{
    "case_title": "Sharom bin Ahmad and Another v Public Prosecutor",
    "ncitation": "[2000] SGCA 36",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "The prosecution`s case": "On 20 March 1999, a surveillance exercise was conducted by the officers from the Central Narcotics Bureau (`CNB`) at the Costa Sands Chalets at Pasir Ris. The CNB officers were keeping watch on the first appellant, Sharom bin Ahmad (`Sharom`), who is also known as `Boy Dol` or `Boy`. The CNB officers believed that Sharom was using a 125cc chopper motorcycle with the licence plate FQ9032M. At around 4.10pm, Sharom and his girlfriend, Norsila bte Mohd (`Norsila`) were seen leaving the chalets on the said motorcycle. Sharom was wearing a black jacket with white pants while Norsila was described as wearing a blue t-shirt with black pants. The couple were followed by the CNB officers who trailed them as they first went to Tampines Street 34, then to Century Square Shopping Centre at Tampines Central 1. After leaving Century Square, the couple went to Blk 86 Bedok North Street 4 before they finally proceeded to Blk 420 Ang Mo Kio Avenue 10 and parked the motorcycle FQ9032M in the car park at around 7.15pm. The CNB officers observed the couple leaving the motorcycle, carrying plastic shopping bags and walking towards Blk 420 Ang Mo Kio Avenue 10. They were seen taking the lift in Blk 420 up to the 11th floor. At about 8.25pm, the couple were spotted coming down from the 12th floor staircase to the 11th floor  lift landing and going inside the lift. Soon after, they were seen approaching the motorcycle FQ9032M at the car park and were about to leave when the CNB officers moved in to arrest them.Upon being confronted by the CNB officers, Sharom refused to stay still and tried to move away before the officers handcuffed him. It was observed that Sharom was nervous and shivering and he had since changed his clothing. Sharom was questioned about where they had come from, whereupon he lied and said that he and Norsila just came from the coffee shop in the next block. When asked where did he change his clothes, Sharom again lied and said that he did it at the fifth floor of the next block. A body search was conducted on Sharom and a `Marlboro` cigarette box containing one sachet of powdery substance was found tucked at his waistband. The substance was later analysed and found to contain diamorphine. A key chain with a fur ball and holding four keys was also recovered from Sharom. He was asked whether the keys belonged to him and he admitted that they did. Sharom was then asked where his identity card (`NRIC`) was and his reply was that it was in his wallet. When his wallet was searched, a NRIC belonging to one Amran Bin Adahar, NRIC No. 1674423/I, was found. He was asked whether this was his NRIC and he nodded and replied `yes`. He also responded when he was called `Amran` by the CNB officers. Sharom only admitted later that the NRIC did not belong to him and Amran Bin Adahar was actually his brother-in-law.Thereafter, the CNB officers took Sharom and Norsila up to the 12th floor of Blk 420 Ang Mo Kio Avenue 10. The bunch of keys seized from Sharom was then tried from house to house to locate which unit the keys belonged to. Sharom was questioned as to which unit on the 12th floor he had come from and which unit the keys belonged to. Sharom replied that he did not stay on the 12th floor and the keys were not for that block. This was, however, soon proven untrue and the seized keys were used to access unit [num ]12-1131 of Blk 420 Ang Mo Kio (the `Ang Mo Kio flat`). It was later established that the Ang Mo Kio flat belonged to the second appellant, Boksenang bin Bochek, who had rented the unit from the Housing and Development Board. The CNB officers then conducted a search of the one-room flat in the presence of Sharom and Norsila.A number of items were found and seized in the premises. A green and black haversack was recovered in the corner of the bedroom area, next to the wardrobe. Ten packets of granular substance were found in the main compartment of the haversack and two sachets of substance were found in the front compartment. All these substances were later analysed to contain diamorphine. Cash amounting to $1112 was also recovered from the haversack. When the haversack and its contents were placed before Sharom, he appeared distressed and he knelt down with his head on the floor and seemed to be crying. Sharom was asked about the haversack and its contents.Q: What is this, ten packets?A: It is heroin.Q: Whose is this?A: I do not know. I do not know how this is here.Q: Is the bag yours?A: The bag is mine.Q: Are the two sachets yours?A: No, they are not.A white plastic bag was also recovered from under the sink in the kitchen of the Ang Mo Kio flat. The white plastic bag contained in it 21 empty sachets, a TANITA digital weighing scale and a sachet of granular substance inside a `Marlboro` cigarette box. The sachet of granular substance was later analysed and found to contain diamorphine. Sharom was asked whether the items in the white plastic bag belonged to him and he admitted that they were all his. The CNB officers further found clothes similar to what Sharom and Norsila were wearing earlier soaking in a pail in the toilet and a motorcycle cover belonging to Sharom lying on the floor in the hall area. Sharom was questioned on who the owner of the Ang Mo Kio flat was and how many people were staying in it. Sharom`s reply was that the house belonged to `Bob` and that `Bob` stayed in the flat with his wife.Subsequently, Sharom and Norsila were brought by the CNB officers to two other places which were also searched. The first was Blk 80 Bedok North Road [num ]02-268, which was the address shown in Sharom`s NRIC, and the second was Blk 195 Kim Keat Avenue [num ]04-324, which Sharom claimed he had rented and was staying at with Norsila. The search in these two premises did not recover any incriminating evidence. At around the same time, other CNB officers also raided chalets B9 and B10 of the Costa Sands Chalets, with the intention of arresting the second appellant, Boksenang bin Bochek (`Boksenang`). However, he was not arrested on that day.Boksenang, who is also known as `Bob senang` or `Bob`, evaded arrest until 28 July 1999. On that day, at around 5pm, he was spotted near a Baby and Child Medical Clinic at Blk 828 Tampines Street 81 and was subsequently arrested there. A body search of Boksenang was conducted and nothing incriminating was found on him.",
        "Scientific analysis of the substance seized": "The various sachets and packets of substance seized on 20 March 1999 from Sharom and the Ang Mo Kio flat were sent for analysis by the Department of Scientific Services. The analyses revealed the following results:(i) The one sachet of substance found on Sharom himself had a gross weight of 4.96g and contained 0.34g of diamorphine.(ii) The one sachet of substance found in the white plastic bag in the kitchen of the Ang Mo Kio flat had a gross weight of 2.36g and contained 0.15g of diamorphine.(iii) The ten packets of granular substance found in the haversack was of a gross weight of 4,605g and contained not less than 59.94g of diamorphine.(iv) The two sachets of granular substance found in the haversack was of a gross weight of 23.12g and contained 0.23g of diamorphine.",
        "Sharom`s defence": "A cautioned statement and four long statements were made by Sharom in the course of the investigations. He did not challenge the admissibility of any of the  statements. In his statements, Sharom affirmed that the haversack belonged to him. However, he adamantly maintained throughout that the ten packets and two sachets of drugs found in the haversack were not his but belonged instead to Boksenang, who was also the owner of the Ang Mo Kio flat in which the haversack had been found. According to Sharom, Boksenang had borrowed the haversack from him on the Sunday before his arrest, ie on 14 March 1999, and Boksenang must have used it to contain the drugs. Sharom claimed that he had no knowledge of the drugs being placed in the haversack and neither was he aware that the haversack was in the Ang Mo Kio flat.He sought to dissociate himself from the Ang Mo Kio flat and asserted that he was staying with Norsila at a rented room in Blk 195 Kim Keat Ave since January 1999 till the time of his arrest. Prior to his arrest on 20 March 1999, he had been to the Ang Mo Kio flat only on three occasions, the first being on 14 March 1999 (Sunday), second time on 18 March (Thursday) and the last time on 19 March (Friday). On the morning of 14 March 1999, Boksenang had invited him and Norsila to the Ang Mo Kio flat. They went to the flat and met Boksenang, his wife - Lisfah, Lisfah`s sister - Hamidah, a Mohamed Hussain and his girlfriend there. He was at the flat with Norsila until around 4 to 5pm and as they were about to leave, Boksenang asked to borrow Sharom`s haversack which he was carrying at that time. Sharom lent the haversack to Boksenang after removing his and Norsila`s personal belongings from it. In his oral evidence, Sharom claimed that the next occasion he was at the Ang Mo Kio flat was on 18 March 1999 (Thursday). Although this was inconsistent with his earlier account in one of his long statements where he had said that he stayed at the Ang Mo Kio flat `from Monday till Friday morning`, he claimed in his oral testimony that the earlier statement was a mistake as he was confused at the time he was making it. According to him, he and Norsila had gone to the flat on Thursday upon Boksenang`s invitation and had spent the night there with Boksenang, Lisfah and Hamidah. When Sharom was at the Ang Mo Kio flat on Thursday night, he was invited by Boksenang to go to Blk 520 Jelapang Road [num ]03-289 (`the Jelapang flat`) on Friday morning as Boksenang had arranged to meet a friend there. Boksenang had been renting a room in the Jelapang flat since December 1998. He decided to go along as he wanted to replenish his stock of heroin from Mohamed Hussain (`Hussain`), who was also renting a room in the Jelapang flat.On Friday morning, 19 March 1999, Sharom left the Ang Mo Kio flat on his motorcycle for the Jelapang flat, while Boksenang and Lisfah made their way there in a taxi. Norsila and Hamidah stayed behind in the Ang Mo Kio flat. After he arrived at the Jelapang flat he went into Boksenang`s room and slept there. He was awakened later by Boksenang who said that his friend, Bai (also known as `Bujang` or `Bob`), had arrived. He was still in the room when Bai came in, carrying a red shopping bag. Boksenang then told him to leave the room and so he went to Hussain`s room where he smoked heroin with Hussain. After about 10 to 15 minutes, he returned to Boksenang`s room and saw the red shopping bag on the floor of the room. He observed that the shopping bag contained packets of heroin and he took out three packets to examine them. In his defence, Sharom stated his belief that the heroin in the haversack belonged to Boksenang as the packets of heroin in the haversack looked very much like the ones he had examined in  Boksenang`s room in the Jelapang flat. After handling the packets of heroin, he placed them back into the red shopping bag and thereafter returned to Hussain`s room to smoke more heroin. Bai and Boksenang remained in the room and were smoking heroin as well. He stayed at the Jelapang flat until about 6.00pm before leaving and returning to the Ang Mo Kio flat.After arriving at the Ang Mo Kio flat, Sharom stayed only for a short while, after which he left with Norsila to go to Norsila`s mother`s house at Teban Gardens. They left Teban Gardens at around 10.15pm that Friday night and made their way to Costa Sands Chalets where Boksenang and Lisfah were celebrating their birthdays. Boksenang had booked a few chalets for the occasion and had invited relatives and friends to join in the celebrations. He and Norsila spent the night at the chalets. The next day, on 20 March 1999, he told Boksenang that he wanted to go to the Ang Mo Kio flat to retrieve a sachet of heroin he had kept in the kitchen. He had obtained this sachet from Hussain at the Jelapang flat on the previous day. Boksenang then handed to him the bunch of keys for the Ang Mo Kio flat and this was the first time Boksenang was lending the keys to him. At that time, Norsila was also present when the keys were being borrowed. After taking the keys, he left the chalets with Norsila on his motorcycle and they first went to his sister`s place at Tampines before going to Tampines Mall where the two of them bought some clothes for themselves. After their shopping, they went to Bedok North where he had his haircut and subsequently they proceeded to the Ang Mo Kio flat. At the Ang Mo Kio flat, he retrieved the sachet of heroin he had kept in the kitchen and smoked some of it with Norsila. He then split the remaining heroin into two sachets, placing them in two separate `Marlboro` cigarette boxes. He put one of the cigarette boxes into the white plastic bag which he then placed under the sink in the kitchen while he kept the other box with him. In the meantime, Norsila tidied up the kitchen and cooked some food. She then took a shower and they both changed into the new clothes they had just bought, soaking their old clothing in a pail in the toilet. Soon after, they received a call from Boksenang asking them when they were returning to the chalets. They then left the Ang Mo Kio flat to return to the chalets, locking up the flat with the keys that Boksenang had lent to him. They were about to leave the car park when they were arrested by the CNB officers.",
        "Evidence against Boksenang": "In establishing its case against Boksenang, the prosecution relied essentially on the confession made by him in one of the long statements recorded from him (`P47`). Boksenang had made a cautioned statement and three long statements to the CNB officers and he agreed that the three earlier statements were made voluntarily. However, he challenged the admissibility of the last long statement he made on 11 August 1999 (ie P47) on the ground that it had been procured as a result of inducement, threat and promise. Boksenang alleged that the investigating officer, Insp A Muruganandam (`Insp Muru`), had threatened to arrest his wife and to detain him indefinitely unless he made a proper statement. Insp Muru later induced him by saying that he would allow him the special privilege of seeing his wife and the inspector further promised that he would try to get the charge reduced to a non-capital charge. As a result of Boksenang`s allegations, a voir dire was  conducted to determine the admissibility of P47. At the end of the voir dire, the trial judge made the finding that there was no inducement, threat or promise and that the statement was made voluntarily. Consequently, P47 was admitted as evidence. It is useful to reproduce here the relevant parts of P47 that were relied on by the prosecution. In P47, Boksenang said:12 I am now referred to a photograph in a album showing a green bag and I am also shown a green bag physically. (Recorder`s Note: Accused was shown album showing a green haversack marked as A and also the same green haversack bag seized from accused Sharom Bin Ahmad on 20 March 1999 at Blk 420 Ang Mo Kio Ave 10). I can identify the bag as that which I have seen Boy Dol carrying with him all the time that I have met him. The bag does not belong to me and I have never taken custody of the bag from Boy Dol at any time. I am very sure that the bag belongs to Boy Dol and I am aware that there were money in the side pocket of the bag when Boy Dol came to see me at Blk 520 Jelapang Road on the Friday before my birthday. I know that there was more than $1,000 in the bag and if that is my money why haven`t I removed it and kept it with me.13 Boy Dol visited me at Blk 520 Jelapang Road in my rented room on this day. Boy Dol visited me in the morning at about 9 to 10 am and I was in the room with my wife and I was waiting for the arrival of Boy Dol as he have called me before coming. After Boy Dol arrived I asked my wife to leave the room and wait in the hall. When Boy Dol came to my room he was carrying the same green bag which was shown to me. He had the bag over his shoulders and I also saw him carrying a chrome helmet. After the arrival of Boy Dol in about 20 minutes Bob arrived and he brought with him a fruit carton into my room. Bob had brought inside the fruit carton about 25 packets of heroin. Each packet of heroin weighs about 1 pound or about 450 grams. I know about the weight because I had a digital weighing scale in my room all the time.14 I received all the 25 packets from Bob for $2,400 per packet and I paid the cash amount of about $60,000 for all the 25 packets of heroin. Out of the 25 packets of heroin I gave 10 packets of heroin to Boy Dol which I sold at $3,500 per packet. I saw Boy Dol taking the ten packets of heroin from the fruit carton and placing it into the green bag. When Boy Dol gave the money for the ten packets of heroin I saw him take the money from the side pocket of the green bag. I saw him counting the money in front of me when he paid me. After that I notice that he had a balance of about $1,000 or more and placing this money in the green bag. I also saw Boy Dol take the ten packets of heroin straight from the carton and placing them one by one inside the green bag. All the packets of heroin came in a plastic packet wrapping.15 At the time when I was in the room with Boy Dol and Bob my friend Saddam Hussain who is staying in the next room also came over and I sold him two packets of heroin from the same consignment. I sold the two packets of heroin for $3,500 each packet. Saddam Hussain paid me only $5,000 and he owed the balance of $2,000 to me. After the transaction with Saddam Hussain he left the room. Left in the room were Boy Dol, Bob and myself only. The three of us then smoked some heroin in the room using Chasing the Dragon method. We took some heroin from the packets of heroin which Bob brought in the fruit carton to smoke. After this Boy Dol left with the green bag filled with ten packets of heroin which he had taken from the fruit carton. Boy Dol is aware that I am getting the heroin from Bob but he cannot negotiate directly with Bob as I am the one who would deal with Bob.16 When Boy Dol was leaving my room the ten packets of heroin I warned him not to place the heroin in my flat at Blk 420 Ang Mo Kio Ave 10 [num ]12-1131. I advised him  to place it in Surrey Mansion which is near Newton. I know that Boy Dol has an apartment at Surrey Mansion. When I told Boy Dol not to put the heroin packets which he had carried in the green bag in my flat at Blk 420 Ang Mo Kio he agreed.17 Bob left my room subsequently after taking all the money and I later cleared the fruit carton and there were about 13 packets of heroin left in my room. I hid the 13 packets of heroin under the cupboard of my room. The heroin packets were placed under the drawers of the cupboard and were actually hidden. It can only be seen if we remove the drawers. My wife Lisfah is not aware of the heroin which I had kept under the drawers and she is not aware of my drug trafficking activities. ...Boksenang`s defenceBoksenang admitted that he had been avoiding arrest by the CNB since 20 March 1999 but he denied that the packets of drugs found in the haversack in the Ang Mo Kio flat belonged to him. He identified the haversack as belonging to Sharom and maintained that he never borrowed or took custody of the bag from Sharom at any time. He claimed that he was not at the Ang Mo Kio flat during the period of 14 to 19 March 1999 and he did not meet Sharom on 14 March (Sunday), much less borrow the latter`s haversack on that day. Like Sharom, Boksenang also sought to distance himself from the Ang Mo Kio flat. He claimed that he rented and stayed at a room in the Jelapang flat with his wife, Lisfah. Whilst he also rented the Ang Mo Kio flat from the HDB and had furnished it substantially after receiving the keys on 1 February 1999, he did not move into the flat as he had resumed his heroin addiction and was afraid that the CNB would trace him to his rented flat. Instead, he allowed Sharom to stay in the Ang Mo Kio flat since February 1999 as the latter had requested for a place to stay with his girlfriend, Norsila. Sharom needed a place to stay as he believed his other accommodation at Blk 195 Kim Keat Avenue [num ]04-324 was suspected by the CNB as being the place where he was selling heroin. Thus, a set of keys to the Ang Mo Kio flat was given to Sharom by Boksenang. Boksenang claimed that he and his wife never stayed at the Ang Mo Kio flat except for once after he gave the keys to Sharom and it was Sharom who occupied the flat with Norsila until Sharom was arrested on 20 March 1999.Boksenang admitted that he met Sharom on 19 March 1999 (Friday) when Sharom went to the Jelapang flat in the morning. He claimed that Sharom was carrying a haversack when he arrived at the flat. During that occasion, Bai also went to the Jelapang flat as Boksenang had arranged to meet him there. Bai had brought with him a fruit carton containing packets of heroin which he took into Boksenang`s room in the Jelapang flat. Soon after, Hussain came and joined Bai, Sharom and him in the room as well. All three of them bought heroin from Bai, although Boksenang claimed that he only bought one sachet of heroin that was meant for his own consumption. On the other hand, Sharom bought ten packets of heroin from Bai and Boksenang saw him place the ten packets in his haversack. Hussain bought two packets and returned to his own room after that. The remaining three of them stayed in Boksenang`s room and smoked heroin together. After a while, Sharom left the room to go to Hussain`s room and he stayed there until he left the flat in the afternoon. When Sharom was leaving the flat he took his haversack with him and Boksenang told him not to place the haversack at the Ang Mo Kio flat and Sharom agreed not to do so. In the course of his oral  examination during the trial, Boksenang maintained his position that the incriminating evidence in P47 had been given involuntarily. He insisted that he did not buy 25 packets of heroin from Bai and neither did he sell any heroin to Sharom or Hussain.As for the events on the morning of 20 March 1999, Boksenang denied that he had instructed Sharom to go to the Ang Mo Kio flat, as was alleged by Norsila in her evidence. He claimed that Sharom had merely told him that he was going to the Ang Mo Kio flat with Norsila. He chose not to join them and stayed at the Costa Sands chalets, fleeing with Lisfah when the CNB officers raided the place. He then stayed with Lisfah at the Jelapang flat before going into hiding from the CNB officers.",
        "The decision below": "The trial judge did not believe Sharom`s assertion that he was at the Ang Mo Kio flat only on three occasions and that he did not stay there at all. The trial judge also did not accept Sharom`s claim that Boksenang had borrowed his haversack. He noted that there were many shortcomings and inconsistencies in Sharom`s claims that substantially weakened his defence. He found that there was uncontroverted evidence that the ten packets of drugs were in Sharom`s haversack, which was found in the Ang Mo Kio flat and he was in possession of the keys to the said flat. Further, it was found that Sharom had bought the ten packets of drugs from Boksenang at the Jelapang flat and the drugs were in his possession when they were recovered from his haversack in the Ang Mo Kio flat. The trial judge held that in any event, Sharom had not rebutted the presumption of possession arising under s 18(1)(c) of the Misuse of Drugs Act (`MDA`) by virtue of the fact that he was found in possession of the keys to the Ang Mo Kio flat. The trial judge also found that Sharom did not rebut the presumption under s 17 of the MDA that the drugs were in his possession for the purposes of trafficking.Turning to Boksenang, the trial judge rejected his claim that he did not stay at the Ang Mo Kio flat as there was sufficient evidence to show otherwise. However, what the trial judge found to be most incriminating was the confession he made in P47. He rejected the allegations of involuntariness raised by Boksenang in relation to the recording of P47 and found that it contained the truth of the events. Based on Boksenang`s own admission, the trial judge found that he had bought 25 packets of heroin from Bai, of which he sold ten packets to Sharom.After reviewing all the evidence adduced before him, although the trial judge was satisfied that there was evidence that Sharom was in possession of drugs for the purposes of trafficking and there was also evidence that Boksenang had sold the drugs to Sharom, he was not convinced that all this led to an irresistible inference of a criminal conspiracy between them as was contemplated by the original joint charge. Consequently, the trial judge substituted the joint charge against the two appellants with two separate charges. He found the appellants to be guilty on the substituted charge they each faced and convicted them, imposing the mandatory death sentence.",
        "The appeal": "Sharom`s appealSeveral grounds of appeal were raised by counsel for Sharom and these can be generally summarised in the following manner:(i) That the trial judge erred in law in substituting fresh charges against both appellants when he found that the joint charge could not be made out; and in proceeding with the substituted charges against both appellants in the same trial when the trial should have been severed.(ii) That the trial judge erred in failing to give any or sufficient weight to the evidence of Sharom and in wrongly assessing the evidence given by Norsila.(iii) That the trial judge erred in using the presumptions under s 17 and s 18(1)(c) of the MDA together to find a case against Sharom.(iv) That the trial judge erred in law in not directing himself to treat Boksenang`s evidence with caution under s 116, illustration (b) of the Evidence Act (Cap 97).(i) Substitution of fresh charges and continuance of joint trial after severance of joint chargeSection 163(1) of the Criminal Procedure Code (Cap 68) (`CPC`) provides that `any court may alter any charge or frame a new charge, whether in substitution for or in addition to an existing charge at any time before judgment is given`. Whilst it is true that in the present case the substitution of the fresh charges were made at a rather late stage in the trial, after the defence had already presented its case and both sides had delivered their closing submissions, we would point out that the power conferred by s 163(1), CPC, exists at every stage of the trial, so long as judgment has not been given yet. Hence, the trial judge was clearly empowered to substitute the original joint charge with new separate charges if he was of the view that the evidence did not support the original charge but may found others. The trial judge`s decision to substitute fresh charges against the two appellants was therefore not wrong in law.Counsel for Sharom then sought to contend that the learned judge should have severed the hearing of the trial after substituting the two separate charges instead of continuing with the joint trial and the failure to do so thereby prejudiced Sharom. Under s 176 of the CPC, it is contemplated that two or more accused persons may be tried jointly for charges of different offences that were committed in the same transaction. The term `same transaction` was interpreted inTse Po Chung Nathan v PP[1993] 1 SLR 961, which decision was later followed and applied inLee Teck Wah & Anor v PP[1998] 2 SLR 827. It was held by the Court of Criminal Appeal in the earlier case that, the phrase `same transaction` meant that there was proximity of time, continuity of action, unity of place and unity of purpose or design in the commission of the different offences. The last element of `unity of purpose or design` has been regarded as the most important, whilst the remaining elements are not so crucial in establishing whether the offences were committed in the `same transaction`.Here, the prosecution`s case was that, on 19 March 1999, Boksenang bought 25 packets of heroin from `Bai`, whereupon he immediately sold ten packets to Sharom. It was through this sale that Sharom was put in possession of the ten packets of heroin which he kept in his haversack and placed in the Ang Mo Kio flat. Considering the factual scenario put forward by the prosecution, it is clear that the two separate offences, Boksenang selling the drugs to Sharom and the latter being put in possession of the drugs for the purposes of trafficking, were committed in the same transaction. In any case, we failed to see how the joint trial of the two substituted charges caused any prejudice to Sharom at all. It was clear that the substitution of the original charge was made by the trial judge after he assessed the existing evidence that had been presented by both sides and was not based on the introduction of any new facts or evidence. Furthermore, the trial judge had clearly taken the necessary precautionary safeguards when he made the substitution. He ensured that the new charges were read and explained to the two appellants and that they were given a fresh opportunity to tender a plea on the amended charges. All the parties were given the opportunity to recall any witnesses for further examination and call new witnesses as well as to make submissions on the new charges. It was pertinent to note that the trial judge also took care to ensure that defence counsel were not taken by surprise and were prepared to submit on the new charges when he offered to grant them more time to prepare any further submissions which they might wish to make. Indeed, the trial judge even went as far as to inquire if any party wished to make a plea on whether there was any difficulty with the substituted charges on a legal basis. No objections were raised at all. It was relevant to note that Mr SS Dhillon, who was also counsel for Sharom in the trial below, did not challenge the legality or propriety of the substitution of the charges and also declined the trial judge`s offer for more time as he was of the view that his earlier submissions already addressed the substituted charges adequately. In all the circumstances, we were of the view that this ground of appeal was unsustainable and must be rejected.(ii) Evaluation of Sharom`s and Norsila`s evidenceNext, it was contended by counsel for Sharom that the trial judge had wrongly evaluated the evidence given by Sharom and Norsila. First, it was argued that the trial judge had overlooked the fact that the Ang Mo Kio flat was rented by Boksenang from HDB and Sharom was not the owner of the flat but had merely borrowed the keys from Boksenang and this fact was corroborated by Norsila`s evidence. It was contended that since Sharom was not the owner of the flat, the drugs found therein could not be considered to be in his possession.In our opinion, the above argument was misconceived. To prove possession of drugs found in a flat, it is certainly not necessary for the prosecution to prove that the person in possession of the drugs is also the owner of the flat, and conversely, proof that a person is not the owner of the unit in which the drugs were found does not necessarily mean that the person could not have been in possession of the drugs. In any event, even if the prosecution was relying on the presumption of possession raised by s 18(1)(c) of the MDA, which we will discuss later, the argument by counsel for Sharom was still without merit. The presumption under s 18(1)(c) is not dependent upon ownership of the premises in which the drug was found, but will be raised once the accused is proved to have had in his possession  or custody or under his control the keys of the place or premises in which the drug was found. In the present case, the presumption could be raised since the keys to the Ang Mo Kio flat were found in Sharom`s possession during a body search conducted immediately after he was arrested and Sharom himself had admitted that the keys belonged to him when he was questioned about it.It was not disputed that Sharom was not the owner of the Ang Mo Kio flat. However, this did not preclude him from having used the place. From the evidence, it would seem to us that Sharom was indeed at the premises frequently, at least during the week prior to his arrest. Although he may not necessarily have stayed at the Ang Mo Kio flat for the length of period as alleged by Boksenang, Sharom was certainly not the mere occasional invitee at the flat that he sought to make himself out to be. His assertion that he did not stay in the flat but only visited it on the three occasions when he was invited by Boksenang was clearly not made out on the facts. Sharom had attempted to minimise his association with the Ang Mo Kio flat by saying in his oral testimony that he only stayed in the flat for one night and that was on 18 March 1999 (Thursday). This assertion was, however, completely contradictory to the long statement he made earlier on 5 April 1999 at 3.10pm (`D4`), where he stated that he had stayed at the Ang Mo Kio flat from 15 March (Monday) until the morning of 19 March (Friday). His explanation for the apparent discrepancy was that his earlier statement was a mistake as he was confused during the recording of the long statement. In this regard, we were in agreement with the trial judge`s view that this was an incredible explanation and that while it may be believable that a person who has only spent a night at a place may not recall the exact date of the stay, it was implausible that he would be mistaken as to how many days he stayed, especially by a difference of three days. We found the oral assertion to be untrue and merely a weak attempt by Sharom to bolster his defence. Furthermore, the fact that Sharom`s personal belongings like his clothing, his motorcycle cover, his drug trafficking paraphernalia such as the weighing scale and empty plastic sachets, were all found in the Ang Mo Kio flat was a strong indication that he was at the premises more often than the three occasions that he claimed. His own admission that the keys to the Ang Mo Kio flat were his when these were found on him was also contrary to the kind of reply that one would expect from someone who was borrowing the keys for the very first time.The next argument advanced by counsel for Sharom was that the trial judge erred in disbelieving his defence that the drugs in the haversack belonged to Boksenang. Sharom claimed that the haversack was borrowed by Boksenang on 14 March 1999 (Sunday) and he did not see the haversack again until after his arrest. It was contended that this claim was corroborated by Norsila`s oral testimony in the trial. First, we noted that this crucial fact about Boksenang borrowing the haversack from him was never alluded to by Sharom in his cautioned statement, even though he had remembered to claim that the drugs in the haversack must have belonged to Boksenang. Instead, he stated in the cautioned statement that he had placed the haversack in the Ang Mo Kio flat on the Friday before his arrest (ie 19 March 1999). This appeared to run counter to his defence that he did not see or handle the haversack after he lent it to Boksenang on 14 March (Sunday). Although Sharom tried to insist during his cross-  examination that he had said `Sunday` and not `Friday`, this was refuted by the interpreter involved in the recording of the statement, who testified that Sharom had specifically used the word `Friday` and the statement had been verified by him before he signed it. We found no reason to disagree with the trial judge`s decision to accept the interpreter`s testimony.Secondly, we found it hard to believe why Boksenang would need to borrow the haversack from Sharom and why he would lend it to the former. According to Sharom, this was a haversack he had used since 1996 and he often used it to carry his own belongings as well as Norsila`s. He also claimed that he had never lent this haversack to anyone before this occasion. Yet, Sharom sought to maintain that he simply allowed Boksenang to borrow it without even asking why he needed it and when it would be returned. Furthermore, as was pointed out by the trial judge, the haversack in question was only an ordinary haversack which could easily be purchased and was not expensive. There was no credible reason why Boksenang should need to borrow a bag that was so personal to Sharom to contain packets of drugs which could easily have been kept or carried by other means.As regards to the corroboration supposedly provided by Norsila`s evidence, we agreed with the trial judge`s doubts over the veracity of her evidence on this aspect due to the evident contradiction in her testimony. In the earlier statement Norsila made to the CNB officers, she had stated that on 14 March 1999 (Sunday), when they were at the Ang Mo Kio flat, Sharom told her to remove her belongings from his haversack without telling her the reason for doing so and she did not bother to ask him why. She further noted that the haversack was left behind in the flat when they left on that day. No mention was made in her statement that Boksenang had borrowed the haversack. Subsequently, during her cross-examination, Norsila then said that Sharom had told her that the haversack was left at the Ang Mo Kio flat because Boksenang wanted to borrow it. This was obviously inconsistent with her earlier statement. Curiously, when Norsila was referred to her earlier statement during the later course of her cross-examination, she again contradicted herself by affirming the earlier investigation statement and said that she did not know why she was asked to remove her belongings from the haversack and why it was left in the Ang Mo Kio flat. The confusion was obviously due to Norsila`s futile attempts to tailor her evidence in order to support that given by Sharom, who was her boyfriend.After assessing the factual circumstances and the evidence presented before the court, we were of the view that the weight of the evidence was clearly against Sharom. He was in possession of the keys to the Ang Mo Kio flat, his personal belongings were found there and even his own statements showed that he was staying at the flat, at least in the week before his arrest. Sharom was also unable to prove that his haversack had been borrowed by Boksenang to contain the drugs. Another pertinent point was that we found Sharom`s behaviour during and after his arrest to be highly reflective of his guilt. When he was first arrested, he was distraught and nervous and he told a series of lies on where he had come from, which unit the seized keys belonged to and even his own identity. Counsel for Sharom argued that the lies told by him should not be treated as evidence of his guilt and the trial judge wrongly applied the law in doing so. InPP v Yeo Choon Poh[1994] 2 SLR 867, the Court of Appeal followed the holding in the English  case ofR v Lucas (Ruth)[1981]  QB 720that, although the mere fact that an accused told lies should not amount to evidence of his guilt, there were certain circumstances in which lies by an accused could have corroborative value because it indicated a consciousness of guilt. The four criteria that must be satisfied before a lie can amount to corroboration was laid down by Lord Lane CJ in the English case at p 724 as follows:The lie ... must first of all be deliberate. Secondly, it must relate to a material issue. Thirdly, the motive for the lie must be a realisation of guilt and a fear of the truth. ... Fourthly, the statement must be clearly shown to be a lie by [independent] evidence.There was no doubt in our minds that the above four criteria had been satisfied and the lies told by Sharom were plainly deliberate attempts on his part to distance himself from the Ang Mo Kio flat and the drugs which he knew were placed in it. Sharom`s reaction when the haversack and its contents were found and placed before him in the Ang Mo Kio flat was another significant fact. The CNB officers testified that his response upon seeing the discovery of the haversack was to kneel down with his head touching the ground. In the words of Inspector Omer Ali Saifudeen, who was in charge of the search of the Ang Mo Kio flat, he saw that Sharom`s face `looked contorted and he appeared like he was almost crying`. Such a reaction seemed to us to be inconsistent with someone who did not own the drugs and who did not know how and why the drugs got there.At this juncture, we would add that the possession of drug trafficking paraphernalia, whose utility is obviously for the preparation of drugs for sale, is also relevant as circumstantial evidence of drug trafficking activities by an accused: seeChan Hock Wai v PP[1995] 1 SLR 728, recently applied inSu Chee Kiong v PP[1999] 1 SLR 782. In the present case, the drug trafficking paraphernalia such as the TANITA digital weighing scale and empty plastic sachets found in the Ang Mo Kio flat were admitted by Sharom to belong to him. This important circumstantial evidence supported the others to show that Sharom was in possession of the packets of drugs in the haversack for the purposes of trafficking them.(iii) Use of the presumptions in s 17 and s 18(1)(c) of the Misuse of Drugs ActSection 17 of the MDA provides that `any person who is proved to have had in his possession more than ... (c) 2g of diamorphine ... shall be presumed to have had that drug in possession for the purpose of trafficking` unless it is proved otherwise. Section 18(1)(c) provides for the rebuttable presumption of possession of drugs which arises from proof of possession of the keys to any place in which a controlled drug is found. These two presumptions cannot, however, be used at the same time as the presumption in s 17 can apply only if the possession of the controlled drug is proved and not merely presumed, as would be the case if s 18(1)(c) was invoked: seeLow Kok Wai v PP[1994] 1 SLR 676;Abdul Aziz bin Ahtam v PP[1997] 2 SLR 96;Aziz bin Abdul Kadir v PP[1999] 3 SLR 175andChia Song Heng v PP[1999] 4 SLR 705. Consequently, if in the instant case, the prosecution sought to invoke the presumption in s 17 to prove the mens rea of possession for the purpose of trafficking, they would then be prevented from relying on the presumption of possession found in s 18(1)(c). This reasoning applies as well to the other presumptions of possession found in ss 18 to 21 of the  MDA. Such being the case, we accepted the contention that the trial judge`s statement in his grounds of decision, that Sharom had failed to rebut both the presumptions in s 17 and s 18(1)(c) of the MDA, was highly misleading and erroneous.However, this did not mean that the conviction of Sharom was wrongly founded. The prosecution did not need to rely on double presumptions to establish its case against Sharom since his possession of the drugs was clearly proven beyond a reasonable doubt on the facts. As discussed earlier, his close connection with the Ang Mo Kio flat, his failure to prove that his haversack was borrowed by Boksenang and other circumstantial evidence such as the lies he told and his guilty behaviour during the discovery of the haversack in the Ang Mo Kio flat all went towards proving that Sharom was in possession of the drugs in the haversack. There was thus no need for the prosecution to utilise the presumption of possession found in s 18(1)(c) and only s 17 was required to be relied upon. On the facts, we were not satisfied that the presumption in s 17 had been rebutted by Sharom. The drugs that were recovered from the haversack had a gross weight of more than 4.6kg, with a total drug content of not less than 60.17g of diamorphine. The large amount of drugs, beyond what was reasonably required for personal consumption, coupled with the existence of drug trafficking paraphernalia in the same premises, raised the irresistible inference that those drugs were in Sharom`s possession for the purposes of trafficking. In the result, we were of the view that this ground of appeal should be rejected as well.(iv) Evidence of an accomplice or a person with an interest to serveAnother ground of appeal advanced by counsel for Sharom was that the trial judge erred in failing to treat Boksenang`s evidence against Sharom with caution as provided by s 116, illustration (b) of the Evidence Act (`EA`)(Cap 97). The provision states as follows:The court may presume the existence of any fact which it thinks likely to have happened, regard being had to the common course of natural events, human conduct, and public and private business, in their relation to the facts of the particular case.Illustrations(b) that an accomplice is unworthy of credit and his evidence needs to be treated with caution.The law on the treatment of evidence given by an accomplice is well-settled and has been extensively examined by our local courts: seeKwang Boon Keong Peter v PP[1998] 2 SLR 592,Chua Poh Kiat Anthony v PP[1998] 2 SLR 713andTan Hung Yeoh v PP[1999] 3 SLR 93. The common law rule that a court must warn itself of the danger of convicting on uncorroborated evidence of an accomplice has since been abrogated by s 135 of the EA which reads:An accomplice shall be a competent witness against an accused person; and any rule of law or practice whereby at a trial it is obligatory for the court to warm itself about convicting the accused on the uncorroborated testimony of an accomplice is hereby abrogated.As s 116, illustration (b), of the EA is couched in directory and not mandatory terms, the effect of reading this section together with s 135 is that the court may convict an accused person based on accomplice evidence that is uncorroborated, at the same time bearing in mind that the evidence should still be treated with caution as the accomplice may, and not must, be presumed to be unworthy of credit. InChua Poh Kiat Anthony v PP[1998] 2 SLR 713at 719, it was held, with regard to evidence of accomplices, that:All that the court is required to do is scrutinise such evidence carefully. However, accomplice evidence should be given the same weight as any other evidence so long as it is shown that the evidence is reliable from all the circumstances of the case.The above principles would similarly apply to a witness who is not an accomplice but one who has an interest to serve. InChua Keem Long v PP[1996] 1 SLR 510, the High Court recognised that the person with an interest to serve was in many ways akin to an accomplice and the court drew guidance from the law on accomplice evidence as to how it should treat the evidence of such persons. It was held at p 518 that:In light of the removal of the corroboration warning for accomplice evidence, it is not necessary either for the judge to administer himself a similar warning as regards the evidence of a person with an interest to serve, in contrast to the present position as to the evidence of victims of sexual offences and children.It is open for the judge to so treat the evidence of an interested person with caution, but this is not a general rule. Whether caution is in fact required is very much dependent on the facts of the case.On a legal basis, there was simply no merit in the argument that the trial judge must direct himself to treat Boksenang`s evidence with caution since there was no longer such a requirement under our law. On a factual basis, the argument must also fail since a careful examination of the trial judge`s reasons for convicting Sharom would reveal that he did not rely on the evidence of Boksenang to establish Sharom`s guilt. Rather, Sharom`s conviction was founded on other independent evidence and the numerous discrepancies and shortcomings in his own evidence which eventually rendered his defence incredible and unbelievable.",
        "Boksenang`s appeal": "Only one ground of appeal was raised by counsel for Boksenang and it was contended that the trial judge erred in law and in fact in finding that the long statement made by Boksenang on 11 August 1999 (P47) was a voluntary statement and was admissible as evidence. In challenging the admissibility of P47, it was alleged that the statement was procured as a result of inducement, threat and promise being made to Boksenang.First, it was alleged that prior to the recording of P47, the IO Insp Muru had said this to him, `You better make your statement properly so that I will have an easy job. If not, I will arrest your wife because she is the second owner. This is the law`. This was apparently made in the presence of the interpreter, Sofia bte Sufri, who then confirmed that Insp Muru was correct to say that the second owner of the flat could be involved under the law. Boksenang claimed that he was very worried after hearing the threat as his wife had just given birth to twins three  weeks ago and he was concerned about the care of his children should his wife be arrested as well. He therefore decided to follow what Insp Muru told him to do. Next, Boksenang alleged that during the recording Insp Muru referred to the statements made by Sharom, thereby inducing him to give a statement that was consistent with Sharom`s statements. Insp Muru further induced him by saying, `Do co-operate ... I can empathise with you. I would let you see your wife. This is special for you as long as you co-operate`. Boksenang also claimed that Insp Muru promised to make an application to the Deputy Public Prosecutor to get his capital charge reduced. During his cross-examination in the voir dire, Boksenang made a further allegation that Insp Muru had also threatened to detain him indeterminately when he had tried to tell Insp Muru that certain parts of Sharom`s statements were untrue.All the allegations were denied by Insp Muru. Although he admitted that Boksenang may have said that the wife did not know anything about the heroin, Insp Muru denied that this was made as a result of any threats to arrest the wife. Insp Muru also agreed that after the recording of P47, Boksenang was in fact allowed visits by his wife on 16 and 17 August 1999, but he denied that this was pursuant to any promise he made to Boksenang. The interpreter, Sofia bte Sufri, gave a consistent testimony to that of Insp Muru. She affirmed that no inducement, threat or promise was made at all to Boksenang prior to and during the recording of P47. With regard to the allegation on the reduction of the charge, the interpreter gave evidence that it was Boksenang himself who had requested for Insp Muru to guarantee that the capital charge would be reduced to a non-capital one but Insp Muru had merely replied that Boksenang should bring up this matter with his defence counsel and no promises were made at all.In the present case, as P47 was not made to police officers but to CNB officers, the admissibility of the statement would be governed by s 24 of the Evidence Act (Cap 97) (`EA`) and not the Criminal Procedure Code (Cap 68). There are two stages in the test to determine whether a statement is admissible under s 24 of the EA. Firstly, was the confession made as a consequence of any inducement, threat or promise and secondly, whether in making that confession, the accused did so in circumstances which would have led him to reasonably suppose that he would gain some advantage for himself or avoid some evil of a temporal nature to himself: seeGulam bin Notan Mohd Shariff Jamalddin & Anor v PP[1999] 2 SLR 181,Chai Chien Wei Kelvin v PP[1999] 1 SLR 25,Seow Choon Meng v PP[1994] 2 SLR 853,Tan Boon Tat v PP[1992] 2 SLR 1. The question of whether a statement is voluntary is essentially a question of fact and the test of voluntariness is both objective and subjective. The query of whether there is an inducement, threat or promise is objectively determined while the question of whether such inducement, threat or promise has operated on the mind of the accused must be subjectively answered from the perspective of the particular accused: seeGulam bin Notan Mohd Shariff Jamalddin & Anor v PP[1999] 2 SLR 181,Chai Chien Wei Kelvin v PP[1999] 1 SLR 25,Dato Mokhtar bin Hashim v PP[1983] 2 MLJ 232andMohd Desa bin Hashim v PP[1995] 3 MLJ 350.We now move on to consider firstly, whether objectively speaking, those remarks, allegedly made by Insp Muru, would have amounted to an inducement,  threat or promise that would render the statement involuntary. The remark on arresting Boksenang`s wife, if made at all, could amount to a threat sufficient to vitiate the confession. This was so held inPoh Kay Keong v PP[1996] 1 SLR 209, which was subsequently followed inYeo See How v PP[1997] 2 SLR 390, although in the latter case it was found for a fact that no such remark was made. As for the inducement to see the wife, this by itself was unlikely to be a sufficient inducement that would render the statement involuntary, especially if the accused was facing a capital charge. InYeo See How v PP(supra), the court found that given the nature of the capital charge that the accused was facing, it was incredible that he would have made the statement merely to obtain cigarettes and visits by his family members. The court went on to say that the fact that the requests were later acceded to after the recording of the statement were also not conclusive since they were not made pursuant to any inducement or promise given earlier. This was similarly the case in the present situation. We could not believe and it made no sense that Boksenang`s free will would be so easily weakened by his desire to see his wife that he would rather give a statement that would eventually bring him more harm than any advantage.The promise to procure a reduced charge would also amount to an obvious inducement to give a good statement in exchange for a non-capital charge. InPoh Kay Keong v PP(supra), the court was of the view that if such a promise had indeed been made, it would have been clear enough to vitiate the confession. The same would apply for a threat of indefinite detention, which could certainly induce an accused to confess in order to avoid the punishment of prolonged confinement. On the other hand, we did not think that the same could be said of a mere reference to statements made by a co-accused, an accomplice or even a witness. It was argued by counsel for Boksenang that Insp Muru`s reference to Sharom`s statements during the recording of P47 induced Boksenang to make the statement when he would not have done so otherwise. We were unable to agree with this contention. It was difficult to see how an accused person could perceive gaining any advantage or avoiding any evil by making a self-incriminating statement simply because he was told what his co-accused had said. On the contrary, it would seem proper that the accused should be kept informed of what kind of allegations have been made against him by other accused persons or witnesses so that he may properly defend himself against such allegations. Indeed, references to such other statements would assist the accused in deciding on what he should say to best present his defence and therefore should not be regarded as an inducement rendering the statement involuntary.The next question that followed was the finding of whether those threats or inducements were actually made by Insp Muru before and in the course of the recording of P47. Counsel sought to argue that Boksenang`s utterance that his wife did not know anything about the heroin must have been made as a result of the threat to arrest his wife since this utterance was not recorded in P47. We found this to be an unconvincing argument. An indirect reference to the remark could in fact be found in paragraph 17 of P47 where Boksenang had said that his wife was not aware of his drug trafficking activities at all. There was also a very plausible alternative explanation for this remark on the non-involvement of his wife. Boksenang had mentioned in his statement that his wife was present at the  Jelapang flat on 19 March 1999 when the drug trafficking transaction took place and therefore, it was necessary for him to clarify that she was not a party to the drug trafficking activities and should not be implicated. There was insufficient evidence to show that the utterance by Boksenang must have been made pursuant to a threat to arrest his wife.After reviewing the evidence, the trial judge reached the finding that the alleged statements were never made by Insp Muru to procure the making of P47. He observed that Boksenang was not entirely consistent in his complaints and in the course of the voir dire, he even sought to embellish his allegations, adding that Insp Muru had also threatened him with indefinite detention if he failed to co-operate, even though this serious allegation was never mentioned before and neither was it put to Insp Muru or the interpreter. In the course of his oral testimony in the voir dire, Boksenang also gave somewhat contradictory accounts of how the recording of P47 took place. At first, he claimed that Insp Muru did not tell him what to say and would ask questions which he would then answer. However, he later said that Insp Muru had taught him the contents of nearly the whole statement and that Insp Muru was the one who provided the answers to the questions, which formed the details in the statement. In addition, although Boksenang alleged that he was compelled by Insp Muru to make a statement that was consistent with those made by Sharom, a careful perusal of P47 showed that it was not actually consistent since Sharom`s account of the events that took place on 19 March 1999 (Friday) at the Jelapang flat had significant differences from Boksenang`s version. This did not gel with Boksenang`s claim that he made P47 to satisfy the demands for consistency with and corroboration of Sharom`s statements. Furthermore, Sharom`s statements were all recorded before Boksenang`s first statement was even taken, therefore if Insp Muru had wanted consistency with Sharom`s statements, he could have demanded for it in Boksenang`s earlier statements and not wait until his third long statement. In any case, we noticed that his earlier statements were not contradictory to the events as recorded in P47 as all the statements each dealt with distinct events. Hence, there appeared to be little reason for Insp Muru to be displeased with Boksenang`s earlier statements, as was suggested, such that he had to resort to the use of inducement, threat or promise to procure P47 when none had been necessary in the recording of the earlier statements.In summary, we found that Boksenang`s allegations were self-contradictory and inherently improbable on the facts of the case. The evidence he gave to support his claims were inconsistent and the assertions were not otherwise sustained by objective evidence. On the other hand, Insp Muru`s evidence was clearly substantiated by the testimony of the interpreter, refuting the bare allegations raised by Boksenang. As the trial judge had the benefit of hearing and seeing the witnesses give evidence and was in the position to test their credibility and veracity in the witness box, the appellate court should be slow to disturb the findings that were reached by him. We saw no reason to depart from the findings made by the learned judge and affirmed his decision that the statement in P47 was made voluntarily and was admissible as evidence.",
        "Conclusion": "In the light of the foregoing reasons, we found the separate charges against the two appellants established beyond a reasonable doubt. We therefore upheld the convictions and mandatory death sentences passed by the trial judge and dismissed both the appeals.Outcome:Appeals dismissed.Copyright  Government of Singapore."
    }
}