{
    "case_title": "Xpress Print Pte Ltd v Monocrafts Pte Ltd and Another",
    "ncitation": "[2000] SGCA 37",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "Facts": "The appellants own a plot of land along Kallang Way. On it stands their eight-storey light industrial building named the `Communications Techno Centre`, which was completed in 1996. In one survey report, the building was described as follows:The structures constituting the Xpress Print Pte Ltd building is (sic) an eight storey high tower block situated within an open compound including open car parks, a driveway of trowelled concrete construction and landscape features with a garden area. The building is constructed predominantly on a structural frame of reinforced concrete with brick infill walls finished in sand and cement render.The first respondents own a plot of land adjacent to the appellants` plot. Early in 1997, the first respondents decided to construct an industrial building of their own on their land, and engaged the second respondents, a firm of contractors named L & B Engineering (S) Pte Ltd (`the contractors`), to do this. In February 1997, the contractors erected a temporary retaining wall between the two plots of land to hold up the soil on the appellants` plot. They then began excavating on the first respondents` land to build a basement and lay the necessary foundations for the building.On 10 March 1997, the appellants discovered that there were one-inch cracks along the driveway of their building, caused by subsidence of the soil under the driveway. The driveway was separated from the first respondent`s land by a drain, a grass verge and a fence. The soil underneath the grass verge between the driveway and the first respondents` land had also subsided. The appellants informed the first respondents and the contractors of this immediately.The next day, 11 March 1997, the cracks on the driveway widened to about five inches and certain water pipes lying underneath the driveway burst, which interrupted the appellants` water supply. The first respondents and the contractors were informed of this and the contractors carried out emergency repairs to the water pipes.The contractors did not stop excavating, however, and the water pipes on the appellants` land burst again on 15 and 16 March 1997. Again, the contractors had to carry out emergency repairs to the pipes.All this while, from 10 March 1997 onwards, the parties had been trying to negotiate a solution to the problem. It had been ascertained that the soil subsidence and the consequent damage to the appellants` property had been caused by the inadequacy of the retaining wall that the contractors had erected, and, in particular, the contractors` failure to follow the strutting design provided by the first respondents` engineer. The question was what should be done to remedy this. The possibility of a compromise was scuttled however by the contractors` refusal to stop the excavation works and repair the retaining wall, and by the inability of the parties to agree on the preventive measures that should be taken at the time. Eventually, the appellants complained to the Building Control Division (BCD) of  the Public Works Department about the situation and a `stop works order` was issued by the BCD to the first respondents on 10 April 1997.On or about 22 April 1997, the BCD permitted the works to continue, but only insofar as they pertained to the repair of the retaining wall. On or about 24 May 1997, the repairs to the retaining wall having been completed, the BCD gave permission for the works to continue.Unfortunately, that was not the end of the appellants` troubles. Further soil subsidence and damage to their property occurred on 11 June 1997. A complaint was made again to the BCD, who immediately issued a further stop works order. This stop works order was lifted a few days later after a professional engineer engaged by the first respondents convinced the BCD that henceforth all excavation works would be carried out in stages and under strict supervision.On 17 November 1998, the appellants commenced a suit against the first respondents and the contractors for `damages and loss suffered as a result of the negligence, wrongful interference of support and nuisance` on the part of the first and the second respondents. They claimed $574,598.78 for costs incurred so far in dealing with the problem, and other losses yet to be quantified.Before the trial, the contractors were wound up, and the appellants obtained a default judgment against them for failing to comply with various `unless orders` of the Registrar. The suit therefore proceeded at trial against the first respondents only, and they are the only party defending this appeal.",
        "The decision below": "In the court below, the appellants` primary submissions were in respect of the claim under the right of support. The trial judge held that a right of support extends only to what is naturally on the land, and not to buildings or things constructed on the land. He stated in his grounds of decision:3 The main thrust of the plaintiffs` [appellants`] case lay in the claim based on the wrongful interference with the right of support. However, the law is abundantly clear on this point. The right of support extends only to what is naturally on the land. The only exception, which does not apply in this case, is based on the right equivalent to an easement, that is, an acquired right of support by long usage and reliance. In this case, it is an undisputed fact that the plaintiffs` building was constructed only a year previously. The contrasting rights of adjacent land-owners, namely, the right to do as one pleases on his own land is limited by the right against wrongful interference of support. The plaintiffs have as much right to construct and maintain a building on their own land as the first defendants [first respondents] have to excavate theirs. So long as the excavation is carried out without negligence on the part of the first defendants whether directly or vicariously, and no wrongful act of nuisance was committed by them, they cannot be held responsible for the damage to the plaintiffs` building only by reason of the expectation of a right of support. That right creates a no-fault liability. Thus, it is restricted to apply only to the support of the natural ground and not to objects constructed thereon. The protection of those objects in law will lie only in negligence, nuisance or the rule inRylands v Fletcher, none of which assist the plaintiffs as can be gleaned from the sparse pleadings of the plaintiffs. Reverting to their case based on the right of  support, the law may be summed up in this robust pronouncement of Lord Penzance inDalton v Angus[1881] 6 App Cas 740at 804:`It is the law, I believe I may say without question, that at any time within 20 years after the house is built the owner of the adjacent soil may with perfect legality dig that soil away and allow his neighbour`s house, if supported by it, to fall in ruins to the ground.`This statement was adopted ... in the Court of Appeal inLee Quee Siew v Lim Hock Siew[1896] 3 SSLR 80, at 90.The trial judge further held that on the facts the claims in negligence and nuisance also failed. He thus dismissed the claim.",
        "The appeal": "Before us, counsel for the appellants, Mr Shanmugam SC, advances two arguments. The primary argument is that the principle inDalton v Angus[1881] 6 App Cas 740relied on by the trial judge is no longer good law and should be rejected. He submits that the first respondents are liable under common law principles of negligence or nuisance for the damage caused. Mr Shanmugam`s second argument is that the appellants can rely on their right to support of their land notwithstanding that a building has been erected on it, if they can show that the building did not contribute to the subsidence.We consider first the argument relating to the right of support. Mr Shanmugam contends that the principle inDalton v Angusrelied on by the trial judge is an anachronism. Citing a number of cases from Commonwealth jurisdictions in support, he urges this court to adopt a wider jurisprudential basis for imposing a liability on neighbouring landowners consistent with the realities of an urban city. In his view, there should be a duty of reasonable care on landowners who carry out potentially damaging excavation works. Further, this duty ought to be non-delegable so that the fact that the works have been carried out negligently by an independent contractor, and not by the landowner himself, should offer the latter no excuse in law.Mr Rai, for the first respondents, submits that theDalton v Angusprinciple is too well entrenched to be abrogated by this court. In his view, any change in the law is a matter for Parliament.It is necessary to begin by considering the seminal case ofDalton v Angus. The facts of that case were briefly these. The defendant landowner had employed a contractor to excavate his land. In carrying out the excavation works, the adjacent land, belonging to the plaintiffs, was deprived of lateral support. The withdrawal of support caused the plaintiffs` factory standing on the land, which had been built some 27 years prior to the commencement of the excavation works, to collapse. The plaintiffs brought an action to recover damages for injury to the factory. At the trial, Lush J directed a verdict for the plaintiffs for the damages claimed, but left them to move for a judgment in order to have the questions of law determined. On motion for judgment, it was argued for the defendants, inter alia, that the plaintiffs` factory was not entitled to the support claimed. On appeal to the Court of Appeal and House of Lords, the primary issue for determination was `whether a right to lateral support from adjoining land could be acquired by 27  years` uninterrupted enjoyment for a building proved to have been newly erected at the commencement of that time` (per Lord Selborne LC).Before the House delivered their ruling, their Lordships invited no less than seven eminent judges to give their opinions on the matter due to the complexity of the issues thrown up by the case. In the end, the central question was answered in the affirmative by all the members of the House. They held that the plaintiffs had acquired an easement of support in respect of their factory, which had been infringed when the defendant interfered with the support causing damage. Four substantive written judgments were delivered by their Lordships, but it is necessary to refer to only three of them here.We turn first to the judgment of Lord Selborne LC. Lord Selborne was of the opinion that the right to lateral support from adjoining land in respect of a building was a right in the nature of a positive easement, which could be acquired by the prescriptive period of 20 years` uninterrupted enjoyment. In reaching this conclusion, he undertook a discourse on the nature of rights of support in general, including their derivation. He said at p 791:In the natural state of land, one part of it receives support from another, upper from lower strata, and soil from adjacent soil. This support is natural, and is necessary, as long as the status quo of the land is maintained; and, therefore, if one parcel of land be conveyed, so as to be divided in point of title from another contiguous to it, or (as in the case of mines) below it, the status quo of support passes with the property in the land, not as an easement held by a distinct title, but as an incident to the land itself ...Support to that which is artificially imposed upon the land cannot exist ex jure naturae, because the thing supported does not itself so exist; it must in each particular case be acquired by grant, or by some means equivalent in law to grant, in order to make it a burden upon the neighbour`s land, which (naturally) would be free from it.The second judgment of relevance was that of Lord Penzance. Lord Penzance took the view that, if one were to approach the question afresh from the perspective of pure legal principle, the right of support in respect of buildings could not be acquired by prescription. However, Lord Penzance felt bound by authority to concur in the decision of the other members of the House to answer the question before him in the affirmative. His final position was summarised in the following passages (at pp 804, 807):... the matter is not res integra. It has been the subject of legal decisions, and those decisions leave it beyond doubt that such is not the law of England. On the contrary it is the law, I believe I may say without question, that at any time within 20 years after the house is built the owner of the adjacent soil may with perfect legality dig that soil away, and allow his neighbour`s house, if supported by it, to fall in ruins to the ground ...... the learned judge asserted ... [the plaintiff`s right] to be an absolute right acquired by 20 year`s enjoyment quite independently of grant, acquiescence, or consent. In so doing he relied, he said, upon the existing authorities. I will not recapitulate them or criticise them individually, as they have been carefully reviewed by others. They constitute the existing law on the subject; and I think the learned Judge has drawn what is upon the whole the correct inference from them, though they are by no means uniform, and although, for the reasons I have given, and for those more fully expanded in the opinion of Fry J, I am unable to find a satisfactory legal ground upon which these authorities may be justified. I feel the less difficulty in acquiescing in them, inasmuch  as they affirm a right to exist after 20 years, which in my opinion should have been held to exist as soon as the plaintiff`s house was built.Finally, we refer to the judgment of Lord Blackburn. His position with respect to the right of support was as follows:It is, I think, conclusively settled in the House inBackhouse v Bonomi[9 HLC 503] that the owner of land has a right to support from the adjoining soil; not a right to have the adjoining soil remain in its natural state (which right, if it existed, would be infringed as soon as any excavation was made in it); but a right to have the benefit of support, which is infringed as soon as, and not till, damage is sustained in consequence of the withdrawal of that support.This right is, I think, more properly described as a right of property, which the owner of the adjoining land is bound to respect, than as an easement, or servitudene fecias, putting a restriction on the mode in which the neighbour is to use his land; but whether it is to be called by one name or the other is, I think, more a question as to words than as to things. And this is a right which, in the case of land, is given as of common right ... And I think the decision of this House inBackhouse v Bonomialso conclusively settles this, that though the right of support to a building is not of common right and must be acquired, yet when it is acquired, the right of the owner of the building to support for it, is precisely the same as that of the owner of land to support for it.We shall return to the case ofDalton v Anguslater. For now, we would simply highlight the fact that the portion of Lord Penzance`s judgment relied on by the trial judge below does not, strictly speaking, form any part of the ratio ofDalton v Angus. The building in question had been built some 27 years prior to the removal of support. Therefore, the only question for determination before the House of Lords was whether a right of support in respect of a building was in the nature of an easement which could be acquired by prescription. Since the House determined that question in the affirmative, the matter was concluded in the plaintiff`s favour. The question of what the position should be prior to the acquisition of the easement was therefore not before their Lordships. It is perhaps somewhat ironical thatDalton v Angushas, through the industry and ingenuity of lawyers, become as well known for a proposition of law which it did not decide (ie. the proposition that a landowner may excavate his land with reckless abandon prior to the acquisition of a prescriptive easement) as for one which it did (ie the proposition that a right of support for a building can be acquired by the 20 year prescriptive period). This is especially so given that the dicta most frequently relied upon in support of the former proposition is that of Lord Penzance, the only member of the House who expressly disagreed with such a result. His view, as a matter of legal principle unencumbered by authority, was that the right to support `should have been held to exist as soon as the plaintiff`s house was built.`In addition toLee Quee Siew v Lim Hock Siew[1896] 3 SSLR 80referred to by the trial judge,Dalton v Anguswas considered by the Court of Appeal of the Straits Settlements in the case ofYong Joo Lin & Ors v Fung Poi Fong[1941] MLJ 63, which was heard in 1941. The appellants were the executors of one Yong Nee Chai, who had purchased a one-storied house at 19 Cross Street, Kuala Lumpur in 1905. Adjoining their house was the respondent`s house on 21 Cross Street. Some time before 1910, 19 Cross Street was converted into a two-storied house, and for this purpose, the outside wall of the top storey of the respondent`s house was utilised. In 1938, the respondent demolished his house, save for the  dividing wall between the houses. The parties tried to agree on the building of a new party wall but the negotiations did not bear fruit. Eventually, the respondent took down the wall, strutting the floors and roof of the appellants` house from within and shoring it from without, and further digging foundations on his own land. However, the strutting was `inadequate`, and the shoring `farcical`. The totality of the respondent`s works caused the house on 19 Cross Street to become unsafe for habitation, and the Sanitary Board ordered its demolition. The appellants argued, inter alia, that they had a right of support for their building under the common law doctrine whereby an easement would be presumed after 20 years` uninterrupted user. The respondent argued that that doctrine did not apply in the Federated Malay States.After considering the judgments of their Lordships in Dalton v Angus, Acting Chief Justice Terrell said at p 66:...There is accordingly ample authority for the proposition that after undisturbed enjoyment for twenty years the dominant tenant has a right of support of his building similar in every respect with the right of support of soil by soil which existsex jure naurae....a Common Law right of support for buildings comes into existence after twenty years` uninterrupted user, and the theories and fictions by means of which the Courts of Common Law in England give effect to that right, are something quite distinct from the right itself.The Court of Appeal went on to hold that the doctrine of the lost modern grant did indeed apply in the Federated Malay States notwithstanding the Land Code of 1926 and other applicable legislation. Hence, a right of support was acquired by the appellants by the passage of 20 years or more uninterrupted user.Before we consider whether a landowner`s apparent liberty to excavate prior to the completion of the prescriptive period can be justified in Singapore on principle, we turn to deal with the cases cited by the parties.Mr Shanmugam relies principally on four cases, which he says are illustrative of the approach taken in other Commonwealth jurisdictions. The first isFyvie v Anand1994 NSW Lexis 13219, a decision of the Supreme Court of New South Wales, Australia. That case concerned excavations carried out by the defendant landowners on their land, which interfered with the plaintiff`s adjacent property, causing some soil erosion. Both properties had houses erected on them. The plaintiff brought claims in trespass and interference with the right of support, the latter on the basis that the defendants had failed to erect a retaining wall. Young J found for the plaintiff in respect of the claim in trespass. In respect of the claim for withdrawal of the right of support, he said:The law as to support of land by adjoining land, especially when both parcels of land are, as they are in this case, under the Torrens system, is in a very archaic and unsatisfactory state. Giles J analysed the position inPantalone v Alaouie[1989] 18 NSWLR 119at 133. He considered that the law itself, based onDalton v Angus[1881] 6 App Cas 740, was quite unsuitable for modern Australian conditions, but he and also Brownie J, inLJP Investments Pty Ltd v Howard Chia Investments Pty Ltd[1988] 4 BPR 9640, thought that it was the duty of first instance judges of this court to continue to follow theDalton v Angusline of authority until the Court of Appeal or the High Court had decided otherwise.In the end, the judge felt bound by the authorities and held that there was no right of support in respect of the plaintiff`s house. However, he went on to award the plaintiff the cost of a retaining wall which would have been required had there been no building on his land. A point of interest in this case is that the judge, in assessing damages for a wall on the hypothetical basis that the house did not exist, did not accept thatDalton v Angusbarred any damages per se, as some other cases have seemed to suggest.The next case is the Canadian case ofWilton v Hansen[1969] 4 DLR (3d) 167, from the Manitoba Court of Appeal. The plaintiffs alleged that the defendant had, through his contractor, carried on an excavation job of his premises in such a manner as to cause removal of support of the plaintiffs` land, resulting in the collapse of the west wall of the plaintiffs` building. In the court below, the judge held that an easement of support for the plaintiffs` building had been acquired by prescription. The Court of Appeal affirmed this finding. However, the court went on to say at p 170:But there is in our view another ground on which the liability of the defendants can be based. That is the ground of negligence. Quite apart from any considerations of interference with or disturbance of an easement (which could conceivably occur without negligence) what the defendants did in the present case imposes responsibility on them for the damage which the plaintiffs sustained...This surely is a case for the application of the maximsic utere tuo ut alienum non lÃ¦das- so use your property as not to injure another`s. The principle to be followed was well set forth by Cockburn CJ, in the case ofBower v Peate[1876] 1 QBD 321. He declared that where anyone does an act on his own premises prima facie lawful in itself, but from which in the natural course of things injurious consequences to a neighbour must be expected to arise, unless means are adopted by which such consequences may be prevented, he is bound to see to the doing of that which is necessary to prevent the mischief...The third case cited by Mr Shanmugam is the American case ofWalker v Strosnider67 W Va 39, a case emanating from the Court of Appeal of West Virginia. The plaintiffs and the defendant were neighbouring landowners. The plaintiffs brought an action against the defendant for the fall of the plaintiffs` building as a result of the defendant`s excavation works on his land. In the course of his judgment, Judge Poffenbarger said:The duty on the part of the excavator, as regards buildings on adjacent land, when no right of lateral support therefor has been acquired, results from the relative rights of the parties and legal principles, governing conduct. As an adjacent owner has no right of support for his buildings, he has no property right in the form or nature of an easement in his neighbour`s lands. If therefore, the latter remove a part of his land so as to endanger the building of the former, he destroys no property right, -- takes away nothing that belongs to the former. It does not follow, however, that he owes him no duty in the premises. Though he has complete dominion and power over his own land and may do with it what he pleases, he is nevertheless bound, agreeably to the maxims, `Sic utere tuo ut alienum non lÃ¦das` and `Prohibetur ne quis faciat in suo quod nocere posit alieno,` to use his property in such a manner as not to injure his neighbour`s. This gives the latter no property right in the land of the former. It merely gives a personal right against him. It places a restraint upon his conduct. For any lawful purpose, he may use his property, but he must use it in a lawful, that is, careful, manner. In other words, he must execute the work, as far as is reasonably practicable, and not unduly burdensome,  with a view to the safety of the buildings on the adjacent property... The rule requiring care, is not based upon any right of property in adjacent land for support of buildings or otherwise. It is simply a restraint on reckless and unnecessary conduct in respect of the use of such adjacent property, fraught with danger to the building. Its justification is found in a well established principle, having wide application in English and American jurisprudence, and its application to cases of this kind is as well settled as the doctrine that the owner has no right of support therefor in the land of an adjacent owner. The two propositions are asserted, side by side, in the same decisions, and in practically all of them. All authorities on the subject impose a duty of exercising care in excavating on land adjacent to a building.Finally, there is the New Zealand case ofBognuda v Upton & Shearer Ltd[1972]  NZLR 741, a decision of the New Zealand Court of Appeal. In that case, the appellant, the owner of a service station, had sued the respondent for damaging the wall of his service station by excavating alongside the boundary on the adjoining property. The respondent was a construction company but it was treated by the court as if it were an adjoining owner. It was contended by the appellants that the excavation had been done negligently, causing their land to collapse. The evidence showed that the appellant`s land would not have collapsed except for the pressure of the wall. In the court below, the judge held himself bound byDalton v Angusthat, as the appellant had no right of support, no action would lie. He further held that, in order to found a successful claim in negligence, there had to be a breach of duty by the respondent and, as the respondent owed no duty to the appellant, this claim also failed. The appellant appealed to the Court of Appeal, arguing that a landowner owed a duty to use reasonable care in carrying out his excavation so as not to damage adjoining buildings, irrespective of the adjoining owner`s absence of the right of support. This submission was accepted by the Court, which allowed the appeal.North P first examined the English and Commonwealth cases relating to rights of support, includingDalton v Angus,Wilton v HansenandWalker v Strosniderreferred to above. He then went on to consider the impact of the expansion of the tort of negligence sinceDonoghue v Stevenson[1932]  AC 562on this line of authority. He said at p 756:In my opinion then, once the House of Lords inDalton v Angusrecognised that a right to support for a building could be acquired, not merely by express grant but also by the effluxion of time, there was no escape from the conclusion that until the 20 years expired (whether by reason of the Prescription Act or otherwise) the owner of the adjoining land must be free to prevent, if he could, the maturing of his neighbour`s right to support for his building. Therefore, so far as England is concerned, I cannot see any easy way of avoiding the conclusion that during the 20 year period the owner of the neighbouring soil cannot be placed under the restriction of having to exercise reasonable care in the way he excavates his own land immediately adjacent to his neighbour`s building. Indeed, his very object may be to demonstrate that he does object to the owner of the building acquiring a prescriptive right of support. Likewise, when the 20-year period has expired, as I see the matter, the owner of the building has acquired an absolute right to the support of his neighbour`s soil, so once again the presence or absence of negligence is immaterial for the lucky owner of the building has now acquired without the aid of an express grant, a right, not only to the support for his own soil, but as well for his building...But while I can see difficulties in the way of the development of the law in this field in England, by the judicial process, it is obvious from the line of authority I have referred to that no such difficulty has been experienced in the United States - this for the reason, I suggest, that the American courts, we are told, `have steadfastly refused to recognise the doctrine whereby such a right is acquired by prescription.` Consequently, it was, in my opinion, inevitable with the development of the law of negligence that a person wishing to make excavations on his land adjacent to a neighbouring building, should be required to exercise reasonable care to protect the building from harm...In my opinion, the short answer to all of [the respondent`s] objections is that in New Zealand, as in the case of the United States of America, it is not possible, under our land transfer system, to acquire a prescriptive easement or right to support for a building from the soil of adjoining land. Such a right must be acquired, if at all, by express grant. Therefore, I can see no reason why the range of negligence which was greatly extended inDonoghue v Stevenson`on the wide principle of the good neighbour: sic utere tuo ut alienum non lÃ¦das` should not be applied to this field...Accordingly, I am of the opinion that the defendant did owe a duty to exercise reasonable care for the protection of the plaintiff`s wall as he proceeded on his way of exercising his property right to excavate the soil adjacent to the building...The reasoning of Turner and Woodhouse JJ was broadly along the same lines.Those are the authorities relied on by the appellants. We now turn to consider the cases cited on behalf of the first respondents. Mr Rai relies principally on two cases. The first isLee Quee Siew`s case. That was a decision of the Court of Appeal of the Straits Settlements, and it is therefore binding on us. The appellant and the respondent were owners of adjoining pieces of land. The appellant excavated his land to a depth of about six feet up to the respondent`s wall. The respondent alleged that the excavations had been done in a careless manner, causing his wall to bulge and crack, to such an extent that the Municipal Engineer served a notice upon him requiring him to take down and re-erect the wall. In the court below, Cox CJ held that the appellant had been negligent and found him liable in damages, notwithstanding that the respondent could rely on no right of support in respect of the wall. The appellant appealed. Delivering the only substantive judgment of the court, Leach J stated at p 90:The respondent has proved no right of support for his house, the appellant has not encroached, so far as the evidence goes, on respondent`s land, and it appears to me clearly established by the authority ofDalton v Angusthat the respondent was not entitled to damages, and that appellant was within his rights in excavating right to the foot of respondent`s wall so long as he did no act of trespass which caused the damage. (sic)Relying on the well known sentence from the judgment of Lord Penzance set out in [para ] 12 above, Leach J then allowed the appeal.The second case relied on by the first respondents is the Australian case ofHicks v Lake MacQuarie Pty Ltd1992 NSW Lexis 6983. This was an application by the defendants pursuant to the Supreme Court Rules of New South Wales for certain claims brought against them by the plaintiffs to be struck out. The precise facts of the underlying dispute are sparse and in any event irrelevant to the appeal before us. Mr Rai merely sought to emphasise a particular passage from the judgment of Loveday J which dealt with the plaintiff`s claims in nuisance arising through the withdrawal of a right of lateral support of his land:The second basis for the claim in nuisance is said to arise by reason of the presence on the land of a hazard. The hazard nominated by Mr Stevens is said to be the tendency of land on the reserve below Madison Drive properties to slip withdrawing support for the fill on the plaintiffs` land...... The claim made by the plaintiffs, however, under this head is not maintainable in respect of the hazard if that claim is only coextensive with the claim made in respect of the right of lateral support for the fill. The plaintiffs have no right to support for the fill, as I have already stated, and accordingly it could not constitute a nuisance to withdraw support for the fill: See Kebewar v Harkin (1987) 63 LGRA 412.We return now to consider the issue before us as a matter of principle. English law on the subject of the right of support, as presented by counsel, contains a number of curious propositions. If my neighbour`s land is in its natural state, I may not remove the soil on my land without providing alternative support for his land; but if my neighbour expends money and effort in building a bungalow on his land, then I may excavate with impunity, even though his bungalow may crumble to the ground. Yet, my liberty to ignore the support required by his house is not perpetual, but lasts only for 20 years, at which time any indolence in pursuing my right to remove my soil is transformed into a positive right of support in respect of his dwelling.In Singapore, the position, as submitted by counsel, is further complicated by the fact that land ownership is governed by different regimes, depending on whether the land is registered or unregistered. Counsel draws our attention to the decision of Judith Prakash J inLim Hong Seng v East Coast Medicare Centre Pte Ltd[1995] 2 SLR 685. That case concerned a claim by the plaintiff for an easement of passage over a driveway on adjacent land. Judith Prakash J held that prima facie no easement could be acquired by prescription in respect of registered land. However, in respect of unregistered land, an easement could be acquired by the doctrine of the lost modern grant, under which the person claiming the easement had to show user of the easement for a period of 20 years. In that case, the land in question had been brought under the provisions of the Land Titles Act (Cap 157) on 27 August 1981. This meant that the plaintiff had to show user of the easement sought for 20 years preceding that date. Judith Prakash J found that on the facts such user had been shown, and held that a right of way existed.We would add that the above principle enunciated inLim Hong Seng`s case was followed by GP Selvam J inTrustees of the Estate of Cheong Eak Chong v Medway Investments Pte Ltd[1997] 1 SLR 329, who stated that he had no doubt that it was correct. Further, the principle was cited in the Court of Appeal case ofMCST Plan No 549 v Chew Eu Hock Construction Co Pte Ltd[1998] 3 SLR 366by LP Thean JA without disapproval. In the circumstances, the law on this point must be taken to be settled. The upshot of applying it to the present scenario is that a building which has stood for 20 years on land prior to that land being brought under the Land Titles Act will have acquired an easement of support in respect of neighbouring lands. On the other hand, a building which has stood for less than 20 years before such date will not have acquired such a right.Perhaps only lawyers can understand and appreciate how a simple issue such as this, through the process of law, comes to be governed by a mass of convoluted  and irreconcilable rules; surely only the bravest among them would attempt to explain it to the average citizen. For our part, we fail to see any legal principle capable of supporting the distinctions drawn by the cases. Further, we are of the view that the proposition that a landowner may excavate his land with impunity, sending his neighbour`s building and everything in it crashing to the ground, is a proposition inimical to a society which respects each citizen`s property rights, and we cannot assent to it. No doubt the trial judge felt constrained by the authority ofDalton v AngusandLee Quee Siew`s case, but this court is entitled to depart from those cases, and therefore does not suffer from any such impediment. In the event, we are of the opinion that the current state of affairs cannot be allowed to persist. The question is therefore not whether the principle applied by the trial judge in the court below should be rejected, for it clearly must, but rather how far the duty of the landowner should extend.Mr Shanmugam citesWilton v Hansen,Walker v StrosniderandBognuda v Upton & Shearer Ltdin support of his submission that there should be a non-delegable tortious duty on the landowner to use reasonable care not to damage a neighbour`s building by removing the support to his land, irrespective of any natural right of support. Such a solution has some appeal, since in the 70 years sinceDonoghue v Stevenson, the law of negligence has been extended to cover practically all types of conduct causing property damage. As was stated by North P inBognuda v Upton & Shearer Ltd, there appears to be no credible reason for the exclusion of general negligence principles in this particular area of property rights.InBognuda v Upton & Shearer Ltd, North P justified the extension of negligence liability in New Zealand on the basis that, in that jurisdiction, there was no possibility of acquiring an easement of support in respect of one`s building by prescription under their land transfer system. In his view, Lord Penzance`s famous liberty to excavate with impunity was a corollary of the prescriptive method of acquisition of an easement of support. This was because prior to the 20 year period elapsing, the owner of the servient land must be permitted to demonstrate his objection to acquisition of the prescriptive right of support by excavating his land and allowing his neighbour`s building to fall. However, since the doctrine of prescription did not apply in New Zealand, there was no difficulty in imposing a general duty of care with respect to excavation works which covered neighbouring buildings.We would make two points with respect to this line of reasoning. First, Singapore law does recognise the prescriptive acquisition of an easement within circumscribed limits (see [para ] 35-36 above), so the difficulty which arises from the rule that a servient owner must be given an opportunity to object to the prescriptive acquisition cannot be dismissed out of hand. Having said that, with the greatest of respect to North P, we are unable to agree that the prescriptive method of acquisition of an easement of support necessarily entails the proposition that the servient owner must be allowed to remove his soil and send his neighbout`s property crashing to the ground. We acknowledge that, in law, practical convenience must at times bow to the requirements of technical consistency. However, we feel that the approach suggested above demands too high a ransom. This particular point was discussed at length inDalton v Angus,  not only by the members of the House who heard the case, but also by the judges who were invited to deliver their opinions on the matter. There was disagreement among the protagonists as to the correct position on the point, but we feel that it is not necessary to recite from all the relevant judgments. We are content to associate ourselves with the words of Lord Penzance on this issue at p 807:...It would indeed be an unreasonable state of the law which should enforce upon the defendant, if he wished to retain his original right to excavate his own soil at such time as his interests might require him to do so, that he should pull his own house down, and drag his neighbour`s to the ground with it at a time when his interest did not require it, and when it could be nothing but a grievous loss and injury to all parties concerned.In our view therefore, there is no objection on the above-mentioned ground to adopting the solution adopted by the courts in Canada, New Zealand and the United States. Indeed, that position is supported by principle and has much to commend it.However, there is an additional factor to consider in adopting that solution in Singapore. Imposing a duty of care here, given the different land ownership regimes, would create an anomalous situation. In relation to unregistered land, the duty to take reasonable care would be superseded by a strict duty of support upon the passage of 20 years. As stated above,Lim Hong Seng`s case means that the strict duty would also apply to buildings on registered land which were built more than 20 years before the land was brought under the Land Titles Act. On the other hand, in relation to registered land, or buildings built less than 20 years before the land was brought under the Land Titles Act, no easement of support would arise, and the duty to take reasonable care would continue in perpetuity. We feel that such a result is undesirable, and should be countenanced only if there is no viable alternative. It is therefore necessary to consider whether it is open to this court to hold that the `natural` right of support of one`s land includes support of a building on the land once the building is completed. The difference between this position and the imposition of a tortious duty in negligence is that the former would impose a strict duty not to damage one`s neighbour`s property by interference with the support afforded by one`s land, whereas the latter would impose a duty of mere reasonable care (such duty being non-delegable). To consider this question, it is necessary to take a closer at the underlying rationale of the natural right of support as expressed in the cases.We first examine more closely the judgments delivered inDalton v Angus. As is clear from [para ] 19 above, the view of Lord Selborne LC was that in the natural state of land, a right of support existed as an incident of the land itself, and not as an easement distinct from the title. On the other hand, a natural right did not exist vis-Ã -vis things artificially imposed on the land, since such things did not themselves exist naturally. However, he then went on to say:All existing divisions of property in land must have been attended with this incident, when not excluded by contract; and it is for that reason often spoken of as a right by law; a right of the owner to the enjoyment of his own property, as distinguished from an easement supposed to be gained by grant; a right for injury to which an adjoining proprietor is responsible, upon the principle, sic utere tuo, ut alienum non lÃ¦das [meaning `use your own property in such a manner as not to injure that of another`]. This is all that I understand to be meant by those passages of the judgments inHumphries v Brogden12 QB 744,Rowbotham v Wilson8 E & B 142,Bonomi v Backhouse1 EB & E 639, 642, 644 andBackhouse v Bonomi9 HLC 512, 513 to which some of the learned judges who assisted your Lordships have referred.In these cases, or in some of them, there were buildings upon the land; but no separate question was raised as to the support necessary for the buildings, as distinguished from that necessary for the land; and the doctrine laid down must, in my opinion, be understood of land without reference to buildings.Support to that which is artificially imposed upon the land cannot existex jure naturae, because the thing supported does not itself so exist; it must in each particular case be acquired by grant, or by some means equivalent in law to grant, in order to make it a burden upon the neighbour`s land, which (naturally) would be free from it. This distinction (and, at the same time, its proper limit) was pointed out by Willes J inBonomi v Backhouse, where he said, `The right to support of land and the right to support of buildings stand upon different footings,as to the mode of acquiring them, the former beingprima faciea right of property analogous to the flow of a natural river, or of air, though there may be cases in which it would be sustained as matter of grant (seeCaledonian Railway Company v Sprot2 Macq 449): whilst the latter must be founded upon prescription or grant, express or implied;but the character of the rights, when acquired, is in each case the same.` Land which affords support to land is affected by the superincumbent or lateral weight, as by an easement or servitude; the owner is restricted in the use of his own property, in precisely the same way as when he has granted a right of support to buildings. The right, therefore, in my opinion, is properly called an easement, as it was by Lord Campbell inHumphries v Brogden; though when the land is in its natural state the easement is natural and not conventional. The same distinction exists as to rights in respect of running water, the easement of the riparian landowner is natural; that of the mill-owner on the stream, so far as it exceeds that of an ordinary riparian proprietor, is conventional, i.e., it must be established by prescription or grant.As for Lord Penzance, he was compelled by authority to hold that an easement of support could be acquired by prescription. However, before so holding, he registered his objection in principle to such a result:It must be borne in mind both what the claim is, and what it is not. It is not a claim asserted for the support of a house by the adjacent soil as soon as the house is built; but a claim that when the house has stood `for twenty years supported by the adjacent soil it has by absolute law acquired a right to the support of the soil;` and this not by reason of any implied grant, and quite independently of whether `the opposite or adjacent neighbour had notice or not of what was done or what weight was put upon` the ground to which the lateral support was required.It is this sudden starting into existence of a right which did not exist the day before the twenty years expired, without reference to any presumption of acquiescence by the neighbour (to which the lapse of that period of time without interruption on his part might naturally give rise) which I find it (sic) impossible to reconcile with legal principles...If this matter wereres integra, I think it would not be inconsistent with legal principles to hold, that where an owner of land has used his land for an ordinary and reasonable purpose, such as placing a house on it, the owner of the adjacent soil could not be allowed so to deal with his own soil by excavation as to bring his neighbour`s house to the ground. It would be, I think, no unreasonable application of the principle `sic utere tuo ut alienum non lÃ¦das` to hold, that the owner of the adjacent soil, if desirous of excavating it, should take reasonable precautions by way of shoring, or otherwise, to prevent the excavation from disastrously affecting his neighbour.A burden would no doubt be thus cast on one man by the act done without his consent. But  the advantages of such a rule would be reciprocal, and regard being had to the practicability of shoring up during excavation, the restriction thus placed on excavation would not seriously impair the rights of ownership.[Emphasis added.]But the matter is notres integra...We would also refer to a passage in the opinion delivered inDalton v Angusby Fry J, with whom Lord Penzance was in entire agreement. This passage is of direct relevance to the point we are considering:On principle it appears to me that it might well be held that every man must build his house upon his own land, and that he cannot look to support from the land of adjoining proprietors. Such a principle would prevent the owner of a house from ever acquiring a right to lateral support except by actual contract. An opposite view might be taken, for which also much reason could be given.The right of soil to support by adjoining soil is given by our law as a natural right, and it might well have been held that this natural right to support carried with it a right to support of all those burthens (sic) which man is accustomed to lay upon the soil. On this principle, the right to support would arise as soon as the house was built, and would exist independently of user, consent, or contract. It might thus, it appears to me, be reasonable to hold that a house should never have the right of support, or that it should always have it....[Emphasis added.]In addition, it is helpful to refer briefly to the case ofBonomi v BackhouseEl Bl & El 639, since that case was relied on by both Lord Selborne LC and Lord Blackburn. In that case, the plaintiff claimed damage to his property caused by the collapse of the defendant`s mines, which were below the plaintiff`s land. On appeal to the Exchequer Chamber, the primary question for determination related to whether the defence of limitation applied. However, the plaintiff`s right of support for his buildings was clearly raised by the case stated, and was therefore considered by the judges who heard the appeal. Willes J held that the right of support of land and the right of support of buildings stood upon different footings as to the mode of acquiring them (see the quotation in the judgment of Lord Selborne LC in [para ] 43 above). However, he then went on to say:...the right which a man has is to enjoy his own land in the state and condition in which nature has placed it, and also to use it in such manner as he thinks fit, subject always to this: that if his mode of using it does damage to his neighbour, he must make compensation.More tellingly, Wightman J, in the Court of Queen`s Bench in that case said:Upon consideration of all the cases, it appears to me that the cause of action, in such a case as the present, isfounded upon a breach of duty on the part of the defendant by using his own property as to injure that of his neighbour, and not upon any right of the plaintiffs to an easement in, upon, or over the land of their neighbours[Emphasis added].In our view, the passages set out above, with their emphasis on thedutyof the servient landowner not to injure his neighbour`s interests, and their insistence on the fact of damage, indicate that the right of support cannot be based solely on any principle of natural philosophy, but must instead take root in the terra firma of the principles of reciprocity and mutual respect for each other`s property. Although inDalton v Angusreference was made to the right of support existing `ex jure naturae`, and the jurists involved further drew analogies with rights over land, light, air and water, such arguments provide an insufficient foundation for a duty  on landowners to support their neighbour`s burdens imposed without their consent. For the question of what rights exist in `nature` is a notoriously difficult issue upon which persons may disagree with legitimate cause; in the instant case, Lord Selborne LC was of the view that the `natural` right to support of land could not extend to what was artificially on it, whereas Fry J, with whom Lord Penzance agreed, opined that it might well be held that the `natural` right to support carried with it a right to support of all burdens which a man was accustomed to lay on the soil. Further, rights of passage, or a right to light, water or air are of a wholly different character from the right of support, and raise different policy considerations. In relation to the former rights, the question is whether a person is entitled to a particular liberty or the benefit of a natural resource, such as a right to walk over land, or to draw water from a stream, having openly enjoyed that liberty or benefit for a substantial period of time. On the other hand, in relation to the right of support, the real concern is damage to life, limb or property; thus the rule that an action on the right of support cannot be maintained until damage has occurred.We believe that the true legal justification for the right of support is the legal principle encapsulated in the Latin maximsic utere tuo ut alienum non lÃ¦das, which translates in English to: use your own property in such a manner as not to injure that of another. The importance of that principle is compounded in Singapore in view of our land use pattern, whereby all land available for commercial, industrial or residential purposes is used to a high intensity. The damage that might be caused if landowners were lackadaisical in their excavation works could be astronomical, not to mention the cost in human lives or injury to property.Once the primacy of the principle forbidding landowners to use their property to the injury of others is accepted, we think that there is scant justification for the 20-year gestation period for a right of support in respect of a building. Historically, the English courts designated 20 years of open and peaceable enjoyment of certain rights as sufficient to raise a presumption that the particular right was in fact the subject of an express grant. However, the development of that rule was primarily in relation to rights of a wholly different character which, as we have said, raise completely different considerations.In the event, we are of the view that the principle in question operates to give a landowner a right of support in respect of his buildings by neighbouring lands from the time such buildings are erected, and we so hold.Lee Quee Siew v Lim Hock Siewis thereby overruled, and any part ofDalton v Anguswhich is incompatible with this holding should in future not be followed. There appear to be no other cases in Singapore which have applied the principle relied on by the trial judge in this case. Mr Rai submits thatDalton v Anguswas applied inTrustees of the Estate of Cheong Eak Chong v Medway Investments Pte LtdandLim Hong Seng`s case, and that is so. However, in those cases the central point before us was not in issue and they therefore stand on a different footing.We acknowledge that in imposing a strict duty on landowners we are going further than our learned colleagues in the Commonwealth cases cited above, but the law must adapt itself to modern conditions and local policies. Furthermore, we see the solution we have adopted not so much as one which creates a new legal right, but rather as one which removes unjustifiable restrictions on a right already  firmly established and accepted. So the enlarged right has exactly the same characteristics as the `original` right of support which operated only in respect of land in its natural state. In particular, it is not a right to have adjoining soil remain in its natural state, but rather a right to support from the adjoining soil, which in practical reality translates into a correlating duty of the adjoining landowner not to cause damage to his neighbour`s land by excavating or otherwise removing his land without first securing alternative means of support. Further, the right is infringed as soon as, but not until, damage is sustained in consequence of the withdrawal of that support. We would observe that what is prohibited is anactive interferencewith the support which causes damage. The authorities cited to us do not consider what the position would be if the interference with the support were not caused by a positive act of the servient landowner, but rather by an act of God, such as a landslide or earthquake. We are of the view that, in all probability, damage caused by such an occurrence would be entirely outside the scope of any right of support, natural or otherwise, afforded by one landowner to another. However, as the point is not before us for determination, we prefer to express no definitive view on it.In consequence, we find that the first respondents in the present case were under a duty to support the appellants` property, including any buildings on it, and they breached that duty by causing their soil to be removed without sufficient alternative means of support. Since the action for withdrawal of a right of support is equivalent or akin to an action under the tort of nuisance, the measure of damages to be awarded is the general tort measure, ie. all foreseeable losses suffered by the injured party as a result of the wrongful act.As it was argued before us, we would like to affirm that it matters not that the damage to the appellants` property was in fact caused by the wrongful acts of the contractors. The duty lies on the landowner and it cannot be disposed of by delegation. Authority for this proposition, if needed, is to be found in the case ofBower v Peate[] 1 QBD 321, where Cockburn CJ said:A man who orders work to be executed from which, in the natural course of things, injurious consequences to his neighbour must be expected to arise, unless means are adopted by which such consequences may be prevented, is bound to see to the doing of that which is necessary to prevent the mischief, and cannot relieve himself of the responsibility by employing someone else - whether it be the contractor employed to do the work from which the danger arises or some independent person - to do what is necessary to prevent the act he has ordered to be done from becoming wrongful.Having said that, we would add that the attitude taken by the first respondents themselves throughout the dispute did not commend itself to us. In cases where a retaining wall is built in order to support adjoining soil for excavation works, the retaining wall is as much for the benefit of the party carrying out the excavation works as for the person whose soil is being supported. Without the wall, the first respondents would have had the appellants` soil cascading onto their land and the excavation works would not have been possible. The building of the retaining wall was therefore not a random act over which the first respondents had no control or interest. Having control over, and an interest in, the retaining wall, once the first respondents became aware of the defects in the wall, they were under an immediate duty to remedy it, or at least to order the contractors to stop the works  to ascertain what needed to be done. That would have been the reasonable course of action to take. However, they did not do this and there is a strong case for liability against them in negligence, independent of any interference with the right of support.In the circumstances, it is not necessary for us to consider Mr Shanmugam`s second argument that the weight of the appellants` building did not contribute to the soil subsidence.",
        "Conclusion": "For the above reasons, we would allow this appeal with costs. We order that this matter be remitted to the Registrar for the assessment of damages. The security deposit provided by the appellants is to be returned to them or their solicitors.Outcome:Appeal allowed.Copyright © Government of Singapore."
    }
}