{
    "case_title": "Zarkovic Stanko v Owners of the Ship or Vessel `MARA`",
    "ncitation": "[2000] SGCA 47",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "The facts": "The appellant was employed as a fitter on the ship pursuant to a shipboard contract dated 1 July 1992 made between him and the respondents, which incorporated the terms of a collective agreement dated 16 July 1991 and made between the respondents and the International Transport Workers Federation (`collective agreement`). On 6 September 1992, the ship was anchored in the anchor area of Wielingen Noord near Vissingen in the Netherlands. On that morning, the appellant was instructed by the chief engineer and the first engineer to move the antenna of the satellite navigation system. In doing so, he needed some fastening clips which were stored in a workplace in the engine room. He accordingly took the ship`s internal elevator from the bridge deck for the purpose of going to the engine room. The elevator stopped at the landing, which was about 5 to 6 metres above the floor where the engine room was situated. On stepping out to the landing, he saw another seaman at work. While trying to assist that seaman, he was hit on his left shoulder from behind by an engine valve, which had come loose. He was pushed off the landing and fell onto the engine room below. Immediately following his fall, the engine valve weighing 1300 to 1350 kg rolled off the landing and fell onto him below.As a result of the accident, the appellant suffered serious injuries and became permanently disabled. About three years later, he instituted an admiralty action in rem against the ship in the High Court, invoking the admiralty jurisdiction of the court, and claimed damages for the personal injuries sustained and the loss and expenses incurred by reason of the accident on board the MARA. In the statement of claim, as subsequently amended, the appellant by [para ] 7, 8 and 9 claimed as follows:7 The plaintiff`s aforesaid pain and suffering, loss of amenities, injuries and expense were caused by the breach of duty and/or breach of the contract of employment and/or negligence of the defendants and/or their servants or agents, whom they are vicariously liable for, as particularised hereunder.Particulars...8 Further or in the alternative, the plaintiff`s aforesaid pain and suffering, loss of amenities, injuries and expense were caused by the breach of the defendants` duty, as occupier of the vessel, to the plaintiff who was on board the vessel pursuant to a contract made between the plaintiff and the defendants.Particulars...9 Further, it was a term of the contract of employment that the plaintiff would be paid compensation in the event of his suffering injury under art 15 of the collective agreement dated 16 July 1991. The compensation payable to the plaintiff in this regard amounts to US$122,400.00 plus interest and is without prejudice to such damages the plaintiff is entitled to claim at law.Particulars...The claim for the sum of US$122,400 with interest was founded on art 15 of the collective agreement which was incorporated into and was part of the terms of the employment contract. We shall refer to the terms of art 15 in detail in a moment.The claim was initially resisted and a defence was filed and served by the respondents. In the defence, the issues on liability and quantum were joined. But no issue was raised as to the jurisdiction of the court. The action proceeded and affidavits of evidence-in-chief were filed by or on behalf of both parties. On 8 August 1998, which was shortly before the trial, the parties reached a settlement, which was embodied in a settlement agreement. That agreement was filed in court pursuant to O 70 r 34 of the Rules of Court, and in consequence under r 34 became an order of court and had the same effect as if it had been made by a judge. The agreement provided as follows:(a) Without any admission of liability, the defendants agree to pay the plaintiff the settlement sum comprising US$420,000 plus costs to be taxed if not agreed in full and final settlement of all the plaintiff`s claims in the re-amended statement of claim re-filed on 16 February 1998, save for the plaintiff`s claim for US$122,400 (or alternatively damages to be assessed) pursuant to paras 9 and 10 of the said re-amended statement of claim.(b) This agreement is strictly without prejudice to the defendant`s rights to challenge the plaintiff`s claim for US$122,400 (or alternatively damages to be assessed) pursuant to paras 9 and 10 of the said re-amended statement of claim, and the agreement to pay the settlement sum to the plaintiff in full and final settlement of all the plaintiff`s claims other than the plaintiff`s claim in paras 9 and 10 of the said re-amended statement of claim is not to be a waiver or diminution of the defendants` rights as such, which continue to remain expressly reserved.(c) Upon the defendants` payment to the plaintiff of the settlement sum, the parties agree to continue this action solely on the issue of whether the plaintiff is entitled to claim for US$122,400 (or alternatively damages to be assessed) pursuant to paras 9 and 10 of the said re-amended atatement of claim (and if so, the quantum of such damages), notwithstanding that the defendants have paid or agreed to pay the settlement sum in full and final settlement of all the plaintiff`s claims in the re-amended statement of claim other than the plaintiff`s claim made under paras 9 and 10 of the said re-amended statement of claim.We should mention that during the negotiations leading to the settlement agreement, the respondents` stand was that, as the appellant was legally entitled  to be paid contractual compensation under art 15, this amount ought to be deducted from the appellant`s claim for loss of future earnings. Their contention was that the appellant was not entitled to recover the sum of US$122,400 under art 15 or any sum, in addition to the US$420,000 received under the settlement agreement. The appellant, on the other hand, maintained that the sum under art 15 was in addition to any sum payable under the settlement agreement. This difference was not resolved, and the settlement was therefore expressly made without prejudice to the claim of US$122,400 which remained outstanding.On 1 April 1999, the appellant took out an application by way of summons for further directions, seeking a determination of the following:(i) Whether the plaintiff, having recovered US$420,000.00 plus costs under the agreement dated 8 August 1998, is entitled to claim compensation under art 15 of the applicable FIT/CISL collective agreement.(ii) On the basis that the annuity under the said art 15 is agreed at US$4,896.00 per annum.(a) Whether this annual annuity is payable to the plaintiff each year of his life and only ceases when the plaintiff dies, or is it payable from the date of the accident for the remainder of the plaintiff`s working life (ie up to retirement age).(b) Given that the contract of employment is subject to Maltese law and that Maltese retirement age is 60 years, what is the appropriate multiplier to be applied in the computation of the lump sum amount under art 15 of the collective agreement.(c) Whether the lump sum compensation payable under the said art 15 is subject to deduction for the accelerated payment received by the plaintiff.The application was heard before the assistant registrar on 1 June 1999, who determined that the appellant was not precluded from bringing a claim under art 15 but held that there should not be double recovery in the quantification of damages and that the annuity is payable to the appellant from the date of the accident for the remainder of the appellant`s natural life. The appellant appealed to a judge-in-chambers.",
        "The decision below": "Before the learned judge, for the first time, the issue of jurisdiction of the court was raised. It is common ground that in bringing the claim the appellant invoked the admiralty jurisdiction of the court under s 3(1)(f) of the Act. The learned judge held that the court had no jurisdiction to hear and determine the appellant`s claim for any sum under art 15. In reaching this conclusion, he relied on the English case ofThe Moliere[1925]  P 27. In that case, the court held that the admiralty jurisdiction in respect of loss of life or personal injury was limited to a claim for damages arising by reason of a tort, and did not include a claim for statutory compensation payable irrespective of fault. Following the decision in that case, the learned judge held that, as the compensation under art 15 of the collective agreement is payable irrespective of fault, it is therefore outside the ambit of the court`s admiralty jurisdiction. His opinion is that any claim invoking the court`s admiralty jurisdiction under s 3(1)(f) of the Act must be based on fault.The learned judge further held that if the appellant`s action is to be treated as a civil action, instead of an admiralty action, the appellant`s claim under art 15 would still be dismissed as the court would not allow double recovery. In his opinion, the following words in art 15, namely: `any payment effected under this clause shall be without prejudice to any claim for compensation made in law`, mean that the appellant is not shut out of the common law claim based on tort by reason of having received a contractual payment under art 15. If the appellant can show a larger claim in tort at common law, he can recover the difference between them, but not both in full.",
        "Jurisdiction": "We turn first to the issue of jurisdiction. The learned judge in deciding that the appellant`s claim does not come within s 3(1)(f) of the Act relied on the English case ofThe Moliere[1925]  P 27. It is necessary to examine that case in some detail and the legislation governing the court`s admiralty jurisdiction then in force. In that case, a collision took place between a Swedish ship Adolf and a British ship The Moliere and it was decided by the Court of Appeal that both were equally to blame. As a result, cross-claims were brought by the respective parties and one of the claims that was brought by the owners of Adolf was the amount of compensation paid under Swedish law to the relatives of a seaman of Adolf, who was drowned as a result of the collision. The registrar reported on this claim and allowed it. The matter was then heard before Roche J. At that time, the statutes governing the admiralty jurisdiction of the High Court of the United Kingdom were the Admiralty Court Acts of 1840 and 1861 and the Supreme Court of Judicature Act 1873, as extended by the Maritime Conventions Act 1911. Prior to the passing of the latter Act, the High Court did not have admiralty jurisdiction in rem over claims for loss of life and personal injury. Roche J in the course of his judgment said at pp 31-32:Before the passing of the Maritime Conventions Act the position as to claims for loss of life or personal injury in relation to courts with admiralty jurisdiction was as follows: where such claims had to be enforced by action they were not within the jurisdiction of the Court of Admiralty as such, accordingly an action in rem will not lie to enforce them, and the Admiralty rules as to division of loss had no application in respect of them. SeeThe Vera Cruz (No 2) (1884) 9 PD 96;The Bernina[1888] 13 App Cas 1. An action in personam could of course be brought in the Admiralty Division to enforce such claims, subject to the same rules of law as would apply to them in a Court of common law. Where such claims gave no right of action, but a right to compensation subsisted or arose under some statute, British or foreign, it could not be contended that it was within the jurisdiction of the Court of Admiralty to award compensation to a claimant.The Maritime Conventions Act 1911 by ss 2, 3 and 5 extended in certain respects the admiralty jurisdiction of the High Court. In so far as relevant, they provided as follows:2 Where loss of life or personal injuries are suffered by any person on board a vessel owing to the fault of that vessel and of any other vessel or vessels, the liability of the owners of the vessels shall be joint and several:Provided ...3(1) Where loss of life or personal injuries are suffered by any person on board a vessel owing to the fault of that vessel and any other vessel or vessels, and a proportion of the damages is recovered against the owners of one of the vessels which exceeds the proportion in which she was in fault, they may recover by way of contribution the amount of the excess from the owners of the other vessel or vessels to the extent to which those vessels were respectively in fault:Provided ...4 ...5 Any enactment which confers on any court Admiralty jurisdiction in respect of damage shall have effect as though references to such damage included references to damages for loss of life or personal injury, and accordingly proceedings in respect of such damages may be brought in rem or in personam.The effect of ss 2, 3 and 5 of the Maritime Conventions Act was that the admiralty court had in rem jurisdiction over claims for damages for loss of life and personal injuries suffered by persons on board the vessel owing to the fault of the vessel but not claims for compensation arising independently of fault. This limitation was clearly provided in ss 2 and 3. Under s 2, where the loss of life and personal injuries were suffered by any person on board a vessel `owing to the fault` of that vessel and of any other vessel or vessels, the liability of the owners of the vessels was to be joint and several, and s 3 provided for contribution from owners of the vessels. Section 5 extended the jurisdiction of the court to `damages for loss of life and personal injuries` which in turn referred to damages for loss of life and personal injuries as provided in ss 2 and 3. In view of these provisions, it is clear to us that to invoke the admiralty jurisdiction in rem, the claim for loss of life or personal injury had to be founded on the fault of the vessel or vessels in question, and a claim for compensation arising independently of fault was not a claim falling within ss 2, 3 and 5 of the Maritime Conventions Act.Roche J, having considered, inter alia, ss 2, 3 and 5 of the Maritime Conventions Act and their impact on the admiralty jurisdiction of the court over claims for loss of life or personal injury, said at p 33:It is to be observed that ss 2, 3 and 5 of the Act are concerned with damages and with actions therefor. No mention is made of compensation or of claims for compensation arising independently of fault in a shipowner, and no right of contribution or indemnity is conferred in respect of payments made by way of compensation. On any other view the silence of the contribution section (s 3) with regard to the case of an owner who may have to pay compensation, though his vessel is not in fault at all, would be quite inexplicable. The Maritime Conventions Act, therefore, in my opinion leaves the matter where it was before, and does not cover, or support, the claim now under consideration.Our general observation onThe Moliereis that the provisions of our High Court (Admiralty Jurisdiction) Act conferring in rem jurisdiction on our High Court are very much more extensive than those provided by the United Kingdom legislation in force at the time, whenThe Molierewas decided. Reverting to the case at hand, with the utmost respect to the learned judge, we do not findThe Moliereof any assistance in the determination of the issue on jurisdiction under consideration.It is now necessary to turn to the provisions of s 3(1)(f) of the Act which the appellant invokes in founding his claim. This section in so far as relevant is as follows:3(1) The Admiralty jurisdiction of the High Court shall be as follows, that is to say, jurisdiction to hear and determine any of the following questions or claims:...(f) any claim for loss of life or personal injury sustained in consequence of any defect in a ship or in her apparel or equipment, or of the wrongful act, neglect or default of the owners, charterers or persons in possession or control of a ship or of the master or crew thereof or of any person for whose wrongful acts, neglects or defaults the owners, charterers or persons in possession or control of a ship are responsible, being an act, neglect or default in the navigation or management of the ship, in the loading, carriage or discharge of goods on, in or from the ship or in the embarkation, carriage or disembarkation of persons on, in or from the ship.The approach of the courts here and in the United Kingdom has been to give a broad and liberal construction to the statutory provisions conferring admiralty jurisdiction on the courts. InThe Antonis P Lemos; Samick Lines Co Ltd v Owners of the Antonis P Lemos[1985]  AC 711, the House of Lords held that a broad and liberal construction should be given to the provisions of the Supreme Court Act 1981 relating to the admiralty jurisdiction of the High Court on the ground that the legislation was designed to give effect to an international convention. Lord Brandon of Oakbrook, who delivered the main speech of the House, said at pp 725-726:Parker LJ, in his judgment in the Court of Appeal, accepted the proposition put forward by the respondents that, since the provisions of the Act of 1981 relating to the Admiralty jurisdiction of the High Court was designed to give domestic effect to an international convention, a broad and liberal construction should be given to them. There is ample authority to support this as a general proposition, to some of which Parker LJ referred in his judgment. I have no doubt that the proposition is, in general, correct, and that Parker LJ was right to accept it.In that case, the sub-sub-charterer sued the head charterer in negligence for damage caused to its cargoes and invoked the admiralty jurisdiction of the court under s 20(2)(h) of the Supreme Court Act 1981 (which is the equivalent of s 3(1)(h) of our High Court (Admiralty Jurisdiction) Act). The House of Lords construed the words `arising out of` to mean `connected with`, and held that the plaintiff`s claim, even though founded on tort, fell within s 20(2)(h) as a `claim arising out of any agreement relating to the carriage of goods in a ship or to the use or hire of a ship`, because the claim was connected with an agreement relating to the carriage of goods in, or the use or hire of, a ship, namely, either the sub-charter or the sub-sub-charter, notwithstanding that the defendants were not a party to either agreement.A similar approach was adopted by this court. InThe Trade Fair[1994] 3 SLR 827, the plaintiffs were engaged to discharge a cargo of soybean meal from the ship, The Trade Fair, and three of their employees, in the course of discharging the cargo from a deep tank, were overcome with hypoxia and subsequently died. The plaintiffs paid compensation in the sum of $135,000 under the Workmen`s Compensation Act (Cap 354) and thereafter instituted an action in rem against the  ship claiming an indemnity under s 18(b) of the Workmen`s Compensation Act. The claim was brought under s 3(1)(f) of the Act, as in this case. This court, following the approach inThe Antonis P Lemos(supra), construed the words `any claim for loss of life or personal injury` in s 3(1)(f) of the Act to read `any claim arising out of loss of life or personal injury` and held that `any claim` would include a claim for compensation or a claim for indemnity in that case.InAlexander G Tsavliris & Sons Maritime Co v Keppel Corp Ltd[1995] 2 SLR 113, the plaintiffs invoked the admiralty jurisdiction of the High Court to enforce an arbitration award for remuneration for the services rendered by the plaintiff salvors to the Atlas Pride. The claim was made under s 3(1)(i) of the Act. This court followingThe Saint Anna[1983] 1 Lloyd`s Rep 637, where Sheen J held that an arbitration award made pursuant to an agreement to refer to arbitration contained in a voyage charterparty could be enforced by an action in rem brought under s 20(2)(h) of the United Kingdom Supreme Court Act 1981 (which is the equivalent of s 3(1)(h) of our High Court (Admiralty Jurisdiction) Act), construed the words `in the nature of salvage` in s 3(1)(i) to mean `arising out of salvage`. Accordingly, the court held that the action to enforce the award was properly brought under s 3(1)(i) of the Act. Karthigesu JA, delivering the judgment of the court, said at p 119:If it is right that the words `in the nature of salvage` in s 3(1)(i) of the Act ought to be read as `arising out of salvage`, and in our judgment it is right, then applying the judgment inThe Saint Anna, with which judgment we are in entire agreement, there is no doubt that this action which was brought to enforce the award is within the admiralty in rem jurisdiction and has been properly brought against the `Atlas Pride`. The agreement to refer to arbitration in London the assessment of the salvage reward or remuneration payable to the salvorsarose out ofthe salvage of the `Atlas Pride` and the award of the arbitrator was the result of that reference.Again, inThe Indriani[1996] 1 SLR 305, this court, following the reasoning of the House of Lords in their decision inThe Antonis P Lemos(supra), held that the phrase `arising out of` within s 3(1)(h) of the Act should be construed broadly and liberally to mean `connected with` rather than narrowly to mean `arising under`. This case is of particular significance in that a very broad and liberal construction was given to that section. There, the plaintiffs contracted to sell a certain cargo to an Indonesian company called Metro. The contract provided for, among other things, a `clean on board bill of lading` to be presented for payment by way of letter of credit. The plaintiffs chartered The Indriani from the defendants for the carriage of the cargo from China to Indonesia. By the terms of the charter party, the master was empowered to issue a `clean on board` bill of lading and had a right to reject any damaged cargo not in conformity with the description of the quality certificate of the official surveyor. The cargo was shipped on board and a clean bill was issued. However, when the cargo was discharged in Indonesia, it was found to be in a bad condition. The defendants wrote to Metro alleging that the cargo was `wet, warm and ill-smelling at the time of loading in China`. Metro rejected the cargo and refused to pay for it. The plaintiffs commenced an action against the defendants claiming damages in an amount representing the price of the cargo based on misrepresentation made by the defendants. The plaintiffs subsequently amended the claim to one for malicious or injurious falsehood. It was held by this court that the plaintiffs` claim  came within s 3(1)(h) of the Act, which covers `any claim arising out of any agreement relating to the carriage of goods in a ship or to the use or hire of a ship`. This court, reiterating the approach adopted in the previous cases, said at pp 310-311:The interpretation of the phrase `arising out of` adopted inThe Antonis P Lemoswas followed inThe Maersk Nimrod[1991] 3 All ER 161, at p 171 andThe Hamburg Star[1994] 1 Lloyd`s Rep 339, at p 406. In the light of the authorities, we agree with GP Selvam J that the phrase `arising out of` within s 3(1)(h) of the Act should be interpreted widely to mean `connected with`. In fact, the construction is in line with the recent decisions of this court inThe Trade Fair; Owners of the Ship or Vessel Trade Fair v Lim & Sons (Pte) Ltd[1994] 3 SLR 827and inAlexander G Tsavliris & Sons Maritime Co v Keppel Corp Ltd[1995] 2 SLR 113. In the former, `any claim for loss of life or personal injury` within s 3(1)(f) of the Act was interpreted widely to mean any claim arising out of loss of life or personal injury. In the latter, any claim `in the nature of salvage` within s 3(1)(i) of the Act was interpreted to mean any claim arising out of salvage. Both constructions aimed to give a wide and extensive effect to the admiralty jurisdiction conferred by the Act. In the premises, s 3(1)(h) is wide enough to include claims in tort. It is also immaterial whether the parties to an action are the parties to the agreement or agreements concerned.And later with reference to the claim under consideration the court said at p 311:The tort of malicious or injurious falsehood protects the plaintiff`s interest in his property or trade, or economic interests generally. In the present case, the respondents seek to protect their interests in the cargo which was carried on board the Indriani pursuant to the charterparty, of which payment was to be made based on the clean bill of lading which the appellants issued. In this general sense, we find that a claim of this nature is not outside the ambit of the Act altogether.Reverting to the case at hand, the learned judge after referring toThe Moliere, expressed the view (at [para ] 8) that the admiralty jurisdiction in respect of personal injuries was limited to claims for damages, and that a claim for damages was a `term of art`. He then went on to say:It means damages arising by reason of a tort and not statutory compensation payable irrespective of fault.A fortioricompensation payable under a contract irrespective of fault would be outside the ambit of the admiralty jurisdiction of the court. The same reasoning applies to any claim under s 3(1)(f) of the Act. Jurisdiction under s 3(1)(f) of the Act must be based on fault as spelt out by the words of the Act. A statutory tort is created by the Act. Once the claim based on the statutory tort was settled the parties were out of court.Later he said at [para ] 9:Claims in contract, in other words, are outside an admiralty jurisdiction of the High Court. The plaintiff, accordingly, is out of court in respect of a claim for personal injury based on the collective agreement.It seems to us that the learned judge was of the view that to found admiralty in rem jurisdiction under s 3(1)(f) of the Act, the claim for loss of life or personal injury must be based on `fault`. With respect, a careful reading of para (f) of s 3(1) of the Act does not appear to support this conclusion. It bears repeating here the material words in that section:(f) any claim for loss of life or personal injury sustained in consequence ofany defect in a ship or in her apparel or equipment, or of the wrongful act, neglect or defaultof the owners, charterers or persons in possession or control of a ship or ... [Emphasis is added.]In our opinion, the words `sustained in consequence of any defect in a ship or in her apparel or equipment, or of the wrongful act, neglect or default of the owners ...` qualify the `loss of life or personal injury`. On a plain reading of this part of para (f), there are two types or categories of `claim for loss of life or personal injury sustained` as envisaged in para (f): one is where such loss of life or personal injury is sustainedin consequence of`any defect in a ship or in her apparel or equipment`; and the other is where the loss of life or personal injury is sustainedin consequence of`the wrongful act, neglect or default of the owners, charterers or persons in possession or control of the ship or the master or crew thereof or of any other persons for whose wrongful acts, neglects or defaults the owners, charterers or persons in possession or control of the ship are responsible, being an act, neglect or default in the navigation or management of the ship, in the loading, carriage or discharge of goods on or from the ship or in the embarkation, carriage or of disembarkation of persons on, in or from the ship` The second type or category of claim is based on `fault`, as the causation of the loss of life or personal injury is the `wrongful act, neglect or default`. However, the first type or category is not necessarily so based; no `fault` may be present in the causation of loss of life or personal injury, the causation being `any defect in a ship, in her apparel or equipment`.In coming to this conclusion, we are mindful of the decision of this court inThe Trade Fair(supra), where Karthigesu JA, delivering the judgment of this court, said at p 831:We have no doubt, just as the learned judicial commissioner had no doubt, that the words `any claim` are wide enough to include claims for compensation or indemnity where such claims for compensation or indemnity are founded onfault in one or other of the respects as enumerated in the section. [Emphasis is added.]However, that case was argued and decided on the basis that fault was present. The cause of action in that case was one under s 18(b) of the Workmen`s Compensation Act, and that section applies where the injury was caused in circumstances creating liability on the part of the person causing the injury, and the issue whether fault is or is not a requisite or essential element for invoking s 3(1)(f) was not argued and considered. In other words, that action was premised on fault of the person causing the injury. Karthigesu JA, immediately after the above passage of the judgment, said at p 831:Turning once again to s 18(b) of the Workmen`s Compensation Act and translating it to the facts of this case it is clear that the respondents are entitled to be indemnified since the compensation payable by the respondents to the relatives of the stevedores for their death `was caused under circumstances creating a legal liability` in the appellants.The next question here is whether the claim under consideration is one for loss of life or personal injury as provided in s 3(1)(f) of the Act. InThe Trade Fair(supra), the term `any claimforloss of life or personal injury` was construed to  mean a claimarising out ofloss of life or personal injury. Karthigesu JA, delivering the judgment of the court, said at p 832:So also if we substituted `arising out of` for the word `for` in s 3(1)(f) of the Act it will read `any claim arising out of loss of life or personal injury...` and, in our judgment, would make perfectly good sense. Construed in this way, it is clear that a claim for compensation or a claim for an indemnity therefor arising out of loss of life must fall within s 3(1)(f) of the Act. In our view, this interpretation also accords with the legislative intent behind the enactment of s 3 of the Act as manifested in the parliamentary speech of the minister referred to above.In this case, following what was decided inThe Trade Fair, we would construe the words `any claim for loss of life or personal injury` to mean `any claim arising out of loss of life or personal injury`. No doubt, the present claim of the appellant is based on art 15 and is a contractual claim. However, it is a claim arising out of the personal injuries sustained by the appellant in consequence of either (i) a defect in the MARA or in her apparel or equipment, or (ii) the wrongful act, neglect or default of a person or persons, for whose wrongful act, neglect or default the respondents as owners of the MARA were responsible. In our judgment, such a claim falls within s 3(1)(f) of the Act. The appellant`s right to the payment under art 15 arose because he was injured by reason of an accident while working on board the respondents` ship.It is necessary to refer briefly to the matters alleged in the affidavit of evidence filed by or on behalf of the appellant. He alleged that he sustained his injury because the valve was not properly secured due to the improper construction of the valve seat which did not support the greater part of the valve. Further, he also alleged that the accident was caused by the unsafe manner of working of his colleagues, in that the only two studs holding the valve were removed before the two steel slings had been fastened to the valve, thus leaving the valve standing loose. Mr Chay Choon Chong, a marine engineer, also gave evidence in his affidavit that the accident was due to unsafe work practices on board the ship.Essentially, the appellant`s case was that his personal injuries were caused by a defect in the ship or in the equipment of the ship as well as the wrongful act, neglect or default of those persons for whom the owners were responsible, being an act, neglect or default in the management of the ship. Such injuries give rise to the claim under art 15 which falls within s 3(1)(f) of the Act, as the claim arose out of his personal injuries sustained as a consequence of one or more of the events covered in s 3(1)(f). The section covers `any claim`, and it does not matter whether the claim is in the nature of damages or indemnity or compensation or even a contractual claim. What matters is that the claim should arise out of loss of life or personal injury and that the loss of life or personal injury is occasioned by one or more of the causes enumerated in s 3(1)(f). On the facts of the present case, the appellant`s claim under art 15 is a claim arising out of personal injury sustained in consequence of a defect in the ship or in the equipment of the ship or in consequence of the wrongful act, neglect or default of those persons for whom the respondents as owners of the ship are responsible, being an act, neglect or default in the management of the ship. In our judgment, the appellant`s claim comes within the Court`s admiralty jurisdiction under s 3(1)(f) of the Act.",
        "Double recovery": "The next issue is whether the appellant is entitled to recover the amount of US$142,000 as compensation under art 15 in addition to the US$420,000 he had received in the settlement. The basic rule is that damages in negligence are purely compensatory, and in assessing damages for the loss the injured plaintiff has sustained, any gain which is received by him, which he would not have but for the injury, prima facie will be taken into account. InHussain v New Taplow Paper Mills Ltd[1988]  AC 514, 527, Lord Bridge of Harwich said:[P]rima facie the only recoverable loss is the net loss. Financial gains accruing to the plaintiff which he would not have received but for the event which constitutes the plaintiff`s cause of action are prima facie to be taken into account in mitigation of losses which that event occasions to him.In that case, the plaintiff, who was employed by the defendants as a machine operator, was seriously injured in the course of his employment and was incapacitated from work. He was off from work until the trial but his contract of employment continued. Under the terms of the contract, he was entitled to and was paid full wages for 13 weeks and thereafter 50% of his pre-accident earnings as long-term sickness benefit so long as he remained in employment. These payments were made pursuant to an insurance scheme effected by the defendants. The trial judge held that these payments should be disregarded in assessing damages for loss of earnings, but the court of appeal held that they should be taken into account in reduction of damages. On appeal, the House of Lords agreed with the Court of Appeal. Lord Bridge of Harwich, who delivered the main speech of the House, said at p 530:The question whether the scheme payments are or are not deductible in assessing damages for loss of earnings must be answered in the same way whether, after the first 13 weeks of incapacity, the payments fall to be made for a few weeks or for the rest of an employee`s working life. Looking at the payments made under the scheme by the defendants in the first weeks after the expiry of the period of 13 weeks of continuous incapacity, they seem to me indistinguishable in character from the sick pay which the employee receives during the first 13 weeks. They are payable under a term of the employee`s contract by the defendants to the employee qua employee as a partial substitute for earnings and are the very antithesis of a pension, which is payable only after employment ceases. The fact that the defendants happen to have insured their liability to meet these contractual commitments as they arise cannot affect the issue in any way.There are two established exceptions to the basic rule against double recovery. The first is where a plaintiff recovers any moneys under an insurance policy for which he has paid the premiums, and the insurance moneys are not deductible from damages payable by the tortfeasor:Bradburn v Great Western Rly Co[1874]  LR 10 Exch 1[1874-80]  All ER Rep 195. The second is where the plaintiff receives money from the benevolence of third parties prompted by sympathy for his misfortune, as in the case of a beneficiary from a disaster fund, and the amount received is again to be disregarded:Redpath v Belfast and County Down Railway[1947]  NI 167. In Hussain (supra), Lord Bridge, having referred to these two exceptions, said at pp 527-528:In both these cases there is in one sense double recovery. If the award of damages adequately compensates the plaintiff, as it should, the additional amounts received from the insurer or from third party benevolence may be regarded as a net gain to the plaintiff resulting from his injury. But in both cases the common sense of the exceptions stares one in the face. It may be summed up in the rhetorical question: `Why should the tortfeasor derive any benefit, in the one case, from the premiums which the plaintiff has paid to insure himself against some contingency, however caused, in the other case, from the money provided by the third party with the sole intention of benefiting the injured plaintiff?`We have an observation on these two exceptions. The number of such exceptions is by no means closed, and there are circumstances where payments made to the injured plaintiffs do not fall precisely and squarely within either of the exceptions but are nonetheless not deductible in the assessment of recoverable loss. It should be borne in mind that the distinction between what is deductible and what is not is at times certainly not clear cut, and in between them are borderline cases which essentially turn on the special facts. InHussain(supra), Lord Bridge said at p 528:There are, however, a variety of borderline situations where a plaintiff may receive money which, but for the wrong done to him by the defendant, he would not have received and where there may be no obvious answer to the question whether the rule against double recovery or some principle derived by analogy from one of the two classic exceptions to that rule should prevail ... Many eminent common law judges, I think it is fair to say, have been baffled by the problem of how to articulate a single guiding rule to distinguish receipts by a plaintiff which are to be taken into account in mitigation of damage from those which are not. Lord Reid aptly summed the matter up inParry v Cleaverwhen he said [1970] AC 1, 13H: `The common law has treated this matter as one depending on justice, reasonableness and public policy.`It is helpful to consider some of the borderline cases. InPayne v Railway Executive[1952] 1 KB 26, the plaintiff was at the material time in the service of the Royal Navy and while travelling by train was injured and as a result of his injuries became an invalid. He was discharged from service and was awarded a disability pension. In subsequent proceedings against the Railway Executive for damages for negligence, the question which arose was whether the disability pension could be taken into consideration in reduction of damages. Seller J was of the opinion that the plaintiff became entitled to the pension by reason of his naval service, it being one of the benefits such service afforded, and the pension would have been paid if the accident had been caused without any negligence on the part of the defendant`s servants. He therefore held that the pension must be disregarded in the assessment of damages just as insurance money would be disregarded, and that as a matter of principle the wrongdoer should not get the benefit of the fortuitous circumstances that the plaintiff was in the service of the navy and consequently received a pension. His decision was upheld by the Court of Appeal. In particular, Cohen LJ, with whom Birkett LJ agreed, expressly approved (at pp 35-36) the conclusion and reasoning of Seller J.InWatson v Ramsay[1961] 78 WN (NSW) 64, the plaintiff was employed under the Public Service Act 1902 and upon retirement as a result of incapacity which was not due or attributable to any misconduct on his part became entitled to superannuation payments under a superannuation scheme. Both the plaintiff as the employee and his employers made contributions to the scheme. The question  which arose for consideration was whether such payments under the scheme were deductible in the assessment of damages for the injuries the plaintiff sustained as a result of the negligence of the defendant. Bereton J of the Supreme Court of New South Wales considered that the existence of such scheme as one of the incidents of the employment offered to the plaintiff which had the effect of making the terms of employment more attractive and of encouraging continuity of employment. In holding that the payments under the scheme should be disregarded, Bereton J said at p 65:It may be that as a result of an accident this retirement is accelerated. The payment of the pension, therefore, begins earlier if the superannuation scheme so provides. But if it so does provide, this is no less a benefit earned by past work than a pension payable only at a specified age. A superannuation scheme of the type involved here is therefore to my mind completely analogous to a policy of accident or sickness insurance taken out in the employee`s favour with his employer instead of with an insurer. Whether paid by him wholly, or paid for partly by him and partly by his employer, it is none the less to my mind provided in consideration of his service to his employer; and where superannuation becomes payable before the normal retiring age, it is not payable in recognition of any injury which may have caused such retirement, or in order to alleviate any loss of earnings thereby occasioned, or as a discretionary payment or act of grace; it is payable simply and solely because the employee has by his work bought his entitlement to it; if it were not paid, and he sued for it, the fact that he had recovered damages for his injury from his employer or anyone else could not conceivably be pleaded in bar in that action.In the case ofNational Insurance Co of New Zealand Ltd v Espagne[1961] 105 CLR 569, the plaintiff, while a passenger in a car owned by one Archer and driven by one Brinskey, was seriously injured in a road traffic accident caused by the negligence of the latter. He brought an action against both of them to recover damages for the personal injuries sustained. Joined as a defendant also was the insurance company which was the substantive defendant in the suit. Among the injuries sustained by the plaintiff was permanent blindness, and as a result he qualified for and was granted an invalid pension by the authority concerned under the Social Services Act 1947-1957 in exercise of its administrative discretion. It was held by the High Court that the invalid pension was to be disregarded in the assessment of damages. Dixon CJ, in analysing the reasoning for the distinction between what is deductible and what is not, said at p 573:The reasoning begins with a distinction which I think is clear enough in general conception. There are certain special services, aids, benefits, subventions and the like which in most communities are available to injured people. Simple examples are hospital and pharmaceutical benefits which lighten the monetary burden of illness. If the injured plaintiff has availed himself of these, he cannot establish or calculate his damages on the footing that he did not do so. On the other hand there may be advantages which accrue to the injured plaintiff, whether as a result of legislation or of contract or of benevolence, which have an additional characteristic. It may be true that they are conferred because he is intended to enjoy them in the events which have happened. Yet they have this distinguishing characteristic, namely they are conferred on him not only independently of the existence in him of a right of redress against others but so that they may be enjoyed by him although he may enforce that right: they are the product of a disposition in his favour intended for his enjoyment and not provided in relief of any liability in others fully to compensate him.Windeyer J in a very detailed judgment, where he discussed and considered various authorities, said at pp 599-600:Is there a governing principle in all these cases? So far as any rules can be extracted, I think that they may be stated, generally speaking, as follows: In assessing damages for personal injuries, benefits that a plaintiff has received or is to receive from any source other than the defendant are not to be regarded as mitigating his loss, if: (a) they were received or are to be received by him as a result of a contract he had made before the loss occurred and by the express or implied terms of that contract they were to be provided notwithstanding any rights of action he might have; or (b) they were given or promised to him by way of bounty, to the intent that he should enjoy them in addition to and not in diminution of any claim for damages. The first description covers accident insurances and also many forms of pensions and similar benefits provided by employers: in those cases it is immaterial that, by subrogation or otherwise, the contract may require a refund of moneys paid, or an adjustment of future benefits, to be made after the recovery of damages. The second description covers a variety of public charitable aid and some forms of relief given by the State as well as the produce of private benevolence. In both cases the decisive consideration is, not whether the benefit was received in consequence of, or as a result of the injury, but what was its character: and that is determined, in the one case by what under his contract the plaintiff had paid for, and in the other by the intent of the person conferring the benefit. The test is by purpose rather than by cause.The case ofGraham v Baker[1961] 106 CLR 340is another decision of the High Court of Australia on the point under consideration. There, the plaintiff, who at the material time was a station officer in the employ of the Board of Fire Commissioners of New South Wales, was injured by the negligence of the defendant. Following the injuries, he was compulsorily retired whereupon he became entitled to a pension. This pension accrued to him as a result of his participation in a contributing superannuation scheme. It was held by the Supreme Court of New South Wales and the High Court of Australia that no account should be taken of the pension payment accrued and paid to the plaintiff for the period between the date of the compulsory retirement and the date on which he would retire in the ordinary course of events.In the leading case ofParry v Cleaver[1970]  AC 1, referred to by Lord Bridge in Hussain, a police constable while directing traffic was injured by the negligence of the defendant and as a result of the injuries had to be discharged from the police force. During the time of his employment, he was required under the Police Pension Regulations to contribute a certain amount from his wages to the pension fund, although no fund was maintained for his benefit. Upon his discharge from the service, he was paid a weekly ill-health or disablement pension. The main issue for consideration before the House of Lords was whether his ill-health or disablement pension was deductible in assessing the award of damages. It was held by a majority of three to two that such pension should not be taken into account and be deducted in the computation of damages. In particular, Lord Reid (at p 16) treated the pension as a form of insurance to which the plaintiff had contributed the premiums by his pre-accidental service. Lord Wilberforce (at p 42) considered that the pension was payable in any event and was not dependent on loss of earning capacity and that the pension was to be regarded as the reward  or earning of pre-injury service and therefore should not be taken into account in computing the post-injury wages.Turning to the case at hand, counsel for the respondents contends that the payment under art 15 was in the nature of contractual compensation and should have been deducted from the damages for loss of earnings claimed by the appellant. As the appellant had recovered loss of earnings under the settlement without such deduction, he should not be allowed to recover the payment under art 15, as that would amount to double recovery. Counsel also contends that the burden is on the appellant to show that the payment under art 15 falls within either of the established exceptions to the prima facie rule against double recovery.In support of his contention that the payment of art 15 is in the nature of a contractual compensation and not an insurance benefit or a benevolent gift, counsel for the respondents relies on the following factors. Firstly, the payment under art 15 is the appellant`s entitlement under his contract of employment and the nature of the payment is akin to sick or disability pay. Secondly, art 15 itself is headed `Compensation for Disability` and provides that the appellant shall receive an annual annuity if his ability to work is reduced as a result of the accident. Thirdly, the calculation of the annuity by reference to the appellant`s wages and degree of disability shows that the purpose of art 15 is to provide compensation for the appellant as a result of any disability occurring in the course of his employment.Counsel for the appellant, on the other hand, relies on the decision of the Court of Appeal in England inMcCamley v Cammell Laird Shipbuilders Ltd[1990] 1 All ER 854and contends that the payment under art 15 is in the nature of insurance benefits arranged by or through the respondents and also an act of benevolence on the respondents` part and should thus be excluded in the computation of damages for the tort for which the respondents are liable.InMcCamley v Cammell Laird Shipbuilders Ltd[1990] 1 All ER 854, the defendant employers took out a personal group insurance policy for the benefit of their employees, in which the employers were described as `the insured` and their employees as the `insured persons`. Payments under the insurance policy were made independently of fault and as a lump sum, not in substitution for loss of wages. The plaintiff was seriously injured in the course of his employment by the defendants and received a substantial sum under the terms of the insurance policy. The Court of Appeal held that the insurance payment was not to be deducted from the compensation claim in respect of his injuries, on the ground that such payment was an act of benevolence. The sum payable was quantified in advance of an accident taking place and it could not have been foreseen what damages might be sustained. Thus the payment made to the plaintiff under the policy did not fall within the normal rule that there should be no double recovery and the proceeds of the policy were not deductible from the damages awarded to the plaintiff.Likewise, counsel for the appellant contends that the payment under art 15 is in the nature of an insurance benefit and also represents an act of benevolence on the part of the respondents. Counsel submits that the intent and purpose of art 15 is not to compensate him for any pain and suffering, loss of amenities and loss of earnings but to provide financial security in the form of an annual annuity for the  remainder of his natural life. It is an insurance benefit arranged by or through the respondents as the employers at the insistence of the appellant`s trade union and it forms part of the appellant`s remuneration as a benefit in kind. Under the appellant`s employment contract, the respondents were obliged to provide such an insurance benefit. Thus, followingMcCamley`s case, the appellant should be allowed to claim payment under art 15 in addition to the US$420,000 he had received under the settlement agreement.In our view, there is a material distinction between the present case andMcCamley. There, the policy was taken out by the employers on their own for the benefit of their employees and not pursuant to the contract of employment between them and their employees. In this case, however, art 15 is part of the terms of the contract of employment between the respondents and their employees, and by reason of this, the appellant is entitled to the payment under art 15 as a term of his employment contract and the respondents are legally obliged to pay it. That being so, it can hardly be contended that the payment is an act of benevolence on the respondents` part.In considering the question whether the payment under art 15 should be brought into account in the assessment of damages, it is necessary to consider the nature of that payment. Lord Reid inParry v Cleaver(supra) said at p 15:Surely the distinction between receipts which must be brought into account and those which must not must depend not on their source but on their intrinsic nature.In this connection, we now turn to art 15, which so far as material reads as follows:Compensation for DisabilityA seafarer who suffers an accident whilst in the employment on the Vessel through no fault of his own, including accidents occurring whilst travelling to or from the Vessel at the request of the Owner/Management or their Agents, or as a result of marine peril and whose ability to work is reduced as a result thereof, shall receive from the Vessel, in addition to his sick pay, an annual annuity calculated on his basic pay at the rate given in the table below....The annuity may be converted into a lump sum if the injured party so agrees.If agreement cannot be reached as to the degree of disability or the amount of lump sum, the matter shall be referred to a mutually acceptable third party whose findings shall be binding. If a third party cannot be agreed upon the Owner/Management or their Agents and the Unions shall retain full freedom of action.Any payment effected under this clause shall be without prejudice to any claim for compensation made in law. [Emphasis is added]The benefit under this clause is in the form of an annuity payable to a seafarer, who through no fault of his own, sustains personal injury in an accident while in the employment of the respondents on board the ship, and such annuity is calculated at certain rates. The seafarer is given a right to elect to convert the annuity into a lump sum payment. So long as the employee is not at fault in an accident, such benefit is payable irrespective of how it is caused. The annuity is payable for the remainder of the employee`s natural life and not merely for the remainder of his working life. For this reason, the purpose of the payment is not just to compensate the injured employee for his loss of earnings. Moreover, sick  or disability pay is provided elsewhere in the collective agreement, and the payment under art 15 is intended to be in addition to the sick pay that the employee would receive as a result of his injury. Also, the calculation of the annuity under art 15 is made by reference to the employee`s wages and degree of disability. It seems to us that the intent and purpose of art 15 is to provide the employee a kind of financial security in the form of an annuity for the rest of the employee`s natural life in the event that he suffers any disability as a result of an accident whilst in the employment of the ship through no fault of his. Broadly speaking, it is analogous to a benefit derived from an insurance scheme arranged by or through the respondents and it formed part of the employee`s remuneration as a benefit in kind. It is certainly analogous to the disability pension inPayne v Railway Executive(supra) or the invalid pension inNational Insurance Co of New Zealand Ltd v Espagne(supra), which was held not to be deductible in the assessment of damages. In our opinion, the appellant is entitled to the payment under art 15 without having it deducted from the damages payable or paid under the settlement agreement in respect of his claim in tort.Even if the payment is not a benefit arising strictly from an insurance scheme, we think that the appellant is still entitled to recover this contractual sum on the ground that the payment was expressly provided by his employment contract. In this connection, it is necessary to ascertain the intention of the parties at the time the agreement was made. It is trite law that the intention of the parties to a contract must be ascertained from the language they have used, considered in the light of the object or purpose of the contract and the surrounding circumstances. It should be noted that art 15 is part of the collective agreement entered into between the respondents and the trade union representing the crew members of the ship MARA, and it is quite apparent that it was intended to confer certain additional benefits to the crew members. It is also apparent to us that art 15 was drafted with the knowledge that a crew member who is injured through no fault of his own can also recover damages from a tortfeasor, and hence it expressly provides that any payment made under that artis without prejudice to any claim by the injured crew member against the tortfeasor. To our mind, the intent of art 15 is to provide the appellant a payment as an employee of the respondents which would not be affected by any claim for damages in law. In the words of Dixon CJ inNational Insurance Co of New Ltd v Espagne(supra) at p 573, such payment is `both independent of and cumulative upon whatever right of redress against others might arise out of the circumstances of the accident`.For the reasons given, it seems to us that both the appellant and the respondents had intended that the payment under art 15 is to be made over and above any damages or compensation that the appellant may recover. If the respondents had contracted on such a basis, as we think they had, there is no reason why they should be allowed to resile from their contractual obligation. There is no rule of law precluding an employer from making or agreeing to make a payment to his employee over and above what is recoverable by the latter as damages or compensation for any injury suffered by him.",
        "Conclusion": "For the reasons given, we allow the appeal and set aside the judgment of the learned judge. We vary the order made by the assistant registrar by deleting [para ] 1(i) thereof and substituting for it an order that the appellant, having received the sum of US$420,0000, is entitled to the payment under art 15. The appellant is awarded costs here and before the learned judge. The deposit in court, with interest, if any, is to be refunded to the appellant or his solicitors.Outcome:Appeal allowed.Copyright  Government of Singapore."
    }
}