{
    "case_title": "Parfums Rochas SA and Others v Davidson Singapore Pte Ltd and Another",
    "ncitation": "[2000] SGCA 11",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J; \n      L P Thean JA",
    "sections": {
        "The settlement agreement": "On 13 July 1997, a settlement agreement was reached between the appellants and the first respondents. The settlement agreement provided as follows:a The first respondents were to repay 80% of the outstanding amounts due to each of the three appellants in three monthly instalments starting from 29 July 1997. The remaining 20% was to be paid in three monthly instalments starting from 29 October 1997.b For as long as 80% of the outstanding amount remained unpaid, all fresh orders by the first respondents were to be paid for in full via telegraphic transfer or irrevocable documentary credit, and the total amount of goods ordered in any month should not exceed FF80,000, out of which the total order for `Gucci Envy`, a fragrance for men, should not exceed FF50,000. Furthermore, the first order was not to be made until after the first instalment had been paid.c Once 80% of the outstanding amount had been paid, the first respondents could order up to FF300,000 worth of products on the pre-existing 90-day settlement terms. The appellants would also discuss with the first respondents the terms for the eventual replacement, return or destruction of the latter`s remaining unsold stock.d Once all of the outstanding amounts were paid, all the foregoing restrictions would be lifted and payment terms would be on the usual 90 days` settlement terms.The first respondents took the view that the settlement also governed the appellants` relations with the second respondents, a view not shared by the appellants. In any case, on 10 July 1997, the second respondents` manager  proposed a separate rescheduling of the outstanding amounts due to the second and third appellants in three instalments respectively. He also requested the third appellants to ship their orders for Gucci products upon payment of the first instalment. This proposal was apparently accepted as it was agreed that upon payment of the first instalment to the third appellants, `Gucci Envy` would be shipped but a limit of FF30,000 worth of orders per month was imposed. This was consistent with the approach taken under the settlement agreement with the first respondents. By 20 September 1997, the second respondents had settled the bulk of the amount owed to the third appellants.",
        "The termination notices": "Apparently, the appellants were still dissatisfied with the respondents` performance of their contractual obligations after the settlement agreement and the respondents` new orders for goods were not met. On 8 October 1997, the three appellants each sent separate and identical letters to the first respondents to terminate the distributorship agreement with effect from 31 December 1997. Similar letters were also sent to the second respondents. No reasons for the termination were furnished in the said letters, which merely stated as follows:We hereby give you formal notice of termination of the distribution relationship existing between our company ... and your company ...The termination will be effective on 31 December 1997, and therefore all dealings between our company and yourselves will cease on that date ...Subsequently, the first and second respondents each received a letter dated 17 October 1997, which stated as follows:After having considered your past practices, your conduct to date, as well as the subsequent situation of our distribution network and the important damages already suffered by our brands ..., and after having also reviewed the terms of the written distributorship agreement of December 1993 between ROCHAS and yourselves, our companies Rochas, Muelhens and Scannon are of the view that they are no longer obliged to deliver any further products to you.We are therefore instructed that Rochas, Muelhens and Scannon will not be delivering any further products to you henceforth.In the letter to the first respondents, the appellants also alleged that the first respondents seriously breached the settlement agreement by placing an order for FF80,000 worth of Gucci products without paying for the goods ordered.The appellants appointed a new Gucci distributor, namely, Prestige Products Distribution. New price lists were issued by Prestige to the first respondents` outlets. The price lists were stated to be `effective November 1997`.The timing of the termination of the distribution agreement was unfortunate for the respondents as they had looked forward to increased sales during the forthcoming Christmas season. Faced with the termination of their distribution agreement, the first respondents conducted a warehouse sale of the appellants` products at their own premises at Peace Centre from 28 October 1997 to 8 November 1997. This sale was advertised by the distribution of leaflets to pedestrians. The appellants alleged that this warehouse sale damaged their reputation and gave them an additional ground to terminate their distribution  agreement with the first respondents. Their solicitors duly issued another notice of termination on 11 November 1997.",
        "The suits": "On 16 May 1998, the first respondents initiated proceedings against the appellants and claimed, inter alia, damages for loss of profits resulting from the appellants` wrongful termination of the distribution agreement. The appellants commenced their own suit against the first respondents on 1 July 1998, claiming, inter alia, the remaining sum due to them under the settlement agreement and damages in respect of the first respondents` numerous breaches under the distribution agreement. The second respondents were subsequently added as a party in both suits in respect of disputes over the Malaysian aspect of the distribution agreement. Both suits were consolidated. On 30 June 1998, the first respondents were placed under receivership.BThe decision belowThe learned trial judge held that the appellants had no right to terminate the distribution agreement in October 1997. As such, they were themselves in breach for wrongful termination of their contract with the respondents.The learned trial judge, who accepted that the general terms of the earlier Rochas agreement applied to the comprehensive distributorship agreement between the appellants and the respondents, noted that the appellants` main complaints against the respondents related to the accumulation of substantial arrears in payments and the respondents` failure to meet the agreed sales targets. His honour said that notwithstanding these breaches, the appellants accepted the terms of the settlement agreement on 13 July 1997. By so doing, the appellants affirmed and varied the main agreement. As such, there was a suspension of the sales targets until the settlement terms were implemented. Having elected to deal with the problems relating to arrears in payment and sales targets in this manner, it was no longer open to the appellants to terminate the distribution agreement on the ground of these alleged breaches. His honour also noted that there was a failure on the part of the respondents to tender payment with their order of 3 September 1997 but added that this could not, without more, justify the termination in question. The purported termination of the distribution agreement in 17 October 1997 was therefore wrongful and the appellants were liable in damages to the respondents for the wrongful termination.In respect of the respondents` claim for damages for loss of profits, the learned trial judge took the view that a realistic profit margin should be 15%, instead of the 35% pleaded by the respondents. The loss suffered by the respondents as a result of the appellants` failure to act on the orders placed by the respondents before the termination of the distribution agreement, was thus computed on the basis of a 15% profit margin. In the case of the respondents` claim for damages for loss of profit based on their forecast of the volume of goods which could have been ordered and sold by them had the distribution agreement not been wrongfully terminated, the same profit margin of 15% was adopted for quantification of damages. However, his honour did not think it right that the  damages should be quantified on the basis that the distribution agreement would have run its full course in view of the respondents` unsatisfactory performance, especially with respect to payment for goods ordered. The appellants would probably have taken steps to properly terminate the distribution agreement before it ran its full course. As such, his honour thought that for the purpose of quantifying the damages due to the respondents for loss of profits, it was not unreasonable for him to assume that the contract would run for another 1.5 years instead of 2.5 years and the respondents were awarded damages for loss of profits for only 1.5 years. The amounts outstanding under the settlement agreement were set-off against these awards. The respondents` claim for damages based on loss of goodwill was dismissed for want of supporting evidence.As for whether the appellants were obliged to take back any of the unsold goods from the respondents after the termination of the distribution agreement, the learned trial judge drew a distinction between slow-moving stocks and other stocks. With respect to the slow-moving stocks, his honour thought that the risk of these remaining unsold rested with the respondents and the respondents` failure to clear these stocks was not due to the wrongful termination of the distribution agreement by the appellants. As such, the appellants were not obliged to take back these stocks. However, his honour thought that different considerations arose for the stocks which were not slow-moving for it was the wrongful termination of the distribution agreement that prevented the respondents from selling these stocks. It was a reasonable assumption that these stocks were in a saleable condition at the time of termination. His honour, who noted that the parties` uncompromising positions prevented a sensible solution to the matter, took the view that as the appellants were in a better financial position to take preservation measures and should have done more in this respect, they ought to take back all these goods. His Hhonour thus ordered the appellants to re-purchase from the respondents all unsold stocks excluding slow-moving products at `landed` cost, as defined in the Rochas agreement.Turning to the appellants` claim for damages in respect of the same breaches on which they relied to justify the termination of the distribution agreement, the learned trial judge reiterated that a contracting party is entitled to claim damages for breaches which are not serious enough to warrant a repudiation of the contract. However, in this case, even if the appellants had proven the breaches in question, they had not adduced evidence of the damages suffered as a result of the alleged breaches. As such, the question of awarding anything other than nominal damages did not arise.CThe appealThe questions which arise in this appeal are as follows:(a) Were the appellants entitled to terminate the distribution agreement by reason of the breaches committed by the respondents before 13 July 1997? If so, did the appellants deny themselves the right to rely on these breaches as grounds for terminating the distribution agreement when they became a party to the settlement agreement of 13 July 1997?(b) If the appellants affirmed the distribution agreement by accepting the terms of the settlement agreement, was there any fresh breach of contract after 13 July 1997 that gave the appellants the right to terminate the distribution agreement?(c) If the appellants were not entitled to terminate the distribution agreement, the following questions are relevant for the purpose of quantifying the damages to which the respondents are entitled for the wrongful termination of the said agreement:(i) what was the remaining period of the distribution agreement if it had not been wrongfully terminated by the appellants?(ii) what was the net profit margin of the respondents?(iii) are the appellants entitled to deduct the amount underspent on advertising and promotion from the damages awarded to the respondents?(d) What is the extent of the appellants` duty, if any, to repurchase existing stocks in the hands of the respondents at the date of termination of the distribution agreement?",
        "Whether the respondents were entitled to terminate the distribution agreement in October 1997": "The appellants` case is that they were entitled to terminate the distribution agreement in October 1997 because the respondents seriously breached the distribution contract before the settlement agreement of 13 July 1997 as well as after the date of the said settlement agreement.The breaches which were allegedly committed before the settlement agreement will first be considered. These included the respondents` failure to pay for goods supplied to them as well as their failure to provide regular reports and to spend the agreed amounts for advertising and promotion. As has been mentioned earlier on, the learned trial judge took the view that these breaches cannot be relied upon by the appellants to justify the termination of the distribution agreement in October 1997 because they had, with knowledge of the breaches in question, affirmed the distribution agreement by entering into the settlement agreement on 13 July 1997. The appellants argued that the learned trial judge came to the wrong conclusion because he misconstrued the scope and effect of the settlement agreement. They pointed out that the negotiations which led to the settlement agreement were only concerned with the payment of the outstanding amounts owed to the appellants. As such, the settlement agreement could, at most, merely operate as a waiver of their right to terminate the distribution agreement on the ground that the respondents had consistently failed to pay for the goods ordered. The appellants maintained that they did not give up their right to rely on the respondents` other pre-settlement breaches to terminate the distribution agreement.The appellants also asserted that the settlement agreement could not operate as an affirmation of the distribution agreement with the second respondents since the second respondents were not a party to the said settlement.An innocent party will not be regarded as having affirmed a contract unless he knew of the circumstances giving rise to his right to choose between affirming  the contract or treating it as discharged. Admittedly, the correspondence leading to the settlement agreement focused on the outstanding payments due from the first respondents and cl 3 of the settlement agreement indicated that the consideration for the settlement was the appellants` withholding of legal proceedings to recover the debt in question. However, it must be borne in mind that under the settlement agreement, the appellants, who were entitled to temporarily suspend their obligations regarding the sale and delivery of their products to the respondents until the outstanding sums were paid, were required to fulfil all their contractual obligations once all the outstanding sums had been paid. There were no other qualifications to this resumption of normal contractual relations. The appellants could have expressly reserved their right to terminate the distribution agreement for the other breaches if they had so intended. They did not. In these circumstances, the appellants must be taken to have affirmed their obligations under the distribution agreement and cannot rely on the breaches known to them at the time of the settlement agreement to justify their subsequent termination of the distribution agreement in October 1997.The appellants` allegation that the respondents committed fresh breaches after the settlement agreement of 13 July 1997 will now be considered. Two of the subsequent breaches relied on by the appellants were `continuing` obligations, namely, the respondents` failure to provide the appellants with required reports every month and every semester and the respondents` failure to spend the agreed amounts on advertising and promotion. The appellants also complained that after the settlement agreement, the respondents continued to evince an intention to concentrate on selling `Gucci Envy`, the fragrance for men which was the most profitable product for them, and had no intention of promoting Rochas and Muelhens products. This was contrary to their contractual obligation to promote all of the appellants` products. Finally, the appellants submitted that the respondents` warehouse sale between 28 October and 8 November 1997 was a breach of the respondents` obligation to maintain the international reputation of the products that was serious enough to justify the termination of the distribution agreement. These alleged breaches will be examined in turn.The respondents` obligation to report to the appellants was governed by cl 14 of the Rochas agreement, as incorporated into the distribution agreement. Monthly reports were required ten working days after each calendar month on the sales figures for each line of product for the preceding month, while semesterly reports were required 20 working days after the each semester or when requested at any time by the appellants` managers. The relevant period of reporting relied on by the appellants spanned about three months, from 13 July 1997 to 8 October 1997, when the distribution agreement was terminated. The appellants have not established that the monthly reports were not furnished because the last correspondence concerning the reports was dated 11 April 1997. In any case, it is difficult to see how a failure to provide two or three monthly reports can, in the circumstances of this case, amount to a breach that is serious enough to warrant the termination of the distribution agreement in October 1997.As for the respondents` alleged breaches with respect to expenditure on advertising and promotion, there were two types of required expenditure. The first was expenditure which was pegged to net wholesale sales. Clause 13 of the  Rochas agreement required the respondents to spend not less than 15 percent of net wholesale sales on advertising and promotion. The second type of expenses, known as `extra marketing expenses`, `over-investment` or `over-expenditure`, was to be spent in addition to the amount pegged to net wholesale sales. The amount required for `extra marketing expenses` was fixed at $300,000 for a period of three years from the date of the distribution agreement. This amount was to be spent in accordance with a schedule specified by the appellants, namely, $50,000 in 1995, $100,000 in 1996 and 1997, and $50,000 in the first six months of 1998. The appellants alleged that as at 30 September 1997, the respondents had not spent enough on the first type of advertising and promotion expenses and that nothing had been spent on `extra marketing expenses`. This was denied by the respondents.As far as the first type of advertising and promotion expenses is concerned, it appears from the evidence that the appellants have nothing to complain about. The appellants contended that while the Rochas agreement required the respondents to spend not less than 15% of the net wholesale sales on advertising and promotion, this figure of 15% was no longer relevant because the parties subsequently agreed to increase the amount to be spent on advertising and promotion from 15% to 20-23%, depending on the type of goods ordered by the respondents. The respondents denied that they agreed to any such increase. In the absence of sufficient proof of the alleged increase in the expenditure for advertising and promotion, the terms of the Rochas agreement are applicable. In view of this, the respondents have met the requirement of spending 15% of the net wholesale sales on advertising and promotion since they have, according to the appellants` own figures, already spent 16.1% of the net wholesale sales on such expenses when the distribution agreement was wrongfully terminated.As for the $300,000 which was earmarked as `extra marketing expenses`, it should be noted that the appellants terminated the distribution agreement in the early part of the third year of the distribution agreement. As such, the respondents had the remaining period of the third year to fulfil their obligations with respect to `extra marketing expenses` or `over-investment`. Whether or not they were likely to do so may be questioned but it cannot be denied that at the date of the termination of the distribution agreement, they were not yet in breach even if they had, according to the appellants, a large shortfall to make up for. No evidence was adduced of the first or second respondents` financial position during the relevant period nor thereafter. The respondents may well have arranged for a fresh injection of capital or may have diverted profits from other contracts in order to fulfil their contractual obligations. In view of the paucity of the evidence on these matters, there is no basis at the date of the wrongful termination of the contract to evaluate the likelihood of the respondents` failure to live up to their obligations in relation to the budget for advertising and promotion activities.Finally, in respect of the allegation that the respondents concentrated on selling `Gucci Envy` and neglected the sale and promotion of the appellants` other products, only the orders placed after the settlement agreement are relevant. When faced with the temporary limits on orders imposed by the settlement agreement, it is understandable that the respondents would place orders for `Gucci Envy`, their most saleable and profitable product. This, by itself, does not show that the respondents intended to neglect the rest of the appellants` products during the  remaining period of the distribution agreement. It would be premature in view of all the above-mentioned circumstances to infer that the respondents intended to renounce their contractual obligations under the distribution agreement.",
        "The warehouse sale": "The warehouse sale will next be considered. As the appellants` solicitors issued a subsequent notice of termination on 11 November 1997 in respect of this alleged breach, it is necessary to consider whether or not this warehouse sale was, without more, a sufficiently serious breach to warrant such a termination. The appellants contended that the warehouse sale was fundamentally inconsistent with their selective marketing strategy. They referred to cl 12 of the Rochas agreement, which provides generally for the selective distribution of goods through suitably qualified retailers. Furthermore, cl 12G of the said agreement provided as follows:In order to preserve the principle of selective distribution, which constitutes one of the fundamental points of the Rochas` marketing policies and which the parties acknowledge to be an essential condition of the maintenance and development of the international reputation of Rochas` trademarks and products, agent will make its best efforts to help Rochas to fight against illegal import of products ...Clause 12 of the Rochas agreement does not expressly prohibit such warehouse sales. It is difficult to see how clearance sales on an ad hoc basis by the authorised distributor would necessarily be detrimental to the exclusive image of the products. As for cl 12G of the Rochas agreement, it appears that this provision is directed at parallel imports or counterfeit goods. It ought to be noted that this was not the first time that the respondents conducted a warehouse sale. The respondents, who adduced evidence that other perfume and cosmetics houses also conducted similar clearance sales, pointed out that the appellants had been informed of an earlier warehouse sale on 23 May 1997. The appellants did not see it fit to protest against this earlier sale. The appellants have thus not demonstrated that the warehouse sale in question detrimentally affected the image and reputation of their products and deprived them of substantially the whole benefit of the distribution agreement. It follows that the termination of the distribution agreement cannot be justified solely on the ground that there was a warehouse sale between 28 October to 8 November 1997.",
        "Whether the settlement agreement concerned the second respondents": "As for whether the second respondents are outside the ambit of the settlement agreement, the second respondents insisted that they are implicitly a party to the settlement agreement. It was pointed out that for the purpose of the appointment of the first and second respondents as the appellants` sole distributors in Singapore and Malaysia respectively, there was a single agreement which was reached after an exchange of letters. The terms of the appointment offered to the respondents did not make any distinction between the first and second respondents. The proposed obligation with respect to `extra marketing expenses` or `over-investment` did not distinguish between the two companies or the country concerned. Furthermore, the appellants` conduct after the conclusion of the distribution agreement confirmed that there was a single distributorship contract. For instance, the appellants informed the second respondents on 22 May 1997 that  they could not honour the latter`s order for Gucci products in view of the arrears accumulated by the first respondents. This made no sense unless the distributorship rights for both respondents were governed by the same contract. Again, when the second respondents sought a rescheduling of their outstanding debt, the appellants refused because of the size of the aggregate debt of both the respondents. It should also be noted that para 14 of the appellants` own defence and counterclaim in Suit 738/98 avers that the distribution agreement was a single agreement between all the parties to the appeal. If the appellants` argument that the settlement agreement did not apply to the second respondents is accepted, it would allow the appellants to create two separate contracts, one with the first respondents and the other with the second respondents, when this was not the case from the very start. As such, the appellants must be regarded as having affirmed the whole of their 1995 distribution agreement with the first and second respondents when they accepted the settlement agreement. It follows that the second respondents are within the ambit of the said settlement agreement.",
        "Whether there was proof of the respondents` loss of profits": "For the purpose of determining whether or not the trial judge had sufficient evidence to enable him to quantify the respondents` loss of profits as a result of the appellants` wrongful termination of the distribution agreement, the following words of Bowen LJ inRatcliffe v Evans[1892] 2 QB 524, 532-533 are rather helpful:In all actions accordingly on the case where the damage actually done is the gist of the action, the character of the acts themselves which produce the damage, and the circumstances under which these acts are done, must regulate the degree of certainty and particularity with which the damage done ought to be stated and proved. As much certainty and particularity must be insisted on, both in pleading and proof of damage, as is reasonable, having regard to the circumstances and to the nature of the acts themselves by which the damage is done. To insist upon less would be to relax old and intelligible principles. To insist upon more would be the vainest pedantry.Where precise evidence is obtainable, the court expects to have it but where it is not, the court must do the best it can. InTai Hing Cotton Mill Ltd v Kamsing Knitting Factory[1979]  AC 91, the Privy Council took the view that where it is clear that the plaintiff has suffered substantial loss but the evidence does not enable it to be precisely quantified, the court will assess the damages as best as it can on the available evidence.We are of the view that the learned trial judge`s quantification of the damages payable by the appellants to the respondents should not be disturbed. To begin with, his Honour correctly rejected the respondents` contention that no overhead expenses need be deducted from the 35% profit margin exhibited in the price structures submitted by them. The respondents` argument that expenses such as rental, transportation and staff costs were marginal and that the fixed overhead expenses were in any case constant and covered by the minimum basic turnover of other product lines was clearly off the mark. As such, his honour rightly required the deduction of overhead expenses from the prima facie 35% profit margin.As for the learned trial judge`s conclusion that the respondents` net profit margin for goods which had been ordered before the termination of the distribution agreement as well as for goods which could have been ordered in the future should be reduced from 35% to 15% because of overheads and other expenses, the appellants argued that this figure was arbitrary and that there was no evidence to support it. The learned trial judge found that there was some indication that fixed overheads accounted for around 5% of the plaintiffs` total turnover. His honour also took into account a margin for variable expenses and said that taking everything into consideration, a profit margin of 15% might not be too far off the mark. In our view, the appellants had nothing to complain about because the amount of overhead expenses deducted was on the high side. However, as the respondents did not appeal against the decision of the learned trial judge, his finding with respect to the respondents` net profit margin will not be varied.As for whether the learned trial judge was correct in awarding the respondents damages for loss of profits on goods which could have been ordered and sold by the respondents for 1.5 years, this depends on how long the distribution agreement was intended for and what was the remaining period of the agreement when it was wrongfully terminated. The learned trial judge accepted that the distribution agreement was for a period of five years because the first and second respondents were appointed as distributors for an initial period of three years plus an `automatic renewal for a period of two years`.Much turns on the meaning of `automatic renewal`. The appellants contended that the phrase `automatic renewal`, as used in the correspondence, must be taken as meaning that the distribution agreement would be renewed for a further two-year period if the respondents substantially complied with their other contractual obligations in the first three years. However, the correspondence does not establish such an intention. If the appellants had wanted the contract to run for only three years unless the respondents fulfilled their obligations in the first three years, they should have made this clear in their correspondence with the respondents. In view of this, the appellants` argument, which contradicts the plain meaning of `automatic`, cannot be countenanced. It follows that the learned trial judge was correct in assuming that the distribution agreement was for a period of five years. Furthermore, he was entitled, in the circumstances of the case, to award the respondents damages for loss of profits for only 1.5 years instead of 2.5 years as the contract might not have run its full course of five years because the appellants were obviously not satisfied with the performance of the respondents.",
        "Advertising and promotion expenses and `extra marketing expenses`": "For the purpose of quantifying the damages to which the respondents are entitled for the wrongful termination of the distribution agreement, account must be taken of the respondents` obligation to spend 15% of the net wholesale sales on advertising and promotion and to expend a further $300,000 on `extra marketing expenses` or `over-investment`. Any shortfall in such expenditure represents a saving to the respondents and should be deducted from the damages awarded to them. Such an approach would compensate the respondents for their actual loss. InCommonwealth of Australia v Amann Aviation Pty Ltd[1991] 174 CLR 64, 98, Brennan J explained:The measure of damages prescribed by Robinson v Harman ensures that the parties to the contract are kept to the benefits and the burdens of the contract they have made: the plaintiff recovers no more than the net benefit he would have received under the contract; the defendant acquires no right to profit by his breach. The measure of damages for breach of contract is governed by the contract itself.As has already been mentioned, the respondents have spent more than 15% of the net wholesale sales on advertising and promotion. As such, there is no shortfall in such expenses for the purpose of reducing the damages awarded to the respondents by the learned trial judge. Different considerations arise in the case of the additional $300,000 for `extra marketing expenses` or `over-investment`, which the respondents were required to spend on advertising and promotion. This amount was to be spent over the first three years of the distribution agreement and would have been incurred had the distribution agreement not been wrongfully terminated by the appellants. A shortfall, if any, should be deducted from the damages awarded to the respondents for their loss of profits. We thus order that the amount spent by the respondents on `extra marketing expenses` or `over-investment` be assessed for the purpose of having the shortfall, if any, deducted from the damages awarded to the respondents. Such assessment will be done by the Registrar. For this purpose, any amount spent by the respondents on advertising and promotion which is in excess of 15% of the net wholesale sales may be regarded as `extra marketing expenses` or `over-investment` expenditure.DWhether the appellants are required to take back unsold stocksAs for whether the appellants are obliged to take back the unsold goods remaining in the hands of the respondents after the termination of the distribution agreement, the respondents contended that there was a separate agreement with the appellants to take back old and excess stocks. They also asserted that there was an implied term in the cosmetics industry for such taking back of existing stocks on the termination of a distribution agreement. On the other hand, the appellants contended that their obligation to take back the unsold stocks was governed by Appendix 3 of the Rochas agreement, as incorporated into the distribution agreement with the respondents.The learned trial judge found that the terms of the Rochas agreement were incorporated into the 1995 distribution agreement. Consequently, Appendix 3 of the Rochas agreement, which contained detailed provisions on the appellants` obligations regarding the return of stock held by the agent upon the ending of the contract, was part of the general terms of the distribution agreement. Appendix 3 provides as follows:3 With a maximum delay of thirty (30) days from the end of the contract, agent shall furnish Rochas with the `Final Inventory` established at the end of the contract. The Final Inventory shall include all products and advertising material bearing Rochas` name.4 After reception by Rochas of this Final Inventory list, Rochas shall be entitled, within a maximum period of time of 30 days, to check or have checked by whoever is convenient:a the accuracy of this final inventory, andb the olfactive and visual qualities of the products listed in the said final inventory.5 In case of disagreement between Rochas and agent, either:a on the products to be repurchased by Rochas or,b on their value, both parties shall rely on the decision of an expert appointed by Rochas and agent. Expenses and fees of the said expert shall be equally borne by both parties.6 Rochas shall repurchase, or cause to be repurchased by whomever it designates, from agent merchandises listed on the `final inventory`: types, quantities and prices of products repurchased by Rochas are determined as follows:(A) Products repurchased by RochasFinished products of the price list ... at landed cost. The payment term will be thirty (30) days from invoicing date following delivery ...The above-mentioned products shall be repurchased after they have been tested and deemed satisfactory by Rochas, with regard to the olfactive quality and visual standards required by the same and so far considered as `in saleable condition`.(B) Products not repurchased by RochasThis category relates to the following products:(a) Products which are not on Rochas` price list as hereabove defined;(b) Products on the price list but considered by Rochas as unsaleable due to bad quality of their fragrance or appearance.The afore-mentioned products (b) shall be destroyed by agent at its expenses and shall provide Rochas with proof of the destruction of said products ...8 In case the actual advertising expenses paid by agent, between the end of the last fiscal year and the date of termination of the agreement, are less than fifteen (15) percent of the amount of net sales of the same period, the difference shall be deducted by Rochas from all sums its owes to agent for any reason...Appendix 3 of the Rochas agreement was not, as the respondents contended, inapplicable because of a custom or usage of the trade which required the appellants to take back all unsold stocks, irrespective of condition. Apart from the fact that the alleged custom was not proven, it is clear that a term will not be implied if it is inconsistent with the express terms of the contract. The comprehensive scope of the terms of Appendix 3 leaves no room for any implied term.The Rochas agreement clearly states that Appendix 3 is to apply to the `liquidation of reciprocal obligations at the end of the contract`. As such, Appendix 3 is not limited to a case where the distribution agreement has been properly terminated in accordance with its express terms. The appellants are thus only obliged to repurchase unsold stock which are in saleable condition, as defined in Appendix 3, and which are on the respondents` stock list as at 8 October 1997, the day the distribution agreement was wrongfully terminated. In view of the aforesaid, the order of the learned trial judge with respect to the repurchasing of unsold stocks is set aside and we order the appellants to repurchase unsold stocks from the respondents in accordance with the terms of Appendix 3 of the  Rochas agreement. As for whether any deduction for a shortfall in advertising and promotion expenditure is warranted in respect of the repurchased goods, cl 8 of Appendix 3 expressly limits any set-off for a shortfall in advertising and promotion expenditure to the amount that is less than 15% of the net sales, if any. The figures furnished by the appellants showed that the respondents` advertising and promotion expenditure amounted to 16.1% of net sales. It was not part of the appellants` pleaded case nor was there any evidence that cl 8 has been varied. No set-off is therefore warranted under cl 8 of the Rochas agreement.ECostsAs for costs, the respondents are awarded only one-third of the costs of the appeal. Admittedly, the appellants have not succeeded in their appeal against the learned trial judge`s award of damages in favour of the respondents. However, the learned trial judge`s order with respect to the purchase by the appellants of products in the hands of the respondents at the date of the wrongful termination of the distribution agreement has been varied and an order has been made for the shortfall, if any, in `extra marketing expenses` or `over-investment` to be deducted from the damages awarded to the respondents. In these circumstances, the respondents ought to be awarded only one-third of the costs of the appeal.Outcome:Order accordingly.Copyright © Government of Singapore."
    }
}