{
    "case_title": "Fortune Hong Kong Trading Ltd v Cosco Feoso (Singapore) Pte Ltd",
    "ncitation": "[2000] SGCA 24",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "Background": "The appellants are a Hong Kong company carrying on the business of trade financing, and the respondents are a Singapore company trading in gasoil products. In August 1997, the respondents agreed to supply a cargo of gasoil to a firm in Hong Kong known as Pacific Fond for US$915,000. Pacific Fond arranged for a letter of credit to be opened by the appellants for payment of the cargo. Under the terms of the letter of credit, one set of clean bill of lading had to be presented to the issuing bank. In the event that that bill of lading was not available, the letter of credit provided that a letter of indemnity issued and signed by the respondents would also be acceptable in lieu of the bill of lading. On the respondents` presentation of a commercial invoice together with a letter of indemnity dated 28 August 1997, the bank duly paid the respondents the amount of US$915,000. The bank was subsequently reimbursed by the appellants. However, the cargo was never delivered to the appellants.",
        "English proceedings": "On 30 July 1998, the appellants commenced proceedings against the respondents by way of a writ of summons issued out of the Admiralty and Commercial Registry of the High Court of England and Wales claiming, inter alia, damages in the sum of US$915,000 pursuant to the terms of the letter of indemnity. On 28 August 1998, leave was obtained from the High Court in England to serve the writ out of jurisdiction on the basis that the letter of indemnity was governed by English law and was expressed to be subject to the jurisdiction of the English courts. A concurrent writ was issued on 3 September 1998. The appellants` English solicitors, Sinclair Roche & Temperley, instructed the Singapore solicitors, Colin Ng & Partners, to effect service of the writ on the respondents in Singapore. On 17 September 1998, the process server engaged by Colin Ng & Partners effected service on the respondents by leaving the concurrent  writ and other documents at the respondents` registered office in Singapore in accordance with s 387 of the Companies Act (Cap 50). In other words, the writ was served on the respondents as if it were a writ issued in Singapore.After entering appearance in England, the respondents took out an application to set aside the service of the writ on the ground that the appellants had failed to serve the writ in accordance with O 65 of our Rules of Court. The application came on for hearing before Thomas J, and the issue before him was whether the service of the writ on the respondents was contrary to Singapore law. After hearing arguments of counsel, he formed the opinion that that issue should be determined by the Singapore courts. He said at p 6 of the transcript:It seems to me that the better suggestion would be to suggest to the parties, as I have done in the course of argument, that they might wish to consider asking the High Court of Singapore to decide itself the proper meaning of the Rules of that court. It seems to me invidious for this court to determine that question, conscious of the fact that it cannot have either the depth of experience or knowledge that the courts of Singapore have, as to their own procedures and the meaning of the Rules of their court. It seems to me that if a procedure is available in Singapore (and I am told by the defendants that it is) for this short issue to be decided by originating summons in Singapore, then that is, in my view, a much better way of the issue being resolved at much less expense to the parties than the matter being restored by the alternative route suggested or for the consideration of further expert evidence.It seems to me that as a matter of comity and a matter of the great respect that these courts hold for the courts of Singapore, that it is, if at all possible, infinitely preferable for this very short point to be decided in the courts of Singapore. I cannot imagine that this point on the meaning of the Rules of the Supreme Court of Singapore could take more than a very, very short time for decision in Singapore, because the answer is either well established in the practice of the courts, or can be decided expeditiously as a short point on the construction of O 65 of the Rules of the Singapore Supreme Court, a provision which does not have a corresponding provision in the Rules of this court.Accordingly, the learned judge adjourned the hearing of the application for the parties to proceed with an application to the High Court in Singapore to determine whether the service of the writ on the respondents was valid.",
        "Proceedings in Singapore": "Following from the decision of Thomas J, the appellants commenced proceedings by way of an originating summons on 9 June 1999 for a declaration that the service of the writ effected on the respondents by the appellants` solicitors in Singapore was valid. It is common ground that there is no Civil Procedure Convention subsisting between Singapore and the United Kingdom. There was evidence adduced by the appellants to the effect that the Foreign Process Department of the High Court of England and Wales would not issue a letter of request for the service of a writ in Singapore. It is also common ground that no letter of request was issued by the High Court of England and Wales and sent to the Ministry of Law pursuant to O 65 r 2 of our Rules of Court.It is evident from the affidavits filed on behalf of the parties that there is no consistent view amongst members of the Bar in Singapore on the proper mode of service of English process in Singapore. Mr Winston Kwek of Colin Ng &  Partners in his affidavit in support stated that O 65 r 2 does not provide that a letter of request from the foreign tribunal is mandatory before service of the foreign process can be effected in Singapore. In the absence of such a letter, the foreign process can be validly served in accordance with O 10 r 1 or s 387 of the Companies Act (Cap 50), as the case may be. There was also filed an affidavit deposed to by Mr Richard Kuek Chong Yeow of Gurbani & Co, in which he said that he had served foreign process in Singapore on previous occasions in the same way as he would have served a local writ and he had never obtained a letter of request from the foreign tribunal. According to him, such a view was also shared by another member of the Bar, Mr Steven Chong SC.On the other hand, Ms Corinna Susan Cresswell of Clyde & Co, the firm of solicitors representing the respondents, stated in her affidavit that she had been advised by Mr Goh Kok Leong of Ang & Partners that service of foreign process within Singapore is an encroachment upon the sovereign rights of Singapore and is therefore only permissible, if it is effected with the consent of the official authorities. She submitted that O 65 r 2 requires a letter of request to be sent by the English High Court to the Minister for Law in Singapore. In the absence of such a letter of request, the service of foreign process would not be in compliance with O 65 r 2 and therefore would be invalid. In an affidavit filed by Mr Andrew Lloyd Bicknell, another solicitor of Clyde & Co, there was exhibited a written opinion given by Mr Kenneth Tan SC, who is also of the view that service of foreign process must comply with O 65, and that service of such process through a Singapore solicitor is inadequate.The learned judge below [see [2000] 1 SLR 633] was of the opinion that O 65 sets out two procedures for effecting service of foreign process: the first is under r 2 and the second is under r 3. The procedure under r 3 is irrelevant, as it deals with service of foreign process where there subsists a Civil Procedure Convention between Singapore and the foreign country concerning the service of such process. There being no such convention between Singapore and the United Kingdom, the procedure under r 2 is the relevant one. He held that service of foreign process in Singapore must comply with O 65, there being no other statutory provision governing the service of foreign process. Insofar as the appellants had failed to comply with O 65 r 2 in effecting the service of the writ on the respondents in Singapore, the writ was not validly served on the respondents in Singapore.",
        "The appeal": "The central issue in this appeal concerns the ambit of O 65 of the Rules of Court and the extent to which it governs the service of foreign process in Singapore. Order 65 by rr 2 and 3 provides for two separate procedures for effecting service of foreign process in Singapore, depending on whether there subsists a Civil Procedure Convention between Singapore and the foreign country concerning the service of process. Order 65 r 3 provides a procedure to be applied where there subsists such a Civil Procedure Convention, and is not applicable here, as there is no such Civil Procedure Convention subsisting between Singapore and the United Kingdom. Order 65 r 2 is the relevant one which we  need to consider. It provides a procedure for service of foreign process through the Supreme Court of Singapore, and the material provisions are as follows:(1) This Rule applies in relation to the service of any process required in connection with civil proceedings pending before a court or other tribunal of a foreign country where a letter of request from such a tribunal requesting service on a person in Singapore of any such process sent with the letter is received by the Minister and is sent by him to the Supreme Court with an intimation that it is desirable that effect should be given to the request.(2) In order that service of the process may be effected in accordance with this Rule, the letter of request must be accompanied by a translation thereof in English, two copies of the process to be served and two copies of the translation of the process in English.(3) Subject to paragraph (4) and to any written law which provides for the manner in which documents may be served on a body corporate, service of the process shall be effected by leaving a copy of it and of the translation with the person to be served.Service shall be effected by the process server.Under r 2(6), the Registrar is required to give a certificate in the form prescribed in Form 144 stating, inter alia, that the service was effected in accordance with the Rules of Court or, if such be the case, that service of the process could not be effected for the reason specified in the certificate.The essence of the appellants` contention is that the provisions of O 65 are not exhaustive and all-encompassing. In particular, not all foreign processes issued by non-convention countries must be effected in accordance with the procedure prescribed in O 65 r 2. On a plain and ordinary reading of O 65 r 2, the procedure set out there applies only where a letter of request for service is received by the Minister for Law and forwarded to the Supreme Court. In this case, given that there is no letter of request from the High Court of England and Wales, O 65 r 2 is inapplicable. That being the case, the foreign plaintiff is permitted to serve the foreign process in Singapore as if it were a local process. Thus, the service of the English writ on the respondents effected by the process server of Colin Ng & Partners in accordance with s 387 of the Companies Act by leaving the writ at their registered address is valid.On the other hand, the respondents` contention is that the act of service of a foreign process in a foreign country is an encroachment upon the sovereignty of that country, which can only be done with the consent of the country. Hence, the service of foreign process must go through the official channels. Order 65 is the only provision expressly regulating the service of foreign process in Singapore, and the provisions contained therein are exhaustive and the procedure set out there must be complied with. As for s 387 of the Companies Act, that is a piece of domestic legislation, and is not applicable to service of foreign process in Singapore.",
        "Extent of O 65 r 2": "Order 65 of our Rules of Court is derived from and is identical in all material respects with O 69 of the Rules of Supreme Court of England and Wales (`RSC`) prior to the latter being amended in 1980. The pre-1980 O 69 of the RSC (like our present O 65) draws a distinction between the service of process under a Civil  Procedure Convention and service of process issued by non-convention countries. The commentary on the pre-1980 O 69 r 2 in the 1979 edition ofThe Supreme Court Practicestates, at para 69/1-5/1:Scope of Rule 2. This Rule applies only where a letter of request is sent from the foreign Court or tribunal through official channels to the Supreme Court for service here. Where process is sent from non-convention countries abroad to be served here by means other than official channels, there is no rule which enables an English Court to grant a certificate that service has been effected in accordance with the requirements of English law.One of the main changes that have been made to O 69 is to assimilate the two procedures to be followed regardless of whether the written request for service emanated from a non-convention country or from a convention country. The current O 69 r 2 provides that the Order applies to the service of foreign process in England, where the senior master receives a written request for service from a foreign court or tribunal. The learned editors of the 1999 edition ofThe Supreme Court Practiceexpress the view that the practice regulating service of foreign process was revised `with a view to making such practice more simple, speedy and economical and in accordance with the modern times`. At para 69/4/2 of the 1999 edition ofThe Supreme Court Practice, the commentary states, inter alia, the following:It equates the method of service of foreign process for requests received by the Senior Master for such service emanating from a non-convention country through the Secretary of State for Foreign and Commonwealth Affairs and from a consular or other authority of a convention country, whether it be a country with whom a bilaterial [sic] convention or the multi-lateral convention, known as `the Hague Convention`, exists.Reverting to the instant case, the learned judge below, in construing O 65 r 2, said at [para ] 6 of his grounds of judgment:Order 65 is similar to the English O 69. The editors of the 1999 edition of theWhite Bookmakes the following comment: `It equates the method of service of foreign process for requests received by the Senior Master for such service emanating from a non-convention country through the Secretary of State for Foreign and Commonwealth Affairs ...` This is a significant departure from their previous view that O 69 applies only when a letter of request from a foreign tribunal is received (see the 1979 edition). In my view, O 65 r 2(1) should not be read literally. It is a provision which involves the service of a foreign process, and, understandably, any rule which sets out directions as to how a foreign process may be served in this country is likely to be phrased diplomatically. Thus, rather than bluntly directing that a foreign tribunal shall send a letter of request through the Minister in Singapore, in order to effect service of process emanating from that tribunal, O 65 is worded in a way in which the method of serving a foreign process is `equated` with the letter of request.With respect, we think that the learned judge had misread the commentary in the 1999 edition ofThe Supreme Court Practiceon O 69 of the RSC. That commentary has to be understood in the context of O 69 then in force which was different from that in force in 1979. In our view, there is no `significant departure from their previous view that O 69 applies only when a letter of request from a foreign court or tribunal is received`, as stated in the 1979 edition ofThe Supreme Court Practice. With respect, the commentary in the 1999 edition ofThe Supreme  Court Practice(quoted above) does not support the learned judge`s conclusion that `the method of serving a foreign process is \"equated\" with the letter of request`.In our opinion, the learned judge`s construction of O 65 r 2, with respect, ignores the express provisions therein. Giving the rule its plain and ordinary meaning, we are firmly of the opinion that the rule applies onlywherea letter of request for service from a foreign court or tribunal is received by the Minister for Law and is subsequently sent by him to the Supreme Court with an intimation that it is desirable that effect should be given to the request. In cases where no such letter of request is received, r 2 simply has no application. A similar view to this effect is stated in the 1979 edition of TheSupreme Court Practiceon O 69 r 2 of the RSC then in force, which we have quoted earlier. It seems to us that O 65 r 2 is not intended to govern the service ofallforeign processes in Singapore issued by the courts or tribunals of non-convention countries. The question we need to consider now is what procedure there is, which has been provided for service of foreign process emanating from a court or tribunal of a non-convention country, in the absence of a letter of request from the court or tribunal. If no such procedure has been provided, does it follow that the foreign process cannot be served in Singapore as submitted by counsel for the respondents? We think not.",
        "English procedure": "In considering this issue, it is helpful to consider the relevant provisions of O 11 of the RSC currently in force in England. In this connection, the appellants have placed much emphasis on the fact that the High Court in England would not issue a letter of request for service of an English writ in Singapore in the light of O 11 r 5 read with r 6 of the RSC. Order 11 r 5 of the RSC is a general provision governing the service of writ abroad and the wording of the sub-rules are very similar to, though not identical with, our O 11 r 3. Order 11 r 5 of the RSC provides as follows:(2) Nothing in this rule or in any order or direction of the Court made by virtue of it shall authorise or require the doing of anything in a country in which service is to be effected which is contrary to the law of that country;(3) A writ which is to be served out of the jurisdiction -(a) need not be served personally on the person required to be served so long as it is served on him in accordance with the law of the country in which service is effected; and(b) need not be served by the plaintiff or his agent if it is served by a method provided for by rule 6 or rule 7.Order 11 r 6 of the RSC deals with the service of the writ abroad through foreign governments, judicial authorities and British consuls. By virtue of r 6(1), save in cases where the Hague Convention applies, r 6 does not apply to service in -(a) Scotland, Northern Ireland, the Isle of Man or the Channel Islands;(b) any independent Commonwealth country;(c) any associated state;(d) any colony;(e) the Republic of Ireland.The learned editors of the 1999 edition ofThe Supreme Court Practice, at para 11/6/2, express the view that if the country in which service is to be effected is an independent Commonwealth country, service cannot be effected through `official channels`, namely, through the government or judicial authority or a British consular authority, and may be effected by the plaintiff or his agent direct. This position was also confirmed by the Senior Master of the Supreme Court of England and Wales in his letters: two dated 1 June 1999 and 8 October 1999 both addressed to Sinclair Roche & Temperley and the third dated 12 October 1999 addressed to the learned judge. He explained that Commonwealth countries are not regarded as `foreign` for the purposes of service of judicial process and are therefore not subject to the `regulatory and bureaucratic process required of foreign countries when dealing with service of process`.It should be borne in mind that O 11 of the RSC merely prescribes the modes of service out of jurisdiction which would be recognised by the English courts as valid service for the purposes of English law. That per se does not determine what is regarded as proper service of a foreign writ in the place of service. The leave to serve out of jurisdiction is subject to the general qualification contained in O 11 r 5(2), which provides that such service must not be contrary to the law of the country where the service is to be effected. Hence, even if the service by a private agent complies with the English procedure, the question still remains whether the service of foreign process by a private agent is contrary to Singapore law.However, the English practice in this regard does illustrate the difficulty with the respondents` interpretation of O 65 r 2 as an exhaustive and all-encompassing provision. If it is held that in Singapore a letter of request is mandatory, a startling result would arise: English writs can never be served in Singapore. It is not inconceivable that there will be other jurisdictions, apart from the United Kingdom, having procedural laws which provide for service of process abroad to be effected by a private agent, as provided by the RSC.",
        "Sovereignty argument": "The main contention urged upon us by counsel for the respondents is that service of foreign process in Singapore is an encroachment upon the rights of sovereignty of Singapore and that such service can only be effected through official channels and not by a private agent. In support, he relies on the following cases:The Sky One; Ferrarini SpA & Ors v Magnol Shipping Co Inc[1988] 1 Lloyd`s Rep 238,Sunkyong International Inc v Malaysian Rubber Development Corp Bhd[1992] 2 MLJ 146,Ong & Co Pte Ltd v Chow YL Carl[1987] SLR 304[1987] 2 MLJ 430andUnited Overseas Bank Ltd v Wong Hai Ong[1999] 1 MLJ 474. We need to consider these cases in some detail.InThe Sky One, the plaintiffs were granted leave by the English courts to serve a writ out of jurisdiction for a maritime claim. Service was effected on the president of the defendant company in Switzerland. The defendants applied to set aside the writ on the ground that the service was improper under Swiss law. Under art 271 of the Swiss Penal Code, it is an offence for any person who without due authority acts for a foreign state within Swiss territory when such acts are within the competence of the constituted authorities. Such an offence is punishable with  imprisonment and in serious cases, with solitary confinement and hard labour. The main issue was whether the service of a foreign process in Switzerland by a private agent is an act done `for a foreign state` in breach of art 271. Having considered the expert evidence tendered on Swiss law, Staughton J (as he then was) held that private service of an English writ would, in Swiss law, be considered an act for a foreign state and therefore a breach of art 271. This is because the writ conveys to the defendant the command of the sovereign of the United Kingdom to appear in the English court. The learned judge said at p 243:In my judgment, private service of an English High Court writ would, in Swiss law, be considered an act for a foreign state and therefore a breach of art 271, since it conveys to the defendant the command of the sovereign of the United Kingdom (once expressly included in the writ, now tacit) to appear in the English court. I prefer the evidence of Dr Arnold and the authorities which he cites to that effect. Court proceedings can be contrasted with a request for arbitration pursuant to the private contract of the parties, which would not be prohibited by art 271, at all events unless the arbitration rules made some special provision that was relevant to the point.I therefore hold that service of the writ by Dr Rossi was a breach of Swiss law. By reason of O 11 r 5(2), it cannot be held to have been authorised by the order of Mr Justice Turner.Accordingly, the learned judge`s conclusion was that the service was not proper as it contravened Swiss law.In our view, this case has no direct relevance because it essentially involves the interpretation of the phrase `act for a foreign state` for the purposes of determining the ambit of art 271 of the Swiss Penal Code. It does not stand for the general proposition that all foreign processes must be served through official channels. In fact, Staughton J himself recognised that the service of an English process in a foreign country by a private agent is acceptable under English law but for the fact that Swiss law did not permit such a method of service: see p 240 of his judgment.InSunkyong International Inc v Malaysian Rubber Development Corp Bhd, the plaintiff brought an action for breach of contract of sale of rubber gloves allegedly bought by the local defendant as agent for the foreign defendant. The local defendant obtained an order for leave to issue and serve a third party notice out of jurisdiction on the foreign defendant through the local defendant`s agents in the United States of America. The foreign defendant applied to set aside the order on the ground, inter alia, that the method of service of the notice of writ provided in the order was invalid. It was held by the Supreme Court of Malaysia that as there did not subsist a Civil Procedure Convention between Malaysia and the United States, O 11 r 6(2) of the Rules of the High Court 1980 applied and that the service of the notice of the writ would have to be effected through the Government of the United States or through the Malaysian consular authority, contrary to what was ordered and carried out in that case. Thus, the Supreme Court set aside that part of the registrar`s order providing for service on the foreign defendant by the agents of the local defendant. In the course of delivering the judgment of the court, Peh Swee Chin SCJ said at p 151:As regards the particular procedural point mentioned at the outset, it concerns the actual method of service of the notice of the writ out of jurisdiction after an order of service out of jurisdiction is granted. This is provided by O 11 r 6 in particular, depending on  whether or not there subsists the Civil Procedure Convention in that foreign country where the service out of jurisdiction is intended to be effected. In the instant appeal, it was common ground and we accepted that in the USA, there did not subsist the Civil Procedure Convention, therefore O 11 r 6(2) applied. The service of the notice of writ herein would have to be effected through the Government of the USA or through our Malaysian consular authority contrary to what was ordered and done in this case, as stated above.The rationale behind this prescribed method of service is of course that our courts do not exercise their judicial powers beyond their territorial limits, and further service of judicial process in a foreign country, to use the grave words of Lord Denning inAfro Continental Nigeria Ltd v The Meridian Shipping Co SA[1982] 2 Lloyd`s Rep 241, 244 is an exercise of sovereignty in that country, which can only be done with the consent of that country.Ong & Co Pte Ltd v Chowwas decided by our High Court in the context of our O 11 of the Rules of Supreme Court 1970 then in force. In that case, the plaintiffs obtained leave to issue a writ against the defendant and to serve the notice of the writ on him in Malaysia. The notice was served on the defendant by a process server of a firm of solicitors practising in Malaysia. The defendant applied to set aside the service of the notice on the ground that it could not be effected by a private agent. It was held the service of the notice of the writ must comply with either O 11 r 5(8) or r 6(2). Order 11 r 6(2) essentially provides for service (i) through the government of that country; or (ii) through a Singapore consular authority in that country. Rule 5(8) sets out an additional method of service through the judicial authorities of Malaysia or Brunei Darussalam, where the defendant is in one of these countries. Chan Sek Keong JC (as he then was) rejected the plaintiffs` argument that the use of the expression `may` in both the rules gave them a choice of procedure. In his opinion, the service of a writ is an exercise in judicial power and such judicial power cannot be extended or exercised in another independent State except with the consent of that State because it encroaches upon the sovereign rights of the other State. The learned judge said at p 431:... the judicial power of one State cannot be extended or exercised in another independent State except with the consent of that State. The reason is that it encroaches upon the sovereign rights of the other State. As was said by Lord Denning inThe Vrontados; Afro Continental Nigeria Ltd v Meridian Shipping Co SA[1982] 2 Lloyd`s Rep 241, 245:`... service of a writ out of jurisdiction is an exercise of sovereignty within the country in which service is effected. It can only be done with the consent of that country. That is why our rules provide for service through the judicial authorities of that country or through a British Consular authority in that country, see. RSC O 11 rr 5(5) and (6).`The first thing to note is that bothSunkyongandChowinvolve the interpretation of the respective provisions governing the service of process out of jurisdiction and they do not concern the interpretation of O 65 or its Malaysian equivalent. It appears to us that the primary concern of the judges in these cases was that the procedure set out in O 11 prescribing the methods of service of process in a foreign jurisdiction must be strictly adhered to. Understandably, they were sensitive to the possibility that the foreign state might view such a service of process as being an encroachment upon its sovereign rights.What counsel for the respondents now seeks to do is to extrapolate a general principle from these cases to say that service of process on a foreign state must always be effected through official channels. To be more precise, his argument is that the service of any foreign process in Singapore would be an encroachment upon the sovereignty of Singapore, unless such service is effected through an official channel. We do not think that the principles enunciated in those cases necessarily lead to such a conclusion. Ultimately, it would depend on whether the country, where the service of process is to be effected, treats the service of process by a private agent as an encroachment upon its sovereign rights.In 1991, among other things, O 11 was extensively amended. One of amendments made was to allow a method of service of process in Malaysia or Brunei Darussalam which does not involve the official authorities. With respect to defendants in Malaysia or Brunei Darussalam, apart from service through the foreign judicial authorities, O 11 r 3(8)(a) (as amended) permits a method of service in accordance with O 11 r 4; and r 4 by para (2)(c) provides that service of process in a non-convention country may be effected by a method of service authorised by the law of that country for service of any originating process issued in that country. Thus, by virtue of r 4(2)(c), a plaintiff who has commenced an originating process in Singapore may effect service of that process in Malaysia or Brunei Darussalam as if it were issued there, subject of course to the applicable laws there.This amendment, however, gave rise to some difficulty on the issue of service of a Singapore writ in Malaysia, which surfaced in the Malaysian case ofUnited Overseas Bank Ltd v Wong Hai Ong. There, the plaintiff commenced an action in the Singapore High Court for the recovery of a debt owed by the defendant. The writ of summons and statement of claim were served personally on the defendant in Kuching by the plaintiff`s agent. Subsequently, judgment in default of appearance was entered against the defendant in Singapore and the judgment was registered in the High Court of Sabah and Sarawak. Following that the defendant sought to set aside the registration of the judgment. One of the grounds relied on was that he had not been served with the writ in accordance with O 65 r 2 of the Rules of the High Court 1980 (which is identical with our O 65 r 2). Ian Chin J held that O 65 only applies where there is a letter of request for service from the foreign tribunal. Since there was no letter of request from the Singapore court, he had to consider whether service of foreign process by a private agent was sufficient. He relied on Sunkyong (supra) and held that service of a foreign process by a private agent in Malaysia would encroach on the sovereignty of Malaysia and therefore service of a Singapore process must go through the official channels prescribed under the rules. He referred to O 11 r 4(c) of the Singapore Rules of Court and said at p 483:... this Singapore O 11 r 4 is similar to the Malaysian O 11 r 6 except that it provides, with regard to countries like Malaysia and Singapore (which do not subscribe to a Civil Procedure Convention), for an additional method of service, viz `by a method of service authorized by the law of that country for service of any originating process issued by that country`. It is this additional provision that is relied upon as authorizing the service by a private agent (instead of through the judicial officer) which method when employed for the service of Malaysian legal process in a foreign country had been held  bySunkyong International Inc v Malaysian Rubber Development Corp Bhdto be invalid as it amounted to the exercise of judicial power beyond its territorial limit.The learned judge thus concluded that the service was invalid, and he set aside the registration of the judgment.That case clearly supports the contention of counsel for the respondents that service of foreign process in Singapore is an encroachment on Singapore sovereignty, unless it is effected through an official channel. However, there is one material aspect of the matter which appears to us to have escaped counsel`s attention. Historically, a writ means a judicial order. Prior to June 1981, a writ issued by the High Court of England and Wales, by its very terms, was issued in the name of the sovereign and tested or witnessed by the Lord High Chancellor and contained a command addressed to the defendant to cause an appearance to be entered within a prescribed time. For that reason, for service out of jurisdiction with leave of the court under O 11 of the RSC (except for service in Scotland, Northern Ireland, the Isle of Man and the Channel Islands), only a notice of the writ, and not the writ itself, was issued for service. In 1981, the form of writ was substantially amended, both in form and content, to take effect as from June 1981, and the new form of writ omitted all reference to the sovereign, thetesteof the Lord High Chancellor and the imperial command to the defendant. In substance, it carried a notification of the action that had been commenced against the defendant and a requirement that the defendant enter an appearance within a prescribed time. In view of these changes, the process of issue and service of the notice of the writ out of jurisdiction was abrogated. The commentary in the 1982 edition ofThe Supreme Court Practiceat para 6/1/1C at p 36 states:[T]he omission of the Royal Command from the Form of the Writ of Summons has made it compatible with international comity to allow service out of the jurisdiction of a copy of the writ itself, instead of requiring such service to be effected under the guise of a `notice of the writ\", so that O 11 r 3, infra, which provided for leave for service of notice of the writ out of the jurisdiction (except in Scotland, Northern Ireland, the Isle of Man and the Channel Islands) has been revoked and the prescribed form of such notice, ie Form No 6 in App A and Form No 2A in App B have also been revoked (see RSC (Amendment No 4) 1980 (SI 1980 No 2000).Similarly, our form of writ was until 1991 issued in the name of the President of the Republic of Singapore and tested or witnessed by the Chief Justice and was in the form of a command addressed to the defendant to cause an appearance to be entered. For service of process out of jurisdiction with leave of the court under O 11, only a notice of the writ, and not the writ itself, was issued for service. In 1991, very substantial amendments were made to our Rules of Supreme Court 1970, and the amendments came into force on 1 February 1992. One of the amendments made was to the form of the writ. It was amended along a similar line as in England in 1981, and the notice of the writ for issue and service abroad was dispensed with. Our writ in the present form is no longer structured in the form of a command to the defendant and does not contain any reference to the President of the Republic of Singapore and is not tested or witnessed by the Chief Justice. In its present form, the writ is more of a notification to the defendant that an action has been commenced against him in the court in Singapore than a command to him issued by the court. It seems to us that this change in the content of the writ has  made it `compatible with international comity to allow service out of jurisdiction` of the writ: (per the commentary at para 6/1/1C of the 1982 edition ofThe Supreme Court Practice). In its present form, the writ has lost its meaning of a judicial order, and it can hardly be contended that the service of our writ abroad would interfere with or encroach upon the sovereignty of the country in which the writ is served.In our judgment, the service of foreign process in Singapore need not invariably go through official channels. As we have held, it clearly could not have been intended that O 65 r 2 should be an exhaustive and all-encompassing provision governing the service of all foreign processes in Singapore. Order 65 r 2 applies only where a letter of request for service from a foreign court or tribunal is received by the Minister for Law and is subsequently sent by him to the Supreme Court with an intimation that it is desirable that effect should be given to the request. Where no such letter of request is received, r 2 has no application.",
        "Procedure in the absence of a letter of request": "We now turn to consider what the proper procedure is for service in Singapore of a foreign process emanating from a court or tribunal of a non-convention country, where there is no letter of request from the court or tribunal, as in the present case. On this issue, we find instructive to have regard to O 11 r 4(2) of our Rules of Court which provides:Where in accordance with these Rules an originating process is to be served on an a defendant in any country with respect to which there does not subsist a Civil Procedure Convention providing for service in that country of process of the High Court, the originating process may be served -(a) through the government of that country, where that government is willing to effect service;(b) through a Singapore consular authority in that country, except where service through such an authority is contrary to the law of that country; or(c) by a method of service authorised by the law of that country for service of any originating process issued by that country.Thus, by para (c), our own rules allow for service abroad of our legal process by the method of service authorised by the law of that country for service of originating process issued by that country, provided of course such method of service of our process is not contrary to any law of that country. This provision is another strong indication that we do not regard the service of process in a foreign jurisdiction as an encroachment upon the sovereignty rights of that country so long as it is served in accordance with any method of service authorised by its local laws for service of its originating process. If Singapore does not insist on service out of jurisdiction through official channels, it could not have been the intention of O 65 r 2 that service of all foreign process in Singapore must be effected through the official means as provided in that rule.It appears that a fairly liberal approach towards service of foreign process is adopted in England. Significantly, O 69 is not considered as exhaustive, and foreign plaintiffs are permitted to serve their process by other means including through their local agents in England. InPark & Cromie: International  Commercial Litigation(2nd Ed, 1997), after setting out the procedure for formal service under O 69 upon the receipt of a letter of request from a foreign court or tribunal, the author notes at p 452 that there are other methods of service:England does not object to the use of consular or diplomatic channels for effecting service in England. Process may also be sent by post direct to a defendant in England. There is no equivalent to huissiers or judicial officers in England, so that all service by English authorities must go through the Foreign Office or High Court. It is however quite normal for foreign process to be served from within England by the plaintiff`s agent there, usually his solicitor.We should add that quite apart from the fact that there is no clear principle of law in Singapore requiring all foreign process to be served through official channels, there does not appear to be any sound policy reason why we should require foreign litigants to comply with the more cumbersome formal procedure for service under O 65. In this regard, it is important not to lose sight of the purpose of service of process, whether it be a foreign or local process. Essentially, it is to notify the defendant of the proceedings that have been commenced against him, and in our view, a more pertinent consideration is whether the method of service employed by the plaintiff is sufficient to bring to the attention of the defendant such proceedings and not whether the service is effected through the official means.In our judgment, in the case of service of the foreign process emanating from a court or tribunal of a non-convention country, where no letter of request is issued by such court or tribunal, the service should be effected by personal service on the defendant in accordance with O 10 r 1, read with O 62 and, in the case of a body corporate, read with the relevant provisions of the Companies Act (Cap 50). Although these rules by their express terms apply only to an originating process issued locally, we see no reason in principle why that mode of service prescribed for service of an originating process issued in Singapore cannot and should not be followed and adopted in the absence of any rule of procedure to the contrary. This mode of service fulfils, at least, the vital function of service of legal process.Counsel for the respondents seeks to impress upon us that such a conclusion would effectively render O 65 r 2 nugatory, as foreign litigants would prefer to effect the service of foreign process through private agents instructed by them rather than through the Supreme Court. Such a conclusion is premised on the fact that a foreign litigant can comply with the service requirements of the foreign jurisdiction by not serving through official channels. This is not necessarily the case. One cannot readily assume that all foreign jurisdictions would accept service of process by private agents as being proper. Order 65 r 2 therefore remains a facilitative provision which sets out an official channel for service of foreign process through the Singapore courts if the foreign jurisdiction requests for such service to be effected.It should also be noted that if the foreign jurisdiction requires a certificate from our courts stating that service was effected in accordance with Singapore law, the foreign plaintiff would have to proceed under O 65 because there is no other provision in our Rules of Court which allows the court to furnish such a certificate where the service is effected by a private agent. This view is echoed by  the editors of the 1979 edition ofThe Supreme Court Practicewhich we have quoted earlier. Thus, without a letter of request, no certificate on the due service of the foreign process can be furnished under the Order.",
        "Conclusion": "In our judgment, the respondents were duly served with the writ at their registered office, and the service was proper and valid in accordance with Singapore law. Accordingly, the appeal succeeds and we set aside the order below. The appellants will have their costs here and below. The deposit in court as security for costs is to be refunded to the appellants with interest, if any.Outcome:Appeal allowed.Copyright © Government of Singapore."
    }
}