{
    "case_title": "Miller Freeman Exhibitions Pte Ltd v Singapore Industrial Automation Association and Another",
    "ncitation": "[2000] SGCA 50",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "The issues": "In this appeal, the issues before us are as follows:(a) whether the Association was rightly sued;(b) whether the sale by the Association of 80% of their rights in the IA exhibitions to Messe Dusseldorf constituted a breach of the management agreement;(c) whether the appellants had mismanaged the IA 97 exhibition; and if they had, whether that was sufficient to justify the summary termination of the management agreement by SIAA;(d) whether the appellants and the respondents were partners;(e) whether Logistics Asia 98 was a competing exhibition to IA 99; and(f) if so, whether there was any breach by the appellants of the management agreement.",
        "The party to be sued": "The first issue is whether the Association was rightly sued by the appellants. It is the case of the appellants that the Association and SIAA were one and the same party or alternatively that SIAA, at all material times, acted as the agent of the Association. In support, the appellants rely on the following facts:(1) SIAA is a company with a paid up capital of only $2 and both the issued shares are held by the Association;(2) SIAA shared the same office address and had the same officers as the Association;(3) the appellants always dealt with the Association and not SIAA. This can be seen from the fact that most of the correspondence between the two parties were written on the letterhead of the Association;(4) the Association had authorised SIAA to be its agent in organising the IA exhibitions, as can be seen from the statement contained in the recital to the management agreement;(5) the Association was the `head and brain of the trading venture` and it was the controlling mind behind SIAA; and(6) the Association admitted that it was a party to the management agreement when they described themselves as such in the sale and purchase agreement made with Messe Dusseldorf.Counsel for the appellants therefore submits that all these facts show that the Association and SIAA were one and the same entity or alternatively that SIAA was the agent of the Association.On the other hand, the respondents` case is that the Association and SIAA were separate legal entities and the Association was wrongly sued. The whole purpose of the Association in incorporating SIAA was to form a separate entity to take over the Association`s liability for the organisation of the IA exhibitions. It had always intended to use the new entity as a commercial vehicle to manage and run the exhibitions. There was no express authorisation given by the Association to SIAA to act as its agent and the management agreement was entered into by SIAA in its own capacity. The respondents explain that the use of the Association`s letterhead was only for the sake of convenience, and as for the point that the Association and SIAA shared the same officers and offices, that was irrelevant. With respect to the `head and brain of the trading venture`, the respondents rely on cl 3.3 of the management agreement under which the management of the exhibitions or shows vested in a committee consisting of three members from SIAA and three from the appellants with the chairman of the committee, who was to be the representative of the SIAA, having a casting vote. The council members of the Association were only consulted on important decisions to be taken as the owners of the IA exhibitions.In the court below, the learned judge held that the parties to the management agreement were SIAA and the appellants, and the Association was not a proper party to the action. She did not accept that the Association and SIAA were one and the same party; nor did she accept that SIAA was the agent for the Association in relation to the management agreement. She said at [para ] 45:In my view there was no basis at law or on the facts for the first defendants [the Association] to have been sued when clearly the parties to the agreement were not the first defendants but, SIAA and the plaintiffs. In this regard I reject the plaintiffs` submissions to the contrary as misconceived and unfounded. Similarly, I totally reject the plaintiffs` argument that SIAA at all times acted as the agent of the first defendants; the evidence adduced at the trial does not support this conclusion. The fact that the first defendants and SIAA shared common office bearers/directors like Teng did not mean that they were the one and the same person let alone that the former was the principal of the latter, even if all decisions for IA shows were taken by the first defendants. Neither does the fact that Teng was in the habit of using the first defendants` letterhead `for convenience` in corresponding on SIAA`s behalf, change the fact that at law they are two separate legal entities although SIAA is wholly owned by the first defendants. He used the correct letterhead where necessary, including SIAA`s letterhead for the notice of termination to the plaintiffs dated 5 May 1998. Accordingly the plaintiffs` claim against the first defendants is dismissed with costs.We think that the learned judge was justified in coming to this conclusion. First, the appellants are unable to show that a principal and agent relationship existed between the Association and SIAA, as opposed to that of a holding company and its subsidiary. There was no evidence that the Association had given any express authority to SIAA to act as its agent in relation the management agreement. Nor, on the evidence adduced, could such authority be implied. There was therefore no evidential basis for saying that SIAA acted as agent for the Association. The appellants rely on the following statement in the recital to the  management agreement showing that the Association had authorised SIAA to organise the IA exhibitions:Singapore Industrial Automation Association has hitherto been organising exhibitions called IA (Industrial Automation) in Singapore for the past few years. Singapore Industrial Automation Association has authorised SIAA Pte Ltd to organise future IA exhibitions.The presence of this statement was clearly understandable. The party who owned the rights to the IA exhibitions was the Association, but the management agreement was made between SIAA and the appellants whereby SIAA appointed the latter to manage and organise the IA exhibitions. This statement was intended to show that authority had been given to SIAA, and on that basis it was entitled to appoint the appellants. Without this statement there would be a lacuna with respect to the right or authority of SIAA to appoint the appellants. In other words, this statement was a declaration by the Association that SIAA, having been authorised to organise the IA exhibitions, had the right to appoint the appellants to manage and organise the same.We now turn to the contention that the Association and SIAA were one and the same party and it was the Association that carried on the business. The basis for this contention is the under-capitalisation of SIAA; the commonality of the directors and executives of SIAA and the Association; the ownership by the Association of all the shares in SIAA; the use of the letterhead of the Association in the correspondence with the appellants; and the sharing of the same office and address with the Association. These indicia, in our view, are by no means conclusive on this issue. The fact remained, however, that the management agreement was expressly made between SIAA and the appellants, and both of them entered into this contract as principals and not as agents. Pursuant to the contract, a performance bond was issued at the instance of the appellants and was issued to SIAA and not to the Association. The formal notice of assignment of the management agreement to MDA was given in the name of the SIAA; so also was the letter stating that the management agreement had been terminated and refusing permission to the appellants to be present at the presentation of the IA 99 given jointly by MDA and the Association. The letter of termination of the agreement was given on behalf of SIAA. In addition, there was evidence to show that payments by the appellants were made to SIAA itself. First, in the letter dated 22 April 1996, Teng complained that `a cheque for $5,000 to SIAA Pte Ltd to be drawn from the joint account from the sales of 26th ISIR proceedings` was long overdue. Secondly, according to the evidence of Foo Chee Lan, the finance director of the appellants, the share of profits from the IA 95 and IA 97 exhibitions was, in each case, paid by the appellants to SIAA.True it is that the Association managed and controlled SIAA and that the `driving force` or the `head and brain` of SIAA was and is the Association and that it is the Association which made the important decisions in relation to the IA exhibitions. However, it does not necessarily follow that SIAA was the Association`s agent or that both of them were one and the same party. It should be borne in mind that SIAA was specifically formed by the Association to absorb the risk of the business involved in organising IA exhibitions, which the Association was entitled to do. True also that most of the letters or faxes written to the  appellants in relation to matters concerning the IA exhibitions came from the office or address and written by the officers of the Association using the letterhead of the Association. This, however, is not altogether surprising, having regard to the commonality of directors and executives of the Association and SIAA.Counsel for the appellants refers to the case ofSmith, Stone & Knight Ltd v Birmingham Corp[1939] 4 All ER 116and relies on the factors laid down by Atkinson J therein to suggest that the business carried on was the Association`s business and not SIAA`s. In that case, the plaintiffs (`SSK`) bought the premises and a waste business of a partnership as a going concern. The premises and the business were conveyed or assigned to SSK. Thereafter, it formed and registered a new company (`subsidiary`). The subsidiary had a small issued capital and all its shares were owned by the parent company. It had the same directors as SSK. The subsidiary purported to carry on the business acquired by SSK in the sense that its name was placed on the premises and the note-papers, invoices and other documents. Subsequently, Birmingham Corporation compulsorily acquired the premises at which the subsidiary purported to carry on the business. The subsidiary was reputedly the tenant of SSK, which still owned the premises. The Corporation was obliged by law to compensate owners of the land for the value of their land as well as for removal and disturbance of their business, if they were also the occupiers. However, the Corporation argued that they were not obliged to compensate SSK for the removal and disturbance of the business, as it was run by its subsidiary which was a separate legal entity. The subsidiary could not claim for this loss as it was a tenant for a period not exceeding a year and such claim was excluded by operation of the relevant statute. Atkinson J found that that there was an apparent carrying on of the business by the subsidiary, but the premises and waste business were never assigned or transferred to the subsidiary. The subsidiary had no books and no staff, and the rent was merely a book-keeping entry, and profits from the business went straight into SSK`s books. SSK had complete control over the subsidiary and managed the business, as if it were a department of SSK. In the circumstances, Atkinson J found that SSK, and not the subsidiary, was really carrying on the business. In the course of his judgment, the learned judge found the following six questions material in determining the question as to who was carrying on the business:(1) were the profits treated as the profits of the company?(2) were the persons conducting the business appointed by the parent company?(3) was the company the head and the brain of the trading venture?(4) did the company govern the adventure, deciding what should be done and what capital should be embarked on the venture?(5) did the company make the profits by its skill and direction? and(6) was the company in effectual and constant control?Having considered these questions, the learned judge found that the subsidiary was the agent of SSK and that the business was that of SSK.The six points adumbrated by Atkinson J are certainly helpful guidelines but they are by no means, and it was never suggested by the learned judge to be, a conclusive and definitive test applicable in all circumstances in determining whether a business is carried on by a subsidiary as the principal or as an agent for  its holding company. In some cases, as in the present one, there are other circumstances which have to be taken into account. In this case, in particular, SIAA carried on the business: it entered into the management agreement with the appellants as the principal; it was the beneficiary of a performance bond issued at the instance of the appellants to secure the latter`s due performance of the management agreement; it received the shares of the profits derived from the IA 95 and 97 exhibitions, and presumably for this and other purposes it had banking accounts; it gave formal notice to the appellants of the assignment of the management agreement and through its solicitors it issued the notice of termination of the agreement. On the facts, we do not find that in the execution and performance of the management agreement, SIAA was the alter ego or the agent of the Association.The Association had utilised the corporate structure by setting up a company in order to limit its liability and risk. The law gives it a right to do so. True it is that SIAA was a two dollar company and probably even now is not a substantial company; but this must have been known or should have been known to the appellants, and despite having had such notice the appellants, on their own free will, decided to do business with SIAA.",
        "Sale of IA exhibition to Messe Dusseldorf": "The next issue relates to the sale by the Association of its rights in the IA exhibitions to Messe Dusseldorf. The appellants contend that by this sale the respondents had placed themselves in a position where they could no longer perform their obligations under the management agreement, namely, to continue with appointment of the appellants as the manager for the IA exhibition, and also by this sale the respondents had evinced an intention not to be bound by the management agreement, and there was therefore a repudiatory breach. The fact that Messe Dusseldorf undertook to indemnify the Association against any legal proceedings that may be instituted by the appellants against the Association as a result of the termination of the management agreement was a further indication that the Association itself acknowledged that this sale would amount to a repudiatory breach of the management agreement.This contention has no merit. Like the learned judge, we have found that the Association and SIAA were not one and the same party and SIAA did not act as the agent for the Association in the execution and performance of the management agreement. The Association was therefore not a party to the management agreement, and being the owner of the IA exhibitions, the Association was entitled to sell 80% of its rights in the exhibitions to Messe Dusseldorf and such sale did not bring about or occasion a breach of the management agreement on the part of SIAA.",
        "Mismanagement of the IA 97 exhibition": "Even before the commencement of the action, the respondents repeatedly complained that the appellants had mismanaged the IA 97 exhibition. Their complaint was first that there was a long delay on the part of the appellants in appointing an effective sales team to replace the positions left vacant by Richard  Tan and Annie Wong who had resigned, and this delay had resulted in the marketing and sales effort beginning late. Secondly, they complained that the appellants had failed to incorporate the concept of `national pavilion` in the exhibition and in consequence no national pavilion was set up. Thirdly, the appellants had failed to provide in the space contracts payment of penalties for any belated cancellations, wholly or partly, on the part of the exhibitors in the IA 97 exhibition, of which cancellations there was a significant number. Lastly, the appellants had failed to prepare the brochures and other promotional materials for the IA 99 exhibition in time for distribution and use by the close of the IA 97 exhibition so that the IA 99 exhibition could be marketed at the end of the IA 97 exhibition to the participants there.The appellants, on the other hand, denied that there was any mismanagement of the IA 97 exhibition in any respect. They contend that the respondents raised the several allegations of mismanagement of the IA 97 exhibition as an excuse to justify their termination of the management agreement. Moreover, even if there were acts or instances of mismanagement, they would not constitute a repudiation of the management agreement. In any event, the respondents did not consider all of any of these instances of mismanagement as amounting to a repudiation of the contract, as they continued to treat the contract as being subsisting. The appellants continued to perform the contract, until they received the notice of termination in May 1998.The learned judge found that in certain respects the appellants had mismanaged the IA 97 exhibition. She described the appellants` management of the exhibition as `poor performance` and said that the result was dismal compared with that of the IA 95 exhibition. She said at [para ] 52:... Compared with IA 95, the performance of IA 97 was dismal as it fell far short of the defendants` target of 4,400 sq m of space by over 1,000 sq m which figure resulted in a revenue loss in excess of $400,000. The plaintiffs at no time indicated they could not meet the target; indeed Ng had expressly informed the defendants she was confident of meeting the same. If the plaintiffs` argument that they had `performed` the agreement by merely holding an IA show is accepted, it would lead to the absurd result that even if colossal losses were incurred in consequence, the plaintiffs would be deemed to have discharged their contractual obligations; that cannot be right. The yardstick of performance must surely be how successful the show was, measured in terms of revenue and number of visitors.The learned judge attributed the poor performance to the belated marketing for the IA 97 exhibition undertaken by the appellants. They should have started the marketing before or immediately after the IA 95 exhibition, which they did not. She said at [para ] 54-55:54 [T]he plaintiffs should have completed their marketing before the onset of the economic crisis as that occurred barely three (3) months before the show. Last-minute exhibitors may have changed their mind about participating but those who had contracted for space earlier would not/should not have been affected or, at the very least they should not have been allowed to withdraw or reduce their bookings without payment of penalties which provision was absent from the plaintiffs` contract booking form. Neither does it help to advance their case for counsel for the plaintiffs to point to cl 4.1(b) of the agreement and say it envisaged that a loss  would be incurred! It bears mentioning that 1996 was a `boom` year of robust economic growth in Singapore and many sectors of the economy did extremely well. Had the plaintiffs properly marketed IA 97 within the two-year interval after IA 95 it should have done as well if not better than, IA 95 considering that the latter was organised in a much shorter time-frame. From the evidence adduced, the lack of participation by national pavilions in IA 97 was inexcusable on the part of the plaintiffs and could only be attributable to the fact (as evidenced by Ng`s letters to foreign missions in September 1997) that the plaintiffs` sales team was very late in making their approach.55 I also accept the defendants` evidence that the plaintiffs were late in producing both the fact sheet and brochure for IA 99 and these were only available in early 1998. Ng`s ignorance of `association` pavilions also serves to support the defendants` case that she and her team lacked experience in organising such a specialised show as IA/Logismat.The evidence before the learned judge was conflicting as to what was to be expected of a manager involved in the organisation of an exhibition, such as the IA exhibition. While there were heated disputes as to who caused the delay in the preparation of the promotional materials and also as to the impact of the failure to provide for national pavilions, it is clear to us that there was a considerable delay in forming an effective sales team for the IA 97 exhibition, after Richard Tan and Annie Wong had left the employment of the appellants, and that there was a failure on the part of the appellants in providing in the contracts with the exhibitors payment of a liquidated sum for belated cancellations, whether in whole or in part, of the bookings, of which cancellations there was a significant number. In our view, the learned judge was entitled to take into account these lapses as indicia of mismanagement on the part of the appellants.",
        "Repudiatory breach": "The next question is whether these aspects of mismanagement of the IA 97 exhibition constituted a repudiatory breach of the management agreement by the appellants entitling SIAA to terminate the contract, as they did. We think not. In order to amount to a repudiatory breach, that breach must be such as to show an intention on the part of the appellants not to perform their obligations under the contract and that they were no longer bound by its provisions:San International Pte Ltd v Keppel Engineering Pte Ltd[1998] 3 SLR 871, 880 at [para ] 20. The instances of mismanagement as found by the learned judge, whether collectively or singly, could hardly be regarded as amounting to a repudiatory breach justifying SIAA to terminate the management agreement. Such a breach, in our view, would only give rise to damages, if any loss is occasioned by the breach. In this regard, it is pertinent to note that the learned judge, despite her finding of instances of mismanagement, did not award any damages to the respondents, presumably on the ground that it would be difficult to attribute the fall in revenue entirely to these instances of mismanagement on the part of the appellants. There is no appeal by the respondents against the failure or refusal of the learned judge to award damages, and we need not consider this point further.",
        "Partnership": "One of the main arguments before us pertains to the issue of whether the appellants and SIAA were partners under the management agreement in the matter of organising the IA exhibitions. The learned judge held that they were. She said at [para ] 51:Looking at the terms of the agreement as a whole and bearing in mind the rules under s 2 of the Act, I accept the defendants` submission that the plaintiffs and SIAA were indeed partners under the agreement, in organising IA/Logismat shows. As the actual work of organising the shoes was done by the plaintiffs, the defendants agreed to allow them to claim a fixed sum of $289,500 by way of `agreed overheads` under cl 4.3(i) of the agreement. In this regards, I reject Tan`s contention that the sum is payable to the plaintiffs regardless of whether the IA show is or is not held. That construction of cl 4.3(i) cannot be right on its wording. The fact that the plaintiffs did not have to justify receipt of the sum by producing bills etc does not mean they do not have to first incur expenses before they can claim, particularly when the sum has to be paid from revenue earned from the IA show.Following from this, the learned judge held that by reason of this relationship the appellants were under a fiduciary duty to the SIAA `not to do anything which would conflict with their duties under the agreement`. Having come to the conclusion that Logistics Asia was a `carbon copy` of IA 99/Logismat, the learned judge held that in organising Logistics Asia the appellants were competing with IA 99/Logismat and were therefore in breach of their duty as a partner. As such, the learned judge held that SIAA was entitled to terminate the management agreement summarily without any notice to the appellants. The learned judge said at [para ] 56:... In view of my earlier finding that Logistics Asia was similar to the IA show in many respects, the possibility of conflict of interest became a fact. It cannot be a pure coincidence that a number of exhibitors at Logistics Asia were exhibitors at either or both IA 95 and IA 97. As the plaintiffs were in breach of the agreement by organising Logistics Asia, I am of the view that the defendants were entitled to terminate the agreement summarily without any notice to the plaintiffs, leaving aside the poor showing of IA 97. In actual fact, the plaintiffs had been forewarned by the defendants` aforementioned two letters of the possibility of legal action if the plaintiffs persisted in holding Logistics Asia.The central issue here is whether the appellants and SIAA were partners under the management agreement. Counsel for the appellants submits that where the relationship between parties are spelt out in a contractual document, one must first look at the terms of the document to ascertain the true nature of their relationship. Firstly, he submits that the management agreement did not expressly create a partnership. Since the parties are established commercial entities and the management agreement was drafted by lawyers, there was no reason why there should be no express mention of a partnership, if that was the true intention of the parties. Secondly, the appellants did not acquire any interest or rights in the IA exhibitions, which remained vested in the Association. The appellants were merely appointed as show or exhibition managers with specific duties and responsibilities as spelt out in the management agreement. Thirdly, counsel points out that while profits and losses were indeed shared between the appellants and SIAA as provided in the agreement, that was only prima facie evidence of a  partnership under the Partnership Act (Cap 391) (the `Act`), but that was far from conclusive. All the circumstances and relevant factors would also have to be considered. He submits that the profit-sharing mechanism was a common method of remunerating show or exhibition managers in the industry. Moreover, the appellants were paid a fixed management fee of $289,500, irrespective of how well the IA exhibition performed. Fourthly, the appellants were required to execute a performance bond for $70,000. This showed that it was a typical of service-type agreement in which one party contracts to perform a service for another party and furnishes a performance bond to secure the due performance of his obligations under the contract. Lastly, counsel submits that the fact that the Association sold 80% of its rights in the IA exhibitions to Messe Dusseldorf without any consent of the appellants showed that the Association or SIAA did not regard the relationship between SIAA and the appellants as that of partners. This was because such a disposal of the business of the partnership without consent of the other partner would have constituted a breach of SIAA`s fiduciary duties, if SIAA and the appellants were partners.Counsel for the respondents, on the other hand, submits that the relationship between the appellants and the respondents was that of a partnership, as found by the learned judge. He relies primarily on the arrangement for the sharing of profits and losses, which was not the standard arrangement for the appellants. He disputes that the sum of $289,500 was a fixed management fee to the appellants, and submits that this sum was actually the agreed costs and expenses which the appellants would incur. As for the lack of ownership of any rights in the IA exhibition on the part of the appellants, counsel contends that a partnership does not necessarily entail a joint ownership of partnership assets.The question of whether two or more collaborators in a venture are partners in the legal sense is always a difficult one to answer. This is because there is no conclusive test for determining such relationship. A number of factors may be identified. Section 2 of the Act states that the sharing of profits is prima facie evidence of a partnership. Another factor is the beneficial ownership of the assets by the parties involved. The label used by the parties, particularly in the legal documents, is also relevant. However, it is also clear from the cases cited by both parties, as well as the relevant passages fromLindley & Banks on Partnership(17th Ed, 1995), that while these factors are relevant, they are by no means conclusive. As such, while the respondents were able to cite authorities that state that the sharing of profits is the essence of a partnership, equally the appellants could point to authorities where it was held that no partnership existed despite the existence of a profit-sharing arrangement. The question is one of mixed fact and law and all the surrounding circumstances have to be taken into account in the determination of such an issue: seeKeith Spicer Ltd v Mansell[1970] 1 WLR 333,Davis v Davis[1894] 1 Ch 393andChua Ka Seng v Boonchai Sompolpong[1993] 1 SLR 482.It should also be appreciated that there are various vehicles or mechanisms by which parties may collaborate on a project, such as a joint venture or an appointment of agency. In entering into such collaboration certain aspects of a partnership may be adopted in their working relationship. An example is the  sharing of profit or loss. Much depends on the terms of the agreement the parties have entered into.In this case, under the management agreement, SIAA appointed the appellants as the show manager of the IA exhibitions for minimum of three exhibitions, and the appellants were responsible for the marketing and sales of exhibition space, logistical supports as well as the preparation and maintenance of accounts. Profits were to be divided in the proportion of 40% to the appellants and 60% to SIAA and losses were to be shared equally. From the revenue, a sum of $289,500 was to be deducted as the agreed costs and expenses of the appellants before the parties could proceed to divide the net profits. Apart from these provisions of sharing of profits and losses, there are no other features in the agreement suggesting a partnership between them. The appellants were and are in the business of organising and managing exhibitions and shows, and SIAA is a wholly owned subsidiary of the Association which at that time owned the IA exhibitions. The Association, to minimise its risk and liability, procured SIAA to enter into the management agreement with the appellants. The agreement was essentially one for the appointment of the appellants as the manager for the IA exhibitions. It is unlikely that the parties concerned intended that SIAA and the appellants should enter into partnership arrangement. In our judgment, the appellants and SIAA were not partners in the organisation and management of the IA exhibitions under the management agreement, and there was no fiduciary duty owed by the appellants to SIAA, and in consequence vis-Ã -vis SIAA there can be no question of any breach of a fiduciary duty on the part of the appellants. With respect, we are therefore unable to agree with the learned judge that there was a breach of fiduciary duty on the part of the appellants.",
        "Logistics Asia 98": "The learned judge found (at [para ] 46 and 48) that Logistics Asia 98, which was organised by the appellants, was an exhibition which competed with the IA 99 exhibition. She said at [para ] 48:... There is no doubt in my mind that Logistics Asia was a carbon copy of IA/Logismat in many respects and it targeted the same visitor profile. The question is, did the plaintiffs owe a fiduciary duty to the defendants not to organise competing exhibitions? Such a term if any would have to be implied from their relationship.Before us, this conclusion was challenged by the appellants. It is their case that Logistic Asia 98 and the IA 99 exhibition were not competing events, as they had different focuses and profiles. Furthermore, Logistics Asia 98 was held one year before IA 99/Logismat. On the other hand, the respondents contend that it was apparent from the product exhibit and visitor profiles and also the exhibitors themselves that these two events were in competition with each other. It is also their contention that the appellants had made use of confidential information in organising Logistics Asia 98 by using the IA 95 database of exhibitors, which belonged to the Association by virtue of cl 2 of the management agreement.This is essentially a question of fact and we agree with the respondents that the important factors to be considered here are the profiles of the exhibitions, the exhibitors and visitors, as well as the timing of the two events. The appellants attempted to explain that the main difference between Logistics Asia 98 and IA  99/Logismat was that the former was targeted at drawing tail-end users of `logistics solutions and services`, whereas the latter was aimed at logistic solutions and services providers. However, such a distinction does not seem to be borne out by the promotional materials. A comparison of the product profiles of Logistics Asia 98 and IA 99/Logismat respectively showed that there was a large degree of overlap. For example, both profiles contained a `Materials Handling & Storage` section under which both had `Automated Guided vehicles, Air cushion Conveyors, Archives & Library Systems, Automated Warehouse Systems, Chain Conveyors` as some of the products listed. The appellants themselves admitted that there was an overlap between the Logistics Asia 98 and IA 99/Logismat.Further, the fact that the two events were held one year apart does not detract from the competitiveness of the two events. The reason is this. A large portion of the products exhibited comprised hardware and machinery. A manufacturer who had bought an automated machinery or equipment at Logistics Asia 98 in 1998 would be unlikely to return in 1999 to attend IA 99/Logismat to look for another automated machinery or equipment. Such hardware products represent a substantial capital outlay and would not usually be replaced within a year or so. We agree with the learned judge that Logistics Asia 98 was an exhibition which competed with IA 99/Logismat.Turning to the allegation of the use of confidential information by the appellants in organising the Logistics Asia 98, we note that the learned judge did not make any finding on this point. It does not appear to us that SIAA has made good this allegation. What counsel for SIAA has so far shown is only a grave suspicion that the appellants might have made use of the confidential information. That is not enough.",
        "Implied term": "We now turn to the issue whether the appellants, in organising Logistics Asia 98, which was an exhibition competing with IA 99/Logismat, had committed a breach of their obligations, express or implied, under the management agreement. There is no express provision in the agreement restricting the appellants from organising any such event. The question therefore is whether such an obligation could be implied from the terms of the contract. As this court said inEnergy Shipping Co Ltd v UDL Shipping (Singapore) Pte Ltd[1995] 3 SLR 25, the test for determining whether a term ought to be implied in a contract had often been described as `the business efficacy test` or `the officious bystander test`. But, no matter which test is applied, the touchstone of `necessity` remains. Therefore, the term which could be implied must be a necessary term. It suffices to quote the following passage from the judgment of Scrutton LJ inRe Comptoir Commercial Anversois and Power, Son and Co`s Arbitration[1920] 1 KB 868at p 899, which we had adopted in the earlier decision of this court:The court ... ought not to imply a term merely because it would be a reasonable term to include if the parties had thought about the matter, or because one party, if he had thought about the matter, would not have made the contract unless the term was included;it must be such a necessary term that both parties must have intended that it should be a term of the contract and have only not expressed it because its necessity was so obvious that it was taken for granted. [Emphasis is added.]In this case, a term can only be implied ifbothparties must have intended it to be a necessary term of the management agreement. It cannot be said that a non-competition clause was a necessary term that both parties must have intended that it would a term of the agreement. It may well have been the intention of SIAA that the necessity for such a clause was obvious. However, we have grave doubts if this was or could have been the shared intention of the appellants, bearing in mind that they are professional managers and organisers of shows or exhibitions. If SIAA had intended to restrict the business of the appellants, it would have to do so expressly in the management agreement which was negotiated at arms length. If such a restriction is required by SIAA, one would expect the appellants to negotiate for different terms or to negotiate for a term qualifying or limiting the operation of such a restriction. In the circumstances, we do not think that such a term is of necessity one which both parties must have intended when the management agreement was executed. In this regard, before us the respondents do not really pursue this line of argument with any vigour. Their main argument is that such an term should be implied by virtue of the fiduciary obligations owed by the appellants to SIAA.",
        "Conclusion": "In our judgment, there was no justification for SIAA terminating the management agreement summarily and by so doing they repudiated the contract. They are therefore liable in damages for breach of contract and the appellants` claim against them in damages succeeds. We set aside the judgment below dismissing their claim and order that interlocutory judgment be entered against SIAA with damages to be assessed by the registrar. SIAA`s counterclaim is dismissed. To this extent, we allow the appeal. We make a consequential order that the appellants` performance bond is to be rescinded, unless it has been called and the amount thereunder paid, in which case the sum paid is to be refunded to the appellants with interest at the rate of 6% per annum from the date of payment to the date hereof. As we have held that the Association was not a party to the management agreement, we affirm the judgment below dismissing the appellants` claim against the Association.",
        "Costs": "We now come to the question of costs. As the appellants` claim against SIAA succeeds, they should have the costs here and below, and we so order. To this extent the order below as to costs is set aside. Any costs paid by the appellants to SIAA is to be refunded.We now turn to the costs of the Association. The claim against the Association was dismissed on the ground that it should not have been sued as the second defendant. In our view, the Association had partly contributed to the misjoinder. Having procured SIAA to enter into the management agreement with the appellants, the Association thereafter did not take sufficient care to maintain the distinction between itself and SIAA in the dealings with the appellants. Teng, in his correspondence with the appellants, gave the impression that the Association, and not SIAA, was involved in the business of organising and managing the IA exhibitions. All these had, to a certain extent, created a confusion  which appeared to have bedevilled the appellants. In the court below, the appellants were ordered to pay the costs of the Association. We would allow that order to stand. However, as for the costs of the appeal, having regard to the part the Association had played and the confusion it had created, and the fact that the Association and SIAA were represented by the same solicitors and that full costs below had been awarded, we are not disposed to award to the Association any costs. In the circumstances, we make no order as to costs. The deposit in court, with interest, if any, is to be refunded to the appellants or their solicitors.Outcome:Appeal allowed.Copyright © Government of Singapore."
    }
}