{
    "case_title": "Lifestyle 1.99 Pte Ltd v S$1.99 Pte Ltd (trading as ONE.99 SHOP)",
    "ncitation": "[2000] SGCA 19",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "The facts": "The plaintiff-respondents, S$1.99 Pte Ltd, are the owners of a chain of retail shops which operate under the style `ONE.99 Shop`, which name was registered with the Registry of Businesses on 1 December 1995. The respondents opened their first retail outlet with that name on 6 April 1997 at The Heeren, an upmarket shopping centre along Orchard Road. By the time of the trial, the respondents had opened a total of seven such outlets at various shopping centres all over the island, of which one was a franchised outlet. An important characteristic of the respondents` outlets is that all the goods sold in the outlets, ranging from Japanese snacks and other foodstuffs to cosmetics, fashion accessories, stationery, toiletries, common household products, plastic-ware and toys, are priced at a fixed price of $1.99.The person behind the respondents is one Ms Nanz Chong, the Managing Director. She is a relatively well-known former-model-turned-entrepreneur. According to her, she first conceived the idea of a `one-price store` following her travel to Japan in the mid-nineties in the course of her work as a model when she noticed numerous stores there selling all items at one fixed price. She felt that this kind of a sales concept would catch on and be popular in Singapore. So for three years preceding the opening of the first store, she put in considerable effort sourcing for goods and preparing for the opening. The logo she chose for the shop consisted of the words `ONE.shop` written in black against a stark white background with the numbers `99` appearing in a larger, bold red-coloured font over the word `shop`.Following the opening of the first ONE.99 outlet at The Hereen, the shop received immense publicity in the media, both in terms of news reports as well as feature articles. It seems to us clear that to a large extent this was due to Ms Chong`s own earlier fame as a fashion model. Another reason was obviously due  to the fact that the articles sold at the shop were at a relatively cheap price of $1.99[cent ]. A bargain shop like this at an upmarket location was obviously something the public would be curious about. The shop was variously referred to by the media as the `$1.99 Shop`, the `1.99 Shop` and the `$1.99 Store` .Ms Chong attributed the success of the shop to two factors: pricing policy and good service by her staff. `Service with a smile` is the respondents` hallmark and the respondents sought to drive home the point that you can obtain good quality goods at an upmarket location without paying for the sky.From the volume of business done, it was clear that the venture was a success. During the first 11 months of business, from April 1997 to February 1998, the sales turnover amounted to slightly more than $3.5m. In the year ending February 1999, the turnover almost doubled to $6.9m. For advertising in 1997, they spent $23,000 while it was $29,000 for 1998. Although in absolute terms these advertising figures are not very large, they are no doubt significant when one bears in mind that we are here concerned with goods priced at only $1.99.Turning to the appellants, they were incorporated on 8 September 1998. They are almost a wholly owned subsidiary of Rubber Band Enterprises Pte Ltd (`Rubber Band`), as only 1% of the shares are owned by another party. Rubber Band was itself incorporated in 1992 and has a paid-up capital of $4m. It is a major player in the toy industry, being the licensee or agent for various popular overseas brands of toys including Disney from America, and Sanrio, a toy and gift company from Japan.In September 1997, Rubber Band started selling Sanrio products at various department stores at $1.99. This move was prompted by the sales strategy of a competitor who was then selling a certain range of Sanrio products at a standard price of $2. To match that, they decided to go for the price of $1.99 and had appointed a manufacturer in Hong Kong to supply them that range of products. According to the appellants, three factors contributed to their choosing the price of $1.99. First, it was then very much the market norm to retail goods at prices ending with 99[cent ] such as $1.99, $2.99 or $9.99. In the case of the Sanrio products in question, $1.99 was the most appropriate price after taking costs and profit margins into account. Secondly, `99` is auspicious because it can be translated to mean `everlasting` or `perpetuity` in Mandarin. Thirdly, the price $1.99 was more competitive than $2, which was the retail price adopted by the appellants` competitor. At the time `100 Yen` shops were very popular in Japan and Rubber Band was encouraged by that.In 1998, Rubber Band adopted another strategy of holding joint promotional sales of products at $1.99 with the Watson`s retail chain. Between February and October 1998, more than 40 such joint promotions were held at various Watson`s outlets, raking in a total of more than $1m in sales. With the success of the Watson`s promotions, Rubber Band was subsequently approached by major department stores to hold similar `$1.99` sales promotions. Thus a joint promotion was held at Takashimaya`s `Talking Hall` from 31 July to 19 August 1998 and the sales generated came up to some $150,000. Joint promotions were also held with Daimaru, at both Junction 8 and Liang Court Shopping Centres locations. At the sites of these promotions, various posters and placards contained the figure  `$1.99`, preceded by a clasped hand with its index finger pointing upwards. At the opposite end were several Japanese characters written vertically, which when translated meant `this is good`.While promotional sales were successful, because of the low profit margin for retailers, few of them were willing to enter into long-term partnership with Rubber Band. Thus Rubber Band felt it could no longer just concentrate on distribution and wholesale. There was a need for it to actually go into retail. Furthermore, the continued holding of such ad hoc promotional sales with others posed a severe strain on its limited manpower. The appellants were, therefore, incorporated to function as the retail arm of Rubber Band. They decided to start with the $1.99 retail concept as it was something they had been doing with the various department stores since 1997, and for which they had ready products and suppliers.The appellants also explained why their name bears the word `Lifestyle`. They said that from February 1997 Rubber Band had used the slogan `A leadingLifestylecreator` on posters to promote the toys and household products which they distributed. A director of Rubber Band, one Mr Ong Choon Seng, who coined the slogan, felt that since toys, household items and gifts would always be a part of our lifestyle, by bringing these products into the lives of Singaporeans, Rubber Band was thereby `creating a lifestyle`. As such, it was thought desirable to have the word `lifestyle` as part of the subsidiary`s name in order to give the subsidiary a common identity with the parent company. As it was also important that the name of the new company should be reflective and descriptive of the business of selling products at a fixed price of $1.99, the appellants` retail outlets were and are therefore called `Lifestyle 1.99`. The appellants said the `$` sign was omitted from the name as just `Lifestyle 1.99` was easier to pronounce. The clasped hand with the index finger pointing up was similarly discarded in favour of a simpler new logo which consisted of the word `Lifestyle` above the number `1.99`, all of which were printed in a distinctive white-coloured font against an oval-shaped cyan-coloured background.However, not all the goods sold at each `Lifestyle 1.99` outlet were priced at $1.99. This was because in each outlet, there were `Premium Counters` where products were sold at prices other than $1.99, such as $3.99, $4.99 and the like. These premium products were generally products distributed by Rubber Band to other retailers but they cost more than $1.99. As a concession to the customers of `Lifestyle 1.99`, these products were offered to them at highly discounted prices. The appellants said that the number of `premium items` for sale in any outlet was highly insignificant when compared with the number of `$1.99` items and none of the premium items cost more than $10.On or about 18 February 1999, the respondents` solicitors, M/s Drew & Napier, sent a letter to the appellants stating that the respondents had acquired goodwill in the name `ONE.99` and demanded that the appellants cease the use of the name `Lifestyle 1.99`, as the latter is confusingly similar to the name `ONE.99`. The appellants did not comply. Thus the institution of this action by the respondents.",
        "The decision below": "At the hearing below, the learned judge granted an order restraining, inter alia, the appellants from passing off their business as and for the business of the respondents, and from misleading the public into thinking that the appellants were in some way connected or associated with the respondents.The learned judge found that the name `ONE.99` is a fanciful one as it is pronounced as `One Point Nine Nine`, which has nothing to do with the price of the products sold at $1.99. He further found that in the light of the wide extent of media publicity concerning the ONE.99 Shop and the large sales turnover for the period of over one and a half years (until the incorporation of the appellants), the respondents had demonstrated that they had acquired goodwill in the name `ONE.99` and its variants `1.99 Shop` and `$1.99 Store`. He felt that part of the respondents` goodwill came from a combination of factors, namely, selling quality products at the fixed price of $1.99 in a trendy and upmarket setting. In his view, there must inevitably be confusion if both shops were referred to as the `One Point Nine Nine Shop`. He felt that the prefix `Lifestyle` to the appellants` outlets made no difference as the appeal of the name lay in `One Point Nine Nine`. The learned judge further thought that the appellants` choice of `1.99` as part of their name was influenced in part by the success of the respondents` ONE.99 shops.On the question of damage, the learned judge found that there was sufficient evidence to show that many of Ms Chong`s customers had mistaken the appellants` shop for hers. A survey conducted by Asia Market Intelligence (S) Pte Ltd showed that 48% of the 300 persons sampled thought that `ONE.99` and `Lifestyle 1.99` were connected or associated with each other. While the learned judge recognised that evidence of confusion is not necessarily evidence of damage he held that `in the circumstances of this case ... there were, in all probability, instances of diversion of business, borne from confusion, and that, is clearly damage.`",
        "The appeal": "It is trite law that for a plaintiff to succeed in an action for passing-off three elements must be proved: (i) goodwill in a business, (ii) misrepresentation, namely, passing off one`s goods or services as the goods or services of another, and (iii) damage: seeReckitt & Colman Products Ltd v Borden Inc & Ors[1990] 1 All ER 873per Lord Oliver at 880. The issues raised in this appeal touch on all three elements and they are:(a) whether the respondents had by 9 September 1998, the date on which the appellants commenced trading, acquired sufficient goodwill in their business in association with the use of the name `ONE.99`;(b) whether the use by the appellants of the name `Lifestyle 1.99` was a misrepresentation to the public that they were in some way connected with the respondents or their business; and(c) whether as a result, damage had been caused to the respondents.",
        "Goodwill": "What is goodwill? We can do no better than cite the oft-quoted passage of Lord Macnaghten inIRC v Muller & Co`s Margarine Ltd[1901]  AC 217 at 223-224:It is a thing very easy to describe, very difficult to define. It is the benefit and advantage of the good name, reputation, and connection of a business. It is the attractive force which brings in custom. It is the one thing which distinguishes an old-established business from a new business at its first start. The goodwill of a business must emanate from a particular centre or source. However widely extended or diffused its influence may be, goodwill is worth nothing unless it has power of attraction sufficient to bring customers home to the source from which it emanates.Ordinarily goodwill is acquired by trading. It is inseparable from the business to which the goodwill relates. Again in the words of Lord Macnaughten at p 223:Goodwill has no independent existence. It cannot subsist by itself. It must be attached to a business. Destroy the business and the goodwill perishes with it though elements remain, which may perhaps be gathered up and be revived again.`There is common ground between the parties that the respondents must show they had acquired goodwill on the date on which the first `Lifestyle 1.99` shop opened for business, namely, 9 September 1998 (the relevant date). On this issue, the appellants` bone of contention is that the learned judge did not correctly appreciate the term `goodwill` as he used the expression `goodwill in the name` throughout his judgment. The appellants submitted that this is a serious error as it wrongly assumes that the cause of action is based on the protection of a name. To substantiate this criticism, counsel for the appellants citedWadlow on the Law of Passing Off(at p 45):The right of property protected by the action for passing-off is the goodwill of the plaintiff`s business as a whole. Passing-off does not directly protect names, marks, get up or other indicia.However, having perused the judgment as a whole, it seems to us clear that the learned judge was conscious that `goodwill` relates to business even though he had in various places referred to `goodwill in the name`. We think what the learned judge wanted to do, perhaps not entirely accurately, was to use that phrase as a short form to encapsulate the idea of `goodwill in a business as represented by the name ONE.99`. This can be seen from the factors he considered in determining whether the respondents had acquired sufficient goodwill in the business to sustain a passing-off action.As indicated earlier, during the period of one and a half years of trading before the appellants set up their first outlet, the respondents enjoyed a huge turnover in their business: $3.5m for the first 11 months and $6.9m for the next 12-month period. Bearing in mind that the price of each item was only $1.99, this would represent a very large number of customers who had patronised the respondents` shops. In our view that would be evidence of goodwill. Even the appellants have to admit, and to quote from their case, `the respondents` business turnover is relatively substantial which is indicative of the existence of at least some goodwill in the business.`The huge customer base which the respondents had built up in that one and a half year period was no doubt due to a combination of factors: the advertising impact, the media coverage, both in terms of news report as well as special articles, the cheap but yet relative good quality goods sold therein and the friendly service rendered by their sales staff. As this court had ruled inCDL Hotels International Ltd v Pontiac Marina Pte Ltd[1998] 2 SLR 550, advertising and media publication can help a business to acquire goodwill. The results of the survey conducted by Asia Market Intelligence which showed that some 48% of the 300 persons interviewed were aware or had heard of the ONE.99 Shop and at least 40% of the interviewees were aware of the shops` locations demonstrated that the business of ONE.99 was known fairly widely. This is quite understandable bearing in mind that at the time the respondents` outlets were the first and only shops selling goods at the fixed price of $1.99.In the result we agree with the learned judge that the respondents had on the relevant date acquired goodwill in the business bearing the name `ONE.99`, which was a business of a retailer selling miscellaneous goods at a fixed price.",
        "Fancy or descriptive?": "We now turn to the second element, the question of misrepresentation. What the respondents` assert to be the distinction of their business is in their name `ONE.99`. They say that the appellants by using the name `Lifestyle 1.99` are representing that the two businesses are related. In this connection, the question of whether the name `ONE.99` is fancy or descriptive is highly critical. It is on this aspect that the appellants argued very strenuously that the learned judge had gone wrong when he held that the name is a fancy one. They contended that the judge applied the wrong test in determining the question when he said:In my view, the fundamental test to be applied in determining whether a name is a descriptive or fancy name is to see what ostensible meaning the name conjures in the context of its business.The law treats quite differently the name or mark of a business depending upon whether the name or mark is descriptive or `fancy`. InBritish Vacuum Cleaner Co v New Vacuum Cleaner Co[1907] 2 Ch 312at 321, Parker J said:... I think a distinction must always be drawn between cases in which the word in question, the word which it is proposed to restrain the defendant from using is a word of ordinary use, descriptive of an article, and cases in which the word complained of more or less, partakes of the character of a `fancy word`, or primarily, does not relate to the article but to the person who makes the article.A name or mark which is prima facie descriptive will only be protected if it can be shown to have acquired a secondary meaning, namely, it has become distinctive of the plaintiff`s business. `Distinctive` is a term of art in the law of passing-off and bears a meaning at variance with that in everyday use. In relation to a name or mark, it denotes the goods of the plaintiffs to the exclusion of other traders.Wadlow on The Law of Passing Off(at pp 391-392) describes how a mark/name is to be categorised, and the consequences flowing therefrom, as follows:A fancy word is one which has no obvious relevance to the character or quality of the goods or business in relation to which it is used, such asEurekafor shirts,Clockfor an hotel orJunefor toiletries. It is `of an arbitrary and fanciful nature` in that context. Whether a word is fancy or descriptive may depend on how it is used.Healthmay plausibly be called a fancy word in respect of fishing gear but not for cocoa. The significance of the difference is that distinctiveness is very much more easily acquired for fancy words, and it is inappropriate to speak of secondary meaning when the word has no primary meaning to displace. However, the decision to categorise a word as fancy or descriptive is only one part of the wider issue of whether there is a material representation to restrain. Inherent ability to distinguish is always a matter of degree with there being a continuous spectrum between the highly fanciful and the obviously descriptive. Wherever the name may fall on that range, what matters is whether the name is distinctive in fact.We note that while the learned judge felt that `ONE.99` qualifies as a fancy name, he recognised `there is a connection between ONE.99 and the business of selling goods at $1.99.` But he added that the connection was not straightforward. The reason he came to that conclusion was because he thought there was `sufficient novelty and features in the idea for it to qualify as a fancy name.` He also noted that while numbers may `connect, indicate, and represent ideas, ... it is straining the language to say that they \"describe\".` The judge further said:The name `ONE Point Nine Nine` as is read and pronounced does not immediately lead one to think of the shop as a $1.99 Shop. The connection becomes obvious after a while and therein lies the sublety that makes it, in my view, a fancy name, ... The omission of the $ sign in both cases is thus significant. In the (respondents`) case it shears the descriptive character from the name.With respect to the learned judge we think the name `ONE.99` is quite clearly descriptive, bearing in mind the business that is carried out in the respondent`s outlets, namely, the selling of goods at $1.99`. He recognised it as much, though he said that it only becomes obvious `after a while`. Ms Chong tried to explain that she chose the name `ONE.99` because it was `magical`. We are unable to follow that. Furthermore, in court, she added that `99` also meant `everlasting` in Mandarin. This may well be so. But `ONE.99` or `1.99` must obviously have come from the fact that she intended to sell the things in her shop at the price of $1.99. We cannot accept that `ONE.99` was arbitrarily chosen. The link is clear. We also do not think that `ONE.99` or `1.99` will, in oral conversation, be referred to as `One point ninety-nine.` More likely than not, the `dot` will be omitted. Let us illustrate. If one were to buy an article at say $2.99, and if one were to be asked how much it costs, the answer that any person would normally give would be `two ninety-nine`, omitting the dot, as well as the $. It is wholly unreal to suggest that the `dot` would be pronounced.In this regard, we think the caseMcCain International Ltd v Country Fair Foods Ltd[1981]  RPC 69is quite instructive. There the plaintiffs had introduced potato chips cooked in an oven and called them `McCain Oven Chips`. The defendants sold `Country Fair Oven Chips` and `Birds Eye Oven Chips`. The Court of Appeal held that there was no arguable case of passing-off against the defendants and that the name `oven chips` was descriptive of the product; it was not a fancy name. The plaintiffs sought to argue that the two words were `an  ungrammatical aggregate of two English nouns and that it was nonsensical without an explanation.` This was how Templeman LJ dealt with the argument:But in my judgment the words `oven chips`, grammatical or not, constitute an expression which is an ingenious and apt description of the contents, namely, potato chips prepared for cooking in the oven; and although the consumer may not have been aware, and could not have been aware of what the expression meant until oven chips came on to the market, once they had come on the market he could recognise a name which is apt and appropriate to describe a produce rather than a manufacturer, the product being potato chips prepared for cooking in the oven. The fact that the name `oven chips` does not indicate that the chips may also be grilled is neither here nor there. The name does inform the consumer of what is inside the package so that he may know what he is purchasing.`InHorlick`s Malted Milk Co v Summerskill[1916] 33 RPC 108, the plaintiffs manufactured a food preparation which they sold as `Horlick`s Malted Milk`. The defendants sold a food preparation under the name `Headley`s Malted Milk`. The plaintiffs brought a passing off action and sought to restrain the defendants from using the words `Malted Milk`. The Court of Appeal, agreeing with Joyce J, held that those were descriptive words meaning milk to which malt had been added or applied and that the plaintiffs were not entitled to restrain the defendants from using the descriptive words to identify their products.A case which shows that the court would treat words as descriptive notwithstanding deliberate alterations made to them so that as spelt there are no such words in the English language isAncona Printing Ltd v Kwik-Kopy Corp[1973]  CPR (2d) 122. InAncona Printingthe plaintiff for some 13 years carried on business of copying and duplicating documents under the style `Kopy Kwik Printing` and sought to restrain the defendants who were in the business of printing written material from using the name `Kwik-Kopy Printing`. Both were operating in the same area in Kitchener, Ontario. Notwithstanding evidence of confusion, the High Court refused to continue the ex parte injunction. While `Kopy Kwik` are not English words (presumably intended to be a fanciful expression of `copy` and `quick`), White J held that `Kopy-Kwik Printing` was a descriptive expression.Reverting to our instant case, we have no doubt that once the public realise that the goods sold in the ONE.99 outlets are all fixed at a price of $1.99, it does not require much imagination to appreciate that the name `ONE.99` is intended to inform all consumers that the goods sold therein are so priced. It, therefore, is descriptive.",
        "Secondary meaning: distinctiveness": "Of course the fact that a name is descriptive does not mean that it could not become distinctive although it would be difficult. It would appear that the only case which held that a descriptive term had become distinctive of the plaintiffs is the early case ofFrank Reddaway & Co v George Banham & Co[1896]  AC 199where the term was held to have acquired a secondary signification. There the plaintiffs succeeded in establishing that between 1879 and 1891 the term `camel-hair belting` had acquired a secondary meaning. Lord Herschell said (at p 213) that the term `did not convey to persons dealing in belting the idea that it was made  of camel`s hair, but that it was belting manufactured by the plaintiffs.` It seems to us that the court inReddawayreached that conclusion due in no small part to the fact that there was a letter which on the face of it not only showed a dishonest intent on the part of the person who was proposing to use the term `camel`s hair belting` but also contained an admission that such a secondary or subsidiary meaning did exist.In contrast, inCellular Clothing Co Ltd v Maxton and Murray[1899]  AC 326, the plaintiffs invented a fashion suitable for shirting and underwear woven in a particular manner and had marketed it for ten years under the name `cellular cloth`. The defendants sold cotton and woollen goods which they recently described as `cellular`. The House of Lords held that the word `cellular` was an ordinary English word which appropriately and conveniently described the cloth of which the goods sold by the plaintiffs were manufactured. Lord Halsbury said, at p 336:where you are dealing with a name which is properly descriptive of the article the burden is very great to shew that by reason of your using that name descriptive of the article you are selling, you are affecting to sell the goods of somebody else ... under ordinary circumstances it would be very difficult to establish ...Lord Shand, commenting onReddaway, said at p 340:Of that case I shall only say, that it no doubt shews it is possible where a descriptive name has been used to prove that so general, I should rather say so universal, has been the use of it as to give it a secondary meaning and so to confer on the person who has so used it a right to its exclusive use or, at all events, to such a use that others employing it must qualify their use by some distinguishing characteristic. But I confess I have always thought, and I still think, that it should be made almost impossible for any one to obtain the exclusive right to the use of a word or term which is in ordinary use in our language and which is descriptive only - and, indeed, were it not for the decision inReddaway`s case, I should say this should be made altogether impossible.As would be apparent from the opinion of their Lordships quoted above, when a descriptive name is used, a very great burden is placed on a plaintiff to prove that the name has acquired a secondary meaning. All the more so where a descriptive name is put to an invented article (or as in the case here of a term to indicate a new sale concept at a fixed price of $1.99), the problem of proving secondary meaning will be further compounded and the reason for that is, and here we will quote Lord Davey inCellular Clothing Co(at pp 343-344):... that where a man produces or invents, if you please, a new article and attaches a descriptive name to it - a name which, as the article has not been produced before, has, of course, not been used in connection with the article - and secures for himself either the legal monopoly or a monopoly in fact of the sale of that article for a certain time, the evidence of persons who come forward and say that the name in question suggests to their minds and is associated by them with the plaintiff`s goods alone is of a very slender character; for the simple reason that the plaintiff was the only maker of the goods during the time that his monopoly lasted, and therefore there was nothing to compare with it, and anybody who wanted the goods had no shop to go to, or no merchant or manufacturer to resort to except the plaintiff.This opinion of Lord Davey expressed inCellular Clothing Cowas applied by Parker J inBritish Vacuum Cleaning Co Ltd(supra) where he held that no  secondary meaning was proved in respect of the descriptive words `vacuum cleaner`. This was how he further elucidated the point (at p 325):I think that the evidence itself - what there is of it - really points to the fact that the public have understood `vacuum cleaner` and the `vacuum cleaning process` to be a description of a particular kind of cleaner and a particular process, a cleaner, namely, which operates by means of a nozzle applied to the furniture and the suction in the pipes caused by the vacuum created by the machine. As long as the plaintiff company was the only manufacturer who manufactured and dealt with and went from house to house with a machine of that sort, no doubt in the mind of the public there would be a connotation of the fact that the machine was the machine of the plaintiff company. But I do not think that primarily the words have ever been in the mind of the public anything else than descriptive words, and, if that be so, then it appears to me that the case falls for this purpose within what was said by Lord Davey, namely, that no great inference can be drawn from the fact that during the period when the patentee has had a monopoly, or the manufacturer has had a monopoly, either at law or in fact, words primarily descriptive of an article have become associated with the patentee or manufacturer.There is nothing, and there was nothing, as he said, for the public to contrast it with, so that it is impossible to say that the public understood by those words a machine dealt in or brought round by any one person or company as distinguished from any other person or company.` [Emphasis added.]In the light of the authorities above, it is clear that where the name of a business is descriptive and it is the first of such business, it is difficult to show distinctiveness in the sense we have indicated earlier. Furthermore, when descriptive words are used, a slight difference between the names would suffice to distinguish them. This is illustrated inOffice Cleaning Services Ltd v Westminster Window & General Cleaners Ltd[1946] 63 RPC 39where both the plaintiffs and the defendants carried on the business of office cleaners, the former under the style `Office Cleaning Service` since 1930 and the latter `Westminster Office Cleaning` since 1933, which the defendants changed in 1942 to `Office Cleaning Association`. The plaintiffs sought to restrain the defendants from using the latter style on the ground that it was likely to cause confusion. The plaintiffs admitted that they had no monopoly in the two words `Office Cleaning` and that these two words had not acquired a secondary meaning so as to be distinctive of them. The High Court granted relief to the plaintiffs. This decision was reversed by the Court of Appeal which held that as the words here were clearly descriptive, and in the absence of fraud, a slight difference in the titles of the plaintiffs and the defendants would be a sufficient distinction. The Court of Appeal decision was upheld by the House of Lords. Lord Simmonds who delivered the leading judgment for the House said (at p 43):It comes in the end, I think, to no more than this, that where a trader adopts words in common use for his trade name, some risk of confusion is inevitable. But that risk must be run unless the first user is allowed unfairly to monopolise the words. The court will accept comparatively small differences as sufficient to avert confusion.Some other cases where the same principle was applied wereBritish Vacuum Cleaner Co Ltd v New Vacuum Cleaner Co Ltd(supra),McCain International Ltd v Country Fair Foods(supra),Burberrys v JC Cording & Co Ltd[1909] 26 RPC 693(concerning slip-on coats) andDeane v Schofield[1962]  RPC 179(involving `The Under Six Club` and `The Over-Six Club`).Reverting to the case in hand, and having considered the evidence, firstly, we do not think there was really any design on the part of the appellants to take an unfair advantage of the name `ONE.99` or `1.99`. As indicated before, the appellants` parent company had been engaging in ad hoc promotional sales of products at $1.99 from September 1997. Secondly, as the name `ONE.99` or `1.99` is in the circumstances descriptive, the measures which the appellants had taken to distinguish the two businesses, `Lifestyle 1.99` compared with `ONE.99 shop`, are adequate. The respondents cannot claim a monopoly to the concept of selling goods at a fixed price of $1.99 which would be the case if no others are allowed to use `1.99`. The additional word `Lifestyle` should suffice to differentiate. And when we take into account the fact that the colour scheme of their outlets, as well as their logo, are clearly different from those of the respondents, all the more so we do not think there could be any reasonable probability of deception.On the respondents` part they relied on the Canadian caseJoseph v Lee[1984] 78 CPR (2d) 159to argue that a name or mark in figures could acquire distinctiveness. There, the plaintiff was carrying on coin-operated games business as `501 Video`. Subsequently, the defendants commenced a similar business under the style `501 Arcade`. The defendants also selected free game cards of the same colour and conformation as free games cards issued by `501 Video`. An injunction against the defendants was issued by the County Court of Frontenne, Ontario. From the report, it seems to us that the learned judge did not draw any distinction between a fancy name and a descriptive name. He said that `501 Video` constituted `a sufficient descriptive term or trade name as to cause them to be distinguishing words`. None of the issues referred to inOffice Cleaning Serviceswere considered. It seems to us that the case could perhaps be justified on the ground that `501` was really fanciful, as it had nothing to do with coin-operated video games. Further, inJoseph v Leethere was clear evidence that the defendants there intended to deceive.It is not in dispute that `figures` could be distinctive, as decided inHymac Ltd v Priestman Brothers Ltd[1978]  RPC 495where the plaintiffs who were manufacturers of excavators made excavators known as the `580` series. This figure was derived from the capacity of the particular excavation bucket used on such machines which was five-eights of a cubic yard. The defendants also began to market an excavator using the figure `580` for identification. The defendants claimed that they were only using a number which had descriptive connotation and which anyone could use. The defendants could not show that `580` was derived from the capacity of their bucket. From the reasoning of Walton J what comes across is that he did not think that the figure `580` could be descriptive. We are fortified in this view by the following utterances he made:... given a number and nothing else it is quite impossible for anybody to deduce if that number refers to weight, bucket capacity or indeed engine power`. [At p 497.]even if it is known that the number refers to bucket capacity, that bucket capacity may be cubic yards, cubic metres, or litres. Even if that was known that is still not the end of the matter because the various manufacturers use various conventional multipliers. Insley use 1000, Menck use 100, Hitachi use 10 and Poclain use 10. There is absolutely  not that kind of consistency which enables one to say from the number what it is about and what it means at all. Even if one does know that it refers to bucket capacity one is just as wise as ever....whatever sensible multiplier you use you cannot get five-eighths from 580....Once one realises that the interpretation of the number 580 requires the kind of key that it does require, a key to be supplied by the plaintiffs, one wonders, why 580 was used by the defendants at all. I have seen nothing in the case to cause me to cease to wonder at that.` [At p 498.]Of courseHymacwas a case concerning the issue of an interlocutory injunction. As the court held that the plaintiff had shown there was a seriously arguable case for passing off and `conceivably fraud`, relief was granted.The Scottish casePC Products Ltd v Wilfred Doulton[1957]  RPC 199can also be distinguished on the ground that the mark was clearly fanciful. There the plaintiff manufactured a cleaning preparation known in the trade as `one thousand and one` and sold in bottles bearing a label on which were prominently displayed the figures `1001`. The defendant put on the market another cleaning preparation in bottles, also prominently displaying the figures `1001`. An injunction was granted against the defendant.Slazenger & Sons v Feltham & Co[1889] 6 RPC 531should similarly be distinguished because the use of the words `The Demon` on a tennis racquet must clearly be fanciful.Perhaps, to the perception of some, what the appellants had done amounted to riding on the favourable publicity generated by Ms Chong and her company on the new sales concept. While the law of passing off is adaptable to changing trading practices, there is no tort of unfair competition. The caseCadbury Schweppes Pty Ltd v Pub Squash Co Pty Ltd[1981] 1 All ER 213[1981] 1 WLR 193[1981]  RPC 429provides a useful illustration. There, the plaintiffs launched a lemon drink (`Solo`) with a publicity blitz. The defendants then launched a lemon drink (`Pub Squash`) with a get up and advertising theme closely resembling those for Solo. The Privy Council upheld the decision of the court below which dismissed the plaintiffs` claim for injunction and damages. The Privy Council held that the defendants had sufficiently distinguished their goods from those of the plaintiffs to prevent any likely confusion from arising. While in the court below an argument based on unfair competition was raised, it was not raised before the Privy Council.In the result, we do not think that the respondents have shown that there has been any misrepresentation. We noted the evidence relating to the survey results show that there were members of the public who thought the two businesses were related. But in the nature of things some such misconception would be inevitable when you have two businesses adopting a similar descriptive term as a part of their names. Given a little time the public will be able to distinguish, now that the two  businesses are operating side-by-side. Otherwise, it would amount to granting a monopoly to the person who happens to use that descriptive term first.In the light of our views above on the second element to establish the tort of passing-off, we do not think it is necessary for us to consider the third element relating to damage.",
        "Judgment": "In the premises, we would allow the appeal, set aside the decision of the court below and dismiss the respondents` claim. The appellants shall have the costs of the action below as well as this appeal. The security for costs shall be refunded to the appellants or their solicitors.Outcome:Appeal allowed.Copyright © Government of Singapore."
    }
}