{
    "case_title": "Ching Mun Fong (executrix of the estate of Tan Geok Tee, deceased) v Liu Cho Chit (No 2)",
    "ncitation": "[2001] SGCA 36",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "The proper parties": "17.    One of the defences raised by Mr Liu in the pleadings was\n\nthat the proper parties were not before the court. First, Madam Ching as the executrix of the estate\n\nof Mr Tan was not the proper plaintiff. The reason for this was that it was established in the 1983\n\naction that the monies paid to Mr Liu came from a company, Komala Decoff SA, and therefore the\n\nmonies belonged to that company and accordingly that company should be the plaintiff. Secondly, Mr\n\nLiu was not the proper defendant. Here, the reason was that in the 1984 action, the judge found that\n\nMadam Lim had entered into an agreement, through Mr Liu, to sell her interest in the Property and\n\nthat Mr Liu was only the agent for Madam Lim, and therefore the proper defendant should be Madam Lim\n\nand not Mr Liu.18.    On this issue, the judge held that the correct plaintiff\n\nshould be Lee Tat and that the correct defendant should be Madam Lim. The basis for this conclusion\n\nwas that the parties to the underlying agreement for the sale of Madam Lims alleged interest were\n\nMadam Lim and Lee Tat. The judge approached the issue thus:34 As regards the question as to who the correct plaintiff should be, I am of\n\n  the view that the material point is not where the monies came from or who paid the monies or who\n\n  the monies belonged to. The material point is who the contracting parties were. This would also be\n\n  the correct approach on the question as to who the correct defendant should be.35 For example, if X enters into a contract with Y to buy Ys interest in a\n\n  property and monies are paid pursuant to that contract to purchase Ys interest, it is\n\n  irrelevant as between X and Y whether the money came from Xs parents or a family company or a\n\n  financial institution. It is also irrelevant whether Y received the monies personally or not. X is\n\n  the correct person to sue and Y is the correct person to be sued if there is a total failure of\n\n  consideration on Ys part or if the payment was made pursuant to a mistake.The judge then turned to what was found in the 1983 and 1984 actions by the High\n\nCourt, and said:36 As I have mentioned, in the 1983 and 1984 actions, the trial judge had\n\n  found:(a) that the monies were paid as part payment of Mdm Lims interest in the\n\n    Property pursuant to an agreement in April 1981 which Mdm Lim had entered, through Liu, to sell\n\n    her interest to Lee Tat, and(b) that Mdm Lim had acquired an interest in the Property and therefore there\n\n    was something for her to sell. Accordingly the trial judge had ordered Lee Tat, and only Lee\n\n    Tat, to pay the balance of the purchase price to Mdm Lim.37 When the Court of Appeal reversed the trial judges decision, it was only\n\n  on the basis that Mdm Lim had not established that she had, or had acquired, an interest in the\n\n  Property.38 The Court of Appeal did not disturb the other findings of the trial judge in\n\n  the 1983 and 1984 actions, i.e. that the purchaser was Lee Tat and the vendor was Mdm Lim.39 Accordingly, as regards the causes of action based on mistake of fact and\n\n  total failure of consideration, and monies had and received, I am of the view that in the light of\n\n  the findings of the trial judge in the 1983 and 1984 actions, the claims before me should have\n\n  been made by Lee Tat against Mdm Lim and not by Mdm Ching, as executrix of Tans estate, against\n\n  Liu.40 As for the cause of action based on a remedial constructive trust, I am of\n\n  the view that even though Liu had received the monies, the findings of the trial judge in the 1983\n\n  and the 1984 actions would also mean that Liu had received the monies on behalf of Mdm Lim.\n\n  Whether he had parted with the monies to Mdm Lim is a matter between them. It would then follow\n\n  that it is Mdm Lim, not Liu, who is to account as trustee for the monies even if I should find\n\n  that the Plaintiff has established a remedial constructive trust.19.    Before us, Mr Michael Khoo, counsel for Madam Ching, argued\n\nthat the approach of the judge ignored the fact that the true contracting parties were Mr Tan and Mr\n\nLiu, which was accepted by Mr Liu in his evidence. On a true analysis of the facts, so far as Mr Liu\n\nwas concerned, Madam Lim was his nominee, and the interest in the Property which he thought had been\n\nacquired was his but held by Madam Lim as his nominee. In the negotiation with Mr Tan, Mr Liu acted\n\nin his personal capacity as the beneficial owner. As for Mr Tan, he also negotiated with Mr Liu as\n\nthe true owner of the Property and not as the agent for Lee Tat. The negotiations were conducted\n\nonly between Mr Tan and Mr Liu and the agreement was reached between them as the contracting\n\nparties, and the moneys were handed by Mr Tan to Mr Liu. Mr Khoo thus contended that the money\n\nshould be recovered from Mr Liu, not Madam Lim, and the action was properly brought by Madam Ching,\n\nas the executrix of the estate of Mr Tan, against Mr Liu.20.    On the other hand, Mr C R Rajah, counsel for Mr Liu, argued\n\nthat the claim brought by Madam Ching against Mr Liu was for the return of some $1.3 m paid by\n\nmistake as part of the purchase price under a contract for the purchase of an interest in the\n\nProperty, which the vendor did not have. The contract was made between Mr Liu on behalf of his wife,\n\nas the vendor and Mr Tan on behalf of Lee Tat as the purchaser. If this sum had to be returned, it\n\nwould be by the vendor, Madam Lim, to the purchaser, Lee Tat. On this point, Mr Rajah relied on what\n\ntranspired in the 1983 and 1984 actions and what the High Court found in those actions. He thus\n\nmaintained that the proper plaintiff should be Lee Tat and the proper defendant Madam Lim.21.    We were unable to agree with Mr Rajah. It should be borne\n\nin mind that, in the 1984 action, before the High Court and on appeal before this Court, the\n\nquestion as to the proper parties for the recovery of the sum of $1,368,420.71 (being the equivalent\n\nof US$642,451.01) was not in issue. The main issue there was whether Madam Lim had an interest in\n\nthe Property. The High Court held that she had, but on appeal this Court found that she had not\n\nestablished that she had such interest. As Mr Khoo rightly pointed out, both the High Court and this\n\nCourt, at times in the course of the respective judgments, dealt with the alleged interest in the\n\nProperty as interchangeably that of Mr Liu and Madam Lim. Certainly this Court did not make any\n\nclear distinction between the two.22.On the facts, there was no\n\ndoubt that both in the joint venture agreements made in January 1973 and in the sale of the alleged\n\ninterest in the Property in April 1981, the true contracting parties were Mr Tan and Mr Liu and\n\nnobody else. In respect of the joint venture, Mr Tan and Mr Liu were the ones who negotiated with\n\neach other and reached an agreement, which was then reduced into four separate agreements. So far as\n\nMr Liu was concerned, his wife, Madam Lim, was merely his nominee. In entering into the joint\n\nventure with Mr Tan in 1973, he made use of his wife as a nominal party to the joint venture\n\nagreements and signed the agreements on her behalf. She did not even know of the joint venture or of\n\nany of the agreements which were made in her name. The same applies to Mr Tan with regard to using\n\nhis daughter, Collin, and his family company, Lee Kai, in entering into the joint venture\n\nagreements. Mr Tan signed the agreements on behalf of Collin and Lee Kai respectively. Like Madam\n\nLim, Collin did not even know of the joint venture or any of the joint venture agreements. In truth\n\nand in fact, Mr Liu and Mr Tan were the contracting parties. As Mr Khoo submitted, and we agreed,\n\nnone of the nominal parties to the joint venture agreements had any independent thought or action as\n\nregards any of the agreements. Further, the subsequent dealings in relation to the proposed\n\ndevelopment on the joint venture site were between Mr Tan and Mr Liu only.23.    Subsequently, in April 1981, when Mr Liu and Mr Tan\n\nnegotiated on the sale and purchase of what was then believed to be Madam Lims or Mr Lius\n\ninterest in the Property, only Mr Liu and Mr Tan were the parties involved in such negotiations. So\n\nfar as Mr Liu was concerned, his wife was the nominee and the interest acquired was his, and in the\n\nnegotiations he was acting in his personal capacity as the beneficial owner of that interest. The\n\nevidence of Mr Liu was that he negotiated with Mr Tan on the sale of that interest, and they reached\n\nan agreement, whereby Mr Tan agreed to purchase that interest at the price of $3.8 m, and in part\n\npayment of the purchase price, Mr Tan handed to him the two cashiers orders for the total amount\n\nof US$642,451.04. It was Mr Tan who made the payment. Where he got the funds from was immaterial.24.    Even if it can be said, as it was so argued on behalf of Mr\n\nLiu, that Madam Lim was the contracting party and that the sum of US$642,451.01 was a purported part\n\npayment, through Mr Liu, to Madam Lim of what was then believed to be her interest in the Property,\n\nand thus the payment was made to Mr Liu as the agent for Madam Lim, an action could still be\n\nbrought, as was brought here, to recover that sum from him. He was the sole recipient and\n\nbeneficiary of this sum, and the irrefutable evidence was that no part of that sum was ever paid to\n\nMadam Lim. He had kept this sum and treated it as his. He could properly be sued, as he was here,\n\nfor repayment of the money that was paid to him. There is authority for the proposition that, where\n\na payer makes a payment to an agent of the payee under a mistake of fact, the payer can recover the\n\npayment from the agent, if the agent has not paid it over to the principal:Kleinwort, Sons &\n\nCo v Dunlop Rubber Co(1907) 97 LT 263, at 264 and 265. See also Goff and Jones,The Law of\n\nRestitution(5thedn) (1998) at pp 186 and 833.25.    Turning to Mr Tan, it was not in evidence that Mr Tan on\n\nbehalf of Lee Tat entered into the sale and purchase agreement with Mr Liu; there was only an\n\ninference that he probably did so, because the Property was then vested in Lee Tat. The undisputed\n\nevidence was that it was Mr Tan who negotiated with Mr Liu for the purchase of the alleged interest\n\nof Madam Lim or Mr Liu in the Property, that it was Mr Tan who agreed with Mr Liu on the price for\n\nthe alleged interest, and that it was Mr Tan who paid the monies to Mr Liu. The monies were clearly\n\nhis, and there was no evidence that the monies were Lee Tats. In any case, Lee Tat was his\n\nnominee and his company, and to all intents and purposes the Property was his. There was nothing to\n\nprevent him, on his own account, from purchasing what he believed was Madam Lims or Mr Lius\n\ninterest in the Property and made the part payment. Even if, acting as an agent of Lee Tat, he made\n\nthe payment to Mr Liu, he did so in the mistaken belief that Madam Lim or Mr Liu had an interest in\n\nthe Property, which in fact neither of them had. In such circumstances, that mistake was entirely\n\nhis and not his principals; nor could it be attributed to his principal, and he can recover the\n\nmonies from the payee: see Goff and Jones,The Law of Restitution(5thedn) (1998)\n\nat pp 183  184.26.    In our judgment, Madam Ching as the executrix of the estate\n\nof Mr Tan, was entitled to bring this action against Mr Liu for the recovery of the sum paid to him.\n\nThe proper parties were before the court. On this point, with respect, we were unable to agree with\n\nthe judge below.Periods of limitation27.    With respect to Madam Chings claim for money had and\n\nreceived for a total failure of consideration, the judge held that the cause of action was founded\n\non contract, and s 6(1)(a) of the Limitation Act (Cap 163) applied. As the money was paid to Mr Liu\n\non or about 23 April 1981, the claim for the recovery of this sum had been barred by 22 April 1987.\n\nHe said:72 I am of the view that such causes of action are founded on a contract for\n\n  the purpose of s 6(1)(a) of the Limitation Act (Cap 163) which states:6 - (1) Subject to this Act, the following actions shall not be brought after\n\n    the expiration of 6 years from the date on which the cause of action accrued:(a) actions founded on a contract or on tort;73 The monies which are the subject of this action were paid pursuant to the\n\n  oral contract to purchase Mdm Lims interest. The claim for monies had and received are also\n\n  founded on the oral contract in that it was not as though the monies were received on a basis\n\n  apart from the oral contract. In addition, the words founded on a contract are wide enough\n\n  to cover claims for the recovery of monies paid pursuant to a contract where the underlying\n\n  subject matter of the agreement did not exist or did not materialise.76 Accordingly these causes of action would be time-barred long before the\n\n  commencement of the present action on 4 June 1998.The judges reasoning on this point was, with respect, correct. We agree with\n\nhim entirely.28.    We now turn to the claim for recovery of the monies on the\n\nground that the payment was made under a mistake. If the monies were paid under a mistake, then the\n\nlimitation period for Madam Lims action would have been postponed under s 29(1)(c) of the\n\nLimitation Act. The provision states:29(1) Where, in the case of any action for which a period of limitation is\n\n  prescribed by this Act",
        "(c) the action is for relief from the consequences of a mistake, the period of\n\n  limitation shall not begin to run until the plaintiff has discovered the fraud or the mistake, as\n\n  the case may be, or could with reasonable diligence have discovered it.": "29.    It was Mr Khoos contention that payment of the\n\nUS$642,451.04 was made under a mistake of law, and that this mistake could not have been discovered\n\nuntil this Court delivered its decision on 6 February 1998. He thus argued that the present\n\nproceedings, which were commenced in 1998, were not time barred. This argument was rejected by the\n\njudge below. We too rejected it.30.    There was ample evidence before the court that Mr Tan\n\ndiscovered the mistake long before the judgment of this Court was delivered. The judge laid out the\n\nevidence as follows:93 By a letter dated 4 May 1983, M/s Drew & Napier, acting for Fook Gee,\n\n  demanded the return of the monies paid and interest from Liu on the basis that Fook Gee had lent\n\n  the monies to Liu.94 By a letter dated 11 May 1983, M/s Allen Yau, acting for Liu, replied. They\n\n  said that Liu had received on behalf of Mdm Lim the monies from Lee Tat. They also said that the\n\n  monies represented part payment of a purchase price for Mdm Lims interest in the Property.95 By a letter dated 27 July 1983, M/s Drew & Napier asserted that Mdm Lim\n\n  never had any direct interest in the land.96 M/s Drew & Napier must have been taking instructions from Tan as Tan was\n\n  controlling Fook Gee and Lee Tat.97 Lee Tats and Tans position was reiterated in paragraph 12 of the\n\n  Amended Defence (of the first three defendants), filed on 7 October 1987, in the 1984 action,\n\n  which states:12. Paragraphs 5 and 6 of the Statement of Claim are denied. Further the\n\n    Statement of Claim discloses no share which the Plaintiff owned at the said date which she could\n\n    agree to sell. The Defendants reserve the right to plead further hereto when the case is\n\n    properly particularised.Apart from the pleadings filed in that action, Mr Tan himself asserted in his\n\naffidavit filed on 1 February 1989 that Madam Lim had no interest in the Property. Thus, as of that\n\ndate, if not earlier, he had already discovered the mistake. That was the most damning piece of\n\nevidence against the claim that the mistake was not discovered until the decision of this Court. The\n\njudge referred to Mr Tans affidavit and said:99 Furthermore, paragraph 20(iii) of Tans affidavit affirmed on 1 February\n\n  1989 for the 1984 action stated:(20) In June 1984, 11 years after the alleged Second Agreement was\n\n    purportedly entered into, the Plaintiff commenced this action to claim the following relief:-(iii) as against the 1st Defendants and/or myself, she claims specific\n\n      performance of a purported oral agreement made sometime in April 1981, under which the 1st\n\n      Defendants and/or myself allegedly agreed to buy her share in Lot 1606 of Mukim 28 for $3.8\n\n      million (hereinafter called \"the alleged oral Third Agreement\").100 Paragraphs 25(a) and 27 to 29 of the same affidavit stated:(25) The Plaintiffs claim that the 1st Defendants are holding Lot 1606 of\n\n    Mukim 28 on trust for her and Collin Tan is also misconceived and cannot be sustained for the\n\n    following reasons:-(a) At all material times, the Plaintiff hadno proprietory interest in\n\n      the property;(b)(c)(26)(27) Further, for any or all of the above reasons, the Plaintiff hadno\n\n    interest in the propertyand, consequently, nothing for which she could allegedly sell to\n\n    the 1st Defendants or myself.(28) Besides, the 1st Defendants were at all material times the de facto and\n\n    de jure owner of the property (including Lot 1606 of Mukim 28). Even if the alleged oral Third\n\n    Agreement existed, which is denied, there was no consideration to support it.(29)  At the time of the alleged oral Third Agreement, she had no right\n\n    whatsoever in the property. For this reason, the alleged oral Third Agreement is invalid for\n\n    want of consideration. [Emphasis is added]In view of what had transpired, it was impossible to argue on behalf of Madam\n\nChing that Mr Tan could not have known about Madam Lims want of interest until this Courts\n\ndecision. At the latest, Mr Tan knew about it by 1 February 1989, when he affirmed the affidavit.\n\nEven if the limitation period was postponed by virtue of s 29(1)(c) of the Limitation Act, the time\n\nbar would have set in by 1 February 1995, at the latest.31.    The following argument was, nevertheless, raised by Mr Khoo\n\non behalf of Madam Ching in the Appellants Case:86. It was held by the Lords inKleinwort Benson v Lincoln County Councilthat the date when the local authority interest swap rate transactions proved to be void was when\n\n  the House of Lords made its decision inHazell v Hammersmith and Fulham London Borough Council.\n\n  It is submitted that it is implicit if not express in that judgment that the cause of action to\n\n  recover a payment made under a mistake of law only accrues when the court determines that there is\n\n  a mistake of law...89. Therefore it was not until the Court of Appeal judgment of 6thFebruary 1998 that it was established that there had been a mistake in 1981 when the moneys were\n\n  paid over to the respondent. The mistake was therefore not \"discovered\" until the Court\n\n  of Appeal held that Mdm Lim/the respondents assumed interest was not an interest at all.32.    We were unable to accept this argument. The provision in\n\nquestion is s 29(1)(c) of the Limitation Act, which states quite clearly that time begins to\n\nrun once the plaintiff could with reasonable diligence have discovered the mistake. As far as\n\ns 29(1)(c) is concerned, it is the plaintiffs means of ascertaining the mistake, and not what the\n\ncourt eventually decides, that is relevant in determining when the limitation period begins to run.\n\nWhile the fact that Madam Lim (or Mr Liu) had no interest in the Property was determined only after\n\nthis Courts decision on 6 February 1998, Mr Tan obviously knew about the true state of affairs\n\nlong before that date. In fact, he had already discovered the mistake by the time he affirmed his\n\naffidavit on 1 February 1989. In these circumstances, it was impossible to maintain that Mr Tancould\n\nnot with reasonable diligencehave discovered that Madam Lim (or Mr Liu) had no interest in the\n\nProperty until only after the decision of this Court.Remedial constructive trust33.    Mr Khoo finally argued that the court should impose a\n\nconstructive trust on the sum of US$642,451.01 paid to Mr Liu. His argument was along the following\n\nline. The money was paid to Mr Liu under a mistake, and although the mere receipt of the money in\n\nignorance of the mistake did not give rise to a trust in favour of Mr Tan at that time, the\n\nretention of the money by Mr Liu after he discovered the mistake, i.e. after this Court had\n\ndelivered its decision, gave rise to a constructive trust, because thenceforward his conscience was\n\naffected by the fact that the monies received by him had been paid for no consideration or under a\n\nmistake. It was the continued retention of such monies by Mr Liu that gave rise to this remedial\n\nconstructive trust, which the court should now impose, requiring Mr Liu to return the money to Mr\n\nTan. Mr Khoo then invoked s 22(1) of the Limitation Act, which provides:No period of limitation prescribed by this Act shall apply to an action by a\n\n  beneficiary under a trust, being an action. . . . .(b) to recover from the trustee trust property or the proceeds thereof in the\n\n  possession of the trustee, or previously received by the trustee and converted to his use.34.    A remedial constructive trust arises where the court\n\nimposes a constructive trust de novo on assets which are not subject to any pre-existing trust as a\n\nmeans of granting equitable relief in a case where it considers just that restitution should be made\n\n(per Slade LJ inMetal Und Rohstoff A G v Donaldson Lufkin & Jenerette Inc and Anor[1990] 1 QB 391, 478. Slade LJ, however, said (at p 479) that the extent to which a constructive can\n\nproperly be treated as a remedy is far from clearly defined in the authorities, and said at the end\n\nof p 479:While we have had the benefit of very full argument on almost all other aspects\n\n  of the law involved in this case, we have neither heard nor invited comprehensive argument as to\n\n  the circumstances in which the court will be prepared to impose a constructive trust de novo as a\n\n  foundation for the grant of equitable remedy by way of account or otherwise. Nevertheless, we are\n\n  satisfied that there is a good arguable case that such circumstances may arise and, for want of a\n\n  better description, will refer to a constructive trust of this nature as a \"remedial\n\n  constructive\" trust.35.    Mr Khoo relied on certain dicta of Lord Browne-Wilkinson inWestdeutsche Landesbank Gironzentrale v Islington London Borough County Council[1996] AC\n\n669. In that case, a bank in June 1987 entered into a swap contract with a local authority,\n\nand pursuant to that contract paid certain sums to the local authority. As a result of the decision\n\nof the House of Lords inHazell v Hammersmith and Fullam London Borough Council[1992] 2 AC\n\n1, such a contract was ultra vires the authorities and therefore void. The bank therefore sought the\n\nrecovery of the sums from the local authority it had paid together with compound interest and\n\nsucceeded before the trial judge and the Court of Appeal. The local authority appealed to the House\n\nof Lords and one of the questions for consideration was whether the bank could get compound interest\n\non the sums recovered from the authority. As the general rule was that, in the absence of fraud,\n\nequity would not award compound interest except against trustees or other persons in a fiduciary\n\nposition in respect of profits improperly made, the bank sought to argue that the sums received by\n\nthe authority were held on trust for the bank. This argument was rejected and it was held, inter\n\nalia, that a recipient of monies under a contract subsequently declared void or as being ultra vires\n\ndoes not hold those monies on a resulting trust and that equity would not award the bank compound\n\ninterest in aid of their common law claim of restitution. In the course of his speech, Lord\n\nBrowne-Wilkinson discussed the possibility of a remedial constructive trust being available and\n\ndistinguished the remedial constructive trust from the normal institutional constructive trust as\n\nfollows:Under an institutional constructive trust, the trust arises by operation of law\n\n  as from the date of the circumstances which give rise to it: the function of the court is merely\n\n  to declare that such trust has arisen in the past. The consequences that flow from such trust have\n\n  arisen (including the possibly unfair consequences to third parties who in the interim have\n\n  received the trust property) are also determined by rules of law, not under a discretion. A\n\n  remedial constructive trust, as I understand it, is different. It is a judicial remedy giving rise\n\n  to an enforceable equitable obligation: the extent to which it operates retrospectively to the\n\n  prejudice of third parties lies in the discretion of the court.And later at p 716 his Lordship said:Although the resulting trust is an unsuitable basis for developing proprietary\n\n  restitutionary remedies, the remedial constructive trust, if introduced into English law, may\n\n  provide a more satisfactory road forward. The court by way of remedy might impose a constructive\n\n  trust on a defendant who knowingly retains property of which the plaintiff has been unjustly\n\n  deprived. Since the remedy can be tailored to the circumstances of the particular case, innocent\n\n  third parties would not be prejudiced and restitutionary defences, such as change of position, are\n\n  capable of being given effect. However, whether English law should follow the United States and\n\n  Canada by adopting the remedial constructive trust will have to be decided in some future case\n\n  when the point is directly in issue.36.    Reverting to the case at hand, the judge below held that\n\neven if remedial constructive trust applies in Singapore, no remedial constructive trust arose in\n\nthis case. He said:141  I am satisfied that on the particular facts before me, the Plaintiff\n\n  has failed to establish such a trust.142 The Plaintiffs case was that the payment was made pursuant to a contract\n\n  of sale of Mdm Lims interest. The Court of Appeal has found that Mdm Lim did not have such an\n\n  interest.143 The Plaintiff is in no better position than the depositors inSinclair v\n\n  Broughamwhere the monies were paid pursuant to a void contract.144 As in that case, when the monies were paid to purchase Mdm Lims\n\n  interest, it was intended that she should be free to deal with the monies and she was entitled to\n\n  mix the monies with other monies of hers or anyone else for that matter. Whether it was in fact\n\n  mixed is irrelevant.145 The Plaintiffs cause of action is one based on a total failure of\n\n  consideration and not trust. Mdm Lim has been unjustly enriched and was accountable for the monies\n\n  received but the relationship was exclusively commercial and the monies were and are not trust\n\n  property.We agree with these observations of the judge. A remedial constructive trust is a\n\nrestitutionary remedy which the court, in appropriate circumstances, gives by way of equitable\n\nrelief. In order for a remedial constructive trust to arise, the payees conscience must have been\n\naffected, while the monies in question still remain with him. If, as was the situation in theWestdeutschecase, the payee learns of the mistake only after the monies have got mixed with other funds or\n\ndissipated, no constructive trust in respect of these monies can arise. This is because there would\n\nno longer be an identifiable fund for the trust to bite. It is significant to note that the\n\nplaintiff bank in theWestdeutschecase expressly disavowed any intention of pursing a claim\n\nin constructive trust. The reason for their not having done so was stated by Lord Browne-Wilkinson\n\nat p 707:This is not a case where the bank had any equitable interest which pre-dated\n\n  receipt by the local authority of the upfront payment. Therefore, in order to show that the local\n\n  authority became a trustee, the bank must demonstrate circumstances which raised a trust for the\n\n  first time either at the date on which the local authority received the money or at the date on\n\n  which payment into the mixed account was made.Counsel for the bank specifically disavowed any\n\n  claim based on a constructive trust. This was plainly right because the local authority had no\n\n  relevant knowledge sufficient to raise a constructive trust at any time before the moneys, upon\n\n  the bank account going into overdraft, became untraceable. Once there ceased to be an identifiable\n\n  trust fund, the local authority could not become a trustee:In re Goldcorp Exchange Ltd.[1995] 1 A.C. 74. Therefore, as the argument for the bank recognised, the only possible trust\n\n  which could be established was a resulting trust arising from the circumstances in which the local\n\n  authority received the upfront payment. [Emphasis is added]37.    Turning to the facts of this case, we found that there was\n\nno ground for imposing a remedial constructive trust on Mr Liu in respect of the sum US$642,451.01\n\npaid to him. The relationship between Mr Liu and Mr Tan was only that of a vendor and purchaser and\n\nwas wholly commercial. There was no dishonest conduct on the part of Mr Liu The sum was paid to Mr\n\nLiu in April 1981 with the intent that he was free to deal with it as his money. It was never\n\nintended by either Mr Tan or Mr Liu that it should be kept, and it had never been kept, distinct as\n\nan identifiable fund. On the basis of Mr Khoos contention that Mr Liu discovered the mistake only\n\nin February 1998 or thereabouts, there was a span of some 17 years and the sum paid to Mr Liu must\n\nhave, in the meanwhile, been spent or mixed with other funds of Mr Liu. There was no sum or fund on\n\nwhich a remedy of constructive trust could be imposed by the court. The sum paid to Mr Liu was\n\ncertainly not trust property. There was, of course, an obligation on the part of Mr Liu to return\n\nthe monies to Mr Tan, but that was only a personal obligation. In our judgment, no remedial\n\nconstructive trust could and should be imposed on the facts of this case.Conclusion38.    In the result, Madam Chings appeal failed, and we\n\ndismissed it.Yong Pung HowL P TheanChao Hick TinChief JusticeJudge of AppealJudge of AppealCopyright © Government of Singapore."
    }
}