{
    "case_title": "Collector of Land Revenue v Heng Long Investment Pte Ltd",
    "ncitation": "[2001] SGCA 47",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "Background": "2.    The respondent, Heng Long Investment Pte Ltd\n\n(‘Heng Long’) owned three plots of adjoining land, namely, Lots 119-4, 119-5 and\n\n121-17, with frontages to Kovan Road and Upper Serangoon Road. The total land area of\n\nthese plots was 3,898.1 square metres.3.    By declaration No. 2134 made on 24 June 1996,\n\nwhich was published in the Government Gazette No. 32 on 28 June 1996, notice was given\n\npursuant to s 5 of the Act for the acquisition of all the three plots of land for a public\n\npurpose, namely for the Northeast MRT line and for comprehensive development.4.    Pursuant to s 10 of the Act, an inquiry was held\n\non 2 August 1996 before the Collector of Land Revenue (‘the Collector’), and\n\nHeng Long submitted a claim of $26,000,000 as compensation for the acquisition. This claim\n\nwas partly supported by a report by JLW Property Consultants Pte Ltd which valued the\n\nacquired land at $20,000,000 as at 1 January 1995. On 28 October 1996, the Collector\n\nawarded Heng Long an amount of $16,760,000 (for the land and buildings with vacant\n\npossession) as the market value of the acquired land at the relevant date.5.    Heng Long appealed to the Appeals Board against\n\nthe Collector’s award, claiming the sum of $20,000,000 as the market value of the\n\nacquired land. In addition, at the hearing before the Appeals Board, Heng Long also\n\nclaimed under s 33(1)(e) of the Act a sum of $220,200 for stamp duty as an expense\n\nthey had incurred as a result of the compulsory acquisition. This claim for stamp duty was\n\nmade for the first time before the Appeals Board; it was not made at the inquiry before\n\nthe Collector.",
        "The decision of the Appeals Board": "6.    The Appeals Board rejected altogether the\n\nvaluation put forward by Heng Long’s valuer and determined that the market value of\n\nthe acquired land was $15,647,610, which was lower than the Collector’s award of\n\n$16,760,000. As for the claim for the stamp duty in the sum of $220,000, the Collector\n\nconceded that Heng Long was entitled to the claim. He therefore submitted before the\n\nAppeals Board that the total amount to which Heng Long was entitled was only $15,867,610,\n\ncomprising the market value of $15,647,610 of the acquired land as determined by the\n\nAppeals Board and the stamp duty of $220,000. However, by reason of s 35(1) of the Act,\n\nthe Appeals Board has no power to award as compensation a sum less than the amount awarded\n\nby the Collector, and accordingly the Appeals Board should award the sum of $16,760,000\n\n(which was the amount awarded by the Collector), the stamp duty of $220,000 being included\n\nin the award.7.    The Appeals Board did not agree with the\n\nCollector’s submission. The Appeals Board took the view that the market value of the\n\nland represented a head of the claim under s 33(1) of the Act. Although the amount awarded\n\nby the Collector for the market value of the acquired land was more than that determined\n\nby the Appeals Board, by reason of s 35(1) of the Act, the Appeals Board did not have the\n\npower to award a sum less than the amount awarded by the Collector for that particular\n\nhead of claim. As for the stamp duty of $220,000 claimed by Heng Long, it came under a\n\ndifferent head of claim, wholly different from that relating to market value. It was not\n\nincluded in the award made by the Collector. Therefore, to the amount of $16,760,000\n\nawarded by the Collector, there still had to be added the sum of $220,000, which formed a\n\nseparate head of claim, to make the total award. The Commissioner of the Appeals Board\n\nsaid:[W]hen this matter was heard by the Collector, she was dealing with\n\n  market value of the land – that is made abundantly clear in her grounds of award\n\n  which I summarized a moment ago. She determined the market value of the land and buildings\n\n  with vacant possession and gave an award of $16,760,000. No claim had been put forward to\n\n  her under Section 33(1)(e) as has been put forward before us. We understand and appreciate\n\n  what Mr Chin has said that at the end of the day there has to be one composite figure for\n\n  compensation. However in that one composite figure, there would be various matters,\n\n  various headings, as I have enumerated, and in this case, the appellant made a claim for\n\n  stamp duty expenses which the respondent concede the appellants are entitled to. So far as\n\n  market value is concerned, we have ruled after hearing the evidence, having heard all the\n\n  evidence, that the correct market value must be as put forward for the respondents, the\n\n  sum of $15,647,610, which is less than the market value as given by the Collector at\n\n  $16,760,000. Mr Chin for the respondent submits that in making the award, the sum of\n\n  $220,200, being stamp duties, which the respondent concedes the appellants are entitled\n\n  to, is absorbed into the Collector’s award of $16,760,000. With respect, we cannot\n\n  agree with that. As I have sought to demonstrate, that relates purely to the market value\n\n  of the land. This other sum of $220,200 is another matter – wholly different from\n\n  that relating to market value. Because we do not have the power to reduce the award that\n\n  has already been made by the Collector which is more than the market value as we\n\n  determined it to be, there still has to be added the sum of $220,200 which forms a\n\n  separate head of claim to make the total award. In those circumstances, the award of this\n\n  Board will have to be what the Collector gave plus the sum of $220,200, making a total\n\n  award of --- what’s the amount? $16,980,200. Am I right?8.    In the result, the Appeals Board awarded Heng Long\n\nthe sum of $16,980,000, comprising: (i) $16,760,000 as the market value of the land, and\n\n(ii) $220,000 as the stamp duty paid. The Collector appealed against this award.",
        "Preliminary issue": "9.    Under s 29(2) of the Act, an appeal from the\n\ndecision of the Appeals Board can only be brought to this Court on a question of law.\n\nBefore us, a preliminary issue was raised as to whether the issue raised under appeal was\n\none of law. Mr Eric Chin, counsel for the Collector, conceded that Heng Long was indeed\n\nentitled to claim as part of the compensation the amount of stamp duty it had paid.\n\nHowever, he submitted that whether the amount of stamp duty claimed ought to be included\n\nas part of the amount awarded turned on the interpretation of s 35(1) of the Act.10.    On the other hand, Mr Alan Wong, counsel for Heng\n\nLong, contended that there was no question of law to be decided in this appeal and\n\ntherefore the appeal fell foul of s 29(2) of the Act and should necessarily be dismissed.\n\nMr Wong argued that the only issue in this appeal was whether the Appeals Board could add\n\nthe $220,000, representing stamp duty paid by Heng Long, to the amount awarded by the\n\nCollector and that this was a question of fact.11.    We agreed with Mr Chin that the issue in this\n\nappeal was one of statutory interpretation. It is settled law that questions as to the\n\ncorrect interpretation of statutory provisions are indeed questions of law. In our\n\njudgment, the Collector was entitled to bring this appeal under s 29(2) of the Act.",
        "The substantive points in this appeal": "12.    The issue raised turned on the true construction\n\nof s 35(1) of the Act which provides as follows:35. --(1) Where the applicant has made a claim to compensation pursuant\n\n  to any notice under section 8, the amount awarded to him shall not exceed the amount so\n\n  claimed or be less than the amount awarded by the Collector under section 10.The crucial issue revolved around how the phrase ‘the amount\n\nawarded’ in s 35(1) was to be interpreted – should it be construed to mean the\n\ntotal compensation awarded or should it relate to each of the six items or matters\n\nreferred to in s 33(1) of the Act?13.    Mr Chin submitted that under the Act, the\n\nCollector was obliged to make one composite award after considering, in so far as\n\nrelevant, each of the six matters falling within s 33(1) of the Act. The Collector was not\n\nobliged to give a breakdown of the amounts attributed to each of the six matters listed.\n\nThat being the case, Mr Chin argued that on the true construction of s 35(1) ‘the\n\namount awarded’ means the composite award and not any specific sum for each of the\n\nmatters listed in s 33(1).14.    Therefore, Mr Chin’s contention was that the\n\nAppeals Board was mistaken in taking the view that it had to apply s 35(1) to each of the\n\nsix matters set out in s 33(1) as the ‘heads of claim’, as opposed to\n\napplying it to the composite award made. The ‘amount awarded’ under s 35(1) does\n\nnot mean the individual amount that may be attributed to each ‘head of claim’\n\nthat makes up the award butthe total composite awardmade under s 10 of the Act.\n\nHis position was that under s 35(1), the Appeals Board was free to reduce or increase the\n\namounts attributed to the heads of claim under s 33(1), but the total composite amount\n\nawarded should not exceed the amount claimed or be less than the amount awarded by the\n\nCollector.15.    Adopting this interpretation, Mr Chin argued\n\nthat, as the Appeals Board found that the market value of the acquired land was\n\n$15,647,610, which was an item referred to in s 33(1)(a) and that an expense in the sum of\n\n$220,000 was incurred as a result of the compulsory acquisition, which was an item falling\n\nwithin s 33(1)(e), the total composite figure for the award was therefore $15,867,610.\n\nHowever, by reason of s 35(1) of the Act, the Appeals Board could not award an amount\n\nless than the amount awarded by the Collector. As a result, the Appeals Board should have\n\nordered the Collector’s award of $16,760,000 to stand. Instead, the Appeals Board\n\ntook the view that, as it could not reduce the Collector’s award of $16,760,000 as\n\nthe market value, it added to this amount a further sum of $220,000 for the stamp duty\n\nincurred, thus making a total award of $16,980,000.Our decision16.    We turn first to s 33(1) of the Act, which so\n\nfar as material provides:33.—(1) In determining the amount of compensation to be awarded\n\n  for land acquired under this Act, the Board shall, subject to subsections (2), (3) and\n\n  (4), take into consideration the following matters and no others:(a) the market value —…..(b) any increase in the value of any other land of the person\n\n    interested likely to accrue from the use to which the land acquired will be put;(c) the damage, if any, sustained by the person interested at the time\n\n    of the Collector’s taking possession of the land by reason of severing that land from\n\n    his other land;(d) the damage, if any, sustained by the person interested at the time\n\n    of the Collector’s taking possession of the land by reason of the acquisition\n\n    injuriously affecting his other property, whether movable or immovable, in any other\n\n    manner;(e) if, in consequence of the acquisition, he is compelled to change\n\n    his residence or place of business, the reasonable expenses, if any, incidental to that\n\n    change; and(f) if, in consequence of the acquisition, any reissue of title is\n\n    necessary, the fees or costs relating to survey, issue and registration of title, stamp\n\n    duty and such other costs or fees which may reasonably be incurred.Clearly in determining the amount of compensation to be awarded, the\n\nAppeals Board is required by s 33(1) to take into consideration such of these matters\n\nenumerated in sub-s (1) as are relevant. Having considered such of the matters as are\n\nrelevant, the Appeals Board then proceeds to make an award of compensation. The amount the\n\nAppeals Board makes is one composite award. There is nothing in the Act which requires the\n\nBoard to make, or entitles the Board to make, a separate award for each of the matters (so\n\nfar as they are relevant) listed in s 33(1).17.    Having determined the amount of the award, the\n\nBoard then applies s 35(1) which is as follows:35. --(1) Where the applicant has made a claim to compensation pursuant\n\n  to any notice under section 8,the amount awardedto him shall not exceed the\n\n  amount so claimed or be less thanthe amount awarded by the Collectorunder section\n\n  10. [Emphasis is ours]It is clear to us that the words ‘amount awarded to him’ in\n\nthe context of the subsection clearly means the amount awarded by the Appeals Board. Now,\n\nin this case, the amount awarded by the Appeals Board comprises two sums: (i) the sum of\n\n$15,647,610 as the market value of the land acquired, a matter falling within\n\ns 33(1)(a), and (ii) the sum of $220,000 as the stamp duty incurred as a consequence\n\nof the compulsory acquisition, a matter falling within s 33(1)(e). The total of these two\n\ncomponents came to $15,867,610, and this total sum representedthe amount awardedto\n\nHeng Long as compensation. Now, the amount awarded by the Collector under s 10 of the Act\n\nwas $16,760,00. As the amount awarded by the Appeals Board was less thanthe amount\n\nawarded by the Collector, s 35(1) of the Act applied and the Appeals Board was obliged\n\nunder that section to award an amount not less than the amount awarded by the Collector.\n\nIn other words, the Appeals Board was obliged to award the amount of $16,760,000 to Heng\n\nLong. For the purpose of s 35(1) the total composite amount awarded has to be looked at\n\nand not the various sums or components that make up the total. In our judgment, the\n\nAppeals Board was not entitled to treat, as the amount awarded, the amount of $16,760,000\n\nbeing the market value of the acquired land and then add to it the amount of $220,000 as\n\nthe stamp duty incurred, thereby awarding in total a sum of $16,980,000.18.    In this regard, we found the Indian authorities\n\ncited by Mr Chin to be highly persuasive and pertinent. The provisions of the Act,\n\nincluding s 35(1), are almost identical to the Indian equivalent, specifically the Indian\n\nLand Acquisition Act 1894 (‘the Indian Act’). Section 35(1) of our Act is\n\nsubstantially the same as s 25 of the Indian Act. The interpretation of s 25 of the Indian\n\nAct has been dealt with in numerous Indian cases.19.    Firstly, in the case ofBai Jadav and others v\n\nCollector of BroachAIR 1926 Bombay 372, Macleod CJ said at p 372:We do not think then, that the Judge was in error in infringing the\n\n  rule under which the Court is not entitled to award as compensation to a claimant under\n\n  the Land Acquisition Act an amount less than the amount offered by the Collector. The\n\n  compensation…..is to be determined after certain matters have been taken into\n\n  consideration by the Court andthe total compensation has to be looked to and not the\n\n  various items which make up that total. [Emphasis is ours]20.    Some seven years later, the case ofSecretary\n\nof State v F.E. DinshawAIR 1933 Sind 21 went before the courts. Rupchand AJC said at\n\np 24:…..it would appear that s 25 wasintended to refer to the whole\n\n  claim made by the claimant and the whole amount of compensation awarded to him…..,\n\n  and to empower the Judge to alter the award of the Land Acquisition Officer under any one\n\n  or more of the sub-heads by either decreasing and increasing the amount awarded, provided\n\n  he did not award less than the total amount awarded by that officer or more than the total\n\n  amount claimed before that officer by the claimant. [Emphasis is ours]21.    Rupchand AJC also referred to the case ofGangadhara\n\nShastri v Deputy Collector of Madras(1912) 14 IC 270, where the same principles\n\napplied – that the whole case and not merely the particular objection should be\n\nreferred to; therefore it is open to the judge to award a sum less than that awarded by\n\nthe Land Acquisition Officer in respect of some of the sub-items, provided of course that\n\nthe total amount which he awards to the claimant on all items is not less than that\n\noriginally awarded by the Land Acquisition Officer.22.    The next relevant case wasSecretary of State\n\nv Malik Amir Mohammad KhanAIR 1935 Lahore 653. A very pertinent passage from the\n\njudgment of Din Mohammad J at p 655 reads as follows:It is no doubt true that the award made by the Collector cannot be\n\n  reduced, butthis restriction is confined to the award on the whole and not to its\n\n  component parts. There is nothing in s 25(1) which precludes the District Judge from\n\n  introducing variations in different items that make up the award so long as the total\n\n  amount is not reduced. We cannot import into the plain language of section 25(1)\n\n  restrictions which do not exist there andthe only reasonable construction that can be\n\n  placed on the language employed therein is that it is only the total compensation made by\n\n  the Collector that cannot be reduced. [Emphasis is ours]23.    Finally the court in the case ofSardar Sujan\n\nSingh and others v Secretary of StateAIR 1936 Peshawar 217 confirmed that the\n\nDistrict Judge had the power and was entitled to add some item while reducing another from\n\nthe Collector’s award with the result that the total award wasincreased.\n\nThe only limitation to the court’s power was that it could notdecreasethe\n\nCollector’s total award.",
        "Conclusion": "24.    In our judgment, the expression the ‘amount\n\nawarded’ refers to a composite award made by the Appeals Board and the Collector\n\nrespectively and not to each separate head of claim under s 33(1). The Act clearly\n\nenvisages the award of a composite figure, as opposed to an individual award for each head\n\nof claim.25.    In our judgment, the Appeals Board, having\n\ndetermined that the market value of the acquired land was $15,647,610, should have added\n\nto it the sum of $220,000, representing the stamp duty, thus making one composite award of\n\n$15,867,610. As this amount was less than the Collector’s award of $16,760,000, the\n\nAppeals Board, as required under s 35(1) of the Act, should have awarded to Heng Long the\n\nsum of $16,760,000. We accordingly allowed the appeal, and made an award of $16,760,000 to\n\nHeng Long.Sgd:Yong Pung HowChief JusticeSgd:L P TheanJudge of AppealSgd:Chao Hick TinJudge of AppealCopyright © Government of Singapore."
    }
}