{
    "case_title": "Harris Hakim v Allgreen Properties Ltd",
    "ncitation": "[2001] SGCA 61",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "The facts": "1. The relevant facts giving rise to the appeal now before us are as follows. The appellant, Mr\n\nHarris Hakim ('Mr Hakim') entered into a sale and purchase agreement dated 14 May 1996 ('the\n\nAgreement') with the respondents, Allgreen Properties Ltd ('Allgreen'), whereby Mr Hakim agreed to\n\npurchase from Allgreen an apartment in a private housing development called 'Springdale Condominium'\n\nwhich was then being developed by Allgreen. The Agreement was in the form prescribed as Form E by\n\nthe Housing Developers Rules (1990 ed) and incorporated within it the Singapore Law Society's\n\nConditions of Sale 1994, in so far as those conditions were applicable to the sale and were not\n\nvaried by or were not inconsistent with the terms of the Agreement.2. The purchase price for the apartment was $1,165,000, which was to be paid by instalments at\n\ndifferent stages of the construction as provided in cl 3 of the Agreement. It was provided by cl\n\n5(1) of the Agreement that, in the event that Mr Hakim defaulted in payment of any instalment for\n\nmore than 14 days, Allgreen would be entitled to charge interest at the specified rate as provided\n\nin cl 5(2). By cl 5(3), the Agreement further provided that if Mr Hakim should default in payment of\n\nany instalment for more than 14 days, Allgreen would be entitled, at their option on giving not less\n\nthan 21 days' notice to Mr Hakim, to treat the Agreement as having been repudiated and, unless in\n\nthe meanwhile the unpaid instalments and interest were paid up, upon the expiration of the 21 days,\n\nthe Agreement would be annulled, and in such event, without prejudice to any other rights available\n\nto Allgreen at law or in equity, Allgreen would be entitled to certain rights as provided in\n\nparagraphs (a), (b) and (c) of cl 5(3). We shall refer to the terms of this clause in detail in a\n\nmoment.3. About two years later, Mr Hakim ran into financial difficulties, and found it difficult to\n\nkeep up with the instalment payments. By that time, the total amount of instalments Mr Hakim had\n\npaid to Allgreen under the Agreement amounted to $669,000. By a letter dated 28 July 1998, written\n\nby his solicitors to Allgreen, he requested the latter to serve him a notice under clause 5 of the\n\nAgreement and thereafter to exercise their rights under cl 5(3): forfeit the sum of $233,000, which\n\nis 20% of the purchase price of $1,165,000, deduct it from the sum of $699,000, being the total of\n\nthe instalments previously paid, and refund the balance thereof to him. Allgreen, however, refused\n\nto accede to this request.4. Mr Hakim continued to default in the payment of further instalments. Finally, on 19 August\n\n1999, Allgreen decided to invoke cl 5(3) of the Agreement. Allgreen's solicitors sent a notice to Mr\n\nHakim pursuant to cl 5(3) which, so far as relevant, read as follows:We refer to the above matter and note that the progress payments under clauses 3(1)(h) and\n\n  3(3)(a) of the Sale and Purchase Agreement were due on 5 November 1998 and 30 April 1999\n\n  respectively.In view of the above, we are instructed by our clients to and do hereby give to your client(s)\n\n  notice pursuant to clause 5(3) of the Sale and Purchase Agreement that unless your client(s) pay\n\n  the unpaid instalment(s) and interestwithin twenty-one (21) days from the date hereof, the\n\n  said Sale and Purchase Agreement shall at the expiration of the said twenty-one (21) days be\n\n  annulled and our clients shall, without prejudice to any other rights available to them at law or\n\n  in equity proceed in accordance with clause 5(3) of the said Sale and Purchase Agreement.5. As might have been expected, Mr Hakim was unable to comply with the notice. On 6 December\n\n1999, Allgreen's solicitors sent Mr Hakim a further letter referring to the previous notice and\n\nstating, among other things, the following:3     In accordance with Condition 29 of the Singapore Law Society's\n\n  Conditions of Sale 1994, without prejudice to any other rights or remedies available to our\n\n  clients at law or equity, the deposit paid by your client has been forfeited and retained for our\n\n  client's own benefit.It is common ground that the reference in the letter to 'Condition 29 of the Singapore Law\n\nSociety's Conditions of Sale 1994' was an error and that the correct reference intended was 'clause\n\n5(3)(c) of the Agreement'. Nothing however turns on this error.6. Mr Hakim's apartment was subsequently resold by Allgreen. By a letter dated 23 March 2000,\n\nAllgreen's solicitors informed Mr Hakim that out of the total amount of the instalments paid up by\n\nhim, Allgreen would be refunding him the sum of $399,259.87, and provided the following computation\n\nshowing how the sum of $399,259.87 was arrived at:1.Original Sale Price$1,165,000.002.New Sale Price$ 900,000.003.Shortfall$ 265,000.00AddOutstanding Interest$ 20,896.30Legal Fees$ 350.20Outstanding Maintenance Charges$ 2,532.54Agent's Commission$ 9,000.00Outstanding Property Tax$ 1,652.09Auction/Valuation Charges$ 309.00$299,740.134.Off-set amount paid by original purchaser to date (60%)$699,000.00Refund Amount$399,259.877. Mr Hakim disputed this computation. While he accepted that Allgreen were entitled to claim for\n\nthe outstanding interest, maintenance charges and property tax, these being accrued debts due to\n\nAllgreen, and to claim the sum of $223,000 being the 20% of the purchase price that was forfeited\n\nunder cl 5(3) of the Agreement, he disputed that Allgreen were entitled to claim for legal fees, the\n\nagent's commission incurred during the sale, the auction/valuation charges, as well as the shortfall\n\narising from the resale. His computation of the refundable amount was as follows:Total payment by Mr Hakim$699,000.00Less 20% pursuant to clause 5(3)(c)$233,000.00Outstanding interest$20,896.30Outstanding maintenance charges$2,532.54Outstanding property tax$1,652.09Amount to be refunded:$440,919.078. Allgreen were unwilling to refund $440,919.07 as requested by Mr Hakim. They refunded only\n\n$399,259.87, which was accepted Mr Hakim without prejudice to his right to claim the balance. Mr\n\nHakim therefore commenced proceedings in Originating Summons No 896 of 2000 ('the present action'),\n\nseeking a determination by the Court as to the amount to be refunded by Allgreen to him, and claimed\n\nthe balance sum of $41,659.20.",
        "Decision below": "9. At the hearing below, Mr Pereira, counsel for Mr Hakim submitted that by virtue of the words:\n\n'without prejudice to any other rights available to [Allgreen] at law or in equity', upon the\n\ntermination of the contract under cl 5(3), Allgreen were entitled to elect either of the two\n\ncourses:(i) to re-sell the property and pursue a\n\nclaim against Mr Hakim for unliquidated damages at common law, or(ii) to proceed under cl 5(3) by,inter alia, forfeiting 20% of the purchase price.In support of this construction of cl 5(3), counsel relied on three cases decided in England:Tally\n\nand Anor v Wolsey-Neech(1979) 38 P&CR 164;Wallace-Turner v Cole(1983) 46 P&CR\n\n164 andSakkas and Anor v Donford Ltd(1983) 46 P&CR 290. We shall turn to these cases\n\nshortly. Reverting to the instant case, Mr Pereira submitted that, as Allgreen had elected to\n\nexercise their rights under cl 5(3), they would be entitled only to such compensation as cl 5(3)(b)\n\nand (c) allowed, and were not entitled to recover, in addition, any damages at common law. Any loss\n\narising from the re-sale above and beyond the forfeited sum and the interest under cl 5(3)(b) and\n\n(c) was irrecoverable.10. On the other hand, Mr Peter, counsel for Allgreen submitted that the right to invoke cl 5(3)\n\nand forfeit 20% of the purchase price was exercisable, in the words of cl 5(3), 'without prejudice\n\nto any other rights available to [Allgreen] at law or in equity'. It was thus submitted that in the\n\ninstant case the 20% forfeited was insufficient to cover Allgreen's losses arising from the resale,\n\nand therefore on the basis of those words in cl 5(3) they were entitled to recover from Mr Hakim the\n\namount of loss they had sustained over and above the 20%.11. Allgreen's contention was accepted by the judge. He held at  9 as follows:9  On the face of it, cl 5(3) gave Allgreen Properties the right to forfeit the 20% as well\n\n  as pursue other rights they may have against HH [Mr Hakim] for the breach of contract. And, in the\n\n  absence of any restrictive words in cl 5(3), these other rights must include Allgreen Properties'\n\n  right to damages (by way of expenses in the re-sale and any drop in the sale price) should those\n\n  damages exceed the 20% forfeited by Allgreen Properties under cl 5(3).The judge rejected the three cases relied upon by Mr Pereira on the ground that 'the context and\n\ncontent of the conditions' in those cases were materially different from the provisions of cl 5(3),\n\nand the courts in those cases held that those conditions provided for liquidated damages, and that\n\nthe parties, having pre-agreed on the quantum of damages, were precluded from claiming additional\n\namounts as damages. Turning to cl 5(3) the judge said:11 Clause 5(3) in our present Agreement does not appear to be a clause setting out the\n\n  liquidated damages payable on breach. Whilst cl 5(3) entitled Allgreen Properties to forfeit 20%\n\n  of the purchase price, it does not say, nor can it readily be inferred from the context, that this\n\n  20% is to be treated as liquidated damages. Indeed, cl 5(3) leaves the question of damages for\n\n  breach open because the right to forfeit the 20% is prefaced by the words \"without prejudice\n\n  to any other rights available to him at law or in equity\". These words appear to have the\n\n  effect of preserving the right of Allgreen Properties to recover damages or seek other remedies at\n\n  common law or in equity should Allgreen Properties suffer damages in excess of the 20%. The effect\n\n  of the words \"without prejudice to any other rights available to him at law or in\n\n  equity\" in cl 5(3) appears to me to be that should the damages suffered by Allgreen\n\n  Properties be less than 20%, Allgreen Properties are entitled to all of that 20% but should the\n\n  damages exceed 20%, Allgreen Properties are entitled to the additional damages.12. In the result, the judge found that Allgreen were entitled to make the deductions as they did\n\nand he dismissed Mr Hakim's claim. Mr Hakim now appeals against this decision.",
        "The appeal": "13. The issue before us is one of construction of cl 5(3) of the Agreement and in particular the\n\nwords 'without prejudice to the other rights available to [the vendor] at law or in equity'. It is\n\nconvenient at this stage to set out in full cl 5(3) and also cl 5(4) of the Agreement, which are as\n\nfollows:(3) If any such unpaid instalments and interest remain unpaid for any period in excess of\n\n  fourteen (14) days after its due date, the Vendor shall be entitled at its option on giving to the\n\n  Purchaser or his solicitors not less than twenty-one (21) days' notice in writing to treat this\n\n  Agreement as having been repudiated by the Purchaser and (unless in the meanwhile the unpaid\n\n  instalments and interest shall have been paid) this Agreement shall at the expiration of such\n\n  notice (and in this respect time shall be of the essence) be annulled and in such an event,\n\n  without prejudice to any other rights available to him at law or in equity, the Vendor shall be\n\n  entitled:-(a) to resell or otherwise dispose of the building unit as the Vendor shall see fit as if\n\n    this Agreement had not been entered into;(b) to recover from the instalments (excluding payments for interest) previously paid by the\n\n    Purchaser all interest calculated in accordance with paragraph (1) of this clause owing and\n\n    unpaid; and(c) to forfeit and retain for his own benefit a sum equal to twenty (20) per cent of the\n\n    purchase price from the instalments (excluding payment for interest) previously paid by the\n\n    Purchaser.(4) The balance of the instalments prepaid by the Purchaser after making deductions in\n\n  accordance with paragraph (3)(b) and (c) shall be refunded to the Purchaser.",
        "Historical perspective": "14. The Agreement was in a statutory form, namely Form E prescribed by the Housing Developers\n\nRules (1990 ed) for the sale by a developer of a flat or any housing accommodation in a condominium\n\nproject. All the relevant forms of sale and purchase agreements for sale of housing units by\n\ndevelopers have been prescribed by law since the amendments made in 1967 to the Housing Developers\n\nRules 1965. Such forms have been amended from time to time by the legislature, and it would be\n\nhelpful for our purpose to examine the relevant amendments made to the statutory forms which led to\n\nthe evolution of the cl 5(3) now under consideration.15. The Housing Developers (Licensing and Control) Act (Cap 130, 1985 ed) was enacted in 1965 and\n\nbecame law on 1 October 1965. Under s 22 of the Act, the Minister is empowered to make rules for the\n\npurpose of carrying out the provisions of the Act and in particular for regulating, inter alia, (a)\n\nthe payments to be made by a purchaser to a housing developer before and during the construction of\n\nthe premises in question, (b) the form of contract to be made between a housing developer and a\n\npurchaser, and (c) the terms and conditions of such a contract. The first set of rules was the\n\nHousing Developers Rules 1965. At that time, the 1965 Rules did not prescribe any specific form of\n\nagreement between a housing developer and a purchaser, but Rule 9 contained specific provisions -\n\n(a) prescribing the sum of $500 as the maximum sum as the booking fee to be paid by a purchaser for\n\nan option or right to purchase the property; (b) prescribing a sum equal to 10% of the purchase\n\nprice as the maximum to be paid by the purchaser either as a deposit or the first instalment of the\n\npurchaser price; (c) requiring the developer to submit to the Controller of Housing for approval a\n\nproposal regarding the amounts of instalments payable by the purchaser at various stages of the\n\nconstruction of the building, and upon such approval, requiring the developer to adhere to the\n\nproposal; and (d) prescribing 90% of the purchase price as the maximum to be paid by the purchaser,\n\nuntil the issue and delivery of the certificate of fitness for occupation for the premises.16. The statutory forms of agreement between a developer and a purchaser were introduced for the\n\nfirst time by the Housing Developers (Amendments) Rules 1967. For the sale of flats the form\n\nprescribed was then Form B. The agreement in that form provided, inter alia, payment of the purchase\n\nprice by instalments according to the stages of the construction of the premises in question and\n\npayment of interest on any instalment which the purchaser failed to pay. The forerunner of the\n\npresent cl 5(3) under consideration was cl 5 of Form B, which so far as material was as follows:5 . . . . . .If any of such unpaid instalments and interest shall remain unpaid for any period\n\n  in excess of forty days after its due date the Vendor shall be entitled at its option on giving to\n\n  the Purchaser or his solicitors not less than thirty days' notice in writing to treat this\n\n  Agreement as having been repudiated by the Purchaser and (unless in the meanwhile such unpaid\n\n  instalment and interest shall have been paid) this Agreement shall at the expiration of the said\n\n  notice (and in this respect time shall be of the essence) be annulled and in such an event -(a) The Vendor shall be entitled to deal with or otherwise dispose of the said Flat in such\n\n    manner as the Vendor shall see fit as if this Agreement has not been entered into.(b) The instalments previously paid by the Purchaser to the Vendor excluding any interest\n\n    paid shall be dealt with and disposed of as follows: -(i) firstly all interest calculated up to the date of the expiration of the said notice\n\n      owing and unpaid shall be paid to the Vendor;(ii) secondly a sum equivalent to 25 per cent of the balance thereof shall be paid and\n\n      forfeited to the Vendor; and(iii) lastly the residue thereof shall be refunded to the Purchaser.(c) Neither party hereto shall have any further claims against the other for costs, damages,\n\n    compensation or otherwise hereunder.(d) Each party hereto shall pay its own costs in the matter.Thus, in the event that this clause was validly invoked, the developer's rights for any loss he\n\nsuffered were limited to recovering from the instalments previously paid (i) all the interest owing\n\nand unpaid up to a certain date, and (ii) thereafter a sum equal to 25% of the balance of the\n\ninstalments (previously paid). After the recovery of these sums, the developer was obliged to refund\n\nthe residue to the purchaser. The developer was not entitled to claim damages for any other loss\n\noccasioned by the breach of contract on the part of the purchaser.17. The 1965 Rules were repealed by the Housing Developers Rules 1976. The 1976 Rules introduced\n\nnew forms of sale and purchase agreements. Form B as prescribed there was the form of sale agreement\n\nfor the sale of a flat or any housing accommodation in a condominium project. Clause 1 of the new\n\nForm B incorporated for the first time the conditions of sale by public auction known as 'The\n\n(Revised) Singapore Conditions of Sale' so far as they were applicable to a sale by private treaty\n\nand were not varied by or inconsistent with the special conditions contained in Form B. In so far as\n\nrelevant for our purpose, cl 5(3) of the then Form B was substantially the same as the material\n\nparts of cl 5 of the previous Form B under the 1965 Rules (as amended in 1967), and was as\n\nfollows:(3) If any of such unpaid instalments and interest remains unpaid for any period in excess of\n\n  forty (40) days after its due date the Vendor shall be entitled at its option on giving to the\n\n  Purchaser or his Solicitors not less than thirty (30) days' notice in writing to treat this\n\n  Agreement as having been repudiated by the Purchaser and (unless in the meanwhile such unpaid\n\n  instalment and interest shall have been paid) this Agreement shall at the expiration of the said\n\n  notice (and in this respect time shall be of the essence) be annulled and in such an event -(a) the Vendor shall be entitled to deal with or otherwise dispose of the housing unit in\n\n    such manner as the Vendor shall see fit as if this Agreement had not been entered into;(b) the instalments previously paid by the Purchaser to the Vendor excluding any interest\n\n    paid shall be dealt with and disposed of as follows:-(i) firstly, all interests calculated in accordance with paragraph (1) hereof owing and\n\n      unpaid shall be paid to the Vendor;(ii) secondly, a sum equal to twenty-five (25) per cent of the balance thereof shall be\n\n      paid and forfeited to the Vendor; and(iii) lastly the residue thereof shall be refunded to the Purchaser;(c) neither party hereto shall have any further claims against the other for costs, damages,\n\n    compensation or otherwise hereunder; and(d) each party hereto shall pay its own costs in the matter.18. The next significant amendments made to the statutory forms of agreement were introduced by\n\nthe Housing Developers (Amendment) Rules, 1981. For our purpose we need to mention only two material\n\namendments to the relevant form, namely, Form B. First, Rule 9 of the 1981 Rules deleted the\n\nreference to 'The (Revised) Singapore Conditions of Sale' in Clause 1 of the sale and purchase\n\nagreement and replaced it with the 'Singapore Law Society Conditions of Sale, 1981'. Secondly, Rule\n\n12 amended cl 5(3) of the sale and purchase agreement by deleting paragraphs (2) and (3) thereof and\n\nsubstituting new paragraphs (2), (3) and (4). Paragraph (2) prescribed the interest rate payable for\n\noverdue instalments; paragraph (3) was the cl 5(3) which is now under consideration, and paragraph\n\n(4) was cl 5(4) of the Agreement. For the first time, the words 'without prejudice to any other\n\nrights available to him at law or in equity' were inserted in cl 5(3). It was suggested by Mr\n\nPereira that these words were derived from condition 29 of the 'Singapore Law Society Conditions of\n\nSale, 1981' which were incorporated into the statutory form of agreement. His reason for saying this\n\nwas that condition 29, which deals with the situation where the purchaser fails to complete on the\n\ncompletion date, provides that if the purchaser does not comply with the notice to complete served\n\nby the vendor pursuant to condition 29, then -(a) ...(b)without prejudice to any other rights and remedies available to him at law or in equity,\n\n  the Vendor may:(i) forfeit and retain for his own benefit the deposit paid by the Purchaser, and(ii) resell the property whether by auction or by private treaty without previously tendering\n\n    a conveyance to the Purchaser.[Emphasis is ours]This is not seriously disputed by Mr Peter. We think that Mr Pereira is probably right. We would\n\nsay in passing that condition 29 was itself modelled on condition 19 of the English Law Society's\n\nGeneral Conditions of Sale: seeThe Singapore Law Society's Conditions of Sale 1981by Mr C C\n\nTan (1982) MLJ xxxix. The same words 'without prejudice to any other rights or remedies available to\n\nhim at law or equity' are also contained in condition 22 of the English National Conditions of Sale.\n\nThese words in the context of condition 19 of The Law Society's General Conditions of Sale and\n\ncondition 22 of the National Conditions of Sale have been construed by the courts in England in the\n\nthree cases relied upon by Mr Pereira, to which we shall refer in a moment.",
        "Construction of Clause 5(3)": "19. Having traced the historical evolution of cl 5(3) to the form now under consideration, we\n\nturn to consider how the words 'without prejudice to any other rights available to him at law or in\n\nequity' in the context of cl 5(3) should be construed.20. Mr Pereira's submission is that when cl 5(3) is validly invoked these words merely give to\n\nthe developer an option to elect either to claim damages at common law or to claim the amounts under\n\nparagraphs (b) and (c) of cl 5(3). Thus, in this case Allgreen had that right of election, and since\n\nthey had exercised their rights under cl 5(3), they were entitled only to the sums stated in\n\nparagraphs (b) and (c) of cl 5(3) and were not entitled, in addition, to damages at common law. In\n\nsupport, he relies on the three English cases.21. Mr Peter, on the other hand, submits that when cl 5(3) is validly invoked and the contract is\n\nannulled, as was the case here, the vendor is entitled to forfeit the 20% of the purchase price\n\nunder clause 5(3)(c) and this right is exercisable, in the words of cl 5(3), 'without prejudice to\n\nany other rights available to [the vendor] at law or in equity'. It follows that, if the amount\n\nforfeited exceeds the actual loss or damage suffered by the vendor, the latter may retain the\n\nsurplus. But, if the amount forfeited is insufficient to cover the loss, the vendor is entitled to\n\nrecover from the purchaser the amount of loss over and above the amount forfeited. Therefore, in the\n\ninstant case, as the loss sustained by Allgreen exceeded the sum forfeited, they were entitled to\n\nclaim the excess amount as well.22. We turn first to consider the cases relied upon by Mr Pereira. InTalley and Anor v\n\nWolsey-Neech(1979) 38 P&CR 45, the plaintiffs agreed to sell a house to the defendant for\n\n55,000 and the defendant paid a deposit of 5,500. The sale and purchase agreement incorporated\n\nThe Law Society's General Conditions of Sale (1973 rev.), of which condition 19, so far as material,\n\nreads:19(2) If the sale shall not be completed on the date fixed for completion either party may on\n\n  that date or at any time thereafter  give to the other party notice in writing to complete the\n\n  transaction in accordance with this condition19(3)19(4) If the purchaser does not comply with the terms of an effective notice served by the\n\n  vendor under this condition, then -(b)without prejudice to any other rights or remedies available to him at law or in equity,\n\n    the vendor may -(i) forfeit and retain for his own benefit the deposit paid by the purchaser, and(ii) resell the property whether by auction or by private treaty without previously\n\n      tendering a conveyance to the purchaser,(c) if on any such re-sale contracted within one year from the date fixed for completion the\n\n    vendor incurs a loss, the purchaser shall pay to the vendor asliquidated damagesthe\n\n    amount of such loss, which shall include all costs and expenses reasonably incurred in any such\n\n    re-sale or any attempted re-sale, subject to the vendor giving credit for any deposit and any\n\n    money paid on account of the purchase price, but any surplus money shall be retained by the\n\n    vendor. [Emphases is ours]The defendant failed to complete on the date fixed for completion. The plaintiffs served on him\n\nthe requisite notice to complete under condition 19(4) but the purchaser still failed to complete,\n\nand in consequence the vendor resold the house. The house fetched a price, which was 4,000 below\n\nthe price at which the defendant contracted to pay. The plaintiffs brought an action against the\n\ndefendant claiming:(i) 4,000, being the reduction of price on resale.(ii) costs and expenses in effecting the resale, and(iii) interest on the amount of the purchase price which should have been paid by the\n\n  defendant, for the period stretching from the date when the defendant should have completed to the\n\n  date of completion of the resale.The Court of Appeal held that the third head of damage, i.e. the interest, was not recoverable,\n\nsince it did not fall within the scope of condition 19(4). Browne LJ held at pp 51-53:When a buyer defaults by failing to complete on the due date after time has been made of the\n\n  essence of the contract, the seller can choose between various rights and remedies .If he decides to sue for damages, he can choose whether to sell or not, and the measure of\n\n  damages will be different according to his choice.In my view, the object and effect of the opening words of condition 19(4)(b) [i.e.\n\n  \"without prejudice to any other rights or remedies available to him at law or in\n\n  equity\"] are to make it clear that these rights of choice are preserved to the seller, but,\n\n  if he chooses to exercise his rights and remedies under condition 19(4)(c), he can, in my view,\n\n  only do so in accordance with and within the limits of the provisions of this condition.If, as [counsel for the vendor] suggests, the effect of condition 19(4)(c) were merely to\n\n  provide machinery for the simple quantification of one element in the damages at common law, it\n\n  could and would have been very differently worded. It seems to me that the words \"liquidated\n\n  damages\" are conclusive.In my judgment, the plaintiffs, having chosen to exercise their rights and remedies under\n\n  condition 19(4)(c), are only entitled to recover the \"liquidated damages\" defined by\n\n  that condition23. The next case isWallace-Turner v Cole(1983) 46 P&CR 164. There, the plaintiff\n\nagreed to sell a flat to the purchaser and the agreement incorporated the National Conditions of\n\nSale, 19th ed (1976). Condition 22(3) provided that if, on the purchaser failing to complete, the\n\nvendor resold the property within the 12 months stated therein, the vendor would be entitled, on\n\ncrediting the deposit, to recover from the purchaser 'the amount of loss occasioned to the vendor by\n\nexpenses of or incidental to such resale, or by diminution of the price'. The purchaser failed to\n\ncomplete, in spite of the notice to complete under condition 22. The plaintiff contracted to resell\n\nthe flat and issued a writ claiming the diminution of the price as the measure of his loss. That\n\ncontract, however, was not completed. Subsequently the plaintiff resold the flat and claimed 9,600\n\nbeing the diminution in the price of the flat. It was held, inter alia, that under the terms of\n\ncondition 22(3) the vendor was put to his election between liquidated damages under the condition\n\nand unliquidated damages at large for loss of bargain and breach of contract and that when the\n\nplaintiff took judgment for the unliquidated damages, he opted for unliquidated damages. Mr John\n\nMowbray QC, sitting as a deputy High Court judge, said at p 167:In my judgmentTalley v Wolsey-Neechshows that a vendor cannot recover both a\n\n  contractual sum under such a condition as condition 22 and damages for the delay. The conditions\n\n  there were the Law Society's General Conditions of Sale (1975 rev.), and they referred to the sum\n\n  expressly as \"liquidated damages,\" and the Court of appeal relied on those words; but in\n\n  my judgment the sum payable under condition 22 of the National Conditions of Sale was also\n\n  liquidated damages and that does not distinguishTalley v Wolsey-Neech.The learned judge further said at p 168:... The basis of the decision inTalley v Wolsey-Neech, as I understand it, is that a\n\n  vendor is put to his election between his different remedies. It is common ground between counsel\n\n  that he is put to an election between damages and specific performance.Talley v Wolsey-Neechis, in my view, a decision that he is likewise put to his election between liquidated damages\n\n  under this kind of condition and unliquidated damages at large for loss of bargain and breach of\n\n  contract.24. The third case relied on by Mr Pereira isSakkas and Anor v Donford Ltd(1983) 46\n\nP&CR 290, which was decided Mr Grantchester QC, sitting as a Deputy High Court judge. In that\n\ncase, the defendant purchased the property at a public auction and the contract incorporated the\n\nNational Conditions of Sale (19th ed). Subsequently the purchaser refused to complete the contract\n\non discovering certain material information relating to the property which was not disclosed in the\n\nparticulars of the property at the auction. The learned judge held that the purchaser was entitled\n\nto rescind the contract on the ground that the vendor had failed to disclose the material\n\ninformation concerning the property and that the particulars of the property furnished by the vendor\n\ncontained information which was untrue to the knowledge of the vendor. However, he went further to\n\nconsider the question of damages, should the claim of the vendor be upheld. In that connection, he\n\nconsidered condition 22(3) of the National Conditions of Sale and followingTalley v\n\nWoolsley-Neechheld at p 309:...In my view that case is authority for the proposition that where a vendor elects to proceed\n\n  under a condition similar to the condition in that case, what he then obtains thereunder is only\n\n  the difference between the initial sale price and the re-sale price and the costs of the re-sale.\n\n  Condition 22 of the National Conditions of Sale (19th ed.) in the present case, although the words\n\n  \"as liquidated damages\" do not appear therein, says that after a notice to complete such\n\n  as was given in this case, then the purchaser's deposit may be forfeited and the vendor can\n\n  re-sell. Thereupon the condition provides that the vendor shall be entitled upon crediting the\n\n  deposit to recover from the purchaser thereunder the amount of any loss occasioned by the vendor\n\n  by expenses of or incidental to such re-sale or by diminution in the price. Such condition, as I\n\n  read it, in the circumstances that happened in this case, indicates that the rights of the\n\n  plaintiffs on the re-sale at 12,000 are only to claim for the 2,300 shortfall, plus the costs\n\n  of the re-sale of 258.75.25. For completeness, we should mention that about a month before the decision inSakkas,\n\na different conclusion was arrived at in the case ofBruce v Waziri(1983) 46 P&CR 81.\n\nThere, the plaintiff entered into a contract to sell her house to the defendant and the contract\n\nincorporated the National Conditions of Sale, 19th ed (1976). The purchaser failed to complete on\n\nthe date fixed for completion and the vendor gave him a notice to complete under condition 22 but\n\nthe purchaser still failed to complete. The vendor treated the contract as discharged and resold the\n\nproperty at a lesser price resulting in a loss of 42,500. The vendor claimed against the purchaser\n\nspecial damages for the loss occasioned. In allowing the claim, Mr Julian Jeffs QC, sitting as a\n\nDeputy High Court judge, distinguished the case before him fromTalley v Woolsley-Neechon\n\nthe ground that the two conditions, namely condition 22 of the National Conditions of Sale and\n\ncondition 19 of The Law Society's General Conditions of Sale, are different. He held at pp\n\n86-87:If, on a proper construction of condition 22 of the National Conditions of Sale, which govern\n\n  the contract in this case, the same provision occurs as was contained in The Law Society's\n\n  Conditions of Sale which were under consideration inTalley v Wolsey-Neech, that is\n\n  decisive of the matter. The plaintiff has her remedy according to that condition and none other.However, in my judgment, the two conditions cannot be equated and condition 22 of the National\n\n  Conditions of Sale does not provide a remedy limited to liquidated damages. I can emphasise this\n\n  by going back to the specific wording of the conditions in question. Looking at condition 19(4) of\n\n  The Law Society's General Conditions of Sale as set out inTalley v Wolsey-Neech, which I\n\n  have already read, it is to be noted that there are three sub-paragraphs to condition\n\n  19(4)....  Paragraph (c) reads: \"if on any resale contracted within one year from the\n\n  date fixed for completion the vendor incurs a loss, the purchaser shall\" - (it is mandatory)\n\n  - \"pay to the vendor as liquidated damages,\" certain sums which are there set out. I\n\n  emphasise the words \"shall\" and \" as liquidated damages.\"On my construction of paragraph (3),the words\"without prejudice to any other\n\n  right or remedy available to the vendor\" govern the whole of it, and the last section is put\n\n  in to clarify the vendor's entitlement in respect of certain heads if the property is resold. I\n\n  accordingly hold in this case that the two conditions are distinguishable and that the plaintiff\n\n  is entitled to recover the special damages which she claims.26. We do not find these English cases of any assistance in our construction of cl 5(3) of the\n\nAgreement. There is a material difference between, on the one hand, the context in which the words\n\n'without prejudice to any other rights or remedies available to him [the vendor] at law or in\n\nequity' are set out in condition 19(4) of The Law Society's General Conditions of Sale and condition\n\n22(3) of the National Conditions of Sale and, on the other hand, the context in which a similar\n\nwording is set out in cl 5(3) of the Agreement. For this purpose, we need to revisit the material\n\nwording of condition 19(4) which is as follows:19(4) If the purchaser does not comply with the terms of an effective notice served by the\n\n  vendor under this condition, then -(a) ..(b)without prejudice to any other rights or remedies available to him at law or in equity,\n\n    the vendor may -(i) forfeit and retain for his own benefit the deposit paid by the purchaser, and(ii) resell the property whether by auction or by private treaty without previously\n\n      tendering a conveyance to the purchaser,(c) if on any such re-sale contracted within one year ..the vendor incurs a loss, the\n\n    purchaser shall pay to the vendor asliquidated damagesthe amount of such loss, which\n\n    shall include .., subject to the vendor giving credit for any deposit and any money paid on\n\n    account of the purchase price, but any surplus money shall be retained by the vendor.With the condition so structured, it is plain that, if and when condition 19(4) applies, the\n\nwords 'without prejudice to any other rights or remedies available to [the vendor] at law or in\n\nequity' operate to give the vendor the options available to him at law or in equity. Accordingly,\n\nthe vendor has the option of (a) treating the contract as still subsisting and pursuing a claim for\n\nspecific performance and damages in addition or in lieu thereof, or (b) treating the contract as\n\nhaving been repudiated and (i) claiming unliquidated damages at large for loss of bargain and breach\n\nof contractor, or (ii) claiming the amounts under paragraphs (b) and (c) of condition 19(4). The\n\nsame position applies to condition 22(3) of the National Conditions of Sale:Wallace-Turner v\n\nColeandSakkas v Dunford(supra).27. Turning to cl 5(3), we find that the entire clause is differently structured and the context\n\nin which the words 'without prejudice to any other rights available to him at law or in equity' are\n\nset out is different. At the risk of repetition, the material part of cl 5(3) is as follows:(3) If ., the Vendor shall be entitled at its option on giving to the Purchaser or his\n\n  solicitors not less than twenty-one (21) days' notice in writing to treat this Agreement as having\n\n  been repudiated by the Purchaser and (unless in the meanwhile the unpaid instalments and interest\n\n  shall have been paid) this Agreement shall at the expiration of such notice (and in this respect\n\n  time shall be of the essence) be annulled and in such an event, without prejudice to any other\n\n  rights available to him at law or in equity, the Vendor shall be entitled:-(a) to resell.(b) to recover all interest calculated ..(c) to forfeit and retain ..twenty (20%) per cent of the purchase price from the\n\n    instalments ..Thus, as and when such clause is validly invoked, the agreement is 'is annulled' and is at an\n\nend. In that event, the consequences set out in paragraphs (a), (b) and (c) apply and the words\n\n'without prejudice to any other rights available to [the vendor] at law or in equity' has a narrower\n\nscope. In our opinion, these words in the context in which they are set out do not operate to give\n\nto the vendor an option or a right to elect either to claim for unliquidated damages at large or to\n\nclaim the sums stated in paragraphs (b) and (c) of cl 5(3). In the context in which they are set out\n\nthey cannot be construed in the manner in which similar words in condition 19(4) of The Law\n\nSociety's General Conditions of Sale or condition 22(3) of the National Conditions of Sale have been\n\nconstrued in those cases which we have discussed.28. It is eminently clear that the purpose of the Housing Developers Rules and the forms and\n\ncontents of the sale agreements prescribed thereunder are intended for the protection of purchasers\n\nof housing units developed and sold by developers. The Housing Developers Rules, since they were\n\nfirst enacted, contain restrictions on the rights of the developers with regard both to the form and\n\nthe terms of the contract which they are at liberty to make with their purchasers. The statutory\n\nforms of contract prescribed by the Rules dictate, among other things, the number and the amount of\n\ninstalments of the purchase price which a developer is allowed to receive from a purchaser at\n\ndifferent stages of the construction, the period of the notice required to be given for calling such\n\npayments, the rates of interest the developer is entitled to charge for any default in the payment\n\nof any instalment, the period required to be given to a purchaser before the developer is entitled\n\nto treat the agreement as having been repudiated and to annul it, and the measure of damages the\n\ndeveloper is entitled to recover from the purchaser.29. For these reasons, it could not have been the intention of the legislature to provide to the\n\ndeveloper by cl 5(3) a right to claim damages at common law, in addition to their rights to recover\n\nthe amounts under paragraphs (b) and (c) of cl 5(3) as contended by Mr Peter. Nor, in our opinion,\n\ncould it have been intended to provide the developer an option to elect either to claim damages at\n\ncommon law or to proceed to recover the amounts under paragraphs (b) and (c) of cl 5(3) as contended\n\nby Mr Pereira. In our opinion, as and when cl 5(3) is validly invoked and the agreement is annulled,\n\nthe rights of the developer to the amount of damages which he is entitled to recover from the\n\npurchaser is confined to paragraphs (b) and (c) of cl 5(3). That is the measure of damages the\n\ndeveloper is entitled to. He is not entitled to claim damages for breach of contract at common law\n\nand recover more than what he would be entitled under cl 5(3). We are reinforced in our conclusion\n\nby the presence of cl 5(4), which unequivocally provides:The balance of the instalments prepaid by the Purchasers after making deductions in accordance\n\n  with paragraph (3)(b) and (c) shall be refunded to the Purchaser.By reason of this sub-clause, the vendor is under an express obligation to refund the purchase\n\nmoneys after making the deductions specified in paragraphs (b) and (c) of cl 5(3). This means that\n\nthe vendor can only keep what has been deducted under clause 5(3).30. Turning to the words 'without prejudice to any other rights available to the vendor at law or\n\nin equity', we are of the opinion that they are intended to preserve to the developer 'other rights'\n\nhe may have, such as his right to payment of other sums which has accrued under the agreement: seeLim\n\nLay Bee and Anor v Allgreen Properties Ltd[1999] 1 SLR 471. The words 'other rights' mean\n\nrights other than the rights to damages which the developer is entitled to recover under paragraphs\n\n(b) and (c) of cl 5(3) of the Agreement.31. It is also instructive to refer briefly toLim Lay Bee. The case concerned another\n\napartment of the same development 'Springdale Condominium' and involved the same developers, namely,\n\nAllgreen. There, the purchaser had paid only the booking fee which was 5% of the purchase price.\n\nUnder the agreement, the first instalment payable was 20% of the purchase price, which included the\n\n5% already paid. The purchaser defaulted in payment of the balance of the first instlament ('the\n\nbalance sum') and also a subsequent instalment. Allgreen therefore served on the purchaser an\n\nannulment notice under cl 5(3) of the agreement, and thereafter commenced proceedings against him\n\nclaiming the balance sum due and two other sums representing interests due. It was held by the Court\n\nof Appeal that Allgreen's right to payment of the balance sum under cl 3(1) accrued prior to the\n\ntermination of the agreement; that reading cl 3(1)(a) and cl 5(3)(c) together this right survived\n\nthe termination of the agreement; and that Allgreen were entitled to recover this amount and forfeit\n\nit. In the course of the judgment the Court said obiter at  11:Loh's defaults in payment of the instalments, the respondents in exercise of their rights under\n\n  cl 5(3) annulled and terminated the agreement, and their rights and remedies in such an event are\n\n  governed by cl 5(3) which is quite explicit and specific: it provides that 'without prejudice to\n\n  any other rights available to' them, they are entitled to the rights as set out in paras a) to c)\n\n  of that clause. In so far as the monetary compensation is concerned, the respondents are entitled,\n\n  first, under para (b) to 'recover from the instalments (excluding payments of interest) previously\n\n  paid by the Purchaser' the interest on the overdue instalments, and secondly, under para (c) to\n\n  forfeit and retain, also from the instalments (excluding payments of interest) previously paid by\n\n  the Purchaser' a sum equal to 20% of the purchase price. The respondents are thus empowered to\n\n  have recourse to the sums previously paid under cl 3(1) for the purpose of satisfying the two\n\n  amounts under paras (b) and (c) of cl 5(3)",
        "Conclusion": "32. In our judgment, as the Agreement had been annulled under cl 5(3), Allgreen were entitled to\n\npayment of the amounts under paragraphs (b) and (c) of cl 5(3). They were also entitled to be paid\n\nby Mr Hakim the outstanding maintenance charges and property tax, as their rights to these sums had\n\naccrued prior to the termination of the Agreement. Subject to payment of these sums, Allgreen are\n\nobliged to refund to Mr Hakim the balance of the instalments paid under the Agreement.33. We therefore allow the appeal with costs here and below, and set aside the judgment below.\n\nAllgreen were obliged to refund to Mr Hakim the sum of $440,919.07. It appears that Allgreen had\n\nrefunded to Mr Hakim the sum of $399,259.87. That being the case, there will be judgment for Mr\n\nHakim for the refund of the balance. The deposit in court, with interest, if any, is to be refunded\n\nto Mr Hakim or his solicitors.- Sgd -YONG PUNG HOW- Sgd -L P THEAN- Sgd -CHAO HICK TINChief JusticeJudge of AppealJudge of AppealDate: 13 September 2001Copyright © Government of Singapore."
    }
}