{
    "case_title": "Seah Kok Meng v Public Prosecutor",
    "ncitation": "[2001] SGCA 40",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "The facts": "2.    The facts leading to the killing on the fateful morning were\n\nthese. On 1 May 1999, at about 9.00pm, some seven to eight hours before the incident, three persons,\n\nthe appellant, his girlfriend Bok Swee Hoon (Bok) and the appellants friend Chan Kam Seong\n\n(Chan), were drinking beer at a hawker centre at Lorong 2, Geylang. An argument ensued between the\n\nappellant and Bok and to avoid further quarrelling, the appellant and Chan slipped away from the\n\nhawker centre leaving Bok behind. He also switched off his handphone so that Bok could not contact\n\nhim.3.    The appellant and Chan spent considerable time loitering in\n\nthe area between Lorong 2 and Lorong 12 Geylang until the early hours of the next morning. When they\n\nwere at Lorong 12, the appellant switched on his handphone. Soon he received a call from Bok, who\n\nasked him where he was. He refused to answer her and just told her to go home.4.    Shortly after, at about 4.00am, and by then it was already 2\n\nMay 1999, the appellant received a second call from Bok, who told him that a Malay man was following\n\nher and had touched her. She complained that the man would not leave her alone and continued to be a\n\nnuisance. She also informed him that she was then at a coffee shop at the corner of Sims Ave and\n\nLorong 5, Geylang.5.    On hearing that, the appellant was very worked up and,\n\ntogether with Chan, took a taxi to the coffee shop where Bok said she was. On arrival, the taxi\n\nstopped on the other side of the road and the appellant and Chan alighted from it. The appellant\n\nwalked across Sims Road towards the coffee shop where Bok was. The coffee shop bore the sign\n\n\"Nikmath Restaurant\". Chan remained where he was and did not follow the appellant in\n\ncrossing the road.6.    At that moment, Bok was talking on a public telephone, which\n\nwas located at the front right corner of the coffee shop as one faces the shop. The appellant\n\napproached Bok and asked who was the person disturbing her. She pointed to a Malay man [later\n\nestablished to be S Salim Bin Ahmad (Salim)] who was standing near another public telephone, a very\n\nshort distance away. The appellant and Salim then stared at each other. Following this, the\n\nappellant went to the alley at the back of the coffee shop where he found a wooden pole, which was\n\nquite heavy. Armed with that, he returned to where Salim was and attacked him on his head and body.\n\nThere was no retaliation by Salim. The appellant then left the scene with Bok and went into hiding\n\nin Malaysia. About a year later he was arrested in Malaysia and on 12 May 2000 he was brought back\n\nto Singapore to face the charge.7.    We ought to mention that the evidence of Chan was slightly\n\nat variance with the above. According to him, upon alighting from the taxi, the appellant told him\n\nthat he was going to beat up the Malay man. He saw the appellant going into the lane behind the\n\nNikmath Restaurant. Shortly afterwards, the appellant was seen carrying a wooden pole about two feet\n\nlong. He then approached Bok, presumably asking her to identify the man who was harassing her. He\n\nnext saw the appellant hitting Salim on the back of his head. Salim then fell onto the ground and\n\nthe appellant continued to hit him two to three times on the head and four to five times on the\n\nlegs. The appellant also used his right leg to kick the waist of Salim, and said \"pergi\n\nmati\" (\"go and die\" in Malay). As far as Chan saw it, there was no staring incident.\n\nSalim did not retaliate when the appellant was attacking him. The appellant then left the coffee\n\nshop with Bok. However, the trial judge did not accept the evidence of Chan as he felt that Chan\n\nappeared hostile and was not reliable.8.    The owner of Nikmath Restaurant, one Mr Assinar s/o Mamu\n\n(Assinar), was at the relevant time behind the counter. He saw the appellant approach Salim and use\n\na wooden stick to hit Salim. He was not able to say where the blows landed. He did not hear any\n\nquarrelling between the appellant and Salim. He then came out of the counter and saw Salim sitting\n\non the ground and leaning against the orange coloured coin phone stand. He shouted\n\n\"Jangan\" (meaning \"dont\" in Malay) three times and ran to make a call to the\n\npolice. The evidence of Bok was along similar lines to that of the appellant.9.    Salim died several hours later in hospital. He was\n\nunconscious from the time the Civil Defence team came to the scene. The pathologist, Dr Paul Chui,\n\nwho examined the body of Salim found, besides other injuries on the body, three major injuries to\n\nthe head as follows:-(i) a fracture of the skull over the right forehead with fragmentation of the\n\n  nasal bones and fractures over the cheek area and injury to the brain with bleeding;(ii) a fracture of the skull beneath the occipital scalp with bleeding over the\n\n  surface of the brain;(iii) a fracture of the base of the skull.It was Dr Chuis opinion that these injuries were caused by the blunt force of\n\nan object which could have been a stick with a square or rectangular cross-section and the force\n\nused would have been moderately severe. It was also his opinion that each of these injuries would,\n\nin the ordinary course of nature, cause death.10.    In passing, we should mention that there was, moreover, one\n\nother set of significant injuries  a fracture to Salims ribs, and a tear in his kidney which\n\nwas bleeding. In Dr Chuis opinion, these injuries were also sufficient in the ordinary course of\n\nnature to cause death, although in the present case, the actual cause of death were the head\n\ninjuries.11.    The appellant gave several statements to the Police in the\n\ncourse of their investigation and three were sought to be admitted by the prosecution and not\n\nobjected to by the appellant:-(i) a statement recorded on 15 May 2000;(ii) another statement recorded on 15 May 2000;(iii) a statement recorded on 17 May 2000.12.    The pertinent parts of the second statement recorded on 15\n\nMay 2000 were the following:-As I was walking to the coffeeshop, I saw my girlfriend was on a silver colour\n\n  public phone and she was facing the main road (Recorders note:- refers to Sims Ave). She did\n\n  not see me as I came from the back of the coffeeshop. At the same time, I also saw a Malay man\n\n  standing infront of my girlfriend. Both of them were about 2 feet away from each other. The Malay\n\n  man (deceased) was alone...I hurried my girlfriend to put down the phone so that we could go back home. I\n\n  was then rather unhappy with her behaviour and my tone also sounded unhappy. The Malay man\n\n  (deceased) mistook me that I had passed remarks against him while I was talking to my girlfriend.\n\n  As such, he uttered something at me in Malay which I could not understand. I wish to say that I do\n\n  not either understand or speak Malay language. The Malay mans (deceased) tone sounded angry\n\n  just like me. When the Malay man (deceased) stopped talking, we started staring at each other for\n\n  a short while. He appeared to be very fierce and I became frightened . I then walked away to the\n\n  back of the coffeeshop. At that time, my girlfriend was still talking on the phone. While at the\n\n  back of the coffeeshop, I saw a square-shaped wooden plank lying on the cemented floor...I wish to say that I picked up the wooden plank for self defence in case there\n\n  is a fight between the Malay man and me...On my return, the Malay man (deceased) remained standing infront of my\n\n  girlfriend. He stared hard at me as if he was going to hit me. Before the Malay man (deceased)\n\n  could make any move, I immediately hit him with the wooden plank. I first hit him on one of his\n\n  arms about one to two times. After that, he fell sideways onto the ground. I continued to hit him\n\n  a few times with the wooden plank on his legs, shoulder and head. I believed I had hit the Malay\n\n  man (deceased) on the side of his head as he was then lying sideways on the ground. The Malay man\n\n  (deceased) did not retaliate at all as he was lying on the ground13.    The statement recorded on 17 May 2000 was in the form of\n\nquestions and answers and we need only quote the following:-Q2: When you were at Nikmath Restaurant located at 24 Sims Ave, why did you\n\n  want to arm yourself with a wooden plank?A2: The Malay man kept staring at me as if he was going to start a fight. As\n\n  such, I walked to the back of the restaurant and by chance, I saw a piece of wooden plank lying on\n\n  the ground and I picked it up. I took the wooden plank for self-defence in case a fight erupted\n\n  between the Malay man and me.Q3: Did the Malay man whom you referred to in your statement (Recorders\n\n  note:- refers to the deceased) pose any threat or harm to you at Nikmath Restaurant located 24\n\n  Sims Avenue?A3: His behaviour towards my girlfriend and the way he stared hard at me made\n\n  me felt frightened. As a result, I must get myself prepared and to protect myself.Q6: Do you know that the wooden plank as described by you in Q5 can cause\n\n  serious injury to a person when it is used as a weapon?A6: I only know that it can cause serious injury. However, I have never thought\n\n  that it could cause death. This is the first time that I have used a wooden plank in a fight. If I\n\n  know it can cause death, I would not have used it.Q7: Did the Malay man whom you referred to in your statement (Recorders\n\n  note:- refers to the deceased) retaliate while you were hitting him with the wooden plank?A7: The Malay man fell onto the floor after I had hit him once or twice on one\n\n  of his arms with the wooden plank. He did not retaliate at all.Q8: Why did you continue to hit the Malay man whom you referred to in your\n\n  statement (Recorders note:- refers to the deceased) after he had fallen onto the ground?A8: I was afraid that he would stand up and hit me back.Q14: Do you have anything else to say?A14: I wish to say that I do not have any intention to cause the deceaseds\n\n  death. I do not know him and bear no grudge against him. I just wanted to teach him a lesson. I\n\n  never expected that it would cause his death. I beg for leniency and hope the judge would give me\n\n  a chance.14.    In his defence, the appellant made basically two points.\n\nFirst, that when he went to \"rescue\" his girlfriend, Bok at Nikmath Restaurant, he was\n\n\"a bit high on beer\" But he knew where he was, what the time was and what he was doing.\n\nSecond, that he went to the back lane behind the restaurant to get something to protect himself, and\n\nthis was after he had chided Bok and asked her to hang up the phone and leave with him. Salim had\n\nappeared thereby to be angry and had said something. He had also stared at the appellant. Upon his\n\nreturn from the back lane with the wooden pole, he again asked Bok to hang up and leave and Salim\n\ndid not like that. According to the appellant, at that point Salim raised his right hand to the\n\nshoulder level and as he felt that Salim was going to hit him, he struck Salim on the shoulder. As\n\nhe was feeling high and frightened, he did not know thereafter how many times he struck Salim.15.    The appellant denied saying to Chan that he was going to\n\nbeat up Salim. When he was referred to his answer to question 14 given on 17 May 2000, where he\n\nstated \"I just wanted to teach him a lesson\", the appellant said that that was suggested\n\nto him by the recording officer and he just signed. But when the recording officer and the\n\ninterpreter gave evidence this was not put to them.",
        "Decision below": "16.    In evaluating the evidence of the witnesses, the trial\n\njudge felt that Assinar, though an earnest witness, had rather poor recollection of the events. As\n\nfor Bok, while some of her evidence was corroborated by others, the trial judge was not able to rely\n\non her evidence as she was under the influence of Erimin or Upjohn tablets and her recollection was\n\nalso unclear. As for Chan, in view of contradictions in his evidence and his apparent hostility\n\ntowards the appellant, the trial judge did not think it safe to rely on his evidence.17.    Turning to the appellant, the trial judge accepted that\n\nwhat the appellant stated in his statements was an honest account of the events. It was not\n\nsuggested to the recording officer or the interpreter that there was anything incorrect in those\n\nrecordings. Thus, to the extent that the appellants evidence in court was at variance with what\n\nwas set out in his statements, the trial judge preferred the latter.18.    The trial judge found that the defence had not shown that\n\nthere was grave and sudden provocation. It was not shown that when the appellant attacked Salim, he\n\nwas deprived of self-control. He also went on to say that, even if there was provocation, the\n\nappellants actions were out of all proportion to it, and thus did not come within Exception 1 to\n\ns.300. He further found that there was nothing to show that the appellant was so intoxicated that he\n\ncould not have possessed the intention to commit an offence under s 300.",
        "Issues on appeal": "19.    Before us, as in the court below, the same two issues were\n\nraised : first, that of grave and sudden provocation, and second, that because of his intoxication,\n\nthe appellant did not have the requisite intention to commit the offence of murder. Counsel\n\nsubmitted that the trial judge erred when he found that the appellant had not established that there\n\nwas grave and sudden provocation. He also fell into error for holding that the appellant was not so\n\nintoxicated that he did not know what he was doing.",
        "Provocation": "20.    Provocation, as a defence to a charge of murder, is set out\n\nin Exception 1 to s 300 of the Penal Code and the provision reads:-Culpable homicide is not murder if the offender whilst deprived of the power of\n\n  self-control by grave and sudden provocation, causes the death of the person who gave the\n\n  provocation, or causes the death of any other person by mistake or accident.The Explanation to that Exception provides that \"whether the provocation was\n\ngrave and sudden enough to prevent the offence from amounting to murder is a question of fact.\"21.    InPP v Kwan Cin Cheng[1998] 2 SLR 345andLau\n\nLee Peng v PP[2000] 2 SLR 628, this Court laid down that there are two distinct requirements\n\nwhich must be satisfied before the defence of provocation can be successfully raised. First, is the\n\nsubjective requirement that the accused was deprived of his self-control by provocation. Second, is\n\nthe objective requirement that the provocation must have been grave and sudden which involved\n\nthe application of the reasonable man test. The question involves considering whether an\n\nordinary person of the same sex and age as the accused, sharing such of his characteristics as would\n\naffect the gravity of the provocation and placed in the same situation, would have been so provoked\n\nas to lose his self-control.22.    Counsel for the appellant contended that on the evidence\n\nboth the requirements were satisfied to enable the appellant to raise the defence of provocation.\n\nCounsel argued that what constituted provocation here was a series of acts, starting with the\n\nmolestation of Bok by Salim and the appellant being informed by Bok about it, followed by Salim\n\nstanding close to Bok when she was talking on the phone, Salim uttering something in Malay angrily\n\nwhen the appellant asked Bok to hang up and staring at the appellant, and finally, when the\n\nappellant returned from the back lane holding the wooden pole, Salim raising his right hand as if\n\nwanting to strike.23.    It would be appropriate if we should at this juncture set\n\nout the manner in which the trial judge viewed the situation ( 51 and 52 of the Grounds of\n\nDecision):-The alleged molestation had ceased before the accused arrived at the coffee\n\n  shop. The accused said that the deceased stared at him, and he stared back at the deceased. The\n\n  act that precipitated the assault was the deceased raising his hand as though to hit him. This was\n\n  not consistent with the accuseds statement that Before the Malay man (deceased) could make\n\n  any move, I immediately hit him with the wooden plank and his answer when asked whether the\n\n  deceased posed any harm or threat to him, that His behaviour towards my girlfriend and the way\n\n  he stared hard made me felt frightened with no mention of any gesture, hand or arm movements.The evidence showed that he was angry with the deceased for accosting his\n\n  girlfriend and annoyed at her for not leaving the coffee shop with him immediately. He did not say\n\n  that he was so provoked that he had lost his self-control when he attacked the deceased.24.    Counsel urged us to bear in mind that, while the appellant\n\nand Bok were not married, their relationship was de facto that of a married couple. That was not\n\ndisputed. Nowhere did the trial judge indicate a different view. The fact that the appellant was not\n\nmarried to Bok played no part in the determination of the trial judge. Counsel reiterated that the\n\nprovocation was a continuous one. First the molestation, then Salim continued to stand close to Bok\n\ndisturbing her, followed by the utterance and the stare, and eventually the raising of the arm. The\n\nappellant obviously lost his control and the attack was carried out in a frenzy as the appellant did\n\nnot even know where and how many times he hit Salim. Counsel also pointed out that the appellant\n\nonly went to arm himself with a wooden stick and not a knife or a broken bottle. That only went to\n\nshow the defensive nature of that move.",
        "Our decision": "25.    Like the trial judge, we did not think that it had been\n\nestablished that the appellant had, in fact, lost his self-control due to provocation. The\n\ncircumstances showed that he was very much in control of the situation. Upon being informed by Bok\n\nthat she was being disturbed by someone, he had the presence of mind to do the only proper thing :\n\nto go there to rescue her. On arrival at the scene, there was no altercation although Salim\n\nwas standing close by. After the appellant asked Bok to hang up the phone and leave the place, there\n\nwas some staring between the appellant and Salim. Whereupon the appellant went to the back lane and\n\ncame back armed with the wooden pole. Thereafter, he attacked Salim. To justify his striking first,\n\nhe alleged that Salim lifted his right hand up to his shoulder. But in his statement of 15 May 2000,\n\nhe merely stated that before the Malay man  could make any move, I immediately hit him with\n\nthe wooden plank. More important to note was that Salim was not carrying any weapon or instrument\n\nwhich could be used as such. It seemed to us that every move of the appellant was very deliberate.\n\nHe knew what he wanted to do. He found his implement and took the offensive against Salim, literally\n\nto teach the latter a lesson.26.    Turning to the second requirement, the objective\n\nrequirement laid down inKwan Cin Cheng, again, we did not think whatever provocation there\n\nwas in the circumstances was \"grave and sudden\". A reasonable person, who was not out to\n\nget even, would not, in the circumstances, have gone on to search for some weapon and carry out an\n\nassault of this kind. The severity of the physical assault which the appellant inflicted on Salim,\n\nwhich eventually led to his death, showed, in the circumstances, that the appellant was bent on\n\nteaching Salim a lesson. The appellant might well not have appreciated that striking Salim with the\n\nwooden pole would lead to his death, but that did not matter as it was clear that he intended to\n\ncause the three fractures to the skull of Salim, as there was nothing accidental about the\n\nfractures, and any one of the fractures was sufficient in the ordinary course of nature to cause\n\ndeath: seeVirsa Singh v State of Punjab(1958) AIR SC 465 andPP v Visuvanathan[1978] 1 MLJ 159. Accordingly, the appellant was rightly convicted of murder.",
        "Drunkenness": "27.    In the light of our views above, there was really nothing\n\nmeritorious in the defence of intoxication. It was not in dispute that the appellant had, before the\n\nincident, consumed a fair amount of beer. While he was \"high\" because of the effect of\n\nbeer, he was not completely drunk. He was in fact conscious of the surroundings and knew what he was\n\ndoing. This came out from his evidence:-Q: When your girlfriend called you for the first time when you were at Lorong\n\n  12 Geylang coffee shop, were you drunk?A: I was not completely drunk. I was a bit high. My gait was not steady.Q: But Mr Seah, you were aware of your surroundings; you knew what was going\n\n  on, am I correct, at that time?  You were aware of the surroundings  that means you know\n\n  what time it was, where were you, what were you doing?A: Yes.Q: In fact when your girlfriend called you the first time you had the presence\n\n  of mind to ask her to go back by herself?A: Yes.28.    By s 85 of the Penal Code, intoxication as a defence is\n\nrather restricted. It applies only if by virtue of intoxication the accused did not knowthat the act or omission, which constituted the offence was wrong, or did\n\n  not know what he was doing and, (a) the state of intoxication was caused without his consent by\n\n  the malicious or negligent act of another person; or (b) he was then, by reason of intoxication,\n\n  insane, temporarily or otherwise.29.The circumstances of the\n\npresent case did not satisfy the condition laid down in s 85 for the defence of intoxication to be\n\ninvoked. In our judgment, it was clear that the appellant knew what he was doing. Even according to\n\nthe appellant, he appreciated the danger and had the presence of mind to get a wooden pole for his\n\nown protection. He could not have been so intoxicated. The truth of the matter was that the\n\nappellant wanted to teach Salim a lesson for disturbing or trying \"to get fresh\" with Bok\n\nand getting the wooden pole was the means by which he sought to achieve that objective. In the\n\nresult, the appeal was dismissed.30.    Before we conclude, there is a matter we ought to refer to.\n\nThe judge below had expressed some concern on the following passage of this Court inLau Lee Peng\n\nv PP[2000] 2 SLR 628:-In the light of the discussion inKwan Cin Cheng, the test of\n\n  proportionality is probably not a distinct requirement for raising the defence of provocation. It\n\n  is a factor to be taken into account in determining whether the objective test of gravity and\n\n  suddenness is fulfilled. Therefore,the fact that the retaliatory acts may have been out of\n\n  proportion to the provocation offered does not necessarily mean that the defence must fail. This\n\n  is because where the provocation defence in Exception 1 to s 300 is raised, the accuseds acts\n\n  of retaliation wouldex hypothesialways have been of an extreme degree, resulting in the\n\n  death of another person. An inquiry into proportionality does little to answer the\n\n  essential question of whether an ordinary person would, upon receiving the provocation in\n\n  question, have reacted in the same way the accused did. (Emphasis added).In particular, the two sentences underscored above.31.    The judge seemed to think that it did not follow that an\n\naccuseds acts of retaliation \"wouldex hypothesialways have been of an extreme\n\ndegree.\" He pointed out that under s 300 there are four classes of acts which constitute\n\nmurder, and of those four classes, one of them (s 300[d]) relates to an act which the accused knows\n\nis so imminently dangerous that it must in all probability cause death or such bodily injury as is\n\nlikely to cause death, with no requirement that there should be any intention on his part to cause\n\ndeath or bodily injury. Accordingly, an act which falls within s 300(d), and which was brought about\n\nas a result of provocation, may not necessarily have been \"of an extreme degree\".32.    His second point would appear to be that the test of\n\nproportionality is a distinct and separate test and, if an accuseds act of retaliation was out of\n\nproportion to the provocation, the defence under Exception 1 would not be available to him.33.    We agree with the trial judge that the resulting act of\n\nprovocation may not always be of an extreme degree just because death ensued, though it invariably\n\nis. We accept his contention that an act which falls within a s 300(d) is essentially the doing of a\n\ndangerous act and that act need not necessarily be of an extreme degree.34.    As regards the question of proportionality, we would\n\nreiterate what is stated in the passage inLau Lee Pengthat the test of proportionality is a\n\nfactor to be taken into account in determining whether the objective condition is satisfied. All we\n\nstated was that the fact that the act of retaliation may be out of proportion to the provocation\n\noffered does not mean that the defence must fail. In as much as there are degrees of provocation,\n\nthe same applies to the severity of the response. Besides, there are also degrees of\n\ndisproportionality. In an issue such as this, which is a question of fact, one cannot be so clinical\n\nor emphatic as to say that the provocation and the response must always be matched, otherwise the\n\ndefence will fail. It is the overall circumstances which the trial judge must weigh, and\n\nsuperimposed into that consideration how a reasonable person in those circumstances would have\n\nreacted, and then come to a conclusion."
    }
}