{
    "case_title": "Goh Chye Soon Jimmy v Public Prosecutor",
    "ncitation": "[2001] SGCA 29",
    "coram": "Chao Hick Tin JA; \n      Lai Kew Chai J; \n      L P Thean JA",
    "sections": {
        "Q Who is the owner of these drugs": "A I am the oneQ What is the purpose of the drugsA For my consumption and selling, only the heroin is for sale, the rest of the\n\n  drugs is for my own consumption",
        "Q Is your wife [meaning Annie Ng] aware that you are selling heroin?": "A Dont knowThe statement was signed by the appellant.The Defence6.    The appellants defence was as follows. He had been in\n\nfinancial trouble for some time. Someone by the name of Ah Seng offered to help him by paying\n\nfor the rent of the appellants flat. In return, Ah Seng was to be allowed to store heroin\n\nin the flat. Under this arrangement, Ah Seng was also to supply the appellant with heroin,\n\nfree of charge, to feed his addiction, but the appellant was not allowed to touch the heroin stored\n\nby Ah Seng in the flat.7.    On 29 May 2000, the appellant felt a craving for heroin. He\n\nwent to the wardrobe in the master bedroom, but found none there. The appellant called Ah Seng\n\nand asked for some heroin, and the latter told the appellant that he would pass him some later.\n\nAfter the phone call, the appellant decided to stave off his craving for the time being by resorting\n\nto the other drugs that were in the flat. The appellant took one L4A tablet and five Upjohn tablets.\n\nTwenty minutes later, the appellant met Ah Seng downstairs, where the latter handed him a\n\nMarlboro cigarette box containing the heroin requested for by the appellant. The appellant then made\n\nhis way back to his flat. However, the Upjohn tablets started to take effect, with the result that\n\nthe appellant ended up trying to use his key to open the wrong door. This led to his being arrested\n\nby the police, who found the heroin in his pocket.8.    Two days after his arrest (ieon 31 May 2000), the\n\nappellant and Annie Ng followed the CNB officers to the flat, where the search was conducted. When\n\nthe officers discovered the heroin in the wardrobe, the appellant was shocked. This was because\n\nthere was no heroin to be found when the appellant last left the flat.9.    At the trial, the appellant suggested that it was probably\n\nAh Seng who had placed the heroin in the wardrobe. Ah Seng had the keys to the flat, and\n\nhe would visit the flat up to three times a week. Annie Ng also testified that someone entered the\n\nflat late one night when she and the appellant were in the bedroom The appellant had then gone out\n\nto talk to the person. It was submitted on the appellants behalf that the person was probably Ah\n\nSeng, and that this corroborated the appellants story that Ah Seng had access to the\n\nflat.10.    The appellant alleged that Insp Lek fabricated parts of the\n\nstatement that was purportedly recorded from him. The appellant denied ever having given an\n\nunqualified admission to being the owner of the drugs in the wardrobe, as the heroin did not belong\n\nto him. The appellant admitted that he did list the various other drugs found in the wardrobe, such\n\nas ketamine, ecstasy, up-john, erimin, ice and their respective quantities to Inspector Lek. He\n\ncould do so because these drugs belonged to him, and were for his consumption. However, he did not\n\nlist out heroin as being one of the drugs in the wardrobe. Nor did he give Insp Lek the weight of\n\nthe heroin in the wardrobe.11.    The appellant explained that the statement was in fact\n\nobtained by threat. According to the appellant, Sgt How had, after opening the master bedroom\n\nwardrobe, inquired of the appellant as to what was inside the wardrobe. When the appellant replied\n\nthat he did not know, Sgt How hit the appellants back with the flat of his hand, and pushed the\n\nappellants head forward. Following this, Insp Lek asked the appellant whom the drugs in the\n\nwardrobe belonged to. When the appellant replied that they were not his, Insp Lek threatened to\n\nbring a capital charge against Annie Ng and the appellants landlady, unless the appellant\n\nadmitted to ownership of the drugs. Insp Lek further mentioned that if the appellant co-operated, he\n\nhimself could avoid facing a capital charge.The Trial Below12.    The trial of the charge was heard before Choo Han Teck JC.\n\nAs the voluntariness of the appellants statement to Insp Lek was challenged, the judge conducted\n\na voir dire to determine the statements admissibility. At its conclusion, the judge found that\n\nthe statement was not obtained by any threat or inducement, and allowed it to be admitted. On this\n\npoint, the judge held (at 5):I was not persuaded by his testimony and after considering the evidence on the\n\n  whole, including what his counsel had put to the CNB officers in cross-examination, I am satisfied\n\n  that the statements were made by him without any threat, inducement or promise. In these\n\n  statements the accused gave a precise account of the type and quantity of the various drugs found\n\n  in the wardrobe. He also admitted that the drugs belonged to him. He stated that only the heroin\n\n  were meant for sale but the other drugs were for his personal consumption.13.    At the conclusion of the trial, the judge convicted the\n\nappellant. His reason for so doing was as follows (at 7):The accused admitted that all the drugs found in his wardrobe belonged to him\n\n  except the heroin. In my view, the way the various drugs were packed and kept made it extremely\n\n  unlikely that they belonged to different persons. Furthermore, there was the unexplained powdered\n\n  heroin found in the mortar and pestle inside the wardrobe. Apart from the evidence-in-chief of the\n\n  accused, there was no other evidence of the existence of Ah Seng or his visits to the accuseds\n\n  flat. Ng Annie mentioned that once at midnight someone came calling and spoke to the accused but\n\n  this evidence even if true can hardly be given any weight to the specific defence of the accused.\n\n  I am unable to accept the evidence of the accused and in my judgment, all the drugs in the\n\n  wardrobe belonged to him and nothing in his evidence persuaded me that the benefit of the doubt\n\n  ought to be given in his favour.",
        "The Appeal": "14.In the present appeal before\n\nus, Mr Leo Fernando raised the same two contentions that were advanced at the trial, viz:-i) The appellants statement to the judge was not made voluntarily, and the\n\n  judge erred in admitting it into evidence; andii) The judge erred in rejecting the appellants defence that he had no\n\n  knowledge of and therefore was not in possession of the heroin in the wardrobe.The Admissibility of the Statement15.    Section 24 of the Evidence Act (Cap 97) reads:A confession made by an accused person is irrelevant in a criminal proceeding\n\n  if the making of the confession appears to the court to have been caused by any inducement, threat\n\n  or promise having reference to the charge against the accused person, proceeding from a person in\n\n  authority and sufficient in the opinion of the court to give the accused person grounds which\n\n  would appear to him reasonable for supposing that by making it he would gain any advantage or\n\n  avoid any evil of a temporal nature in reference to the proceeding against him.16.    In seeking to impugn the appellants statement to Insp\n\nLek, Mr Fernando relied principally on the case ofPoh Kay Keong v PP[1996] 1 SLR. In that\n\ncase, it was held by this court that when an officer threatens to charge an accuseds loved ones\n\nso as to coerce the accused into confessing to an offence, this will constitute an inducement or\n\nthreat falling within the ambit of s 24 of the Evidence Act. The case ofPoh Kay Keong v PPalso states that if an officer makes a promise to an accused not to charge the accused if he\n\ncooperates, the promise also falls within the scope of s 24. Therefore, if there was any truth in\n\nthe appellants allegation that Insp Lek had threatened to charge Annie Ng and his landlady with a\n\ncapital offence if the appellant refused to admit to ownership of the heroin, the confession\n\nrecorded by Insp Lek would have to be disregarded. Likewise, it would also have to be disregarded if\n\nInsp Lek did in fact tell the appellant that he could avoid a capital charge if he cooperated.17.    During the course of cross-examination, the appellant\n\nadmitted that when he was being questioned by the CNB officers about the things in the wardrobe,\n\nthose things had remained as they were found in the wardrobe. The statement was recorded at 12 noon.\n\nWhen ASP Tan Yee Hong from the CNB arrived at the flat at 12.45pm, the contents of the wardrobe\n\nstill remained undisturbed. As could be seen from the photograph P7, the various containers in the\n\nwardrobe were piled up rather messily. At the time of the recording of the statement, it would have\n\nbeen difficult for any to surmise that there was heroin in the wardrobe, let alone that there was\n\nmore than one pound of it. As such, it was unlikely that Insp Lek could have fabricated the\n\nappellants response to the effect that there was heroin in the wardrobe, and that the heroin\n\nweighed more than a pound. The possibility of Insp Lek having taken his notebook back to the office\n\nto fabricate the statement also has to be ruled out, since the statement bore the appellants own\n\nsignature.18.    There were other ample evidence to support the finding of\n\nfact of the judge. We were thus of the view that the judge could not be said to have erred in\n\nadmitting the statement.Should The Conviction Be Upheld?19.    The appellant was charged with having the heroin in his\n\npossession for the purpose of trafficking, this being an offence under s 5(1)(a) read with s 5(2) of\n\nthe Misuse of Drugs Act. These provisions read:s 5(1) Except as authorised by this Act or the regulations, it shall be an\n\n  offence for a person, on his own behalf or on behalf of any other person, whether or not that\n\n  other person is in Singapore to(a) traffic in a controlled drug;(2) For the purposes of this Act, a person commits the offence of trafficking\n\n  in a controlled drug if he has in his possession that drug for the purpose of trafficking.20.    The first question is whether the appellant was proven to\n\nhave the heroin in his possession. For there to have been possession, the appellant must have had\n\nknowledge of the drugs: seeR v Warner[1969] 2 AC 256 at 312.21.    In the present case, the heroin was found in the appellants\n\nflat. They were in a locked wardrobe, to which he had the key, and in which some of his personal\n\neffects were found. This gave rise to a strong inference that the heroin in the wardrobe belonged to\n\nthe appellant, and that he consequently must have been aware of the presence of the heroin. The\n\nappellant nevertheless came up with the story of Ah Seng, saying that it was probably Ah\n\nSeng who kept the heroin in the wardrobe.22.    This story was rejected by the judge and for good reasons.\n\nThe appellant himself admitted that he omitted to mention about Ah Seng to any of the CNB\n\nofficers when they were questioning him and when his statement was being taken down. Surely, a fact\n\nas material as Ah Sengs involvement must have been raised to the officers if it were true.\n\nSecondly, no attempt was made to locate Ah Seng after the appellants arrest, or to produce\n\nAh Seng at trial. These factors went to indicate that Ah Seng was nothing more than a\n\nconcoction cooked up by the appellant as an afterthought.23.    Thirdly, as noted by the judge, the manner in which the\n\nheroin was packed tended to indicate that they belonged to him, and not to Ah Seng (if there\n\nwere such a person). Mr Fernando argued that the manner in which the heroin was packed was not\n\nprobative of the appellants ownership. We would note, however, that part of the heroin was kept\n\nin loose powder form in a green container as well as in a pink container. Both containers were found\n\nin the cupboard. The appellant admitted quite unequivocally that these containers were his. We also\n\nnote the fact that the heroin was closely intermingled with the appellants other drug related\n\nitems in the cupboard. We agree with the finding that the heroin belonged to the appellant and was\n\nin his possession.24.    Accordingly, the presumption arises that the heroin in the\n\nappellants possession was for the purpose of trafficking under s17 which reads:17 Any person who is proved to have had in his possession more than(c) 2 grammes of diamorphine;",
        "whether or not contained in any substance, extract, preparation or mixture\n\n  shall be presumed to have had that drug in possession for the purpose of trafficking unless it is\n\n  proved that his possession of that drug was not for that purpose.": "25.    The judge on the evidence quite rightly rejected the\n\nappellants story that the heroin belonged to Ah Seng. We agree that the appellant had\n\npossession of the heroin for trafficking.L P TheanChao Hick TinLai Kew ChaiJudge of AppealJudge of AppealJudgeCopyright © Government of Singapore."
    }
}