{
    "case_title": "Yap Ah Chuan v Public Prosecutor",
    "ncitation": "[2001] SGCA 71",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "The charge": "2 The charge read:That you, Yap Ah Chuanon the 19thday of January 2001, at about 1.20 p.m., at Blk 218 Choa\n\n  Chu Kang Ave 3 #03-246, Singapore, did traffic in a controlled drug specified in Class A of\n\n  the First Schedule to the Misuse of Drugs Act, Chapter 185, to wit, by having in your possession\n\n  for the purpose of trafficking, 2 blocks, 54 sachets and 1 straw containing a total of more than\n\n  15 grams but less than 55.38 grams of diamorphine, without any authorisation under the said Act or\n\n  the regulations made thereunder, and you have thereby committed an offence under section 5(1)(a)\n\n  read with section 5(2) of the Misuse of Drugs Act, Chapter 185, and punishable under section 33 of\n\n  the aforesaid Act.",
        "The offence": "3 The substantive offence is found in s 5(1)(a) of the Misuse of Drugs Act, which\n\nprovides:5. --(1) Except as authorised by this Act, it shall be an offence for a person,\n\n  on his own behalf or on behalf of any other person, whether or not that other person is in\n\n  Singapore(a) to traffic in a controlled drugThis substantive offence includes the offence of possession of a controlled drug\n\nfor the purpose of trafficking, as provided for in s 5(2):(2) For the purposes of this Act, a person commits the offence of trafficking\n\n  in a controlled drug if he has in his possession that drug for the purpose of trafficking.4 The elements required for the offence are as follows. Theactus reusis\n\nthe possession of a threshold amount of a controlled drug. The relevant provision in this case is\n\ns17(c):17. Any person who is proved to have had in his possession more than(c) 2 grammes of diamorphineThis element must be proved by the prosecution beyond a reasonable doubt.5 Themens reais the intention to traffic in that controlled drug. The\n\npresumption in s 17(c) reverses the burden of proof such that, instead of the prosecution having to\n\nprove beyond a reasonable doubt the accuseds intention to traffic, it is the defence which has to\n\nshow (on a balance of probabilities) that the accused had no such intention. The relevant part of s\n\n17 provides:17. Any person who is proved to have had in his possession more than(c) 2 grammes of diamorphinewhether or not contained in any substance, extract, preparation or mixtureshall\n\n  be presumed to have had that drug in possession for the purpose of trafficking unless it is proved\n\n  that his possession of that drug was not for that purpose(emphasis added).",
        "The background facts": "6 On 19 January 2001, a party of officers from the Central Narcotics Bureau\n\n(\"CNB\") arrived at Blk 218 Choa Chu Kang Central and discovered the appellant at the\n\nlanding between the fourth and fifth storeys. On arrest, the appellant led the officers to his home\n\nand surrendered two packets, 25 sachets and a straw of heroin. Inspector Gary Chan (\"Inspector\n\nChan\") (PW13) took a statement from the appellant (\"the first statement\"). The\n\nofficers searched the apartment and found another 29 sachets of heroin. At this point, Inspector\n\nChan took another statement from the appellant.7 The particulars of the items found are as follows. It would be useful at this\n\npoint to adopt and adapt a table from the judges grounds of decision. A final column, labelled\n\n\"status\", has been added.ItemExhibit NoWeight (g)Diamorphine weight (g)FoundStatus1 sachetP786.260.27Rack in\n\n      appellants bedroomCourt\n\n      held it was for appellants own consumption2 sachetsP799.920.51Pouch\n\n      on rack in appellants bedroom1 strawP800.230.0110 sachetsP8173.904.26White envelope\n\n      on coffee table in appellants bedroomAppellant\n\n      admitted it was for trafficking5 sachetsP8237.492.29Newspaper\n\n      on coffee table in appellants bedroom5 sachetsP8337.282.221 packetP84447.2019.14White\n\n      bag in appellants bedroomAppellant\n\n      claimed it was for own consumption1 packetP85446.8017.882 sachetsP8614.910.92Hazeline Snow\n\n      box on study table in appellants bedroomCourt held it\n\n      was for appellants own consumption29 sachetsP87216.407.88Cookie tin on\n\n      table near kitchenAppellant\n\n      claimed it was for own consumption8 The total weight of the drugs found was 1,290.39 g, and the total diamorphine\n\nweight was 55.38 g. The appellant admitted to possessing 8.77 g of the diamorphine for the purpose\n\nof trafficking. Hence the issue was whether the appellant possessed the remaining 46.71 g of\n\ndiamorphine for trafficking.9 The officers also found various paraphernalia used for drug consumption, two\n\nmobile phones and two pagers.10 As mentioned above, the appellant made two statements which were recorded by\n\nInspector Chan. He also made a long statement, recorded in four tranches, which was recorded by the\n\nInvestigating Officer, Inspector Muruganandam (PW 21). The defence did not challenge the\n\nvoluntariness of any statement.",
        "The evidence of the prosecution": "11 The prosecution called a total of 22 witnesses. The majority of them were\n\nCentral Narcotics Bureau officers, who gave evidence as to the appellants arrest and the location\n\nof the drugs. Others were staff of the Centre for Forensic Science, Health Sciences Authority, who\n\nhad analysed the appellants urine sample and the drugs. The combined effect of their evidence\n\nproved beyond reasonable doubt, that the appellant was in possession of 55.38 g of diamorphine. At\n\nthis point, the s 17 presumption operated to place on the appellant the burden of proving that he\n\ndid not intend to traffic in the drugs.",
        "The evidence of the defence": "12 The first point which the defence tried to establish was that the appellant\n\nwas heavily addicted to heroin. The appellant had been detained in drug rehabilitation centres\n\n(\"DRC\") seven times between 1983 and 1998. He was imprisoned for two years from 1998.\n\nDuring this period, he spent more time incarcerated than free. However, he reverted to his drug\n\nhabit each time he was released. The table below shows his level of consumption over this period,\n\naccording to the appellant. It should be noted that the appellants evidence as to the period of\n\ndetention is not on fours with the records, and in any case, some of the time periods do not make\n\nsense. However, these inconsistencies are not material.Approximate timeSachets consumedGrade of heroinBefore 1stdetention (1983)2 / week3After 1stdetention2 / week3Before 2nddetention (1984)5-6 / week3After 3rddetention (1986)8 / week3Before 4thdetention (1988)4 / week4 (superior grade)After 4thdetention8 / week4Before 5thdetention (1991)11 / week3After 5thdetention15 / week3After 6thdetention20-21 / week3After 7thdetention20 / week3After imprisonment2.5-3 / day3To support this, the appellants sister, Yap Bee Hoon (\"Ms Yap\")(DW2)\n\nalso testified regarding the withdrawal symptoms which she had witnessed in the appellant, and her\n\nfailed attempts to rid him of the addiction.13 The appellant claimed that most of the drugs were for his own consumption.\n\nHence the second point which the defence attempted to address was, why the appellant had purchased\n\nsuch a large quantity of drugs from one Ah Boy for his own consumption. The reasons given were:a As Ah Boy would not supply drugs for three weeks over the Chinese New Year\n\n  period, the appellant bought a larger amount to tide himself over during that period.b The appellant wanted to show Ah Boy that he could pay for a large quantity of\n\n  drugs, so that he could win Ah Boys trust.14 The third point which the defence tried to establish was that the appellant,\n\nthough an odd-job painter with a drug habit, could pay $12,000 for the heroin. It was also alleged\n\nthat Ah Boy allowed the appellant to have the drugs on credit. The appellant planned to pay by\n\neither of the following ways. The first option was:a He would borrow $10,000 from his brother-in-law, Goh Hak Hua (\"Mr Goh\")\n\n  (DW3).b He would make a profit of $1,000 from selling certain exhibits P81, P82 and\n\n  P83; andc He would return to work and earn the balance of $1,000.If Mr Goh could not or would not lend him the money, the appellant claimed that\n\nhe could return to work and save about $10,000 in seven months. He would also sell exhibits P81, P82\n\nand P83. This was his second option.15 The appellant claimed that the drugs could not have been meant for sale\n\nbecause:a There was no weighing machine in the appellants bedroom with which the\n\n  packets could be accurately weighed.b The packets had not been machine-sealed.16 The appellant added that one of the mobile phones had been given to him by one\n\nAh Heng, so that he could contact the appellant when he wanted to consume drugs with the appellant.\n\nThe appellant also said that both pagers belonged to him, but only one was still in use.",
        "The Judicial Commissioners decision": "17 The judge handed down his grounds of decision on 7 August 2001. He first set\n\nout the background facts relating to the appellants arrest and the recovery of the drugs. He then\n\nset out the gist of the appellants statements to the police. He then documented the proceedings\n\nbefore him.18 The judge found that the charge against the appellant was proved beyond\n\nreasonable doubt for the following reasons:a He did not believe that the appellant had bought such a large quantity of\n\n  drugs merely because Ah Boy would not supply him with drugs for three weeks over the Chinese New\n\n  Year period.b He did not believe that the appellant had tried to borrow $10,000 from Mr Goh.c He did not believe that Ah Boy would not chase the appellant for payment.d He did not believe that the sachets could not be for sale because they had\n\n  not been sealed by machine, as the sachets which the appellant had admitted were for sale had also\n\n  not been sealed by machine.e The fact that there was no weighing scale in the appellants bedroom was\n\n  irrelevant, as there was no evidence that buyers would not buy drugs unless they had been\n\n  accurately weighed.f He accepted the evidence of the prosecutions expert, Dr Choos opinion\n\n  that the appellant was only mildly addicted to heroin.g He did not believe that Ah Heng gave the appellant a mobile phone merely for\n\n  the purpose of contacting him so they could consume drugs together. He also did not believe that\n\n  the appellant had terminated the line of his second pager.h He was not satisfied with the appellants attempt to explain away the\n\n  inconsistencies between his statements and his evidence, by saying that he had been confused and\n\n  tired when he gave his statements.19 We do not discuss points (d), (e) and (g) above as they are minor and we see\n\nno reason to overturn the judges findings thereon.20 The judge also held that 1.81 g of the diamorphine was probably for the\n\nappellants own consumption, as these items were not found with the other drugs and were neither\n\nin an envelope nor covered with newspaper. The respondent submitted before us that the judge should\n\nnot have conducted the apportionment exercise, but the status of the 1.81 g of heroin would not have\n\naffected the outcome of our decision.",
        "The issues": "21 The issues in this appeal were:a Whether the appellant was severely addicted to, and consumed large amounts\n\n  of, heroin.b Whether it was believable that the appellant had bought an unusually large\n\n  amount of drugs on credit, for his own consumption.c Whether it was believable that the appellant would be able to pay for the\n\n  drugs.22 In dealing with these issues, the following passage fromPublic Prosecutor\n\nv Lim Ah Poh and another[1992] 1 SLR 87was borne in mind:An appellate court will not disturb findings of fact unless they are clearly\n\n  reached against the weight of the evidence. In examining the evidence, an appellate court has\n\n  always to bear in mind that it has neither seen nor heard the witnesses and has to pay due regard\n\n  to the trial judges findings and their reasons therefor.",
        "The first issue": "23 The first question was whether the appellant was severely addicted to heroin.\n\nThe prosecutions final witness was Dr Choo. Dr Choo had, in a little less than a year, attended\n\nto about 1,000 drug addicts at DRCs. He was called to rebut the defences case that the appellant\n\nwas heavily addicted to heroin, and hence that it was very likely that exhibits P84, P85 and P87\n\nwere also meant for the appellants own consumption.24 Dr Choo first described the withdrawal symptoms associated with mild, moderate\n\nand severe cases of drug addiction respectively. He then spoke about the treatment which had to be\n\nadministered in each case. He also offered an opinion on the average amount of heroin which a\n\nmildly-, moderately- and severely-addicted person would consume per day.25 Dr Choo felt that the following factors pointed to the conclusion that the\n\nappellant was only mildly addicted to heroin:a Several reports by different doctors at the DRCs stated that the appellant\n\n  was mildly addicted to heroin.b Each time the appellant was in DRC or in prison, he did not have access to\n\n  drugs. This would mean that, each time he reverted to his drug habit, he would start by consuming\n\n  small amounts as his tolerance to drugs had not built up. It was hence unlikely that the appellants\n\n  consumption rate was as high as he claimed it was.c Dr Choo and his staff nurse examined the appellant on the day of his arrest\n\n  and found that his symptoms were consistent with that of mild addiction. He was well enough to be\n\n  discharged the next day.d As Ms Yap testified, the appellant recovered from his withdrawal symptoms\n\n  after \"cold turkey\" treatment. If he had been severely addicted, he would have died as a\n\n  result of such treatment.26 The defence did not challenge Dr Choos status as an expert and failed to\n\nproduce any relevant evidence which rebutted Dr Choos opinion.27 The second question was whether it was likely that the appellant was consuming\n\n2.5 to 3 sachets of grade 3 heroin a day prior to his arrest for the present charge. This was the\n\nevidence given by the appellant at trial. However, in the third tranche of his long statement\n\n(recorded on 29 January 2001), the appellant had stated that he smoked a sachet of heroin a day and\n\nhence his average monthly consumption was 30 sachets. When cross-examined on this inconsistency, the\n\nappellant claimed that he may have been confused as to the quality of the heroin, because if it was\n\nof a better grade, he would require fewer sachets. However, as pointed out by the prosecution, the\n\nonly time during which he consumed grade 4 heroin was 1986 to 1987. There should be no reason for\n\nsuch confusion in 2000.28 Dr Choo also opined that it was unlikely that the appellant consumed 2.5 to 3\n\nsachets of heroin a day. His rate of consumption was more likely to be 0.5 sachet per day.",
        "The second issue": "29 The first question was whether the drugs were for the appellants own\n\nconsumption or for trafficking. Several parts of the appellants statements suggested that the\n\nappellant was trafficking in drugs:a From the first statement:Q: Whom does this drug belong to?A: I safe keep for my friend..Q: What are all these substances for?A: He call me to pass to people when he contact me. I do not know who will\n\n    take from me as I will be instructed by Ah Boy.Q: How much will you earn from all these?A: About one thousand dollars.b From para 15 of the second tranche of the long statement (recorded on 26\n\n  January 2001):I have not paid the money to him, as I will have to sell the heroin and pay it\n\n  to him later. I normally would sell the heroin and pay Ah Boy later. Ah Boy would call\n\n  me regularly to check if I could pay him his money.c From para 21 of the third tranche of the long statement (recorded on 29\n\n  January 2001):The profits, which I had obtained from the heroin trafficking, had been loaned\n\n  out to my friends. For each ball of heroin that I purchase from Ah Boy, I would make about\n\n  $3,000 profit.d From para 27 of the fourth tranche of the long statement (recorded on 30\n\n  January 2001:The other reason why I do not have many customers is because I had just started\n\n  selling drugs about three weeks before my arrest I have five friends who are living in Teck\n\n  Whye to whom I sell heroin.30 The appellant only mentioned the notion of personal consumption in the third\n\ntranche of the long statement (para 24):I would like to say that on the day of my arrest there were two balls of heroin\n\n  and another 30 over sachets of heroin seized in my flat. All these drug (sic) were actually\n\n  meant for my own consumption.However, during the trial, the appellant admitted that exhibits P81, P82 and P83\n\nwere meant for trafficking. The appellant seemed to have changed his story more than once: he first\n\nspoke of his trafficking in general terms, then claimed that all the drugs seized were for his\n\npersonal consumption, then circumscribed his admissions as to trafficking to exhibits P81, P82 and\n\nP83. We found this account unbelievable.31 The second question was why the appellant bought such a large quantity of\n\ndrugs if they were merely for his own consumption. Neither reason given by the appellant at trial\n\nhad been mentioned in his statements. Under s 123(1) of the Criminal Procedure Code (Cap 68), the\n\ncourt could draw any relevant inferences from this failure. The appellants first reason was that\n\nAh Boy would not supply him with heroin for three weeks over the Chinese New Year period. At the\n\ntrial below, defence counsel submitted that the appellant would take between 60 and 72 days to\n\nconsume three packets of heroin, and this made the appellants case credible. The prosecutions\n\ncalculations, based on two packets, 54 sachets and a straw of heroin, concluded that the appellant\n\nwould have enough to last him more than 51 days. A period of 51 to 72 days can by no means be\n\nmistaken for three weeks, and with respect this aspect of the appellants case was not credible.32 The appellants second reason was that he had ordered a large quantity of\n\nheroin from Ah Boy so that, on his making full payment, Ah Boy would think him a reliable customer\n\nand trust him. There were many holes in this line of reasoning. The largest one was the premise that\n\nthe appellant could make payment at all (see the third issue below). It also went against common\n\nsense to go to so much trouble to gain Ah Boys trust. Surely the relationship between drug\n\nsupplier and drug user is of a commercial nature rather than one built on trust. For this reason,\n\nthe appellants evidence that Ah Boy supplied the heroin to him on credit and did not chase him\n\nfor payment was also difficult to believe.",
        "The third issue": "33 A key element in the appellants first payment option was a loan of $10,000\n\nfrom Mr Goh. It should be noted that the appellant did not mention in any of his statements that he\n\nhad asked Mr Goh for a loan. Once again, the court could draw adverse inferences under s 123 of the\n\nCriminal Procedure Code.34 Mr Gohs testimony also cast some doubt on the truth of this claim. The\n\nfirst issue was Mr Gohs ability to make the loan. In response to a question by the judge, Mr Goh\n\nrevealed that his personal savings amounted to more than $10,000 but less than $15,000. While he may\n\nhave been able to lend the appellant $10,000, that would have meant parting with a large part of his\n\nsavings. Given that the appellant still had not repaid a loan which he had previously taken from Mr\n\nGoh, and that the appellant did not hold a regular job, it was unlikely that Mr Goh would see his\n\nmoney again.35 Secondly, Mr Goh was not sure of, and did not care for, the reason behind the\n\nappellants request for a loan. This seemed strange, given the reason above. Under\n\ncross-examination, he admitted that he knew of the appellants drug habit, but claimed that it did\n\nnot occur to him that the appellant might use the money to buy drugs. It also did not strike him\n\nthat this might undermine the efforts of the appellants family to rid the appellant of his\n\naddiction.36 Thirdly, Mr Goh had not even agreed to the appellants request. He was\n\nunable to communicate his decision to the appellant because the latter had been arrested. He was\n\nevasive as to his level of willingness to make the loan, and maintained that he would\n\n\"consider\" the appellants present and future requests.37 As for the appellants second payment option, it was unlikely, given his\n\nmonthly salary of about $2,000 and his expensive drug habit, that he could save $10,000 in seven\n\nmonths.",
        "Conclusion": "38 For the reasons above, we dismissed the appeal.Sgd:Sgd:Sgd:YONG PUNG HOWL P THEANCHAO HICK TINCHIEF JUSTICEJUDGE OF APPEALJUDGE OF APPEALCopyright © Government of Singapore."
    }
}