{
    "case_title": "The Development Bank of Singapore Limited v Ong Yew Huat and Others",
    "ncitation": "[2001] SGCA 58",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "Decision of the court below": "12 The judge below held that the charge was only to secure the $18 million overdraft\n\ndebt which Sogo owed to DBS at the time the charge was created and that the phrase\n\n\"all moneys and liabilities which may be owing to the Bank from time to time\"\n\nappearing in the facility letter related to ancillary debts such as interests and costs\n\narising under the facility; it could not mean any money or liability outside the facility.\n\nHe was of the view that while the wording of the charge seemed to be wide, the clauses\n\ntherein must be read together to determine the parties' intention. Clause 4 referred to\n\nthe termination provision of the facility letter and the right of the chargor to withdraw\n\nsuch amount from the FD as was commensurate with the sums repaid by Sogo in accordance\n\nwith the repayment schedule. Clause 6 referred to Tararone's obligation to keep the charge\n\nas a continuing security up to $18 million and the expression \"continuing\n\nsecurity\" ought not be given a wider meaning than was plain in the context of the\n\nfacility letter and the charge. He felt that it could not have been the intention of the\n\nparties that the charge should secure any further loans made by DBS to Sogo when the\n\noverdraft facility granted under the letter of 4 March 1998 had been terminated.",
        "Issues": "13 Before us the main issue centred on the nature and scope of the charge. The second\n\nissue is whether, having informed Tararone that the overdraft facility was terminated, DBS\n\nwas under a duty to inform Tararone that the former was proposing to restore the overdraft\n\nfacility. The third issue is whether a fresh approval or resolution of the board of\n\ndirectors was necessary to enable the facilities granted to Sogo after 15 July 2000 to be\n\nsecured under the charge.",
        "Nature of charge": "14 Tararone seek to construe the charge in the light of the facility letter where it\n\nwas provided that the overdraft facility, \"together with all monies and liabilities\n\nwhich may be owing to (DBS) from time to time\" would be secured by the FD. Tararone\n\nargue that the expression \"all monies and liabilities\" must mean, in the\n\ncontext, all monies and liabilities under the overdraft facility and nothing else.15 We would observe that, if that was the intended meaning, then the word\n\n\"thereunder\" should appropriately have appeared after the phrase \"may be\n\nowing\". Indeed, if that was the intention, there would have been no necessity to\n\nrefer to \"all monies and liabilities which may be owing to the bank from time to\n\ntime.\" It would have sufficed to merely state \"The above facility shall be\n\nsecured by…..\"16 We shall now turn to consider the provisions in the charge. Under clause 1, the\n\ncharge was expressly stated to be in respect of \"advances, loans credit and/or other\n\nbanking facilities or accommodation\" given to Sogo, all of which facilities are\n\ncollectively referred to as \"the banking facilities\". Under that clause,\n\nTararone covenanted to pay to DBS, on demand, all sums of money owing by Sogo in respect\n\nof those banking facilities. Clause 2 charged the FD with the repayment of all moneys\n\nowing by Sogo to DBS. Tararone further confirmed that the FD would be held by DBS as a\n\ncontinuing security for the due payment of all of Sogo's liabilities owing from time to\n\ntime to DBS. Clause 3 authorised DBS, without notice to Tararone, to appropriate all or\n\nany part of the FD towards payment of all of Sogo's liabilities to DBS. Finally, clause 6\n\nreaffirmed that notwithstanding the other provisions, the charge \"shall be and remain\n\na continuing security for all moneys and liabilities from time to time owing by Sogo to\n\nDBS in respect of the banking facilities.\" In the light of the terms of these\n\nclauses, there cannot be any doubt that this was an \"all money\" charge.17 While it is true that the original reason for the creation of the charge was the $18\n\nmillion overdraft facility which DBS had then granted to Sogo, and which DBS were prepared\n\nto continue to extend to Sogo, the express terms of the charge clearly go beyond that.\n\nNowhere is it stated, nor can it be implied, that the charge merely secures the payment of\n\nthe overdraft facility. The court ought to give effect to what the document expressly and\n\nspecifically stated.18 In this connection reference may be made to Bank of India v Trans Continental\n\nCommodity Merchants' Ltd & Patel [1983] 2 Lloyd's Rep 298 and Re Rudd & Son Ltd\n\n(1986) 2 BCC 98,955. Admittedly, in these two English cases, the charging provisions were\n\nnot identical to that of the present case and they also specified \"on any account\n\nwhatsoever\" or \"any other account\", which are not to be found in our\n\ninstant charge. However, in our opinion, these differences notwithstanding, they do not\n\nrender the charge here any less an \"all-money\" charge. While the words \"any\n\nother account\" do not appear in the present charge, it must be borne in mind that\n\nclause 1 refers to \"advances, loans, credit and/or other banking facilities or\n\naccommodation\". It is a very wide clause. If the intention was merely to secure that\n\nspecific overdraft account, it would have easily so stated. Furthermore, Tararone also\n\ncovenanted to pay on demand \"all sums of moneyswhich now or thereafter from time\n\nto time and at any timeshall be owing\" in respect of the aforesaid banking\n\nfacilities. This is again inconsistent with any intention to only repay the debt in the\n\noverdraft account.19 In our judgment, the charge is truly a charge in respect of all moneys from any\n\naccount which are owed by Sogo to DBS. We would reiterate that, if the overdraft account\n\nwas all that the parties had in mind, they would have simply referred to that and would\n\nnot have widened the clause to cover any \"advances, loans, credit and/or other\n\nbanking facilities.\" Most of the clauses in the charge may well be standard\n\nprovisions (as clause 4 is clearly not) but there is no canon of construction which allows\n\nthe court to ignore the express words in a document, or to rewrite the terms which the\n\nparties have agreed, unless a plain construction of the words would lead to absurdity20 In this regard, it would be useful to examine the case of Bank of India v Trans\n\nContinental Commodity and glean the purposive and practical approach taken by the court in\n\nrelation to a wide \"all money\" clause in a guarantee given to a bank. There, the\n\noperative wording was \"in consideration of the (bank) … affording banking\n\nfacilities\" to the borrowers, the guarantors agreed to pay the bank \"all and\n\nevery sum and sums of money which are now or shall at any time be owing to the bank\n\nanywhere on any account whatsoever.\" In that case the claim related to losses\n\nsuffered by the borrowers on some twelve foreign exchange contracts. The arguments\n\nadvanced by the guarantors were that the foreign exchange transactions did not come within\n\nthe terms \"banking facilities\". Both the English High Court and the Court of\n\nAppeal refused to let the wide terms of the guarantee be circumscribed by the opening\n\nwords of the clause. At first instance, Bingham J said ([1982] 1 Lloyd's Rep 506 at 512):-\"I am, however, of opinion that the language of this guarantee was deliberately\n\n  drawn in the widest possible language so as to cover any liability of the company to the\n\n  bank arising out of their mutual relations as banker and customer, however that liability\n\n  might arise and whether it arose out of what may be called a pure banking activity or not.\n\n  I consider the language of the substantive clause so clear as to obviate the need for\n\n  reference to the introductory recital, but even if regard is paid to that recital and\n\n  \"banking facilities\" were assumed not to include foreign exchange facilities I\n\n  could not read the recital as cutting down in any way the deliberately wide language which\n\n  follows. I would not, in any event, construe 'banking facilities' as excluding foreign\n\n  exchange facilities offered by and through the bank. It is true that these are not what I\n\n  have called pure banking activities. It is however indisputable that the major\n\n  international banks conduct a large and regular business in foreign exchange dealing,\n\n  which operations play a very large part in the business of some of them. It would, I\n\n  think, be unrealistic in the modern financial world to treat facilities for the conduct of\n\n  foreign exchange deals by and through banks as not being banking facilities, even though\n\n  these are not facilities exclusively offered by banks.\"21 This view of Bingham J was affirmed by the Court of Appeal where Robert Goff LJ said\n\n([1983] 2 Lloyd's Rep 298 at 301):-\"… there is no ambiguity in the body of the guarantee justifying recourse to\n\n  the introductory words to resolve any such ambiguity; but even if such recourse were\n\n  justified, I would not myself read the words \"banking facilities\" in those\n\n  introductory words as excluding foreign exchange transactions of the type which were\n\n  entered into in the present case. I am therefore unable to accept this argument.\"22 In Re Rudd & Son Ltd (supra), the issue was whether contingent liabilities were\n\nsecured by the mortgage, which provided that \"all … sums … owing anywhere\n\non the current account of the firm (the borrower) or any other account …\n\nincluding\" and naming various kinds of liability. The contingent liabilities were\n\ncounter-indemnities given by the firm to the bank in respect of performance bonds given by\n\nthe bank to a local authority in connection with road works to be carried out by the firm.\n\nThe liquidators of the mortgagor company argued that the contingent liabilities were not\n\nsecured by the mortgage. It should be mentioned that, sometime after the liquidation of\n\nthe mortgagor company, the local authority did call on the performance bonds. The Court of\n\nAppeal, reversing the High Court, took into account commercial sense in arriving at its\n\ndecisions. Dillon LJ said (at 98,959):-\"in my view it does not make commercial sense that the mortgage should cover\n\n  contingent liabilities once they are called but not otherwise.\"23 Nicholls J, the second member of the panel, said (at 98,961):-\"In the proviso for redemption there are several references to transactions which\n\n  at their inception would give rise to a contingent liability of the firm to the bank. I\n\n  mention some of them. When a bill is discounted the liability of the firm to the bank will\n\n  be contingent on the bill being dishonoured, which may not happen. Likewise, if the credit\n\n  is made for the accommodation or at the request of the firm, the firm's liability to the\n\n  bank in respect of this will be contingent until payment is made by the bank under the\n\n  letter of credit. Again, liability of the firm to the bank as surety will normally be\n\n  contingent on the primary debt accruing due as a present liability.To my mind it is abundantly clear that the security was intended to embrace these\n\n  contingent liabilities. But that intention will not be given effect to if the proviso is\n\n  read in such a way that only money which is shown as presently owing on a current or other\n\n  account of the firm is covered by the security.For my part, I can see no justification for so reading the proviso. A common, if not\n\n  strictly accurate, usage of the word \"including\" by draftsmen is to refer to\n\n  matters which are not embraced by the preceding words. So used, the word\n\n  \"including\" enlarges, or extends, as well as particularises. I think it is\n\n  evident that the word \"including\" is so used in this mortgage document.So construed, the security created by this mortgage will extend to contingent\n\n  liabilities, notwithstanding that the provision at the beginning of the proviso refers\n\n  only to payment to the bank of 'all and every the sum and sums of money which shall for\n\n  the time being be owing to the Bank by the Firm anywhere on the current account of the\n\n  Firm or any other account.\"24 We have considered these two cases purely to gauge judicial attitudes in relation to\n\nsuch \"all money\" clauses. We recognise that in each case, the relevant document\n\nmust be considered as a whole in order to obtain its true sense. More significantly, the\n\ncourt has to interpret such clauses in accordance with its commercial sense, in order to\n\ngive effect to the parties' intention.",
        "Alleged contradiction": "25 At this juncture, we would refer to an alleged contradiction between clause 1 and\n\nclause 4, as contended by Tararone. The judge below, in arriving at his conclusion, felt\n\nthat clause 4 was relevant to determining the scope and intent of the charge. Here, we\n\nwould refer to what DBS's counsel, Mr Leslie Chew, submits is an erroneous reference made\n\nby the judge. The judge said that clause 4 \"referred specifically to the termination\n\nprovision under the facility letter.\" Mr Chew pointed out that there is no\n\ntermination provision in the facility letter. We note that the opening of clause 4\n\nprovides that \"without prejudice to para 1(d)(i) of the facility letter.\" Para\n\n1(d)(i) of the facility letter states that \"DBS reserves the right to review the\n\nabove banking facility from time to time at its absolute discretion\" which would\n\nundoubtedly give DBS the right to terminate the facility. In our view, this was probably\n\nwhat the judge had in mind when he stated that clause 4 referred specifically to the\n\ntermination provision under the facility letter. Of course, a clause giving the bank a\n\npower to review should not be regarded as a termination provision. A review need not\n\nnecessarily lead to termination. To this extent, to describe para 1(d)(i) of the facility\n\nletter as a termination provision is not entirely correct.26 The contention of Mr Ronald Choo, counsel for Tararone, is that implicit, if not\n\nexplicit, in clause 4 is the acknowledgement that the charge is really intended to cover\n\nthe overdraft facility and nothing else. This is because the clause permits Tararone to\n\nwithdraw sums from the FD in line with the repayment of the sum outstanding in the\n\noverdraft account. If the charge was intended to cover all debts or liabilities due from\n\nSogo on any account with DBS, besides the overdraft account, then Tararone should only be\n\nallowed to withdraw sums from the FD in line with the total liabilities of Sogo to DBS and\n\nnot just based on what was outstanding in the overdraft account to DBS.27 Mr Chew, however, argues that clause 4 does not affect the \"all money\"\n\nnature of the charge set out in clause 1. It is effectively a provision which sets out how\n\nmuch monies can be withdrawn by Tararone from the FD. For example, in accordance with the\n\nrepayment schedule, as at 31 July 1998, the maximum limit of the overdraft account had to\n\nbe reduced from $18 million to $10 million and in turn Tararone could withdraw $8 million\n\nfrom the FD. Similarly, on the day preceding the date the overdraft facility was\n\nterminated, in accordance with the repayment schedule, the maximum overdraft allowed to\n\nSogo was $3 million. What Tararone could withdraw from the FD at that point in time was\n\nsuch sum as would leave behind in the FD a sum of not less than $3 million.28 On a true construction, we would agree with counsel for DBS that what clause 4\n\nreally provides is a right for Tararone to withdraw sums from the FD in accordance with\n\nthe repayment schedule. It is really a provision of a consequential nature, because, with\n\nthe compliance of Sogo with the repayment schedule, the maximum accommodation which DBS\n\nwould allow to Sogo was to be reduced in stages. In line with that, there would be no\n\nreason for DBS to hold onto the original FD of $18 million but to allow Tararone to\n\nwithdraw therefrom corresponding with DBS's exposure. Just as an illustration; on 28 April\n\n2000, Sogo would have reduced the outstanding amount owed to DBS to $3,000,000. So from\n\nthat day onwards DBS would only grant Sogo facilities up to that limit and no more. Of\n\ncourse, the account being a current overdraft account, the amount outstanding therein\n\nwould vary from day to day but under no circumstances would DBS grant facilities beyond\n\nthat limit. Thereafter, the next milestone would be 31 July 2000 when Sogo would only be\n\naccorded facilities of up to $2 million. Between 28 April 2000 and 31 July 2000, even\n\nthough there might well be some days where the sum in debit in the account might be very\n\nmuch less than $3 million, say $1.5 million, there would still be no right on the part of\n\nTararone to request a further withdrawal of $1.5 million from the FD. The right of\n\nwithdrawal of Tararone must follow the milestones set out in the repayment schedule. Sogo\n\nwas entitled to expect DBS to accord to it the facilities up to the extent as specified in\n\nthe repayment schedule. Tararone could not demand the acceleration of withdrawal from the\n\nFD based on the day to day variations in the outstanding sum in the overdraft account.29 Accordingly, it is our opinion that clause 4 is not inconsistent with clause 1,\n\nwhere the scope of the charge is set out.30 Finally, we ought to mention that counsel for Tararone relied upon the following\n\npassage of Young J in the Australian case Estoril Investments Pty Ltd v Westpac Banking\n\nCorporation (1993) 6 BPR 13,146 to contend that, in relation to the present charge, it\n\nshould sensibly be read down to circumscribe its application:- However, in my view it is\n\nvalid to say in Australia that when one sees a mortgage in wide words and, as I believe is\n\nthe situation in the instant case, one would get absurdities if one read the wide words\n\nliterally, one should pause to see whether the parties intended when they entered into the\n\nmortgage that it should cover the circumstance which has now arisen.31 We do not see how this passage assists Tararone when the crucial qualification in\n\nthat passage is \"one would get absurdities if one read the wide words\n\nliterally.\" The absurdities which counsel thought existed in the present charge was\n\nthe alleged contradiction between clause 1 and clause 4. We have explained above the\n\nconsistency between the two clauses. To give clause 1 of the charge its plain meaning\n\nwould not lead to any absurdity. It is a common phenomenon for banks, in granting\n\nfacilities, to require the execution of an \"all-money\" charge. It is also a\n\ncommon feature for banks to set a limit to the facilities it would accord to the borrower,\n\nwhich facilities would be secured by a charge.",
        "Letter of 15 July 2000 and estoppel": "32 We now turn to consider the letter of 15 July 2000 of DBS (15 July letter) notifying\n\nTararone of the termination of the overdraft account and demanding that Tararone repay the\n\nsum of $365,873.87 then outstanding in that account. The effect of that notification is no\n\nmore, and no less, than what it stated - that the overdraft account had been terminated\n\nand that the outstanding debt was $365,873.87 and that Tararone as the guarantor, should\n\npay up the same to DBS. It did not refer to the charge in any way. Therefore, it could not\n\nhave impinged on the continued validity or enforceability of the charge.33 It is not reasonable to infer from the letter that DBS would not grant any further\n\nfacility to Sogo, or for that matter, to revive the overdraft account (effectively\n\ngranting a fresh facility). As the coverage of the charge is in very wide terms and as it\n\nis an \"all money\" charge, then, until the charge is validly withdrawn, it would\n\ncover all sums which Sogo may be owing from time to time to DBS, including any new\n\nfacility extended by DBS to Sogo.34 Counsel for Tararone has argued before us that the 15 July letter, by stating that\n\nthe overdraft facility had been terminated, had represented that DBS would not permit\n\nfurther drawings or offer new facilities to Sogo. It seems to us that this argument raises\n\nthe question of estoppel.35 For estoppel to apply, three elements must be satisfied and they are encapsulated in\n\nthree words: representation, reliance and detriment. It is clear that the 15 July letter\n\n(a) notified Tararone of the termination of the overdraft facility and (b) demanded\n\npayment from Tararone as the guarantor of what was outstanding then in the account of\n\n$365,873.87. Looking at the letter objectively, we do not think anything more can or\n\nshould be read into it. This is very much the usual letter of demand issued by a bank to a\n\nguarantor. It says nothing with reference to the charge. We do not think it warrants any\n\ninference that DBS would not be offering any fresh facility to Sogo or that the amount\n\nstated in the letter was the final amount that Tararone would be liable under the charge\n\nand that the charge would effectively come to an end. To find an estoppel, a\n\nrepresentation must be clear and unambiguous. This can hardly be said to be satisfied\n\nhere. Accordingly, we hold that the first element to raise estoppel is not met.36 We would further add that the second element of reliance is also not fulfilled.\n\nTararone argued that they could have withdrawn the charge subject to putting up adequate\n\nsecurity for the outstanding sum owing by Sogo under the overdraft account. This, Tararone\n\nsaid, was the reliance. To constitute reliance, there must be substantive evidence on\n\nthat. There is, in truth, no evidence whatsoever of any reliance. There is no evidence\n\nthat Tararone was contemplating withdrawing the charge and had refrained from doing so on\n\naccount of the alleged representation that Tararone's liability under the charge was fixed\n\nat $365,873.87 and that thereafter the charge would be of no effect. This alleged reliance\n\nsmacks entirely of an ex post facto rationalization. Accordingly, as there was no\n\nreliance, there could not have been any damages suffered on account of that.37 In this regard, it is pertinent to point out that Mr Takeshi Tsujita, who was the\n\nManaging Director of Sogo and who wrote the letter of protest of 17 July 2000 to DBS, was\n\nalso the Managing Director of Tararone. He was clearly running both Sogo and Tararone. So\n\nwe are unable to see how Tararone can claim to be ignorant of what transpired between DBS\n\nand Sogo. It is significant that no one from Tararone has affirmed any affidavit to say\n\nthat Tararone was not aware of the further accommodation extended by DBS to Sogo on 17\n\nJuly 2000.",
        "Other issues": "38 In 13 above, we have identified two other issues raised by Tararone. In our\n\njudgment, they are without merits and may be disposed off shortly.39 In the light of our views as to the nature and scope of the charge, there was no\n\nnecessity for DBS to obtain the approval of the board of Tararone before DBS could extend\n\nfresh facilities to Sogo after the termination of the overdraft account.40 The other point is whether, DBS, having informed Tararone of the termination of the\n\noverdraft facilities, was under a duty to further inform Tararone when the bank intended\n\nto revive the overdraft account or grant further facilities to Sogo. Tararone put this\n\nargument on the basis that a bank must disclose to a surety \"unusual features\"\n\nrelating to a transaction and reliance was placed on Habibullah Mohamed Yousuff v Indian\n\nBank[1999] 3 SLR 650, which was a case where the Court of Appeal granted leave to a\n\nguarantor to defend the claim in an Order 14 application. Unlike the situation there,\n\nthere is nothing unusual for a bank to terminate a facility and later, upon\n\nrepresentation, to either revive the facility or offer fresh facilities. Indeed, such a\n\nsituation clearly falls within the terms of clause 1 of the present charge. The situation\n\nin Habibullah Mohamed Yousuff was really quite different.",
        "Judgment": "41 In the result, we would allow the appeal and declare that the further facilities,\n\nextended by DBS to Sogo after 15 July 2000, were secured under the charge. DBS were,\n\ntherefore, entitled to recover the outstanding amount in the overdraft account of Sogo\n\nfrom the FD of Tararone.42 The appellants shall have the costs here and below. The security for costs, together\n\nwith any accrued interest, shall be refunded to the appellants.YONG PUNG HOWL P THEANCHAO HICK TINCHIEF JUSTICEJUDGE OF APPEAJUDGE OF APPEALSINGAPORE DATE: 4 SEPTEMBER 2001Copyright © Government of Singapore."
    }
}