{
    "case_title": "Wu Fu Ping and Another v Ong Beng Seng and Others",
    "ncitation": "[2001] SGCA 6",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "The background": "In 1992, the appellants, in this appeal, whom we will for convenience call Wu and Thia, and the respondents, whom we will call `the Ongs` and another, Juay Chong Lee, entered into a joint venture and incorporated a company called Koh Yee Huat Enterprises Pte Ltd (KYH). KYH was run like a quasi-partnership. The Ongs, in total, held 46% of the shares in KYH.The business of KYH grew. It bought shares in another company, PJ88 Enterprises Pte Ltd (`PJ88`) and incorporated two other companies, Teng Tong Corporation Pte Ltd (Teng Tong) and Wueyfu Investment (S) Pte Ltd (Wueyfu). Everyone had the same number of shares in KYH except for one of the Ongs, Ong Kok Beng (the third respondent).KYH, PJ88 and Teng Tong are all involved in the business of operating coffee shops and renting stalls to third parties who would pay in addition to the rental, a deposit which would be refunded on termination of the licence. These three companies shall hereinafter be referred to as `the companies`.Trouble started in June 1997 when Wu and Thia purchased Juay`s shares in KYH and appointed three additional directors to KYH. Under the articles of association of KYH, the same opportunity should also have been offered to the Ongs to purchase Juay`s shares. The Ongs then instituted OS 781/97 for a declaration that the transfer of shares from Juay to Wu and Thia was invalid. A second originating summons (OS 776/97) was commenced to declare the appointment of the three new directors as invalid. A third originating summons (OS 767/97) sought relief for the sale of the Ongs` shares in KYH to Wu and Thia, or for the company to be wound up, on the ground of oppression.All the three originating summonses were consolidated for trial. Juay was also made a party to those proceedings. However, the trial did not commence as the parties, on the prompting of the judge, decided to negotiate for a settlement. In  order that a settlement could be speedily reached, the parties adopted a broad brush approach, without seeking valuation and taking only the following assets into account to determine the fair price for the shares of the Ongs, which Wu and Thia would buy over:(i) the value of the real properties owned by the companies;(ii) the cash in the bank accounts of the companies;(iii) the estimated value of Teng Tong as a going concern.All other assets, eg amounts due from debtors to KYH, profits of KYH, furniture and fittings, were to be disregarded for the valuation of the shares of KYH.After considerable haggling over several days, it was agreed that each KYH share be valued at $8. On the basis of this valuation, Wu and Thia were to pay $3.68m to the Ongs for their 460,000 shares in KYH and some $1.1m to Juay. However, as Wu and Thia did not have the necessary funds to pay to the Ongs, the parties agreed that the Ongs would take over a commercial property (a coffee shop) which was the principal asset of PJ88 (by transferring all shares in PJ88 to the Ongs) and it was also agreed that that property was worth $9m. On this arrangement, with the transfer of the property to the Ongs, the latter were to pay Wu and Thia, the difference between $9m and $3.68m and also less some other sums. The details of the payment arrangement were specified in cl 5 of the consent order and it is necessary that we set out that provision:Subject to the first and second defendants complying with the conditions laid down in s 76(10) and 76(11) of the Companies Act on or before the completion date, the first, second and third plaintiffs shall pay the first and second defendants a sum of moneys on the completion date calculated in the following manner:$9,000,000.00 less the amount due to the Bank in respect of the mortgage loan of Blk 640 [num ]01-04 Bukit Batok Central less all other debts of PJ88 which accrued before the completion date less the sum of $3,680,000.00 being the agreed valuation of the first, second and third plaintiffs shares in the Company less the first and second defendants` share of the hearing fees of the above actions. The payment herein is subject to settlement of account under Orders 6, 16, 17 hereof, if any.It would be noted that cl 5 refers to cll 6, 16 and 17 and these clauses are central to the issues which have now arisen between the parties:6 There shall be verification of the Bank balances, rental of food stalls deposits as at 21 October 1998 before the completion date provided that any adjustments shall not affect the share valuation but shall be by settlement of account....16 (Wu and Thia) are to indemnify the (Ongs) of all liabilities, including all government taxes, levies, fees and/or charges incurred up the completion date owing to third parties and/or government bodies of PJ88.17 (Ongs) are to indemnify (Wu and Thia) of 46% of all liabilities, including all government taxes, levies, fees and/or charges incurred up 21 October 1998 owing to third parties and/or government bodies by the Company and (Teng Tong).Under the consent order, the original completion date was to be 2 February 1999. By mutual agreement it was postponed to 12 April 1999. However, prior to this date problems began to surface. On 7 April 1999, the parties appeared before  the judge, who recorded the consent order, for the purpose of resolving the completion account. Following that appearance, Wu and Thia`s solicitors wrote on the same day to Ongs` solicitors forwarding a revised completion account and stating:-1 We refer to the attendance before the Judicial Commissioner Tay Yong Kwang this morning on the matter of the Settlement Account for completion.2 We enclose herewith revised Completion Account and in respect of which please take note the manner of payments requested.3 With regard to your clients` liability to indemnify our clients to the extent of 46% of the Company`s and Teng-Tong Corporation Pte Ltd`s liabilities, our clients will seek your clients` payment in discharge of their indemnity for each and every of the liabilities when discharged. In this regard, we shall forward to you as soon as possible a statement of all the liabilities subject to your clients` indemnity. Amongst others, the liabilities will include the Company`s and Teng-Tong Corporation Pte Ltd`s liability to third parties for the refund of rental deposits and tax liabilities.The revised completion account, for reasons set out in the letter, left out the required adjustments under cll 6 and 17. It reads:Amount payable under Order of Court9,000,000.00Less:Redemption amount2,090,821.65(subject to adjustment)Rental deposit and GST of PJ88142,587.00Agreed valuation of first, second and third plaintiffs` share3,680,000.00First and second defendants hearing fee for the action5,580.00Purchase price of furniture at Blk 640 Bukit Batok Central [num   ]01-04 by first and second defendants2,300.00Add:The redemption amount2,092,821.65M/s Lee & Lee`s bill284.28Total payable by your clients5,169,817.28[ast   ]([ast   ] of which, $2,092,821.65 payable to mortgagee)Solicitors for the Ongs replied on the same day objecting to Wu and Thia`s attempt to bring KYH and Teng Tong`s liability for the refund of rental deposits under cl 17. On 13 April 1999 Wu and Thia`s solicitors further responded reiterating their stand that besides tax liabilities, the liability to refund rental deposits came under cl 17 for which the Ongs should indemnify Wu and Thia to the extent of 46%.In the meantime, on 12 April 1999, completion took place, based on the revised completion account, leaving open the adjustment or settlement required to be done pursuant to clauses 6 and 17. Wu and Thia took the position that cl 5 did not require the parties to settle all matters falling within cll 6, 16 and 17 by the completion date.On the other hand the contention of the Ongs was that, in view of the deteriorating relationship between the parties, what was sought to achieve by the settlement was a clean break with finality. Thus, a cut-off date was adopted with completion originally fixed on 2 February 1999 (later postponed to 12 April 1999) in order to work out all the outstanding liabilities of the respective companies. Wu and Thia even engaged accountants to examine the accounts of KYH and Teng Tong. After completion on 12 April 1999, neither party could make further claims pursuant to cll 5, 16 and 17.Wu and Thia`s claims under cl 17 were included in two lists. List A relates to KYH and list B, Teng Tong. They formed the subject matter of the present action.",
        "Decision below": "The judge, while agreeing with the Ongs that the settlement agreement envisaged finality and certainty, noted that in this instance the objective was not achieved, as could be seen from the correspondence between the parties. Adjustments under cll 6 and 17 were clearly left to be resolved. He held that the completion on 12 April 1999 was on the basis that the dispute regarding these two clauses remained outstanding and would be addressed later.The judge then went on to deal with two lists of claims of Wu and Thia. Many of the items on list A related to payment for professional services rendered. The approach taken by the judge was that so long as the claim in question was clearly in respect of services rendered before the cut-off date, that claim would be allowed under cl 17. Another class of claims in the list related to rental deposits and, on these, the judge ruled that they did not come within cl 17. In his view, rental deposits came within cl 6 and that clause provided for verification of bank balances and rental deposits. All that needed to be verified was that rental deposits were placed into the account of the companies. If it were shown that any particular deposit was not so placed, there would have to be an adjustment. That, in his view, was the scheme of things under the settlement.There were another five claims in list A which related to tax liabilities of the company in respect of the years of assessment 1997, 1998 and 1999. The judge allowed these under cl 17 provided that they related only to liabilities up to the cut-off date (21 October 1998) and if the liabilities related to income for the entire year up to December 1998, then there should be a proportional adjustment. On this basis, he held that the Ongs should indemnify Wu and Thia 46% of $346,013.29 under cl 17. He also held that if, in future, there should be any refund or rebates from the tax authorities in respect of the tax paid, Wu and Thia would have to return a proportionate part to the Ongs.The judge applied the same approach in dealing with the claims in list B. In particular, he also disallowed the claims in respect of rental deposits.",
        "Issues on appeal": "Before us there are only two issues. The first relates to the computation of the amount of tax liability of KYH up to the cut-off date. The second concerns the rental deposits which the judge ruled do not fall under cl 17.",
        "Tax liabilities": "In arriving at his computation that the relevant five items on tax liability in list A amounted to $346,013.29, the judge relied wholly on a Notice of Assessment (Additional) for the year 1999 raised by the Inland Revenue Authority of Singapore (IRAS) dated 19 April 2000 where it was stated that:Additional Tax payable as per this assessment$48,695.17Account balance brought forward297,318.12Account balance payable346,013.29The details of the above tax liabilities were set out in a separate statement of account issued by IRAS of the same date as follows:-Effective DateTransaction DescriptionYear of AssessmentAmount ($)Balance ($)Balance b/f0.00269,078.49 DR19 Apr 2000Original Assessment19961,298.43 DR270,376.92 DR19 Apr 2000Additional Assessment19972,852.72 DR273,229.64 DR19 Apr 2000Additional Assessment199824,088.48DR297,318.12 DR19 Apr 2000Additional Assessment199948,695.17DR346,013.29 DRBalance c/f0.00346,013.29 DRIt would be seen that the amount $297,318.12 brought forward represented the tax due and payable up to the year of assessment 1998. The dispute relates to a sum of $58,558.50 raised by IRAS in respect of the year of assessment 1998. The judge was under the impression, which he thought counsel for Wu and Thia had confirmed, that the figure of $346,013.39 included the sum of $58,558.50. The notes of evidence taken by the judge (CB157) are not clear and would appear to indicate to the contrary. Be that as it may, there is clear evidence in the record of appeal to show that in respect of that assessment for $58,558.50, KYH issued two cheques for the same amount of $29,279.25 each, dated 8 January and 8 February 1999 respectively, to pay up for that liability. Both cheques were duly debited from the account of KYH with Keppel Tatlee Bank. As the sum of $58,558.50 had already been paid by February 1999, it would, of course, no longer be reflected in any statement of IRAS subsequent to that. Accordingly, the statement of IRAS of 19 April 2000 showing the amount of tax still due and owing could not have included the sum already paid. This sum of $58,558.50, which was paid, therefore should rightfully be added onto $346,013.29, making a total of $404,571.79, for the purposes of determining the extent of Ongs` liability to indemnify under cl 17.",
        "Rental deposits": "Clause 17 provides that the Ongs are to indemnify Wu and Thia in respect of all liabilities owing to third parties or government bodies by KYH and Teng Tong. As a matter of interpretation, the fact that the clause also goes on to particularise specific liabilities by stating `including all government taxes, levies, fees and or charges` cannot be relied upon to restrict the general scope of that obligation to indemnify. The use of the word `including` clearly indicates that those specific liabilities mentioned are not intended to be exhaustive.The judge below thought otherwise. It is necessary that we set out in extenso the reasons given by the judge:It was not disputed that all rental deposits have been credited into the company`s bank accounts. The fact that the credit balances in the bank accounts were taken into consideration for the purpose of the valuation of KYH`s shares did not mean that they must now be deducted as liabilities of the company. As stated earlier, the valuation was a rough and ready one and was never intended to be an exercise in precise accounting. Certain items were included like others were excluded only for the sake of speed and simplicity. In any event, it was not just assets that were considered by the parties in the rough and ready exercise. Liabilities like mortgage loans were also taken into consideration. It was also possible that the rental deposits were utilised for the company`s other purposes after they were banked into the accounts. Further, if precise accounting was the aim of the plaintiffs, subsequent payments by trade debtors to the company for debts accruing before the cut-off date would have to be returned proportionately to the defendants. Clause 6 of the Consent Order allowed verification that such deposits were properly banked into the company`s accounts so that any shortfall could be made good in the completion account. If they were in the company`s accounts and had not been siphoned off, all the plaintiffs had to do when the time came was to return the deposits to the tenants.To understand the object of cl 17, read together with cl 6, it is necessary to move a little backwards. As mentioned in [para ] 5 above, in determining the value of the shares of KYH, the cash in the bank account of KYH, as well as of Teng Tong and PJ88, was taken into account. It is not disputed that the rental deposits paid by the stall-holders were paid into the bank account of KYH, and that of Teng Tong and PJ88 too. This would mean that only the cash in the bank account, less the deposits to be refunded, belonged to KYH (or Teng Tong or PJ88). These rental deposits should rightfully be deducted from the bank account in arriving at what belonged to each of the companies. That, however, was not done. The reason was obvious. The parties then were pressed for time to reach a settlement lest the earlier actions would have to proceed to trial. There was an urgent need to determine the value of each share of KYH. Rather than allowing the settlement to be held up, they agreed to let matters of details be sorted out later on completion - thus cll 6, 16 and 17.In our opinion, apart from the fact that as a matter of plain interpretation cl 17 is wide enough to cover rental deposits which were being held by KYH and Teng Tong and which would have to be refunded to the stall-holders, being a liability to those stall-holders, the obligation to indemnify laid down therein is completely just and proper. As the Ongs held 46% of the shares in the two companies, they should be responsible up to 46% and that is what cl 17 provides.In this regard, we note the comment made by the judge that if precise accounting was intended then in respect of subsequent payments made by trade debtors to the companies for debts incurred before the cut-off date a proportionate part should be returned to the Ongs. While logically this argument cannot be disputed, we must not overlook what is provided in the consent order. Nowhere in cll 6, 16 or 17 is the matter of debts owing by trade debtors mentioned. What is expressly provided are debts or obligation of the companies to third parties, including government bodies. We should not go beyond what is provided in the settlement agreement. It could be that there were no trade debtors. Or alternatively, it could also be that the trade debtors were so insignificant that it was not worth the while taking them into account. There is really no need for us to speculate and we ought not to. The fact of the matter is that the parties did not provide for that. It is not for the court to rewrite their agreement.We would also add that in substance cl 16 is a replica of cl 17, the only difference is that the former relates to Wu and Thia`s obligation to indemnify the Ongs in respect of the liabilities of PJ88, a company taken over by the Ongs under the settlement. To the credit of Wu and Thia, they had been entirely fair because in the revised completion account, which was prepared by them, a credit of $142,587 was given to the Ongs in respect of rental deposits repayable by PJ88 to its stall-holders. The Ongs accepted that credit without demur. Therefore, similarly, under cl 17 the Ongs should indemnify Wu and Thia up to 46% of the rental deposits which were refundable to stall-holders. These are the sort of adjustments envisaged in cl 6.",
        "Judgment": "In the result, the appeal of Wu and Thia is allowed with costs and the usual consequential orders. We order that the Ongs indemnify Wu and Thia accordingly.Outcome:Appeal allowed.Copyright © Government of Singapore."
    }
}