{
    "case_title": "Star City Pty Ltd (fka Sydney Harbour Casino Pty Ltd) v Tan Hong Woon",
    "ncitation": "[2002] SGCA 10",
    "coram": "Chao Hick Tin JA; \n      Lai Kew Chai J; \n      Yong Pung How CJ",
    "sections": {
        "Background facts": "The appellant, Star City operates the only licenced casino under the Casino Control Act 1992 of New South Wales, Australia. This casino is known as Star City Casino and is located in the Sydney suburb of Pyrmont. In accordance with the rules of its licence, Star City Casino has to comply with strict credit controls supervised by the Casino Control Authority of Australia. All gaming transactions within the casino are done with chips, other than slot machines, keno and totalisation betting. There are basically three ways by which a patron can obtain chips for gaming in the casino. The first is by simply exchanging cash for chips at either the counters or the gambling tables; the second will be through a deposit account and the third is through the cheque cashing facility (`CCF`). A patron who has been granted a credit facility hands over a cheque to the casino in exchange for a chip purchase voucher (`CPV`) of an equivalent value. The CPV will then be exchanged for chips for gaming at the tables. If the patron does not have his personal cheques with him, he may request to make use of counter cheques, known as `house cheques`. A house cheque is simply a document printed on a format which has been pre-approved by the Casino Control Authority and is recognised by most banks in Australia. The patron after signing the house cheque hands it over to the counter staff in exchange for a CPV and consequently chips for gaming. It is also Star City`s standard practice that, before handing over the  CPV to the patron, the casino staff will inform the patron that his cheque, if drawn upon an account in Australia, will be available for redemption within 10 working days after its acceptance. The patron can redeem his cheque by exchanging it with cash, bank drafts, CPV, chips or via the electronic transfer of funds of an equivalent value. If the cheque is not redeemed within the applicable time period, Star City will then present the cheque for payment. Without the CCF, the patron will not be able to gamble at the casino unless he has enough cash in hand to pay for the gambling chips or has sufficient funds in his cash deposit account.The respondent, Mr Tan, is a seasoned gambler and a regular patron of Star City Casino. Between February 1996 to March 1998, he visited and gambled at the casino on at least 28 occasions and was treated by the casino as a `valued patron`. Mr Tan was also granted the use of the casino`s CCF in February 1996. In March 1998, Star City provided Mr Tan and his wife with two complimentary air tickets to Sydney as well as a complimentary suite at their hotel for a few days. Between 26 and 28 March 1998, Mr Tan signed and handed over to Star City five house cheques, each for the sum of AU$50,000, in exchange for CPVs and promptly proceeded to lose the entire sum of AU$250,000. When these house cheques were presented to Mr Tan`s bank for payment, all five were dishonoured for lack of sufficient funds in his bank account. Subsequently Mr Tan made good to the casino AU$55,160, leaving the sum of AU$194,840 unpaid. The appellant is now seeking to recover this sum as unpaid loans made to the respondent to enable him to gamble at their casino.",
        "The decision below": "In a carefully reasoned judgment, the trial judge examined the effect which s 5 of the Civil Law Act has upon gaming contracts made abroad. He was of the view that s 5(1) of the Civil Law Act which renders all contracts of gaming or wagering void, has no extra-territorial effect and thus applies only to gaming contracts concluded in Singapore. Therefore, he held that s 5(1) does not invalidate here the gaming contract which was concluded in New South Wales. However, s 5(2) of the Civil Law Act is a procedural section and applies as part of the lex fori to make unenforceable in Singapore all actions to recover `money won upon a wager`, regardless of whether or not the wager was concluded in Singapore or elsewhere and whether or not the wagering contract, if made abroad, was lawful at the place where it was made.The trial judge did not accept that a claim cannot be viewed as an attempt to recover money won upon a wager merely because a cheque was exchanged for chips. Whether there is a genuine loan must depend on the circumstances in each case. He held that, when the facts in the case were examined closely, it was evident that Mr Tan gambled and lost the sum which Star City is seeking to recover from him. There was only one contract and that was a gaming contract between the parties. Therefore whether Star City`s claim was framed as a recovery of a loan, a claim on the dishonoured cheques or one for money had and received, the action would ultimately be characterised as one for money won upon a wager and was irrecoverable in the courts of Singapore.",
        "The appeal": "Before us, Star City contends that the trial judge erred in the following main aspects:(1) in deciding that it was open to him to `re-characterise` the moneys as `moneys won upon a wager`;(2) that s 5(2) of the Civil Law Act was procedural in nature;(3) in not allowing Star City to claim upon the dishonoured house cheques. Star City argues that when a cheque is issued as payment under a contract of sale, it is treated as a distinct and separate transaction from the underlying contract. Therefore, even if the gambling contract is unenforceable (but not void) in Singapore by virtue of s 5(2) of the Civil Law Act, the claim on the cheque is still good and enforceable.We are of the view that the third argument can be disposed of summarily here. It is established law that there can be no recovery on the cheque if the enforcement of the underlying contract would be against public policy or contrary to a statute that must be applied as part of the lex fori. Therefore this third argument must stand or fall together with the first and second. We shall deal with the second issue first.First issue: Section 5 Civil Law Act and the common lawIt may be appropriate to set out the relevant provisions of our s 5(1) and (2) of the Civil Law Act which is in pari materia to s 18 of the Gaming Act 1845 (UK). Section 5(6) is largely similar to s 1 of the English Gaming Act of 1892. The section states as follows:Agreements by way of gaming or wagering to be null and void5(1) All contracts or agreements, whether by parol or in writing, by way of gaming or wagering shall be null and void.(2) No action shall be brought or maintained in the court for recovering any sum of money or valuable thing alleged to be won upon any wager or which has been deposited in the hands of any person to abide the event on which any wager has been made.(3) Subsections (1) and (2) shall not be deemed to apply to any subscription or contribution, or agreement to subscribe or contribute, for or toward any plate, prize or sum of money to be awarded to the winner or winners of any lawful game, sport, pastime or exercise....(6) Any promise, express or implied, to pay any person any sum of money paid by him under or in respect of any contract or agreement rendered null and void by subsections (1) and (2), or to pay any sum of money by way of commission, fee, reward or otherwise in respect of any such contract or of any services in relation thereto or in connection therewith, shall be null and void, and no such action shall be brought or maintained to recover any such sum of money.",
        "NATURE AND EFFECT OF SECTION 5(2) CIVIL LAW ACT": "Star City argues that, as a matter of principle, notwithstanding that s 5(2) of the Civil Law Act begins with the words ` no action shall be brought`, it is a  substantive provision because it extinguishes a right of action by divesting it of its legal enforceability. They also referred us to an article `Substance and Procedure - the Gaming Acts` 23 ALJ 487 which argued that the majority decision inHill v William Hill (Park Lane)[1949]  AC 530[1949] 2 All ER 452in effect destroyed the basis for construing s 5(2) as procedural by assigning to it a clear and unambiguous meaning of substantive import. With respect, we disagree. In order to explain our conclusion, it will be appropriate for us to examine some judicial authorities interpreting s 5(2).It was once thought that s 5(2) does not add anything more to s 5(1) and is a prime example of a parliamentary enactment saying the same thing twice over without adding anything to what has already been said. The conclusion was reached because once a contract is rendered null and void by s 5(1) there can be nothing to recover. At best, s 5(2) was considered as a section which confirms the consequences of the simple proposition in s 5(1) that all gaming or wagering contracts shall be null and void. The link equating validity and the enforceability of a contract was thus made. The conclusion required the courts inBubb v Yelverton[1870]  LR 9 Eq 471,Re Browne, ex p Martingell[1904] 2 KB 133,Chapman v Franklin[1905] 21 TLR 515andHyams v Stuart King[1908] 2 KB 696to draw a distinction between the gaming contract itself and other collateral contracts arising therefrom. These cases involved gamblers who owed debts to creditors. In order to prevent these creditors from complaining against the gambler or to embarrass him for his unpaid debts, the gambler would often hand over to the creditor some valuable security in the form of bills, notes or bonds. When the gambler defaulted upon the gambling debts, the creditor would then sue upon this new contract to pay. The courts allowed recovery upon the basis that there was a collateral contract between the creditor and debtor supported by valuable consideration when the creditor agreed not to do something to the detriment of the debtor. So while a plaintiff cannot sue for the recovery of money won by him by betting, nor on a bill, note or cheque given to pay the money lost, he can sue upon a new contract, not tainted by illegality and made for good consideration if he can prove such a contract. The words of Buckley J inRe Browne, ex p Martingell(supra) summed up the judicial thinking of the day:The bills were given for an altogether new consideration, which was not an illegal consideration. They were given, not to pay the gambling debt, but, as Romilly MR said inBubb v Yelverton[1870]  LR 9 Eq 471, to avoid the consequences of not having paid it.However, the law has now changed. The appellant inHill v William Hill (Park Lane)(supra) incurred betting debts amounting to 3,935l 12s 6d. The respondents who were bookmakers obtained a decision from the committee of Tattersalls that the appellant should pay 635l 12s 6d within 14 days and discharge the balance by monthly instalments. He failed to comply and in consideration of his giving them a cheque for the amount of 635l 12s 6d, the respondents agreed to refrain from enforcing the decision of the committee which would have involved his being posted as a defaulter and warned off the races. However, the cheque was subsequently dishonoured and the respondents brought an action to recover the sum due under the agreement. The majority of the House of Lords refused to allow the recovery of the moneys. They held that the payments contracted to be made by the agreement were in essence payments of `a sum of money alleged to be won  upon a wager` within the second limb of s 18 of the Gaming Act 1845 [our s 5(2)] and accordingly irrecoverable. Unlike s 5(1) which only renders null and void the original wagering or gaming contract, s 5(2) strikes down as unenforceable all other contracts to pay the sum won upon a wager. The prior position inHyams v Stuart King(supra) when an artificial distinction was made between the original wagering contract and a subsequent agreement not to embarrass the gambler or to call him a defaulter was overruled. Wherever the obligation under the contract is or includes the payment of money won upon a wager, the courts will not enforce the performance of that part of the obligation. The essence of the decision inHill v William Hill (Park Lane)was contained in the judgment of Lord Greene ([1949] AC 530 at 552-553; [1949] 2 All ER 452 at 465):Here the language of the first branch [ie s 5(1)] is entirely different from the language of the second branch. Under the first branch the agreement is a nullity before the race is run. The second branch [ie s 5(2)] assumes the race to have been run and the bet to have been lost. It is true that the language of the second branch would prohibit the bringing of an action upon a wager which had been won. To that extent I agree that it covers ground already adequately covered by the first branch. But that is no justification for limiting the words of the second branch as suggested. They are quite general and when read in their ordinary meaning they extend to any action to recover money alleged to be won on a wager ... I find myself in complete agreement with what was said on this topic by Fletcher Moulton L.J. inHyams v Stuart King[1908] 2 KB 696, 713: \"It provides with complete generality that no action shall be brought to recover anything alleged to be won upon any wager, without in any way limiting the application of the provision to the wagering contract itself.\"",
        "Hill v William Hill (Park Lane)": "was not a case that was concerned with the nature of s 5(2) but rather the scope of its application. We are hence of the view that the issue of whether s 5(2) is a procedural section or not must be tested by the `guidelines` set down in the cases. InMonterosso Shipping Co v International Transport Workers` Federation[1982] 3 All ER 841, one of the issues that arose was the effect of one s 18 of the English Trade Union and Labour Relations Act 1974 which declared that a collective agreement `shall be conclusively presumed not to have beenintended by the parties to be a legally enforceable contractunless the agreement ... states that the parties intend that the agreement shall be a legally enforceable contract`. The Court of Appeal held that s 18 was to be classed as a substantive provision. Lord Denning MR said (at p 846):It seems to me that the true distinction is between the existence of a contract (which is substantive law) and the remedies for breach of it (which is procedural law). The right course is to analyse the statute and see whether it negatives the existence of a contract or not. If there is no contract, then there is nothing to enforce. That is substantive law. If there is a contract, but the statute says it cannot be enforced ... that is procedural law. It is governed by the lex fori. In this present case, as I construe s 18 of the 1974 Act, it negatives the existence of any contract at all.Since s 18 makes it a conclusive presumption that there is no intention to create legal relations between the parties, which is an essential element of any contract, it is rightly construed as being a substantive provision. Words to similar effect were also used by the court inRe Shoesmith[1938] 2 KB 637following Lush LJ inPoyser v Minors[1881] 7 QBD 329at 333:\"[P]rocedure\" ... denotes the mode of proceeding by which a legal right is enforced, as distinguished from the law which gives or defines the right, and which by means of the proceeding the Court is to administer the machinery as distinguished from its product.Therefore in every case, to determine whether a provision is substantive or procedural, one must look at the effect and purpose of that provision. If the provision regulates proceedings rather than affects the existence of a legal right, it is a procedural provision. A distinction is drawn between the essential validity of a right and its enforceability. Applying this to s 5(2), it is clear that the interpretation taken inHill v William Hill (Park Lane)(supra) does not per se render it a substantive provision. Although it now renders unenforceable all actions to recover sums won upon wagers, s 5(2) does not nullify such other actions not falling within s 5(1). The crucial words in s 5(2) are `no action shall be brought`. Conversely the court inHill v William Hill (Park Lane)was concerned with the essence of the action to recover, thus the important words were `money won upon a wager`. It is clear to us that the decision inHill v William Hill (Park Lane)only widens the ambit of s 5(2) but not its legal nature under private international law.Furthermore, the bulk of authority is that s 5(2) of the Civil Law Act is procedural. Volume 8(1)Halsbury`s Laws of England(4th Ed) (1996 Reissue) para 1081 states the position as follows:In so far as the Gaming Act 1845 [our s 5 Civil Law Act] enacts that no suit is to be brought or maintained to recover any sum of money or valuable thing alleged to have been won upon any wager, it is a statute affectingprocedure, and therefore no action lies in England for money won upon a wager in a foreign country, even though the wager is lawful by its proper law. [Emphasis is added.]Dicey and MorrisConflict of Lawsalso states in similar terms at para 33-436:Section 18 of the Gaming Act 1845 makes wagering contracts null and void. It also forbids suits being brought to recover money won on wagers. It is therefore a statute which deals both with the validity and with the enforceability of such contracts. The validity of a foreign wagering contract is not affected by this statute, but though valid, it cannot be sued upon in an English court. Being part of thelex fori, the secondproceduralpart of the section relieves the court of the duty of adjudicating on foreign wagering contracts which by the ordinary rules of private international law would escape validation by the first part.Therefore the better and more widely supported view is that s 5(2) of the Civil Law Act is procedural and the appellant`s contention on this issue must be rejected. The consequence of reaching the conclusion that s 5(2) of the Civil Law Act is procedural means that our courts must apply it as part of the lex fori;lex fori ad litis ordinationa. Applying this to our facts, Star City`s claim, though originating from New South Wales, therefore becomes subject to s 5(2) of the Civil Law Act and is unenforceable in Singapore if it is `an action for recovering any sum won upon a wager`.",
        "Second issue: Does Star City`s claim fall within section 5(2) Civil Law Act?": "",
        "wagering contract": "action on the loanThe trilogy of cases,Quarrier v Colston[1842] 1 Ph 147(Unreported) ,Saxby v Fulton[1909] 2 KB 208andSoci,t, Anonyme des Grands Establissements de  Touquet Paris-Plage v Baumgart[1927] 96 LJKB 789(Unreported)  all stand for the proposition that an action on the loan itself will succeed if the loan is valid by its governing law. This is in contradistinction to the other principle contained within s 5 of the Civil Law Act that a wagering contract which is valid by its governing law is valid in Singapore, but no action lies in Singapore to recover any sum of money won on such a contract. It is clear that recovery turns upon the characterisation of the transaction in question. If there is a loan, the first line of authorities applies whereas, if there is an action to recover money won upon a wagering contract, s 5 of the Civil Law Act prevails. This is reflected in r 199Dicey and Morrisas follows:(1) A  which is valid by its governing law is valid in England, but no action lies in England to recover any money won on such a contract.(2) A cheque drawn on an English bank and given by way of security for money won by gaming or betting on games, or for money lent for gaming or betting, is deemed to have been given for an illegal consideration. Hence an action in England on the cheque will fail, unless it has been negotiated to a holder in due course.(3) But an  itself will succeed if the loan is valid by its governing law.The authors then go on to state the three principles flowing forthwith from r 199:(1) An English statute which makes wagering contracts void applies only to contracts governed by English law.(2) An English statute which makes wagering contracts unenforceable, ie forbids the bringing of an action on the contract, applies to all actions brought in an English court on wagering contracts, irrespective of the law applicable to them.(3) English law governs the validity of a negotiable instrument, eg a cheque payable in England but issued or negotiated by way of conditional payment of, or security for, a debt arising from a foreign wagering contract.We agree with the trial judge that the proper law of the gaming contract and transaction relating to Mr Tan`s utilisation of the CCF is the law of New South Wales. It was an express term of the CCF application form that the agreement between the parties was to be governed by the laws of New South Wales. New South Wales was also where the gambling took place and where the loan facility for placing the wager was offered and accepted. Star City argues that, having selected New South Wales as the proper law of the contract, Mr Tan`s liability must be determined according to its laws. Since under New South Wales laws, a loan of AU$194,840 for the purpose of gambling had been advanced by Star City to Mr Tan, this sum of money should be recoverable as a loan in Singapore. Therefore the trial judge erred in deciding that it was open to the courts of the forum to `re-characterise` the moneys as `moneys won upon a wager`.We are of the view that while the conflict rules assist the court in determining the appropriate choice of laws, they do not go further. One is still left with the fundamental question of whether the courts of the forum are entitled to re-characterise a foreign transaction when applying a procedural statutory provision  of the lex fori even before applying choice of law rules. We shall now examine some case authorities to determine the course which this court should adopt.RELEVANT CASE AUTHORITIESThe case ofG & H Montage GmbH v Irvani[1990] 2 All ER 225[1990] 1 WLR 667is instructive although it deals with a different subject matter. The plaintiffs, a West German company drew up 30 bills of exchange naming them as drawers and IDS, an Iranian company as drawees. They were expressed to be paid to the plaintiffs` order in London. The bills were then indorsed and signed by the defendant, the chairman of IDS in Iran. The plaintiffs, as drawers then signed and sent the bills to their bank. The words `bon pour aval pour les tires` (good as a guarantee for the drawees) were then added by the defendant to the bills. The bills were subsequently dishonoured; however, no notice of dishonour or protest was given or made by the plaintiffs in respect of the bills. The plaintiffs then sued the defendant on the aval for the sums due in England. Under the Geneva Conventions on Bills of Exchange of 1932, an aval acts like an indemnity whereby the giver of the aval is bound to make good the whole or part of the amount of the bill in the same manner as the person for whom he has become guarantor. Both parties agree that the choice of law governing the bills of exchange was to be determined by reference to s 72 of the Bills of Exchange Act 1882 (UK) as the lex fori. The issue relevant for our purposes is whether the procedural requirements of protest and notice of dishonour in s 72(3) applied to a claim on an aval. Section 72 reads:Where a bill drawn in one country is ... accepted, or payable in another, the rights, duties, and liabilities of the parties thereto are determined as follows ...(2) Subject to the provisions of this Act, the interpretation of the ... indorsement ... is determined by the law of the place where such contract is made.(3) The duties of the holder with respect to ... the necessity for or sufficiency of a protest [s 51] or notice of dishonour [s 48], or otherwise, are determined by the law of the place where the act is done or the bill is dishonoured. [Emphasis is added.]Saville J held at first instance [1988] 1 WLR 1285 and affirmed by the Court of Appeal that, in accordance with s 72(2), the proper law governing the interpretation of the indorsement of the bills of exchange was German law. Therefore upon the basis of that interpretation and applying German law, the court accepted that the obligations of the defendant were to be categorised as those of a bill of exchange guarantor and not those of an indorser. The court also found that in principle s 72(3), as part of the lex fori, applied to the foreign bills of exchange as all that was required to bring the section into play was that the holder of the bill should bring a claim upon it, even though the claim was of a kind which English law did not acknowledge. The reasoning by the Court of Appeal suggests that, once it has been found that German law characterises the action as one upon the aval, it is no longer open to the forum when applying a procedural provision to re-characterise the action as something else. The lex fori is to be applied upon that foreign cause of action as it is, even though it does not exist in the forum. This is most explicit from the judgment of Woolf LJ ([1990] 2 All ER 225 at 241-242; [1990] 1 WLR 667 at 687):Having so categorised the defendant`s liability [as that of a giver of an aval under German law as the place where the contract was made], the next stage is to apply s 72(3)  of the 1882 Act ... The result of applying s 72(3) is that it is the requirements of English law which have to be complied with as to the giving of notice of dishonour and the noting of protest.The application of English law does not, however, necessitate the recategorisation of the defendant`s liability which both under German law and Iranian law is that of a giver of an aval. [Emphasis is added.]Purchas LJ ([1990] 2 All ER 225 at 242-243; [1990] 1 WLR 667 at 688) also commented in a similar fashion:Subsection (3) ... is concerned with the procedure to be adopted by a holder of the bill when presenting it for acceptance or, as in this case, for payment if the bill is dishonoured. In relation to the necessity for, or sufficiency of, a protest or notice of dishonour or otherwise this shall be determined by the law of the place where the act is done or the bill is dishonoured [lex fori]. So the procedure to be adopted when unsuccessfully presenting the bill for payment is to be determined by the law of the place where that act is to be done butthis does not have relevance to the interpretation of liabilities arising under the supervening contracts related to the bill. [Emphasis is added.]A similar approach was implicitly taken inSoci,t, Anonyme des Grands Establissements de Touquet Paris-Plage v Baumgart(supra). The defendant drew three cheques on an English bank in favour of the plaintiffs who were the proprietors of a casino at Le Touquet. The cheques were exchanged for francs in cash for gambling. The cheques were dishonoured and the plaintiffs sued upon them or alternatively for money spent. Sherman J was satisfied on the evidence of a French avocat that the games were lawful in France, an action for money lent for the purpose of gaming at those games can be brought in the French courts and that money so lent can be sued for in France either on any security given or on theloanitself instead of the security. Without going further to re-characterise the nature of the transaction under English law, the judge went on to allow the recovery of the moneys on the basis that they were moneys lent abroad where gaming was lawful and recoverable.Conversely, there was some indication inQuarrier v ColstonandSaxby v Fulton(supra) that it was English law as the lex fori that determined the nature of the transaction. The facts in both cases were largely similar. Two friends were in the habit of going for holidays together. One would lend money to the other; a large part of which was used for gambling although not all. This was known to both parties. The debtor died and the creditor sued his estate for the moneys that had been advanced. The claims were resisted by the personal representatives on the basis this was an action for the payment of money lost at play. Lord Chancellor Lyndhurst inQuarrier v Colston, on the basis that an IOU was given by the testator to the plaintiff, held that there was a loan for the purpose of gambling which can be recovered so long as the gaming took place in a country where they were not illegal. There is suggestion that English law as the lex fori was applied, the Lord Chancellor referring several times to `the memorandum as prima facie evidence of the debt`. Similarly inSaxby v Fulton, Vaughan-Williams J felt that he was obliged by the English authority ofQuarrier v Colstonto hold that there was a loan and the loan being made for legal gambling abroad was enforceable in England.",
        "THE LOCAL APPROACH": "The approach of the local courts towards re-characterisation should also be examined. InLas Vegas Hilton Corp v Khoo Teng Hock Sunny[1997] 1 SLR 341, the plaintiff casino commenced an action against the defendant for the recovery of approximately US$1.6m. The money was lent in this way: the defendant completed a casino credit card, approval for the amount of credit was obtained and he could then draw on the credit to gamble. Each time he drew on the credit, he had to sign a marker for the relevant amount before the equivalent amount of gaming chips would be given to him in exchange. According to expert opinion in that case, the gaming on credit under Nevada law was legal and each marker executed by the defendant evidenced a loan and constituted a debt owed by the defendant to the casino enforceable under that law. This was accepted by the High Court. The judge held that the fact that the loan, if governed by Singapore law could be invalid and void under s 5 of the Civil Law Act did not mean that it, being governed by Nevada law and valid under that law, may not be enforced in Singapore. In other words, having accepted that the credit facility extended by the casino was enforceable and valid as a loan in Nevada, it fell outside the scope of s 5(2) altogether. However, we note that the court in that case was only concerned with the issue of enforceability of the loan. It was not disputed by both parties that a loan had been advanced by the casino to the gambler. Therefore no arguments were raised and the court was not required to consider the issue which faces us here: whether it is entitled to re-look or re-characterise the nature of the transaction when applying s 5(2) of the Civil Law Act as the lex fori.The next case wasLoh Chee Song v Liew Yong Chian[1998] 2 SLR 641. The plaintiff junket`s claim against the defendant gambler was on three dishonoured cheques totalling $150,000. The defendant had obtained advances from the plaintiff for the purchase of rolling chips. The gambling was on board a ship in international waters, but there was no evidence as to which flag the vessel was flying. In the absence of such evidence, the judge held that it was for the court to determine the proper law of the contract. This was Singapore law as this was the jurisdiction that was closest and most convenient for the parties. Both were Singaporeans, the vessels were berthed in Singapore and returned to Singapore after each cruise. Judicial Commissioner Choo Han Teck held that a loan had been advanced by the plaintiff to the defendant for the purposes of gambling. He further held that the loan was recoverable, as it was not against public interest to allow recovery of such loans. Section 5 of the Civil Law Act did not nullify loans made for the purposes of gaming or wagering. It only nullified any gaming or wagering contract and any prize won could not be recovered with the assistance of the court. In the words of Choo JC (at [para ]6):The two [a loan and a wagering contract] are distinct transactions. If A lends money to B who used it to lay a wager with C, the contract between B and C is affected by s 6 [now s 5] but not the contract between A and B.It seems clear that Choo JC applied Singapore law as the proper law of the contract to make an initial characterisation of the transaction as a loan and having done so, held that it fell outside the reach of s 5 of the Civil Law Act. However, the case  was similarly equivocal as to the essential issue in this present case as no foreign elements were involved.We now move on to consider the recent authority ofStar Cruise Services v Overseas Union Bank[1999] 3 SLR 412. TheStar Cruisecase involved a cheque cashing facility similar to that used by Star City. The gambler gives a cashiers` order or cheque to the casino in exchange for credit equivalent to the value of the cashiers` order or cheque. If the gambler wins, the cheque is returned to him when accounts are settled. If the gambler loses, the casino retains the cheque and realises it to make good his loss. The judge looked at the final effect of the transaction and held it abundantly clear that the cheque or cashiers` order represented the losses or winnings of the gambler. When the play was over and accounts were settled, the moneys that were paid over or retained would be moneys won by way of gaming; nothing more or nothing less. Therefore, although the casinos called it a loan it was actually a gambling debt, the recovery of which was prohibited by s 5(2) of the Civil Law Act. In the words of GP Selvam J (as he then was) (at [para ]69):[W]hen faced with a gaming transaction, having regard to s 9A of the Interpretation Act, one must take the scene in its totality and determine what the true nature of the contract is and give effect to s 6 [now our s 5] to promote its purpose and object.Further inStar Cruise(supra), GP Selvam J also held that it was the law of the forum that decides what actions may be brought and what actions may not be brought. If the domestic law says actions of a certain kind cannot be brought it means that the court cannot adjudicate them irrespective of where the cause of action arose. In his view, the courts of the forum were fully justified in applying the lex fori to discover the reality of the gambling transaction before deciding whether an action to recover the moneys can be enforced in Singapore. He emphasised this at [para ]87 of the judgment:The clear and peremptory wording of s 6(1), (2) and (5) [our s 5(1), (2) and (6)] means that parties cannot contract out of its provisions either expressly or impliedly by choosing some other system of law because those provisions are based on public policy and the parties will not be permitted by agreement to override them.Similar statements were made by the judge inSun Cruises v Overseas Union Bank[1999] 3 SLR 404andQuek Chiau Beng v Phua Swee Pah Jimmy(DC 500072/99, RA 6000539/2000).We are aware that in bothStar CruiseandSun Cruises(supra), the proper law of the contract and the lex fori was Singapore law. The coincidence of laws may make it difficult to conclude that the case is authority for the proposition that the lex fori should be used when applying s 5(2) to re-characterise the transaction as one that is substantially different from that under its proper foreign law. Be that as it may, we read GP Selvam J to be clearly of the view that forum public policy calls for the Singapore courts, when applying s 5(2), to pierce the veil to discover the reality of the transaction.",
        "PRINCIPLE AND PUBLIC POLICY": "As examined above, the cases as a whole do not clearly reveal the characterisation process of the courts when applying the procedural laws of the  forum. The issue must ultimately depend upon the public policy of Singapore: whether our courts should help in the enforcement of gambling contracts technically falling outside local statutory prohibitions, but with potentially deleterious effects on the social and economic fabric of our society.To begin with, it is clear that the enforcement of a right or a cause of action is a matter for the forum. The lex fori does not interfere in the validity of the transaction but as the place where the action is being brought, it has the right to determine the situations when foreign causes of action can be enforced. It is an established principle of private international law that the courts of the forum will not enforce a foreign cause of action that is contrary to local public policy. We need only refer toDicey and Morris(13th Ed) at p 81:Rule 2 - English courts will not enforce or recognise a right, power, capacity, disability, or legal relationship arising under the law of a foreign country, if the enforcement or recognition of such right, power, capacity, disability or legal relationship would be inconsistent with the fundamental public policy of English law.This was also echoed by Turner J inHope v Hope[1857] 8 De GM & G 731(Unreported) :I think that, when the courts of one country are called upon to enforce contracts entered into in another country, the question to be considered is not merely whether the contract sought to be enforced is valid according to the laws of the country in which it was entered into, but whether it is consistent with the laws and policy of the country in which it is sought to be enforced. A contract may be good by the law of another country, but if it be in breach, fraud, or evasion of the law of this country, or contrary to its policy, the Courts of this country cannot, as I conceive, be called upon to enforce it.We are of the view that in order to determine whether the enforcement of a foreign cause of action would be contrary to forum policy, the court must necessarily apply its mind and the lex fori to determine its true substance. Otherwise, the forum would no longer be master of its own home and local public policy concerns easily circumvented by `forum-shopping`. There is another way to support this conclusion. We have earlier concluded that s 5(2) is a procedural provision which applies whenever foreign causes of action are being enforced in Singapore. The clear and peremptory words of s 5 of the Civil Law Act make clear that it is intended by the legislature to be a forum mandatory provision which parties cannot avoid by contracting out of. Our courts must hence pay attention to the essence of foreign transactions and must forcefully resist all attempts to evade the provisions of the Civil Law Act. We are further supported in our conclusion by s 9A of the Interpretation Act (Cap 1, 1999 Ed) which requires the court, in the interpretation of a statutory provision, to prefer a purposive interpretation which would promote the purpose or object underlying the written law (whether that purpose or object is expressly stated in the written law or not) to an interpretation that would not promote that purpose or object. Putting the two principles together, it follows that the courts of the forum are entitled to re-characterise a transaction according to the law and logic of the lex fori. Unlike what Star City contends, we consider that the trial judge was, in principle, fully justified to look into the reality of the transaction so as to determine whether s 5(2) of the Civil Law Act applied. The fact that a sum of money won on a wagering contract is valid and enforceable under the laws of New South Wales should not prevent the Singapore courts from  declining to aid in its enforcement, if to do so would be contrary to the public policy of Singapore.What then is this aspect of local public policy that militates against the recovery of moneys won in foreign wagering contracts which are valid and enforceable overseas? It is clear that gaming and wagering contracts were never considered to be illegal in common law. The distinction which the law makes between wagering contracts and others is therefore entirely the creation of statute. In line with the position in England, the Singapore legislature has long departed from the historical position that gambling and gaming, especially when on credit, is a social vice that has to be eradicated at all costs. It now recognises that gambling can be permitted for its entertainment value if it is strictly controlled and regulated by the relevant authorities. Gambling per se is no longer considered to be contrary to the public interest and this accounts for the various forms of legalised gaming and gambling which currently exists in Singapore such as 4-D, Toto, the Big Sweep, the Singapore Turf Club, etc. Therefore there is no general principle of public policy in Singapore, against the recovery of money lent for the purposes of gambling abroad, so long if the transaction is indeed a genuine loan and one which is valid and enforceable according to that foreign law.However, what is objectionable is courts being used by casinos to enforce gambling debts disguised in the `form` of loans. Valuable court time and resources that can be better used elsewhere are wasted on the recovery of such unmeritorious claims. The machinery of the courts cannot be used indirectly to legitimise the recovery of moneys won upon wagers overseas when similar relief would be refused for moneys won upon wagers in Singapore. Hence in order to give full effect to s 5(2) of the Civil Law Act, which provides that no action can be brought or maintained to enforce gambling debts, the courts of the forum cannot be prevented by foreign law from investigating into the true nature of the transaction. The courts of justice must remain out of bounds to claims for moneys won upon wagers, however cleverly or covertly disguised:Star Cruise Services v Overseas Union Bank(supra). It is in this sense that the earlier decision inLas Vegas Hilton Corp v Khoo Teng Hock Sunny(supra) can be distinguished; having felt that there is no public policy against gambling per se, the court naturally did not go further to re-characterise the transaction. However, once it is recognised that the courts should not, as a matter of principle and public policy, act as gambling debt collectors for foreign casinos, we are then obliged to investigate further according to the lex fori.Although this can have the unhappy consequence that Singapore may be viewed by foreign casino operators as `safe havens` for gamblers with assets situated here, the fact remains that gambling debts are debts of honour and not legal debts recoverable in the courts. We consider that these are the risks and consequences that casinos in the conduct of their ordinary businesses have to bear. It is but a small price to pay in exchange for the huge profits that such businesses reap by trading in games of chance. If a result of this case is that `credit` facilities will be less readily granted to local gamblers, so be it. The courts will not be concerned with such considerations but must stand guided by the principle that the courts of justice must remain out of bounds to claims based on gaming debts. We emphasise that our conclusion on the operation of s 5(2) of the Civil Law Act  merely negatives the enforcement but not the validity of gaming contracts; the casinos can always attempt to enforce their causes of action elsewhere.",
        "WHAT IS STAR CITY ATTEMPTING TO RECOVER?": "Having reached the two conclusions above that, first, s 5(2) of the Civil Law Act is a procedural provision which applies to all causes of action enforced in Singapore irrespective of where the gambling transactions took place and second, our courts are entitled to look beyond the foreign characterisation of the transaction to determine its true nature as a matter of principle and policy, it now remains for us to determine whether Star City is claiming from Mr Tan moneys won in wagers within the meaning of s 5(2) of the Civil Law Act.Star City relies upon its undertaking to all patrons not to present the cheques for ten days pending redemption of the cheque to show that there was a promise by the patron to the casino to pay sometime in the future, ie a credit or loan transaction. The casino also argues that the issue of the cheques by Mr Tan at a time when he had `no expectation of sufficient funds in his account` in exchange for chips also meant that a loan had been advanced to him by the casino. Lastly Star City says that the trial judge erred in applyingCumming v Mackie(Unreported) (Unreported) ,Crockfords Club v Mehta[1992] 2 All ER 748[1992] 1 WLR 355,CHT v Ward[1965] 2 QB 63[1963] 3 All ER 835,Law v Dearnley[1950] 1 KB 400[1950] 1 All ER 124,Woolf v Freeman[1937] 1 All ER 178andMacDonald v Green[1951] 1 KB 594[1950] 2 All ER 1240because no element of private international law was involved in any of those cases. With respect to this last point, having already expressed our view that the lex fori should be used to determine the true quality of the contract between Star City and Mr Tan, it necessarily follows that we believe the trial judge to be perfectly correct in relying upon those cases to ascertain the nature of the transaction in issue.We now turn to consider the nature of the transaction. Several features of the cheque-cashing facility that had been offered by Star City to Mr Tan should be noted:(1) The chips are worthless outside the casino and are mere counters.(2) No moneys were ever actually advanced by the casino. Star City only gave the gambler the right to play at the tables upon presentation of the house cheques.(3) Any moneys that were lost were made good by the gambler and not Star City.Chips are regarded as cash in Star City casino and have to be used to gamble at the tables. Therefore a gambler patron has to exchange cash or money`s worth for the chips. We are of the view that the chips placed on the gaming tables represent the moneys paid in advance by the gamblers to the casino by the cheques, although the actual transfer of funds will come later. Therefore the chips lost at the tables represented the gambling losses of the patron. He will have to make good his gambling losses to the casino and not to anyone else. Although cheques are to remain uncashed and can be redeemed upon `re-payment` by gamblers within a period of ten days, this is only a deferred form of payment to give gamblers time to ensure that they have sufficient funds to repay their gambling losses in their bank accounts. The CCF facility provided by Star City to  their patrons cannot be genuine loans because the facility merely enables them to gamble on credit and not for any other purpose.The converse conclusion will mean having to classify the exchange of the cheque for the chips as a sale; for which the casino is giving loan credit on the security of the cheque pending redemption and the gambling at the tables as a transaction that is independent and unconnected to the first. This is against logic and principle: what would a gambler want with the chips except to use them for gambling and gambling alone? A broad view of things must be taken, and this points towards the cheques being used to pay for the gaming chips and any money to be recovered by the casinos as money won/lost upon a wager rather than a true loan:Lipkin Gorman v Karpnale[1991] 2 AC 548[1992] 4 All ER 512. The exchange of a cheque for a CPV and chips is an essential part of the composite gambling contract. It is the means by which gambling is to take place rather than a true security for credit; a `play now and pay later` scheme. For the above reasons, we agree with the trial judge that the sum of AU$194,840 was money that Star City had won from Mr Tan on a wagering contract rather than a genuine loan.Another subsidiary point was taken by Star City. It was this: Star City claimed that Mr Tan had admitted that the casino had extended a loan for the purposes of gambling to him. In addition, his subsequent conduct of repaying part of the total sum owing clearly indicated his acknowledgement of the existence of such a debt. The facts in this case were therefore indistinguishable from that ofLas Vegas Hilton Corp v Khoo Teng Hock Sunny(supra) where the High Court allowed the recovery of the moneys on the basis that it was a genuine loan. We consider that there is no rational reason for differentiating between cases where there is an explicit admission of a loan by the gambler and where there is not. The fact that the gambler has stated that he believes that he owes the casino moneys lent to him for the purposes of gambling cannot convert what is essentially money lost in wagers into something else. The overriding test must be the essence of the transaction itself as determined by the courts of the forum. In addition, it is also obvious from the trial judge`s grounds of decision that he had found as a fact that Mr Tan`s position throughout the trial was that he had never obtained a loan from Star City.ConclusionIn the premises, we agree with the trial judge that s 5(2) of the Civil Law Act is a procedural section which was legislated to relieve our courts from the burden of adjudicating upon both local and foreign gambling contracts. Star City`s claim against Mr Tan being in essence an action to recover money lost upon a wager falls within s 5(2) and is unenforceable in Singapore. Neither can Star City claim upon the dishonoured cheques as the recovery on the underlying gambling contract is contrary to public policy. The appeal is accordingly dismissed with costs.Outcome:Appeal dismissed.Copyright © Government of Singapore."
    }
}