{
    "case_title": "Thongthot Yordsa-Art and Another v Public Prosecutor",
    "ncitation": "[2002] SGCA 33",
    "coram": "      Chao Hick Tin JA;\n Tan Lee Meng J;\n Yong Pung How CJ",
    "sections": {
        "A. BACKGROUND": "3.        The\n\ndeceased, Saenphan Thawan (‘Yaou’), apparently wielded a measure of influence in\n\nan area off Pioneer Road, not far from Kian Teck Road, where a small community of Thai\n\nworkers lived. He was in control of gambling, prostitution and the sale of drugs in the\n\narea, which is referred to by Thai workers as ‘Kian Teck’, a name which will,\n\nfor convenience, be used in this judgment.4.        Ten days\n\nbefore Yaou was killed, Thongthot’s girlfriend, Wena Awaburt (‘Wena’), went\n\nto Kian Teck with a female friend, a Thai prostitute. While Wena was seated on a discarded\n\nbed in Kian Teck, Yaou approached her. He was not pleased to find her at Kian Teck and\n\nshowed his displeasure by telling her ‘not to do a man’s job’. He then\n\npointed a knife at her and warned her that he would arrange to have her raped and silenced\n\nif she was seen in the area again. Wena left in tears and reported the incident to\n\nThongthot, who lived with a number of other Thai workers in a squatter settlement in a\n\nforested area off Jalan Bahar.5.        Thongthot\n\nwas angered by Yaou’s treatment of Wena. Within a few days, he went with six other\n\nmen to Kian Teck to look for Yaou. According to him, the purpose of this trip to Kian Teck\n\nwas to ask Yaou to apologise to Wena. However, they did not manage to find Yaou.6.        A few days\n\nlater, Thongthot was informed that Yaou was sighted in Kian Teck. On 2 June 2001, he\n\nassembled another group of men to confront Yaou. This group included the second appellant,\n\nDornchinnamat, and four other Thai men. The six men gathered at Jalan Bahar for drinks\n\nfrom 6 pm onwards and left for Kian Teck by taxi at around 10 pm. They were armed and\n\ntheir deadly arsenal of weapons, which were concealed in umbrellas, included knives,\n\nparangs, a long sword and a variety of metal chains.7.        After\n\narriving at Kian Teck, Thongthot and his men managed to locate Yaou, who was with his\n\ngirlfriend, Namphakdee Thapanee (‘Nam’). During the confrontation, Yaou tried to\n\nflee from Thongthot and his gang but he was soon cornered and killed by them.8.        A\n\npathologist, Dr Paul Chui, gave evidence that the injuries inflicted on Yaou were\n\nsufficient in the ordinary course of nature to cause his death. He pointed out that there\n\nwere at least three injuries, each of which was sufficient to result in Yaou’s death.\n\nAn injury at the back of Yaou’s head was particularly gruesome. The wound was so deep\n\nthat Yaou’s brain and spinal cord were cut.",
        "THE TRIAL": "9.        At the\n\ntrial, the prosecution asserted that Thongthot, Dornchinnamat and their gang went to Kian\n\nTeck on 2 June 2001 with the common object of causing grievous hurt to Yaou. As such, it\n\nwas submitted that they and the other four men in their gang were members of an unlawful\n\nassembly by virtue of section 141 of the Penal Code, which provides, inter alia, as\n\nfollows:An assembly of 5 or more persons is designated an\n\n  ‘unlawful assembly’ if the common object of the\n\n  persons        composing that assembly is –…(c)    to commit any mischief or criminal\n\n  trespass, or other offence.10.      The prosecution also\n\nasserted that the members of the unlawful assembly knew that if their common object was to\n\nbe achieved, it was likely that Yaou would be killed. In view of this, it was submitted\n\nthat Thongthot and Dornchinnamat were guilty of murder because of section 149 of the Penal\n\nCode, which provides as follows:If an offence is committed by any member of an unlawful\n\n  assembly in prosecution of the common object of that assembly, or such as the members of\n\n  that assembly knew to be likely to be committed in prosecution of that object, every\n\n  person who, at the time of committing that offence, is a member of the same assembly, is\n\n  guilty of that offence.11.     Both Thongthot and\n\nDornchinnamat admitted that they were part of the gang which confronted Yaou and killed\n\nhim on the evening of 2 June 2001. However, they denied that the common object of their\n\ngang was to cause grievous hurt to Yaou. Thongthot, who admitted that he stabbed Yaou,\n\nsaid that his object was merely to teach Yaou a lesson by getting him to apologise to his\n\ngirlfriend, Wena. As for Dornchinnamat, who admitted in his statements to the police that\n\nhe participated in the attack on Yaou, he asserted that the incriminating parts in the\n\nsaid statements were not interpreted to him by the Thai interpreter and did not reflect\n\nwhat he had told the police. He also said that when the statements were read to him before\n\nhe signed them, he did not pay attention as he was under physical and mental stress.The trial judge’s decision12.        The trial\n\njudge said that the main issues before him were whether or not Thongthot and Dornchinnamat\n\nand their gang went to Kian Teck on 2 June 2001 with the common object of causing Yaou\n\ngrievous hurt and whether or not the members of the gang knew that Yaou’s death would\n\nbe a likely result of what they would do in pursuit of their common object. He did not\n\nbelieve that Thongthot and his gang merely wanted Yaou to apologise to Wena. He was\n\nconvinced that Yaou’s assailants went to Kian Teck fully and dangerously armed to\n\ncause serious and grievous harm to Yaou. He thus accepted that Thongthot and Dornchinnamat\n\nwere members of an unlawful assembly and proceeded to consider the effect of section 149\n\nof the Penal Code.13.        The trial\n\njudge noted that Thongthot admitted in court that he stabbed Yaou with a knife although he\n\nclaimed that this was done to ‘stop Yaou from running’, a claim which could not\n\nbe believed. He also took into account the fact that Dornchinnamat had confessed to having\n\nplayed a role in the killing of Yaou and rejected his assertion that he did not\n\nincriminate himself in his statements to the police. The trial judge said that it was\n\nunnecessary for him to re-enact every blow struck during the murder ‘for it does not\n\nmatter who struck first, or who struck most or who struck the hardest’. What was\n\nimportant was that the unlawful assembly had the common object of causing grievous hurt to\n\nYaou and that its members knew that the pursuit of their common object was likely to\n\nresult in Yaou’s death. As Yaou was killed, he held that it was evident from section\n\n149 of the Penal Code that Thongthot and Dornchinnamat had committed murder, an offence\n\npunishable under section 302 of the Penal Code.",
        "C. THE APPEAL": "14.        The main\n\nthrust of the appellants’ case was that the trial judge erred when he held that they\n\nwanted to exact revenge on Yaou and that they carried weapons to Kian Teck so that\n\ngrievous hurt could be caused to Yaou. Thongthot reiterated that he and the other members\n\nof his gang only intended to extract an apology from Yaou and not to kill him.15.        It cannot\n\nbe disputed that Thongthot and Dornchinnamat and the other members of their gang were, by\n\nvirtue of section 141 of the Penal Code, members of an unlawful assembly as there was\n\nample evidence at the trial that their common object was to cause grievous hurt to Yaou.\n\nThe remaining issue before us concerns the application of section 149 of the Penal Code to\n\nthe circumstances of this case.16.        The\n\nmeaning of the term ‘common object’ has been considered by the courts on\n\ninnumerable occasions. InChandran v Public Prosecutor,[1992] 2 SLR 265, 269, this\n\ncourt noted as follows:Section 149 does not require proof of a pre-arranged\n\n  plan and a common intention which a\n\n  prosecution            involving s\n\n  34 of the Code would require. The ‘common object’ under s 149 of the Code must\n\n  not be confused with the ‘common intention’ under s 34 of the Code. Though they\n\n  both deal with what may be called ‘constructive liability’ for crime, it is\n\n  important to see the distinction and the way both sections operate.InBarendra Kumar Ghosh v Emperor, Lord Sumner at\n\n  p 7 said:There is a difference between object and intention, for\n\n  though their object is common, the intentions of several members may differ and indeed may\n\n  be similar only in the respect that they are all unlawful while the element of\n\n  participation in action which is the leading feature of s 34, is replaced in s 149, by\n\n  membership of the assembly at the time of the committing of the offence. Both sections\n\n  deal with combinations of persons who become punishable as sharers in an offence.17.        In our\n\nview, the trial judge cannot be faulted for holding that the appellants and the other\n\nmembers of the unlawful assembly knew that it was likely that Yaou would be killed when\n\nthey acted in pursuit of their common intention to cause him grievous hurt. The appellants\n\ntried to downplay the significance of their deadly arsenal of weapons by asserting that\n\nthe weapons were only intended for self-defence. However, it is evident from the\n\ncircumstances of the case and the ferocity of the attack on Yaou that this could not have\n\nbeen the case. If the weapons had indeed been carried by the appellants and the other\n\nmembers of the unlawful assembly for self-defence, Yaou would not have been killed. After\n\nall, Thongthot testified that Yaou was unarmed and outnumbered and that he was running\n\naway when he was savagely attacked. When questioned, he said as follows:Q.    So when he got up to run away, he ran away alone?A.….[H]e was alone.Q.     And he was not carrying any weapons?A.     When he got up,I don’t see him carry anything.Q.     You were at [Yaou’s] side. That means Yaou was not\n\nattacking you when you stabbed him?A.     No,he was running.18.        Thongthot\n\nalso shed some light on the common object of the unlawful assembly. When cross-examined,\n\nhe said as follows:Q.     Wouldn’t [it] have been better to just let Yaou run away?A.You think it’s better if he runs and the others chase\n\nafter him and kill him?Don’t you think that I … better … stop him?Q.    … you think they would have killed him?A.     The thing happened was Rang carried a long sword and I\n\ncan’t tell what was going to happen when Rang\n\nchased                       \n\nafter Yaou at the dark area.Q.But you were worried he could have killed Yaou?A.Yes, your Honour…Q.     …. You could have stopped two people who were your\n\nfriends. Why did you not tell them to stop?A.    …even I can stop\n\n  [them], there were three more that I do not know where they were. They mightattackYaou as well.19.        When\n\nconsidering the effect of section 149 of the Penal Code in relation to ‘an offence\n\ncommitted by any member of an unlawful assembly in prosecution of the common object of\n\nthat assembly’, it did not escape our attention that all the members of the unlawful\n\nassembly played a part in killing Yaou. Thongthot testified that after he stabbed Yaou\n\ntwice, the other members of the unlawful assembly surrounded Yaou and Dornchinnamat\n\nslashed Yaou’s head with great force. Another member of the unlawful assembly then\n\nslashed Yaou on the neck. Dornchinnamat corroborated this evidence when he said that the\n\nother members of his group continued to attack Yaou after he had slashed Yaou on the head.\n\nIn these circumstances, there can be no doubt that the assailants knew that it was likely\n\nthat their actions in furtherance of their common object of causing Yaou grievous hurt\n\nwould result in his death. We thus saw no reason to interfere with the findings and\n\nverdict of the trial judge.The second appellant’s other grounds of\n\nappeal20.        Before\n\nconcluding, reference will be made to the second appellant’s other grounds of appeal,\n\nwhich, in our view, had no merit whatsoever. Dornchinnamat asserted that portions of his\n\nown statements to the police and the confession of his co-accused, Thongthot, who\n\nimplicated him in the murder of Yaou, should not have been relied upon by the trial judge.21.        \n\nDornchinnamat’s statements to the police will first be considered. As has been\n\nmentioned, he retracted substantial portions of these statements during the trial. He\n\nclaimed that the retracted portions of the statements in question did not reflect what he\n\nactually said and that he did not pay attention when his statements were read to him by\n\nthe Thai interpreter, Tasneeporn.22.        It is\n\ntrite law that the retraction by an accused of his confession of guilt does not prevent\n\nthe confession from being relied on if the judge believes that it is the truth. (See, for\n\ninstance,Yap Sow Keong v Public Prosecutor[1947] MLJ 90 andIsmail bin UK\n\nAbdul Rahman v Public Prosecutor[1972-1974] SLR 232). The trial judge had reason to\n\nbelieve that Dornchinnamat was telling the truth when he confessed that he had played a\n\npart in the killing of Yaou. Dornchinnamat’s two long statements were made nearly two\n\nweeks after he was arrested and each of the two-day sessions ended by around 2.15 pm. Both\n\nSSgt Daniel Teo, who recorded the statements, and the Thai interpreter, Tasneeporn,\n\ntestified that the recorded statements were made by Dornchinnamat and that he was invited\n\nto amend any part of the statements before acknowledging that they were correct. The\n\ninterpreter is an independent party and has no reason to fabricate evidence. Furthermore,\n\nas Dornchinnamat knew that he was facing a capital charge, it is most unlikely that he was\n\nnot paying attention when his statements were read to him. We thus agreed with the trial\n\njudge that Dornchinnamat’s confession may be relied upon as evidence of his guilt.23.        As for\n\nDornchinnamat’s assertion that the confession of his co-accused, Thongthot, should\n\nnot have been given any weight by the trial judge, the courts have, on numerous occasions,\n\nconsidered whether or not a confession of an accused may be used against a co-accused. InChin\n\nSeow Noi v Public Prosecutor[1994] 1 SLR 135, this court reiterated that the\n\nconviction of an accused can be sustained solely on the basis of a confession by his\n\nco-accused if the confession establishes beyond reasonable doubt that the accused is\n\nguilty. In the present case, there was no incentive for Thongthot to lie about\n\nDornchinnamat’s role in the murder of Yaou. He had already admitted that he was part\n\nof the gang that took Yaou’s life and his account of the events at Kian Teck on the\n\nevening of 2 June 2001, including the fact that Dornchinnamat slashed Yaou on the head, is\n\nconsistent with Dornchinnamat’s own admission in his statements to the police and\n\nwith the eye-witness account by Yaou’s girlfriend, Nam. As such, the trial judge was\n\nentitled to take into account Thongthot’s evidence that Dornchinnamat played a role\n\nin the killing of Yaou.",
        "D. CONCLUSION": "24.        As\n\nThongthot and Dornchinnamat did not establish that the trial judge erred in finding them\n\nguilty of the charge faced by them, their appeals were dismissed.Sgd:YONG PUNG\n\n  HOW          CHAO HICK\n\n  TIN              TAN LEE\n\n  MENGChief\n\n  Justice             \n\n  Judge of Appeal\n\n  Judge                    \n\n  JudgeCopyright © Government of Singapore."
    }
}