{
    "case_title": "Amran Bin Eusuff & Anor v Public Prosecutor",
    "ncitation": "[2002] SGCA 20",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J; \n      Yong Pung How CJ",
    "sections": {
        "Criminal Law –": "Misuse of Drugs – Trafficking in\n\ncontrolled drugs – Whether accused persons were involved in the sale and delivery of\n\nmore than 500 grams of cannabis – Section 5(1)(a), 33 of the Misuse of Drugs Act",
        "Criminal Procedure": "– Appeal – Power of an appellate court\n\nto reverse findings of fact – Whether any reason to interfere with trial judge’s\n\nfindings of fact",
        "Evidence": "– Admissibility and weight of a confession by a\n\nco-accused – Admissibility of co-accused confession pursuant to section 30 of the\n\nEvidence Act - Whether the First Accused’s confession can be used against the Second\n\nAccused because it is reliable",
        "Sentencing": "– Trafficking more than 500 grams of cannabis\n\n– Entrapment - Whether there is a judicial discretion to reduce the sentence from one\n\nof death to life imprisonment on account of the entrapment – Section 33 and the\n\nSecond Schedule of the Misuse of Drugs Act",
        "Facts": "Amran bin Eusuff (‘Amran’) and Rabu bin Rahmat\n\n(‘Rabu’) were jointly charged with committing an offence under s 5(1)(a) of the\n\nMisuse of Drugs Act, read with s 34 of the Penal Code and punishable under s 33 of the\n\nMisuse of Drugs Act for trafficking in more than 500 grams of cannabis, in furtherance of\n\na common intention of them both, by delivering 2174.86 grams of cannabis to an undercover\n\nCNB officer, Mohd Nabil bin Shahar on 3 May 2001.On 1 May 2001, Corporal Fazuri bin Isnin (‘CPL Fazuri’) of\n\nthe CNB received information that a person named \"Daud\" was looking for a buyer\n\nof cannabis. The next day, he managed to get in contact with Daud and his partner who was\n\ncalled \"Abu\". CPL Fazuri posed as a buyer named \"Boy\" and negotiated\n\nwith both of them to purchase 3 kg of cannabis to be delivered on 3 May 2001. On that\n\ndate, two CNB officers posed as Boy’s men. These officers met with Amran and Rabu,\n\nwho introduced themselves as \"Daud\" and \"Abu\" respectively. Both Amran\n\nand Rabu got into a car that the undercover officers were in. The car was driven to Bukit\n\nMerah View where Rabu alighted to collect the drugs. He returned to the car and handed the\n\ndrugs to one of the undercover officer. The CNB officer then signalled to his colleagues\n\nto move in to arrest the two suspects whereupon the undercover car was intercepted. Amran\n\nand Rabu tried to flee but were eventually arrested.Amran made two long statements to the Investigating Officer. He\n\nadmitted that he and Rabu negotiated the sale of cannabis to CPL Fazuri and that he went\n\nwith Rabu to deliver the drugs to the undercover CNB officers. He admitted that he did so\n\nfor the commission he was promised. As for Rabu, he also made two long statements to the\n\nInvestigating Officer. In the first one, he denied flatly that he was involved in drug\n\ntrafficking. However, in the second statement, he admitted that he procured the drugs to\n\nsell to Boy.During the trial, Amran claimed that he did not own the drugs and that\n\nhe was entrapped to commit the offence. Rabu argued that he made the statements to the CNB\n\ninvoluntarily and that he was actually not involved in the trafficking at all. The trial\n\njudge rejected all the defences raised by both accused, convicted them of drug trafficking\n\nand sentenced them to death. Both accused appealed against his decision.",
        "Held": ", dismissing both appeals:Entrapment is not a valid defence to a criminal charge. The central thesis of our\n\n    criminal law is that a person who voluntarily, and with the necessary intent, commits all\n\n    the elements of a criminal offence is guilty of that offence, regardless of whether he was\n\n    induced to do so. Amran admitted to the offence and could not be exonerated on the grounds\n\n    of entrapment. (¶ ¶ 29,30)Rabu’s appeal against conviction was an appeal against the trial judge’s\n\n    findings of fact. The usual caution that an appellate court should not overturn a trial\n\n    judge’s finding of fact unless it is clearly wrong, applied. (¶ 32)The burden was on the prosecution to prove that the statements made by Rabu were made\n\n    voluntarily. The test for the admissibility of such statements is partly objective and\n\n    partly subjective. The prosecution must show objectively that there was no threat,\n\n    inducement or promise. If it failed to prove that, it must show that although there was an\n\n    objective threat, inducement or promise, it did not actually operate on the mind of the\n\n    accused in question. (¶ 34)Reading a previous statement made by an accused person back to him at the start of the\n\n    recording of another statement to refresh the memory of the accused does not amount to an\n\n    objective threat. It is a self-induced threat which does not cause a statement to be\n\n    inadmissible. (¶ 36)The denial of family visits would not make Rabu more susceptible to making an\n\n    involuntary and inadmissible statement as compared to other accused persons. Such a\n\n    measure is necessary during the period of interrogation. (¶ 41)The trial judge rightly decided that Rabu was not unwell or deprived of food and sleep\n\n    to the extent that he could not make a voluntary statement (¶ 41)Amran’s confession was admissible as against Rabu, pursuant to s 30 of the Evidence\n\n    Act. It was also reliable because Amran implicated himself fully for a serious offence\n\n    carrying a mandatory death penalty, he did not seek to shift the blame to Rabu and gave\n\n    evidence which was credible as a whole. (¶ 47)The evidence against Rabu was overwhelming. His statements to the CNB, Amran’s\n\n    evidence against him and the independent evidence available clearly pointed to his guilt.\n\n    (¶ 53)Under s 33(1), read with the Second Schedule of the Misuse of Drugs Act, the court does\n\n    not have any judicial discretion to reduce Rabu’s sentence from one of death to life\n\n    imprisonment. It is irrelevant whether Rabu had been entrapped to commit the offence.\n\n    (¶¶ 54,55)",
        "Case(s) referred to": "Chin Seow Noi & Ors. v PP[1994] 1 SLR 135(folld)Gulam bin Notan v PP [1999] 1 SLR 26 (folld)How Poh Sun v PP [1991] 1 SLR 220 (folld)Ng Ai Tiong v PP[2000] 1 SLR 454(folld)SM Summit Holdings v PP[1997] 3 SLR 922(folld)",
        "Legislation referred to": "Misuse of Drugs Act (Cap 185, 1998 Ed.), ss 5(1)(a), 33, Second\n\nSchedulePenal Code (Cap 224, 1985 Ed.), s 34JudgmentGROUNDS OF DECISIONThis was an appeal against\n\nthe decision of Judicial Commissioner Tay Yong Kwang, who convicted the appellants, Amran\n\nBin Eusuff (‘Amran’) and Rabu Bin Rahmat (‘Rabu’) of an offence\n\npursuant to s 5(1)(a) of the Misuse of Drugs Act (Cap 185)(‘the Act’) read with\n\ns 34 of the Penal Code (Cap 224) and punishable under s 33 of the Misuse of Drugs Act. The\n\njudge sentenced both appellants to suffer death.The charge2 The charge against Amran and Rabu read as follows:That you, 1) Amran Bin Eusuff and 2) Rabu Bin Rahmat, on or about the 3rdday of May 2001 at about 8.10 p.m. at along Bukit Merah View in motor car SZA 5202 M,\n\n  Singapore, in furtherance of the common intention of you both, did traffic in a controlled\n\n  drug specified in Class ‘A’ of the First Schedule of the Misuse of Drugs Act,\n\n  Chapter 185, to wit, by giving to one Mohd Nabil Bin Shahar 6 blocks of vegetable matter\n\n  containing 2174.86 grams of cannabis at the said place, without any authorisation under\n\n  the said Act or the regulations made thereafter, and you have thereby committed an offence\n\n  under section 5 (1)(a) of the Misuse of Drugs Act, read with section 34 of the Penal Code,\n\n  Chapter 224, and punishable under section 33 of the Misuse of Drugs Act, Chapter 185The prosecution’s case3 The prosecution presented the following facts. On 1 May 2001, at\n\nabout 8:30 p.m., an agent contacted Corporal Fazuri Bin Isnin (‘CPL Fazuri’) of\n\nthe CNB and informed him that a man named \"Daud\" was looking for a buyer of\n\ncannabis. CPL Fazuri told the agent to contact Daud to recommend him as a buyer called\n\n\"Man Boy\". When contacted, Daud asked the agent to relay the message to CPL\n\nFazuri to call him at telephone number \"4688965\" the next night to discuss the\n\ndeal. This number belonged to a public telephone at a coffeeshop along Sixth Avenue.4 On 2 May 2001, at about 8 p.m., CPL Fazuri called Daud at the\n\npre-arranged number and told him that he wanted to buy 1 kg of cannabis. Daud said he had\n\nto check the stuff and the price first. He called back about ten minutes later and\n\ninformed CPL Fazuri that the price would be cheaper if he were to buy 3 kg of cannabis\n\ninstead. CPL Fazuri said that he would check with his partner and call Daud back. About 15\n\nminutes later, CPL Fazuri called and told Daud that he would take 3 kg if the price was\n\nright. Daud said that he wanted $6,000 for the drugs and CPL Fazuri bargained with him to\n\nreduce the price. Daud then handed the phone over to a person called \"Abu\". Abu\n\ncontinued the negotiations with CPL Fazuri and finally agreed to accept $5,000 for the\n\ndrugs. He told CPL Fazuri that either he or Daud would contact him the next day to confirm\n\nthe time and place of delivery of the drugs.5 The next day, Daud called CPL Fazuri to arrange a meeting with him\n\nlater that evening at the 7-eleven store along Sixth Avenue to collect the drugs. CPL\n\nFazuri told Daud that he would send his men to meet Daud and Abu. Daud agreed to the\n\narrangement and told CPL Fazuri that either he or Abu would call again in the evening for\n\na final confirmation. At 7 p.m., Abu called CPL Fazuri to tell him that he had only 2.5 kg\n\nof cannabis and that it was selling for $4,400. CPL Fazuri agreed to buy the drugs at that\n\nprice. He also informed Abu that the registration number of the car that his men would be\n\ndriving was \"SZA 5202 M\". Abu then told CPL Fazuri to instruct his men to pick\n\nDaud and him up at the 7-eleven store along Sixth Avenue at 7:45 p.m..6 After the conversation with Abu, CPL Fazuri briefed the CNB officers\n\ninvolved in the operation to arrest Abu and Daud for trafficking cannabis. The plan was\n\nthat Corporal Mohd Nabil Bin Shahar (‘CPL Nabil’) and Sergeant Noor Aldi bin\n\nAlip (‘SGT Aldi’) would act as Man Boy (CPL Fazuri)’s men. They would drive\n\nthe car bearing the registration plate of \"SZA 5202 M\" to meet Daud and Abu and\n\nbe led by the pair to another place to collect the drugs. Three other teams would follow\n\nthe undercover car in three separate cars. CPL Fazuri would call CPL Nabil’s\n\nhandphone just before the latter was due to meet Daud and Abu. The telephone line would be\n\nkept on so that CPL Fazuri could monitor the conversation in the car. Once the cannabis\n\nwas handed over, CPL Nabil would give a pre-arranged signal by saying the words\n\n\"barang bagus\". Upon receiving this signal, CPL Fazuri would notify the rest of\n\nthe teams to move in and arrest the suspects.7 After the briefing, SGT Aldi drove the undercover car and CPL Nabil\n\nwas the front seat passenger. They parked the car near the 7-eleven store at Sixth Avenue\n\nas arranged. At about 7:50 p.m., Amran and Rabu approached their car and asked if they\n\nwere sent by Man Boy. Amran then introduced himself as \"Daud\" and Rabu said he\n\nwas \"Abu\". Both men entered the car. Daud sat behind CPL Nabil and Abu sat\n\nbehind SGT Aldi. Amran then instructed SGT Aldi to proceed to Bukit Merah View and stop\n\nalong the road in front of Block 117, Bukit Merah View. During the drive, Rabu did not say\n\nanything but Amran asked CPL Nabil if he had the money for the drugs. When the car\n\nstopped, Rabu alighted on his own accord and crossed the road. He headed towards Block\n\n123, Bukit Merah View and was out of sight of the people in the car. While Rabu was\n\ncollecting the drugs, Daud told CPL Nabil that the stuff was still wet which meant that\n\nthe drugs were good.8 About five minutes later, Rabu reappeared with a yellow paper bag in\n\nhis hands. SGT Aldi made a U-turn to pick him up. Rabu handed the bag over to CPL Nabil\n\nand when he saw that the bag contained some bundles, he said \"barang bagus\". As\n\narranged, the rest of the CNB officers moved in to effect the arrest of Amran and Rabu.\n\nOne team’s car intercepted the undercover car. When the undercover car stopped, both\n\nmen ran out and tried to escape. They put up a violent struggle to evade arrest and\n\nsuffered minor injuries in the course of their struggle. However, both were eventually\n\nsubdued and arrested by the CNB officers.9 The suspects were brought to a carpark near Delta Swimming Complex\n\nwhere Inspector Senthil Kumaran (‘Insp Senthil’) recorded their oral statements.\n\nAmran admitted that he knew that the yellow paper bag contained 2.5 kg of\n\n\"ganja\" or cannabis. However, he said that the drugs belonged to Rabu and that\n\nthey were for \"Boy\". He admitted that he arranged for Rabu to sell the drugs to\n\n\"Boy\". On the other hand, Rabu said that the contents of the yellow paper bag\n\nwere Amran’s. He claimed that he did not know what was inside the bag.10 After that, CNB officers proceeded to search the homes of Amran and\n\nRabu. However, Amran’s residence had already been demolished and nothing\n\nincriminating was found in Rabu’s home. Subsequently, the suspects were brought to\n\nthe Jurong Police Regional Headquarters for their urine tests. At about 2:15 p.m., Amran\n\nand Rabu were brought to the Major Investigation Branch (‘MIB’) of the CNB.11 At the MIB, Insp Senthil briefed Assistant Superintendent Daniel Tan\n\n(‘ASP Tan’), the Investigating Officer of the case. CPL Nabil also handed the\n\nyellow paper bag over to ASP Tan who weighed the drugs in the presence of the suspects and\n\nlocked them in his metal cabinet. ASP Tan instructed the arresting officers to bring the\n\nsuspects for a pre-statement medical examination. When Amran and Rabu returned to MIB that\n\nnight, ASP Tan served them both a copy of the charge against them and a Notice of Warning\n\nunder section 122(6) of the Criminal Procedure Code. Between about 4 a.m. to 4:42 a.m., he\n\nrecorded down their cautioned statements separately. Rabu denied that he knew what was in\n\nthe yellow paper bag while Amran stated that it was Rabu who owned the drugs. Then, he\n\ninstructed his men to bring the two suspects for their post statement medical examination\n\nand left for home.12 Dr. John Chiam (‘Dr. Chiam’) of the Alexandra Hospital\n\nconducted the pre statement medical examination for both Amran and Rabu. He testified that\n\nhe found recent abrasions on the forehead, nose, right cheek and lip of Amran. As for\n\nRabu, he found a bruise on his forehead and his right hand and back as well as an abrasion\n\non his left shoulder. Dr. Tan Sing Huang, also a doctor at the Alexandra Hospital,\n\nconducted the post statement medical examination. She found seven injuries on Amran\n\ninstead of the four found by Dr. Chiam. However, she found approximately the same injuries\n\nnoted by Dr. Chiam on Rabu. She also testified that both Amran and Rabu did not complain\n\nto her that any CNB officer has assaulted them.13 When ASP Tan returned to MIB on 4 May 2001, he took the drug\n\nexhibits pertaining to the case to the Centre for Forensic Science (‘CFS’) and\n\nhanded it over to Dr Lui Chi Pang for analysis. Subsequently, ASP Tan received six\n\ncertificates from the CFS which revealed that the drugs recovered from Amran and Rabu in\n\nthe yellow paper bag were 2174.86 grams of cannabis.14 Dr. Ann Young, also an analyst with the CFS testified that Iskandar\n\nZulkarnain Bin Abd Aziz handed the urine samples of Amran and Rabu for analysis on 4 May\n\n2001. She found that Rabu, but not Amran, tested positive for cannabis consumption.\n\nAnother analyst with the CFS, Dr Natarajan also gave evidence that he received the urine\n\nsample of Rabu on 4 May 2001 from Iskandar Zulkarnian. Upon analysis, he found that\n\nRabu’s urine sample contained cannabis.15 Lastly, the prosecution relied on the long statements made by Amran\n\nand Rabu to show that both were involved in trafficking cannabis. Amran made a long\n\nstatement on 8 May 2001 and a further one on 15 May 2001. In the statement recorded on 8\n\nMay 2001, he described the events of 2 and 3 May 2001 as the following: On 2 May 2001, he\n\nspoke with Boy and told him that he could obtain some cannabis for him. On 3 May 2001, he\n\nand Rabu contact Boy to negotiate the sale of the cannabis. When Rabu reached an agreement\n\nwith Boy, Rabu passed the phone to him. At this point, Boy informed him that his men would\n\npick him and Rabu up at about 7:45 p.m. that night to collect the drugs. When the car\n\narrived, Rabu and him got in. The car drove to Bukit Merah View where Rabu left to collect\n\nthe drugs. Shortly after that, the car was intercepted and he was arrested. In his\n\nstatement recorded on 15 May 2001, he admitted that he promised Boy to get the drugs for\n\nhim because he wanted the commission that Boy promised him badly.16 Rabu made a long statement on 9 May 2001. He denied that he was\n\ninvolved in the negotiations for the sale of the cannabis. He admitted that, on 3 May\n\n2001, he followed Amran into the undercover car. Furthermore, he admitted that when the\n\ncar reached Bukit Merah View, he left the car to collect a yellow paper bag from another\n\nperson waiting at Block 123, Bukit Merah View. However, Rabu denied that he knew what was\n\nin the bag. He claimed that he merely followed Amran’s instructions to collect the\n\nbag.17 However, in his long statement recorded on 15 May 2001, Rabu changed\n\nhis story. He admitted that he was involved in procuring and selling the cannabis to CPL\n\nFazuri. His version of what happened on 3 May 2001 was the following: that day, Amran\n\nasked him whether he could obtain some cannabis for him and he replied that he would try.\n\nAt about 7:15 p.m., Amran asked him to talk to Boy who wanted 3 kg of cannabis. Rabu said\n\nthat he would try to get the drugs and subsequently, he contacted a person called\n\n\"Daud\" (not Amran), whom he met in Batam previously. Daud told him that he could\n\nsupply him with 2.5 kg of cannabis at $4,400. Rabu then informed Amran who in turn told\n\nBoy that only 2.5 kg of cannabis was available. Boy agreed to both the quantity and price.\n\nRabu also knew that Amran had been promised a commission for setting up the sale.Amran’s case18 Amran did not dispute most of the prosecution’s case. In his\n\ndefence, he testified that he did not own the drugs and that he was entrapped into\n\ncommitting the offence. However, in his closing submissions, Mr. Luke Lee, counsel for\n\nAmran, conceded that entrapment was not a defence to the charge. Furthermore, Mr. Lee\n\nconceded that Amran had admitted to all the essential facts constituting the charge even\n\nthough he denied ownership of the drugs. Ownership was not an essential element of drug\n\ntrafficking. Amran pleaded for leniency in court but Mr. Lee also conceded that no\n\nleniency was possible since Amran was charged with an offence that was punishable with a\n\nmandatory death penalty.Rabu’s case19 Rabu’s gave the following version of the facts in court: He\n\nwent to Batam on 30 April 2001 and returned to Singapore on 2 May 2001, arriving at the\n\nWorld Trade Centre at about 8 p.m.. He had his dinner at the hawker centre near the World\n\nTrade Centre and returned home after that. He did not go to the coffeeshop at Sixth Avenue\n\nor speak to Boy that day. He pointed out that Boy spoke to a person called \"Abu\"\n\nand testified that he was not \"Abu\" since he was never known by that name.20 On 3 May 2001, he did go to the coffeeshop at Sixth Avenue at about\n\n5 p.m.. Amran arrived at the coffeeshop at about 7:15 p.m. but they did not speak to each\n\nother until Amran had finished with his telephone call. Amran told him that his friends\n\nwould be coming to the coffeeshop in a car and that they were proceeding to Bukit Merah\n\nView. He was invited to come along with Amran and he did so because he thought that Amran\n\nwanted to give him some tips about racing horses. He did not ask Amran any other questions\n\nabout the purpose of the trip. He testified that he introduced himself as \"Rabu\"\n\nto Amran’s \"friends\", i.e. the undercover CNB officers. During the journey,\n\nthere was no mention about drugs. He did not talk to the CNB officers. It was Amran who\n\ninstructed the officers to proceed to Bukit Merah View.21 When the car reached its destination, Amran asked him to go to Block\n\n123 to collect a plastic bag. He decided to collect the bag as a favour to Amran. Thus, he\n\nwent to the void deck of Block 123 where he met a man, called \"Ahmad\", whom he\n\nhad never seen before. Ahmad refused to tell him what he promised to give Amran and Rabu\n\ndid not press the issue. He followed Ahmad to the landing between the second and third\n\nfloor. Ahmad then took a paper bag that was tied up from a heap of rubbish and handed it\n\nto him. He took the bag without opening it and gave it to Amran in the car. Rabu testified\n\nthat he did not know the contents of the bag.22 When he entered the car, SGT Aldi drove off. In the car, Amran\n\nhanded the paper bag to the front seat passenger. Rabu gave evidence that he only realised\n\nthat the bag contained cannabis when the front seat passenger opened up the bag and he\n\nsmelt the drugs. He heard the front seat passenger say \"barang bagus\". Soon\n\nafter that, the car was intercepted. Rabu suspected that CNB officers were conducting\n\narrests and he attempted to flee because he thought he might be implicated for drug\n\ntrafficking or at the very least for drug consumption. He had consumed cannabis while he\n\nwas in Batam. However, he was eventually arrested.23 This version of the facts contradicted his long statement to the CNB\n\nrecorded on 15 May 2001. In court, Rabu claimed that the contents of that long statement,\n\ntogether with his statement that was recorded on 9 May 2001, were inaccurate because he\n\nhad made them involuntarily.24 Avoir direwas conducted. Rabu alleged that he was suffering\n\nfrom a toothache and was not feeling well. He testified that he suffered from a lack of\n\nsleep and missed his family. In addition, when he made the statement on 15 May 2001, ASP\n\nTan read the statement made on 9 May 2001 and he felt that this was a signal that he must\n\ngive a different answer when he recorded the later statement. Furthermore, he alleged that\n\nASP Tan told him that if he co-operated, his sentence for the offence may be reduced. For\n\nthese reasons, he contended that his statement was involuntary as they were made as a\n\nresult of a threat or inducement. He alleged that ASP Tan did not record the full facts\n\nand contended that the accurate version of the facts was that he did not know anything\n\nabout the drug deal or the contents of the paper bag that he collected.The decision below25 Tay JC decided that the prosecution had proven its case against\n\nAmran beyond reasonable doubt. He found that Amran’s version of the facts coincided\n\nwith essentially all of the prosecution’s case. It was immaterial that Amran did not\n\nown the drugs. In addition, he dismissed Amran’s defence of entrapment because such a\n\ndefence was unavailable in Singapore. In any case, he found that Amran participated\n\nvoluntarily in the drug deal.26 The judge also concluded that the totality of evidence put it beyond\n\nreasonable doubt that Rabu was guilty of trafficking cannabis. The judge decided that Rabu\n\nmade the statements to the CNB on the 9 and 15 May 2001 voluntarily. He relied on the\n\nstatement made on 15 May 2001 as evidence that Rabu knew about and became involved in\n\nselling Boy 2.5. kg of cannabis. He accepted the testimony of ASP Tan and Ms. Sofia, the\n\nMalay interpreter who was present during the recording of both statements in question.\n\nBoth emphatically denied that any threat, inducement or promise were offered to Rabu\n\nduring the recording of his statements. The judge also accepted Amran’s testimony\n\nthat Rabu was actively involved in the trafficking. He applied section 30 of the Evidence\n\nAct andChin Seow Noi & Ors. v PP[1994] 1 SLR 135to admit Amran’s oral\n\nevidence and written statements as against Rabu as these amounted to confessions by\n\nRabu’s co-accused. Lastly, the judge held that Rabu’s conduct on 3 May 2001 was\n\nmore consistent with the prosecution’s case that Rabu was aware that a drugs deal was\n\ntaking place.The appealAmran’s appeal27In his Petition of Appeal, Amran appealed against the\n\njudge’s findings of fact that he directed the undercover car to Bukit Merah View and\n\nthat he sat behind the driver during the journey. He also contended that he was entrapped\n\nto commit the offence.28 However, before us, Counsel for Amran stated that he had advised his\n\nclient that the appeal was unlikely to succeed. We agreed. Amran had already admitted to\n\nall the essential elements of the charge against him by his own evidence, in court as well\n\nas in his statements to the CNB. He gave evidence that he facilitated the sale between Abu\n\nand CPL Fazuri of 2.5 kg of cannabis at $4,400 to obtain a commission which he badly\n\nwanted. He also took part in the delivery of the drugs by going with Rabu and the\n\nundercover CNB officers to Bukit Merah View to collect the drugs. Amran did not dispute\n\nall these facts in this appeal.29 In addition, the defence of entrapment was obviously unavailable to\n\nexonerate Amran from liability. It is trite law that entrapment is not a valid defence to\n\na charge. InHow Poh Sun v PP[1991] 1 SLR 220, another case on drug trafficking\n\nwhere the defence of entrapment was raised, this court held at p 224:The observation of the Law Lords that the defences of agent provocateur\n\n  and entrapment do not exist in English law would also reflect the position in Singapore.\n\n  It is not the province of the court to consider whether the CNB should have proceeded\n\n  about its work in one way or the other. The court can only be concerned with the evidence\n\n  before it30 The rationale for this position was elaborated inSM Summit\n\nHoldings v PP[1997] 3 SLR 922, 937 in the following terms:Sangand the line of Singapore cases followingSang(e.g.PP v Rozman bin Jusoh and Razali bin Mat Zin[1995] 3 SLR 317,Ajmer Singh v PP[1986]   SLR 454,Chan Chi Pun v PP[[1994] 2 SLR 61;How Poh Sun v PP[1991] 1 SLR   220) have held that entrapment is not a substantive defence to a charge of a criminal\n\n  offence. This is not surprising since it isa central thesis of our criminal law that a\n\n  person who voluntarily, and with the necessary intent, commits all the element of a\n\n  criminal offence is guilty of that offence, regardless of whether he was induced to actby another, whether a private citizen or law enforcement officer31 In conclusion, we found that the trial judge had rightly convicted\n\nAmran of the charge against him since Amran had admitted to voluntarily committing all the\n\nelements of drug trafficking. The fact that he was induced to act by a law enforcement\n\nofficer could not exonerate him from his guilt.Admissibility of Rabu’s statements to the CNB32 In his appeal, Rabu sought to revisit the issue on whether he had\n\nmade the statements on 9 and 15 May 2001 to the CNB voluntarily. The appeal on this matter\n\nwas purely factual. The usual caution that an appellate court should not overturn a trial\n\njudge’s findings of fact unless they areclearlywrong applies (Ng Ai Tiong\n\nv PP[2000] 1 SLR 454).33 The law governing the admissibility of these statements was not in\n\ndispute. Section 24 of the Evidence Act governs the admissibility of confessions made to\n\nCNB officers. It reads:A confession made by an accused person is irrelevant in a criminal\n\n  proceeding if the making of the confession appears to the court to have been caused by any\n\n  inducement, threat or promise having reference to the charge against the accused person,\n\n  proceeding from a person in authority and sufficient in the opinion of the court to give\n\n  the accused person grounds which would appear to him reasonable for supposing that by\n\n  making it he would gain any advantage or avoid any evil of a temporal nature in reference\n\n  to the proceeding against him.34 InGulam bin Notan v PP[1999] 1 SLR 26, the Court of Appeal\n\nrestated the law on the admissibility of confessions made to CNB officers. The court held\n\nthat the prosecution had the burden to prove beyond reasonable doubt that the confession\n\nwas made voluntarily although it need not remove \"every lurking shadow of influence\n\nor remnants of fear\". The court described the test of voluntariness as a partly\n\nobjective and partly subjective one. The prosecution must prove objectively that there was\n\nno threat, inducement or promise, i.e. there were no circumstances that made it reasonable\n\nfor an accused to suppose that he would gain some advantage for himself or avoid some evil\n\nof a temporal nature to himself if he made the statement. If the prosecution failed to\n\nprove this, it must then show beyond reasonable doubt that although there was objectively\n\na threat, inducement or promise, it did not actually operate on the mind of the accused in\n\nquestion.35 In his appeal, Rabu placed strong reliance on the trial judge’s\n\nfinding that ASP Tan had asked Ms. Sofia to read his earlier statement back to him at the\n\nbeginning of the recording of the later statement. First, he argued that this itself\n\nconstituted a threat which Rabu had actually succumbed to. Secondly, he argued that\n\nbecause ASP Tan had previously made such a threat, it was likely that ASP Tan had also\n\noffered a lighter sentence to Rabu if he co-operated. He also urged the Court to consider\n\nthat he was particularly susceptible to any inducements or threats because he was unwell\n\nand was deprived of food, sleep and family visits.36 The trial judge dealt with all these arguments comprehensively. He\n\nfound that there was nothing sinister about reading Rabu’s earlier statement back to\n\nhim at the beginning of the recording to refresh his memory. We agreed that such a\n\nsituation could not amount to a threat objectively. It is not reasonable for an accused\n\nperson to believe that he will avoid some evil of a temporal nature to himself by making\n\nan incriminating statement merely because the investigating officer reads back his\n\nprevious statement. An accused who views the reading back of his own statement as a threat\n\nmust clearly be labouring under his own delusions. It is trite law that such self-induced\n\nthreats will not cause a statement made pursuant to it to be inadmissible.37 At this juncture, we would deal with Rabu’s argument that the\n\ntrial judge had erred in finding that ASP Tan did not offer him an inducement of a lighter\n\nsentence if he co-operated. Rabu contended that since ASP Tan caused Ms. Sofia to threaten\n\nhim by reading his previous statement back to him, it was probable that ASP Tan also\n\noffered him an inducement and the judge should have found in his favour. This argument\n\nclearly involved a leap of logic and we rejected it. Even if ASP Tan did threaten Rabu\n\nonce (which clearly had not been shown on the facts), it did not necessarily imply that he\n\noffered another separate inducement as well. No other reasons were raised to show that the\n\njudge was clearly wrong in finding that ASP Tan had not offered a lighter sentence to Rabu\n\nif he co-operated.38 Finally, we also rejected Rabu’s argument that he had made the\n\nstatements in question involuntarily because he was \"not fit\" to make those\n\nstatements when they were recorded. Rabu claimed that he was unwell and complained that he\n\nwas deprived of food, sleep and family visits. In his written submissions, Counsel for\n\nRabu argued that these circumstances made Rabu more susceptible to any form of threat or\n\ninducement held out to him. He urged the Court to find that the statement were made\n\ninvoluntarily because he actually felt that he was threatened and offered inducements to\n\nmake them.39 We rejected this argument on two grounds. First, it was unnecessary\n\nto consider whether the circumstance actually operated on Rabu when he made the statement\n\n(the subjective limb). Rabu did not raise a reasonable doubt that an inducement or a\n\nthreat that would reasonably affect an accused and cause such a person to make statements\n\ninvoluntarily did not exist (the objective limb). UnderGulam bin Notan v PP, it\n\nwas unnecessary to consider the subjective limb of the test of voluntariness when the\n\nobjective limb of the test had not been met.40 Secondly, the facts that Rabu sought to rely on to prove that he was\n\nmore susceptible to any inducement had not been proven. In the trial below, the judge had\n\nthe advantage of observing ASP Tan and Ms. Sofia and preferred their testimonies about the\n\nconduct of the recording of Rabu’s statements. He noted particularly, that Ms. Sofia\n\nhad no interest in ensuring that Rabu made an incriminating statement. The judge accepted\n\nthe evidence of ASP Tan and Ms. Sofia that Rabu did not appear unwell and that he said\n\nnothing about feeling unwell or being unable to carry on with the statements at anytime.\n\nHe was also satisfied that Rabu had not been deprived of food or sleep to such an extent\n\nthat he could not comprehend what was going on during the recording of the statement. As\n\nfor Rabu’s complaint about his toothache, the judge found that the tooth problem only\n\nfeatured after the recording of the two statements in issue.41 In the present appeal, Rabu failed to raise any grounds to show that\n\nthe judge wasclearly wrongin his assessment of the witnesses and evidence before\n\nhim. Consequently, we affirmed the trial judge findings of fact on this issue.\n\nFurthermore, although Rabu had been denied family visits, this would not make him more\n\nsusceptible to inducements compared to any other accused person since the deprivation of\n\nfamily visits is necessary during the period of interrogation. Rabu had no basis to argue\n\nthat he was more susceptible to an inducement or threat because he felt unwell and was\n\ndeprived of food, sleep and family visits.42 In summary, we concluded that none of Rabu’s contentions to\n\nsupport his argument that he made the statements on the 9 and 15 May 2001 involuntarily\n\nwere valid. We agreed that the trial judge rightly admitted and gave due weight to these\n\nstatements.Admissibility and weight of the confessions of a co-accused43 Rabu also appealed against the decision of the trial judge to accept\n\nAmran’s evidence. The law on confessions of a co-accused is clear. Section 30 of the\n\nEvidence Act (Cap 97) reads:When more persons than one are being tried jointly for the same offence\n\n  and a confession made by one such persons affecting himself and some other of such person\n\n  is proved, the court may take into consideration the confession as against the other\n\n  person as well as against the person who makes the confession44 InChin Seow Noi v PP[1994] 1 SLR 135, the Court of Appeal\n\nheld that the natural construction of s 30 meant that the confession of a co-accused may\n\nbe made part of the substantive evidence against the accused in the same manner it formed\n\npart of the evidence against the confessing co-accused. The court noted that a\n\nco-accused’s confession may not always be reliable because the maker of the statement\n\nmay lie to shift the blame on the other accused. However, this went to the weight of the\n\nevidence, not its admissibility.45 Amran’s oral evidence and written statements to the CNB\n\namounted to confessions since, by them, he had admitted to the essential elements of drug\n\ntrafficking. Pursuant to s 30 of the Evidence Act, these confessions were admissible and\n\ncould be taken into consideration against Rabu.46 Amran gave evidence that Rabu was aware of the drug deal, negotiated\n\nit and went with him into the undercover car to obtain delivery of the drugs to sell to\n\nBoy. Rabu argued that this evidence should be rejected because it was unreliable. Amran\n\nhad an incentive to lie and shift the blame on Rabu since he believed that he could obtain\n\nleniency from the Court.47 We did not accept this argument. In his confessions, Amran\n\nimplicated himself fully for a serious offence that carried the mandatory death penalty.\n\nHe accepted his own role in the matter fully. Although Amran did dispute the fact that he\n\ngave directions to the CNB officers to go to Bukit Merah View, this was merely a minor\n\ndiscrepancy. In the rest of his testimony, Amran did not seek to push the blame onto Rabu\n\nto lessen his role in the offence. Amran’s evidence was convincing and credible as a\n\nwhole. The judge had the opportunity to observe both Amran and Rabu on the stand and chose\n\nto believe Amran’s version of the facts as stated in his confession. Rabu failed to\n\nshow that the judge obviously erred in his assessment of the weight of Amran’s\n\nconfession.Independent evidence against Rabu48 The trial judge found that there was sufficient independent evidence\n\nto convict Rabu. Rabu contended that the judge made two main errors of fact. The first\n\nerror was finding that he took part in the negotiations with CPL Fazuri to sell the drugs.\n\nSecondly, he argued that the judge wrongly found that he knew the true purpose of the\n\njourney in the undercover car and the contents of the yellow paper bag.49 The judge’s findings were clearly supportable. Rabu argued that\n\nhe could not have taken part in the negotiations with CPL Fazuri on 2 May 2001 at about 8\n\np.m. at the coffeeshop at Sixth Avenue. This was because he had just arrived in Singapore\n\nfrom Batam. However, the prosecution produced documentary proof in the form of the records\n\nkept by the Singapore Immigration and Registration to show that Rabu had disembarked from\n\nthe ferry at the World Trade Centre Terminal at 7:32 p.m.. It waspossiblefor him\n\nto be at Sixth Avenue at about 8 p.m. since would take less than half an hour to get from\n\nWorld Trade Centre to Sixth Avenue by cab. The trial judge had a proper basis for\n\nbelieving Amran’s testimony that Rabu was at the coffeeshop on 2 May 2001 and that\n\nRabu took part in the negotiations for the drugs deal with CPL Fazuri. It also followed\n\nthat the judge’s finding that Rabu was the \"Abu\" who spoke to CPL Fazuri\n\nthat day could not be seriously challenged.50 The judge’s finding that Rabu knew the true purpose of the\n\njourney to Bukit Merah View also could not be faulted. Rabu claimed that he did not know\n\nthat the people in the undercover car intended to obtain drugs at Bukit Merah View. He\n\ntestified that he was simply accompanying Amran on a journey with unknown men so that\n\nAmran could talk to him about horses. The judge found this explanation incredulous. It was\n\nillogical for a fully-grown up man to go along with Amran to Bukit Merah View with\n\nstrangers without even first enquiring about the purpose or the length of time that they\n\nwould stay there. In any case, there was no talk about horses and it was inconceivable\n\nthat a person expecting to talk about horses would later just sit in the car silently\n\nwhile Amran and the front seat passenger continued talking. The judge drew the inference\n\nthat Rabu’s conduct in the car was much more consistent with someone who already knew\n\nthe purpose of the trip and who needed no explanation from anyone. In light of the\n\nevidence, this inference was perfectly justifiable.51 Furthermore, other than Amran, CPL Nabil and SGT Aldi testified that\n\nwhen the car reached Bukit Merah View, Rabu alightedon his own accordto collect\n\nthe paper bag. The judge chose to believe these witnesses over Rabu. The Notes of Evidence\n\ndid not show that the judge was clearly wrong to accept the testimonies of the CNB\n\nofficers that Rabu acted on his own accord to collect the yellow paper bag.52 Rabu’s attempt to evade arrest was also consistent with his\n\nknowledge of what has been going on. He explained that he bolted because he feared being\n\ncaught for drug consumption. On appeal, he added that he tried to escape to avoid the\n\nbeatings by the CNB officers who were trying to effect his arrest. However, in view of the\n\ntotality of the evidence, the true reason for his attempt to evade arrest for drug\n\ntrafficking was that he knew that the yellow paper bag that he delivered to Boy’s men\n\ncontained cannabis.53 The evidence against Rabu was overwhelming. His statements to the\n\nCNB, the independent evidence available and Amran’s testimony against him painted a\n\nconsistent picture that he was heavily involved in the drug transaction on 3 May 2001. He\n\nnegotiated with CPL Fazuri for the sale of the drugs and he contacted the supplier in\n\nBatam to provide the drugs. On the 3 May 2001, he and Amran entered the undercover car to\n\ngo to Bukit Merah View to collect the drugs. Upon reaching the destination, he got down on\n\nhis own accord and went to pick up the drugs from the supplier, brought it back to the car\n\nand passed them to Amran who in turn delivered it to CPL Nabil. We found that his appeal\n\nagainst conviction was devoid of merits and we upheld his conviction.Sentencing54 Counsel for Rabu also made submissions on Rabu’s sentence at\n\nthe end of his oral submission. He suggested that if the Court intended to uphold\n\nRabu’s conviction, it should exercise its judicial discretion to reduce Rabu’s\n\nsentence from one of death to life imprisonment. He submitted that the Court should\n\nconsider the fact that Rabu was entrapped into committing the offence as a mitigating\n\nfactor in sentencing him.55 This argument was totally misconceived and we rejected it. Section\n\n33(1) read with the Second Schedule of the Act prescribes amandatorydeath\n\nsentence for persons convicted under s 5(1)(a) of the Act for trafficking more than 500\n\ngrams of cannabis. There was no room for judicial discretion in sentencing in the face of\n\nthe clear wording of the section.Conclusion56 For the foregoing reasons, we dismissed the appeals of Amran and\n\nRabu and upheld their convictions and sentences.Sgd:YONG PUNG HOWChief JusticeSgd:CHAO HICK TINJudge of AppealSgd:TAN LEE MENGJudgeCopyright © Government of Singapore."
    }
}