{
    "case_title": "Clarke Beryl Claire (as personal representative of the estate of Eugene Francis Clarke) and Others v SilkAir (Singapore) Pte Ltd",
    "ncitation": "[2002] SGCA 26",
    "coram": "Chao Hick Tin JA; \n      Judith Prakash J; \n      Yong Pung How CJ",
    "sections": {
        "The facts": "2 On 19 December 1997 at 08:37:13 Coordinated Universal Time, SilkAir\n\nFlight MI 185 departed from Jakarta, bound for Singapore. It proceeded without incident to\n\nPalembang while maintaining a cruising altitude of 35,000 feet. The last voice\n\ntransmission from the crew was at 09:10:26, to Jakarta Air Traffic Control\n\n(\"ATC\"). It was not a distress call. The last radar recording from Jakarta ATC\n\nwhich showed that the aircraft was at 35,000 feet was at 09:12:09. The last data\n\nrecording, at 09:12:41, showed the aircraft to be at 19,500 feet. The aircraft crashed\n\ninto the Musi River at about 09:13. This occurred in daylight and in good weather. All 97\n\npassengers, five crew, pilot Captain Tsu Way Ming (\"Capt Tsu\") and First Officer\n\nDuncan Ward (\"FO Ward\") perished. The personal representatives and dependants of\n\nall but six of the persons on board came to a settlement with the respondent regarding\n\ncompensation. The appellants – the personal representatives and dependants of the\n\nremaining six persons – sued the respondents. According to the judgment below, some\n\nor all of the appellants were also suing the manufacturers of the aircraft (Boeing) and\n\nthe manufacturers of the aircraft parts in the United States (\"the US\n\nproceedings\"). Mr Khoo SC had denied this at trial, but did not clarify the matter on\n\nappeal.3 The Indonesian National Transportation Safety Committee\n\n(\"NTSC\") carried out a thorough investigation into the cause of the crash. In\n\nits Final Report (dated 14 December 2000) (\"the NTSC report\"), it concluded that\n\nthe cause was unascertainable due to a lack of evidence. Only 73 percent of the wreckage\n\nhad been recovered, and not all of it could be used for investigative purposes. The parts\n\nof the aircraft which were recovered included the cockpit voice recorder\n\n(\"CVR\"), the flight data recorder (\"FDR\"), the horizontal stabiliser,\n\nthe throttle box and some oxygen generators. The data from the FDR was corrected by the\n\nmanufacturers of the radar, Hughes Raytheon, and further corrected by Boeing and the NTSB.\n\nThis will be referred to as the \"corrected radar data\". Simulation tests were\n\nconducted by Boeing, the NTSC and Captain John Laming, one of the appellants’ expert\n\nwitnesses.4 The USA Accredited Representative, the National Transportation Safety\n\nBoard (\"NTSB\"), disagreed with the NTSC’s conclusion. In a letter to the\n\nNTSC (dated 11 December 2000), the NTSB suggested that:a The accident was not caused by mechanical failure.b It was likely that the accident was caused by intentional pilot\n\n  action, which probably included: sustained manual nose-down flight control inputs (more\n\n  likely made by Capt Tsu than by FO Ward); intentional disconnection of the CVR; and a\n\n  decision not to attempt recovery of the aircraft from its dive.5 The Criminal Investigation Department in Singapore conducted an\n\ninquiry into the career history and personal circumstances of the pilots and crew\n\n(\"the human factors\"). In its report, \"Investigation into Police Report\n\nLodged by the Singapore-Accredited Representative to the NTSC on 25 August 1999\"\n\n(dated 14 December 2000) (\"the CID report\"), it stated that it had found no\n\nevidence of suicidal tendencies or of motives to crash the aircraft.",
        "The judge’s decision": "6 The judge delivered his judgment on 24 October 2001. He described the\n\nincident and summarised the NTSC and CID reports. He then set out the relevant provisions\n\nof the Conventions and the gist of the parties’ cases. He went on to discuss the\n\nevidence recovered from the crash site and the parties’ respective interpretations of\n\nthe evidence. He also explored the human factors, which he thought were relevant.7 The judge made the following findings:a The accuracy of the corrected radar data was doubtful.b The value of the simulation tests was limited because: one, they were\n\n  based on the corrected radar data; and two, they did not envisage a situation where the\n\n  aircraft had exceeded its normal flight envelope (as was the case here).c The final set position of the jackscrew of the horizontal stabiliser\n\n  was unclear.d It was not shown that the pilots did not attempt to recover the\n\n  aircraft from its dive.e It was not shown that the CVR and FDR had been intentionally\n\n  disconnected.f The evidence on the human factors did not show any suicidal or\n\n  murderous intent on the part of the pilots.g The aircraft was not intentionally crashed.h The pilots were not guilty of wilful misconduct, hence the respondent\n\n  could limit its liability under the Warsaw Convention. They also did not act recklessly\n\n  and with knowledge that the damage would probably result, hence the respondent could limit\n\n  its liability under the Warsaw (Hague) Convention.",
        "The issues": "8 The key issue is whether the respondent can limit its liability under\n\na 25 of the Warsaw Convention and the Warsaw (Hague) Convention. The specific issues are:(1) Whether the technical evidence revealed the cause of the crash, in\n\n  particular:(a) Whether the experts’ inferences from the facts are tenable.(b) Whether the corrected radar data was accurate.(c) Whether the simulation tests were useful.(d) Whether the horizontal stabiliser showed that the aircraft had been\n\n    placed in the maximum nose-down position.(e) Whether the pilots had attempted to recover the aircraft from its\n\n    dive.(f) Whether the CVR and / or FDR had been intentionally disconnected.(g) Whether there were other possible \"causes\" of the crash.(2) Whether the human factors are relevant; and, if so, what they\n\n  revealed in respect of the following:(a) The NTSC and CID reports(b) Capt Tsu(c) FO Ward(3) Whether the respondent can limit its liability under the Warsaw\n\n  Convention.(4) Whether the respondent can limit its liability under the Warsaw\n\n  (Hague) Convention.(5) How the concept of burden of proof applies in this case.",
        "The first issue: the technical evidence": "(1)(a) The experts’ opinions and other inferences9 The opinions of experts are relevant under s 47 of the Evidence Act\n\n(Cap 97). An opinion will, however, only be accepted if it fulfils the criteria enunciated\n\ninMuhammad Jeffry v Public Prosecutor[1997] 1 SLR 197:… the three criteria for the acceptance of expert opinion\n\n  evidence, i.e. value, impressiveness and reliability.If the opinion is purportedly based on facts, it must fulfil a further\n\ncriterion set out inSingapore Finance Ltd v Kim Kah Ngam (Spore) Pte Ltd[1984-1985]\n\nSLR 381:Where the opinion of an expert is based on reports of facts and\n\n  empirical observations, I have endeavoured to satisfy myself, on a balance of\n\n  probabilities, whether those facts did in truth exist and whether any inference or\n\n  inferences drawn from those facts, taken individually and collectively, were sound or not.Hence the court must consider whether the facts exist, and whether the\n\nexpert’s inferences from those facts are tenable.10 The appellants’ experts were Captain John Laming (\"Capt\n\nLaming\"), Captain Maurie Baston (\"Capt Baston\") and Mr Macarthur Job\n\n(\"Mr Job\"). The respondent’s experts were Professor Denis Howe (\"Prof\n\nHowe\") and Captain Robert Galan (\"Capt Galan\"). The judge generally\n\npreferred the view of the respondent’s experts. Capt Laming’s evidence was based\n\nlargely on his simulation tests, which the judge did not find useful. Capt Baston had\n\nadmitted that, if the corrected radar data was inaccurate, his opinion on the cause of the\n\ncrash may well change. The judge thought that Mr Job’s evidence was \"undermined\n\nfrom the very start by his failure to give sufficient attention to the human factors which\n\nhe himself thought to be relevant\". Mr Job also relied heavily on the NTSB’s\n\ncomments on the NTSC report.",
        "(1)(b) The accuracy of the corrected radar data": "11 The appellants sought to rely on \"Recorded Radar Study\" by\n\nCassandra Johnson (dated 2 November 1998), claiming that a copy thereof was not available\n\nat trial. This cannot be allowed. First, the judge had refused to admit the document as\n\nevidence on 5 September 2001. Secondly, the document had been considered in the NTSC\n\nreport. Thirdly, if the appellants wanted to have the document admitted as fresh evidence,\n\nthey should have done so by a motion to adduce fresh evidence. Such a motion would almost\n\ncertainly have failed.",
        "(i) The views of the appellants’ experts": "26 Capt Laming thought that the FDR could not have tripped without the\n\npilots’ knowledge, because there would have been a warning light above the\n\npilots’ heads. He pointed out the circuit breaker panel was at the back of the\n\npilot’s seat and that it would have been difficult for the co-pilot to see a pulled\n\ncircuit breaker. During cross-examination however, he admitted that he could not comment\n\nas an expert on the possibility of progressive electrical failure leading to the cessation\n\nof CVR and FDR functions.27 Capt Baston agreed with the NTSC that the cause of the CVR and FDR\n\nstoppage could not be determined.",
        "(ii) Prof Howe’s view": "28 Prof Howe raised the possibility of progressive power failure,\n\nespecially in view of the fact that the transponders had stopped working at about the same\n\ntime as the CVR and FDR. The appellants tried to disprove this theory, but to our minds,\n\nit is not any less likely than their assertion that the CVR and FDR had been deliberately\n\ndisconnected. In any case, as we point out at  58, the appellants had to prove theirowncase on a balance of probabilities, and not merely show that their explanations were more\n\nprobable than the respondent’s or that the respondent’s explanations were\n\nunlikely to be true. The respondent did not have to convince the court that its theories\n\nheld absolutely true. For this reason, we do not think it necessary to discuss this issue\n\nat length here. We agree with the judge that the appellants had not shown, on a balance of\n\nprobabilities, that the CVR and the FDR had been deliberately disconnected.",
        "(1)(c) The usefulness of the simulation tests": "(i) The views of the appellants’ experts16 During cross-examination, Capt Laming admitted that he had not even\n\nused the corrected radar data for his tests. He had conducted the tests from a \"pilot\n\npoint of view\" and had attempted to achieve the steepest dive possible. He also\n\nagreed that a simulator could not fully replicate the motions of an aircraft beyond the\n\naircraft’s normal operating limits, but did not know off-hand what those limits were.\n\nIn any case, he had conducted the tests without subjecting the simulator to motion.17 Capt Baston recognised that Boeing’s tests were problematic\n\nbecause they were not based on any real radar points at all. Hence there is no reason to\n\noverturn the judge’s finding that the simulation tests were not useful.",
        "(1)(d) The final position of the horizontal stabiliser: whether the pilot(s) intended to\n\nexit the normal flight envelope": "(i) The views of the appellants’ experts18 It was Capt Laming’s view that, to bring the horizontal\n\nstabiliser trim setting from the cruise setting (4.5 units) to the forward manual electric\n\ntrim limit (2.5 units), the pilot would have had to set the manual stabiliser trim for\n\neight to ten seconds. To bring the trim setting from 4.5 units to 3.05 units, it would\n\nhave taken six to seven seconds. He did not have an opinion on whether it was possible\n\nthat something other than cockpit input could have caused the nut and screw of the\n\nhorizontal stabiliser to turn and yield a different reading from that set by the pilot.19 Mr Job said that it was only remotely possible that the jackscrew\n\nball-nut unit could have rotated after the horizontal stabiliser trim was manually set. He\n\ncould only base this on his \"experience\"; he did not have a technical\n\nexplanation for his view nor was he able to accept or refute the study done by the\n\nCranfield Impact Centre.",
        "(ii) The views of the respondent’s experts": "20 Capt Galan’s view was that the pilots had initiated an\n\nemergency descent, but that this went wrong. They did not intend to exit the normal flight\n\nenvelope. He thought that although an emergency descent comprised three theoretically\n\nsimple steps, its execution was in actual fact a difficult task. He cited studies to\n\nsupport this.21 The appellants’ counsel tried to have Capt Galan concede that,\n\nif there was no rapid depressurisation or faulty indication thereof, the pilots were\n\nreckless in initiating the descent in the first place. This was misguided. First, it is a\n\nfutile exercise to speculate onwhythe pilots initiated an emergency descent, if\n\nat all. Secondly, it is all very well for others, with the benefit of hindsight, to say\n\nthat a pilot should not have done certain acts in response to certain situations. In any\n\ncase, even if the pilots had made an error of judgment, that alone would not justify\n\nlabelling them \"reckless\".22 From the wreckage photographs and studies by the Cranfield Impact\n\nCentre, Prof Howe estimated that the horizontal stabiliser trim might have been set at or\n\nfound at 3.05 units. He thought that, as there was a failure of the attachment of the ball\n\nscrew actuator to the horizontal stabiliser, the ball screw could have rotated before\n\nimpact, and even on impact. He agreed with Mr Job that the trim setting was unlikely to\n\nchange once the aircraft had hit the ground, but this was based on the assumption that\n\nthere was no failure of the attachment. Once again, the appellants had not shown, on a\n\nbalance of probabilities, that the pilots had set the horizontal stabiliser such that the\n\naircraft dived steeply, whether deliberately or recklessly.",
        "(1)(e) Whether any recovery attempts were made": "(i) Capt Laming’s view23 In simulator trials, Capt Laming found that standard recovery\n\nactions from steep dives were well within normal airline pilot skills. In his expert\n\nreport, he said that only deliberate setting of the stabiliser trim to the full forward\n\nposition and full engine power would force an aircraft into a dive as steep as that\n\nexperienced by Flight MI 185. He agreed that putting the engines at high thrust would lift\n\nthe plane, such that there would be tension between the downward position and the\n\npower-induced lift. However, he thought that, although it was more difficult to put the\n\naircraft into a dive with the engine power on, the aircraft would attain an uncontrollable\n\nspeed in less time than with the power off.",
        "(1)(f) Whether the CVR and / or the FDR had been intentionally disconnected": "25 The CVR records sounds in the cockpit. The CVR stopped recording at\n\n09:05:15.6. Data from the FDR was used to reconstruct the aircraft’s flight path. The\n\nlast recorded data recovered from the FDR was that at 09:11:27.4.",
        "(1)(g) Other possible \"causes\" of the crash": "29 The respondent raised some possible \"causes\" other than\n\nsuicide. The first was mechanical failure. The NTSC did not rule this out, as only 73\n\npercent of the aircraft was recovered. The second possible cause was rapid\n\ndepressurisation. While the NTSC thought this unlikely, the respondent’s experts did\n\nnot rule it out. They pointed out that: one, not all the oxygen generators were recovered,\n\nso the investigators could not say that none had been activated; and two, even if none had\n\nbeen activated, this may have been because there was no time to do so. The third possible\n\ncause was a false indication of depressurisation. The judge found that, on balance,\n\nmechanical failure, rapid depressurisation and a false indication of depressurisation had\n\nnot been proved to have caused the crash. As he stated, that finding demonstrated how\n\ndifficult it was to prove the cause conclusively. The discussion at  28 applies here\n\ntoo.",
        "The second issue: the human factors": "(2)(a) The NTSC and CID reports30 The judge considered the NTSC report, but declined to consider the\n\nCID report as the appellants’ counsel did not have the opportunity to cross-examine\n\nthe CID’s witnesses. With respect to the learned judge, as the appellants’\n\ncounsel had not cross-examined either the NTSC’s witnesses or the CID’s\n\nwitnesses on the human factors, the status of both reports should have been the same. The\n\nappellants said that those parts of the NTSC report relating to the human factors should\n\nnot have been considered for the same reason. If the appellants’ argument was taken\n\nto its logical conclusion, the NTSB report should not have been considered either, as the\n\nrespondent’s counsel had not cross-examined the makers of that report.",
        "(2)(b) Capt Tsu": "31 The NTSC and CID reports found that Capt Tsu had good relations with\n\nhis family. Although he had lost some money in the stock market, he had a net worth of\n\nmore than $580,000 at the time of the crash. He had several insurance policies, all but\n\none of which had been bought significantly prior to the crash. The commencement date of\n\nthe remaining policy was to be 19 December 1997, the day of the crash, but Capt Tsu did\n\nnot know this. His behaviour before the crash was normal.",
        "(i) The Manado incident": "32 The most controversial aspect of the human factors related to three\n\nincidents in Capt Tsu’s career. The first incident will be referred to as the\n\n\"Manado incident\". On 3 March 1997, Capt Tsu and First Officer Lawrence Dittmer\n\n(\"FO Dittmer\") flew from Singapore to Manado. FO Dittmer claimed that Capt Tsu\n\nhad executed a series of \"S-bends\" to attempt to bring the aircraft to the\n\ncorrect altitude for a normal landing.33 The incident was not as serious as the appellants made it out to be.\n\nFirst, for safety reasons, FO Dittmer had recommended landing on a runway different from\n\nthat allocated and Capt Tsu had agreed. It was because of this decision, and not because\n\nof Capt Tsu’s handling of the aircraft, that the aircraft was at too high an altitude\n\nfor a normal landing. This was not noted by the judge nor by the appellants. Secondly, FO\n\nDittmer could not give specific details about the speed or angle of the manoeuvres. This\n\nwas curious, given that he was the co-pilot. Thirdly, although Capt Tsu had failed to\n\nreport the incident, so had FO Dittmer. Both were disciplined for this. It should be\n\nnoted, however, that an Inquiry Panel found that the charge of mishandling the aircraft\n\nagainst Capt Tsu was not proven. Fourthly, no passengers had complained about the\n\nincident.",
        "(ii) The CVR incident": "34 The second incident will be referred to as the \"CVR\n\nincident\". On 24 June 1997, Capt Tsu and FO Dittmer flew from Singapore to Jakarta.\n\nThe pilots discussed the Manado incident before takeoff. Capt Tsu pulled out the circuit\n\nbreaker of the CVR to preserve the recording and wanted to move the aircraft back to the\n\ngate to have the recording downloaded. He later changed his mind and reset the CVR. The\n\nInquiry Panel found him guilty of deliberately disabling equipment essential for the\n\nproper conduct of the flight. Capt Tsu was reprimanded and removed as a Line Instructor\n\nPilot.35 This incident was not as serious as the appellants made it out to be\n\neither. First, the motivation behind Capt Tsu’s action was to preserve a conversation\n\nregarding the Manado incident, an inquiry into which was underway. This motivation was\n\nspecific and one-off. Secondly, Capt Tsu had checked the Minimum Equipment List before he\n\npulled out the circuit breaker, to ensure that the safety of the aircraft would not be\n\ncompromised by his action. Thirdly, Capt Tsu had informed FO Dittmer that he intended to\n\npull the circuit breaker before he did it. His action was open, not surreptitious.",
        "(iii) The Kunming incident": "36 The third incident will be referred to as the \"Kunming\n\nincident\". On 20 November 1997, Capt Tsu and an unnamed co-pilot were supposed to fly\n\nfrom Singapore to Kunming. On takeoff, an engine failed to achievetargetthrust\n\nand hence the pilots flew back to Singapore. Because the aircraft did not have fuel\n\ndumping capacity, it exceeded the maximum landing weight allowed at Changi Airport. Capt\n\nTsu failed to record the overweight landing and received a \"be more mindful\"\n\nletter from the respondent.37 Once again, the appellants overstated the seriousness of the\n\nincident. First, the appellants’ claim that the engine failed to achievesufficientthrust was not universally accepted: Capt Galan and Captain Ganapathy (the\n\nrespondent’s Chief Pilot) said that the engine thrust was above the minimum takeoff\n\nthrust, which meant that the thrust was sufficient. Secondly, Captain Anthony Leong (the\n\nrespondent’s Deputy Chief Pilot) and even Capt Baston agreed that Capt Tsu was faced\n\nwith judgment calls which had to be taken very quickly, for example: whether to apply full\n\nthrust and risk harsh braking should the takeoff be rejected, or to take off with lower\n\nthrust; whether to stay airborne to achieve acceptable landing weight, or land while\n\noverweight. Thirdly, Capt Tsu’s failure to record the overweight landing was an\n\nadministrative breach and did not jeopardise the safety of the aircraft.38 The NTSC and CID reports found that Capt Tsu was not unduly upset by\n\nthese incidents and their consequences. Furthermore, the appellants could not say that the\n\nrespondent had wilfully omitted to discipline Capt Tsu or that it was wrong to have\n\nallowed him to assume command of Flight MI 185. The respondent had conducted inquiries\n\ninto all the incidents and disciplined the pilots involved according to the gravity of\n\ntheir breaches.",
        "(2)(c) FO Ward": "39 The NTSC and CID reports found that FO Ward had good relations with\n\nhis family and friends. He had no financial problems and had rather significant savings\n\nfor his age. He had an insurance policy, which had been bought many years ago. He did not\n\nhave any disciplinary or other career problems. His behaviour before the crash was normal.",
        "Limitation of liability": "40 Article 17 Para 1 of the respondent’s General Conditions of\n\nCarriage for Passengers and Baggage provides:Carriage hereunder is subject to the rules and limitations relating to\n\n  liability established by the Convention unless such carriage is not international carriage\n\n  to which the Convention applies. In international carriage as defined by the Warsaw\n\n  Convention the liability of the Carrier for each passenger is limited to the sum of\n\n  125,000 French gold francs or its equivalent (US equivalent approximately $10,000); and in\n\n  international carriage as defined by the Warsaw Convention as amended at The Hague, 1955,\n\n  the liability of the Carrier is limited to 250,000 French gold francs or its equivalent\n\n  (US equivalent approximately $20,000).Article 1(2) of both Conventions defines \"international\n\ncarriage\" as:any carriage in which, according to the agreement between the parties,\n\n  the place of departure and the place of destination… are situatedeither\n\n  within the territories of two High Contracting Parties or within the territory of a single\n\n  High Contracting Party if there is an agreed stopping place within the territory of\n\n  another State, even if that state is not a High Contracting Party…41 Singapore is a High Contracting Party to both Conventions, but\n\nIndonesia is a High Contracting Party only to the Warsaw Convention. Hence the carriage of\n\nthose passengers who bought single trip tickets to Singapore was governed by the Warsaw\n\nConvention, and the carriage of those passengers who bought return tickets to and from\n\nSingapore was governed by the Warsaw (Hague) Convention.",
        "The third issue: limitation of liability under the Warsaw Convention": "42 Article 22(1) provides:(1) In the carriage of passengers the liability of the carrier for each\n\n  passenger is limited to the sum of 125,000 francs… Nevertheless, by special contract,\n\n  the carrier and the passenger may agree to a higher limit of liability.Article 25 provides:(1) The carrier shall not be entitled to avail himself of the\n\n  provisions of this Convention which exclude or limit his liability,if the damage is\n\n  caused by his wilful misconductor by such default on his part as, in accordance with\n\n  the law of the court seised of the case, is considered to be equivalent to wilful\n\n  misconduct.(2) Similarly the carrier shall not be entitled to avail himself of the\n\n  said provisions, if the damage is caused as aforesaid by any servant or agent of the\n\n  carrier acting within the scope of his employment. (emphasis added)43 The English text speaks of \"wilful misconduct\" or\n\n\"such default… as… is considered to be equivalent to wilful\n\nmisconduct\". The French text uses \"dol\" or \"une faute\n\nqui… est considr comme quivalente au dol\". It should be noted that, in\n\nEngland, only the English translation of the Warsaw Convention text was given effect to by\n\nthe Carriage by Air Act 1932 (now repealed). In contrast, s 3(2) of the Singapore Carriage\n\nby Air Act provides that the French text of the Warsaw Convention shall prevail. Singapore\n\nis thus in a rather strange situation with regards to the Warsaw Convention, because its\n\ncourts generally follow English case law but, unlike the English courts, they regard the\n\nFrench text of the Warsaw Convention as paramount.",
        "(a) \"Wilful misconduct\"": "44 There are a number of definitions, but one of the most-cited is\n\nfound inHorabin v British Overseas Airways Corporation[1952] 2 QBD 1016:To be guilty of wilful misconduct the person concerned must appreciate\n\n  that he is acting wrongfully, or is wrongfully omitting to act, and yet persists in so\n\n  acting or omitting to act regardless of the consequences, or acts or omits to act with\n\n  reckless indifference as to what the results may be.It is not easy to apply the myriad formulations, which are often slight\n\nvariations on one another. One of the most useful, practical, tests is that enunciated inThomas\n\nCook Group Ltd & Ors v Air Malta Co Ltd[1997] 2 Lloyds Rep 399:1 The starting point when considering whether.. the acts or omissions\n\n  of a person entrusted with goods of another amounted to wilful misconduct isan enquiry\n\n  about the conduct ordinarily to be expected in the particular circumstances.2 The next step is to askwhether the acts or omissions of the\n\n  defendant were so far outside the range of such conduct as to be properly regarded as\n\n  \"misconduct\"…3 It was next necessary to considerwhether the misconduct was\n\n  wilful.4 …Wilful misconduct is far beyond negligence, even gross\n\n  or culpable negligence.5 … A person wilfully misconducts himselfif he knows…\n\n  that it is misconducton his part in the circumstances to do or to fail or omit to do\n\n  somethingand yet:(a)intentionallydoes or fails or omits to do it or(b)persistsin the act, failure or omissionregardless of\n\n    the consequencesor(c)acts with reckless carelessness, not caring what the results\n\n    of his carelessness may be. (A person acts with reckless carelessness if,aware of a\n\n    riskthat goods in his care may be lost or damaged,he deliberatelygoes ahead\n\n    andtakes the risk, when it is unreasonable in all the circumstances for him to do so.)6 The final step is to considerwhether the wilful misconduct…caused the lossof or damage to the goods. (emphasis added)",
        "(b) \"Within the scope of his employment\"": "45 According toCarriage by Air (2001)by Fountain Court\n\nChambers at  10.77, the English courts have applied the ordinary case law meaning of\n\nthis phrase. The authors cite a test inSalmond & Heuston on the Law of Torts (21\n\ned):… an act is done in the scope… of employment if it is either(1) a wrongful act authorised by the master, or(2) a wrongful and unauthorised mode of doing some act authorised by\n\n  the master.The respondent correctly pointed out that suicide, murder and dangerous\n\nstunts would not fall within the scope of employment. No carrier authorises such acts. In\n\nany such circumstance, the pilot would be on a frolic of his own. It would not be an act\n\ncommitted in furtherance of the carrier’s business.",
        "(c) Application to the facts": "46 The question of whether the pilots were guilty of wilful misconduct\n\nis very difficult to answer, simply because of the limited facts available. We could not\n\nanswer the first two questions inThomas Cook– what conduct was expected in\n\nthe circumstances and whether the pilots’ conduct fell outside the expected range\n\n– because we do not know what those circumstances were. The experts discussed the\n\npossible \"causes\" of the crash, but at the end of the day, it was still\n\nanyone’s guess what the actual \"cause\" was.47 The third question – assuming misconduct was established,\n\nwhether it was wilful – can only be partly answered (see  48). The fourth question\n\nwas whether negligence did not amount to wilful misconduct. This is most pertinent to the\n\ncase of an attempted recovery. We do not know what happened: did the pilots not even\n\nattempt to recover the plane from its dive; did they so attempt but fail because they were\n\nreckless; or did they so attempt but fail because they were negligent or careless? If the\n\nlast-postulated situation is true, the pilots were not guilty of wilful misconduct.48 The fifth question will be dealt with next. As for the first part,\n\nbecause we can not answer the first two questions, we do not know whether the pilots would\n\nsubjectively have known whether their acts or omissions amounted to misconduct. As for the\n\nsecond part, the appellants have not shown that the pilots intentionally did the act or\n\nomitted to do an act (this is also implied by the concept ofdol). First, the\n\ncorrected radar data and tests did not establish that the trajectory of the aircraft was\n\nvery steep. Secondly, the condition of the horizontal stabiliser did not lead one to\n\nconclude that the aircraft had been manually programmed to dive as steeply as it could.\n\nThirdly, the appellants could not show that the CVR and FDR had been intentionally\n\ndisconnected. Neither can we judge whether the pilots had persisted regardless of the\n\nconsequences or acted with reckless carelessness. We do not even know the situation which\n\nthe pilots faced, hence it is very difficult for us to appreciate the decision they had to\n\nmake, and the risks appurtenant to each choice.49 The answer to the seemingly simple sixth question – whether the\n\npilots’ acts or omissions caused the crash – also cannot be adequately given.\n\nFirstly, we cannot ascertain what the cockpit inputs were. Secondly, because we do not\n\nknow the circumstances prevailing at that time, we cannot know whether there was something\n\nwhich the pilots should have done but omitted to do.The fourth issue: limitation of liability under the Warsaw (Hague) Convention50 Article 22(1) provides:(1) In the carriage of persons the liability of the carrier for each\n\n  passenger is limited to the sum of 250,000 francs… Nevertheless, by special contract,\n\n  the carrier and the passenger may agree to a higher limit of liability.Article 25 provides:The limits of liability specified in Article 22 shall not applyif\n\n  it is proved that the damage resulted from an act or omission of the carrier, his servantsor agents,donewith intent to cause damage or recklessly and with knowledge\n\n  that damage would probably result; provided that, in the case of such act or omission\n\n  of a servant or agent, it is also proved that he was acting within the scope of his\n\n  employment. (emphasis added)51 The first thing which should be noted is the narrowness of a 25. The\n\nAustralian Court of Appeal said inSS Pharmaceutical Co Ltd & Anor v Qantas Airways\n\nLtd[1991] 1 Lloyds Rep 288:… art. 25 … suggests a rigorous standard in order to qualify\n\n  for full recovery from the air carrier. One of two criteria established is intentional\n\n  damage. That will be rare indeed, particularly in flight, where the lives of many crew and\n\n  passengers are inevitably at stake. Thatextreme exceptiongives a clue, without\n\n  more, to the high stringency involved also in the alternative ground of exception… So\n\n  too does the context. Forthis is an exception from a compensation regime which is\n\n  obviously meant to be one of general application… a study of the minutes of theWorking\n\n  Group which developed that [Hague] Protocolshows conclusively thatits purpose was\n\n  to limit even more rigorously the circumstances of escape from the general regime of\n\n  limited entitlement, when compared tothe already strict regime which had obtained\n\n  underthe Warsaw Conventionitself. (emphasis added)The point that the compensation regime provided for in a 22 was meant\n\nto be the rule rather than the exception was reinforced by the UK delegation to the Hague\n\nconference (quoted inSingapore Airlines Ltd & Anor v Fujitsu Microelectronics\n\n(Malaysia) Sdn Bhd & Ors[2001] 1 SLR 241):The UK agrees with the view that,as a reasonable limit is set to\n\n  the operator’s liability in return for giving the claimant a right to secure\n\n  compensation without the burden of proof of negligence, the Convention should limit\n\n  very narrowly indeed, that is to those where there is an element of criminal intent, the\n\n  cases where liability is unlimited. (emphasis added)It should be noted that the maximum liability for each passenger as\n\nprovided for in the Warsaw (Hague) Convention is double that in the Warsaw Convention.52 What are the elements of liability under a 25? The court inGoldman\n\nv Thai Airways International Ltd[1983] 3 All ER 693 said:… the article requires the plaintiff to prove the following:(1) that the damage resulted from an act or omission;(2) that it was done with intent to cause damage, or(3) that it was done when the doer was aware that damage would probably\n\n    result, but he did so regardless of that probability;(4) that the damage complained of is the kind of damage known to be the\n\n    probable result.The meaning of \"within the scope of his employment\" has been\n\ndiscussed at  45.",
        "a \"Recklessly and with knowledge that damage would probably result\"": "53 Element (3) requires some clarification. InSS Pharmaceutical Co\n\nLtd, the clause was said to involve \"one composite concept\". It is hence\n\nwrong to attempt to construe \"reckless\" in isolation and to ask whether it\n\nshould be given an objective or subjective meaning:Goldman.54 It is however possible to attribute an objective or subjective\n\nmeaning to \"knowledge\". Courts in common law and most other jurisdictions agree\n\nthat the knowledge must be subjective:Air Law (4 ed)by Shawcross & Beaumont\n\nVol 1 atVII (447);Carriage by Air (2001)byFountain Court\n\nChambersat10.72. InNugent and Killick v Michael Goss Aviation Ltd\n\n& Ors[2000] 2 Lloyds’ Rep 222, Dyson J classified the relevant\n\n\"knowledge\" as follows:a Actual conscious knowledge: \"actual knowledge in the mind of the\n\n  pilot at the moment at which the omission occurs\".b Background knowledge: \"knowledge which would be present to the\n\n  mind of a person if he… thought about it\".c Imputed knowledge: \"knowledge which a person ought to have but\n\n  does not in fact have\".Dyson J held that only actual conscious knowledge would suffice for a\n\n25 because it is difficult to draw the line between such knowledge and the knowledge in\n\ncategories (b) and (c) above. With regards to background knowledge, he said:If a person fails to apply his mind to a fact because he has\n\n  temporarily forgotten it, he has no more and no less actual knowledge of that fact at the\n\n  time of his act or omission than a person who fails to apply his mind to it because he has\n\n  been temporarily distracted.With regards to imputed knowledge, he said:It is not sufficient to show that, by reason of his training and\n\n  experience, the pilot ought to have known that damage would probably result from his act\n\n  or omission.Auld LJ agreed that background knowledge did not fall within a 25, but\n\nPill LJ dissented on that point.55 As for \"probable\", the court inGoldmansaid that\n\nit means \"something is likely to happen… In other words, one anticipates damage\n\nfrom the act or omission\".",
        "b Application to the facts": "56 As was the case with the Warsaw Convention, large gaps in the\n\ninformation render insoluble the issue of whether the pilots intended to cause the crash\n\nor were reckless and knew that damage would result. The second requirement – intent\n\nto cause damage or recklessness with knowledge that damage would result – will be\n\ndiscussed first. As discussed at  48, the evidence did not support a conclusion that the\n\npilots intended to cause the crash. If intent could not be proved, could recklessness with\n\nknowledge of damage be shown? The court inGoldmansaid:One cannot… decide whether or not an act or omission is done\n\n  recklessly without considering the nature of the risk involved.In that case, the court knew what the risk was: the risk of injury\n\nshould the passengers not be told to fasten their seatbelts during turbulence. This was\n\nnot so here. The discussion at  48 also applies here. It is also impossible for a court\n\nto ascertain whether the pilots had actual conscious knowledge of the risks, as these\n\nrisks are unknown.57 As for the first requirement, one cannot say – even on a\n\nbalance of probabilities – that cockpit input had caused the crash and the lives of\n\nall on board. As for the third requirement, it is clear that such a consequence would have\n\nbeen envisaged by a pilot who either intended to cause a crash or who took the risk that\n\nhis acts or omissions would cause the aircraft to leave its normal flight envelope.\n\nHowever, it is not clear that Capt Tsu and FO Ward intended to crash or to take that risk,\n\nand hence that they had envisaged that consequence.",
        "The fifth issue: the burden of proof": "(a) Burden and standard of proof58 The appellants were mistaken when they stated that there is a\n\n\"higher burden of proof in a civil case where there are allegations of\n\nmisconduct\". Theburdenof proof was on the appellants. At the risk of stating\n\nthe obvious, we citeMurphy on Evidence (7 ed)byPeter Murphyat  4.1.5:If the claimant bears the burden of proof, and fails to persuade the\n\n  court that his case has been proved on the balance of probabilities, judgment should be\n\n  given for the defendant. Moreover, the test is not whether the claimant’s case is\n\n  more probable than the defendant’s, but whether the claimant’s case is more\n\n  probably true than not true. (emphasis added)At various junctures, the appellants seemed to have forgotten that\n\ntheir task was to prove their own case on a balance of probabilities, not to show that\n\ntheir explanations were more probable than the respondent’s.59 Thestandardof proof is on a balance of probabilities, but a\n\nhigher degree of probability is required in respect of particularly serious allegations:Carriage\n\nby Air(2001) by Fountain Court Chambers at10.82. The appellants said it\n\nwas unclear whether the judge had required a higher degree of probability, and that, in\n\nany case, he was wrong in requiring the appellants to show that the pilots had intended to\n\ncommit suicide. They cited Dyson J inNugent and Killick, who said it was not\n\nnecessary to prove suicidal intent and that \"reckless manoeuvres in the sky by\n\nnon-suicidal pilots\", though extremely rare, would suffice for a 25 of the Warsaw\n\n(Hague) Convention. The first point to note is that the appellants could not allege that\n\nthe pilotsintendedto cause the crash without also alleging that the pilots also\n\nintended to commit suicide; this was recognised by the judge. The second point is that the\n\njudge not only considered the presence of suicidal intent, but also considered whether the\n\npilots wererecklessso as to come within either or both Conventions. Hence the\n\nappellants’ contentions on this point are without merit.",
        "(b) Drawing inferences": "60 The appellants urged the court to draw the inference that pilot\n\naction probably caused the aircraft to depart from its cruising altitude and then crash,without\n\nhaving to make a finding on why the aircraft departed from its normal flight envelope.\n\nLord Wright said inCaswell v Powell Duffryn Associated Collieries Ltd[1940] AC\n\n152:… the precise manner in which the accident occurred cannot be\n\n  ascertained as the unfortunate young man was alone when he was killed. The court therefore\n\n  is left to inference or circumstantial evidence…There can be no inference unless\n\n  there are objective facts from which to infer the other facts which it is sought to\n\n  establish... But if there are no positive proved facts from which the inference can be\n\n  made, the method of inference fails and what is left is mere speculation or conjecture. (emphasis\n\n  added)61 The appellants submitted that the following were \"positive\n\nfacts\" which supported the inferences they urged on the court. Our comments are in\n\nitalics.a The aircraft went into a steep descent following deliberate acts\n\n  (depressing the stabiliser trim settings for at least eight seconds, pushing the throttles\n\n  to maximum thrust and not deploying the speed brakes):it was not proved that the\n\n  descent was steep because the accuracy of the corrected radar data was called into\n\n  question. It was certainly not shown that the pilots committed these acts. Neither was it\n\n  shown that the descent was caused by these acts, if they were indeed committed.b These acts were inconsistent with any emergency descent\n\n  procedure:this was not a fact either, as the experts were divided on whether the act\n\n  of pushing the throttles to maximum thrust (if really committed) would cause the aircraft\n\n  to lift or to dive.In any case, the pilot(s) were trained to execute emergency\n\n  descent procedures.See  54 on background knowledge.c The relatively small impact area was consistent with the\n\n  appellants’ case that the aircraft was driven to the ground:it was true that the\n\n  impact area was relatively small, but it was not a fact that this was consistent with the\n\n  appellants’ interpretation. The appellants could not pass off what they sought to\n\n  prove as a fact.d The judge did not find that any mechanical failure occurred:while\n\n  the judge did not make a positive finding of mechanical failure, he refused to rule it out\n\n  as a possible cause.The appellants could point to very few \"positive proved\n\nfacts\". Moreover, we find it difficult to draw the inferences which the appellants\n\nurged us to draw, especially because their arguments were not clearly preferable to the\n\nrespondent’s.",
        "(c) Res ipsa loquitur": "62 The appellants sought to rely onres ipsa loquiturto fill in\n\nthe gaps in their case, but this is not allowed. The maxim was explained inLloyde v\n\nWest Midlands Gas Board[1971] 2 All ER 1240:It means that a plaintiff prima facie establishes negligence where: (i)\n\n  it is not possible for him to prove precisely what was the relevant at or omission which\n\n  set in train the events leading to the accident; but (ii) on the evidence as it stands at\n\n  the relevant time it is more like than not that the effective cause of the accident wassomeact or omission of the defendant or of someone for whom the defendant is responsible,\n\n  which act or omissions constitutes a failure to take proper care for the plaintiff’s\n\n  safety.As the maxim only allows the plaintiff to establish negligence, it\n\ncannot be used to establish intent or recklessness under the Warsaw (Hague) Convention:Air Law (4 ed)byShawcross & Beaumont Vol 1 atVII (69).\n\nSimilarly, the American court inJohnson v American Airlines20 Avi 18,248 refused\n\nto apply the maxim to the Warsaw Convention:The doctrine ofres ipsa loquiturprovides a means of\n\n  establishing negligence from certain facts… We refuse… to extend the doctrine to\n\n  prove an intentional tort.",
        "(d) Conclusion on the burden of proof": "63 Lord Brandon said inThe Popi M[1985] 2 All ER 712, which\n\nconcerned a lost ship:… it is always open to a court, even after the kind of prolonged\n\n  inquiry with a mass of expert evidence… to conclude… that the proximate cause of\n\n  the ship’s loss, even on a balance of probabilities, remains in doubt, with the\n\n  consequence that the shipowners have failed to discharge the burden of proof which lay on\n\n  them.He later said:No judge likes to decide cases on burden of proof if he can\n\n  legitimately avoid having to do so. There are cases, however, in which, owing to the\n\n  unsatisfactory state of the evidence or otherwise, deciding on the burden of proof is the\n\n  only just course for him to take.It is understandable if relatives and friends of the deceased are\n\nfrustrated that lengthy investigations and a full-blown trial have yielded no conclusive\n\ncause. But a court of law cannot ignore the relevant substantive law and the rules of\n\nevidence in order to offer what may be a false sense of closure.",
        "Costs": "(a) Offer to settle64 The respondent had offered to compensate the appellants S$332,000\n\nfor each deceased passenger under O. 22A of the Rules of Court, but the appellants\n\nrejected the offer. Order 22A r 9(3) provides:(3) Where an offer to settle made by a defendant –(a) is not withdrawn and has not expired before the disposal of the\n\n  claim in respect of which the offer to settle is made; and(b) is not accepted by the plaintiff, and the plaintiff obtains\n\n  judgment not more favourable than the terms of the offer to settle,the plaintiff is entitled to costs on the standard basis to the date\n\n  the offer was served and the defendant is entitled to costs on the indemnity basis from\n\n  that date, unless the Court orders otherwise.As the judge had held that the respondent was entitled to limit its\n\nliability (the limits being US$10,000 and US$20,000 per deceased passenger under the\n\nWarsaw and Warsaw (Hague) Conventions respectively), the appellants had failed to obtain a\n\njudgment more favourable than the terms of the offer. Hence we order costs to be awarded\n\nas provided in r 9(3).",
        "(b) Costs of more than one solicitor": "65 The respondent asked the court to certify costs for more than one\n\nsolicitor under Order 59 r 19 of the Rules of Court:19. –(1) Costs for getting up the case by and for attendance in\n\n  Court of more than one solicitor for a party shall not be allowed unless the Court at the\n\n  hearing or within 7 days thereof so certifies.(2) Such costs may be allowed notwithstanding that the solicitors are\n\n  members of the same firm of solicitors.We find the request justified. We certify costs for two solicitors for\n\nboth parties.",
        "Conclusion": "66 The only plank in the appellants’ case was the NTSB report and\n\nits sheer vehemence. On a number of previous occasions, the NTSB has been wrong in its\n\nassessments of aircraft accidents. We do not think they are yet the last word in aviation\n\naccident investigation. The judge also noted that the appellants’ position in these\n\nproceedings was inconsistent with the stand of the plaintiffs (who may include the\n\nappellants) in the US proceedings. In Singapore, the appellants alleged that pilot action\n\ncaused the crash; in the US, the appellants claimed that mechanical failure caused the\n\ncrash. It would be strange if the courts of both countries, urged by the plaintiffs in\n\nboth suits, came to diametrically opposed conclusions.67 In our judgment the respondent is entitled to limit its liability\n\nunder the Conventions. Accordingly we dismiss the appeal with indemnity costs and order\n\nthat the security deposit together with accrued interest be released to the respondent or\n\nits solicitors.Sgd:YONG PUNG HOWCHEIF JUSTICESgd:CHAO HICK TINJUDGE OF APPEALSgd:JUDITH PRAKASHJUDGECopyright © Government of Singapore."
    }
}