{
    "case_title": "Denko-HLB Sdn Bhd v Fagerdala Singapore Pte Ltd",
    "ncitation": "[2002] SGCA 30",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J; \n      Yong Pung How CJ",
    "sections": {
        "Civil Procedure": "– Failure of the appellants to apply to judge\n\nfor further arguments within seven days of interlocutory order in chambers – Motion\n\nbrought to Court of Appeal for an extension of time to request for further arguments\n\n– Whether an extension should be granted – Whether Court of Appeal has\n\njurisdiction to grant the extension of time – Supreme Court of Judicature Act (Cap\n\n322) s 34(1)(c)",
        "Facts": "This was a motion by Denko-HLB Sdn Bhd (‘Denko’) to the Court\n\nof Appeal in respect of two matters: (i) an extension of the time prescribed by s 34(1)(c)\n\nof the Supreme Court of Judicature Act (‘SCJA’) to apply for further arguments\n\nto the judge in chambers in relation to an interlocutory order made by that judge; and\n\n(ii) an extension of time to file and serve a notice of appeal against the interlocutory\n\norder.Denko was the defendant in an action brought by\n\nFagerdala Singapore Pte Ltd (‘Fagerdala’) for money due on goods sold. Denko\n\napplied to have the action stayed on the ground offorum non conveniens. The Senior\n\nAssistant Registrar (‘SAR’) ordered a stay. On 19 February 2002, Lai Siu Chiu J,\n\nsitting in chambers, allowed the appeal and reversed the order of the SAR. The decision of\n\n19 February 2002 was an interlocutory order and under s 34(1)(c), if Denko wished to\n\nappeal, it must first apply for further arguments to the judge within seven days of the\n\norder. Under O 56 r 2 of the Rules of Court, the party can only file his notice of appeal\n\nif the judge certified that he did not wish to hear further arguments or if the judge\n\nfailed to notify the party of his intention within 14 days and is thereby deemed not to\n\nrequire further arguments.On 12 March 2002, Denko’s solicitor applied for\n\nfurther arguments and on 19 March 2002, Denko filed the notice of appeal. The Registrar of\n\nthe Supreme Court notified Denko the next day that their request for further arguments was\n\nout of time and that the notice of appeal was therefore not valid. Denko thus applied to\n\nthe Court of Appeal for an extension of time to request for further arguments. Fagerdala\n\ncontended,inter alia, that the Court of Appeal had no jurisdiction to grant an\n\nextension of time to enable Denko to request the judge in chambers to hear further\n\narguments, as no such jurisdiction or power was conferred upon it by either s 34(1)(c) or\n\nany other provisions in the SCJA, or any other written law. By virtue of s 18 and\n\nparagraph of the First Schedule to the SCJA, the High Court is given the power to enlarge\n\nor abridge time prescribed by any written law for doing an action or taking any\n\nproceeding, and the Court of Appeal has all the powers and duties of the High Court by\n\nvirtue of s 37(2) of the SCJA. However, for s 37(2) to operate, there must first be a\n\npending appeal before the Court of Appeal and there was none here.",
        "Held": ", dismissing the motion:(1) The Court of Appeal inThe Tokai Maru[1998] 3 SLR 105had\n\ndrawn a distinction between an application for an extension of time to file a notice of\n\nappeal and an application to extend time in relation to other matters and had ruled that a\n\nless stringent approach should be adopted in relation to the latter kind of application.\n\nDenko’s application was more akin to an application for an extension of time to file\n\nan appeal, given that the objective of Denko’s application was to enable it to appeal\n\nagainst the order on 19 February 2002. Therefore, a stricter approach should be followed\n\nin determining whether an extension of time should be granted to Denko (see ¶ 9 and 10).(2) There are four factors to consider in determining whether an\n\nextension of time should be granted to file or serve a notice of appeal: the length of the\n\ndelay, the reason for the delay, the merits of the appeal and the question of the degree\n\nof prejudice (see ¶ 11) .(3) The delay was for some 14 days. Considering that the period allowed\n\nby s 34(1)(c) to apply for further arguments is only 7 days, a delay of 14 days cannot be\n\nsaid to be relatively short. As for the second factor, Denko, other than stating that it\n\nwas simply an \"oversight\" on the part of the solicitors, did not offer any other\n\nexplanation with regard to the oversight. In respect of the merits in the application for\n\na stay on the ground offorum non conveniens, the application was not\n\n\"hopeless\", since Denko’s application for a stay had succeeded before the\n\nSAR before it was reversed by Lai Siu Chiu J on appeal. Fagerdala had not shown any real\n\nprejudice which could not be compensated by costs, e.g., changed position pursuant to\n\ninterlocutory order (see ¶ 12 – 17).(4) The greatest obstacle in the way of Denko’s application was in\n\nrelation to the first two factors. Not only was the length of the delay quite substantial,\n\nthere were no extenuating circumstances offered for the \"oversight\" of the\n\nsolicitor. Some explanation should have been offered to mitigate or excuse the oversight.\n\nIf, in every case, \"oversight\" is per se a satisfactory ground, there will be a\n\nrisk of turning the rules prescribing time into dead letters. It would be all too simple\n\nfor a party to run to a judge to ask for indulgence because of oversight (see ¶ 18).(5) As for the jurisdictional point, the reference to s 37(2) was\n\nerroneous. The more appropriate provision is s 29A(3)(a) of the SCJA. By virtue of s 18(2)\n\nread with paragraph 7 of the First Schedule to the SCJA, the judge making the\n\ninterlocutory order could have the power to grant an extension of time to enable Denko to\n\napply for further arguments out of time. The Court of Appeal would have the powers which\n\nare conferred upon the High Court, at the hearing of the appeal or at the hearing of a\n\nmatter incidental to the appeal: s 29A(3)(a). However, Denko’s application for an\n\nextension of time to apply for further arguments cannot be considered to be the\n\n\"hearing of\" an appeal or a matter incidental to the hearing of an appeal, as\n\nthere was, as yet, no appeal (see ¶ 24 – 28).(6) The Court of Appeal does not have an original jurisdiction to\n\nentertain an application to extend time prescribed in s 34(1)(c). If Parliament had\n\nintended that the Court of Appeal should have a separate power to extend time prescribed\n\nin s 34(1)(c), it would have so provided as it did in relation to the criminal\n\njurisdiction of that Court: see ss 47(5) and 50 of the SCJA. In the present case, Denko\n\nshould have taken the following approach: it should have applied to the judge to extend\n\ntime for it to make the request for further arguments and if the extension application is\n\nrefused by the judge, it can then appeal to the Court of Appeal (see ¶ 29 – 32).",
        "Cases referred to": "Aberdeen Asset Management Asia Ltd v Fraser & Neave Ltd[2001] 4 SLR 441(refd)Gatti v Shoosmith[1939] 3 All ER 916 (refd)Nomura Regionalisation Venture Fund Ltd v Ethical Investments Ltd[2000] 4 SLR 46(refd)Palata Investments Ltd v Burt & Sinfield Ltd[1985] 2 All ER 517 (refd)Pearson v Chen Chien Wen Edwin[1991] 1 SLR 212 (refd)Seabridge Transport Pte Ltd v Olivine Electronics Pte Ltd[1995] 3 SLR 545(refd)Singapore Press Holdings v Brown Noel Trading[1994] 3 SLR 151(refd)Tan Chiang Brother’s Marble (S) Pte Ltd v Permasteelista Pacific Holdings Ltd[2002] 2 SLR 225(refd)The Tokai Maru[1998] 3 SLR 105(folld)Thomson Plaza Pte ltd v The Liquidators of Yaohan Department Store Pte Ltd[2001] 3 SLR 248(refd)Legislation referred toRules of Court O 3 r 4, O 56 r 2, O 57 r 17Supreme Court of Judicature Act (Cap 15, 1970 Edition) s 34(2)Supreme Court of Judicature Act (Cap 322) ss 18(2), 29A(1), 29A(3), 34(1)(c), 37(2),\n\n47(5), 50, para 7 of First Schedule[Delivered by Chao Hick Tin JA]Judgment:GROUNDS OF DECISION1   This was a motion by Denko-HLB Sdn\n\nBhd (Denko), seeking the indulgence of the Court of Appeal in respect of two matters\n\n–(i) an extension of the time prescribed\n\n  in s 34(1)(c) of the Supreme Court of Judicature Act (SCJA) for a request to be made for\n\n  further arguments to the judge in chambers in relation to an interlocutory order made by\n\n  that judge.(ii) an extension of time to file and\n\n  serve a notice of appeal against the said interlocutory order.2    We heard the motion on 21 May 2002\n\nand dismissed it. We now give our reasons as some points of practical significance were in\n\nissue.",
        "The Facts": "3    Denko was the defendant in an\n\naction, Suit No. 1241/2001, brought by Fagerdala Singapore Pte Ltd (Fagerdala) for money\n\ndue on goods sold. Denko applied to have the action stayed on the ground offorum non\n\nconveniens. The Senior Assistant Registrar (SAR) granted the application and ordered a\n\nstay. Fagerdala appealed against that order to the High Court. On 19 February 2002, Lai\n\nSiu Chiu J, sitting in chambers, allowed the appeal and reversed the order of the SAR. The\n\neffect of this decision was that there would be no stay of proceedings.4    It was not in dispute that the\n\ndecision of 19 February 2002 was an interlocutory order and that under s 34(1)(c), if\n\nDenko wished to appeal, it must first apply for further arguments to the judge within\n\nseven days of the order. Pursuant to O 56 r 2, if the judge certified that he did not wish\n\nto hear further arguments, or if he failed to notify the party of his intention within 14\n\ndays, he would be deemed not to require further arguments and the party could proceed to\n\nfile his notice of appeal. But if the judge should certify that he wished to hear further\n\narguments then the order already made would be suspended and the judge at the further\n\nhearing could make such order as he thought fit: seeSingapore Press Holdings v Brown\n\nNoel Trading[1994] 3 SLR 151andThomson Plaza Pte Ltd v The Liquidators of Yaohan\n\nDepartment Store Pte Ltd[2001] 3 SLR 248.5    In the present case, the solicitor\n\nfor Denko overlooked the requirement of s 34(1)(c) and did not apply for further arguments\n\nwithin the prescribed time. On 11 March 2002 his client instructed him to appeal and only\n\nthen did he realise that he had failed to comply with s 34(1)(c). So on 12 March 2002,\n\nDenko’s solicitor applied for further arguments. Fagerdala objected to the\n\napplication by way of a letter dated 14 March 2002. On 19 March 2002, Denko filed the\n\nnotice of appeal. The next day, the Registrar of the Supreme Court notified Denko that\n\ntheir request for further arguments was out of time and not valid and that the notice of\n\nappeal filed by Denko the day before was also not valid.6    These were the factual matrix upon\n\nwhich Denko moved the court for the two reliefs prayed for.7    Finally, we should add that in the\n\nparties’ submissions before us, besides seeking to persuade us to grant, or to refuse\n\nto grant, an extension of time, in terms of the motion, Fagerdala had also raised a\n\njurisdictional point. However, we think it would be more expedient if we first deal with\n\nthe substantive application in the motion.",
        "Extension of time": "8    This Court has in numerous cases in\n\nthe past set out the factors which should guide the court in determining whether to grant\n\nan extension of time to enable a party to file and/or to serve a notice of appeal out of\n\ntime: e.g.,Pearson v Chen Chien Wen Edwin[1991] 1 SLR 212;Nomura\n\nRegionalisation Venture Fund Ltd v Ethical Investments Ltd[2000] 4 SLR 46;Aberdeen\n\nAsset Management Asia Ltd v Fraser & Neave Ltd[2001] 4 SLR 441. Obviously, this\n\napplication by Denko was not strictly an application to extend time to file and serve a\n\nnotice of appeal. It was in relation to a step that was needed to be taken before an\n\nappeal could be lodged. So the question is: should the factors which are applicable to an\n\nextension of time to file and/or serve a notice of appeal also apply here?9    In this regard, the decision of this\n\nCourt inThe Tokai Maru[1998] 3 SLR 105is germane. The dispute there concerned\n\nlate filing of affidavits of evidence-in-chief. The appellants applied to obtain\n\nretrospective extension of time for the late filing. The judge below held that as there\n\nwas no material before the court which satisfactorily explained the delay, he refused to\n\ngive any extension and instead granted the respondent’s application to have the\n\nappellants’ defence struck out. On appeal, this Court ruled that a distinction should\n\nbe drawn between an application for an extension of time to file a notice of appeal and an\n\napplication to extend time in relation to other matters and that a less stringent approach\n\nshould be adopted in relation to the latter kind of application. The Court declared the\n\napplicable principles to be as follows (at 113-4):-\"The rules of civil procedure guide\n\n  the courts and litigants towards the just resolution of the case and should of course be\n\n  adhered to. Nonetheless, a litigant should not be deprived of his opportunity to dispute\n\n  the plaintiff’s claim and have a determination of the issues on the merits as a\n\n  punishment for a breach of these rules unless the other party has been made to suffer\n\n  prejudice which cannot be compensated for by an appropriate order as to costs.Save in special cases or exceptional\n\n  circumstances, it can rarely be appropriate then, on an overall assessment of what justice\n\n  requires, to deny a defendant an extension of time where the denial would have the effect\n\n  of depriving him of his defence because of a procedural default which, even if\n\n  unjustified, has caused the plaintiff no prejudice for which he cannot be compensated by\n\n  an award of costs.\"10    While Denko’s application was\n\nnot an application for an extension of time to file a notice of appeal, neither was it an\n\napplication to extend time in relation to a matter of the nature as inThe Tokai Maru.But\n\nthe objective of Denko’s application was to enable Denko to appeal against the order\n\nmade on 19 February 2002. It would appear that there is no previous case which addressed\n\nthis very point. As we see it, Denko’s application was more akin to an application\n\nfor an extension of time to file appeal rather than to file affidavits of\n\nevidence-in-chief out of time as inThe Tokai Maru. It was a necessary step to\n\nfiling an appeal. Therefore, a stricter approach should be followed in determining whether\n\nan extension of time should be granted to Denko. It must be borne in mind that the very\n\nlimited time frame prescribed in s 34(1)(c) is to ensure that an interlocutory order made\n\nby a judge in chambers will obtain finality quickly so that the trial of the action will\n\ntake place soonest practicable and not be bogged down by interlocutory squabbles. The\n\ntrial of the action should not be delayed.11    There are four factors which this\n\nCourt have consistently declared to be pertinent in determining whether an extension of\n\ntime should be granted to file or serve a notice of appeal: the length of the delay; the\n\nreason for the delay; the merits of the appeal; and the question of the degree of\n\nprejudice. We will consider these factors in turn.",
        "Length of delay": "12    The delayed application to request\n\nfor further arguments was made on 12 March 2002 when Denko should have made it on 26\n\nFebruary 2002, a delay of some 14 days. Considering that the period allowed by s 34(1)(c)\n\nto apply for further arguments is only 7 days, a delay of 14 days cannot be said to be\n\nrelatively short.",
        "Reason for delay": "13    As for the second factor, there was\n\nonly a one line cryptic explanation for the delay: \"oversight on (solicitors) and\n\nthere was no fault on the part of (Denko).\" We had inNomura Regionalisationreviewed the authorities where mistake or oversight on the part of the solicitor was the\n\ncause of the delay in filing or serving the notice of appeal out of time. At the\n\nconclusion of the review, we made the following pronouncement (at 54-55):-\"We agreed … that there is no\n\n  absolute rule of law which prescribes that an error on the part of a solicitor or his\n\n  staff can never, under any circumstances, be a sufficient ground to grant an extension of\n\n  time to file a notice of appeal. Having said that, we do not think it is possible to lay\n\n  down any hard and fast rules as to the circumstances under which a mistake or error on the\n\n  part of the solicitor or his staff would be held to be sufficient to persuade the court to\n\n  show sympathy to the application. It is the overall picture that emerges to the court that\n\n  would be determinative. However, a mistake, evenbona fide, is only one factor in\n\n  the overall consideration. Such a mistakeper semay not be sufficient to enable\n\n  the court to exercise its discretion in favour of an extension. As illustrations, and no\n\n  more, we note that two aspects which seem to have considerable bearing in the court’s\n\n  consideration inGatti v ShoosmithsandPalata Investment v Burt & Sinfieldto grant extension were (i) the fact that in each of those two cases, notice within the\n\n  prescribed time was given to the other side that an appeal would be taken and (ii) the\n\n  mistake was understandable and not gross. But this is not to say that only where such a\n\n  notice was given that a blunder by the solicitor or his staff would be viewed\n\n  sympathetically. There could well be other circumstances..\"14    We noted that in the affidavits\n\nfiled in support, Denko, other than stating that it was simply an \"oversight\" on\n\nthe part of the solicitors, did not offer any other explanation with regard to the\n\n\"oversight\". Section 34(1)(c) was enacted in 1993. It is a provision which has\n\nbeen in operation for some nine years and there is nothing in it which is complex or could\n\ngive rise to a misunderstanding. Indeed, the substance of what is in s 34(1)(c) has been\n\naround for more than thirty years. In the 1970 Edition of Singapore Statutes, s 34(2) of\n\nthe then SCJA (Cap 15) read:\"No appeal shall lie from an\n\n  interlocutory order made by a Judge in chambers unless the Judge has certified, after\n\n  application, within four days after the making of such order by any party for further\n\n  argument in court, that he requires no further argument, or unless leave is obtained from\n\n  the Court of Appeal or from the Judge who heard the application.\"",
        "Merits of application": "15    With regard to the third factor,\n\nthe merits, it must mean, in relation to this case, the merits in Denko’s application\n\nfor a stay on the ground offorum non-conveniens.There was a clear connection\n\nbetween the judge wishing to hear further arguments and the merits of the application for\n\na stay. The threshold to be satisfied on this factor was not high. It was not necessary\n\nfor Denko to show that the application was likely to succeed. All that was necessary to be\n\nshown was that the application for a stay was not \"hopeless\". We noted that\n\nbefore the SAR, Denko’s application for a stay was granted. It was on appeal that Lai\n\nSiu Chiu J reversed this order. We really could not say that the application for a stay\n\nwas \"hopeless\" and thus, as far as the third factor was concerned, we would say\n\nthat it was satisfied.",
        "Question of prejudice": "16    Turning to the fourth factor, the\n\ndegree of prejudice, two points were raised by Fagerdala: (i) if an extension was granted,\n\nit would mean further delay in the substantive action coming on for hearing before the\n\ncourt; and (ii) a director of Denko, Dato Ahmed Anuar bin Mohamed, had informed Mr Paul\n\nYeo, the Managing Director of Fagerdala, that Denko were in the process of completing the\n\nsale of their assets and/or the business was in the process of being acquired by a third\n\nparty. If this were true, the enforcement of any eventual judgment which Fagerdala would\n\nobtain against Denko would be frustrated. This allegation was, however, denied by Dato\n\nAhmad Anuar and Fagerdala was not able to produce any concrete evidence to substantiate\n\nits assertion.17    We accept that if an appeal were\n\neventually filed it would, of course, lead to some delay. But that would be the effect of\n\nalmost every appeal. Fagerdala had not shown any real prejudice which could not be\n\ncompensated by costs, e.g., changed position pursuant to interlocutory order. Thus, it\n\nseemed to us that prejudice was not shown.",
        "Our overall assessment": "18    As we viewed it, the greatest\n\nobstacle in the way of Denko’s application was in relation to the first two factors.\n\nNot only was the length of the delay quite substantial (bearing in mind the prescribed\n\nperiod of time within which a party must apply to the judge for further arguments was only\n\n7 days), there were no extenuating circumstances offered for the \"oversight’ of\n\nthe solicitor. Some explanation should have been offered to mitigate or excuse the\n\noversight. If, in every case, \"oversight\" isper sea satisfactory\n\nground, we run the risk of turning the rules prescribing time into dead letters. It would\n\nbe observed in breach. It would be all too simple for a party to run to a judge to ask for\n\nindulgence because of oversight. The need for finality must be borne in mind.19    We have earlier referred to the\n\nfact that s 34(1)(c) has been in the statute book since 1993. Furthermore, a similar,\n\nthough not identical provision, was in the SCJA long before that. In all recent cases\n\nwhere this Court exercised its discretion to extend time, there were extenuating\n\ncircumstances in relation to the solicitor’s mistakes or oversight, e.g.,Nomura\n\nRegionalisation; Aberdeen Asset Management; Tan Chiang Brother’s Marble (S) Pte Ltd v\n\nPermasteelista Pacific Holdings Ltd[2002]. Two English cases, which are enlightening,\n\nhad also adopted a similar approach:Gatti v Shoosmith[1939] 3 All ER 916 andPalata\n\nInvestments Ltd v Burt & Sinfield Ltd[1985] 2 All ER 517.20    In summary, there must be\n\ncircumstances which would persuade the court to exercise its discretion in favour of the\n\napplicant. It would not be sufficient for an applicant to merely say, my solicitor forgot\n\nabout the whole matter. This aspect was what was lacking in Denko’s application.21    In passing, we must emphasise that\n\nthe decision which Denko would like to have reversed is not one relating to the\n\nsubstantive claim in the action. It only decided that there would be no stay because Denko\n\nhad failed to satisfy the judge that Malaysia was the more appropriate forum. All it meant\n\nwas that the action proper would be heard here in Singapore.",
        "Jurisdictional issue": "22    We now turn to the jurisdictional\n\npoint. Fagerdala contended that this Court had no jurisdiction to grant an extension of\n\ntime to enable Denko to request the judge-in-chambers to hear further arguments. Its\n\nreasoning ran as follows. This Court is a creature of the SCJA and its jurisdiction must,\n\nof necessity, be as circumscribed in that Act. Its civil jurisdiction consists of appeals\n\nfrom any judgment or order of the High Court, subject to the SCJA or any other written law\n\nregulating the terms and conditions upon which the appeals may be brought. Since Denko\n\nfailed to comply with s 34(1)(c), the decision of 19 February had become non-appealable.23    Denko averred that this Court had\n\nno jurisdiction or power to extend time to enable that decision to be rendered appealable,\n\nas no such jurisdiction or power was conferred upon this Court by either s 34(1)(c) or any\n\nother provisions in the SCJA, or any other written law. By virtue of s 18 and ¶7 of the\n\nFirst Schedule of the SCJA, the High Court is given the power to enlarge or abridge time\n\nprescribed by any written law for doing an act or taking any proceeding, whether the\n\napplication is made before or after the expiration of the time prescribed. Section 37(2)\n\nof SCJA also provides that the Court of Appeal \"shall have all the powers and duties\n\n… of the High Court.\" But for s 37(2) to operate there must first be a pending\n\nappeal before the Court of Appeal. And there was none here.",
        "Analysis": "24    We would at the outset state that\n\nthe reference made by Denko to s 37(2) is erroneous. This subsection touches on the powers\n\nof the Court of Appeal at the hearing of an appeal and it specifically mentions that the\n\nCourt of Appeal \"shall have all the powers and duties, as to amendment or otherwise\n\nof the High Court\" and it goes on to say the Court has full discretionary power to\n\nreceive further evidence. It does not relate to the power of the court, whether the High\n\nCourt or the Court of Appeal, to grant an extension of time. If at all, it seems to us\n\nthat the more appropriate provision is s 29A(3)(a), which is set out later in ¶27.25    It is clear, pursuant to s\n\n34(1)(c), that in relation to an interlocutory order made by a judge in chambers, unless\n\nthe application for further arguments is made within 7 days by the party who wishes to\n\nhave the order reversed or varied, no appeal may be brought against that order. Section\n\n18(2) provides that the High Court shall have the powers set out in the First Schedule to\n\nthe SCJA and ¶7 thereof reads as follows:-\"Power to enlarge or abridge the\n\n  time prescribed by any written law for doing any act or taking any proceeding, whether the\n\n  application therefor is made before or after the expiration of the time prescribed, but\n\n  the provision shall be without prejudice to any written law relating to limitation.\"26    By virtue of ¶7 of the First\n\nSchedule, the judge making the order could have the power to grant an extension of time to\n\nenable Denko to apply for further arguments out of time. Of course, in the present case\n\nDenko did not apply to the judge for an extension of time but had instead merely requested\n\nfor further arguments. This was rightly rejected by the Registrar, Supreme Court, as being\n\na request made out of time and was invalid.27    So the question is, has the Court\n\nof Appeal the jurisdiction to entertain an application in terms of the motion herein. Two\n\nprovisions in the SCJA are pertinent, s 29A(1) and (3), and they read:-(1)     The civil\n\n  jurisdiction of the Court of Appeal shall consist of appeals from any judgment or order of\n\n  the High Court in any civil cause or matter whether made in the exercise of its original\n\n  or of its appellate jurisdiction …(3)     For the\n\n  purposes of and incidental to –(a)     the hearing\n\n    and determination of any appeal to the Court of Appeal; and(b)     the\n\n    amendment, execution and enforcement of any judgment or order made on such an appeal.the Court of Appeal shall have all the\n\n  authority and jurisdiction of the court or tribunal from which the appeal was brought.28    It seems to us clear that the civil\n\njurisdiction of the Court of Appeal is to hear appeals from the High Court. It also seems\n\nto us that the effect of s 29A(3) is that the Court of Appeal will only have the powers of\n\nthe High Court, where there is in existence an appeal. It is only at the hearing of the\n\nappeal, or at the hearing of a matter incidental to the appeal, that the Court of Appeal\n\nwould have the powers which are conferred upon the High Court. Denko’s application\n\nfor an extension of time to apply for further arguments can, under no stretch of the\n\nimagination, be considered to be the \"hearing of\" of an appeal or a matter\n\nincidental to the hearing of an appeal. There was, as yet, no appeal.29    If Parliament had intended that the\n\nCourt of Appeal should have a separate power to extend the time prescribed in s 34(1)(c),\n\nit would have so provided as it did in relation to the criminal jurisdiction of that\n\nCourt: see ss 47(5) and 50.30    There may be a temptation to\n\ncompare this application by Denko with an application for an extension of time to file a\n\nnotice of appeal, which this Court often receives. Two factors differentiate the latter\n\napplication from the former. First, the time limit to file a notice of appeal is not\n\nprescribed in the SCJA, but in the Rules of Court (the Rules). Second, the Rules\n\nspecifically gives a power to the High Court as well as this Court to extend the time\n\nprescribed under the Rules: Order 3 r 4 and Order 57 r 17. Quite apart from the question\n\nwhether the Rules may modify what is laid down in s 34(1)(c), the Rules do not confer such\n\na power or jurisdiction upon the Court of Appeal to enlarge the time prescribed by that\n\nprovision.31    But that is not to say that the\n\nsame application may not come before the Court of Appeal by the more normal route. As we\n\nhave mentioned, a dissatisfied party, who is out of time, may apply to the judge to extend\n\ntime (extension application) for that party to make the request for further arguments (s\n\n18(2) read with ¶7 of the First Schedule). If the extension application is refused by the\n\njudge, that party can then appeal to the Court of Appeal. That should have been the\n\napproach which Denko should have taken. This appears to have been the approach adopted inSeabridge\n\nTransport Pte Ltd v Olivine Electronics Pte Ltd[1995] 3 SLR 545but with one\n\ndifference. Instead of making the extension application direct to the judge, the appellant\n\nmade it to the Assistant Registrar and having failed to obtain an extension from the\n\nAssistant Registrar, the appellant did not pursue it further. So there was really no cause\n\nfor this Court in that case to consider this procedural point. Similarly, there was also\n\nno cause for this Court in that case to express any view whether it had a separate\n\njurisdiction to entertain an application to extend time prescribed in s 34(1)(c), other\n\nthan by way of an appeal from a refusal to extend time by the court below.32    For the reasons we have indicated,\n\nit is our opinion that this Court does not have an original jurisdiction to entertain an\n\napplication to extend time prescribed in s 34(1)(c). Thus, the motion filed by Denko was\n\nnot in order.Sgd:YONG PUNG HOWCHAO HICK TINTAN LEE MENGCHIEF JUSTICEJUDGE OF APPEALJUDGECopyright © Government of Singapore."
    }
}