{
    "case_title": "Anwar Siraj & Another v Teo Hee Lai Building Construction Pte Ltd",
    "ncitation": "[2002] SGCA 51",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J",
    "sections": {
        "Background": "2.\n\n        The appellants, the owners of No 2 Siglap\n\nValley, entered into a contract with THL on 30 December 1999 for the demolition of the\n\nhouse then standing on the property and the construction of a new house. The cost of the\n\nconstruction work was $1,200,000 and the agreed date for the completion of the new house\n\nwas 9 January 2001.3.\n\n        THL was required by the building contract to\n\nprocure a performance bond in the appellants’ favour for 10% of the cost of\n\nconstruction. As such, they arranged for Tai Ping Insurance Co (\"Tai Ping\") to\n\nfurnish a performance bond for the sum of $120,000 on 12 January 2001. The bond provided\n\nthat the insurance company would pay the appellants the sum of $120,000\n\n\"unconditionally and immediately on demand and without any reference to the\n\ncontractor and notwithstanding any dispute or difference which may have arisen under or in\n\nconnection with the contract\".4.\n\n        The construction of the house was not completed\n\nby 9 January 2001 and the house was handed over to the appellants on 5 April 2001. As\n\nsuch, liquidated damages at the rate of $1,000 per day was payable by THL to the\n\nappellants. At the date of handing over of the house, a number of defects listed by the\n\nappellants’ architect, Mr Tan Hock Beng of Maps Design Studio, had not been\n\nrectified. The architect then wrote to THL to request for an undertaking that the latter\n\nwould rectify all the stated defects.5.\n\n        THL complained that that they were denied\n\naccess to the appellants’ premises to carry out the rectification work. In August\n\n2001, they gave the appellants notice of arbitration. THL said that they would bear the\n\ncost of rectification work pending the arbitrator’s finding as to who should be\n\nresponsible for the cost.6.\n\n        On 20 September 2001, the appellants, who\n\ncontended that THL breached their contractual obligation to rectify the defects noted by\n\nthe architect, made a demand under the performance bond for $120,000. When Tai Ping did\n\nnot pay the amount claimed, the appellants issued a writ against them. THL then sought an\n\ninterim injunction to restrain the appellants from obtaining any payment from Tai Ping\n\nunder the performance bond. An ex-parte interim injunction was granted by the District\n\nCourt but it was set aside on 14 January 2002. THL appealed to the High Court and\n\npersuaded the judicial commissioner who heard the appeal to restore the interim\n\ninjunction. The appellants sought and obtained leave to appeal to the Court of Appeal\n\nagainst the decision of the judicial commissioner.",
        "The decision of the judicial\n\ncommisisoner": "7.\n\n        The judicial commissioner noted that THL had\n\nalleged that the first appellant had been an extremely difficult client and that he had\n\ninterfered with the architect’s duties. He also noted that THL had alleged that some\n\nof the problems in relation to the construction of the house were caused by design error\n\nand he thought that they had put up a reasonable case.8.\n\n        The judicial commissioner pointed out that THL\n\nhad alleged that they had been denied the opportunity to carry out remedial work during\n\nthe maintenance period. There was a dispute as to whether THL’s expert, one Mr Donald\n\nPayne (\"Payne\"), should have been allowed to attend meetings with the architect.\n\nThe judicial commissioner, who pointed out that a contractor is entitled to be assisted by\n\nany person in his attempt to keep a proper record of the works to be completed before and\n\nafter rectification work has been carried out, was satisfied that the architect and the\n\nfirst appellant had acted oppressively by denying THL the assistance which Payne could\n\nhave rendered them. After taking all the circumstances into account, he ruled that there\n\nwas sufficient evidence of unconscionability on the part of the appellants. As such, he\n\nagreed that the appellants should be restrained from making a demand or receiving any\n\npayment under the performance bond until their dispute with THL has been resolved through\n\narbitration.",
        "The appeal": "9.\n\n        This court has stated on numerous occasions\n\nthat fraud and unconscionability are grounds for restraining a beneficiary of a\n\nperformance bond from insisting on his right to demand payment under the bond. (See, for\n\ninstance,Bocotra Construction Pte Ltd v Attorney-General[1995] 2 SLR 523.)As there is no allegation of fraud in this case, the only issue which arises is\n\nwhether or not the appellants have acted unconscionably when they made a demand for\n\npayment under the performance bond issued by Tai Ping.10.\n\n        As for what constitutes unconscionable conduct,\n\ninEltraco International Pte Ltd v CGH Development Pte Ltd[2000] 4 SLR 290,\n\n298-299, this court stated as follows:InDauphine Offshorethis\n\n    court did not think it possible to define what would constitute\n\n    ‘unconscionability’. Lack of bona fide would in most instances indicate such\n\n    ‘unconscionability’. The situation in each case would naturally differ from\n\n    another. Thus, there we stated (at p 668):What kind of situation would\n\n      constitute unconscionability would have to depend on the facts of each case…. There\n\n      is no pre-determined categorisation….The appellants would appear to\n\n      suggest that … unfairness, per se, could constitute 'unconscionability'. We do not\n\n      think it necessarily follows…. In every instance of unconscionability there would be\n\n      an element of unfairness. But the reverse is not necessarily true. It does not mean that\n\n      in every instance where there is unfairness it would amount to\n\n      ‘unconscionability’.11.\n\n        As for the standard of proof required to\n\nestablish unconscionability on the part of a person who is making a call on a performance\n\nbond, the position was made very clear inDauphin Offshore Engineering & Trading\n\nPte Ltd v The Private Office of HRH Sheikh Sultan Khalifa bin Zayed Al Nahyan[2000] 1 SLR 657, 672, where this court stated as follows:In [Bocotra’s case]this court stated that ‘a high degree of strictness applies, as the applicant\n\n    will be required to establish a clear case of fraud or unconscionability in the\n\n    interlocutory proceedings. It is clear that mere allegations are insufficient…. In\n\n    our opinion, what must be shown is a strong prima facie case of unconscionability.12.\n\n        THL’s counsel, Mr S Thulasidas, asserted\n\nat the hearing of the appeal that the appellants had acted unconscionably by making a\n\ndemand for payment under the performance bond for a number of reasons. First, the\n\nappellants ought not have made a demand for payment under the performance bond because\n\nthey had sufficient security for their claims. Secondly, a major complaint of the\n\nappellants, namely the flooding of the basement and the debonding of the basement tiles\n\nwould not have occurred if the architect’s design had not been defective. Thirdly,\n\nTHL had been denied access into the appellants’ premises to carry out rectification\n\nwork.13.\n\n        The contention that the appellants ought not\n\nhave made a demand for payment under the performance bond as they had sufficient security\n\nin their hands will first be considered. It was pointed out that the appellants held\n\n$290,000 of THL’s money because the latter’s claim for a progress payment, which\n\namounted to $265,190.17, had not been certified by the architect. Furthermore, there was a\n\nretention sum of $24,010.86. However, the appellants contended that it should not be\n\noverlooked that the quantity surveyor had estimated the cost of rectification work\n\nrequired by the architect to be more than $500,000. They submitted that if their claim for\n\nliquidated damages for delayed completion, which amounted to $84,000, was taken into\n\naccount together with the estimated cost of rectification work, their demand for $120,000\n\nunder the performance bond was not unreasonable. It is not our task to determine whether\n\nthe appellants’ or THL’s estimated cost for the rectification of defects is more\n\nrealistic. Neither is it our task to determine whether or not the architect should have\n\ncertified THL’s claim for $265,190.17. In the circumstances, it was not established\n\nthat it was unconscionable for the appellants to make a demand under the terms of the\n\nperformance because they had sufficient security for the cost of rectification work.14.\n\n        As for THL’s assertion that some of the\n\nappellants’ complaints, including the flooding of the basement, were due to a defect\n\nin the architect’s design, the appellants retorted that the flooding and the damage\n\nto the basement tiles resulted from THL’s failure to build in accordance with the\n\narchitect’s plans, which had been approved by the relevant authorities. We were in no\n\nposition to conclude that there has been defective designing by the architect. As such, it\n\ncould not be said that the appellants’ call on the performance bond was\n\nunconscionable on the ground that the architect’s plans were defective.15.\n\n        Finally, the question of access to the\n\nappellants’ premises will be considered. THL complained that their expert, Payne, was\n\nnot allowed into the premises to look into the alleged defects. We agree with the judicial\n\ncommissioner that THL should not be obstructed in their attempt to get an expert to help\n\nthem evaluate the position. The appellants asserted that they were not unwilling to allow\n\nPayne to enter their premises and the impasse arose because THL failed to respond to their\n\nrequest for particulars of Payne’s credentials. Evidently, the dispute concerning the\n\nentry into the appellants’ house by Payne has been blown out of proportion.\n\nAdmittedly, the appellants could have been more co-operative but THL could have provided\n\nthe requested particulars with the greatest of ease. Consequently, months passed because\n\nof the intransigence of both parties. We were unable to conclude from the voluminous\n\ncorrespondence between the parties on this matter that the appellants were clearly at\n\nfault and that they were guilty of unconscionable conduct in relation to the entry of\n\nPayne into their premises.16.\n\n        We are mindful of the fact that inEltraco\n\nInternational Pte Ltd v CGH Development Pte Ltd[2000] 4 SLR 290, 299, this court\n\nnoted that it \"is important that the courts guard against unnecessarily interfering\n\nwith contractual arrangements freely entered into by the parties\". The terms of the\n\nperformance bond are crystal clear and they are that the insurers shall\n\n\"unconditionally and immediately on demand without any reference to the contractor\n\nand notwithstanding any dispute or difference which may have arisen under or in connection\n\nwith the contract\" make a payment under the performance bond. As a case of\n\nunconscionability on the part of the appellants was not made out, we allowed the appeal\n\nwith costs and set aside the injunction restraining the appellants from making a demand\n\nunder the performance bond issued in their favour. The appellants are entitled to costs.Sgd:CHAO HICK TINTAN LEE MENGJudge of AppealJudgeCopyright © Government of Singapore."
    }
}