{
    "case_title": "Wee Soon Kim Anthony v The Law Society of Singapore (No 4)",
    "ncitation": "[2002] SGCA 24",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J; \n      Yong Pung How CJ",
    "sections": {
        "Background": "2.    This was the third occasion an appeal had come before this court\n\narising from a letter of complaint dated 8 August 1999 lodged by Mr Wee against two\n\nadvocates and solicitors, Mr Davinder Singh SC and Mr Hri Kumar. We will hereinafter refer\n\nto them as Mr Singh and Mr Kumar respectively or as \"the two solicitors\"\n\ncollectively.3.    Upon receipt of the complaint letter, the Council of the Law\n\nSociety (the Council) summarily determined that it did not contain information of\n\nmisconduct warranting a reference to an IC. The complaint letter set out four incidents\n\nwhere the two solicitors had prepared affidavits on behalf of clients in legal proceedings\n\nwhich contained falsehoods. Being dissatisfied with the decision of the Council, Mr Wee\n\napplied to the High Court to compel the Law Society to have the complaint letter referred\n\nto an IC for investigation. The High Court, having considered the four alleged incidents\n\nof misconduct set out in the complaint letter, directed that only one of the incidents\n\nneed be referred to an IC. On Mr Wee’s further appeal, this Court ruled that once a\n\ncomplaint related to the conduct of an advocate and solicitor, the Council was required\n\nunder s 85(1) of the Act to refer it to an IC, through the Chairman of the Inquiry Panel.\n\nThat decision was reported in[2001] 2 SLR 145.4.    In the meantime, the Council acted on the order of the High Court.\n\nAn IC was duly constituted to look into that one incident of alleged misconduct\n\n(hereinafter referred to as \"the complaint\"), and, after due inquiry,\n\nrecommended that the complaint be dismissed. This recommendation was endorsed by the\n\nCouncil. Being dissatisfied, Mr Wee again applied to the High Court (OS 1575/2000),\n\npursuant to s 96(1) of the Act, for an order to compel the Law Society to apply to the\n\nChief Justice that a DC be appointed to hear into the complaint. However, before OS\n\n1575/2000 was heard, the two solicitors applied to intervene in those proceedings. This\n\nrequest of the two solicitors was acceded to by the Assistant Registrar, which decision\n\nwas affirmed by the High Court. It was in relation to this order allowing the two\n\nsolicitors to intervene that Mr Wee again appealed. This Court allowed the appeal and held\n\nthat it was not proper in such a proceeding to permit the two solicitors to intervene (see\n\n[2001] 4 SL R 25).5.    The present appeal was in relation to Woo JC’s refusal to\n\nmake the order prayed for in OS 1575/2000.6.    The substance of the complaint was as follows. Mr Wee and his\n\nfamily (wife and son) were customers of the bank, UBS (AG) [UBS]. Disputes arose between\n\nthem and this resulted in UBS closing the three accounts which Mr Wee and his family had\n\nwith the bank. UBS took out legal proceedings (OS 546/99) seeking directions as to the\n\ndisposal of certain assets held by UBS in relation to the three accounts because Mr Wee\n\nrefused to give any instruction in relation thereto. The two solicitors acted for UBS in\n\nthat proceeding, which was eventually settled at the door-steps of the court. It was a few\n\nmonths later that Mr Wee wrote the complaint letter.7.    The complaint which the IC was tasked to inquire into related to\n\nthe following sentence which appeared in an affidavit filed by an officer of UBS, Ms\n\nShirreen Sin (Shirreen) in OS 546/99:-\"… The account opening forms for all the three accounts were\n\n  prepared by (UBS) in Singapore and executed by (Mr Wee and his wife and son) in\n\n  Singapore.\" (hereinafter referred to as the \"disputed sentence\")8.    Mr Wee alleged that the disputed sentence was false because not\n\nall of the three account opening documents were prepared and executed in Singapore. He\n\nsaid that the opening forms relating to one account (No. 207038), dated 26 August 1997,\n\nwere prepared and witnessed by one Sheila Wong of UBS (Hong Kong) in Hong Kong. To\n\nsubstantiate this, Mr Wee produced his passport to show that he was in Hong Kong from 24\n\nAugust to 11 September 1997.9.    Mr Wee thus concluded that the two solicitors had misconducted\n\nthemselves in that they –(a) had knowingly prepared an affidavit which contained a false\n\n  allegation; and/or(b) had otherwise permitted Shirreen to perjure herself in a court of\n\n  law.",
        "Explanation of the two solicitors": "10.    It was first pointed out to the IC that at no time during the\n\ncourse of the proceedings in OS 546/99 did Mr Wee ever complain that the disputed sentence\n\nwas false.11.    The affidavit in question was prepared by Mr Kumar in\n\nconsultation with Shirreen and another Mr Mathias Lee, a Legal Officer of UBS. Upon\n\nenquiry by Mr Kumar, Shirreen informed the former that the account opening forms of all\n\nthree accounts were executed in Singapore.12.    In this regard, Shirreen made two statements which were tendered\n\nto the IC. Counsel for the two solicitors also informed the IC that both Shirreen and\n\nMathias Lee, who were then no longer in the employ of UBS, were available to be questioned\n\nby the IC. After deliberation, the IC felt that it would suffice to examine only Shirreen.\n\nShe duly appeared and gave an account of the matter. She re-affirmed what she stated in\n\nher two statements. She recalled having visited Mr Wee at his residence at No. 38 Jalan\n\nArnap and he signed all three sets of the forms in her presence. A copy of a letter from\n\nMr Wee’s Hong Kong’s solicitors dated 14 December 1998 was also tendered to the\n\nIC, where in 2 it was stated that all three accounts were arranged by Shirreen for Mr\n\nWee.",
        "Findings of the IC": "13.    The IC noted that in the circumstances its task was to determine\n\nwhether aprima faciecase of misconduct had been made out against the two\n\nsolicitors. It examined the relevant case law on the duty of an advocate and solicitor in\n\nrelation to the instructions of clients, includingWee Soon Kim Anthony v The Law\n\nSociety of Singapore[1988] 3 MLJ 9andTang Liang Hong v Lee Kuan Yew[1998] 1 SLR 97, and came,inter alia,to the following conclusions:-\"(i) It is not part of an advocate and solicitor’s duty to\n\n  believe or disbelieve his client’s information, unless:-(a) he himself has personal knowledge of the matter; or(b) his client’s statements are inherently incredible; or(c) his client’s statements are logically impossible;even then, his duty does not go beyond advising the client of the folly\n\n  of making incredible or illogical statements.(ii) It is not part of an advocate’s duty on every occasion to\n\n  verify the truth or otherwise of what his client has deposed in his affidavit.\"14.    The IC, having scrutinised what Shirreen had said, unanimously\n\naccepted her statements. The IC observed that she gave her answers in a forthright manner,\n\nfirm and without prevarication. It was satisfied that she told the truth to the best of\n\nher honest recollection. It found that the disputed sentence was inserted in the affidavit\n\nin accordance with the clear instructions of clients. It was not the duty of an advocate\n\nand solicitor in such a circumstance to go further and check the internal records of the\n\nclient to ascertain if the statement was indeed true. Thus, the complaint could not stand\n\nas the evidence showed that neither Mr Kumar nor Mr Singh knew that the disputed sentence\n\nwas false. Indeed, Mr Singh was not even present when Mr Kumar received the instructions\n\nfrom Shirreen.15.    For the purpose of determining whether there was aprima faciecase for the complaint to be referred to a DC, the IC took the approach that it was wholly\n\nunnecessary for it, in the circumstances of this case, to resolve the fact in dispute,\n\nnamely, whether the documents relating to account No. 207038 were executed in Singapore or\n\nin Hong Kong. This, however, was not to say that Shirreen was unable to explain the\n\nposition to the IC. She also clarified why the date stated on the documents relating to\n\nthe account was different from that on the documents relating to the other two accounts.\n\nEffectively, what Shirreen explained was as follows::-\"(a) the fact that 207038’s opening forms are dated\n\n  differently from the other two accounts are (sic) not conclusive because account opening\n\n  forms are not always dated on the same day that they are signed;(b) sometimes clients sign and the dates inserted later, this is\n\n  especially so for foreign accounts where they are sent to that foreign branch to be\n\n  processed and the foreign branch may then insert the date;(c) the bank officer who signs on the account opening form may not\n\n  necessarily have witnessed the signature, the bank officer is only required to verify the\n\n  customer’s signature on the account opening form and the verification may also take\n\n  place at a later date from that when the customer signed the form.\"16.    To substantiate points (a) and (b) above, Shirreen produced a\n\nLetter of Charge which was executed by Mr Wee in Singapore in her presence dated 3\n\nSeptember 1997. But Mr Wee was in Hong Kong on that date. As regards Shirreen, she was not\n\nin Hong Kong on 3 September 1997 and neither was she there during the entire period from\n\n24 August to 11 September 1997.",
        "Issues": "17.    In challenging the decisions of the IC and the Council before the\n\nHigh Court, Mr Wee raised a host of arguments, and the main ones were these –(i) The Council had merely rubber-stamped the recommendation of the IC;(ii) The IC should have recommended that the complaint be referred to a\n\n  DC upon it being shown that the disputed sentence was not in line with what appeared on\n\n  the documents;(iii) The Chairman of the IC had misunderstood the nature and scope of\n\n  the duties of an IC;(iv) It was the duty of an advocate and solicitor in every instance to\n\n  verify the instructions of his client;(v) The procedures adopted by the IC to carry out the inquiry were\n\n  contrary to the rules of natural justice, e.g., failure to inform the complainant that the\n\n  two solicitors had given their written explanation nor was he given a copy thereof ; no\n\n  opportunity was given to Mr Wee to comment on the written explanation of the two\n\n  solicitors ; forwarding all subsequent correspondences from Mr Wee on the complaint to the\n\n  two solicitors without Mr Wee’s permission.(vi) The IC should have tested the two solicitors’ explanation\n\n  against ‘other evidence’.All these contentions were dismissed by Woo JC as being without merit.18.    Before us, Mr Wee submitted only two issues for determination\n\nand, in his words, they were:-\"(i) The cardinal rule of law that no man is above the law should\n\n  remain inviolate;(ii) What is the role of an IC constituted under s 85(6) of the\n\n  Act.\"19.    The first issue was really a non-issue, as that is trite law\n\nwhich nobody can or should dispute. It is like a statement on motherhood. It seemed to us\n\nclear that he sought to convert a well-established principle of law into an issue because\n\none of the two solicitors, Mr Singh, is a Senior Counsel and a Member of Parliament. While\n\nnobody is above the law, it is also trite law that every person is entitled to the equal\n\nprotection of the law. We would say no more.",
        "The role of an IC": "20.    The function of an IC, as laid down in s 85(6D) of the Act, is to\n\n\"inquire into the complaint\". The following provisions in section 86 of the Act\n\nalso indicate what is expected of the IC:-\"(5) Where an Inquiry Committee is satisfied that there are no\n\n  grounds for disciplinary action under this Part, it shall report to the Council\n\n  accordingly and state the reasons for its decision.(6) Where an Inquiry Committee is of the opinion that an advocate and\n\n  solicitor should be called upon to answer any allegation made against him, the Inquiry\n\n  Committee shall –(a) post or deliver to the advocate and solicitor concerned\n\n    –(i) copies of any complaint or information …; and(ii) a notice inviting him to give within such period … any\n\n      written explanation he may wish to offer and to advise the Inquiry Committee if he wishes\n\n      to be heard by the Committee;(b) allow the time specified in the notice to elapse;(c) give the advocate and solicitor concerned reasonable\n\n    opportunity to be heard if he so desires; and(d) give due consideration to any explanation (if any) given by\n\n    him.(7) The report of the Inquiry Committee shall, among other things, deal\n\n  with the question of the necessity or otherwise of a formal investigation by a\n\n  Disciplinary Committee and, if in the view of the Inquiry Committee no formal\n\n  investigation by a Disciplinary Committee is required, the Inquiry Committee shall\n\n  recommend to the Council –(a) a penalty sufficient and appropriate to the misconduct\n\n    committed; or(b) that the complaint be dismissed.\"21.    While the Act leaves it very much to the IC to determine how it\n\nshould go about carrying out its task (seeSeet Melvin v Law Society of Singapore[1995] 2 SLR 323at 341), it will be seen from s 86(6) that, where the IC is of the\n\nopinion that the advocate and solicitor complained against should be called upon to answer\n\nany allegation, certain procedures must be followed.22.    The contention of Mr Wee was as follows. The function of an IC is\n\nto carry out a preliminary inquiry to ensure that a complaint of professional misconduct\n\nagainst an advocate and solicitor is not frivolous. It acts as a filter. A complaint\n\nrelating to the preparation of an affidavit for use in legal proceedings and which is\n\nfalse isprima facieprofessional misconduct and is notex faciefrivolous,\n\nrelying in this regard onRe James Gray Exp. The Incorporated Law Society[1869] 20\n\nLT 730. Accordingly, such a complaint must be referred to the DC and it should be left to\n\nthe DC to formally investigate and determine if the alleged misconduct had been made out.23.    But the question was whether aprima faciecase of\n\nprofessional misconduct had been established against the two solicitors. For the\n\ndetermination of this question, this Court had assumed that the disputed sentence was, in\n\nfact, wrong, because if it were not wrong, there was nothing more to be said. It was clear\n\nto us that in order to impute fault to the two solicitors, it was necessary to show that\n\nthey knew at the time the affidavit was prepared for Shirreen to execute that the disputed\n\nsentence was, in fact, false or at least had reasons to believe it was so. There is no\n\ngeneral duty on the part of a solicitor that he must verify the instructions of his\n\nclient. This was laid down inAnthony Wee Soon Kim v The Law Society of Singapore[1988] 3 MLJ 9andTang Liang Hong v Lee Kuan Yew[1998] 1 SLR 97. It would be\n\ndifferent if there were compelling reasons or circumstances which required the solicitor\n\nto verify what the client had instructed.24.    In the present case, Mr Kumar took instructions from Shirreen,\n\nwho was then an Associate Director of UBS, holding a responsible position in the bank.\n\nThere was no reason whatsoever why Mr Kumar should have hesitated to accept what Shirreen\n\ntold him on a simple matter such as this. Shirreen had appeared before the IC and\n\naffirmed, in no uncertain terms, that when Mr Kumar made the enquiry, she told him that\n\nthe account opening documents relating to all the three accounts of Mr Wee and his family\n\nwere executed in Singapore. We should hasten to add that she had so instructed Mr Kumar\n\nbecause she honestly recalled that all the documents were in fact executed here\n\nnotwithstanding that, in one document, the signature of Sheila Wong of UBS (Hong Kong)\n\nappeared.25.    In the light of such unequivocal evidence, there was really only\n\none course open to the IC to take, namely, dismissing the complaint. There was noprima\n\nfaciecase of professional misconduct established against Mr Kumar or Mr Singh.26.    However, Mr Wee argued that as there was a conflict in the\n\nevidence in relation to the place where the documents for account No. 207038 were\n\nexecuted, aprima faciecase had been established and the IC should not have gone\n\nfurther to consider the explanations of Shirreen and the two solicitors. He submitted that\n\nthe IC should not have resolved the conflict but, in line with its function of sifting out\n\nfrivolous complaints, should have recommended that the matter be put before a DC, which\n\nwas the proper forum to resolve issues of fact involving conflict of evidence.27.    In this regard, Mr Wee relied upon the pronouncements of this\n\nCourt in two cases. InWhitehouse Holdings Pte Ltd v Law Society of Singapore[1994] 2 SLR 476at 486, this Court stated that \"the role of the IC is merely to\n\ninvestigate the complaint. It does not have to make any conclusion on misconduct or\n\nwhether an offence was committed but simply to consider whether or not there is aprima\n\nfaciecase for a formal investigation.\" InSubbiah Pillai v Wong Meng Meng[2001] 3 SLR 544at 554, the Court stated that under the Act \"the function of the IC\n\nis only to inquire into complaints, to eliminate frivolous complaints and to ensure that\n\nonly complaints which have beenprima facieestablished will proceed to the\n\nDC.\"28.    Obviously, both these pronouncements must be viewed in the light\n\nof the provisions of Part VII of the Act, as well as the context of the issues which\n\nconfronted the Court in those cases. Under ss 86(5) and (7), the IC can dismiss a\n\ncomplaint or recommend a lesser punishment (a penalty of not more than $5,000) without\n\nhaving it being referred to a DC if the misconduct in question is minor. It is common\n\nsense that in order to decide whether a complaint is frivolous or has beenprima facieestablished, it would be necessary for the IC to evaluate both the facts and the\n\napplicable law. It should be noted that inWhitehouse Holdingsthe Court stated\n\nthat the IC \"does not have to make any conclusion\" and not that it \"cannot\n\nmake\" any conclusion. The fact that the primary function of the IC, under the scheme\n\nof things laid down in Part VII of the Act, is to sift out frivolous complaints, cannot be\n\ninterpreted to mean that it cannot make any determination, especially as to questions of\n\nfact. Such a construction would be absurd. How could an IC sift out frivolous complaints\n\nif it cannot decide?29.    Again, although the Court stated inWee Soon Kim Anthony v Law\n\nSociety of Singapore[2001] 4 SLR 25at 30 that \"it is not the mandate of the\n\nInquiry Committee to come to a firm view as to the merits where there is conflict as to\n\nthe facts\", this pronouncement must similarly be read in the light of both the\n\nprovisions of the Act as well as its context. It does not follow from this pronouncement\n\nthat the IC is, therefore, precluded from coming to any decision at all once a conflict of\n\nfact is shown to exist. Where the nature of a complaint is such that, if proven, it would\n\nwarrant being referred to a DC, and there is a conflict as to facts, then the IC should\n\nnot normally seek to resolve the conflict and should instead leave it to the DC to decide.\n\nBut that is not to say that, just because a complainant makes an assertion of material\n\nfacts which are at variance with those advanced by the respondent solicitor, the IC is\n\nthereby precluded from making any determination. If there are objective facts upon which\n\nthe IC could verify the two opposing versions, the IC would be entitled to make a finding\n\nand, if that finding should favour the respondent-solicitor, then the IC should recommend\n\nthe dismissal of the complaint. Of course, if the IC feels that, in view of the gravity of\n\nthe complaint and the opposing versions of the material facts, a more formal inquiry by a\n\nDC is warranted, then it should recommend that the complaint be referred to the DC.30.    That everything is not as cut and dried as suggested by Mr Wee\n\ncan be seen from the example of a complaint where the misconduct is minor and where the IC\n\nis inclined to recommend, in line with s 86(7), that the matter be dealt with summarily by\n\nthe Council by the imposition of a penalty without reference to a DC. In the nature of\n\nthings, for the IC to come to this conclusion, it would have to make a value judgment on\n\nat least two aspects: (i) that the complaint is made out, including determining issues of\n\nfact, where the evidence is in conflict; and (ii) that the misconduct in question is\n\nminor. It is thus not the position that, whenever there is a conflict as to evidence, the\n\nIC should always refrain from making a finding and that the matter should be referred to a\n\nDC.31.    Therefore, how an IC should carry out its task depends on the\n\nnature of the complaint and the circumstances prevailing in the case. The situations that\n\ncan arise are so varied and diverse that we do not think it appropriate or desirable to\n\nlay down any hard and fast rule. As far as procedure is concerned, the IC must, at all\n\ntimes, act fairly: seeSubbiah Pillaiat p.561. It must hear the solicitor who is\n\nthe subject of the complaint, unless at that stage and without having any explanation from\n\nthe solicitor, the IC is able to determine that the complaint is frivolous and should be\n\ndismissed. In carrying out the inquiry, the IC is entitled to hear from any person whom it\n\nthinks is able to shed light on the matter. If the complaint is serious, warranting a\n\nreference to a DC, then the ICshouldnotseek to make findings on\n\ndisputed material facts, but should leave that to the DC. We say \"should not\"\n\nadvisedly because such a finding of the IC will not be binding on the DC as the latter is\n\nrequired to carry out its hearingde novo.32.    Reverting to the matter in hand, what the IC had decided was that\n\naprima faciecase on the complaint had not been made out against the two\n\nsolicitors. The approach taken by Mr Wee ignored the need to establishmens reaon\n\nthe part of the two solicitors. The case ofRe James Gray(supra) relied upon by Mr\n\nWee at the IC was quite different. There the solicitor knew that what his client stated\n\nwas false. In the words of Lord Romilly (at p. 731) \"here is a gross and manifest\n\nfalsehood sworn to by Mostran, known to be such by his solicitor, and yet not corrected by\n\nhim but allowed to be sworn, and the affidavit is actually filed by him\". Similarly,\n\nin the local caseRe an Advocate and Solicitor[1962] MLJ 125 where a solicitor\n\nprepared an affidavit containing an untrue statement, there was knowledge of the falsehood\n\non his part.33.    The evidence before the IC showed that the two solicitors did not\n\nknow that the instruction was false (assuming that the disputed sentence was false) and\n\nthere was nothing to suggest to them that they should verify the sentence. The evidence of\n\nShirreen was very clear. On this question, there could be no input from Mr Wee. It was not\n\na matter within Mr Wee’s knowledge. If at all, his conduct in not raising any\n\nobjection to the disputed sentence during the proceedings of OS 546/99 substantiated the\n\nassertion by Shirreen that all the account opening documents were executed in Singapore,\n\nor, at the very least his conduct showed that the instruction of Shirreen was not\n\nobviously wrong.34.    In the absence of knowledge of the falsehood on the part of the\n\ntwo solicitors, the complaint could not stand and was, in our judgment, correctly\n\ndismissed. The primary role of the IC as a filter must also mean that a solicitor should\n\nnot be unnecessarily dragged through a DC hearing.Sgd:YONG PUNG HOWCHIEF JUSTICESgd:CHAO HICK TINJUDGE OF APPEALSgd:TAN LEE MENGJUDGECopyright © Government of Singapore."
    }
}