{
    "case_title": "Collector of Land Revenue v Mustaq Ahmad  s/o Mustafa",
    "ncitation": "[2002] SGCA 14",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J; \n      Yong Pung How CJ",
    "sections": {
        "Background": "2.    Mustaq owned No 38 and No 40 Owen Road (\"the\n\nproperties\"), which were acquired on 28 June 1996 for a public purpose, namely the\n\nconstruction of the North-East MRT Line and the comprehensive development of the area.3.    For a more complete picture of the dispute between\n\nthe parties, the following ought to be noted:(a) The acquired properties had a total area of 475 square metres and\n\n  were located in a local shopping zone in the Master Plan.(b) On 7 September 1993, written permission was granted by the\n\n  competent authority for the development of the site and for a \"3-storey and an attic\n\n  residential building with a restaurant at the 1ststorey\".(c) Construction work, which began in July 1994, was suspended in June\n\n  1995 following an application by the architect to amend the written permission by adding a\n\n  4thstorey and by converting the residential building to a boarding house.(d) Provisional permission for the amendments was obtained on 18 July\n\n  1995. The provisional permission was valid for a period of 6 months from 27 July 1995.(e) No written permission was obtained for the amendments to add a 4thstorey and to convert the residential building to a boarding house and by the time the\n\n  properties were acquired in June 1998, the provisional permission to increase the size of\n\n  the building and to convert its use had lapsed.4.    After the acquisition of his properties, Mustaq\n\nmade a claim for $7,107,500 as compensation for the said acquisition. On 11 September\n\n1996, the Collector of Land Revenue (the \"Collector\") awarded him the sum of\n\n$3,300,000. On 3 November 1996, Mustaq submitted a revised claim for $5,850,000, which\n\nincluded a claim for $4,500,000 in respect of the land.5.    The Appeals Board ruled that the market value of\n\nthe acquired properties was $5,640,000. In coming to this conclusion, it took into account\n\nthe fact that Mustaq had obtained provisional permission to increase the size of the\n\nbuilding and to convert the residential building to a boarding house. The Board took this\n\napproach because it accepted that \"the probable use of the acquired land for the\n\npurpose of determining its market value is use for a restaurant on the 1ststorey and a boarding house on the upper storeys in a building with 4 storeys and an attic\n\nas proposed in the appellant’s application for an amendment to the original\n\ndevelopment proposal and for which provisional permission had been granted.\" A\n\ndiscount was given because the provisional permission had lapsed by the time the\n\nproperties were acquired.6.    The Collector, who disagreed with the approach of\n\nthe Appeals Board, appealed against its decision.",
        "The appeal": "7.    The main issue in the appeal was whether or not\n\nthe Appeals Board acted in contravention of section 33(5)(e) of the Land Acquisition Act\n\nby taking into account the provisional permission for the purpose of awarding Mustaq\n\ncompensation for the acquisition of his properties.8.    Section 33(5)(e) of the Land Acquisition Act\n\nprovides as follows:[T]he market value of the acquired land shall be deemed not to exceed\n\n  the price which a bona fide purchaser might reasonably be expected to pay for the land on\n\n  the basis of its existing use or in anticipation of the continued use of the land for the\n\n  purpose designated in the Master Plan, whichever is the lower, after taking into account\n\n  the zoning and density requirements and any other restrictions imposed under the Planning\n\n  Act and any restrictive covenants in the title of the acquired land, and no account shall\n\n  be taken of any potential value of the land for any other more intensive use.9.    The Collector pointed out that by taking into\n\naccount the provisional permission, the Appeals Board departed from the principles laid\n\ndown by a previous Appeals Board inBeauty Park Development (Pte) Ltd v Collector of\n\nLand Revenue[1991] 2 MLJ li.In that case, two and half acres of land in Bukit\n\nTimah were acquired by the Urban Renewal Authority. Prior to the acquisition, the\n\nowners’ architect had prepared plans for a 27-storey commercial and residential\n\ncomplex and had applied to the authorities for planning permission. After corresponding\n\nwith the relevant authorities, the architect met an officer in the Planning Department,\n\nwho advised him to amend the plans to provide for the construction of a 20-storey complex,\n\nwith 60% of the building allocated for residential purposes. Although no written\n\npermission had been obtained for the proposed amendments, the owners of the acquired\n\nproperty, who made a claim for $16.5m, asserted that as planning permission could\n\nreasonably have been expected to be granted for the multi-storey shopping and residential\n\ncomplex, this should be taken into account for the purpose of determining the market value\n\nof the property. However, the Collector awarded the owners only $631,000. This sum was\n\nincreased to $1,832,484 before the hearing of the appeal against the Collector’s\n\naward. The Appeals Board noted that the main issue before it was whether or not the\n\nproperty should have been valued with the benefit of the planning permission that the\n\nappellants alleged that they would have obtained but for the acquisition of their property\n\nby the Urban Renewal Authority. The Board accepted that the owners had in their hands what\n\nmay be termed \"in principle\" approval for their plans to redevelop the acquired\n\nsite. However, it did not think that the \"in principle\" approval should be taken\n\ninto account for determining the compensation payable to the owners. Sinnathuray J, who\n\ndelivered the decision of the Appeals Board, said at ppliv-lvas follows:There was evidence before the Board that at all material times, all\n\n  that the appellants could be said to have got from the Planning Department at the very\n\n  most was an ‘in principle approval’ of their plans. This however, did not\n\n  necessarily mean that a final approval would have been granted to them.Although it was said that it was reasonable then to expect that\n\n  planning permission would have been granted to the appellants when they had amended their\n\n  plans according to the directives given by the officer from the Planning Department, it is\n\n  a wholly different thing to say that it was certain that they would have been granted such\n\n  planning permission…10.    We are of the view that the approach adopted by\n\nthe Appeals Board inBeauty Park Development (Pte) Ltd v Collector of Land Revenueis\n\ncorrect. The provisional approval granted to Mustaq cannot be equated with written\n\npermission to develop the site. If provisional permission for a proposed plan is to be\n\ntaken into account for the purpose of determining the market value of an acquired\n\nproperty, it will be necessary to evaluate whether or not it is likely that written\n\npermission will eventually be granted after the submission of building plans, and whether\n\nor not the written permission may include restrictions, which have to be taken into\n\naccount. Such speculation is unnecessary and undesirable.11.    We thus remitted the case back to the Appeals\n\nBoard for the compensation payable to Mustaq to be computed on the basis of the written\n\npermission granted for the development of the acquired properties.Sgd:YONG PUNG HOWChief JusticeSgd:CHAO HICK TINJudge of AppealSgd:TAN LEE MENGJudgeCopyright © Government of Singapore."
    }
}