{
    "case_title": "Ricky Charles s/o Gabriel Thanabalan v Chua Boon Yeow",
    "ncitation": "[2002] SGCA 52",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J; \n      Yong Pung How CJ",
    "sections": {
        "Facts": "The appellant and the respondent were involved in a motor vehicle\n\naccident on 25 December 1999. On 18 July 2000, the appellant commenced an action against\n\nthe respondent for damages for personal injuries arising out of the accident. The defence\n\nwas filed on 22 August 2000. Subsequently, about ten months later, on 15 June 2001, the\n\nappellant obtained an interlocutory judgment from the district court, against the\n\nrespondent, by consent, with damages to be assessed. On 11 January 2002, the appellant\n\nfiled an application to transfer the proceedings from the district court to the High\n\nCourt, on the ground that his damages might exceed the jurisdictional limit of the\n\ndistrict court. His application was dismissed by the judicial commissioner in Originating\n\nSummons 46 of 2002/W on the basis that the High Court had no jurisdiction to order the\n\ntransfer, in view of the interlocutory judgment. The judicial commissioner further stated\n\nthat even if the High Court had the jurisdiction to transfer the proceedings,\n\nnotwithstanding the interlocutory judgment, the appellant still had to persuade him to\n\nexercise his discretionary power in the appellant’s favour. He was of the view that\n\nit was too late for the appellant to try and overcome the jurisdictional limit of the\n\ndistrict court via a transfer of the proceedings to the High Court, since the parties had\n\nproceeded and interlocutory judgment was entered on the basis that the damages awarded\n\nwould be circumscribed by the jurisdiction of the district court.",
        "Held,": "dismissing the appeal :(1) Section 18(3) of the SCJA provides very clearly that the powers set\n\nout in the first schedule are to be exercised in accordance with any written law relating\n\nto them. The judicial commissioner had correctly interpreted that, although clause 10 of\n\nthe first schedule gives the High Court very wide powers to transfer proceedings from the\n\ndistrict court to the High Court, it has to be read subject to s 38 of the SCA (see  10)\n\n.(2) The power of the High Court to transfer proceedings from a lower\n\ncourt to itself orvice versais a necessary one, in the interests ofjustice. Nevertheless, such a power should not be exercised liberally.\n\nThe onus is really on a plaintiff to commence his action in the correct court. The\n\nplaintiff, who has commenced his action in the inappropriate court, ought not to be\n\nallowed, without good cause, to simply rectify his own error by applying for a transfer of\n\nproceedings (see  12).(3) Section 38 of the SCA gives the High Court the discretion to\n\ntransfer an entire action, ie the claim, encompassing both the question of liability and\n\nquantum to the High Court. It is not within the spirit of the section, which requires the\n\nmatter to be \"one which should be tried in the High Court\", to permit a\n\ntransfer of a case where interlocutory judgment had already been obtained in the district\n\ncourt, leaving only the quantum to be assessed and what was sought to be transferred to\n\nthe High Court was merely the assessment of damages. This would be to truncate a single\n\nproceeding and blur the distinction between the two jurisdictions. By obtaining an\n\ninterlocutory judgment in the district court, the appellant had affirmed his claim within\n\nthe jurisdiction of that court (see  16).",
        "Case(s) referred to": "Australian Masters Builders Co Pte Ltd v Ng Tai Tuan(1988) 1\n\n  MLJ 273 (refd)"
    }
}