{
    "case_title": "Regenthill Properties Pte Ltd v Management Corporation Strata Title Plan No 2192",
    "ncitation": "[2002] SGCA 32",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J",
    "sections": {
        "The facts": "2        The\n\nappellants, Regenthill Properties Pte Ltd (Regenthill), were the developers of a\n\ncondominium located along Yio Chu Kang Road known as \"Regent Park Development\".\n\nBy the end of December 1996 the construction of the condominium was completed. On 6\n\nJanuary 1997, a temporary occupation permit (TOP) for the condominium was issued by the\n\nrelevant authority. The effect of the issue of the TOP was that the subsidiary proprietors\n\nwere obliged and did pay contributions to a maintenance fund which Regenthill were\n\nrequired to set up under s 9 of the Building and Common Property (Maintenance and\n\nManagement) Act (BCP Act).3        On 20 April\n\n1998, pursuant to s 33 of the LTSA, the MC for the condominium was constituted. Its first\n\nannual meeting was held on 6 May 2000. Shortly after, Regenthill handed over to the MC all\n\nthe documents (including accounting documents) in respect of the period after the\n\nconstitution of the MC. The dispute concerns the documents relating to the maintenance\n\nfund for the period from TOP to the formation of the MC.4        We should\n\nexplain here that even after the establishment of the MC, the developer is still obliged\n\nunder s 34 of the LTSA to undertake the following duties:-(a) open a bank account in the name of the\n\n  MC;(b) cause to be kept such accounting and\n\n  other records as well, inter alia, as would sufficiently explain the transactions and\n\n  financial position of the MC up to the first annual general meeting.The rationale for this provision would\n\nappear to be the recognition by the legislature that while a MC might have been set up it\n\nmay not have, until the first AGM, the means to discharge its duties. Thus the developer\n\nis made to operate the MC account.5        There are\n\ntherefore three distinct periods which one has to bear in mind:-(i) first period : from TOP to the\n\n  establishment of the MC where contributions by subsidiary proprietors are paid into a\n\n  maintenance fund managed by the developer.(ii) second period : from the\n\n  establishment of the MC up to approximately the holding of the first AGM, where\n\n  contributions are paid by the subsidiary proprietor into an account in the name of the MC\n\n  but managed by the developer.(iii) third period : on and after the\n\n  first AGM: the MC will assume all charge of the financial affairs of the condominium.6        On 11 January\n\n2001, the solicitors for the MC wrote to Regenthill, asking, pursuant to s 37(4) of the\n\nAct, for the delivery of the following documents:-(a) all plans, specifications,\n\n  certificates (other than certificates of title for lots), diagrams and other documents\n\n  obtained or received by you and relating to the parcel or building; and(b) if they are in your possession or\n\n  under your control, any notices or other records relating to the subdivided building.7        In response to\n\nRegenthill’s request for particulars of the documents, the solicitor for the MC\n\nfurnished a list. This was followed by a series of correspondence between them. The upshot\n\nof it all was that the parties could not agree whether the MC is entitled to the originals\n\nof the accounting records relating to the management fund (the first period). They\n\nincluded payment vouchers, journal vouchers, cash book, cheque butts, bank statements\n\n(current and multi-link), financial statements, invoice, official receipt, accounts\n\nreceivable, audit reports, fixed deposit slips/statements and bank-in slips. Regenthill\n\neven sought the assistance of the Commissioner of Buildings (under the BCP Act) on the\n\ndispute but the latter was not able to assist. Eventually, Regenthill indicated that they\n\nwere prepared to allow the MC to inspect the accounting documents at their premises but\n\nthe documents could not be transferred as the property in the documents remained vested in\n\nthem.8        It soon became\n\ninevitable that the MC had to file an Originating Summons to have the issue determined,\n\nwhich it did. At the hearing, the MC also orally asked for the contracts relating to\n\nvarious matters (cleaning, security, management and staff). Giving it a purposive\n\ninterpretation, the judge ruled that most of the documents asked for by the MC came within\n\nthe scope of s 37(4)(b). She said:-\"On a purposive interpretation, it is\n\n  hard to envisage that Parliament, in enacting the section, intended only for documents\n\n  such as plans, certificates and diagrams and other documentsejusdem generiswith\n\n  this class of documents to be handed over to the management corporations. Under the Act,\n\n  upon the formation of a management corporation, the same takes over control, management\n\n  and administration of the common property as well as its records and accounts. In order to\n\n  properly exercise its powers and perform its duties and functions, a management\n\n  corporation would need to have possession of necessary records relating to the subdivided\n\n  building, including accounting records.\"9        The trial\n\njudge held that the originals of the following documents be delivered to the MC:-(a) Contract on cleaning services(b) Contract on Security(c) Water and electricity bills(d) Contract on management fees(e) Contract on staff costs(f) Printing/stationery and postages(i) payment vouchers(ii) journal vouchers(iii) cash book (soft copies or print out\n\n  copies)(iv) invoices/statements(v) official receipts(vi) accounts receivables/interest\n\n  computation(vii) fixed deposit slips (photocopies\n\n  only)(viii) bank-in slips",
        "Issues": "10        The\n\nsubstantive issue formulated by Regenthill is as follows:-\"Whether Regenthill are obliged under\n\n  s 37(4) to deliver up the original copies of the contracts and accounting records relating\n\n  to the maintenance fund to the MC.\"Regenthill accept that they are obliged in\n\nlaw to allow the MC to inspect the accounting records and to make copies thereof. So the\n\nbattle line is drawn on just the narrower issue as to whether Regenthill are obliged to\n\nhand over the originals of the accounting documents to the MC.11        However,\n\nbeside this, Regenthill have also raised two preliminary/procedural issues, which they\n\nalso did in the hearing below. First, they say that the Originating Summons (OS)\n\ninstituting the proceeding is flawed because it did not identify the specific classes of\n\ndocuments which the MC would want Regenthill to deliver, thus contravening O 7 r 3(1) of\n\nthe Rules of Court. Second, they contend that the MC does not have the right to commence\n\nan action under s 37(4). Before the court below, both issues failed. We shall deal with\n\nthem in turn.",
        "Regularity of OS": "12        To determine\n\nthis issue, it is necessary for us to set out the provisions of O 7 r 3(1) as well as the\n\nprecise formulation of the OS:-\"3(1) Every originating summons must\n\n  include a statement of the questions on which the plaintiff seeks the determination or\n\n  direction of the Court or, as the case may be, a concise statement of the relief or remedy\n\n  claimed in the proceedings begun by the originating summons with sufficient particulars to\n\n  identify the cause or causes of action in respect of which the plaintiff claims that\n\n  relief or remedy.\"13        In the OS,\n\nafter reciting ss 37(4), 65 and 121 of the LTSA at the heading, the MC sought an order to\n\ncompel Regenthill to deliver the following:-\"(i) all plans, specifications,\n\n  certificates (other than certificates of titles for the lots), diagrams and other\n\n  documents obtained or received by the Defendants relating to Regent Park Condominium;(ii) any notices or other records relating\n\n  to Regent Park Condominium, other than any such documents which exclusively evidence\n\n  rights or obligations of the Defendants and which are not capable of being used for the\n\n  benefit of the Plaintiffs or any of the subsidiary proprietors, other than the\n\n  Defendants.\"14        Essentially,\n\nthe point made by Regenthill is that the OS only stated in very vague and broad terms what\n\nthe MC wanted and did not identify the specific classes of documents which Regenthill are\n\nrequired to deliver. They relied upon the High Court decision inEngineering\n\nConstruction Pte Ltd v AG[1993] 1 SLR 390.15        It will be\n\nseen that under O 7 r 3(1) there are two alternative manners in which a plaintiff in an OS\n\ncould formulate his case. One is to include a statement as to the question on which the\n\ncourt’s determination is sought (first limb). The other is to set out concisely the\n\nrelief or remedy claimed, with sufficient particulars to identify the cause or causes of\n\naction (second limb). Having regard to the manner in which the present OS is formulated it\n\nis clear that it does not fall under the first limb.16        The question\n\nis: does the OS, as filed, fulfil the second limb? Regenthill contend that it was only in\n\nthe affidavit filed in support of the OS did the MC list out the classes of document which\n\nthe MC wanted. They submit that these particulars should have been stated in the OS. While\n\nin a broad sense the basis of the claim is indicated, as the OS has cited s 37(4), we\n\nwould agree with Regenthill that the relief claimed lacks sufficient particulars.\n\nComparing the two prayers in the OS with s 37(4) (set out later at 29), it is apparent\n\nthat the MC had merely copied the provisions of that section. It should have identified\n\nthe classes of documents which it required Regenthill to deliver. It did this only in the\n\naffidavit in support. Any person reading the OS would not know the specific types of\n\ndocuments which the MC is seeking. Accordingly, the OS is defective. The fact that the\n\nspecifics were given in the affidavit does not cure the defect.17        As indicated\n\nin 9 above, six additional classes of documents, besides those set out in the affidavit,\n\nwere also asked for orally at the time of the hearing and in respect of which an order was\n\ngranted by the court below. Although the appellants had lodged the appeal, they had\n\nnevertheless on 26 December 2001 handed these six classes of document to the MC.18        What then is\n\nthe effect of non-compliance with O 7 r 3(1)? The answer is to be found in O 2 r 1(1)\n\nwhich provides that \"where, … there has, by reason of anything done or left\n\nundone, been a failure to comply with the requirements of these Rules, whether in respect\n\nof … form or content … the failure shall be treated as an irregularity and shall\n\nnot nullify the proceedings.\" Under r 1(2), where there is such a failure, the court\n\nmay set aside the proceeding wholly or allow amendments to be made.19        In the court\n\nbelow, the judge seemed to think that the OS is in order. She said:-\"In my view, the plaintiffs, in\n\n  listing down the types of accounting documents which they required, had given sufficient\n\n  particulars to identify the cause of action in the originating summons. It would be most\n\n  unreasonable to require the plaintiffs to further itemise every single specific document\n\n  in the categories which they had listed, as the plaintiffs could not be expected to be\n\n  able to identify specific documents which were not in their possession.\"20        With respect,\n\nwe think she misunderstood the contention of Regenthill. From the passage cited above, it\n\nis clear that she thought Regenthill were saying that particulars of each document should\n\nbe set out in the OS when they were only asking that the categories or classes of document\n\nbe set out, as the MC did in its affidavit in support.21        Be that as it\n\nmay, there are two reasons why this objection has to be rejected. First, under O 2 r 2, it\n\nis provided that an application to set aside for irregularity \"shall not be allowed\n\nunless it is made within a reasonable time and before the party applying has taken any\n\nfresh step after becoming aware of the irregularity.\" Regenthill should have objected\n\nupon being served with the OS. Instead, they proceeded to file their substantive affidavit\n\nin response. Having taken a \"fresh step\" in the proceeding, it shall be deemed\n\nthat they had waived that irregularity; seeRein v Stein(1892) 66 LT 469 at 471\n\nandOng Heok & Anor v Ooi Bee Tat & Ors[1982] 2 MLJ 326. It was too late\n\nto raise it at the time of the hearing.22        Second, even\n\nif the point was raised timely, the court would not have exercised its discretion to set\n\naside the OS for non-compliance. Although spelling out in the affidavit the classes of\n\ndocument required to be delivered does not regularise a defective OS, it nevertheless does\n\nindicate clearly to the defendants what the plaintiff, in fact, wants. Such an\n\nirregularity is in no sense serious. As far as Regenthill were concerned, they were not\n\nprejudiced. They knew the case they had to meet notwithstanding that the MC even made some\n\noral additions at the hearing. We find support for this approach from the case,Metroinvest\n\nAnsalt v Commercial Union[1985] 1 WLR 514, where Cumming-Bruce LJ said,\"I would say that in most cases the\n\n  way in which the court exercises its powers under Order 2, rule 1(2) is likely to depend\n\n  upon whether it appears that the opposite party has suffered prejudice as a direct\n\n  consequence of the particular irregularity, that is to say, the particular failure to\n\n  comply with the rules. But I would construe Order 2, rule 1(2) as being so framed as to\n\n  give the court the widest possible power in order to do justice …\"23        We are\n\nconfident that if the judge had not misunderstood the point taken, she would have given\n\nleave to the MC to amend, as we ourselves would be inclined to do. But the proceedings\n\nhaving come to this stage, we see no point in granting leave to the MC to amend.24        The caseEngineering\n\nConstruction,relied on by Regenthill, concerned proceedings relating to the\n\nconstruction of a contract. There, on the facts, the High Court held that the originating\n\nsummons contained enough particulars to identify the cause of action as it referred to a\n\ncontractual clause in issue and the relief sought.",
        "Right to institute proceedings": "25        This point\n\nrests entirely on s 39 of the Interpretation Act which provides that –\"The imposition of a penalty by any\n\n  written law, in the absence of express provision to the contrary, shall not relieve any\n\n  person from liability to answer for damages to a person injured.\"26        Regenthill\n\nargued that this section implies that, where there is criminal sanction for contravention\n\nof a written law, like s 37(4) read with s 37(8), no civil suit may be brought by any\n\nother person unless the latter has been injured or suffered damages. In the present case,\n\nas it has not been alleged that the MC was injured or suffered damages the MC are,\n\ntherefore, not entitled to commence the present action.27        This point is\n\nwholly without merit and was rightly rejected by the court below. It is based on a\n\nmisunderstanding of the scope of s 39. This section is merely a provision to clarify\n\nmatters. It does not seek to take away the rights of any party. We endorse the following\n\nviews expressed by the judge (except in relation to the scope of s 37(4) which will be\n\ndealt with next):-\"In my view, s 39 of the\n\n  Interpretation Act is merely a clarification provision which makes it clear that even when\n\n  there is an imposition of penalty, civil recovery is not necessarily denied. However, it\n\n  does not mean that only when there are damages, would one be allowed to bring a civil\n\n  action. Section 37(4) of the Act imposes a duty on the proprietor of the land to hand over\n\n  certain documents to the management corporation. In this case, the cause of action lies in\n\n  requiring the delivery-up of documents which the plaintiffs believed to fall within the\n\n  ambit of s 37(4). Section 39 of the Interpretation Act should not be used to limit the\n\n  positive obligation found in s 37(4) of the Act to deliver up documents required by the\n\n  management corporation, otherwise, the provision would be rendered otiose when it was\n\n  meant for the party entitled to the documents i.e., the management corporation to sue for\n\n  the same. The plaintiffs need not show that damages have been suffered before they can\n\n  bring this application.\"",
        "Construction of s 37(4)": "28        We now turn\n\nto the substantive question of this appeal. The problem arose because under the LTSA,\n\nsubsidiary proprietors of units in a condominium are allowed to take possession when the\n\ntemporary occupation permit (TOP) is issued by the relevant authorities. Between the issue\n\nof the TOP and the establishment of the MC, the developer is required to establish a\n\nmaintenance fund, into which contributions from the subsidiary proprietors of the units\n\nwithin the condominium are to be paid and which fund is to be used for the maintenance of\n\nthe undivided building and the common property. Once the MC is established, it will take\n\nover the functions of the developer in that regard and the developer shall transfer any\n\nremaining money in the maintenance fund to the MC: see ss 9 and 10 of BCP Act and s 34 of\n\nthe LTSA.29        As the issue\n\nconcerns the interpretation of s 37(4) of the LTSA, we shall set it out in full:-The proprietor of the land comprised in a\n\n  strata title plan shall deliver to the management corporation at its first annual general\n\n  meeting –(a) all plans, specifications,\n\n    certificates (other than certificates of title for the lots), diagrams and other documents\n\n    obtained or received by him and relating to the parcel or building, and,(b) if they are in his possession or under\n\n    his control, any notices or other records relating to the subdivided building.other than any such documents which\n\n  exclusively evidence rights or obligations of the proprietor and which are not capable of\n\n  being used for the benefit of the management corporation or any of the subsidiary\n\n  proprietors, other than the proprietor.\"The judge found that the accounting\n\ndocuments requested came within the ambit of s 37(4)(b).30        Before us the\n\nmain contention of Regenthill is that the accounting documents relating to the maintenance\n\nfund are not \"notices or other records relating to the subdivided building\"\n\nwithin s 37(4)(b). They say that the maintenance fund is for the upkeep of the common\n\nproperty and the subdivided property and as s 37(4)(b) only refers to notices and other\n\ndocuments relating to the subdivided building, that clearly indicates that documents\n\nrelating to the common property and the maintenance fund are not within contemplation.31        They pointed\n\nout that \"subdivided building\" is defined in the LTSA to mean any one or more\n\nbuildings comprised in a strata subdivision plan approved by the relevant authority. On\n\nthe other hand \"common property\" is defined as –\"(a) in relation to subdivided\n\n  buildings in an approved plan bearing the title of \"condominium\" and issued by\n\n  the relevant authority, means so much of the land for the time being not comprised in any\n\n  lot shown in a strata title plan or in any parts of any building unit (partially erected\n\n  or to be erected) intended to be included as lots in a strata title plan to be lodged with\n\n  the Registrar after strata subdivision of the building unit has been approved by the\n\n  relevant authority;..(c) unless otherwise described\n\n  specifically as comprised in any lot in a strata title plan and shown as capable of being\n\n  comprised in such lot, includes –(i) foundations, columns, beams, supports,\n\n  walls, roofs, lobbies, corridors, stairs, stairways, fire escapes, entrances and exits of\n\n  the building and windows installed in the external walls of the building;\"32        From these\n\ndefinitions, Regenthill contended that while the \"subdivided building\" would\n\ninclude some parts of the common property, it does not encompass all the common property.\n\nThe maintenance fund required to be set up by the developer as provided in s 9 of the BCP\n\nAct is intended for maintenance of the \"subdivided building\" and \"common\n\nproperty\". As non-compliance with s 37(4) would attract penal sanction, a strict\n\ninterpretation should be adopted. Regenthill also refer to the equivalent New South Wales\n\nprovisions to support their contention.33        We must, at\n\nthis stage, point out that this argument, based on the distinction between\n\n\"subdivided building\" and \"common property\" was not taken at the\n\nhearing below. It is a new point. Before the judge, the contention centred on the\n\napplication of theejusdem generisrule to the construction of s 37(4). Having said\n\nthat, it does not mean that this argument, which is a point of law, may not be raised in\n\nthis appeal (see O 57 r 9A[4]).",
        "\"Common property\" and\n\n\"subdivided building’": "34        Central to\n\nthe contention of the appellants is the issue whether there is a difference between\n\n\"subdivided building\" and \"common property\". As defined, a subdivided\n\nbuilding effectively refers to any building in a strata title plan. Of course, a building\n\nwould include,inter alia, foundations, columns beams, walls, roofs, lobby,\n\ncorridors, stairways. As these are also part of the common property as defined, it is true\n\nto say that a subdivided building or buildings would include some parts of the common\n\nproperty. But as not all the common property in a strata title plan is found in a\n\nsubdivided building, and notwithstanding some overlap, the two terms are distinct\n\nconcepts.35        Section 34(a)\n\nof the LTSA refers to the maintenance fund set up by the developer as being a fund\n\n\"for the maintenance of the subdivided building and the common property\".\n\nClearly the draftsman of the LTSA viewed the \"subdivided building\" as being\n\ndistinct from the \"common property\", even though some parts of the\n\n\"undivided property\" are also common property. This distinction is also\n\nmaintained in section 35(1) of the LTSA which refers to contributions made by subsidiary\n\nproprietors to the MC for the maintenance of the subdivided building and the common\n\nproperty. There are, therefore, merits in the argument that if the draftsman had intended\n\nto refer to the maintenance fund he would have referred to the common property as well,\n\ninstead of only the subdivided building. Indeed, if the accounts of the maintenance fund\n\nwere contemplated, there is no reason why the draftsman would not refer expressly to the\n\nmaintenance fund.36        We are\n\nreinforced in this view when we trace the source of s 37(4). It was added to the LTSA in\n\n1987. Indeed the entire Part IV of the LTSA on \"Management of the Subdivided\n\nBuilding\" was revised extensively and re-enacted by the 1987 Amendment Act. Section\n\n37(4) would appear to have been modelled after s 57(4) of the New South Wales Strata Tiles\n\nAct (NSW Act). The initial version of s 57(4) (1973 version) reads:-\"An original proprietor shall not\n\n  fail or neglect to deliver to the body corporate at its first annual general meeting\n\n  –(a) all plans, specifications,\n\n  certificates (other than certificates of title for lots), diagrams and other documents\n\n  (including policies of insurance) obtained or received by him and relating to the parcel\n\n  or building; and(b) If they are in his possession or under\n\n  his control,the certificate of title for the common property, the strata roll, the\n\n  books of accountand any notices or other records relating to thestrata scheme.other than any such documents which\n\n  exclusively evidence rights or obligations of the original proprietor and which are not\n\n  capable of being used for the benefit of the body corporate or any of the proprietors,\n\n  other than the original proprietor.\" (emphasis added).37        In 1984, s\n\n57(4)(b) of the NSW Act was amended, and a new subsection 4(c) added, as follows:-\"(b) if they are in his possession or\n\n  under his control, the certificates of title for the common property, the strata roll and\n\n  any notices or other records relating to the strata scheme; and(c) the accounting records kept pursuant\n\n  to s 68(1)(g) and the last preceding financial statements prepared in accordance with s\n\n  68(1)(h) …38        At the time\n\nour Parliament enacted the revised Part IV and added s 37(4), it would have been aware of\n\nthe two versions of the NSW provisions. It would appear that the draftsman chose to follow\n\nthe 1973 version but deleting the reference to \"certificate of title for the common\n\nproperty, the strata roll, the books of account.\" The term \"strata scheme\"\n\nis defined in the NSW Act to cover the whole scheme of development, including \"the\n\nmanner of division … of a parcel into lots and into lots and common property.\"\n\nIt seems to us that the equivalent to \"strata scheme\" in our Act is \"strata\n\ntitle plan\". Why did the draftsman delete the reference to \"books of\n\naccount\"? Why did it adopt just \"subdivided building\" instead of\n\n\"subdivided building and common property\" or \"strata title plan\"?\n\nObviously, he must have had something different in mind. After all, just a couple of\n\nsections before [in ss 34(a) and 35(1)] the draftsman had referred to \"subdivided\n\nbuilding and common property\".39        In any case,\n\nlooking at s 37(4) as a whole, in relation to both limbs (a) and (b) therein, it seems to\n\nus clear that the subsection has nothing to do with the maintenance fund or the\n\nmaintenance of the common property. It has all to do with title, rights and designs of the\n\ncondominium and subdivided building. We also think it rather odd that the draftsman would\n\nhave referred to the accounting documents relating to the maintenance fund as \"any\n\nnotices or other records relating to the subdivided building.\"40        For\n\ncompleteness, we would add that we agree with the judge below that those same accounting\n\ndocuments could not, applying theejusdem generisrule, come within the meaning of\n\n\"other documents\" in limb (a) of s 37(4).",
        "Common Law": "41        It will be\n\nrecalled that it is s 9 of the BCP Act which requires the developer to set up a\n\nmaintenance fund upon the issuance of TOP. Section 10(2) of the BCP Act provides that the\n\ndeveloper shall hold all moneys in the maintenance fund on trust for the subsidiary\n\nproprietors. Section 10(4) requires the developer to transfer the surplus moneys in the\n\nmaintenance fund to the MC upon its establishment. However, s 10 does not state what would\n\nbe the position with regard to the accounting documents relating to the maintenance fund.\n\nIt seems to us that the answer is to be found in common law. We would be inclined to think\n\nthat s 10(4) of the BCP Act and s 34(a) of the LTSA only provide for the transfer of the\n\nmoney in the maintenance fund to the MC upon its establishment because the position of the\n\naccounting documents in relation thereto is abundantly clear under general principles.42        The judge\n\nbelow who also relied upon general principles to order Regenthill to release the documents\n\nsaid:-As trustee of the maintenance fund, a\n\n  developer would have to be accountable to the owners and purchasers of all the flats in a\n\n  condominium for the monies in the maintenance fund. As representative of the owners and\n\n  purchasers of all the flats in the condominium, the properly constituted management\n\n  corporation has a right to ensure such accountability on the part of the developer.43        Regenthill\n\nargued that the judge below had over-extended the duty of a trustee as far as delivering\n\ntrust documents is concerned. They said that a beneficiary is only entitled to see and\n\ninspect the accounts and if he wants a copy he must pay for it. For this proposition they\n\nrelied onOttley v Gilby(1845) 8 Beav 602. They also relied on a passage inHanbury\n\n& Martin on Modern Equity (14thEdn)at p. 539 where this principle is\n\nrecited.44        With respect,\n\nwe think that counsel for Regenthill has misappliedOttley v Gilbyto the fact\n\nsituation in the present case. Here is not a case where a beneficiary requests to see the\n\naccounts of the trust or the delivery of trust documents. The true position here is that\n\nthe MC has become the new trustee in place of Regenthill and is asking for all documents\n\nrelating to the trust. In as much as moneys in a trust do not belong to the trustee (in\n\nthis case Regenthill), so are the documents of the trust. Trust assets would include trust\n\ndocuments.45        While there\n\ncould be some difficulties in defining \"trust documents\", as recognised by\n\nSalmon LJ inIn Re Londonderby’s Settlement[1965] 918 at 938, he nevertheless\n\nventured to suggest that they would have these common characteristics:-(1) they are documents in the possession\n\n  of the trustees as trustees; (2) they contain information about the trust which the\n\n  beneficiaries are entitled to know; (3) the beneficiaries have a proprietary interest in\n\n  the documents and, accordingly, are entitled to see them.\"There cannot be any dispute that all three\n\ncharacteristics are satisfied in relation to the documents of account asked for by the MC.46        Under s 10(4)\n\nof the BCP Act, upon the establishment of the MC, Regenthill were obliged to pay into the\n\nbank account of the MC the surplus moneys in the maintenance fund. This means that\n\ntrusteeship has come to an end and all moneys and related documents must be passed over to\n\nthe successor trustee. It stands to reason that the MC, as the person stepping into the\n\nshoes of Regenthill, should be entitled to have all the records of the trust. The\n\nfollowing passage in Regenthill’s Case demonstrates that they have miscomprehended\n\nthe position:-If the Appellants are obliged to hand over\n\n  the original accounting documents before the constitution of the Respondents by reason\n\n  that they are trustees of the maintenance moneys, this would mean that each and every\n\n  subsidiary proprietor will be entitled to ask for delivery up of the original accounting\n\n  documents as the monies in the maintenance fund is held on trust for owners and purchasers\n\n  of all the flats in the development according to s 10(2) of the BCPMMA. Surely, this\n\n  cannot be correct and could impose an administratively onerous and impossible burden on\n\n  the Appellants since condominiums may have hundreds of units. Hence, the Appellants submit\n\n  that at best, the owners, subsidiary proprietors and/or the Respondents are only entitled\n\n  to inspection of these records and should they require copies, to be furnished copies. The\n\n  originals of these accounting records should remain with the Developers.The MC is not a \"beneficiary\" or\n\n\"subsidiary proprietor\".47        It is settled\n\nlaw that the new trustees are entitled to all the documents of the trust.Lewis on\n\nTrusts (17thEdn)states at 12-55 that \"a new trustee is entitled to\n\nrequire the outgoing trustees to deliver up to him all records, books and other papers\n\nbelonging to the trust\" and cites in support of this proposition the caseTiger v\n\nBarclays Bank Ltd[1952] 1 All ER 85.48        InWentworth\n\nv De Monsfort & Ors[1988] 15 NSWLR 348, the Court of Appeal of New South Wales\n\nheld that where a solicitor was acting only as an agent for a client who was his principal\n\nin the doing of some act, the ordinary rules of agency applied to him and a document\n\nbrought into existence or received by him when so acting belonged to the client. Hope JA\n\nsaid (at 356):-Normally when a trustee ceases to hold\n\n  office, either on appointment of a new trustee or the determination of the trust, he would\n\n  be required to handover all trust property, including documents and financial records, to\n\n  the new trustee, or to the sole beneficiary or all the beneficiaries if more than one, if\n\n  required to do so. InRe Cowin(1886) 33 Ch D 179 at 185, North J quoted with\n\n  approval the following passage inLewin on Trusts, 8thed (1885) at 975:\n\n  \"All documents held by the trustee in that character must be produced by him to thecestuis\n\n  que trust, who in equity are the true owners.\" This position would generally\n\n  apply to a trustee who is a solicitor, but there are important qualifications in some\n\n  cases. If he is solicitor for the client as well as trustee, he is required by law (as I\n\n  shall describe later) to maintain and to retain proper financial records. He is entitled\n\n  to retain these records, some of which may refer to other clients as well as the trust but\n\n  the beneficiary should be provided with copies if asked for.49        Counsel for\n\nRegenthill argues that the situation here comes within the exception referred to by Hope\n\nJA. For this contention, Regenthill rely upon s 10(5) of the BCP Act which provides:-The developer shall –(a) cause proper books of accounts to be\n\n  kept in respect of all sums of money received for and all payments out of the maintenance\n\n  fund, specifying the matters in relation to which the receipts and expenditure take place;(c) file with the Commissioner a certified\n\n  true copy of the audited accounts within 28 days of the accounts being audited;(d) permit the Commissioner, or any person\n\n  authorised by him to act on his behalf, at all reasonable times full and free access to\n\n  accounting and other records of the maintenance fund and permit the Commissioner or the\n\n  person to make copies or make extracts from those accounting or other records; and(e) furnish a certified true copy of the\n\n  accounts to the Commissioner at such intervals as may be required by the Commissioner.50        It would\n\nappear that the exception referred to by Hope JA is a narrow one and relates to the\n\nspecial position of a solicitor. Here Regenthill were trustees simpliciter of the\n\nmaintenance fund although the trust was imposed under the BCP Act. While it is true that\n\nunder s 10(5), the Commissioner had the responsibility of ensuring that Regenthill\n\ndischarged their duties of trustee properly, this, in our view, must relate to the period\n\nwhile Regenthill were the trustees of the fund. Upon the closure of the maintenance fund,\n\nwith the moneys therein being transferred to the account of the MC, the trusteeship ended.\n\nAt that point, Regenthill must hand everything relating to the trust, including the\n\ndocuments, to the MC and account to the MC in respect of the transactions effected while\n\nthe maintenance fund was under their stewardship.51        It seems to\n\nus clear that s 10(5) is to ensure that the interests of the subsidiary proprietors are\n\nprotected during the interim period between the issue of the TOP and the constitution of\n\nthe MC. While we see that s 10 of the BCP Act does not deal expressly with the question of\n\nthe accounting documents of the trust, it is our opinion that this point is not expressly\n\naddressed because it is a settled principle that where there is a change of stewardship,\n\nthe documents of account of a trust must follow the trust and be delivered to the new\n\ntrustee. We agree with the following observations of the judge below:-\"… a plain reading of s 10(5) of\n\n  the Management Act makes it patently clear that it does not impose any obligation on the\n\n  developer to keep the accounts continually or exclusively. Section 10(5) merely requires\n\n  the developer to have proper accounts in respect of the maintenance fund and to file the\n\n  audited accounts with the Commissioner. The Commissioner is empowered under the section to\n\n  verify the accounts. However, it is my view that the developer only remains accountable to\n\n  the Commissioner for the period of which he (the developer) is in charge of the monies in\n\n  the maintenance fund.All the remaining monies in the\n\n  maintenance fund have to be transferred over to a management corporation upon its\n\n  formation. Thenceforth, it would be the management corporation who would be managing the\n\n  funds for the benefit of the subsidiary proprietors or residents of the condominium. It\n\n  seems rather nonsensical to say that the developer has to continue to keep proper accounts\n\n  of a fund of which he is no longer in control and that the Commissioner could verify such\n\n  accounts.\"",
        "Section 199 of the Companies Act": "52        The final\n\nargument of Regenthill concerns s 199 of the Companies Act which requires a company to\n\nkeep such accounting and other records \"as will sufficiently explain the transactions\n\nand financial position\" of the company for a period of 7 years after the completion\n\nof the transactions. Therefore, they cannot part with the physical possession of the\n\naccounting records relating to the maintenance fund.53        There is a\n\nserious flaw in this argument. The documents to which s 199 applies are those relating to\n\nthe \"transactions and financial position\" of the company. As far as the moneys\n\nin the maintenance fund are concerned, Regenthill stands in the position of a trustee.\n\nDocuments relating thereto are not documents relating to the \"transaction and\n\nfinancial position\" of Regenthill but to a fund in respect of which s 10 of the BCP\n\nAct has rendered Regenthill to be a trustee. The \"transactions\" which Regenthill\n\nhad undertaken on behalf of the maintenance fund were not the transactions of Regenthill.\n\nThey did not affect the financial position of Regenthill. The records maintained by\n\nRegenthill in respect of those transactions were clearly records maintained under s 10(5)\n\nof the BCP Act. With respect, the reference to s 199 of the Companies Act is a red\n\nherring.",
        "Judgment": "54        In the result\n\nthe appeal is dismissed. On the question of costs, the following two points need to be\n\nnoted. First, the MC made the application essentially on the ground of s 37(4) of the\n\nLTSA, and the parties’ submissions were largely on the construction of that section,\n\neven though the judge in coming to her decision also, to an extent, relied on common law.\n\nSecond, the argument which Regenthill raised before us in relation to s 37(4)(b) was not\n\nraised in the court below. How the court below would have construed s 37(4)(b) had this\n\nargument been raised is a matter of speculation. In the circumstances, even though the\n\nappellants have failed, we do not think the MC should obtain full costs of the hearing\n\nhere and below as the MC has failed on its main point, the construction point. Viewing the\n\nmatter as a whole, we think a fair order would be that the respondent, the MC, shall only\n\nhave 40% of the costs, here and below. The security for costs, together with any accrued\n\ninterest, shall be released to the MC to account of the latter’s costs.Sgd:CHAO HICK TIN\n\n        TAN LEE MENGJUDGE OF APPEAL    JUDGECopyright © Government of Singapore."
    }
}