{
    "case_title": "Ler Wee Teang Anthony v Public Prosecutor",
    "ncitation": "[2002] SGCA 23",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J; \n      Yong Pung How CJ",
    "sections": {
        "The evidence for the prosecution": "3.    At the material times, Anthony and Annie were husband and wife,\n\nbut were by then separated for almost a year and a half. Divorce proceedings were\n\nimminent. They had a daughter, now aged 4. Annie and her daughter were then living with\n\nAnnie’s parents and her brother at #04-52 Block 923, Hougang Avenue 9, Singapore.4.    Annie was a full-time insurance agent with AIA. On 14 May 2001,\n\nshe returned home from office at about 11.00 pm. Her mother and brother were at home.\n\nAfter her shower, she received a call in her bedroom. She then left the flat in her night\n\ndress, having informed her mother that she was going downstairs to sign some documents\n\nbrought by Anthony. Annie’s daughter went down with her. As neither she nor Anthony\n\nbrought a pen, she took the documents and went up in the lift, intending to sign the\n\ndocuments at the flat and then bringing them down. She left her daughter with Anthony. On\n\nthe fourth floor, as she emerged from the lift and walked towards her mother’s flat,\n\nZ attacked her from the rear, slashing her neck and stabbing her at the chest. Thereafter\n\nhe fled. Her screams were heard by her mother who did not know then that they were from\n\nher daughter. Her mother opened the door to take a look. At that point, Annie managed to\n\nstruggle back to the flat and before she collapsed onto her mother, she told her in\n\nCantonese that she had been stabbed.5.    The screams of Annie were also heard by Anthony who rushed up with\n\nthe daughter to the flat. He appeared shocked when he saw Annie’s condition. Soon the\n\nambulance arrived and Annie was brought to Tan Tock Seng hospital accompanied by Anthony.\n\nSeveral hours later, Annie succumbed to her injuries. The cause of death was established\n\nby the Forensic Pathologist to be \"acute haemorrhage due to stab wounds of heart and\n\nlung.\"6.    The Police soon arrived at the scene to investigate. They could\n\nnot find the weapon even after extensive search of the block and the surrounding areas.\n\nHowever, at the third floor lift landing they found a piece of newspaper folded in a\n\nrectangular shape. It was the front and back pages ofThe New Paperof 23 April\n\n2000, with a tear at the front page and this was later established to be a page taken from\n\nAnthony’s home.7.    On 16 May 2001 a search was carried out by the Police at\n\nAnthony’s HDB maisonette at Pasir Ris. In the living room there was a stack ofThe\n\nNew Paperon a table and on top of the pile was the 23 April 2001 issue with the\n\nfollowing pages 5-34 and 39-44. Also on the table was a crushed sheet of the same issue\n\nconsisting of pp 3-4 and 45-46. The other pages 35-38 of the same issue were found in a\n\nfile containing cuttings on horse racing. So what were missing from that issue ofThe\n\nNew Paperwere the front and back pages. An analyst at the Centre for Forensic\n\nScience, Health Sciences Authority, having examined the piece ofThe New Paperof\n\n23 April 2001 found on the third floor and the sheets of the same issue found in\n\nAnthony’s home, came to the conclusion that they were from a complete set of the\n\nnewspaper of 48 pages as the manufacturing cutting edges of the sheets fit perfectly.8.    Because Anthony told the Police that on 13 May 2001 he was with\n\ntwo of his friends, Gavin Ng and Z, the latter were interviewed by the Police. At an\n\ninterview on 18 May 2001, Z admitted to being the assailant but said that he killed Annie\n\nat the instigation of Anthony. Among the things the Police seized from Z’s home that\n\nday was a Japanese knife and a zip-locked bag. The following was Z’s statement\n\nwritten in his own handwriting:-On the 14thMay 2001, I left my friend’s house at about\n\n  9 pm. I went home to bathe and went over to Anthony’s house to meet him and we went\n\n  to Hougang Street 91 Block 923. He went to the coffeeshop then he told me to wait for his\n\n  ex-wife under her block. I saw her alight from the taxi but I couldn’t do it because\n\n  I don’t wish to. I called him and he said that he would meet her again under her\n\n  block. He then told me to wait for her at the staircase. He told me to kill her even if\n\n  his ex-wife was with their daughter. But I saw her with her daughter so I didn’t do\n\n  it. Later she went up alone and I took the chance. I slashed the neck and stabbed her,\n\n  then I went down the stairs and took a cab to Pasir Ris beach, there I threw the knife\n\n  into the dustbin and took a slow walk home, thinking of the inhuman deed I have done to an\n\n  innocent women. I went home, took a bath and went down to Macdonald’s to meet my\n\n  friend.9.    Pursuant to this statement by Z, Anthony was arrested on the same\n\nday. He denied any involvement in the murder of Annie.Statement of Z10.    Subsequently, altogether 12 statements were recorded from Z,\n\nincluding the cautioned statement. Statements were also recorded from the other boys. A\n\nsummary of what they said in the statements is hereinafter set out. But in order to\n\nappreciate how Anthony went about plotting the murder, some details would have to be gone\n\ninto.11.    Z first befriended Anthony when he was ten years old. Anthony was\n\nthen staying in a block opposite to his which was Block 109, Pasir Ris Street 11. Later,\n\nAnthony moved to Block 116 which was also in the same vicinity. Z’s friends then were\n\nGavin Ng (Gavin), Kong Ka Cheong (Ka Cheong), Vickneswaran (Vick) and Seah Tze Howe (Tze\n\nHowe). They are hereinafter referred to collectively as \"the boys\". Their usual\n\nhang out was at the McDonald’s restaurant (McDonald’s) at Block 444, Pasir Ris\n\nDrive 6. A few girls (Melissa, Michelle and Joanna) sometimes joined them. Anthony\n\nsocialised with them there. Anthony was a jovial person and the boys enjoyed his company.12.    It was at a gathering, during the first week of May 2001, when\n\nthe boys were talking of fighting and killing, that Anthony challenged them if they dared\n\nto kill people. The boys asked if there was any reward. Gavin mentioned $100,000. Anthony\n\nsaid he was willing to pay that amount. When asked who did Anthony want to be killed, he\n\nreplied it was his wife. He said he could offer to pay if he were to sell off his\n\nmaisonette, which had an estimated value of $470,000. While talking, Anthony was smiling\n\nand then said he was only joking. However, he also uttered that he wished his wife was\n\ndead.13.    On 9 May 2001 at about 12.30pm, Anthony, Z and Gavin were again\n\nat McDonald’s. Anthony again raised the matter about killing his wife. This time his\n\ntone was serious. He told them that he was a professional killer and had killed five\n\npeople before. Anthony also taught them how to go about doing it – use a full-face\n\nhelmet, bring a pair of gloves, preferably woollen, and a zip-lock plastic bag to hold the\n\nknife and the victim’s wallet (so as to make it look like a robbery), the route to be\n\nused, how to dispose of the knife, the wallet and clothing, and the identity card of his\n\nwife was to be sent back to her home (same as Anthony’s address as Annie had not yet\n\nchanged her NRIC address) with a note saying \"sorry etc\". As between Z and\n\nGavin, Anthony thought the latter was more stable and daring and thus better able to carry\n\nout the assignment but Z felt hurt and jealous and offered to do it.14.    Z then left, leaving Anthony and Gavin behind. Anthony indicated\n\nto Gavin that he preferred the job be carried out by Gavin. Anthony persistently asked\n\nGavin to kill his wife and the latter said he would think about it. At Anthony’s\n\nsuggestion, Gavin went to Anthony’s home where Anthony showed Gavin how to carry out\n\nthe killing with the use of a knife, either from the front or from the rear of the victim.\n\nGavin left Anthony’s home at about 7.00pm. He did not reply to Anthony whether he was\n\nprepared to do the killing. Later that evening, Gavin spoke over the phone with a female\n\nfriend, Adeline Quek, who strongly advised Gavin against doing it.15.    Also that same evening, Z went to Gavin’s home where the\n\nlatter told him that he had informed Adeline Quek of what Anthony wanted them to do and\n\nwhat Adeline’s advice was. Gavin, in turn, advised Z not to do it as \"it was a\n\nset-up.\" Z replied that he had no intention of carrying out Anthony’s plot.16.    After leaving Gavin’s home, Z went over to McDonalds. Gavin\n\ncalled Z on the handphone to ask the latter to inform Anthony that he would not be doing\n\nthe job. After all the other people had left, Z told Anthony of Gavin’s decision\n\nwhereupon Anthony asked Z if he would like to carry it out. Z said anything, indicating a\n\nkind of willingness.17.    That same night Z went round his neighbourhood looking for a\n\nhelmet. He found one with a jacket inside on a motorcycle and stole them. After that he\n\nwent over to Anthony's home. The two talked the whole night until the morning. In their\n\ndiscussions, they touched on the sort of knife to buy (Anthony showed Z samples from his\n\nown kitchen), small enough to be hidden on the body yet sharp and long enough to reach the\n\nheart, the need to buy a pair of gloves, two pre-paid handphone cards from M1 to\n\nfacilitate untraceable communications between the two and a cloth to wipe the knife after\n\nthe job. Z said that he was ready to carry out the task that night (10 May).18.    The plan was that Z was to bring the things together in a\n\nhaversack, which should also contain a change of clothes. He was to put on a long sleeved\n\nshirt to avoid being scratched and leaving traces of his tissue in the wife’s\n\nfingernails. Anthony also showed Z an album containing photographs of his wife. Z should\n\ncarry out the attack in the lift, if not, after she had stepped out of the lift on the\n\nfourth floor. He should run up the stairs and attack her from the back. He was to avoid\n\nholding any railing so as not to leave any finger-prints. After stabbing Annie, Z was to\n\ntake Annie’s wallet, empty the contents into the zip-lock bag and throw the wallet\n\naway. In this way, the whole thing would look like a robbery. In making his escape he\n\nshould just leave the helmet on any motorcycle he came across. He should take a bus\n\ninstead of a taxi as the latter would be more likely to be stopped at police road blocks.\n\nHe should find his way to the nearest MRT station where he should wash the knife, the\n\ngloves and anything that had blood on it and put the rest into the zip-lock bag. He should\n\nchange his clothes and go as far as possible and throw away the things at different\n\nlocations. As regards the money taken from the wallet, if it be soiled with blood, it\n\nshould be burnt away so as to avoid detection. As for Annie’s identity card it should\n\nbe posted back with a note of apology. Anthony told Z that to make it look real he would\n\ncry at Annie’s wake and that he had acquired the art of doing so. That morning before\n\nZ parted company with Anthony, the former was given $100 by the latter (in two $50 notes)\n\nto buy a knife, zip-lock bag, the M-cards, etc.19.    Later that morning, after taking his examination in school, Z\n\nwent to a handphone shop near to McDonald’s. He gathered from the shop manager that\n\nthe particulars of purchasers of pre-paid phonecards need not be registered. He bought two\n\nphonecards with running numbers (for easy remembering) and went home to sleep until awoken\n\nby Anthony. Z then took the helmet, the M-cards and a paper-bag with a long sleeved\n\nsweater and walked over to Anthony’s home. He reaffirmed his readiness to carry out\n\nthe job that evening. They left Anthony’s maisonette, intending to buy a knife and\n\nthe gloves. Z went alone into a hardware shop and bought a knife with a paper casing.\n\nLater he went back to the same shop to buy a pair of rubber gloves. Earlier, he had wanted\n\nto buy a pair of leather gloves but Anthony told him that any type would do.20.    Thereafter, they went by bus to Hougang. They sat together at the\n\nupper deck. Along the journey, Anthony asked Z if the latter was scared. Though nervous, Z\n\nput on a brave front. They then changed to a feeder bus and they sat separately because\n\nAnthony did not want to be seen with Z. At a certain bus stop, Anthony alighted and Z\n\nfollowed suit. Through the use of their handphones (with the M-cards) Anthony communicated\n\nwith Z, telling him that the bus stop was the one at which Annie would usually alight and\n\nthe route he was taking was also her usual route. He asked Z to wait for him on the fifth\n\nfloor of Block 923.21.    When Z came out of the lift on the fifth floor, Anthony came from\n\nbehind him and demonstrated to him how to kill Annie: Anthony covered Z’s mouth with\n\nhis left hand and moved a finger across his throat, saying \"See, it’s so\n\nsimple\". Z was told to carry out the attack on Annie one level below, as that was\n\nwhere her parents’ flat was.22.    Anthony also showed Z, by communicating on the handphones, the\n\nlocation of the coffee shop where he would usually meet Annie. They sat separately in the\n\ncoffee shop. Some fifteen to twenty minutes later, Z was asked to go back to Block 923 to\n\nwait for Annie’s return. That evening Annie came home by taxi. As Z had not seen\n\nAnnie before, he called Anthony to verify what she looked like. By the time he ran up to\n\nthe fourth floor, Annie had already returned to her parents’ flat.23.    About half an hour later, Anthony called Annie to come down to\n\nthe coffee shop. At the same time he informed Z to ambush her at the fourth floor. He ran\n\nup from the ground floor and saw Annie holding a little girl by the hand and taking the\n\nlift down. He then ran down the stairs and caught up with them. However, he did not have\n\nthe heart to do the job. He retreated.24.    Some time later, as Annie was leaving the coffee shop with the\n\ndaughter, Anthony called Z to inform him that she was returning to the flat and that he\n\nshould carry out the plan on the fourth floor, regardless of the fact that the daughter\n\nwas with Annie. Because he was hesitant, Z took his time and was a little too late when he\n\nreached the fourth floor. Anthony was angry at his failure. Z said they could try again\n\nthe next day.25.    Back at Anthony’s home, Z left the things there and asked\n\nAnthony if he could back out of the whole plot. While saying that he understood, Anthony\n\ninstigated Z by saying it would take a different type of guts to do such things.\n\nThereafter, Z agreed to try again the next day.26.    The next day, sometime past 5.00pm, Z came to Anthony’s home\n\nas requested by the latter. Z took out the knife he had bought to show to Anthony. Both\n\nthought it was a little too short. Anthony took a steak knife from his kitchen and gave it\n\nto Z and placed the knife which Z had bought in the tray with other knives of his.27.    When Z wanted to place the steak knife under his waist, Anthony\n\nadvised against it lest he cut himself. Instead he took a sheet of newspaper from a pile\n\non a table, folded it and used it to wrap the blade of the steak knife and passed the\n\nknife back to Z. They left Anthony’s home and travelled by bus to Hougang. On this\n\ntrip he advised Z not to use his MRT farecard for fear of being traced. He passed some\n\ncoins to Z for his use. At the bus-interchange they walked apart like the way they did the\n\nday before. Upon reaching their destination, Anthony walked to the coffee shop while Z\n\nwent to the void deck of Block 923.28.    While waiting, Z again had second thoughts and did not want to\n\ncarry out the attack. He even disposed of the helmet by leaving it on a parked motorcycle.\n\nBecause of his reluctance, the planned action again did not materialise, as Z moved too\n\nslowly.29.    On returning to Anthony’s home, and on being asked why he\n\ndid not carry out the job, Z again said he wanted to back out. Anthony dissuaded him by\n\nsaying that the reward of $100,000 was a lot of money which would be of great use to him.\n\nZ seemed to have been persuaded and he left, asking Anthony to call him regarding the next\n\nattempt.30.    On 12 May 2001 Anthony called Z to arrange for another attempt to\n\nattack Annie on that evening or the following day. For one reason or another, Z did not\n\nagree with both suggestions.31.    Then on 13 May 2001 sometime past midnight, pursuant to\n\narrangements, Anthony met Z at McDonald’s and told him that on the night before, one\n\nSingh (Darshan Singh) challenged him to a fight at McDonald’s. There was some\n\naltercation. Notwithstanding the arrival of the Police, Darshan Singh (Darshan) threatened\n\nto kill Anthony. He told Z that the incident could be used to their advantage so that, if\n\nZ were to attack Annie, the suspicion would fall on Darshan. At this point, Z indicated\n\nthat he did not want to go through with the plan to kill, but Anthony threatened to kill\n\nhim on the ground that the latter already knew too much.32.    The next day, 14 May, past 9.00pm, Z arrived at Anthony’s\n\nhome. There, the two of them practised, by the use of a comb as a knife, on how to attack\n\nAnnie from behind, covering her mouth with the left hand and slashing her throat with the\n\nknife in the right hand and then stabbing at her chest. Anthony assured Z that everything\n\nwould turn out fine. Thereafter, they travelled by bus to Hougang and alighted at the\n\nbus-stop where Annie would usually alight. Anthony proceeded to the coffee-shop while Z\n\nwaited at the void deck of Block 923.33.    Sometime later, Annie came back in a taxi and went straight to\n\nthe lift. Z was again frightened and did not act. Later, Anthony informed Z that Annie\n\nwould be coming down to the void deck to meet him and asked Z to wait between the fourth\n\nand fifth floors and to act when he saw Annie walking towards the lift, regardless of\n\nwhether or not the daughter was with her. Again Z could not make himself do it when Annie\n\nappeared with the daughter. Anthony scolded Z when the latter told him what happened. He\n\nthen instructed Z to wait on the fourth floor and that Annie would be going up alone.34.    As soon as Annie emerged from the lift on the fourth floor, Z\n\ncame behind her, used the cloth to cover her mouth, slashed her neck with the steak knife\n\nand then stabbed her. Annie fell backwards. He wiped the knife with the cloth and put the\n\nknife into his rear trouser pocket and ran down the stairs. He walked briskly to the bus\n\nstop and took a taxi (which happened to arrive first) to Pasir Ris, where he washed the\n\nknife in a toilet and disposed of it in a rubbish bin and went home.35.    The next day when Z met Gavin, he told the latter what he had\n\ndone. Gavin was shocked and scolded him for his stupidity. On 17 May 2001, Z went over to\n\nAnthony’s home as instructed by the latter. Anthony was sitting in front of his\n\ncomputer typing out a message asking Z to act shocked when told of Anthony’s\n\nwife’s death and informing him that the Police could hear their conversation. They\n\nthen carried out a short conversation as planned for the benefit of the Police.\n\nThereafter, Anthony reverted to typing and asked \"where is the IC?\" Z asked\n\n\"What IC?\" Anthony responded \"The IC you used to register the card\". Z\n\nsaid \"No need\". Anthony then typed and asked Z what the latter had done with the\n\nknife and the M-card. Z typed in reply that he had broken the card and thrown away the\n\nknife at the beach. Anthony further stated on the computer that, if the Police should find\n\nout about Z’s involvement, the latter should tell them that he did it on his own.\n\nAfter this, they resumed their oral conversation, with Anthony saying he was sad about his\n\nwife’s death. Z then left Anthony’s flat.36.    There were three computer systems in Anthony’s home. They\n\nwere examined by Station Inspector Murad bin Abdul Latiff (SI Murad) of the Techno\n\nForensic Branch of the Technology Crime Division, CID. In one of the computers SI Murad\n\nmanaged to retrieve a deleted file dated 17 May 2001 timed at 7.33am where there were the\n\nfollowing expressions/words:-\"They can hear what we are saying.\"\"Act shock that the woman is my wife. When I tell you.\"\"U threw the knife.\"\"the chip the ic.\"\"the 2 ic.\"\"type to tell me.\"\"What ic?\"\"to buy the chip.\"\"no need ic.\"\"I drop my ic.\"\"police found they might trace to your friend.\"\"They ask you if I\" loan u on 14.5.01 say yes.\"Bthey can trace the call.\"\"Ttook my money.\"\"Your Ypayment might have 2 wait.\"\"Hyou understand.\"\"If 1police found the chip.\"\"say wrong number if they question u.\"\"they ask you 90418565 who is.\"\"you say male wrong number.\"\"Wthey ask me who is 90418566.\"\"II say female wrong number.\"\"ur friend play u out, just deny it\".\"Ts no way they can catch u.\"He could not find if, inter alia, the phrase \"I was only joking\n\nabout killing my wife\" was in the computers. The words mentioned above which were\n\nretrieved from the computer were not disputed by Anthony.",
        "Evidence on motive": "37.    The prosecution also relied upon the evidence of a number of\n\nwitnesses to show motive. Tze Howe, aged 22, was first introduced to Anthony by Z in\n\nFebruary 2001. He interacted more closely with Anthony because he was interested in\n\nhorse-racing prediction and Anthony had told him that he was planning to launch a magazine\n\non horse-racing. In relation to Anthony’s plot, Tze Howe recalled having once asked\n\nhim why did he not hire a professional to do the job. In response, Anthony asked Tze Howe\n\nto find one for him and he would give Tze Howe a 20% share in his company. The next day\n\nAnthony called Tze Howe to enquire if he had found anyone. He sounded serious. To put him\n\noff, Tze Howe said a friend was trying to help. In the next two days, Anthony kept\n\ncontacting Tze Howe, on his handphone. Eventually, Tze Howe had to tell Anthony that he\n\ncould not find anyone. He denied the suggestion that it was he who pestered Anthony about\n\nthe $100,000 reward for killing Annie so that he could have the money to invest in\n\nAnthony’s magazine on horse-racing.38.    Gavin said that on 9 May 2001, after the meeting at\n\nMcDonald’s, Anthony asked him to go to his home. Among the things shown to Gavin were\n\nalbums containing photographs of his wife and daughter and a kitchen drawer where there\n\nwere a lot of small knives, some of which Anthony indicated could be used to kill his\n\nwife. He also demonstrated to Gavin how the killing could be done. For the demonstration,\n\nAnthony’s bolster was used as if it were Annie.39.    Attempts were made to discredit the evidence of Gavin, that he\n\nhad stabbed someone before and that he had made a girl pregnant. These were denied. Gavin\n\nadmitted that he and Z had discussed with Anthony their personal problems and vice-versa.\n\nAlthough he felt greatly induced by Anthony to carry out the assignment, he did not do it.\n\nHis girlfriend, Adeline Quek, played a part in his determination. He admitted that nothing\n\nhappened to him when he turned Anthony down. Anthony did not utter any threat against him.40.    Two women with whom Anthony had affairs also testified. The first\n\nwas one Berlinda Ho who cohabited with him from 1997 to 2000. They were also involved in\n\nsome business together. He had complained to Berlinda about his wife wanting a divorce and\n\nof his concerns that he could not pay her maintenance and his visitation rights to his\n\ndaughter might be restricted. He even told Berlinda that, if Annie were to take his\n\ndaughter away from him, he would kill Annie. When they broke up and Berlinda left him,\n\nAnthony threatened to kill her but he did not carry out the threat.41.    After Berlinda left him, Anthony befriended one Marilyn Tan Su\n\nFen. He told her of his plan to publish a magazine on horse-racing and was looking for\n\ninvestors and that this was a quick way of making money. He also told her he was in debt\n\nand was a bankrupt. Nevertheless she was persuaded to invest some $50,000 in the venture,\n\nwhich she registered as a sole proprietorship business under the style of \"Advance\n\nMedia\". When another potential investor backed out from the venture, the business\n\nsuffered, so much so that Marilyn even contemplated committing suicide. When she\n\ncommunicated this desire to Anthony, he told her that before she took her own life, she\n\nshould go and kill his wife first so that he would be able to tell the Police that Marilyn\n\nkilled out of jealousy.",
        "Defence": "42.    In his evidence, Anthony said he started to mix with Z and his\n\ngroup of friends from around October/November 2000, several times a week between 10.00pm\n\nand 1.00am at the McDonalds’. He had acted as an elder brother in advising and\n\ncounselling them on their problems. On one occasion in mid April 2001 the boys talked of\n\nfights and declared that they were not afraid of killing. He thought they were just\n\nboasting and the topic of killing for payment came up. He challenged them to kill for\n\nreward. When he was asked who he had in mind, he unthinkingly mentioned his wife as an\n\nexample, as she was the only person they knew. Of course, they also knew he and his wife\n\nwere then estranged.43.    Anthony also confirmed the conversation Tze Howe had with him\n\nregarding engaging a professional to do the killing. The subject came about because Tze\n\nHowe was interested in investing in the horse racing magazine which Anthony was planning\n\nto publish. Tze Howe did not have the money so he thought of the $100,000 reward. So just\n\nto call his bluff, Anthony challenged him to find a killer. Eventually, Tze Howe backed\n\noff.44.    As regards Anthony’s suggestion to Marilyn that she kill\n\nAnnie, this must be viewed in the context of the circumstances then. At the time, Marilyn\n\nwanted to commit suicide. His intention of mentioning to Marilyn about killing his wife\n\nfirst was to buy time so that he could counsel Marilyn not to do something silly. As\n\nregards what he said to Berlinda, those were said while he was arguing with Berlinda and\n\nin the heat of argument he said he would kill his wife if she took the daughter away from\n\nhim. He did not ask Berlinda to kill Annie.45.    Anthony admitted that on 9 May 2001 he did discuss with Gavin how\n\nthe latter could go about killing Annie. But it was never his intention to have Gavin kill\n\nAnnie. It was really to call Gavin’s bluff – to show that it was all nothing\n\nmore than big talk on Gavin’s part. All the details he discussed with Gavin, e.g.,\n\nhow to kill and to send Annie’s identity card back with an apology etc, were to make\n\nit look real so as to see how far Gavin was prepared to go. Anthony said that, while he\n\ndid not think Z had the guts to do it, Z did indicate that he would like to do the job. He\n\nconfirmed that on that day, Gavin came to his home and he taught Gavin how to slash\n\nAnnie’s throat, using a bolster, as a substitute for Annie. He drew a sketch of the\n\nblock, showing the lift lobby together with the corridors and the staircases. Before Gavin\n\nleft Anthony’s home, they agreed to recce Annie’s parents’ home.46.    That evening, while Anthony was with Z at McDonald’s, Z\n\nreceived an SMS message from Gavin on his handphone asking Z to tell Anthony that Gavin\n\nwas no longer interested in the job (Z’s evidence differed here: it was a phone\n\ncall). Anthony laughed as if to say it proved he was correct after all. He was not angry\n\nwith Gavin for backing out.47.    Anthony denied ever having brought Z to Hougang to recce Block\n\n923. When he was questioned on how Z came to know of the place of residence of Annie,\n\nAnthony said Z must have followed him to Hougang. He also denied having told Z to kill his\n\nwife or planned with him to kill her. He loved and cared for his daughter very much and\n\nwould never have asked anyone to kill his wife in the presence of his daughter. He also\n\ndenied giving $100 to Z to buy the two M-cards as he himself was so broke that he had to\n\neven borrow $50 from Marilyn.48.    Anthony said that on 14 May 2001, in the morning, Z came to his\n\nhome to surf the internet. At the time, Anthony was about to leave for Hougang to meet a\n\nbookmaker. Z told him that he wanted to visit his uncle who was living in the vicinity of\n\nAnnie’s residence. But they went their separate ways.49.    After Annie was killed, Anthony suspected it could be Gavin who\n\ndid it as the latter appeared the most courageous of the boys. So on 17 May 2001 Anthony\n\ncalled Z to tell the latter that he was being watched by the Police. Z came to his home.\n\nAnthony told Z that he suspected it could also be Darshan, with whom he fought, who did\n\nit. But to Anthony’s shock, Z said that he had done it. Thereafter, for fear that his\n\nhome might be bugged, Anthony communicated with Z by typing on the computer. He claimed\n\nthat his aim was to protect Z.50.    Anthony asserted that Z implicated him in the crime perhaps\n\nbecause Z perceived that Anthony had squealed to the Police and Z was trying to get even.\n\nAs regards the sheet ofThe New Paper, since Z was free to move around in his\n\nmaisonette, it was probable that Z took a sheet off that issue without his knowledge.\n\nNeither did he give the steak knife to Z who probably swapped it with the knife he bought\n\nfrom the hardware shop.51.    Anthony admitted having gone to Annie’s home on 11 May 2001\n\nas she called him. He did not bring Z there. He also met Z in the evening of 13 May 2001\n\nand informed the latter of the incident involving Darshan the previous day. He denied\n\ntelling Z that, should Z kill Annie, the Police might well suspect Darshan as the killer.\n\nHe denied having threatened to kill Z if the latter were to refuse to kill Annie. However,\n\nhe admitted to typing the words \"payment might have 2 wait\" because Z was\n\npressing for payment and he was stalling for time.",
        "Evidence of Z at trial": "52.    In his evidence in court, Z reiterated what he stated in the\n\nnumerous statements - that he killed Annie as plotted by Anthony and that while he felt\n\nhurt that Anthony chose Gavin over him to kill Annie, he would not have killed anyone just\n\nto show he was more mature, if not for the threat of Anthony. He was afraid to tell anyone\n\nof what Anthony wanted him to do. He had never visited his uncle in Hougang before.",
        "Decision below": "53.    The trial judge found that the idea of getting his wife killed\n\nwas hatched in Anthony’s mind. While he initially raised it with the boys in a\n\njocular manner, he was, in fact, dead serious. He discussed with Tze Howe on how to engage\n\na professional killer to do the job and with Gavin and Z on how his wife could be killed,\n\nusing a bolster symbolising his wife. The trial judge debunked Anthony’s assertion\n\nthat he was only testing Gavin with these observations (281):-\"… when this so-called ‘joke’ was called off in the\n\n  early hours of Thursday, 10 May 2001, Anthony Ler did not exult in his ‘victory’\n\n  over Gavin by telling him that he had seen through Gavin’s boasting and proved him to\n\n  be lacking in killer’s guts. He did not even ask to speak to Gavin when the latter\n\n  called Z at McDonald’s that day. Instead, he merely appeared to have been calm in his\n\n  disappointment over Gavin’s withdrwal from the plan. Similarly, when Anthony Ler met\n\n  Gavin two or three days later at McDonald’s, there was no gloating and jibing by\n\n  Anthony Ler over the elaborate con job that he had supposedly pulled on Gavin.\"54.    The trial judge accepted the evidence of Z as entirely truthful.\n\nHe did not think that Z was capable of concocting all those stuff which he told the court,\n\nif they did not, in fact, occur. He did not see in Z a vicious individual who would\n\nunjustifiably implicate another.",
        "Appeal": "55.    Before us, counsel for Anthony rehashed the same main contention\n\nwhich was canvassed in the court below, that he did not intend that Z should, in fact, go\n\nand kill his wife. He had no reason to have her killed, after all they separated amicably.\n\nHe was only playing a game of bluff with the boys, who were boasting of getting involved\n\nin fights and killing. He never intended the boys to take it for real. Counsel suggested\n\nthat because Z was not Anthony’s first choice for the job of potting-off his wife,\n\nhis ego was hurt and to show that he was just as capable and strong in mind as Gavin, Z\n\nwent about entirely on his own. The killing of Annie was purely an egoistic act on the\n\npart of Z, carried out to prove to himself and to Anthony that he was not a weak person.56.    Counsel also urged us to disregard the evidence which suggested\n\nthat Anthony had also instigated Tze Howe and Gavin to undertake the task of killing his\n\nwife. It was irrelevant to the killing undertaken by Z and, in any case, his instigation\n\nof Tze Howe and Gavin was really, as Anthony said, part of his game of bluff.",
        "Our analysis": "57.    Anthony’s central theme was that it was just a game of bluff\n\nand that Z killed Annie to satisfy his own ego. To show that he had no motive to kill his\n\nwife, he emphasised that they separated amicably. While he loved his daughter, he had no\n\nmeans to take care of her and was thus in no position to fight for custody.58.    The fact of the matter was that Anthony had serious financial\n\ntroubles. Annie was then about to divorce him. He was given limited access to his\n\ndaughter. The extent to which he had gone about the \"game\" defied his assertion\n\nthat there were no problems with Annie.59.    The whole thing was indeed morbid. Not only did he mention the\n\nidea of getting someone to kill his wife once, he mentioned it numerous times. He\n\nmentioned it to his two ex-lovers, Berlinda and Marilyn. He talked about it to the boys,\n\nfirst as a group, and later individually. Clearly he was very obsessed with the thought of\n\nhaving his wife killed. All these utterances (besides those to Z) clearly evinced his\n\nill-will towards his wife and were undoubtedly relevant to the charge preferred against\n\nhim of instigating a murder. Illustration (p) to s 14 of the Evidence Act is on point\n\n–\"(p) A is tried for a crime.The fact that he said something indicating an intention to commit that\n\n  particular crime is relevant.The fact that he said something indicating a general disposition to\n\n  commit crimes of that class is irrelevant.\"60.    As regards Anthony’s contention that Z carried out the\n\nkilling because of egoistic motives, in our judgment, nothing could be further from the\n\ntruth. Z was then fifteen years old with an average IQ of 93. There was psychiatric\n\nevidence which showed that Z’s \"mental state was susceptible to a point, that he\n\nliterally had to do what he was told by a skilful and aggressive proselytiser.\"\n\nAnthony was looked up to by the boys, including Z. He admitted as much that he had\n\ninfluence over Z. He made use of this superior position to manipulate and pressurize Z\n\ninto doing his bidding, as he tried without success with Gavin. Z followed Anthony’s\n\ninstructions in buying two M-cards, the knife, gloves, etc. Z followed him to Hougang\n\nwhere he was shown the block where Annie lived and the path she usually took from the\n\nbus-stop to her home.61.    Anthony knew Z was not a strong-willed person. Thus, he would\n\nhave preferred that Gavin undertook the task. But with Gavin backing out, he had no other\n\nchoice but to accept Z as a fallback. Anthony persisted in wanting Z to do the killing\n\neven though on two occasions (on 10 and 11 May) Z was shown not to have the guts to do it.\n\nSo much so that after the second failed attempt when Z wanted to quit, Anthony preyed on\n\nhis ego by using reverse psychology, saying it was all right and that he understood. After\n\nall, he had previously told Z that the assignment required \"a different kind of\n\nguts.\" He also enticed him with the $100,000 reward stating what the sum of money\n\ncould do for him. He continued to cajole and badger Z and coupled it with a demonstration\n\nof his martial art prowess to suffocate a person or to break an arm. He worked on Z’s\n\nweaknesses. At that point Z was really afraid that if he did not proceed to kill Annie,\n\nAnthony would kill him. As the trial judge quite rightly observed, if it were true that Z\n\nproceeded to kill because of his own ego, he would have bragged about it to Anthony and\n\nhis friends, instead of feeling dejected and afraid after the event.62.    Another aspect of the evidence which again clearly implicated\n\nAnthony was his behaviour after Annie was killed. Why should he have the phobia that the\n\nPolice were bugging his home if he was indeed innocent and that all his instigations were\n\njust jokes? Moreover, why did he start to communicate with Z using the computer? Why did\n\nhe, in reply to Z’s request for money, not state \"what money\" \"it was\n\na joke\" \"you idiot\" or words to that effect but had instead said \"your\n\npayment might have 2 wait\"? In short, he admitted there was the deal for which he had\n\nto pay Z the $100,000. When asked why did he respond in that manner he said \"I\n\ndon’t know why. I just put it that way.\" It was clear to us, as it was to the\n\njudge, that he replied in that manner because that was the truth – there was a deal.63.    Anthony contended that consideration must be given to the fact\n\nthat his evidence given in court tallied in substance with the numerous statements he gave\n\nto the Police. Such consistency alone did not mean that the court should have accepted his\n\nevidence. Consistency was no doubt a factor in the overall assessment. But the evidence\n\nmust be verified against the objective facts and the evidence of other witnesses. Apart\n\nfrom all previous preparatory acts Anthony had undertaken, including coaching Z on how to\n\ncarry out the killing, what things to get, where Annie lived and how she looked like, one\n\ncrucial fact which implicated Anthony in the plot was Z’s presence on the fourth\n\nfloor waiting for Annie who was coming up to get a pen to sign the documents. In all the\n\ncircumstances, it was a clear case of a plot rather than a coincidence.64.    If the whole thing was intended by him to be a joke why\n\ndidn’t he say so in his cautioned statement? It would have taken him no time to state\n\nthis simple fact. But he did not, giving the excuse that he was tired. His story was\n\nclearly an afterthought, something cooked up by him later.65.    Finally, it was argued that if Anthony was serious in wanting his\n\nwife killed, he would not have solicited the help of a bunch of 15-16 year old boys, some\n\nof whom he had only recently got acquainted with. We could see that he was a schemer,\n\nalways seeking ways to ensure that no one would link him to the crime, e.g., wanting to\n\nmake the killing look like a robbery; wishing the Police would suspect that the killing\n\nwas done by Darshan in revenge. But the fact of the matter was that he did all this. He\n\nwas desperate and the boys were his only hope.66.    In the premises, we were satisfied that there was solid evidence\n\nto substantiate the charge against Anthony beyond a reasonable doubt. Accordingly, we\n\naffirmed the conviction and sentence.67.    In passing, we would observe that the present case involved a\n\nfinding of fact by the trial court that Anthony did instigate Z into killing Annie. It is\n\ntrite law that an appellate court, which does not have the advantage of hearing the\n\nwitnesses and observing their demeanour, will not disturb a lower court’s findings of\n\nfact unless they are clearly wrong and against the weight of the evidence: seeLim Ah\n\nPoh v PP[1992] 1 SLR 713.Sgd:YONG PUNG HOWCHIEF JUSTICESgd:CHAO HICK TINJUDGE OF APPEALSgd:TAN LEE MENGJUDGECopyright © Government of Singapore."
    }
}