{
    "case_title": "Rusli Bin Sembayang v Public Prosecutor",
    "ncitation": "[2003] SGCA 11",
    "coram": "Chao Hick Tin JA; \n      Judith Prakash J; \n      Yong Pung How CJ",
    "sections": {
        "The decision below": "9 The trial judge held that Rusli’s account of Ahmad’s presence and escape from the flat was pure fabrication. The evidence showed that Ahmad was nothing more than a fictitious character. The trial judge noted that Rusli was unable to provide the address, contact number or whereabouts of Ahmad. This severely damaged the credibility of his story, since he claimed that Ahmad was a childhood friend and had been a frequent visitor to his flat.10 In addition, the trial judge held that there was compelling evidence that Rusli was involved in the trafficking of cannabis. In his statements, Rusli had repeatedly referred to the cutting, weighing and packing of cannabis. The evidence seized during the arrest showed that Rusli had notes of the price of the drugs, records of sales transactions and even a specific code word for cannabis. The trial judge also found Rusli’s retraction of his incriminating statements to be an afterthought, and noted that the court was entitled to convict him on the strength of his retracted confessions as long as it was satisfied as to the truth of the retracted portions.11 The trial judge thus held that the prosecution had proved its case beyond a reasonable doubt, and Rusli had not, on a balance of probabilities, rebutted the presumption under the Misuse of Drugs Act that the cannabis found in his possession was for the purpose of trafficking. Under s 17 of the Act, a person is presumed to be a trafficker if he has in his possession more than 15 grams of cannabis. In the present case, Rusli had in his possession more than 1000 grams of cannabis, which clearly brought the presumption into operation. Rusli had failed to establish his defence as he was unable to prove the existence of Ahmad. He was consequently found guilty and sentenced to death under s 33 of the Act.",
        "Issues arising on appeal": "12 The main issue before us was whether the trial judge had erred in holding that Ahmad was merely a fictitious character. The other issues arising on appeal were whether the trial judge had erred in finding that Rusli was in possession of the cannabis in question, and whether there was any error in the trial judge’s rejection of Rusli’s attempt to retract the incriminating portions of his statements. We dismissed the appeal, and now give our reasons.The existence of Ahmad13 Rusli’s entire defence revolved around the existence of Ahmad. His sole rebuttal to the presumption of trafficking was that the drugs did not belong to him. Counsel for the appellant in fact characterised the appeal in the following terms: if Ahmad exists, that makes up the defence; but if that fails, the entire defence crumbles.14 In the court below, the trial judge was not impressed by Rusli’s defence, and unequivocally rejected his version of events:In my finding, the accused’s accounts as to the existence as well as the presence of Ahmad at his flat were entirely unconvincing. The defence of the accused that the drugs belonged to someone else and not to him was, in my determination, a complete fabrication.15  We saw no reason to disturb the trial judge’s decision on this point. In our view, the trial judge could not be faulted for holding that Ahmad was nothing more than a fictitious character.16  Rusli had portrayed the relationship between Ahmad and himself as a close one. Ahmad was allegedly a childhood friend whom he had grown up with in Geylang, and who had in the past year been a regular visitor to the flat. Rusli also testified that he had previously helped Ahmad in the preparation of cannabis, and had kept business records of Ahmad’s drug transactions.17 Given their allegedly close relationship, we found it inconceivable that Rusli was unable to furnish any of Ahmad’s details or particulars. In fact, Rusli repeatedly stated that he had no evidence to prove Ahmad’s existence. In his statement recorded on 16 April 2002, Rusli stated:I do not have anything to show (Ahmad) exists. I do not know his family. I do not have any photos of him. I do not know where he works or what he does … I am not able to give any particulars of any real existing person who knows Ahmad. (emphasis added)18 In his statement recorded on 22 May 2002, Rusli stated:I have nothing to show that Ahmad exists except for his slippers which are there. I cannot remember what the slippers look like …I do not have anything to prove that Ahmad exists. No telephone numbers, no photograph, nothing. I have no way of reaching him. (emphasis added)19 This inability to provide Ahmad’s details was particularly incredible in light of the fact that Ahmad’s existence was the entire foundation of Rusli’s defence to a capital charge. This inexplicable failure to provide any details led us inexorably to the same conclusion reached by the trial judge: Ahmad simply did not exist.20 Rusli did attempt to explain his ignorance. He argued that his inability to provide particulars was a natural consequence of Ahmad’s involvement in illegal drug-related activities. As a drug trafficker, Ahmad would not divulge his personal details to anyone, in order to reduce the risk of his being traced by the authorities.21 Ultimately, we found this argument to be without merit. It failed to account for Rusli’s own evidence that he was actively involved in Ahmad’s drug activities. In his statements, Rusli claimed to have kept records of Ahmad’s drug transactions, assisted in the packing of the drugs, and even allowed his flat to be used for drug-related activities. His relationship with Ahmad was far more than that of a casual friend – it was akin to that of a business partner or an accomplice. Under such circumstances, we found it implausible that Ahmad would not provide Rusli with at least some means of contacting him, especially for business purposes. We found it equally implausible that Rusli could remain so blatantly ignorant of Ahmad’s particulars even after their prolonged interaction in both social and business contexts.22 We found no merit in Rusli’s argument that the officer concerned had failed to see Ahmad climbing down the block and running away, and that the trial judge had thus erred in giving no weight to his account of Ahmad’s escape. We agreed with the trial judge that Ahmad was a mere fabrication. It would thus be ludicrous to suggest that the trial judge had erred when he gave no weight to the account of an imaginary person’s escape from the flat.23 We also noted that Rusli did not mention Ahmad’s presence or escape to the officers when he was questioned immediately after his arrest. Rusli had been given ample opportunity to inform the questioning officers that the drugs in his flat belonged to Ahmad, but he chose not to do so. In fact, his first reference to Ahmad was in a statement recorded on 16 April 2002, five days after his arrest. The trial judge held that, if indeed Ahmad was present on the day of Rusli’s arrest, he would have mentioned this fact at the very first opportunity. Rusli’s explanation for this glaring omission was that no officer had asked him specifically about Ahmad. In our opinion, this explanation was patently unsatisfactory. We accordingly held that there was no reason to disturb the trial judge’s finding on this point.24 Rusli’s inability to prove that Ahmad was an actual person was fatal to his defence that the drugs in his possession belonged to someone else. We accordingly held that Rusli had failed to rebut the presumption that his possession of the cannabis was for the purpose of trafficking. The appeal was dismissed on this ground.",
        "Rusli’s admission of possession of the drugs": "25 Rusli also appealed against the trial judge’s finding that he was in possession of the drugs found at the bottom of the flat. The trial judge relied on an admission made in a previous statement in which Rusli said:I admitted that the cannabis found below was mine but I was not in a proper frame of mind … I feel that there was some paranormal influence on me. (emphasis added)26 During the trial, Rusli retracted this portion of his statement and claimed that he had never made any such admission. He made no attempt to explain the nature of the \"paranormal influence\" that was affecting him, nor did he explain why this allegedly false admission had appeared in his statement. The trial judge disregarded Rusli’s retraction, and held that his admission of ownership was a convincing piece of evidence which showed that he was in possession of the cannabis. We saw no reason to disturb the finding of the trial judge.27 In any case, we saw absolutely no merit in the allegation that Rusli was not in possession of the drugs in question. It was not disputed that the white plastic bag and the packets of drugs were found on the ground floor of the block, and were not found inside Rusli’s flat or on his person. However, it was similarly not disputed that it was Rusli who had thrown these items out of his flat’s window.28 The case ofLim Swee Seng v Public Prosecutor[1995] 1 SLR 425was instructive on this point. InLim Swee Seng, the appellant had also thrown a white plastic bag containing drugs out of a window. The bag was subsequently recovered from a grass patch below the balcony of the flat. The appellant in that case had also admitted in a previous statement that he had thrown the items out of his flat. The Court of Appeal upheld the trial judge’s decision that the evidence was sufficient to prove the element of possession. In our opinion, the case law fully supported the trial judge’s finding that Rusli was proved to be in possession of the drugs which formed the subject matter of the present charge.29 Moreover, Rusli’s argument on possession was premised entirely on his allegation that the drugs belonged to Ahmad, and that he had merely discarded them in a state of panic. In our opinion, this argument lost all semblance of credibility in light of the trial judge’s finding that Ahmad did not exist in the first place.The trial judge’s rejection of Rusli’s attempts to retract the incriminating portions of his statements30 In court, Rusli attempted to retract those portions of his statements which suggested that he had been a trafficker in cannabis. He denied telling the recording officer that he had helped Ahmad pack, weigh and store the cannabis. He also denied saying that he had helped Ahmad sell cannabis by keeping accounts of the transactions and actively seeking out potential buyers. The trial judge characterised Rusli’s retraction of the incriminating portions of his statements as \"pure afterthoughts\", and held that the retracted portions reflected the truth of the events narrated.31 Rusli took issue with the trial judge’s characterisation, and argued that it was unfair to call his retractions \"afterthoughts\" merely because he sought to retract only the incriminating portions of his statements. We saw no merit in this argument. In our opinion, Rusli misunderstood the trial judge’s decision. The trial judge did not reject the retractions merely because he considered them to be \"afterthoughts\". Rusli’s attempt to disown his incriminating statements was unsuccessful because the trial judge was convinced that those incriminating statements reflected the truth of the events – save, of course, for the fabrication of Ahmad’s existence. He held that the retracted statements gave a convincing and consistent account of Rusli’s trafficking activities. In doing so, the trial judge made it clear that he had come to this decision after reviewing all the evidence before him.32 It is settled law that an accused’s retraction of his confession does not prevent that confession from being relied on to convict him if the judge believes that it represents the truth. The law applicable to retracted confessions was clearly stated by the Malayan Union Court of Appeal in the case ofYap Sow Keong v PP[1947] MLJ 90and was subsequently upheld by the Court of Appeal in cases such asIsmail bin UK Abdul Rahman v PP[1972-1974] SLR 232andThongthot Yordsa-Art & Anor v Public Prosecutor[2002] 4 SLR 161:In our view the law as to the admissibility of retracted confessions in evidence is clear, and put shortly it is that an accused person can be convicted on his own confession, even when it is retracted, if the court is satisfied of its truth. We do not agree with those Indian decisions which lay down that before a person can be convicted on his retracted confession there must be corroborative evidence to support it.Conclusion33 For the reasons given above, we dismissed the appeal.Copyright © Government of Singapore."
    }
}