{
    "case_title": "Godfrey Gerald, Queen's Counsel v UBS AG and Others",
    "ncitation": "[2003] SGCA 16",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J; \n      Yong Pung How CJ",
    "sections": {
        "The facts giving rise to the application to admit the appellant": "2 Mr Wee is a 72 year old retired lawyer suffering a serious heart ailment complicated by diabetes and renal failure. UBS AG (‘UBS’), the first respondent in this case, is an international private bank carrying on business in Singapore in accordance with the Association of Banks in Singapore’s Code of Conduct.  3 In August 1997, Mr Wee’s son, Richard, received a tip that the Malaysian ringgit (‘RM’) was likely to strengthen and decided, with his father’s consent, to use his father’s account with the bank to purchase RM35 million against a US$ loan. However, the RM weakened instead against the US$. By December 1997, Mr Wee was deeply concerned about the mounting losses he was suffering as a result of that transaction. He therefore asked the bank for suggestions on how he could effectively manage his losses.  4 The bank offered him the following three alternative strategies: (1) keep his existing RM position and do nothing; (2) cut his RM position immediately and convert it into US$, realising his losses; or (3) adopt the ‘DFF Strategy’ which consisted of an investment in the bank’s US$ denominated SBC Dynamic Floor Fund (‘DFF’) and a 12-month Forward Foreign Exchange trade buying RM against the US$. After several meetings, Mr Wee decided to adopt the DFF Strategy.  5 Around the middle of 1998, interest rates for the RM shot up to almost 30% per annum as the Malaysian government aggressively raised interest rates in order to fend off speculative attacks on the RM. Mr Wee would have been much better off financially had he kept his RM position intact in December 1997. In September 1998, as a result of the capital measures imposed by Bank Negara, the bank converted Mr Wee’s RM deposits at US$1 to RM4, the rate adopted by the Association of Banks in Singapore.  6 On 4 July 2001, Mr Wee commenced Suit No. 834 against the bank, alleging that the bank’s representatives misrepresented the DFF Strategy to him. He also claimed that the conversion of his RM deposits was wrongful and took issue with various charges and fees debited against his account. The issues arising out of Suit No. 834 will be dealt with in greater detail below. The trial of that action has commenced but was adjourned due to Mr Wee’s health problems. In Originating Motion No. 22 of 2002, the appellant applied under s 21 of the Legal Profession Act (Cap 161) to be admitted as an advocate and solicitor of the Supreme Court for the purpose of representing Mr Wee in Suit No. 834.  7 The judge below held that an application for admission of a Queen’s Counsel (‘QC’) under s 21 of the Legal Profession Act (‘the Act’) was governed by a three-stage test, following the principles inRe Caplan Jonathan Michael QC[1998] 1 SLR 432at 435. At the first stage, the applicant must demonstrate that the case in which he seeks to appear contains issues of law and/or fact of sufficient difficulty and complexity to require elucidation and/or argument by a QC. Such difficulty or complexity is not of itself a guarantee of admission, for the decision to admit is still a matter for the court’s discretion. At the second stage, therefore, the applicant must persuade the court that the circumstances of the particular case warrant the court exercising its discretion in favour of his admission. Finally, the applicant has to satisfy the court of his suitability for admission. The judge refused to admit the appellant because his application failed every stage of the three-stage test. The judge found that: (1) the facts and the legal issues in the action were not of sufficient difficulty and complexity to warrant the admission of a QC; (2) the circumstances of the case did not warrant the court exercising its discretion in favour of admission because it was Mr Wee’s own unjustifiable stance which caused him to be without legal representation in Suit No. 834; and (3) despite the appellant’s very impressive achievements and ability, his qualifications and experience did not quite meet the requirements of the action before the court. In addition, the judge ordered Mr Wee to pay $5000 in costs to the first respondent, UBS. The appellant appealed against both the judge’s decision denying him ad hoc admission, as well as the award of costs.",
        "The intervening developments": "8 Subsequent to the filing and service of the appellant’s case and the record of appeal, the appellant’s then counsel, Mr Goh Aik Leng (who also represented Mr Wee), informed the respondents in a letter dated 5 February 2003 that Mr Wee was no longer desirous of seeking ad hoc admission for the appellant. Counsel therefore did not wish to pursue the issue of the appellant’s suitability for admission. However, he wished to proceed with the remainder of the appeal to prevent Mr Wee from being estopped by the findings of the judge below should he decide to hire another QC.  9 In the interim period before the hearing of this appeal, Mr Goh sought ad hoc admission for another QC, Mr Richard de Lacy, again for the purpose of representing Mr Wee in Suit No. 834. The application came before the same judge who had heard the appellant’s application. The judge rejected Mr de Lacy’s application because his application failed the first two stages of the three-stage test (seeRe Richard de Lacy QC[2003] SGHC 55).  10 When the present appeal came on for hearing, Mr Goh applied for leave to discharge himself as counsel for Suit No. 834 and its related matters on the ground that he was \"not capable\" and did not \"possess the requisite skill or resources to lead and conduct\" the case. Mr Goh indicated that Mr Wee was ready and willing to argue the appeal in person and that Mr Wee was now desirous of seeking ad hoc admission for the appellant. We granted Mr Goh leave to discharge himself and Mr Wee proceeded to argue the appeal based on a new set of submissions.   11 In the premises, two main issues arose for our consideration: (1) Whether the judge erred in refusing to grant the appellant ad hoc admission under s 21 of the Act; and (2) Whether the judge below erred in ordering Mr Wee to pay $5000 in costs to the first respondent.",
        "Whether the judge erred in refusing to grant the appellant ad hoc admission under s 21 of the Act": "12 Under s 21(1) of the Act, the court — … may, for the purpose of any one case where the court is satisfied that it is of sufficient difficulty and complexity and having regard to the circumstances of the case, admit to practise as an advocate and solicitor any person who — (a) holds Her Majesty`s Patent as Queen`s Counsel; (b) does not ordinarily reside in Singapore or Malaysia but who has come or intends to come to Singapore for the purpose of appearing in the case; and (c) has special qualifications or experience for the purpose of the case.  As the judge below held, s 21 of the Act embodies a three-stage test for admission (see e.g.Re Caplan Jonathan Michael QC[1998] 1 SLR 432at p 435).  13 The decision whether to admit a QC under the three-stage test is one involving the exercise of discretion. According toThe Vishva Apurva[1992] 2 SLR 175at p 181, it is clear that an appellate court will interfere with an exercise of discretion on only three grounds. These are — (1) where the judge has misdirected himself with regard to the principles in accordance with which his discretion has to be exercised; (2) where the judge, in exercising his discretion, has taken into account matters which he ought not to have done or failed to take into account matters which he ought to have done; or (3) where his decision is plainly wrong. In our judgment, there was no reason for us to interfere with the manner in which the judge applied the three-stage test to the present case.",
        "Whether the case contained issues of law and/or facts of sufficient difficulty and complexity to require elucidation and/or argument by a QC": "14 Mr Wee submitted that the judge below fell into error because he construed the first-stage of the test to require that the case be both difficultandcomplex, when it should be sufficient that the case waseitherdifficultorcomplex (emphasis added).  15 We note that s 21(1) of the Act expresses the two terms conjunctively. InThe Law of Advocates and Solicitors in Singapore and West Malaysia(2nded, 1998) at p 69, Professor Tan Yock Lin is of the opinion that this holds some significance. As he puts it: The conjunctive in the phrase ‘difficult and complex’ must also not be overlooked. Not only must the law be difficult, it must also be complex. So a law may be difficult in that there are conflicting authorities but it must also be complex in the sense, for instance, that the development of the law has ramifications for other branches of the law or in the sense that it has been modified by statute in some convoluted fashion or that its policy or rationale may not be suitable for or congenially followed in Singapore. We are inclined to agree with the view expressed in this passage, with the qualification that there is no requirement that the requisite difficulty and complexity must pertain to the law as opposed to the facts (see e.g.Re Fenwick QC[1995] 3 SLR 89;Re Caplan Jonathan Michael QC (No 2)[1998] 1 SLR 440at p 445;The Law of Advocates and Solicitors in Singapore and West Malaysiaat p 70.  16 A perusal of the case law in this area reveals that the terms ‘difficulty’ and ‘complexity’ have been cited both conjunctively as well as disjunctively: see e.g.Re Howe Martin Russell Thomas QC[2001] 3 SLR 575at p 577;Re Caplan Jonathan Michael QC[1998] 1 SLR 432at p 435. However, it should be pointed out that nothing in those cases turned on whether the terms were read either conjunctively or disjunctively. Indeed, Mr Wee himself failed to explain what, if any, difference it would make to the present case if the two terms were to be read disjunctively.  17 Moving on to examine the facts of the present case, Mr Wee set out six issues which allegedly captured the difficulty or complexity of the case: (1) Whether UBS failed to provide adequate banking advice; (2) Whether UBS was in a position of conflict by being the opposite party in carrying out his instructions; (3) Whether UBS gave fraudulent and/or negligent advice in a fax dated 23 December 1997; (4) Whether UBS failed to carry out Mr Wee’s written instructions dated 24 December 1997; (5) Whether UBS duplicated Mr Wee’s instructions dated 24 December 1997; (6) Whether UBS destroyed or erased telephone records of business transactions in the face of pending litigation; (7) Whether UBS breached the laws of Hong Kong in giving Mr Wee advice in respect of his transactions in Hong Kong. These issues, Mr Wee submitted, revolved around the \"significant legal concepts\" of \"foreign exchange contracts, spot rates, derivatives and loss limiting schemes\", all of which had \"highly technical financial ramifications\". Mr Wee contended that the difficulty or complexity of Suit No. 834 was borne out by the voluminous paperwork that it has generated thus far. The statement of claim was 64 pages long, while the defence ran to 61 pages. UBS’s opening statement, which ran to 42 pages, was \"limited to highlighting the fundamental flaws of the plaintiff’s claim whilst reserving the right to supplement it at the appropriate time\". As it was, the case was only part-heard after three weeks with Mr Wee on the witness stand. Finally, there was no evidence of local cases which demonstrated that there were local counsel with experience in \"foreign exchange transactions, derivatives, ‘forward contracts’, ‘forward rates’ as opposed to ‘spot rates’ and loss limiting schemes\".  18 Even if we were to take Mr Wee’s case at its highest and accept his submission that it was sufficient for the case to be either ‘difficult’ or ‘complex’, we were of the opinion that he formulated the issues at a level that was too general for us to discern where the difficulty or complexity in the case lay. If anything, the dispute appeared to be primarily a factual one that the High Court could determine on the basis of documents and witnesses’ testimony and its evaluation of the evidence (ReHowe Martin Russell Thomas QC[2001] 3 SLR 575at pp 578-579).  19 While the documentation in Suit No. 834 may well be voluminous, we were of the view that length should not be equated with either difficulty or complexity. We express our agreement with the judge’s view that: A long story is not always a complicated one. New factual situations, like new business practices, will always arise. With each new permutation of facts, the law is applied, sometimes by way of extension, at other times by refinement, of the principles involved.   20 A closer examination of the proceedings in Suit No. 834 in fact revealed that the cause of the protracted trial was Mr Wee himself. At the commencement of Mr Wee’s cross-examination, his then counsel requested that he be cross-examined in the morning sessions only as he was not fit enough to continue the full day. That was granted by the trial judge. During the course of the cross-examination, Mr Wee also asked for breaks on account of his medical condition. The cross-examination thus took up the three weeks fixed for the trial.  21 Insofar as the alleged scarcity of local precedents was concerned, Mr Wee was mistaken in his assumption that the absence of direct local precedents was sufficient to warrant the admission of a QC. As Chan Sek Keong J (as he then was) put it inRe Oliver David Keightley Rideal QC[1992] 2 SLR 400at p 404I, \"novelty of this nature is not even prima facie evidence of complexity\". Indeed, \"the logical approach should instead be to refer to decisions of other Commonwealth jurisdictions\" (Re Howe Martin Russell Thomas QC[2001] 3 SLR 575at p 578).  22 In any case, there is in fact already a body of local case law that the High Court can build upon in determining the merits of Suit No. 834. InBanque Nationale De Paris v Wuan Swee May & Ors, Suit No. 2031 of 1997, 13 October 1999 (unreported), the High Court dealt with the contractual and tortious duties of a banker in the context of a dispute over the operation of a multi-currency loan facility. In particular, the court took into account the relevance of the Code of Conduct issued by the Association of Banks in Singapore and the promotional literature used by the bank. Apart from the case ofBanque Nationale De Paris v Wuan Swee May, there are several cases that touch on various other aspects of Suit No. 834.Ri Jong Son v Development Bank of Singapore[1998] 3 SLR 64dealt with the validity of an exemption clause in the terms and conditions governing accounts,Shenyin Wangou-APS Management Pte Ltd (formerly known as Shanghai International-APS Management Pte Ltd) & Anor v Commerzbank (South East Asia) Ltd[2001] 4 SLR 275dealt with issues arising from the currency measures imposed by Bank Negara and the conversion of MYR at 4: 1, whileTeo Soy Kin v United Overseas Bank Ltd & Ors, Suit No. 2092 of 1995, 28 May 1998 (unreported) dealt with allegations of misrepresentations by the bank.",
        "Whether the circumstances of the case warranted the court exercising its discretion in favour of admission": "23 In determining that the circumstances of the case did not warrant the court exercising its discretion in favour of admission, the judge was influenced by the fact that there was \"no shortage of local lawyers who [were] more than capable of handling the factual and legal issues for Anthony Wee in his dispute with the bank\". Mr Wee accused the judge of adjudicating an issue that was never put before him. In any case, he argued, the issue of whether there existed local counsel who could undertake the case was \"not a factor that should be taken into account for the purposes of determining the meaning of and intent of s 21(1) of the Legal Profession Act\".  24 We were of the opinion that this was an unfair allegation to make. In the hearing below, counsel for the appellant had dwelled at some length on Mr Wee’s purported difficulties in securing adequate local representation. It was only natural, therefore, that the judge would consider the merits of that submission. Further, case law has repeatedly underlined that the \"individual justice of each case\" must be balanced against the \"need to foster a strong and independent Bar\" (see e.g.Price Arthur Leolin v A-G & Ors[1992] 2 SLR 972at 977;Re Caplan Jonathan Michael QC (No 2)[1998] 1 SLR 440at p 445;Re Howe Martin Russell Thomas QC[2001] 3 SLR 575at p 579). The availability of local counsel is certainly one factor to be placed in the scales.  25 Another plank of Mr Wee’s case was that the judge below had failed to place adequate emphasis on the importance of doing individual justice because he did not give due consideration to the following three factors: (1) that Mr Wee was a 72 year old retiree with a serious life-threatening illness; (2) that Mr Wee would be reduced to the \"grim choice\" of leading Suit No. 834 himself or entrusting his case to Mr Goh Aik Leng, a sole proprietor of only nine years standing, if the appellant’s application were to fail; (3) that a QC was necessary to \"level the playing field\" against UBS who was represented by a Senior Counsel (‘SC’).",
        "Mr Wee was a 72 year old retiree with a serious life-threatening illness": "26 It may be true that a life-threatening illness was sufficient cause for Mr Wee to abandon any attempt to appear in person and rely on legal assistance. It did not follow, however, that the legal assistance must come in the form of a QC.",
        "Mr Wee would be reduced to the \"grim choice\" of leading Suit No. 834 himself or entrusting his case to Mr Goh Aik Leng, a sole proprietor with only nine years standing, if the appellant’s application were to fail": "27 Insofar as the second factor was concerned, the reason why Mr Wee perceived that a failure of the appellant’s application would reduce his options to two stark choices was because he was of the opinion that a local lawyer did not exist whose ability and integrity he was comfortable with. Mr Wee parted ways with his first two SCs over disputes on the manner in which they conducted his case.  28 Ms Engelin Teh SC represented Mr Wee in Suit No. 834 up to the completion of the first tranche of the trial, but was discharged on account of her assistant refusing to take instructions. Mr Harry Elias SC represented Mr Wee in a related action against UBS. Mr Wee, however, parted ways with Mr Elias on the ground that the lawyer had improperly induced him to settle his action with UBS. Mr Wee subsequently appeared in person in Suit No. 834, assisted by two lawyers who acted as his ‘co-counsel’ (Mr Mohan Singh) and ‘friend’ (Mr Goh Aik Leng), until the trial judge put a stop to the practice. Mr Wee was subsequently represented by Mr Goh, until he too discharged himself at the commencement of the appeal hearing.  29 We were of the opinion it entailed a leap in logic for Mr Wee to assume that no acceptable alternative exists among the local bar from the fact that he has been disappointed by his first two choices of SCs. As the judge below held: Even assuming his feelings about the two Senior Counsel are justified, is it reasonable of him to assume that the twenty or so other Senior Counsel would disappoint him in like fashion? Surely not. What about the 3,000 other practising members of the local Bar? His unjustifiable stance in this case does not warrant the court exercising its discretion in his favour.  While the availability and ability of local counsel is not per se an absolute bar to the admission of a QC (Re Beloff Michael Jacob QC[2000] 2 SLR 782at p 786), there would be little justification in admitting a QC if local counsel are ready and able to act (Re Gyles QC[1996] 2 SLR 695at 700). While it appeared that Mr Goh had approached three other SCs (Mr Kenneth Tan SC, Mr Michael Khoo SC and Mr Alvin Yeo SC) unsuccessfully on Mr Wee’s behalf after the failure of the appellant’s application, this was not sufficient in itself to warrant the court exercising its discretion in favour of admission, especially when Mr Wee failed to give any particulars as to why these lawyers rejected the case.  30 In any case, it appeared that Mr Wee was less than candid about his reasons for dismissing his first two SCs. According to r 71 of the Legal Profession (Professional Conduct) Rules, where a client has instructed an advocate and solicitor to include an allegation against another advocate and solicitor in an affidavit, that other advocate and solicitor must be given an opportunity to answer the intended allegations. The answer of the other advocate and solicitor must be included in the affidavit before the same is deposed to, filed and served.  31 Despite the fact that the appellant’s then counsel made allegations against the conduct of Ms Teh and Mr Elias in his affidavit in support of the application to admit the appellant, he failed to give them an opportunity to respond before filing his affidavit. Although he subsequently obtained responses from the two lawyers, he declined to exhibit Ms Teh's response on grounds of confidentiality. Insofar as Mr Elias was concerned, the SC disclosed certain communications with Mr Wee subsequent to the settlement of the case that show that, far from being unhappy with Mr Elias’s conduct of the case, Mr Wee was effusive in his thanks and praise for Mr Elias’s efforts and advice.  32 In the hearing below, as well as on appeal, neither counsel for the appellant nor Mr Wee made any attempt to rebut Mr Elias’s response. This left the bona fides of Mr Wee’s application for a QC in question. On appeal, Mr Wee refused to be drawn into a discussion on his disputes with the two SCs on the basis that it was not \"appropriate or even dignified\" to air his differences with his lawyers in the Court of Appeal. We found this excuse to be disingenuous, given the fact that it had been Mr Wee’s own counsel who had first impugned the conduct of the two SCs in an affidavit that was made on behalf and on the instructions of Mr Wee himself (para 1 of Mr Goh Aik Leng’s affidavit filed on 2 October 2002).",
        "A QC was necessary to \"level the playing field\" against the first respondent who was represented by a Senior Counsel": "33 Without the assistance of a QC, Mr Wee would have it that he would be embroiled in a battle of \"David and Goliath\" proportions because UBS was represented by Mr Davinder Singh SC, \"arguably Singapore’s foremost litigator\" with the backing of the \"vast resources of Drew and Napier\". In support of his contention that the courts should admit a QC to level the playing field, Mr Wee seized upon the case ofRe Beloff Michael Jacob QC[2000] 2 SLR 782, where the High Court permitted the defendant, who was already represented by a SC, to hire a QC in order to \"ensure a level playing field\" against the plaintiff, who was already represented by a QC.  34 We were of the view thatRe Beloff Michael Jacob QCdoes not stand for the general principle that the circumstances warrant the admission by a QC when the opposing side is represented by a SC. The High Court’s reference to the principle of a level playing field must be read in the context where the court had already decided that the factual and legal matrix of the case was sufficiently complex and difficult to warrant the admission of a QC on the plaintiff’s behalf. It would seem perverse in those circumstances, therefore, to deny the application by the defendant’s QC.",
        "The Suitability of the Appellant": "35 The appellant practised at the Chancery/Commercial Bar in England for 30 years, 15 of which were as a QC. He appeared frequently in the High Court and the Court of Appeal in England and in Hong Kong as well as in the House of Lords and the Privy Council. He has also appeared in Singapore, Malaysia, Brunei, the Bahamas and Kenya. He is an experienced arbitrator and a Fellow of the Chartered Institute of Arbitrators. He is also a member of the International Academy of Estate and Trust Law and of the Insolvency Practitioners Association. He has addressed many international law conferences in his various fields of expertise and has given lectures by invitation at Harvard and Tufts Universities in the USA.  36 In 1981, he was appointed Chairman of the team investigating the affairs of St Piran Ltd ordered by the United Kingdom’s Director of Trade. The matter involved allegations that a financier who had acquired a public listed company was stripping its assets to the detriment of the minority shareholders.  37 In 1986, the appellant was appointed a High Court Judge in Hong Kong. In that capacity, he delivered many landmark judgments in conveyancing, trust, arbitration, revenue and company law. In 1993, he was appointed to the Court of Appeal in Hong Kong and in 2000 he became the Vice-President of that Court. He retired on 29 July 2001 and was honoured with a CBE on 31 December 2001.  38 In the hearing below, the judge found the appellant did not qualify for ad hoc admission because he did not possess special qualifications or experience in the area of banking law, private or otherwise.  39 We found no reason to interfere with the judge's findings, especially when Mr Wee did nothing to establish the appellant’s suitability for admission beyond citing the \"imputed forensic ability of a Queen’s Counsel to marshal the facts contained in a 64 page Re Re Amended Statement of Claim as well as the reputed ability to cross-examine effectively the Defendant’s key witnesses against defence documentary evidence produced under the discovery process.\"  40 We found it ironical that, even if we had been inclined to accept Mr Wee’s submissions that the case called for a QC who was experienced in \"foreign exchange transactions, derivatives, ‘forward contracts’, ‘forward rates’ as opposed to ‘spot rates’ and loss limiting schemes\", the appellant in fact did not possess any expertise in these specific areas.",
        "Whether the judge below erred in ordering Mr Wee to pay $5000 in costs to the first respondent.": "41 In order to successfully impugn the costs order, Mr Wee must show that the judge committed a prima facie case of error (Lee Kuan Yew v Tang Liang Hong& Anor[1997] 3 SLR 489at p 499). Mr Wee, however, devoted little attention to this ground of appeal. He only submitted that it was wrong for the judge to order him to pay costs to UBS when \"neither are parties in Originating Motion No. 22 of 2002 and…the latter has a vested interest in the eventual outcome\".  42 Mr Wee’s submission that UBS was not a party to the appellant’s application was patently incorrect. Indeed, UBS was one of the three respondents to this appeal. It is not unprecedented for the judge to order the applicant to pay costs to the respondents (see egRe Reid James Robert QC[1997] 2 SLR 482;Re Gore Daniel Richard QC[1997] 2 SLR 478).  43 Insofar as Mr Wee’s submission that a non-party should not be asked to pay costs is concerned, he failed to cite any authority in support of his contention.  44 Interestingly, the protagonist in the leading local case on the power of the courts to make an order of costs against a non-party was Mr Wee himself. InTheKarting Club of Singapore v David Mak & Ors (Wee Soon Kim Anthony, Intervener)[1992] 2 SLR 483, the plaintiffs, an unincorporated club, failed in their action for a declaration that the defendants be deemed to have retired as officers and/or committee members of the club. The trial judge awarded costs against Mr Wee, as chairman of the club, because the action had been initiated by him and that action was found to have been unjustified. Mr Wee then applied to intervene in the action so that he would be in a position to challenge the order of costs made against him. The basis of this challenge was that the court had no jurisdiction to award costs against a non-party. Chan Sek Keong J (as he then was) held that the court was empowered to make such an order by s 18(2)(n) of the Supreme Court of Judicature Act (Cap 322) (see now, para 13 of the first schedule to the Supreme Court of Judicature Act) and O 59 r 2(2) of the Rules of Court. In particular, O 59 r 2(2) of the Rules of Court provides that the court \"…shall have full power to determine by whom and to what extent the costs are to be paid\". InChin Yoke Choong Bobby & Anor v Hong Lam Marine Pte Ltd[2000] 1 SLR 137at p 145, the Court of Appeal recognised that the court had the jurisdiction and discretion to order, in circumstances where it was just to do so, a non-party to be personally liable for costs of court proceedings.  45 We found that there were ample grounds for the judge to order that Mr Wee be personally liable for costs. As inTheKarting Club of Singapore v David Mak & Ors (Wee Soon Kim Anthony, Intervener), Mr Wee was responsible for initiating an unwarranted application. As the judge below expressly found, it was Mr Wee’s own unjustifiable stance that no local counsel would be fit for the job that was responsible for the predicament that he was in.",
        "Conclusion": "46 For the foregoing reasons, we dismissed the appeal with costs to all three respondents. The usual consequential orders follow.",
        "Appeal dismissed.": ""
    }
}