{
    "case_title": "Roberto Building Material Pte Ltd and Others v Oversea-Chinese Banking Corp Ltd and Another",
    "ncitation": "[2003] SGCA 21",
    "coram": "Chao Hick Tin JA; \n      Judith Prakash J; \n      Tan Lee Meng J",
    "sections": {
        "Background": "2 The applicants in the motion are the four appellants in Civil Appeal No. 100/2002.  The first appellant (Roberto) is a Singapore incorporated company engaged in the business of supplying building materials to the construction industry.  The second, third and fourth appellants are the directors of Roberto. 3 There are two respondents in the civil appeal.  The first is a bank, the Oversea-Chinese Banking Corporation Ltd (OCBC), and the second, Mr Don Ho Mun-Tuke, a public accountant, who was appointed receiver and manager of Roberto pursuant to rights conferred upon OCBC under a deed of debenture entered into between Roberto and OCBC.  The second to fourth appellants stood as guarantors in relation to the credit facilities granted by OCBC to Roberto. 4 The appointment of Mr Don Ho as receiver and manager was made by OCBC on 22 April 2000.  At that point in time, Roberto owed OCBC a sum of about $32.9 million.  After his appointment as receiver and manager, attempts were made by him to sell a certain real property belonging to Roberto.  Some attempts were also made to rent out the property on short term leases.  But, up to the time of the institution of the action by Roberto and the guarantors against OCBC and Mr Don Ho for alleged breaches of their duties, the property had not yet been sold.  Except for a brief period, 13 November 2000 to 12 February 2001, when the 6thfloor was rented out, no rental income from the building was obtained. 5 The trial of the action stretched over some nine days in August/September 2002.  At its conclusion Roberto’s and the guarantors’ claims against OCBC and Mr Don Ho were dismissed with costs.  On 26 September 2002 the appellants filed their Notice of Appeal, having furnished the standard sum as security for costs.  The trial judge rendered his Grounds of Decision on 9 December 2002.  The appellants filed their Case in the appeal on 10 February 2003.  The respondents filed their Cases on 10 March 2003.  In the meantime, OCBC’s costs for the trial were taxed.  Despite request, the taxed costs were not paid. 6 In March 2003, by way of two motions (Nos. 18/2003 and 25/2003) the respondents asked for the appeal to be stayed until the taxed costs of the first respondent in relation to the action below have been paid  and also for further security for costs of the appeal.  The applications came before Choo Han Teck J who, pursuant to s 36(1) of the SCJA, ordered the appellants to furnish to OCBC, by 17 April 2003, further security for costs of the appeal in the sum of $40,000 by way of a banker’s guarantee.   He also ordered that the unpaid taxed costs of the trial below due to OCBC in the sum of $287,849, plus disbursements, be paid by the same date, failing which the appeal against both the respondents would be stayed and OCBC would be entitled to make a further application to dismiss the appeal.   In respect of the second respondent, Mr Don Ho, the judge ordered that the appellants furnish him $10,000 as additional security.  The additional security for both respondents was duly provided by the appellants.  However, the taxed costs of OCBC remained unpaid.",
        "Jurisdiction under s 36(1)": "7 By way of the present motion, the appellants sought to have part of the order, i.e., that the appeal be stayed unless they paid up the taxed costs of OCBC at first instance by 17 April 2003, discharged or varied.  The appellants made a two-pronged submission.  First, they argued that the single Judge, exercising jurisdiction under s 36(1), had no power to make the order in question.  Second, even if the single Judge had such a power, he should not have exercised it in the circumstances of this case. 8 Section 36(1) reads: In any proceedings pending before the Court of Appeal, any direction incidental thereto not involving the decision of the appeal, any interim order to prevent prejudice to the claims of parties pending the appeal, and any order for security for costs and for the dismissal of an appeal for default in furnishing security so ordered, may at any time be made by a Judge. 9 Quite clearly, under this provision there are three limbs indicating the three broad categories of orders that may be made by a single Judge. (i)  any incidental direction not involving the decision of the appeal; (ii) any interim order to prevent prejudice; and (iii) any order for security for costs of the appeal and the consequential order for dismissal of appeal for default. 10 It is quite clear that the order under challenge does not fall under the third limb; nor under the second.  The question is whether it falls under the first limb.  On the face of it, when a judge orders that the costs below be paid, otherwise there will be a stay of the appeal, he is not making an order involving the decision of the appeal.  It is, however, no less a procedural order.  By qualifying the expression “direction incidental thereto” with the phrase “not involving the decision of the appeal”  the legislature must have intended that any direction, so long as it does not involve the disposal of the appeal may be made by the single Judge. 11 On the other hand, the appellants submitted that as the order could lead to the appeal being struck out and not just stayed if there was non-compliance, it is outside the scope of the first limb.  In this regard, they relied upon the decision of this Court inTan Chiang Brothers Marble (S) Pte Ltd v Permasteelisa Pacific Holdings Ltd[2002] 2 SLR 225where the court stated, in relation to the first two limbs of s 36(1), that they “… are premised on the existence of an appeal and the need for certain interim orders or directions to safeguard the interest of the parties pending the disposal of the appeal.” 12 In this regard, it may be useful to ask an even more basic question, namely, whether the full Court of Appeal has the power to grant such an order.  There is a dearth of authority on point.  Two cases may be mentioned although they are not really germane.  InJ.H. Billington Ltd v Billington[1907] 2 KB 106, there was an appeal from a decision of an official referee to the King’s Bench Division.  Although the rules were silent as to the power of the court to order security for costs in such an appeal, the Court of Appeal held that the court had an inherent power to do so. 13 InRe E.E. Manasseh[1938] SSLR 199, a decision of the Straits Settlements Court of Appeal, the plaintiff failed in his civil claim against the defendant who, in turn, took out bankruptcy proceedings against the plaintiff for failing to pay his taxed costs of the action.  In the meantime the plaintiff appealed against the decision.  On hearing the bankruptcy petition, the judge ruled that he had no discretion to order a stay and made the plaintiff a bankrupt.  The Court of Appeal reversed that order holding that the judge had the power under s 95 of the Bankruptcy Ordinance to order a stay of the bankruptcy proceedings, subject to such terms as might be just.  It ordered a stay on terms that the plaintiff should furnish security for the approximate costs of the appeal. 14 Under the SCJA, an unsuccessful party in an action before the High Court has an undoubted right of appeal to have his case heard and reviewed by an appellate tribunal.  It is because he has already had the opportunity of being heard at first instance and has lost, that the Rules of Court provide for the furnishing of security for the appeal.  The Rules also provide [O 57 r 3(4)] that the Court of Appeal may, at any time, where it thinks fit, order further security.  Under the third limb of s 36(1) of SCJA, this power to order further security may be exercised by a single Judge. 15 Interestingly, the Rules of Court do not provide that the Court of Appeal can order a stay of the appeal where the taxed costs of the trial below remain outstanding.  However, notwithstanding this omission, we think this Court has the inherent jurisdiction, where the circumstances so warrant, to require an appellant to pay the costs of the action below, on penalty of the appeal being stayed.  Order 92 r 4 provides that: For the removal of doubt it is hereby declared that nothing in these Rules shall be deemed to limit or affect the inherent powers of the Court to make any order as may be necessary to prevent injustice or to prevent an abuse of the process of the Court. 16 By its very nature, the inherent jurisdiction of the court should only be exercised in special circumstances where the justice of the case so demands. This Court had, inWee Soon Kim Anthony v Law Society of Singapore[2001] 4 SLR 25cited a passage from Sir Jack Jacob published in[1970] 23 Current Legal Problems 23, indicating how this jurisdiction should be exercised:- … This [inherent] jurisdiction may be invoked when it is just and equitable to do so and in particular to ensure the observance of the due process of law, to prevent improper vexation or oppression and to do justice between the parties.  Without intending to be exhaustive, we think an essential touchstone is really that of ‘need’. 17 Accordingly, this inherent jurisdiction should only be invoked in exceptional circumstances where there is a clear need for it and the justice of the case so demands.  The circumstances must be special.   The costs due to the successful party in the court below, unless there is an order for a stay of execution, are a debt which is recoverable under the normal enforcement process.  Ordinarily, this would have nothing to do with the appeal which is pending.  It may well be true that if the successful party were to seek execution by bankruptcy proceedings, he could encounter some problems in view of the fact that the case is under appeal.  But that is not the only manner of execution.  In any event, a right of appeal should not be curtailed by considerations which are extraneous to the appeal.  The appellate court should not be used as a means to enable the respondent to obtain payment of his taxed costs.  The appeal, if it proceeds,  would only cause prejudice to the respondent as to the costs of the appeal, as he would have to incur the expenses of defending the judgment.  To that extent, he is entitled to be secured. 18 In this case the single Judge seemed to think that the mere fact that the taxed costs of the trial were not paid and yet the appellants could nevertheless proceed with the appeal wasipso factoprejudicial to the respondents.  For the reasons above, we would respectfully differ.  In the same vein, we do not think the merits of the appeal are a relevant consideration either.  It is different if an appellant is seeking the indulgence of the court by, for example, applying for an extension of time to file or serve a notice of appeal: see, e.g.,Nomura Regionalisation Venture Fund Ltd v Ethical Investments Ltd[2000] 4 SLR 46. 19 Accordingly, the circumstances where such an order may be made must be rare indeed. We do not wish to prejudge matters or lay down any definite considerations.  It is the twin criteria of prejudice/justice which would be decisive.  Purely as an example, if a plaintiff was required by the court below to furnish security, and failed to do so, and the case went on to trial as the defendant wished to have the matter disposed of expeditiously, and the plaintiff then failed and appealed, this may be the sort of circumstance where the appeal court could invoke that jurisdiction to order payment of the costs below before the appeal may be allowed to proceed. 20 The respondents had relied upon the following passage inHalsbury Laws of England, Vol 37 (4thEdn) ¶930to support the contention that the Court of Appeal has an inherent jurisdiction to stay an appeal until the taxed costs of the trial below had been paid:- Under its inherent jurisdiction the court has power to order the stay of proceedings or further proceedings in a variety of circumstances.  These include power to stay proceedings … where the costs of a previous claim or previous proceedings have not been paid. 21  But this passage does not concern the case of an appeal from the High Court to the Court of Appeal.  There, the authors are talking of a second set of proceeding being instituted when the costs of the previous claim or proceedings have not yet been paid.  This is illustrated byM’Cabe v Bank of Ireland(1889) 14 App Cas 413 andSinclair v British Telecommunications plc[2000] 2 All ER 461. 22 It is perhaps of interest to note another passage in the same paragraph ofHalsbury’s Laws:- The stay of proceedings is a serious, grave and fundamental interruption in the right that a party has to conduct his litigation towards the trial on the basis of the substantive merits of his case, and therefore the court’s general practice is that a stay of proceedings should not be imposed unless the proceedings beyond all reasonable doubt ought not to be allowed to continue. 23 Reverting to the question of interpretation of the first limb of s 36(1), we were inclined to take a wider view of that limb, as it is a facilitative provision to assist the Court of Appeal.  Thus, where the circumstances warrant it, the single Judge may order a stay until the costs below are paid, with the caveat that if there is any failure to comply with that order, the single Judge may not strike out the appeal, as any order which such a Judge may make under that provision is on the premise that an appeal is pending.  The striking out of an appeal has to be done by the full quorum of the Court: seeTan Chiang Brothers Marble (S) Pte Ltd v Permasteelisa Pacific Holdings Ltd(supra). 24 In the circumstances of the present case, there was nothing to warrant the exercise of this jurisdiction."
    }
}