{
    "case_title": "Ei-Nets Ltd and Another v Yeo Nai Meng",
    "ncitation": "[2003] SGCA 48",
    "coram": "Chao Hick Tin JA; \n      Judith Prakash J; \n      Yong Pung How CJ",
    "sections": {
        "The background": "2    The facts giving rise to the actions were somewhat involved.  They  may, however, be briefly stated as follows.  Yeo was a shareholder in a company called Plan-B Technologies Pte Ltd (“Plan-B”).  Plan-B in turn wholly owned another company called Plan-B Speed.com Pte Ltd (“Speed”).  Speed, in turn, owned 74% of the issued and paid-up capital of a third company, Suntze Comunications Engineering Pte Ltd (“Suntze”). Speed then had a paid-up capital of $600,000/-, with each share bearing a par value of $1/-. 3    Yeo was at all material times an Executive Director of Plan-B and the Managing Director of Speed.  As regards Suntze, its Managing Director was Mr Lawrence Tan Wai Liang (“Tan”). 4    In late 1999, a public listed company, Strike Engineering Ltd (“Strike”), was interested in investing in Speed.  Negotiations proceeded.  This led to the execution on 18 November 1999 of a Sale, Purchase and Subscription Agreement (“SPS Agreement”) between Plan-B, Strike and Speed.  Under this Agreement, Plan-B and Strike would each eventually own 4.6 million shares in Speed.  This was to be brought about in the following stages:- First stage Plan B was to transfer all its 600,000 shares in Speed to Strike in exchange for 11,574,000 ordinary shares of Strike with a par value of $0.05, and which had a market worth of $5 million.  Strike would further subscribe for another 2 million new shares in Speed at par value. Second stage Thirty days after the completion of stage one, Plan-B would subscribe for 2.6 million shares in Speed at par value.  Sixty days from the completion of stage one, Plan-B and Strike would each subscribe for another 2 million shares in Speed also at par value. 5    At the time, another company, Ei-Nets.Com Ltd (“Ei-Nets”) was wholly owned by Armorcoat International Pte Ltd (“Armorcoat”).  LBC was a major shareholder and director of Armorcoat. On 7 January 2000, Plan-B and Strike entered into a Memorandum of Understanding (“MOU”) with Armorcoat and Ei-Nets with the object of having Ei-Nets listed on the Stock Exchange.  Under the MOU, it was envisaged that when both Plan-B and Strike had fulfilled their terms under the SPS Agreement, they would transfer their total shareholding of 9.2 million in Speed to Ei-Nets in exchange for shares in Ei-Nets. 6    The MOU further provided that a formal Share Exchange Agreement (“SE Agreement”) would be entered into between the parties as soon as possible and, in any event, no later than 31 January 2000. 7    Due to one reason or another, the execution of the SE Agreement was delayed and it was only signed on 22 May 2000.  This Agreement provided that the completion date would be 15 June 2000.  By recital B to the Agreement, the parties thereto had appreciated that the obligations of Strike and Plan-B under the SPS Agreement to acquire 4.6 million shares each in Speed had not yet been carried out in full. 8    There was delay on the part of Plan-B and Strike in fulfilling their obligations under the SPS Agreement.  The first stage of the SPS Agreement was performed only on 9 May 2000.  By 15 June 2000, the original date specified for completion under the SE Agreement, the second stage under the SPS Agreement had yet to be carried out; this only occurred on 28 June 2000. 9     The upshot was that, by mutual consent, the completion of the SE Agreement was postponed to 19 July 2000.  Before that, on 14 July 2000, Plan-B and Strike executed the share transfer forms to transfer their respective Speed shares to Ei-Nets. 10    Two important pre-conditions to the share exchange laid down in  the SE Agreement were that, upon completion, Speed would have (i) S$8.6 million cash injected into it; and (ii) a Net Tangible Asset value of not less than S$6 million on 15 June 2000.  The eventual outcome under the SE Agreement would be that Strike/Plan-B of the one part and Armorcoat of the other part would each hold 50% of Ei-Nets, and Speed would become a wholly-owned subsidiary of Ei-Nets. 11    The matter that gave rise to the two actions related to the manner in which Plan-B paid for the 4.6 million shares it acquired in Speed under the SPS Agreement.  Plan-B paid with two cheques, one for $675,585 and the other for $2 million.  The first cheque was cleared on 5 July 2000 and the second on 7 July 2000.  The remaining purchase price of $1,924,415 was paid by capitalising inter-company loans of the same amount.  The audited accounts of Speed treated the payment for the shares as having been made by 30 June 2000.   What the appellants objected to was the capitalisation of the $1,924,415 debt. 12    We now turn to set out the facts relating to the capitalising of the inter-company loans.  In September 1999, Speed purchased an IT and telecommunications portal (“Telport”) from Suntze for $2.5 million.  By 30 May 2000, Speed still owed Suntze $1,390,448.  At the same time, Speed also owed Plan-B $850,000 and Suntze owed Plan-B $1,074,415. On the suggestion of the accountant of Speed, one Ms Tey, the amount of $1,074,415 owed by Suntze to Plan-B was offset against the $1,390,448 owed by Speed to Suntze.  The net result of this offset was that Speed owed Plan-B a total of $1,924,415 and Speed’s debt to Suntze was thereby reduced to only $316,033.  The appropriate entries were made in the books of the three companies.  It was clear then that Plan-B did not have the cash in hand to pay fully for the 4.6 million shares in Speed.  Thus, the need to capitalise the debt of $1,924,415. 13    In late July 2000, a similar transaction took place whereby a debt of $351,388 owed by Suntze to Plan-B was transferred to Speed, resulting in Speed owing the said amount to Plan-B. 14    The terms of the SE Agreement provided that there would only be a true merger between Speed and Ei-Nets if the public listing of Ei-Nets was successful.  Until then, the merger of Speed and Ei-Nets was only on a pro-forma basis for listing purposes.  There was no change in the constitution of the Board of Speed. 15    There was some delay in obtaining listing of Ei-Nets.  That eventually occurred in January 2001.  It was only then that the Board of Speed was reconstituted and Yeo ceased to be its Managing Director. Instead, Yeo became an executive employed by Ei-Nets.  It was also around this time that LBC was appointed the President and Chief Executive Officer (“CEO”) of Ei-Nets. 16    A formal contract of employment was entered into between Yeo and Ei-Nets on 3 January 2001, but back-dated to commence on 3 June 2000.  Under the contract of employment, Yeo’s services were for a term of three years from 3 June 2000.  Thereafter, they were to continue automatically on a year-to-year basis unless terminated by either party giving to the other six months’ notice in writing.  However, Ei-Nets could, with his consent, second Yeo to one of its subsidiaries.  His services could, in any case, be terminated if, “in the reasonable opinion of the Board”, he was guilty of, inter alia, misconduct or any neglect of duties. 17    For reasons not known, an employee of Ei-Nets, one Wan Tuck Wah, either in early May 2001 or shortly before then, conducted an audit of Speed’s accounts (“Wan Report”).  This report was not produced to the court.  According to LBC, the Wan Report led him to have misgivings about the accounts of Speed.  LBC consulted a legal practitioner, Mr Lim Chor Pee (“Mr Lim”) on the Wan Report.  Between them it was decided that, instead of asking the auditors of Speed, Suntze and Ei-Nets, Deloitte & Touche (“D&T”), to look into it, they should appoint one Mr JK Medora to undertake the task with two specific terms of reference – namely, to determine  – (i)  whether, as on 15 June 2000, there was a cash injection of $8.6 million in the form of equity into Speed and that Speed had a NTA of not less than $6 million; (ii) whether an amount of $351,388 was transferred in the accounts of Speed, as being owed to Plan-B instead of to Suntze. 18    Mr Medora concluded in his report (“Medora Report”) that the transfers of the inter-company loans from Suntze to Plan-B were fictitious and that the NTA of Speed on 30 June 2000 was only $1,267,147.  He  disregarded the capitalisation of the debt owing by Speed to Plan-B of $1,924,415 and the cheque payments received by Speed which were cleared after 30 June 2000. 19   Medora also concluded that the transfer of the loan of $351,388 from Suntze to Plan-B was fictitious as he did not see any documents evidencing the same. 20   Mr Lim, having studied the Medora Report, produced his own report (“LCP Report”) wherein he advised that the accounts of Speed should be fully investigated.  Notwithstanding such a reservation, he went on to make certain conclusions.  He stated that the fictitious book entries highlighted in the Medora Report appeared to be a fraudulent device resorted to by the person(s) who authorised the transaction to misappropriate the sum of $1,074,415 and that this device constituted a breach of s 76(1)(a) of the Companies Act (Cap 50).  This section prohibits a company from giving financial assistance for the purpose of the acquisition of its own shares.  Mr Lim also stated that Speed could initiate legal proceedings against Plan-B for money had and received resulting from the payment of non-existent debts amounting in total to $1,425,803 ($1,074,415 plus $351,388). 21   Upon receipt of the LCP Report, LBC called for a meeting of the Audit Committee of Ei-Nets on 23 May 2001.  Also placed before the Committee that day were the Medora Report and an unsigned document which appeared to be a draft legal opinion (“draft opinion”) prepared by a lawyer in Mr Lim’s firm, Mr Lim Teck Hui.  These three documents will hereinafter be referred to as “the three reports”.  On realizing that Yeo had not been given the chance to study the three reports beforehand, Prof Cham Tao Soon (“Prof Cham”), an independent director of Ei-Nets and a member of the Audit Committee, proposed that the consideration of this matter be postponed.  It was so agreed.  Sometime later, Prof Cham also recommended that a neutral firm of accountants, such as PriceWaterhouseCoopers, be appointed to look into the matter objectively. 22    Following the meeting, Prof Cham sent an e-mail to LBC making further suggestions as to how the dispute should be handled, including an objective way of appointing a third party to look into the matter.  He also said that the relevant parties should be given easy access to documents to prepare their cases for presentation to the third party.  Prof Cham opined that the Chairman of the Audit Committee should consult the Committee as to the terms of reference of the third party.  Apparently, LBC had already instructed PWC to give an opinion on two issues before the receipt of this e-mail from Prof Cham. 23    The first issue on which PWC’s opinion was sought was whether the capitalisation of current loans would come within the meaning of “cash injection”.  On this, PWC stated in its report (“PWC Report”) that a “cash injection” would include the capitalisation of loans only if the latter were short term loans with no fixed terms of repayment, i.e., the loan was repayable upon demand.  The second issue was as to the value of the NTA of Speed as at 15 June 2000.  On this, PWC stated that it was only $376,741.  However, PWC also noted that significant cash payments and capitalisation of loans had taken place after 15 June 2000. 24    On 18 June 2001, LBC simply handed a letter to Yeo informing the latter that he was being transferred back immediately to Plan-B. The next day Yeo replied rejecting the “transfer”, stating that he was still an executive of Ei-Nets, offering to return to work and asking for a response within 7 days.  There was no response. 25    On 27 June 2001, Yeo instituted an action against Ei-Nets in the Subordinate Courts (“the first action”) for repudiatory breach of his  employment contract.  Also on the same day, Ei-Nets, through LBC, wrote to Yeo stating that the latter’s services were terminated with immediate effect because of the irregularities found in the accounts of Speed as pointed out in the Medora Report. 26    On 4 July 2001, the Board of Directors of Ei-Nets met to consider the PWC report.  Even though the Board suggested that the management of Ei-Nets and Yeo should jointly review the documents and come to a conclusion, on 20 July 2001, LBC wrote to Yeo stating, after referring to the Board meeting, that “I… confirm that the management issue has been resolved.”  However, not being a member of the Board, Yeo did not know what this sentence meant.  Yeo sought clarification but the response given by LBC was not helpful. 27    At a Board meeting of Ei-Nets held on 21 September 2001, Mr Chang Meng Teng, the Chairman of the Audit Committee, reported to the Board that the Audit Committee, after discussion with PWC and Mr Aric Loh Siang Khee (“Mr Loh”), the partner of D&T in charge of the Speed accounts, accepted that the completion of the SE Agreement was in order. 28    On 9 October 2001, Yeo commenced an action in the High Court against Ei-Nets and LBC for defamation (“the second action”) on the basis  that the three reports alleged that Yeo was guilty, inter alia, of fraud, and gross misconduct against Speed, and had acted in breach of s 76 of the Companies Act. 29    LBC did not deny that the three reports contained defamatory statements and that they were circulated to the members of the Board and shown to three staff members and an outsider, Mr Christopher Chong Meng Tak (“Chong”).  LBC’s defences were those of justification and qualified privilege. 30   In the action for wrongful dismissal, Ei-Nets counterclaimed against Yeo for the two transferred amounts (i.e., $1,074,415 and $351,388).  In view of the quantum of the counterclaim, the first action was later transferred to the High Court and consolidated with the second action to be heard together.",
        "Decision below": "31    The trial judge, after due consideration of the evidence adduced before him, came to the conclusion that nothing done by Yeo in relation to Speed was in any way irregular or dishonest. He found that at all times, in making the transfers, Yeo had acted honestly in the best interests of Speed.   Yeo had furnished all relevant information on Speed to Ei-Nets both before and after Speed became its subsidiary.  The trial judge was of the view that the findings in the Medora Report and the LCP Report were badly flawed.  He rejected the allegation that Yeo was involved in surreptitious and dishonest activities and held that the appellants had not proven that the transactions effected were irregular, let alone fraudulent; nor was there any breach of s 76. 32    The trial judge did not accept LBC’s assertion that Ei-Nets did not know, at the time the SE Agreement was signed, of the SPS Agreement.  He pointed out that in the recital to the SE Agreement it was recognised that Plan-B/Strike did not as yet have 9.2 million shares in Speed.  Quite naturally, the advisers of Armorcoat/Ei-Nets would have acquainted themselves with the factual scenario and thus been aware of the SPS Agreement.  In turn, the advisers would have advised Armorcoat and LBC of the same. 33    The trial judge rejected the suggestion that at the time of the transfers of inter-company debts, Suntze was insolvent. He also found that Strike, Plan-B, Armorcoat and Ei-Nets, in agreeing to postpone the completion of the SE Agreement to 19 July 2000, had also impliedly agreed to postpone the date by which the conditions precedent had to be met. 34    In this regard, the Judge noted that D&T, in auditing the accounts of Speed for the six months period ending 30 June 2000, had observed (signed on 15 September 2000) that during the period, the Company – “issued 8,600,000 ordinary shares … for a cash consideration of $6,675,586 where the proceeds were used as working capital, and by way of capitalisation of a loan payable to Plan-B of $1,924,414.” D&T had not found anything remiss in the issue of the 8.6 million shares of Speed and the methods of payment therefor. 35    As regards the dismissal of Yeo from the employment of Ei-Nets, the trial judge noted that it was “unusual and somewhat high-handed” that LBC should dismiss Yeo without even discussing the question with the Audit Committee or the Board.  In any event, he found the dismissal wrongful for two main reasons.  First, the Board never met to consider the dismissal of Yeo.  The management of Ei-Nets had no power under the contract to dismiss Yeo.  Second, even if the Board had considered the matter and decided to dismiss him, such a decision would not, in the light of the circumstances alluded to before, have been reasonable.  Accordingly, the Judge awarded Yeo $308,000 as damages for the wrongful dismissal and dismissed the appellants’ counterclaim. 36    On the defamation claim, the trial judge, following the findings above, rejected the defence of justification.  As regards the defence of qualified privilege, he ruled it was not available to the appellants as regards the publication of the three reports to the three staff members and Mr Chong.  He observed that the appellants did not seek to show how the publication to these persons was an occasion which attracted qualified privilege.  For the publication of the defamatory statements in the three reports to the four persons, the judge awarded Yeo damages in the sum of $80,000. 37    For completeness, we should also add that as regards the publication of the three reports to the members of the Board, the judge, while recognising that LBC had entertained some ill-will towards Yeo, found that the dominant reason why LBC distributed the three reports to the Board members was that, as the Chief Executive of Ei-Nets, he was duty-bound to draw the attention of the Board to the disturbing conclusions reached in the Medora and the LCP reports.  Accordingly, the Judge found that Yeo had not established any express malice on the part of LBC to displace the defence.",
        "Issues": "38    The issues raised before us traversed basically the same points as those canvassed at the trial.  On the action for wrongful dismissal, the appellants submitted that the Judge erred, in the main, in making the following findings:- (i)  that there was nothing remiss in Yeo effecting the transfers of the loans owing by Speed to Suntze, to Plan-B; (ii) that in capitalising the total loan owing by Speed to Plan-B, that amounted to a “cash injection” and accordingly, there was no breach of s 76 of the Companies Act. 39    In any event, even if the dismissal had been wrongful, the appellants submitted that the damages awarded were excessive.  They contended that Yeo should not be entitled to more than six months’ wages (including  other benefits) as the employment contract was not for a fixed term of three years; all that was required was six months’ written notice of termination or six months’ wages in lieu of notice.   Moreover, Yeo had also failed to mitigate his loss by seeking alternative employment.  The judge had also erred in not deducting the tax which Yeo would have had to pay on his wages. 40    As regards the Judge’s findings on defamation, the appellants took two main points.  First, the Judge was wrong to hold that the defence of qualified privilege did not apply to the publication of the three reports to the three staff members of Ei-Nets and Mr Chong.  Second, having regard to precedents, the quantum of damages awarded to Yeo for the very limited publication of the three reports to the four persons concerned was clearly excessive.",
        "Our consideration": "41    It is quite clear that in respect of the debt owed by Speed to Suntze, there was no fixed term for repayment.  The same is true as regards the debt due from Suntze to Plan-B.  The transfers and mutual offsetting were approved by the three companies and duly entered in the books although there was no formal resolution.  The problem, as found by the Judge, would appear to have been caused by the Medora Report which made certain determinations without first ascertaining the true position.  Mr Medora looked only at the records of Speed and nothing else.  He spoke to nobody.  Neither did he seek any clarification from either Plan-B or Suntze.  He did not know that the completion of the SE Agreement had been postponed to 19 July 2000, nor of its aim of obtaining listing on the Stock Exchange.  He had construed his terms of reference far too narrowly. 42    We endorse the view of the Judge that Mr Medora had jumped to conclusions, which, in turn, caused Mr Lim to have reached the same unwarranted conclusions, although Mr Lim thought that the matter should be investigated fully. 43    The fact of the matter is that Plan-B had been advancing funds, without formal agreements, for the activities of Speed and its subsidiary Suntze.  The audited accounts of both Speed and Suntze recorded these loans as having no fixed terms of repayment.  According to the expert called by Yeo, Mr Kaka Singh, whose evidence the judge accepted, a loan with no fixed terms of repayment would rightly be classified as a current liability as it would be construed as “repayable on demand”.  This is in line with the Statements of Accounting Standard in Singapore which provides that an amount which has “no fixed terms of repayment” should be classified as a current liability and deemed repayable on demand.  PWC was also of the opinion that the term “cash injection” would include the capitalisation of loans if they were short-term loans with no fixed terms of repayment.  There are authorities which decide that capitalisation of a current debt is in order: Arsene Larocque v Hyacinthe Beauchemin[1897] AC 358. 44    Admittedly, there were no formal resolutions sanctioning the transfers.  Mr Kaka Singh pointed out that between related companies this was a common practice and it was not a requirement of law that such formalities must be fulfilled.  As we see it, the truth of the matter is that both Speed and Suntze owed money to Plan-B, and Speed also owed money to Suntze.  There is no reason why by mutual consent, such debts may not be offset.   No company suffered a disadvantage or loss. 45    The argument was made that at the time of the transfer of debts, Suntze was insolvent.  There was no credible evidence on that.  In the view of the auditors, D&T, that was not so; they did not qualify their report.  As Mr Kaka Singh explained, in determining the question of insolvency, one does not look just at the bottom line.  More importantly, the auditor must evaluate whether the company can be regarded as a going concern, and, for this purpose, look at various factors including the profitability of the company and the plans which the directors have for the company.  Indeed, in reality, while Suntze was cash poor, it was asset rich.  Even Mr Kon Yuen Kong, the expert called by the appellants, agreed that there were matters other than what appeared in the financial statements of a company that needed to be considered before it could conclusively be said that the company was insolvent. 46    It is true that under the SE Agreement it was provided that on the original completion date of 15 June 2000 the NTA of Speed should be at least $6 million.  However, as the parties to the SE Agreement had agreed to postpone the completion date, then surely 19 July 2000 would have been the new date on which the NTA must be fulfilled.  Otherwise it would make no sense.  By that date, the requirement of an NTA of $6 million was clearly met. 47    In this regard, we find it significant that under the SE Agreement, the expected NTA of Speed was to be not less than $6 million.  It may be recalled that under the SE Agreement, there was to be a cash injection for the newly issued 8.6 million shares.  Strictly, the issue of the new shares would have brought in $8.6 million.  Why then did the SE Agreement only provide for an NTA of $6 million?  This clearly indicated that the parties realised there were debts of Speed to be cleared.  Thus, the NTA was a reduced sum of $6 million.  Obviously, the ordinary method of repaying a debt would be the issue of a cheque by a debtor to a creditor.  By that method, in the situation here, multiple cheques would have to be issued by the parties concerned.   Instead of doing all that, the same was effected just by book entries, without the hassle of physically issuing cheques. 48    Once it is shown that the debt transfers were real and not fictitious, as we think was shown, and that capitalisation of a current debt amounted to a “cash injection”, then the very foundation upon which LBC sought to dismiss Yeo no longer existed. 49    Admittedly, between 9 May 2000 to 5 July 2000, Plan-B was technically not the holding company of Speed or Suntze, having divested its 600,000 shares in Speed to Strike.  But the matter must be viewed in the context of – (i)  the arrangement envisaged in the SPS Agreement,  which  was  that, prior to completion, liabilities owing by Speed and Suntze to Plan-B would have to be paid up and that Plan-B and Strike would each hold 50% of Speed; and (ii) the arrangement under the SE Agreement which, as has been explained above, also envisaged that debts of Speed should be paid up. The set-offs effected between Plan-B, Speed and Suntze were in line with this scheme.   It must be borne in mind that the substance of the complaint by Mr Medora was that the “transfers” were fictitious, thereby fraudulently creating a debt in favour of Plan-B.  This was not shown to be the case.  Therefore, even if one takes the strict view and holds that Plan-B was, at the time, no longer related to Speed and Suntze, and that there should have been a formal agreement reflecting the assignments, the absence of such a document could hardly constitute fraud or dishonesty on the part of Yeo, warranting his dismissal from employment.  It was really  a technical lapse which did not cause any loss to either Speed or Suntze. 50Before we move to the issue of quantum of damages for wrongful dismissal we ought to address one other point, even though like the Judge, we do not think it is of any consequence in the context.  The point made was that the treatment in the audited accounts of Speed for the year ending 30 June 2000 of the three cheques as payment received as at 30 June was wrong, as the last cheque was not cleared until 13 July 2000.  If the cheques were correctly treated, then, as at 30 June 2000, the NTA of Speed would not have met the requirement of $6 million.   There are really two answers to this point.  First, there is evidence before the court from both Mr Loh and Mr Kaka Singh that such treatment was permitted in accounting practice provided that it was not done as “window-dressing”.  Mr Loh, who was subpoenaed to testify, did not think there was any need to review the accounts which he had audited and given an unqualified clearance.  Here, it is of interest to note that D&T are still the auditors of Ei-Nets and its subsidiaries and Mr Loh, the partner-in-charge.  Second, in any event, this point is irrelevant as the relevant date for determining whether the pre-conditions set by the SE Agreement had been met was not 15 June 2000 but the mutually agreed deferred date of 19 July 2000.",
        "Wrongful dismissal and damages": "51    In the light of the above, we wholly concur with the Judge that Yeo had done no wrong to warrant his dismissal.  What is unusual is that LBC acted on his own without awaiting a decision of the Audit Committee or of the Board.  He seemed anxious to get rid of Yeo so much so that he even disregarded the terms set out in the employment contract.  It is not in dispute that the Board never discussed the dismissal of Yeo.  The Board never made a finding that Yeo was guilty of any misconduct or neglect of duty.  In fact, the report of the Chairman of the Audit Committee to the Board indicated that no wrong was done by Yeo.  Accordingly, there was clearly a breach of the employment contract in respect of which Yeo was entitled to damages. 52    The Judge even went further to state that had the Board decided that Yeo was guilty of misconduct and should be dismissed, that decision would have been wrongful as it would have been a decision which could not be supported at all. 53    An alternative argument of the appellants is that even if Yeo had not misconducted himself, so that his dismissal was wrongful, the damages awarded by the court below were excessive. 54    In this regard, it is necessary to look at the exact terms of the employment contract:- 2.2  This Agreement shall commence on the Commencement Date and the employment shall continue … for an initial term of three (3) years and thereafter shall automatically continue from year to year unless terminated in accordance with this Agreement or by either party giving to the other six (6) months’ notice in writing of such intended termination, which notice is to expire at or on any day after the end of the said period.  In lieu of the said six (6) months’ notice, either party may pay to the other party an amount equivalent to six (6) months’ salary based on the Executive’s last drawn monthly salary, such salary to include all allowances and benefits payable to the Executive. …” 55    Based on this clause, the appellants argued that they could at any time terminate the contract of employment by giving six months’ notice in writing.  In this connection, the appellants relied upon the local case Yeo Kee How v Container Warehousing & Transportation Pte Ltd[1975-1977] SLR 435to contend that the damages awarded should only be limited to the wages due to Yeo for the six months’ notice period. However, it is pertinent to note that the relevant clause in Yeo Kee How,  which was in two parts, was as follows:- “I.  CWT shall employ the Commercial Manager and the Commercial Manager shall serve CWT as Commercial Manager for a term of three years from the date hereof and thereafter until this Agreement shall be terminated by either party by giving three months’ notice in writing to the other. II.  Upon expiry of this Agreement, either CWY or the Commercial Manager may request a renewal of the said Agreement or enter into a fresh Agreement under such terms and for such purpose as may be determined, by giving to the other three calendar months notice in writing. ” 57    Before we consider the decision in Yeo Kee How further, it is necessary that we refer to the case of Costigan v Gray Bovier Engines Ltd[1925] 41 TLR 372where the contract provided that the engagement – “ was deemed to have commenced on September 11, 1922, and was to continue for a period of 12 calendar months from such date, and thereafter until determined by three calendar months’ notice in writing given by either party at any time to the other.” There, notice was given on 13 July 1923 to terminate the contract in October 1923.  However, the employee contended that the notice to terminate could only be given after the expiry of the original 12 month period.  The Court of Appeal, affirming the decision of the court below, held that the clause there meant that the engagement was to last at least 12 months, but the parties were entitled to determine it by three months’ notice ending at the expiry of the 12 month period. 58In Yeo Kee How, Winslow J did not disagree with the construction taken in Costigan. Indeed, it would seem to us that if in Yeo Kee How the clause had had no part II, the judge would have adopted the construction in Costigan, for he said:- “All the three cases cited so far refer to similar clauses relating to what has been described as the termination clause, i.e., clause I.  In not one of these cases, to which I have already referred, was there a clause such as clause II …” Given the context of the entire clause in Yeo Kee How, Winslow J held the contract did not provide for a fixed term of 3 years. 59In our judgment, the clause in the present case means that the contract would run for a period of three years and would automatically continue from year to year unless terminated by the giving of six months’ notice in writing.  If the construction contended for by the appellants is correct, there would have been no need to mention a period of three years.  It would have been enough to provide that the contract would continue indefinitely until terminated by six months’ written notice.  Nothing more had to be said.  Moreover, the construction we favour is reinforced by the phrase “which notice is to expire at or on any day after the end of the said period”  Clearly, the reference to the “said period” in the context must be to the initial three year period.  What this means is that Ei-Nets could not terminate Yeo’s services earlier than the expiry of the 3-year period. 60   As regards the argument of the appellants that Yeo was under a duty to mitigate, the first answer is that the appellants had not pleaded that Yeo had failed to mitigate his loss.  Second, the burden was on the appellants to show that Yeo could or ought reasonably to have obtained alternative employment, and they had not discharged the burden.  As regards the argument that taxes which Yeo would have had to pay on his income would also have to be deducted to determine the damages due to Yeo, the fact of the matter is that no evidence was placed before the court as to what the proper deduction on that account should be.",
        "Defamation": "61   We now turn to the court’s findings in the defamation suit.  Here, the appellants submitted that the judge erred in two respects.  First, he erred in holding that the publication of the three reports to the four individuals was not covered by qualified privilege.  Second, even if the judge did not err on the first point, he erred on the quantum of damages awarded, it being too high and out of line with precedents, bearing in mind that the dissemination of the defamatory material was of an extremely limited nature, i.e., to only four individuals. 62   The appellants argued that the disclosure to Chong was for the purposes of receiving Chong’s professional advice.  However, Chong’s services were obtained in relation to the listing.  No evidence was adduced to show how his expertise was germane to the accounting question raised by Ei-Nets following the Medora Report.  In fact, Chong stated in his affidavit that the appellants did not engage his professional services in respect of any of the reports.  As regards the other three individuals to whom publication was also made, one was Jarrod Wong, an Ei-Nets accountant. The other two were secretarial staff of Ei-Nets, Deborah Lai and Pamela Tay.  Again, no evidence was adduced to explain why the three reports had to be disclosed to them.  The fact of the matter is that it was not shown that LBC was under a duty to disclose the reports to the four persons; neither was it established that they had a duty to receive them.  Sloppiness or carelessness would appear to be the cause of the publication of the three  reports to the four persons. 63   As regards the question of quantum of damages, the appellants argued that $80,000 is excessive.  They relied on the following cases in support.  First, Lee Kuan Yew v Jeyaretnam JB[1978-1979] SLR 429, which was an action concerning defamatory statements made against the then Prime Minister of Singapore, and where S$130,000.00 was awarded for what the court termed a “very serious slander”. 64   Next, the case of Chiam See Tong v Xin Jiang Restaurant Pte Ltd[1995] 3 SLR 196which involved the preservation of the reputation of an opposition Member of Parliament (MP), who was also an advocate and solicitor.  The defamation there consisted of publishing the photograph of the MP in business promotional materials without his consent.  Damages of $50,000 were awarded. 65   Third, the case of Tang Liang Hong v Lee Kuan Yew and another[1998] 1 SLR 97, where there was limited circulation of a defamatory report to the police alleging that three leaders of the Government had, without factual basis, been making statements that one Mr Tang Liang Hong was a Chinese chauvinist and anti-English educated.  The Court of Appeal awarded to Mr Lee Hsien Loong, Dr Tony Tan, and Mr Lee Yock Suan S$130,000 (taking into account the fact that he had already been awarded S$220,000 in a related suit), S$150,000, S$130,000 in damages respectively. 66   Last, the case of Goh Chok Tong v Jeyaretnam Joshua Benjamin and another action[1998] 3 SLR 337, where the allegation against the Prime Minister of Singapore was that he was guilty of a criminal offence, i.e., criminal defamation.  The allegation was made during the heat of an election rally.  The Prime Minister was awarded damages of S$100,000. 67   Of course none of the above cases quite fits the facts and circumstances of the present case.  Arguably the closest is Chiam See Tong but not quite.  In Chiam See Tong, the wrongdoing was the use of the plaintiff’s photograph for a commercial purpose.  There was no allegation of dishonesty or fraud as such.  Here, what was alleged against Yeo was that he had conspired with others to misappropriate funds of Speed, clearly an allegation of dishonesty and fraud.  On the other hand, in Chiam See Tong, the plaintiff was a more well-known public figure and the publication was very much wider, unlike the present case which only involved four persons. 68   Contrast Chiam See Tong with Tang Liang Hong v Lee Kuan Yew & Anor, where the sting was that certain political leaders were guilty of criminal conspiracy and where the publication, like the present case, was only to a few police officers.  The award given by this court was $150,000  to a Deputy Prime Minister and $130,000 to a Minister.  In giving these awards, the court took into account the standing of each victim. 69   Yeo’s standing is nowhere near that of a Minister.  Neither is he a leading public figure.  Nevertheless, he is a man of business and has held positions of responsibility in public and private organisations.  Bearing in mind the quantum given in the cases discussed above, it may appear that the award of $80,000 to Yeo is high.  However, we do not think it is so high as to warrant the intervention of this court.  Here, we think the principles laid down in Dingle v Associated Newspapers Ltd[1964] AC 371are germane:- “… An appeal court rejects his figure only in ‘very special’ or ‘very exceptional’ cases.  Such cases are embraced by the formula that the judge must be shown to have arrived at his figure either by applying a wrong principle of law or through a misapprehension of the facts or for some other reason to have made a wholly erroneous estimate of the damage suffered …” 70   The trial judge appreciated that in an exercise such as this, all relevant factors must be considered.   He took into account “the sting of the defamatory words; the context in which the words were uttered; the occupation and professional standing of the person defamed, the degree of harm caused by the defamatory words and the degree of aggravation/mitigation present… ”  This Court had in Goh Chok Tong v Jeyaretnam Joshua Benjamin[1998] 3 SLR 337enunciated the principle that the court should give sufficient regard to precedents as they provide a broad guideline.  However, we do not think that the Judge had erred as a matter of principle; nor can we say, on the above precedents, that his award was a wholly erroneous estimate of the damage suffered.",
        "Judgment": "71    In the result, we would dismiss the appeal with costs.  The security for costs, together with any accrued interest, shall be released to the respondent’s solicitors to account of the respondent’s costs."
    }
}