{
    "case_title": "Hitachi Plant Engineering & Construction Co Ltd and Another v Eltraco International Pte Ltd and Another Appeal",
    "ncitation": "[2003] SGCA 38",
    "coram": "Chao Hick Tin JA; \n      Judith Prakash J; \n      Yong Pung How CJ",
    "sections": {
        "The facts": "2          The facts are not in dispute. In 1996, Pine View Holdings Pte Ltd (‘Pine View’) entered into a building contract (‘the Main Contract’) with Eltraco for the development of a project known as Pine Springs at 7B Balmoral Road (‘the Project’). The Main Contract was based on the Articles and Conditions of Building Contract (1990) 4thEdition. Amendments were made by the parties to that standard form contract but those amendments are not material for the purpose of these appeals. 3          Eltraco was the main contractor for the Project. Andrew Tan Architects Pte Ltd (‘the Architects’) was the architect for the Project. Eltraco subsequently entered into separate sub-contracts with various Nominated Sub-Contractors (‘NSCs’). The appellants in both appeals, namely Hitachi Plant Engineering & Construction Co Ltd (‘Hitachi’), Wing Tai Enterprises Pte Ltd (‘Wing Tai’), Yi Wee Pools & Fountains Pte Ltd (‘Yi Wee’) and Nature Landscapes Pte Ltd (‘Nature Landscapes’) were NSCs of the Project. The parties adopted the Singapore Institute of Architects (SIA) Conditions For Sub-Contract For Use In Conjunction With The Main Contract (1980) Edition.",
        "Pertinent Clauses of the Contracts": "4          Clause 2 of the Sub-Contract states, in essence, that the Sub-Contract shall be construed consistently with the requirements of the Main Contract. Under the Main Contract, there are two situations in which Pine View is entitled to make direct payment to the NSCs. First, under cl 30(4) of the Main Contract, Pine View has a general discretion to make direct payment to NSCs in the event that a Certificate of Non-Payment is issued by the Architects. Clause 30(4) of the Main Contract states: Upon issue of a Certificate of Non-Payment the Employer may, but shall not be bound to, pay some or all of any sums so certified directly to the Sub-Contractor or Supplier named in the Certificate, and having done so may at any time thereafter before Final Certificate deduct some or all of any sum so paid from any sum so paid from any sums due or subsequently becoming due to the Contractor under this Contract, or otherwise recover the same from the Contractor. Any Certificate of Non-Payment and decision of the Architect which it represents shall be binding between the Employer and the Contractor until final judgment or award in any dispute between them relating thereto. The Architect shall record any such payment direct or any subsequent deduction or recovery by the Employer in any later payment certificates issued by him. 5          Secondly, under cl 31(10) of the Main Contract, Pine View may make direct payment to the NSCs where the Final Certificate and a Certificate of Direct Payment is issued by the Architects. The relevant parts of cl 31(10)(b) state: In addition the Architect […]may, but shall not be obliged to, certify direct paymentby the Employer to any Nominated Sub-Contractor or Supplier […] of any outstanding balance due to such Sub-Contractor or Supplier and unpaid at that time. […] any amounts so paid may be taken into account by the Architect in the Final Certificate or, if not,may be deducted by the Employer from any sums then certified as payable by him, or may be otherwise recovered by the Employer from the Contractor.[emphasis added]",
        "The Scheme of Arrangement (‘the Scheme’)": "6          Eltraco was subsequently placed under judicial management via an Order of Court dated 21 January 2000. A meeting of creditors was convened by the Judicial Managers to propose a Scheme of Arrangement (‘the Scheme’) between Eltraco and its creditors. 7          The contentious term of the Scheme is in paragraph 1.2.1 which states: The realisation from the Company’s assets (mainly accounts receivable from completed projects) after meeting the costs of realisation and administration shall be paid entirely to the creditors in the manner set out in the following paragraphs. [emphasis added] 8          Paragraph 2 then sets out the creditors’ entitlement under the Scheme. For the unsecured creditors, paragraph 2.2 states: Unsecured creditors whose claims have been admitted by the JMs/Administrator shall be paid on a pro-rata basis within two weeks of receipt of payment provided the claims of the preferential creditors have been met in full. There shall be no payment and the funds shall be held by the JMs/Administrator to consolidate with future receipts if the sum is not sufficient to make a payment of at least 5%. 9          The Scheme was accompanied by an Explanatory Statement, as required by s 211 of the Companies Act. The material clauses of this Explanatory Statement are as follows: 4.1        The bulk of the Company’s assets are represented by outstanding debts due from CGH Holdings Pte Ltd (“CGH”) and Pine View Holdings Pte Ltd (“Pine View”). The ultimate amount receivable is still uncertain due to the disputes between the Company and the debtors. […] 4.3        With regard to the Pine View project, the defect liability period has expired on 1 June 2000. Pine View has refused to make any payment to the Company on the grounds of outstanding defects work and delay on the project. The Company has recently submitted additional claim against Pine View on the extension time (approximately 500 days) in addition to the outstanding progress claim of $1,992,049 (excluding retention of $251,58). 10        The Judicial Managers applied to the Court for a creditors’ meeting to approve the Scheme. Choo Han Teck J made an order on 12 July 2000 to convene that meeting. Under this Order, the Court dispensed with the need for separate meetings to be called for the different classes of creditors. 11        A majority of the creditors attending and voting, representing 86.5% in value, voted in favour of the Scheme. It is undisputed that the majority of the unsecured creditors who voted at the meeting were creditors who were not NSCs. With the requisite majority, the Judicial Managers applied for and obtained sanction from Lai Siu Chiu J for the Scheme on 4 October 2000.  On the same day, an Order of Court was obtained to discharge the Judicial Management Order against Eltraco. Events leading up the Originating Summons 12        On 15 January 2002, Eltraco received a letter from the Architects stating that they had received requests from the NSCs for direct payment from Pine View. Ten days later, the Judicial Managers, who had become the Scheme Administrators by then (because the Judicial Management Order had been discharged), replied stating that the monies requested by the NSCs for direct payment should be paid to Eltraco. This letter also stated that any direct payment to the NSCs would constitute a preference payment. Four days later, the Architects replied stating their view that the Scheme did not affect the contractual rights between Pine View and the NSCs since Pine View was not privy to the Scheme. They also pointed out that no satisfactory reason had been given as to why direct payment would constitute a preference. 13        On 22 June 2002, the Architects issued a Certificate of Direct Payment to the NSCs. The sums allowed under this Certificate for the respective appellants ranged from $21,463.85 for Yi Wee to $265,407.93 for Hitachi. 14        The Scheme Administrators subsequently took out an Originating Summons against the appellants (and four other defendants, including Pine View). They sought to restrain Pine View from effecting direct payments to the NSCs and an order for the NSCs to authorise Pine View to effect such payments due to them to Eltraco.",
        "Direct Payment to Uni-Strong": "15        One other fact bears mention. This pertains to one of the NSCs which was not the subject of Eltraco’s action, Uni-Strong Pte Ltd (‘Uni-Strong’). Uni-Strong refused to furnish the warranties for the waterproofing works for which they were engaged unless and until their outstanding sums were paid in full. In the meantime, the Architects directed Eltraco to submit the waterproofing warranties failing which the retention monies would be withheld and the Final Certificate would not be issued. Despite the Scheme Administrators’ attempts to persuade Uni-Strong to issue the water-proofing warranties without payment of the outstanding sum, Uni-Strong refused to budge. 16        Finally, at a meeting between the Architects, the Scheme Administrators and Pine View on 3 August 2001 (i.e. after the Scheme had been approved), it was agreed that Eltraco would allow Pine View to treat the non-furnishing of the warranty as a default on their part and thus allow Pine View to effect direct payment to Uni-Strong for the sum of $43,000. The Scheme Administrators took the view that this did not constitute undue preference. This was confirmed in a letter dated 13 August 2002. It is imperative to note that this confirmation came after Eltraco initiated the action against the other seven NSCs and Pine View. Eltraco does not dispute that this happened.  The decision below 17        The Judge below granted the injunctive reliefs prayed for by Eltraco. In coming to his conclusion, he rejected the NSCs’ argument that the scheme, as approved, did not expressly exclude their rights to receive direct payment from Pine View. The Judge held, at paragraphs 28 and 29 of his Grounds of Decision: 28.        In my view, the […] argument appeared to ignore and sideline a significant feature of the scheme where it was stated in simple and uncomplicated language that the sums receivable by the plaintiffs from the project owners would be distributed as spelt out in the scheme. 29.        In my determination, it was a compelling inference that all the unsecured creditors (which group includes the first to seventh defendants) who attended the meeting could not have missed the significance of para 1.2.1 as well as para 2 of the scheme. There was indeed a pointed and unmistakable reference to accounts receivable in para 1.2.1 of the scheme and a further clear enunciation as to how the realised amount would be distributed to the various classes of creditors in para 2 thereof. 18        The Judge also considered the argument raised by Eltraco’s counsel that once the Scheme had been sanctioned by the court, any direct payment to the defendants would be contrary to public policy. After a survey of the relevant cases, the Judge held at paragraph 36 of his Grounds of Decision: In my view, there was no reason why the public policy approach adopted by Thean J [inJoo Yee Construction Pte Ltd (in liquidation v Diethelm Industries Pte Ltd & Ors[1990] SLR 278] should not, perforce, be applied to the case at hand although the present situation, no doubt, fell into a scheme outside the winding-up regimen. In my view, the wording as well as the spirit of s 210 and s 227X of the Act left no room for ambiguity. […] Furthermore, to scuttle the scheme sanctioned by the court to benefit only a handful of unsecured creditors as against the rest who had not come forward to resist it, would most certainly be against public policy.  19        On the issue of the payment to Uni-strong, the Judge was persuaded that the Scheme Administrators had little choice but to yield to the demands of Uni-Strong and he found that the allegation that the Scheme Administrators’ acts were not bona fide was not made out.",
        "Issues arising in these appeals": "20        It seems to us that there are really three issues for determination in these appeals. The first is whether the Scheme prevents the appellants-NSCs from receiving direct payment from Pine View. The second is the relevance and effect, if any, of the Scheme Administrators’ consent to Uni-Strong receiving direct payment from Pine View. The third is whether the pari passu principle has any scope for operation in schemes of arrangement. To our mind, the resolution of these appeals lies in the answer to the first issue. Nevertheless, we feel that the third issue has wide-ranging ramifications on the law and status of schemes of arrangement. We therefore propose to state our views on the law on this issue.",
        "Whether the Scheme prevents the appellants from receiving direct payments from Pine View": "",
        "The appellants’ case": "21        The appellants’ counsel argued that the Judge erred in his finding that the Scheme prevents the appellants from receiving and retaining direct payments from Pine View. They submitted that there is no express term in the Scheme which would prohibit the appellants from receiving or retaining such payments. As a general principle, creditors’ rights may only be affected by express terms in a scheme of arrangement. They contended that the appellants’ rights to such payments were not affected by the Scheme because their rights to such payments were not expressly stated in the Scheme. 22        Even if it may be permitted to imply terms into a scheme of arrangement, counsel argued that there was no basis for the Judge to infer that the Scheme prevents the appellants from receiving and retaining any direct payment from Pine View. The Scheme (under paragraph 2.2) does not promise that any funds will be received or any distribution made. They used this as the basis for arguing that the Scheme is consistent with the appellants being able to receive and retain direct payments, resulting in little or no funds being received by the Scheme Administrators for the other unsecured creditors. They also relied on two other facts. First, they pointed out that the Explanatory Statement did not allude to the fact that the rights of the NSCs to receive and retain direct payments were affected in any way by the Scheme. Secondly, they noted that at the meeting to approve the Scheme, the Scheme Administrators did not highlight or mention that the Scheme would restrict the rights of the NSCs to receive and retain direct payments. 23        Counsel further submitted that Eltraco had the onus of making sure that the Scheme properly set out the manner in which the creditors’ rights may be affected under the Scheme. Since this was not explicitly provided for, the Scheme must be strictly construed and any ambiguity should be resolved in favour of the appellants. It would be unfair to the appellants if their rights to direct payment are curtailed because they had participated and voted on the Scheme on the basis that their rights to those payments would not be affected by the Scheme.",
        "The respondents’ case": "24        The respondents’ case was that direct payments fall within the express terms of ‘accounts receivable’ under paragraph 1.2.1 of the Scheme. Consequently, the receipt and retention of any direct payments by the NSCs will be in contravention of the Scheme. 25        Further, they argued that the NSCs have no rights to receive direct payments under the Main Contract since under cl 31(10)(b) of the Main Contract, the NSCs’ entitlement to direct payments rested on the Architects’ discretion to certify direct payments to them. Since they had no legally enforceable rights to the direct payments, the question of expressly providing for those ‘rights’ was a non-starter. 26        Counsel for the respondents also submitted that the appellants’ actions belied their allegations that their basis for participating in the Scheme was that their rights to direct payments would not be affected under the Scheme. They noted that some of the appellants had submitted proofs of debts for adjudication by the Scheme Administrator. If they truly believed that their rights to direct payments were not affected, they would have avoided the unnecessary time and expense incurred in submitting themselves to the Scheme.",
        "Our decision on this issue": "Whether the appellants had a right to the direct payments at the time the scheme was proposed and sanctioned by the Court 27        InDaewoo Singapore Pte Ltd v CEL Tractors Pte Ltd[2001] 4 SLR 35, this Court held that a scheme of arrangement can incorporate a term to the effect that upon the company performing its obligations as regards payment vis-à-vis the creditors, the creditors will release the obligations of guarantors who are not a party to the scheme. In coming to that conclusion, this Court held at paragraph 21: it is settled law that a scheme of arrangement or compromise made between a company and its creditors in relation to its debts and liabilities, approved by the requisite majority of the creditors and by the court, affects only the rights of the creditors against the company, and does not affect the rights of the creditors against a third party, such as a guarantor, for the same debts and liabilities of the company. Consequently, where such scheme discharges either in whole or in part the debts owed by the company to its creditors, it does not operate as a discharge of the liability of the guarantor for the same debts or liabilities of the company. However, in all these cases, the schemes in question did not contain any express term requiring the creditors to extinguish or discharge the liability of a third party, such as a guarantor, for the debts or liabilities of the company concerned. In the instant case, the scheme contains an express provision to the effect that upon the company, CEL Tractors, observing and performing their obligations under the scheme, the creditors will release the guarantors from their obligations under the respective guarantees. In this respect, the instant case is distinguishable from these cases, which therefore do not really assist in the resolution of the issue before us. 28        Counsel for the appellants sought to rely on that decision for the proposition that if a particular right of the creditors is to be taken away from or affected by the Scheme, it has to be expressly stated in the Scheme. 29        At paragraph 31 of his Grounds of Decision, the Judge made the following findings on this issue: It must be remarked at this stage that the relationship between the project owners and the defendants/nominated sub-contractors did not appear to be one of guarantors and beneficiaries;nor was there any independent legal obligation on the part of the project owners to pay the nominated sub-contractors.In any event, as mentioned inDaewoo, in the case at hand too the phraseology employed in paras 1.2.1 and 2 of the scheme clearly supported the plaintiffs’ contention that when the poll took place at the court-directed meeting, the focus of parties was in relation to the distribution of monies receivable by the plaintiffs from the project owners. [emphasis added] 30        We agree with the appellants’ counsel that as a general principle, if a right of the creditors is to be taken away or affected by a scheme of arrangement, it has to be expressly stated in the scheme. Without full disclosure of the mechanics of the scheme of arrangement, it will be difficult for the creditors to decide whether to vote on or participate in the scheme. The requirement of full disclosure is also in line with the decision of Selvam J inRe Halley’s Departmental Store Pte Ltd[1996] 2 SLR 70. 31        However, the application of that general principle really depends on the facts and circumstances of each case. A court has to first decide whether the creditors have a right that requires protection through an express term in the scheme of arrangement. Assuming that is answered in the affirmative, the court has to then decide whether the terms of the scheme are sufficiently expressed to affect that right. 32        On the facts of the present appeals, counsel for the appellants, while rightly conceding that their clients did not have any legally enforceable right against Pine View to insist that Pine View should make direct payment under cl 31(10)(b) of the Main Contract, submitted that that is irrelevant. What is critical, in their view, is that the appellants have a legally enforceable right against Eltraco to receive and retain the direct payment from Pine View if Pine View chooses to make the direct payment. We find this argument to be an exercise in the splitting of hairs. In our view, the material time to consider whether the appellants had a right that required protection under the Scheme was the time the Scheme was proposed and sanctioned. To attempt to assess the creditors’ rights in light of events that may occur subsequent to the sanction of a scheme, particularly if they depend on the exercise of discretion by a particular party, would be so speculative as to be impossible. 33        InB Mullan & Sons (Contractor) Ltd v Ross & Anor(1996) 54 Con LR 161, the Northern Ireland Court of Appeal rejected the sub-contractor’s argument that the liquidator takes the contractor’s property subject to liabilities, namely, the sub-contractor’s right to direct payment from the employer. The Court distinguished the Irish case ofGlow Heating Ltd v Eastern Health Board (1992)8 Const L J 56 on the basis that in theGlowcase, there was a mandatory provision in the contract that the employer ‘shall himself pay’ the direct payments to the sub-contractors as certified by the architect. Since it was a mandatory provision, Costello J held in theGlowcase that the liquidator took the property of the main contractor subject to the direct payments and therefore the direct payments did not become the ‘property’ of the contractor for division amongst the creditors. 34        Here, if the Main Contract had stated that it is mandatory for the Architects to certify direct payment upon a particular event, we may have been more inclined to adopt the position in theGlowcase and hold that the NSCs had a right to the direct payments. However, on the facts, and similar to the case ofB Mullan & Sons, the NSCs’ entitlement was merely contingent upon the exercise of discretion by the Architects. 35        The facts ofB Mullan & Sonsand of the present appeals may be distinguished from the case ofGolden Sand Marble Factory Ltd v Easy Success Enterprises Ltd & Anor[1999] HKCFI 359. There, the employer, contractor and sub-contractor came to an agreement prior to the insolvency of the contractor that the employer would make direct payments to the sub-contractor. These direct payments were allowed by the Hong Kong Court of First Instance on the basis that there was a right to them by virtue of the agreement between the parties. Here, Eltraco, Pine View and the NSCs did not enter into an express agreement to elevate the NSCs’ entitlement to the direct payments to a right that had to be protected by the express terms of the Scheme. 36        The appellants’ entitlement to direct payment under cl 31(10)(b) of the Main Contract is contingent upon the Architects’ exercise of  their discretion to certify direct payment to the NSCs. The Architects only exercised that discretion on 22 June 2002. As such, we find that the appellants did not have a right to receive direct payment at the time the Scheme was approved on 4 October 2000, some 18 months prior to the Architects’ exercise of their discretion. Therefore, while we agree with counsel that there is a general principle that the rights of creditors can only be affected by an express term in a scheme of arrangement, that principle does not apply on the facts of the present appeals because the appellants did not have a right to those payments at the time the Scheme was proposed and sanctioned. Whether the terms of the Scheme were nevertheless sufficiently express to include direct payments payable to the NSCs 37        The crux of this issue lies in the interpretation of the term ‘accounts receivable’ in paragraph 1.2.1 of the Scheme. The starting point for the interpretation of such terms can be found in the judgment of Lord Hoffman inInvestors Compensation Scheme v West Bromwich Building Society(1998) 1 All ER 98. In that case, Lord Hoffman laid down the following guidelines in the construction of clauses in a compensation scheme for investors at p 114H of the report: (1) Interpretation is the ascertainment of meaning which the document would convey to a reasonable person having all the background knowledge which would reasonably have been available to the parties in the situation in which they were at the time of the contract. (2) The background was famously referred to by Lord Wilberforce as the ‘matrix of fact’, but this phrase is, if anything, an understated description of what the background may include. Subject to the requirement that it should have been reasonably available to the parties and to the exception to the mentioned next, it includes absolutely anything which would have affected the way in which the language of the document would have been understood by a reasonable man. (3) The law excludes from the admissible background the previous negotiations of the parties and their declarations of subjective intent. […] 38        With these guidelines in mind, we will first deal with the issue of the parties’ intentions at the time the Scheme was approved. On balance, we find that contrary to the parties’ allegations, both the NSCs and the Scheme Administrators of Eltraco did not put their minds to address the issue of whether direct payments would fall under the Scheme when the Scheme was being considered. In any event, as rightly pointed out by Lord Hoffman, the interpretation of the terms should exclude the subjective intent that each party claims to have had at the time the Scheme was entered into. Consequently, we give little weight to the appellants’ contention that they would not have taken part and voted in favour of the Scheme if they knew that their rights to direct payment would be affected under the Scheme. By the same token, we give little weight to the respondents’ response that, if the appellants really thought that their entitlement to the direct payments were not affected by the Scheme, they would not have taken steps to submit their proofs of debt and participate in the Scheme. We find both these allegations to be mere post-facto reasoning and we do not place any emphasis on them. 39        We next turn to the express wording of the Scheme and consider it in light of any other ‘background knowledge’ which would reasonably have been available to the parties at the time the Scheme was approved. We find that this ‘background knowledge’ can be established through an examination of the clauses in the Main Contract – a document available to all the parties at the time the Scheme was approved. 40        This leads us to cl 31(10)(b) of the Main Contract which deals with the mechanics of a direct payment. The last part of cl 31(10)(b) states that direct payments made by the Employer (Pine View) to the NSCs ‘may be taken into account by the Architect in the Final Certificate or, if not,may be deducted by the Employer from any sums then certified as payable by him, or may be otherwise recovered by the Employer from the Contractor.’ 41        The effect of this clause is that any direct payment made by Pine View to the NSCs will be deducted from the sums payable by Pine View to Eltraco. We find that there is therefore a very close nexus between the direct payment and Eltraco’s ‘accounts receivable’. Any direct payment made will have the knock-on effect of reducing the monies receivable by Eltraco. In our view, the effect of cl 31(10)(b) is that, when a direct payment is made, that sum is one that is actually due from Eltraco, and not from Pine View, to the NSCs. Such payments clearly fall within the ‘accounts receivable’ of Eltraco. 42        The effect of such a construction is similar to that arrived at by Thean J  inJoo Yee Construction Pte Ltd v Diethelm Industries Pte Ltd & Ors[1990] SLR 278. There, in respect of a similar direct payment clause, he found that whatever sums of money the government elected to pay to the NSCs in that case were monies which would otherwise have been paid to the plaintiff, Joo Yee and so form part of the general assets of Joo Yee available for distribution among the creditors.  Consequently, we hold that direct payments payable to the NSCs fall within the terms of ‘accounts receivable’ under paragraph 1.2.1 of the Scheme. Such payments cannot be received by the appellants without contravening the Scheme. Therefore, we agree with the Judge that the injunctive reliefs sought by Eltraco ought to be given. The NSCs as a separate class of creditors 43        Before leaving this issue, we would like to comment on an argument raised by the appellants’ counsel. They alleged that if the Scheme had expressly included a clause prohibiting the NSCs from receiving and retaining direct payments, the appellants would have challenged the Scheme on the ground that their interests are wholly dissimilar to the rights of other creditors, thereby entitling them to vote separately in a different class. 44        It is useful to start by comparing the language of the provisions in s 210 (where there is a scheme of arrangement simpliciter) and s 227X(a) (where there is a scheme of arrangement proposed after a Judicial Management Order has been made). The relevant parts of the two provisions state: Power to compromise with creditors and members. 210.—(1) Where a compromise or arrangement is proposed between a company and its creditors or any class of them or between the company and its members or any class of them, the Court may, on the application in a summary way of the company or of any creditor or member of the company, or, in the case of a company being wound up, of the liquidator, order a meeting of the creditors or class of creditors or of the members of the company or class of members to be summoned in such manner as the Court directs. Application of certain provisions in Parts VII and X to a company under judicial management. 227X.At any time when a judicial management order is in force in relation to a company under judicial management — (a) section 210 shall apply as if for subsections (1) and (3) thereof there were substituted the following: (1) Where a compromise or arrangement is proposed between a company and its creditors, the Court may on the application of the judicial manager order a meeting of creditors to be summoned in such manner as the Court directs. (3) If three-fourths in value of the creditors present and voting either in person or by proxy at the meeting agree to any compromise or arrangement, the compromise or arrangement, if approved by the Court, is binding on all the creditors and on the judicial manager. 45        Counsel for the appellants in Civil Appeal No 130 of 2002 rightly conceded that there is no express requirement that the creditors be divided into classes under s 227X(a) because for some reason, the reference to ‘classes of creditors’ (which is found in s 210) had been omitted by the Legislature. They then submitted that it cannot be credibly argued that the role and function of the Court in deciding whether to sanction a scheme should be different according to whether the scheme is presented under s 210 alone (i.e. without a Judicial Management Order being in force) or under s 210 read with s 227X(a). 46        Despite the difference in wording of the two provisions, we find that there is nothing to preclude the Judge who is sanctioning the scheme from considering the NSCs as a different class. The duty of the Court when a scheme of arrangement comes before it for sanction was neatly summarised by this Court in theDaewoocase at paragraph 36 where it was held: Generally speaking, in approving a scheme under s 210 of the Act, the duty of the court is to consider whether the statutory provisions have been complied with, whether the scheme is fair and reasonable to the creditors as a whole, whether the company and the majority creditors are acting bona fide, and whether the minority is being coerced to promote the interest of the majority: seeRe English, Scottish, and Australian Chartered Bank[1893] 3 CH 885, 408;Re Dorman, Long & Co[1934] CH 635. 47        With this duty in mind, there is nothing to prevent the court from considering the NSCs as a different class when sanctioning a scheme if that is necessary to ensure that the scheme is fair and reasonable to the creditors as a whole. InUDL Argos Engineering & Heaving Industries Co Ltd v Li Oi Lin[2001] HKCFA 53, the Hong Kong Court of Final Appeal enunciated the principles in accordance with which creditors should be divided into classes. After examining the relevant case law on this issue, Lord Millet distilled the following principles which can be found at paragraph 27 of his judgment: The following principles can be derived from this consistent line of authority: (1) It is the responsibility of the company putting forward the Scheme to decide whether to summon a single meeting or more than one meeting. If the meeting or meetings are improperly constituted, objection should be taken on the application for sanction and the company bears the risk that the application will be dismissed. (2) Persons whose rights are so dissimilar that they cannot sensibly consult together with a view to their common interest must be given separate meetings. Persons whose rights are sufficiently similar that they can consult together with a view to their common interest should be summoned to a single meeting. (3) The test is based on similarity or dissimilarity of legal rights against the company, not on similarity or dissimilarity of interests not derived from such legal rights. The fact that individuals may hold divergent views based on their private interests not derived from their legal rights against the company is not a ground for calling separate meetings. (4) The question is whether the rights which are to be released or varied under the Scheme or the new rights which the Scheme gives in their place are so different that the Scheme must be treated as a compromise or arrangement with more than one class. (5) The Court has no jurisdiction to sanction a Scheme which does not have the approval of the requisite majority of creditors voting at meetings properly constituted in accordance with these principles. Even if it has jurisdiction to sanction a Scheme, however, the Court is not bound to do so. (6) The Court will decline to sanction a Scheme unless it is satisfied, not only that the meetings were properly constituted and that the proposals were approved by the requisite majorities, but that the result of each meeting fairly reflected the views of the creditors concerned. To this end it may discount or disregard altogether the votes of those who, though entitled to vote at a meeting as a member of the class concerned, have such personal or special interests in supporting the proposals that their views cannot be regarded as fairly representative of the class in question. 48        In future cases, a Court sanctioning a scheme where there are NSCs-creditors who have a contingent entitlement to direct payments, may find the above principles useful when deciding if it should direct that a separate meeting be called for the NSCs. 49        On the present facts, however, we consider that any allegation of unfairness in the Scheme should have been raised when the Scheme was before the court to receive its sanction under s 210(3) read with s 227X. This is in line with the decision in cases such asRe Halley Department Store Pte Ltd[1996] 2 SLR 70andWah Yuen Electrical Engineering Pte Ltd v Singapore Cables Manufacturers Pte Ltd[2003] SGCA 23. Here, the need for meetings of separate classes of creditors was dispensed with by the court and the appellants and other NSCs did not challenge it. Since the appellants did not challenge it at the proper stage, there is little that this Court can do for them now. 50        The appellants also argued that, if they had known that their entitlements to the direct payments were to be affected under the Scheme, they would have objected to the Scheme. We find that argument to be speculative. Once again, we are unable to give such post-facto expressions of subjective intention much weight. One can never be sure if they did not object to the Scheme because they did not know that their entitlements were not affected, or whether they chose not to object even though they realised that their entitlements were affected. It is always easy to apply post-facto reasoning to justify one’s actions to suit the needs and outcomes of a case. Indeed, just as the appellants may make that argument, the respondents may argue that the appellants should have known of their contractual entitlements to the direct payments when the Scheme was proposed and came up for sanction by the court. If they were indeed concerned about their entitlements, they should have raised them when the Scheme was proposed and when it came up for sanction by the courts. 51        To our mind, once the Scheme has been approved, the Court can only interpret the words of the Scheme to determine if, on a true construction, the receipt and retention of direct payments by the NSCs would fall foul of the Scheme. We have analysed this issue above and found that the direct payments in question do fall under the Scheme.",
        "The relevance and effect, if any, of direct payment to Uni-Strong": "52        The next issue for this Court to determine is whether the Scheme Administrators’ decision to consent to Pine View making direct payment to Uni-Strong (but not the other NSCs) has any bearing on the outcome of these appeals. Counsel for the appellants in Civil Appeal No. 130 of 2002 argued that the relevance of this fact is not (as the trial judge had found) whether the Scheme Administrators had consented to the payment bona fide, but whether Eltraco and the Scheme Administrators themselves, having previously taken the position that the Scheme did not prohibit the NSCs from receiving and retaining direct payment, can now take a contrary position which discriminates against the appellants. 53        From our analysis on the first main issue, all the NSCs including Uni-Strong, are not entitled to receive and retain direct payment from Pine View since the sums so received fall within the definition of ‘accounts receivable’. We agree with counsel for the appellants that the heart of this issue is not whether the Scheme Administrators had acted in good faith. The real question is whether there had been consistency in their dealings with Uni-Strong on one hand and their dealings with the other NSCs on the other. We find the inconsistency in conduct to be stark and glaring. The terms of the Scheme are just as applicable to Uni-Strong, an unsecured creditor, as to the other NSCs. Yet, consent was given by the Scheme Administrators to Uni-Strong to receive and retain the direct payments. The fact that Uni-Strong had applied pressure on Eltraco seems to us to be a red herring. The consistency of behaviour by a Scheme Administrator towards the creditors should not depend on whether a particular creditor has been more effective at applying pressure on the company. To condone such behaviour may lead to discrimination against other unsecured creditors who have chosen to take a more docile approach vis-à-vis the company. 54        We are then left to decide the implications and effect of such inconsistency in the Scheme Administrators’ conduct. If the Judicial Management Order had still been in place, the appellants would be entitled, under s 227R of the Companies Act, to take out a separate action against the Scheme Administrators and to pray for relief which will effectively injunct Uni-Strong from receiving and retaining the direct payments which had been effected. Unfortunately for the appellants, the Judicial Management Order against Eltraco was discharged on the same day the Scheme was approved. Consequently, this avenue is no longer available to the appellants. Nevertheless, if the appellants (and, indeed, any of the other unsecured creditors) feel aggrieved by the Scheme Administrators’ consent vis-à-vis Uni-Strong, they may wish to seek recourse against them for breach of terms of the Scheme. However, that has to be dealt with in a separate cause of action and is therefore strictly not pertinent for the purposes of the present appeals.",
        "Whether the pari passu principle has any scope for application in schemes of arrangement": "55        The above would be sufficient to dispose this appeal. However, we would like to take this opportunity to state our views on whether the pari passu principle has any scope for application in schemes of arrangement. 56        InJoo Yee Construction Pte Ltd (in liquidation) v Diethelm Industries Pte Ltd & Ors[1990] SLR 278, the High Court had to decide whether any direct payment to be made by the Government to the nominated sub-contractors in that case contravened the insolvency provisions in the Companies Act. After considering the relevant authorities, the judge held at p 288 of the report: Upon liquidation of an insolvent company (whether voluntary or compulsory), subject to the rights of preferential creditors and also secured creditors, if any, its property must be applied in settlement of its liabilities pari passu, and any contract made by the company which provides for a distribution of any of its property for the benefit of one or more of its unsecured creditors which runs counter to or seeks to vary this rule, ie any ‘contracting out’, is contrary to public policy, and the law as regards distribution of the insolvent’s property under the insolvency legislation must prevail. Accordingly, the liquidator of an insolvent company is entitled to disregard – indeed it is obligatory on him to disregard – such a contract. […] Therefore, if the government elects to make payment of these sums to the three defendants under the first limb of cl 20(e) and in consequence deducts these amounts from moneys due or payable to the plaintiff, it is in effect distributing to the three unsecured creditors of the plaintiff sums of money which would otherwise be paid to the plaintiff and form part of the general assets of the plaintiff available for distribution among all its creditors pari passu. On this analysis, clearly the operation of such a contractual provision in the liquidation of the plaintiff would infringe the insolvency law providing for distribution of the insolvent’s property pari passu among its creditors; the operation of that clause would amount to a ‘contracting out’ of the provisions of such insolvency law. On the authority ofBritish Eagle,such ‘contracting out’ is contrary to public policy and the liquidator is entitled, and indeed is obliged, to disregard it. 57        In coming to his decision, the Judge held that there was no reason why the public policy approach adopted by Thean J should not, perforce, be applied to the present case although the facts of the present case fell into a scheme outside the winding-up regime. 58        Counsel for the appellants submitted that the application of the principles inJoo Yeeto the present appeals is unsustainable and therefore, the decision of the Judge on this point was wrong in law. In support, they relied on a passage in the decision of Lord Cross inBritish Eagle International Airlines Ltd v Compagnie Nationale Air France[1975] 2 All ER 390 where he said, at p 411 of the report: what Air France are saying here is that the parties to the ‘clearing house’ arrangements by agreeing that simple contract debts are to be satisfied in a particular way have succeeded in ‘contracting out’ of the provisions contained in s 302 of the 1948 Act for the payment of unsecured debts ‘pari passu’. In such a context it is to my mind irrelevant that the parties to the ‘clearing house’ arrangements had good business reasons for entering into them and did not direct their minds to the question of how the arrangements might be affected by the insolvency of one or more of the parties. Such a ‘contracting out’ must, to my mind, be contrary to public policy.The question is, in essence, whether what was called in argument the ‘mini liquidation’ flowing from the clearing house arrangements is to yield or to prevail over the general liquidation. I cannot doubt that on principle the rules of the general liquidation should prevail.I would therefore hold that notwithstanding the clearing house arrangements, British Eagle on its liquidation became entitled to recover payment of the sums payable to it by other airlines for services rendered by it during that period and that airlines which had rendered services to it during that period became on the liquidation entitled to prove for the sums payable to them. [emphasis added] 59        Counsel for the appellants also argued that the policy reasons cited in Thean J’s judgment in theJoo Yeecase were similarly restricted to situations where the company has gone insolvent. They also pointed to authorities from other jurisdictions which indicate that the pari passu principle has scope for application only where the company is insolvent. 60        Counsel for the respondents accepted that there are no authorities to support the position adopted by the Judge.  Nevertheless, they submitted that the mere lack of authorities is not an adequate ground for suggesting that the Judge had erred in his findings. They argued that the Judge was correct in basing his decision on the premise that a court sanctioned scheme of arrangement inherits a statutory effect under the Companies Act. Consequently, the Judge was right to hold that the pari passu principle applied equally to a scheme of arrangement.",
        "The case law in other jurisdictions": "61        In considering the merits of these arguments, we first turn to survey the authorities in other jurisdictions. InCarreras Rothmans Ltd v Freeman Mathews Treasure Ltd (in liquidation) & Anor[1985] CH 207, the plaintiff was a manufacturer of cigarettes and had tasked the defendant, a company carrying on the business of an advertising agency, to place advertisements for the plaintiff. The defendant, in turn, negotiated favourable discounts for advertising space and incurred debts as a principal to third parties for the advertisement space bought and for certain technical services. In July 1983, the plaintiff and the defendant agreed to set up a special account into which the plaintiff would pay a sum equivalent to the monies due from the defendant to third parties. The defendant would draw the cheques on that account as was necessary to pay the third parties. The defendant went into a creditors’ voluntary liquidation on 3 August 1983. The plaintiff then discovered that a number of invoices relating to liabilities incurred in May had not been met although the plaintiff had paid an equivalent sum to the defendant for the discharge of those invoices. When the third parties pressed for settlement of those invoices, the plaintiff refused to pay and sought a declaration from the court that the monies deposited into the special account for the settlement of those invoices were held on trust for the sole purpose of paying the third party creditors. One of the issues raised in that case was whether the setting up of the special account violated the pari passu principle. 62        In allowing the claim by the plaintiff, Peter Gibson J held at p 226 of the report in relation to the applicability of theBritish Eaglecase: Thus the principle that I would extract from that case is thatwhere the effect of a contract is that an asset which is actually owned by a company at the commencement of its liquidationwould be dealt with in a way other than in accordance with section 302 of the Companies Act 1948, then to that extent the contract as a matter of public policy is avoided, whether or not the contract was entered into for consideration and for bona fide commercial reasons and whether or not the contractual provision affecting that asset is expressed to take effect only on insolvency. [emphasis added] 63        On the facts of that case, the judge held that the July agreement could not be avoided under the insolvency provisions on public policy grounds because the monies in the special account were not the assets of the defendant at the date of the liquidation. The judge had earlier held that the defendant was holding the monies in the special account on trust for the plaintiff. The principle that we glean from this case is that there is no scope for the application of public policy considerations prior to the commencement of winding-up of the debtor company. 64        Next, we move on to consider the New Zealand Court of Appeal decision inAttorney-General v McMillan & Lockwood Ltd[1991] 1 NZLR 53. There, McMillan & Lockwood Ltd (‘McMillan’) had contracts with the Ministry of Works and Development for the construction of certain buildings. The contracts between McMillan and the Government included a clause which sought to achieve the effect of allowing subcontractors and suppliers to prevail over other unsecured creditors upon liquidation of McMillan. The Court was asked to decide whether those direct payment clauses were void for infringement of public policy. The Court there held: The principle of equal sharing among creditors is fundamental to the scheme of the winding up and insolvency legislation and it is not open to a company to contract for unequal division of its property on liquidation. If then, as we have concluded, the company had an interest in property in respect of the balances under the Gisborne and Tokoroa contracts when the company went into liquidation, the continued application of cls 19.10 and 19.11 was thereafter barred by the pari passu rule. […] Finally, it is not in our view a matter of balancing various public policy considerations. The pari passu rule applies absolutely on liquidation.Unless and until that point is reached provisions such as cls 19.10 and 19.11 and the provisions in the cases just mentioned operate as terms of a commercial contract.[emphasis added] 65        The New Zealand Court of Appeal took the position that the pari passu rule applies absolutely only when the point of liquidation is reached. Until then, direct payment clauses operate as terms of a commercial contract. 66        InB Mullan & Sons (Contractor) Ltd v Ross & Anor(1996) 54 Con LR 161, the Northern Ireland Court of Appeal had to grapple with the issue of whether the sub-contractor could receive direct payment from the employer subsequent to the liquidation of the contractor. The direct payment clause in that case was similar to the clause we have in the present appeals in that payment was not mandatory, but rather, was contingent on the employer’s (or in the present appeals, the Architects’) exercise of its discretion to pay the sub-contractor direct. 67        There, the plaintiff sub-contractor applied to the employer for direct payment of the balance sum due in the autumn of 1993. The contractor went into receivership on 7 October 1993 and into voluntary liquidation on 26 January 1994. The plaintiff asked the court for directions as to whether the employer could make the direct payments to them. Kerr J held that the employers were not entitled to make payment direct to the sub-contractor and that the monies must be paid over to the liquidators to form part of the company’s assets for distribution amongst its creditors. The reason for this was that the payments due for work carried out by the sub-contractor constituted ‘property’ of the contractor at the time of the winding up and were therefore subject to the pari passu rule. 68        The Northern Ireland Court of Appeal dismissed the appeal against the decision. It held: In our opinion, the matter is determined by the effect upon theoperation of the pari passu principle of such exercise of the employers’ right after the commencement of the liquidation. Until the winding-up resolution was passed, the contractor’s interest may have been defeasible by the exercise of the employers’ right to make direct payment.Once the company went into liquidation, however, the exercise of that right would remove the sum so paid from the property which should come to the hands of the liquidator, so reducing the amount divisible among the general creditors, and such a result would offend against the pari passu principle. It therefore is in our opinion void and the employers have not been entitled to exercise the right of direct payment to the sub-contractor since McLaughlin & Harvey plc went into liquidation. [emphasis added] 69        InGolden Sand Marble Factory Ltd v Easy Success Enterprises Ltd & Anor[1999] HKCFI 359, the Court of First Instance in Hong Kong similarly had to decide the fate of a direct payment clause in light of the contractor’s liquidation. The distinguishing facts of this case were that prior to the contractor’s liquidation, the employer, contractor and nominated sub-contractors entered into an agreement for the employer to pay the nominated sub-contractors directly. The Court, bearing in mind these special facts, declared that the nominated sub-contractor was entitled to the direct payment. In coming to that conclusion, Findlay J held: In the case where an employer acts unilaterally under clause 27(c) and pays a nominated sub-contractor directly and deducts this payment from money due to the main contractor, it must be that,if the main contractor is liquidated after that payment is made, no right of property in that money was vested in the main contractor on the date of winding up. Where, however, the liquidation happens before the employer has made the payment, it must be, on principle, that the right to receive the payment was still vested in the company in liquidation at the time of winding up. But that is academic to this case. Here, there was no unilateral decision by the first defendant under clause 27(c). In the case before me the employer, the main contractor and the nominated subcontractor agreed that payments would be made directly to the nominated subcontractor a long time before the liquidation. So, whatever the position may be where there is a unilateral act under Clause 27(c), where there is an agreement such as here the sub-contractor acquires an enforceable right to have the payments made directly to him, and the main contractor loses any right under the main contract it might have had otherwise to insist that payment by made through it. Here, there is no question of the employer exercising a discretion to pay the nominated subcontractor directly. It is a matter of rights under the agreement of March 1995. [emphasis added] 70        InCharter Reinsurance Co Ltd v Fagan[1997] AC 313, there was even clearer judicial pronouncement on the application of the principles enunciated in theBritish Eagleto cases which do not involve insolvency. Mance J, whose judgment was upheld by the English Court of Appeal and the House of Lords, made the following observations, albeit as dicta, at p 351 of the report: Alternatively, Mr Kentridge [counsel for Charter] submitted that the principle in theBritish Eaglecase was directly applicable in view of the appointment of provisional liquidators in respect of Charter by order of Blackburn J dated 23 June 1994. The effect of the syndicates’ [reinsurers, i.e. the respondents Fagan] construction of the contracts was in his submission to require Charter to meet its liabilities in a manner other than pari passu if it was to get in its assets, contrary to the compulsory scheme applicable in liquidation and contrary, he submitted, to a strong public interest […]. Mr Hildyard’s [counsel for Fagan] response is twofold: that Charter is not in winding up and the principle can have no application, and that, even if Charter were in winding up, the principle would not apply; any asset was and is, in his submission, “flawed” in that its realisation is subject to a precondition which cannot be fulfilled in insolvency; he says that its diminished economic worth in circumstances where the reinsured cannot pay its claims in full is irrelevant. The order gives the provisional liquidators powers, inter alia, to get in all the company’s property and assets and to administer and settle such claims either by or against Charter as advised in the interests of the creditors, as well as to prepare and consider a scheme of arrangement. I understand Mr Kentridge to accept that the power to administer and settle claims would not embrace the pari passu distribution of assets in relation to claims, which would be a matter for the liquidators after a winding up order.This insolvency may well follow the pattern of other recent insurance company insolvencies and lead not to winding up but to a scheme of arrangement. I see the force of Mr Hildyard’s submission that theBritish Eaglecase can have no relevance unless and until there is a winding up order.However, in the view which I take on construction, it is unnecessary for me to go further into this or any issue concerning the scope and application of theBritish Eaglecase and I shall not do so. [emphasis added] 71        We agree with counsel for the appellants that there is considerable authority in other jurisdictions to indicate that the pari passu principle only applies in insolvency. However, most, if not all, of the passages from the cases cited above do not take that extra step to state the converse, viz. that the pari passu principle does not apply in schemes of arrangement. Nevertheless, we are of the view that these cases do indicate a strong leaning in other jurisdictions in favour of limiting the pari passu principle to situations of corporate insolvency only. 72        Against the authorities cited above, the respondents relied on a number of decisions to persuade us that the Judge was right in extending the pari passu principle to a scheme of arrangement. First, they referred us toHill v Anderson Meat Industries Ltd[1971] 1 NSWLR 868, a case which they also relied on in the Court below. In that case, one Mrs Hill lent Anderson Meat Packing Co Pty Ltd (‘Anderson Meat Packing’) a sum of money. The terms of the agreement included a provision that the loan shall be conditional upon the loan being guaranteed by Anderson Meat Industries Ltd, the holding company of Anderson Meat Packing. Anderson Meat Packing subsequently entered into a court sanctioned scheme of arrangement. One of the clauses under this scheme stated that all debts and claims of unsecured creditors would be extinguished and discharged. The question which arose for determination was whether Mrs Hill could enforce the guarantee against Anderson Meat Industries in light of the scheme of arrangement. The Supreme Court of New South Wales held that she could. In coming to that decision, Street J observed at p 875 of the report: Essentially the point for present determination turns upon whether there is a valid distinction between a composition within the bankruptcy legislation or a scheme within a current winding up on the one hand, and a scheme outside a winding up on the other.In my judgment the point of distinction, although it exists, is too fine to be recognised.Where, as here, a scheme of arrangement is propounded in connection with the affairs of an insolvent company, then the court’s approval under s 181 will give to the scheme a statutory operation upon the relationship between the debtor company and its creditors, and so far as concerns a guarantor, in the absence of any special provision in the guarantee agreement, the guarantor’s liability subsists in exactly the same manner as if the scheme had been formally approved within a current winding up. [emphasis added] 73        Next, counsel referred us toRe London Chartered Bank of Australia(1893) 3 Ch 540 where Vaughn Williams J made the following remarks about a scheme of arrangement: The scheme of arrangement under the Act of 1870 is […] an alternative mode of liquidationwhich the law allows the statutory majority of creditors to substitute for the pending winding-up whether voluntary or under the Court […] The discharge of the company or contributories under theJoint Stock Companies Arrangement Act, 1870, is by operation of law effected by the stay of actions imposed, after winding-up order […] and during voluntary liquidation […]. The effect of this stay, coupled with the stay of the winding-up proceedings excepting so far as necessary for carrying out the scheme of arrangement, is to discharge the company and contributories from further liability. It seems to me, then, that, the discharge being clearly by operation of law consequent upon pending statutory liquidation […] [emphasis added] 74        Counsel also referred us to the decision inMortgage Insurance Corporation v Pound(1895) 65 LJ QB 394 for the proposition that a scheme, although made and sanctioned in a voluntary liquidation and at the instance of the plaintiffs, is to be regarded as being effected by operation of law in the same manner as a bankruptcy or composition. 75        We consider the respondents’ reliance on the case law cited to us to be misplaced. First, most of the judicial remarks made in the cases cited by counsel for the respondents were made in the context of a liquidation of the company. Therefore, quite naturally, the judges would seek to apply the pari passu principle applicable in liquidation to the scheme in question. That does not advance the respondents’ argument that this principle should perforce apply to schemes of arrangement since there are situations not involving liquidation or insolvency  where schemes of arrangement are used. 76        As for the decision inHill v Anderson Meat Industries Ltd, we note that Street J admitted that a point of distinction exists between a scheme within a winding up and a scheme outside a winding up. What counsel for the respondents seek to rely on is his remark that the distinction is too fine to be recognised. For the reasons we will refer to below, we do not agree with Street J’s view that the distinction is too fine to be recognised. There are strong grounds to distinguish between the application of the pari passu principle to schemes of arrangement within an insolvency regime and to those outside the insolvency regime. 77        Counsel for the respondents sought to bolster their arguments by submitting that the close scrutiny a court exercises over schemes of arrangement before it clothes a scheme with its statutory veil of approval emphasises the statutory transformation which a scheme undergoes under insolvency law. We find that that argument conflates the purpose of requiring court sanction for schemes of arrangement with the pari passu principle. The purpose for which a scheme of arrangement requires court sanction is to ensure that the scheme is, to borrow the phrase from this Court’s decision in theDaewoocase, ‘fair and reasonable to the creditors as a whole’. In our view, there is a fine but important distinction between that and the wholesale application of the pari passu principle. Overall fairness to the unsecured creditors can be achieved without an application of the pari passu principle.",
        "Our approach from first principles": "78        Since there is no case law which directly establishes the applicability of the pari passu principle in a scheme of arrangement outside liquidation, we propose to consider the issue from first principles. Admittedly, it is tempting to follow the decision of the Judge. It may be true that the majority of scheme of arrangement cases form the precursor to the liquidation of a company. If one takes that into account, it is easy to agree with the Judge that the pari passu principle should, perforce, apply in schemes of arrangement. This is particularly so if one is wary of cunning creditors who may seek to frustrate the principle by positioning themselves for maximum distribution of the assets in a scheme of arrangement prior to the insolvency of the company. 79        However, we find that the adoption of that position would be tantamount to turning a blind eye to three fundamental aspects of corporate rescue mechanisms outside liquidation in general and of a scheme of arrangement in particular. 80        First, we agree with the appellants’ argument that there are fundamental differences between a scheme of arrangement and liquidation. Turning first to its characteristics, a scheme of arrangement is nothing more than a contractual arrangement between the debtor company and its creditors to arrive at a compromise arrangement that is satisfactory to the parties. As pointed out by this Court in theDaewoocase at paragraph 23 of the judgment: After all, a scheme of arrangement or compromise proposed by a company to be made with its creditors or a class of creditors under s 210 of the Companies Act isno more than a proposal to vary or modify its obligationsin relation to its debts and liabilities owed to its creditors or a class of creditors on certain terms and conditions. [emphasis added] At paragraph 24 of that judgement, this Court also observed that the scheme is ‘wholly a contractual scheme’. 81        Further, one has to remember that a scheme of arrangement is a corporate rescue mechanism.  As with other corporate rescue mechanisms, such as judicial management, it seeks to rehabilitate the company and achieve a better realisation of assets than possible on liquidation: see, generally, Woon,Company Law, (2 ed, 1997) at p 627 and Chapter 17.  Such a rescue mechanism may need, in order to be effective, to discriminate amongst creditors for example by repaying bigger creditors proportionately less than small creditors are repaid.  Dictating that the assets should be distributed in a pari passu manner would not only decrease the flexibility now available to planners of schemes but it may also put a dampener on what the scheme of arrangement could achieve and spell the death knell of the company prematurely. 82        Secondly, we note that there have been recent instances in other jurisdictions where schemes of arrangement have been used to depart from the pari passu principle even in instances of insolvency. InRe Bank of Credit and Commerce International SA (No 3)[1993] BCLC 1490, the liquidators of BCCI sought the sanction of the court for various proposals. The proposal which is material for our present purposes was a ‘contribution agreement’. It was common ground between the parties that if sanctioned by the court, the contribution would result in a breach of the pari passu principle. In spite of that, the Vice-Chancellor sanctioned the scheme and that decision was upheld on appeal to the Court of Appeal. In delivering the judgment of the Court, Dillon LJ reasoned at p 1509 of the report: The other point taken by the appellants concerns the departures under the contribution agreement […] from the pari passu rule. Reference has been made to the decision of the House of Lords inBritish Eagle International Air Lines Ltd v Compagnie Nationale Air France Ltd[1975] 2 All ER 390[1975] 1 WLR 758. That case actually only decided that the pari passu rule invalidated a clearing house arrangement for the settlement of debts among airline operators which they had entered into before one of them went into liquidation. When the liquidation supervened, the rights of all concerned were governed by the pari passu rule in company liquidation which superseded the arrangements for the previous clearing hours settlement arrangements. As I see it,in a liquidation there can be a departure from the pari passu rule by a scheme of arrangement under s 425; but, equally, there can be a departure from the pari passu rule if it is merely ancillary to an exercise of any of the powers which are exercisable with the sanction of the court under Pt I of Sch 4 to the Insolvency Act 1986. There are some things that cannot be done without a scheme of arrangement and in the normal run that would include a very large number of proposals, and indeed almost all, if not all, proposals for re-arrangements of rights as between creditors of different companies or different classes of creditors. But the compromise powers within their scope are an alternative way of doing things, andI do not believe that theBritish Eagledecision precludes that being exercised in a way which may, in an ancillary fashion, involve a departure from the strict pari passu rule. If any compromise is dissected, it may involve elements of give and take as to who is to have what, which may make it quite impossible to fit the compromise in with the strict pari passu rule. […] [emphasis added] 83        These principles were followed inRe Anglo American Insurance Ltd[2001] BCLC 755. In that case, the court was asked to sanction a scheme of arrangement which, in the event of a subsequent liquidation, imposed on the liquidator provisions which differed from the statutory scheme on liquidation. The court sanctioned the scheme. In his decision, Neuberger J quoted the principles enunciated by Dillon LJ inRe BCCI SA (No 3)with approval and said at p 765 of the report: The second issue is whether the court has jurisdiction to impose a scheme, in effect, on a liquidator which is in any way different from the statutory scheme which applies on liquidation. In general,while I believe that the court should be very careful before making an order which would involve approving a scheme which differs in any way from the statutory scheme appropriate to liquidations in terms which would carry over and be binding on a subsequent liquidator, I do consider that the court has jurisdiction to make such an order. […] it appears to me that s 425 [the equivalent of our s 210] can be invoked to provide for a binding scheme, binding on the liquidator and the liquidation, after the company has gone into liquidation and liquidators have been appointed. […] [I]f s 425 can be invoked so as to bind the company, and therefore the liquidator and the creditors, after the company has gone into liquidation, it is hard to see any logic or sense in the court not being able to approve a scheme before the company has gone into liquidation so as to bind the company and the liquidator after it has gone into liquidation. That is particularly true in a case such as this, where a petition to wind up the company has been presented because the company is insolvent, and indeed where the scheme is intended to bind all the creditors, those creditors have voted overwhelmingly to support the scheme, and subject to one point, the scheme proposals do not alter the substantive right of the secured or preferential creditors or the rules relating to set-off, and in particular r 4.90 of the Insolvency Rules 1986, which would apply in liquidation. Furthermore, the court often is asked to approve a scheme in a case just such as this, namely, where the company is insolvent. The scheme requires to be managed on the basis that, subject to the specific sort of events which are catered for in the scheme itself, which would involve the scheme administrators coming back to court and asking for the scheme to be discharged, they expect to be carrying it on a long-term basis. If at any time the scheme was liable to be destroyed by a petition to wind up the company, it would render the potential effectiveness of such a scheme nugatory, or at any rate much reduced. […] [emphasis added] 84        We find these authorities to be persuasive. Instances where a scheme of arrangement proposes to depart from the provisions of the insolvency regime will be rare. The actual circumstances and facts of each case will determine if such a scheme should be sanctioned. Future cases will decide when and under what circumstances such a departure will be allowed in Singapore. Suffice it for us to say, for the purposes of the present appeals, that in England the courts have sanctioned schemes of arrangement which potentially infringe the pari passu rule even in instances where the company is insolvent or is facing liquidation. A fortiori, a departure from the pari passu principle should be allowed in other corporate rescue mechanisms outside the insolvency regime. 85        Thirdly, there are also instances where schemes of arrangement have nothing to do with insolvency at all. There is a myriad of situations in which schemes of arrangement could be used in the field of corporate restructuring of solvent companies. For example, schemes of arrangement may be proposed to reorganise the share capital of a company: see s 210(11) of the Companies Act. In the case of a group of companies, schemes of arrangement could be used in its reconstruction or merger: see p 627 of Woon,Company Law(2 ed, 1997). Extending the pari passu principle to such schemes of arrangement which do not lead to insolvency would be to go farther than is necessary. 86        It seems to us that whether the pari passu principle should apply outside liquidation really depends on whether the creditors to be affected by a proposed scheme of arrangement require the additional protection of this principle.  Our view is that they do not.  The statutory regime already sufficiently safeguards the interests of such creditors.  Under s 210(3) of the Companies Act for a scheme of arrangement simpliciter and s 210(3) read with s 227X(a) of the Companies Act for a scheme of arrangement in a judicial management, the scheme will not become binding unless the court approves it.  This means that every creditor is entitled to challenge the scheme before the courts and to point out why it should not be sanctioned.  Such objections can be based on the failure of the scheme to embody the pari passu principle or be made for other reasons.  Where the objection is that the scheme does not provide for pari passu distribution, the court will be able to decide whether in the particular circumstances, this objection is an insuperable barrier to implementation of the scheme.  The statutory regime therefore enables each case to be considered on its own particular facts and this is a far better approach than the rigid application of the pari passu rule would be. 87        Even though we have come to the conclusion that the pari passu principle does not extend to schemes of arrangement, that does not alter the outcome of the present appeals. The appellants’ argument that their right to direct payments can only be affected by an express term in the Scheme fails because the appellants did not have a right to those payments when the Scheme was approved and sanctioned. We have also found that direct payments would fall under the Scheme because they form part of the ‘accounts receivable’ by Eltraco. Consequently, the appeals would have to be dismissed.",
        "Conclusion": "88        For the reasons given above, we accordingly dismiss the appeals with costs. The security deposit together with interest, if any, will be released to the respondents or their solicitors to account of costs. Appeals dismissed."
    }
}