{
    "case_title": "Tan Kim Seng v Ibrahim Victor Adam",
    "ncitation": "[2003] SGCA 49",
    "coram": "Chao Hick Tin JA; \n      Woo Bih Li J",
    "sections": {
        "The background": "2       On 7 November 1998, the plaintiff-respondent (“Ibrahim”) who was a passenger in a motor-car was injured when the car he was travelling in was involved in an accident with a goods vehicle driven by the defendant-appellant (“Tan”).  On 10 October 2001, less than a month before limitation set in, Ibrahim filed an action against Tan claiming for general and special damages for the injuries he suffered on account of the accident. 3       On 23 November 2001, Ibrahim amended the writ of summons as well as the statement of claim.  On 27 November 2001, by consent, an interlocutory judgment was entered against Tan on the basis that he was 100% to blame for the accident and damages were to be assessed by the Registrar. 4       Thereafter no step or proceeding was taken by Ibrahim to have his claim for damages assessed, although there was some correspondence between the solicitors on various matters pertaining to assessment, e.g. the discovery of documents and the re-examination of the plaintiff by medical experts.  Among the correspondence was a letter of 6 February 2002, where Tan requested Ibrahim to hold his hands. 5       It was only some 14 months later, on 6 February 2003, following a communication from Tan’s solicitors, that Ibrahim filed his summons for direction for assessment of damages.  Tan’s solicitors objected to the application.  On 28 February 2003, Tan applied for a declaration that the action be deemed discontinued under O 21 r 2(6). 6       On 24 March 2003, Ibrahim applied for a declaration that O 21 r 2(6) did not apply to his case.  Alternatively, if it did, he applied for the court’s indulgence under r 2(8) to have the action reinstated. 7       All these applications came before the Assistant Registrar who ruled that O 21 r 2(6) applied to the case and that the action was deemed discontinued.  Ibrahim’s application for indulgence under r 2(8) was dismissed. 8       Ibrahim took the matter further to the judge-in-chambers, who allowed the appeal on the ground that O 21 r 2(6) is inconsistent with s 6(3) of the Limitation Act (“s 6(3)”) which provides that a judgment has a limitation period of 12 years.  As s 6(3) does not differentiate between interlocutory and final judgments, she came to the conclusion that O 21 r 2(6) could not and did not apply to a case where interlocutory judgment had been obtained.  Tan, being dissatisfied with the Judge’s decision, has appealed to the Court of Appeal.",
        "Application of O 21 r 2(6)": "9       Order 21 r 2(6) reads:- “Subject to paragraph (6A), if no party to an action or a cause or matter has, for more than one year (or such extended period as the Court may allow under paragraph 6(B)), taken any step or proceeding in the action, cause or matter that appears from records maintained by the Court, the action, cause or matter is deemed to have been discontinued.”  10     Paragraph (6A) of r 2 merely provides that paragraph (6) shall not apply where the action, cause or matter has been stayed pursuant to an order of court.  There is no such order in the present case, so paragraph (6A) is of no relevance. 11     It is not in dispute that during the one year period from 28 November 2001 to 27 November 2002 no step or proceeding was taken by Ibrahim to have the damages assessed.  The contention of Ibrahim is that as he has already obtained an interlocutory judgment, O 21 r 2(6) can no longer apply to his case.  He argued that where interlocutory judgment has been entered, any step or proceeding taken thereafter would be a step taken “after” judgment and not a step taken “towards” judgment.  Here, counsel for Ibrahim relied upon a passage in an article entitled“Automatic Discontinuance under Order 21 Rule 2, First Dormant then Dead” published in (2001) 13 S.Ac. LJ 150 by Lim Hui Min:- “A proceeding is essentially any formal and significant step taken before judgment.  It should refer to the last interlocutory proceeding taken by a party ie an act done while the matter is still in controversy, before judgment is obtained.  The rationale for this is that while the suit is ongoing, the plaintiff has the duty to push the suit to a conclusion.  However once the plaintiff has obtained judgment in the matter, the suit is concluded, and his duty ceases.  Moreover, actions in which judgments have already been obtained are considered to be concluded, and what has been concluded cannot be discontinued.” 12     Counsel also relied upon O 37 r 1 of the Rules of Court (“O 37 r 1”) to argue that matters relating to assessment post interlocutory judgment are not governed by O 21 r 2(6). 13      In our opinion, it may perhaps be useful to view the matter from first principle.  In every cause or action instituted in court, broadly two issues need to be addressed.  The first is to determine whether the defendant is liable to the plaintiff for the cause.  If the court is to hold that the defendant is not liable, then that would be the end of the matter.  It would be a final order.  No further steps need to be taken by the plaintiff or the defendant.  However, if the order determines that the defendant is to be blamed for what had happened, leaving damages suffered by the plaintiff to be assessed at a later date, the order is final as far as liability is concerned.  Such an order as to liability could well be given after a trial or it could be made by consent.  But how the order is obtained is of no consequence and cannot change its nature.  The fact of the matter is that at this stage, only one aspect of the action has been determined, namely, liability.  The second aspect, of determining the quantum of loss, is still outstanding. 14     In this connection, we think it is crucial to bear in mind the overall scheme of things under the present Rules of Court.  It was put by Lim Hui Min in her article in these terms:- “In the course of the last decade, there has been a major shift in the judicial approach towards the control of litigation proceedings, not only in Singapore, but in other parts of the Commonwealth.  The emphasis is now on expedition, economy, and the avoidance of delay in litigation.  Disputes will no longer be allowed to drag on for years.  Towards this end, the courts in Singapore have adopted the practice of case management.  Each case is monitored, and if necessary, the court will intervene to ensure that it proceeds expeditiously.  If every action has an indefinite life span from the time it is commenced, and if the court is to adhere conscientiously to its case management philosophy, the burden will continually be on the court to conduct case management exercises (such as pre-trial conferences) in order to monitor dormant suits and to find out why they have become dormant.  This is arguably an unnecessary and inefficient use of judicial resources.  It seems that the court has now found a solution – in the form of the automatic discontinuance provision – to the problem of having to adhere to its case management philosophy on the one hand, and having to husband scarce judicial resources in doing so, on the other.  Under the automatic discontinuance regime, no action will have an indefinite life span.  Therefore the court’s burden in conducting case management exercises for any one case will be for a finite time-period.” 15      We would only add that the fact that the court takes the initiative of actively conducting case management does not detract from the parties’ obligation to comply with the time-lines set in the Rules of Court.  No sufficiently persuasive arguments have been advanced to us to demonstrate why O 21 r 2(6) should no longer apply after interlocutory judgment has been obtained when, quite clearly, further steps are still required to be taken to bring the action to completion.  Otherwise, it would mean that a party with the benefit of an interlocutory judgment could let the matter of assessment remain outstanding for an indefinite period, a course which is hardly consonant with the modern approach of requiring civil litigation to proceed expeditiously. 16       We agree that generally there is no incentive for a party with an interlocutory judgment to delay matters.   However, the same can be said even in respect of a case where no interlocutory judgment has been obtained.  Every plaintiff would want to see his claim determined and satisfied quickly.  But a party who has difficulties in proving his loss may just want to have more time, although he may have obtained an interlocutory judgment.  He must, nevertheless, comply with the time-frame set by the Rules of Court for assessment. 17      Admittedly, under O 37, specific rules are laid down on the assessment of damages.  Rule 1(1) of that Order requires the party entitled to the benefit of the judgment to apply, within one month, to the Registrar for directions.  Under r 1(3) of the same Order, if such a party fails to make the application, “the court may, on the application of the party against whom the judgment is given, proceed to assess damages or make such order as it thinks just.” 18       We note that Prof J Pinsler inSingapore Court Practice 2003 (Cumulative Update No. 2/2003),in commenting on the decision below of the present case, is of the view that O 21 r 2(6) does not apply where interlocutory judgment has been obtained.  He reasoned:- “This is because the plaintiff has acquired substantive rights in this situation even though they are inchoate (ie, as yet expressed in the form of damages).  The rationale of the discontinuance provisions in O 21 r 2 is that the parties should not be put to further expense in engaging the court’s processes if the plaintiff no longer intends to pursue his rights.  Once those rights are obtained, the issue of discontinuance does not arise.  The pertinent provisions at this point in time are those in O 37 rather than in O 21.  InTan Wee Beng, the court justified its view that O 21 r 2(6) should apply even though interlocutory judgment had been obtained because such an approach would avoid delays and dormant suits (ibid, at paras 20-21).  However, the court has more appropriate weapons with which to respond in such a situation.  The Order governing assessment of damages (O 37) itself anticipates the problem of delay.  Accordingly, a failure to apply for directions within one month of the judgment pursuant to O 37 r 1 is a procedural breach which may result in an ‘unless order’ and even punitive sanctions.  Order 37 r 1(3) states that the court may ‘proceed to assess damages or make such other order as it thinks just’.  The application of O 21 r 2(6) would unnecessarily interfere with the scheme of O 37.” 19     We do not see any special scheme in O 37 r 1 as such.  That rule sets out what the party with the benefit of the interlocutory judgment should do.  It also gives the other party the option, but he is not obliged to, of pushing the assessment along by applying to court.  The Registrar on his own is not obliged to make any “unless order”.  Why should an obligation be imposed on the Registrar to monitor the movement of cases awaiting assessment when the duty clearly rests on the party who has obtained the interlocutory judgment?  The time frame set out in O 37 r 1 for a party with the benefit of an interlocutory judgment is very much of the same nature as the various time frames set out in the Rules of Court for a plaintiff (e.g., filing of pleadings), which is to ensure that the party moves the proceeding along.  If the party with the benefit of the interlocutory judgment allows it to go to sleep, then he takes the consequence of the action being deemed discontinued.  The only way to revive it would be to adduce reasons compelling enough to persuade the court to reinstate the suit pursuant to powers conferred under O 21 r 2(8). 20      The rationale behind O 21 is the maintenance of an efficient judicial system which requires less policing, with the imposition of drastic consequences for tardy litigants.  The approach favoured by Ibrahim would make nonsense of the Rules, which on the one hand encourages the plaintiff to proceed with utmost despatch to interlocutory judgment and yet on the other hand allows the party to procastinate after that.  Until the assessment is completed, the suit is still in the court’s docket as an outstanding case.  The case is not over yet.  It would be totally out of sync with the scheme of things under the current Rules of Court to say that once a plaintiff obtains an interlocutory judgment on liability, he can thereafter take his time. 21     The court below relied on the following passage inSingapore Civil Procedure 2003(at p.394) which defines the word “proceeding”, to come to its conclusion that O 21 r 2(6) does not apply to a case where interlocutory judgment has been obtained:- “A proceeding is essentially any formal and significant step taken before judgment.  It should refer to the last interlocutory proceeding taken by a party i.e., an act done while the matter is still in controversy, before judgment is obtained.  (SeeTaylor v Roe(1893) 62 LJ Ch 391;Bank Bumiputra Malaysia Bhd v Syarikat Gunong Tujoh Sdn Bhd & Ors[1990] 1 MLJ 298)” 22    It is, therefore, important to see what the two cases, which the authors of theSingapore Civil Procedure 2003relied upon, decide.  InTaylor v Roe, an action was commenced for an account for certain dealings in the nature of partnership transactions.  An order was made directing certain accounts and inquiries to be taken.  The plaintiff took no action for seven years before moving for leave to bring issue a writ of sequestration to enforce the earlier order.  Kekewich J dismissed the motion and in relation to Order LXIV rule 13 (a provision which required notice to be given if there had been no proceedings for one year from the last proceeding) stated that – “InHoulston v Woodward(78 L.T. 113) it seems to have been held thatthere is no occasion to give notice of intention to issue execution after judgment, and that seems to have been decided by the Court of Appeal on the ground that the rule did not apply to the issue of execution at all; I am prepared to go a step further and to hold that the rule does not apply to the issue of execution at all; thatthe rule is directed to proceedings in the action, such as the delivery of pleadings, notice oftrial or going on with inquiries at chambers or matters of that kind.I do not think that the rule aims at execution for default in payment of costs in one sense that is a proceeding in the action, but I do not think it is within the intent of the order.  There is no reason why a party to an action should not have execution on an order simply because the action has been dormant for some time; andI am of opinion, though the point is certainly new, that the issue of execution is not a proceeding within this rule, and that so far the notice of motion is right.  (Emphasis added) 23Houlston v Woodwardwas a case where the English Court of Appeal held that the word “proceeding” meant a proceeding towards and not after judgment.  It is clear that Kekewich J had not only endorsed this view but had even gone further to state that “the rule does not apply to the issue of execution at all.”  Implicit in this holding must be the view that ‘proceeding’ terminates only after final judgment as only final judgments can be executed. 24Bank Bumiputra Malaysia Bhdis a Malaysian case where Haidar J, in considering O 3 r 6 (a provision identical to the Singapore provision replaced by O 21 r 2), had stated that:- “The word ‘proceeding’ indicates a step ‘towards’ judgment and the rule, therefore, applies only when judgment has not been entered up; in other wordsit refers to an interlocutory proceeding before final judgment.”  (Emphasis added). 25     It would be noted that Kekewith J referred to the non-application of the then English Order LXIV rule 13 to post-judgment execution. Similarly, in Haidar J’s opinion, the termination point is the “final judgment”.  Execution only arises on final judgment where, for example,  damages are ordered to be paid to the winning party.  Thus, the passages inTaylor v RoeandBank Bumiputra Malaysia Bhddo not appear to support the proposition advanced by Ibrahim that “proceeding” is anything prior to interlocutory judgment. 26     To our mind O 21 r 2(6) would apply to any case where steps are still required to be taken to obtain a judgment which is enforceable.",
        "Section 6(3) of the Limitation Act": "27      We now turn to the point taken by the Judge that O 21 r 2(6) is inconsistent with s 6(3) of the Limitation Act.  The provision reads:- “An action upon any judgment shall not be brought after the expiration of 12 years from the date on which the judgment became enforceable and no arrears of interest in respect of any judgment debt shall be recovered after the expiration of 6 years from the date on which the interest became due.” 28     It is vitally important to note the opening words of this provision, namely, “an action upon any judgment”.  Under s 2, “action” is defined to include “a suit or any other proceedings in a court.”  The effect is that under s 6(3) you cannot by means of a proceeding in court enforce a judgment if more than twelve years have elapsed from the date of the judgment. 29     In this regard, one must bear in mind the distinction between “execution” and “an action upon any judgment”.  InHalsbury’s Laws of England (4thEdn Reissue) Vol 28at ¶916, the learned authors stated the following in a footnote, in commenting on the equivalent English provision:- “… an action upon a judgment applies only to the enforcement of judgments by suing on them and does not apply to the issue of executions upon judgments for which the leave of the court is required, after six years have elapsed, by RSC Ord 46 r 2(1)(a); in matters of limitation the right to sue on a judgment has always been regarded as quite distinct from the right to issue execution under it, but the court will not give leave to issue execution when the right of action is barred: …” We should point out that there is a provision in our Rules of Court which is identical to the English RSC Ord 46 r 2(1)(a). 30     It is true that s 6(3) does not expressly differentiate between final and interlocutory judgments.  Indeed, it is difficult to lay down any hard and fast rules on the question as to what order is final and what is interlocutory.  As is so aptly noted inHalsbury’s Laws of England (4thEdn) Vol 26at ¶504 “a judgment or order may be final for one purpose and interlocutory for another or final as to part and interlocutory as to part.”  However, as ordinarily understood, what is decided in an interlocutory judgment is the question of liability.  The quantum of damages is to be assessed later.  This was also the case here.  The reasoning of the court below as to why O 21 r 2(6) should not extend to a case where interlocutory judgment has been obtained is: “… it would be inconsistent with s 6(3) of the Act which states that a judgment is valid for twelve years.  The Act makes no distinction between interlocutory and final judgment nor is the word judgment defined.  An interlocutory judgment is final as regards liability.  As the Act did not confine the validity of a Judgment only to final judgments, how can O 21 r 2(6) apply to say the claim underlying a judgment is deemed discontinued when the judgment itself is valid for 12 years?” 31     But what is there to be enforced when all that an interlocutory judgment decides is the question of liability and the very order itself goes on to declare that damages due to the party entitled to the interlocutory judgment is to be assessed?  Such an interlocutory judgment does not come within s 6(3).  The logic is the same as in the case where a person is the cause of an accident, but if the other party suffers no loss then a judgment which merely states that the first person caused the accident hardly means anything.  There is nothing to be enforced. 32     It seems to us that s 6(3) applies where a judgment has been obtained which gives something to the winning party who is entitled to enforce it to ensure compliance.  This is also the view of the learned authors of theHalsbury’s Laws of England (4thEdn Re-issue) Vol 28who, in dealing with the equivalent provision in theEnglish Limitation Act,stated at ¶917:- “The limitation period for bringing an action on a judgment applies toany final judgment for the payment of a specific sum of money, whether in law or equity …  The limitation extends to proceedings for enforcing judgment … but execution is not within the meaning of the action.” (Emphasis added). 33      In the instant case, the interlocutory judgment merely stated that Tan was liable for the accident and the quantum of damages which he was liable to pay Ibrahim was to be assessed later.  Ibrahim is the party who was obliged to take follow-up action to have the damages assessed and he had failed to do so within the time prescribed in the Rules.  There is nothing yet to be enforced.  Accordingly, we have to respectfully differ from the Judge and hold that there is nothing in O 21 r 2(6) which is inconsistent with s 6(3).",
        "Judgment": "34     In the result, we would allow the appeal and declare that the action is deemed discontinued pursuant to O 21 r 2(6).  In so holding, it does not mean that the interlocutory judgment already obtained must be cancelled or abrogated.  The interlocutory judgment remains.  But nothing more can be done on the judgment as the rights conferred under it are inchoate.  If in the interlocutory judgment the court had awarded costs to Ibrahim, say of $5,000/-, then notwithstanding that the action is deemed discontinued, execution may still be carried out to ensure that the costs awarded are paid. 35     In passing, we ought to observe that the Judge below had said that had she ruled that O 21 r 2(6) applied to the case, she would not, on the facts of the case, have exercised her discretion under r 2(8) to reinstate the action.  Ibrahim has not in his Case pursued this point.  No submission was made on it.  So the question whether the court should have exercised its powers under O 21 r 2(8) to reinstate the action does not arise for our consideration. 36    The appellant shall have the costs, both here and below.  At the hearing before the Assistant Registrar, it was ordered that the appellant shall have the costs of the application as well as of the action.  We do not think the appellant should have the costs of the action.  The issue before her related only to the application of O 21 r 2.  Accordingly, we would set aside this part of that order.  For the avoidance of doubt, we would also state that the costs which the appellant shall be entitled to for the hearing before the High Court, and before us, is also so restricted. 37    The security for costs, together with any accrued interest thereon, shall be returned to the appellant."
    }
}