{
    "case_title": "Amara Hotel Properties Pte Ltd v Sie Choon Poh (trading as Image Galaxy)",
    "ncitation": "[2004] SGCA 19",
    "coram": "Chao Hick Tin JA; \n      Judith Prakash J; \n      Yong Pung How CJ",
    "sections": {
        "Background": "2The appellant, Amara Hotel Properties Pte Ltd (“Amara”), was the owner of a shop unit in the shopping complex known as “The Amara” in Tanjong Pagar Road. The respondent, Sie Choon Poh (trading as Image Galaxy) (“Mr Sie”), took a lease of the unit for a period of three years from 9 September 1998 to 8 September 2001 under a lease agreement dated 28 July 1998. Mr Sie operated a printing business at the unit. 3For the purposes of the action and this appeal, the material terms of the lease are as follows: 8.1Negligence The Lessees agree to occupy use and keep the demised premises at the risk of the Lessees and hereby release the Lessors and their contractors and inviteesin the absence of any gross negligenceon the part of the Lessors their servants or agents from all claims and demands of every kindin respect of or resulting from any accident damage or injuryoccurring in the Complex or the demised premises and the Lessees expressly agree that in the absence of any such negligence as aforesaid the Lessors shall have no responsibility or liability for any loss damage or injury suffered by the Lessees (whether to or in respect of the Lessees’ person property or business conducted by the Lessees)as a result of any breakage leakage accident or eventin the Complex or the demised premises. 9.2Quiet Enjoyment To permit the Lessees … to have quiet enjoyment and exclusive possession of the demised premises during the said term without any interruption by the Lessors … 9.4Maintenance of the Complex The Lessorsshall maintain and keep in repair the Common Areaduring the term of this Leaseinclusive ofthe exterior walls (other than shop fronts) and all parking spaces roads pavementswater drainagelighting and other common facilities and services Provided Always that the manner in which such areas and facilities shall be maintained and the expenditure thereon shall be at the absolute discretion of the Lessors. [emphasis added] 4On 19 April 2001, waste water from the food court located directly above the unit leaked into the unit through the ceiling. The unit and the printing machinery inside it were soiled and the carpeted area at the entrance was damaged. Subsequent investigation revealed that the waste pipeline system installed for the food court met in a T-junction above the unit. The pipe at the T-junction was found to be severely corroded and this had led to the leakage. Mr Sie then commenced this action claiming damages for the loss sustained by him as a result of the leakage. 5In his statement of claim, Mr Sie first set out the covenants contained in cll 9.2, 9.3 (relating to management and operation of the shopping complex) and 9.4. He then set out the events of 19 April 2001 and the consequential damage. Mr Sie then averred that the water and/or waste material contained in the piping system had leaked into the premises as a result of the cast iron pipes “being faulty, wholly corroded and unmaintained”. In these premises, in breach of the specified covenants, Amara had failed to keep the waste water pipe in the common area of the premises in good and proper condition or in a state of proper repair, and in the process had deprived Mr Sie of the use of the premises and caused him to suffer damages. 6In the defence filed by Amara, all breaches of covenant alleged by Mr Sie were denied. In para 7, Amara pleaded that the leakage on 19 April 2001 was not the result of its default. This paragraph went on: The Defendants aver that the leak was caused whilst the Defendants’ independent contractors (Dyna-Jet Pte Ltd) were clearing a blockage in the waste pipeline located in the ceiling of unit #03-K2. The Defendants deny any breach of covenants of the Lease Agreement. The waste pipeline system was designed, constructed, installed and supplied by Chan Weng Wah Engineering Pte Ltd, whom the Defendants relied upon for their skill and expertise. The Defendants had also relied on the skills and expertise of independent contractors Dyna-Jet Pte Ltd to regularly service and maintain the waste pipeline system. 7Amara further pleaded that it was entitled to rely on the operation of cl 8.1 of the lease to exempt it from liability. This pleading, contained in para 9 of the defence, formed the basis of the appeal. It reads: Further or in the alternative, the Defendants aver that by Clause 8.1 of the Lease Agreement, the [plaintiff] agreed to occupy use and keep the Unit at his own risk and expressly agreed that in the absence of gross negligence, the Defendants shall have no responsibility or liability for any loss or damage suffered by the [plaintiff]. In the reply that he filed, Mr Sie joined issue with each and every allegation in the defence but did not otherwise make any reference to Amara’s reliance on cl 8.1. 8On the first day of trial, Amara admitted that it was in breach of the covenant to repair but maintained its pleaded position on the covenant for quiet enjoyment. It also reiterated its reliance on cl 8.1 and contended that this clause operated to exempt it from liability for the leakage. During the course of the trial, Lai J observed that while Amara asserted it was exempted from liability under cl 8.1, it had not pleaded that it had been negligent in failing to maintain the waste pipeline system so as to support that clause. The judge stated (as recorded in the notes of evidence): If so pleaded, plaintiff could have replied by asserting that there was in fact Gross Negligence, thereby taking the matter outside cl 8.1 … There could have been negligence or gross negligence; I don’t know. The party that relies on negligence has to prove it. No evidence on the nature or degree of the negligence to show that it was simple negligence and not gross negligence will be allowed, on the case as pleaded. The above ruling in relation to evidence of the nature or degree of the negligence, if any, displayed by Amara was made when counsel for Mr Sie was cross-examining one Ms Tan Hwee Joo who was a witness called by Amara to testify in relation to the steps taken by Amara to ensure that the pipes were cleaned and serviced regularly.",
        "The decision below": "9When the trial ended, Lai J granted judgment in favour of Mr Sie for damages arising out of Amara’s breach of covenant to repair. He did not find it necessary, in the circumstances, to consider the alleged breach of the covenant for quiet enjoyment. 10In his grounds of decision, the judge stated that the outcome of the case had hinged on the failure of Amara to aver specifically and in terms that the bursting of the pipe at the T-junction was due to Amara’s negligence. Amara had by para 7 of its defence set out the steps taken to maintain the pipe and by this pleading it had always been Amara’s case that it denied any breach of the covenant to repair. By para 9 of the defence Amara had, as the judge said, “purported to invoke the exemption clause” contained in cl 8.1 of the lease. The judge then went on to emphasise that throughout the defence, there was no pleading of any sort that Amara accepted that it was negligent but not grossly negligent, so that Amara could invoke the exemption under cl 8.1. Admittedly by para 9 of the defence, Amara had invoked the exemption clause but it had not particularised how that clause would avail it. It had not put in issue as to whether it was asserting that it was only negligent, setting out the particulars relied on, which would have also explained why Amara was not grossly negligent. 11In consequence, the judge emphasised that there was no admission of negligence by Amara. There were no particulars of the negligence. In those circumstances, Mr Sie did not counter that Amara was “grossly negligent”. As a consequence, what had happened in this case was that the issue whether Amara was negligent or not was not joined. Consequently, Mr Sie did not plead in his reply that Amara was “grossly negligent” and therefore precluded from relying on the exemption clause. The relevant evidence was not called to enable investigation into the actual circumstances under which the T-junction and pipe could have been left to reach such a degree of corrosion. Once Amara admitted that it was in breach of the covenant to repair, judgment had to be entered against it since its pleadings had not allowed the issue of negligencevis-à-visgross negligence to be investigated.",
        "The appeal": "12The main issue on the appeal was whether there was a defect in Amara’s pleadings so as to preclude it from relying on cl 8.1 of the lease. To be more precise, in order to raise the issue of whether the leak had been caused by mere negligence as opposed to gross negligence, was it incumbent on Amara to plead that it had itself been negligent, though not grossly negligent, and to support that averment with particulars of such negligence? 13We did not see any lacuna in Amara’s pleadings. Mr Sie had based his claim on breaches of the covenant to maintain and keep in repair the common area and of the covenant of quiet enjoyment. Amara’s defence had been to deny such breaches, to state what it had done to keep the common area in repair and to rely on the operation of cl 8.1 by which Mr Sie had agreed that in the absence of gross negligence on the part of Amara, Amara would not be responsible for any loss or damage suffered by him while he occupied the unit. That pleading made it clear that Amara was asserting that unless the damage was proved to have been caused by gross negligence, contractually Amara would not be responsible for it. It was entirely open to Mr Sie to specifically assert in his reply that Amara was not entitled to rely on cl 8.1 because the damage had resulted from gross negligence on its part. He did not do so. The course that he chose which was to join issue with every allegation in the defence was, however, in itself sufficient to deny Amara’s entitlement to rely on cl 8.1 and make it an issue in the case as to whether the damage arose from negligence or gross negligence. This was because by joining issue, Mr Sie was saying to Amara “you are not entitled to the protection of cl 8.1 because you have been grossly negligent”. 14The primary purpose of pleadings, as is well known, is to define the issues and thereby to inform parties, in advance, of the case that they have to meet. In the present instance, Amara’s intention to rely on cl 8.1 was expressly pleaded and Mr Sie could not therefore say that he was caught by surprise by such intention. By para 7 of the defence, Amara had pleaded that the leak was not due to its default. By para 9 of the defence, it had specifically, and sufficiently, put in issue the applicability of cl 8.1. In our view, Amara was not required to assert its own negligence in order to achieve that aim. To require Amara to first plead the particulars of negligence in this case would go against the established rules of pleading. As stated inThe Supreme Court Practice 1999(Sweet & Maxwell London, 1998) at para 18/8/3, the tactic known as “confess and avoid” is a common one available to the defendant in a situation where it is not enough for him to deny an allegation in his opponent’s pleading but which requires him to go further by disputing its validity in law or setting up some affirmative case of his own in answer to it. In such a situation, the defendant cannot merely traverse the allegation but must confess and avoid it. However, as that commentary fromThe Supreme Court Practice 1999also makes clear, a defendant is not bound to admit an allegation which he seeks to avoid. He may at the same time deny its truth so long as he makes it quite clear how much he is denying. At the same time, collateral matter may be pleaded to destroy its effect. In this case, therefore, Amara was not bound to plead that it was negligent but not grossly negligent. It was sufficient for it to deny liability for breach entirely (whether arising from negligence or otherwise) as it did by para 7 of the defence and then bring in cl 8.1 to warn Mr Sie that if he could only establish negligence and not gross negligence (or some other causative factor not covered by cl 8.1), he would not be able to escape from the effect of the clause. It is also relevant that, as para 18/7/19 ofSingapore Civil Procedure 2003(Sweet & Maxwell Asia, 2003) notes, “[n]either party need, in any pleading, allege any matter of fact as to which the burden of proof lies on the other side”. In this case, the burden of proving facts establishing negligence and, even more than that, gross negligence, would lie on Mr Sie. Therefore, Amara was not required to plead any fact that would establish negligence, or give particulars of any such fact. 15Looking at this case in perspective, it was clear that Amara was seeking to avoid liability. Any admission or suggestion on Amara’s part concerning its own negligence would have served only to support Mr Sie’s case. The rules of pleading did not require Amara to take such a step. 16In our view, issue had definitely been joined on the question of whether the leakage was caused by negligence. In order to allow the admission of evidence on the degree of negligence displayed by Amara, no further pleading from Amara was required. The pleadings were sufficient for the purpose of admitting all evidence relevant to the issue of whether or not the requirements of cl 8.1 of the lease had been met. 17It is also noteworthy that Mr Sie’s presentation of his case was not prejudiced by any perceived defect in the pleadings. His case was that the pipe had leaked or burst due to want of maintenance. In response, Amara had pleaded facts to show how the pipes were maintained. For the trial, Mr Sie had called a professional building surveyor as an expert witness to give evidence on the surveyor’s investigations into the cause of the accident and the conclusions he had drawn. That witness was called specifically to establish that the cause of the leakage was want of maintenance. Mr Sie had therefore appeared in court equipped and prepared to try the case on the issue of whether Amara had fallen below the standard of care expected of it and to what extent. Once all the evidence of what had been done and what had not been done was in, the trial judge would have been in a position to decide whether or not the leakage arose from negligence or gross negligence or had nothing to do with negligence at all.",
        "Conclusion": "18As the taking of the evidence was cut short by the view that the learned judge took of the pleadings, we considered that the case had to be remitted to the judge so that all the evidence could be taken and the issue of whether on the facts cl 8.1 was available to relieve Amara from liability could be decided. In the result we allowed the appeal with costs and remitted the case to the judge. We also made the usual consequential orders."
    }
}