{
    "case_title": "Shahary bin Sulaiman v Public Prosecutor",
    "ncitation": "[2004] SGCA 39",
    "coram": "Chao Hick Tin JA; \n      Choo Han Teck J; \n      Yong Pung How CJ",
    "sections": {
        "Presumption concerning trafficking": "17.        Any person who is proved to have had in his possession more than — (a)        100 grammes of opium; (b)        3 grammes of morphine; (c)        2 grammes of diamorphine; (d)        15 grammes of cannabis; (e)        30 grammes of cannabis mixture; (f)        10 grammes of cannabis resin; (g)        3 grammes of cocaine; (h)        25 grammes of methamphetamine; or (i)         10 grammes of any or any combination of the following: (i)         N, a-dimethyl-3,4-(methylenedioxy)phenethy-lamine; (ii)        a-methyl-3,4-(methylenedioxy)phenethyla-mine; or (iii)       N-ethyl-a-methyl-3,4-(methylenedioxy)phene-thylamine, whether or not contained in any substance, extract, preparation or mixture shall be presumed to have had that drug in possession for the purpose of trafficking unless it is proved that his possession of that drug was not for that purpose.",
        "Presumption of possession and knowledge of controlled drugs": "18.—(1) Any person who is proved to have had in his possession or custody or under his control — (a)        anything containing a controlled drug; (b)        the keys of anything containing a controlled drug; (c)        the keys of any place or premises or any part thereof in which a controlled drug is found; or (d)        a document of title relating to a controlled drug or any other document intended for the delivery of a controlled drug, shall, until the contrary is proved, be presumed to have had that drug in his possession. 10        The presumption under s 17 is one of trafficking, not of possession. Therefore, the Prosecution may invoke the presumption only after it has proved beyond reasonable doubt that the accused person had the drugs in his possession. What then is meant by “possession” in this provision? That seemed to be the point counsel for the appellant was hoping to thrust before us. Relying on a brace of decisions from this court, namely inLow Kok Wai v PP[1994] 1 SLR 676andFun Seong Cheng v PP[1997] 3 SLR 523, counsel stressed that the obligation to prove possession must mean that the Prosecution had to prove “physical possession” of the drugs at the time of the arrest. So far, he has been correct. But, thereafter, counsel made an argument that, if accepted, would place an unreasonable strain on the meaning of the phrase “physical possession”. This term is not restricted to apply only where the drugs are found on the accused person physically. If a person walks into a restaurant with a bag in his hand and the knowledge that it contained drugs, he is clearly in physical possession of the bag and the drugs. The sense does not change when he places the bag on the ground next to him. The bag is physically detached from his person, but no one would argue that the bag was no longer in the physical possession of the man. Does the man lose physical possession if he leaves the bag where he had put it, and walks two steps to an adjoining table? We would think not. The question will then arise as to how far he needs to go before it can be said that the bag was no longer in his possession. That is a question of fact depending on the circumstances of the case. If the court finds that the man had left a considerable gap in terms of space and time between him and the bag, it may only mean that the stated timing of the moment of possession would have to be amended to reflect when it was that the man could still be regarded as being in possession of the bag. 11        Section 18, on the other hand, is a presumption of possession, not of trafficking. The material evidence, that the Prosecution needed to prove before the presumption can be invoked, is evidence that the accused person was in physical possession of a key to anything containing drugs, or of any container that contained drugs, or keys to any premises in which drugs are found, or of any document of title relating to drugs. It can easily be seen that s 18 is wider than s 17 and, consequently, there could be situations in which parts of it might overlap with s 17. The present case is an example in point. A person in possession of a bag of drugs, knowing that he was carrying a bag of drugs, would thus attract the application of s 17, but it would also naturally have attracted s 18(1)(a). 12        The trial judge found as a fact that the “Lafuma” bag was in the front compartment of the van of which the appellant was the driver at the material time. The judge further found that the bag belonged to the appellant. It was also found that the “Lafuma” bag contained the bulk of the heroin seized. The relevant part of his grounds ([2004] SGHC 135at [59]) states as follows: At the conclusion of my review of the evidence and the defence, I found the defence to be entirely unworthy of belief. There was no doubt in my mind that the accused was in possession of the Lafuma bag, the Hayrer bag and the heroin in them, as well as the sachet in the ashtray, and that he had admitted that they belonged to him. However, on the evidence accepted by the trial judge, including the confession of the appellant to selling heroin to Sazali, no presumption of law under the Misuse of Drugs Act was in fact required to convict the appellant on the charge. Moreover, even if the trial judge had relied on the presumption under s 17 (as he was entitled to in this case), he had found no evidence to rebut it. Similarly, had the judge relied on the s 18 presumption, there was sufficient evidence of trafficking, and nothing sufficient to persuade the court to find a reasonable doubt. In cases such as the present, it is desirable that the court states whether its finding of guilt was based on direct evidence (as would be in this case), or under the presumption in s 17 or 18 as the case may be. 13        We are of the opinion that there was no error in fact or law that required us to set aside the conviction and sentence. The appeal was therefore dismissed."
    }
}