{
    "case_title": "Ismail bin Abdul Rahman v Public Prosecutor",
    "ncitation": "[2004] SGCA 7",
    "coram": "Chao Hick Tin JA; \n      Lai Kew Chai J; \n      Yong Pung How CJ",
    "sections": {
        "Facts": "3          The uncontested facts are these. The appellant and the deceased were former colleagues. The deceased, an officer with the Commercial and Industrial Security Corporation (“CISCO”), was on overnight duty at Bukit Panjang Telecoms Exchange (“the Exchange”) from approximately 9.15pm on 6 March 2003. He had been issued a .38 calibre Special Smith and Wesson revolver (“the revolver”) and ten rounds of ammunition. The appellant was a former CISCO officer, known to the deceased and some others by his nickname “Mail”, who was working as a commercial diver in Indonesia. (The appellant had been absent without leave from his CISCO duties. Disciplinary action was taken against him, and his full-time employment with CISCO came to an end at the end of December 2002.) 4          On 6 March 2003, at approximately 11.20pm, the appellant went to the Exchange after returning to Singapore from Batam at about 9.30pm. The appellant testified that the deceased let him into the guardhouse and made him a drink. There was no one else there. They engaged in casual conversation and the topic of discussion soon came around to marksmanship. Sometime past 11.20pm, the deceased handed the revolver to the appellant and asked him to demonstrate shooting techniques, knowing that the appellant had been classified as a “marksman” during his time at CISCO. At around 2.30am on 7 March 2003, the deceased took back his revolver and went on his patrol duties; the appellant waited in the guardhouse. The deceased returned and they continued talking. According to the appellant, the deceased gave the revolver to him a second time at approximately 5.30am and asked him to demonstrate some shooting techniques again. 5          The appellant then caused three live rounds to be discharged from the revolver into the deceased. The appellant, thinking that his former colleague was dead, took the deceased’s revolver and bullet pouch of five rounds, an ash tray, a glass cup, all the closed-circuit television (“CCTV”) video tapes at the Exchange, $7 from the deceased’s wallet, and left for home. At his flat in Bukit Batok, the appellant placed the CCTV videotapes in the storeroom, kept the revolver and the bullets in a drawer in the master bedroom, and threw the ashtray and the cup into the rubbish chute. 6          The appellant went to the Hong Kah North Neighbourhood Police Post (“the NPP”) at about 9.15am on 7 March 2003. A team of Criminal Investigation Department (“CID”) officers, who had been tailing the appellant, entered the NPP soon after and arrested him. 7          The officer-in-charge of the CID team, Assistant Superintendent Abdul Halim bin Osman (“ASP Halim”), proceeded to interview the appellant. The appellant professed that the shooting was accidental and wrote a statement to that effect (“the self-written statement”). The Prosecution did not use this statement at trial. 8          In the course of police investigations, the appellant made four further statements (“the four statements”), which were in the nature of confessions to the investigating officer (“IO”), Inspector Roy Lim (“Insp Lim”): (a)        on 7 March 2003 at about 11.00am at the Bukit Batok bus interchange (“the first statement”); (b)        on 9 March 2003 at about 6.20pm at the CID (“the second statement”); (c)        on 13 March 2003 at about 2.30pm at the CID (“the third statement”); and (d)        on 20 March 2003 at about 3.55pm at the CID (“the fourth statement”). We will deal with the circumstances relating to the taking of the four statements in greater detail below.",
        "The Prosecution’s case": "9          The contents of the four statements formed the backbone of the Prosecution’s case. In those statements, the appellant had stated that he had gone to the Exchange on 6 March 2003 with the intention to “get” a gun, and he knew that there would only be one CISCO guard stationed there. He had a “money problem” and needed the revolver to carry out his plan to rob the DBS bank at Bukit Batok Central. When the deceased handed the revolver (which was loaded with live rounds) to him at about 5.30am on 7 March 2003, he had fired two shots into the deceased’s left side in order to “get hold of the revolver”. The appellant knew that the revolver was loaded with live rounds, and that firing live rounds at someone could be fatal. The deceased thought that there had been a misfire and told the appellant that both of them should explain this to CISCO. The deceased had then wanted to use the telephone to inform his family and the ambulance services that he had been shot. The appellant, to prevent his plan from being foiled, fired a third shot into the deceased’s stomach. 10        The four statements were clearly in the nature of confessions. A confession, according to s 17(2) of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”) is “an admission made at any time by a person accused of an offence, stating or suggesting the inference that he committed that offence”. The test of whether a statement is a confession is an objective one,iewhether a reasonable person reading the statement would conclude that the appellant had committed the offence charged:Anandagoda v The Queen[1962] 1 MLJ 289,Chin Seow Noi v PP[1994] 1 SLR 135,Chai Chien Wei Kelvin v PP[1999] 1 SLR 25. The following excerpts from the appellant’s third statement illustrate this very clearly: His left side of the body was facing me. My main target was to get hold of the revolver. So when he was not aware, I fired the revolver two times at the left side of his body. He then asked me to pass the phone to him to call his wife and ambulance. I could not let him call because it would spoil my second plan. So I estimated at about 5.45am, I shot him one more time around the front part of his stomach … I thought that he was dead. We now turn to the rest of the evidence presented by the Prosecution. 11        At about 6.00am on 27 March 2003, the deceased’s superior, Sergeant Chandrasaharan, had received a call from the deceased. The deceased informed Sgt Chandrasaharan that he had been shot by “Mail”. The deceased’s family received a similar call from him. When the deceased’s 19-year-old son spoke to him, the deceased sounded breathless and kept uttering some prayers. The police and the ambulance services were informed. Sgt Chandrasaharan went to the Exchange immediately and found the electronically controlled main gate opened. The deceased was in a supine position on the floor in the guardhouse, and he told Sgt Chandrasaharan that the appellant had shot him and then run away with the revolver. 12        Shortly thereafter, police officers arrived at the Exchange. Sgt Chandrasaharan related to them what the deceased had told him, and described the appellant to them as a male Malay in his thirties who was bald and had a stout build. This information was relayed to the Police Division Operations Room. 13        An ambulance arrived and the attending paramedic found three gunshot wounds at the front of the deceased’s body and an exit wound at his rear right waist area. The deceased went into cardiac arrest during emergency surgery and passed away at the hospital. The autopsy report stated that the certified cause of death was the multiple gunshot wounds to the abdomen. It also stated that there were three separate gunshot wounds, and that three slugs were recovered from the deceased’s body. According to the autopsy report, each gunshot wound was sufficient by itself to cause death in the ordinary course of nature. 14        The appellant’s wife testified that the appellant had returned to their Bukit Batok flat on 7 March 2003 at about 6.30am. He was perspiring. After sending their youngest son off to school, he sat in the kitchen, smoked a cigarette and ate his breakfast. He appeared to his wife to be disturbed about something. He told his wife he had gone to Batam the previous night and had arrived back in Singapore at about 1.00am on 7 March 2003. He then went to lie down on their bed. At about 8.15am, he left the flat with a white helmet and helmet bag. The appellant’s wife added that they did not have any financial problems during the earlier years of their marriage. From the middle of 2002, however, the appellant had incurred credit card debts and was facing financial difficulties. 15        ASP Halim testified that at about 8.50am on 7 March 2003, he received information that the appellant had been spotted at Bukit Batok Central. He and his team of officers arrived in the vicinity, and saw the appellant leaving the men’s toilet at the Bukit Batok bus interchange. They tailed him. The appellant took a bus to Bukit Gombak and walked towards the NPP. Sergeant Lim Tong Harn (“Sgt Lim”), who was on duty at the NPP, testified that the appellant walked into the NPP at about 9.15am, perspiring and panting. He had paced about carrying a bag, and looked out of the glass door anxiously. He told Sgt Lim that he was being chased. Sgt Lim then realised that the appellant fit the description of the person wanted in connection with the shooting. The appellant asked Sgt Lim for permission to use the telephone and made a phone call to his wife. He then told Sgt Lim, “I confessed to what happened earlier at Panjang. Here are all the things”, and surrendered the bag containing the revolver, seven rounds of ammunition and three cartridges. ASP Halim and his team of CID officers entered the NPP at that point and arrested him. 16        ASP Halim proceeded to interview the appellant at the NPP, and the self-written statement was taken. When the IO arrived, the appellant was brought to the men’s toilet at the Bukit Batok bus interchange and the first statement was taken. At about 12.15pm, the police officers brought the appellant to his flat, where the CCTV videotapes were found. The cup and the ashtray were recovered from the rubbish chute. 17        Dr Tay Ming Kiong, an analyst with the Centre for Forensic Science, Health Sciences Authority, examined the clothes worn by the appellant and the deceased at the time of the shooting incident and found gunshot residue on them. His finding meant that the clothes examined were within one or two metres of the firearm at the time of discharge or were in close contact with things with gunshot residue particles. 18        Another analyst, Vicky Chow Yuen San, found that the gunpowder patterns around the holes in the deceased’s shirt were consistent with those of shots fired from less than a distance of one metre. She was of the opinion that the slugs and the cartridges were fired from the revolver in question. 19        Sergeant Kwek Tze Wei (“Sgt Kwek”) of the Armament and Operations Equipment Division, Police Logistics Department, examined the revolver and found that it was in a fully serviceable condition. In particular, there was nothing faulty with its trigger and its safety mechanism. Importantly (and this will be seen), Sgt Kwek highlighted to the court that a finger pressure of 5.91kg was required to pull the trigger at “double action” while 1.38kg of finger pressure was required at “single action”, where the hammer of the revolver was at a fully cocked position. 20        Dr Tommy Tan (“Dr Tan”), a consultant with the Institute of Mental Health at Woodbridge Hospital, examined the appellant and was of the opinion that the appellant had been suffering from a prolonged depressive reaction for at least a few months. This condition was characterised by a low mood, decreased appetite and poor sleep, and Dr Tan stated in his report that this was caused by the appellant’s financial difficulties. (The appellant had told Dr Tan that he was in debt, to the extent of more than $140,000, to credit card companies and other persons. He had also told Dr Tan that he had been robbed of $35,000 while he was in Batam.) However, Dr Tan also reported that the appellant was not of unsound mind at the time of the shooting incident, as he was aware of what he was doing and that what he did was wrong. His mental state, according to Dr Tan, did not substantially diminish his mental responsibility for the shooting as he had planned it and was fully aware of the consequences if he was arrested. 21        As such, the Prosecution contended that the appellant was liable under s 4 of the Arms Offences Act (Cap 14, 1998 Rev Ed) (“the Act”). Section 4 of the Act provides: (1)        Subject to any exception referred to in Chapter IV of the Penal Code (Cap. 224) which may be applicable (other than section 95), any person who uses or attempts to use any arm shall be guilty of an offence and shall on conviction be punished with death. (2)        In any proceedings for an offence under this section, any person who uses or attempts to use any arm shall, until the contrary is proved, be presumed to have used or attempted to use the arm with the intention to cause physical injury to any person or property. 22        Upon hearing the Prosecution’s evidence, the trial judge found that a case had been made out against the appellant that would warrant his conviction if not rebutted. As such, he called upon the Defence to present its case.",
        "The Defence’s case": "23        The appellant challenged the voluntariness of the four statements at trial. He claimed that the version of events furnished in the four statements was a result of inducements, threats and promises made by the investigating officers during the course of investigations and the statements were thereby inadmissible by virtue of s 122(5) of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“CPC”). 24        The appellant’s version of events was as follows. He had discharged the three rounds unintentionally. He had not gone to the Exchange with the intention to get a gun, but rather, to borrow money from the deceased to alleviate his “money problem”. He had stood the deceased up at an earlier appointment in the afternoon of 6 March 2003, when the deceased was supposed to have lent him $2,000. Knowing that the deceased was on duty at the Exchange, he went there immediately upon arriving in Singapore from Batam that evening without informing the deceased beforehand. The deceased let him into the guardhouse but did not have the cash on him. The appellant, however, remained in the guardhouse as the deceased agreed to withdraw the money for him the next morning. The deceased made the appellant a drink and they soon starting chatting, among other things, about shooting and marksmanship. 25        The appellant claimed that the revolver was not loaded the first time he demonstrated shooting techniques to the deceased: the cylinder of the revolver was opened with no bullets inside its chambers and they both clicked on the trigger many times without harm. The appellant asserted, as such, that he was unaware that the revolver was loaded the second time the deceased handed it to him. He did not check to see if the deceased had loaded the revolver when the deceased went on his patrol duties. The appellant took the revolver and pulled the trigger twice in quick succession to demonstrate the “double-clicking” shooting technique to the deceased. This resulted in the first two shots being discharged, both of which hit the deceased. The deceased exclaimed, “Mail, short circuit”, and tried to stand up when another shot hit him. This third round was supposedly discharged unintentionally when the appellant somehow accidentally pulled the trigger a third time.",
        "The decision below": "26        The trial judge rightly held a trial within a trial to determine the voluntariness of the four statements made by the appellant. He found that the Prosecution had discharged its duty to prove beyond reasonable doubt that all the statements of the appellant were made voluntarily and duly admitted them into evidence. 27        He proceeded to hold that the true version of events was contained in the four statements from the appellant and not in his oral testimony in court. To him, the facts of the case showed clearly that the appellant had fired the first two shots at the deceased with the intent to cause physical injury at the very least. The third shot was undoubtedly fired not only to cause physical injury but death as well. He therefore had no doubt that the appellant was guilty of the offence as charged and sentenced him to the mandatory death penalty contained in s 4(1) of the Act.",
        "The appeal": "28        The appellant raised three questions in his petition of appeal for our determination: (a)        Were the four statements voluntary and rightly admitted into evidence? (b)        Did the trial judge rightly prefer the Prosecution’s version of events? (c)        Did the appellant intend to cause physical injury to the deceased by the shooting? Before us, counsel for the appellant conceded that his client had a challenging case because much of the learned judge’s decision was based on findings of fact. As such, he did not belabour us with lengthy oral submissions. Nevertheless, the severity of the sentence called for our close attention, and we now address each of the appellant’s three questions in turn.",
        "Voluntariness of the appellant’s four statements": "29        The appellant contended that the trial judge erred in admitting the four statements, giving undue weight to the evidence of the Prosecution’s witnesses. 30        The admissibility of statements made to police officers (under ss 121 and 122(6) of the CPC) is governed by s 122(5) of the CPC. This is in identical terms to the test of voluntariness for confessions in general enunciated by s 24 of the EA. The case law on both provisions that we have referred to is, as such, of relevance. Section 122(5) of the CPC provides: Where any person is charged with an offence any statement, whether it amounts to a confession or not or is oral or in writing, made at any time, whether before or after that person is charged and whether in the course of a police investigation or not, by that person to or in the hearing of any police officer of or above the rank of sergeant shall be admissible at his trial in evidence and, if that person tenders himself as a witness, any such statement may be used in cross-examination and for the purpose of impeaching his credit: Provided that the court shall refuse to admit such statement or allow it to be used as aforesaid if the making of the statement appears to the court to have been caused by any inducement, threat or promise having reference to the charge against such person, proceeding from a person in authority and sufficient, in the opinion of the court, to give such person grounds which would appear to him reasonable for supposing that by making it he would gain any advantage or avoid any evil of a temporal nature in reference to the proceedings against him. We now turn to the four statements and the alleged circumstances in which they were taken in greater detail. 31        On 7 March 2003, after the appellant had completed the self-written statement at the NPP, the CID officers brought him to the Bukit Batok bus interchange where he had been spotted earlier. The appellant alleged that while he was in the vehicle headed for the bus interchange, Assistant Superintendent Ng Poh Lai (“ASP Ng”) told him not to tell lies as the government had spent thousands of dollars to send him (ASP Ng) for courses and that he was able to determine if a person was lying. In the men’s toilet at the bus interchange, the appellant alleged that ASP Ng kept asking him to tell the truth even though the appellant had told him it was a misfire. The appellant claimed that he felt disappointed and hopeless since nobody believed him. As a result, he made up the first statement to the IO and put his signature to it. Later that day, the appellant was informed that the deceased had passed away and that he would be facing a murder charge. 32        On 9 March 2003, the IO, Insp Lim, brought the appellant out of the lockup. The appellant alleged that Insp Lim asked him to co-operate with him and to tell the truth. Insp Lim told the appellant that if he co-operated and told him everything, he would speak to the judge and try to get a lesser sentence for the appellant. The appellant claimed that since his self-written statement was not believed he had no choice but to make up a story based on the promise made by Insp Lim. This “made-up story” is the version of events contained in the second, third and fourth statements that we have summarised above. 33        It is the Prosecution’s duty to prove beyond reasonable doubt that the statements made by the appellant were voluntary:Koh Aik Siew v PP[1993] 2 SLR 599,Chai Chien Wei Kelvin v PP([10],supra). It does so by removing reasonable doubt of the existence of the inducement, threat or promise, and not every lurking shadow of influence or remnants of fear:Panya Martmontree v PP[1995] 3 SLR 341. Corollary to this duty is the responsibility on the part of the Prosecution to ensure that the persons who the appellant claimed induced or threatened him are available as witnesses at thevoir direto show these contentions to be untrue:PP v Kadir bin Awang[1989] SLR 214. For instance, the police officer who interrogated the appellant would have to give a detailed account of how the interrogation was conducted, including the times of interrogation, the length or the periods of interrogation and how the accused was treated:PP v Lim Kian Tat[1990] SLR 364. We were fully satisfied that these requirements were fulfilled at the trial below, and that no discrepancies arose from the testimonies of the police officers in charge of the investigation. 34        At the trial within the trial, the Prosecution’s witnesses, including ASP Ng and Insp Lim, consistently maintained that none of the alleged utterances were ever made to the appellant during the course of police investigations; the appellant had been fully co-operative with the police throughout. The trial judge accepted that the Prosecution had discharged its burden and held that there were no such threats or inducements as alleged by the appellant. This was a finding of fact based on an assessment of witnesses’ credibility which we would not disturb unless convinced that such findings were clearly against the weight of evidence:Lim Ah Poh v PP[1992] 1 SLR 713,Ameer Akbar v Abdul Hamid[1997] 1 SLR 113. There was nothing that led us to doubt the veracity of the Prosecution’s witnesses. The appellant did not discharge the burden upon him to show that the trial judge’s assessment of credibility and veracity was plainly wrong:Syed Jafaralsadeg bin Abdul Kadir v PP[1998] 3 SLR 788. As such, we were of the view that none of the alleged inducements, threats or promises were ever made. 35        It was therefore patently clear to us that there was no basis for the appellant to challenge the admissibility of the statements pursuant to s 122(5) of the CPC since nothing in the nature of “any inducement, threat or promise” was ever made to him. The statements could not, as such, have been made as a consequence of any inducement, threat or promise. Any purported inducement, if at all, would have been self-perceived by the appellant, which cannot in law affect the admissibility of a statement:Lu Lai Heng v PP[1994] 2 SLR 251,Chai Chien Wei Kelvin v PP. 36        Even if the alleged utterances were made (and we were of the view that they were not), the four statements would not have been rendered inadmissible as a result. The test of voluntariness was articulated clearly by this court inChai Chien Wei Kelvin v PPat [45]: The test of voluntariness is applied in a manner which is partly objective and partly subjective. The objective limb is satisfied if there is a threat, inducement or promise, and the subjective limb when the threat, inducement or promise operates on the mind of the particular accused through hope of escape or fear of punishment connected with the charge … 37        We considered the appellant’s allegation that ASP Ng had told him not to tell lies as the government had trained him to determine if a person was lying. We also bore in mind the appellant’s allegation that Insp Lim had told the appellant to co-operate with him and to tell the truth, and that if the appellant did so by disclosing everything, Insp Lim would speak to the judge and try to get the appellant a lesser sentence. Whether or not a particular statement imports an inducement, threat or promise should be approached in a common-sense way and in the context of the individual case:Osman bin Din v PP[1995] 2 SLR 129. InOsman bin Din, this court held that it was necessary for the appellant to have reasonable grounds for supposing that he would gain any advantage or avoid any evil of a temporal nature by giving the contested statements. On the particular facts ofOsman bin Din, this court held that there were no such reasonable grounds. The objective part of the voluntariness test was not satisfied and there was therefore no necessity to move on to consider the subjective limb of the test. If the objective limb was satisfied, then the question would have been whether the accused had indeed made the statement as a result of the inducement, threat or promise. Thus, if the accused knew that the inducement, threat or promise was an empty one that could not be carried out, but nevertheless made his statement, the statement would have been voluntary. 38        InPoh Kay Keong v PP[1996] 1 SLR 209, the appellant was charged for the possession of drugs for the purpose of trafficking under s 5(2) of the Misuse of Drugs Act (Cap 185, 1985 Rev Ed). This court found that the police officer made a representation to the appellant that he would not face the death penalty since the appellant’s key could not open the door to the flat where the drugs in question were found and as such, he should give a “good” statement and leave it to the investigating officer who would make out the appropriate charge. This court went on to find that such a statement plainly was an inducement calculated to influence the appellant’s mind with respect to his “escape from the charge” brought against him. The appellant’s confession was therefore inadmissible pursuant to s 24 of the EA. InSharom bin Ahmad v PP[2000] 3 SLR 565, this court consideredPoh Kay Keongand concluded that a promise to procure a reduced charge (from a person in authority) would amount to an obvious inducement to give an inculpatory statement in exchange for a non-capital charge. This is, of course, subject to the second limb of the voluntariness test mentioned above. 39        On the other hand, it is now the law that words to the effect of “you had better tell the truth” or their equivalent do not automatically constitute an inducement, threat or promise vitiating voluntariness:Chai Chien Wei Kelvin v PP. It is clear to us that a police officer can legitimately remind a witness that he should tell the truth and not tell lies:PP v Ramasamy a/l Sebastian[1990] SLR 875,Tang Tuck Wah v PP[1990] SLR 412. Indeed, it is a function of police investigations to ascertain the truth of the matter. An exhortation to tell the truth cannot, objectively or immediately, be taken as an inducement, threat or promise to make a statement relevant or relating to the charge in question in order to gain any advantage or avoid any evil of a temporal nature. The entire circumstances must be examined. 40        In the instant case, words to the effect that the appellant should tell the truth (or not to tell lies) were coupled with the representations that first, the appellant would not be able to tell a lie without detection in any case because of the officer’s training and second, that the officer would speak to the judge and try to get the appellant a lighter sentence if he did. We were of the view that, taken in their alleged context, these words were wholly different from the representation made inPoh Kay Keongto the appellant that a lighter charge would be procured (from one which carried the death penalty) if he made a “good” statement. 41        We felt that the trial judge was correct to hold that: Even if the alleged words had been uttered by ASP Ng or anyone else, I did not think that the accused would have abandoned hope and his senses so completely that he would concoct a story for the investigating officer. It was not his case that the so-called story was suggested to him by any of the officers or that they told him what they wanted to hear from him. InSim Cheng Yong v PP[1994] 1 SLR 722, it was held that merely stating that the accused would be assisted if he co-operated, without more, was not sufficient to satisfy the conditions of the proviso to s 122(5) of the CPC. In this vein, the difference between the alleged inducements inPoh Kay Keongand the present case was the degree of assurance (discernible to the reasonable man) allegedly given to the respective appellants by the police officer involved. InPoh Kay Keongthe appellant was told that hewould not hang, whereas here the appellant was told that the officer wouldtry to get the appellant a lighter sentence. As such, we would apply the approach of the Court of Appeal inOsman bin Dinand hold that the appellant would have had no reasonable grounds for supposing that he would gain any advantage or avoid any evil of a temporal nature by giving the four statements, failing on the objective limb of the voluntariness test. Thus, whether the appellant had subjectively thought that an advantage would have resulted from telling the “truth” did not arise.",
        "The Prosecution’s version of events": "42        The appellant contended that the trial judge erred in law and in fact in finding that the appellant’s version of the shooting incident was “totally illogical and incredible”. We were unable to agree with this contention. 43        It is a trite proposition of law that where the trial judge had to decide which among different versions of events was true, and his findings were not clearly against the weight of evidence, this court will not interfere with his determination:Chua Yong Khiang Melvin v PP[1999] 4 SLR 87. InChua Yong Khiang Melvinat [31], I stated that: There is a sound rationale for this. The trial judge enjoys the advantage of observing the demeanours of the witnesses. In deciding who to believe, he takes into consideration all relevant factors involved, with the advantage of his observations. 44        We noted the following features of the appellant’s version of events at trial: (a)        The appellant had gone to the Exchange immediately after arriving in Singapore from Batam with the hope of borrowing some money from the deceased. (b)        The deceased handed the revolver to the appellant with the cylinder opened and with no bullets inside the chambers in order for the appellant to demonstrate shooting techniques on the first occasion. (c)        The deceased went on his patrol duties at approximately 2.30am with the revolver. The appellant did not see the deceased loading the weapon at any time. (d)        The deceased handed the revolver to the appellant again at about 5.30am for the same reason as before, this time with the cylinder closed. The appellant pointed the revolver at the deceased and pulled the trigger twice, thinking that it was not loaded. It was loaded, and two rounds hit the deceased. (e)        Somehow, the appellant accidentally pulled the trigger a third time and another shot hit the deceased. (f)         The appellant realised that he had misfired and helped the deceased to the ground. He helped the deceased to remove his shoes and turned to see that the deceased had reloaded the revolver. The appellant then went to get some water for the deceased and returned to find him motionless. (g)        Thinking the deceased had died, the appellant tookthe deceased’s bullet pouch of five rounds, the revolver,a cup, the ashtray and the CCTV videotapes. The appellant testified that he had taken the revolver for “safety reason” and the other items “not for a purpose”. He “just took whatever were in front of [him], during that moment of pressed and under tension”. He also took $7 from the deceased’s wallet for the taxi fare home. (h)        The appellant then left for home in a confused state of mind with all those items. At his flat in Bukit Batok, the appellant placed the CCTV videotapes in the storeroom and kept the revolver and the bullets in a drawer in the master bedroom. His intention at that time was to return the revolver. He also threw the ashtray and the cup into the rubbish chute without knowing why. 45        It was evident to us that there were many inherent improbabilities in the appellant’s version of events such that the trial judge was fully entitled to find it “totally illogical and incredible”. We were of one mind with him in his evaluation of the appellant’s version. The trial judge had highlighted these improbabilities in the appellant’s version in his grounds of decision, and they were as follows: (a)        The deceased was on official duty at a guard post and the revolver could not have been unloaded to begin with. The appellant himself had testified that, according to CISCO procedures, the “loading and unloading of bullets must be done at the CISCO station” prior to the assumption of guard duty. (b)        If the deceased later decided to load the weapon, as the appellant claimed he did, he would surely have informed the appellant about it when handing it to him. He would not have allowed the appellant to handle a loaded weapon in the knowledge that the appellant was going to demonstrate shooting techniques by pulling the trigger. (c)        The appellant had been a CISCO officer for about ten years and was a marksman adept at handling revolvers. He would have immediately realised that two live rounds had been discharged from the revolver from the noise and the resultant recoil even if he genuinely thought that it was unloaded when squeezing the trigger the first two times. (d)        A normal reaction thereafter would have been to drop the revolver in shock. Instead the appellant had held onto the revolver firmly and pulled the trigger a third time. The appellant, significantly, had never misfired a revolver once during his ten years in CISCO. (e)        The appellant’s evidence about wanting a loan from the deceased was mentioned for the first time during his testimony in court. The trial judge held that this was concocted to give the impression that the appellant had a legitimate reason for visiting the deceased so late at night immediately after returning from Batam. (f)         The appellant’s story about the deceased having reloaded the revolver was bizarre. The deceased would have been unable to do so after being shot thrice. (g)        The appellant claimed that he was confused after the “accidental” shooting but was able to remove all the things that he thought could have pointed to his presence at the Exchange in a cool-headed and calculated way. (h)        If the shooting was in fact an accident, the appellant would have sought medical attention for the deceased immediately. If he believed that the deceased had died, he would still have called for the police since a firearm and live bullets were involved. However, neither course of action occurred to him “at all” and he took the dying man’s money for his taxi fare home instead. (i)         At home, he behaved as if nothing had happened and had the presence of mind to keep the CCTV videotapes in the storeroom and to get rid of the cup and the ashtray. 46        We did not hesitate affirming the trial judge’s preference for the Prosecution’s version of events to that of the appellant’s at trial. The Prosecution’s version was gleaned from the four voluntary confessional statements made by the appellant, and the trial judge had rightly adverted to a sense of detail, coherence and consistency in the four statements unlikely to be present in a fictitious version of events. We now turn to deal with the last question on the appellant’s intention to cause physical injury in the context of s 4 of the Act.",
        "Intention to cause physical injury": "47        In preferring the Prosecution’s version of events, the trial judge had rejected the appellant’s assertion that he had fired the three shots without the intention to cause the deceased any physical injury. The appellant’s contention in relation to the first two shots was that he had not known that the revolver was loaded when he pulled the trigger. In relation to the third shot, he claimed that he had misfired the gun accidentally. The trial judge rejected these contentions and held that: The facts of this case did not even require the application of the presumption in section 4(2) of the Arms Offences Act. The facts showed clearly that the accused fired the first two shots at Rahim with intent to cause physical injury to him at the very least. The third shot was undoubtedly fired not only to cause physical injury but death as well. 48        In this, we felt that the trial judge had adopted an incorrect method of analysis of the operation of the presumption of intention to cause physical injury under s 4(2) of the Act. Section 4(1) of the Act provides that any person who uses or attempts to use any arm (including a firearm such as the revolver) “shall be guilty of an offence and shall on conviction be punished with death”. The definition of “use” includes an “intent to cause physical injury to any person” under s 2 of the Act. Section 4(2) of the Act provides that any person who uses or attempts to use any arm is presumed, until the contrary is proved, to have intended to cause physical injury to a person or to property. 49        The trial judge, in stating that the facts of the present case did not evenrequirethe application of the presumption, presupposed that he could choose whether or not to apply the presumption in s 4(2) of the Act. It was our understanding of the 1993 amendment to the Act (introducing the section) that the presumption was meant to beautomaticand comes into operation the moment a person uses or attempts to use any arm. It was apparent to us that the parliamentary intention underlying the amendment was that punishment for such offences should not be made dependent on an accused’s state of mind due to the extreme gravity of arms offences. The Minister, during the relevant parliamentary debates, had recognised that this presumption “almost brings the law to that of strict liability”, but he made “no apologies for it”. 50        It was therefore important to recognise the precise manner of operation of the presumption even though the trial judge had ultimately found the existence of an intention to cause physical injury on the part of the appellant. The correct approach was adopted by this court inTay Chin Wah v PP[2001] 3 SLR 27, where the presumption in s 4(2) of the Act was held to bereinforcedby the evidence before the court rather thannotapplied. 51        It was noteworthy that the operation of s 4 of the Act is subject to the general exceptions contained in Chapter IV of the Penal Code (Cap 224, 1985 Rev Ed) (“PC”). This includes s 80 of the PC, which provides that nothing is an offence that is done by accidentin the doing of a lawful act. If made out, the defence of accident would have provided the appellant with a complete defence. This defence was however not available to the appellant since he did not possess a valid licence for the revolver at the material time and instantly failed the “lawful act” requirement. We felt that the distinction between the appellant’s assertion that he fired the revolver “accidentally” and thegeneral defenceof accident was not fully appreciated by the trial judge below. The appellant’s assertion was to the effect that he did not intend to cause physical injury to the deceased when he discharged the live rounds from the revolver. The trial judge, however, thought that the appellant was attempting to rely on the general defence of accident. 52        In order to succeed on the third limb of the appeal and rebut the presumption in s 4(2) of the Act, the appellant had the burden to produce sufficient evidence to prove that he discharged the three rounds from the revolverwithoutthe intention to cause physical injury to the deceased:Tay Chin Wah. It was not for the Prosecution to prove that the appellant had intended to cause physical injury to the deceased. 53        InTay Chin Wah, the Court of Appeal held that the appellant’s bare denial of possessing the requisite intention was far from sufficient to rebut the statutory presumption in s 4(2) of the Act. Indeed, the evidence before the court inTay Chin Wahreinforced the presumption that the appellant had intended to cause physical injury to the victims. We would say the same for the present appeal. The evidence pointed clearly to the appellant’s knowledge that the revolver was loaded. He had been a CISCO guard for ten years and was a marksman. He was fully conversant with the safety regulations and was likely to have checked whether the revolver was loaded when he took it from the deceased. Indeed, at trial, the appellant was able to tell just from looking at a photograph of the revolver whether it was loaded. To us, his explanation that the lighting was poor and that he was sleepy at the time rang hollow in light of the fact that he was alert enough to demonstrate shooting techniques to the deceased. It was in the evidence that whenever the revolver was fired, it would recoil upward and backward by approximately 10cm. Even if the appellant had unintentionally fired the first round from the revolver, the resultant recoil and sound from firing the first shot would have alerted him to the fact that a live round had been fired. 54        The triggering mechanism for the discharge of a round from the revolver also pointed to the appellant’s culpability. Rounds are fired from the revolver by “single action” or “double action”. “Single action” firing involves cocking the hammerbeforepulling the trigger to discharge one round. “Double action” firing does not involve cocking the hammer of the revolver, and it is “to pull the trigger backwards until the end of the action”, upon which the mechanism will disengage and the hammer will throw itself forward in order to discharge a round. (It was not possible for two bullets to be discharged, one after the other, with a single pull of the trigger as the revolver was not an automatic or semi-automatic weapon.) Double action firing requires a great deal more force than single action firing. The exact finger pressure, as we mentioned earlier, required on the trigger of the revolver for double action firing is 5.91kg and 1.38kg for single action firing. The appellant testified that he had not cocked the hammer of the revolver for all three rounds discharged. On this testimony, double action firing would therefore have been required and the corresponding amount of finger pressure reinforced our conclusion that it was highly unlikely that any round was accidentally discharged at all. It struck us with particular force, considering all these, that the appellant had never misfired a single round during his decade of service with CISCO and that he was fully aware that firing live rounds from a revolver at a person could have fatal consequences.",
        "Conclusion": "55        For all the reasons above, there was no reasonable doubt in our minds that the appellant was guilty of the offence as charged. He had used the revolver and the law presumed that he had intended to cause physical injury. He failed to rebut the presumption, which was fully reinforced by the evidence before us. The legislative rationale underlying the presumption and accompanying mandatory death penalty in s 4 of the Act was articulated by the Minister during the debates in Parliament on the 1993 amendment to the Act, and we found his following words particularly pertinent when we dismissed the appeal and affirmed the sentence of death passed: The punishment for such offences should not be made dependent on an accused’s intention. A firearm is, as we all know, a very lethal weapon, and when fired, it can cause death or injury even to innocent bystanders in the vicinity, whatever the intention of the accused may be. Therefore, arms and firearms must be distinguished from other weapons like knives, parangs and so on. Not only to innocent bystanders but the discharge of a firearm has a tremendous effect of causing alarm on the population. Sir, crimes of violence of this kind must be strongly deterred and suppressed. In particular, the unlawful use of arms must not be condoned. Otherwise, it will lead to greater use of arms for unlawful purposes in Singapore and we will face the experience of many other countries in this regard. Peace and good order, which we value so much in Singapore, will be threatened. Appeal dismissed."
    }
}