{
    "case_title": "Teo Yeow Chuah v Public Prosecutor",
    "ncitation": "[2004] SGCA 17",
    "coram": "Chao Hick Tin JA; \n      MPH Rubin J; \n      Yong Pung How CJ",
    "sections": {
        "Prosecution evidence": "2          Teo was arrested on 29 January 2003 by officers from the Central Narcotics Bureau (“CNB”) at the staircase of a multi-storey car park at Block 10 Everton Road/Cantonment Close (the “multi-storey car park”). Prior to his arrest, the CNB officers had conducted surveillance on Teo following information that Teo and one Lee Siong Lim (“Ah Siong”) knew each other and that drugs were stored at Fragrance Court, a four-storey apartment block. 3          Teo was searched and several items, including a bunch of six keys, a “Marlboro” cigarette box containing a sachet of heroin, a rolled-up piece of paper and a piece of tin foil, were found on him. Upon questioning by Station Inspector Ang Oon Tho (“SI Ang”), Teo admitted that he had kept drugs at the driver’s door of vehicle number SBR4X, a gold-coloured BMW, that he had parked at the multi-storey car park. The vehicle was searched and ten sachets of heroin wrapped in paper and an “Elsema” remote control were recovered. Teo informed SI Ang that the remote control was for the opening of the main gate of Fragrance Court. 4          The CNB officers escorted Teo to unit #04-01 of Fragrance Court (“the apartment”), where Teo had rented a bedroom on the second floor (“the bedroom”). On entering the apartment, SI Ang asked Teo whether there were any drugs in the bedroom. Teo denied this. SI Ang conducted a search of the bedroom and found several items in a wardrobe, a drawer beneath the platform bed and on the floor. These items were a white plastic bag containing some empty sachets, a red plastic bag containing some rubber gloves, an empty sealer box, a plastic container, a spoon believed to be stained with heroin and a “Ghostbusters” magazine with several missing pages. 5          Thereafter, SI Ang climbed out of the bedroom through an unlocked window that led to the rooftop of Fragrance Court. He searched the rooftop and found a knotted black plastic bag behind a pillar at one end of the rooftop. The plastic bag contained a black “Oakley” sports bag (“the Oakley bag”) that had its zip secured with a padlock. SI Ang brought the plastic bag together with the Oakley bag into the bedroom and showed them to Teo. Teo admitted that the Oakley bag belonged to him. SI Ang then asked Teo for the key to the padlock securing the zip of the Oakley bag. Teo informed SI Ang that the key was among the bunch of six keys recovered from him earlier. 6          When unlocked, the Oakley bag was found to contain the following items: Main compartment (a)        A bundle of substance wrapped in paper. The substance was believed to be heroin. (b)        A “Soda” brand plastic bag containing two bundles of substance wrapped in paper. The substance was believed to contain heroin. (c)        An “M1” brand paper bag containing: (i)         Eight packets, each containing ten sachets of substance wrapped in paper from a “Ghostbusters” magazine. The substance was believed to be heroin. (ii)        One packet containing nine sachets of substance wrapped in paper from a “Ghostbusters” magazine. The substance was believed to be heroin. (d)        A white plastic bag containing: (i)         A brown envelope containing a weighing scale. (ii)        A black plastic bag containing a second weighing scale. (iii)       A blue-coloured bag containing a third weighing scale. (e)        A sealer. Side pocket (f)         A metal spoon. (g)        A pincer. (h)        A cutter. (i)         Some empty sachets. (j)         Some empty plastic bags. (k)        A roll of scotch tape. (l)         A plastic container. (m)       A pair of pliers. (n)        A blade. (o)        A white envelope containing three yellow and one blue tablet believed to be “Ecstasy”. 7          SI Ang questioned Teo as to the ownership of the drugs and items found in the Oakley bag. Teo admitted that all the drugs and items belonged to him. At about 8.00pm, SI Ang asked Teo further questions in the Mandarin language. The questions and answers were recorded in SI Ang’s pocket book in Chinese script with an English translation. The significant questions and answers were found at questions 4 to 6. They are reproduced below: Q4:       All the “Peh Hoon” [“white powder”] found inside the bedroom belong to whom A4:       Mine Q5:       How much “Peh Hoon” are there A5:       About 4 bundle Q6:       All the “Peh Hoon” is for what purpose A6:       For selling 8          There was an objection from the Defence as to the admissibility of Teo’s purported answers to questions 4 and 6. It was contended by the Defence that Teo’s said answers were not voluntary and they were given as a result of threats and intimidation from SI Ang. Consequently, a trial within a trial was held by the trial judge to determine the admissibility of the said answers. In the end, after reviewing all the evidence tendered at the trial within a trial including a few unsatisfactory aspects in the evidence of SI Ang, the said answers were admitted in evidence by the trial judge as being voluntarily made without any threat, inducement or promise. It should be presently mentioned that Teo was represented at all times at the trial by a briefed counsel. Apart from the objection raised in relation to the statement recorded by SI Ang mentioned here, neither Teo nor his counsel raised any objection to the admissibility of the other statements recorded from the accused which the Prosecution sought to admit. 9          The items in the Oakley bag were sent for analysis, and in the event, it was established that (a) the two bundles of substance in the “Soda” brand plastic bag contained diamorphine and (b) the nine packets in the “M1” brand paper bag in turn contained a total of 89 sachets of diamorphine. In all, the diamorphine content and weight of the substance found in these two bundles (or big packets, as referred to in the charge) and 89 sachets was 55.29g. 10        On 30 January 2003, the Investigating Officer, Inspector Abdul Halim bin Abdul Rahman, (“IO Halim”), together with the help of interpreter Tan Chee Leong (“the interpreter”), read to Teo a charge of trafficking in diamorphine under the Misuse of Drugs Act (Cap 185, 2001 Rev Ed) (“MDA”) and the notice of warning under s 122(6) of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“CPC”) (collectively “the s 122(6) charge”). Teo acknowledged that he understood the s 122(6) charge and appended his signature accordingly. Teo’s statement in reference to the s 122(6) charge was “I have nothing to say in relation to the charge”. 11        Teo then provided three long statements, which were recorded in narrative form by IO Halim. Two long statements were given on 5 February 2003 and the third, on 8 February 2003. In the first two long statements, Teo confirmed that he was the one who put the drugs inside the Oakley bag, used a small padlock to lock it and placed the Oakley bag at the rooftop. The statements also elaborated on how Teo came to rent the bedroom in order to have more privacy, since he was involved in illegal drug activities. The third long statement established that Teo only went to the bedroom to pack or store heroin (the street name for diamorphine) and that he never brought any friend there apart from Ah Siong, who had come to visit Teo on the eve of his arrest.",
        "The defence": "12        In the event, the trial judge, having been satisfied that the Prosecution had established aprima faciecase, called for the defence of Teo. He elected to give evidence in his defence from the witness box. In his testimony, he admitted that the drugs found on his person and in SBR4X were for his own consumption and for sale to his friends when they required them. However, he claimed that although the Oakley bag belonged to him, he had not placed the drugs in it. He said that one Eric, a Malaysian friend of his, had schemed and used the bedroom and the Oakley bag to pack his own drugs. Teo added that Eric had asked him to keep three keys for him, one of which managed to open the padlock of the Oakley bag. Teo also claimed that after his arrest, he had requested his elder brother to contact Eric, though he did not inform his brother of the reason behind this request. 13        Additionally, Teo repeated his earlier claim that his answers to questions 4 and 6 of SI Ang’s list of questions were the result of threat or inducement. Teo further claimed that this threat or inducement had been on his mind when he gave the three self-implicating long statements. He added that most of the first and the second long statements and part of the third were untrue and fabricated. This was despite the fact that all three long statements were read back to Teo, whereupon he declined to make any corrections, deletions or amendments to them. Teo claimed that he was not paying attention when the first long statement was read back to him because he had been suffering from withdrawal symptoms and was feeling cold. He also claimed that he was not told that he would be facing the death penalty when the charge was read to him. 14        He added that since he thought that he was facing merely an ordinary trafficking case, he was prepared to admit to the drugs found in the Oakley bag. If not, he believed his family and his girlfriend would be charged. He further claimed that it took more than three hours to record the first long statement because he needed to fabricate his story. 15        As regards the second long statement, he said that paras 15 and 16 of the statement, where he had detailed how he had packed the heroin for sale, had been fabricated by him. A similar disclaimer was made in relation to his third long statement.",
        "Decision below": "16        The trial judge, after reviewing all the evidence in its entirety, concluded that the suggestion by the Defence that Eric was the real culprit, and that the accused had nothing to do with the drugs found in the Oakley bag, could not have been the truth. Furthermore, if Eric was the real owner of that bag, the accused would have mentioned it at the very outset when he gave his cautioned statement. The trial judge also found that the statements given by the accused were voluntary and they contained what was actually narrated by the accused to the recording officers. In the concluding paragraphs of his grounds of decision, the trial judge said ([2003] SGHC 306at [152] and [153]): In the circumstances, I found that the accused had failed to discharge the presumption under s 18 [of the MDA], and the consequent presumption under s 17 applied. I add that, in my view, the prosecution would have proved its case beyond a reasonable doubt even without the aid of the presumptions in the light of the overwhelming evidence against the accused. Accordingly, I convicted the accused on the charge and sentenced him according to the law.",
        "The appeal": "17        In the petition of appeal filed on behalf of the appellant, it was contended on his behalf that the trial judge had erred in: (a)        wrongly admitting into evidence the statement made by Teo to SI Ang at about 8.00pm on 29 January 2003; (b)        failing to find that the CNB had failed to adhere to the fundamental principles of investigation; (c)        failing to appreciate that SI Ang’s threat(s) or promise(s) were operative on Teo’s mind during the recording of the long statements; (d)        failing to appreciate that Teo might not have been fully apprised of the possibility that he was facing the death penalty; (e)        failing to convene avoir direto determine the admissibility of the long statements; and (f)         relying on evidence adduced in thevoir direat the trial.",
        "Long statements": "18        The first main point argued by counsel for Teo on appeal was that although avoir dire, or trial within a trial, was conducted by the trial judge in relation to the oral statement given by Teo, shortly after his arrest, and recorded by SI Ang in his pocket book, the long statements recorded from the accused subsequently were not subjected to any suchvoir dire, when there was indication that the long statements were not voluntary. Relying on certain observations by the Federal Court of Malaysia inLee Weng Sang v PP[1978] 1 MLJ 168, counsel for Teo contended that even if the Defence had failed to indicate any objection to the admissibility of statements, avoir diremust still be convened, if the accused was effectively found to be taking an objection as to their admissibility. 19        Reviewing the trial records, it became apparent to us that Teo’s counsel, who took an issue with the voluntariness of the statement recorded by SI Ang soon after Teo was apprehended, did not raise any objection to the admissibility of any other statements. Even when Teo was giving evidence in his defence, the points raised by him were not in relation to voluntariness of his other statements. What he claimed was that the incriminating parts of the long statements were fabricated by him. This claim was, in the event, rejected by the trial judge. It would be useful at this stage to recall what was observed by the Federal Court of Malaysia (perChong Min Tat FJ) inLee Weng Sangat 171. He said: We feel obliged to say that it is the clear duty of counsel to indicate to the trial court his objection to the admission of any statement by an accused if on the instructions given to him, the statement was unlawfully induced or obtained and that the proper time to do this would be when the prosecution seeks to introduce the statement. … We are of the view that notwithstanding the failure to challenge it directly but in view of the nature of the cross-examination of [the police witnesses], a trial within a trial should have been held to determine the admissibility or otherwise of the first cautioned statement. 20        We are in agreement with the views expressed by the Federal Court inLee Weng Sangand add for our part that before any statement by the accused tending to implicate the accused with any wrongdoing was admitted in evidence, the court should be satisfied beyond a reasonable doubt that the statement given by the accused was made voluntarily without any threat, inducement, promise or any form of oppression. However, in Teo’s case, not only was there no objection from counsel for Teo as to the voluntariness of the long statements, but there was also nothing in the records to suggest that the voluntariness of the statements was ever put in issue. In the circumstances, we found the argument by Teo’s counsel that the court ought to have conducted a trial within a trial for the said long statements to be baseless.",
        "Oral statement": "21        The next main contention advanced on behalf of Teo by his counsel was that that the oral statement recorded by SI Ang , shortly after the arrest of Teo, was wrongly admitted. Counsel for Teo argued that the trial judge was wrong in finding that SI Ang had not made any threat, inducement or promise in threatening to charge Teo’s family and girlfriend. Counsel further contended that the production and identification of Ah Siong must have operated as a threat on Teo’s mind at the time the statement was recorded. It is a well-established principle of law that the court must be satisfied beyond a reasonable doubt that the statement of the accused that was sought to be admitted in evidence was given voluntarily without any threat, inducement, promise or any form of oppressive conduct or coercion. In relation to the present contention, having revisited the records, we were satisfied that the trial judge had not erred in his evaluation of the evidence tendered at the trial within a trial both by the Prosecution and Teo. In the circumstances, we also found Teo’s arguments to be equally without any merit.",
        "Use of voir dire evidence at the main trial": "22        Another point argued on behalf of Teo was that the trial judge was in error when he used the evidence adduced at thevoir direfor the purposes of the main trial. Counsel for Teo invited our attention to a decision by the Singapore Court of Criminal Appeal inLim Seng Chuan v PP[1975–1977] SLR 136 at 142, [22], where it was observed: It seems to us that fairness to the accused, which is a fundamental principle of the administration of criminal justice, requires that a trial within a trial ought to be considered a separate or collateral proceeding. In the course of a trial within a trial evidence may be given which would be inadmissible evidence on the charge against the accused but may be relevant on the issue to be decided at the trial within a trial. In such a situation it would be grossly unfair to the accused if the true principle is that evidence called at a trial within a trial is before the court for all purposes. 23        InWong Kam-ming v The Queen[1979] 1 All ER 939, the Privy Council held that whether the accused’s statement was excluded or admitted on thevoir dire, the Crown was not entitled as part of its case on the general issue to adduce evidence of the testimony given by the accused on thevoir dire. However, where a statement is admitted as voluntary on thevoir direand the accused, in giving evidence on the general issue, gives evidence as to the reliability of the admissions in the statement, and in so doing departs materially from his testimony on thevoir dire, cross-examination on the discrepancies between his testimony on thevoir direand his evidence on the general issue is permissible, for then his statements in evidence on thevoir direstand on the same basis as, for example, evidence by the accused in a previous trial. 24        In the case at hand, it would appear from the records[1]that counsel for the accused himself had expressed a view that it would be prudent to use the evidence adduced at the trial within a trial for the purposes of the main trial. Given the unconditional express approval by counsel and the fact that the two short answers given by the accused to SI Ang had been admitted in evidence as being made voluntarily, we could find nothing in the proceedings below that seemed to suggest that the use of the evidence at thevoir direat the main trial occasioned any miscarriage of justice. We hasten to add, however, that trial judges, as a matter of law and practice, should avoid using the evidence adduced at the trial within a trial for the purposes of the main trial, except as pointed out by the Privy Council inWong Kam-ming.",
        "Failure by CNB to send the seized bag for fingerprint analysis": "25        Another argument raised by Teo’s counsel in his petition appeal was that the omission by the CNB to send the seized Oakley bag for fingerprint analysis amounted to a break in the chain of evidence. We found this argument to be wholly disingenuous in view of a clear admission by Teo that the said bag belonged to him. In our view, even if the fingerprints of others were to be found on the bag, that aspect alone would not have broken the chain of evidence, as was being suggested by Teo’s counsel in the petition of appeal. The issue as to whether there was any requirement on the part of the authorities to send the relevant incriminating exhibits for fingerprint analysis was considered by the Court of Appeal inOsman bin Din v PP[1995] 2 SLR 129. 26        InOsman bin Din, the appeal was brought against conviction on a charge of trafficking in 9,504g of cannabis. The appellant was found to have been in possession of a bag containing the drugs. A fingerprint examination was undertaken on the contents of the bag which were compressed blocks of cannabis. However, the examination was negative, in that no prints were lifted. The bag which contained the offending substance was, however, not dusted for fingerprints. 27        It was contended on behalf of the appellant inOsman bin Dinthat the fact that there were no prints to implicate him supported his defence that the drugs did not belong to him and that he did not know the contents of the bag. The court rejected this argument and held that there was no primary or statutory obligation on the part of the authorities to undertake a fingerprint examination, particularly in a case where the appellant was apprehended with the offending substance. The court further held that in any event, within the statutory framework of the Misuse of Drugs Act (Cap 185, 1985 Rev Ed), once possession wasprima facieestablished, it was for the accused person to explain how he came into possession of the drugs. 28        We reaffirm the views of this court inOsman bin Din. Returning to the present appeal, having regard to the fact that Teo had openly admitted to the ownership of the seized bag, we found the argument that the CNB had failed to adhere to the fundamental principles of investigation to be plainly unsustainable.",
        "The punishment of death penalty not brought to the attention of the accused": "29        The next ground of appeal was that the trial judge had failed to appreciate that Teo might not have been fully appraised of the peril of death penalty when his statements were being recorded by the investigating officer. In addressing the same point raised before him, the trial judge said at [131] of his grounds: The accused himself admitted at trial that he knew that trafficking above a certain weight of diamorphine would carry the death penalty, although he said he did not know what the threshold was (NE 827). He said that he was aware that the s 122(6) charge pertained to 1973.42 grams of diamorphine and he was shocked. Yet he thought it was an ordinary trafficking case (NE 707, 708 and 728). Although he wondered what the penalty was, he did not ask how long a jail sentence he would serve as he was not feeling well (NE 829). It seemed to me that if the accused did not know what the threshold was, he had no basis for thinking that this was an ordinary trafficking case especially given that he had repeatedly asserted he had been shocked at the heavy weight of 1973.42 grams. I did not accept that the accused was the simpleton that he had portrayed himself to be. True, he did not have a high formal education but he was street-smart, having had to fend for himself from a young age. As I have elaborated, he was even able to present arguments for himself while he was on the witness stand. Accordingly, I found that the accused knew that he was facing a capital charge at the time when his s 122(6) statement was given, and also when his long statements were given. 30        The finding by the trial judge that Teo was fully aware of the penalty he was facing was based on evidence before him and we saw no reason to disturb this. In any event, it was clear from the records that the charge and the notice of warning in due form, as prescribed under s 122 (6) of the CPC, were served on the accused. The charge ended with the words, “you have thereby committed an offence under Section 5(1)(a) read with Section 5(2) of the [MDA] and punishable under Section 33 of the [MDA]”. The records also showed that the accused had confirmed by appending his signature to the charge that the nature and consequence of the charge was explained to him in Hokkien by an interpreter. In the circumstances, the contention that the punishment of death penalty was not brought to the attention of the accused was without merit.",
        "Application of s 18 and 17 of the MDA": "31        There was one other point that required our consideration in this appeal. The trial judge, in the concluding part of his grounds, said that he “found that the accused had failed to discharge the presumption under s 18 [of the MDA] and the consequent presumption under s 17 applied”. He added, however, that in his view, there was overwhelming evidence to find the accused guilty of the charge even without the aid of the presumptions. 32        Section 18 of the MDA provides: 18.—(1) Any person who is proved to have had in his possession or custody or under his control — (a)        anything containing a controlled drug; (b)        the keys of anything containing a controlled drug; (c)        the keys of any place or premises or any part thereof in which a controlled drug is found; or (d)        …, shall, until the contrary is proved, be presumed to have had that drug in his possession. (2)        Any person who is proved or presumed to have had a controlled drug in his possession shall, until the contrary is proved, be presumed to have known the nature of that drug. (3)        … (4)        … 33        Section 17(c) of the MDA provides: Any person who is proved to have had in his possession more than 2 grammes of diamorphine, whether or not contained in any substance, extract, preparation or mixture shall be presumed to have had that drug in possession for the purpose of trafficking unless it is proved that his possession of that drug was not for that purpose. 34        In our view, the presumption under s 17 cannot be triggered by the operation of a presumption under s 18. The presumption of trafficking under s 17 was to apply only where a person wasprovedto have had in his possession the requisite amount of the prohibited drug, and not justpresumedto have had that drug in his possession. This view was expressed by this court inLow Kok Wai v PP[1994] 1 SLR 676at 683, [36] and [37] in the following terms: It seems to us clear that in the Act “proof” is different from “presumption”. This is apparent from s 18. Subsection (1) of s 18 provides that “any person who is proved to have had in his possession … any keys of anything containing a controlled drug … shall … be presumed to have had that drug in his possession”. Subsection (2) of s 18 provides that “any person who isproved or presumedto have had a controlled drug in his possession shall … be presumed to have known the nature of that drug”. The earlier version of s 17 (pre-15 February 1990) included the words “or presumed”. By omitting those two words in the later version, Parliament must have intended that the presumption of trafficking in s 17 was only to apply where a person was proved to be in possession of a controlled drug and not merely presumed to be in possession of a controlled drug. If Parliament had intended s 17 to also apply to the situation of “presumed” possession, then it would not have deleted those two words. It is a rule of construction that a word in a statute must bear the same meaning unless the context clearly otherwise requires. The word “proved” must bear the same meaning in s 17 as in s 18. In our judgment, Parliament, by deleting the words ‘or presumed’, had shown abundantly that it did not intend to create a situation of triple presumption, namely, by linking ss 18(1), 18(2) and 17. 35        Later, inLim Lye Huat Benny v PP[1996] 1 SLR 253at 260, [17], this court re-iterated that it was settled law that the presumption under s 17 only arose where possession of the drugs (not mere physical possession) had been proved. 36        Although there was an error as to the correct application of the presumptions under ss 18 and 17 of the MDA in the decision by the trial judge, there was, as stated by the trial judge, overwhelming evidence to conclude that Teo was in possession of the drugs seized for the purposes of trafficking in them. Having reviewed the evidence in its totality, we too were satisfied that there was ample evidence to find Teo guilty of the charge against him, without resorting to any of the presumptions under ss 18 and 17 of the MDA. 37        Having considered all the arguments presented and the grounds appearing in Teo’s petition of appeal, we were satisfied that the Prosecution had indeed discharged its ultimate burden of proving its case against Teo beyond reasonable doubt. 38        Accordingly, for the reasons given above, we dismissed the appeal. Appeal dismissed. [1]Notes of evidence p 454 and 693"
    }
}