{
    "case_title": "Compaq Computer Asia Pte Ltd v Computer Interface (S) Pte Ltd",
    "ncitation": "[2004] SGCA 23",
    "coram": "Chao Hick Tin JA; \n      Judith Prakash J; \n      Yong Pung How CJ",
    "sections": {
        "The background": "2          The facts leading to the issue of the letter are of some importance to a better understanding of the construction point and we shall allude to them in some detail. Reuters Singapore (“RS”), whose parent company is in London, is in the business of providing international news and financial information to subscribers (“customers”) through television terminals installed at customers’ premises. Before 1993, RS had a technical division which provided services relating to the installation, servicing and maintenance of hardware and software (“field services”) at the customers’ premises. In 1993, RS decided to outsource the provision of such field services and close down its technical division. Some employees from that division left RS to form the respondent company, CIS, to provide the field services to the customers of RS. At the time, RS held 25% of the issued shares in CIS. From then on, under successive periodic contracts with RS, CIS provided field services to RS’s customers. 3          In December 1999, RS notified CIS that upon the expiry of the then current term,ie30 June 2000, and pursuant to directions from its parent company, RS would be subcontracting the provision of the field services by competitive bidding. The contract would be for a three-year period. To maintain impartiality in the bidding process, RS withdrew from CIS and sold its CIS shares back to CIS. 4          Pursuant to the new system, five companies were invited by RS to tender for the field services, namely, IBM, Siemens, Gentronics, Compaq and CIS. 5          At the same time, in view of the change in the system of awarding contract for the field services, RS was anxious that the services to be provided to its customers should not in any circumstances be disrupted. To ensure that, RS requested the other four companies to explore the possibility of working with CIS in providing the services. Compaq was amenable to the suggestion and its director, one Mr Lawrence Mok (“Mok”), got in touch with the managing director of CIS, Mr Bala Supramaniam (“Supramaniam”). However, the discussion did not lead to any concrete result, leaving the two parties to submit their separate bids for the contract. 6          As it turned out, the bids of Compaq and CIS were the two lowest. Even so, RS thought that their bids were still high and they were asked to review the matter and submit fresh bids. They duly complied. Eventually Compaq’s bid was the lower of the two. However, the managing director of RS, Mr Dennis Lim (“Lim”), was still uncomfortable in awarding the contract to Compaq. He wanted to be sure that the services provided to customers would not be compromised. A presentation was made by Compaq. There, one of the proposals of Compaq was that it would provide the field services in conjunction with CIS. This proposal was acceptable to RS. On 18 May 2000, RS issued to Compaq a conditional letter of intent and some of the conditions were: (a)        Compaq would, within five working days (19–25 May 2000), finalise the Compaq/CIS partnership; (b)        Compaq would, by 26 May 2000, furnish RS with a document signed by CIS detailing the partnership arrangement with CIS; (c)        A meeting between RS, Compaq and CIS would be held no later than 29 May 2000. 7          During the period of the said five days, Compaq and CIS worked hard towards achieving an arrangement. By 26 May 2000, they signed a memorandum of understanding (“MOU”) under which it was envisaged that CIS would be a sub-contractor, not a partner, of Compaq in the provision of the field services. It is important to note a few matters in the MOU. First, recital 4 stated that: Formal services sub-contract arrangement will be entered into between CIS and Compaq within a … period of time which shall not be more than 30 days from the date of signing this MOU. Second, cl 1 of Attachment A to the MOU stated that: A subcontract agreement will be entered into with CIS for providing services of installation and maintenance. The terms and conditions will be back to back depending on [RS’s] agreement with Compaq …” Third, cl 5 of Attachment A stated that “[t]he subcontract agreement will run for 3 years” but it could be cancelled for cause. 8          On 29 May 2000, a meeting of the three parties was held at RS’s office. Lim was pleased with the terms of the MOU, as it provided for a back-to-back agreement with CIS for the provision of the field services and thus assured him that the level of service to be provided to the customers of RS would be maintained. However, as Supramaniam was not present at the meeting, another meeting was held several days later when Supramaniam confirmed that he would support Compaq in providing the services. Upon such confirmation, Lim informed Compaq that its tender was accepted. However, the formal contract between RS and Compaq was only signed on 13 July 2000. 9          Contrary to what was envisaged in the MOU, a written agreement could not be concluded and signed between Compaq and CIS by 30 June 2000. Instead, on that day, Compaq issued to CIS a letter of award (“LOA”) which enclosed various schedules setting out the services to be rendered and the charges payable. These schedules were taken essentially from the tender documents submitted by Compaq to RS. As required by the LOA, Supramaniam signed the LOA and returned it to Compaq. As the LOA is at the heart of the present action, we shall set it out in full: LETTER OF AWARD (“LOA”) It is our pleasure to hereby confirm that,subject to final terms and conditions being agreedbetween Compaq Computer Asia Pte Ltd (“COMPAQ”) and Computer Interface Singapore Pte Ltd (“CIS”), we haveselected CIS to supply the installation, maintenance and related servicesfor the Reuters Field Outsourcing project in Singapore. The attached schedules will form part of the Agreement. By accepting this LOA, CIS agrees to commence the project on the terms stated on the schedules. Both parties agree that they will take all reasonable steps to ensure that the Agreement is negotiated and signed on or before Friday 14thJuly 2000. If the Agreement has not been entered into by 17thJuly 2000, a new target date for the signing of the Agreement will then be mutually agreed between the parties. The Agreement shall take effect on 1stJuly 2000and subject to any ability to terminate it under the Agreementshall expire 3 years after such date. Both parties also agree that the operations will be reviewed six months from 1 July 2000 for better control in economic [sic] of scale and improvement in productivity, which cost could be saved and passed on to Compaq. We would like to take this opportunity to thank you and your staff for the keen support and co-operation that you have extended to usduring the negotiations. We look forward to the establishment of a mutually beneficial relationship. [emphasis added] 10        From 1 July 2000, CIS provided field services to the customers of RS on the basis of the LOA. RS continued to send the work orders direct to CIS in the same manner as during the period when CIS was its contractor carrying out the field services. But CIS would invoice Compaq in accordance with the payment terms set out in the LOA. 11        It would have been noted that under the LOA, it was envisaged that the written agreement would be finalised and signed by 14 July 2000. But this did not occur. However, the field services were provided by CIS and periodical tripartite management meetings were held to monitor the services provided. From the minutes of two such tripartite meetings, it is clear that CIS had been pressing Compaq for the draft agreement. Eventually, in late August or early September, a lengthy draft of an agreement, based on Compaq’s standard version, was e-mailed by Janet Heng (“Heng”) of Compaq to Supramaniam. As Supramaniam thought that many of the provisions were not entirely appropriate, he made extensive amendments to the draft agreement and e-mailed the amended version back to Heng. There was no response to this amended version. The minutes of several meetings thereafter recorded the fact that Supramaniam was chasing Compaq for a response. It was after 11 December 2000 that Heng e-mailed a revised draft to Supramaniam. That was followed by discussions between Heng and Supramaniam. However, on 13 February 2001, Heng told Supramaniam that thereafter one Choo Choon Teck (“Choo”) would be handling this matter in place of Heng. However, Supramaniam never heard from Choo. 12        It is clear, and it was so found by the trial judge, that Compaq did not give priority or importance to concluding the written agreement. Instead, on 16 January 2001, and without prior indication, Compaq sent an e-mail to Supramaniam stating that Compaq would be doing some of the installation work itself, thereby reducing the volume of work which under the LOA would be given to CIS. While upset by this move, Supramaniam did not challenge that this move amounted to a breach of contract, but expressed concern at not being given prior notice and at the consequence of having idle manpower. We should add that Supramaniam had explained to the court below that, being a small company, CIS could not afford to offend Compaq. Following this e-mail of Compaq, RS also stopped sending work orders direct to CIS and, instead, routed them through Compaq. 13        Thereafter, not only was the volume of work channelled to CIS reduced, Compaq also pressed CIS to reduce its prices for the services. In a letter of 26 November 2001, CIS refused to succumb to the pressures, pointing out that the rates had been agreed. It also highlighted the fact that in the past year the volume of work given by Compaq to CIS had been reduced by 20% to 50%, ignoring the understanding that CIS was to provide the field services on a back-to-back basis. 14        On 18 December 2001, Compaq wrote a letter which was to change the course of events. After referring to the fact that Compaq had, pursuant to the request of RS, agreed to make certain changes to the services which Compaq was then providing to RS, it stated: For the past year and a half, you have been providing services to Reuters on our behalf. This was done notwithstanding the fact that CIS and Compaq have not signed any agreement for these services although we recognize that a draft agreement was discussed. However, given the request from Reuters and our continued working relationship with CIS, we would like to discuss with yourselves the following changes to the operational model. In the new model, Compaq will: 1.         Use existing CIS resources as appropriate and directly manage these resources, 2.         Set up a field office and will consider sub-leasing existing facilities from CIS as appropriate, and 3.         Look to revising the financial and commercial terms with CIS to reflect the new requirement. Reuters have given us a deadline to fully implement the new model. As time is of the essence we would like to discuss and conclude with you by 24thDecember 2001 the role that CIS can participate in the new model, the resources and facilities that can be offered to Compaq and the financial and commercial terms of the arrangement. 15        As the changes proposed by Compaq were drastic, CIS asked for an extension of time to consider the proposal. But all that Compaq was prepared to accommodate was to extend the deadline from 24 December 2001 to 9.00am on 26 December 2001. This provoked a pointed reply by Supramaniam on 26 December 2001 where, after referring to the prior events, he said: However, on the 18 December 2001, we were surprised and astonished to receive a letter from Mr Lawrence Mok which in a nutshell clearly stipulates that the joint venture agreement to provide services to Reuters is no longer to continue to be valid, and that you are to provide direct management and operational control and complete contact with Reuters. This will reduce our service to that of a mere subcontractor. You are aware that we will not be able to work on this basis as it will lead to substantial financial losses for us and not to mention that we will not have direct management, operation and control of the services provided to Reuters. In substance, no partnership or joint co-operation exists between Compaq and Computer Interface based on this new delivery model. Finally, if we cannot sit and negotiate an agreement which is mutually and commercially beneficial to both of us, as was the arrangement previously mentioned in the MOU i.e. based on joint co-operation and partnership, we are not in a position to continue on the new model. By your new model as per your letter dated 18/12/01, you are seeking unilaterally imposed terms and conditions, which are not commercial[ly] viable to us. If you insist on the terms in your letter dated 18/12/01, we have no alternative but to seek legal redress. 16        The response from Compaq on 28 December 2001 was to terminate “the arrangement” between CIS and Compaq with immediate effect. However, Compaq left the door open until 5 January 2002 should CIS wish to rethink Compaq’s new proposal for CIS’s participation in some form. 17        Through subsequent inquiries with the new managing director of RS, Mr Clemenson, Supramaniam learnt that while it was true that RS was seeking to renegotiate its contract with Compaq arising from RS’s review of the situation, RS had not required Compaq to renegotiate its arrangements with CIS. Encouraged by RS, Compaq and CIS met to see whether they could move forward in some way. But they failed. 18        The above was the setting which gave rise to the action instituted by CIS claiming for damages for the termination of the agreement which CIS averred is evidenced partly in writing by the MOU and LOA and partly by the conduct of the parties. The “conduct” refers to the provision of the field services by CIS from 1 July 2000 onwards and the payment for the same by Compaq.",
        "Decision below": "19        At the trial, the central issue related to the interpretation of the words “subject to final terms and conditions being agreed” in the LOA. These words will be hereinafter referred to as “the phrase”.  Compaq argued that there was to be no agreement until the written agreement was finalised and signed. Until that agreement was executed, what Compaq and CIS had was only an interim arrangement for the field services to be provided. 20        The trial judge found that there was a binding contract between the parties even though the written agreement envisaged in the LOA was not finalised and executed ([2003] SGHC 239). He said at [46] to [47]: Ignoring for the time being the effect of the words “subject to final terms and conditions being agreed”, the language used in the LOA, namely: - the description of the letter of 30 June 2000 as a “Letter of Award”; - the confirmation in cl 1 thereof that Compaq hadselectedCIS to provide the requisite services; - the statement in cl 2 that CIS by accepting the LOA agrees to commence work on the terms stated in the Schedules to the LOA; - the emphatic statement in cl 3 that “the Agreement shall take effect on 1stJuly 2000”; - the expression of thanks to CIS in cl 5 for their co-operation during the negotiations; all indicate that the negotiations between Compaq and CIS had, by 30 June 2000, been successfully concluded and that, upon CIS signing its acceptance in the space provided in the LOA, the agreement was in place. The fact that after accepting the LOA, CIS rendered the requisite services for a period of 18 months was also a strong indicator that by 1 July 2000 the terms of the sub-contract between Compaq and CIS had been agreed. The fact that the LOA required the “award” to be “accepted” by CIS and that prior to commencing work on 1 July 2000 CIS had accepted that award is also significant. This is conduct indicative of a desire to enter immediately into a binding arrangement. [emphasis in original] 21        The trial judge next went on to examine whether the presence of the phrase in the opening paragraph of the LOA altered the position. He did not think the cases cited which involved the expression “subject to contract” were of much assistance. Instead, relying on a passage inCheshire, Fifoot and Furmston’s Law of Contract(2nd Singapore and Malaysian Ed, 1998) at 100, he said that the critical question to address was this: Is the preparation of a further document a condition precedent to the creation of a contract or is it an incident in the performance of an already binding obligation? 22        The trial judge held at [52] that at the date of the LOA, all “material terms and conditions necessary for CIS to commence providing the [field] services to [RS] had been agreed upon in the LOA”. The word “final” in the phrase also suggested that “at the date of the LOA the terms and conditions had been agreed upon but as there were some final terms that the parties may agree upon, those terms (if agreed) would be included in the formal agreement to be signed”. He also pointed out that the fact that Compaq saw no urgency to conclude the written agreement, and that CIS had been providing 18 months of field services, indicated that the execution of a formal agreement was not in the nature of a condition precedent to the creation of a contract. 23        Accordingly, the trial judge held that there was a binding contract between the parties when CIS signed the LOA and that Compaq had breached the contract when it terminated it on 28 December 2001. Compaq had also breached the contract when it withheld some of the services from CIS during the first 18 months. As regards the question of damages, the parties had agreed, at the commencement of the trial, that damages would be assessed separately.",
        "Issue on appeal": "24        Before us, primarily the same issue is being canvassed, with Compaq seeking to persuade us that the LOA could not have evidenced a binding contract, bearing in mind the phrase. Moreover what was contemplated was a back-to-back arrangement, and while, before 1 July 2000, RS had indicated to Compaq that the contract would be awarded to the latter, the binding agreement in written form between RS and Compaq was only concluded on 13 July 2000. Compaq said this explained why the phrase had to be inserted at the outset of the LOA to make the position clear. 25        On the other hand, CIS argued that, reading the LOA as a whole, in the context of the factual matrix, the signing of a formal agreement was merely an incident in the performance of an already binding contract. CIS averred that the LOA evidenced the contract. The parties realised that the agreement was to come into effect on 1 July 2000 as that was the date on which CIS was to commence fulfilling its obligations to Compaq. The phrase in the LOA did not constitute a condition precedent but only meant to provide that Compaq reserved the right to add further agreed terms in a written form. The LOA had already set out all the essential terms for a binding contract to come into being.",
        "Our analysis": "26        The trial judge is correct to have placed no importance on the MOU to determine whether, notwithstanding the absence of a written agreement, there was a binding contract between Compaq and CIS. Clause 1 of Attachment A of the MOU quite explicitly stated that: “[a] subcontract agreementwill be enteredinto with CIS for …”. Clause 8.1 of the MOU further stated that the MOU was “solely an expression of intent between Compaq and CIS pertaining to a general goal to be pursued”. The purpose of having the MOU was to show to RS that Compaq and CIS had made progress in their negotiations for co-operation in providing the field services to RS. 27        Again, as the judge quite rightly indicated, the critical document is the LOA and it was from this document that he found that a binding contract between Compaq and CIS had come into being. We have earlier alluded to the reasons given by the judge in coming to his conclusion. We do not disagree that many of the things referred to in the LOA, including those in the schedules, are matters which had been agreed to. But, as the judge clearly recognised, the single obstacle in the way of that construction is the presence of the phrase. 28        There are a number of settled principles which ought to be borne in mind in construing a document. The first is that a document should be construed objectively without regard to the subjective intention of the parties. The trial judge did apply this principle. The second is that any subsequent statement or conduct of the parties should not be taken into account in the construction of a document, although the court would be entitled to look at the factual matrix: seeJames Miller & Partners Ltd v Whitworth Street Estates (Manchester) Ltd[1970] AC 583andReardon Smith Line Ltd v Yngvar Hansen-Tangen[1976] 1 WLR 989. However, this principle does not apply to determine whether a document evidenced a contract, where such document is not the whole of the contract. 29        As indicated above, the judge, in coming to his conclusion, had taken into account the following facts or circumstances: (a)        Compaq took its time to negotiate and finalise the written agreement. (b)        For some 18 months from 1 July 2000, CIS had been providing field services to Compaq. (c)        All the material terms necessary for CIS to carry out the field services had been set out in the LOA. (d)        There was the presence of the word “final” in the phrase. 30        We will address these points in turn. As regards Compaq’s tardiness in getting the written agreement finalised, there are really two ways of looking at it. One is that advanced by CIS: that Compaq knew there was already a binding contract between the parties and so did not think there was a need to hurry. It was clear that CIS was chasing for an early conclusion. The other way to view the situation is that CIS was anxious to conclude the written agreement because it knew that the deal was not yet firmed up and what CIS had was only an interim arrangement which would not give it the full contractual rights. Therefore, we do not think this point is really helpful in deciding the issue, as what it indicates is less than certain. 31        While there are authorities which show that where the parties have acted upon the faith of a written document, the court would be inclined to assume that the document embodies a firm contract,eg,Sweet & Maxwell Ltd v Universal News Services Ltd[1964] 2 QB 699, this would not apply where there is contrary intention. In the present case, such a contrary intention is indicated in para 2 of the LOA which contemplated, pending the finalisation of the written agreement, an interim arrangement. We will revert to this a little later. 32        Nor do we think all the essential terms had been set out in the LOA. Just to name a few: nothing in the LOA addresses the issues of payment terms, exclusion of liability, insurance or termination, which would be vital in a complex contractual arrangement like the one contended for by CIS. 33        The judge seemed to think that the presence of the word “final” in the phrase would suggest that it should not be read to mean the same thing as “subject to contract” but to mean that as “there were some final terms that the parties may agree upon, those terms (if agreed) would be included in the formal agreement to be signed” (at [52]). In short, it was really a reservation of a right to add more terms if they could be agreed. If that is all it means there is hardly any need to say that. After all, if parties agree, they can add anything. In our view, that would not be an appropriate reading of the word “final”. It would be more consistent with its plain meaning and logic to read it to mean “last”. 34        We now turn to examine the phrase. Ultimately the question we have to answer is whether the phrase objectively should be construed in the manner adopted by the trial judge, or should it be construed in a similar manner as the expression “subject to contract”. 35        The authorities are almost of one view that the expression “subject to contract” means that until a formal written agreement is drawn and executed between the parties, there would be no binding contract between them. Of course, how a qualifying phrase of this nature should be construed must also depend on the context of the entire document. InAlpenstow Ltd v Regalian Properties plc[1985] 2 All ER 545, the court held that there was a binding contract even though the expression “subject to contract” was used because of a very strong and exceptional context. 36        As far as the phrase in this case is concerned, it seems to us that the important word there is not the word “final” but the words “subject to”. The plain meaning of the words “subject to” is “depending” or “conditional”. The presence of the word “final” indicates that while some terms have been agreed, some others are yet to be settled. The entire phrase would mean what it says,ie, the award was conditional upon the “final terms and conditions being agreed”. Equally important, there is also nothing to indicate what is the nature of these “final terms and conditions”. So what these “final” or “last” terms are is quite uncertain. It must be borne in mind that for there to be a binding contract, there has to be a “final and unqualified expression of assent” to contract: seeAircharter World Pte Ltd v Kontena Nasional Bhd[1999] 3 SLR 1, a decision of this court. 37        This is probably a stronger case thanLockett v Norman-Wright[1925] Ch 56, where the expression used was, “subject to suitable agreement being arranged between your solicitors and mine” and that was held to be a condition precedent to any concluded bargain. InLockettall the essential terms had been agreed upon. 38        Accordingly, we are unable to accept the construction given by the judge. If the parties had intended the phrase to have the sense given by the judge, being concerned with inconsequential additional points of agreement, it would not have been expressed in the way we now see it. If at all, that idea would probably have appeared at the end of the LOA with something like this: “There are still some incidental matters upon which the parties are negotiating and if agreement could be reached they will be included subsequently in a written agreement.” It would not have been expressed in the form “subject to” and placed right at the top. 39        Indeed, the second paragraph of the LOA also supports the construction we have placed on the phrase. The first sentence, namely, “the attached scheduleswill formpart of the agreement”, brings this sense out. The words “will form” indicate something in the future. In other words, the schedules, which set out the works and the rates, had not yet formed part of the Agreement although there had beenconsensus ad idemon them. The judge does not seem to have given consideration to these two words. 40        The second sentence of the second paragraph does not detract from the first sentence. What was contemplated in the second sentence, “[b]y accepting this LOA, CIS agrees to commence the project on the terms stated [in] the schedules”, was clearly a proposal for an interim arrangement pending the finalisation of the written agreement. Thus, Compaq asked for CIS’s signature. This explains why in the next two sentences, the parties agreed to negotiate diligently to conclude and sign the written agreement by 14 July 2000, or, if not by that date, by such other mutually agreed target date. There is nothing exceptional about work being done pending the finalisation of a written contract: seeBritish Steel Corp v Cleveland Bridge and Engineering Co Ltd[1984] 1 All ER 504. 41        The third paragraph of the LOA is also pertinent. It referred to three things: (a)        the agreement shall take effect on 1 July 2000; (b)        it is subject to any ability to terminate it under the Agreement; and (c)        the agreement is to last for three years from 1 July 2000. It is not in dispute that (a) and (c) had by then been agreed upon between the parties. But that was not so with regard to (b). Nothing in the LOA, or the schedules, touched on (b). So what was set out in para 3 was the parties’ expectation as to what should be provided in the written Agreement. 42        The judge seemed to have placed some importance on the words “during the negotiation” in the last paragraph of the LOA: see [20] above. The expression of appreciation by Compaq for the co-operation extended by CIS “during the negotiations” must be viewed in the proper context. There is no doubt that there had been negotiations and agreement reached on many points. But that could in no way be read to mean that negotiations had been completed. Here, we think the last sentence in the paragraph is just as illuminating. It says, “We look forward to the establishmentof a mutually beneficial relationship.” [emphasis added]. This does not allude to an existing relationship. It refers to something to come – the eventual establishment of a mutually beneficial relationship. 43        Finally, we should refer to a matter which CIS relied upon to argue that it was the intention of the parties to conclude a firm contract by the LOA. Relying on the facts we have alluded to earlier, which showed that RS was keen to see that there be co-operation between Compaq and CIS, and that Compaq’s commitment with RS would start from 1 July 2000, CIS argued it was vital that the arrangements between Compaq and CIS should be in place by that date. Basically, what RS was anxious to ensure was a smooth transition so that the level of service to customers would be maintained. There was nothing in the proposed contract between RS and Compaq which touched on this aspect and it was clear that RS left it very much to Compaq and CIS to work out their legal arrangement. All that RS’s conditional letter of intent stipulated was that Compaq should work with CIS to ensure a smooth transition and finalise their “partnership arrangement”. That letter did not suggest that there had to be an immediately binding contract for Compaq to comply with their contractual obligations to RS. Moreover, on 30 June 2000, the written contract between RS and Compaq had not yet been finalised. 44        Accordingly, and with the utmost respect, we would have to disagree with the construction given by the judge to the LOA. It seems to us clear that the LOA sought to make three main points. First, although CIS had been selected to be the sub-contractor, there were terms on which the parties had yet to agree and only upon the execution of a written agreement would there be a contract between the parties. Second, in the meantime, CIS should carry out the field services from 1 July 2000 and would be paid in accordance with the terms set out in the schedules attached to the LOA. Third, the parties should seek to have the written agreement executed by 14 July 2000, or, if that was not possible, by another mutually acceptable target date. While we share some of the sympathy which the judge had for CIS, as Compaq had failed to fulfil its gentlemen’s commitments to CIS, we are afraid those commitments are not legally binding. As stated by Tomlin J inLockett v Norman-Wright([37]supra) at 61: It is no part of my duty to pronounce whether or not the conduct of any of the parties concerned in this matter is open to censure. All I have to do is to determine whether there is or is not a concluded contract between the plaintiff and defendant which the plaintiff can enforce. 45        In the result, we allow the appeal with costs, both here and below. The security for costs, together with any accrued interest, shall be refunded to the appellant, Compaq. Appeal allowed."
    }
}