{
    "case_title": "Ong Cheng Aik v Dayco Products Singapore Pte Ltd (in liquidation)",
    "ncitation": "[2005] SGCA 14",
    "coram": "Chao Hick Tin JA; \n      Kan Ting Chiu J; \n      Yong Pung How CJ",
    "sections": {
        "The background": "2The respondent, which was the plaintiff in the action below and then under liquidation, sued the appellant for breaches of fiduciary duties as its managing director in relation to certain transactions. On 2 September 2004, the trial judge found the claim proven and ordered the appellant to pay US$598,695.37 as damages, plus interest and costs. On 17 September 2004, the appellant filed a notice of appeal against the judgment. 3By way of a notice from the Registry, the appellant was informed that, pursuant to O 57 r 9(1) of the Rules of Court (Cap 322, R 5, 2004 Rev Ed), he was required to file the Record of Appeal, Core Bundle and Appellant’s Case (for convenience they will hereinafter be referred to collectively as “the Record of Appeal”) relating to his appeal within two months thereof,ie, by 22 November 2004. 4However, three days before the expiry date, on 19 November 2004, the appellant filed a notice of motion (Notice of Motion No 114 of 2004) seeking a 21-day extension for him to file the Record of Appeal. On 26 November 2004, the motion came before Woo Bih Li J, sitting as a single judge of the Court of Appeal pursuant to s 36(1) of the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed) (“SCJA”), and he dismissed the application with costs. 5On 29 November 2004, pursuant to s 36(3) of the SCJA, the applicant filed the present motion seeking a review by a full quorum of the Court of Appeal of the decision of the single judge.",
        "Reasons for the application": "6We now turn to the reasons advanced by the appellant to explain why he needed an extension of time to file the Record of Appeal. The trial of the action giving rise to the judgment under appeal lasted 19 days in three tranches. The first two tranches took place in 2002 and the third in 2003. During the first two tranches the appellant was represented by Mr Michael Khoo SC (“Mr Khoo”). At the third tranche, Mr Francis Goh (“Mr Goh”) took over from Mr Khoo. The appellant was informed by Mr Goh of the Registry’s notice requiring him to file the Record of Appeal by 22 November 2004. As the appellant felt that he needed the best help to argue his appeal, he told Mr Goh not to act on the appeal and immediately set about trying to engage a Senior Counsel. He approached some of them. The problems that apparently stood in the way of those Senior Counsel acting for him were either unavailability due to other commitments or shortness of time to consider the case and prepare the Record of Appeal. The professional fees expected by them was another reason. As at 12 November 2004, a Senior Counsel was still pondering whether to take up the brief. By 16 November 2004, when the appellant did not receive a positive reply from the Senior Counsel, he went back to Mr Goh, who, in view of the shortness of time remaining to file the Record of Appeal, advised him to apply for an extension of time. This gave rise to the application in NM 114/2004. 7It was true that on 14 October 2004, the appellant had instructed Mr Goh to apply for a stay of execution of the judgment. However, in the circumstances, we could not see who else the appellant could go to make the stay application. This could hardly mean that he did not seriously want a Senior Counsel to argue his appeal.",
        "Applicable considerations": "8This court has in several cases laid down the factors which the court should take into account in determining whether an extension of time should be granted to enable a party to file or serve a notice of appeal out of time: see [11] below andPearson v Chen Chien Wen Edwin[1991] SLR 212(“Pearson”);Vettath v Vettath[1992] 1 SLR 1;The Tokai Maru[1998] 3 SLR 105;Hong Huat Development Co (Pte) Ltd v Hiap Hong & Co Pte Ltd[2000] 2 SLR 609andNomura Regionalisation Venture Fund Ltd v Ethical Investments Ltd[2000] 2 SLR 686.In respect of such an application for extension of time, the court takes a rather strict view of things and sufficient grounds must be shown before the court will exercise its discretion. This is because if no appeal is filed and served within the prescribed time of one month, the successful party is justly entitled to assume and act as if the judgment is final. 9In the present case, three factors clearly stood out. First, this was not an application to obtain an extension of time to enable a notice of appeal to be filed or served out of time. Second, the application, which related to a pending appeal, was for an extension of time to file the Record of Appeal. Third, the application was made before the expiry of the prescribed time to file the Record of Appeal. 10A useful point to start the consideration of the principles governing an application for an extension of time to do an act in relation to proceedings in court isRatnam v Cumarasamy[1965] 1 MLJ 228, a case involving an application for an extension of time to file a record of appeal. There, the Privy Council, on an appeal from the Court of Appeal of the Federation of Malaya, said at 229: The Rules of Court mustprima faciebe obeyed, and in order to justify a court in extending the time during which some step in procedure requires to be taken there must be some material upon which the court can exercise its discretion. If the law were otherwise, a party in breach would have an unqualified right to an extension of time which would defeat the purpose of the rules which is to provide a time table for the conduct of litigation. 11Therefore, what is important is that there “must be some material upon which the court can exercise its discretion”. This comment was considered and amplified by Chan Sek Keong JC (as he then was) inHau Khee Wee v Chua Kian Tong[1986] SLR 484at 488, [14] (“Hau Khee Wee”) to encompass an assessment of the following four factors: (a)the length of the delay; (b)the reason for the delay; (c)the merits of the appeal; and (d)the question of prejudice. 12LikeRatnam,Hau Khee Weewas a case where the appellant was out of time in filing the record of appeal. There was a delay of 24 days when the application for extension of time was made. What is significant aboutHau Khee Weeis that while Chan JC appreciated that an application for extension of time to file the record of appeal was different from that of an application to file and serve a notice of appeal out of time, he seemed to say that the same four factors were applicable to both types of applications. That Chan JC was conscious of the difference can be seen from the following passage, at 487, [11]: It is not necessary for me to examine all of them as each case depended on its own facts. Some of them are not directly in point as they deal with applications for extension of time in respect of a different phase of an appeal. For example, inTan Chai Heng v Yeo Seng Choon[1981] 1 MLJ 271 [[1980–1981] SLR 381], Choor Singh J held that the negligence or mistake of the appellant’s solicitor was not a good ground for extension of time to file a notice of appeal. Choor Singh J’s decision is not a direct precedent for the present case which involves the filing of the Appeal Record. InGan Hay Chong v Siow Kian Yuh[1975] 2 MLJ 129the Federal Court of Malaysia was of the view that it would be wrong to apply a general rule that a mistake by a solicitor, by itself, was not a sufficient ground for granting an extension of time to file a notice of a memorandum of appeal. The Federal Court made a distinction between a case of a failure to file a notice of appeal in time from a case of a failure to file a memorandum of appeal in time. In the former case, no appeal was in existence and the court would apply a more stringent test. “Here a notice of appeal had been filed. There was an appeal, but there was no record for it to be heard, unless time was extended for filing it.” (See page 131ibid.) Similarly, inLee Guat Eng v Tan Lian Kim[1985] 2 MLJ 196the Federal Court of Malaysia granted an extension of time to serve the memorandum of appeal and the appeal record on the respondent out of time (which was for about 15 days). 13SinceHau Khee Wee, the four factors have been adopted and applied by our courts, including this court (see the cases referred to in [8] above), in determining whether in a particular case the court should grant an extension of time to file or serve a notice of appeal out of time. 14However, there is clearly a difference between an application for an extension of time to file a notice of appeal out of time and that for an extension of time to file or serve the record of appeal out of time. In the former situation, there is no appeal; in the latter there is already an appeal, only that the appellant has failed to take a required step in time. This difference was noted by Judith Prakash JC (as she then was) inBank of India v Rai Bahadur Smith[1993] 2 SLR 592when she said at 597, [27]–[28]: [T]hese factors [the four factors listed inHau Khee Wee] are factors to be considered when an applicant wants leave to appeal after the time limited for appealing has expired. That is a different and more complex situation than the one I was faced with. In that situation the judgment would have become final in favour of the successful party and he would, in a sense, have had an accrued right which he would be deprived of if the application were allowed. In the present case, the applicants had exercised their rights of appeal within time. No rights had accrued to the respondents in the sense used above. 15InThe Tokai Maru([8]supra), a case concerning an application for extension of time to file affidavits of evidence-in-chief out of time in relation to a pending action, this court also observed (at [20]) that an application to extend time to file a notice of appeal out of time stood on a different footing from other applications to extend time. 16While the four factors may be applicable to both types of applications for extension of time to do an act in that they assist the court in determining whether there is “some material” for the court to exercise its discretion in favour of the applicant, it must follow as a matter of logic and justice that the “material” required for an application for extension of time to file a notice of appeal out of time should be weightier or more compelling than that required for other applications for extension of time. At the end of the day, the court must, after weighing all the circumstances, come to the conclusion that the application deserves sympathy: seePearson, [8]supra, at 219, [20]. 17In the present case, it is crucial to bear in mind that the appellant applied to court for an extension of time before the prescribed time to file the Record of Appeal had expired. This demonstrated that the applicant had not wholly disregarded the rules. He had wanted to comply with the rules. He did not take things for granted. He had sought leave. He had explained why he was placed in that predicament. We did not think that it was unreasonable of the applicant to try to get a Senior Counsel to argue his appeal, although he should have got back to Mr Goh earlier. 18As regards the factor relating to the merits of the appeal, it could not be said that the appeal was hopeless: seePearsonat 218, [17]. It is a low threshold which an applicant has to satisfy even if the application relates to an application to file a notice of appeal out of time. We appreciated that the present appeal relates essentially to findings of fact. While overturning a finding of fact may be difficult, it is not impossible or doomed to fail especially where the finding is based on both oral and documentary evidence. 19Lastly, on the question of prejudice, it was quite clear that from 17 September 2004 the respondent knew that the appellant intended to have the judgment against him overturned. No real prejudice was shown to have been suffered by the respondent. The only point made was that the respondent would not be able to obtain the benefits of the judgment until the disposal of the appeal. That fact could hardly constitute prejudice. In any event, post-judgment interest should take care of that. 20In the light of these considerations, we were satisfied that there was material warranting this court exercising its discretion in favour of the appellant. 21On the question of costs, as it was the appellant who was seeking the indulgence of the court, costs fixed at $3,000 were awarded to the respondent. Application granted."
    }
}