{
    "case_title": "Management Corporation Strata Title Plan No 2297 v Seasons Park Ltd",
    "ncitation": "[2005] SGCA 16",
    "coram": "Chao Hick Tin JA; \n      V K Rajah J; \n      Yong Pung How CJ",
    "sections": {
        "The facts": "2          The appellant is the management corporation of a condominium called the Seasons Park Condominium (“the condominium”) which was developed by the respondent, Seasons Park Ltd. The condominium, located along Yio Chu Kang Road, consists of four blocks of residential buildings and other amenities. It has a total of 390 residential units. It was alleged that in the year 2000, defects began to appear in the common property of the condominium. The appellant accordingly brought the action on behalf of all the subsidiary proprietors of the units to claim for damages on account of the defects that surfaced. The action is in contract as well as in tort. 3          The appellant had called for tenders to assess the cost required to rectify the defects. The tenders indicated a mean figure of about $2.2m. The respondent disputed the extent of the alleged defects and the cost of rectification. 4          At the commencement of the trial, the respondent asked the court to determine three preliminary issues which might facilitate the disposal of the case. They were: (a)        in relation to the claim in contract, whether the appellant was entitled to sue on behalf of all the subsidiary proprietors of the condominium who had entered into sale and purchase agreements with the respondent, and if not all the subsidiary proprietors, which of them; (b)        in relation to the claim in tort, whether the respondent could avail itself of the defence of “independent contractor” against the appellant’s claim; and (c)        whether the appellant was entitled to seek a declaration of indemnity from the respondent. 5          On the evidence placed before Choo J, it would appear that of the 390 units, the owners of only 319 units bought them directly from the respondent. With regard to the remaining 71 units, the present owners of those units did not purchase them directly from the respondent. They were sub-purchasers. 6          Before the institution of the present action, there was an annual general meeting (“AGM”) of the appellant held on 31 March 2002, where only 49 sub-proprietors attended and voted in favour of the appellant instituting an action against the respondent in respect of the defects.",
        "The decision below": "7          In relation to the first issue, Choo J answered in the negative. In his opinion, s 116 of the Land Titles (Strata) Act (Cap 158, 1999 Rev Ed) (“the LTS Act”) merely empowered the management corporation of a development to sue or be sued. It did not as such confer any cause of action upon the management corporation. It was a provision which empowered the management corporation, which was a separate legal entity, to sue on behalf of one or more subsidiary proprietors in relation to claims which the subsidiary proprietors had against any person, including the developer. As some of the subsidiary proprietors who had authorised the appellant at the AGM of 31 March 2002 to sue the respondent were not original purchasers from the respondent, they, being third parties, were not entitled to sue the respondent in contract. They therefore had no right to authorise the appellant to sue, on their behalf, the respondent in contract. Thus, Choo J held that it was essential, as far as the claim in contract was concerned, for the appellant to identify who the subsidiary proprietors on whose behalf the appellant was suing were, which was not done. All that the pleadings indicated was that the appellant represented the 390 subsidiary proprietors, which was not correct. He also rejected the appellant’s submission that the resolution of 31 March 2002 provided the authority. Accordingly, Choo J held that the appellant was not properly authorised to institute the action in contract. 8          With regard to the second issue, Choo J answered in the positive, namely, that the respondent was entitled to rely on the defence of “independent contractor”. However, he added that for the respondent to successfully plead this defence, it must show that it had exercised reasonable care and skill in engaging the independent contractor for the development. This was a question of fact and would have to be determined by the court on the evidence to be adduced. 9          With regard to the third issue, the judge answered in the negative. In order for the appellant to be entitled to an indemnity, ordinarily it must be shown that there was a contract between the parties or that this obligation arose by operation of law. None of these two conditions was found to exist. 10        The net result of these rulings is that the appellant may not proceed with the action in contract against the respondent because it does not have thelocus standi.Only the action in tort may continue and at the trial, the defence of “independent contractor” will be available to the respondent unless the respondent is found to be in breach of its duty of care in appointing the contractor. 11        In this appeal, the appellant is only challenging the answers given by the judge to the first two issues. The answer to the third issue is no longer being pursued.",
        "Claim in contract": "12        We will now examine the two issues in turn. Under the LTS Act, the subsidiary proprietors of individual units in a private development, like the condominium here, own the common property as tenants-in-common. For every such development, the LTS Act constitutes all the subsidiary proprietors of the development as a corporate entity called the management corporation. The management of the common property is entrusted to the management corporation. The powers, rights and duties of the management corporation are set out in the LTS Act. The management corporation may represent all the subsidiary proprietors in a developmentvis-à-visthird parties. 13        Essentially, the appellant relies on s 116 of the LTS Act to contend that it is authorised to institute the claim in contract on behalf of all the subsidiary proprietors of the units in the condominium. In order to fully appreciate the scope of s 116, it is necessary that we set out the provisionin extenso: (1)        Where all or some of the subsidiary proprietors of the lots in a subdivided building are jointly entitled to take proceedings against any person or are liable to have proceedings taken against them jointly (any such proceedings being proceedings for or with respect to common property), the proceedings may be taken by or against the management corporation as if it were the subsidiary proprietors of the lots concerned. (2)        Any judgment or order given or made in favour of or against the management corporation in any such proceedings shall have effect as if it were a judgment or order given or made in favour of or against the subsidiary proprietors. (3)        Where a subsidiary proprietor is liable to make a contribution to another subsidiary proprietor in respect of a judgment debt arising under a judgment referred to in subsection (2), the amount of that contribution shall bear to the judgment debt the same proportion as the share value of the lot of the first-mentioned subsidiary proprietor bears to the aggregate share value. 14        It is apparent that of the three subsections of s 116, the main one issub-s (1). Subsections (2) and (3) are really consequential provisions. It is plain that sub-s (1) does not confer a cause of action upon the management corporation. It is a provision to facilitate the institution of action by or against subsidiary proprietors in the development and nothing more. It authorises the management corporation to institute or defend actions on behalf of subsidiary proprietors. The scope of this subsection has been the subject of consideration in several previous cases. 15        InMCST Plan No 1279 v Khong Guan Realty Pte Ltd[1995] 1 SLR 593at 596, [14], G P Selvam J said: [T]he plain words of s 116(1) entitle a management corporation to represent the subsidiary proprietors where the subsidiary proprietors have a cause of action whether it be an action in tort or contract. It is an action in a representative capacity authorized by statute. 16        This statement as to the meaning and scope of s 116(1) was approved by this court inRSP Architects Planners & Engineers v Ocean Front Pte Ltd[1996] 1 SLR 113(“Ocean Front”) at 121, [17] where the court added that the purpose of s 116 is “to simplify the procedural aspect of the proceedings so as to avoid naming all the subsidiary proprietors or some of them who are concerned in the proceedings”. 17        InMCST Plan No 1938 v Goodview Properties Pte Ltd[2000] 2 SLR 807, Lai Siu Chiu J said (at [16]): In interpreting and applying s 116(1), it must first and foremost be noted that s 116(1) is a procedural provision and does not confer any separate substantive right on the management corporation. Clearly, any party wishing to rely on this procedural provision must point to an underlying substantive cause of action against the intended defendants. We would respectfully agree with this statement too. 18        In the light of the foregoing, we do not think that the appellant can obtain much help from s 116. It is a procedural provision to facilitate action by a large number of subsidiary proprietors. It does not confer upon the management corporation any cause of action. The appellant can undoubtedly sue on behalf of subsidiary proprietors and as not all the present subsidiary proprietors of the condominium bought their units directly from the respondent, the appellant must specify on which of the subsidiary proprietors’ behalf is the action in contract instituted. The substantive party is not the management corporation but the specific subsidiary proprietors. While the names of these subsidiary proprietors need not appear as plaintiffs, they must be identified specifically, such as, for example, in an annex to the Statement of Claim. It seems to us that this is necessary for two related reasons. First, it is to enable the respondent to know which subsidiary proprietors have authorised the appellant to institute the claim in contract on their behalf. Second, it is to ensure that there is no doubt as to whom the eventual judgment delivered should bind. This follows from s 116(2) which states that the judgment in such an action shall have effect “as if it were a judgment or order given or made in favour of or against the subsidiary proprietor”. Thus, there must be certainty as to who are the parties to the proceedings. 19        The alternative argument of the appellant is that it is, in fact, authorised to act on behalf of all the subsidiary proprietors by virtue of the resolution passed at the AGM on 31 March 2002. This cannot be true. First, not all the present subsidiary proprietors purchased their units from the respondent – at least 71 were sub-purchasers, which means that they had no contract with the respondent and thus could not have made a claim in contract against the respondent. Second, with regard to the AGM held on 31 March 2002, only 49 subsidiary proprietors voted in favour of the resolution to pursue the matter against the respondent, and of the 49 subsidiary proprietors, nine did not purchase their units directly from the respondent. These nine subsidiary proprietors can have no claim in contract against the respondent, there being no privity: seeOcean Front([16]supra) at 123. The position would be different if the claim was founded in tort. This is because under the LTS Act, the administration of the common property of a development is vested in the management corporation, which will be entitled in its own right to sue in tort with respect to the common property. InOcean Front,this court noted (at 120, [14]) that while the management corporation has no proprietary interest in the common property, it has certain rights and obligations with regard to the common property which is “something akin to possession of the common property”. This was the basis upon which the court inOcean Frontheld that the management corporation had a claim in tort, in its own right, against the developer. This right to sue was extended to cover the contractor and the professional consultants inRSP Architects Planners & Engineers v MCST Plan No 1075[1999] 2 SLR 449(“RSP Architects”). However, a claim in contract would have to rely on the sale and purchase contract entered into by each subsidiary proprietor with the developer. 20        Up to the time when the preliminary issues were raised before Choo J, the pleadings stood as an action instituted by the appellant on behalf of all the subsidiary proprietors, even though by February 2004, the appellant knew from the affidavit of the respondent’s witness, Mr Jimmy Ho, that there were only 319 original purchasers who still owned units in the condominium. Moreover, the appellant did not appreciate that although there were 319 original purchasers, it did not mean that they had allipso factoauthorised the appellant to sue in contract on their behalf, and that specific authorisation was required from each original purchaser. No attempt was made to amend the pleadings and state explicitly on which of the subsidiary proprietors’ behalf was the action in contract taken. As rightly noted by Choo J, it did not necessarily follow that every subsidiary proprietor would sue in contract just because he had the right to do so. Neither had the appellant given the names of the subsidiary proprietors who had bought their units from the respondent and had voted at the AGM on 31 March 2002, authorising the management corporation to act. Accordingly, we agree with these observations made by Choo J at [6]–[7]: Some of the subsidiary proprietors, as counsel conceded, were sub-purchasers who had no contract with the [respondent]. Thus, it behoves the [appellant] to identify all the subsidiary proprietors on whose behalf it is suingin contract.… … Where a cause of action is to be founded on contract every party bound by that contract must be identified, and thus every subsidiary proprietor who had a contract with the [respondent] had to expressly authorise the [appellant] to sue on his behalf … 21        In the light of the pleadings and the factual matrix before Choo J, we think he was correct to rule the way he did. However, on 3 November 2004, the appellant sought to file a list setting out the names of 223 subsidiary proprietors who had purchased their units directly from the respondent and had authorised the appellant to claim on their behalf against the respondent in contract. The respondent objected to the inclusion of these documents on the ground that they were not a part of the record at the hearing below and it was too late to insert them now. 22        The respondent submitted that the appellant should have prepared the list very much earlier, well before the hearing before Choo J. If that had been done, the first issue would not have arisen. As far as admission of fresh evidence before the Court of Appeal is concerned, this is governed by ss 37(2), 37(3) and 37(4) of the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed) which read: (2)        … the Court of Appeal shall have … full discretionary power to receive further evidence by oral examination in court, by affidavit … (3)        Such further evidence may be given without leave on interlocutory applications, or in any case as to matters which have occurred after the date of the decision from which the appeal is brought. (4)        Upon appeals from a judgment, after trial or hearing of any cause or matter upon the merits, such further evidence, except as to matters subsequent as specified in subsection (3), shall be admitted on special grounds only, and not without leave of the Court of Appeal. 23        It is quite clear that if fresh evidence is sought to be admitted for the purpose of an appeal against a judgment delivered following a trial, s 37(4) will be applied. In order that such leave may be granted, special grounds must be established. To show such special grounds, the three conditions laid down inLadd v Marshall[1954] 1 WLR 1489must be satisfied, namely, first, it must be shown that the evidence could not have been obtained earlier with reasonable diligence; second, the evidence must be such that, if given, would probably have an important influence on the result of the case; and third, the evidence must be apparently credible although it need not be incontrovertible. 24        The rulings under appeal were, of course, not made after a trial. But were they made after the hearing of a matter on the merits? Arguably they were. The answers given by the court were on the merits on the basis of the pleadings. Therefore, the adduction of the proposed fresh evidence would require the fulfilment of the stringent conditions laid down inLadd v Marshall. In addition, and more importantly, the pleadings must also be amended. 25        Admittedly, the decision on the first issue would have the effect of striking out the appellant’s claim in contract on the ground that it had nolocus standito make the claim, as it failed to disclose on which of the subsidiary proprietors’ behalf the action in contract was instituted. There can be no doubt that the list is vital and could have been prepared earlier. Indeed, its timely preparation and production would have avoided the first issue being brought up as a preliminary issue. It seems to us clear that the list was not prepared earlier because of the perception on the part of the appellant that it was not necessary. The appellant did not appear to appreciate that its claim in contract on behalf of the subsidiary proprietors stands on a different footing from that of its own claim in tort as enunciated inOcean Front([16]supra).Thus, the appellant failed to satisfy the first condition laid down inLadd v Marshall. The fresh evidence could not be taken into account. In any case, the real problem was in the pleadings, as they failed to identify the specific subsidiary proprietors on whose behalf the claim in contract was made by the appellant. 26        As we have mentioned before, in the light of the state of the pleadings and the submissions before Choo J, he was absolutely correct to have made the ruling he did. The appellant had not shown then that it was representing, pursuant to s 116, specific subsidiary proprietors who themselves had a cause of action in contract against the respondent. However, this ruling cannot preclude the individual subsidiary proprietors from instituting a new action in contract against the respondent. Neither do we think that the appellant is precluded from instituting a new action in contract against the respondent for and on behalf of specified individual subsidiary proprietors who have such a claim against the respondent. The respondent conceded as much. 27        Accordingly, it seems to us that unless limitation has set in, there is much to be said in favour of the court granting leave to the appellant to amend the pleadings to properly set out the basis of its claim in contract, so that the trial of both causes, in contract, as well as in tort, can proceed together as the evidence will be common to both causes. It would not make much sense, if limitation has not set in, to compel the appellant, or the individual subsidiary proprietors with a claim in contract, to institute a fresh action. It would clearly be inexpedient to try the remaining portion of the present action, which is in tort, separately from the new action in contract to be instituted, as the evidence will be common to both. 28        While there is a Motion filed seeking leave of this court to amend the pleadings, to include the names of the subsidiary proprietors who have authorised the appellant to pursue the claim in contract, that Motion has been held back pending our ruling on this preliminary issue (as well as the second issue). As there appears to be some dispute as to whether the wording of the consent given by the 223 subsidiary proprietors is sufficient to authorise the appellant to continue with this action, and in order to ensure that the question of limitation is properly addressed, we think it would be more sensible that the Motion seeking leave of court to amend the pleadings be placed before the trial judge and we would so direct. 29        Before moving on to the second issue, it is necessary for us to consider the Court of Appeal decision inMCST Plan No 1938 v GoodviewProperties Pte Ltd[2000] 4 SLR 576(“Goodview Properties”), a case which the appellant has invited us to revisit. It is a basic principle of contract law that before one party may sue another for breach of contract, the first party must show that there is a contract between them. Because of this principle, this court had, inGoodview Properties, held that the management corporation, pursuant to s 116 of the LTS Act, could only sue on behalf of those subsidiary proprietors who had direct sale and purchase contracts with the developer and claim, in respect of defects to the common property, a proportionate part of the damages suffered. In other words, the damages awarded to the management corporation would abate corresponding to the ratio that the collective share value of the units owned by subsidiary proprietors of the units on whose behalf the action was taken bore against the total share value of all the units in the development. 30        At this juncture, we should add that with the enactment of the Contracts (Rights of Third Parties) Act (Cap 53B, 2002 Rev Ed) (“the CTP Act”) which came into force on 1 January 2002, the strict privity rule has been modified. Under this Act, a third party, under specified circumstances, can sue on the contract even though he is not a party. However, this Act is not applicable to the present case as it only applies to contracts entered into after it had come into force. 31        The appellant submitted that the rule of abatement enunciated inGoodview Propertiesshould be reviewed. It gave an example of a development with 100 units (assuming each unit is of the same share value) to show how the rule could work rather unfairly. Supposing of the 100 units, 60 were sold to the public, and of that, only 35 remained as direct purchases from the developer with 25 units having been sub-sold. The remaining 40 are being kept by the developer. Supposing further that the cost of repair would be $1m, then followingGoodview Properties, the management corporation would be awarded only $350,000 (based on the ratio of 35 out of 100), a sum which will be grossly inadequate to carry out the repairs. As the areas at which repairs are required are common property, it will not be possible to differentiate between the various common areas at which repairs are required to be undertaken, and the amount awarded would be clearly inadequate to carry out all the repairs. What is even more grotesque is that the developer, who retains 40 units, will stand to gain even though it has taken a contrary position. The thrust of the appellant’s argument is that regardless of the number of original purchasers who have authorised the management corporation to sue on their behalf, the management corporation should be entitled to recover full damages as if all the original purchasers had authorised the action. 32        We recognise these abnormalities. However, the ruling inGoodview Propertiesnecessarily flows from the principle of privity of contract as well as from the scheme of things under the LTS Act, as under s 13(1) thereof, each subsidiary proprietor is only a tenant-in-common of the common property to the extent of his share value. Nevertheless, the position is not as dire as the appellant makes it out to be. The management corporation could always sue the developer, the contractor and the professional consultants in tort for the defects to the common property as declared by this court inOcean Front([16]supra). While we acknowledge that a claim in tort is perhaps not as efficient as a claim in contract, it seems to us that a more comprehensive solution would be to await legislative intervention. The Legislature is far better equipped than the courts to deal with policy matters in the field of consumer protection which may require limitations or safeguards. A more limited solution might well be to amend the standard sale and purchase agreement prescribed in the Housing Developers Rules (Cap 130, R 1, 1999 Rev Ed) so as to confer upon the sub-purchaser of a unit a right to sue in contract pursuant to s 2(1)(a) of the CTP Act (see [30] above). 33        We have mentioned above that s 116 is a facilitative provision. So, also, is s 33(2) of the LTS Act which provides that: The management corporation may — (a)        sue and be sued on any contract made by it; (b)        sue and be sued in respect of any matter affecting the common property; (c)        sue in respect of any loss or damage suffered by a management corporation arising out of a contract or otherwise; and (d)        be sued in respect of any matter connected with the parcel for which the subsidiary proprietors are jointly liable. 34        Section 33(2) does not confer upon the management corporation a cause of action. It sets out in general terms the competence of the management corporation to sue or defend an action. However, for a management corporation to sue in contract, it must show that it has a cause of action, as it has in relation to a claim in tort: seeOcean Front([16]supra). 35        The appellant sought to rely on the decision of the High Court inProsperland Pte Ltd v Civic Construction Pte Ltd[2004] 4 SLR 129(“Prosperland”), which decision has recently been affirmed by this court in[2005] SGCA 12, to submit that all the more so the appellant should have a cause of action in contract against the respondent. The appellant argued in its Case:[1] The developer [inProsperland] had parted with the property and had no proprietary interest in the building, and yet still had the right to the contractor in contract, it is submitted that [a fortiori] a Management Corporation would have the power itself to sue the developer in contract for building defects using section 33 (2) (b) and (c) of Land Titles (Strata) Act. 36        The comparison of the present case withProsperlandis quite inapt. Here, the management corporation of the condominium (the appellant) has no cause of action in contract against the respondent. There is no analogy between this case andProsperland, where the developer had a cause of action in contract and the question there was whether the developer was entitled to claim for substantial damages for the breach of the building contract, even though at the time of the action the developer no longer owned the development. The issue hinged on whether the developer’s claim came within the exception propounded inDunlopv Lambert(1839) 6 Cl & Fin 600; 7 ER 824. That is an entirely different issue.",
        "Defence of “independent contractor”": "37        We now turn to consider the second issue. The general principle is that an employer is not vicariously liable for the negligence of an independent contractor, his workmen or agents in the execution of his contract:Charlesworth & Percy on Negligence(Sweet & Maxwell, 10th Ed, 2001) at p 156 andClerk & Lindsell on Torts(Sweet & Maxwell, 18th Ed, 2000) at p 249. This principle was applied inOcean Front([16]supra) andRSP Architects([19]supra). It would be different if it could be shown that the employer did not exercise proper care in appointing an independent contractor. In this latter event, liability would arise because of the employer’s own lack of care. 38        However, there are exceptions to this general rule. InSalsbury v Woodland[1970] 1 QB 324, the English Court of Appeal stated that there were two instances in which the employer of an independent contractor could be held liable for the acts of the latter. The first involved extra-hazardous acts, that is to say, acts commissioned by an employer that were so hazardous in their nature that the law had thought it proper to impose a direct obligation on the employer to see that care was taken. The second concerned dangers created by work done in or on a highway, when an employer had a duty to see that due care was taken for the protection of those who used the highway. 39        Non-delegable duties can also arise by statute,eg, the UK Occupiers’ Liability Act 1957 (c 31). There are also other exceptions, such as where an employer owes a duty to his employee to ensure that reasonable care is taken (Wilsons & Clyde Coal Company v English[1938] AC 57), where the case comes within the rule inRylands v Fletcher(1868) LR 3 HL 330 or where the matter concerns the withdrawal of support for neighbouring land (Bower v Peate(1876) 1 QBD 321). However, no general principle can be deduced as to the circumstances under which such non-delegable duty arises in common law: seeClerk and Lindsell on Tort(Sweet & Maxwell, 17th Ed, 1995) at para 5-50. InHughes v Percival(1883) 8 App Cas 443 at 447, Lord Blackburn said that the mere fact that the work delegated to the independent contractor was of a type that could cause harm unless care was taken, would not be sufficient to impose liability on the employer. 40        On the pleadings, the claim of the appellant in tort was on the basis that the respondent failed to exercise reasonable care and skill “in designing and/or building the [condominium] and/or supervising the construction and rectification works”. This was also the basis in counsel’s submission. Breach of specific statutory duty was not pleaded. This notwithstanding, the main argument made by the appellant to this court is that pursuant to the Housing Developers (Control and Licensing) Act (Cap 130, 1985 Rev Ed) (“the HD Act”) and the rules made thereunder, the respondent could not delegate to an independent contractor the duty of building the condominium in a good and workmanlike manner. However, other than making bald assertions, the appellant is not able to point to any specific provisions in the HD Act or the rules which have so provided. 41        We are unable to see anything in the HD Act or its rules which could be read to have the effect contended by the appellant. The HD Act is essentially a piece of legislation to control and license the business of housing developers. It has nothing to do with building standards. The law that relates to building standards is the Building Control Act (Cap 29, 1999 Rev Ed) (“the BC Act”) which regulates the design, supervision and construction of buildings, for example, stipulating that the building plans must be prepared by a qualified person (an architect or a professional engineer) who has the duty to ensure that the design complies with the prescribed standards, and that the plans must be approved before building works may proceed. The BC Act also contemplates the appointment of a builder by the owner to carry out the construction and that a qualified person should supervise the work of the builder. Thus, the BC Act does not contemplate that the design and erection of the building in a development would be undertaken by the owner or developer personally. In fact, it implicitly recognises that the owner/developer is not competent to undertake the tasks of designing the plans and supervising the construction. The BC Act expressly recognises that all those matters should be undertaken by competent professionals and contractors appointed by the developer. 42        However, it does not thereby follow that a purchaser of a unit has no remedy against the developer for faulty design or inadequate supervision by the architect or engineer whom the developer has appointed. The claim will be in contract and in respect of such a claim, the developer cannot plead in defence that he has engaged competent professionals to design the project and supervise its construction and an experienced contractor to build it. This is because the developer has, by contract, agreed to deliver a unit, or building, in accordance with the specifications, and if he should fail to do so, he is liable for breach of contract and should compensate the purchaser or purchasers of the units in the development. Of course, this does not mean that the developer is without a remedy against the architect/engineer or builder for either poor professional services or poor workmanship. The developer would have a claim against them in contract and, if it is more convenient, may bring them in as third parties to the proceedings instituted by the purchasers. 43        As would be apparent from our discussions on the first issue, for a buyer of a unit in a development to have a claim in contract against the developer, he must have purchased the property direct from the developer. If he should be a sub-purchaser, he would not have a claim in contract against the developer. However, there are ways to overcome this and it would depend on whether the project has been completed and title is legally passed to the original purchaser, and on whether the developer is agreeable to a novation agreement. In the alternative, the sub-purchaser could sue in contract if the original purchaser is willing to lend his name to being a co-plaintiff (subject always to the sub-purchaser indemnifying the original purchaser as to costs and other possible liabilities) to the action in contract. All these arrangements could be set out in the agreement for sub-sale from the original purchaser to the sub-purchaser, provided that the original purchaser is agreeable. At [32] above, we have also indicated that, for future developments, amending the standard sale and purchase agreement prescribed under the Housing Developers Rules could be a solution. 44        Counsel for the appellant has cited to us several cases from other jurisdictions to demonstrate that the developer has a special duty of care. These cases are not really helpful as they were decided either in the context of special legislative provisions or peculiar fact situations. They in no way lay down any general principle that an owner/developer is not entitled to rely on the defence of “independent contractor”. 45        Great reliance was placed by the appellant on the New Zealand Court of Appeal case ofMount Albert Borough Council v Johnson[1979] 2 NZLR 234(“Mount Albert”). There, a development company had a block of flats erected by a contractor. A subsequent purchaser of one of the flats discovered that the foundations were not what they should have been and sued the developer. The court held that the developer was negligent for failing to ensure that the foundations were adequate. The appellant cited the following passages, which it had wrongly attributed as having been uttered by Cooke J inMount Albert, but which were, in fact, taken from the English Court of Appeal case ofBatty v Metropolitan Property Realisations Ltd[1978] QB 554at 561 and 567: [T]he building of the house and its disposition was a co-operative effort by the first defendants and the second defendants, the second defendants doing the building, the first defendants providing the finance and being the party with whom the purchasers of the house, the plaintiffs, entered into contractual relations. … … … I have no doubt that it was the duty of the first defendants [the developers], in the circumstances of this case … to examine with reasonable care the land … in order to see whether the site was one on which a house fit for habitation could safely be built. It was a duty owed to prospective buyers of the house. 46        However, it is important to bear in mind that inMount Albert, the developer was found to be liable for the negligence of the builder because of the particular fact situation against the context of a rather lax legal framework. First, the developer signed the building permit both as owner and builder. Second, the construction work was carried out by a partnership, F&H, which worked solely for the developer and their relationship was described as “close and somewhat informal”. There was no written contract between them. Third, neither the developer nor F&H engaged any professional consultants. The court there identified the developer very much with F&H. It is significant to note that Cooke J recognised that there were no uniform criteria to determine when the employer could be held liable for the negligence of the builder and this was what he said (at 240): It is not easy to state clear principles about when an employer will be held liable in tort for the negligence of an independent contractor, as witness the difference of judicial opinion in the progress through Australian Courts ofStoneman v Lyons(1975) 8 ALR 173. Lord Reid’s observations inDavie v New Merton Board Mills Ltd[1959] AC 604, 646; [1959] 1 All ER 346, 367-368, in a cognate field testify to the difficulty of evolving hard-and-fast rules. InClerk and Lindsell on Torts(14th ed, 1975) para 262, Professor Jolowicz says, after reviewing the authorities, that in the result it seems that no general principle can be stated and that the various types of case must be dealt with individually. 47        In the passage above, Cooke J quoted fromClerk and Lindsellon Torts, (Sweet & Maxwell, 14th Ed, 1975). The passage from the current edition ofClerk and Lindsell on Torts([37]supra) at para 5-52, reads: If a non-delegable duty is found to exist at common law, then the employer of an independent contractor is as much liable for its breach as if the duty had been created by statute. The difficulty is, however, to know when such a duty does exist at common law. As Lord Blackburn made clear inHughes v Percival, the mere fact that the work delegated to the independent contractor is of a type that may cause harm, unless care is taken, will not be sufficient to impose liability on the employer. It would appear that no general principle can be stated and that the various types of case must be dealt with individually. 48        It is critical to bear in mind that inMount Albert, no competent professional consultant was engaged to advise on the various technical requirements. The position here is quite different, as the respondent engaged competent professional consultants to design and supervise the development/building contract, which engagement is also very much a requirement specified in the BC Act. 49        InAnglia Commercial Properties Ltd v South Bedfordshire District Council(1984) 2 Con LR 99, the court noted that no English case had gone as far asMount Albertto hold a building owner liable for the wrong of an independent builder. The court said at 105: I am bound to say that I take the view that a building owner at least, in contrast to an owner-builder, is not under any non-delegable or absolute duty to comply with the Building Regulations and, indeed, may well not be under any statutory duty at all. The Building Regulations unhappily make no provision as to whose duty it should be to comply with this or that regulation. 50        InD & F Estates Ltd v Church Commissioners for England[1989] 1 AC 177, Lord Bridge of Harwich clearly thought (at 209) that an employer who engaged a contractor to undertake building work would notprima faciebe liable for a dangerous defect in the work caused by the negligence of the contractor. If that was so, he opined that it would lead to absurd results. Commenting onMount Albert(at 210), he said that the conclusion reached there might be “entirely admirable” as a matter of social policy. But as a matter of legal principle, he said he could “discover no basis on which it [was] open to the court to embody this policy in the law without the assistance of the legislature” and that it would be “a dangerous course for the common law to embark” as unlike the Legislature “it [was] unable to set carefully defined limitations”. In the case itself, the House of Lords held that the builders were not liable for the negligence of their sub-contractor in carrying out the plastering because the builders’ only duty was to employ a competent plasterer, which they had done. 51        In the result, we would affirm the ruling of Choo J on the second issue. In passing, we should add that the appellant took the point that the builder was, in fact, not an independent contractor and that the builder was, in fact, the respondent’s agent. No evidence was tendered to substantiate this assertion. In fact, the builder engaged by the respondent is a contractor in the “G8-category”, the highest category in the building industry.",
        "Judgment": "52        Accordingly, we affirm the rulings of the trial judge on the preliminary issues and dismiss this appeal with costs and the usual consequential orders. However, for the reasons set out in [26] to [28] above, we direct that the application to amend the pleadings be placed before the trial judge. For the avoidance of doubt, we would state that the appellant should not be precluded from adding more subsidiary proprietors to the list or, in view of the controversy whether the consent given is adequate, obtaining fresh authorisation from the subsidiary proprietors. [1]At para 28"
    }
}