{
    "case_title": "Woh Hup (Pte) Ltd and Others v Lian Teck Construction Pte Ltd",
    "ncitation": "[2005] SGCA 26",
    "coram": "Chao Hick Tin JA; \n      Lai Kew Chai J; \n      Tan Lee Meng J",
    "sections": {
        "Background": "3          Pursuant to a contract between the appellants and the Land Transport Authority (“LTA”) on 7 August 2001 (“the main contract”), the appellants were made the main contractors in a project known as “Contract-825 – Design, Construction and Completion of Stations at Millenia (‘MLN’), Convention Centre, Museum (‘MSM’) and Dhoby Ghaut (‘DBG’) including Tunnels”. The appellants appointed the respondent, Lian Teck Construction Pte Ltd, as the earthworks subcontractor for the project by a letter of award dated 23 July 2002 (“the subcontract”). The subcontract included the Singapore Institute of Architects Conditions of Sub-Contract (“the Conditions”), which contained an arbitration clause (“cl 23”). 4          After six warning letters citing poor progress, poor overall performance and inexcusable delays by the respondent, the appellants terminated the part of the subcontract relating to earthworks at the MLN station by a letter dated 19 February 2004 (“the termination notice”). The respondent elected to treat the partial termination as a repudiation of the subcontract by the appellants, which repudiation the respondent accepted on 5 March 2004. 5          On 5 July 2004, the respondent filed an originating summons (“the application”) under O 24 r 6(1) of the Rules of Court (Cap 322, R 5, 2004 Rev Ed) (“the Rules”) for an order that the appellants give discovery of the following documents pertaining to the main contract: (a)        the letter of award issued to the defendants by the LTA (Item A); (b)        the main contract conditions and particular conditions (Item B); (c)        the main contract specifications (relating to earthwork only) (Item C); (d)        the original master programme and subsequent amended master programmes and all recovery programmes issued in respect of DBG, MSM and MLN (Item D); (e)        all applications for extension of time submitted by the appellants and all replies thereto (Item E); (f)         all minutes of site meetings in which the defendants were in attendance (Item F); (g)        all monthly progress reports in respect of DBG, MSM and MLN (Item G); (h)        all monthly records/documentation and/or concrete control sheets evidencing the concrete casting dates for each bore at DBG, MSM and MLN (limited to sub-structure only) (Item H); and (i)         all diaphragm wall records for DBG, MSM and MLN (Item I). 6          In an affidavit filed by the respondent’s director, Loh Teck Lok (“Loh”), in support of the application (“Loh’s first affidavit”), the respondent alleged that the appellants wrongfully partially terminated the subcontract, and that the respondent intended to refer the subsequent disputes that arose to arbitration pursuant to cl 23 of the Conditions. 7          The appellants’ project manager, Per Jonsson (“Jonsson”), filed an affidavit opposing the application on the grounds that,inter alia: (a)        the respondent had been given reasonable opportunity to inspect the main contract (Items A to C) (save for detailed prices of the appellants), as stated in p 13 of the preamble to the Conditions; (b)        the application was premature and unnecessary as cl 23 precluded the respondent from referring its dispute to arbitration until after the completion of the works, which was scheduled for 30 January 2006; (c)        in the light of the arbitration clause which bound both sides, the appellants were unlikely to be party to subsequent court proceedings; and (d)        the documents requested were largely irrelevant to the respondent’s purported claim against the appellant for wrongful termination. 8          In a second affidavit filed by Loh (“Loh’s second affidavit”), the respondent did what the trial judge described as a “volte-face”. Loh deposed that the respondent was no longer proceeding by way of arbitration because cl 23 did not necessarily have universal application to all of its claims, and the respondent intended to institute legal proceedings against the appellants in the High Court for work done under the subcontract estimated to be in the region of about $2.5m. In addition, the respondent had other claims against the appellants for damages, expenses and losses which might need to be assessed. 9          The application was heard on 4 August 2004 before an assistant registrar who granted an order in terms of Items A to D only (“the Order”). The trial judge dismissed the appellants’ appeal and affirmed the Order on the basis that the documents disclosed were to be used for court proceedings, should the respondent decide to pursue its claim against the appellants based on those documents. The trial judge also extended the time for compliance with the Order.",
        "The parties’ arguments and the decision below": "10        Before us, the arguments canvassed by the parties mirrored those raised in the court below. The appellants, asserting that the application was for pre-arbitral discovery, framed the following two issues in their appeal: (a)        Whether the court has power to order pre-arbitraldiscovery of documents; (b)        Whether the respondent’s application for discovery satisfied the requirements of O 24 rr 6 and 7 of the Rules. 11        Both parties had made submissions in the hearing below as to whether the court had the jurisdiction to order pre-arbitral discovery. The trial judge opined that the arguments made by counsel for the appellants, based on s 18 of the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed) (“SCJA”) read in conjunction with the First Schedule of the SCJA, O 24 r 6 and O 69 of the Rules, as well as s 31 of the Arbitration Act (Cap 10, 2002 Rev Ed), cast some doubt on whether the court’s inherent jurisdiction extended to ordering pre-arbitral discovery. However, the trial judge found it unnecessary to decide this issue as, upon her inquiry, counsel for the respondent had confirmed that it intended to commence a suit against the appellants. The trial judge further held that the appellants’ argument that the respondent’s intended legal proceedings would be stayed by reason of the arbitration provision was premature, as it was not for the court to decide at this juncture whether cl 23 should be upheld. 12        The appellants argued that the trial judge should have recognised that the application was, as it was originally brought, for pre-arbitral discovery. Alternatively, the trial judge should have considered the arbitration clause, and had she done so, she would have found that it bound the parties. In either case, the question of whether the court has jurisdiction to order pre-arbitral discovery had to be answered, and should have been answered in the negative. 13        The appellants again cited s 18 of the SCJA and para 12 of the First Schedule to the SCJA in support of their argument that the court did not have jurisdiction to order pre-arbitral discovery. Section 18 of the SCJA provides: (1)        The High Court shall have such powers as are vested in it by any written law for the time being in force in Singapore. (2)        Without prejudice to the generality of subsection (1), the High Court shall have the powers set out in the First Schedule. (3)        The powers referred to in subsection (2) shall be exercised in accordance with any written law or Rules of Court relating to them. 14        Paragraph 12 of the First Schedule, which sets out the additional powers of the High Court, states: Power before or after any proceedings are commenced to order discovery of facts or documents by any party to the proceedings or by any other person in such manner as may be prescribed by Rules of Court. 15        The appellants contended that the reference to “any proceedings” in para 12 of the First Schedule refers only to court proceedings as the SCJA is solely concerned with proceedings in the superior courts of Singapore. They supported this interpretation by reference to the use of the word “proceedings” in paras 4, 5, 6, 9, 10 and 19 of the First Schedule. Further, the court’s powers pursuant to s 31 of the Arbitration Act, which include the power to order discovery, can only be exercised in support of arbitration proceedings that have already commenced. Order 69 of the Rules, which regulates court procedure in relation to arbitration proceedings, also makes no reference to pre-arbitral discovery. Thus, they argued, the Rules do not prescribe any procedure for the grant of pre-arbitral discovery. This led to the conclusion that no power has been accorded to the High Court under the Rules to grant pre-arbitral discovery. 16        The appellants also cited case law rejecting the suggestion that the court has inherent jurisdiction to give discovery orders that are not prescribed by legislation: seeeg,Abraham v Law Society of Singapore[1991] SLR 761,AJ Bekhor & Co Ltd v Bilton[1981] QB 923andCox v Bankside Members Agency Ltd[1995] CLY 4122. 17In response, the respondent contended that the question as to whether the court has power to order pre-arbitral discovery was academic and irrelevant because: (a)        the application was for pre-actiondiscovery, which the court had power to order; and (b)        the court was unable to conclude at that stage whether any legal proceedings taken by the respondent against the appellants would be stayed in favour of arbitration. 18        The respondent asserted that, in any event, the court had jurisdiction to order pre-arbitral discovery. The respondent argued that the court’s powers under para 12 of the First Schedule and O 24 r 6(1) could be exercised in respect ofany proceedings, which encompassed both litigation and arbitral proceedings. Furthermore, the phrase “before or after any proceedings” meant that there need not be pending court proceedings before discovery could be ordered, nor did discovery have to be sought only for the purposes of court proceedings. The respondent also made the argument that the court’s powers pursuant to s 31 of the Arbitration Act could be exercised even before the commencement of arbitral proceedings and the constitution of the arbitral tribunal, and that O 69 r 3(2) supported this view. The respondent contended that under O 24 r 6(3), the affidavit in support of the O 24 r 6(1) discovery application need only statewhether(and notthat) the party from whom discovery was sought waslikelyto be a party to subsequent proceedings, and not that the partyhad to bethe party to subsequent proceedings. The party from whom pre-action discovery was sought might thus be a third party who was in possession of documents but was not likely to be a party to subsequent court proceedings. 19        The respondent claimed that if the court lacked power to grant pre-arbitral discovery, a plaintiff would be deprived of necessary material to enable him to ascertain if he had a claim suitable for arbitration, and this would hinder him from instituting arbitral proceedings. The respondent thus contended that even if the courts have no power to grant pre-arbitral discovery under O 24 r 6, the court must still have inherent jurisdiction under O 92 r 4 of the Rules to make any order as may be necessary to prevent injustice. 20        The respondent submitted, finally, that the trial judge was right to find that its application for discovery satisfied the requirements of O 24 r 6.",
        "The issues on appeal": "",
        "Whether the court has power to order pre-arbitral discovery": "Whether the application was for pre-action discovery or pre-arbitral discovery 21        It is helpful at this stage to clarify the terms “pre-action discovery” and “pre-arbitral discovery”. We are of the view that the term “pre-arbitral discovery” should be restricted to discovery sought before the commencement of arbitral proceedingsper se. Thus, any discovery prior to and for the purpose of commencing legal proceedings, including that sought by a party to an arbitration agreement, should still be termed “pre-action discovery”. 22        As the issue of the court’s jurisdiction to order pre-arbitral discovery had to be decided only if the application was for pre-arbitral discovery, the crux of the dispute before us related to whether the respondent’s application was for pre-arbitral discovery or pre-action discovery. It is useful, for the purposes of this determination, to set out the relevant portions of Loh’s affidavits in support of the application. 23        Paragraphs 7 and 8 of Loh’s first affidavit state: 7.         Sometime in or around February 2004, theSubcontract was wrongfully partially terminatedby the Defendants … Following this,disputes and differences arosebetween the Plaintiffs and the Defendants. Pursuant to Clause 23 of the Conditions of Subcontract,the Plaintiffs intend to refer these disputes and differences to arbitration.The Defendants are thus a likely party to the intended arbitration. 8.         The issues that are likely to arise in the arbitration are: (1)        Whether the Defendants wrongfully repudiated the Subcontract; (2)        If so, the quantum of damages payable to the Plaintiffs for,inter alia, loss of profit for the Subcontract Works; (3)        Whether the Defendants were responsible for acts of prevention which in turn caused delays or disruption to the Subcontract Works and if so, whether the Plaintiffs are entitled to claim prolongation costs arising therefrom; (4)        If so, the quantum of such prolongation costs payable to the Plaintiffs; (5)The value of work doneby the Plaintiffs (prior to the repudiation by the Defendants which remains due and outstanding. [emphasis added] 24        Paragraphs 3, 4, 5 and 8 of Loh’s second affidavit read as follows: 3.         For convenience and ease of reference, I shall adopt the abbreviations employed in my 1staffidavit and in Jonsson’s affidavit where appropriate. 4.         In reply to paragraph 6 of Jonsson’s affidavit, I need only say that having taken legal advice, the Plaintiffs do not necessarily regard the arbitration provision at Clause 23 of the Contract … as being of universal application to all the claims the Plaintiffs have or might have against the Defendants. 5.         The Plaintiffs do in fact haveclaims against the Defendants for work done under the Contract for which the Plaintiffs have not been paidand which the Plaintiffs regard as beingsuitable for litigation. Suffice it to say for the purposes of the present application, the Plaintiffs dointend to institute legal proceedings against the Defendantsin the High Court forsums which the Plaintiffs estimate to be in the region of about S$2,500,000.00. For avoidance of doubt, the Plaintiffs have otherclaims against the Defendants for damages, expenses and losses which may need to be assessed. It is therefore not correct for the Defendants to assume that they “are not likely to be party to subsequent proceedings in Court.” 8.         With regard to paragraph 9 of Jonsson’s affidavit, the Plaintiffs disagree that their application for discovery is premature and unnecessary as alleged. On the contrary, as stated above,the Plaintiffs have the option of instituting legal proceedings against the Defendants and do in fact intend to do so. The discovery provided by the Defendants will assist the Plaintiffs considerably in framing and particularising their claims against the Defendants. [emphasis added] 25        The appellants maintained that the application was, as originally brought, for pre-arbitral discovery, and argued that Loh’s second affidavit was but an attempt by the respondent, upon realising that the court lacked power to order pre-arbitral discovery, to introduce new grounds of discovery to buttress the failed application. The appellants claimed that Loh’s second affidavit had made no reference to the respondent’s intention to refer the wrongful termination dispute to litigation. The appellants thus alleged that it was the oral confirmation of respondent’s counsel, in response to the trial judge’s inquiry, that the respondent intended to commence a suit against the defendants for,inter alia, wrongful termination of the subcontract, that led the trial judge to make a qualified affirmation of the Order (see [9] above). The appellants thus alleged that the trial judge erred in law by taking into account evidence that was not disclosed on affidavit. 26        We were, however, unable to accept these contentions by the appellants. The fact that the respondent intended to sue the appellants in court had been expressly stated on affidavit. In our view, therefore, having regard to both of Loh’s affidavits which the court was entitled to take into account, the respondent’s application was ultimately for pre-action discovery. Applicability of the arbitration clause 27        The appellants submitted that, in the event that the trial judge accepted that the respondent intended to institute legal proceedings against the appellants, the trial judge ought to have considered the applicability of the arbitration clause to the disputes between the parties. As such, if the arbitration clause did not apply, the court could then proceed to consider whether the requirements of O 24 r 6 were met. Conversely, if the arbitration clause were operative, then the court would not have been able to grant discovery as it lacked the power to do so. 28        The appellants contended that the arbitration clause was extremely wide and bound the respondent to refer the disputes with the appellants to arbitration. The relevant extract from the arbitration clause, cl 23, reads as follows: Provided always that in caseany dispute or differenceexcept a dispute or difference as to rates of wages or conditions of employment of workmen employed by the Sub-Contractor in and for the purpose of this Sub-Contract including workmen employed by the authorised Sub-Contractor engaged directly by the Sub-Contractorshall arise between the Main Contractor and the Sub-Contractor, either during the progress or after completion of the Works, or after the determination, abandonment, or breach of this Sub-Contract,as to the construction of this Sub-Contract or as to any matter of[sic]thing of whatsoever nature arising out of, or, in connection therewith or as to the withholding by the main contractor of any payment certificate to which the Sub-Contractor may claim to be entitled, then either party shall give to the other notice in writing of such dispute or difference and such dispute or difference shall be referred to arbitration. … Such reference, except on the question of certificates shall not be commenced until after the completion or alleged completion of the works … [emphasis added] 29        The respondent, on the other hand, contended that the appropriate time at which to consider the scope of an arbitration clause would be upon an application to stay legal proceedings under s 6 of the Arbitration Act, which states: (1)        Where any party to an arbitration agreement institutes any proceedings in any court against any other party to the agreement in respect of any matter which is the subject of the agreement, any party to the agreement may, at any time after appearance and before delivering any pleading or taking any other step in the proceedings, apply to that court to stay the proceedings so far as the proceedings relate to that matter. (2)        The court to which an application has been made in accordance with subsection (1) may, if the court is satisfied that — (a)        there is no sufficient reason why the matter should not be referred in accordance with the arbitration agreement; and (b)        the applicant was, at the time when the proceedings were commenced, and still remains, ready and willing to do all things necessary to the proper conduct of the arbitration, make an order, upon such terms as the court thinks fit, staying the proceedings so far as the proceedings relate to that matter. 30        The respondent pointed out that under s 6(2) of the Arbitration Act, the court’s power to grant a stay is discretionary, andthe conditions in s6(2)(b) have to be met before the court may exercise its discretion to stay the action:Australian Timber Products Pte Ltd v Koh Brothers Building & Civil Engineering Contractor (Pte) Ltd[2005] 1 SLR 168(“Australian Timber Products”)andInterscope Versicherung Sdn Bhd v Sime Axa Assurance Bhd[1999] 2 MLJ 529.Thus, the court would not, at the hearing of an application for discovery, be able to conclude that a stay of legal proceedings (if instituted) in favour of arbitration would be granted, as there would be no way of predicting whether the s 6(2)(b) conditions would be satisfied. To determine the applicability of the arbitration clause at that juncture would effectively be pre-hearing a stay application brought in “through the back door”. 31        In the alternative, the respondent relied on the underlined portions of cl 23 to argue that the parties were, in any event, obliged to go to arbitration only on specific disputes,vizthose relating to the construction of, or any matter arising out of or in connection with the construction of, the subcontract, as well as disputes relating to the withholding by the appellants of payment certificates to which the respondent might claim to be entitled. Likewise, the moratorium in cl 23 only applied to such disputes. Consequently, cl 23 did not preclude the respondent from commencing legal proceedings at any time against the appellants for wrongfully terminating the subcontract. 32        We agreed with the respondent and the trial judge that it is not for the court hearing a discovery application to consider whether the arbitration clause applies. As the learned trial judge rightly held (at [36]), it was premature for the court at that juncture to decide if cl 23 should be upheld, as: If and when the [respondent] commenced its suit, the [appellants] could take this objection at the appropriate time. … It may well be that the court would refuse a stay of proceedings because the ambit of cl 23 did not cover the termination of the [respondent’s] sub-contract … The court’s jurisdiction to order pre-action discovery where there is an arbitration clause 33        It is clear to us that a party to an arbitration agreement may apply for discovery prior to commencinglegalproceedings, and that the court has jurisdiction to hear and grant the application for pre-actiondiscovery. It is trite law that an arbitration clause does not operate as a bar to commencing legal proceedings as parties may not have agreed to oust the court’s jurisdiction: seeeg,Australian Timber Products([30]supra)at 172. The trial judge thus had the power to grant the respondent’s application for pre-action discovery, notwithstanding the fact that the respondent was party to an arbitration agreement. 34        This does not mean, however, that parties to arbitration agreements may indiscriminately apply to the courts to obtain pre-action discovery. We are cognisant of the policy-related concerns raised by the appellants’ counsel, who has pointed out that allowing parties to an arbitration agreement to obtain pre-action discovery might potentially give rise to an abuse of process, since the court would not consider the applicability of the arbitration agreement at that juncture.The appellants also argued thatthe trial judge’s qualificationthat the disclosed documents be used only for court proceedings was of little assistance; such a qualificationmightnot sufficiently safeguard against the possibility that a party who had obtained discovery might subsequently institute arbitration proceedings, while falsely claiming that the arbitration proceedings were not premised on the documents disclosed. 35   There seems to be a conflict between a plaintiff’s need to know whether he has a likely cause of action and the prejudice that may be caused to the defendant who has given discovery if the parties end up going to arbitration instead. While the plaintiff may legitimately apply for pre-action discovery, the potential for abuse is particularly high wherethe arbitration clause is or is very likely to be operative. It appeared to us, therefore, that in circumstances where, on a plain literal reading, the arbitration clauseprima faciecovers the dispute in question, the court may refuse to grant discovery to prevent a possible abuse of process by the applicant. Such a refusal would be made without prejudice to a later court’s determination on the applicability of the arbitration clause. The court’s jurisdiction to order pre-arbitral discovery 36        In view of the appellants’ insistence that the application was for pre-arbitraldiscovery, it was unsurprising that their submissions before us, and accordingly, the respondent’s submissions, focused in the main on the question of the court’s jurisdiction to order pre-arbitral discovery. Like the trial judge, we were of the view that the appellants’ arguments cast some doubt on whether the court has the power under the Rules and/or its inherent jurisdiction to order pre-arbitral discovery. However, pre-arbitral discovery is, as defined in [21] above, limited to instances where discovery is sought by a party contemplating or intending to institute arbitration proceedings. Having found the respondent’s application to be for pre-action discovery, we agreed with the learned trial judge that it was unnecessary on the facts of the case to determine if the court has jurisdiction to order pre-arbitral discovery. Nevertheless, it appeared to us that any matter submitted to arbitration should, in general, and certainly wherever possible, be dealt with by the arbitral tribunal. To invoke the assistance of the courts prior to the commencement of arbitral proceedings may, in certain instances, appear to run contrary to the spirit and scheme of arbitration.",
        "Whether the application for discovery complied with the requirements of O 24 r 6(3)": "37        In the second of the two main issues set out by the appellants, counsel for the appellants alleged that that the respondent’s application failed in any event to satisfy the conditions for discovery. Principles of discovery 38        The relevant rules governing the court’s exercise of its discretion to allow or deny discovery are as follows. Order 24 r 6(3) of the Rules states: A summons under paragraph (1) or (2) shall be supported by an affidavit which must — (a)        in the case of a summons under paragraph (1), state thegroundsfor the application, thematerial facts pertaining to the intended proceedingsandwhether the person against whom the order is sought is likely to be party to subsequent proceedings in Court; (b)        or in any case, specify or describe the documents in respect of which the order is sought and show, if practicable by reference to any pleading served or intended to be served in the proceedings, that the documents arerelevantto an issue arising or likely to arise out of the claim made or likely to be made in the proceedings, or both, and that the person against whom the order is sought is likely to have or have had them in his possession, custody or power. [emphasis added] 39        Also, under O 24 r 7: On the hearing of an application for an order under Rule 1, 5 or 6, the Court may, if satisfied that discovery is notnecessary, or not necessary at that stage of the cause or matter, dismiss or, as the case may be, adjourn the application and shall in any case refuse to make such an order if and so far as it is of opinion that discovery is not necessary either for disposing fairly of the cause or matter or for saving costs. [emphasis added] 40        The guidelines for the court considering an application for pre-action discovery have been set out inKuah Kok Kim v Ernst & Young[1997] 1 SLR 169(“Kuah”) andBayerische Hypo- und Vereinsbank AG v Asia Pacific Breweries (Singapore) Pte Ltd[2004] 4 SLR 39(“Bayerische”). InKuah, the appellants were minority shareholders of a company. Their shares were valued in a non-speaking valuation by the respondent and sold to the majority shareholders. Upon obtaining a higher valuation for the shares from another accounting firm, the appellants requested that the respondent disclose its basis of valuation but the respondent refused. The appellants then applied under O 24 r 7A of the Rules of the Supreme Court 1990 (Cap 322, R 5, 1990 Rev Ed) (now O 24 r 6 of the Rules) for discovery of the working papers which the respondent had used or referred to in arriving at its valuation, so that they could determine whether to bring an action against the respondent for breach of contract or negligence. The trial judge varied the assistant registrar’s order granting the application to exclude the working papers created or prepared by the respondent. 41        The Court of Appeal, allowing the appellants’ appeal, held that in seeking pre-action discovery, the plaintiff had a duty to set out the substance of his claim to enable a potential defendant to know what the essence of the complaint was. The safeguards in O 24 r 6 of the Rules were to ensure that the plaintiff could not go on a fishing expedition. The supporting affidavit should state the cause of action, and it might be desirable but was not necessary to give particulars of it. Moreover, “material facts” did not mean all the facts sufficient to constitute the elements of the cause of action; it was enough for the plaintiff to state the facts sufficiently to explain why pre-action discovery was necessary. The documents would also be relevant under O 24 r 6(3)(b) to an issue arising or likely to arise in an intended proceeding if they fulfilled the purpose of the discovery,ie, for the plaintiff to find out if he had a good cause of action against the defendant. 42        InBayerische, four foreign banks in Singapore had purportedly extended loans of various amounts to the appellant, Asia Pacific Breweries (Singapore) Pte Ltd (“APB”). The finance manager of APB during that period, Chia Teck Leng (“Chia”), had deceived the banks into thinking that the borrower was APB, by forging the signatures of the directors of the company on various resolutions which purportedly signified the company’s acceptance of the loans and the appointment of Chia as the authorised sole signatory for the loans. Chia pleaded guilty to charges of cheating and forgery and was convicted. 43        The banks applied for pre-action discovery against APB under O 24 r 6(3) on the basis that they did not believe that APB had no knowledge of the unauthorised accounts and loans taken by Chia. The assistant registrar’s order granting the banks’ application was reversed by Belinda Ang Saw Ean J, who held that such disbelief was not a sufficient reason for seeking pre-action discovery. 44        Ang J went on to hold that in any event, the banks had failed to demonstrate that disclosure was necessary. If the court was satisfied that the O 24 r 6(3) criteria were met, the next consideration was whether discovery was necessary under O 24 r 7 for disposing fairly of the proceedings or for saving costs:Tan Chin Seng v Raffles Town ClubPte Ltd[2002] 3 SLR 345at [15]. The court had discretion under O 24 r 7 to refuse discovery of a document unless the necessity for its disclosure was clearly demonstrated. It was obvious that a document that was not relevant could not be necessary. Conversely, the mere assertion or fact that a document was relevant did not mean it was necessary. 45        Applying theratio decidendiofKuahandBayerische, the trial judge found that Loh’s affidavits satisfied the requirements of O 24 r 6(3). Order 24 r 6(3)(a): Grounds, material facts and likely party to proceedings 46        The appellants submitted that Loh’s second affidavit did not satisfy O 24 r 6(3)(a) as it constituted anabandonmentof the respondent’s original failed grounds for discovery, namely that the appellants’ wrongful termination of the subcontract was referable to arbitration. The references to unpaid work as well as other claims for damages, expenses and losses were but vague and tentative “surrogate grounds” which could not stand as grounds for discovery. On this basis, it was said that the respondent had failed to set out the substance of the intended claim against the appellants such as to enable the appellants to know the essence of the complaint against them. 47        In support of their point that the surrogate grounds were not stand-alone grounds for discovery, the appellants argued that in finding that the respondenthad stated the material facts pertaining to the intended proceedings, the trial judge (at [33]) was referringonlyto the respondent’s decision to proceed with a claim for wrongful termination, andnotto the claims for work done and damages. We found this assertion to be without merit, for the learned trial judge took both of Loh’s affidavits into account in concluding that the respondent had stated the material facts pertaining to the claims for wrongful termination and work done. The trial judge reiterated that Loh had, in his first affidavit, deposed that the subcontract was wrongfully partially terminated and set out the issues likely to arise from such a claim (albeit for arbitration), and had, in his second affidavit, deposed that the respondent had claims against the appellants for work done under the subcontract. The trial judge also noted that Loh had, in his first affidavit exhibited the relevant documents, including the termination notice. The appellants did not dispute the trial judge’s finding that the material facts relating to the wrongful termination claim were set out. Finally, the trial judge found that the appellants, as the authors of the termination notice, were fully aware that they were likely to be party to subsequent proceedings in court. 48        The respondent pointed out that, by asserting that the respondent had abandoned its original ground of discovery, the appellants deliberately shut their eyes to Loh’s first affidavit and focused solely on the second. On the other hand, the appellants ignored Loh’s second affidavit when insisting that the application was for pre-arbitral discovery. We found the appellants’ inconsistent and contradictory use of the evidence, based solely on what suited them best, to be unacceptable. If it was true, as the appellants asserted, that Loh’s first affidavit was abandoned by the second affidavit which was incapable of standing on its own,then the appellants could have attempted to strike out the latter, but they did not do so. The trial judge was thus entitled to read both of Loh’s affidavits together to find that the substance and essence of the respondent’s claim had been made outin compliance with O 24 r 6(3)(a). Order 24 r 6(3)(b) and O 24 r 7: Relevance and necessity 49        In addition to the portions of Loh’s affidavits reproduced at [23] to [24] above, para 10 of Loh’s first affidavit reads: [T]he documents enumerated … are required … as they will enable the Plaintiffs’ experts to assess with greater precision the acts of prevention committed by the Defendants and the effect of such acts of prevention on the progress of the Subcontract Works … [and] the extensions of time which might have been granted under the Main Contract in respect of the Subcontract Works … In this regard, the documents … are material, relevant and necessary. 50        And as stated in para 10 of Loh’s second affidavit: As regards paragraph 11 of Jonsson’s affidavit, the Plaintiffs’ position is that even if the documents requested do not directly concern the sub-contract works (which is not admitted), in construction contract disputes there is an undoubted relationship or link between the main contract works and sub-contract works since the latter derive from the scope of the main contract works … 51        The appellants contended that Loh’s second affidavit failed to comply with O 24 r 6(3)(b) in that it did not show that the documents previously sought in relation to arbitration for the alleged wrongful termination were relevant or necessary to the claims for work done, damages, expenses and losses. We found it pertinent, however, that Loh had deposed in hisfirstaffidavit that the respondent considered the value of work done (prior to the repudiation by the appellants), which remained due and outstanding, as one of the issues likely to arise in arbitration (see [23] above). In our view, the documents were therefore also specifically sought in relation to the respondent’s unpaid work, which the appellants categorised as a “surrogate” ground stated only in Loh’s second affidavit. 52        We were also of the view that the trial judge had expressly found (at [34] and [35]) that the respondent had shown that the documents were relevant under O 24 r 6(3)(b) to the claim for wrongful termination. The trial judge had held that the relevance of Items A to C,ie, the letter of award forming the main contract between the appellants and the LTA and the attendant conditions and specifications, was undisputed. The trial judge also found Item D, the original master programme and subsequent amendments, to be relevant, as the termination notice was based on a breach of cl 16(a)(iii) of the Conditions and it expressed the appellants’ disappointment with the respondent’s progress and overall performance throughout the duration of the subcontract. 53        Finally, the appellants ventured to argue that the trial judge had only addressed the relevancy of the documents sought and not their necessity. In our view, this argument ignored the trial judge’s holding (at [35]) that to found a claim for wrongful termination, the respondent “wouldneed to knowthe [appellants’] original master programme and any amendments in relation thereto to ascertain the basis for the issuance of the notice of termination and how the [respondent’s] overall performance had affected the progress under the master programme” [emphasis added]. The trial judge thus found discovery to be necessary. 54        In the premises, we found ourselves unable to agree with the appellants’ argument that the trial judge had exercised her discretion under a mistake of law, in disregard of principle, or under a misapprehension as to the facts, or that she had taken account of irrelevant matters, or that the decision reached was “outside the generous ambit within which a reasonable disagreement is possible”:Lian Soon Construction Pte Ltd v Guan Qian Realty Pte Ltd[1999] 2 SLR 233at [34]. To our minds, the appellants had not shown that the trial judge’s exercise of discretion in dismissing the appeal and affirming the discovery order fell within any of the above grounds.",
        "Conclusion": "55        The appellants had not, in our view, set forth a valid basis for their appeal, and had failed to demonstrate sufficient grounds on which this court should interfere with the trial judge’s exercise of discretion. We therefore dismissed the appeal in its entirety with costs. Appeal dismissed."
    }
}