{
    "case_title": "Jurong Town Corp v Wishing Star Ltd (No 2)",
    "ncitation": "[2005] SGCA 25",
    "coram": "Chao Hick Tin JA; \n      Lai Kew Chai J; \n      Woo Bih Li J",
    "sections": {
        "Introduction": "1          The appellant, Jurong Town Corporation (“JTC”), is a statutory body. The respondent, Wishing Star Limited (“WSL”), is a company registered in Hong Kong which carries on the business of a façade-cladding contractor. 2          JTC was developing the Biopolis which was to be a 185,000m² research complex housing key biomedical research institutes and biotechnological companies. The Biopolis was to comprise seven tower blocks and three basement levels. The vision for the Biopolis was that it would be a world-class biomedical sciences research and development hub in Singapore. As there was keen competition at an international level by various governments to promote their countries as such a hub, the Biopolis was to be developed on a fast track. Accordingly, the development of the Biopolis was to be completed within 19 months instead of the 30 months that a project of such a size would normally require. 3          The main contract was eventually awarded to Samsung Corporation (Engineering and Construction Group) (“Samsung”). An important part of the construction works was the façade works. The façade works were to be awarded by JTC to a nominated subcontractor (“NSC”). This meant that the NSC was to be nominated or selected by JTC after which the main contractor Samsung was obliged to enter into a contract with the NSC and be responsible for the NSC’s performance of the contract for the façade works, unless Samsung had valid objections against entering into such a contract. 4          JTC was assisted by its consultant, Jurong Consultants Pte Ltd (“JCPL”), which was a wholly-owned subsidiary of JTC. JCPL invited tenders for the façade works. WSL submitted its tender in April 2002. It was one of eight tenderers for the façade works. Its bid of $54m was the lowest. However, Samsung sought to dissuade JCPL from awarding WSL the subcontract for such works. Samsung was not familiar with WSL and WSL had no experience in doing such works in Singapore. Samsung preferred another subcontractor whose bid was for a much higher sum of $90m. This was the highest bid. The second lowest bid was $54,071,488. Notwithstanding Samsung’s views, the contract for the façade works was eventually awarded to WSL on 14 June 2002. However, Samsung resisted entering into any contract with WLS. 5          It was common ground between WSL and JTC that until Samsung entered into a contract with WSL, WSL’s contract remained with JTC. Eventually, for reasons which we shall elaborate below, JTC terminated its contract with WSL for,inter alia, misrepresentation and breach of contract. 6          WSL then commenced the present action against JTC for various reliefs, including damages for wrongful termination. Before the trial judge, JTC applied for the issue of misrepresentation to be tried first on the basis that if this issue was decided in JTC’s favour, it would be unnecessary to go into the various allegations of breach of contract. Notwithstanding WSL’s opposition to this application, the trial judge agreed to JTC’s application. After hearing evidence and submissions on the issue of misrepresentation, the trial judge decided that although WSL was guilty of misrepresenting some facts, JTC had not relied on the misrepresentations. Furthermore, the trial judge decided that JTC had affirmed the contract with WSL after it had knowledge of the misrepresentations: seeWishing Star Ltd v Jurong Town Corp (No 2)[2005] 1 SLR 339.JTC then appealed to the Court of Appeal against this decision. The rest of the trial was held in abeyance pending the outcome of JTC’s appeal.",
        "Issues": "7          The issues before us are: (a)        Whether certain representations made by WSL were false. If so, the following issues would be relevant. (b)        Whether the misrepresentations were made fraudulently. (c)        Whether JTC was induced by WSL’s misrepresentations to award the contract for façade works to WSL. (d)        Whether JTC had elected to affirm the said contract after it had become aware of the alleged misrepresentations.",
        "Main players": "8          As a number of people were involved, we set out below the names of the main players and their appointments: (a)        JCPL: (i)         Mao Whey Ying – Executive Vice-President (“EVP”) in charge of the Public Business Division (“PBD”) of JCPL. As EVP of PBD, she was also appointed as the Superintending Officer (“SO”) for all public sector projects undertaken by JCPL (save for demolition works). At any one time she might have been holding the appointment of SO for more than 100 projects concurrently. (ii)        Nick Chang Koong Chean – Principal Architect, Specialised Parks Department, PBD of JCPL. Appointed SO’s Representative of the Biopolis project. (iii)       Ong Tiong Beng – Vice President in JCPL. Appointed Project Manager (Building) of the Biopolis project. (iv)       Lim Lye Huat – Manager in JCPL. Qualified Internal Auditor certified by the Construction Industry Development Board. He is responsible for ensuring that all construction sites managed by JCPL comply with ISO standards. (b)        JTC: (i)         Dr Steven Choo Kian Koon – Board member of JTC. Also a member of Tender Board B of JTC between October 2001 and December 2002. Tender Board B was the ultimate authority approving the award of the contract to WSL. (ii)        Brigadier General (“BG”) Philip Su – Assistant Chief Executive Officer of JTC. (iii)       Spencer Lim – Deputy Director (Development & Marketing) of JTC. (iv)       Bruce Charles Wymond – Independent expert engaged by JTC. (b)        Samsung (i)         Harrison K H Park – Senior Project Manager in Samsung for the Biopolis project. (c)        WSL (i)         Carol Wen – Director of WSL. (ii)        Tong Che Hung (also referred to as C H Tong) – Architect by training. Initially assigned by WSL as Project Director of the Biopolis project and then reassigned as Senior Project Director. (iii)       Jack Koh – Assigned by WSL as Project Director for the Biopolis project when C H Tong was reassigned as Senior Project Director. (iv)       John Andrew Shillinglaw – Independent expert engaged by WSL.",
        "The representations": "9          JTC alleged that WSL had made ten representations knowing that such representations were false. The representations were: (a)        WSL had completed a curtain walling system of S$10m and above in a single project for the past five years; (b)        WSL had at least two project managers with 20 years’ experience for unitised curtain wall projects; (c)        WSL had a chief design manager with at least 20 years’ experience for unitised curtain wall projects; (d)        WSL’s facilities had an in-house production capacity of 10,000m² per month for curtain walls; (e)        WSL’s in-house facilities included a metal panel fabrication plant; (f)         WSL’s in-house facilities included a 3,000m² window and curtain wall plant; (g)        WSL’s in-house facilities included a 2,000m² stone fabrication plant; (h)        WSL’s in-house facilities included a 1,000m² polyester powder coating plant; (i)         WSL’s in-house facilities included a fluorocarbon coating workshop; and (j)         WSL’s in-house facilities included a test laboratory for cladding systems. We will refer to these representations as representations (a) to (j) for convenience. The representations were made in an introduction of WSL which was submitted with its tender and/or letters from WSL before the award of the contract to WSL. WSL did not deny making the representations. We would add that the representations about its in-house facilities were in respect of its facilities located in Wishing Star Industrial Park (“WSIP”) at Dongguan, Guangdong Province, in the People’s Republic of China (“China”). 10        JTC’s case was that JCPL discovered that the representations were false when JCPL made a visit to Chinabetween 10 to 14 July 2002. We will elaborate on this visit and other visits when we come to the issue of election and affirmation. 11        Tenderers for the façade works had to meet various evaluation criteria. The criteria were grouped under “Critical Criteria” and “Other Criteria”. 12        It was common ground that representation (a) about WSL having completed a curtain walling system of $10m and above in a single project was in respect of a project in China and this was in response to a criterion under the Critical Criteria. Although JTC had claimed that this was a misrepresentation before the trial judge, it eventually dropped this allegation before us. Accordingly, we need say no more about it.",
        "Whether the remaining representations by WSL were false": "Representation (b) – WSL had at least two project managers with 20 years’ experience for unitised curtain wall projects 13        Representation (b) was to meet item (i) of the Other Criteria. The trial judge did not make any finding as to whether this representation was true or not. 14        WSL’s position was that at the time of tender, it did have two project managers with 20 years’ experience for unitised curtain wall projects. These project managers were Mr Cheung Tak Ming and Mr Tony Tang Chi Fai. However, at the trial, WSL did not produce either of these persons as witnesses. 15        As regards Mr Cheung, WSL alleged that he had passed away but did not produce his death certificate. WSL sought to establish that he had been employed by WSL by relying on letters of offer of employment dated 16 October 1982 and 16 February 1983 from WSL to Mr Cheung. WSL also relied on payment vouchers for Mr Cheung’s monthly basic salary between March to September 2002 and a résumé. 16        We are of the view that even if the letters of employment were genuine, they do not help WSL very much especially since they were dated many years before 2002 and the offers of employment were for the post of chief designer and not project manager. The payment vouchers referred to Mr Cheung’s department as “Technical” and could easily have been fabricated. In any event, they did not show that he had had 20 years’ experience as project manager for unitised curtain wall projects. There was a handwritten résumé of Mr Cheung with words in Chinese and English. Even if this résumé were genuine, the English words therein mentioned that he had been a designer and a contract engineer during various periods but did not mention that he had been a project manager. We are of the view that Mr Cheung was not a project manager with 20 years’ experience for unitised curtain wall projects at the time of WSL’s tender. 17        As for Mr Tang, he had signed an affidavit of evidence-in-chief for WSL but, as mentioned above, he was not produced as a witness either. No satisfactory explanation was given for this omission. WSL sought to establish that he was their employee with the requisite experience in the same manner as it did for Mr Cheung. There was a WSL letter offering employment to Mr Tang dated 20 November 2001. This letter mentioned the position of project manager and was apparently signed by Mr Tang to signify his acceptance of the offer. There were also similar payment vouchers for Mr Tang’s monthly basic salary between March and September 2002 but apparently no résumé. We find this evidence inadequate. 18        In addition, when representatives from JTC went to visit WSIP on 3 September 2002, C H Tong was queried on WSL’s project managers and chief design manager. The names Mr Tong provided then were different from those which WSL raised for the trial. We will elaborate on this later. 19        In the circumstances, we are of the view that Mr Tang was also not a project manager with 20 years’ experience for unitised curtain wall projects at the time of WSL’s tender. 20        Accordingly, we are of the view that representation (b) was false. Representation (c) – WSL had a chief designer with at least 20 years’ experience for unitised curtain wall projects 21        Representation (c) was to meet item (l)(i) of the Other Criteria. The trial judge did not make any finding as to whether this representation was true or not. 22        WSL’s position was that it did have such a chief designer by the name of Andy Chan Chung Shing at the time of tender. However, again, WSL did not produce Mr Chan as its witness although Mr Chan had filed an affidavit of evidence-in-chief as did Mr Tang. 23        WSL also relied on similar evidence to prove that Mr Chan was a chief designer with the requisite experience. There was a letter dated 22 January 1985 from WSL to Mr Chan offering him employment as a design engineer trainee and a letter dated 22 April 1985 from WSL to Mr Chan stating that he had completed his probation. There were payment vouchers for Mr Chan’s monthly basic salary between March and September 2002 and his résumé. According to the résumé, Mr Chan had working experience as a summer trainee with Fong Shing Cotton Mill between July and August 1980. He was also a summer trainee with Charles Haswell & Partners Consulting Engineers between July 1982 to August 1982. The résumé did not say that the summer training was for design work. Neither did it show what work experience he had acquired between September 1980 and June 1982 and between September 1982 to January 1985 when he was purportedly employed by WSL as a design engineer trainee. Furthermore, as mentioned above, C H Tong had mentioned a person with a different name as WSL’s chief designer during JTC’s visit to China. 24        In the circumstances, we are of the view that Mr Chan was not a chief designer with the requisite experience at the time of WSL’s tender. Accordingly representation (c) was false. 25        There is one other point we would mention. WSL submitted that Nick Chang had admitted in cross-examination that WSL probably had the relevant personnel at the time of tender. This submission is not accurate. Nick Chang’s evidence was as follows:[1] Q:         … Wishing Star never had these people mentioned in their employment? A:         If they are able to call out the names specifically and with the degree next to it, I mean, I would believe that these people probably had been hired before or still are there, I am not sure. 26        In any event, Nick Chang had no personal knowledge whether WSL had the project managers and chief designer as claimed by WSL. At most, he was merely venturing his personal opinion. Representation (d) – WSL’s facilities had an in-house production capacity of 10,000m² for curtain walls and representation (f) – WSL’s facilities included a 3,000m² window and curtain wall plant 27        Representation (d) was to meet item (n) of the Other Criteria. In addition, WSL also made representation (f). It seems that representation (f) was connected with representation (d) because (f) dealt with the floor area of WSL’s curtain wall plant while (d) dealt with its production capacity. 28        WSL asserted that representation (d) applied only to the mullions and transoms but not to the cladding itself. A mullion is a vertical bar between the panes of glass in a window, while a transom is a strengthening crossbar set above a window. Cladding refers to the covering of the wall. WSL’s position was that its plant could produce 10,000m² of mullions and transoms per month. It relied on the evidence of its expert Dr Shillinglaw that the definition of “curtain wall” included only the mullions and transoms. 29        The trial judge was of the view that while Dr Shillinglaw’s explanation was plausible, the evidence on the whole suggested that when the parties referred to the curtain wall, the reference was to the entire curtain wall, cladding and all. WSL asserted that the trial judge had erred in his conclusion. Besides relying on Dr Shillinglaw’s evidence, WSL raised the following arguments. 30        WSL submitted that Nick Chang had explained that the 10,000m² capacity was based on an estimate of the area of the total façade for Phase 1 which involved Blocks 1, 3 and 4 that were 30,000m² in size and approximately three months would be required to produce the curtain wall components. This worked out to 10,000m² per month. WSL submitted that hence its representation of the 10,000m² requirement was meant to be generally indicative of its approximate curtain wall production capacity. 31        WSL further submitted that the 10,000m² criterion had to be evaluated against the project’s curtain wall requirements as they stood at the time of tender. It alleged that, at that time, there was no requirement for aluminium cladding for Blocks 1, 3 and 4; instead, only granite panels were required for Blocks 1 and 4. The project’s quantity summary showed that at the time of tender there was no requirement for any aluminium cladding for Blocks 1, 3 and 4. As the 10,000m² criterion was based on the area of the façade for Phases 1, 3 and 4, the parties could not have contemplated the inclusion of aluminium cladding as part of this criterion. 32        WSL also relied on a letter dated 12 July 2002 from C H Tong to JCPL. In that letter, the focus was on mullions and transoms. Also, JCPL did not disagree with WSL’s position that the 10,000m² was a reference only to the mullions and transoms in its letter of award dated 14 June 2002. 33        WSL then referred to various specifications to support its argument that there was a clear distinction between the terms “curtain wall” and “external wall cladding”. 34        Lastly, WSL relied on thecontra proferentemrule to argue that any discrepancy or ambiguity should be resolved in its favour. 35        It seems to us that the key to the issue raised by WSL is whether JCPL was inviting bids for a curtain wall only,ie, without the cladding or a system comprising both curtain wall and cladding, and whether WLS was making a bid for the former or the latter. The specifications which WSL relied on did not assist its submissions because JCPL could have invited bids for the curtain wall only or for both curtain wall and cladding. 36        From the various tender documents and WSL’s own tender submission, it is clear to us that JCPL was inviting bids for both curtain wall and cladding and WSL was making a bid for such a system. The award was for such a system. 37        Secondly, if WSL was not intending to make any representation as to the cladding, how was it that its other representations like representations (e) and (g) were in respect of a 2,000m² metal panel fabrication plant and a 2,000m² stone fabrication plant? 38        Thirdly, if JCPL was not inviting bids for the cladding from this exercise, then there would have been another tender exercise for the cladding and the award of another contract for such work. Yet there was no suggestion at all that an additional tender exercise had been undertaken by JCPL or that another contract was awarded separately for the cladding. 39        As for the letter dated 12 July 2002 from C H Tong to JCPL, it is true that it focused on mullions and transoms. However, it did not say cladding was excluded. 40        As regards WSL’s submission that aluminium cladding was initially not required for Phase 1, it is our view that that is beside the point. The specifications mentioned both aluminium and stone cladding. What the Other Criteria called for was an in-house production capacity of 10,000m² for curtain walls which, we find, included cladding. Whether such a capacity was eventually really necessary is a separate matter. This was not a case where WSL had said to JCPL, when submitting its tender, that such a capacity was unnecessary because of the specifications for the scope of the work for Phase 1. WSL knew that such a capacity was one of the Other Criteria and represented it had such a capacity when it did not have it. 41        Accordingly, in our view, the application of thecontra proferentemrule does not arise. For the reasons stated above, we see no reason to disturb the trial judge’s finding on this issue. 42        As for representation (f), we make no finding on it because there was a dearth of submissions on it. Representation (e) – WSL’s in-house facilities included a 2,000m² metal fabrication plant 43        JTC submitted that representation (e) was to meet items (n) and (o) of the Other Criteria. Item (n) states that tenderers must have an in-house production capacity of 10,000m² per month. Item (o) states that tenderers must have an in-house production floor area of at least 2,500m². It seems that representation (e) was meant to meet item (o) of the Other Criteria although representation (e) had a shortfall in the floor area required. Item (n) of the Other Criteria was already addressed by representation (d). 44        The trial judge found that WSL’s facilities comprised a two-storey building with just over 1,000m² on each floor. He was also of the view that the photographs produced of this building put an end to the debate because they showed the empty interior of the building with two machines inside. It was clear to the trial judge that a building which might potentially be a metal fabrication plant is not such a plant. 45        WSL submitted that the initial amount of metal panels required was small and this was significantly increased only after the award of the subcontract to it. It also said that it had intended to farm out the metal fabrication work in view of the small quantity required initially. It further submitted that it would not take more than four weeks to set up a workshop that could undertake the increased metal panel fabrication. It said that the real issue was whether it could equip its plant to accommodate the increase in metal panels in time to meet its obligations. 46        We are of the view that these are not valid arguments. At the time of WSL’s tender, WSL did not say that it could come up with the necessary metal panel fabrication facility if more aluminium panels were required. Neither did it say that it intended to farm out such work based on the initial quantity of aluminium panels required. It represented that its in-house facilities included a 2,000m² metal panel fabrication plant. 47        We come now to WSL’s other submissions on this representation. WSL submitted that part of the metal panel fabrication was located at its Plant 4 which JCPL’s inspection team had declined to visit during JCPL’s first visit to WSIP between 10 to 14 July 2002. It also submitted that JCPL’s team had not physically entered the metal fabrication plant to verify the equipment contained therein. 48        We find these other submissions disingenuous. The evidence of Ong Tiong Beng was that he and Lim Lye Huat did go to Plant 4 but they found it empty. Furthermore, while it is true that they did not actually go in, they were at the door and could see inside. During a subsequent visit by JTC on 3 September 2002, two machines were found inside. As the trial judge said, whether the presence of two machines made the building not “virtually bare” is a quarrel that need not be dwelt on. 49        We would add that whether these two machines were in fact essential pieces of equipment comprising the break press and press fold, as alleged by WSL, is irrelevant. WSL had represented that they had a 2,000m² metal panel fabrication plant and not two essential pieces of part of a plant. 50        Accordingly, we see no reason to disturb the trial judge’s finding that representation (e) was untrue. Representation (g) – WSL’s in-house facilities included a 2,000m² stone fabrication plant 51        Representation (g) was not in response to any particular item of the Other Criteria although stone cladding was mentioned in the specifications. The trial judge did not make any finding in respect of representation (g). 52        WSL submitted that it did have the stone fabrication plant although this plant was not located at WSIP. According to C H Tong, WSL had such a plant within six and a half hours from WSIP. WSL submitted that therefore its representation to JCPL was substantially accurate. 53        It is clear to us from the photographic evidence produced for JTC and from WSL’s own evidence that WSL did not have the in-house stone fabrication plant it had represented. As for the claim that WSL had such a plant six and a half hours away, this was a bare assertion which we do not accept. Accordingly, we are also of the view that representation (g) was untrue. Representation (h) – WSL’s in-house facilities included a 1,000m² polyester powder coating plant and representation (i) – WSL’s in-house facilities included a fluorocarbon coating workshop 54        Item (p) of the Other Criteria states that tenderers must have direct control over a painting plant (preferably in-house). Clause 2.3.9.3(b)(vi) of the supplementary specifications refers to a fluorocarbon coating system. It appears that both representations (h) and (i) overlap as we will elaborate below and that they were meant to meet item (p) of the Other Criteria read with specifications such as cl 2.3.9.3(b)(vi). 55        The trial judge noted that JTC had adduced evidence to rebut the representations about a powder coating plant and a fluorocarbon coating plant and he found that WSL did not have these facilities. 56        WSL submitted that at the time of tender, it did have a powder coating facility which could be used for fluorocarbon coating purposes. This could be used for carrying out two-coat fluorocarbon coating but not the three-coat fluorocarbon coating required for the façade works. WSL added that this was drawn to JCPL’s attention at a meeting on 20 May 2002,ie, before the award of the contract to WSL on 14 June 2002. WSL alleged that it was only by a letter dated 21 May 2002 that JCPL clarified that the coating specification was for a three-coat fluorocarbon paint with a certain minimum thickness. 57        WSL’s position was that when it learned about the requirement of three coats, it dismantled its existing powder coating facility to make way for a new fluorocarbon coating facility. The dismantling was done after the letter of award. 58        However, the photographs which JTC relied on show a different picture. There was a large shed which was enclosed on three sides. The beams of the shed appeared new. Parts of the ground inside the shed were covered with grass. WSL admitted it did not have any evidence of the dismantling of the powder coating plant. 59        In our view, the photographs show a new facility which was being put up. The alleged powder coating plant did not exist at the time of WSL’s tender. Accordingly, we see no reason to disturb the trial judge’s finding on this issue. Whether there was a genuine misunderstanding or not about the need to have a facility for a three-coat fluorocarbon paint, the fact is that WSL misrepresented even the existence of a powder coating plant in WSIP. Accordingly, its representation that it had an in-house fluorocarbon coating workshop was also untrue. Representation (j) – WSL’s in-house facilities included a test laboratory for cladding systems 60        The requirement for tests to be carried out is found in cll 4.15.1 to 4.15.8 of the supplementary specifications and not in the evaluation criteria. Representation (j) was meant to meet these specifications. 61        The trial judge noted that JTC had adduced evidence to rebut the representation of an in-house test laboratory and he found that WSL did not have this facility. 62        WSL submitted that it did have a fully computerised test laboratory for cladding systems at the time of tender. 63        First, it relied on purchase records. The purchase records comprised invoices, some in English and some in Chinese. The ones in English were issued by M/s J A Shillinglaw & Associates and related to various items of equipment, a start-up fee and the submission of drawings for a test chamber and equipment at Dongguan. They were issued in 1998. In our view, these documents fall short of demonstrating that there was a fully computerised test laboratory at WSIP at the time of tender. 64        Indeed, C H Tong said in his Affidavit of Evidence-in-Chief that there was a test chamber and a booth. He said he had explained at a meeting after an inspection during a third visit to China that the test laboratory was located in an open area within WSIP. For security reasons, the test equipment such as transducers, connection cords and computers would not be stored in the test chamber. The air compressors were stored in a store room at the back of the observation booth. He said he had shown the inspection team all the hardware fixed to the test chamber. 65        WSL also relied on the views of its expert Dr John Andrew Shillinglaw who stated in para 6 of his third Affidavit of Evidence-in-Chief dated 10 November 2003 that “[t]he WSL test facility is and was fully operational”. 66        It is our view that this sentence was taken out of context by WSL. Paragraph 6 of the affidavit states: I refer to paragraph 2.1.12 [of Bruce Charles Wymond’s report] Performance Testing and paragraph 6.10 Inadequate Mock Up Test Facilities. The paragraph 2.1.12 is a description of the testing required to be executed on various samples of the curtain walling for this project.I note all the tests were to be carried out at a test facility in Singapore. In paragraph 6.10 Mr Wymond implies that the WSL test facility in China was not “able to be used for testing the curtain wall”.I would opine that it was never intended to be used for the Biopolis Project testings.The WSL test facility is and was fully operational. All the equipment is kept in the factory for security reasons. The facility was used to conduct a test for a Palmer Turner (Architects) project in November 2002. WSL do not have an aero engine at their test facility. I note this test was not required for the Biopolis Project test regime. [emphasis added] 67        Paragraph 6 does not make it clear when Dr Shillinglaw made his inspection. In any event, his view that WSL’s test facility in China was fully operational was given in the context of using that facility for a different project in November 2002. Indeed, he stressed that it was “never intended to be used for the Biopolis Project testings”. He also noted that such tests were to be carried out in Singapore. However, para 11 of a letter dated 25 April 2002 from WSL to JCPL stated that “[a]ll necessary mock-up testings will be carried out in WSL’s computerized control curtain wall/cladding test laboratory in WSL’s industrial park”. 68        In the circumstances, we do not accept C H Tong’s explanation about having to keep equipment elsewhere for security reasons. It is clear to us that WSL did not have the test facility in WSIP for the Biopolis project which it represented it did. Representation (j) was untrue and we see no reason to disagree with the trial judge’s finding on it.",
        "Whether the misrepresentations were made fraudulently": "69        The trial judge was of the view that WSL had been overly optimistic about its facilities. He did not make a finding that WSL was guilty of fraudulent misrepresentations. However, it should be remembered that the trial judge found only that representations (d), (e), (h), (i) and (j) were untrue. He did not make any finding on representations (b), (c), (f) and (g). 70        Out of the remaining nine representations which are still in issue before us,ie, after excluding representation (a), we have found that eight of the representations were untrue. As mentioned above, we make no finding as regards representation (f). Even if we were to confine ourselves to the representations which the trial judge found to be untrue, it seems to us, with respect, that the trial judge was being euphemistic. It is clear to us that WSL made these representations knowing that they were untrue. They were made fraudulently. We are also of the view that WSL made the other untrue representations,ie, representations (b), (c) and (g), fraudulently.",
        "Whether JTC was induced by WSL’s misrepresentations to award the contract for façade works to WSL": "71        The next issue is whether JTC was induced by WSL’s misrepresentations to award the contract for façade works to WSL. As mentioned above, JTC was at all material times assisted by JCPL. 72        JTC relied onPanatron Pte Ltd v Lee Cheow Lee[2001] 3 SLR 405(“Panatron”). In that case, L P Thean JA found the case ofJEB Fasteners v Marks, Bloom & Co[1983] 1 All ER 583 instructive. He then said, at [23]: Reverting to the case at hand, as found by the judge, the misrepresentations had been made by Phua, and Lee and Yin respectively had been induced by the misrepresentations to invest in Panatron.The misrepresentations need not be the sole inducementto them, so long as they had played a real and substantial part and operated in their minds, no matter how strong or how many were the other matters which played their part in inducing them to act and invest in Panatron. If inducements in this sense are proved and the other essential elements of the tort are also made out, as is the case here, then liability will follow. [emphasis added] The above principle was not disputed by WSL. 73        The trial judge noted that there was a distinction between the items under the Critical Criteria and those under the Other Criteria. He agreed with WSL’s submission that non-compliance with an item under the former would have ended the prospect of further evaluation whereas non-compliance with an item under the latter would not rule out a tenderer’s chances entirely. He also noted that there could have been minor non-compliance under the Other Criteria, for example, if WSL had said that it had a project manager with experience of 19 years and six months instead of the 20 years’ experience required. 74        The trial judge was of the view that in a case like the present, generally proposals and counter-proposals would be exchanged and become terms of the contract. These must be subject to the law relating to breach of contract and not misrepresentation. Otherwise, every breach of such a contract in itself would be an actionable misrepresentation. He, therefore, took a stricter view as to whether there was misrepresentation in law in a construction contract. 75        The trial judge also concluded that there was no evidence before him which inclined him to find that JTC was induced into awarding the contract to WSL because of one or more of WSL’s misrepresentations. He said in his grounds of decision ([6] above) at [12]: In a contract of this size and nature, there are very few considerations that stand out to be the one article that clinches the deal. All conditions and factors had to be weighed and considered in totality. But if there were a single most important item in the present case, it would be the fact that the plaintiff’s was the lowest tender at $60,000,000 [sic]. The next closest, but by a long way, would have been the representation that the plaintiff had experience in a project of at least $10,000,000. 76        It is our view that the trial judge erred in concluding that as the misrepresentations would have become part of the terms of the contract, JTC’s cause of action was for breach of contract. Section 1 of the Misrepresentation Act (Cap 390, 1994 Rev Ed) states: Where a person has entered into a contract after a misrepresentation has been made to him, and — (a) the misrepresentation has become a term of the contract; or (b) the contract has been performed, or both, then, if otherwise he would be entitled to rescind the contract without alleging fraud, he shall be so entitled, subject to the provisions of this Act, notwithstanding the matters mentioned in paragraphs (a) and (b). 77        It is also our view that the trial judge erred in concluding that because the representations would have become terms of the contract, a stricter view should be taken before such representations become actionable. 78        Further, it is immaterial in law whether a construction contract or some other contract is involved. A construction contract may, generally speaking, make findings of misrepresentation more difficult than, say, a simple contract to purchase a car. However, that is a different point from imposing some sort of higher threshold for construction contracts. 79        We come now to the trial judge’s view of the relative importance of the requirements under the Critical Criteria and the Other Criteria. While we do not quarrel with the distinction between the importance of requirements under the Critical Criteria and those under the Other Criteria, it is our view that the requirements of the Other Criteria were still important although relatively less important than those of the Critical Criteria. 80        To elaborate, while it is true that failure to meet a requirement of the Other Criteria would not necessarily have doomed a tender, this would depend on the nature and the extent of the failure. The trial judge gave an illustration regarding the requirement to have two project managers with requisite experience of 20 years. He considered experience of 19 years and six months to be an unimportant failure. However that is not what transpired here and, hence, with respect, the illustration is not apt. Surely a tenderer like WSL knew that if it had said it did not have any project manager of 20 years’ or close to 20 years’ requisite experience, its chances of success would be jeopardised. 81        Then, let us suppose that WSL had also said it did not have the following in respect of some other requirements under the Other Criteria: (a)        a design manager with 20 years’ requisite experience; (b)        an in-house production capacity of 10,000m² per month for curtain walls (and cladding); (c)        an in-house 3,000m² window and curtain wall plant; (d)        an in-house 2,500m² metal panel fabrication plant; (e)        a painting plant (preferably in-house). What would WSL’s chances have been? We accept the evidence and submission for JTC that it would be a distortion of the tender process if tenderers were not competing on a level playing field and a tenderer was able to submit a price lower than other tenderers due to its non-compliant tender without revealing the non-compliance. Therefore, it seems to us that with the above additional omissions, WSL would not have even got its foot in the door notwithstanding its price unless the evidence demonstrates that JCPL did not in fact consider all these requirements important or had waived them. 82        We now come back to the trial judge’s finding about the dominance of the price factor. WSL sought to support this finding by relying on other evidence from JCPL. However, it seems to us that such evidence did not go as far as WSL was advocating. We need refer only to some of the evidence which WSL relied on. 83        For example, WSL relied on an e-mail dated 28 May 2002 from Nick Chang to Spencer Lim which said: Spencer, My analysis of our recommended contractors is very much in-line with tiong beng email to you. This is because we have spent so many hours debating over pros and cons of each tenderers.The underlying fact is that we have $54M[to]work on, the choice is apparent when we have no strong ground to reject WS. Perhaps, the only thing we could learn from this saga is to have a close/invited tender at first. Working with WS means we have to devote more hours and manpower to make sure they have not slip off their program. WS team is new, their learning curve time is longer, they may face difficulty dealing with SC. this are real and practical problem that will erode the essence of time. The way to make sure that they deliver what they promised is to deploy additional site staff to watch over their team consistently. We like to discuss further whether we can have a contingency sum (say 5% on top of the $4.5M) to deploy more of our site staff to mediate the tension between SC and WS. In conclusion, we cannot guarantee WS performance, we also cannot just judge their performance merely during tender evaluation. What JCPL can commit is that we will put forward the best team to complete this project in time. Thanks Nick Chang [emphasis added] 84        In our view, this e-mail does not support WSL’s contention. On the contrary, it is against such a contention. It shows that Nick Chang considered WSL’s price to be important because he did not think there was any strong reason to reject WSL’s tender. 85        Another example is the evidence of Mao Whey Ying. WSL’s written case relied on the following transcript: Q:         “Not an easy paper as ODG members have differing opinions.” What are the different opinions referred to here? A:         It is a difficult paper in the sense that there is reservation about Wishing Star. Samsung although did not state clearly, exactly, what is wrong with Wishing Star, had many letters which were already sent to JTC.But when we checked through all the tender criteria, Wishing Star’s submission appeared to satisfy all the tender evaluation criteria and they are the lowest tender price. That is why we mention it is not an easy paper. If we are going to knock out – either way, if we nominate Wishing Star, we have a little bit of reservation ourselves, based on this letter. But if we do not recommend Wishing Star and recommend anybody else, especially Diethelm, which is much higher price,we do not have enough evidence to inform the tender board or JTC why Wishing Star should not be selected. Q:         Let me be very clear about this. The price was a very important factor; correct? A:         Yes, as in all government tenders,the price is always one of the criteria, after satisfying all the tender criteria set out in the document. If – may I add? Q:         Yes. A:         You see,when the tenderer satisfies all the criteria as set out in the tender document, we consider them as bona fide tender submission, and if that is the case, then normally, price would be the most important criteria. Q:         In fact, I would suggest to you here that price was the overriding criteria, because there was already a budget of 60 million set aside by JTC for the facade work. Anything above 60 was practically ruled out; correct? A:         Not necessarily, because at that time, if price is the only criteria, we would then, if we cannot find any contractor to satisfy those within the price range, we would have to talk to JTC to see whether there are ways to increase the budget. If not, then we have to look at varying the design to reduce the cost. Q:         Ultimately, your team, JCPL put up a tender recommendation on the 23rd, if I recall correctly. A:         Yes. Q:         I will show it to you first. That is found in the same bundle at pages 218 to 223, if I am not mistaken. Maybe you could just take a look at it to refresh your memory. The cover page is at 218, from Mr Cheong to Mr Mark Koh, ODG. A:         Yes. Q:         Could I assume that this was the final draft? Were there drafts produced in between the 18th and this date? A:         This would be – this should be the final draft, since it is already signed. Q:         Were there drafts produced in between that you have seen? A:         I cannot recall. Q:         You cannot recall? A:         I cannot recall. Q:         Because if I look at Mr Ong's email, the approach then was to put up the pros and cons, so to speak, of engaging Wishing Star, setting out reservations about their ability to perform and so on and then leave it to JTC to then decide? A:         If I recall that particular email that I saw just now, it was referring to the fact that if we were to recommend anybody other than Wishing Star, then we would have to put that in to show why we were not recommending the lowest tenderer. Q:         Could I ask you now to look at the tender recommendation report at paragraph 3.1. It is at page 220, your Honour. Could you look at paragraph 3.1. It says: “Tender interviews were conducted by JCPL and representatives from ODG for the lowest five tenderers to assess their understanding of the design intent; whether they have the capabilities and resources to meet the tight schedule of this contract; their performances in current and past projects;and if they can meet the following critical criteria.” [emphasis added] 86        The reference in the last question to para 3.1 of JCPL’s recommendation does not give a complete picture. Paragraph 4.1 thereof states that WSL submitted the lowest base tender and “[its] submission has been vetted by JCPL and was found to comply with the tender requirements”. 87        It seems to us that the evidence of Mao Whey Ying also does not support WSL’s contention and is against it. JCPL was under the impression that WSL had met all the evaluation criteria and hence WSL’s tender price became very important. 88        It seems to us that the trial judge omitted to consider other factors. First, there was an evaluation team whose role was to evaluate the tenders. It was not there to evaluate the different prices which spoke for themselves. It was there to check to see if the tenderers could do the job. The evaluation team had five interviews with WSL. In the second interview, which Harrison Park also attended, Mr Park not only asked WSL why its tender price was so low, he also asked WSL to reply point by point on its ability to meet the evaluation criteria. This WSL did in its letter dated 1 May 2002. 89        Secondly, as we have mentioned, although JCPL’s recommendation to JTC to award the contract to WSL did highlight that WSL’s bid was the lowest, the recommendation was made on the premise that WSL had met all the tender requirements. 90        Accordingly, we are of the view that the trial judge was plainly wrong in his conclusion about the dominance of the price factor. 91        Furthermore, inLim Bio Hiong Roger v City Developments Ltd[1999] 4 SLR 451, MPH Rubin J said that inducement may be inferred from the fact that the person to whom the representation was made entered into the contract unless the inducer proves that that person either knew that the representation was false or did not rely on it. WSL did not quarrel with this principle. Instead it submitted that JCPL either knew of the misrepresentations or did not rely on them. 92        As regards representations (b) and (c) in respect of the two project managers and a chief design manager who were alleged to have the requisite experience, WSL submitted that JCPL was indifferent to these criteria. WSL said that it had submitted a project organisation chart to the evaluation team and from this it should have been clear that WSL was not intending to deploy the exact number of personnel as required under the Other Criteria. It also relied on a letter dated 10 May 2002 from WSL which it said showed that WSL was proposing to designate only one project manager and not two. Yet there was no follow-up by JCPL on this. 93        Upon consideration of the letter dated 10 May 2002, we note that it does not specifically say “one” or “a” project manager. True, it refers to “project manager” in the singular but this could have been overlooked by JCPL as Nick Chang was suggesting. In any event, a reference to a single project manager is quite different from saying that there would not be any project manager. Accordingly, we do not see how this evidence demonstrates that it was acceptable for WSL not to have any project manager with the requisite experience. 94        As regards a chief design manager, WSL submitted that in its letter dated 17 May 2002 it had said that this role would be filled by Mr Tong and Mr Tong’scurriculum vitaewas provided to JCPL upon request. However, WSL did not say that Mr Tong’scurriculum vitaedisclosed that he had less than 20 years’ relevant experience. In addition, this submission of WSL contradicted its other submission, mentioned above, that its chief design manager was actually Andy Chan Chung Shing. We are of the view that these submissions demonstrate WSL’s duplicity. Indeed, instead of demonstrating that JCPL was prepared to accept the non-existence of a chief design manager with the requisite experience, WSL’s submissions on this issue demonstrate the contrary. 95        As regards representation (d) in respect of an in-house production capacity of 10,000m² per month for curtain walls (and cladding), WSL said that JCPL had asked for further information of such production capacity in a meeting on 20 May 2002 but did not follow up on this prior to the award of the contract. WSL submitted that the reasonable inference was that JCPL considered such a production capacity to be immaterial. 96        We do not accept this submission. The contract was not a simple one. There were many requirements and there was some urgency as the Biopolis project was on a fast track. Moreover, it seems to us that the omission to follow up was because JCPL was not up to the mark. As we will elaborate below, JCPL was also deficient in other aspects. However, its omission to follow up to obtain more information on representation (d) did not mean that it considered such information to be immaterial. After all, if such information were immaterial, JCPL would not have even have requested for it in the first place. 97        WSL, however, submitted that JCPL’s insistence on WSL having contingency plans for this requirement demonstrated that the requirement was not material. We do not agree. The need for contingency plans was in case the original plans fell through but it did not relieve WSL from its obligation to ensure that it had some basis for its original plans. 98        As regards representation (h) and (i) in respect of an in-house powder coating plant and an in-house fluorocarbon coating workshop, WSL submitted that there was no mandatory requirement for an in-house painting facility in the first place, although this was a preferred requirement. It was sufficient if WSL had had direct control over the painting facility. 99        However, we note that WSL chose to represent that it had these in-house facilities. Having done so, it does not lie in the mouth of WSL to argue that this representation did not induce JCPL to award it the contract. In our view, there was inducement. 100      If WSL had shown that at all material times it did in fact have direct control over a painting facility which was not its own, that might well have affected the relief to be granted to JTC for this misrepresentation. However, that is a different point. In any event, WSL did not demonstrate that it had direct control of such a facility. 101      WSL also had another argument. As mentioned above, WSL said it had informed JCPL of the unsuitability of its in-house painting facility in a meeting on 20 May 2002. WSL suggested that JCPL had accepted this clarification but its own internal memorandum of the minutes of that meeting showed that WSL was required to submit an explanation for this, meaning a written explanation. In our view, this demonstrates the opposite of what WSL was advocating. JCPL had not simply accepted WSL’s oral explanation and had required a written explanation. However, WSL submitted that JCPL’s omission to follow up on this point before awarding the contract demonstrated that this representation was not material or had not induced JCPL to award the contract to it. For the same reasons as mentioned above in the context of representation (d), we do not accept this submission of WSL. If representations (h) and (i) were immaterial, JCPL would not have asked WSL to submit an explanation in the first place. 102      WSL relied on yet other arguments to refute the claim that there was inducement. It submitted that although there was a requirement in the evaluation criteria that the tenderer’s construction programme was to conform with Samsung’s master programme and although this was considered by Nick Chang to be as important as any of the requirements under the Critical Criteria, JCPL nevertheless awarded the contract to WSL even though WSL’s construction programme did not conform with Samsung’s. 103      Secondly, WSL was to submit samples of spiders, frames and louvres by 3 June 2002 and to finalise its appointment of its Professional Engineer, Design and Façade Consultant by 28 May 2002. It did not do so and yet Nick Chang omitted to report these breaches. 104      WSL submitted that such conduct was reflective of JCPL’s overall attitude and that such conduct also supported its argument about non-inducement. 105      We are of the view that such conduct does not add anything more to WSL’s other submissions. At most, such conduct again illustrates JCPL’s deficiency in carrying out its responsibilities but that is different from non-inducement. 106      WSL further submitted that what JCPL had relied on was WSL’s grading of L6 under the Building Control Authority’s system of registration. L6 was the highest category of façade contractors. JCPL accepted that it had placed reliance on this grading for WSL. However, in our view, it does not follow that JCPL did not place reliance on any representation from WSL. 107      There was one more argument on the issue of inducement. WSL submitted that because JTC had JCPL to evaluate WSL’s representations, JTC had not relied on the representations but had instead relied on JCPL’s evaluation. WSL relied on the House of Lords decision inAttwood v Small[1835–1842] All ER Rep 258 (“Attwood”). 108      InAttwood, certain representations were made by Mr Attwood about the productive power and nature of the property he was selling to directors of the intended purchaser. The purchaser was agreeable to purchasing the property on the basis that Mr Attwood would afford every facility to its agents to ascertain the correctness of the representations. After the agents had made inquiries, the purchase was completed and the purchaser took possession of the property. About six months after possession and after working the property, the purchaser sought to rescind the contract on the ground of fraud. The House of Lords by a majority of three to two concluded that the purchaser had not relied on the representations since the purchaser had decided to have the representations investigated for itself. 109      We accept that there are passages in the judgments of the majority,ie, Lord Cottenham LC, the Earl of Devon and Lord Brougham, which seem to support the proposition advocated by WSL. However, in the subsequent case ofRedgrave v Hurd(1881) 20 Ch D 1, the Court of Appeal expressly disavowed such a proposition. 110      In that case, Mr Redgrave, a solicitor, had published an advertisement about his practice to solicit an offer to purchase his suburban residence. Mr Hurd responded to the advertisement and had an interview with Mr Redgrave. In that interview, Mr Redgrave said his practice brought in a certain amount of revenue a year. Subsequently, Mr Hurd made further inquiry of Mr Redgrave of the amount of business done for the last three years. Mr Redgrave produced three summaries showing revenue which was less than what he had represented. Mr Hurd made a further inquiry and he received some papers from Mr Redgrave in response. It is unnecessary to go into details of that. Shortly afterwards, Mr Hurd signed an agreement to purchase the residence but the agreement made no reference to the business of the practice. Mr Hurd took possession of the residence but refused to complete the purchase because he alleged that the business was worthless. Mr Redgrave sued for specific performance. The trial judge allowed the claim. However, his decision was reversed on appeal. 111      The main judgment of the Court of Appeal was that of Jessel MR. It is necessary that we quote extensively from his judgment (at 13–17) as it deals with the judgments of the majority inAttwood: There is another proposition of law of very great importance which I think it is necessary for me to state, because, with great deference to the very learned Judge from which this appeal comes, I think it is not quite accurately stated in his judgment. If a man is induced to enter into a contract by a false representation it is not a sufficient answer to him to say, “If you had used due diligence you would have found out that the statement was untrue. You had the means afforded you of discovering its falsity, and did not choose to avail yourself of them.” I take it to be a settled doctrine of equity, not only as regards specific performance but also as regards rescission, that this is not an answer unless there is such delay as constitutes a defence under theStatute of Limitations.… Nothing can be plainer, I take it, on the authorities in equity than that the effect of false representation is not got rid of on the ground that the person to whom it was made has been guilty of negligence. One of the most familiar instances in modern times is where men issue a prospectus in which they make false statements of the contracts made before the formation of a company, and then say that the contracts themselves may be inspected at the offices of the solicitors. It has always been held that those who accepted those false statements as true were not deprived of their remedy merely because they neglected to go and look at the contracts. … It is not sufficient, therefore, to say that the purchaser had the opportunity of investigating the real state of the case, but did not avail himself of that opportunity. It has been apparently supposed by the learned Judge in the Court below that the case ofAttwood v. Smallconflicts with that proposition. He says this: “He inquired into it to a certain extent, and if he did that carelessly and inefficiently it is his own fault. As inAttwood v. Small, those directors and agents of the company who made ineffectual inquiry into the business which was to be sold to the company were nevertheless held by their investigation to have bound the company, so here, I think, the Defendant who made a cursory investigation into the position of things on the 17th of February must be taken to have accepted the statements which were in those papers.” I think that those remarks are inaccurate in law, and are not borne out by the case to which the learned Judge referred. Of course where you have five Lords giving independent reasons, it is very difficult to ascertain with accuracy the ground upon which the House of Lords decided, but I think that in all such cases you must only look at the judgments of the majority who decided the case, for the reasons to be found in their judgments must be either wholly or to some extent the reasons which guided the House of Lords in coming to their conclusion. I therefore confine myself for this purpose to the opinions of the three Lords who decided the case in favour of the Appellants. The first opinion is that of EarlDevon, … His Lordship says: “The question is not as to waiver or acquiescence in fraud, but whether the parties have used that ordinary degree of vigilance and circumspection in order to protect themselves which the law has a right to expect from those who apply for its aid.” In that sentence I think he is not quite correct as regards the law, but the ground of his judgment is this: “The whole course of the proceeding from its commencement to its close tends to shew that the purchasers did not rely upon any statements made to them, but resolved to examine and judge for themselves.” Now, that is a good ground if borne out by the evidence. It is a different ground from that taken by the other Lords, but it cannot be objected to in point of law. I now turn to the judgment of Lord ChancellorCottenham, who says, “We are now trying two propositions by this evidence, first, whether fraud was practised; and, secondly, whether that which is alleged as fraud, or rather the facts from which fraud is inferred, were not known to the Plaintiffs, or to those by whose conduct and by whose knowledge they must be affected from the very commencement of this transaction. I have satisfied myself that both these propositions are in favour of the Defendant;” that is, he found not only no fraud, but he also found that all the material facts were known before they entered into the contract. “I do not find the fact of fraud made out, although undoubtedly it may be supposed that the bargain was a very good one for Mr.Attwood. That is not the matter in question, but that the fraud alleged, which alone can be resorted to for the purpose of supporting the Plaintiff’s case, is not made out in fact, and that the circumstances from which that fraud is endeavoured to be inferred by the Plaintiffs, are, in my opinion, proved to have been known to them from the beginning.” Those are the two grounds of his judgment, and neither of them is anything like the proposition to be found in the judgment of Mr. JusticeFry, that if cursory or ineffectual attempts are made by the agents of the person defrauded to discover the real facts he loses his right to complain of the fraud. There is a sentence in EarlDevon’s judgment to that effect, but not in LordCottenham’s. The only other judgment which was in favour of the appeal was a very long judgment of LordBrougham, which I shall not read through, but at p. 497 we find his conclusion: “My Lords, when we apply to this case the principles which I stated at the outset, we find the facts are wanting; we find there is no misrepresentation which gave rise to the contract” (that is, he concurs with LordCottenhamthat there is no fraud – that is the first ground). We find that the purchasers did not rely upon the representation, but said, We will inquire ourselves” – that is the second ground; it is the same as LordDevon’s ground, and also would be a good answer, though it was not taken by LordCottenham. Then he goes on: “From the 6th of June, 1825, downwards, they constantly proceeded upon the plan of satisfying themselves, first by sending their agents, then by going down themselves, then by inquiring themselves, then even afterwards by sending other agents to inquire, and those agents reporting that the representation was true, and that those parties finding by their own inquiries” (not as Mr. JusticeFryputs it, “the imperfect inquiries of agents”) “that the agents had reported accurately, and that the representation was corroborated by the result of the inquiry, and that even when their own interest, when everything in the commercial world was down, when shares were falling, when money was not to be had, when they were asking time for a prolongation of the term of payment to Mr.Attwood, and when it was their interest to discover a flaw in the contract, they then inquire again and send a new agent to inquire, Mr.Foster, an engineer, and they state to him their own opinion to be in favour of Mr.Attwood’s representations; and Mr.Foster, in answer as late as the 26th of April, less than a month before the bill was put upon the file, reports in favour of Mr.Attwood’s representations. Such being the facts, even if no observation arose as to the delay, as to the adoption and affirmance of the contract, purging it of all objections which might be made, and supposing that they had come in time, instead of delaying so many months; then I ask myself this question, In these circumstances have these parties a right to be released from their contract by the interposition of a Court of Equity, according to those principles which I have stated? When I ask myself that question upon which alone my judgment must turn, I am bound to say No.” So that the two grounds taken by LordBroughamare that there was no misrepresentation, and that the purchasers did not rely on the representations. He agreed in one with LordCottenhamand in the other with LordDevon. The three grounds taken by the three noble Lords, one of which grounds was taken by one only of the Lords, and each of the others by two, were that there was no fraud – that there was actual knowledge of the facts before the contract, and that no reliance was placed upon the representation. In no way, as it appears to me, does the decision, or any of the grounds of decision, inAttwood v. Small, support the proposition that it is a good defence to an action for rescission of a contract on the ground of fraud that the man who comes to set aside the contract inquired to a certain extent, but did it carelessly and inefficiently, and would, if he had used reasonable diligence, have discovered the fraud. 112      If the proposition advocated by WSL were correct, it means that a fraudster can be as deceitful as he wishes in his representations and yet escape the consequences of his deceit if the innocent party chooses to make his own inquiry or due diligence on his representations. However, if the innocent party chooses not to make his own inquiry or due diligence, he can rely on the misrepresentations to avoid the contract. 113      We see no logic, firstly, in penalising a party who has chosen to act carefully but failed, whether due to negligence or otherwise, to discover the fraud. Put in another way, such a proposition would encourage the indolent. Secondly, such a proposition would also encourage fraud. 114      It is our view that such a proposition cannot be valid. A person who has made a false representation cannot escape its consequences just because the innocent party has made his own inquiry or due diligence, unless the innocent party has come to learn of the misrepresentation before entering into the contract or does not rely on the misrepresentation when entering into the contract. This is all the more so when the representation is made fraudulently. We would add that it matters not whether the inquiry or due diligence is conducted by the innocent party or his agents or both. The principle is the same. 115      As for a point made by the trial judge that JTC and JCPL were not unschooled and inexperienced parties in the context of their being aware of the right to terminate, we would add that the expertise and experience of JTC and JCPL did not mean that they were not induced by the representations. 116      InPanatron([72]supra), L P Thean JA said, at [20] and [24]: Admittedly, both Lee and Yin are experienced businessmen, and undoubtedly they must have made their own evaluation of the prospects of investing in Panatron. In this respect, by reason of the exposure and experience they had had, they must have relied, inter alia, on their own expertise and knowledge in deciding whether or not to invest in Panatron. However, it does not follow that they could not have been induced by the representations made by Phua. In this regard, the judge found as a fact that Phua had made the representations to them, which they said were made, and that these representations were false. These findings were not seriously challenged or shown to be plainly in error. The judge also found that both Lee and Yin acted on these representations and they made substantial investments in Panatron. With these findings, the most that can be said on behalf of the appellants was that both Lee and Yin relied partly on their own knowledge and expertise and partly on the representations made by Phua in deciding to invest in Panatron. In this event, the claims of Lee and Yin would still succeed. This is enough to dispose of the appeal. However, something should be said about the appellants’ argument concerning the exercise by Lee and Yin of reasonable diligence in making their respective investments. It is argued on behalf of the appellants that Lee and Yin should nevertheless be denied success, because they failed to exercise reasonable diligence to discover the falsity of the statements, something they should have done, being knowledgeable and experienced businessmen. However, the law is clear. All that is required is reliance in the sense that the victims were induced by the representations. Once this is proved, it is no defence that they acted incautiously and failed to take those steps to verify the truth of the representations which a prudent man would have taken:Central Rly Co of Venezuela v Kisch(1867) LR 2 HL 99. 117      We are of the view that that is what occurred in the case before us. JCPL had relied partly on its own expertise and experience and partly on the representations, although JCPL was also certainly influenced by the price. In turn, JTC relied on JCPL. 118      In the circumstances, we are of the view that representations (b), (c), (d), (e), (h) and (i) were calculated by WSL to induce JTC to award the contract to it. We also find that although JCPL did make its own evaluation, it was also induced by representations (b), (c), (d), (e), (h) and (i) to recommend to JTC to award the contract to WSL. In the circumstances, it is unnecessary for us to venture a view as to whether representations (g) and (j), regarding the in-house stone fabrication plant and in-house test laboratory respectively, were additional inducements. 119      From what we have said, we consider representations (b), (c), (d), (e), (h) and (i) to be material in that it cannot be said that no reasonable person would have considered them unimportant. Accordingly, it is also unnecessary for us to decide whether materiality is an essential ingredient in the tort of misrepresentation, an issue on which JTC and WSL differed and presented arguments based on different cases and different textbooks.",
        "Election and affirmation": "120      The trial judge found that in any event JTC had affirmed the contract with WSL after it had come to know of WSL’s misrepresentations. It is therefore necessary to consider in some detail what transpired after the award of the contract to WSL on 14 June 2002. 121      After the award, JCPL became increasingly concerned over WSL’s operational plans as the project was moving ahead on a tight time line. Accordingly, JCPL asked to visit WSL’s facilities at WSIP. As time progressed, JCPL was also concerned about WSL’s delays in the production of shop drawings. JCPL’s first visit was carried out between 10 and 14 July 2002. We will refer to this as “JCPL’s first China trip”. The representatives from JCPL who went on this trip were Ong Tiong Beng, Nick Chang, Ram Chander Sr and Lim Lye Huat. Jack Koh from WSL went along. Carol Wen and C H Tong were apparently already in China. In addition, JCPL requested Harrison Park to make the visit so that he would be able to see for himself WSL’s facilities. 122      JCPL’s first China trip began with a visit on 11 July 2002 to one of WSL’s proposed suppliers for aluminium extrusions, Fushan Jin Lan Aluminium Co (“Jin Lan”). It was disappointed with what it saw as Jin Lan’s plant was old and did not meet the standards expected for the Biopolis. 123      The party then proceeded to WSIP at Dongguan. They arrived at about 5.00pm. JCPL observed that the industrial park appeared much smaller than the 79 acres that was represented. The industrial part of the park was a collection of fairly old and poorly maintained buildings. After a short briefing, JCPL was brought to a plant which JCPL referred to as the curtain wall and window plant. The machines therein looked old and small in scale. The only work being carried out there was window frame fabrication. 124      JCPL was then brought to another plant which they referred to as the curtain wall plant. Again the machines therein looked old. There was no large computer-numerically-controlled machine which JCPL expected to see for a plant which was carrying out façade work worth $54m for a world-class facility. 125      JCPL was next brought to the powder coating plant. As mentioned earlier, this was a huge shed. At the time of this visit, it had an open roof and one or two sides were exposed to the elements. 126      Fourthly, JCPL was brought to the metal panel fabrication plant. JCPL said there was no machinery inside. Lim Lye Huat said nothing could have prepared him for what he saw there. Ong Tiong Beng said it was a farce. 127      Fifthly, JCPL proceeded to the test laboratory for cladding systems but did not see any of the required equipment there. 128      On the next day,ie, 12 July 2002, JCPL was brought to visit a third party called “Pan Asia”. Pan Asia had a metal panel fabrication plant, a coating plant and a test laboratory. Its facilities were much more impressive than Jin Lan’s although JCPL considered there was room for improvement of certain standards. 129      Subsequently that day, JCPL was brought to visit a glass factory. The next day, on 13 July 2002, it was brought to see the Shanghai East Ocean Centre, which was the project in which WSL claimed it had previous requisite experience. 130      JCPL said it was in a dilemma as it was clear that WSL’s facilities were inadequate for its responsibilities. After the 11 July 2002 visits and before returning to Singapore, JCPL had its own discussions. It knew it was in deep trouble and was panicking. The question of terminating WSL’s contract came up but the consequential result in delaying the Biopolis project was considered “humungous”. It considered asking WSL to use subcontractors whom JCPL had more faith in. 131      At breakfast in the morning of 14 July 2002, Tiong Beng mentioned to Carol Wen that she should consider having the aluminium curtain wall components supplied by Pan Asia. She agreed to consider this although she said she had told Tiong Beng and Lye Huat that WSL had already signed a contract with Jin Lan. 132      After JCPL’s return from China, JCPL briefed JTC at a weekly meeting on 16 July 2002. Apparently JCPL did not go into details of its first China trip. The impression JTC got was that WSL’s in-house facilities were not up to mark. However, JTC was informed that JCPL was trying to get WSL to tie up with third-party suppliers to alleviate the shortcomings of WSL. 133      Mao Whey Ying was briefed on 17 July 2002. Her evidence was that termination of WSL’s contract was considered but the priority was to avoid delay. JCPL still considered that the best way forward was to find other suppliers whom WSL could tie up with. 134      On 18 July 2002, at a meeting (“the first co-ordination meeting”), WSL was requested by JCPL to use a third-party supplier for extrusion, coating and fabrication all rolled together. JCPL agreed to consider a party known as “Nonfemet” as the primary third-party supplier and Pan Asia as the contingent third-party supplier. 135      In the meantime, on 18 July 2002 Harrison Park wrote to BG Philip Su. He described the whole episode of JCPL’s first China trip as a ruse. In his view, it was obvious that WSL did not comply with various requirements of the Other Criteria. He urged JTC to take drastic action to terminate WSL’s contract. 136      Notwithstanding this letter and although JCPL agreed that WSL’s facilities were inadequate, JCPL’s preference was still to get WSL to use third-party suppliers as the implications of termination were horrendous to JCPL. Mao Whey Ying also thought that Samsung had a vested interest in recommending termination as that would give it a ground to request an extension of time for completion of the main contract. 137      JTC had a meeting with JCPL on 20 July 2002 regarding Samsung’s letter. JTC’s in-house legal counsel also attended the meeting. At that meeting, JCPL assured JTC that they had things under control as it was trying to work out a solution using third-party suppliers. JTC’s view then was that termination and the need to have another open tender were too time-consuming and preferred JCPL’s approach of using third-party suppliers. 138      JTC replied to Samsung’s letter on 27 July 2002 stating that they had been advised by JCPL that in order to replace WSL, JTC would need objective and supporting evidence that WSL would not be able to perform the work. JTC said they understood that WSL had, to date, provided acceptable explanations, plans and timelines. 139      In the meantime, JCPL made a second trip to China between 25 and 28 July 2002. We shall refer to this trip as “JCPL’s second China trip”. The representatives from JCPL were Ong Tiong Beng, Nick Chang and Lim Lye Huat. WSL was represented by C H Tong and Jack Koh. The trip was arranged by WSL for JCPL to assess the facilities of various potential third-party suppliers, other than those already visited during JCPL’s first China trip. 140      After JCPL’s second China trip, there was a second co-ordination meeting on 29 July 2002 in Singapore. The minutes show that WSL had confirmed the line-up of certain third-party suppliers proposed by JCPL for various works under WSL’s scope of works. JCPL also required WSL to acknowledge that JCPL could, at their discretion, intervene and engage a third party to complete any outstanding works should WSL’s performance be below par. 141      On 30 July 2002, C H Tong left for China to tie up arrangements with the proposed third-party suppliers. C H Tong started to get quotations from the proposed third-party suppliers. He found them high and mentioned this in ane-mail to Carol Wen dated 30 July 2002. 142      On 31 July 2002, JCPL sent an e-mail to WSL to refer to the meeting on 29 July 2002 to stress that WSL was to give an added assurance that their works would proceed as scheduled and WSL had agreed that JTC and/or JCPL and/or Samsung could take intervening action including, but not limited to, engaging third parties to prevent further delay. A draft of WSL’s added assurance was also forwarded to WSL. 143      Significantly, C H Tong said, in para 137 of his Affidavit of Evidence-in-Chief, that he then got a call from Carol Wen and he told her that “if we did not confirm the subcontractors quickly, JCPL would terminate us”. He and Carol Wen decided to report to JCPL that WSL would use third-party suppliers in Singapore known as Compact and Rotol. Carol Wen then spoke to Ong Tiong Beng but did not obtain approval for Compact or Rotol. 144      There was a third co-ordination meeting on 1 August 2002. The representatives of WSL at this meeting included Carol Wen and Jack Koh. The minutes of this meeting show that, notwithstanding the problem of high prices being quoted by the proposed third-party suppliers in China, Carol Wen was telling JCPL that either WSL had tied up or would be able to tie up with the proposed third-party suppliers by certain deadlines between 7 and 15 August 2002. WSL submitted that such dates were subject to acceptable programmes and quality assurance plans. However, the fact is that WSL did not manage to tie up with these third-party suppliers by those deadlines or at all. 145      In the meantime, on 1 and 3 August 2002, C H Tong sent faxes to Ong Tiong Beng to complain about the high prices being quoted by the proposed third-party suppliers in China. 146      On 5 August 2002, Ong Tiong Beng sent C H Tong an e-mail to say that JCPL’s first China trip was a major disappointment and JCPL’s second China trip was to visit the proposed third-party suppliers. The e-mail also said that it was for Mr Tong to strike a deal with the third-party suppliers. 147      Ong Tiong Beng also sent an e-mail to Mao Whey Ying the same day complaining about various issues, such as the inability of WSL to provide a programme that would meet with Samsung’s programme, WSL’s inability to staff the project comfortably, internal squabbling among its staff, and WSL’s inability to line up the proposed third-party suppliers. Accordingly, Tiong Beng concluded that “it is futile to pursue further” with WSL. He said JCPL would have to sweep WSL aside and for intervening action to be taken with suggested options. However Mao Whey Ying was then not in favour of the options. 148      On 6 August 2002, there was a meeting between Carol Wen and Mao Whey Ying. Carol Wen said that WSL’s facilities were adequate but Mao Whey Ying did not agree. 149      In the meantime, also on 6 August 2002, JCPL had informed JTC about disagreement over WSL’s programme and WSL’s delay in tying up with the proposed third-party suppliers. 150      On 10 August 2002, C H Tong wrote to Ong Tiong Beng to respond to his e-mail of 5 August 2002. C H Tong said WSL was never aware that JCPL’s first China trip was a disappointment. He also asserted that JCPL’s second China trip was to visit a particular third-party supplier suggested by Ong Tiong Beng (and not various proposed third-party suppliers). 151      On 12 August 2002, Mao Whey Ying sent an e-mail to JTC’s Spencer Lim to recommend that either WSL be persuaded to novate its contract to an acceptable contractor or, failing that, WSL’s contract be terminated. 152      On 20 August 2002, JTC instructed JCPL to prepare a paper setting out the basis for terminating WSL’s contract. This was to enable JTC to assess whether there were good grounds for the termination. 153      On 22 August 2002, Ong Tiong Beng replied to WSL’s 10 August 2002 letter and subsequent correspondence from WSL. His letter reiterated that it was for WSL to deal with the proposed third-party suppliers. The letter also stressed that after JCPL’s first China trip, it was clear that WSL’s representations on its technical capabilities and manufacturing facilities were untrue. The possibility of using third-party suppliers was considered but this solution could not be provided within a reasonable time or at all. The letter also mentioned Samsung’s objection to WSL as WSL did not have the necessary technical competence and that JCPL had “advised JTC accordingly”. In the circumstances, JCPL did not think it appropriate to respond to WSL’s recent correspondence. 154      WSL’s solicitors, M/s Hee Theng Fong & Co, then replied on 24 August 2002. In that letter, they denied any misrepresentation. They also said that JCPL had insisted that WSL engage the proposed third-party suppliers in China and because of higher costs, WSL had recommended Singapore suppliers instead, such as Compact and Rotol. The solicitors gave JCPL a deadline of 4.00pm on 26 August 2002 to say whether it wished WSL to proceed with its contract and were notified that there was no basis to terminate WSL’s contract. 155      WSL then wrote another letter dated 26 August 2002 directly to JTC and also to JCPL. WSL denied any misrepresentation. WSL also alleged that as the inspections carried out by JCPL during the two visits in July 2002 were done according to tight schedules, JCPL was not able to inspect all the plants it should have inspected, that is: (a)        a metal panel fabrication plant; (b)        a curtain wall plant; (c)        a stone fabrication plant (joint venture); (d)        a polyester powder coating plant; and (e)        a test laboratory. 156      Furthermore, WSL’s letter alleged that the earlier inspections were conducted after working hours and as such, photographs taken by JCPL would not have displayed the true capabilities of WSL’s staff and facilities. WSL annexed its own photographs to its letter and said it had offered JCPL an independent assessment to be done. The same point about third-party suppliers in China being uncooperative and WSL’s recommendation of Compact and Rotol was reiterated. 157      In the light of WSL’s claims, BG Su decided that JTC should send its own team to assess WSL’s facilities and also obtain an objective opinion from a façade specialist. The team was to be led by Dr Steven Choo Kian Koon and included Spencer Lim and Bruce Wymond, the independent façade specialist. With this in mind, a meeting between JTC and WSL was organised for 2 September 2002 in Singapore. WSL was represented by C H Tong who maintained WSL’s position in the 26 August 2002 letter. BG Su told him that the best way to resolve the differences was for JTC itself to inspect WSIP the next day, as time was short. The visit was on 3 September 2002. Representatives of JCPL and WSL also went along. 158      As far as JCPL was concerned, this visit reinforced what it had seen on its first China trip. For example, although by then there were two machines inside the metal fabrication plant instead of an empty space, this did not make a significant difference as we have alluded to in [48] and [49]supra. The powder coating plant was the same incomplete shed-like structure JCPL had seen but there was some old machinery in it and the “fully-computerised” test laboratory still did not have any computer. 159      As far as JTC’s own representatives were concerned, their observations were similar to those of JCPL. There was no stone fabrication plant, no powder coating plant or fluorocarbon coating plant, the machinery in the window and curtain wall plant in two buildings was old and of the manual type, and the metal fabrication plant was bare save for two pieces of equipment. There was no computer or electronic equipment in the test laboratory. 160      Spencer Lim said he queried C H Tong on the project managers and chief designer. C H Tong replied he was one of the project managers and the other was one Michele Marzotto but C H Tong was unsure whether this person had the requisite 20 years’ experience. As for the chief designer, Mr Tong asked whether this role and the role of project manager could be shared by one person, and then said that Michele Marzotto was the chief designer and the other project manager was Nicholas Wong. As we have mentioned earlier, these names were not the ones which WSL relied on at trial as its project managers and chief designer. 161      After Spencer Lim briefed BG Su about what he had learned, BG Su said it became clear to him that WSL had not been sincere. On 6 September 2002, BG Su received Bruce Wymond’s report which BG Su said highlighted disturbing aspects of WSL’s facilities. It is not necessary for us to go into the details of the report which was along the lines of what JCPL and JTC had observed. In the light of these developments and after seeking solicitors’ advice, BG Su instructed Spencer Lim and two others on 6 September 2002 to prepare a paper to seek the board’s approval to terminate WSL’s contract. The approval was obtained on 9 September 2002. 162      On 9 September 2002, BG Su conveyed to WSL the decision to terminate. JTC’s decision was contained in a letter of that date which stated that the contract was rescinded for misrepresentation and also for repudiation arising out of WSL’s breach of fundamental terms which WSL’s representations constituted. The letter of termination also relied on the ground that Samsung had objected to WSL’s appointment as the relevant NSC. As JTC’s case before the trial judge and us proceeded first on the misrepresentation issue, we need not express a view on the other grounds for termination. 163      In the meantime, from 23 August 2002, JCPL was inviting bids from certain contractors to be submitted for the façade works in case WSL’s contract was terminated. Subsequent to JTC’s termination of WSL’s contract on 9 September 2002, a new contract for the façade works was awarded to another NSC for the higher sum of $61,810,000. The contract was not awarded to the next lowest bid submitted under the initial tender exercise for reasons which we need not go into here. 164      The trial judge was of the view that before there could be an election, JTC or JCPL must first have had knowledge not only of the facts which gave rise to the right to rescind but also of the right to rescind. He found that JCPL had been aware of both. We agree with the trial judge on this finding of fact. It is obvious to us that after JCPL’s first China trip, JCPL was aware of many facts which gave rise to the right to rescind and also of the right itself. It may be that JCPL was under a misapprehension as to the mechanics of exercising the right to terminate but that is a different matter. Knowledge of the mechanics is not a prerequisite to election. In the circumstances, it is academic whether knowledge of the right to rescind is an essential ingredient of election. 165      The trial judge also found that after JCPL’s first China trip, JCPL had decided on a two-pronged approach. The first was to get WSL to appoint certain third-party suppliers. The second was to try and get Samsung to take over WSL’s contract. 166      The trial judge was of the view that at the meeting of 20 July 2002 between JTC and JCPL, the meeting was content with the assurance from Ong Tiong Beng that things were under control. Tiong Beng was of the view that because the implications of termination were horrendous, the way forward was to salvage the situation by getting WSL to engage third-party suppliers. Also, JCPL did not want to give Samsung a reason to claim an extension of time. In these circumstances, the trial judge concluded that JTC had at that time weighed all its options and decided against termination. In his view, that was an election. 167      The trial judge also noted the following. JTC had decided positively in favour of the idea of using third-party suppliers. In the meantime, shop drawings were being submitted by WSL to JCPL for approval and co-ordination meetings between WSL and JCPL continued. The trial judge referred to one meeting on 18 July 2002 where WSL was told that JCPL would consider any innovations proposed by WSL and the parties discussed matters concerning copper cladding, glass-work and manpower. The minutes of the 18 July 2002 meeting ended with a schedule for the next meeting. In an earlier e-mail dated 17 July 2002 from Mao Whey Ying to Spencer Lim, she had informed him that JCPL had identified credible suppliers whom JCPL would get WSL to work with. 168      Accordingly, besides his finding of non-inducement, the trial judge concluded that JTC had elected to affirm the contract with WSL. 169      WSL also relied on JTC’s willingness to have WSL use third-party suppliers in China to constitute an election. WSL submitted that that was something that went beyond the exploring of options. WSL also said that it had faced problems with its negotiations with the third-party suppliers suggested by JCPL and it then took the reasonable step of looking for other suitable suppliers in Singapore like Compact and Rotol. WSL claimed that JCPL did not respond to these two parties nor did JCPL notify JTC of these parties. However, WSL did mention these two parties to JTC in its letter to JTC dated 26 August 2002. 170      WSL also relied on the fact that since JCPL’s first China trip, there were various co-ordination meetings between JCPL and WSL at which other matters in addition to the use of third-party suppliers were discussed. Secondly, in the meantime, WSL had submitted shop drawings and its construction programme to JCPL for its approval and there were discussions thereon. Thirdly, WSL had submitted its first progress claim on 17 August 2002. There were also discussions with JCPL about WSL moving into its site office as soon as possible. On the law, WSL relied onMotor Oil Hellas (Corinth) Refineries SA v Shipping Corporation of India(The Kanchenjunga) [1990] l Lloyd’s Rep 391 where Lord Goff of Chieveley said at 398 and 399: If, with knowledge of the facts giving rise to the repudiation, the other party to the contract acts (for example) in a manner consistent only with treating that contract as still alive, he is taken in law to have exercised his election to affirm the contract. 171      That proposition was not disputed by JTC who referred to the case ofYukong Line Ltd of Korea v Rendsburg Investments Corporation of Liberia[1996] 2 Lloyd’s Rep 604 (“Yukong Line”). The facts there are not relevant but Moore-Bick J cited a number of principles on the issue of affirmation after referring to an array of authorities. The principles relevant for present purposes are: (a)        A binding election requires the injured party to communicate his choice to the other party in clear and unequivocal terms. In particular, he will not be bound by a qualified or conditional decision. (b)        Election can be express or implied and will be implied where the injured party acts in a way which is consistent only with a decision to keep the contract alive or where he exercises rights which would only be available to him if the contract had been affirmed. 172      In addition, we considered that Moore-Bick J’s stricture at 608 was particularly pertinent. He said: [T]he Court should not adopt an unduly technical approach to deciding whether the injured party has affirmed the contract and should not be willing to hold that the contract has been affirmed withoutvery clear evidencethat the injured party has indeed chosen to go on with the contract notwithstanding the other party’s repudiation. … Considerations of this kind are perhaps most likely to arise when the injured party’s initial response to the renunciation of the contract has been to call on the other to change his mind, accept his obligations and perform the contract. That is often the most natural response and one which, in my view, the Court should do nothing to discourage. It would be highly unsatisfactory if, by responding in that way, the injured party were to put himself at risk of being held to have irrevocably affirmed the contract whatever the other's reaction might be, and in my judgment he does not do so. The law does not require an injured party to snatch at a repudiation and he does not automatically lose his right to treat the contract as discharged merely by calling on the other to reconsider his position and recognize his obligations. [emphasis added] 173      JTC submitted that by allowing WSL to seek the aid of certain third-party suppliers, JTC was exploring its options. This was not an election, but if it was, the election was a conditional one,ie, the election was effective if WSL could and did engage the proposed third-party suppliers. 174      It is our view that JTC had, through JCPL, made an election requiring WSL to engage certain third-party suppliers to make up for WSL’s inadequate or non-existent facilities. The crux of the issue on election is whether this was a conditional election or an outright election. As the trial judge concluded that there was an outright election by JTC, he did not deal with the argument on conditional election. 175The Kanchenjungawas not a case on conditional election, andYukong Linementioned that a qualified or conditional decision did not result in a binding election without elaboration. JTC relied on two other cases to further explain its submission on conditional election. 176      The first of the two cases wasTropical Traders Limited v Goonan(1964) 111 CLR 41 (“Tropical Traders”). In that case, a contract for the sale of land provided for the purchase price to be paid by instalments. Clause 11 of the contract provided that if the purchasers were to default on paying any money payable under the contract, all moneys paid by them would be absolutely forfeited to the vendor and it would be lawful for the vendor to rescind the contract. Clause 12 provided that time was to be of the essence of the contract in all respects. The purchasers made various payments late. They also paid contractual interest. The late payments were accepted by the vendor. However, the final payment was also not made on its due date,ie, 6 January 1963. The next day, contractual interest up to the due date was tendered and accepted but not the principal sum. The purchasers’ representative requested an extension of time of three months to make the last payment. On 8 January 1963, the purchasers’ representative was told that the vendor was entitled to rescind the contract but, in order to give the purchasers an opportunity of making payment, the vendor would not exercise the power to rescind until 14 January 1963 provided an additional sum was paid to cover additional interest, costs and expenses. This was followed by a letter to the same effect. The purchasers did not pay by 13 January 1963 and the next day, the vendor’s solicitors gave notice of forfeiture of all moneys paid and rescission of the contract. The vendor issued a writ claiming a declaration that the contract was rescinded and claiming possession of the land which had been given to the purchasers. One of the issues raised by the purchasers was that the vendor had waived the term that time was of the essence of the contract. 177      The High Court of Australia was of the view that the previous acceptance of late payment did not waive the term that time was of the essence of the contract. It was of the view that the real questions were, first, whether the granting of an extension of time amounted to a binding election not to rescind for non-payment on 6 January 1963 and, if it did, whether it was ineffectual to fix 13 January 1963 as a date in respect of which time was of the essence. Kitto J, who delivered the main judgment of the High Court, referred toKilmer v British Columbia Orchard Lands Ltd[1913] AC 319andBarclay v Messenger(1874) 43 LJ Ch 449 (“Barclay”). He stated that inFry on Specific Performance(Stevens & Sons, 6th Ed, 1921) at para 1126 on p 523,Barclayis described as having decided that the letter agreeing to an extension of time was “only a qualified and conditional waiver of the original stipulation”. Kitto J was of the opinion that that was an accurate way of describing the extension of time in the case before him. It was not of such a nature as to be justified only on the footing of an election made: seeTropical Tradersat 53–55. 178      WSL did not quarrel withTropical Traders. Instead it relied onBreach of Contractby J W Carter (The Law Book Co Ltd, 2nd Ed, 1991), which states, at para 1141: A promisee who grants an indefinite period of time will usually lose the right to terminate, at least without first giving a further notice. 179      WSL also relied on para 1089 of Carter. The relevant portion states: No waiver clauses and without prejudice elections. … Promisees cannot avoid the legal consequences of election to continue performance by stating that they are acting “without prejudice”. The purpose of the election doctrine is to prevent a party from simultaneously taking up inconsistent positions and unequivocal words or conduct deprive a promisee of the right to terminate performance even though said to be without prejudice to the right. However, a without prejudice statement may be an indication that the promisee’s words or conduct are not necessarily a final election. For example, a promisee who grants further time for a promisor to perform an essential time stipulation may make it clear that failure to perform before the expiry of the time allowed will result in termination. In such a situation the election can be described as a “conditional election”. 180      WSL then submitted in paras 467 to 469 of its written case as follows: … Further, the present case is not one where JTC had imposed conditions or time limits along the clear lines contemplated inTropical Traders, nor did the Appellants expressly preserve its right to rescind/ terminate if those conditions were not met. This of course is in stark contrast with the situation inTropical Traders, and defeats also the Appellants’ reliance on theYukong Linecase which requires a “qualified or conditional decision” to negative affirmation. On the facts, there was plainly no qualification or conditions attached to the Appellants’ affirmation of the Contract. It is also pertinent to note, as pointed out in Carter, that if no time limits are specified for fulfilment of conditions, the right to terminate would usually be lost. 181      We do not agree with these submissions of WSL. First, the absence of an express reservation of the right to rescind does not necessarily mean that election has taken place. Consequently, the condition imposed by the promisee which the promisor has to meet to avoid rescission need not be stated with such an express qualification. 182      Secondly, Carter does not say that the absence of a time limit to fulfil the condition means that the right to terminate will usually be lost. He says it will usually be lost “at least without first giving a further notice”. Furthermore, it is also important to remember that Carter says that the promisee would “usually”, not invariably, lose the right to terminate. 183      In the case before us, it was clear to WSL that JCPL was unhappy with WSL’s inadequate or non-existent facilities, hence the discussions on third-party suppliers. True, no time limit was given for WSL to engage the proposed third-party suppliers from China but this was not a situation in which WSL was still in the midst of negotiating their engagement when WSL’s contract was terminated. According to WSL’s own position, as it could not reach agreement with the proposed third-party suppliers from China, it had to propose certain suppliers from Singapore. In the circumstances, it was unnecessary for JCPL to give WSL a deadline to appoint the third-party suppliers from China when WSL itself had intimated that this was not possible. 184      Next, WSL submitted that even if JTC’s election was conditional upon WSL’s engagement of third-party suppliers, WSL had not failed to meet this condition as it was JCPL which had failed to consider WSL’s further proposals about the suppliers in Singapore and to highlight the same to JTC. We are of the view that this is not a valid submission. The condition was for WSL to engage certain third-party suppliers in China which were discussed and identified as between JCPL and WSL. That was the purpose and result of JCPL’s second China trip. WSL agreed to engage these third-party suppliers but failed to do so. Having failed, it then proposed the suppliers in Singapore but that was not the condition which it and JCPL had agreed on. WSL and JCPL did not agree that WSL could engage any supplier as it might wish so long as the supplier appeared to be reliable and cost-effective. In the circumstances, if there was a conditional election, WSL had failed to meet the condition. 185      The second case which JTC relied on wasEvans v Argus Healthcare[2001] SCLR 117(“Evans”), a decision of the Outer House of the Scottish Court of Session. We will adopt the facts from the judgment of Lord Macfadyen. 186      In 1998 the pursuer’s solicitors on her behalf concluded missives for the sale of her nursing-home business to the defenders. As part of the bargain the pursuer was to convey to the defenders the heritable subjects in which the business was carried out. The missives contained provisions relating to the water rights to be conveyed to the defenders in connection with the heritable subjects. The pipeline providing the water supply to the subjects passed through land in other ownership. The pursuer therefore undertook to deliver to the defenders at settlement a deed of servitude granted by the owners of the land through which the water pipe passed. It proved impracticable to implement that obligation according to its terms because part of the pipeline lay under a private road and the owner of one-half of the road was unidentifiable. In these circumstances prolonged discussions took place between the parties’ solicitors. The solution which was proposed involved the grant of a deed of servitude for part of the length of the pipeline, with the section in respect of which no valid deed could be procured covered by ananon dominotitle fortified by title indemnity insurance. Various steps were taken with a view to putting that solution into effect. However, there was considerable delay, and the defenders sought to resile from the bargain. The pursuer did not accept that they were entitled to do so. She accepted that she was not able to fulfil her obligation to deliver a deed of servitude according to its terms, but contended that the defenders had waived their right to resile on that ground. The defenders on the other hand contended that there were no relevant averments of waiver. 187      Lord Macfadyen said at [11], [25], [26] and [28]: It is, in my view, sufficient for the purposes of the present case to take from those authorities the propositions (1) that waiver is constituted by the giving up or abandonment of a right; (2) that such abandonment may be express or may be a matter of inference from the actings of the party in whom the right in question was vested; (3) that determination of whether abandonment is to be inferred requires objective consideration of the facts and circumstances of the case; and (4) that circumstances which are also consistent with retention of the right in question will not support an inference that the right has been abandoned. ... …I do not see any objection in principle to waiver being conditional. It is no doubt settled that for waiver to be established there must be circumstances yielding the inference of permanent, rather than mere temporary, abandonment of the right (James Howden & Co Ltd [James Howden & Co Ltd v Taylor Woodrow Property Co Ltd[1998] SCLR 903]). It does not seem to me, however, that that stands in the way of acceptance of an inference thataparty has permanently, but conditionally, given up a contractual right. A party may say: I give up my right permanently and absolutely. Or he may say: I give up my right permanently, provided I receive instead the following substitute benefit. Either of these things may be said expressly, or may be a matter of inference from the actings of the person vested in the right in question. … If the right to strict compliance with clause 2(2) has been given up only on the basis that there will be provided instead (a) an a non domino disposition, and (b) a suitable and sufficient title indemnity policy, the defenders are left in a position in which failure on the pursuer’s part to provide either or both of those substitute forms of protection would constitute failure to purify the condition on which the right to resile had been given up, and that right would in that event, but in that event only, re-emerge. … It seems to me that the dispute between the parties comes to this. The pursuer says that the defenders have acted in a way that shows that they have given up the right to insist on strict compliance with clause 2(2) provided they get an a non domino disposition and a suitable and sufficient title indemnity policy to cover section C-D of the pipe, and must therefore, if they are to resile, do so on the ground that the pursuer is failing to tender one or other or both of these components of the alternative solution. The defenders say that they have co-operated with the pursuer in her efforts to identify an alternative means of giving good title to the problematic length of the pipe, but that it cannot reasonably be inferred that they have by doing that given up their strict contractual entitlement in advance of complete agreement on all the components of the alternative solution. They have approved the form of certain elements of that alternative solution, but must be regarded as having reserved their position on whether or not to accept the alternative package as a whole. That is a dispute which in my view cannot properly be resolved without a proof. Waiver is a matter of circumstances, and it would only be if I were persuaded that the pursuer’s averments are incapable of supporting the inference which the pursuer seeks to draw from them that I would dismiss the action as irrelevant. It seems to me that the pursuer’s averments are capable, on one view, of supporting the inference ofwaiver of the conditional sort discussed above. … [emphasis added] 188      In the circumstances, the pursuer’s action inEvanswas not dismissed and was subject to evidence being given. 189      Relying onEvans, JTC submitted that its agreement to have WSL engage third-party suppliers in China was a conditional election by it and when WSL failed to meet the condition, JTC’s right to terminate re-emerged. 190      WSL, however, sought to distinguishEvanson the basis that that case involved waiver as opposed to an election to affirm. It submitted that waiver was separate and distinct from affirmation and that the test for the latter was a different one. Yet, WSL did not say what the different test was, and we were not convinced by its argument. The editors ofChitty on Contracts(Sweet & Maxwell, 29th Ed, 2004) observe at para 24-007 that affirmation is sometimes regarded as a species of waiver. They distinguish between two types of waiver: waiver by election and waiver by estoppel. They explain that the former term is used to signify the “abandonment of a right which arises by virtue of a party making an election”, and that affirmation is “an example of such a waiver, since the innocent party elects or chooses to exercise his right to treat the contract as continuing and thereby abandons his inconsistent right to treat the contract as repudiated”. We also note that whilst the case ofTropical Traders([176]supra) involved waiver, it is cited by Carter ([178]supra) in his discussion on conditional election. 191      Likewise, althoughThe Kanchenjunga([170]supra) did not deal with conditional election, Lord Goff did express a view on waiver in the context of an affirmation. At 397–398 he said: It is a commonplace that the expression “waiver” is one which may, in law, bear different meanings. In particular, it may refer to a forbearance from exercising a right or to an abandonment of a right. Here we are concerned with waiver in the sense of abandonment of a right which arises by virtue of a party making an election. 192      At 400, Lord Goff said that the owners of the vessel before him “must be taken in law to have thereby elected not to reject the charterer’s nomination, and so to have waived their right to do so or to call for another nomination”. 193      We are of the opinion that the views expressed by Lord Macfadyen inEvansregarding a conditional waiver were in the context of waiver being an abandonment of a right,ie, affirmation. This is clear from Lord Macfayden’s judgment at [11]. Furthermore, if those views were in the context of temporary forbearance only, there would have been no need to require evidence to be given. The pursuer’s action would have been dismissed since it was clear that the defenders no longer wanted the alternative solution. 194      When JCPL learned of the misrepresentations during JCPL’s first China trip, it knew the situation was desperate. It wanted to avoid the termination of WSL’s contract with its consequential delay if an alternative solution could be found. That solution, it thought, was WSL’s engagement of third-party suppliers in China which WSL had agreed to do. Had WSL engaged these suppliers, then it would not be open to JTC to reopen the issue of termination. However WSL failed to do so. In these circumstances, it seems to us clear that there was a conditional election by JTC through JCPL not to terminate the contract if WSL were to engage these suppliers. 195      We reiterate C H Tong’s own evidence that after JCPL had sent the e-mail on 31 July 2002 to WSL to seek WSL’s assurance that the project would be completed without delay, failing which JTC would have the right to engage third parties, C H Tong then got a call from Carol Wen and he told her that “if we did not confirm the subcontractors quickly, JCPL would terminate us”. He and Carol Wen had thought that they could persuade JCPL to accept other third-party suppliers as substitutes to those which JCPL had proposed, but they were wrong. As WSL failed to meet JCPL’s condition, JTC’s right to terminate re-emerged and it was entitled to and did terminate WSL’s contract on 9 September 2002. 196      With respect, we do not think it right to categorise the desperate discussions and agreement to engage certain third-party suppliers as “business as usual”. If it were business as usual, there would have been no need for JCPL to make its second China trip or for C H Tong to try and engage these third-party suppliers from China and thereafter to suggest third-party suppliers from Singapore as substitutes. There would also have been no need for JTC to send its own team and an independent expert to WSIP on 3 September 2002. 197      As for the omission by JCPL to inform JTC of WSL’s suggestion of Compact and Rotol, WSL had itself informed JTC of these two suppliers. In any event, we are of the view that JCPL’s omission does not affect JTC’s right to terminate. Whether the omission will affect the issue of damages is another matter. 198      We now come to WSL’s arguments that, in the meantime, WSL had submitted shop drawings and construction programmes to JCPL and had discussions with JCPL thereon as well as on other matters. WSL had also taken other steps like submitting a progress claim for payment. In our view, all of these steps must be considered in the context of a building contract which was on a fast track. A building contract by nature is already more complex than, say, a contract to buy a car. When the parties were discussing WSL’s engagement of third-party suppliers and following up on WSL’s agreement to do so, the rest of the work by WSL had to continue on the assumption that WSL would carry out what it had agreed to do. It is not realistic to expect JCPL to have suspended the rest of WSL’s work pending its engagement of the third-party suppliers. That would have resulted in further delay which JCPL was anxious to avoid. 199      True, by early August 2002, JCPL had learnt that WSL was having difficulties in engaging the third-party suppliers. On 5 August 2002, Ong Tiong Beng had sent an e-mail to C H Tong to express JCPL’s major disappointment after its first China trip and that it was for WSL to strike a deal with the third-party suppliers. However, WSL knew it still had not met the condition and hence it continued thereafter to try to persuade JCPL to accept Compact and Rotol as substitutes but without success. 200      WSL was also hoping to persuade JTC that JCPL’s views on the representations (after JCPL’s first China trip) were wrong. In these circumstances, the other steps, whether relating to shop drawings, construction programme or otherwise, had to continue in the meantime. 201      There is one other point which WSL raised in its written submissions but did not pursue orally before us. WSL pointed out that while JCPL was alleging misrepresentation in its correspondence with WSL, JCPL and JTC were taking a different tack with Samsung. This was the second of the two-pronged approach mentioned by the trial judge. 202      We have mentioned above a letter dated 18 July 2002 from Samsung to JTC complaining about WSL’s ruse and JTC’s response dated 27 July 2002 stating that in order to replace WSL, JTC would need objective and supporting evidence that WSL would not be able to perform the work. There were also other letters between JTC and Samsung, which we need not set out, in which JTC tried to persuade Samsung to take over WSL’s contract after JCPL became aware of various misrepresentations by WSL. 203      We are of the view that while such conduct suggested that JTC was trying to pass the buck to Samsung, it did not constitute a clear and unequivocal election to affirm WSL’s contract. After all, although JCPL and JTC were aware of the misrepresentations, they were expecting WSL to engage certain third-party suppliers. Also, as we mentioned above, Samsung was already contractually obliged to take over WSL’s contract as WSL was an NSC, unless Samsung had valid objections not to do so. 204      Accordingly, we make the following orders: (a)        JTC’s appeal is allowed and the decision of the trial judge on 15 September 2004 is set aside. (b)        We declare that WSL’s contract for the façade works was validly terminated by JTC. (c)        WSL is to pay damages to JTC to be assessed by the Registrar. (d)        WSL is to pay 90% of the costs of this appeal to JTC to be agreed or taxed. We have not awarded the full costs of the appeal to JTC because it was responsible for some wasted costs. For example, in its written submissions, JTC had relied on O 57 r 3 of the Rules of Court (Cap 322, R 5, 2004 Rev Ed) and submitted that it was not open to WSL to argue that the trial judge had erred on certain findings of fact when WSL had not filed any cross-appeal. That submission of JTC was a non-starter as WSL was entitled to raise other grounds in its Respondent’s Case to support the trial judge’s ultimate conclusion, pursuant to O 57 r 9A(5). Secondly, JTC had dropped the issue on representation (a) without making this clear in its Appellant’s Case and WSL had addressed this issue in its Case. In addition, JTC failed to persuade us that both JCPL and it were unaware of the right to terminate at the material time. 205      The costs of the trial are to be determined by the trial judge, subject to any right of appeal thereon. 206      There is one more point. In Notice of Motion No 121 of 2004, JTC had to apply for certain reliefs in respect of its avenue of appeal on which there was a dispute between the parties. We granted JTC the primary declaration sought and ordered costs of that motion to be JTC’s costs in the appeal. In the circumstances, JTC is entitled to the full costs of that motion as it has succeeded in its appeal, even though it is entitled to only 90% of the costs of its appeal. Appeal allowed. [1]At p 111 of the Notes of Evidence."
    }
}