{
    "case_title": "Lim Swee Khiang and Another v Borden Co (Pte) Ltd and Others",
    "ncitation": "[2006] SGCA 33",
    "coram": "Andrew Ang J; \n      Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Background": "1          The appellants, who are the minority shareholders of the first respondent,Borden Company (Private) Limited (“Borden”),have appealedagainst the dismissal by the High Court of their application under s 216(1) of the Companies Act (Cap 50, 1994 Rev Ed) (“CA”) to wind up Borden on the ground that the majority shareholders, namely the second to tenth respondents, had oppressed or disregarded their interests as minority shareholders. 2These proceedings, which were commenced by way of originating summons on9 September 2002, were later converted into a writ action on 17 August 2004 and a statement of claim was filed. The first appellant, Lim Swee Khiang (“SKL”), filed three affidavits altogether, on 9 September 2002 (“the first affidavit”), on 16 July 2003 (“the second affidavit”) and on 15 January 2004, deposing to various acts and events concerning the respondents that he alleged were oppressive or in disregard of his interests and those of his family company as minority shareholders. The respondents filed affidavits containing little more than bare denials. In the course of these proceedings, both the appellants and the respondents amended their pleadings several times. 3          At the trial, SKL testified and confirmed the statements in his three affidavits and was cross-examined by defence counsel. After the appellants had closed their case, defence counsel made a submission of no case to answer. The trial judge reserved judgment and, subsequently, dismissed the claim with costs. She held that SKL’s testimony failed to establish aprima faciecase of oppression and that in any case the action was an abuse of process as the appellants had rejected the respondents’ offer to buy them out. Her judgment is reported at[2005] 4 SLR 141.",
        "Observations": "4          Before we consider the rival contentions of the parties in this appeal, it is desirable that we examine a few matters relating to these proceedings in order to better understand the forensic strategy of the respondents in dealing with the allegations of oppression against them. In an ordinary case, the court is not concerned with how each party strategises the conduct of his case, but this case has a number of features that require this court to examine closely the complete silence of the respondents to the claims of the appellants.",
        "Submission of no case to answer": "5          The first matter is the submission of no case to answer. It is a trite principle that under our adversarial system of justice, each party has the right to conduct his action or his defence, as the case may be, in a way that benefits him most. It is also an accepted principle that he who asserts must prove and therefore a defendant is entitled to put the plaintiff to strict proof of everything he is alleging, without having to respond in any way to the allegations. However, it is also accepted that where a defendant calls no evidence to rebut the evidence of the plaintiff, a submission of no case in those circumstances is a very high-risk strategy. This is particularly so as the appellants are alleging a series of oppressive and prejudicial acts and omissions of the respondents. Absentmala fideson their part, the appellants would indeed have to have obtained very poor or even negligent advice if they could not make out a case of oppression on the evidence they had adduced in court. 6InCentral Bank of India v Hemant Govindprasad Bansal[2002] 3 SLR 190at [21], S Rajendran J said: A decision by a defendant not to adduce evidence in his defence is a decision that ought not to be lightly taken. Where a defendant makes such an election, the result will be that the court is left with only the plaintiff’s version of the story. So long as there is some prima facie evidence that supports the essential limbs of the plaintiff’s claim(s), then the failure by the defendant to adduce evidence on his own behalf would be fatal to the defendant. In the light of this principle, the respondents would have to be supremely confident of the absence of any merits in the appellants’ claims of oppression, either on the facts or on the law, to resort to a submission of no case to answer. But it could well be that they had been advised that the rejection by the appellants of their buyout offer was a complete answer to the appellants’ claims (the abuse of process argument) or that if the strategy failed, they would not be in any worse position than being ordered to buy out the appellants, for the reason that the court would be unlikely to order Borden to be wound up, given that a winding up order is a last resort remedy.",
        "The respondents’ refusal to explain anything": "7          As it is, the respondents’ silence in this case has resulted in many gaps in SKL’s narrative that might have been filled if the respondents, or some of them, had testified. There were many events and incidents in SKL’s account that needed some explanation on the part of the respondents, especially Mdm Halim, to complete the story, so to speak, and to clarify the actual relationships between the respondents, especially between Mdm Halim and her son, Edy Chew, who owns and controlsPT Eagle Indo Pharma (“PT Eagle”). This would have been one way of restoring the mutual trust and confidence that the appellants once had in the way the respondents were managing the affairs of Borden. Instead, the respondents rubbed salt into the appellants’ wounds by keeping obdurately silent and seeking to put the blame on SKL through questions put in cross-examination. This strategy led the trial judge to focus her attention on specific events and incidents which, taken in isolation, gave the impression that SKL was principally to be blamed for the way he was treated by the other respondents and also for Borden’s inability to take any action to protect its interests against its licensee, PT Eagle. 8          To avoid any misunderstanding with respect to the thrust of our observations, we wish to explain that the trial judge in fact dealt with the issue of the silence of the respondents in a proper way. The appellants had complained that the silence of the respondents was one of the matters making it clear that the respondents had conducted the affairs of Borden in a manner that departed from the standards of fair dealing. The trial judge dismissed this argument, explaining that the respondents had the right not to go into the witness box. But, in our view, what the appellants had intended to convey by their submission was that the refusal to explain anything was a reflection of the way the respondents had treated SKL. In any case, our observation makes a separate point altogether, which is that the respondents, instead of taking the trouble to explain matters to SKL to repair a personal relationship that had broken down, resorted to legal niceties to perpetuate it.",
        "The appeal and the respondents’ applications to strike out the appeal": "9          After judgment, the respondents made a similar buyout offer to the appellants. After rejecting the offer, the appellants appealed against the trial judge’s decision. On 26 October 2005, the fourth respondent (“Mdm Halim”) applied to court (in Notice of Motion No 97 of 2005) to strike out the appeal on the ground that it was an abuse of process. The second, third, fifth, sixth, seventh, eighth and tenth respondents collectively filed a similar application (Notice of Motion No 107 of 2005). On 23 January 2006, the Court of Appeal dismissed the applications. The court held that the appeal was not an abuse of process because the buyout offer was not a reasonable offer in that it did not include the damages claimed by the appellants arising from the oppressive acts of the respondents.",
        "No abuse of process": "10        In this appeal, the respondents have again contended in their written submission that the appeal is an abuse of process for the reason that the appellants have rejected their second buyout offer. The clear implication of the Court of Appeal’s dismissal of the respondents’ applications to strike out the appeal in Notices of Motion Nos 97 and 107 of 2005 is that the respondents’ argument would fail. For this reason, the respondents have not pressed this argument before us.",
        "Unrebutted evidence and undisputed facts": "11        To appreciate fully the nature of the appellants’ complaints of oppression or disregard by the respondents of their interests as minority shareholders in Borden, it is useful to set out at this juncture the unrebutted testimony of SKL on the salient facts. In this regard, we consider as unrebutted any statement made by SKL that has not been withdrawn, or qualified (and if qualified, only to that extent), when challenged by the respondents’ counsel in cross-examination. We take note that unrebutted evidence is not necessarily credible or good evidence as it may be inherently incredible or so unsatisfactory that it cannot be relied upon.",
        "Business of Borden": "12        Borden was incorporated in 1960 to carry on the business of medicinal and pharmaceutical products. Its most successful product is its “Eagle Brand” medicated oil. Borden is the registered owner of the trade mark which depicts an eagle device, the words “EAGLE BRAND” in English and Chinese and the words “CHAP LANG” which Borden has used and continues to use for its medicated oil and other products. In addition to Singapore, Borden has also registered the trade mark in Malaysia, Australia, Canada, the United States of America, Taiwan, Hong Kong, the Philippines and Vietnam.",
        "Borden is a family-owned “quasi-partnership”": "13        Borden was originally set up by six families. The appellants and the respondents, and also the trial judge in the way she dealt with the appellants’ case, have accepted that, in the words of Lord Wilberforce inEbrahimi vWestbourne Galleries Ltd[1973] AC 360(“Ebrahimi”),Borden is to be regarded asa “quasi-partnership”.Mdm Halim has also confirmed this legal fact in her affidavit filed in Originating Summons No 1759 of 1999 (another action concerning Borden). SKL has testified at the trial that the founders had intended that each family would be represented on the board of directors of Borden by a family member. The respondents, whilst suggesting otherwise to SKL in cross-examination, have not testified to the contrary.",
        "Family shareholdings in Borden": "14        The six families holding shares in Borden and the extent of their shareholdings are as follows: (a)        The C H Lim family holds 27%. SKL holds two shares, and the rest are held by the second appellant, the family company of SKL. (b)        The Tan family holds 20%, held by the estate of Tommy Tan. The second respondentsare the executors and trustees of the estate of Tommy Tan. The third respondent (“TLT”), one of the executors, holds one share, which was transferred to him by Mdm Halim. TLT is the sole beneficiary of Tommy Tan’s estate. (c)        The Chew family holds 20% through Mdm Halim, the fourth respondent. Her daughter is the fifth respondent (Rachel Chew), to whom Mdm Halim has transferred one Borden share. She also transferred one such share to TLT. (d)        The Yeo family holds 15%, of which 75 shares are held by the eighth respondent (Christopher Yeo), and 450 shares have been transferred to Richard Yeo, the seventh respondent. Richard Yeo is the husband of Ruth Chew, who is Mdm Halim’s daughter. (e)        The Wong family holds 12% in the name of the ninth respondent, who was a nominal defendant in this appeal. (f)         The tenth respondent holds 6% and is the sole survivor of the six original founders of Borden. 15        At the time this action was filed, TLT, Rachel Chew (the assistant managing director), Christopher Yeo (the managing director) and SKL were the directors whilst the seventh respondent was the general manager. TLT and Rachel Chew were appointed as directors after Mdm Halim had transferred to them one share each.",
        "Borden’s business relationship with PT Eagle": "16        In 1975,Borden, under its registered business name, Wilhelm Hauffmann & Company, granted a licence to PT Eagle to manufacture and distribute Eagle brand medicated oil in Indonesia. In exchange, PT Eagle was to pledge its shares to Borden, and Borden had the option to purchase PT Eagle’s shares. On 15 May 1986, Borden authorised PT Eagle to use the Eagle Brand trade mark, subject to payment of royalty. The precise terms of these two arrangements are vague. The appellants have no knowledge of what the precise terms of the royalty or the buy option were. The evidence on record shows that PT Eagle paid Borden royalty of $60,000 annually up to 1995. An entry in Borden’s subsidiary ledger in 1996 stated that royalty had been received by Borden in the amount of $60,000 per year, accompanied by the following statement: “Royalties from Indonesia was [sic] for a period of 15 years starting from 1980 and ended in 1995.” 17        After payment of royalty ceased in 1995, no royalty was collected by SKL as executive director. In cross-examination, the respondents tried to pin the blame on him for not collecting royalty during his tenure as executive director. They also tried to pin the blame on SKL’s father as he was the executive director in 1995. SKL explained that he was only a production manager in 1995 and that he only came to know about the royalty problem in 2000, after he became executive director. He also explained that he did seek advice on the royalty issue from Borden’s lawyers, M/s Drew and Napier (“D&N”), who advised that that it would be difficult to claim royalty because there was no agreement on the payment of royalty. He said he did not take specific action to recover the royalty because he was busy handling the action between PT Eagle and Borden in Malaysia (“the Malaysian action”) with the help of D&N. However, it is common ground that since the respondents took over the management of Borden in December 2001, they made no attempt to collect royalty or raise the issue with PT Eagle. They have given no explanation for their inaction, except to put to SKL in cross-examination that since D&N had advised that it was difficult for Borden to collect royalty, they could not be blamed for not doing so. Furthermore, the respondents have not asserted that they had asked D&N what their actual advice was. From the evidence on record, it was inconceivable that D&N could have advised that no royalty was due from or could be collected from PT Eagle, since D&N in its letter of advice to Borden dated 12 March 2002 referred to the payment of royalty of $60,000 annually by PT Eagle. Up to the date of this appeal, no royalty has been collected, and no explanation has been given by the respondents on why they had taken no steps to do so. 18        Over the years, PT Eagle was able to expand its licensed business to Malaysia, Thailand, Vietnam, Hong Kong and the United States of America, seemingly without any objection from any of the directors or shareholders of Borden. No royalty was paid to Borden using its trade mark for this business outside Indonesia. 19        In early 1970, Borden wanted to expand its Indonesian business but discovered that sometime in 1963, Chew Jin Sian, Mdm Halim’s husband, who was then Borden’s managing director, had secretly registered the Eagle Brand trade mark in his own name in Indonesia. He agreed to transfer the trade mark back to Borden and after he died, his widows (including Mdm Halim) were reminded of this promise on 11 January 1973. It was during this period that Mdm Halim and her son Edy Chew set up PT Eagle to manufacture and distribute Eagle Brand medicated oil under a licence from Borden. Mdm Halim was appointed the commissioner and Edy Chew the director of PT Eagle under the laws of Indonesia.",
        "PT Eagle expands business to Malaysia": "20        In the 1980s, PT Eagle started to export Eagle Brand medicated oil to Malaysia without any objection from Borden as Borden viewed PT Eagle’s role as that of a distributor. In May 1986, Edy Chew was authorised to use the Eagle Brand trade mark subject to payment of royalty. In 1995, Edy Chew became Borden’s general manager to replace Yeo Boon Hong, one of the founders of Borden, who had died. Edy Chew persuaded SKL’s father to allow PT Eagle to sell the Eagle Brand medicated oil to Malaysia for a period of three years. In 1997, the relationship between Borden and PT Eagle deteriorated. Edy Chew left Borden and went back to Indonesia to look after PT Eagle’s business. He took steps to prevent Borden from selling the same product in Malaysia by registering PT Eagle’s products with the Drug Control Authority of Malaysia (“DCA”). In October 1999, Borden (through TLT) complained to the DCA about PT Eagle’s infringement of Borden’s trade mark. 21        PT Eagle retaliated against this complaint by commencing the Malaysian action on 5 November 1999 to nullify Borden’s trade mark on the ground of non-use for a period exceeding three years. TLT alerted Borden to this action. Upon being appointed an executive director in November 1999, SKL took charge of the Malaysian action on behalf of Borden. He filed an affidavit in April 2000, following which PT Eagle’s action was dismissed in July 2000. 22        Prior to this, on 3 November 1999, TLT had requisitioned an extraordinary general meeting (“EGM”) of Borden to remove Mdm Halim as a director of Borden because of her connection with PT Eagle. Mdm Halim, in order to prevent her removal as a director, filed Originating Summons No 1759 of 1999 for relief under s 216 of the CA, seeking the following reliefs: (a)        a special audit of Borden’s accounts to verify any unauthorised payments to TLT and any other irregularities in Borden’s accounts; and (b)        an injunction to restrain the removal of her as a director until the completion of the special audit. In this action Mdm Halim also claimed that Borden was in substance a partnership of the six original founders. This action was eventually settled.",
        "Mdm Halim denies business relationship with PT Eagle": "23        On 25 August 2000, TLT at a shareholders’ meeting expressed his concern about a possible conflict of interest of Mdm Halim and asked the directors to convene a meeting to discuss PT Eagle’s Malaysian action against Borden. He reminded the directors that Mdm Halim (then a director of Borden) was also a director and shareholder of PT Eagle and that Edy Chew was her son, and also stated that Borden had strong grounds to believe that PT Eagle was infringing Borden’s property rights. Mdm Halim, through her solicitors, wrote to TLT’s solicitors, confirming that she had never been a director in PT Eagle and that she had ceased to be a commissioner and a shareholder. At around the same time, in June 2000, Borden had requested D&N to check on Mdm Halim’s position in PT Eagle. D&N instructed General Patent International (“GPI”) to conduct a company search on PT Eagle, and on 22 August 2000, GPI reported that Mdm Halim was no longer a shareholder or director of PT Eagle. However, D&N requested documentary proof from GPI which, when it came, showed that Mdm Halim was indeed a commissioner of PT Eagle, and that she had sold her shares to Edy Chew. The investigators could not determine whether she remained a shareholder. Based on this information, D&N advised that there was no breach of duty by Mdm Halim.",
        "Mdm Halim is revealed to have business relationship with PT Eagle": "24        In August 2001, D&N conducted another search (through M/s Rouse & Co (“Rouse”)) and this time found that Mdm Halim had continued to be a commissioner, that she and Edy Chew were the founding shareholders of PT Eagle and that there was no record of any change in their shareholdings. Numerous marks bearing the Eagle device had also been registered by Edy Chew. D&N also obtained a legal opinion that the role of commissioner under Indonesian law is to supervise and advise the directors in the management of the company. D&N advised SKL that a director who assumed the post of a commissioner would have a conflict of interest. 25        Later, at an EGM of Borden held on 14 December 2001, but after SKL had left the meeting, Richard Yeo tabled GPI’s report of 18 September 2000 showing that Mdm Halim was not a director of PT Eagle. However, he did not table the later report from Rouse stating that Mdm Halim was a commissioner and shareholder of PT Eagle. SKL had left the meeting because he was not aware that this issue would be brought up at the EGM as it was not in the notice of the EGM. 26        In October 2002, Mdm Halim resigned from her directorship in Borden, consequent upon which her daughter, Rachel Chew, became a director in her place.",
        "D&N advises Borden to terminate PT Eagle’s licence": "27        Arising from these revelations, Borden sought advice from D&N on how to terminate PT Eagle’s licence to manufacture and distribute Borden’s Eagle Brand medicated oil. Borden was advised on 5 October 2001 that no formalities were required but three months’ notice would be reasonable. D&N reiterated its earlier advice that the licence agreement with PT Eagle should be terminated “without further delay”.",
        "Mdm Halim takes steps to remove SKL as executive director": "28        On 24 October 2001, notice of an EGM of Borden to be held on 9 November 2001 was given upon the requisition of Mdm Halim, dated 19 October 2001. The EGM was to consider passing,inter alia, the following resolutions: (a)        that all shareholders be invited to be represented on the board of directors; and (b)        that directors not hold executive positions in Borden and that the general manager report directly to the board of directors. SKL objected to both the 19 and 24 October 2001 notices. He proposed that the EGM discuss and resolve the course of action that Borden should take against PT Eagle arising from the latter’s export of the Eagle Brand medicated oil to Singapore, in competition with Borden itself. 29        At the EGM, the resolutions (referred to in [28(a)] and [28(b)] above) were passed. The first was passed unanimously, following which TLT and Christopher Yeo were appointed directors (subject to their becoming shareholders within two months). The second was passed against the objection of SKL who would effectively be stripped of his executive powers as the only executive director in Borden. D&N advised that PT Eagle had no right to sell Borden’s medicated oil in Singapore and again advised the directors and shareholders to terminate the licence to PT Eagle immediately as Mdm Halim, being a commissioner in PT Eagle, was in a position of conflict. Based on this advice, it was unanimously resolved during the meeting to terminate the licence given to PT Eagle to manufacture and distribute the Eagle Brand medicated oil with immediate effect, and to conduct a check on Mdm Halim’s position in PT Eagle.",
        "TLT’s loyalty to Mdm Halim’s family": "30        In 1999, TLT had complained about PT Eagle’s incursion into the Malaysian market and also Mdm Halim’s conflict of interest in holding directorships or shares in both Borden and PT Eagle. Mdm Halim had retaliated by calling for an investigation of TLT’s excessive payments to himself and other irregularities, which were later confirmed by a report from Borden’s accountant, one Casey Lin. The 9 November 2001 EGM had also resolved, as recommended by SKL on the basis of Casey Lin’s report, that TLT return the $250,000 bonus he had awarded himself in five instalments, and that any dividend declared on his shares should be used to offset these sums. 31        On 14 December 2001, another EGM was held when the meeting approved the payment of a salary of $180,240 and a bonus of $100,940 to TLT. SKL abstained from voting on this proposal. 32        On 27 December 2001, at a directors’ meeting, the transfer of one share each by Mdm Halim to TLT and her daughter, Rachel Chew, was approved so that they could qualify as directors as required by Art 65 of the articles of association of Borden. Mdm Halim had also intended to transfer one share in Borden to Christopher Yeo but it turned out that he was able to acquire one share from his father’s estate. 33        On 28 January 2002, a directors’ meeting initiated by TLT was held, during which Christopher Yeo was appointed the managing director and Rachel Chew the assistant managing director. When SKL queried that these appointments contradicted the earlier resolution at the EGM of 9 November 2001, Christopher Yeo replied that circumstances had changed. No query has been raised as to why SKL’s executive powers were removed by a shareholders’ meeting, whereas Christopher Yeo and Rachel Chew’s executive powers were conferred on them at a directors’ meeting. 34        In 2002, the majority shareholders approved the payment of bonuses to TLT for the years 2000 and 2001 of $125,000 each, even though his salary for the year was only $10,000. SKL, in para 74 of his first affidavit deposed that these bonus payments were given to secure the loyalty of TLT to the Chew and Yeo families. 35        SKL, in para 63 of his first affidavit,to which no rebuttal evidence has been led by the respondents, states as follows: It is clear to me that the Chew, Tan and Yeo families had conspired with each other to remove me as an Executive Director in November 2001 so that they could in turn place themselves in power to run the affairs of [Borden]. As they were all linked in one way or another to P.T. Eagle, they were clearly not going to conduct [Borden’s] affairs in the interests of [Borden]. I am afraid that if [Borden] continues to be controlled by them and I cannot provide the necessary checks and balances, they will run [Borden] to the detriment of the [appellants’] rights as shareholders. It is my firm belief that they have a long term plan to siphon away all of [Borden’s] market share in the medicated oil business to P.T. Eagle or any other companies formed or associated with P.T. Eagle. They have much to gain as the medicated oil business can be a very profitable one. There are very few big players in this business. In fact, Eagle Brand has only one other major competitor, the Axe Brand. Already, [Borden] has received complaints from [Borden’s] Singapore agent that another P.T. Eagle’s packaging is similar to the packaging of Axe Brand medicated oil. 36        Similarly, in para 64 of his first affidavit, SKL states: Since [TLT, Rachel Chew and Christopher Yeo] have become the Executive Directors, they have not actively pursued a course of action to try and stop P.T. Eagle from affecting [Borden] adversely: a)         they have not terminated PT Eagle[’s] licence/agreement with [Borden] despite [D&N’s] advice to do so, nor has any action been taken to-date on P.T. Eagle’s parallel imports directly or indirectly into Singapore and Vietnam from Indonesia. b)         though there have been some discussions, it has not been decided on how to conduct the Malaysian action by P.T. Eagle which is still pending, even after advice from [D&N] on 12 March 2002 where it was recommended that they proceed to defend the action by P.T. Eagle. ... c)         they have stopped [Borden’s] proposed opposition action in UAE/Yemen against Edy’s Eagle Brand trade mark filing. 37        Since Christopher Yeo and Rachel Chew became executive directors of Borden, they have not taken any steps to terminate the licence given to PT Eagle, or attempted to collect unpaid royalty from PT Eagle with respect to the sales of Eagle Brand medicated products effected for many years in Indonesia, Malaysia, Vietnam and other countries.",
        "The relevant period of oppression": "38        In her judgment, the trial judge held that the alleged oppressive conduct must have taken place before the action was instituted. In this case, she identified the relevant period as between 9 November 2001, when SKL was removed as an executive director of Borden, and 9 September 2002, when he filed this action. This ruling, if correct, will render irrelevant the appellants’ complaint about PT Eagle’s Malaysian action which was settled in February 2004. Nevertheless, the trial judge did look into the settlement in some detail and found that the appellants had failed to show that the respondents, in approving the settlement, had acted unreasonably or in an overbearing mannervis-à-visthe appellants.",
        "The appeal": "",
        "Application to introduce new evidence": "39        When the hearing began, the appellants’ counsel applied to adduce fresh evidence in the form of Borden’s audited consolidated accounts for 2005/2006 which were not available before or during the trial. These accounts show the volume of sales of Borden’s medicated oil in Malaysia from January 2004 to February 2006 and also demonstrate that the payment of US$900,000 to PT Eagle to settle its Malaysian court action was wholly unjustified and contrary to the commercial interest of Borden. The new evidence also showed that Christopher Yeo’s assurance, which played an important part in the respondents’ decision to settle, was misleading. The assurance was that a company calledMedic Marketing Pte Ltd was prepared to take over the distribution of Eagle oil in Malaysia and that it had committed itself to purchasing three to four containers of goods for the first year, which would give Bordena turnover in Malaysia of S$1.6m. 40The respondents objected to the application on the ground that the evidence did not satisfy the three conditions for the admission of fresh evidence on appeal as laid down inLadd v Marshall[1954] 1 WLR 1489.We were so satisfied and allowed the application. As will be discussed later, the new evidence shows clearly that Christopher Yeo had no basis whatsoever for giving that assurance, or if he had, he did not want the court to know of this basis since he did not testify at the trial.",
        "Issues on appeal": "41        The appellants’ main contention is that on the basis of the undisputed evidence and the unrebutted testimony of SKL, the appellants have proved aprima faciecase of oppression or disregard of their interests as minority shareholders of Borden by the respondents. The acts of oppression or disregard of their interests may be grouped under five headings which we will now consider. They are: (a)        the respondents’ failure to terminate PT Eagle’s Indonesian licence to manufacture and distribute Borden’s medicated oil and to use Borden’s trade mark, and their failure to collect royalty; (b)        the removal of SKL as executive director and the appointment of the Christopher Yeo and Rachel Chew as executive directors; (c)        the respondents’ failure to defend Borden’s Malaysian market for the Eagle Brand medicated oil and their unjustified payment of US$900,000 to PT Eagle in order to settle its Malaysian action against Borden; (d)        the conflicting interest of Mdm Halim in Borden and PT Eagle; and (e)        the respondents’ failure to prevent the loss of the Vietnam market to PT Eagle. Failure to terminate licence and to collect royalty 42        The trial judge’s finding on the evidence was that the respondents’ failure to terminate the licence as a means of protecting Borden’s overseas markets against competition from PT Eagle was due to “a fundamental difference in philosophy” between the appellants and the respondents (at [60]). The respondents, in her words (ibid), viewed “PT Eagle’s aggressive marketing of Eagle [Brand medicated] oil with some degree of complacency as long as PT Eagle did not bring the product into Singapore”, whereas the appellants “regarded PT Eagle’s actions as being in excess of the latter’s authority and, ultimately, detrimental to Borden’s interests and business as PT Eagle’s actions would curtail expansion by Borden into new markets”. The trial judge accepted the business philosophy of the respondents as the “court, in dealing with allegations of oppression, must not second-guess management decisions” (ibid). However, she also concluded from the evidence that where, as in this case, the shareholders had indicated their decision to take certain action, the management should follow through or explain why it had not. Although, in this case, no proper explanation was given by the respondents for their failure to carry through the resolution to terminate PT Eagle’s licence, she concluded that in law, “[f]ailure to explain cannot, however, in itself be oppressive” (ibid). 43        We are unable to agree with the trial judge’s conclusions on these matters. In our view, the evidence produced by SKL shows an entirely different picture from that of mere complacency and is more akin to active complicity. The trial judge’s characterisation of the dispute between the parties as a difference of philosophy does not in our view accurately depict the real nature of the actions of the respondents and their probable objectives. The bitter complaint of the appellants is that the respondents, instead of protecting and promoting the commercial interest of Borden, as was their duty as directors and shareholders, made a series of decisions and took a number of actions that furthered the commercial interests of PT Eagle at the expense of Borden, or in disregard of the commercial interests of Borden. The trial judge also found that the respondents had no obligation to explain their actions as the appellants first had to show aprima faciecase against them. While this is strictly correct in law, we are of the view that SKL’s unrebutted evidence on these matters raised aprima faciecase of a disregard by the respondents of Borden’s interests, and, therefore, also the appellants’ interests as minority shareholders. 44        In our view, it was incumbent upon the respondents to give some credible evidence to explain their inactions and decisions which had led to Borden losing its markets for the Eagle Brand medicated oil to PT Eagle and paying a large sum in compensation to recover a market, the Malaysian market, which they could have eventually regained by terminating the licence given to PT Eagle to manufacture and to use the trade mark. We set out below the reasons why we consider SKL’s account of the reasons for the respondents’ failure to terminate PT Eagle’s licence as a nearer approximation to the truth than the silence of the respondents. 45        Firstly, Borden’s solicitors had advised the immediate termination of PT Eagle’s licence as that was the only effective way to stop the unauthorised sales by PT Eagle of Borden’s products in territories in which Borden had been marketing its products. The respondents’ failure to do that meant not only the condonation of those unauthorised activities, but also a loss of business for Borden in those markets, to the detriment of its shareholders. The failure to take action merely encouraged PT Eagle to continue to disregard the ownership rights to the product and the trade mark and to treat them as if they belonged to PT Eagle. The respondents’ failure and dereliction of their duties as directors of Borden resulted in the commercial interests of PT Eagle being preferred to those of Borden. 46        Secondly, the only effective way that Borden could recover its markets from PT Eagle was to terminate PT Eagle’s licence to sell Borden’s products. Therefore, by failing to terminate the licence, the respondents were in fact giving awaygratisBorden’s markets to PT Eagle. 47        Thirdly, this failure also emboldened PT Eagle to continue, or threaten to continue, with its Malaysian action to revoke Borden’s trade mark in Malaysia on the ground of non-use, even though the court had already dismissed the action, albeit on a technical ground. The respondents, instead of defending the action aggressively when Borden had the upper hand and was holding the winning card in its ability to terminate PT Eagle’s licence, capitulated by entering into a settlement with PT Eagle on terms that were not in the commercial interests of Borden. We will evaluate this settlement in greater detail later in this judgment. 48        Fourthly, the respondents’ failure to terminate the licence also weakened Borden’s opposition to PT Eagle’s applications to register the Eagle device as PT Eagle’s trade mark in the United Arab Emirates (“UAE”). In the end, the respondents’ decision to withdraw Borden’s opposition to PT Eagle’s applications, in the light of legal advice that the cost of so doing was small, ensured the loss of these markets for Borden. 49        Fifthly, the respondents’ failure to terminate PT Eagle’s licence is of a piece with its failure to collect royalty from PT Eagle. Although SKL himself did not institute any concrete action to recover the unpaid royalty, he did seek legal advice from D&N on whether it could be done and how to do it. His own account of D&N’s advice suggests that somehow he misunderstood the advice to mean royalty could be difficult to collect or was not collectable at all because of the absence of a written agreement setting out the terms of payment of royalty. The respondents’ counsel, when cross-examining SKL, tried to persuade him to agree that the respondents’ failure to collect royalty was justified by D&N’s advice. The unrebutted legal position is clear enough. SKL has produced evidence that PT Eagle had agreed to pay royalty (which must have been obvious even to the respondents) and that it did pay royalty of $60,000 a year from 1980 to 1995 after which it stopped. The respondents tried to pin the loss of royalty on the Lim family as the cessation occurred during the period when SKL’s father was the managing director. But the fact remains that the respondents have given no explanation for their own inaction in collecting the unpaid royalty or even to look into the problem. This situation persists up to the date of the hearing of this appeal. 50        Sixthly, all these failures and omissions are hugely significant to the business of Borden. Revenue is being lost in the form of uncollected royalty. Royalty is payable not only in Indonesia but also in all probability in all the other countries where PT Eagle has sold and is continuing to sell medicated oil under Borden’s Eagle Brand trade mark. These failures and omissions by the respondents, whether due to neglect, complacency or a difference in business philosophy, have caused serious and irrevocable damage to the commercial interests of Borden and will continue to cause more damage unless PT Eagle’s licence to manufacture and distribute Borden’s medicated oil under the Eagle Brand trade mark is terminated. 51        Finally, although the respondents’ failure to explain why they did nothing to terminate PT Eagle’s licence is not, in itself, oppressive conduct, it is the consequences of the failure that have resulted in the commercial interests of the appellants as members of Borden being diminished in value. This amounts to a disregard of their interests in terms of s 216 of the CA unless the respondents’ conduct can be otherwise explained. Given the nature of the relationship between the members of Borden, as agreed by them, SKL’s claims of oppression or disregard of the appellants’ interests required an explanation from the respondents. In cases of this nature, where the members have agreed to associate together in trust and confidence in one another, we are of the view that a failure to explain amounts to an inability to explain or to justify why they did what they did. We are not here concerned with an ordinary trading company, where the shareholders have agreed to accept majority control and decision-making. In the absence of any explanation, the respondents must be deemed to have intended the consequences of their acts and omissions. Removal of SKL as executive director 52        SKL’s executive powers were taken away from him at the initiative of Mdm Halim, not directly but indirectly, thus giving rise to the suspicion of a plot or plan behind it. At the EGM of9 November 2001 (“the 2001 EGM”), Mdm Halim’s proposal that “directors do not hold executive positions in Borden” was adopted, resulting in SKL losing his executive powers immediately and preventing him from continuing his investigations into the suspected conflict of interests of Mdm Halim, from taking action to terminate PT Eagle’s licence, and from defending PT Eagle’s Malaysian action aggressively. The reason given for the proposal was that a general manager reporting to the board of directors would be sufficient. In our view, this was not an adequate reason for removing SKL as executive director since it is not normal for shareholders or the directors to embark on this course of action unless the executive director has done something that justifies his removal. Worse, stripping him of such powers and vesting them in a general manager within such a short time suggests a pre-conceived plan to get rid of SKL as the executive director for reasons which had nothing to do with any failure to advance the interests of Borden. 53        The trial judge at [76] of her judgment stated: In my opinion, looking at the matter from Mdm Halim’s point of view, it would appear that she had reason to be annoyed with [SKL] in October 2001 when she put in the requisition for the 2001 [EGM]. The reason was that SKL had done nothing to recover the debt owed by Po Wah Trading Company (“Po Wah”) to Borden or TLT’s bonus, and these were some of the matters that Mdm Halim thought required action when she requisitioned the 2001 EGM. The problem with this statement is that Mdm Halim did not say so, whether at the EGM, or in her amended defence or at the trial. The agenda for the 2001 EGM does not record Mdm Halim’s annoyance, nor do the minutes of that EGM. In the light of her total silence on the matter, and taking into account the fact that about two months later there was a complete turnaround by the directors in appointing Rachel Chew and Christopher Yeo asexecutive directors, a matter which the respondents have also refused to explain in court or to address in their defence, we think the real reason for Mdm Halim’s initiative to strip SKL of his executive powers certainly went beyond mere annoyance with his performance. 54        The trial judge did not believe SKL’s testimony on these issues. The main reason why the trial judge did not believe SKL’s testimony on these points was that, when cross-examined by counsel for the respondents, he could not show positively that they knew about his investigations into PT Eagle’s activities and Mdm Halim’s position. The trial judge found the evidenceequivocaland that therefore, the appellants had “not proved that requisition was prompted by the advice given [by D&N] on Mdm Halim’s position or on the termination of the licence” (at [42]). 55        There were other findings made by the trial judge which could have had a bearing on her refusing to believe SKL’s testimony on why he was removed as an executive director. One at [44] concerns SKL’s claim in para 15 of the second affidavit that he had discovered certain irregularities in the way Borden’s business was being carried on and PT Eagle’s competition with Borden, and that he tried to investigate and rectify some of these matters but was blocked by the other directors and majority shareholders. The trial judge found that he had fabricated these “discoveries” and “investigations” because he had not discovered them on his own and had learnt about them from a past accountant’s report prepared for Mdm Halim. Another is that Mdm Halim was not in a position of conflict (an issue which will be addressed later) and therefore would not have any reason to conspire with the other respondents to remove SKL as an executive director. A third is that when the requisition for the 2001 EGM was served on him, SKL did not complain about any conspiracy, but merely raised various objections and even proposed that no person related to any of the directors should be appointed as general manager. 56        We take note of these findings. However, there were other pointers in the record that lent credibility to SKL’s statements. Firstly, although SKL was found to have lied about his “discoveries”, the record shows that he did check on Mdm Halim’s position in PT Eagle and that he did seek D&N’s advice on the issue. SKL might have breached his duties as a director in not investigating the other irregularities concerning the way Borden’s business was being conducted or in taking action to collect the Po Wah debt or to recover the unauthorised bonus paid to TLT. Nevertheless, the record shows that there were irregularities in the way Borden’s business was being carried on, and that Mdm Halim held a corporate position that entailed responsibilities in PT Eagle, which was owned by her son. Further, Mdm Halim had failed to disclose this relationship to the appellants, and she had in fact lied to the other directors about the existence of such a relationship. 57        Secondly, the record also shows that shortly after SKL was removed as an executive director, TLT convened a directors’ meeting on 28 January 2002 to appoint Christopher Yeo as the managing director and Rachel Chew as the assistant managing director of Borden, contrary to the 2001 EGM resolution. When SKL complained about this, Christopher Yeo replied that circumstances had changed, without elaborating what the changed circumstances were. 58        Thirdly, SKL had also testified that after he was stripped of his executive powers, he was kept out entirely from the affairs of Borden although he was still a director. The respondents have not led any evidence to deny this statement and the trial judge found that the respondents had not addressed this issue in closing submissions. 59        Fourthly, SKL should not and cannot be criticised for not raising the issue of conspiracy when he was served with Mdm Halim’s requisition that all directors not be given executive powers. There was no reason for him to be dissatisfied with a situation where all the directors exercised control and management of the affairs of Borden, with the assistance of a general manager. It is not difficult to understand the change in his appreciation of what was going on when two months later Rachel Chew and Christopher Yeo were appointed executive directors. If he did not smell a rat earlier, he could not be faulted for smelling a rat as a result of this later event. 60        Fifthly, there were other events that lent credibility to the fears of SKL for the future of Borden and his family’s interest in it. These concerned the withdrawal of any action against PT Eagle in connection with the registration of the Eagle Brand trade mark in the UAE, the expansion of PT Eagle’s businesses without the consent of Borden and without having to pay any royalty, and the inequitable settlement with PT Eagle on its Malaysian action. We will now address these other issues. PT Eagle’s Malaysian action 61        The appellants’ case on this episode is that the Malaysian action had been aggressively contested when SKL was an executive director and this had resulted in PT Eagle’s action being struck out. Although PT Eagle had filed an appeal, the momentum was with Borden and there was no reason for it to settle with PT Eagle. However, after SKL lost his executive powers, the respondents decided to settle the case, despite his objections. The trial judge found against the appellants on this issue mainly on the ground that Borden’s Malaysian legal advisers had advised that Borden had a 30% chance of winning the case against PT Eagle, and that it was in the interest of Borden to be able to move into the Malaysian market and benefit from direct sales in Malaysia. The trial judge also dismissed the fact of SKL’s plea for more time to think and seek further advice from D&N as not warranted as the shareholders had thought about it for some time and had also received legal advice from the Malaysian lawyers. 62        In our view, the trial judge, in attributing the Malaysian settlement to a difference in business philosophy, may have overlooked a number of factors that show that the settlement, or rather the terms of the settlement agreement, could only have been agreed upon by shareholders who were either misled or who had little interest in protecting Borden’s Malaysian market. PT Eagle’s Malaysian action was not an isolated incident. The action was taken at a time when Mdm Halim was a commissioner of the company. She was still a commissioner when the settlement took place. If all the other related factors had been taken into account, it is reasonably clear to us that as a commercial settlement, Borden had been made to pay a very substantial sum of money to regain a market which had rightfully belonged to it in the first place. Let us take a look at the evidence. 63        First, PT Eagle had demanded US$1m to move out of the Malaysian market. Christopher Yeo allegedly offered US$500,000 but told the meeting that US$900,000 was the minimum that PT Eagle would accept. Christopher Yeo told the meeting that Medic Marketing Pte Ltd was prepared to take over the distribution of Eagle oil in Malaysia and had committed to purchasing three or four containers of goods for the first year, which would give a turnover of S$1.6m a year. There is no evidence that these statements were true as Christopher Yeo did not testify. The latter statement has now been shown to be highly inaccurate and misleading, and therefore the statement was then totally unreliable. The 2005 and 2006 audited accounts of Borden’s Malaysian operations show thatonly about $670,000 worth of products had been sold in the first two years. This would probably have resulted in a profit of $150,000 to $200,000.At this rate, it would take Borden 15 to 20 years to recover the US$900,000 and interest accruing thereon. It would appear that the respondents had meekly accepted whatever Christopher Yeo had said or recommended. No accounts had been produced to show the volume of PT Eagle’s sales of the medicated oil in Malaysia or the profit it made each year. In our view, SKL had good reason to ask for more time to consult D&N. 64        Second, the trial judge appears to have regarded the advice of Borden’s Malaysian lawyers that Borden had only a 30% chance to win the action as a reasonable justification for the settlement. She did not take into account the full advice given by D&N on 12 March 2002 after taking note of the advice of the Malaysian lawyers. D&N’s advice outlined three courses of action as follows: (a)        defend the action; (b)        settle with PT Eagle by allowing it to continue to use its trade mark in Malaysia, paying royalty on a regular basis; and (c)settle with PT Eagle by selling its Malaysian trade mark to PT Eagle. D&N recommended that if Borden wished to protect its trade mark and sales in Malaysia and other markets, and subject to a favourable assessment from D&N’s Malaysian associates on the admission of fresh evidence in the Malaysian proceedings, option (a) was the best option. 65        D&N’s advice on the fresh evidence was as follows: We did … receive … some extracts from Borden’s account books (1983 – 1991) from [SKL indicating] that a sum of S$60,000 was received annually from [PT Eagle] from 1982 – 1991 ostensibly as payment of a trade mark licence fee … With these documents, Borden … may be able to successfully prove the licence relationship, or at least, that [PT Eagle’s] use of the mark in Malaysia was only with Borden’s consent. We can forward these documents to the Malaysian associates to determine if they can be admitted as fresh evidence at this stage of the proceedings. (The documents were discovered and produced only after the OM was dismissed by the learned Judge below and have not been shown to our Malaysia associates.) 66        At a shareholders’ meeting held on 29 April 2002, D&N’s advice was considered. Borden’s Malaysian lawyer, one Wendy Lam, was present and her advice was as follows: [T]he chance of [Borden] winning the appeal is 30% at best and 20% at worst as [Borden] does not have sufficient documentary proof to show the licensor-licensee relationship between [Borden] and [PT Eagle]. Her recommendation of negotiation for settlement as stated in her letter dated 15 August 2000 still stands. Wendy Lam suggested the following to the meeting: (a)        check the sales of PT Eagle in Malaysia for the purpose of preparing for the settlement negotiation; and (b)        register new products under the “Eagle Brand”. However, the minutes of this shareholders’ meeting do not indicate whether Wendy Lam had seen the fresh evidence that D&N had referred to at the previous meeting. We note that SKL was present and legally represented at this meeting. 67        At the next shareholders’ meeting held on 6 June 2002, SKL was still not in favour of any settlement, but Christopher Yeo, taking the view that PT Eagle had the stronger case, said negotiating with PT Eagle would not be easy and that he would try his best. 68        The next shareholders’ meeting held on 18 December 2003 discussed the problem with PT Eagle under the item “ANY OTHER BUSINESS”. All the shareholders present, other than SKL, approved a resolution to pay PT Eagle US$900,000 in settlement to recover the Malaysian market. SKL suggested that D&N be consulted on the pros and cons, especially on the legal implications, to which Christopher Yeo said he would do so. The views expressed by the shareholders as recorded in the minutes of this meeting are as follows: (a)        Christopher Yeo: He and TLT had talked to Edy Chew, who wanted US$1m to return the Malaysian market to Borden. Christopher Yeo counter-offered US$500,000 but Edy Chew indicated that US$900,000 was the minimum he would accept. Medic Marketing was prepared to take over the distribution of Borden’s medicated oil in Malaysia and had committed to taking four containers of goods for the first year which would give a turnover of S$1.6m; although SKL wanted more time to consider the settlement proposal, other shareholders might not agree, and the shareholders were being asked to decide on whether the settlement proposal should be accepted. (b)        TLT: He agreed to the compensation of US$900,000 as the law suit might drag on for some years. TLT felt that even if Borden won the case, it might take another two years to register the products with the Ministry of Health, Malaysia, and that with the private settlement with PT Eagle, it was likely that Borden wouldbreak even by the second year. He said Borden had to decide fast in case Edy Chew changed his mind. (c)        Rachel Chew: She was of the view that if Borden could gain control of the market and based on Medic Marketing’s commitment, the proposed amount would be a good deal for Borden. (d)        Lim Kheng Puan: He agreed with the proposal and felt that no time should be wasted. (e)        Richard Yeo: He agreed with Christopher Yeo that the proposal was good for Borden in the long run. (f)SKL: He was of the view that D&N should be asked to study the proposal. 69        Our comments on this meeting are as follows: (a)        Given the importance of the Malaysian market to Borden, the majority shareholders treated the problem too casually. The issue was decided under the item “ANY OTHER BUSINESS” without any supporting papers. (b)        No further advice from the Malaysian lawyers was tabled, suggesting that the managing directors did not obtain the advice that D&N had recommended. No paper on Borden’s sales data was tabled. No study was tendered to justify the proposal to pay US$900,000 to PT Eagle. No study was tabled to show the basis of the claim that the turnover would be S$1.6m, and finally, no study was tabled showing that Borden could break even in two years. There is no evidence that the figures given by Christopher Yeo had any factual basis whatsoever. (c)        Furthermore, the shareholders appeared to be in a hurry to settle with PT Eagle, at a time when its Malaysian action had already been dismissed, and the appeal (which was an appeal on the proper form of the action, and not on the merits of the claim) would not be heard for some time. (d)        SKL and Borden were faced with a no-win situation for the simple reason that Mdm Halim and Rachel Chew were related to Edy Chew and that it was within the realm of probability that somehow Edy Chew would come to know about what had been discussed at Borden’s shareholders’ meetings. Although ordinarily a member is entitled to vote as he pleases in his own interests, in this instance, to avoid any allegation of oppressive conduct, Mdm Halim and the shareholders who had family ties to her should have disqualified themselves from attending those crucial meetings and voting on the proposals. In our view, this omission lends credibility to SKL’s allegations that they had acted in concert in disregard of the appellants’ interests as minority shareholders. (e)        The fresh evidence adduced by the appellants on appeal suggests that the shareholders who approved the settlement had either been deliberately misled by Christopher Yeo and TLT on the benefit of the settlement to Borden or that they were not interested in whether it was for Borden’s benefit. The fresh evidence shows that the settlement with PT Eagle was a total rip-off. In 2004, the turnover for Borden’s products was $225,311.33 and in 2005, the turnover was $488,122.93. This was only 15% to 30% of the turnover alleged by Christopher Yeo. The profit margin on the turnover for the two years is not known. Assuming that it is 20%, it would take Borden 15 to 20 years to recover the settlement sum of US$900,000, without taking into account the interest accruing thereon. This is clearly a far cry from TLT’s assertion that Borden would break even in two years. The imprudence and the haste with which the respondents agreed to settle with PT Eagle is evident from the fresh evidence. 70        In fact, the actual terms of the settlement agreement show that Borden’s interests were severely compromised. For example, cl 2.6 states: [PT Eagle] agree to supply Borden at their requests the relevant products in the territory of Malaysia only in accordance to the reasonable terms which parties may agree from time to time and Borden agree to pay for such requested products at cost plus basis to [PT Eagle]. For the purposes of this Agreement, “Products” shall mean the products which [PT Eagle] shall designate in writing to Borden from time to time. The payment for the Products shall be in accordance with the terms and manner which [PT Eagle] shall notify Borden in writing. It seems ludicrous that, having paid PT Eagle US$900,000 to regain the Malaysian market, Borden actually agreed to become PT Eagle’s distributor in Malaysia at prices initially set by PT Eagle! 71        Clause 3 states: Other than clause 2 above, the parties agree and jointly undertake to maintain the status quo in respect of all current and existing registrations for products, trademarks, designs, patents, copyright and all other intellectual property and allied rights respectively held by the parties in the other territories and countries (other than Malaysia) and the parties further agree and undertakes [sic] to recognize, respect, not contest, oppose or challenge or otherwise interfere with the respective use of the same by the parties in their respective territories and countries in any manner or form. Clause 4 states: This Agreement shall be the full, final and complete settlement of all matters, actions, dispute, claims and proceedings whatsoever between the parties. Clause 5 states: The parties jointly agree and undertakes [sic] that in jurisdiction and territories where either parties do not have a current or existing Product or trademark or design or patent or other intellectual property registrations or rights, the parties shall recognize and respect each other’s registration on a first registration basis or as parties may agreed [sic] mutually. Clause 6 states: Save for that which is expressly agreed hereunder, the parties acknowledge that they have no other or further claim whatsoever against each other in connection with the subject-matter of this Agreement. By agreeing to cll 3 to 6, Borden had effectively ceded all the markets in which PT Eagle had already entered (see [18] above). This is despite the fact that PT Eagle had not paid Borden royalty for the use of these trade marks. Bearing in mind that Borden was paying PT Eagle US$900,000 under this same agreement, Borden was in fact paying PT Eagle to take away and secure Borden’s markets. The settlement agreement clearly could not have been in Borden’s interest. What has been given away appeared to be the right to collect royalty. Mdm Halim’s positions in Borden and PT Eagle 72        The trial judge held that Mdm Halim was a commissioner of PT Eagle during the period she was also a director of Borden. In August 2000 she lied to the shareholders when she asserted she was not a commissioner of PT Eagle. There was no reason for her to do so unless she had something to hide. The trial judge took a traditional legal approach that a person may be a shareholder in two competing companies and that a shareholder does not owe any duty not to own other shares. Therefore, Mdm Halim was not in a position of conflict. She found that Mdm Halim was not a director of PT Eagle and therefore even though PT Eagle was in competition with Borden, Mdm Halim was not in a position of conflict. The trial judge also held that being a commissioner is a lesser position than a director in that the former position gives the holder only a supervisory power, and there was no evidence as to how she had exercised her role in such a position as SKL was not able to point to any particular act done, whether as a director of Borden or as a commissioner of PT Eagle, that had put her in a position of conflict or that had arisen from such a position of conflict. 73        We do not disagree with the trial judge on her conclusion that Mdm Halim was not in a position of conflict applying established principles of law relevant to ordinary companies. But Borden is not an ordinary trading company. Borden is only the corporate shell behind which are real people who repose trust and confidence in one another: seeEbrahimi([13]supra).They owe duties to one another. Mdm Halim was at the same time a shareholder of PT Eagle which was controlled by her son. She was instrumental in stripping SKL of his executive powers to prevent him from trying to halt PT Eagle’s aggressive move into Borden’s markets in Malaysia and Vietnam and from registering the Eagle Brand trade mark in the UAE. When SKL was trying to protect the interest of Borden against the expansionist activities of PT Eagle, Mdm Halim was placed in a position where she either had to agree with what SKL was doing or she had to stop it. In equity, she was placed in a position of conflict when she had to decide which interest she preferred, her commercial interest in Borden or her commercial and family interest in PT Eagle. The unrebutted evidence suggests that she preferred the latter. 74        We also agree with the trial judge that a conflict of interest position,per se, is not objectionable so long as the person concerned does nothing to actualise that conflict. But this does not mean that the position of conflict of interest that Mdm Halim was in at the material time was not a material factor. In this case, it is thekeyto the proper appreciation of her conductvis-à-visSKL and the other respondents who were not her extended family members. SKL was stripped of his executive powers and TLT somehow sided with her for no apparent reason after trying to investigate her activities and to remove her as a director. In our view, there is sufficient evidence on record to infer that on a balance of probabilities, Mdm Halim’s conduct was motivated more by her connections with PT Eagle than her interest in Borden. By consistently acting in a way (while a director of Borden) that points to her preferring her interest in PT Eagle to her interest in Borden, she had acted in disregard of the interests of the appellants as minority shareholders. Loss of the Vietnam market, failing to object to PT Eagle registering trade mark in the UAE,etc 75        SKL testified that Vietnam was an important market for Borden and that the sales of Borden’s products in Vietnam were affected by parallel imports of PT Eagle’s products into that market. Borden’s sales in Vietnam between 1998 and 2004 were as follows:  1998–$5.8m1999–$1m2000–$80,0002001–$422,0002002–$850,0002003–$1.1mJanuary to May 2004–$150,000 Mdm Halim and the other respondents did not deny this, since they remained silent. 76        In the face of this damning evidence, the respondents could only resort to cross-examining SKL on how he had acquired samples of the parallel competing products from Vietnam. SKL was quite justified in claiming that the expansion of PT Eagle’s business in competition with Borden resulted in the loss of the Vietnam market as a direct consequence of the respondents refusing to take action to terminate PT Eagle’s licence (see [22] to [30] above). In the light of SKL’s evidence with regard to the Vietnam market, which was not rebutted by the respondents, we are constrained to find that the respondents’ behaviour in Vietnam wasprima faciein disregard of the interests of Borden, andipso factoof the appellants’ interests as minority shareholders. 77        Turning to the loss of Borden’s trade mark in the UAE and Yemen, SKL testified that the respondents’ decision not to proceed with the trade mark oppositions was not consistent with the meeting on 27 December 2001, when Christopher Yeo stated that he would look into the matter. Further, D&N had in their letter dated 2 January 2002 advised that although the chances of success in each of these countries were 50% at best, steps should nonetheless be taken to oppose the trade marks in order to preserve Borden’s position and prevent further expansion into markets by PT Eagle. When cross-examined on these issues, SKL reiterated that parallel imports had been the cause of serious competition for Borden and he had sought legal advice on the matter. He was advised that since PT Eagle was licensed to manufacture Borden’s medicated products, they were not counterfeit products but were parallel imports in countries such as Vietnam. As such, there was little that Borden could do to stop these imports unless PT Eagle’s licence was terminated. 78        Having set out the evidence of SKL and the issues on appeal, we now state the general principles of law relating to s 216 of the CA before stating our conclusions based on the issues on appeal discussed above.",
        "The law – section 216 of the Companies Act": "79Section 216(1) of the CA states that: Any member … of a company … may apply to the Court for an order under this section on the ground — (a)        that the affairs of the company are being conducted or the powers of the directors are being exercised in a manner oppressive to one or more of the members … including himself or in disregard of his or their interests as members, shareholders … of the company; or (b)        that some act of the company has been done … which unfairly discriminates against or is otherwise prejudicial to one or more of the members … (including himself). 80        The law on acts that are considered oppressive to a minority shareholder or in disregard of his interests is settled. Although the courts have been slow to intervene in the management of the affairs of companies (see for exampleRe Tri-Circle Investment Pte Ltd[1993] 2 SLR 523) on the ground that a minority shareholder participates in a corporate entity knowing that decisions are subject to majority rule, s 216 of the CA enjoins them to examine the conduct of majority shareholders to determine whether they have departed from the proper standard of commercial fairness andthe standards of fair dealing and conditions of fair play:Re Kong Thai Sawmill (Miri) Sdn Bhd[1978] 2 MLJ 227at 229. 81        InRe Kong Thai Sawmill (Miri) Sdn Bhd, Lord Wilberforce described the disregarding of minority interests as something more than a failure to take account of the minority interests, such as an awareness of the minority interest and an evident decision to override it or brush it aside.InIn re Five Minute Car Wash Service Ltd[1966] 1 WLR 745at 752, Buckley J made it clear that the director in that case had to have “acted unscrupulously, unfairly or with any lack of probity”. Margaret Chew, author ofMinority Shareholders’ Rights and Remedies(Butterworths Asia, 2000) pertinently states at pp 107 and 108 that: Section 216 of the Companies Act was conceived and passed with the objective of protecting minority shareholders from majority abuse. In order to offer effective and comprehensive protection, section 216 confers on the courts a flexible jurisdiction to do justice and to address unfairness and inequity in corporate affairs. … The courts may be said to be empowered under section 216 of the Companies Act to re-lay the boundaries of what is or is not fair as between corporate participants. 82        A clear exposition of the rationale underlying s 216 of the CA is found in the judgment of Lord Hoffmann inO’Neill v Phillips[1999] 1 WLR 1092, a case under s 459 of the Companies Act 1985 (c 6) (UK), which corresponds materially to our s 216 CA. Lord Hoffmann said (at 1098–1099): In section 459 Parliament has chosen fairness as the criterion by which the court must decide whether it has jurisdiction to grant relief. It is clear from the legislative history ... that it chose this concept to free the court from technical considerations of legal right and to confer a wide power to do what appeared just and equitable. But this does not mean that the court can do whatever the individual judge happens to think fair. The concept of fairness must be applied judicially and the content which it is given by the courts must be based upon rational principles. … Although fairness is a notion which can be applied to all kinds of activities, its content will depend upon the context in which it is being used. Conduct which is perfectly fair between competing businessmen may not be fair between members of a family. In some sports it may require, at best, observance of the rules, in others (“it’s not cricket”) it may be unfair in some circumstances to take advantage of them. All is said to be fair in love and war. So the context and the background are very important. In the case of section 459, the background has the following two features. First, a company is an association of persons for an economic purpose, usually entered into with legal advice and some degree of formality. The terms of the association are contained in the articles of association and sometimes in collateral agreements between the shareholders. Thus the manner in which the affairs of the company may be conducted is closely regulated by rules to which the shareholders have agreed. Secondly, company law has developed seamlessly from the law of partnership, which was treated by equity, like the Roman societas, as a contract of good faith. One of the traditional roles of equity, as a separate jurisdiction, was to restrain the exercise of strict legal rights in certain relationships in which it considered that this would be contrary to good faith. These principles have, with appropriate modification, been carried over into company law. The first of these two features leads to the conclusion that a member of a company will not ordinarily be entitled to complain of unfairness unless there has been some breach of the terms on which he agreed that the affairs of the company should be conducted. But the second leads to the conclusion that there will be cases in which equitable considerations make it unfair for those conducting the affairs of the company to rely upon their strict legal powers. Thus unfairness may consist in a breach of the rules or in using the rules in a manner which equity would regard as contrary to good faith. 83        It bears repeating that in a case such as the present where a company has the characteristics of a quasi-partnership and its shareholders have agreed to associate on the basis of mutual trust and confidence, the courts will insist upon a high standard of corporate governance that must be observed by the majority shareholdersvis-à-visthe minority shareholders.",
        "Conclusions of this court": "84        In this appeal, we have evaluated the evidence of the appellants on the basis of the burden of proof they have to dischargein the context of a submission of no case to answer. As the respondents have declined to give any evidence, the burden on the appellants is merely to prove aprima faciecase. On this basis, the burden is not difficult to discharge. In our view, the appellants have discharged it. Accordingly, we make the findings set out below.",
        "Failure to terminate licence and to collect royalty": "85        The failure on the part of the respondents to terminate PT Eagle’s licence and to collect royalty from PT Eagle since 1995 was detrimental to the commercial interests of Borden and therefore in disregard of the appellants’ minority shareholding interests, contrary to s 216(1)(a) of the CA.",
        "Removal of SKL as executive director": "86        The removal of SKL as an executive director unfairly discriminated against him and was contrary to s 216(1)(b) of the CA. Further, his being kept entirely out of the affairs of Borden after his removalwas oppressive to him, contrary to s 216(1)(a) of the CA.",
        "PT Eagle’s Malaysian action": "87        The settlement of the Malaysian action was in total disregard of the interests of Borden and therefore in disregard of the interests of the appellants, contrary to s 216(1)(a) of the CA.",
        "Mdm Halim’s positions in Borden and PT Eagle": "88        Mdm Halim’s position as commissioner of PT Eagle and her conduct, supported by that of her family members in Borden, wasprima facieevidence that they had preferred the interests of PT Eagle to those of Borden, and this was in disregard of the interests of the appellants as minority shareholders, contrary to s 216(1)(a) of the CA.",
        "Loss of the Vietnam market, failing to object to PT Eagle registering trade mark in the UAE,etc": "89        As the respondents failed to look into why the sales figures of Borden in the Vietnam market fell from $1m in 2003 to $150,000 in the first half of 2004, we find that the respondents’ inactionprima facieamounted to a disregard of the interests of Borden and the appellants’ interests as minority shareholders, contrary to s 216(1)(a) of the CA.",
        "Remedy to be awarded": "90        We now turn to the remedy that is to be granted to the appellants. Section 216(2) of the CA states: If on such application the Court is of the opinion that either of such grounds is established the Court may, with a view to bringing to an end or remedying the matters complained of, make such order as it thinks fit and, without prejudice to the generality of the foregoing, the order may — (a)        direct or prohibit any act or cancel or vary any transaction or resolution; (b)        regulate the conduct of the affairs of the company in future; (c)        authorise civil proceedings to be brought in the name of or on behalf of the company by such person or persons and on such terms as the Court may direct; (d)        provide for the purchase of the shares or debentures of the company by other members or holders of debentures of the company or by the company itself; (e)        in the case of a purchase of shares by the company provide for a reduction accordingly of the company’s capital; or (f)        provide that the company be wound up. 91        We note that the appellants have clearly stated their desire that Borden be wound up. Their main reason for this is that the familial and close-knit management that was originally conceived is no longer possible and Borden’s business would only continue to be exploited by the respondents for their own advantage. We are not minded to accept this submission. As I stated inTang Choon Keng Realty (Pte) Ltd v Tang Wee Cheng[1992] 2 SLR 1114at 1142, [58], the court’s discretion under s 216 of the CA should be exercised with a view to bringing to an end or remedying the matters complained of. If the state of affairs in a particular case can be remedied by an order other than winding up, there is no reason for a court to wind up the company. Further, we are of the view that winding up should only be ordered if, having taken into account all the circumstances of the case, it is the best solution for all the parties involved. In general, the courts are not minded to wind up operational and successful companies unless no other remedy is available. 92        In our view, the most appropriate remedy is for the respondents to purchase the appellants’ shares. Accordingly, we would make the following orders: (a)        The second to tenth respondents are to purchase the appellants’ shares in Borden. (b)        The price of the shares is to be determined by an independent valuer, who is to be appointed by agreement between the appellants and the second to tenth respondents, within 14 days hereof, failing which the Registrar of the Supreme Court will make the appointment. (c)        The independent valuer is to fix the purchase price at a fair value based on Borden’s net assets without any discount after taking into account all moneys of Borden that have been misused by the respondents as referred to in sub-para (d)(ii) below and after making appropriate adjustments to offset the effects of the oppressive and/or unjust conduct of the respondents. (d)        In particular, the independent valuer should: (i)         determine Borden’s loss of royalty from 1995 to the present, and the interest accruing thereon at 6% per annum; and (ii)        compute the loss that the appellants have suffered indirectly as a result of Borden’s payment of US$900,000 to PT Eagle under the terms of the settlement agreement. (e)        The fair value of Borden’s net assets should be determined as at 9 September 2002, when this action was commenced. (f)         All fees, costs, expenses and disbursements incurred by and charged to Borden arising out of and/or in connection with the appellants’ complaints and this action are to be fully reimbursed by the second to tenth respondents. (g)        The parties shall have liberty to apply for further orders. (h)        The costs of this appeal and in the court below are to be paid by the second to the tenth respondents, with the usual consequential orders."
    }
}