{
    "case_title": "Asian Corporate Services (SEA) Pte Ltd v Eastwest Management Ltd (Singapore Branch)",
    "ncitation": "[2006] SGCA 1",
    "coram": "Andrew Ang J; \n      Chao Hick Tin JA",
    "sections": {
        "The background": "2          The appellant is a Singapore-incorporated private limited company and its principal activity is the provision of business management and consultancy services. Such services include the incorporation of Singapore and offshore companies, provision of nominee directorships, appointment of local agents for foreign companies with branches in Singapore, company secretarial and administration, and accounting services. 3          In Suit No 834 of 2004 (“Suit 834/2004”) the appellant sued seven parties for,inter alia, conspiracy to injure by unlawful means. To understand how the alleged conspiracy came about, it is necessary to understand the relationships between the seven defendants. Among the defendants, the main personality is the fifth defendant, Duncan Samuel Rothwell Merrin (“Merrin”), who, prior to the year 2000, owned all the issued shares of the appellant except for one. Merrin was also its managing director. By 2002, Merrin had sold all his shares in the appellant to a New Zealand company called European Trust Company Ltd (“ETC”). We should mention that before ETC became the owner, the appellant was known by another name. However, nothing turns on this change of name. 4          Although by 2002 Merrin no longer owned any shares in the appellant, the new owner, ETC, continued to retain Merrin as the managing director of the appellant until 30 June 2004. Merrin also continued with the appellant as a director and company secretary until 19 October 2004, the date on which the AP Order was executed. 5          The first defendant in Suit 834/2004 is Impact Pacific Consultants Pte Ltd, a Singapore company which was established to provide business management and consultancy services. The second defendant is Impact Pacific Management Pte Ltd, a Singapore company incorporated for the purposes of developing other software and multimedia works. Both these companies share the same registered office and it was the plan that they be brought within the group of companies known as the Kennedy group of companies. The first defendant is wholly owned by Mayseille Intl Ltd (another entity in the Kennedy group). The second defendant is 50% owned by the seventh defendant and 50% owned by the first defendant. 6          The third defendant, the respondent in this appeal, is a UK company registered locally on 22 July 2003 as a general commercial company whose activities include business and management consultancy. The person behind the respondent is one Greg Kennedy (“Kennedy”) who controls the Kennedy group of companies. The fourth defendant, Fullcircle Pte Ltd, is also a Singapore company formed for the purpose of providing business and corporate advisory services. The third and fourth defendants share the same registered office. 7          The sixth defendant, Norhayati Bte Malek, is the wife of Merrin, and was employed by the appellant as a marketing co-ordinator from August 1994 to end October 2003. The seventh defendant, Mark Justin Baile, is a permanent resident in Singapore and is a shareholder of the second defendant. He was, for a very brief period, from May to July 2002, employed by the appellant on a part-time basis. The seventh defendant, together with two others, are the directors of the first defendant. He, together with Kennedy, are the directors of the second defendant. 8          Merrin and his wife (the sixth defendant), together with one Graeme John Bliss (“Bliss”), who resides in the UK, are the directors of the respondent. Merrin and his wife were appointed as the directors of the respondent on 26 June 2003 while they were both still in the employ of the appellant. Bliss only became a director of the respondent on 3 March 2004. 9          Reverting to Merrin’s position with the appellant, on 30 June 2003, he informed the appellant that he would like to quit his employment. On 28 August 2003, the Chairman of ETC enquired of Merrin if he was leaving to join a competitor. The purpose of this inquiry was to enable ETC to decide whether to keep Merrin pending its search for a replacement. Merrin indicated that he was not joining a competitor, but a large organisation in a different field of business. Thereafter, Merrin was retained as the managing director of the appellant. 10        In January 2004, the appellant found one Tan Hang Song (“Tan”) whom it intended would replace Merrin as its managing director. It was arranged that Tan would understudy Merrin to understand the job and ensure a smooth handover. It was during the period of understudy that circumstances arose which gave grounds for Tan to doubt the integrity of Merrin as he thought that Merrin had: (a)        failed to properly account for clients who had decided to terminate the appellant’s services; (b)        been reluctant to give information about some of the appellant’s clients; and (c)        provided incorrect information regarding the loss of clientele. 11        In this regard, there was one other matter which gave the appellant a further reason to be concerned. Merrin, as the managing director, was provided with a laptop computer for his use. However, when Tan requested Merrin to hand over the laptop computer as part of the process of transfer of responsibilities, Merrin claimed that the computer also contained his personal e-mails which he first needed to remove. On or about 10 June 2004, when Merrin left the laptop computer at the office, Tan instructed computer experts, TecBiz FrisMan (“TecBiz”), to copy a minor image of the hard disk and conduct a forensic analysis of the contents of the laptop computer. The next day, contrary to the instructions given to him, Merrin had everything in his computer erased, including documents and materials relating to the business of the appellant, before handing the computer to Tan. Thus, for the next several months, a forensic examination of the laptop computer and further investigations in relation to possible wrongdoings by Merrin were carried out. The net result was the uncovering of the following alleged wrongdoings: (a)        Merrin and his wife had acted in breach of their fiduciary duties as employees, and in the case of Merrin, as a director, of the appellant. (b)        Merrin had conspired with the respondent and the other defendants in so acting in breach of his fiduciary duty to the appellant. (c)        Merrin, his wife, the respondent and the other defendants had conspired to divert business away from the appellant.",
        "Decision below": "12        The judge below discharged the AP Order on primarily the following grounds. First, there was nothing to implicate the respondent in the alleged conspiracy. Notwithstanding that they were the directors of the respondent, Merrin and his wife were not the controlling minds of the respondent. Merrin was only the employee of the respondent. The respondent was controlled by its London office and Kennedy. Second, while Merrin had destroyed the records of the appellant to avoid detection of his breach of fiduciary duties, it did not follow that the respondent would also destroy relevant evidence to avoid detection. An Anton Piller order should only be granted where there was cogent evidence to show that there was a real and imminent risk that such evidence might otherwise be destroyed or tampered with. Third, the businesses of the appellant diverted to the respondent related to companies which are part of the respondent’s group of companies and the value of those businesses came up to only an insignificant amount of $19,000. Fourth, the respondent was established purely to service companies within the group and not to provide services to other companies or entities generally. Fifth, there was no attempt to conceal Merrin and his wife’s involvement with the respondent, their directorships being a matter of public record. Sixth, the appellant sought to use the AP Order granted as a primary investigatory tool to ascertain open facts that could have been obtained through conventional civil procedure processes. Seventh, the grant of an Anton Piller order in the circumstances would be a disproportionate measure.",
        "The law": "13        We recognise that in this appeal, the function of this court is one of review. It must not exercise an independent discretion of its own and must defer to the judge’s exercise of his discretion. This position was stated very clearly in the often quoted passage of Lord Diplock inHadmor Productions Ltd v Hamilton[1983] AC 191at 220, a passage adopted by this court inChiarapurk Jack v Haw Par Brothers International Ltd[1993] 3 SLR 285at 292, [16]: An interlocutory injunction is a discretionary relief and the discretion whether or not to grant it is vested in the High Court judge by whom the application for it is heard. Upon an appeal from the judge’s grant or refusal of an interlocutory injunction the function of an appellate court, whether it be the Court of Appeal or your Lordships’ House, is not to exercise an independent discretion of its own. It must defer to the judge’s exercise of his discretion and must not interfere with it merely upon the ground that the members of the appellate court would have exercised the discretion differently. The function of the appellate court is initially one of review only. It may set aside the judge’s exercise of his discretion on the ground that it was based upon a misunderstanding of the law or of the evidence before him or upon an inference that particular facts existed or did not exist, which, although it was one that might legitimately have been drawn upon the evidence that was before the judge, can be demonstrated to be wrong by further evidence that has become available by the time of the appeal, … 14        It is also settled law that to warrant the issue of an Anton Piller order four tests must be satisfied: (a)        Whether the plaintiff has shown that it has an extremely strongprima faciecase. (b)        Whether the damage suffered by the plaintiff would have been very serious. (c)        Whether there was a real possibility that the defendants would destroy relevant documents. (d)        Whether the effect of the Anton Piller order would be out of proportion to the legitimate object of the order. SeeAnton Piller KG v Manufacturing Processes Ltd[1976] Ch 55at 62 and Steven Gee, Commercial Injunctions(Sweet & Maxwell, 5th Ed, 2004) at pp 491–492.",
        "Strongprima faciecase": "15        There is no doubt, and this was admitted by the respondent’s counsel, that 31 companies in the respondent’s group have moved from the appellant and are being serviced by the respondent and the other defendants. 16        The claim against the respondent is for conspiracy by unlawful means. The judge seemed to think that the appellant’s claim against the respondent was based wholly on the mere fact that Merrin and his wife were the directors of the respondent. It seems to us that this perception is not entirely accurate. There is clear evidence that companies previously serviced by the appellant had moved their patronage to the first, second and fourth defendants as well as the respondent. Moreover, Merrin and his wife never informed the appellant of their involvement with the respondent’s affairs. Merrin and his wife were managing the respondent and had helped the respondent in servicing the companies of the Kennedy group, which service was previously rendered to those companies by the appellant. Merrin and his wife were not inactive directors. 17        While it is true that Merrin and his wife do not own any shares in the respondent, it is also not entirely correct to say that they were merely the employees of the respondent. Merrin and his wife were two of the three directors of the respondent, the third director being Bliss, who is resident out of Singapore. Merrin and his wife, being locally resident, must be taken to have been actively involved in its activities and were in fact so involved. It is a basic principle of company law that the board of directors is the controlling mind and will of a company: seeH L Bolton (Engineering) Co Ltd v TJ Graham & Sons Ltd[1957] 1 QB 159perDenning LJ at 172. Merrin and his wife constituted the majority of the board. To say that, in those circumstances, Merrin and his wife did not control and manage the respondent would fly in the face of the factual and legal position. In Merrin’s own words, he was engaged by Kennedy as a “trusted general” whose role in the respondent was more “entrepreneurial” rather than “administrative”, effectively admitting that he was left to run the show of the respondent. This is not a case where Merrin was just a director in name only or a sleeping director. 18        There is a conspiracy by unlawful means when two or more persons combine to commit an unlawful act with the intention of injuring or damaging another: seeQuah Kay Tee v Ong & Co Pte Ltd[1997] 1 SLR 390at [45]. As far as the respondent is concerned, the claim of the appellant against it is in conspiracy, namely, that the respondent, together with the other defendants, had knowingly and dishonestly assisted Merrin, who was then still the managing director of the appellant, in breaching his fiduciary obligations to the appellant by diverting the business of the appellant to the first, second and fourth defendants and the respondent. As a director of the respondent, Merrin’s actions, which were carried out for the benefit of the respondent, must necessarily be attributable to the respondent. Instead of fulfilling his obligation to inform the appellant of the intended move by Kennedy to take the Kennedy group of companies’ business away from the appellant, Merrin together with the respondent and other defendants conspired to do just that,ie, to take away business from the appellant, in direct conflict with Merrin’s fiduciary duties to the appellant. It does not matter that the respondent could have legitimately procured that companies in the Kennedy group of companies transfer their patronage to the respondent. This was a conspiracy by unlawful means involving the breach by Merrin and his wife of their fiduciary duties to the appellant. Besides, business taken over included those of third parties outside the Kennedy group of companies. There being the intent to injure the appellant, even if the primary purpose of the conspirators was to further their own legitimate interests, it sufficed to make their conduct tortious that they used unlawful means:Lonrho Plc v Fayed[1992] 1 AC 448. 19        It is not often that the victim of a conspiracy will be able to obtain direct evidence to prove the allegation. Proof of conspiracy is normally to be inferred from other objective facts. As the English Court of Appeal said inR v Siracusa(1990) 90 Cr App R 340 at 349: [T]he origins of all conspiracies are concealed and it is usually quite impossible to establish when or where the initial agreement was made, or when or where other conspirators were recruited. The very existence of the agreement can only be inferred from overt acts. Participation in a conspiracy is infinitely variable … 20        With respect, it seems to us that the judge, in holding that there was no evidence to implicate the respondent in the alleged conspiracy, did not give sufficient consideration to the following circumstances: (a)        Kennedy knew at all material times that Merrin was still the managing director of the appellant when Kennedy got Merrin involved in the respondent and in enticing clients (eg, Shanonville Developments Ltd, Shimero Pte Ltd, Seth Jacobsen’s group of companies) away from the appellant. The respondent, by engaging the services of Merrin knowing that he was still the managing director of the appellant, had actively assisted Merrin in breaching his fiduciary duties to the appellant. While it is true that the respondent belongs to a large group, the question to ask is, why did Kennedy, knowing that Merrin was still in the employ of the appellant, engage him in activities contrary to Merrin’s fiduciary duties to the appellant? Why did Merrin not issue invoices on behalf of the appellant to the respondent in respect of services rendered by Merrin (while he was in the employ of the appellant) to the respondent? (b)        Upon their appointment as directors, Merrin and his wife were thede jureas well as thede factocontrolling mind of the respondent. Indeed until March 2004, they were the only directors of the respondent. (c)        Merrin asked one Lindsay Sanford (the representative of the Kennedy group) (“Sanford”) who had always liaised with the appellant to liaise with Merrin in the future at his e-mail account with the respondent. (d)        At the end of July 2003, Merrin asked his wife (the sixth defendant) not to invoice the first defendant for her handling of the application by Kennedy for an employment pass. It is of interest to note that when Merrin instructed his wife to refrain from issuing the invoice he explained: … it is basically done by you in your NEW JOBHe He seemingly referring to her position in the respondent. (e)        On 12 March 2004, the appellant’s former accountant, Quek, gave one month’s notice to quit the appellant’s employment on the ground that her gynaecologist had so advised because her pregnancy was not stable. Merrin, on behalf of the appellant, accepted her resignation. Her last day of service was 23 April 2004. Yet on 27 April 2004, Quek started work with the respondent. (f)         Merrin was tasked by the appellant to explore business opportunities with a Dubai contact, but he diverted these opportunities to the respondent and the first defendant instead. (g)        The affidavits of Tan and the supervising solicitor overseeing the execution of the AP Order revealed that the appellant’s client list and client account payment vouchers were found in the respondent’s possession. Furthermore, documents pertaining to companies related or belonging to Abul Khair (who was a former client of the appellant) were also found at the respondent’s premises. (h)        In para 53 of Merrin’s affidavit of 17 November 2004, he admitted to having flown overseas in January/February 2004 to conduct the respondent’s business while he was still employed by the appellant. 21        No one can dispute that the companies in the Kennedy group were entitled to stop engaging the appellant for secretarial and accounting services. The question is, why did the Kennedy group, in particular through the respondent, act in concert with Merrin to breach his fiduciary duties to his employer, the appellant? The argument was made that Kennedy asked Merrin to work with the group because Merrin wished to leave the appellant. If that were the case, why didn’t Kennedy instruct Merrin to quit the appellant forthwith to work for him full time? Yet, in his letter to Merrin dated 29 April 2004, written on Shimero Pte Ltd’s letterhead, while acknowledging Merrin’s notification that the latter would no longer be with the appellant, Kennedy expressed regret that Merrin was leaving the appellant. The tenor of the letter also suggests that Kennedy was making use of Merrin, knowing full well that Merrin was acting in breach of his fiduciary duties to the appellant. 22        In these circumstances, we are unable to accept the argument that the acts of Merrin cannot be attributed to the respondent, when he, together with his wife, were the persons managing the respondent and documents of the appellant were found in the premises of the respondent. We would further add that Kennedy knew Merrin owed a fiduciary duty to the appellant and yet connived in what Merrin did, all to advance the interest of the respondent and/or the Kennedy group of companies. There is a strongprima faciecase that Merrin and Kennedy were in cahoots. We would emphasise that this is not a definite finding (wholly unnecessary at this stage) but what is apparent to the court on the evidence, without the benefit of adequate contrary explanations.",
        "Losses suffered by the appellant": "23        The judge seemed to think that as the respondent was formed to service companies within the Kennedy group, the loss suffered by the appellant was limited only to $19,000, being the fees collected by the respondent from those companies. The case made against the respondent is one of conspiracy, and if that is eventually proven, the respondent, together with the other co-conspirators could each be jointly and severally liable for all the losses which the appellant has suffered on account of the conspiracy. The respondent would be liable to the same extent as Merrin, a co-conspirator. 24        The respondent reiterated the point that it is really a “cost centre” within the Kennedy group of companies and would not have benefited from the wrongdoings of Merrin. We would first note that the respondent benefited when Merrin did not bill the respondent (on the appellant’s behalf) for the time Merrin spent in relation to the affairs of the respondent. In any case, the question of whether the respondent benefited is merely extraneous. The liability of a co-conspirator arises from the fact that it acted in concert with the others and it does not matter that the co-conspirators might not have benefited equally. The conspiracy not only diverted the business of companies of the Kennedy group away from the appellant to the respondent, but also of companies not related to the Kennedy group away from the appellant to the first, second and fourth defendants. 25        It is therefore incorrect to say that the liability of the respondent is restricted to the loss suffered in the transfer of the business of the companies in the Kennedy group away from the appellant. As the liability of the respondent would be as a co-conspirator, it would be liable for all the losses suffered by the appellant on account of the conspiracy in which the respondent played a part. There are documents which show that Merrin had failed to issue invoices on behalf of the appellant with respect to some services rendered to companies within the Kennedy group. These will be taken into account in determining the total losses of the appellant.",
        "Destruction of documents": "26        In the light of the above, it is clear that the respondent had in its possession evidence relating to the subject matter of the action which the appellant sought to have preserved for the trial of the action. However, the judge held that there was nothing to indicate that there was a real risk that the respondent would destroy documentary evidence. The judge was of the view that Merrin and his wife’s involvement in the respondent was not a clandestine affair. 27        It is true that the fact that Merrin and his wife were holding directorships in the respondent was reflected in the records of the Accounting & Corporate Regulatory Authority. But as employees of the appellant, they should have known better than to be involved with a company which might compete with the appellant. While Merrin did tell one Thomas Bayer, Chairman of ETC, when he wanted to resign from the appellant, that he was going to join “a large diverse international group”, Merrin nevertheless agreed to stay on in the appellant’s employment until a replacement was found. Until Merrin effectively resigned from the employment, he owed a fiduciary duty to the appellant. Merrin and his wife never informed the appellant that they were involved in a potential competitor while remaining in the appellant’s employment. The appellant was entitled to assume that Merrin and his wife would be loyal to the company and there was thus no reason for the appellant to investigate the activities of Merrin. However, the moment Tan felt that Merrin acted strangely, the appellant commenced investigation and uncovered all the wrongdoings of Merrin and his wife. Therefore, we are, with respect, unable to view Merrin’s involvement with the respondent in quite the same way as the judge. This involvement with the respondent was clearly clandestine, as they carried on an activity against the interest of the appellant without notifying the latter. There could not be any duty on the part of an employer to check on its employees unless there is a reason for the employer to do so. 28        The appellant also highlighted the following circumstances to show that Merrin and his wife had, at all material times, wanted to keep their involvement with the respondent concealed from the appellant: (a)        On 10 March 2003, Merrin’s wife requested instructions from him in relation to the deletion of materials from the appellant’s computer system. (b)        On 3 September 2003, Merrin (using his e-mail with the appellant) wrote to Sanford requesting the latter to send all e-mails to Merrin’s e-mail address with the respondent (ie,m.director@estwest-mgt.com)or his personal web-based address. (c)        The investigation by TecBiz would appear to indicate that the Merrin’s wife might have deliberately deleted computer data relating to the respondent from the appellant’s computer. (d)        On 26 November 2002, Merrin’s wife, using her e-mail account with the respondent, wrote to Merrin asking him to have “Pete/Issy” send e-mails to Merrin at the latter’s web-based address to avoid unnecessary “damage control”. 29        Bearing these in mind, we now turn to the question of the risk of destruction of evidence. There is clear evidence that Merrin had destroyed company data in the laptop computer which the appellant had provided to him for his use as the managing director of the appellant. With such propensity, and having regard to the fact that Merrin was the person managing the respondent’s affairs in Singapore, it is, in our opinion, reasonable to hold that there are grounds to believe that Merrin would destroy documents in the respondent’s possession to save his own skin. We think the judge took a charitable view in holding that there was no real risk that the respondent would destroy evidence. The respondent, being an incorporated entity, could not act on its own. Merrin and his wife were the body and mind of the respondent. 30        In this regard, we are reminded by what this court stated inNikkomann Co Pte Ltd v Yulean Trading Pte Ltd[1992] 2 SLR 980at 995, [69] in relation to the question of likelihood by a party destroying evidence where that party had reason to cover its trails: In such matters, it would be unreasonable to expect direct evidence. The court is justified in drawing inferences from the demonstrated propensity of a party. 31        In our judgment, there is sufficient evidence to hold that there was a real risk that the respondent would destroy evidence which is not in its favour or which would show wrongdoing by its directors, namely, Merrin and his wife. The result of the execution of the AP Order demonstrated that the issue of the AP Order was amply warranted: the appellant’s client lists and client account payment vouchers were found in the respondent’s possession. 32        We note that the judge had relied upon the following passage of Hoffmann J inLock International Plc v Beswick[1989] 1 WLR 1268at 1281: People whose commercial morality allows them to take a list of the customers with whom they were in contact while employed will not necessarily disobey an order of the court requiring them to deliver it up. Not everyone who is misusing confidential information will destroy documents in the face of an order of court requiring him to preserve them. 33        It is important, in considering this passage of Hoffmann J, not to lose sight of the fact that the party against whom the Anton Piller order was issued in that case had no propensity to destroy evidence. The case was concerned with an ex-employee entering into business in competition with his ex-employer and allegedly taking away a document of his former employer. Here, we are concerned with an employee who was in breach of his fiduciary duty to his employer and who had actually destroyed documents of his employer with a view to harming his employer and in covering his own tracks. The observation of Hoffmann J inLock International Plc v Beswickquoted above can have no application here. 34        Instead we think the following passage of Oliver LJ inDunlop Holdings Ltd and Dunlop Ltd v Staravia Ltd[1982] Com LR 3 at 3 is germane: [I]t has certainly become customary to infer the probability of disappearance or destruction of evidence where it is clearly established on the evidence before the court that the defendant is engaged in a nefarious activity which renders it likely that he is an untrustworthy person. It is seldom that one can get cogent or actual evidence of a threat to destroy material or documents, so it is necessary for it to be inferred from the evidence which is before the court.",
        "The question of proportionality": "35        The respondent also relies on the following comments made in theStaughton Committee Report(1992) on “the practical operation of Anton Piller orders” published by the Lord Chancellor’s Department: The harm likely to be caused by the execution of the Anton Piller Order to the respondent and his business affairs must not be excessive or out of proportion to the legitimate object of the order…the court will still have to weigh in the balance the plaintiff’s need for the order against the injustice to the respondent in making the orderex partewithout any opportunity for the respondent to be heard. The judge who hears the application for the order should keep in mind that, in as much asaudi alteram partemis a requirement of natural justice, the making of an ex parte mandatory order always risks injustice to the absent and unheard respondent. 36        We agree with these comments in the report. But it is important to note that the AP Order which the appellant sought and obtained against the respondent is of a specific limited scope. The two operative paragraphs are: (a)        image and deliver into safe-keeping of the Supervising Solicitor all the hard disks of computers, portable notebook computers, computer servers and any other computer media storage equipment used by the 5th, 6th, 7th Defendants and Doreen Quek found in the aforementioned premises; and (b)        inspect, photograph or photocopy, copy and deliver into the safe-keeping of the Supervising Solicitors all the documents and articles which are listed or described in Schedule 2 of this Order (“the listed items”) or which the Supervising Solicitors believe to be listed items. 37        The AP Order would not have stifled the business of the respondent. All it sought to do was to enable the appellant to make copies of relevant documents to preserve evidence. The copies are being kept by the supervising solicitors and there is no intention by the appellant or the supervising solicitors to release them to third parties. 38        Another factor which seemed to have played a part in the judge’s decision to discharge the AP Order was the fact that the Kennedy group had expended much time and expenses in seeking to make an initial public offer. Did the issue of the AP Order scuttle those efforts? It seems to us that what would have undermined the public listing is not the issue of the AP Order but the litigation itself: see the observations of Andrew Phang JC (as he then was) inCHS CPO GmbH v Vikas Goel[2005] 3 SLR 202at 234. In view of this, it is not clear how the issue of the AP Order would jeopardise the aim of the Kennedy group to get a listing; the pending litigation would have been the cause, not the AP Order. 39        We acknowledge that an Anton Piller order is an extremely invasive order and could, in particular circumstances, be very damaging to the defendant. That, however, is not the case here. First, the respondent is only a “cost centre”, serving companies within its own group. In fact, Merrin himself concedes that the respondent is not profit generating. Second, the AP Order was specific in its scope. The respondent could carry on its business as per normal, with the exception of the members of its staff required to attend to the execution. No wholesale removal of documents was involved. Third, the execution was carried out discreetly, out of the view of third parties.",
        "Were due investigations carried out?": "40        The judge further thought that the appellant ought to have carried out a more thorough investigation into the ownership of the respondent and the relationships between each of the defendants as well as their roles in the Kennedy group. In this regard, the appellant highlighted the fact that it had acted with caution as it had engaged the services of an independent investigator, TecBiz, to carry out two rounds of investigations between June and September 2004. Together with its solicitors, the appellant had also spent much time looking into the suspicious wrongdoings of Merrin and his wife. 41        The appellant stressed that its claim against the respondent was for conspiracy. Whatever investigations carried out had to be discreet. Merrin was managing the respondent here in Singapore. The TecBiz report clearly showed that the respondent was involved in servicing former clients of the appellant. The situation was urgent and called for swift action. The appellant submitted that having regard to what Merrin was capable of, the AP Order was needed in the interest of justice as there was a real risk of destruction or concealment of evidence. In the circumstances, it is our judgment that the appellant has established a strongprima faciecase for the AP Order. As we have mentioned above, while the fact that Merrin and his wife are directors of the respondent may notper sebe sufficient to taint the respondent with complicity in the alleged conspiracy, Merrin’s involvement with the respondent exceeded being a director. He took steps to divert clients away from the appellant to the respondent and even took documents of the appellant away and kept them at the respondent’s premises. The fact that Merrin and his wife were not, at the material time, shareholders of the respondent is immaterial. Until the shareholders at a properly constituted meeting of the company remove the directors, the board of directors represents the company and acts on its behalf. We would again point out that Merrin and his wife are the two resident directors, the third director being resident abroad, and between them they would have the authority to act on behalf of the respondent. 42        The point was also made that the appellant had used the AP Order as an investigative tool. Obviously, the object of an Anton Piller order is to preserve documents and other evidence relevant to the action. Here, the execution of the AP Order showed the extent of the respondent’s involvement in the conspiracy and the evidence preserved would, in turn, be helpful in determining the loss suffered by the appellant.",
        "Was there material non-disclosure?": "43        We now turn to the final issue as to whether there had been material non-disclosure. It is settled law that on anex parteapplication, the applicant must disclose to the court all matters within his knowledge or which ought to have been within his knowledge, which are material to the proceedings and which may be in favour of the party against whom the application is made: seeThe King v The General Commissioners for the Purposes of the Income Tax Acts for the District of Kensington, ex parte Princess Edmond de Polignac[1917] 1 KB 486at 514 andTay Long Kee Impex Pte Ltd v Tan Beng Huwah[2000] 2 SLR 750(“Tay Long Kee Impex”) at [21]. 44        InSiporex Trade SA v Comdel Commodities Ltd[1986] 2 Lloyd’s Rep 428 at 437, Bingham J expressed the scope of the duty to make full disclosure in these terms: He must identify the crucial points for and against the application, and not rely on general statements and the mere exhibiting of numerous documents. He must investigate the nature of the cause of action asserted and the facts relied on before applying and identify any likely defences. He must disclose all facts which reasonably could or would be taken into account by the Judge in deciding whether to grant the application. 45        However, it does not follow that every non-disclosure would warrant a discharge forthwith. Whether a non-disclosure is of sufficient materiality to justify or require an immediate discharge of theex parteorder without going into the merits, must depend on the importance of the fact to the issues which are to be decided by the judge on theex parteapplication. Even then, sometimes, “[a] locus poenitentiae may … be afforded”: seeBrink’s Mat Ltd v Elcombe[1988] 1 WLR 1350at 1357. Of course “material” does not mean decisive or conclusive: seeTay Long Kee Impexat [21]. 46        The respondent has alleged that the appellant had failed to make a number of material non-disclosures at theex partehearing. However, the only material document which the respondent alleged the appellant did not produce before the judge hearing theex parteapplication was a corporate flow chart showing the shareholding structures and the flow of funds between the entities in the Kennedy group. The flow chart was sent by e-mail by Sanford to Merrin on 4 July 2003. This chart was among the documents deleted by Merrin from his laptop computer. It was retrieved by the appellant’s computer specialist investigator, TecBiz. 47        The judge seemed to have placed much emphasis on the failure to produce the flow chart as he said that the appellant, having been in possession of the chart, “ought to have more painstakingly inquired into and evaluated the ownership structure of the [respondent], not to mention the precise relationships between the various defendants and the Group” ([2005] 4 SLR 61at [32]). 48        The appellant explained that as its case of conspiracy was only against the individual defendants, including the respondent, and not against all the companies within the Kennedy group, it did not think the chart was material. It seems to us clear that the non-disclosure was innocent, not out of a desire to suppress. Clearly, if this flow chart had been disclosed it would have shown the relationship of the respondent to the other companies to the group. However, as the allegations related only to the acts of the persons managing the respondent in Singapore, we do not think this omission isper sethat important. In any case, having regard to the conduct of Merrin, who is apparently dishonest (we need not at this stage make a definite finding on this), and the fact that he was both thede jure(being a director) andde factomanager of the respondent, we think that even if the chart had been produced before the judge hearing theex parteapplication, the AP Order should still have been made. Neither the appellant nor the judge would be able to know the exact status of the chart,eg, whether the scheme had already been implemented or was only proposed. Further, the appellant would not know from the chart that the respondent would only be providing secretarial and other services to companies within the Kennedy group. The appellant was merely attempting to prevent its business from being ruined by Merrin, acting in concert with the other defendants, in breach of his fiduciary duties to the appellant. 49        Another aspect of non-disclosure alleged by the respondent was that the appellant did not inform the court that Merrin was in regular contact with one Simpson, a director of the appellant, updating him on developments in the appellant, until the issue of the AP Order. We do not think the omission to mention this fact is in any way material. Obviously, Merrin would have reported from time to time to Simpson. But we do not see how such communications could lessen the culpability of Merrin in surreptitiously acting against his employer’s interest. 50        In the result, we would allow the appeal and set aside the order below. The appellant shall have the costs here and below, with the usual consequential orders."
    }
}