{
    "case_title": "Ting Sing Ning (alias Malcolm Ding) v Ting Chek Swee (alias Ting Chik Sui) and Others",
    "ncitation": "[2007] SGCA 49",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      Judith Prakash J",
    "sections": {
        "Background": "2          Havilland is a company incorporated under the laws of Hong Kong and having its principal place of business in Singapore. The appellant, the first respondent (“Ting”), the second respondent (“Sia”) and the fifth defendant, (“Binti”) (who is not a party to this appeal) were the four directors of Havilland at all material times. The appellant holds 10% of the shares in Havilland, while Ting, Sia and Binti together hold a total of 42% of the shares in Havilland. Ting’s sister, Ting Shuk Choo, held a 10% stake in Havilland. The latter fact is of particular significance, since if there is evidence that she would have supported Ting in voting against this derivative action by the appellant, it would suffice (without more) to dispose of the present appeal. We now set out the significant events that led to the trial of the preliminary issues, before proceeding to analyse the parties’ submissions.",
        "Chronology of significant events": "3          The appellant commenced the present action in 2000 for the benefit of Havilland against Ting (Sia and Binti were added later, on 10 February 2001), claiming,inter alia: (a)        a declaration that Ting, Sia and Binti, being the directors of Havilland, were in breach of their fiduciary duties for having committed fraud against Havilland; (b)        damages to be paid to Havilland for these breaches; (c)        an account of what is due to Havilland in respect of the secret profits received by Ting, Sia and Binti; (d)        payment of the amount found to be due on the taking of the said account; and (e)        as against Merit Concord Holdings (“Merit”) (a related company, as well as the fourth defendant), the sum of $1,576,579.71, being the net amount of Havilland’s funds utilised by Ting, Sia and Binti to finance Merit. 4          On 11 July 2000, the appellant wrote to Havilland’s board of directors (“the Board”) and enquired whether the Board wished to adopt the action commenced by the appellant. Following this request, on 31 July 2000, the Board, of its own volition, wrote to all the shareholders of Havilland enclosing copies of all affidavits filed, asking for an indication of whether they were in favour of adopting the action against Ting. All the shareholders (excluding Ting and the appellant and two other shareholders, Wong Ling Ann and Ting Sing Kee (the appellant’s brother)) responded that they were against Havilland adopting the action. Sia and Binti conveyed the shareholders’ decision to the appellant on 7 August 2000. By early 2001, the appellant had changed solicitors and they made the application (which was allowed in February 2001) to include Sia and Binti as defendants to the action. Thereafter, the appellant tried to serve Binti in Indonesia but to no avail. The action was therefore in abeyance until Ting and Sia filed the present applications in 2005 (Summonses in Chambers Nos 600542 and 600543 of 2005) for the trial of the preliminary issue of whether the appellant hadlocus standito bring the derivative action on behalf of Havilland. 5          On 30 December 2005, the court in a pre-trial conference gave directions for the filing of affidavits in respect of the respondents’ application for trial of the preliminary issue. Pursuant to these directions, the appellant, in January 2006, filed an expert affidavit by Don Ho, detailing 11 instances of “fraud and/or alleged wrong-doing” by Ting, Sia and Binti in relation to Havilland. Following this, on 7 February 2006, six shareholders requisitioned an extraordinary general meeting (“EGM”) to consider whether the shareholders should oppose the commencement and continuation of this action. The EGM was held on 13 March 2006. The meeting was attended by all the shareholders (either personally or through proxies), except for the appellant and his brother. At the meeting, the proposed resolution (against continuing the action) was discussed at some length after the shareholders received advice from a lawyer who attended the meeting. The shareholders (excluding the respondents who abstained from voting) unanimously voted against the continuation of the action after expressing their unhappiness over: (a) the fact that the appellant commenced the present action without consulting them; (b) the appellant had not attended the EGM to explain his stance and persuade the shareholders to vote in his favour, and (c) the lack of diligence in proceeding with the action, since it was initiated in 2000. Subsequently, on 7 April 2006 and 10 April 2006 respectively, Ting and Sia filed affidavits, essentially detailing the events that transpired at the EGM on 13 March 2006, leading to the decision of the shareholders not to adopt the action by the appellant. On 2 June 2006 and 9 June 2006, the other shareholders filed affidavits (in support of Ting and Sia) to affirm their continued opposition to the commencement and continuation of the action. The preliminary issue was heard by the Judge on 26 July 2006 and 27 July 2006.",
        "Issues before the Judge": "6          The preliminary issues before the Judge were as follows: (a)        whether the appellant had established aprima faciecase that Havilland was entitled to the relief claimed (“Issue A”); (b)        whether the appellant could show that he was qualified to bring an action under the “fraud on the minority” exception to the rule inFoss v Harbottle(1843) 2 Hare 461; 67 ER 189 (“Issue B”); and (c)        whether the “justice of the case” exception to the rule inFoss v Harbottleshould apply (“Issue C”).",
        "The Judge’s decision": "7          At the hearing before the Judge, the respondents did not engage the appellants in dispute on Issue A. Hence, the Judge focused his attention on Issues B and C. In relation to Issue B, the appellant argued that the combined shareholdings of Ting, Sia, Binti and Ting’s sister constituted an absolute controlling block (of 52%) for the purpose of establishing the “fraud on the minority” exception to the rule inFoss v Harbottle.However, the Judge rejected this argument on the ground that the 10% shareholding held by Ting’s sister should not be added to the block of 42% shares held by Ting, Sia and Binti,and that therefore the shareholdings of Ting, Sia and Binti did not constitute a controlling block. The Judge was not satisfied as to why the 10% shareholding of Ting’s sister should be added to Ting’s shareholding as counsel had not advanced any reason that would explain why Ting’s sister would likely vote for Ting’s group. 8          The Judge, after acknowledging that the 42% shareholding of the parties might only indicate ostensible control, proceeded to “discern the true seat of power” in Havilland (seeTing Sing Ning([1]supra) at [4]). The appellant’s argument in this respect was based primarily on the fact that the other shareholders in Havilland, who had voted to not pursue the action, also held shares in Merit (“the cross-shareholdings”), the related company to which Havilland allegedly made unauthorised payouts. Although the Judge recognised this as a legitimate concern of the appellant, the Judge declined to accept the appellant’s arguments in the light of his failure to attend the general meeting and put the issue before the independent shareholders. 9          Having also found against the appellant on this issue, the Judge went on to consider Issue C, with particular reference to case law from Australia and Malaysia. He made some pertinent and illuminating observations on the “justice of the case” exception as encapsulating fairness but ultimately expressed his reluctance to decide which party was more deserving of “justice” in this case. Accordingly, without approving or disapproving the “justice of the case” exception, he held that it was not applicable in this case as the appellant had “put the matter out of the shareholders’ consideration” by not attending the EGM (Ting Sing Ningat [6]). He also held that this exception was not helpful to the appellant in any event. This left only Issue B for consideration, and in that respect, the Judge held that the appellant had not discharged his obligations at law to satisfy the court that,prima facie, Ting, Sia and Binti had unduly influenced the majority shareholders into deciding not to take action through Havilland.",
        "Issues on appeal": "10        In this appeal, the respondents have not challenged the Judge’s finding that they had accepted that the evidence of the appellant’s forensic expert had taken “the [appellant’s] case past theprima faciethreshold” (Ting Sing Ningat [3]). Hence, we need only consider Issues B and C. In regard to Issue C, although the parties have addressed us on the existence and applicability (on the facts) of the “justice of the case” exception, the main focus of the appellant’s case, as set out in his skeletal arguments and in oral argument was Issue B, the “fraud on the minority” issue, and, in particular, whether on the evidence the respondents could be considered to have an absolute majority of the votes or were “in the seat of power” in Havilland. For this reason, we do not propose to consider whether the “justice of the case” exception is applicable under Singapore law. Accordingly we proceed to consider Issue B,ie, whether the appellant could establish, on aprima faciebasis, that he came within a recognised exception to the rule inFoss v Harbottle([6]supra),ie, the “fraud on the minority” exception.",
        "Preliminary point: Payments to Henley": "11        In this appeal, the allegations of wrongdoing made against the respondents related to payments by Havilland to two “related companies”, Merit and Henley Agency Ltd (“Henley”), amounting to approximately $1.5m and US$756, 952 respectively. However, counsel for the first respondent has pointed out that the issue of the payments to Henley was not raised before the Judge and that in any event this allegation had no substance because the forensic expert had admitted in his affidavit that Havilland did not make such a payment to Henley and the mistake was caused by an erroneous accounting entry in the books of Havilland. This being the case, this allegation does not merit any further consideration.",
        "The law": "12        The principle inFoss v Harbottleand the exceptions thereto are captured succinctly in the English Court of Appeal decision ofPrudential Assurance Co Ltd v Newman Industries Ltd(No 2) [1982] Ch 204 at 210–211 (“Prudential Assurance”) in the following classic statement: (1) The proper plaintiff in an action in respect of a wrong alleged to be done to a corporation is, prima facie, the corporation. (2) Where the alleged wrong is a transaction which might be made binding on the corporation and on all its members by a simple majority of the members, no individual member of the corporation is allowed to maintain an action in respect of that matter because, if the majority confirms the transaction, cadit quaestio [(the question is at an end)]; or, if the majority challenges the transaction, there is no valid reason why the company should not sue. (3) There is no room for the operation of the rule if the alleged wrong is ultra vires the corporation, because the majority of members cannot confirm the transaction. (4) There is also no room for the operation of the rule if the transaction complained of could be validly done or sanctioned only by a special resolution or the like, because a simple majority cannot confirm a transaction which requires the concurrence of a greater majority. (5) There is an exception to the rule where what has been done amounts to fraud and the wrongdoers are themselves in control of the company. In this case the rule is relaxed in favour of the aggrieved minority, who are allowed to bring a minority shareholders’ action on behalf of themselves and all others. The reason for this is that, if they were denied that right, their grievance could never reach the court because the wrongdoers themselves, being in control, would not allow the company to sue. We now analyse the constituent elements of the exception in turn.",
        "Prima faciecase of fraud or wrongdoing": "13        The term “fraud” in the context of “fraud on a minority” in company law has a special meaning. InEstmanco (Kilner House) Ltd v Greater London Council[1982] 1 WLR 2, Sir Robert Megarry VC held (at 12) that: It was on the firmly established exception of “fraud on a minority” that [counsel for the applicant] mainly relied. It does not seem to have yet become very clear exactly what the word “fraud” means in this context;but I think it is plainly wider than fraud at common law, in the sense ofDerryv.Peek(1889) 14 App. Cas. 337. In a valuable survey of the authorities, Templeman J. recently came to the conclusion that this head permitted the minority to sue even though there had not been even an allegation of fraud:Danielsv.Daniels[1978] Ch. 406. … The principle which he derived from the cases was that “… a minority shareholder who has no other remedy may sue where directors use their powers, intentionally or unintentionally, fraudulently or negligently, in a manner which benefits themselves at the expense of the company:” see p. 414. Apart from the benefit to themselves at the company’s expense, the essence of the matter seems to be an abuse or misuse of power. “Fraud” in the phrase “fraud on the minority” seems to be being used as comprising not only fraud at common lawbut also fraud in the wider equitable sense of that term, as in the equitable concept of a fraud on a power. [emphasis added] In the recent case ofAbdul Rahim bin Aki v Krubong Industrial Park (Melaka) Sdn Bhd[1995] 3 MLJ 417, the Malaysian Court of Appeal observed (at 431) that: (1)        the expression ‘fraud on the minority’ is a term of art and has absolutely nothing whatsoever to do with actual fraud or deception at common law; (2)        lack of probity comes within the ambit of the expression. But it is not necessary to prove dishonesty before a minority shareholder may claim relief under the doctrine; and (3)        it is sufficient for a plaintiff in an action grounded upon the doctrine to show that thosewielding majority control abused the powers vested in them in the sense that they used or omitted to use their powers for an oblique or collateral motive or purposeand not for the true purpose for which the power was entrusted to them either by the memorandum and articles of association, by statute or the general law. [emphasis added]",
        "Wrongdoer control of the company": "Parties’ submissions 14        Given that it is conceded that there was aprima faciecase of wrongdoing on the part of the respondents based on the report of the forensic expert, all that the appellant has to do in order to succeed in this appeal is to show to the satisfaction of this court that the respondents either had majority control of Havilland or were in the seat of power and had used their control or power to prevent Havilland from suing them for breach of fiduciary duties as directors. In this regard, the appellant has raised two arguments. The first is that Ting’s sister’s 10% share in Havilland should be added to the 42% held by Ting, Sia and Binti, because it is reasonable to assume that the sister would vote to support her brother and prevent him from being sued for his breach of duty to the company. This would raise the shareholdings of the respondents to an absolute majority of 52%. The second is that, in any event, the cross-shareholdings of the independent shareholders in Merit would render them incapable of voting objectively, in the best interests of Havilland. In this connection, the meeting held on 13 March 2006 was in effect a “charade engineered to give the EGM a gloss of independence when in reality it was predetermined that the derivative action would be opposed” [emphasis added]. In the premises, the appellant’s failure to attend before the independent shareholders should not, counsel for the appellant argued, be held against the appellant as the result would have been the same even if he had attended the meeting. Our decision 15        The first issue we have to consider is whether the 10% shareholding of Ting’s sister should be counted as part of the total shareholdings of the respondents for the purpose of determining absolute control. The Judge dismissed this argument on the ground that the appellant had not advanced any reason why she would vote in favour of Ting apart from her being his sister. The appellant has attacked this finding on the ground that the Judge had failed to deal with the reasons which he had given in his submission as to why Ting’s sister was likely to vote for Ting. The reasons were as follows: (a)        Ting’s sister was the largest (12.5%) shareholder of Merit (the fourth defendant in the derivative action) which had benefited from the fraud of the respondents. (b)        Her 12.5% shareholding in Merit was given to her by Ting or she held the shares as a nominee for Ting. (c)        Ting is the first respondent and was either the mastermind of or in the core group of persons responsible for the fraud which has cost Havilland at least $13m. 16        Counsel also pointed out that in his original grounds of judgment, the Judge had ruled that bias or influence could not be inferred by consanguinity alone on the basis that the appellant was the brother of Ting, the first respondent and the largest shareholder of Havilland. The implication of the statement was that if one brother could sue anotherbrother, there would be no reason for a sister to support another brother. However, when it was pointed to the Judge that the appellant was not Ting’s brother but his nephew, he corrected his judgment to reflect the actual family relationship. The suggestion is that the correction of this factual error could not affect the Judge’s state of mind when he first ruled on the irrelevance of consanguinity. In other words, the Judge’s ruling on the irrelevance of consanguinity was based on an error of fact that led to an inferential error that consanguinity was irrelevant. 17        Counsel for the appellant argued that for these reasons, the Judge was wrong in his finding that the appellant had not explained why Ting’s sister would likely have voted for Ting’s group. He pointed out that given her shareholding and interest in Merit and that Merit had benefited from the fraud perpetrated by the respondents, Ting’s sister would have every reason to vote to protect Merit from a claim by Havilland as well as to protect her own interest in Merit. Furthermore, in supporting Ting, she would also be protecting Ting from being made liable for the fraud. 18        In support of his arguments, counsel referred us to the tests of control stated inPrudential Assurance([12]supra) andSmith v Croft (No 2)[1988] 1 Ch 114. In the former case, the English Court of Appeal said, at 219, that the word “control”: … embraces a broad spectrum extending from an overall absolute majority of votes at one end, to a majority of votes at the other end made up of those likely to be cast by the delinquent himself plus those voting with him as a result of influence or apathy. In the latter case, the court laid down the test as to whether shareholders are indeed independent in this statement (at 186): [I]n this case votes [cast for and against the action by shareholders] should be disregarded if, by only if, the court is satisfied either that the vote or its equivalent is actually cast with a view to supporting the defendants rather than securing benefit to the company, or that the situation of the person whose vote is considered is such that there is a substantial risk of that happening. Counsel argued that even if Ting’s sister was not in a position of conflict, given the factors connecting her brother and herself to the fraud, she was likely to vote for Ting in any vote on the issue of whether this action should proceed. 19        We agree with the appellant’s first submission. Given the close relationship between Ting and his sister, quite apart from their familial connection (he gave her enough shares to make her the largest shareholder of Merit), and her indirect interest in protecting Merit from being sued in a derivative action, there is reasonable basis to conclude that Ting’s sister would have voted for Ting’s group to prevent this action from going forward. In our view, and with respect to the Judge, given these circumstances, there was a high likelihood that she would vote for her brother. We cannot, of course, conclude without any doubt that because of consanguinity alone, Ting’s sister would vote for Ting, but we think that in respect of an Asian family which still tends to be rather clan-like, especially where the ties are through blood rather than marriage, the influence of such a relationship on business decisions cannot be discounted. It is, of course, impossible to tell precisely the degree of influence that Ting has over his sister, but given the other two factors mentioned above, in this case, it is probable that she would be in his camp. 20        In coming to this finding of fact, we of course must bear in mind the fact that, in a sense, this conclusion was not put to the test as the appellant refused to attend the EGM to explain his case to the other independent shareholders. We are mindful that the Judge had placed particular emphasis on the appellant’s failure to attend the EGM. However, we are not able to find any consideration of the reasons as to why the appellant decided not to attend the meeting. Before us, the appellant has contended that the outcome of any voting at the meeting was bound to be against him, given the voting block of the respondents and those under their influence, and that if he had attended the EGM and had lost the vote, he would have been bound by such a pre-determined vote. The appellant elaborated on his contention as to why it would have been futile for him to attend the meeting to explain his case to the other attendees. First, the forensic expert’s report detailing the ten different claims arising out of the breaches of fiduciary duties by Ting, Sia and Binti was given to Ting’s solicitors and Sia’s solicitors. Ting’s solicitors did not ask for the cause papers until 13 February 2006, but on 7 February 2006, the so-called independent directors, led by Tang Choi Tieng (“TCT”) (who holds 6% of Havilland and 12% of Merit) requisitioned for the EGM to vote on the subject. The appellant’s cause papers were made available to Ting’s solicitors on 21 February 2006 and they advised these shareholders to ask for a copy of the forensic expert’s report from the appellant’s solicitors if they “wish[ed] to review the same”. This request was never made. Instead, the EGM was held on 13 March 2006, shortly before the deadline for the filing of the rebuttal affidavit by Ting and Sia. 21        The appellant contends that this series of event shows that the independent shareholders had already made up their mind to vote to block the appellant’s action. The appellant has also pointed out that although it was recorded that TCT had alleged that “he had objectively considered all the [appellant’s] allegations in the amended Statement of Claim and found them to be untrue”, he did not mention the expert’s affidavit. In short, there was no discussion on the appellant’s allegations despite their gravity and the amount of money involved. Another speaker at the EGM was an advocate and solicitor (“the A&S”) who attended as a proxy of 50% of TCT’s shares. We find it very unusual for a shareholder to be allowed to divide his speaking rights at a company meeting. The minutes recorded what the A&S had said as follows: ... [The appellant] owed the shareholders an explanation on why he started the legal action without consulting the shareholders and why no progress had been made after 6 years. All shareholders present would like to hear his side of the story. In view of his absence, it seemed that he was not interested to explain his stand and had little regard for the shareholders. All the shareholders are independent minded and can make decision for themselves. … [The A&S] explained to the members the legal position of the suit. He said that it was not a personal suit. The plaintiff was suing the defendants on behalf of the company for the benefit of Havilland and the shareholders. The plaintiff should have come and explained to the shareholders the current status and to obtain the approval from the shareholders. The EGM therefore was for the shareholders to decide whether they would like to proceed with the legal suit. 22        Now what is significant about the explanation given by the A&S at the meeting is that it omitted any reference to the nature and substance of the appellant’s claims even though the expert’s affidavit had been filed on 26 January 2006, well before the EGM was convened by TCT on 7 February 2006. Ting’s solicitors had sent copies of the cause papers to Havilland’s solicitors (in which the A&S was a partner),without the exhibits and the expert’s affidavit.Instead, Ting’s solicitors suggested to Havilland’s solicitors that they obtain the exhibits and the expert’s affidavit from the appellant’s solicitors. The latter did not make such a request. These events give the impression that Ting was trying to make it difficult for Havilland to be apprised of all the details of the appellant’s allegations against Ting and his group of shareholders. 23        It would therefore appear that the shareholders voted not to support the appellant’s action against Ting, Sia and Binti for the benefit of Havilland without being told about the nature of the allegations of fraud against them. It would appear that both Ting and the solicitors for Havilland did not take the trouble to explain to the shareholders what the claims were really about, nor did they let the shareholders read the expert’s affidavit or the exhibits. On these facts, the appellant submitted that the EGM was a charade and engineered to create a semblance of an independent vote to assist Ting and Sia to argue that the test inSmith v Croft(No 2) ([18]supra) was satisfied. In the circumstances, we find it difficult to resist the conclusion that, on a balance of probabilities, the absence of the appellant from the meeting had no significant impact on its outcome. 24        Before concluding this discussion, we wish to address the appellant’s submissions on the Judge’s finding that: (a) the appellant did not put the matter into the hands of the Board or shareholders before commencing the action in March 2000; and (b) the appellant failed to pursue the action with diligence. Dealing with the second point, we accept the appellant’s argument that the delay in proceedings was caused by a confluence of factors including (but not limited to) the appellant’s change of solicitors, as well as attempts to file and serve the papers on Binti (from 2001 to 2005). Hence, we agree that the speed (or the lack thereof) of the action was not solely attributable to the appellant and hence should not be allowed to prejudice his action. As for the appellant’s failure to refer the matter to the Board or shareholders before commencing the action, we find that the appellant had, indeed, raised the allegations of wrongdoing at several meetings (on 17 May 1999, 16 February 2000 and 10 March 2000) and, having received no response or clarification, was compelled to take out an action on 20 March 2000. In this regard, we would note that there is no requirement in law for the appellant tospecificallypropose to the Board or shareholders at a general meeting that an action be brought against the errant directors on behalf of the company (see Paul L Davies,Gower and Davies’ Principles of Modern Company Law(Sweet & Maxwell, 7th Ed, 2003)). In any event, the crux of the allegations having been raised at the previous meetings, the stakeholders were apprised of the (unsatisfactory) state of affairs prevailing in Havilland at the time the action was brought, and chose to do nothing about it. Pertinently, Ting admitted in his affidavit filed in September 2000 that “the appellant had been making thesecomplaints for several years nowand every time he raises them at meetings of the shareholders or directors, the other shareholders and directors have told himthey see no merit in his complaints”. Further, in July 2000, shortly after the commencement of proceedings, the appellant also wrote to the Board to request that the action be adopted by Havilland. This was, however, rejected without any substantive response to the numerous allegations of fraud against the respondents.",
        "Availability of alternative remedies": "25        Counsel for the second respondent has also submitted that this court should not allow this appeal because there are alternative remedies available to the appellant. The first is that Havilland can be wound up as the shareholders had expressed their agreement to such a course of action at Havilland’s annual general meeting held on 31 March 2006. Counsel citedPang Yong Hock v PKS Contract Services Pte Ltd[2003] SGHC 195(HC),[2004] 3 SLR 1(CA) (“Pang Yock Hock”) as authority for this proposition. A second alternative available to the appellant is to pursue an oppression action available under s 168A of the Hong Kong Companies Ordinance (Cap 32) (which corresponds to the oppression action encapsulated in s 216 of the Companies Act (Cap 50, 2006 Rev Ed). Our decision 26        We first considerPang Yong Hock.In that case, Pang and Lee, who were 50% shareholders of PKS Contract Services Pte Ltd (“PKS”), suspected that their co-directors, Koh and Tan, who owned the other 50% of the PKS’s shares, were abusing their power. Pang and Lee gave notice to the board of directors of PKS requiring it to commence action against Koh and Tan for breach of directors’ duties. When PKS did nothing, they applied to the court under s 216A of the Companies Act (Cap 50, 1994 Rev Ed) for leave to commence proceedings in the name of and on behalf of PKS. The trial judge dismissed the application on the grounds that PKS should be wound up as the company was not doing well, and that the inability of the two factions to co-exist meant that there was no future for PKS, which was a partnership in a company’s clothing. 27        In dismissing the application, the trial judge took into account the following facts: (a) Koh and Tan had also made counter-allegations of misconduct against Pang and Lee; (b) an independent accountant’s report ordered by the court showed that there were strongprima faciegrounds for a fuller inquiry but not necessarily against Koh and Tan only; and (c) if Pang and Lee were given leave to pursue a s 216A action against Koh and Tan, then equally the latter two should be given leave to pursue a s 216A action against the former two, which would create a farce. 28        Pang and Lee appealed to the Court of Appeal, which dismissed the appeal on the ground that winding up PKS was an eminently sensible solution in respect of the dispute between the parties. At the time the appeal was heard, Koh and Tan had filed a petition to wind up the company on just and equitable grounds due to the inability of the two factions to co-exist and the resulting deadlock in the management of the company. At [23] of its judgment, the court said: [The trial judge] was correct in concluding that the allegations and counter-allegations of the two factions could not be determined on affidavit evidence alone. No legitimate or arguable case had been made out by Pang and Lee against Koh and Tan. If there was such a case made out by the special accountant’s report, it is against all the four shareholder-directors. It would appear from this passage that the Court of Appeal held that Pang and Lee had not made out aprima faciecase against Koh and Tan to justify the court granting leave to them to pursue a s 216A action against Koh and Tan. The appeal was dismissed but not for the reason that, as a matter of law, winding up PKS was an alternative remedy.In other words, it is not clear thatPang Yong Hockestablishes the principle that when the remedy of a winding up is available, the court should not entertain any application to pursue a s 216A action, however meritorious it may be. 29        In our view, the decision inPang Yong Hockdoes not assist the respondents since we have found that the appellant has established a case to pursue a common law derivative action on behalf of Havilland against the respondents. 30        As regards the second alternative of an action for oppression under the Hong Kong equivalent of s 216, the respondents have not shown us why it affords the best solution to the dispute or that it is a better remedy for the appellant. To begin with, the appellant is not alleging that he has been oppressed, but that the respondents have used Havilland’s funds in breach of their duty as directors. Furthermore, an oppression action will require the appellant to start all over again, not in Singapore but in Hong Kong under the Hong Kong companies’ legislation, resulting in even more delay to the resolution of the present dispute. Delay is one of the grounds on which the respondents have argued that this court should not give leave to the appellant to commence the derivative action. 31        For the above reasons, we are unable to accept the respondents’ arguments that the availability of alternative remedies is a sufficient reason not to grant leave to the appellant in the circumstances of this case.",
        "Conclusion": "32        For all the reasons set out above, we allow the present appeal. Accordingly, the appellant is at liberty to pursue the common law derivative action on behalf of Havilland to recover the losses arising from the alleged breaches of duties (including an account of secret profits earned) from the respondents, Ting and Sia, as well as Binti, if she can be served with the proceedings.",
        "Observations": "33        These proceedings are concerned with a common law derivative action and not one under s 216A of the Companies Act because Havilland is a Hong Kong company and therefore is not entitled to avail itself of the remedy provided by s 216A. The extent to which the common law derivative action is still available to Singapore companies (if at all) in the light of the existence of s 216A is not one that we need to deal with in this case and we therefore make no comment thereon. 34        Although incorporated abroad, Havilland has its principal place of business in Singapore and, at the material times, its directors were resident here. Whether or not this action would be more conveniently tried in Hong Kong, however, is now academic as the respondents applied to stay this action on the ground offorum non conveniensin 2000 but the application and the appeal which followed it were dismissed by the court."
    }
}