{
    "case_title": "Travista Development Pte Ltd v Tan Kim Swee Augustine and Others",
    "ncitation": "[2007] SGCA 57",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "The background": "2The facts were as follows. The appellant is a company which was incorporated for the purpose of purchasing the Property for redevelopment. The 13 respondents are the collective owners of all the strata title units in the Property. As the appellant was a foreign company for the purposes of the Residential Property Act (Cap 274, 1985 Rev Ed) (“RPA”), it required the approval of the Singapore Land Authority (“SLA”) under s 31(2) read with s 31(18) of the RPA (“the Approval”) to purchase the Property. The Approval would be signified by the issuance of a qualifying certificate (“QC”) by the SLA. 3          The relevant clauses in the S&PA pertaining to the obtaining of the Approval were as follows: 3.2        The sale and purchase of the Property shall be completed at the office of the Vendors’ Solicitorswithin six (6) weeks from the date of the receipt of the Qualifying Certificate from the Land Dealing Units [of the SLA] or within three (3) months from the date of this Agreement, whichever is later … … 4.(a)       Subject to the provisions of this Contract, it shall be the obligation of the Purchaser to obtain all requisite consents, approvals and clearances as may be necessary for the purchase contemplated herein and the Purchaser shall pay for all costs and expenses of obtaining and complying with the requirements of the relevant authority(ies) arising therefrom. The Purchaser shall comply with all terms and conditions imposed by the relevant authority(ies) including but not limited to payment of any development charges, differential premia, fees, charges, levies or costs by whatever name called and the imposition of any such terms or conditions shall not annual [sic] this Contract nor entitle the Purchaser to be discharged from this Contract. (b)        Subject to Clause 7 below (on [the] Land Dealings (Approval) Unit), if the sale cannot be completed by the Completion Date by reason of the Purchaser failing to obtain the requisite consent, approval and clearance then the Vendors shall be entitled at their absolute discretion to rescind the sale and purchaser [sic] and recover any damages suffered and the Deposit and all other monies (if any) paid to the Vendors shall be absolutely forfeited and the Purchaser shall not have any claim whatsoever against the Vendors. Provided [that] this provision is to be without prejudice to all such other rights as shall accrue to the Vendors as a consequence of the failure by the Purchaser to complete the purchase of the Property. … 7.         The sale of the Property may be made to a foreign company or person on the following additional terms:- (a)        The sale of the Property is subject to the Purchaser obtaining the approval of the Land Dealings (Approval) Unit or such other relevant authorities pursuant to the Residential Property Act (Chapter 274) for the purchase of the Property (the “Approval”)on or before the Completion Date. (b)        The Purchaser shall within ten (10) days from the date of this Agreement submit his application for the Approval and copies of his application submitted shall be furnished to the Vendors or the Solicitors within three (3) days of the said application and the Purchaser shall use hisbest endeavoursto obtain the Approvalwithoutdelay. (c)        Notwithstanding Clause 9(c), in the event that the Approval is not obtained on or before the Completion Date or is not granted by the relevant authorities, the Purchaser shall direct the purchase herein to be completed by its related company which is an “approved purchaser” or a person qualified to purchase the Property under the Residential Property Act. If on the Completion Date, the Purchaser has not obtained the Approval, or has not so directed, this Contract may be rescinded by the Vendors whereupon the Vendors shall be entitled to forfeit for their benefit the Deposit in full. Nothing herein shall prejudice the Vendors’ right for interest for late completion and shall be without prejudice to Clause 15. … 9. ... (b)        If the Purchaser shall refuse, neglect or fail to complete the purchase as herein stipulated or shall fail to comply with any of the terms and conditions herein contained, the Vendors shall be at liberty after giving twenty-one (21) days’ written notice to the Purchaser or the Purchaser’s solicitors to rescind the sale and purchase of the Property and to treat the Deposit as forfeited. [emphasis added] 4          It should be noted that the “Qualifying Certificate” referred to in cl 3.2 of the S&PA (“Cl 3.2”) and the “Approval” mentioned in cl 7 of the same agreement mean the same thing. It should also be noted that the date falling “three (3) months from the date of [the S&PA]” (see Cl 3.2) was 12 March 2007. 5          The appellant submitted its application for the Approval to the Controller of Residential Property (“the Controller”) through the SLA’s Land Dealings (Approval) Unit on 21 December 2006. By a letter dated 29 December 2006, the Controller approved the appellant’s application, subject to the appellant obtaining a banker’s or an insurance guarantee for the sum of $3.05m (“the Guarantee”) to secure its compliance with the terms for the issue of the QC. One of the terms was that the appellant had to obtain a temporary occupation permit for the redevelopment of the Property within six years from the date of issue of the QC. The appellant was also given six months from the date of the Controller’s letter (ie, the letter dated 29 December 2006) to obtain the Guarantee. 6          The appellant commenced negotiations with Malayan Banking Berhad (“Maybank”) sometime in late December 2006 to obtain financing for the purchase and subsequent redevelopment of the Property (collectively referred to as “the Project”). The appellant also approached Development Bank of Singapore (“DBS”) and The Hongkong and Shanghai Banking Corporation Limited (“HSBC”) for the same purpose. On 14 February 2007, Maybank decided not to provide financing. DBS and HSBC likewise declined to provide financing. However, on 17 February 2007, the appellant managed to obtain from Oversea-Chinese Banking Corporation Limited (“OCBC”) indicative financing terms for the Project. 7          On 26 January 2007, while these negotiations were going on, the appellant’s then solicitors, M/s Central Chambers Law Corporation (“CCLC”), sent to the respondents’ then solicitors, M/s William Oh & Partners (“WO&P”), ten transfer forms (“the Transfers”) postdated 12 March 2007. The date of 12 March 2007 was based on the expectation that completion of the sale and purchase of the Property would take place three months from the date of the S&PA (see Cl 3.2 at [3] above). The Transfers were signed by the respondents by 21 February 2007 and were returned to CCLC. WO&P also forwarded the completion accounts for the sale and purchase computed as at 12 March 2007 to CCLC. 8          Subsequently, via a letter dated 6 March 2007, CCLC informed WO&P that the appellant would not be able to complete the sale and purchase by 12 March 2007 and that the completion date would instead be six weeks from the date of the receipt of the QC to be issued by the SLA. This, CCLC stated in its letter, was “pursuant to” Cl 3.2. WO&P replied the next day to state that the appellant had breached the S&PA as all the parties to the agreement had proceeded on the basis that completion was to be within three months of the date on which the S&PA was signed. WO&P then gave the appellant notice, via a letter dated 13 March 2007, to complete the transaction within 21 days,ie, by 3 April 2007 (“the 21-day notice”). 9          On 3 April 2007, OCBC approved the appellant’s request for financing for the Project, including the request for the Guarantee. However, the respondents refused to withdraw the 21-day notice, whereupon the appellant filed the OS on 3 April 2007. On 10 April 2007, the SLA issued the QC to the appellant. On 18 April 2007, CCLC sent a copy of the QC to WO&P and gave notice of the appellant’s intention to complete the sale and purchase of the Property within six weeks of the receipt of the QC.",
        "The hearing below": "10        In the OS, the appellant sought,inter alia, (a) a declaration that it was at liberty to complete the sale and purchase of the Property within six weeks from the date of its receipt of the QC; and (b) a declaration that the 21-day notice was null and void. 11        The respondents in turn counterclaimed for,inter alia, (a) a declaration that the 21-day notice was valid and effective; (b) a declaration that the S&PA had been duly rescinded; and (c) a declaration that the $3.05m deposited by the appellant had been validly forfeited. 12        The main issue before the Judge was whether the completion date for the sale and purchase of the Property (“the Completion Date”) was six weeks from the date of the appellant’s receipt of the QC, as contended by the appellant, or 12 March 2007, as contended by the respondents. Counsel for the respondents argued, and the Judge agreed, that the answer depended on whether the appellant had used its best endeavours to obtain the Approval without delay. The respondents were of the view that if the appellant had in fact used its best endeavours, it would have obtained the QC in time to complete the sale and purchase of the Property by 12 March 2007. 13        The additional, and subsidiary, issue before the Judge was whether, as contended by the respondents, the appellant was estopped by convention from denying that the Completion Date was 12 March 2007, the date falling three months from the date of the S&PA (see [4] above). The appellant contended otherwise, arguing that its actions in postdating the Transfers 12 March 2007 and in receiving without protest completion accounts computed as at that date were not sufficient to amount to an estoppel by convention.",
        "The Judge’s decision": "14        The Judge dismissed the appellant’s case on both issues and allowed the respondents’ counterclaims. She held that, on the evidence, the appellant had not used its best endeavours to procure the Guarantee. If it had, it would have been able to procure the issuance of the QC on or before 29 January 2007, which would, in turn, have made 12 March 2007 (taking six weeks from 29 January 2007) the Completion Date: see the GD at [30]. The Judge observed, in respect of the two affidavits of Mr Tee Kien Moon, the legal consultant overseeing the appellant’s involvement in the sale and purchase of the Property, (at [32] of the GD) that: Neither affidavit said anything about what steps the [appellant] actually took to obtain the [Guarantee] because what the first affidavit talked about really was the [appellant’s] endeavour “to secure financing for the purchase of the Property”. The Judge questioned the appellant’s failure to explain why it had not applied for the Guarantee, which it was obliged to obtain “without delay” pursuant to cl 7(b) of the S&PA (“Cl 7(b)”), separately from the other financing facilities that were needed for the Project, and noted that “it would probably have been easier to simply obtain a facility for only [the Guarantee]” (see the GD at [34]). 15        The Judge also held that the course of conduct between the parties gave rise to an estoppel by convention (see the GD at [51]–[52]). CCLC had dated the Transfers 12 March 2007 and had sent them to WO&P on 26 January 2007 for execution by the respondents. The respondents had duly executed the Transfers without changing the date of 12 March 2007 and had returned them to CCLC. WO&P had also prepared and forwarded the completion accounts computed as of 12 March 2007 to the appellant without receiving any objection to that specific date from the latter upon receipt until approximately one week later.",
        "The issues on appeal": "16        The issues on appeal were the same as those addressed by the Judge (see [12]–[13] above). At the hearing of the appeal, the appellant applied for leave (via Summons No 2740 of 2007) to refer to the affidavit of Mr Lau Yik Wai (“Mr Lau”) filed on 21 May 2007. This affidavit, which was filed after the Judge delivered judgment, was for the purpose of seeking leave to make further arguments on the question of whether the appellant had used its best endeavours to procure the Guarantee. The affidavit dealt with the appellant’s efforts to procure the Guarantee. The respondents objected to the appellant’s attempt to seek a further hearing, contending that this particular issue had been apparent at a very early stage of the proceedings. The Judge agreed with the respondents and declined to hear further arguments. 17        Before us, counsel for the appellant submitted that this court should allow the appellant to refer to the above affidavit as, at the hearing before the Judge, the appellant had been taken by surprise by the respondents’ argument that it (ie,the appellant) should have applied for the Guarantee separately from the other credit facilities needed to finance the Project. Counsel submitted that this point was raised for the first time only at the hearing before the Judge, and that, in the circumstances, the appellant was not given an opportunity to address the issue in the affidavits which it filed prior to the hearing. We rejected this argument as the skeletal submissions dated 5April 2007 (see paras 13–16 thereof) and the written submissions dated 4May 2007 (see paras 24–38 thereof) filed by the respondents’ counsel showed that the respondents had queried the appellant’s lack of evidence with regard to the steps taken to procure the Guarantee, and had also pointed out that all the evidence adduced by the appellant related to the obtaining of financing for the Project as a whole, as opposed to the obtaining of the Guarantee specifically. In our view, the appellant “had been given a fair opportunity of putting forth all the facts before the court to enable it to make up its mind” (seeWong Phila Mae v Shaw Harold[1991] SLR 93at 97, [16]). In the circumstances, we disallowed the application for leave to refer to Mr Lau’s affidavit.",
        "Determining the completion date of a transaction in the context of a “best endeavours clause”": "18        Given the way in which the main issue (viz, the determination of the Completion Date) was framed for this court’s decision, Cl 7(b), which was a “best endeavours clause”, became a significant feature in counsel’s arguments and in our decision. To understand the significance of Cl 7(b) to the resolution of the main issue, it was necessary to analyse how Cl 3.2 operated in the light of the former provision. Clause 3.2 defined the Completion Date as being either “six (6) weeks from the date of the receipt of the Qualifying Certificate from the Land Dealing Units or … three (3) months from the date of this Agreement, whichever is later” [emphasis added] (see [3] above). For ease of reference, the date falling six weeks from the date of the appellant’s receipt of the QC will be termed the “first completion date”, and the date falling three months from the date of the S&PA, the “second completion date”. This then begged the question of which was the “later”, and thus, the governing, date for completion in the context of the appellant’s obligation to obtain all the approvals and consents required for the purchase of the Property. The appellant contended that since it had obtained the QC only on 10 April 2007, it had six weeks from that date to complete the sale and purchase. On the other hand, the respondents contended that, if the appellant had used its best endeavours to obtain the QC, it would have been able to obtain the QC sufficiently early so as to complete the transaction within three months from the date of the S&PA. Which interpretation was correct? 19        If the appellant’s contention was correct, then the requirement in Cl 7(b) that the appellant was obliged to use its best endeavours to obtain the QC “without delay” [emphasis added] would have no sanctionable effect if it was breached as the S&PA was silent on the consequences of such a breach. Indeed, the appellant’s argument, if accepted, would not only have made the requirement in Cl 7(b) meaningless to the determination of both the first completion date and the second completion date, but would also have rendered nugatory another aspect of the appellant’s “best endeavours” obligations, namely, to “within ten (10) days from the date of [the S&PA] submit [its] application for the Approval and [furnish] copies of [the] application submitted ... to the Vendors or the Solicitors within three (3) days of the said application”. This aspect of Cl 7(b) clearly indicated that the clause was intended to provide some assistance in determining the Completion Date. In our view, this was the correct approach. The “best endeavours” obligation in Cl 7(b)mustbe read together with Cl 3.2 to determine the Completion Date as contemplated by the parties. This was an objective evaluation. 20        The law on documentary construction is clear. It is an established principle of documentary interpretation that a clause must not be considered in isolation, but must instead be considered in the context of the whole document (see Kim Lewison,The Interpretation of Contracts(Sweet & Maxwell, 3rd Ed, 2004) (“Lewison”) at para 7.02, p 193). In addition, in construing a contract, all parts of it must be given effect where possible and no part of it should be treated as inoperative or surplus. This means, as explained inLewisonat para 7.03, p 198, that, in general, “each part of the document is taken to have been deliberately inserted, having regard to all the other parts of the document, with the result that there is a presumption against redundant words”. The courts should not adopt an interpretation of a contract which would render the language of a particular clause redundant. InIn re Strand Music Hall Company (Limited), ex parte European and American Finance Company (Limited)(1865) 35 Beav 153 at 159; 55 ER 853 at 856, Sir John Romilly MR said: The proper mode of construing any written instrument is to give effect to every part of it, if this is possible, and not to strike out or nullify one clause in a deed, unless it be impossible to reconcile it with another and more express clause in the same deed. This was recently reiterated by the judge inMacarthurCook Property Investment Pte Ltd v Khai Wah Development Pte Ltd[2007] SGHC 93at [40]. 21        Accordingly, it was our view, on an objective evaluation of the S&PA, that the “best endeavours” requirement in Cl 7(b) had to be read with Cl 3.2 to determine which was the “later” date as between the first completion date and the second completion date, and thus, the Completion Date for the purposes of this appeal. This meant that the appellant had to show that, in spite of having used its best endeavours to obtain the QC, it could not have done so within “three (3) months from the date of this Agreement” [emphasis added] (ie, the second completion date) and was, therefore, entitled to complete the purchase within “six (6) weeks from the date of the receipt of the Qualifying Certificate from the Land Dealing Units” [emphasis added] (ie, the first completion date) instead. In other words, the appellant had to show that it could not have completed the sale and purchase of the Property by the second completion date despite having used its best endeavours to obtain the QC.",
        "The elements of a best endeavours clause": "22        The appellant argued that it had used its best endeavours to obtain the QC, but could not do so within three months from the date of the S&PA,ie, by 12 March 2007. Before we deal with the evidence relied upon by the appellant in support of this argument, it is apposite that we set out the legal obligation imposed by a contractual best endeavours clause. The law is well established. A best endeavours clause in a contract obliges the covenantor to “take all those reasonable steps which a prudent and determined man, acting in his own interests and anxious to obtain planning permission [or to perform such other applicable obligation], would have taken” (seeIBM United Kingdom Ltd v Rockware Glass Ltd[1980] FSR 335(“IBM v Rockware”) at 345; referred to inJustlogin Pte Ltd v Oversea-Chinese Banking Corp Ltd[2004] 1 SLR 118at [47]). As Kan Ting Chiu J stated succinctly inOng Khim Heng Daniel v Leonie Court Pte Ltd[2001] 1 SLR 445(“Ong Khim Heng Daniel”) at [42]: A covenant to use best endeavours is not a warranty to produce the desired results. It does not require the covenantor to drop everything and attend to the matter at once; the promise is to use the best endeavours to obtain the resultwithin the agreed time. Nor does it require the covenantor to do everything conceivable; theduty is discharged by doing everything reasonable in good faith with a view to obtaining the required result within the time allowed.[emphasis added] The test to determine whether a party has exercised its best endeavours is an objective one. But, it is also a composite test in that the covenantor may also take into account its own interests. While the covenantor has a duty to use its best endeavours to perform its contractual undertaking within the agreed time, the duty is discharged upon the covenantor “doing everything reasonable in good faith with a view to obtaining the required result within the time allowed” (perKan J inOng Khim Heng Danielat [42]). This test also involves a question of fact. As stated by Choo Han Teck J inGroup Exklusiv Pte Ltd v Diethelm Singapore Pte Ltd[2003] 4 SLR 582at [11]: The facts that are relevant in such cases must include the nature of the approval sought, the practice, if any, of those in the trade concerned, the availability of an appeal process, evidence of futility of further efforts and so on. 23        What evidence did the appellant adduce to show that it had used its best endeavours –ie, that it had taken “all those reasonable steps which a prudent and determined man, acting in his own interests and anxious to obtain [the QC], would have taken” (seeIBM v Rockwareat [22]supra) – to obtain the QC? The Controller’s letter dated 29 December 2006 (see [5] above) showed that the appellant had on that date obtained “in principle” approval for the purchase of the Property, subject to it providing a banker’s or an insurance guarantee for the sum of $3.05m (ie, the Guarantee) to secure its compliance with the terms and conditions imposed by the SLA. Having obtained such “in principle” approval, all that the appellant needed to do was to procure the issuance of the Guarantee by a bank in order to obtain the QC. There was no reason why the appellant could not have obtained the Guarantee within a short time, say, 14 days, if it had provided the requisite security to cover the bank’s exposure in issuing the Guarantee. It was reasonable to assume that, when it signed the S&PA, the appellant would have had sufficient funds to provide the necessary security for the issuance of the Guarantee as it would or should have known that such a guarantee was necessary. Therefore, assuming that the appellant needed up to 14 days from 29 December 2006 to procure the Guarantee (which, on the evidence adduced in this case, would be a reasonable time frame), the appellant could have obtained the QC by 12 January 2007. The period of “six (6) weeks from the date of the receipt of the [QC]” should thus be computed starting from 12 January 2007. Following from this, the earliest possible date for completion would have been 23 February 2007, which was earlier than 12 March 2007. This would, in turn, have made 12 March 2007 the “later” date under Cl 3.2 and, therefore, the Completion Date. In other words, the “best endeavours” provision in Cl 7(b) was intended to fix the earliest date by which the appellant had to complete the purchase; if that date occurred earlier than the “later” date as computed under Cl 3.2 (ie, 12 March 2007), then the “later” date would be the Completion Date. Accordingly, unless the appellant was able to show that it had failed to obtain the QC by the “later” date of 12 March 2007 despite having used its best endeavours to do so, it would be in breach of Cl 3.2. 24        In our view, there was no question that, if the appellant had used its best endeavours to obtain the Approval, it would have been able to obtain the QC within 14 days from the date on which “in principle” approval was given by the SLA. In this connection, the respondents adduced what may loosely be termed “expert” evidence in the form of two affidavits to prove that the Guarantee could have been obtained within a few weeks of applying for it if the necessary security was provided. The first “expert”, Mr Lim Yian Poh, a retired banker, stated that the terms of the Guarantee were fairly standard and that it should not have taken more than a week for such a guarantee to be issued if the appellant was able to provide security of at least an amount equal to the value of the Guarantee. The second “expert”, Mr Oh Kim Chong William (“Mr Oh”), who was also the solicitor from WO&P acting for the respondents in the sale and purchase of the Property, stated that he was a lawyer of about 23 years’ standing and that, in his experience, the issuance of the Guarantee and the subsequent issuance of the QC were fairly routine matters which could be completed in no more than two to three weeks. 25        The appellant’s answer to the above evidence was that the appellant had approached four banks to obtain financing for the Project and had told these banks that it needed to complete the sale and purchase of the Property by mid-March 2007. However, none of the banks was able to provide the financing sought by that deadline. Counsel referred to the appellant’s correspondence with Maybank between the end of December 2006 and 14 February 2007 to show that the appellant had informed Maybank that it needed to complete the transaction by 12 March 2007 and that, in order to do so, it needed the bank’s indication that it would provide the requisite financing. However, it was clear from the evidence adduced before the Judge that, at all times, the appellant’s request to the banks was for financing of the Project as a whole; at no time did the appellant apply for the Guarantee alone. 26        By way of rebuttal to the respondents’ argument that, if the appellant had applied to the banks for the Guarantee alone, the banks would have agreed to issue it upon the provision of adequate security, the appellant contended that the respondents had no evidential basis to argue that obtaining such a guarantee on its own was a common procedure or that the banks could have processed such an application and issued the Guarantee within a few days. The appellant further argued that the respondents’ assertion that a prudent and determined man anxious to obtain the QC would have either applied for the Guarantee first or kept that application separate from the negotiations for other credit facilities was unsupported by evidence. There was nothing, so counsel contended, to suggest that the issue of overall financing for the Project could, as a matter of commercial reality, have been separated from that of the Guarantee. Furthermore, even if the request for the Guarantee had been kept separate from the broader issue of financing for the Project as a whole, there was nothing to remotely suggest that the appellant’s application would have been processed significantly faster. Thus, the appellant submitted that the Judge had wrongly accepted the respondents’ arguments that the Guarantee should have been negotiated for separately from the overall financing for the Project as these arguments were mere assertions made without any evidential basis. 27        In our view, none of the appellant’s arguments had any merit. The appellant’s decision to couple its request for the Guarantee with its request for financing for the Project as a whole obviously made it more difficult and more time-consuming for the banks and the appellant to agree on the terms of the credit facilities sought. This was a matter of common sense. Furthermore, the burden was not on the respondents to show that the banks would not have agreed to provide financing in the form of the Guarantee separately from overall financing for the Project. It was for the appellant to demonstrate this, and it could not do so because it never applied for the Guarantee separately from the other credit facilities needed for the Project. In our view, the appellant’s failure to apply for the Guarantee separately was clear evidence that the appellant had failed to use its best endeavours to obtain the QC so as to complete the sale and purchase of the Property on or before 12 March 2007. Indeed, the appellant had not even attempted to use its best endeavours in this respect. 28        In our view, there was another argument, which was not canvassed before either the Judge or this court, that could have been determinative of the main issue in favour of the respondents. We have decided to raise it in these grounds of decision so as to indicate our views on the law relating to this rather obvious (on hindsight) issue for the benefit of lawyers and their clients should a case like the present arise again in the future. In ordinary circumstances, a sale and purchase agreement with respect to any property, whether movable or immovable, is not based on the assumption that completion of the transaction is conditional upon the purchaser’s ability to obtain the necessary financing. As a matter of law, the assumption is to the contrary,ie, the purchaser must find the funds to complete the transaction and how he does so is not the business of the vendor. If completion of the transaction is to be conditional upon the availability of financing to the purchaser, then the agreement must provide for it expressly or by necessary implication. The element of conditionality must be provided for in the agreement, and cannot be implied in favour of the purchaser. In the present case, there was nothing in the S&PA which stated that the sale and purchase of the Property was conditional upon the appellant having the funds to obtain the Guarantee in order to, in turn, obtain the QC. The appellant’s obligation was to use its best endeavours to obtain the QC. If a banker’s guarantee was necessary to obtain the QC, then the appellant had to obtain such a guarantee – this obligation was not conditional upon the appellant’s financial condition.As far as the respondents were concerned,the fulfilment of that condition –ie, the obtaining of the QC – was not dependent upon the appellant being financially able to obtain the Guarantee or to provide the security needed to obtain it. The financial standing of the appellant had nothing to do with and did not affect the rights of the respondents under the S&PA. 29        In our view, had the above argument been canvassed, it would have been accepted by us. It would have led to the same conclusion, namely, that the appellant had failed to complete the sale and purchase of the Property in accordance with the terms of Cl 3.2 read with Cl 7(b). The appellant would have complied with Cl 7(b) only if it had used its best endeavours to procure the Guarantee within 14 days (at the maximum) after receiving the SLA’s “in principle” approval to purchase the Property.",
        "Was there estoppel by convention?": "30        Given our finding that the appellant had failed to use its best endeavours to obtain the QC in order to complete the sale and purchase of the Property in a timely manner, it was unnecessary for us to address the issue of estoppel by convention, which the Judge had relied on as an additional basis for deciding in the respondents’ favour and dismissing the appellant’s application. However, in the interests of completeness, we will address counsel’s submissions on this issue. The doctrine of estoppel by convention was, until recently, not a commonly invoked defence in common law jurisdictions. However, this defence has been relied on increasingly in our courts: see, for example,Wardley Ltd v Bestland Development Pte Ltd[1992] 2 SLR 961;Singapore Island Country Club v Hilborne[1997] 1 SLR 248;MAE Engineering Ltd v Fire-Stop Marketing Services Pte Ltd[2005] 1 SLR 379at [43]–[50];Singapore Telecommunications Ltd v Starhub Cable Vision Ltd[2006] 2 SLR 195(“SingTel v SCV”); andCandid Water Cooler Pte Ltd v United Overseas Bank Ltd[2006] 3 SLR 216. 31        On the basis of existing authorities, for estoppel by convention to operate, the following elements must be present (seeSingTel v SCVat [28]; see alsoChitty on Contracts(H G Beale gen ed) (Sweet & Maxwell, 29th Ed, 2004) vol 1 at para 3-107): (a)        The parties must have acted on “an assumed and incorrect state offact or law” [emphasis added] (perBingham LJ inNorwegian American Cruises A/S v Paul Mundy Ltd (The “Vistafjord”)[1988] 2 Lloyd’s Rep 343 at 352) in their course of dealing. (b)        The assumption must be either shared by both parties pursuant to an agreement or something akin to an agreement, or made by one party and acquiesced to by the other. (c)        It must be unjust or unconscionable to allow the parties (or one of them) to go back on that assumption. It follows that an estoppel by convention cannot arise where neither of the parties between whom the alleged estoppel arose was aware of the facts on which the common assumption in question was said to have been based (seeChitty on Contractsvol 1 at para 3-109;HIH Casualty & General Insurance v Axa Corporate Solutions[2002] 2 All ER (Comm) 1053). 32        In the present case, the Judge held that the appellant was estopped by convention from denying that 12 March 2007 was the Completion Date for the reasons set out in the following passages of the GD: 51         ... In my view, the relevant facts here are that CCLC dated the transfer forms with the date 12 March 2007 and sent these forms to WO&P for execution by the [respondents]; that the [respondents] duly executed the forms without changing that date and their solicitors prepared and forwarded to the [appellant] on 27 February the completion accounts as of 12 March 2007 without receiving any objection thereto upon receipt. It was not till some seven days later that the [appellant] informed the [respondents] that completion could not take place on 12 March 2007. It is also relevant that the knowledge of whether the QC had been issued by 26 January 2007 when the transfers were sent out was wholly in the possession of the [appellant]. The [respondents’] solicitor seeing the completion date on the transfers would have been justified in assuming that, although he had not been formally notified thereof, the QC had either been issued before 26 January 2007 or was expected to be issued by 29 January 2007. … 52         ... Having had time for further consideration, ... in the particular circumstances of this case where it was the [appellant] who needed the approval to proceed with the purchase and who was the only party corresponding with [the] SLA, I have come to the conclusion that because of these factors which also caused the [respondents] to believe 12 March 2007 was the completion date, an estoppel did arise if not on 26 January 2007 then very shortly after [on] 29 January 2007. 33        The appellant challenged the Judge’s finding of estoppel by convention on the ground that there was no common assumption between the parties as to the Completion Date being 12 March 2007. It argued that the respondents’ misconception about the Completion Date stemmed from their own solicitors, in particular, Mr Oh, who had indicated to the respondents that the Completion Date would be 12 March 2007. Counsel submitted that Mr Oh had had the opportunity to ask the appellant about the status of the QC, but had chosen not to do so. Instead, relying on his own experience that the issuance of the Guarantee and the subsequent issuance of the QC were fairly routine matters which could be dealt with in no more than two to three weeks, Mr Oh had proceeded on the basis that the Completion Date would be 12 March 2007. Counsel further argued that the appellant’s conduct in dating the Transfers 12 March 2007 and sending them to the respondents on 26 January 2007 was simply a result of its desire to complete the sale and purchase of the Property as quickly as possible. Given the structure of Cl 3.2, the earliest possible date for completion was 12 March 2007. The appellant therefore tried its best to meet that deadline. 34        In our view, the evidence did not suggest that the parties had acted on a shared assumption that the “later” date for the purposes of Cl 3.2 was 12 March 2007. The mere fact that the appellant inserted that date on the Transfers and sent them over to WO&P for the respondents’ signatures did not raise such a shared assumption. This was because, at the relevant time, the respondents did not know whether the appellant had used its best endeavours to obtain the QC or whether “in principle” approval had been given to the appellant by the SLA. All that the respondents knew was that they were given the Transfers, with the date of 12 March 2007 already inserted, to sign. The appellant, on the other hand, did not appear to have realised that by applying for a total package to finance the Project as a whole, it was not using its best endeavours to obtain the QC, contrary to its undertaking under Cl 7(b). 35        In our view, even if there had been a common assumption between the parties, the assumption would have been that the Completion Date would definitely be 12 March 2007, regardless of whether the appellant had used its best endeavours to obtain the QC. But, such a common assumption could not possibly have arisen in the present case because of the express wording of Cl 3.2 read with Cl 7(b). Pursuant to Cl 7(b), the appellant was under a contractual obligation to use its best endeavours to obtain the QC. If, upon exercising its best endeavours, the appellant had obtained the QC by 12 January 2007 (see [23] above), the second completion date –ie, 12 March 2007 – would have been the Completion Date. In contrast, if the appellant had used its best endeavours but nonetheless failed to obtain the QC in time to complete the sale and purchase by 12 March 2007, then the first completion date –ie, the date falling six weeks from 10 April 2007 (which was the date on which the appellant received the QC) – being the “later” date under Cl 3.2, would have been the Completion Date. In both scenarios, the Completion Date would not have been determined by the operation of any estoppel by convention. 36        For the above reasons, we did not agree with the Judge’s finding that, on the facts, there was estoppel by convention. 37        Notwithstanding the conclusion in the preceding paragraph, in view of our decision on the main issue in this appeal (viz, the determination of the Completion Date), we dismissed the appeal with costs and the usual consequential orders on the ground that, if the appellant had used its best endeavours to obtain the QC (which it had not), it would have been able to complete the sale and purchase of the Property by 12 March 2007."
    }
}