{
    "case_title": "Donald McArthy Trading Pte Ltd and Others v Pankaj s/o Dhirajlal (trading as TopBottom Impex)",
    "ncitation": "[2007] SGCA 8",
    "coram": "Chan Sek Keong CJ; \n      Lee Seiu Kin J; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Facts": "2           For the purposes of the determination of the preliminary issues, the appellants agreed to proceed on the basis of the respondent’s pleaded case at its highest. The effect of this approach was that where there was a dispute on the material facts, the court was to accept those facts as alleged by the respondent. In our view, this was the correct approach to take as the power to order the trial of a preliminary issue of law would not have been exercised unless there was no substantial disagreement on the material facts. 3           Accordingly, putting aside any disputed facts that could be determined at the main trial, the relevant material facts for the purpose of these proceedings were as follows. The first appellant is a limited company, Donald McArthy Trading Pte Ltd. The second and third appellants are the directors and shareholders of the first appellant. The respondent is the sole proprietor of a business known as TopBottom Impex. The parties have known each other for more than 20 years. Sometime in or about 1997, the appellants and the respondent came to an agreement (“the Agreement”) whereby the respondent would allow his letter of credit facilities with his banks (“L/C facilities”) to be used by the first appellant to finance goods purchased by it. In consideration of this service, the first appellant would reimburse the respondent the actual principal amount used, the costs and disbursements charged by the respondent’s banks, a 1.5% commission charge on the amount of each letter of credit used and interest fixed at 12% per annum (which might be adjusted to 14% if the first appellant was late with repayment). 4           From mid-1998 to at least 2000, the first appellant made frequent use of the respondent’s L/C facilities subject to the terms of the Agreement. However, the first appellant defaulted in reimbursing the respondent the amounts of the L/C facilities used by it, as a result of which the respondent commenced an action on 1 April 2005, alleging that the first appellant was merely a shield for the second and third appellants’ fraudulent activities and seeking to lift the corporate veil of the first appellant, consequently claiming from the appellants the sums of US$361,459.66 as principal and US$239,441 as interest. 5           The appellants did not deny the existence of the Agreement but pleaded that it was terminated in October 2000 and all outstanding sums had been paid back to the respondent. Subsequently, the appellants changed solicitors, following which their defence was amended on 7 November 2005 to plead that the transactions under the respondent’s L/C facilities were moneylending transactions, and that as the respondent was an unlicensed moneylender, these transactions were unenforceable under the MLA. It was in relation to this defence and pursuant to the appellants’ subsequent application that Kan J was asked to determine the preliminary issues. In relation to these issues, he held, respectively, that first, there was no loan of money by the respondent to the first appellant; instead, the respondent had in fact lent or rented his L/C facilities to the first appellant, and the MLA was thereby inapplicable: seePankaj([1]supra) at [23]. Secondly, if the transactions were in law moneylending arrangements, Kan J held that the respondent was an unlicensed moneylender within the terms of the MLA, and the appellants would therefore have a complete defence to the respondent’s claims:Pankajat [38] and [39].",
        "Purpose of the MLA": "6           Before giving our reasons for our decision on the preliminary issues, it would be useful to restate the legislative purpose of the MLA and the relevant principles that have been established by case law on the scope of the MLA. It is trite that a court should give effect to the legislative purpose when interpreting an Act of Parliament. From the transcripts of parliamentary debates on the enactment and subsequent amendments of the MLA, it is clear that Parliament intended the MLA to be a social legislation designed to protect individuals who, being unable to borrow money from banks and other financial institutions, have to turn to unscrupulous unlicensed moneylenders who prey on people like them. For example,inSingapore Parliamentary Debates, Official Report(2 September 1959)vol 11 at col 593, Mrs Seow Peck Leng made the following remarks: This Bill [referring to the Moneylenders Bill] is laudable for the fact that it protects the poor from the clutches of unscrupulous moneylenders. This Bill, in my opinion, should be implemented as soon as possible to ease the hardship of those already victimised and to prevent those who, because of financial difficulties, may be victimised in the future … It is the very, very poor, Sir, who need protection most, who usually take loans of less than $100, and I think that they are the ones who should be protected… [emphasis added] These expressions of legislative purpose have been reiterated whenever the MLA has come up for amendment in Parliament. For example, inSingapore Parliamentary Debates, Official Report(28 May 1993)vol 61 at col 294, Prof S Jayakumar (the Minister for Law) said: Sir, this Bill amends the Moneylenders Act to increase the quantum of penalties for illegal moneylending… Members, I am sure, would have read numerous accounts in the press of illegal moneylenders or loansharks resorting to the use of threats and violence in extracting payment from debtors for loans given. These loans were often at exorbitant rates of interest.They prey on debtors who, having no access to the usual channels of raising finance, had no recourse except to look to those loansharks for their funds. [emphasis added] 7           In a similar vein, this court inLorrain Esme Osman v Elders Finance Asia Ltd[1992] 1 SLR 369at 378, [39] endorsed Farwell J’s observations inLitchfield v Dreyfus[1906] 1 KB 584 at 590 with respect to the Money-lenders Act 1900 (c 51) (UK), stating that what he said was equally true of the MLA. Farwell J had said that: The Act [referring to the English Act] was intended to apply only to persons who are really carrying on the business of money-lending as a business, not to persons who lend money as an incident of another business or to a few old friends by way of friendship. This particular Act was supposed to be required to save the foolish from the extortion of a certain class of the community who are called money-lenders as an offensive term. 8           These comments echo theviews which the English Select Committee took into account when enacting the English Money-lenders Act 1900. The Crowther Committee’s Report on Consumer Credit (Cmnd 4596, 1971) at para 2.1.22 summarised these views as follows: … Much of the evidence given to the Committee, and to its successor appointed in 1898, was concerned with such victims of the rapacious moneylender as the widow forced to borrow on a bill of sale of her household effects, and the young son of the aristocracy who in the course of sowing his wild oats ran up large debts, at exorbitant interest, which his family [was] later blackmailed into paying to avoid the publicity of court proceedings. 9           The thrust of these comments is clear. The statutory provisions of the MLA,as V K Rajah J observed inCity Hardware Pte Ltd v Kenrich Electronics Pte Ltd[2005] 1 SLR 733(“City Hardware”) at [27],“have the salutary objective of proscribing rapacious conduct by unlicensed and unprincipled moneylenders” who prey on individuals who turn to them out of financial destitution. The provisions of the MLA are not intended to apply to transactions made at arm’s length between commercial entities. It has never been the objective of the MLA to prohibit or impede legitimate commercial intercourse between commercial persons. Indeed, Rajah J pointed out that the courts should not adopt an over-extensive application of the MLA even though its provisions may beliterallyconstrued to cover most commercial situations, as that would not advance thelegislative purposeof the Act. InCity Hardwareat [22], Rajah J said that: A court has to bear in mind these crucial observations [referring to the judicial pronouncements of the purpose of the MLA and similar foreign legislation] when interpreting and applying the provisions of the MLA.It cannot be denied thatex facie, its provisions have an extensive reach appearing to embrace a myriad of commercial situations. In my view, it would nonetheless be wholly inappropriate to apply the MLA to commercial transactions between experienced business persons or entities, which do notprima faciehave the characteristics of moneylending. [emphasis added]",
        "Whether the respondent was a moneylender within the terms of the MLA": "10         With these legislative and judicial comments as our reference point, we considered the first issue as to whether the respondent was a moneylender within the terms of the MLA. “Moneylender” is defined in s 2 of the MLA thus: “moneylender” includes every person whose business is that of moneylending or who carries on or advertises or announces himself or holds himself out in any way as carrying on that business whether or not that person also possesses or earns property or money derived from sources other than the lending of money and whether or not that person carries on the business as a principal or as an agent … Section 2 then goes on to list certain persons and institutions which are not to be regarded as “moneylenders” under the Act. However, before considering s 2, the obvious question that arose was whether, on the facts of this case, there were, in the first place, any loans given by the respondent to the first appellant, as in the absence of any loans, there could be no moneylending.It is axiomatic that without “lending”, there could be no “moneylending”.",
        "Whether there were loans under the Agreement": "11         As observed by Rajah J inCity Hardwareat [23], the MLAdoes not assist in explicitly defining what constitutes lending or the loan of money. In this context, Rajah J found the discussion in Clifford L Pannam,The Law of Money Lenders in Australia and New Zealand(The Law Book Company Limited, 1965) to be of great assistance in both construing and applying the MLA. Pannam states at p 6: A loan of money may be defined, in general terms, as a simple contract whereby one person (“the lender”) pays or agrees to pay a sum of money in consideration of a promise by another person (“the borrower”) to repay the money upon demand or at a fixed date. The promise of repayment may or may not be coupled with a promise to pay interest on the money so paid.The essence of the transaction is the promise of repayment. As Lowe J. put it in a judgment delivered on behalf of himself and Gavan Duffy and Martin JJ. [inFerguson v O’Neil[1943] VLR 30at 32]: “‘Lend’ in its ordinary meaning in our view imports an obligation on the borrower to repay.” Without that promise, for example, the oldindebitatuscount of money lent would not lay.Repayment is the ingredient which links together the definitions of “loan” to be found in theOxford English Dictionary, the various legal dictionaries and the text books.In essence then a loan is a payment of money to or for someone on the condition that it will be repaid.[emphasis added] In elaboration, Rajah J noted at [24] that what constitutes lending must remain a question of fact in every case. Careful consideration has to be given to the form and substance of the transaction as well as the parties’ position and relationship in the context of the entire factual matrix. 12         In addition, in the light of the discussion on the purpose and application of the MLA above at [6] to [9], we were of the view that the courts should not, in the words of Rajah J inCity Hardwareat [25], “be overzealous in analysing or deconstructing a transaction in order to infer and/or conclude that the object of the transaction was to lend money”, especially when the transactions take place in a commercial context. Similar advice can also be found in the seminal decision ofChow Yoong Hong v Choong Fah Rubber Manufactory[1962] AC 209 (“Chow Yoong Hong”), where Lord Devlin stated at 216–217: The task of the court in such cases is clear. It must first look at the nature of the transaction which the parties have agreed. If in form it is not a loan, it is not to the point to say that its object was to raise money for one of them or that the parties could have produced the same result more conveniently by borrowing and lending money.But if the court comes to the conclusion that the form of the transaction is only a sham and that what the parties really agreed upon was a loan which they disguised, for example, as a discounting operation, then the court will call it by its real name and act accordingly. [emphasis added]",
        "Nature of the Agreement": "13         In this appeal, it was clear to us that the Agreement wasex faciea loan or rental of credit facilities. There was no loan of money but a loan or rental of credit facilities, specifically L/C facilities, which the respondent had obtained from his bankers. Before us, counsel for the appellants argued that several characteristics of the Agreement rendered the transactions effected thereunder as loans of money. Counsel also argued thatNissho Iwai International (Singapore) Pte Ltd v Kohinoor Impex Pte Ltd[1995] 3 SLR 268(“Nissho Iwai”) andCity Hardware, both of which decided that similar transactions were not loans of money, could be distinguished from the facts of the present appeal. In effect, counsel argued that the Agreement was in substance a moneylending arrangement although in form, it was a loan or rental of L/C facilities. 14         This argument required consideration, as the mere fact that a financing arrangement was made at arm’s length between two commercial entities does not,by itself,preclude it from being characterised as a moneylending arrangement. It is a question of substance and not of form, although the form of the transaction wouldprima faciereflect the substance of the transaction. In theory, as Rajah J noted inCity Hardwareat [22], if the parties had wilfully attempted to structure a transaction so as to evade the application of the MLA, the court could construe the transaction as being a loan of money. Commission and interest 15         First, the appellants argued that the 1.5% commission charged by the respondent on the full drawdown amount, in addition to the 12% interest per annum, rendered the transactions under the Agreement loans.The thrust of this argument was that the charging of a fixed interest rate of 12% per annum irrespective of the rate of interest that was being charged by the respondent’s banks on the L/C facilities made the lending of the facilities a loan of money. The argument also implied that topping this 12% interest rate with a 1.5% commission on the amount of the facility drawn down each time made the transaction a usurious transaction. It was also pointed out to us that of the amount claimed by the respondent for the period between December 1999 and December 2003, the principal sum that was “lent” to the first appellant amounted to US$361,459.66, and this was almost equivalent to the interest charged, which amounted to US$239,441. 16         We rejected this argument as the respondent’s charges took into accountthe risk of his exposure to his banks for the principal amounts drawn down under the L/C facilities. It seemed to us that this method of charging borrowers of L/C facilities is a common commercial practice in Singapore. InTan Sim Lay v Lim Kiat Seng[1996] 2 SLR 769, Choo Han Teck JC (as he then was) had no hesitation in concluding that this was not tantamount to moneylending (at 777, [23]): There is implicit in Lord Devlin’s judgment [inChow Yoong Hong] that such transactions at least have the colour of a genuine commercial transaction other than pure moneylending. The defence there failed because the evidence adduced was inadequate to convince the court that the transactions were not only truly what they appeared.Similar transactions may well include the extension by one party for the use of another the credit facilities at the disposal of the former in consideration of payment of a commission.Such transactionsper semay not be moneylending. In the present case, money was actually advanced which were [sic] to be repaid with interest fixed at an exorbitant rate. [emphasis added] Similarly,inWhole Rife Investments Limited v ACI Engineering (S) Pte Ltd[1998] SGHC 308, Tay Yong Kwang JC (as he then was) held at [50] that: The transactions in question did not infringe the Moneylenders Act, which related only to pure money transactions andnot to transactions which were essentially concerned with the granting of credit facilities even though interest may have been chargedfor delayed payment or pursuant to an agreement (per Syed Othman F.J. inGillespie Bros & Co v Ngui Mui Khin & Anor[1980] 1 MLJ 87, at page 88). [emphasis added] 17         Finally, we should mention that the 12% interest per annum charged by the respondent for the use of the L/C facilities was not the net rate. The respondent had to pay interest to his bankers on the amounts utilised by the first appellant. As the banks’ interest rates were 9% to 10% per annum at all material times, the interest the respondent charged was a mere 2% to 3%, in addition to the 1.5% commission. The additional interest of 2% for late payments was imposed because the banks were charging the respondent such interest for late payments. Late payment interest would be chargeable to the first appellant if and when it was responsible for incurring it. It did not add to the respondent’s mark-up. Accordingly, we could not see how the imposition of commission and interest pursuant to the Agreement turned the L/C transactions into loans of money. Absence of interest on invoices and ledger 18         Secondly, the appellants argued that when the respondent issued commercial invoices to the first appellant for the actual principal amounts drawn down under the L/C facilities with bank costs and disbursements plus the 1.5% commission, the respondent did not indicate further interest charged to the first appellant. Furthermore, the appellants pointed out that the respondent kept a general ledger for the interest as per the banks’ method of computation. These, according to the appellants, showed that the respondent was behaving like a bank and had tried to evade the application of the MLA by concealing the interest payable. 19         In our view, these features did not render the Agreement a moneylending arrangement nor were they indications of any moneylending transactions within the terms of the MLA. As therespondent explained,since he was unable to compute interest as and when his invoices were rendered, he maintained an accounting ledger named “Donald Account” to track payment and interest. None of this was designed to disguise an underlying moneylending arrangement. In fact, the respondent had exhibited the “Donald Account” to show that the interest charged was in accordance with the agreed 12% and pro-rated to the time when the first appellant paid the principal amount. Accordingly, we did not find that the respondent hadwilfully attempted to structure the Agreement and the transactions made thereunder so as to evade the application of the MLA. Respondent’s lack of interest in goods bought by appellants 20         Thirdly, the appellants argued that because therespondent did not make any real purchases of the goods in respect of the L/C facilities, the transactions under the Agreement were in effect loans of money to the first appellant. In our view, this argument had no merit. InNissho Iwai([13]supra), Lim Teong QweeJC decided that purchase financing involving the issuance of L/C facilities by one party on another’s behalf, for which that first party was liable to his own bank, was not a loan of money. The first party’s interest in the goods bought by the other party was not material to the conclusion reached by Lim JC. In our view, the underlying purchases and sales of the goods the appellants undertook with their own suppliers were irrelevant to the question of whether the transactions under the Agreement constituted moneylending transactions. Moreover,the fact that the respondent was not the real purchaser of the goods was irrelevant so long as the first appellant bought the goods. The latter’s purchase gave effect to the whole purpose of the Agreement, which was not to borrow money from the respondent but to make the respondent’s L/C facilities available to the first appellant to finance goods purchased by it.This reinforced our view that the Agreement was not a sham arrangement designed to escape the application of the MLA. 21         Despite this, the appellants attempted to distinguishNisshoIwaiby arguing thatthe goods bought by the defendants inNissho Iwaiusing the plaintiff’s L/C facilities had been pre-on-sold, whereas the goods bought by the appellants here were not. This was a distinction without substance. Whether the goods were pre-on-sold or not did not matter in the determination of the nature of the transaction. In fact, inNissho Iwai, the second defendants had also argued that there were goods which had been purchased as stock and not immediately on-sold. Despite this, Lim JC at 275, [18] of his judgment held that “here again there [was] no loan”. Appellants’ lack of credit facilities 22         Another factor relevant to our determination that the transactions made under the Agreement were loans or rentals of credit facilities, and not of money, was that the appellants did not have sufficient credit facilities and had turned to the respondent for assistance. The appellants claimed that they had alternative credit facilities, but whether this was true or not was irrelevant, because even if they had such facilities, these facilities were obviously insufficient for their businesses since they had arranged to borrow the respondent’s L/C facilities. It would be contrary to common or commercial sense for the appellants to have borrowed the respondent’s credit facilities if they had sufficient credit lines themselves. 23         This is similar to the facts inCity Hardware. InCity Hardware, the plaintiff was in the business of selling and distributing sanitary fittings as well as other household goods and appliances. Through the efforts of the managing director of the defendant, the plaintiff was persuaded to enter into a trading relationship to acquire merchandise from Aloh Pte Ltd (“Aloh”). In turn, the plaintiff would supply such merchandise to the defendant at an agreed mark-up. In effect, this tripartite arrangement allowed the plaintiff to “sell” its credit facilities to the defendant for a fee,ie, the mark-up. In the event, Rajah J held (at [38]) that it was wholly inappropriate to view the Aloh transactions as moneylending. 24         Rajah J observed at [42] that the transactions inCity Hardwarecould in effect be viewed as a sale of credit facilities to the defendant. It was undisputed that the defendant there could not obtain credit facilities, whereas the plaintiff, given its standing, had substantial credit facilities. The plaintiff facilitated the purchase of the goods by the defendant by making arrangements with its bank to pay directly for the purchase of the goods. It charged a fee for making these arrangements and absorbed the risk of a default by the defendant. These transactions could be viewed as a “sale of credit facilities” to the defendant. Alternatively, the arrangements could also be considered as commission transactions for credit facilities which the defendant could not obtain directly itself. In our view, the same characterisation must apply to the transactions made under the Agreement here.",
        "Market practice and policy considerations": "25         For the reasons considered above, we concluded that the transactions under the Agreement were loans or rentals of credit facilities by the respondent to the first appellant and not loans of money. The imposition of commission and interest, and the use of a ledger to record interest did not render these transactions loans of money. As can be seen from the numerous cases of this nature that have come before the courts, the financial arrangement set out in the Agreement has become a common and established practice among small business entities in Singapore where one party has L/C facilities but the other party does not. Commercially, this is a mutually beneficial arrangement with one party being able to take advantage of another party’s credit facilities in order to expand his business, and the other party being able to reduce the cost of his own credit facilities. There is no reason why the MLA should proscribe such “win-win” solutions in the business sector when both parties are able to negotiate the terms of the transaction at arm’s length. Not only are these transactions not loans in nature or in form, they are also a convenient way to expand credit facilities in the market. 26         InNissho Iwai,Lim JC said at 274, [18]: … I think not a few importers who use the available letter of credit lines of banking facilities of their business associates from time to time would be surprised if they were told that they were borrowing money by doing that and that their business associates would require a licence under the Moneylenders Act. This was said in 1995 concerning an arrangement that was made in 1991. Lim JC recognised that this kind of arrangement was already an established feature of commercial practice in Singapore and confirmed its status as a non-moneylending arrangement or transaction. Businessmen have since regardedNissho Iwaias having settled the legal status of such arrangements, in spite of the fact that it was a first instance decision. Many attempts have been made by less than honest parties to such arrangements to haveNissho Iwaideclared as bad law or distinguished on the facts, as can be seen by the judicial decisions referred to earlier. Every such attempt has been rebuffed by the courts. 27         More importantly,Nissho Iwaiis well known to the policy makers in our financial sector. The MLA has been amended several times sinceNissho Iwaiwas decided. In the recent decision ofCity Hardware,Rajah J made some pertinent observations (at [49]) on the need for the MLA to be reviewed and fine-tuned to meet current consumer needs in a social and business environment which is very different from that prevailing at the time when the first moneylending legislation was enacted in England in 1900 (on which the MLA is based). In April 2006, Rajah J’s comments were referred to in Parliament when the Moneylenders (Amendment) Bill 2006 (No 12 of 2006), was debated. In the debate, Parliament recognised the need to fine-tune the legislative framework to keep pace with changes in the consumer credit industry. The amendments in the Bill are not relevant to the nature of the arrangement which is the subject matter of this appeal. Nevertheless, the fact that Parliament has taken no step to address the social or commercial desirability of arrangements to loan or rent L/C facilities must mean that as a matter of policy, Parliament does not consider that such arrangements are contrary to the legislative purpose of the MLA.",
        "Conclusion": "28         In view of our conclusion that there was no loan of money under the Agreement from the respondent to the first appellant in the first place, we would determine issue (a) in the negative,ie, the respondent was not a moneylender within the terms of the MLA. It was therefore unnecessary for us to determine issues (b) and (c). Accordingly, we dismissed the appeal with costs and with the usual consequential orders."
    }
}