{
    "case_title": "Ho Soo Fong and Another v Standard Chartered Bank",
    "ncitation": "[2007] SGCA 4",
    "coram": "Chan Sek Keong CJ; \n      Lee Seiu Kin J; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Background": "1          The appellants are the joint owners of a property at 26F Poh Huat Road (“26F Poh Huat Road”). They are appealing against the dismissal by the High Court of their appeal against the decision of the assistant registrar (“the AR”) not to award them damages pursuant to s 128(1) of the Land Titles Act (Cap 157, 2004 Rev Ed) (“the LTA”) arising from the sale by the mortgagee of a property at 179 Syed Alwi Road (“179 Syed Alwi Road”) owned by them. The decision of the High Court is reported at[2006] 3 SLR 263.",
        "Refinancing with the respondent": "2          This appeal marks the conclusion of a series of events which began in March 2001, when the first appellant, Ho Soo Fong (“HSF”), met the respondent’s branch manager, Diana Tan, at his office at 179 Syed Alwi Road to discuss the possibility of refinancing various properties that were mortgaged to other banks. On 11 May 2001, Diana Tan sent HSF a letter offering a loan facility in respect of a property at 150 Braddell Road (“150 Braddell Road”). HSF and another brother, Ho Soo Kheng (“HSK”), met with Diana Tan on 18 May 2001 when they accepted the offer. HSF has also alleged that at this meeting he informed Diana Tan that he wished to refinance a loan of about $700,000 from Oversea-Chinese Banking Corporation Ltd for a property at 77 Syed Alwi Road (“77 Syed Alwi Road”) and overdraft facilities of about $7m from The Bank of East Asia Ltd (“BEA”) secured by 179 Syed Alwi Road. HSF further alleged that Diana Tan informed him that refinancing the 77 Syed Alwi Road loan would not be a problem but that there would be a problem with the 179 Syed Alwi Road overdraft as the respondent’s loan policy did not permit loans exceeding $5m to individual borrowers. Although Diana Tan later denied under cross-examination that HSF had asked her whether the respondent would refinance 179 Syed Alwi Road, the undisputed evidence is that Diana Tan was, at the very least, informed in March 2001 that HSF and HSK had a very large overdraft secured by 179 Syed Alwi Road and that she had informed HSF that the respondent could not refinance it for the reason mentioned earlier. At a subsequent meeting in July 2001, HSF informed Diana Tan that he had another property at 26F Poh Huat Road which he would consider refinancing with the respondent. 3          Following these meetings, the respondent sent a loan facility letter on 1 August 2001 to HSF and HSK offering to refinance 77 Syed Alwi Road. This offer was accepted on 3 August 2001. Subsequently, the respondent offered, by way of another loan facility letter, to refinance 26F Poh Huat Road. This offer was accepted by the appellants on 1 September 2001. Subsequently, the respondent lodged caveats against all three properties,ie, 150 Braddell Road, 77 Syed Alwi Road and 26F Poh Huat Road, the caveat against the last-mentioned property being lodged on 10 December 2001 even though at that point of time the loan facilities had not been activated. 4          The reason for the non-activation of the loan facilities was that under the terms of the loan facility letters, the appellants and HSK had to fully settle pending court actions against Ho Pak Kim Realty Co Pte Ltd (of which HSF and HSK were directors) as a pre-condition for the disbursement of the loans. There were other conditions, such as that the respondent would bear the legal costs for the mortgage of the properties if the transactions were completed but not otherwise, and that the appellants and HSK would have to pay a cancellation fee of 1% of the loan facilities if they were cancelled.",
        "Non-disbursement of loans by respondent": "5          As it turned out, none of the three loans were disbursed even after a year as the respondent was not satisfied that the appellants and HSK had fulfilled their obligation in settling all the pending court actions. After it became clear to the appellants and HSK that the respondent would not disburse the loans, they wrote to the respondent on 7 October 2002 and cancelled the three loan facilities.",
        "Respondent’s refusal to withdraw caveats": "6          Following this, the appellants and HSK wrote to the respondent on 21 October 2002 and requested that the caveats lodged against the three properties be withdrawn. Similar requests were subsequently made on numerous other occasions, the last being made on 22 July 2003. 7          The respondent ignored all these requests because the appellants and HSK had refused to pay the cancellation fees on the three loan facilities amounting to a total of $21,380 being the 1% cancellation fees and $4,476.05 being the abortive legal fees. Out of the $21,380 claimed for cancellation fees, only $2,630 was due on the 26F Poh Huat Road loan facility. The appellants and HSK denied liability for any cancellation fees. This stand-off, which lasted for about 16 months, eventually led to the present proceedings. 8          During this period, the respondent was fully aware that the appellants and HSK needed to refinance their outstanding loans in order to reduce the monthly interest charges on these loans. However, to do that successfully, they also needed the respondent to withdraw the three caveats lodged against the properties, but the respondent was adamant that it would not withdraw them except upon full payment of the cancellation fees. The appellants and HSK made several proposals to pay the cancellation fees even though they considered that no such fee was payable. On 30 December 2002, HSF offered to pay $1,136.05 as cancellation fees and $1,493.95 for legal fees. On 8 May 2003, HSF again offered to deduct $20,000 from the new loans from other banks to be held by his solicitors as stakeholders pending the determination of the dispute. Finally, on 5 June 2003, HSF offered to pay $5,000 as cancellation fees and $2,500 for legal fees. The respondent rejected all these offers. It should be noted that the cancellation fee in relation to the loan facility for 26F Poh Huat Road was only $2,630, but the respondent was not prepared to withdraw any caveat except upon payment of the total cancellation fees.",
        "Proceedings to compel withdrawal of caveats": "9          The stand-off on this small claim continued until early 2004. By this time, BEA, as mortgagee, had taken action on 16 October 2003 to sell 179 Syed Alwi Road by way of a mortgagee’s sale. On 27 February 2004, the appellants and HSK applied to the High Court by Originating Summonses Nos 257, 258 and 259 of 2004 for orders,inter alia, directing the respondent to withdraw the caveats and for an inquiry as to the damages payable by the respondent to the appellants attributable to the respondent’s refusal or failure to withdraw the caveats. On 30 June 2004, the respondent withdrew the caveats without admission of liability. 10        The applications were heard by Belinda Ang J. She held that the caveats had been lodged wrongfully or without reasonable cause as the respondent did not have any caveatable interest in the three properties and ordered an inquiry to determine the compensation payable to the appellants and HSK: seeHo Soo Fong v Standard Chartered Bank[2005] 1 SLR 316.In her decision at [30], Belinda Ang J criticised the respondent’s conduct in these words: The court was dealing with caveats that were left on the land register for an appreciable period of time. The bank let the caveats remain on the land register despite calls to remove them since 21 October 2002. The caveats were withdrawn on 30 June 2004. In addition, no proceedings for outstanding fees were instituted. In that way the bank obtained a considerable advantage, and an unfair advantage as well, given the conclusions reached. By sitting tight the bank was securing for itself all the advantages that it might have gained by bringing an action were the claims good ones.",
        "Inquiry as to compensation": "",
        "The claim for difference in interest rates": "11        The inquiry for damageswas held before the AR. The appellants and HSK sought compensation on two main heads of claims. The first was for the difference between the higher rates of interest that the appellants and HSK had continued to pay to the former lenders and the lower rates of interest which, but for the caveats on the three properties, they would have enjoyed under the new refinancing offers from financial institutions. This claim also included legal costs incurred in the abortive refinancing. The AR disallowed the claim for the interest differential in respect of 77 Syed Alwi Road for lack of evidence that the appellants had approached other lenders for refinancing. However, he allowed in part the claims in respect of 150 Braddell Road (at 40% of the claim) and 26F Poh Huat Road (at 60% of the claim). On appeal to the High Court, the judge increased the awards to 80% and 100% respectively. The AR’s decision in respect of the 77 Syed Alwi Road claim was not appealed against. The judge’s decision in respect of this first head of claim is also not being appealed against in the present appeal.",
        "The claim for loss arising from sale of 179 Syed Alwi Road": "12        This appeal concerns the second head of claim. Under this head, the appellants have claimed compensation for pecuniary loss arising from the mortgagee sale of 179 Syed Alwi Road at the price of $9.3m. The appellants’ case is that but for the respondent’s obstruction of the refinancing of 26F Poh Huat Road by its refusal or failure to withdraw its caveat, the property could have been sold at its open market value of $10.5m, and as a result the appellants have suffered a loss of $1.2m. The appellants have produced evidence showing that Hong Leong Singapore Finance Ltd (“HLF”) had on 26 August 2002 offered them a loan facility of up to $400,000 on the security of 26F Poh Huat Road, and that HLF cancelled the offer only on 23 February 2004. Additionally, the appellants also claimed sale expenses of $163,054.50 and legal costs of $7,482.50 in contesting the mortgagee sale by BEA. 13        The AR disallowed this head of claim for compensation on the ground that the alleged losses resulting from the forced sale of 179 Syed Alwi Road were too remote. On appeal, the judge held that in order to recover compensation for losses under s 128(1) of the LTA, the appellants must show that such losses were attributable to the respondent’s wrongful refusal or failure to withdraw its caveat against 26F Poh Huat Road. This, he further held, depended on the answers to two questions, namely: (a) whether it was foreseeable to the respondent that its refusal or failure to withdraw the caveat would result in BEA exercising its power of sale with respect to 179 Syed Alwi Road; and (b) if so, whether, on the facts such alleged losses were caused, as a matter of law, by the appellants’ own impecuniosity in being unable to service or redeem the mortgage loan rather than by the respondent’s refusal to withdraw the caveat on 26F Poh Huat Road. Foreseeability test 14        On the question of whether it was foreseeable to the respondent that 179 Syed Alwi Road would be sold in a mortgagee sale, the judge held that nothing short of actual knowledge would be sufficient. Applying this test, the judge held that the appellants had to show that the respondent had actual knowledge that its refusal or failure to withdraw the caveat against 26F Poh Huat Road would lead to the forced sale of 179 Syed Alwi Road: see [32] ofHo Soo Fong v Standard Chartered Bank[2006] 3 SLR 263.This meant that the appellants had to show that they had provided sufficient information to the respondent of the sale or the imminence of such sale if the respondent did not withdraw the caveat against 26F Poh Huat Road. 15        Before the AR and the judge, the appellants accepted that they had to show actual knowledge on the part of the respondent. However, they contended that the respondent did have actual knowledge by reason of them having informed the respondent’s officers at two separate events that the purpose of refinancing 26F Poh Huat Road was to service the mortgage loan on 179 Syed Alwi Road: (a)        the first was at a meeting between the first appellant and the respondent’s solicitor, James Tan, in July or August 2002; and (b)        the second was a telephone discussion between the first appellant and Diana Tan on 22 October 2002. The appellants did not keep records of these two events, but argued that what had transpired at the two events could be corroborated if the court were to draw adverse inferences against the respondent in the light of two incidents: (i)         Diana Tan falsely testifying (as found by the AR) that she had not been told about 179 Syed Alwi Road around March 2001. (ii)        The destruction by the respondent of its credit approval files relating to the appellants in August 2003 when the dispute on the appellants’ liability for the cancellation fees had already arisen. The credit approval files, as admitted by the respondent, would contain information on the purpose of any loan, as this was a standard requirement of the respondent for the purpose of credit evaluation of the borrower. 16        The judge affirmed the AR’s finding that the respondent did not have the requisite actual knowledge. He also agreed with the AR’s finding that Diana Tan’s false testimony did not relate to the requisite actual knowledge concerning 179 Syed Alwi Road. The judge also declined to draw an adverse inference of knowledge against the respondent in destroying the credit approval files on the ground that the appellants had conceded that the most that the files could have shown was that the loan to be given on 26F Poh Huat Road would be used for servicing the interest payable in respect of the 179 Syed Alwi Road overdraft, and not that BEA would have sold the property if there had been a failure to reduce the overdraft amount. The judge held, in effect, that the requisite actual knowledge must relate to the very ultimate cause or kind of the appellants’ loss. 17        We should mention that there was other evidence on which the judge concluded that the respondent did not have the requisite actual knowledge. The evidence that weighed most heavily in the judge’s evaluation of the evidence was that the appellants’ letters to the respondent during the period immediately prior to the forced sale of 179 Syed Alwi Road made no mention of the need to refinance 26F Poh Huat Road in order to prevent the sale of 179 Syed Alwi Road or that the mortgagee had threatened to sell the property or that if the caveat were not withdrawn, it would result in a forced sale. The appellants had argued that they did not do this because they did not want the respondent to know about its precarious financial condition, but the judge found that the appellants should not have been so constrained since there was no possibility of the respondent reviving the loan facility. In the result, the judge found that the appellants’ alleged losses arising from the forced sale of 179 Syed Alwi Road were not attributable to the respondent’s refusal to withdraw the caveat and were not recoverable under s 128(1) of the LTA as these losses were not foreseeable to the respondent. Causation – impecuniosity 18        The judge also decided, in the alternative, that he would still deny recovery of any losses suffered by the appellants from the forced sale of 179 Syed Alwi Road by reason of theLiesboschprinciple established inOwners of Dredger Liesbosch v Owners of Steamship Edison[1933] AC 449 (“The Liesbosch”). By this principle, a defendant is not liable, as a matter of law, for any pecuniary loss suffered by the plaintiff if such loss is caused by the plaintiff’s lack of financial resources. Although the judge was aware that the House of Lords case ofLagden v O’Connor[2004] 1 AC 1067 (“Lagden”) has effectively overruledThe Liesbosch, he held that he was bound by theLiesboschprinciple as it had been applied by this court inKhushvinder Singh Chopra v Mookka Pillai Rajagopal[1999] 1 SLR 589(“Khushvinder Singh”).",
        "The appeal": "",
        "Preliminary observations": "19        Before we consider the substantive issues in this appeal, we would first dispose of two preliminary points. Counsel for the respondent has submitted that this court should not set aside findings of fact of the lower court unless we were satisfied that they are plainly wrong or against the weight of the evidence: seeSeah Ting Soon trading as Sing Meng Co Wooden Cases Factory v Indonesian Tractors Co Pte Ltd[2001] 1 SLR 521.It was submitted that a finding on foreseeability is a finding of fact. Similarly, it was submitted that we should not disturb the judge’s decision not to draw any adverse inference from the respondent’s destruction of the appellants’ credit approval files. 20        It is well established that a distinction must be drawn between the perception of facts and the evaluation of facts:Tithes Dental & Photo Supply Sdn Bhd v Empresa Lineas Maritimes Argentinas[1977] 2 MLJ 13.In our view, foreseeability as a factual element in determining remoteness of damage in tort is an inferential fact from other primary facts. For this reason, an appellate court is in as good a position as the trial court to make its own evaluation from the primary facts: seePresident, District Council, Batu Pahat v Lo Hong Tan[1983] 1 MLJ 299andThe Andres Bonifacio[1993] 3 SLR 521, where this court held at 532, [46] that the same principles applied when it came to evaluating affidavit evidence. 21        The second preliminary point relates to the relevant act of the respondent under s 128(1) of the LTA which caused the appellants’ losses. It may be recalled that in the earlier suit Belinda Ang J held that the respondent had lodged the caveat against 26F Poh Huat Road wrongfully or without reasonable cause since it did not have a caveatable interest against the property. We should also highlight that the respondent’s refusal or failure to withdraw the caveat when requested to do so by the appellants was also wrongful or without reasonable cause. The respondent had committed two separate breaches of s 128(1) of the LTA. It is clear that it was not the respondent’s lodgment of the caveat but its refusal or failure to withdraw the caveat that had caused the losses alleged by the appellants.",
        "Issues raised on appeal": "22        Before us, counsel for the appellants accepted that, in order to succeed in their appeal, they must satisfy the two requirements of foreseeability and causation. The appellants must show that it was foreseeable to the respondent that its refusal or failure to withdraw the caveat on 26F Poh Huat Road would lead to the appellants’ alleged losses from the forced sale of 179 Syed Alwi Road, and they must show that these losses were in turn caused by the respondent’s refusal or failure to withdraw the caveat. We agree with counsel but we would add a third requirement for the appellants to succeed, and that is that a claimant under s 128(1) of the LTA has a duty to mitigate his loss and must take reasonable steps to do so.",
        "Section 128(1) of the Land Titles Act": "23        We now consider the scope of s 128(1) of the LTA which provides as follows: Any person who wrongfully, vexatiously or without reasonable cause — (a)        lodges a caveat with the Registrar; (b)        … ; or (c)        being the caveator, refuses or fails to withdraw such a caveat after being requested to do so, shall be liable to pay compensation to any person who sustains pecuniary loss that is attributable to an act, refusal or failure referred to in paragraph (a), (b) or (c).",
        "“Attributable”": "24        It should be highlighted that s 128(1) of the LTA uses the word “attributable” to connect the pecuniary loss which is compensable to any of the acts referred to therein. It is therefore necessary to examine the meaning of “attributable” to determine whether the appellants’ alleged loss was attributable to the respondent’s refusal to withdraw the caveat against 26F Poh Huat Road. InLee v Ross (No 2)[2003] NSWSC 507, the New South Wales Supreme Court had to consider the meaning of “attributable” in s 74P(1) of the Real Property Act 1900 (NSW) (“the NSW Act”), a provision which is similar to s 128(1) of the LTA. Section 74P(1), in so far as it is relevant, provides: Any person who, without reasonable cause ... lodges a caveat with the Registrar-General under [Pt 7A of the Act] ... is liable to pay to any person who sustains pecuniary loss that is attributable to [the lodgment of the caveat] ... compensation with respect to that loss. 25        Palmer J held that a “practical commonsense approach” to the identification ofcompensable loss “attributable” to the wrongful lodgment of a caveat is what is required under s 74P(1) of the NSW Act. He explained at [40] of his judgment: I do not think it is necessary to show that the precise loss suffered by an owner of land as a consequence of the wrongful lodgement of a caveat is known to or foreseeable by the caveator at the time of lodgement. So to hold would be to introduce into the statutory remedy afforded by s 74P(1) notions of causation and loss which are highly developed in the law of tort and contract. The section itself does not use words which invoke or suggest those notions: it seems deliberately to avoid the use of the words “caused by” and uses, instead, the more general word “attributable”. Palmer J further explained at [42] of his judgment what is required under this “commonsense approach”: In my view, when a purchaser places a caveat on the title to property in such a case, the purchaser accepts the risk of liability to compensate the vendor for whatever loss can realistically be shown to be attributable to a wrongful lodging of the caveat, whether or not the purchaser knows what that loss is likely to be. Causation 26        We agree with Palmer J that there is a need to attach significance to the legislature’s use of the word “attributable” in s 74P(1) of the NSW Act and, similarly, in s 128(1) of the LTA. But we do not think that Palmer J in the two passages we have quoted was saying that causation is not a requirement under s 74P(1); only foreseeability might not be a requirement. In our view, a consequence or an effect cannot be attributed to an act or omission in terms of s 128(1) of the LTA unless there is a causal connection between the two elements. The word “attributable” has been judicially interpreted in English cases.InWalsh v Rother District Council[1978] 1 All ER 510, in deciding whether the applicant’sloss of employment was “attributable to” the provisions of the Local Government Act 1972 under the Local Government (Compensation) Regulations 1974 Reg 4(1), Donaldson J in the English High Court held that“attributable” means capable of being attributed, the essential element of which is connection of some kind. Further, this connection need not be that of a sole, dominant, direct or proximate cause and effect. A contributory causal connection is quite sufficient. In that case,loss of employment is “attributable to” the provisions of the Local Government Act 1972 only if there is some causal connection between those provisions and the loss of employment. The decision was upheld on appeal to the English Court of Appeal. 27        InCentral Asbestos Co Ltd v Dodd[1973] AC 518, where the issue was,inter alia, whether the injuries in question were “attributable” to negligence, Lord Reid held at 533 that: [“Attributable”] means capable of being attributed. “Attribute” has a numberof cognate meanings; you can attribute a quality to a person or thing, you can attribute a product to a source or author, or you can attribute an effect to a cause. The essential element is connection of some kind. In the same case, at 543, Lord Pearson defines “attributable” to mean: TheOxford English Dictionary(1888) vol. I, p. 556 says that “Attributable” means “Capable of being attributed or ascribed, especially as owing to, produced by,” and, as one of the meanings of the verb “Attribute,” gives “To ascribe, impute, or refer, as an effect to the cause; to reckon as a consequence of.” Thus “attributable to” refers to causation, but it has to cover cases of dual or multiple causation and perhaps another element of responsibility in the case of contributory negligence. Foreseeability 28        However, with respect to foreseeability, we are not of the view that the use of the word “attributable” in s 128(1) of the LTA has removed the need for foreseeability to determine whether a particular loss is compensable. In our view, such an approach could lead to what Cardozo CJ (inUltramares Corp v Touche, Niven & Co255 NY 170, 174 NE 441 (1931)) feared,ie, the imposition of “liability in an indeterminate amount for an indeterminate time to an indeterminate class”. In this respect, we agree with Chao J (as he then was) inMooka Pillai Rajagopal v Khushvinder Singh Chopra[1998] 1 SLR 186(“Mooka Pillai”), where he said at [9]: Section 128(1) does not elaborate what is “pecuniary loss attributable to (the caveat)”. No case has been cited to me which touched on these words of the section. The ordinary literal meaning of the word “attribute”, as a verb, is “caused or brought about by” …The legislature could not have intended to make a caveatee[sic]liable for all consequences that may be said to flow from a caveat, no matter how remote or unforeseen those consequences may be.[emphasis added] In our view, the foreseeability test should apply to limit the losses which can be claimed under s 128(1) of the LTA. 29        On this basis, we will now proceed to consider the following issues in this appeal: (a)        whether it was reasonably foreseeable to a reasonable bank in the respondent’s position that its refusal or failure to withdraw the caveat lodged against 26F Poh Huat Road would have led to the forced sale of 179 Syed Alwi Road; (b)        whether the appellants’ losses arising from the forced sale of 179 Syed Alwi Road were caused by the respondent’s refusal or failure to withdraw the said caveat; and (c)        whether, if issues (a) and (b) are answered in the positive, the appellants had taken reasonable steps to mitigate their losses.",
        "The requirement of reasonable foreseeability": "30        InMooka Pillai,the owners of a property (“the Owners”) made a claim for compensation under s 128(1) of the LTA against the caveator (“KS”) for wrongfully refusing to withdraw a caveat he had lodged against their property. The Owners claimed compensation under four heads of losses. Chao J held that the losses under three heads could not be attributed to the wrongful act of KS as they were not foreseeable, but one head of loss relating to payment of additional interest on a mortgage loan was foreseeable. These payments were necessitated by the delay in completing the sale of the property as a result of KS wrongfully refusing to remove his caveat against the property. In so determining, Chao J applied the foreseeability test and cited with approval the decisions inJones v Fabbi(1973) 37 DLR (3d) 27 andCompania Financiera “Soleada” SA v Hamoor Tanker Corp Inc (The Boraq)[1981] 1 WLR 274.Chao J held that the payment of the additional interest by the Owners was foreseeable because KS knew or ought to have been aware of the existence of the mortgage as he had acted for the Owners in the execution of the mortgage. 31        InMooka Pillai,KS had also argued that the additional interest could not be claimed under theLiesboschprinciple as the Owners could have avoided paying the additional interest if they had the financial means to redeem the mortgaged property. Hence, such additional interest was caused by the Owners’ own impecuniosity and not by the delay in completion because of the caveat. Chao J declined to applyThe Liesbosch,holding that it merely laid down the principle that any special loss suffered by the plaintiff due to his financial position was too remote. He said at [20]: In applying the principles enunciated in [TheLiesbosch] while we must not lose sight of this very important point made by Lord Wright – “the law cannot take account of everything that follows from a wrongful act”, Lord Wright in no way suggested that the law takes account of no consequences. Indeed, he recognised that some consequences have to be taken into account. All he seemed to say is that the law must draw a line somewhere. 32        KS appealed against Chao J’s judgment. This court, inKhushvinder Singh, endorsed Chao J’s application of the foreseeability test and upheld his finding in relation to the payment of additional interest. However, this court held, disagreeing with Chao J, that the loss was not recoverable because it fell within theLiesboschprinciple. In the present appeal, counsel for the appellants has urged this court to overrule its application of theLiesboschprinciple on the ground that it has been overruled by the House of Lords inLagdenand has also been rejected by other Commonwealth courts and legal scholars. We will address this argument later after we have considered the nature of the respondent’s refusal or failure to withdraw the caveat and how the foreseeability test should be applied in a claim for compensation under s 128(1) of the LTA for such a refusal or failure.",
        "When is the reasonable foreseeability test applicable?": "33        In his book,The Singapore Torrens System(Government of the State of Singapore, 1961) (“The Singapore Torrens System”), Baalman suggested that the act, refusal or failure referred to in s 101(1) of the Land Titles Ordinance 1956 (now s 128(1) of the LTA) might be regarded as a new statutory tort. Chao J accepted this classification inMooka Pillai. We agree that this is an apt description. But, in our view, this tort issui generisbecause it has a chameleon nature in being an intentional tort which may not necessarily entail all the ordinary consequences of intentional torts in terms of compensation payable to the injured party. It may result in different legal consequences depending on the manner, reason or motive for its commission. The tort can be committed wrongfully, vexatiously or without reasonable cause but, by its nature, it can only be committedintentionally, although it may be committed under a mistake of law in that the caveator might have lodged the caveat in the mistaken belief that he was entitled to do it to protect his interest in the property. However, it may also have been done with full knowledge of the absence of legal rights for an extraneous purpose or with an improper motive. 34        In our view, the word “wrongfully” in s 128(1) of the LTA should only cover a tort which is done with an improper motive or an extraneous purpose, for example, where the caveator lodged the caveat deliberately in an attempt to infringe the rights of the caveatee, as the New South Wales Court of Appeal held inBeca Developments Pty Ltd v Idameneo (No 92) Pty Ltd(1990) 21 NSWLR 459 (“Beca Developments”) when it interpreted s 74P(1) of the NSW Act before it was amended in 1996. 35In saying this, we are mindful that the Singapore courts have taken what Tan Sook Yee inPrinciples of Singapore Land Law(Butterworths Asia, 2nd Ed, 2001) has termed the “wide construction” of the word “wrongfully”,iewhere there is no caveatable interest but without an improper motive: seeTan Soo Leng David v Wee, Satku, & Kumar Pte Ltd[1993] 3 SLR 569andEng Bee Properties Pte Ltd v Lee Foong Fatt[1993] 3 SLR 837.Nonetheless, as Tan notes inPrinciples of Singapore Land Lawat p 299, a wide construction of “wrongfully” could deter a person who honestly believes that he has reasonable grounds for lodging a caveat from doing so. In this connection, a wide construction would render the expression “without reasonable cause” otiose. In our view, the expression “without reasonable cause” wouldprima faciesuggest the absence of an improper motive; as the Australian courts have held, this expression means where the caveator has no honest belief based on reasonable grounds that he has a caveatable interest: see for exampleBeca Developments. Thus, to illustrate, the lack of an interestsimpliciterto support the caveat does not mean that it was lodged “without reasonable cause”; the issue is whether the caveator lodged the caveat without an honest belief based on reasonable grounds that a caveatable interest exists. A wide construction of “wrongfully” would render the honest belief of the caveator and, correspondingly, the expression “without reasonable cause” irrelevant in that the mere fact the caveator had no caveatable interest renders him liable to compensation. Given that the words “wrongfully”, “vexatiously” and “without reasonable cause” in s 128(1) of the LTA are to be read disjunctively, an interpretation of “wrongfully” which renders otiose an accompanying expression is undesirable. Therefore, we are of the view that the word “wrongfully”, in the context of s 128(1) of the LTA, must mean that the caveator committed the tort deliberately in an attempt to infringe the rights of the caveatee. 36        Finally, the word “vexatiously” would imply an improper motive. In our view, “vexatiously” means having the objective of wishing to annoy or not intending to lead to a serious result: seeGoh Koon Suan v Heng Gek Kiau[1990] SLR 1251.Further, s 127(2) of the LTA allows a caveatee who contends that a caveat has been lodged or is being allowed to remain,inter alia, vexatiously, to lodge with the Registrar of Titles a statutory declaration to that effect. This is a simpler method of removing the caveat than by court order. As BaalmansuggestedinThe Singapore Torrens Systemat p 208, referring to the predecessor provision of s 127(2), this remedy is directed primarily against eccentric individuals whose claim to land is only imaginary. Thus, the Registrar of Titles should not cancel a caveat where there is even a semblance of good faith on the part of the caveator; that is a matter for the court.In our view, this suggests that the word “vexatiously” implies that the lodgment of the caveat was utterly groundless and would clearly have no prospect of withstanding a challenge to cancel it. 37        InMooka Pillai,Khushvinder Singhand in the present case, the courts have proceeded in applying the foreseeability test on the basis that the tort complained of was done without an improper motive or under a mistaken belief or view by the caveators of their rights. The courts did not have to make a distinction between the tort done with or without an improper motive, nor did they make a distinction between the words “wrongfully” and “without reasonable cause”. We highlight this point because where the tort is done with an improper motive, it might be analogous to the tort of malicious prosecution, as suggested by Baalman. However, whether the reasonable foreseeability test should apply to determine whether a loss is too remote in such a case has yet to be decided by the courts. In this connection, we would note that inSmith New Court Securities Ltd v Citibank NA[1997] AC 254 at 279, Lord Steyn said that “[t]he exclusion of heads of loss in the law of negligence, which reflects considerations of legal policy, does not necessarily avail the intentional wrongdoer”. 38        In this appeal, this court has not been asked to determine this issue and as no arguments have been made to us, we will leave it to be decided by a court in the future. Nevertheless, we ought to point out that if the issue had been raised by the appellants in this case, we might well have found that the respondent acted with an improper motive in obdurately refusing to withdraw the three caveats in order to put pressure on the appellants and HSK to pay cancellation fees since the liability to pay the fees did not, by itself, create a caveatable interest in the properties. There was ample evidence on record that the respondent had taken advantage of its dominant financial position and had acted very high-handedly towards the appellants and HSK. Adopting the interpretation of s 128(1) of the LTA above, the respondent’s refusal or failure to withdraw the caveats would not merely have been “without reasonable cause”; it would have been done “wrongfully”. For the same reasons, the respondent’s conduct may also have been vexatious as it caused annoyance, and more, to the appellants.In other words, the respondent’s tortious act in the present case might have been sufficiently egregious to come within the categories which imply an improper motive on its part.However, we would clarify that our observations in this regard should not be taken to disturb Belinda Ang J’s finding of liability on the respondent’s part inHo Soo Fong v Standard Chartered Bank[2005] 1 SLR 316as her decision is not the subject of this appeal.",
        "Tort principles of remoteness": "39        Chao J, in using the language of remoteness inMooka Pillai, had in mind the tort principles of remoteness as laid down inOverseas Tankship (UK) Ltd v Morts Dock & Engineering Co Ltd (The Wagon Mound)[1961] AC 388 (“The Wagon Mound”). There, the Privy Council confirmed that the test of remoteness for most torts is that the damage has to be of such a kind as the reasonable man should have foreseen. InOverseas Tankship (UK) Ltd v The Miller Steamship Co Pty[1967] 1 AC 617, Lord Reid clarified that what was required was whether a reasonable man would foresee a “real risk” of the damage occurring. There would be a real risk if it was one that would occur to the mind of a reasonable man in the position of the defendant, and which would not be brushed aside as being far-fetched. These principles have been accepted in Singapore: seeFong Maun Yee v Yoong Weng Ho Robert[1997] 2 SLR 297at [53]. 40        The legal position in Malaysia appears to be the same. InQuill Construction Sdn Bhd v Tan Hor Teng @ Tan Tien Chi[2003] 6 MLJ 279,Abdul Malik Ishak J held that damages under s 329(1) of the Malaysian National Land Code 1965 (corresponding to s 128(1) of the LTA) for the improper lodgment of a caveat must be assessed in accordance with the principles of the law of tort, that is, damage will not be too remote if it is of such a kind as the reasonable man should have foreseen. Abdul Malik Ishak J referred to his own judgment inLo Foi v Lee Ah Hong @ Lee Lum Sow[1997] MLJU 310, where he had said: It is now trite law that compensation can only be awarded for damages which is foreseeable. It must be borne in mind that damages per se cannot be ordered for all the direct consequences of a wrongful act. The ‘direct consequences’ approach expounded in Re Polemis (1921) 3 KB 560 was overruled by the Judicial Committee of the Privy Council inOverseas Tankships (UK) Ltd v Morts Dock and Engineering Co Ltd(The Wagon Mound)[1961] AC 388 in favour of the now famous ‘foreseeable damage’ approach. ... In my judgment, damages under s 329(1) of the NLC must be assessed in accordance with the principles of the law of torts — that would be the ‘reasonable foreseeability’ test. We respectfully agree with Abdul Malik Ishak J and hold that the same principles apply in relation to s 128(1) of the LTA in cases where the tort is committed without an improper motive.",
        "Were losses relating to 179 Syed Alwi Road reasonably foreseeable?": "41        We will now consider whether, applying the reasonable foreseeability test, the respondent, with the knowledge that it had concerning the financial condition of the appellants, had or ought to have foreseen that 179 Syed Alwi Road would be sold by BEA if the appellants could not obtain refinancing on 26F Poh Huat Road in a timely manner as a result of its refusal or failure to withdraw its caveat. It may be recalled that in the present case, the judge held that since the respondent did not have actual knowledge that its refusal to withdraw the caveat on 26F Poh Huat Road would have led to the forced sale of 179 Syed Alwi Road by BEA, it could not be said that the forced sale was foreseeable to the respondent. 42        With respect, we do not agree that the reasonable foreseeability test requires the tortfeasor to have actual knowledge of the ultimate cause or kind of the losses suffered by a claimant. No authority has been cited to us, and the judge has referred to none, that foreseeability as a factual element requires actual knowledge of the specific cause or kind of the loss. This approach is contrary to current jurisprudence on remoteness of damage in tort law. In our view, constructive knowledge of the kind of losses suffered is sufficient to satisfy the foreseeability test of remoteness of damage. This may be contrasted with the corresponding test of remoteness in contract, where actual knowledge is required but, even then, only for extraordinary as opposed to ordinary loss: seeHadley v Baxendale(1854) 9 Ex 341. InMooka Pillai, although Chao J might have found actual knowledge on the part of KS, he referred to the broader principle that it was only necessary that the defendantoughtto have known of the losses which would have resulted from the wrongful act. 43        In our view, in the present case, the reasonable foreseeability test requires the appellants to show no more than that a reasonable bank, with the knowledge that the respondent possessed at the material time, would have reasonably foreseen that if the appellants were prevented from refinancing the loans on their properties as a result of its refusal or failure to withdraw the caveat on 26F Poh Huat Road, the appellants would lose one or more of them as a result of enforcement action by one or more of the mortgagees concerned. Respondent’s knowledge of appellants’ financial condition 44        What was the state of knowledge of the respondent concerning the financial condition of the appellants and HSK during the material period between 7 October 2002 (the date of cancellation of the loan facilities) and 16 October 2003 (the date of the sale of 179 Syed Alwi Road)? The evidence is that the respondent knew that (a) the appellants and HSK needed refinancing of four properties,viz, 150 Braddell Road, 77 Syed Alwi Road, 26F Poh Huat Road and 179 Syed Alwi Road; (b) they were also heavily indebted in respect of 179 Syed Alwi Road in an amount of not less than $5m; and (c) they could have raised an amount of not less than $647,000 on the security of 26F Poh Huat Road (since that was the amount the respondent had agreed to lend on that property). With this knowledge, a reasonable bank in the respondent’s position ought to have known that all the existing loans were accruing interest at rates which were higher than current rates, and that there was a high probability that if the appellants and HSK could not obtain refinancing in a timely manner, the mortgagees might well take action to sell the properties to recover their loans. 45        We next consider the state of knowledge of the respondent concerning the likelihood or imminence of a mortgagee’s sale with respect to any of the four properties. First, the first appellant notified the respondent by a letter dated 21 October 2002 that “[a]ny delay to withdraw the [three] caveat properties [sic] by [the respondent] [would] affected [sic] [the appellants’ and HSK’s] other bank approved loan [sic].” Secondly, the appellants’ solicitors wrote to the respondent’s solicitors on 8 May 2003 to “put [the respondent] on notice that [the appellants] have obtained approval for re-financing from another bank and these re-financing would be stalled and affected by the continued presence of the caveats.” Two months later, on 22 July 2003, the appellants’ solicitors again notified the respondent’s solicitors that “[a]ny delay or refusal on [the respondent’s] part in removing the caveats may cause [the appellants] to lose their properties as [the appellants’] mortgages [sic] have taken or are contemplating legal action to recover possession of the same from [the appellants]”. 46        In our view, a reasonable bank in the position of the respondent, having been so warned, must or should have known that the appellants and HSK would not have sought legal advice and given warnings through lawyers unless there was some urgency in the matter. The tone and meaning of these notifications could not be any clearer. The respondent ignored all these notices. In the circumstances, we are of the view that it was reasonably foreseeable that one or more of the appellants’ mortgaged properties would be sold by the mortgagees. As it turned out, 179 Syed Alwi Road was sold in a mortgagee sale on 16 October 2003. The respondent might argue that since none of the notices mentioned 179 Syed Alwi Road, it could not be said that it ought to have known about the possible sale of that property. In our view, the warnings went beyond the properties specifically mentioned in the said notices as they were concerned with the mortgagee banks taking action againsttheir propertiesand the respondent knew that 179 Syed Alwi Road was heavily mortgaged in an amount exceeding $5m. Adverse inference from destruction of credit approval files 47        The appellants have argued before us that if the court had drawn adverse inferences against the respondent for destroying the credit approval files and on account of Diana Tan having given false testimony in court concerning her knowledge of the mortgage on 179 Syed Alwi Road, the respondent would have been found to have had actual knowledge that the purpose of the loan facility for 26F Poh Huat Road was to service the interest accruing on the mortgage loan secured by 179 Syed Alwi Road. In view of our findings on the constructive knowledge of the respondent with respect to the sale of 179 Syed Alwi Road, we do not propose to address this submission. However, we wish to observe that it would be difficult for any court to draw an adverse inference against the respondent for the destruction of the credit approval files since they were destroyedbeforeit had knowledge of the sale of 179 Syed Alwi Road. In our view, unless it could be shown that the respondent had destroyed the files in order to destroy material evidence contained in them, no adverse inference could be drawn.",
        "What caused the forced sale of 179 Syed Alwi Road?": "48        As we mentioned earlier, the appellants would also need to succeed on the issue of causation in order to succeed in their appeal. We start with the respondent’s argument that it was the appellants’ own impecuniosity which caused their losses. 49        In the trial below, the judge held, at [33] of his grounds of decision: [I]t would not be necessary to consider the remaining question,viz, whetheras amatter of law thecauseof the appellants’ loss was their own impecuniosity rather than the respondent’s wrongful refusal to remove the caveat. Nevertheless, he went on to state that on the evidence he was bound by this court’s decision inKhushvinder Singh(which had applied theLiesboschprinciple) to reject the appellants’ claim on the ground that the appellants’ loss was caused by their own impecuniosity and not by the respondent’s refusal or failure to withdraw the caveats. Before us, counsel for the appellants has submitted that theLiesboschprinciple has now been rejected by the English and Commonwealth courts and that this court should follow suit and depart fromKhushvinder Singh. As it is a serious matter for this court to depart from or effectively overrule its own previous decision, we will need to consider the submission with the utmost care. Khushvinder Singhand theLiesboschprinciple 50        InKhushvinder Singh,this court reversed Chao J’s decision inMooka Pillaithat KS was liable to the Owners for the payment of additional interest, holding that the loss came within theLiesboschprinciple. At [16], this Court said: [T]he true question is whether the presence of the appellant’s caveats on the property had impeded or hindered in any way the respondents from either redeeming the property or paying any interest on the outstanding amount owing on the loan.The respondents were at liberty to make such payment at such time and in such manner as they deemed fit. The presence of the caveats would also not impede or hinder in any way the mortgagee from enforcing the mortgage by the exercise of the power of sale or otherwise. [emphasis added] With respect, this reasoning is unconvincing, because it assumed that the Owners had other funds to redeem the mortgage in order not to incur the additional interest. The application of theLiesboschprinciple on the facts inMooka Pillaidid not make good sense for the reason that but for the presence of the caveat, the Owners would have been able to complete the sale of the property earlier and to use the proceeds to repay their debt earlier. The legal possibility that the mortgagee could have enforced the sale in that case was irrelevant because the claim was not against the mortgagee but KS and in any case the mortgagee had taken no steps to enforce the sale. The Owners were not impecunious: they had an illiquid asset which they could not convert into cash because of KS’s caveat. 51        In any case, this court made another finding of fact which rendered irrelevant the application of theLiesboschprinciple: it concluded that there was no loss at all. At [25] of the judgment, this court said: In any event, the respondents had not really incurred any loss arising from the additional interest they had to pay on the loan secured by the mortgage.Whatever interest they had paid on the loan by reason of the delay in the completion caused by the appellant’s caveats on the property was amply compensated by the benefit they had in having their property throughout this period.If, at the time, the property had been rented out, the rental would have had more than compensated them for the interest they had to pay on the loan during this period. On the other hand, if the property had not been rented out, they would have had the benefit of the use and occupation the property and such benefit converted into notional rent would again have had more than compensated them for the interest they had to pay. [emphasis added] 52        Nevertheless, since this court did apply theLiesboschprinciple inKhushvinder Singh,it is necessary for us to deal with the submission of the appellants that we should reject theLiesboschprinciple and overruleKhushvinder Singh. TheLiesboschprinciple 53        InThe Liesbosch, the vesselEdisoncaused the sinking of the dredgerLiesboschat Patras Harbour in the Hellenic Republic. Liability was admitted by the owners ofEdison. The owners of theLiesboschhad a contract with the Patras Harbour Commissioner for some construction work in the harbour, and theLiesboschwas needed for that purpose. Under that construction contract, damages were payable for delay. The owners of theLiesbosch, being short of funds, could not buy a substitute dredger and instead hired one, theAdria. TheAdriawas more expensive to operate than theLiesbosch. Later, the Patras Harbour Commission bought theAdriafrom its owner and resold it to the owners ofLiesboschat cost, payable in instalments, with interest. In a claim for damages owing by the owners of theEdisonto the owners of theLiesbosch, the House of Lords held that the measure of damages was the value of theLiesboschto her owners as a profit-earning dredger at the time and place of her loss and would include a capital sum made up of (a) the market price on the date of accident of a comparable dredger; (b) the cost of adapting the new dredger and of transporting and insuring her from her moorings to Patras; and (c) compensation for disturbance and loss suffered by the owners of theLiesboschin carrying out their contract during the period from the date of the accident to the date on which theAdriacould reasonably have been available for use at Patras, including such items as overhead charges and expenses of staff and equipment, but excluding any special loss or extra expense due to the financial position of one or other of the parties. In his speech, Lord Wright in rejecting this claim said at 460: I think it desirable to examine the claim made by the appellants, which found favour with the Registrar and Langton J., and which in effect is that all their circumstances, in particular their want of means, must be taken into account and hence the damages must be based on their actual loss, provided only that, as the Registrar and the judge have found, they acted reasonably in the unfortunate predicament in which they were placed, even though but for their financial embarrassment they could have replaced theLiesboschat a moderate price and with comparatively short delay. In my judgment the appellants are not entitled to recover damages on this basis. The respondents’ tortious act involved the physical loss of the dredger; that loss must somehow be reduced to terms of money.But the appellants’ actual loss in so far as it was due to their impecuniosity arose from that impecuniosity as a separate and concurrent cause, extraneous to and distinct in character from the tort; the impecuniosity was not traceable to the respondents’ acts, and in my opinion was outside the legal purview of the consequences of these acts. The law cannot take account of everything that follows a wrongful act; it regards some subsequent matters as outside the scope of its selection, because “it were infinite for the law to judge the cause of causes,” or consequences of consequences. Thus the loss of a ship by collision due to the other vessel’s sole fault, may force the shipowner into bankruptcy and that again may involve his family in suffering, loss of education or opportunities in life, but no such loss could be recovered from the wrongdoer. In the varied web of affairs, the law must abstract some consequences as relevant not perhaps on grounds of pure logic but simply for practical reasons.” [emphasis added] 54        Ever sinceThe Liesboschwas decided, judges and legal scholars have criticised it on two main grounds: its inconsistency with the general tort principle that a tortfeasor must take his victimtalem qualemand its diminished utility in light of the reasonable foreseeability test as it later developed in tort law. As a result, its authority as a binding precedent on the English courts has been whittled down over the years. Lord Denning simply ignored it whenever he considered the loss not to be remote: seeMuhammad Issa El Sheikh Ahmad v Ali[1947] AC 414 andTrans Trust SPRL v Danubian Trading Co Ld[1952] 2 QB 297.It was also ignored inAlcoa Minerals of Jamaica Inc v Herbert Boderick[2002] 1 AC 371, which applied the modern test of whether the loss was reasonably foreseeable. As Andrew Tettenborn put it in “Compensating the Cash-Strapped: The Sinking of the Liesbosch”[2004] LMCLQ 135at p 136, “for at least the last 30 yearsThe Liesboschhas been … often cited, rarely approved, and frequently distinguished – adroitly or otherwise.” Inconsistency with thetalem qualemprinciple 55Andrew Burrows inRemedies for Tort and Breach of Contract(Oxford University Press, 3rd Ed, 2004) at p 144 has also noted that by applying the normal principles of causation to the facts ofThe Liesbosch, the loss from impecuniosity should have been recoverable as a wrongdoer must take his victimtalem qualem, as expressed by Lord Collins inTheClippens Oil Co Ltd v The Edinburgh and District Water Trustees[1907] AC 291 (“Clippens Oil”) at 303. InThe Liesbosch, Lord Wright attempted to distinguish Lord Collins’dictumby saying that that principle was not in point as Lord Collins was dealing not with the measure of damages but with mitigation. However, as Lord Hope inLagdenheld at [51], this is “a distinction without a difference”. Burrows has also noted inRemedies for Tort and Breach of Contractat p 145 that it is “mystifying” how Lord Wright could regard the whole issue as being treated differently if viewed in terms of the duty to mitigate. 56        The problem with theLiesboschprinciple, as the authors ofClerk & Lindsell on Torts(Sweet & Maxwell, 19th Ed, 2006) have pointed out at p 134, is this: [I]f a defendant has to take his victim as he finds him should he happen to have an eggshell skull, why did the same rule not apply to the claimant's impecuniosity? After all, a defendant has to take the claimant as he finds him with respect to his earning capacity. If the defendant causes injury to a high earner, he has to compensate him in full for the loss of earnings. InPerry v Sidney Phillips & Son[1982] 1 All ER 1005, Sir Patrick Bennett QC said at 1013: I find it difficult to understand why, if you harm somebody who is a millionaire and thereby increase the damages you have to pay, or a talented pianist whose hands are damaged which also increases the damages you have to pay, when the victim is impecunious … that fact is used via theEdisondecision [the alternative case name forThe Liesbosch] to reduce the damages. 57        In Singapore, the High Court has applied the eggshell skull rule, albeit to a question of property damage. InLoh Siew Keng v Seng Huat Construction Pte Ltd[1998] SGHC 197, in which the plaintiffs claimed for property damage owing to the defendants’ negligence, Chan Seng Onn JC held that the defendants could not shift the blame to the plaintiff on the basis that the premises should have stronger structural fortifications to withstand whatever soil subsidence that might arise out of their trench excavation. While the plaintiff’s premises might have been more susceptible to subsidence due to the renovations and the increased structural loading, it was held the defendants had to take the “victim” as they found him. Specifically, Chan JC noted at [164] that: In the law of tort, this is commonly referred to as the ‘thin skull rule’. If it is reasonable to foresee some injury, however slight, to the plaintiff, assuming him to be a normal person, then the defendants are answerable for the full extent of the injury which he may sustain owing to some peculiar susceptibility. This principle is well established in the case of physical injury (e.g.Smith v. Leech Brain[1962] 2 QB 405) and there is no reason why the principle should not apply to property damage: see egClerk & Lindsell(1995) para 7-192. 58        However, the question of whether the application of the eggshell skull rule would be inconsistent with theLiesboschprinciple was not argued or considered in that case. TheLiesboschprinciple and reasonable foreseeability 59        Brian Coote in “Damages,The Liesbosch, and Impecuniosity”[2001] CLJ 511at p 535 pointed out thatThe Liesboschwas decided at a time whenIn re Polemis and Furness, Withy & Co Ltd[1921] 3 KB 560 was still a leading authority that directness of causation was the test for remoteness of damage in tort. This test was finally rejected inThe Wagon Mound. If the test for remoteness had been reasonable foreseeability, the result inThe Liesbosch, as Lord Hope noted in Lagden, could have been different. Lord Wright himself in the later case ofMonarch Steamship Co Ltd v A/B Karlshamns Oljefabriker[1949] AC 196 held that reasonable contemplation as to damages was what the court attributed to the parties and that the question in such a case must always be what reasonable businessmen must be taken to have contemplated as the natural or probable result if the contract was broken. As Lord Wright also held that the issue does not depend on the differences between contract and tort, it would appear that he had contemplated that the reasonable foreseeability test would apply equally to tort cases. Cases in which tortfeasor caused claimant’s impecuniosity 60        In our view, there is a third ground of criticism against theLiesboschprinciple. In some cases, it may be the tortfeasor who caused the claimant’s impecuniosity in the first place and the application of theLiesboschprinciple to deny the claimant damages would be unjust. For example, inMooka Pillai, the Owners had an illiquid asset which they could not convert into cash because of KS’s caveat. Similarly, in the present case, the appellants had an illiquid asset which they were prevented from converting into cash in a timely manner by the presence of the respondent’s caveat. If the caveatee’s inability to refinance an existing property is caused by the caveator’s tortious act of blocking it with a caveat on the property, it would be unjust and wrong for the caveator to rely on his own tort as a defence to the caveatee’s claim for compensation. Abrogation of theLiesboschprinciple 61After years of criticism from judges and legal scholars as outlined above, the House of Lords finally inLagdendecided to jettison theLiesboschprinciple in favour of the modern test of remoteness. Lord Hope said at [61]: [T]he correct test of remoteness today is whether the loss was reasonably foreseeable. The wrongdoer must take his victim as he finds him: talem qualem, as Lord Collins said in [Clippens Oil] at 303. This rule applies to the economic state of the victim in the same way as it applies to his physical and mental vulnerability. It requires the wrongdoer to bear the consequences if it was reasonably foreseeable that the injured party would have to borrow money or incur some other kind of expenditure to mitigate his damages. 62        TheLiesboschprinciple has also been doubted in other jurisdictions. In Canada, the applicability of theLiesboschprinciple has been restricted to such an extent that it is now effectively inapplicable there. The British Columbia Supreme Court inAmar Cloth House Ltd v La Van & Co33 BCLR (3d) 312 (“Amar Cloth House”) undertook an extensive examination of the history of the application of theLiesboschprinciple in the Canadian courts and came to the conclusion at [35] that: These decisions of the Supreme Court of Canada, British Columbia Supreme Court and Saskatchewan Court of Appeal suggest that the courts have moved away from a strict application of the dictum inLiesboschand have allowed plaintiffs to recover losses which they would not have suffered had they been wealthy, if those losses resulted from the defendant's wrongdoing and were reasonably foreseeable. And, later at [43]: The consideration whether a plaintiff’s losses were caused by its own impecuniosity or a defendant's wrongdoing is highly artificial, usually cloaking a decision as to the reasonable limits fairness requires be imposed on damages. This is particularly evident when addressing the issue of mitigation: ShouldLiesboschbe considered as an exception to the thin-skull rule, an exception that singles out impecunious individuals who are victims of another’s wrongdoing? Phillips states that “the principle that a plaintiff is not to be penalized for his failure to expend monies which he did notpossess is truly a first principle, to be rejected or accepted on policy grounds alone”. The Federal Court (Trial Division) inRollinson v. R.(1994), 20 C.C.L.T. (2d) 92 (Fed. T.D.) at 100, 108, quite firmly states that this interpretation ofLiesboschwould assert a “quintessentially inequitable principle” and would be “un-Canadian, and foreign to Canadian values, and unjust, and [should] not be followed in Canada”. In the event, although theLiesboschprinciple was not expressly rejected inAmar Cloth House, the British Columbia Supreme Court nonetheless adopted the “reasonable foreseeability” test to assess damages suffered by the impecunious plaintiff to soften the effects of theLiesboschprinciple. 63        In Australia, the Court of Appeal of the Supreme Court of New South Wales inTyco Australia Pty Ltd v Optus Networks Pty Ltd[2004] NSWCA 333acknowledged at [192] that the “much distinguished” decision ofThe Liesboschhas been “effectively overruled” by the House of Lords inLagden. 64        In the New Zealand case ofAG v Geothermal Produce NZ Ltd[1987] 2 NZLR 348, Cooke P at 355 said: [I]t seems to me thatLiesboschis certainly not to be extended as far as logic could be said to carry it. The difficulties so generally experienced in accommodating the decision with principle and justice, as commonly understood at the present day, suggest that any continuing effect given to it as a precedent should at least be strictly confined to damages for the loss of a profit-earning chattel, in use for performing a contract, for which a replacement is available by purpose on the market. That is not the present case, which is much more complicated … On the Judge’s findings, fully supported by evidence, the company acted reasonably to mitigate its losses, and that is enough to exclude any defence based on impecuniosity. Should this court reject theLiesboschprinciple? 65        We agree that theLiesboschprinciple has no place in modern jurisprudence and should be abrogated in its application to Singapore. It is inconsistent with the general tort principle that the tortfeasor must take his victim as he is. Moreover, as we have pointed out, in cases such asMooka Pillaiand the present case, its application would be doubly unjust in that it is the very fault of the caveator that brought about the impecuniosity of the caveatee. It is time that we aligned our approach with that of the other Commonwealth courts. Pursuant to our Practice Statement (Judicial Precedent)[1994] 2 SLR 689, we would hold that, in so far asKhushvinder Singhapplied theLiesboschprinciple, it should no longer be followed by a future court.In our view, any policy concern today with the problem of a tortfeasor being made responsiblead infinitumfor all the consequences of his negligent conduct is now addressed by the principles of remoteness and its attendant reasonable foreseeability test.",
        "Would withdrawal of caveat have forestalled forced sale?": "66        We must now consider whether the respondent’s refusal or failure to withdraw the caveat against 26F Poh Huat Road caused the losses suffered by the appellants in relation to the forced sale of 179 Syed Alwi Road. As we have noted above at [26], the use of the word “attributable” in s 128(1) of the LTA, when applied to the issue of causation, requiressome form of causal connection, althoughthis connection need not be that of a sole, dominant, direct or proximate cause and effect. 67        In relation to this issue, HLF had agreed on 26 August 2002 to grant the appellants loan facilities consisting of (a) a housing loan of $285,000 or redemption amount of the existing loan with United Overseas Bank, whichever was lower, and (b) an overdraft of $400,000 to be secured by 26F Poh Huat Road. The appellants informed HLF that they could not take up the offer without settling the respondent’s claim for the cancellation fees. In other words, they were unable to provide the security because of the respondent’s caveat on it. HLF cancelled the offer by their letter dated 23 February 2004, some months after 179 Syed Alwi Road had been sold. 68        The appellants’ witness, Andrew Chew, Second Vice President of BEA, testified that BEA wished to avoid taking enforcement action against the appellants on 179 Syed Alwi Road as far as possible. In this respect, although the BEA overdraft limit was $8.5m, BEA had a tolerance level within which they would not take such action. The tolerance level in this case was $270,000. Accordingly, as long as the outstanding overdraft was $8.77m and below, BEA would allow the mortgage loan to continue. Also, this tolerance level applied until the enforcement notice was issued by BEA on 28 May 2003. After 28 May 2003, BEA would require the outstanding overdraft to be brought down to below $8.5m to avoid a sale. 69        As such, with the $400,000 from the HLF overdraft, the appellants would have been able to forestall the forced sale so long as the outstanding amount was below $9.17m before and on 28 May 2003 (being the sum total of $8.77m and $400,000), and below $8.9m after 28 May 2003 (being the sum total of $8.5m and $400,000). This was the case from 21 October 2002 to 28 February 2003 and from 18 June 2003 to 16 October 2003. Therefore, if the appellants had been able to take up the HLF overdraft, the $400,000 would have been sufficient to reduce the BEA overdraft amount to an acceptable amount and forestall the forced sale of 179 Syed Alwi Road. Accordingly, in our view, but for the respondent’s refusal or failure to withdraw its caveat on 26F Poh Huat Road, the appellants could have obtained refinancing from HLF in respect of the same property, and the funds derived from such refinancing could have been used to forestall the forced sale of 179 Syed Alwi Road. Therefore, the respondent’s refusal to withdraw the caveat could be said to have caused the appellants’ losses. This is especially so since onlycontributorycausation is required.",
        "Duty to mitigate": "70        We have earlier referred to the appellants’ duty to mitigate. The appellants knew that the forced sale of 179 Syed Alwi Road would occur if they could not reduce the BEA overdraft and that the respondent’s caveat lodged against 26F Poh Huat Road prevented them from seeking alternative refinancing to do so. In this respect, there was a long period of about 12 months when the appellants could have taken action to have the caveats removed before the forced sale of 179 Syed Alwi Road. The course of action the appellants chose to take was to engage in prolonged negotiations with the respondent over the cancellation fees payable. During this period, the appellants made various offers to pay off the cancellation fees demanded by the respondent. For example, as noted in [8] above, the appellants offered to deduct $20,000 from new loans from other banks to be held by their solicitors as stakeholders pending the determination of the dispute. 71        There is a duty to mitigate under s 128 of the LTA: seeNelson v Kimberley Homes Pty Ltd(1989) ANZ Conv R 123 (“Nelson”). However, the content of the duty to mitigate is always conditioned by what is reasonable in the circumstances. In this case, the appellants, in addition to offering to pay part of the cancellation fees, could have invoked their rights under s 127 of the LTA (which provides a simple procedure to deal with the removal of caveats in the land register)before the forced sale of 179 Syed Alwi Road. In some circumstances, a caveatee’s failure to seek recourse under s 127 could be regarded as a failure to mitigate: see for exampleNelsonin the Australian context. Nonetheless, the AR had found that the appellants in offering to pay part of the cancellation fees had sufficiently mitigated their losses and the respondent did not appeal against this finding in the court below or before us. Accordingly, it is unnecessary for us to address the issue.",
        "Conclusion": "72        For the reasons given above, we allow the appeal with costs to the appellants, and with the usual consequential orders. We direct that the matter be remitted back to the Registrar to determine whether the appellants have suffered an actual loss as a result of the forced sale of 179 Syed Alwi Road and to assess what that loss is. The costs below will follow the event of the assessment by the Registrar. Appeal allowed."
    }
}