{
    "case_title": "BCH Retail Investment Pte Ltd v Chief Assessor",
    "ncitation": "[2007] SGCA 15",
    "coram": "Andrew Phang Boon Leong JA; \n      Judith Prakash J; \n      Tay Yong Kwang J",
    "sections": {
        "Introduction": "1          This is an appeal by BCH Retail Investment Pte Ltd (“the appellant”) against the decision of the trial judge (“the Judge”) holding,inter alia, that the Chief Assessor of Property Tax (“the respondent”) had been entitled not to allow a “deduction” (the significance of the use of this terminology would be apparent later) of all reasonable advertising and promotion (“A&P”) expenses incurred in relation to the premises known as Parco Bugis Junction (“the Property”) from the gross sums paid by the tenants of the Property when it assessed the Property’s annual value under s 2 of the Property Tax Act (Cap 254, 1997 Rev Ed) (“the Act”) for the purposes of property tax payable by and due from the appellant (seeBCH Retail Investment Pte Ltd v Chief Assessor[2006] 4 SLR 73) (“the GD”).",
        "The facts": "2          The facts before us are uncomplicated and engender no real dispute. The appellant is a Singapore-incorporated company which was, at all material times, the owner of the Property. The Property had, at the time, been sub-divided into various units and let to 173 tenants. All the tenants of the Property had entered into respective lease agreements with the appellant contracting to pay a monthly sum comprising the following four components: (a)        “Basic rent”, comprising a fixed sum payable monthly and  computed on the basis of the number of square metres taken up by the tenant; (b)        “Additional rent”, comprising an agreed percentage of the tenant’s gross sales; (c)        “Tenant’s contribution”, which comprised the tenant’s contribution towards the expenses for cleaning and maintenance; and (d)        “Advertising and Promotional Contribution” (“the tenants’ A&P contributions”), which was payable in relation to advertising and promotion expenses incurred by the appellant. 3          For the purposes of this judgment, the sum of the basic and additional rents (ie, (a) and (b) in [2] above) together with the tenants’ A&P contributions (ie, (d) in [2] above) shall be collectively referred to as “gross rental”. 4          The present appeal arose from the respondent’s decision to reject the appellant’s annual returns for assessment for Financial Year 2003, in particular, the appellant’s calculation of the appropriate annual value of the Property for the purposes of property tax. In arriving at its calculation of the annual value of the Property, the appellant had deducted its actual A&P expenditure, namely some $2,591,707 (“the actual expenditure”), from the gross rental. The respondent contended that the appellant was only entitled to deduct the aggregate of the tenants’ A&P contributions, a sum of $591,677, and rendered an assessment of the tax payable on that basis. For convenience, we shall term the difference between the actual expenditure and the tenants’ A&P contributions collected as “the excess expenditure”. 5          So as to put the consequent discussion in its appropriate context, we pause briefly here to note that this represents the second time that these parties have wound up in court in relation to the appropriate methodology to be utilised in ascertaining the annual value of the Property. In 2002, the parties had appeared before Lee Seiu Kin JC (as he then was) (“Lee JC”) who had to decide whether the appellant should be allowed to deduct the tenants’ A&P contributions from the gross rental in assessing the annual value of the Property for the purpose of levying property tax. 6          Lee JC noted that as the annual value of a property concerned the use and occupation of the heritable subject, a distinction should be made betweenrentand the cost of the provision of such amenities in the determination of annual value. Observing that the cost of provision of services should not be included in the annual value of a property, he then proceeded to hold that the tenants’ A&P contributions, being analogous to payment for such essential services, should similarly not to be included for the purposes of computing the annual value (seeBCH Retail Investments Pte Ltd v Chief Assessor[2002] 4 SLR 844(“BCH No 1”)). As he reasoned (at [17]): It is well known that in order for a shopping centre to be successful in these times it has to continually maintain or even renew its image and attractions. This is achieved principally through advertising in various media combined with the holding of a variety of promotions. This would implant in the mind of the public an awareness of the shopping centre and attract shoppers to the premises. Such expenditure is usually of a continuing nature, especially in view of the keen competition between shopping centres. The successful implementation of A&P activities could go a long way in attracting custom to the shops in the premises thus raising the profitability of those shops and in turn the rent that the landlord would be able to charge upon the renewal of the leases. Therefore such services are probably as essential to the tenants as the traditional ones such as watching, cleaning and air-conditioning. In my view the principles of valuation should take into account modern developments so as not to stifle business innovation and creativity. 7          Having found therefore that, in principle, such contributions should not be included in any computation for the purpose of determining annual value, in addressing the Chief Assessor’s contention in that case that such deductions had to be based onbona fidecontributions, Lee JC proceeded to observe as follows ([6]supraat [18]): The Chief Assessor raised the issue, if the A&P contributions were allowed to be deducted, of the evidence necessary to show that these were bona fide A&P contributions. But that is a question of fact, not principle. If the owner can satisfy the Chief Assessor, in relation to the A&P contributions, that: (1) it was reasonable to provide those services; (2) the tenants had agreed to pay for such services; (3) the services were in fact provided; and (4) the costs of providing them were reasonably incurred, then he ought to deduct such sums from the gross rent in arriving at the annual value. It is always open to the Chief Assessor to disallow anything that he deems to be unreasonably incurred. This was done in theChartered Bankcase (supra) where the landlord made a claim of a loading of 25% on the costs of providing watchmen, cleaning, lifts, air-conditioning, supervision, etc. The High Court held that it was proper and reasonable for the landlord to provide those services and want a return on his outlay, but ruled that the claim of 25% was too high and allowed a loading of 15%. 8          The matter before us therefore represents a sequel of sorts to the above decision, with the appellant now contending that above and beyond allowing a deduction for the tenants’ A&P contributions, it should be entitled to a deduction ofall reasonableA&P expenses incurred from the gross rental paid by its tenants when the assessment of the Property’s annual value is made. 9          Before the Valuation Review Board (“the Board”), the appellant had contended that the test as to whether the cost of the services should be deductible from the gross rental was threefold, namely the four-stage test articulated by Lee JC (as reproduced at [7] above)sansthe second condition,viz, the tenants’ agreement to pay for such a service. We would hasten to add that before the Board, the position adopted by the appellant was thatallA&P expenses (whether reasonably incurred or otherwise) should be deductible from the gross rental in ascertaining the annual value of the Property. The respondent, in contrast, highlighted that the four-stage test was cumulative and that in the light of the appellant’s failure to satisfy the second condition, it should not, in principle, be allowed to deduct the actual expenditure from the gross rental in arriving at the annual value for the purposes of property tax. 10        The Board agreed with the respondent and consequently dismissed the appeal. In its view (seeBCH Retail Investment Pte Ltd v Chief Assessor[2005] SGVRB 4, hereinafter referred to as “the Board’s GD”), the case before it was analogous to that decided by Lee JC inBCH No 1([6]supra) and, accordingly, it would have been “per incuriamto ignore the four conditions and pick and choose only the three deemed to be acceptable by the appellant” (see the Board’s GD at [48]). Instead, applying the four conditions to the A&P expenses incurred by the appellant, the Board agreed with the respondent that such sum could not be deducted from the gross rental as the tenants had not agreed to pay the excess expenditure. 11        This was not the only plank on which the Board justified its decision. In the alternative, the Board dismissed the appeal on the basis that the appellant’s method of computation had been erroneous. The tenants’ A&P contributions had been deducted only because they had initially been added to the sum that comprises the gross rental. In effect, the practical result of such aggregation and deduction would be toexcludethe A&P contributions. This was in stark contrast to the method of computation advocated by the appellant, in which there would be a deduction of the actual amount of A&P expenses without there having been an initial imputation of such amounts into the aggregate gross rental. In the Board’s view, the valuation mechanism adopted by the appellant could not be countenanced for it would have depressed the annual value of the Property artificially by factoring in and deducting, without any corresponding credit, an extraneous amount of additional A&P expenses. 12        Dissatisfied with the decision of the Board, the appellant appealed to the High Court. It should be noted that by the time the appeal came before the Judge, the appellant had abandoned the argument thatallA&P expenses should be deductible in ascertaining the annual value of the Property. Instead, the appellant was content to canvass the argument that only A&P expenses that werereasonably incurredshould be deductible from the gross rental in ascertaining such annual value. 13        Notwithstanding the more moderate stance adopted by the appellant in the proceedings in the court below, the Judge upheld the decision of the Board,albeiton slightly different grounds. In particular, the Judge disagreed that the principles enunciated by Lee JC inBCH No 1([6]supra) were applicable in the present context. Instead, as the issue in that case had been limited to that of whether the sums collected by the appellant from the tenants could be deducted from the gross rentals collected in the ascertainment of annual value, it did not purport to make any determinative finding on the overarching consideration of whether any additional amounts expended by a landlord on A&P above and beyond a tenant’s contractual contributions could be deducted from gross rental in determining annual value. As such, in the light of their narrow import, the Judge felt that the principles enunciated inBCH No 1would not be helpful in resolving the broader question that was before him. 14        Instead, the Judge reasoned that unlike the tenants’ A&P contributions which should never have been included in the computation to ascertain the annual value of the Property in the first place, the excess expenditure was never regarded as part of the gross rent. In that connection, he considered that such expenses would be no more than business expenses that would only be relevant for the computation of income tax, as opposed to property tax. The Judge also appeared to be particularly influenced by the fact that if the excess expenditure could be deducted when ascertaining the annual value, this could have the undesirable attendant effect of allowing landlords to vary, without much difficulty, the annual values of their respective properties by manipulating their A&P expenditure. As the annual value of a property is predicated upon the consideration underlying ahypotheticaltenancy from year to year, allowing the deduction of the excess expenditure without caveat would invariably result in the perversion of the entire conceptual basis of annual value.",
        "The arguments before us": "15        The arguments before us were, in essence, the same as those that had been canvassed before the Board and before the Judge. At its core, counsel for the appellant, Mr Tan Kay Kheng, rested his client’s case essentially on the proposition that, as long as the A&P expenses had beenreasonably incurred, they should, as a matter of principle, be deducted from the gross rental received when ascertaining the appropriate annual value. In support of this proposition, Mr Tan placed reliance on the English Court of Appeal decision ofBell Property Trust Ltd v Assessment Committee for the Borough of Hampstead[1940] 2 KB 543 (“Bell Property Trust”) and the local decision ofChartered Bank v The City Council of Singapore(1959) SPTC 1 (“Chartered Bank”). In the appellant’s view, these cases stand for the proposition that the cost of services must, as a matter of principle, be deducted from the gross rental before arriving at the annual value of the Property. Given that it was expressly highlighted inBCH No 1([6]supra) that services such as A&P would, in the modern context, be as essential to the tenants as more traditional services (as reproduced at [6] above), there should be no bifurcation between the treatment of A&P expenses and that of the more traditional expenses. The appellant contended that the four requirements enunciated by Lee JC inBCH No 1would not be applicable to the factual matrix before us as they were notexhaustiveconditions, and that it could not be an immutable principle that the deductibility of a particular expense would be dependent on an agreement with tenants as to the quantum of such expenses to be borne by them. 16        Counsel for the respondent, Ms Foo Hui Min, quite unsurprisingly adopted an altogether different tack. In her view, there was no unfettered principle that all reasonable expenses incurred by a landlord should bedeductedfrom the gross rental in ascertaining the annual value of a property for the purposes of property tax. Referring to the cases cited by the appellant, Ms Foo sought to distinguish them by averring that they went to only support a more limited proposition: namely, that where agross sumhad been paid to cover both the cost of the occupation of the premises and the services that were provided by the landlord, a reasonable apportionment would be allowed. As a corollary, Ms Foo contended that where there had already been a clear apportionment of the gross rental into its respective constituents in the lease agreements between the tenants and the appellant, there could be no further justification to undertake anyfurtherapportionment with respect to the gross rental amount. 17        Notwithstanding the diametrically opposed stances adopted by both counsel in relation to the law’s consistency with their respective positions, we pause briefly here to emphasise that they weread idemon the legal issue that, in their opinion, arose under the present factual matrix and it is this: whether, as a matter of principle, all reasonable A&P expenses can bedeductedfrom the gross sums paid by the tenants to arrive at the annual value. We stress this because, as we shall see in a moment, the crux of the issue in the present appeal should, in our opinion, be placed on a markedly different footing.",
        "The relevant principles and their application in the context of the present proceedings": "18        At the outset, we would stress thatany meaningful analysis of the factual matrix in the present proceedings must commence with conceptual and definitional clarity. In this regard, it would not be wrong to suggest that the crucial issue in the present decision would turn on our understanding of the ambit of the concept of “annual value”.The definition of “annual value” itself is to be found in s 2 of the Act, the material part of which reads as follows: “annual value” — (a)        in relation to a house or building or land or tenement … means the gross amount at which the same can reasonably be expected to beletfrom year to year, the landlord paying the expenses of repair, insurance, maintenance or upkeep and all taxes (other than goods and services tax); … [emphasis added] 19        It will be immediately seen that the definition of “annual value” focuses on the element of rent or letting.Indeed, it is undisputed by either party that the annual value of any given property must includeonlyelements of rent or letting. To this end, any expenses that are not related toelements of rent or letting oughtnotto be taken into account in the computation of annual value. This is not only logical and fair; it is also an elementary, albeit fundamental, starting-point. Indeed, in our view, this concept is so vital that it constitutes the main compass guiding all our subsequent legal navigation. 20        Before proceeding to analyse the cases cited by counsel in support of their respective cases (as highlighted at [15] above), given the imprecise use of concepts and terminology inherent in the jurisprudence in this area, we are of the opinion that an introductory pronouncement on the general legal position would be appropriate. In this regard, while we agree with thepracticalimport of the cases cited by counsel for both parties and the reasoning found therein, we would like to stress our discomfort with the use of the terminology ofdeductionthat appears to be inherent in the case law hitherto surrounding this area. In our view, reliance on such terminology gives rise to unnecessary confusion. Let us elaborate. 21        The concept ofdeduction, traditionally used in the sphere ofincometax, has no place in the context ofpropertytax. In other words, when, inBCH No 1([6]supra), the value of the tenants’ A&P contributions was excluded from the gross rental, this was not adeductionas such, except as that concept is utilised in its most literal sense (as a form of subtraction or, more accurately,exclusion). Conceptually, the correct approach would be to view the tenants’ A&P contributions in that case as having hadnothing to dowith rental or letting and, consequently, that such contributions oughtnotto have been taken into account or included in the computation of the annual value of the Property in the first instance. It was in that context that Lee JC found that the value of such contributions was to bededucted, so to speak, from the gross rental. That being the case, the court inBCH No 1was entirely correct inexcludingthe amount of such contributions from the computation of the annual value of the property. The court, therefore, wasnot, strictly speaking,deductingthe value of the tenants’ A&P contributions from the gross rent as such, butexcludingit. We shall term this approach “the principle ofexclusion”. 22Such an approach should be contrasted with the situation where expenses are deducted for the purposes ofincometax, an approach that we shall term “the principle ofdeduction”. The principle ofdeduction(put in its simplest terms and shorn of a detailed account of it in relation to the relevant provisions of the Income Tax Act (Cap 134, 2004 Rev Ed) (“the Income Tax Act”), as to which see, generally,Halsbury’s Laws of Singaporevol 16(2) (LexisNexis, 2004) at p 96 ff) allows all reasonable expenses to bedeductedfrom the gross income received in a particular year of assessment, with the remaining income being rendered (in the absence of other allowances or concessions) liable to tax. It will be seen that the principle ofdeductionis, in substance, aninclusionaryconcept. All reasonable expenses that pass muster under the Income Tax Act can beincludedfor the purpose ofreducingthe gross income received when ascertaining assessable income under that Act. The rationale for allowing such deductions is, in essence, that such expenses were reasonably incurred in the production of the gross income received and therefore should not be taxable pursuant to the relevant provisions of the Income Tax Act. Conceptually, this constitutes, incontrast tothe principle of exclusion, a quite different approach with an equally different rationale. 23        We would thus urge avoidance of the use of the concept and terminology ofdeductionin the context of property tax in order to avoid the concomitant confusion that might otherwise ensue. The correct concept as well as terminology should, instead, centre on that ofexclusion. In other words, where elements or components that have nothing to do with rent or letting are included in the gross rent, they ought to beexcluded. This is, we believe, the thrust of the approach of the court inBCH No 1([6]supra) in so far as the value of the A&P contributions was concerned. 24        In a related vein, we should also, at this juncture, emphasise the general principle that the gross rent of a given property should not be equated with its annual value. Instead, and neither party disputes this, it is clearly established that where (as is often the case) the gross rent adopted by the tax authorities is, in fact, theactualrent, that figure, whilst helpful, is by no means conclusive of the annual value of the property in question (see, for example,Bell Property Trust([15]supra) as well as Leung Yew Kwong and Mani Usilappan,Property Tax in Singapore and Malaysia(Butterworths Asia, 2nd Ed, 1997) at pp 124–125). That this is not only a sensible but also a logical approach to adopt is precisely because the gross rent (whether actual or hypothetical) might in fact contain elements that have nothing to do with rent or letting, and which therefore ought to beexcluded. That said, depending on the actual factual matrix, it could well be, as was the case inChartered Bank, that “the actual rents paid are the best evidence on which to arrive at the true annual values of [the] properties” ([15]supraat 2). Certainly, whilst not necessarily conclusive, we would highlight that the actual rent paid would often be an important factor and/or starting-point in the assessment of the annual value of the property concerned. 25        Notwithstanding the nomenclature employed, this was, for all practical purposes, precisely the approach that Lee JC adopted inBCH No 1([6]supra). It was clear to us that in that case, Lee JC recognised that the gross rent represented no more than a starting-point from which to ascertain the annual value after any elements that had nothing to do with rent or letting had beenexcluded. To this end, since the gross rent had incorporated the value of the tenants’ A&P contributions which in reality had nothing to do with rent or letting, Lee JC sought toexcludesuch value for the purposes of ascertaining the annual value of the Property. 26        Having regard to the analysis and (more importantly) general principles laid down above, the correct approach to adopt in the present proceedings (as inBCH No 1([6]supra)) would be to first ascertain whether or not the gross rent adopted as a starting point includes any elements that oughtnotto be included. If, in fact, there are such elements, then their value ought to beexcludedfor the purposes of computing the annual value. The corollary of such an approach is that where expenses have been incurred, but which have had nothing to do with rent or letting and have not been included in the gross rent, they are not to be considered at all. 27        Looked at in this light, it is of no utility in the context ofpropertytax to distinguish between the tenants’ A&P contributions inBCH No 1(which were contractual in nature) and the additional A&P expenses that constitute the subject matter of the present appeal. Both items are, strictly speaking, irrelevant to the computation of annual value. It is therefore essential that they arenot includedin (or areexcludedfrom, as the case may be) the computation of annual value. 28        As we have already pointed out above (see [21] above), as the tenants’ A&P contributions inBCH No 1([6]supra) had already been included in the gross rent, the court there was, on the facts, correct inexcludingthem for the purposes of the computation of annual value. What, then, is the legal status of theadditionalA&P expenses incurred by the appellant and which, in fact, constitute the subject matter of the present appeal? In our view, it was clear that these expenses were never (unlike the contractual tenants’ A&P contributions inBCH No 1) included in the gross rent in the first instance. Applying the above conceptual understanding, it would be both illogicalandunprincipled to argue (as the appellant does) that they should now beexcludedfrom the gross rent simply because they were never (and, in any event, ought not to have been),ex hypothesi, included in the gross rent to begin with. This line of reasoning would also succinctly explain the distinction drawn by the Judge between the A&P contributions inBCH No 1and the additional A&P expenses that are the subject matter of the present appeal (see the GD at [11]). 29        In the interest of completeness, we should add that we accept that if, however, the appellant’s argument (based on the principle ofdeduction) was accepted, any distinction between the tenants’ A&P contributions and the additional A&P expenses would be artificial because there is no material or substantive difference, in principle, between these two amounts. In other words, if one can be deducted, so (in principle) should the other. However, it bears repeating that we arenotconcerned here with the principle ofdeductionbut, rather, with the principle ofexclusion. For the purposes of the latter principle, the distinction between the two amounts is also immaterial (see [27] above) – but for another (and quite different) reason, namely, that any and all A&P contributions are wholly irrelevant to a computation of annual value and, to that extent, should beexcludedfrom the gross rent if they have been initiallyincluded(the paradigm illustration is to be found with respect to the A&P contributions inBCH No 1([6]supra)) and shouldnot be includedif theyhave not already been included(the paradigm illustration is to be found in the context of the additional A&P expenses in the context ofthe present appeal).",
        "The case law reconsidered": "30        If the crux of the present appeal relates to the appropriate application of the principle ofexclusion, as opposed to the principle ofdeduction, the pith of both counsels’ arguments before us (see [15] to [16] above), which had been wholly predicated upon the (erroneous) assumption of the applicability of the latter, would be of little assistance and need not be considered in any great detail. In all fairness, however, it must be stated that such a misunderstanding centring on the applicability of the concept and language ofdeductionis, in the circumstances and for reasons already alluded to, wholly understandable. Indeed, the intensity of this difficulty was patently underscored by the prevalent – though we should add, erroneous – use of such nomenclature embedded within the relevant jurisprudence. 31        While it would be possible to decide the present case without being unduly hampered by the nomenclature adopted in prior jurisprudence, in our opinion, it would be germane not to gloss over these difficulties but to critically analyse whether the apparently distinct conceptual basis upon which we feel fit to decide this case (as opposed to theapparentlydistinct reasoning in the cases cited by both parties) hints of a broader issue as to whether the reasoning in those cases ought to be reconsidered or rejected. Nonetheless, as a closer inspection of the cases concerned will highlight, although the concept and language ofdeductionwas utilised in each of the cases relied on by the parties, an in-depth analysis as well as understanding of the reasoning (as opposed to the apparent nomenclature) employed in each one of these cases would demonstrate their complete conceptual symmetry with the principle ofexclusion, and, in this regard, show that they represent archetypical examples of its operation. 32        We begin our survey of the relevant case law withBCH No 1([6]supra). As we have already explained, the finding in that decision that the tenants’ A&P contributions that were contractually agreed between the landlord and the tenants ought to have been excluded from the gross rent is entirely consistent with the principle ofexclusioninasmuch as these tenants’ A&P contributions, having had nothing to do with rent or letting, ought never to have been included in the gross rent in the first instance for the purposes of computing the annual value of the property concerned. 33        Given the distinct stances adopted by the Board and the Judge in relation to the applicability of the four conditions elucidated upon by Lee JC inBCH No 1(see [10] and [13] above), it may be of some utility for us to highlight, albeit briefly, our viewsvis-à-visthat point. In our view, the four conditions laid down by Lee JC were, looked at in thecontextof the judgment as a whole, related to the issue of thereasonablenessof theamountof A&P contributions sought to be excluded. This must,ex hypothesi, assume that theprinciplethat such contributions could be excluded as a matter of law applied in the first instance. That this is so is evidenced by the fact that Lee JC had already dealt with this particular issue of principle in the paragraph preceding that in which the four conditions just mentioned are found. Indeed, the main portion of that particular (preceding) paragraph has already been quoted earlier (at [6]). It was only after having dealt with theprincipleconcerned, that Lee JC then proceeded to elucidate upon the four conditions that would apply. 34        Even a cursory perusal of the passage in question (quoted at [7] above) would reveal that Lee JC was dealing with the issue of thereasonablenessof theamountof tenants’ A&P contributions sought to be excluded by the taxpayer (see, in particular, the phrase “if the A&P contributions were allowed to be deducted”). Indeed, Lee JC thought that the issue concerned “a question of fact, not principle”. The four conditions then followed. It is interesting, in this regard, to note that two of the conditions (viz, (1) and (4)) deal directly with the issue of reasonableness. Condition (3) constitutes a factual pre-requisite. The remaining condition ((2)) is the one which engendered some legal controversy in the context of the present proceedings in so far as it constituted one of the reasons given by the Board for its dismissal of the initial appeal (see [10] above). 35        In our view, a close examination of condition (2) in the context of the judgment as a whole and that paragraph of the judgment in particular reveals that it relates to the issue of reasonableness as well. Indeed, where the tenants have agreed – and are therefore legally obliged – to pay the landlord a pre-determined amount for the latter’s provision of A&P services, such agreement would probably constitute at leastprima facieevidence that the amount concerned was reasonable in quantum. The proposition that the four conditions laid down in the above passage were concerned with the reasonableness of the amount of tenants’ A&P contributions only is confirmed by the learned judge’s reference to a case to be considered shortly,viz,Chartered Bank([15]supra). In particular, Lee JC referred to the fact how, in so far as one particular item was concerned inChartered Bank, the courtreducedthe claim from 25% to 15%. This is clearly a reference to reduction on the basis of reasonableness (or, more accurately, unreasonableness) in quantum. In light of that, we would respectfully disagree with the findings of the Board that the four conditions elucidated upon by Lee JC inBCH No 1([6]supra) are applicable in the present context. 36        Another decision relied on heavily by counsel for the appellant, Mr Tan, was the High Court decision ofChartered Bank([15]supra). In that case, there was (unlikethe situation inBCH No 1([6]supra)),noitemisation of the various components of the gross rent as such. Nevertheless, the taxpayer proceeded to list out specific items, which it argued merited exclusion from the gross rent in the context of the computation of the annual value of the property concerned. 37        There were eight itemsin totoinvolved inChartered Bank([15]supra). Mr Tan pointed out that whilst the first five items constituted actual expenditure (for watchmen and cleaning, lifts, air conditioning, common parts as well as cost of supervision and services), the remaining three were not inasmuch as they constituted notional expenditure only. Notwithstanding that, the court held that all eight items could be excluded from the gross rents of the properties in question. In a situation such as this, therefore, where (unlike that inBCH No 1([6]supra)) thecomponentsof the gross rental have not been specified, the courts have nevertheless been willing to exclude items where the taxpayer has been able to demonstrate to the courts’ satisfaction that the items concerned were indeedunrelatedto rental or letting. 38        However, one would imagine that where (as inBCH No 1([6]supra)) the components of gross rental have in fact been identified individually, the task of the court isfacilitatedinasmuch as the items concerned have been structurally isolated right from the outset (assuming, of course, that such identification was not in the nature of a sham transaction). Much would, of course, still depend upon the precise nature of the item concerned. InBCH No 1itself, for example, a threshold issue that arose centred on whether or not the A&P expenses paid by the tenants to the landlord could, inprinciple, be classified as an item that wasnotrelated to renting or letting and which should therefore be excluded from the computation of annual value. The court held that such expenses did indeed constitute a service provided by the landlord to the tenants and therefore did not fall within the purview of the concept of annual value. 39        Returning toChartered Bank([15]supra), it is clear that that case is entirely consistent with the analysis set out above. Once again, the items concerned were held by the court there to be unrelated to rental or letting, and the courtexcludedthe value of these items from the gross rental in arriving at the final annual values for the properties concerned. While once more, the concept as well as language ofdeductionwas, unfortunately in our view, utilised by the court, a reasonable reading of the judgment indicates that the court was of the view that all expensesvis-à-visthe items just mentioned would be borne out of the gross rentals (this is,a fortiori, the case with respect to the items ofnotionalexpenditure). This suggests, in turn, that the gross rentals were formulated with these items in mind. In the circumstances, therefore, since they werenotrelated to rental or letting, they oughtnotto have been included in the first instance: hence, theexclusionof the value of such items from the annual values of the respective properties. 40        We should add that if, however, it is argued that one or more of these items hadnotbeen included within the computation of the gross rents in the first instance, then we would respectfully disagree with the analysis of the learned judge in that case inasmuch as he must then have been necessarily (though erroneously) applying the principle of deduction as opposed to the principle of exclusion. However, such an approach does not, from a perusal of the judgment inChartered Bank([15]supra) itself, clearly appear to have been taken and, indeed, we are of the view that a more persuasive interpretation of the reasoning underlying that decision is that the value of the items concerned had in fact already been incorporated within the gross rent right from the outset. 41        Quite ingeniously, on the back of the factual matrix inChartered Bank([15]supra), Mr Tan contended that if the decision of the court below in the present proceedings was upheld, this might lead to landlords not specifying the specific components of gross rental and then attempting to exclude theirentireA&P expenditure in the computation of annual value by contending that such costs were not related to rental or letting. In such an instance, on the assumption the court accepts that a particular item (in this case, A&P expenditure) ought to be excluded from the computation of annual value, the quantum of the sum allowed to be excluded would still be subject to the test of reasonableness. In this regard, in drawing an analogy to the facts before us, Mr Tan’s argument, in essence, was this: if the appellant had structured his affairs in the manner that the landlords inChartered Bankdid, the respondent would have to assess the expenses incurred and consider whether they had been incurred reasonably in allowing for any deduction for the purposes of ascertaining the annual value of the Property. In that sense, allowing this appeal would do no more than arrive at the same end goal:ie, even if the additional A&P expenses were allowed in the present appeal, the precise quantum that would be allowed would still be subject to the test of reasonableness as applied by the respondent. 42        That a landlord could structure his affairs to be consonant with the above analysis cannot be seriously disputed:Chartered Bank([15]supra), after all, does indeed illustrate that landlords could still tender specific items before the Chief Assessor and/or the courts, arguing that they were not related to rental or letting and should therefore be excluded from the computation of the annual value of the property concerned. Be that as it may, we are not persuaded by the merits of such an argument. Though it would be the landlords’ prerogative to adopt such an approach, assuming that they are able to do so without objections and/or counterproposals from actual or prospective tenants with respect to specific items (of which A&P expenses spring readily to mind), we should also observe that, absent any finding of bad faith on the part of the landlord, theexpressspecification of the various components of gross rent (as in this case) mightin facttend to work in the landlord’s favour inasmuch as it would be able to demonstrate to the satisfaction of the Chief Assessor and/or the court that not only were the items concerned arrived at in good faith but also (provided that there is a finding that these items were unrelated to rent or letting) that the values specified therein (being the product of an arm’s length transaction) would be reasonable – at least on aprima faciebasis. 43        This is to be contrasted with a situation where the landlord specifies only the gross rent and then attempts (as inChartered Bank) to argue that certain items were in fact not part of the gross rent and ought therefore to be excluded from the computation of the annual value of the property concerned. One would have thought that the landlord would, in adopting such an approach, have placed itself in at least no better a position than it would have been had it (as inBCH No 1) expressly specified the various components of the gross rental. And it would have noprima facievalue that it could argue as a starting-point – not only from the perspective of assessment but also from the perspective of proving the reasonableness of that value. 44        Finally, we turn to the English Court of Appeal decision ofBell Property Trust([15]supra), which was heavily relied upon by Lee JC inBCH No 1([6]supra) itself. In that case, the tenants concerned each paid a comprehensive sum, described as rent,bothfor the occupation of the flatandfor the benefit ofservices and amenitiesprovided by the landlord. The issue arose (as Goddard LJ (as he then was), reading the judgment of the court, put it) “as to what portion of the gross sums payable by the tenants was actually for rents and how much was remuneration for services, or consideration for services and amenities provided for the tenants by the landlord” (seeidat 552). Indeed, as the learned judge noted, “it appears in the present case that the experienced surveyors who represented the respective parties agreed in principle that the proper method was to find out the value of the services and amenities offered, and to deduct them from the gross sum which the tenant pays, leaving the balance to represent the true value of the flat” (seeidat 553). 45        We note once again the court’s utilisation of the concept and language of deduction. Indeed, given thatBell Property Trustwas the first case in time to have been decided amongst the cases that have been relied on by the parties, we would find it hardly surprising if the inappropriate use of nomenclature there precipitated the use of such terminology in the subsequent decisions. To reiterate, it would have been preferable if the court there had utilised the concept and language ofexclusioninstead because that is, in substance, what, with respect, we think the court in that case actually meant. However, and to return to the principle at hand, it is clear that where sums payable by a tenant to the landlord havenothing to dowith rent or letting, they must beexcludedfrom the computation of the annual value of the property concerned. InBell Property Trust, the court therefore held that the cost to the landlord of providing the tenant with various services and amenities ought to be excluded from the gross payments by the tenant before arriving at the “gross value” (the equivalent of “annual value” under the Act) to be inserted into the valuation list. Indeed, the court even went so far as to permit an allowance for a reasonable profit to the landlord for the provision of the aforementioned services to beexcluded. 46        Taking the factual matrix ofBell Property Trust([15]supra) in the round, so to speak, it is clear that the amounts which were “deducted” from the gross amounts payable by the tenants to the landlord hadnothing to dowith rent or letting. Applying the principle ofexclusion, such amountsought not to have been included in the first instance, and were therefore correctlyexcludedfrom the gross amounts payable by the tenants to the landlord. 47        In summary, notwithstanding the inappropriate use of the terminology and concept of deduction, it will be seen that the cases relied on by the parties are, at the very least, conceptually consonant with the principle ofexclusionas understood in the present judgment.",
        "Conclusion": "48        In the premises, we dismiss the appeal with costs, albeit for somewhat different reasons from those given in the court below."
    }
}