{
    "case_title": "Su Sh-Hsyu v Wee Yue Chew",
    "ncitation": "[2007] SGCA 31",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Overview of the factual matrix": "3          In or aboutJune 2004, the appellant, through her intermediary, one Hsieh Hsi Mou (“Hsieh”), contracted to purchase the respondent’s shares (“the Shares”) in Interstellar Intereducational Pte Ltd (“the Company”). Pursuant to the agreement, the Shares were transferred on or about 25June 2004. 4          The present tempestuous wrangling has emerged from a dispute as to whether the appellant has paid the respondent for the Shares. According to Hsieh, he met the respondent in Shanghai in June 2004 to convey the appellant’s acceptance of the purchase. At that meeting, the respondent allegedly handed Hsieh a photocopied banking slip containing the particulars of a specific account with Standard Chartered Bank in Singapore (“the SCB Slip”). The account was in the name of one “Tung Cheng Yu”. The respondent instructed Hsieh that payment for the Shares should be made by telegraphic transfer to the specified account. Hsieh wrote down the respondent’s instructions on the SCB Slip in Chinese and asked the respondent to sign on the SCB Slip to confirm that the instructions had indeed been given by the respondent. According to Hsieh, the respondent then signed on the photocopied document. Hsieh and one Shi Bi Xian (“Shi”), his business associate, also signed on the document as witnesses. In accordance with these instructions, the appellant then effected payment of the purchase price to the specified account on 28July 2004. 5          The respondent’s version of the facts was diametrically and unequivocally different. He testified that he had never signed the SCB slip and professed not to know “Tung Cheng Yu”. Simply put, the respondent’s position was that he never received the money. He thus commenced the present action to recover the purchase price. The matter was fixed for a two-day trial commencing at 10.00am on 6July 2006.",
        "The trial": "6          On the morning of 6July 2006, former counsel for the appellant, MrFoo Say Tun (“MrFoo”), applied for an adjournment of the trial on the basis that the appellant and her two witnesses, Hsieh and Shi, were unable to be present for the duration of the trial. He produced a letter dated 5July 2006 (“the Letter of 5July 2006”) addressed to the Registrar explaining the reasons for the appellant’s and her witnesses’ absence. The appellant explained that both she and Hsieh were unable to attend the trial because they were engaged in last-minute meetings concerning a Shanghai university they were involved with. This was allegedly due to a variety of factors, in particular: (a) a sudden influx of admissions and related inquiries; (b) the number of applications received that year was unprecedented and totally unexpected; and (c) that was typically a busy period in the school calendar. The appellant explained that Shi was also unable to attend the trial because she too was similarly involved in the recruitment drive and thus unable to depart for Singapore. 7          When questioned by the trial judge, MrFoo disclosed that the appellant had initially inquired about the consequences of not attending trial on 3July 2006. On 4July 2006, the queries became more specific and there were further discussions regarding the possibility of vacating the trial date. Only on 5July 2006 was he was notified that the appellant intended to engage new counsel. He was then instructed to apply for an adjournment. 8          The trial judge was not persuaded by the plausibility of the explanations tendered by the appellant at such a late juncture and rejected her application for an adjournment. The trial thus proceeded in the appellant’s absence. The respondent was called to the stand, but MrFoo had no instructions to cross-examine him. As the appellant and her witnesses were not present, their affidavits of evidence-in-chief were not admitted in evidence. Thereafter, judgment was entered in favour of the respondent for the sum of $414,200 (“the Judgment of 6July 2006”).",
        "The setting-aside application": "9          On 20July 2006, pursuant to O35 r2 of the Rules of Court, the appellant filed Summons No3286 of 2006 to set aside the Judgment of 6July 2006. In her affidavit filed on 1August 2006, the appellant explained that on or about 1July 2006, she received an urgent notice and proxy form from Natural Beauty Bio-Technology Limited (“Natural Beauty”) to attend an important meeting from 5 to 8July 2006 to resolve certain complex matters. She explained that Natural Beauty was unable to find anyone of sufficient seniority who was conversant both in English and its business to attend the meeting. The appellant also clarified that Hsieh and Shi were unable to attend trial because there had been an adverse commentary on 5July 2006 in the Shanghai Morning News in relation to the Shanghai university they were involved with and Hsieh and Shi had to stay back to personally attend to the resulting contretemps. It should be noted that the reasons tendered by the appellant in her affidavit of 1August 2006 did not exactly dovetail with the reasons earlier given in the Letter of 5July 2006. 10        In addition, the appellant mentioned that she had mistakenly assumed that the Singapore legal system was similar to the Taiwan civil law system where an adjournment of trial dates was readily granted. To round up this montage of variegated reasons the appellant claimed that she had also incorrectly believed that, like the civil law system in Taiwan, the affidavits would “speak for themselves” in evidence and that the personal attendance of witnesses at trial was rarely needed. 11        On 28August 2006, the trial judge dismissed the application on the basis that the appellant’s decision not to attend trial was deliberate and there were insufficient grounds to justify the appellant’s non-attendance. The trial judge held that the appellant’s decision to give preference to attending the meeting on behalf of Natural Beauty over the trial was not a good or acceptable reason for her non-attendance. The present appeal arises from this decision.",
        "Application to adduce fresh evidence": "12        Before us, counsel for the appellant first sought to adduce additional evidence in the form of Yang Chiew Yung’s affidavit filed on 8 September 2006 annexing,inter alia, a Health Sciences Authority (“HSA”) report dated 5 September 2006(“the HSA Report”). In essence, the HSA Report concludes that the respondent’s signature on the SCB Slip was genuine. Her counsel vigorously contended that this unequivocal evidence objectively supports the appellant’s version of events in relation to the payment she made for the Shares to the specified account in the name of “Tung Cheng Yu”. 13        Where parties seek to adduce fresh evidence in the Court of Appeal, the starting point for the legal assessment of the merits of the application is s 37(4) of the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed), which provides: Upon appeals from a judgment, after trial or hearing of any cause or matter upon the merits, such further evidence, except as to matters subsequent as specified in subsection (3), shall be admitted onspecial grounds only, and not without leave of the Court of Appeal. [emphasis added] 14        In a similar vein, O 57 r 13(2) of the Rules of Court echoes: The Court of Appeal shall have power to receive further evidence on questions of fact, either by oral examination in Court, by affidavit, or by deposition taken before an examiner, but, in the case of an appeal from a judgment after trial or hearing of any cause or matter on the merits,no such further evidence (other than evidence as to matters which have occurred after the date of trial or hearing) shall be admitted except on special grounds. [emphasis added] 15        It has been authoritatively established inCheong Kim Hock v Lin Securities (Pte)[1992] 2 SLR 349that the “special grounds” referred to in O 57 r 13(2) of the Rules of Court will only be met if the three conditions stated inLadd v Marshall[1954] 1 WLR 1489 are cumulatively satisfied,viz, (a)        the evidence could not have been obtained with reasonable diligence for use in the trial; (b)        the evidence must be such that, if given, would probably have an important influence on the result of the case, though it need not be decisive; and (c)        the evidence must be such as is presumably to be believed or apparently credible. 16        There can be no doubt that the second condition has been satisfied in the present application. After all, the only real controversy in these proceedings is whether the appellant had paid the respondent for the Shares he transferred to her. In this regard, the HSA Report would undeniably have a crucial influence on the outcome of the matter in so far as it proves that the respondent had signed the SCB Slip and therefore had already received payment for the Shares. Similarly, the third condition has also been satisfied as the HSA Report was prepared by an independent expert from a certified public authority. Indeed, the respondent had not attacked the authenticity or credibility of the HSA Report. 17        Unfortunately for the appellant, the same cannot be said for the first condition. The appellant had, as early as 27 October 2005, been alerted to the fact that the respondent had categorically denied signing the SCB Slip. In the respondent’s reply filed on 27 October 2005, he stated that he “gave no such instructions to the [appellant] as alleged by the [appellant] and does not know who ‘Tung Cheng Yu’ is” and further that he had “no knowledge of the alleged telegraphic transfer”. In the respondent’s amended reply filed on 19 May 2006, the respondent added that he “did not sign a copy of the Standard Chartered Bank Cash/Cheque Deposit Advice or any other document”. 18        The appellant therefore had ample time to procure an expert report which reviewed the veracity of the respondent’s alleged signature on the SCB Slip. According to Yang Chiew Yung’s affidavit, the HSA generally takes between three and six weeks to complete an authentication report. The trial before the judge was scheduled to take place on 6 July 2006. In our view, the appellant could easily have, with a modicum of diligence, obtained the expert report well before 6 July 2006. Instead, she chose to wait only until 26 July 2006, after judgment had been entered against her, to instruct her new solicitors to send the respondent’s signature for authentication. 19        In her affidavit filed on 14 February 2007 in support of the application to adduce fresh evidence, the appellant explained that she had not procured the expert report earlier because she genuinely believed that the testimonies of Hsieh and Shi were sufficient to prove the authenticity of the respondent’s signature. Further, it was only upon the appointment of her present solicitors that she was properly advised that an expert report was important to uphold her defence. 20        We failed to see how this argument actually advanced the appellant’s case. In general, the duty on an applicant who seeks to adduce fresh evidence is to satisfy the court that he has made all reasonable, cogent and positive efforts in the pursuit of obtaining thebest evidenceto prove his case. It is incumbent on him to show that “neither indolence nor a lackadaisical attitude predominated in the preparation of his case nor that insufficient preparation at the pre-trial stage” has led to his inability to earlier adduce the fresh evidence:Re Lim Hong Kee David[1995] 4 MLJ 564at 572. 21        In our opinion, the appellant had plainly not exercised reasonable diligence in the conduct of her case. Even though the testimonies of Hsieh and Shi would have supported the appellant’s defence, we reiterate that the appellant nevertheless had a duty to obtain thebest evidencein support of her case. She should not have assumed that the judge would wholly accept Hsieh’s and Shi’s testimonies and reject the respondent’s version of the facts. After all, in the absence of the HSA Report, this was a case where one man’s word was pitted against another’s, and in the absence of unassailable objective evidence, there could be no certainty which way the trial judge would decide. Given that the crux of the appellant’s case was premised on the respondent’s signature on the SCB Slip, the appellant must have appreciated the necessity of procuring an expert report to corroborate the testimonies of Hsieh and Shi. 22        The appellant has therefore failed to satisfy the first condition inLadd v Marshall([15]supra). Our focus then turned to the issue of whether, notwithstanding the lack of compliance with the firstLadd v Marshallcondition, the court ought to allow the application to adduce fresh evidence if it could conclusively (or “decisively”, see [15(b)] above) prove fraud on the part of the opposing party. This issue merited serious consideration as there appears to be an established line of common law authorities suggesting that the courts are generally prepared to adopt a pragmatic and measured approach in such matters by relaxing the application of the firstLadd v Marshallcondition where the fresh evidence pointed to fraud. Such fraud would have to be not merely important but decisive of the matter being adjudicated.",
        "Admission of fresh evidence proving fraud or deception": "23        InPrentice v Hereward Housing Association,[2001] EWCA Civ 437, the English Court of Appeal drew a distinction between cases where the fresh evidence sought to be adduced merely bolstered or augmented the applicant’s case and cases where the fresh evidence could establish the fraud of the other party and thereby unravelled the entire proceedings. These two categories of cases, it was suggested, should be treated differently. Kay LJ observed at [33]: Towards the end of argument the question arose as to whether or not the position was different in a case where a party was coming along saying: I have discovered a witness who could add to my case as I presented it, compared with a case such as that here, where a party is saying: I have now discovered information which suggests that the very claim that the court accepted was false and fraudulently made. If that contention is being made – one of course is not prejudging what might be the conclusion after a retrial – it seems to me to be the case that the court’s approach has to be somewhat different from that which would otherwise be the case where there is simply the discovery of some further piece of evidence. 24        It appears to us from a review of the relevant authorities that in instances where the fresh evidence tended to show fraud or deception of the opposing party, and such evidence would bedeterminativeof the final outcome, the courts have been more readily inclined towards measuredly exercising their discretion to admit the evidence even though the first condition ofLadd v Marshallhad not been strictly satisfied. The objective of this extremely limited approach is to prevent a miscarriage of justice effected through a fraud perpetrated on the court. As Holroyd Pearce LJ observed inMeek v Fleming[1961] 2 QB 366 at 379, “finis litiumis a desirable object, but it must not be sought by so great a sacrifice of justice which is and must remain the supreme object”. 25        This particular issue was recently considered by the English High Court inRajinder Singh Saluja v Partap Singh Gill[2002] EWHC 1435(Ch) (“Saluja v Gill”). In that case, the plaintiff, Dr Saluja, claimed that he had rented his premises to the London Borough of Hillingdon (“Hillingdon”) for the purpose of housing asylum seekers. According to Dr Saluja, he engaged the defendant, Gill, as his managing agent to manage the property and collect rents. Gill, however, presented a totally different version of the facts. According to Gill, he had reached an oral agreement with Dr Saluja to rent the premises in his own name. Gill then rented the premises to Hillingdon to house asylum seekers. 26        A letter allegedly written and signed by Gill, and addressed to the manager of Dr Saluja’s bank, was tendered in court. The contents of the letter supported Dr Saluja’s version of the facts but Gill claimed that the letter was a forgery. The trial judge found that Dr Saluja had forged the document. On appeal, Dr Saluja sought to adduce fresh evidence from Mr Bedale, the bank manager, to prove his version of events and thereby establish that Gill had committed perjury. The court had to consider whether Mr Bedale’s evidence should be admitted. 27        As a starting point, Laddie J noted that the rule inLadd v Marshallshould usually be applied strictly to ensure that justice was achieved between the parties (at [24]): It seems to me that the logical starting point is to consider how Ladd v Marshall was applied before the [Civil Procedure Rules]. I have already noted that the Court of Appeal in that case talked of the triple test in mandatory terms, but this does not mean that it was always applied irrespective of the justice of the case. On the contrary it can be said that normally the justice of the case required the triple test to be applied strictly. Litigants should be disciplined into ensuring that they only fight an action once. For that reason in most cases it will be unfair to a litigant to subject him to a retrial, for example, because his opponent culpably failed to put all the best relevant evidence before the court at the first trial. The rule in Ladd v Marshall was applied so as to achieve justice. 28        Laddie J observed that the twin objectives of promoting and achieving justice would, however, occasionally require that the application of theLadd v Marshallconditions be relaxed. An example would be in a case where the new evidence unravelled the fraud of the other party. Laddie J referred toHamilton v BrodieBrittainRacing Ltd(Court of Appeal (Civil Division), 13 December 1995) (“Brodie”), a decision of the English Court of Appeal, to illustrate this. 29        InBrodie, the plaintiff had succeeded at first instance in an action in which he claimed,inter alia, for the cost of hiring a Jaguar motor car while his car was being retained by the defendant. In support of his case, he relied on certain invoices which showed the amount he had spent on hiring the car. The trial judge accepted the invoices as authentic. On appeal, the defendant sought to adduce evidence which strongly suggested that the invoices were forgeries. On the facts, only the second and third conditions ofLadd v Marshallwere satisfied. 30        In allowing the appeal, Butler-Sloss LJ said: Fraud or deceit, which is proved, goes to the root of the litigation and may vitiate the decision of the court. If the allegations are relevant and comply with conditions 2 and 3 of Ladd [v] Marshall, and a prima facie case is disclosed, unless the applicant has not acted in good faith, such as by deliberately not raising the issue at court with knowledge of the fraud, a court would look very carefully at the possibility of a miscarriage of justice if he were shut out from a rehearing of his case. … [I]n cases of deception or impropriety or fraud, condition 1 is to be considered with a greater degree of flexibility than cases in which such serious allegations are not raised, and too strict an adherence to those important guidelines in Ladd [v] Marshall should not inhibit a consideration by the court of the justice of the case. [emphasis added] 31        InSaluja v Gill([25]supra), Laddie J concluded at [28] that while in most cases the application of theLadd v Marshallprinciples achieved justice for both parties by ensuring that they were not subjected to unnecessary and/or vexatious serial litigation, there were rare cases in which the rigid application of the rules might engender injustice. In these exceptional cases, the court had the power to employ its wide discretion to assess with some latitude the adduction of new evidence. 32        In the prevailing circumstances of that case,Laddie J held that the first condition ofLadd v Marshallhad been satisfied. Crucially, however, Laddie J noted at [59] thateven ifthe case did not fall within the normal application of theLadd v Marshallprinciples, he would nevertheless have adopted the same approach taken by the court inBrodie, because there was a significant risk that Gill’s evidence had been fraudulent and that a particularly harmful miscarriage of justice could have been perpetrated. 33        It is also profitable to make some reference to the decision of the House of Lords inLinton v Ministry of Defence[1983] NI 51. In that case, Lord Scarman unequivocally observed (after itemising theLadd v Marshallconditions): I would add that these conditions are not exclusive of other possible special grounds.Deception or impropriety at trial may well constitute a special ground for admitting fresh evidence. [emphasis added] 34        On the facts, the appeal was dismissed on the basis that the fresh evidence could have been obtained with reasonable diligence. It is important, however, to point out that Lord Scarman also observed: Had the other party deceived the court of trial or had his counsel been guilty of impropriety, I can conceive that the discretion could have been exercised in favour of adducing the fresh evidence: deception or impropriety by an opposing party could be a special ground. But in this case there was neither. 35        We must reiterate, without diffidence, that in the vast majority of cases, theLadd v Marshallconditions ought to be applied strictly. The justification for this strict approach is succinctly embodied in the Latin maximinterest reipublicae ut sit finis litium– meaning that it is in the public interest that there is an end to litigation. Where a litigant has obtained a judgment in a court of justice, he is by law entitled not to be deprived of that judgment without very compelling grounds:Brown v Dean[1910] AC 373 at 374. 36        However, the court should always bear in mind that its overriding constitutional remit and objective is to promote, dispense and achieve justice between the parties as well as uphold public confidence in the even-handed observance of the rule of law. This objective is entirely consistent with the policy offinis litium.As Laddie J has astutely pointed out inSaluja v Gill([25]supra), the justice of the case usually requires theLadd v Marshallconditions to be applied strictly because it would be unfair to repeatedly subject a litigant to retrial merely upon the discovery of new evidence. In a similar vein,finis litiumcannot be invariably and/or rigidly imposed to such an extent that would allow a miscarriage of justice to go uncorrected. In particular, where the fresh evidence uncovers the fraud or deception of the other party, and such fraudstrikes at the very root of the litigation, then, provided the second and third conditions inLadd v Marshallare cumulatively satisfied, the court would, in exceptional circumstances, be prepared to exercise measured flexibility in relation to the application of the firstLadd v Marshallcondition (see [37] below). After all, a judgment that is corrupted at its core by fraudulent conduct is tainted in its entirety, and the whole must fail:Hip Foong Hong v H Neotia and Company[1918] AC 888 at 894. However, we emphasise that the alleged fraud should strike at thevery root of the litigationin the sense that the fresh evidence would be crucial to, or determinative of, the final outcome to be ultimately reached by the court. This requirement is, in fact, very similar to the secondLadd v Marshallcondition save that the evidence must go to the very heart of the matter: see [15(b)] above. It follows that the court will be extremely reluctant to exercise any latitude where the fresh evidence of fraud pertains only to acollateralorancillaryissue. The necessity for such a stringent approach stems, once again, from the principle offinis litiumand is in accordance with our earlier observation that theLadd v Marshallconditions should, in the vast majority of cases, be applied strictly. 37        Whether the fresh evidence is ultimately allowed to be adduced must depend on all the facts and circumstances of the case. It must be further emphasised that even if perturbing circumstances exist, the court will also be most reluctant to allow an application: (a)        if the applicant has not actedpromptlyin making the application; and (b)        where the applicant is perceived as not acting in good faith,eg, where he was aware of but suppressed evidence of the fraud in the earlier proceedings. The courts will not, and indeed must not, allow their processes and the discipline of litigation to be trifled with and/or abused. 38        We admitted the additional evidence on the basis that the HSA Report uncovered a possible fraud perpetrated by the respondent. It will be recalled that the Judgment of 6 July 2006 was entered solely on the basis of the respondent’s testimony confirming his version of events. If it is true that the respondent has acted fraudulently and perjured in the trial court, the entire foundation or root of that judgment would be tainted with fraud. The court will not, indeed, itcannot, sanction such a possible miscarriage of justice. We also note that the appellant had acted promptly in procuring the HSA Report after judgment was entered on 6 July 2006. While she had not exercised reasonable diligence in the preparation of her case and has not given convincing reasons for absenting herself, we certainly did not detect a lack ofbona fideson her part. The respondent, on the other hand, has neither disputed the credibility of the HSA Report nor produced an alternative expert report which may faintheartedly suggest that the findings of the HSA Report are inaccurate. We note that his defence is one of pure denial and is unsupported by any objective evidence. As we entertained plausible concerns as to whether the respondent had obtained his judgment by fraud, and such concerns have not been satisfactorily addressed by the respondent, the application to adduce fresh evidence was allowed. We now pause to address an important aspect of litigation discipline that bears reiteration.",
        "Courts adopt strict approach towards vacation of hearing dates": "39        The present judicial policy in relation to the religious and punctilious observance of hearing dates and minimal tolerance for unmeritorious adjournments has not and will not be modified. This strict judicial policy remains a vital cornerstone that ensures the systematic administration of justice and maximises the optimisation of judicial resources to most advantageously serve the public interest. Court hearing days and time, being scarce and expensive resources, should not be wasted:Tan Huay Lim v Loke Chiew Mun[1998] SGHC 255at [10]. It follows thatstrong compelling groundsmust prevail before the court will consider the exercise of its discretion to vacate trial dates:Chan Kern Miang v Kea Resources Pte Ltd[1999] 1 SLR 145at [13]. InUnilever Computer Services Ltd v Tiger Leasing SA[1983] 1 WLR 856 at 857, the English Court of Appeal clarified that where the court had fixed dates, it would require “cogent reasons” before such dates were vacated. The Singapore standard of “strong compelling grounds” is a higher threshold that requires demonstrably convincing reasons to move a court to exercise its discretion. In this regard, we should also add that the court’s sympathies will certainly not lie with litigants and/or solicitors who exhibit a callous disregard for adherence to trial or hearing dates that have been fixed. Parties and/or solicitors who airily view court schedules and hearing dates as being flexible or elastic will have to accept the usually irreversible consequences if their misplaced assumptions turn out to be incorrect.",
        "Setting aside judgments": "40        After hearing the parties it became apparent to us that there was some confusion amongst counsel in relation to the principles that are to be employed and applied in relation to applications for setting aside judgments. It may therefore be helpful to clarify the position. 41The analysis begins with recognising two broadly different categories of applications involving the setting aside of judgments: (a) cases in which judgment has been given in default of appearance or pleadings or discovery; and (b) cases in which judgment is given after a trial, albeit in the absence of the party who later applies to set it aside. This general categorisation is recognised by the English courts, for example, inShocked v Goldschmidt[1998] 1All ER 372 (“Shocked”) at 377 and the local courts, for example, inVallipuram Gireesa Venkit Eswaran v Scanply International Wood Product (S) Pte Ltd[1995] 3SLR 150. Different considerations apply to each category of cases.",
        "Category (a): Default judgments": "42        As the present appeal is not concerned with the first category of default judgments, only brief comments on this area are called for. Order13 r8 of the Rules of Court specifically provides that the court may, on such terms as it thinks just,inter alia, set aside a default judgment. The basis of this discretion has authoritatively been declared by Lord Atkin in the landmark decision ofEvans v Bartlam[1937] AC 473 at 480: The principle obviously is that unless and until the Court has pronounced a judgment upon the merits or by consent, it is to have the power to revoke the expression of its coercive power where that has only been obtained by a failure to follow any of the rules of procedure. 43        In an application to set aside this type of default judgment, the question of whether there is a defence on the merits is the dominant feature to be weighed against the applicant’s explanation both for the default and for any delay, as well as against prejudice to the other party:Shocked([41]supra)at 379 citingEvans v Bartlam,Vann v Awford(1986) 130SJ 682 andThe Saudi Eagle[1986] 2Lloyd’s Rep 221. This position has been adopted locally: seeHong Leong Finance Ltd vTay Keow Neo[1992] 1SLR 205.",
        "Category (b): Judgment entered after trial in defendant’s absence": "44        In contrast, where judgment has been entered after a trial in the defendant’s absence, thepredominant considerationin deciding whether to set aside the judgment is the reason for the defendant’s absence. InShocked, LeggattLJ itemised (at 381) the other relevant factors that the court should take into consideration: (a)        prejudice – whether the successful party would be prejudiced by the judgment being set aside, especially if the prejudice was irremediable by an order of costs; (b)        applicant’s delay – whether there was any undue delay by the absent party in applying to set aside the judgment, especially if during the period of delay the successful party acted on the judgment, or third parties acquired rights by reference to it; (c)        whether complete retrial required – whether the setting aside of a judgment would entail a complete retrial on matters of fact which have already been investigated by the court; (d)        prospects of success – whether the applicant enjoyed a real prospect of success; and (e)        public interest – whether the public interest in finality in litigation would be compromised. To these broad-ranging factors we would also add the overriding consideration of whether there is a likelihood that a real miscarriage of justice has occurred. This will be discussed in greater detail below. 45        Needless to say, each case depends on its own facts and the weight to be accorded to the relevant factors will have to be evaluated in the light of the factual matrix. The factors adverted to are predicated upon two fundamental interests which may from time to time diverge – the interest in finality in litigation,viz,finis litium, on the one hand, and the interest in preventing a miscarriage of justice on the other. The court thus engages in a balancing exercise by considering all the relevant factors but places added weight on the reasons for the applicant’s absence. As we shall see, where the applicant’s absence was deliberate and not due to mistake or accident, the court’s discretion would generally weigh heavily against setting aside the judgment,even though there may be persuasive countervailing factors. Thus, inShocked, LeggattLJ said at 381 that: Where judgment has been given after a trial it is the explanation for the absence of the absent party that is most important: unless the absence was not deliberate but was due to accident or mistake, the court will be unlikely to allow a rehearing.[emphasis added] On the facts ofShocked, LeggattLJ also considered the various factors listed at [44] above but concluded that these other factors did not tilt the balance in favour of the applicant. As a result, the application was dismissed. 46        This approach has also been affirmed locally inVallipuram Gireesa Venkit Eswaran v Scanply International Wood Product (S) Pte Ltd([41]supra). In that case, interlocutory judgment was entered against a third party in its absence. On an application by the third party to set aside the judgment, Judith PrakashJ noted that the third party put forward no explanation whatsoever for its absence at trial or for its failure to do anything to set aside the judgment for a long period. She held that the case could not be equated to one of default judgment and stated, at 156, [17] that: The third party cannot now come back to the court and insist that the court examines the merits of the third party’s case and gives it leave to proceed because it has a meritorious defencewithout giving any explanation for the course of conduct which led to the judgment against it being given.[emphasis added] Reasons for non-attendance 47        The various reasons for a defendant’s absence may be placed and evaluated on a spectrum of considerations. As will be seen, depending on the cogency of the reasons for absence, the courts may, in exceptional cases, absolve the defendant of such lapses. 48        At one end of the spectrum are cases where the applicant was wholly “innocent”. A good (and perhaps somewhat extreme) example of this type of case is that ofGrimshaw v Dunbar[1953] 1 QB 408. In that case, the landlord commenced an action for possession against the tenant on the ground of non-payment of rent. The tenant paid the arrears of rent into court and was then informed by a court official that it was unnecessary for him to attend the hearing of the action. The tenant relied on this advice and did not appear at the hearing, as a result of which judgment was entered against him. JenkinsLJ, sitting in the Court of Appeal, noted that it was material to know the reason why the tenant had failed to appear at the hearing. JenkinsLJ accepted as a sufficient and reasonable explanation the fact that the court official had unwittingly misled the tenant, and allowed the application. 49        At the other end of the spectrum are cases where the applicant hasdeliberatelydecided not to attend the proceedings. The approach of the courts in such cases has generally been unforgiving. Two cases amply illustrate this category of cases. The first case is that ofCraddock v Barber(Court of Appeal (Civil Division), 19February 1986) (“Craddock”). 50        InCraddock, the landlord claimed possession of the premises from the tenant on the grounds that the tenant had acted in such a way as to produce nuisance or annoyance. The landlord requested that the hearing be postponed until such time as he was able to avail himself for the hearing. Despite the landlord’s objections, the hearing date was fixed and the landlord was informed that he had to attend the hearing or otherwise request for an adjournment. Three days before the hearing, the landlord informed the court that he would not be attending the hearing on the scheduled date and would disregard any order entered against him therein. True to his word, the landlord failed to appear at the hearing and on the tenant’s counterclaim, a series of injunctions were made against the landlord. 51        In dismissing the landlord’s application to set aside the judgment, SirNicolasBrowne-WilkinsonVC observed as follows: For myself, I think in a case such as this, where a party has been clearly notified of a date for trialand has deliberately chosen to absent himself, it is a most real consideration to be taken into account in assessing where the interests of justice lie.Certainly the interests of justice require that a man should at least have the opportunity of a trial:but if he chooses to ignore the opportunity given him I see no manifest injustice in not offering him a second opportunity.… [I]t was entirely open to the judge in this case to say that this gentleman had his opportunity, he had contumaciously decided not to take advantage of it, the [tenant] has an order in his favour and to re-open that would be detrimental to him, and balancing those factors reach the conclusion that the interest of justice did not require the order of Judge Galpin to be set aside. [emphasis added] 52        The second case is that ofShocked([41]supra), where the Court of Appeal found (at 382) that the applicant had “buried her head in the sand” and that her non-attendance of the hearing was deliberate. The court held that the applicant’s conduct was “undeserving” and, after considering all the relevant factors, concluded that the other factors did not tilt the balance in favour of the applicant. The application to set aside the judgment was promptly dismissed. 53        Somewhere in the middle of this spectrum are cases where the reason for non-appearance can be attributed to some inadvertent mistake or oversight by the applicant or some unavoidable accident. In this category of cases, the court would generally lean towards granting a new trial, provided the other party is not irremediably prejudiced. A good example is the case ofHayman v Rowlands[1957] 1WLR 317. In that case, the landlord sought to eject the tenant on the ground of non-payment of rent. The tenant did not appear at the hearing because he had misread the notice – he mistakenly thought that the hearing was for October, and not September. As a result, he did not appear at the hearing and judgment was entered against him. 54        In allowing the tenant’s application to set aside, DenningLJ observed (at 319): I have always understood that if, by some oversight or mistake, a party does not appear at the court on the day fixed for the hearing, and judgment goes against him, but justice can be done by compensating the other side for any costs and trouble which he has incurred, then a new trial ought to be granted. 55        Similarly, inIn re Barraclough, decd[1967] P 1, PayneJ held (at 11) that: The fundamental principle therefore is that a party should be bound by the decision if he has had an opportunity to appear and oppose the proceedings.But if by some unavoidable accident … a defendant has been prevented from coming to the court and opposing the proceedings, it does seem to me that the court would in the interests of justice … put the matter right. It would lead to a grave injustice if a decision … could not be put right although by mistake or by accident it had been given in the absence of somebody who genuinely wished to come to court and oppose it. [emphasis added] 56        Other examples of instances in which the court set aside judgments entered in the absence of parties who did not appear because of mistake or unavoidable accident are illustrated by the decisions inBurgoine v Taylor(1878) 9Ch D 1,Schafer v Blyth[1920] 3KB 140 andSorrell v Clarke(1965) 109SJ 354. 57        In summary, it can be seen that the reasons for non-attendance will be most severely viewed (vis-à-visthe other relevant factors set out in [44] above) in instances where the applicant’s omission was deliberate and contumelious. In such cases, the court will be most reluctant to set aside the judgment even though there may be other countervailing factors in favour of setting aside. Any such countervailing factors would necessarily have to be very compelling to tilt the balance in favour of setting aside the judgment. On the other hand, where the reason for non-appearance was wholly innocent or due to mistake or unavoidable accident, the court will be more inclined to set aside the judgment. In exercising its discretion, the other factors, such as whether the other party would be irremediably prejudiced, will feature more heavily in the court’s consideration. 58        Returning to the facts of the present case, we note that the appellant contended before the trial judge that her absence at trial was not “deliberate”. This argument was based on a plethora of variegated reasons which we can only politely characterise as being both feeble and unpersuasive. We note that even counsel for the appellant had, at one point during the hearing, acknowledged that most of his client’s reasons for absence at the trial were rather “flimsy” in nature. Further, there were several inexplicable discrepancies and inconsistencies in the appellant’s explanations for her non-appearance. These have already been adequately set out in [27] of the GD and it is unnecessary for us to repeat them here. 59        On appeal, the appellant sought to downplay the discrepancies by focusing on three grounds,viz, (a) miscommunication with third parties in Shanghai and her ex-solicitors in Singapore; (b) Hsieh’s assurances to her that her ex-solicitors could represent her interest at trial; and (c) the appellant’s mistaken assumptions of similarities between civil law proceedings and the Singapore common law system. These grounds were unconvincing and we unhesitatingly rejected them. We need only briefly comment on our reasons for doing so. 60        As to ground (a), the exact nature of the alleged miscommunication was unclear and appeared to be a barefaced attempt to sweep all explained inconsistencies under the carpet. Notably, the appellant failed to offer particulars of the alleged miscommunication. No affidavits were filed by Hsieh or his assistant to plausibly explain the miscommunication. 61        As to ground (b), the trial judge has already correctly noted at [27] of the GD that it was hardly credible that Hsieh would have told the appellant that she was not required to attend the trial. In any case, the said assurance was allegedly made on or about 13June 2006, and these false assurances would surely have been debunked when the appellant sought legal advice from her former solicitors on the consequences of non-attendance on 3July 2006. Further, if the appellant truly believed that her former solicitors could adequately represent her interests at trial without her presence, she firstly would not have sought an adjournment of the trial on 5July 2006 and secondly would have instructed her former solicitors on how to proceed. Instead, the evidence was that even up till 6July 2006, her former solicitor, MrFoo, still had not received any instructions on cross-examining the respondent on his affidavit of evidence-in-chief. 62        As to ground (c), this can only be dismissed as a weakly contrived attempt by the appellant to shore up her untenable position. The evidence was that on 3July 2006, the appellant had sought and received legal advice from her ex-solicitors on the consequences of not turning up for trial. On 4July 2006, the questions became more direct and there was a discussion on the vacation of the trial date. Having been advised by Singapore lawyers on the consequences of being absent from the trial, we found it quite incredible and hardly believable that the appellant still held on to her “mistaken assumptions” about the Singapore common law system. 63        On a consideration of all the facts, we affirm the trial judge’s finding that the appellant’s decision not to attend trial was wholly deliberate in nature and therefore should not be countenanced. The appellant was informed of the hearing well in advance and should have rearranged her other commitments accordingly. She alluded to labouring under miscommunications and misconceptions, but these were, for the most part, unsubstantiated and hardly believable. The appellant then said that she had some urgent, last-minute engagements, but even these reasons were riddled with inconsistencies. In any case, prioritising the meeting on behalf of Natural Beauty over the trial was not an acceptable reason for the appellant’s non-attendance. As established by the authorities cited above, the deliberateness of the appellant’s action certainly weighed heavily against her. We should add that, but for the exceptional circumstances of this case which we shall elaborate on shortly, we would have had no hesitation in dismissing the appeal.",
        "Exceptional circumstances of the case – judgment obtained by fraud": "64        An exceptional feature of the case before us was the real possibility that the respondent had attained the judgment through fraud. Although we make no positive finding on this, we note that this had become a real or live issue in the light of the admission of the HSA Report. 65        The starting point of our analysis is the general proposition that a judgment obtained by fraud cannot be allowed to stand. As Denning LJ held in the famous case ofLazarus Estates Ltd v Beasley[1956] 1QB 702 at 712: No court in this land will allow a person to keep an advantage which he has obtained by fraud. No judgment of a court, no order of a Minister, can be allowed to stand if it has been obtained by fraud. Fraud unravels everything. The court is careful not to find fraud unless it is distinctly pleaded and proved; but once it is proved, it vitiates judgments … 66        In general, a party seeking to set aside a judgment by adducing fresh evidence to show that the earlier court was fraudulently deceived can adopt one of two alternative procedures: (a) he can appeal to the Court of Appeal and seek, on appeal, to adduce the fresh evidence; or (b) he can bring a fresh action in which the relief sought is the setting aside of the judgment fraudulently obtained:Hamilton v Al Fayed (No 2)[2001] EMLR 15(“Al Fayed”) at [8]perLord Phillips of Worth MatraversMR. 67        The case authorities have established that the preferred practice is for the party seeking to impugn the judgment to bring a fresh action to set aside the judgment on the basis of fraud:Jonesco v Beard[1930] AC 298. This practice had in fact originated from the oft-quoted speech of JamesLJ inFlower v Lloyd(1877) 6 Ch D 297 at 301–302, where he said: I agree … that in the case of a decree (or judgment as we call it now) being obtained by fraud there always was power, and there still is power, in the Courts of Law in this country to give adequate relief. But that must be done by a proceeding putting in issue that fraud, and that fraud only. You cannot go to your adversary and say, “You obtained the judgment by fraud, and I will have a rehearing of the whole case” until that fraud is established. The thing must be tried as a distinct and positive issue … [I]f it is true that there was a fraud practised upon the Court, by which the Court was induced to make a wrong decree, the way to obtain relief will be to bring a fresh action to set aside the decree on the ground of fraud. 68        It should be noted, however, that this judgment was given partly on the basis that the English Court of Appeal’s jurisdiction under the Supreme Court of Judicature Act 1873 (c 66) at that time did not include the power to set aside its judgment on the basis of fraud:Kuwait Airways Corpn v Iraqi Airways Co (No 2)[2001] 1WLR429 at [24]. 69        The rationale for requiring a party to commence a fresh action to impugn a regular judgment is clear. Given that fraud is a serious allegation, the court is required to look into all the particulars of the fraud, examine all the affidavits and apply the strict rules of evidence:Jonesco v Beard perLord Buckmaster at 301. Further, it has also been said that since an allegation of fraud is very serious, it should not be decided merely upon the basis of affidavit evidence:Rowan v Mitchell[2005] DCR 694(NZ) at [21]. 70        When is it preferable for a party to commence a fresh action to impugn the judgment instead of applying for a retrial? InAl Fayed([66]supra), Lord Phillips held at [8] that where the fresh evidence, or its effect, was “hotly contested”, the procedure of directing the party to bring a fresh action may prove to be more satisfactory. By “hotly contested”, LordPhillips meant that the veracity of the fresh evidence proving fraud was questionable and could not clearly establish fraud. Thus, inBaldev Singh Sohal v Hardev Singh Sohal[2002] EWCA Civ 1297 (“Sohal”), Sir Martin Nourse remarked as follows at [25]: There is no jurisdictional bar to this court admitting the fresh evidence and dealing with the allegation by way of an appeal.But it should only do so if, in the words of Lord Woolf [inWoods v GahlingsThe Times (29 November 1996)],the allegation of fraud “can be clearly established” or if, in the words of Lord Phillips[inAl Fayed](which come to the same thing) the fresh evidence or its effect is not “hotly contested”.In any other case, the party who complains about the judgment should be left to bring a fresh action to set it aside. [emphasis added] 71        On the facts ofSohal([70]supra), it was alleged that the earlier judgment had been obtained on the perjury of two witnesses who had testified to witnessing the testator execute the will. The court held that the fresh evidence could not clearly establish that the judgment had been procured by perjured evidence. It was largely based on the oral evidence of the two witnesses and their perjury could only be clearly established, if at all, at another trial. The court held (at [30]) that the claimants should thus be left to bring a fresh action to set the judgment aside. 72        Returning to the present facts, we note that the respondent had not disputed the authenticity or credibility of the HSA Report nor produced an independent expert report to counter the findings of the HSA Report. Instead, as we had noted earlier, his sole defence was one of pure denial and his main argument before us was that through trickery on the appellant’s part achieved through superimposition of various documents, his signature had somehow materialised on the SCB Slip. We must confess that we found the respondent’s argumentprima facieunconvincing. 73        In cases where one party seeks to impugn a regular judgment on the basis of fraud following the discovery of new evidence, the court is typically confronted with evidence of perjury based on the oral evidence of witnesses. In such cases where one person’s word is pitted against another’s, an appellate court would naturally be most reluctant to make a finding on whether fraud has been clearly established. This was, however, not the case on our present facts. While the respondent strongly disputed therepercussions or implicationsof the HSA Report, he did not produce any convincing evidence that contradicted theauthenticityorcredibilityof the report. The finding of the HSA Report was clear on its face and it stood unchallenged during the appeal proceedings. In such circumstances, it was unnecessary for the appellant to commence a fresh action to impugn the judgment. In our view, a retrial would suffice. 74        There were certain other circumstances of this case that, cumulatively with the fresh evidence, just about tilted the balance towards ordering a retrial. Firstly, this was not a typical case whereby judgment was rendered after a full hearing had taken place. In those cases, in the interest offinis litium,the court is naturally more reluctant to set aside the judgment. In contrast, there had not been a full hearing on the present facts. Here, the appellant and her witnesses never appeared for the hearing. Her affidavits and those of her witnesses were therefore not admitted in evidence. Indeed, her counsel did not even cross-examine the respondent to test the veracity of his evidence. Judgment was thus entered solely on the basis of the respondent’s uncontested evidence. Secondly, we note that the appellant had acted promptly in appointing new solicitors and within the relevant time limits applied to set aside the judgment. Judgment was entered in favour of the respondent on 6July 2006 and on 20July 2006, the appellant filed Summons No3286 of 2006 to set aside the judgment. This was within the 14-day time limit contemplated by O35 r2 of the Rules of Court. We note also that pursuant to Direction No138 of 2006 filed on 17November 2006, the appellant has already paid a sum of $479,000 into court,ie, the judgment debt. She has paid this to unequivocally demonstrate her good faith in pursuing the setting-aside application. This was also not an irrelevant consideration in arriving at our decision to allow the appeal. 75        In addition to the above, we note that minimal prejudice would be suffered by the respondent should a retrial be ordered. When queried, counsel for the respondent could not point to any real or irremediable prejudice that his client would suffer. The only prejudice that the respondent would suffer is the wastage of time and expenses he has expended and incurred in defending the appellant’s application. This is easily remediable by an appropriate costs order. Accordingly, we ordered the appellant to pay costs thrown away on an indemnity basis for the hearing on 6July 2006. We were also concerned whether the respondent would be adequately secured as to costs and the judgment sum in the event of a retrial. After taking into account all the circumstances, we ordered the appellant to pay an additional sum of $50,000 into court as security for costs for the retrial.",
        "Conclusion": "76        It should be remembered that the court’s paramount objective in every case is to unswervingly promote and achieve justice. In relation to the adduction of fresh evidence on appeal, the even-handed administration of justice generally requires that theLadd v Marshallconditions be punctiliously applied so as to ensure that a successful litigant is not vexed by the vagaries of further litigation in being subjected to a retrial upon the discovery of fresh evidence. Litigants must understand that they will only be allowed a single opportunity to contest an action. However, rare cases occasionally demand some flexibility in relation to the application of the firstLadd v Marshallcondition. These are cases where the fresh evidence uncovers the fraud or deception of the other party and such fraud strikes at thevery root of the litigation. Here in the very limited circumstances alluded to earlier, the courts will generally refuse to sanction a miscarriage of justice. 77        The courts endeavour to maintain a firm and consistent policy towards litigants’ adherence to trial and/or hearing dates. When a party applies to set aside a judgment entered after a trial in his absence, the predominant consideration is the reason for his non-attendance. Where the party’s reasons for non-attendance are deliberate and/or contumelious, the courts will, in the absence of exceptional reasons, be usually reluctant to set aside the judgment, even though there are countervailing factors in favour of setting aside. 78        On the facts, notwithstanding the unsatisfactory reasons given by the appellant for her non-attendance at trial, we were of the view that the exceptional circumstances of the case, cumulatively considered (see [74] above), nevertheless marginally tilted the balance in favour of setting aside the judgment. A retrial was ordered as much time and expense would be saved by avoiding separate setting-aside proceedings. It is now unnecessary for the parties to file fresh pleadings. The retrial can be fixed at a much earlier date than if the appellant were to commence a fresh action. Any prejudice that has resulted is easily remediable by appropriate costs orders. We therefore allowed the appeal and ordered the parties to seek further directions from the trial judge. 79        As a final note, we should clarify that the trial judge did not err in dismissing the appellant’s application to set aside the judgment on the basis of what was then before her. At that time, the HSA Report had not yet been procured and tendered in court. On the facts as they stood, the trial judge was justified in finding that the appellant’s decision to absent herself from trial was deliberate and that this constituted a sufficient basis for her to dismiss the application."
    }
}