{
    "case_title": "Britestone Pte Ltd v Smith & Associates Far East, Ltd",
    "ncitation": "[2007] SGCA 47",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1          In the Australian High Court decision ofUnity Insurance Brokers Pty Limited v Rocco Pezzano Pty Limited(1998) 193 CLR 603 (“Unity Insurance”), Hayne J compellingly summarised at [124] the broad philosophy supporting downstream settlements in the following terms: If, without working injustice to the [ultimate payee], the settlement of disputes can be encouraged, the desirability (some may say the necessity) of doing so is obvious. Indeed, in commercial matters, the desirability of settling disputes without recourse to the courts is to be actively encouraged as it is both convenient and pragmatic to do so. However, when a party intends to rely on a settlement as a basis to recover a claim in damages against an upstream defaulter in a liability chain, the courts have to strike an appropriate balance between upholding settlements and assessing the reasonableness of “imposing” a settlement on the ultimate payee, who may not strictly be privy to that settlement. It cannot be right for defaulting parties to be invariably bound by settlements which they are not privy to and have not been consulted about, particularly if liability is still an issue to be resolved. 2          Singapore is an international centre for outsourcing and contract manufacturing. There can be little doubt that the reliability of settlements is often the cornerstone of many commercial arrangements and transactions. The legitimacy that the law will accord to settlements is also of great importance in other multiparty transactions, especially in construction contracts. The resolution of satellite litigation in such a multiparty setting is often fraught with complexity and uncertainty. While the ideal situation will be to resolve all disputes and issues contemporaneously, commercial reality often dictates otherwise. Some claims cannot be crystallised until downstream parties have resolved their disputes. The courts must, therefore, engage in a cautious and scrupulous appraisal when reviewing settlements so as not to impede or deter the use of such a convenient and cost-effective extra-judicial mechanism for resolving commercial difficulties, while ensuring, at the same time, that contractual defaulters are neither unnecessarily nor unfairly penalised. 3          The present proceedings raise squarely an important issue as to the circumstances in which a court may uphold a settlement that a party is seeking to rely on against a third party who has not been directly involved in the earlier settlement process. Must the courts choose only between two stark choices,ie,theprinciplethat a party must prove its losses by establishing through direct evidence what its precise losses are on the one hand andthepragmatismthat encourages the courts to support the sensible extra-judicial resolution of disputes on the other? Is it not open to the courts to approach the resolution of such a conundrum withprincipledpragmatism? Can it not be said that the principle of proving lossfinds expressionin the courts’ scrutiny of the downstream settlement contracts for reasonableness? Ultimately, if liability is not an issue, the true loss suffered by such claimants is in factequivalentto the settlement amount. The courts, in examining the reasonableness of these settlements, are in effect confirming and ensuring that these settlement amounts reasonably reflect the quantum of loss suffered by the claimants. In this sense then, the twin concepts of reasonableness and proof of actual loss are intertwined and, in reality, represent different sides of the same coin. Before we proceed to discuss the applicable law, it would be appropriate to turn first to the facts of the present case.",
        "The facts": "4          Britestone Pte Ltd (“the appellant”) is a company incorporated in Singapore which sources electronic components from traders, distributors and manufacturers for its clients. Smith & Associates Far East, Ltd (“the respondent”) is a company incorporated in Hong Kong which distributes electronic components, semiconductors and computer products. The N F Smith Group, including the respondent, have enjoyed an ongoing business relation with the appellant, the appellant’s holding company (Britestone Limited) and Britestone Limited’s other subsidiaries or associated companies (collectively referred to as “the Britestone Group”) for more than ten years. During this period, the N F Smith Group purchased and sold electronic commodities to the Britestone Group in various countries for sub-sale to their customers. 5          On 11 August 2003, the respondent purchased 52,000 units of “AVX” capacitors bearing the part number “TPSC336K016R0300” from the appellant. On 15 August 2003, the appellant delivered the capacitors to the respondent in Hong Kong. The respondent resold and shipped the capacitors to Celestica Thailand Ltd (“CTL”), a subsidiary of Celestica International Inc, which then installed the capacitors onto printed circuit boards for its customer, EMC Corporation (“EMC”), in Cork, United Kingdom and Franklin, United States of America. 6          In September 2003, CTL discovered that the capacitors supplied by the respondent were in fact counterfeit. This emerged after two capacitors caught fire at EMC’s premises. By an e-mail dated 16 September 2003, AVX Corporation informed CTL that the capacitors were counterfeit. On 25 September 2003, CTL additionally claimed that the capacitors were inherently defective. As a result, a purging exercise was initiated, and the counterfeit capacitors were removed from the printed circuit boards and substituted with genuine capacitors. EMC claimed an amount of US$444,680 from CTL for expenses incurred in the purging exercises undertaken in Cork and Franklin. 7          CTL in turn claimed the same amount of US$444,680 from the respondent. In support of its claim, CTL furnished the respondent with a written summary entitled “EMC Global Summary – Purge Costing” (“the FMC report”). This summary was compiled by Kimberly Aube (“Aube”), who was CTL’s global programme manager in charge of the EMC account at the material time. As CTL agreed to assist EMC in resolving the unhappy situation, Aube became actively involved in the purging exercise. Aube’s summary contained a breakdown of EMC’s purging costs, and is set out in the following manner:  CorkFranklinInitial Purge AssessmentUS$6,405US$20,157Purge ExecutionUS$106,382US$222,201MaterialsUS$18,306US$36,595Management & AdministrationUS$9,443US$6,688Celestica ContractorsUS$18,504-TOTALUS$159,040US$285,641US$444,680 8          Negotiations to assess the damage were carried out between representatives from CTL and the respondent,ie, Ng Lup Wai (“Ng”), CTL’s commodity manager at the material time, and Matthew Henry Hartzell (“Hartzell”), the respondent’s general counsel at the material time. After the initial negotiations, CTL offered the respondent a discount of US$50,000 from the claimed amount. The respondent did not agree to this and insisted on a more substantial reduction. Finally, after nine months of negotiations between CTL and the respondent, a settlement was arrived at on 1 July 2004. The respondent agreed to pay CTL a sum of US$300,000 in full and final settlement of all of CTL’s claims against it. The respondent initially requested to pay CTL US$200,000 by way of a credit memo and US$100,000 in cash. This was rejected by CTL, which insisted that the respondent pay at least US$150,000 in cash. On 13 September 2004, the respondent paid CTL the sum of US$150,000 by way of a wire transfer, and on 15 September 2004, the respondent paid CTL a further US$150,000 by way of a credit memo against CTL’s outstanding account receivables due to the respondent. 9          Throughout the period of negotiations between CTL and the respondent, the respondent repeatedly attempted to contact the appellant to involve it in the ongoing settlement discussions with a view towards seeking a contribution from it to the settlement amount. On 11 June 2004 and 4 August 2004 respectively, the respondent sent letters to the appellant seeking payment of the settlement sum of US$300,000, but there was no reply from the appellant. On 29 September 2004, the respondent’s solicitors sent a letter to the appellant to demand payment of US$309,776 by 8 October 2004. On 8 October 2004, the appellant’s solicitors finally responded to the respondent’s solicitors stating that the appellant would not accede to the respondent’s demand and seeking documentary proof to support the respondent’s claim. More significantly, in the same letter, the appellant’s solicitors said that the appellant was “not notified of the purpose for which [the respondent] had purchased tantalum capacitors from [the appellant]”. This stance has been maintained in these proceedings by Tan Mee Yee (“Tan”), the appellant’s sales manager, who asserted that the respondent did not expressly inform her that it required the capacitors for resale to its customers to manufacture printed circuit boards. 10        On 1 November 2004, the respondent’s solicitors replied to the appellant’s solicitors and furnished the appellant with several documents, including e-mails from AVX Corporation to CTL evidencing that the capacitors were counterfeit, the settlement agreement between CTL and the respondent as well as the credit memo and the wire transfer confirmation evidencing payment of the settlement sum of US$300,000. The appellant’s solicitors, on 9 November 2004, wrote to the respondent’s solicitors denying the allegations that the capacitors which the appellant had supplied were counterfeit. The appellant’s solicitors requested for more documents, including clarification as to how the respondent had computed the alleged settlement sum of US$300,000. On 2 December 2004, the respondent’s solicitors wrote to the appellant’s solicitors asserting that the respondent’s efforts in achieving an amicable settlement for the parties’ mutual benefit were not being satisfactorily addressed. 11        The respondent commenced proceedings against the appellant on 16 February 2005, alleging that the appellant had breached an implied condition of the contract under s 13 of the Sale of Goods Act (Cap 393, 1999 Rev Ed) in failing to ensure that the capacitors would conform to the description “AVX” and the required part number “TPSC336K016R0300”. The respondent claimed the settlement sum of US$300,000 that it had paid to CTL as well as US$2,184 as loss of profits. Ultimately, on 20 March 2006, both parties agreed to a consent judgment by which the appellant admitted liability for the damage caused, leaving the issue of quantum to be assessed by the court. 12        At the hearing for assessment of damages, the assistant registrar awarded damages in the sum of US$302,184 in the respondent’s favour. In addressing the issue of remoteness, Tan attempted to disavow knowledge of the use of the capacitors in printed circuit boards. The assistant registrar, however, accepted the testimony of John Bernhardt Prymmer III, the respondent’s managing director, who stated during cross-examination that the capacitors were used to control the flow of electricity on these boards and “[o]n their own … they do nothing”. We find it helpful to also refer to the assistant registrar’s grounds of decision inSmith & Associates Far East, Ltd v Britestone Pte Ltd[2006] SGHC 186(“GD”).She held (GD at [40]) that: It [was] surely within the [appellant’s] contemplation that the capacitors [might] be sold from customer to customer, and ultimately be used in relation to a [printed circuit board] or some other related use. 13        On the issue of the reasonableness of the settlement reached between the respondent and CTL, the assistant registrar found that there had been sufficient legal advice in the circumstances and held (GD at [48]) that: [A]n in-house legal counsel would certainly seek to settle the claim at the lowest possible quantum. … Hartzell had successfully reduced the initial sum claimed by [CTL], and had not simply accepted the original claim … Further, she noted that opportunities to participate in the settlement negotiations had been given to the appellant in so far as the respondent had made conscious efforts to contact the appellant seeking contribution, but the appellant had “failed to respond” to its letters: GD at [50]. A significant factor that impressed the assistant registrar was the length of the negotiations, which lasted some nine months. The length of this period, she pithily observed (GD at [52]), was: [F]ar from suggestive that the final sum of US$300,000 and the EMC Global Summary were accepted by the [respondent] hastily without due consideration of the merits of [CTL’s] case. Moreover, Matthew Hartzell stated that he had questioned various aspects of the EMC Global Summary, such as “why it cost so much money” and “why rectification and purging had to be done so quickly”. More importantly, we noted that the assistant registrar took into account evidence which demonstrated thebona fidenature of the settlement. She summarised her findings of fact thus (GD at [54] and [57]): 54         … Although Kimberly Aube conceded that certain pages of the EMC Global Summary were submitted by EMC, she clearly considered the entire document to be her own report, albeit prepared with the assistance of EMC. While she stated that certain pages were prepared “100% based on EMC’s input”, she had also testified that she had verified the figures by looking at the corresponding receipts, bills and orders. Kimberly Aube had also incorporated information contained in this document into her own affidavit of evidence-in-chief.When questioned about various parts of the document during cross-examination, she displayed intimate knowledge of all the details of the document. Furthermore, she had personally supervised the entire purging process in Franklin as well as Cork, as well as monitored the operating time, costs and expenses. I find therefore that there is no hearsay as Kimberly Aube had personal knowledge of the details of EMC’s costs. On the contrary, I was impressed by Kimberly Aube’s methodical and meticulous manner of tracing the steps of the entire purging process, as well as documenting all the costs incurred. It can hardly be concluded that it was unreasonable for the [respondent] to have accepted the costs claimed in this document. … 57         In sum, I find that the settlement was a reasonable one. There was proper legal advice given by the [respondent’s] own legal counsel, who had properly taken into account the possibility of incurring exorbitant costs in the event that litigation took place. [CTL] had properly supervised every step of the purging process and was aware of the costs incurred. Matthew Hartzell, on behalf of the [respondent], had also asked for support of the claim. The [respondent] had spent substantial time attempting to reduce the sum claimed by [CTL]. The quantum that was settled for was more than reasonable, since [CTL’s] own costs in purging were finally excluded and only EMC’s costs were claimed. There was also a quid pro quo, as [CTL] was given permission to audit the [respondent’s] work processes in the future.As explained by Kimberly Aube, the large sum for purging was due to the urgency in rectifying the [printed circuit boards]. There were only two weeks for all the products to be repaired and tested to meet EMC’s demands to its customers. On all counts, this was, in my opinion, a reasonable settlement. [emphasis added] 14        The appellant appealed against the assistant registrar’s decision. The resulting registrar’s appeal was heard by a judge, and his decision is reported inSmith & Associates Far East Ltd v Britestone Pte Ltd[2007] 1 SLR 958.The appellant, in the course of that appeal, did not dispute its liability for US$2,184, being the respondent’s loss of profit (see [11] above). The sole issue for determination by the judge was whether the appellant had to pay the respondent the US$300,000 that the respondent had paid in full and final settlement of CTL’s claim against it. The judge dismissed the appeal. He held that the damages were plainly within the parties’ contemplation and were not too remote. He stated at [12] and [16] of his grounds of decision: 12         It is pertinent to note that inMonarch Steamship Co, Limited v Karlshamns Oljefabriker (A/B)[1949] AC 196 at 224, Lord Wright observed that reasonable businessmen “must be taken to understand the ordinary practices and exigencies of the other’s trade or business” and that need not generally be the subject of special discussion or communication. In the present case, Smith and Britestone had traded with each other for a long time and Britestone’s sales manager, Ms Tan, accepted during cross-examination that when Smith ordered the capacitors, it was stated that the capacitors were for its customers. … 16         In the present case, the capacitors sold by Britestone to Smith became an “integral” part of the printed circuit boards in the same way the vinyl film inBence Graphics[see [18]infra] became an integral part of the decals. The fact that it was CTL and not Smith who fixed the capacitors onto the printed circuit boards should not matter in the circumstances of the case,and especially so since the testimony of Smith’s Mr Prymmer that the capacitors sold by Britestone to Smith had no use other than to be installed onto printed circuit boards was not contradicted by Britestone. [emphasis in original] 15        In addition, the judge held that the settlement sum was reasonable and properly arrived at in the light of the legal advice provided by Hartzell and the length of the negotiations between CTL and the respondent. He observed (at [22]–[23] of his grounds of decision): 22         … Mr Hartzell was clearly on top of things for when he was asked how he arrived at the conclusion that more than the settlement sum of US$300,000 would have had to be paid in damages if the parties had not reached a settlement, he testified as follows: [D]rawing on my experience in 20 years of commercial litigation …. I have seen this type of claim both inside and outside private legal practice and legal practice as general counsel of Smith & Associations. In my experience, unless you settle a case where you have a claim of $400,000, you are never going to see a lower number from that claimant. I know from this case, from document[s] I reviewed and discussions with CTL, that we were talking about costs, their lost profits, any time delays, any damage to reputation they might have from their customer and so forth. We did not even know at that time whether the entire problem had been solved. They hurried to get to [sic] customer to fix [the] problem. As legal advisor to Smith, … I know that those damages could only have been worse. 23         It is also pertinent to note that the negotiations between Smith and CTL lasted nine months and that CTL’s own costs in purging the printed circuit boards were finally excluded, leaving only EMC’s own costs to be claimed from Smith.The length as well as the nature of the negotiations suggest that the settlement sum of US$300,000 was not hastily arrived at and without due consideration by Smith of the merits of CTL’s case. [emphasis added] 16        Dissatisfied with the judge’s decision, the appellant appealed to this court. Before us, the same two legal issues that were raised before the judge were once again canvassed. To reiterate, the first issue was whether the damages claimed by the respondent were too remote (“the remoteness issue”), and the second issue entailed a consideration of whether the settlement reached between the respondent and CTL was reasonable and could be relied on as reflecting the actual loss suffered by the respondent (“the reasonableness issue”). We now consider these issues in turn.",
        "The remoteness issue": "",
        "The applicable law": "17        The law in this area is relatively uncontroversial. The appellant’s position was that the damages claimed were not within its reasonable contemplation. At the hearing before us, the appellant’s counsel, Mr Sham Chee Keat (“Mr Sham”), submitted that the fact that the capacitors would only be employed on printed circuit boards was not disclosed to the appellant and, hence, the damages claimed were too remote. This was, with respect, a far too simplistic approach. In view of the unchallenged evidence that the capacitors could not be used as stand-alone items but only on printed circuit boards, the rule inBrowne v Dunn(1893) 6 R 67prima facieapplied. This rule stands for the well-settled proposition that (perColin Tapper,Cross and Tapper on Evidence(Butterworths, 8th Ed, 1995) at p 319, which was cited inArts Niche Cyber Distribution Pte Ltd v PP[1999] 4 SLR 111at [48]; see also M N Howardet al,Phipson on Evidence(Sweet & Maxwell, 14th Ed, 1990) at para 12-13): Any matter upon which it is proposed to contradict the evidence-in-chief given by the witness must normally be put to him so that he may have an opportunity of explaining the contradiction, and failure to do this may be held to imply acceptance of the evidence-in-chief ... In the course of the proceedings before the assistant registrar, Mr Sham did not take issue at all with the respondent’s unequivocal evidence on this issue. In such circumstances, it was not open to the appellant to challenge on appeal, either before the judge or us, the fact that the capacitors could not be used as stand-alone items but only on printed circuit boards. 18        Following from his failure to convince us that the factual finding mentioned in the preceding paragraph could be challenged, Mr Sham then argued that the appellant was not aware of the respondent’s intention to use the capacitors in the particular manner in which they had actually been used. In this connection, Mr Sham attempted to distinguish the present case (wrongly, in our view) fromBence Graphics International Ltd v Fasson UK Ltd[1998] QB 87 (“Bence Graphics”) by arguing that in that case, the defendant knew of the plaintiff’s intention to use the products in a particular manner, while, in this case, the appellant was unaware of any such intention. InBence Graphics, which involved the purchase of vinyl film, the seller knew that the buyer intended to make the vinyl film into identification decalcomania (“decal”) for sale to container owners, who would in turn sell containers marked with the decals to shipping lines and other users. It was a condition of the contract of sale that the film should be able to survive for use in good legible condition for at least five years, and the defendant warranted its quality. The film was defective and some decals became illegible. Otton LJ inBence Graphicsapproved thedictaof Devlin J (as he then was) inBiggin & Co Ld v Permanite Ld[1951] 1 KB 422 (“Biggin & Co (HC)”) at 436, where Devlin J held that “[i]f … a subsale is within the contemplation of the parties, I think that the damages must be assessed by reference to it, whether the plaintiff likes it or not”. For the reasons to follow (see [21]–[23] below), the facts ofBence Graphicscould not be distinguished from those in the present case. Bearing in mind the fact that the capacitors could only be used on printed circuit boards, it must surely have been within the appellant’s reasonable contemplation that the capacitors would be used in such a manner by the respondent. 19        Notwithstanding this preliminary conclusion, it will be helpful to briefly summarise at this point the salient facts ofBiggin & Co (HC)([18]supra), since the case will feature prominently in our later discussion on the reasonableness issue and is also of relevance to the present remoteness issue. InBiggin & Co (HC), the plaintiff, Biggin & Co Ltd, bought defective goods from the defendant, Permanite Ltd. The plaintiff sold the goods to the Dutch government. Subsequently, the Dutch government alleged that it had suffered damage as a result of the resale. The plaintiff agreed to pay the Dutch government an amount in settlement of the claim brought by the latter against it. The plaintiff, in turn, sought to recover from the defendant the amount which it had paid the Dutch government as settlement. At first instance, Devlin J held that the damages which the plaintiff sought to recover were not too remote. He held (at 432): I do not think that the application of the principle is to be determined by the number of links in the chain. If what happened at the end was within the contemplation of the parties, I do not think it matters how long the chain is. He added that the contracts along the chain connecting them must be the same and found (at 432) that: [I]n claims based upon sub-sales by the Dutch government, the description of the compound and any warranties of quality must be substantially the same in all the contracts in the chain. It is not disputed that the necessary similarity exists in the contracts between the defendants and the plaintiffs, and the plaintiffs and the government respectively. … The second qualification is that claims arising after the government knew or ought to have known of the defects in the compound should be excluded. On this point I have already found the facts. 20        Devlin J’s decision was appealed against. Although the English Court of Appeal inBiggin & Co Ld v Permanite Ld[1951] 2 KB 314 (“Biggin & Co (CA)”) ultimately reversed the decision, only one finding was in fact reversed,viz, Devlin J’s conclusion at 430 that: [T]he plaintiffs cannot prove their damages by reference to the settlement which they made with the Dutch government and … evidence relating to such a settlement is irrelevant and inadmissible. This issue relating to the permissibility of relying on a reasonable settlement will be scrutinised in further detail shortly ([25]–[41] below). The English Court of Appeal more recently inBence Graphics([18]supra) approved Devlin J’sdictainBiggin & Co (HC)([18]supra) on the remoteness of damages. The pertinent portions of the headnote ofBence Graphicsread: [T]hat the prima facie measure of damages for breach of warranty of quality provided by section 53(3) of the Sale of Goods Act 1979 would be displaced … [if it was] in the contemplation of the parties at the time the warranty was given that the goods sold would be used in making a product which would be sold on; that in such a case the measure of damages would be based not on the difference between the value of the goods as delivered and that warranted but on the buyer's liability to the subsequent or ultimate users of the product arising from the defects constituting a breach of the seller's warranty; …since the defendants had been aware that the vinyl film would be used by the plaintiffs in making decals which would be sold on to customers requiring five-year durability, the parties must be taken as having contemplated that any latent defect in the film might on becoming apparent render the plaintiffs liable to claims for damages by subsequent or ultimate users and the measure of damages should therefore be based on any such liability of the plaintiffs… [emphasis added] We agree with this common-sense approach.",
        "Application of the law to the facts": "56        Having considered the applicable law, we now return to the facts of the present case. Mr Sham vigorously contended that the settlement sum of US$300,000 was based on a single document that contained summarised information compiled by Aube,viz, the EMC report (see [7] above). He argued that the respondent had failed to make sufficient inquiries or produce other documents to substantiate the quantum claimed. Furthermore, there were no documents to justify the expenses involved in the purging exercise, which included personnel and travelling expenses. It was Mr Sham’s position that all of these supporting documents must be produced by the respondent; otherwise, the settlement was unreasonable. In our view, these submissions mask the deeper evidential principles at play. Legal and evidential burden of proof 57        Indeed, Mr Sham’s contentions on this point bring into sharp focus the crucial distinction between the legal and the evidential burden. When is it the responsibility of the plaintiff in a case to produce evidence to prove his case? Conversely, when is it the responsibility of the defendant to produce evidence to rebut the plaintiff’s evidence? Mr Sham seemingly contended for the position whereby the burden laid squarely and irreversibly with the plaintiff; while this is not entirely incorrect, it would be helpful to clarify the differences between the legal and the evidential burden. 58        The term “burden of proof” is more properly used with reference to the obligation to prove. There are in fact two kinds of burden in relation to the adduction of evidence. The first, designated the legal burden of proof, is, properly speaking, a burden of proof, for it describes the obligation to persuade the trier of fact that, in view of the evidence, the fact in dispute exists. This obligation never shifts in respect of any fact, and only “shifts” in a manner of loose terminology when a legal presumption operates. The second is a burden of proof only loosely speaking, for it falls short of an obligation to prove that a particular fact exists. It is more accurately designated the evidential burden to produce evidence since, whenever it operates, the failure to adduce some evidence, whether in propounding or rebutting, will mean a failure to engage the question of the existence of a particular fact or to keep this question alive. As such, this burden can and will shift. 59        The court’s decision in every case will depend on whether the party concerned has satisfied the particular burden and standard of proof imposed on him. Since the terms “proved”, “disproved” and “not proved” are statutory definitions contained in the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”), the term “proof”, wherever it appears in the EA and unless the context otherwise suggests, means the burden to satisfy the court of the existence or non-existence of some fact, that is, the legal burden of proof: see ss 103 and 105 of the EA. However, this is not to say that the evidential burden, which is the burden to adduce sufficient evidence to raise an issue for the consideration of the trier of fact, does not exist. It exists as the tactical onus to contradict, weaken or explain away the evidence that has been led; there is no distinction between such tactical onus and the evidential burden. 60        To contextualise the above principles, at the start of the plaintiff’s case, the legal burden of proving the existence of any relevant fact that the plaintiff must prove and the evidential burden of adducing some (not inherently incredible) evidence of the existence of such fact coincide. Upon adduction of that evidence, the evidential burden shifts to the defendant, as the case may be, to adduce some evidence in rebuttal. If no evidence in rebuttal is adduced, the court may conclude from the evidence of the plaintiff that the legal burden is also discharged and making a finding on the fact against the defendant. If, on the other hand, evidence in rebuttal is adduced, the evidential burden shifts back to the plaintiff. If, ultimately, the evidential burden comes to rest on the defendant, the legal burden of proof of that relevant fact would have been discharged by the plaintiff. The legal burden of proof – a permanent and enduring burden – does not shift. A party who has the legal burden of proof on any issue must discharge it throughout. Sometimes, the legal burden is spoken of, inaccurately, as “shifting”; but what is truly meant is that another issue has been engaged, on which the opposite party bears the legal burden of proof. The burden of proof in this case 61        For the purposes of the present case, in showing that the settlement between the respondent and CTL was reasonable, we find it useful to borrow the words of Singleton LJ inBiggin& Co (CA)([20]supra) at 325: The plaintiffs must establish a prima facie case that the settlement was a reasonable one. If the defendants fail to shake that case, the amount of settlement can properly be awarded as damages. To this end, it was for the plaintiff/respondent to discharge its legal burden on a balance of probabilities. In contrast, as mentioned above (at [58]), the evidential burden is not stagnant. We were satisfied that the respondent hadprima facieshown that the settlement figure was reasonable. The respondent had provided adequate particularisation of the process and methodology adopted in arriving at the settlement sum. It was certainly open to the appellant to articulate, at an early stage, its objections, if it had any. This, the appellant failed to do, and, despite the respondent’s several requests for its involvement in the settlement process, it continued to give the respondent the cold shoulder. 62        Several other factors supported our conclusion that the respondent hadprima facieshown that the settlement reached was reasonable. First, the negotiations were long and protracted, with deep discounts given by CTL before they culminated in the eventual settlement sum of US$300,000. Second, Aube had painstakingly verified the figures in the EMC report which CTL used in support of its claim of US$300,000 against the respondent. Third, the settlement negotiations were carried out with legal advice from the respondent’s in-house counsel. Fourth, the respondent has already made full payment of the settlement sum to CTL. Fifth, the respondent’s attempts to engage the appellant and seek its participation in the settlement process fell on deaf ears. Sixth, the settlement process between CTL and the respondent was conducted at arm’s length.  The evidential burden thus moved to the appellant to show that the settlement was not reasonable. 63        It should be noted that the initial proposed settlement amount was US$444,680. This was much greater than the final settlement sum of US$300,000. Aube had verified the figures, and it was for this very reason that CTL eventually agreed to the settlement. It bears mention that the respondentdidpay CTL the settlement sum of US$300,000 without having an assurance that it would be reimbursed by the appellant. If the respondent was not satisfied with the quantum, it would, in all likelihood, have disputed the quantum. As Singleton LJ wryly remarked inBiggin & Co (CA)([20]supra) at 325, “[n]o one can think that a person or a company will agree to pay [£43,000] damages lightly”. In other words, we agreed that the respondent would not have paid US$300,000 as the final settlement sum if it did not think that the sum was reasonable. 64        We also noted that the settlement was not hastily concluded; it was negotiated and moulded through nine months of serious negotiations between Ng and Hartzell, with an initial discount of US$50,000 on the claimed amount of US$444,680, and finally resulted in the settlement sum of US$300,000 (see [8] above). Taking into account,inter alia, Aube’s painstaking verification efforts to ascertain the accuracy of the figures in the EMC report, it is apparent that the respondent behaved in a commercially reasonable manner.",
        "The reasonableness issue": "",
        "The authority ofBiggin & Co (CA)": "25        On the reasonableness issue, the English Court of Appeal decision ofBiggin & Co (CA)([20]supra) stood as a formidably unfavourable authority against the appellant. The English Court of Appeal inBiggin & Co (CA), it will be remembered, had reversed Devlin J’s decision on just one issue (see [20] above]. It disagreed with Devlin J that the evidence of the settlement between the plaintiff and the Dutch government was irrelevant because the making of the settlement had been a voluntary act by the plaintiff. In this regard, the English Court of Appeal held at 325: If, upon the evidence, the judge is satisfied that the damages would be somewhere around the figure at which the plaintiffs had settled, he would be justified in awarding the settlement figure. … The plaintiffs must establish a prima facie case that the settlement was a reasonable one. If the defendants fail to shake that case, the amount of settlement can properly be awarded as damages. In this connection, Mr Sham relied on the Australian High Court decision ofUnity Insurance([1]supra) and the Australian Court of Appeal decision ofWhite Industries Qld Pty Ltd v Hennessey Glass & Aluminium Systems Pty Ltd[1999] 1 Qd R 210 to water down the standing of the English Court of Appeal decision ofBiggin & Co (CA), which had been earlier adopted by this court inBrown Noel Trading Pte Ltd v Donald & McArthy Pte Ltd[1997] 1 SLR 1(“Brown Noel Trading”). 26        The appellant contended that the legal standing ofBiggin & Co (CA)([20]supra) has now been considerably diminished, and maintained that the Australian courts have recently declined to follow that decision. Mr Sham argued thatUnity Insurance([1]supra) had criticisedBiggin & Co (CA)for its failure to consider issues of causation and remoteness, and relied, in purported support of his stance, on certain observations of McHugh J at [31] and [34]–[35]: 31         With great respect to the Court of Appeal, the reasoning is far from clear. First, it is not clear whether their Lordships even considered issues of causation and remoteness. Perhaps their Lordships assumed that the settlement was causally connected with the breach and that it was not too remote a consequence of that breach if the settlement was reasonable. But they did not say so. Moreover, the reference to public policy in the judgment of Somervell LJ suggests that they did not consider the case in terms of causation or remoteness. … 34In my opinion, Biggin should not be used as an authority in this country.… … 35         … Somervell LJ expressed the opinion that, while the client can prove that the settlement was made as the result of legal advice, the evidence of the advisers is not ordinarily relevant or admissible. With great respect, I am unable to accept that the evidence of legal advisers is not normally relevant or admissible in such a case. On the contrary, in most cases where the settlement is made on legal advice, the evidence of the relevant legal advisers is vital. [emphasis added] 27        Before we discuss the actual legal issues considered and determined inUnity Insurance([1]supra), it would be helpful to summarise the facts of the case. That was a case where the insured (the respondent) sued an insurance broker (the appellant) for breach of contract in relation to an insurance policy arranged by the broker, the insurer (NZI Insurance Australia Ltd (“NZI”)) having refused to pay on the respondent’s claim. The respondent had leased premises to sell fruit and vegetables. It had appointed the appellant as its insurance broker, and the appellant had arranged an industrial special risks policy for the respondent with NZI. One of the risks covered by the policy was damage to the respondent’s premises and its plant, machinery, stock and contents by fire. The appellant negligently failed to fully disclose the respondent’s claims history to NZI. Subsequently, the premises and its plant, machinery, stock and contents were damaged by fire. NZI refused to pay the full amount which would have been payable under the policy but for the non-disclosure. The respondent brought proceedings against the appellant and NZI, in which NZI paid the respondent a lesser sum of A$900,000 by way of compromise in full settlement of the claim. The respondent continued with its proceedings against the appellant and sought to claim the balance from the appellant. Hayne J made these pertinent observations in relation toBiggin & Co (CA)([20]supra) at [127]: It may be doubted whether the reasons for judgment are as unequivocal as the headnote suggests. Further, there is little discussion of the underlying principles. Other than a reference by Somervell LJ to the law encouraging reasonable settlements, the reasons of the members of the Court do not identify why the settlement should be taken as the measure of the plaintiffs’ damages, and do not discuss in any detail what is meant by “reasonable” in this context. [footnotes omitted] Further, he stated at [135]: The Court of Appeal inBiggin & Co Ltdheld that it was relevant for the client that had compromised to give evidence that this step had been “made under advice legally taken”, but Somervell LJ went on to suggest that the advisers would not “normally” be relevant as admissible witnesses. … I do not accept that the evidence of the advisers would be irrelevant or inadmissible. [footnotes omitted] 28        A more careful and closer reading ofUnity Insurance([1]supra) does not, contrary to Mr Sham’s submissions, suggest thatBiggin & Co (CA)([20]supra) has been wholly disavowed in Australia. Indeed, the headnote ofUnity Insurancestates that: [T]he insured’s damages should be calculated according to the difference between what it would have recovered under the policy [which] the broker ought to have arranged and the amount [which] it recovered under the settlement, as long as the settlement was reasonable when judged objectively by reference to the circumstances at the time, including the reasoning supporting the advice upon which the insured acted in accepting it. This appears broadly consistent with the main holding ofBiggin & Co (CA)aproposthe importance of the objective reasonableness of a settlement. We interpose here to mention thatUnity Insurancehas also recently been applied in the 2001 Supreme Court of Queensland decision ofC A & M E C Mcinally Nominees Pty Ltd v HTW Valuers (Brisbane) Pty Ltd(2001) 188 ALR 439, where Chesterman J held at [65]: It is clear from the judgment in the High Court [inUnity Insurance] that an insured seeking damages from an insurer for breach of its promise to grant indemnity must prove what loss it has suffered by reason of the breach. The loss claimed by the insured must have been caused by the breach and must not be too remote from it in the sense that it must have been reasonably foreseeable and/or within the reasonable contemplation of the parties to the contract when they made it.In some cases proof of such loss will be established by the insured having made a reasonable compromise, but in other cases that will not suffice for the purpose. That case itself illustrates the difficulty of determining the circumstances in which a settlement will be sufficient proof. [emphasis added] 29        Granted thatBiggin & Co (CA)([20]supra) may have been criticised by some members of the court inUnity Insurance([1]supra) for its bare reasoning (and a fair criticism this may well be), this does not detract from the key holding inBiggin & Co (CA)that a settlement can be relied on as against a responsible party if it is reasonable and thereby reasonably reflects actual loss. We noted the appellant’s mantra that the respondent was obliged to prove all the elements of its settlement amount all over again, but that is not, in the final analysis, what the decision of the majority inUnity Insuranceeither stands for or illustrates.Unity Insurancebroadly held that in assessing whether a settlement could be relied on to prove a claim for loss, the court had first to be satisfied that the terms of the settlement were reasonable, and that this acid test comprised an amalgam of considerations. This includes the existence of legal advice and the prospects of success if the dispute had actually been litigated based on the materials available at the time of the settlement. In this regard, the decision ofBiggin & Co (CA)can be said to have been generally endorsed by the majority (Brennan CJ, McHugh and Hayne JJ) inUnity Insurance. To borrow the words of Brennan CJ inUnity Insuranceat [6]: The plaintiff must show that the sum accepted in settlement was reasonable [Biggin & Co (CA)at 321,perSomervell LJ; at 326,perSingleton LJ]. The test of reasonableness is, as Hayne J says, an objective one. Evidence of the advice which the insured received to induce it to accept the settlement is not proof in itself of the reasonableness of the settlement advised. The factors which lead to the giving of the advice are factors relevant to the reasonableness of the settlement but the only relevance of advice given by the insured’s legal advisers to settle is that it tends to negative the hypothesis that the insured acted unreasonably in accepting the settlement. 30        In our view, the Australian High Court inUnity Insurance([1]supra) had rightly expressed its reservations about certain aspects of the English Court of Appeal’s decision inBiggin & Co (CA)([20]supra), in that the latter did not adequately address the principles of causation and treated the issue of remoteness as not relevant. The English Court of Appeal simply assumed the satisfaction of the requisite element of causation and the absence of remoteness. However, the majority inUnity Insurancedid not depart from the approach articulated inBiggin & Co (CA)that before a settlement could be relied on, it had to be reasonable, and a factor evidencing reasonableness was that the settlement had been made pursuant to legal advice. It is this point that is relevant to us in relation to the reasonableness issue, and we find that there is no difference in essence between the broad common-sense approach towards recognising settlements adopted inBiggin & Co (CA)and that adopted inUnity Insurance. Singleton and Birkett LJJ inBiggin & Co (CA)were of the view that the fact that a settlement had been made under legal advice was relevant in determining its reasonableness. With regard to Somervell LJ’s comments at 321 that the evidence of advisers would not “normally be relevant”, it should be noted that Somervell LJ went on to add that: [I]f there is evidence … on which the court can come to the conclusion that this was a reasonable settlement in the circumstances, then ... it should be the measure. It is our view that Somervell LJ, by the above comments, was merely emphasising the importance of the plaintiff leading evidence to prove that the settlement sum was reasonable. 31        In fact, this court’s previous observations inBrown Noel Trading([25]supra) buttress our view that there is no conflict between the two jurisdictions on the relevance of the reasonableness of settlements in determining whether such settlements can be treated as evidencing the actual loss suffered. InBrown Noel Trading, the plaintiffs and the defendants entered into a contract whereby the defendants were to sell steel reinforcing bars to the plaintiffs. The defendants contracted to purchase the same from a third party, with the third party to deliver the goods by a certain date and the defendants to open a letter of credit in favour of the third party prior to that. The defendants opened and delivered the letter of credit to the third party late. Subsequently, the third party informed the defendants that it had problems supplying the goods and offered alternative specifications which the plaintiffs refused to accept. The plaintiffs then commenced an action against the defendants claiming damages for breach of contract, and the defendants in turn commenced third party proceedings against the third party. The plaintiffs and the defendants arrived at a settlement. The third party proceedings carried on. In dealing with the third party proceedings, this court, applying the reasoning inBiggin & Co (CA)([20]supra), concluded (at [67]) that the settlement arrived at was reasonable and thus allowed a claim by the defendants against the third party for the settlement amount: In reaching the settlement the defendants were advised by their solicitors and there was nothing to suggest that their solicitors’ advice was patently wrong or that there was anything suspicious. In all the circumstances, the settlement arrived at was reasonable, and the amount the defendants had paid to [the plaintiffs] should have been allowed. Further, this court held at [70]: In the Australian case ofWong v Hutchison[(1950)] 68 WN (NSW) 55 a trader who failed to deliver goods to his buyer was held liable to the buyer for damages which the latter settled with the sub-buyer. Owen J of the Supreme Court of New South Wales held [that] the settlement reached in that case was prima facie reasonable. He said, at p 58: Apart however from these considerations, it seems to me that where a trader fails to deliver goods and thereby commits a breach of contract to which he has no apparent answer and thereafter proceeds to settle a claim for damages for that breach by making payment of an amount which, on the face of it, does not appear to be exorbitant having regard to the value of the goods which he has undertaken to deliver and the difficulties of replacing them, such a settlement should prima facie be regarded as reasonable, since as a matter of common sense it is surely the exception rather than the rule for a commercial man to settle a claim made against him by paying an extravagant or unreasonable amount because he has a remedy … against a third party who may or may not be worth and [sic] shot.In the absence of anything to raise a suspicion to the contrary, I think it is a fair presumption that a business man who settles a business claim made against him has acted reasonably in doing so. [emphasis added] We do, however, have some reservations in relation to this court’s earlier unqualified adoption of the suggestion (as set out in the above passage) that there is an evidential presumption that business settlements are made reasonably. In our view, thefactthat a settlement has been effected or adopted between businessmen adds nothing to the requirement that the party seeking to rely on such a settlement must show that it is reasonable. Settlements can be made for a number of reasons, not all of which are objectively reasonable. Settlements are sometimes made to preserve business relationships regardless of the legal merits and/or reasonableness of a claim. It is noteworthy that the decision by the Supreme Court of New South Wales inWong v Hutchison(1950) 68 WN (NSW) 55, which this court inBrown Noel Tradingrelied on for this proposition, pre-dates the decision inUnity Insurance([1]supra). Having provided a broad overview of the applicable law and the standing authority ofBiggin & Co (CA), it is perhaps now appropriate to examine the approaches taken by the other common law jurisdictions in greater detail. By undertaking such a comparative approach, we intend to distil certain common guiding principles which can then be applied in the Singapore context.",
        "Approaches in other common law jurisdictions": "The English approach 32        It appears that the approach inBiggin & Co (CA)([20]supra) remains good law in England. Footnote 2 to para 45 ofHalsbury’s Laws of England,vol 4(3) (Butterworths, 4th Ed Reissue, 2002) reads: If the main contractor compromises the employer’s claim arising from the sub-contractor’s breach, the amount paid in settlement is admissible prima facie evidence of the amount of loss and damage caused by the sub-contractor, although liability would still need to be established: see eg [Biggin & Co (CA)]. 33        As we have mentioned (at [30] above),Biggin & Co (CA)([20]supra) stands,inter alia, for the proposition that in determining whether a settlement is reasonable such that it can be relied upon to evidence the actual loss suffered, the courts should have regard to the fact that most settlement agreements are entered into on the basis of responsible legal advice. In addition, it is not the function of the court to dissect the elements of a settlement if it comes to the conclusion that the settlement is, in the round, reasonable. The recent Queen’s Bench Division (Commercial Court) case ofBP plc v Aon Ltd[2006] 1 All ER (Comm) 789 is illustrative of this pragmatic approach sired byBiggin & Co (CA). In that case,Aon Ltd(“Aon”) was appointed by the Amoco group (“Amoco”) as its insurance broker to devise and place a global construction all risks open cover facility (“open cover”) to insure Amoco’s offshore construction projects worldwide. In order to obtain cover in respect of any project, that project had to be expressly declared under the open cover. Amoco merged with BP plc (“BP”). The open cover that was then placed by Aon was a standing offer of insurance that ran for 18 months between 1 January 1998 and 1 July 2000. As is usual with open covers in the energy sector, subject to the projects notified being embraced by the terms of the cover, the projects declared would be binding on the insurers. During the life of the open cover, the market (in which rates for open covers had previously been relatively soft) turned and BP made as many declarations of eligible projects as possible towards the end of the cover period as it could then make considerable savings on the premiums payable. As a result, there was a rush of purported declarations shortly before the expiry of the open cover. Some of the underwriters objected to the cascade of last-minute declarations. BP entered into a settlement agreement with two lead insurers who agreed to accept a number of declarations on certain terms. Although Aon (the insurance broker) persuaded some of the insurers to enter into the settlement agreement, it was unable to persuade a considerable proportion of the insurers (“the defendants”) to do so. BP commenced proceedings against the defendants. These proceedings were later compromised when BP entered into a settlement agreement with the defendants. Subsequently, BP commenced proceedings against Aon based on the latter’s failure to declare projects to each of the defendants within the period of the open cover. BP’s claim was for the shortfall in recovery from the defendants in its earlier action against the latter as well as the costs of that action. One of the defences raised by Aon was in relation to the global settlement which BP had reached. In particular, it was argued that BP had not negotiated vigorously enough with some of the insurers and had, therefore, compromised its rights for too little.In determining the question ofwhether, in all the circumstances, the settlement was reasonable, the court adopted the reasoning inBiggin & Co (CA)and held at [282]–[283]: 282      In this connection, the fact that the terms of a settlement were entered into upon legal advice establishes, at least, that those terms were prima facie reasonable. It is then for the defendant to displace that inference by evidence to the contrary, by establishing, for example, that some vital matter was overlooked (see [Biggin & Co (CA)] at 321 per Somervell LJ). However, the evaluation of the reasonableness of a settlement should not involve the court in arriving at a conclusive judgment on the merits of substantial issues which were contentious in the settled litigation. The court does not need to resolve those issues unless the answer is beyond doubt. The reason for this is that it is testing the reasonableness of the settlement by reference to the perception as to success or failure which the parties would have been expected to hold at the time when the settlement was entered into and the issues remained unresolved: see generallyMander v Commercial Union Assurance Co plc… [1998] Lloyd's Rep IR 93 at 148–149. 283      Further, as Mr Popplewell submitted on behalf of BP, it is only necessary for a claimant to establish that the settlement arrived at was at a figure within the range of what would have been reasonable. This may be quite a wide range because the views of experienced commercial lawyers and businessmen as to the particular strength of their party's case relative to the strength of the opposing party's case can differ quite widely.The test is therefore whether the settlement arrived at was, in all the circumstances which the settling party knew or ought reasonably to have known at the time of the settlement, within the range of settlements which reasonable commercial men might have made. To the extent that such settlement was excessive, the settling party cannot recover. However the range would have to be defined by reference to the benefits and detriments of any settlement for all parties to it. [emphasis added] 34        We find it helpful, at this juncture, to also set out here for comparative purposes the rather similar observations made out by Hayne J inUnity Insurance([1]supra) at [132]: What is a reasonable compromise of the claim will almost always require consideration of the chances of the parties succeeding in their respective claims or defences and that prediction of likely outcomes must always be imperfect and imprecise.To state the obvious, that is why the compromise of a claim, which is a monetary claim that will succeed entirely or fail entirely, will usually fasten upon a figure that is less than [what] would be recovered if the claim were to succeed and why it is that there will be a range of figures within which the reasonable observer may conclude that settlement of the claim would be reasonable. [emphasis added] 35        In another earlier Queen’s Bench Division (Commercial Court) case, Onderlinge Verzekering Maatshcappij “Tegen Zeegevaar” v Hogg Robinson & Gardner Mountain Reinsurance Ltd (5 March 1990) (unreported), the question that the court had to decide was whether the defendants were entitled to succeed in their third party claim against the third party for damages, the main action having been earlier compromised on legal advice. Steyn J (as he then was), in referring to Biggin & Co (CA) ([20] supra), held: The approach that has been adopted is perfectly consistent with established principles. The fact that a settlement was concluded on this basis comes as no surprise, and in dealing with the present indemnity proceedings I am entitled on the principles of [Biggin v Co (CA)] to have regard to the fact that that settlement agreement was entered into on the basis of responsible legal advice. I regard that sum as recoverable. 36        Similarly, it was stated in the Queen’s Bench Division (Technology and Construction Court) case ofBodycote HIP Ltd v Vanguard Engineering Ltd(19 July 2000) (unreported) at [56]: As regards the claim relating to settlement with HIP it was not disputed, save in relation to the question of costs, that the settlement was reasonable. Vanguard are entitled to rely on their settlement to determine the quantum of damages recoverable: see [Biggin & Co (CA)]. As regards the relatively high figure paid in respect of HIP’s costs, I find that this was part of an overall settlement package and that the figure taken overall was itself reasonable. It is not the function of the Court to dissect the elements of a settlement, having come to the conclusion that it was reasonable overall. Vanguard were, therefore, entitled to recover the whole sum paid. 37Biggin & Co (CA)([20]supra) was also adopted in a 1998 Queen’s Bench Division (Technology and Construction Court) decision inP & O Developments Ltd v Guy’s and St Thomas’ National Health Service Trust(1998) 62 Con LR 38 (“P & O Developments Ltd”), where the court held at [30]: A settlement between A and B, however reasonable it may be from the point of view of A and B, cannot determine C’s liability to B. A submission to the contrary was firmly rejected by a strong Court of Appeal inFletcher & Stewart v Peter Jay & Partners(1976) 17 BLR 38 (Megaw, James and Geoffrey Lane LJJ). In that case, the Court of Appeal approved the statement of the Official Referee, Sir William Stabb QC: ‘I am bound to say that I regard the decision inBiggin v Permaniteas being concerned only with the question of whether a reasonable sum paid in settlement of a claim can be regarded as the proper measure of damages in a subsequent action,where liability is not in issue.Where liability is in issue between a defendant and a third party, I cannot think that a defendant can impose liability on a third party by settling a plaintiff's claim against him, where the obligations of the defendant to the plaintiff are the same as those of the third party to the defendant.’ [emphasis added] We respectfully agree with this statement of principle. A prior settlement cannot be imposed when the liability of the alleged defaulter has neither been agreed to nor determined. The Hong Kong approach 38        Similarly, it appears that the approach inBiggin & Co (CA)([20]supra) has been followed in Hong Kong: see the Supreme Court of Hong Kong’s decision inHop Fat Garments Factory Limited v Siber Hegner and Company (HK) Limited[1987] HKCU 93;[1987] HKCFI 214(unreported) (“Hop Fat Garments”). Also, inAtico International (HK) Ltd v Sparko (Far East) Ltd[2006] HKCU 1915;[2006] HKCFI 1025, the Hong Kong Court of First Instance held at [46] that: If the plaintiff reasonably settled [the third party’s] claim out of court, it may recover as damages from the defendant a reasonable amount paid under the settlement (para 17-078Benjamin’s Sale of Goods; [Biggin & Co (CA)]). The Canadian approach 39        The approach established inBiggin & Co (CA)([20]supra) has also been adopted in Canada as well. The British Columbia Supreme Court inMatsumoto Shipyards Limited v Forward Machine Shop Ltd(1984) 25 ACWS (2d) 114;[1984] BCWLD 981observed at [50] that “when a settlement of differences is reached under legal advice, it is prima facie taken to be reasonable: [Biggin & Co (CA)]”. In addition, the British Columbia Supreme Court inWestcoast Transmission Company Limited v Cullen Detroit Diesel Allison Ltd(1986) 39 ACWS (2d) 267 (“Westcoast Transmission”) (the appeal against which decision was dismissed by the British Columbia Court of Appeal inWestcoast Transmission Co Ltd v Cullen Detroit Diesel Allison Ltd(1990) 70 DLR (4th) 503; 45 BCLR (2d) 296; 48 BLR 17) quotedBiggin & Co (CA)at [115] as “the leading case” and did not expressly disapprove of the decision ofBiggin & Co (CA)which it summarised as follows: The Court of Appeal acknowledged that proof of all the facts in a ... complex case might be long and costly (as here) but without proving every detail if the whole of the evidence showed to the judge that the sum paid was a reasonable one and was “in the neighbourhood” of what would likely have been awarded as damages, then the settlement itself was the proper sum. The British Columbia Supreme Court inWestcoast Transmissionfurther held at [119] that “[t]here is no room on our facts for the applications of the [Biggin & Co (CA)] rule” as it found that there was no liability owed. 40        The British Columbia Supreme Court inRivtow Straits Limited v B C Marine Shipbuilders Limited[1978] 2 ACWS 370cited at [77] Harvey McGregor,McGregor on Damages(Sweet & Maxwell, 13th Ed, 1972), which in turn citedBiggin & Co (CA)([20]supra), and agreed at [79] that “the onus rests upon Rivtow to show that its defence was a reasonable one, and the issue is one of fact to be decided by this court”. It further held at [82] that: The circumstances here were very similar to those which existed in the case ofFisher v. Val de Travers[(1875-76) LR 1 CPD 511] as reported in [Biggin & Co (CA)]As Mr. Justice Somerville reports it in theBiggincase, “On receiving notice of H.'s claim the tramway company gave notice to the plaintiffs to meet it, and the plaintiffs handed on the notice to the defendants. The defendants refused to meet the claim, and the plaintiffs were compelled to undertake the case themselves, and forthwith entered into negotiations with H., which eventually resulted in a compromise of the claim for a certain sum paid to H. by way of compensation, with costs of settlement. In an action by the plaintiffs ... against the defendants to recover promise [sic] to H. and the costs the sum paid by way of com [sic], incidental thereto, the jury found that the compromise was reasonable and that the costs were reasonably incurred.” 41        It is clear from our examination of the various jurisdictions above that the courts deem it permissible to refer to the amount reached in settlement between two downstream parties in deciding the amount to be awarded to one of these downstream parties in a claim against an upstream defendant. The broad principle at play is that the claimant must prove its actual loss and, to this extent, the courts adopt the pragmatic approach that if the settlement is reasonably reached and reasonable in nature, the amount agreed therein will be regarded as accurately reflecting the actual loss suffered by the downstream claimant. Indeed, the criterion of “reasonableness” permeates the judicial inquiry as to whether a settlement agreement can be relied upon against an upstream defendant as accurately reflecting the actual losses suffered by a downstream claimant, and the predominant factor taken into account by the courts in assessing reasonableness appears to be whether legal advice was undertaken. As the present case involves the recovery of a prior settlement made with a third party, we think that it would be helpful to clarify the circumstances in which the courts ought to acknowledge such settlements, namely, when liability is not or is no longer an issue between the parties before the court. To recapitulate, liability was not an issue before us (see [24] above).",
        "Relevant considerations to be taken into account in assessing the reasonableness of settlements": "General overview 42        In relation to the relevant considerations to be taken into account in ascertaining the reasonableness of settlements, Lord Eassie inE & J Glasgow Limited v UGC Estates Limited[2005] CSOH 63(“E & J Glasgow Limited”) made the following incisive observations (at [55]) which we found helpful: In my view, there are plainly a variety of methods whereby a settlement of a third party claim may come about, these ranging througha spectrum extending from a direct negotiation or discussion between principals in meetings of greater or less formality to negotiation through lawyers or other agents to ultimate judicial determination at final appellate level. Mr Cormack, for the defenders, whose submissions were unreservedly adopted by Mr Connal, recognised arbitration as one such method within the spectrum. In the event of litigation, judicial reference to a “man of skill” ie an expert, might be appropriate. There is, of course, increasing recognition of the role of alternative dispute resolution procedures in the settlement of commercial affairs. Accordingly I do not consider that – at least at this stage – I can accept the proposition that it was notforeseeable that in advance of the raising of this litigation the pursuers and Kier might confide the settlement of the claims arising between them to a binding expert determination. [emphasis added] 43        We also find it useful to set out Judge Peter Bowsher QC’s observations inP & O Developments Ltd([37]supra) at [38] on when an agreement made with a person who is not a party to the action may be relevant and admissible: Why is an agreement made with a person [who is] not a party to the action relevant or admissible at all? [Biggin & Co (CA)] provides two answers to that question. (a) A rule of evidence. The Court of Appeal in that case stressed that it is the policy of the court to encourage settlements. For that reason, there may be a readiness to accept that individuals settling a claim between them may be taken to have as their purpose trying to reach a settlement at a fair figure related to the claim. … But in many cases, it is inherently unlikely that businessmen, particularly those acting on competent advice, would settle a third party’s claim at a figure significantly in excess of its true value. As Singleton LJ said in [Biggin & Co (CA)] at 325, ‘No one can think that a person or a company will agree to pay £43,000 damages lightly’, but I would add that the reason for the paying party agreeing to make the payment has to be examined. So if a third party’s claim is settled, proof of the settlement may be some evidence of its true value, though not conclusive. The settlement sets a maximum to the claim, and depending on the weight to be attached to it as evidence, it may reduce the degree and detail of evidence required to prove the claim in the action. (b)        The second rule inHadley v Baxendale(1854) 9 Exch 341, [1843-60] All ER Rep 461. The reasonable settlement of claims may be a matter which parties may be held to have had in reasonable contemplation under the second rule inHadley v Baxendale. … Judge Bowsher QC concluded by noting at [39]: To regard [Biggin & Co (CA)] as applying both an evidentiary rule and the second branch of the rule inHadley v Baxendaleis workable and sensible, and I intend so to apply that authority. The application of both aspects of that authority, the evidentiary rule and theHadley v Baxendaleapproach must be fashioned to the facts of the individual case. 44        We accept that businessmen who are equipped with and rendered “competent advice” (perJudge Bowsher QC inP & O Developments Ltd([37]supra) at [38]) will, in all probability, not settle a third party’s claim at a figure which is higher than the true value of the damage. This is a common-sense approach acknowledging that, in the usual course of commercial dealings, parties prefer to resolve rather than litigate differences. Indeed, such an approach is also utilised by the various jurisdictions which we have examined above. However, this approach is not to be elevated into an evidential presumption or inexorable rule of practice. Each settlement must be assessed on its own merits to ascertain if it is reasonable and, therefore, canprima faciebe relied on: see [31] above. 45        If the parties settle a dispute without giving notice to the third party or the ultimate payee, the courts are more likely to investigate and dissect the settlement terms and process, and will be slower to acknowledge the settlement. However, as in the case here, even if notice has been given to the ultimate payee, who does not raise any objection but merely buries its head in the ground like an ostrich, the courts will nevertheless still have to scrutinise the settlement terms while taking into account the fact that the ultimate payee had earlier declined an opportunity to participate in the process. There is no issue of estoppel or implied acquiescence that can be said to apply to such a situation. The ultimate payee remains free to complain, but the courts may be more inclined to view its complaints with less sympathy, given the fact that it had been provided with an opportunity to voice its objections and give its input, to which it elected to pay no heed. 46        While the determination of the reasonableness of the settlement reached in any particular claim may seem more like an art than a science, having a conceptual framework to evaluate the various factors may assist parties to approach the often elusive touchstone of “reasonableness”. We shall now attempt to do this in non-exhaustive broad terms. Sufficiency of the particulars pleaded 47        First, there must be sufficient detail and particularisation regarding the methodology and process of arriving at the settlement. This does not go to the central question of whether a settlement is reasonable, but operates peripherally to enable that question to be properly answered. Where the particulars of the process surrounding the arrival of the settlement are sparse, the courts would be less deposed to find that the settlement was in fact reasonable. This has more to do with the lack of proof that the settlement was in fact reasonable than with any substantive shortcomings of the settlement itself. As Lord Eassie stated inE & J Glasgow Limited([42]supra) at [57]: [I]t is difficult to see what further useful specification of factual matters could be provided as respects this first complaint of lack of specification. The relationship between the parties is well spelled out; there is prior correspondence; and the terms of the Fiddes report itself. … It is of course open to the defenders to articulate substantial objections both to the decision to remit to Mr Fiddes or to the reasonableness of the conclusions or methodology of Mr Fiddes’ report and determination ... 48        Likewise, Gavin Lightman QC, sitting as a deputy judge of the English High Court, pithily observed inSeven Seas Properties Ltd v Al-Essa (No 2)[1993] 1 WLR 1083 at 1089: The sum claimed in respect of the compromise likewise I would have rejected, for it is neither pleaded nor proved that the settlement was a reasonable one to enter into. The onus was on the plaintiff to do this if it was to seek to recover this sum from the defendants: see [Biggin & Co (CA)].It is not sufficient for the plaintiff merely to plead the compromise without any explanation as to how the figure was made up or arrived at or any evidence as to how or why or on what advice it was entered into. [emphasis added] The “reasonable businessman test” General considerations 49        With the detail and particularisation regarding the methodology and process of arriving at the settlement in place, the courts can then proceed to examine whether the settlement was in fact reasonable. The approach taken by the courts in so determining can be broadly characterised as the “reasonable businessman test”. InHolland Hannen & Cubitts (Northern) Ltd v Welsh Health Technical Services Organisation(1985) 35 BLR 1, the English Court of Appeal emphasised (perLawton LJ at 15) that: There was no evidence that, when making the compromise, [the] parties to it took into consideration any extraneous matters such as lack of insurance cover or liquidity problems.All acted in a businesslike wayand those who decided to compromise, in my judgment,acted as reasonable businessmen would have done; butwhen considering the relevance of the compromise to the assessment of the damageswhich AMP would have to pay CED if adjudged negligent,the court has to considernot the reasonableness of the conduct of the parties but thereasonableness of the compromiseitself: see [Biggin & Co (CA)]. [emphasis added] There must be some logical basis for arriving at the settlement sum, which cannot be simply plucked out of thin air. In the final analysis, as stated above, all the sub-factors showing such logical basis (which will be discussed in greater detail below at [50]–[54]) can be encapsulated in an overriding test which is based on the viewpoint of the “reasonable businessman”. In other words, the pertinent question which the courts must answer is this:What would a reasonable businessman have done in the circumstances of the case? 50        To our minds, “reasonableness” can, in this context, be assessed by a few objective factors. First, it must have been reasonable, in the context of the case, for the downstream claimant to settle the claim brought against it. Second, the downstream claimant must have acted reasonably in obtaining advice from an expert (which can include legal counsel). We must add, however, that the taking of external advice is only a signpost and not a requirement to evidence reasonableness. Third, the methodology underpinning the assessment of damages must itself be objectively ascertainable and reasonable. Ultimately, a reasonable businessman would, first and foremost, strive to act with determination to protect his own business interests. Such a person would not attempt to settle for a sum which is in excess of his legal liability or the true value of the damage caused. There is a real need to be wary of excessive settlement amounts that may sometimes be hastily reached to preserve business relationships. Such settlements should not be imposed on third parties as they will not pass muster as being objectively reasonable. As such, the courts have to take into account the business matrix and the negotiating position of the parties in order to ascertain that the settlement figure was not excessive or, put another way, beyond the parameters that reasonable businessmen would have agreed upon. By pegging the test at the level of the “reasonable businessman”, the issue of settlement figures being too high, or even too low, can, in most instances, be satisfactorily resolved. It also bears mention that the touchstone ofreasonablenessis often employed by the law in assessing whether claims are generally recoverable. For example, Harvey McGregor,McGregor on Damages(Sweet & Maxwell, 17th Ed, 2003) at para 2-030 states: Many types of expenses may be incurred by the claimant as a result of the breach which will constitute a recoverable loss.Reasonableexpenditure by the claimant in inquiring and searching for goods, the delivery of which has been delayed by the defendant carrier, has been allowed; the same would apply in the case of goods lost by a carrier, or where their non-delivery or delayed delivery is under a contract of sale. [emphasis added; footnotes omitted] 51        Hayne J inUnity Insurance([1]supra) also discussed in some detail what is meant by “reasonable” settlements, and we have also found this instructive. First, Hayne J held at [129] that: [The settlement] must be judged objectively, not subjectively. Thus whether a party to litigation has received advice to settle may be important in deciding whether that person’s conduct in settling the case was reasonable but, standing alone, the fact that a litigant was advised to settle at a particular figure reveals little or nothing about whether the settlement reached was reasonable. Second, Hayne J stated at [130] that: [T]he settlement … must be judged by reference to the material the parties had available to them at the time the compromise was reached. It is not to be judged according to whether material which was obtained later shows that the opposite party could or could not have prosecuted or defended the claim successfully but according to the assessment which could properly be made at the time of settlement of the chances of success or failure. 52        Essentially, the plaintiff must show that he has assessed the settlement figure as any reasonable litigant would, and he has to further satisfy the court that he has properly evaluated and tested the underlying evidence supporting the settlement amount. To merely show that legal advice was taken in making the settlement may notper seaid the plaintiff’s cause in proving that the settlement was reasonable. The settlementprocessis of crucial importance. COMPETENT ADVICE 53        In connection with the earlier discussion about the relevance of legal advice, it bears mention that reliance on “competent advice”, be it from a legal, industry or other appropriate expert, goes towards showing that the claimant behaved reasonably in arriving at a just settlement. It is noteworthy that, in our view, competent advice need not encompass a legal quotient. We recognise that in certain specialised fields, the best specialist to provide appropriate advice may well be the industry expert himself. We find support for this view from Lord Eassie’s decision inE & J Glasgow Limited([42]supra) at [55], where he used the terms “negotiation through lawyers or other agents” and “judicial reference to a ‘man of skill’ ie, an expert”. This is a timely juncture to emphasise that there is often a very real distinction between the disparate considerations of whether the claimant acted reasonably in arriving at a settlement and whether the settlement itself was reasonable. Singleton LJ inBiggin & Co (CA)([20]supra) correctly noted (at 326) that “[t]he question is not whether the plaintiffs acted reasonably in settling the claim, but whether the settlement was a reasonable one”. However, we note that Judge Bowsher QC inP & O Developments Ltd([37]supra) at [43] adopted a different view: [A]dvice received by the plaintiffs might go either to the question whether the plaintiffs acted reasonably or to the question whether the settlement was reasonable, or both. Moreover, whether the plaintiffs acted reasonably may have an evidential bearing on whether the settlement was reasonable. Judge Bowsher QC’s approach, is in our view, consistent with the “reasonable businessman test”. We have earlier acknowledged (at [41] above) our acceptance as correct the principle that a reliable settlement has to be reasonable, and a factor evidencing reasonableness is that the settlement was made pursuant to legal advice. In short, the availability of competent advice, legal or otherwise, is a factor which the courts will consider in determining whether the parties acted reasonably, and this in turn goes towards showing whether the settlement itself is reasonable. We emphasise that reliance on legal advice is not necessarily or invariably a decisive consideration in the crucible of reasonableness. This must be a question of fact assessed in the totality of the factual matrix. Summary of relevant considerations 54        It will be helpful to summarise the relevant factors to be employed in assessing whether a settlement would pass muster as being reasonable. When a downstream claimant seeks to subsequently rely on an earlier settlement as reflecting the actual loss which he now claims against an upstream defendant, the courts should usually consider the following matters in determining whether he has acted as a responsible and reasonable businessman in arriving at the settlement: (a)        the duration or period of negotiations as well as their general content; (b)        whether there are any customs of trade or previous business dealings between the parties and/or whether there are any legitimate business considerations or contractual requirements (eg, dispute resolution clauses,etc) enjoining a settlement ; (c)        whether the negotiations were conductedbona fide; (d)        the assessment which could properly be made at the time of settlement of the prospects of success or failure of the claim based on materials then available; (e)        the availability of and/or reliance on legal advice, expert advice or independent survey reports taking into account considerations of cost and time; (f)         whether the actual settlement itself was arrived at arm’s length; (g)        whether there was an opportunity accorded to the third party/ultimate payee to be involved in the negotiations; (h)        whether there was a positive reception of complaints by the third party/ultimate payee; (i)         whether the settlement amount has been paid, and, if so, how and when; (j)         the bargaining strengths of the parties involved in the settlement, taking into account (among other things) alternative means by which the dispute could have been concluded; (k)        whether, in the round, the settlement figure was objectively assessed and properly calibrated against the context of the entire factual matrix; and (l)         the practical consequences of the decision on reasonableness. 55        The courts will assess these factors in a holistic fashion. We must emphasise that these factors are neither exhaustive nor to be viewed as anything more than a rough-and-ready practical guide. The broad policy of the law is to encourage settlements without insisting on technical and arid assessment of each item of evidence. The strict proof of evidence on a line-item basis can often be dispensed with, particularly where the costs involved would be disproportionate to the need for veracity. On the other side of the coin, it should also be pointed out that an “unreasonable” settlement may undermine any evidential foundation to prosecute a claim, and yet nevertheless set a ceiling for any later pursuit of the same claim. Further, if it can be shown that the settlement of a claim was wholly unreasonable, the upstream defendant can also plausibly assert that there has been a break in the chain of causation, thereby precluding the downstream party’s claim in any form whatsoever. These are important considerations that businessmen and their advisers must bear in mind when they attempt to reachad hocsettlements in a multiparty setting.",
        "Conclusion": "65        The analysis of whether a settlement is reasonable ultimately calls for the application of a common-sense approach, or put another way, principled pragmatism. A careful consideration of the evidence in the present case showed that there was absolutely no basis for the appellant to argue that the settlement between CTL and the respondent was not a genuine arm’s length settlement and was not reasonable. Given that the negotiations took a period of nine months, with Aube rigorously scrutinising the claim, we rejected, without diffidence, the appellant’s submission that the settlement amount was unreasonable. 66        Before we conclude, it may be useful to touch on the role of in-house counsel in such settlements. On the facts, the respondent’s in-house counsel played a key role in the settlement negotiations. We would like to highlight that it is not essential for legal advice to be invariably sought from external counsel. As long as the advice given is, when objectively viewed, independent, sensible and rational, it will be accorded some weight, regardless of the source. In other words, the identity of the legal adviser is not critical – what is crucial is, instead, whether the legal advice given is indeed prudent, sound and consistent with established legal principles. A party that relies on advice to arrive at a settlement must be prepared to have the reasonableness of that advice scrutinised, and even tested, if and when it seeks to invoke that settlement against an upstream defaulter. A settlement that is able to withstand the objective rigour of a court’s scrutiny and inquiries is one that has been concluded on reasonable terms. 67        This decision also serves as a timely and salutary illustration that if parties, in particular, middlemen and part procurers, omit to include in their contracts clauses that legitimately limit their potential liability, they may find themselves confronted with responsibility for significant consequential losses. 68        On the facts, it was plain that the damages claimed were not too remote and the settlement between the respondent and CTL was reasonable. We therefore dismissed the appeal with costs."
    }
}