{
    "case_title": "Yamashita Tetsuo v See Hup Seng Ltd",
    "ncitation": "[2008] SGCA 49",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "46        We have had the advantage of reading in draft the judgment of Chao Hick Tin JA, in which he took the position that this appeal should be dismissed. After careful reflection, we have reluctantly arrived at a different conclusion and have decided to allow the appeal. We now set out the reasons for our decision separately. 47        This appeal concerns the interpretation of a deed of settlement entered into between See Hup Seng Ltd (“the respondent”) and SHS Holding (Pte) Ltd (“SHSH”) on 29 September 2003 (“the Deed”). As at that date, SHSH was a major creditor and the fourth largest shareholder of the respondent. 48        Mr Tetsuo Yamashita (“the appellant”) was subsequently assigned rights under the Deed. A dispute arose between the appellant and the respondent over the amount that the appellant was entitled to be repaid in cash under the terms of the Deed. The appellant commenced an action against the respondent in the District Court to recover the alleged balance of $118,309.60 due to him (“the Balance Sum”). The district judge who heard the case (“the District Judge”) gave judgment for the appellant, but, on appeal, her decision was reversed by a judge of the High Court (“the Judge”) (seeYamashita Tetsuo v See Hup Seng Ltd[2008] 2 SLR 1040(“the GD”)), who also granted the appellant leave to appeal to this court.",
        "Factual background": "",
        "The efforts to rescue the Company": "3          In 2003, the Company was on the verge of insolvency. SHSH was a creditor of the Company to the tune of $4,043,337.50. In order to salvage the Company, there was a need to inject fresh capital and make arrangements as to the debts owed by the Company to its creditors. Meadow Springs Enterprises Ltd (“Meadow Springs”) emerged as the white knight which was prepared to rescue the Company by investing in it. To that end, an elaborate arrangement (“the rescue plan”) was worked out. As part of this arrangement, on 29 September 2003, Meadow Springs entered into an agreement with SHSH to acquire some 30,813,440 shares which the latter owned in the Company (“the S&P Shares”), representing approximately 28% of the Company’s issued share capital, at the price of $0.0475 per share on condition that the Company’s debts then owing to SHSH (which debts were repayable upon demand) were restructured. Thus, the Deed, which was intended to effect the debt restructuring, came into being as an indispensable part of the rescue plan. A similar deed was also entered into between Lim and the Company in relation to the debts owed by the Company to him. 4          Furthermore, as part of the rescue plan, Meadow Springs also entered into the following agreements on 29 September 2003: (a)        a call and put option agreement with Lim in respect of all of his 36,112,500 shares in the Company (“the TL Shares”), which constituted approximately 32.82% of the Company’s issued share capital; and (b)        a call and put option agreement with SHSH and Linguafranca Co Ltd (“Linguafranca”) in respect of the shares that each of them owned in the Company (collectively, “the SHSH-LF Shares”), which, taken together, came up to 22,924,060 shares and represented approximately 20.83% of the Company’s issued share capital. The actual text of these two call and put option agreements (“the Agreements”) was not disclosed in these proceedings. However, according to the official announcement made by the Company to SGX via MASNET on 29 September 2003, which was tendered to the court,[note: 1]the effect of the Agreements was as follows. First, under the call option aspect of the Agreements, Meadow Springs was entitled, within six months of the date of the Agreements (the “Call Option Period”), to acquire the TL Shares and the SHSH-LF Shares from Lim and from SHSH and Linguafranca respectively at the price of $0.0475 per share. Second, under the put option aspect of the Agreements, Lim as well as SHSH and Linguafranca were entitled, within a period of five market days immediately after the expiry of the Call Option Period, to require Meadow Springs (if it did not exercise the call option) to buy the said two lots of shares at the same price of $0.0475 per share. Third, Lim and SHSH, being the holders of 10,833,750 detachable warrants and 16,121,250 detachable warrants respectively, which warrants could be converted into the same number of shares in the Company at the price of $0.11 per share, had a right (if the warrants were converted) to offer to sell to Meadow Springs, within seven months from the date of the Agreements, the 10,833,750 shares and the 16,121,250 shares respectively at a price to be determined in accordance with a prescribed formula. If Meadow Springs did not accept the offer, Lim and SHSH could sell those shares in the open market. 5          Under the Deed, the debts owed by the Company to SHSH were apportioned into two parts, one part consisting of the sum of $1,773,337.50 (“the Warrant Liability Amount”) and the other part consisting of $2,270,000 (“the SHSH Convertible Loan”). In this appeal, we are only concerned with the SHSH Convertible Loan. Clause 5.5 of the Deed set out a feature (“the Conversion Feature”) whereby SHSH could convert the SHSH Convertible Loan, either in whole or in part, into shares in the Company at the conversion price of $0.15 per share, with “the relevant principal amount from the SHSH Convertible Loan [to] be utilised and applied to meet such conversion price” (see cl 5.5(a) of the Deed). Clause 5.5 also provided that a minimum of 25% of the SHSH Convertible Loan must be converted into shares in the Company within three years from the date of the Deed,ie, by 29 September 2006 (“the Repayment Date”). The present action centred entirely on the construction of the provisions in the Deed, which I will examine more closely in a moment.",
        "How the dispute between the Company and the appellant arose": "6          In March 2004, SHSH was placed under voluntary liquidation. At the time, Lim owned 32% of SHSH, with Linguafranca owning the remaining 68%. Following its liquidation, the assets of SHSH were distributed between its two shareholders in the following proportions:[note: 2]  The Warrant Liability AmountThe SHSH Convertible LoanLim$567,468(approximately 32%)$1,796,761.60(approximately 79%)Linguafranca$1,205,869.50(approximately 68%)$473,238.40(approximately 21%) 7          Subsequently, Linguafranca assigned its right to its share of the SHSH Convertible Loan (viz, $473,238.40 (“the Assigned Amount”)) to the appellant. Of course, this assignment only meant that the appellant stepped into the shoes of Linguafranca as far as the Assigned Amount was concerned, but, other than that, the rights and obligations of the original parties under the Deed would remain the same as before. By way of a notice of assignment dated 21 March 2006, the Company was informed of the assignment. 8          On 28 April 2006, the Company mistakenly notified Linguafranca’s Ms Carmen So (a representative of and the holder of a power of attorney from the appellant) that, as the option to convert the SHSH Convertible Loan into shares vested in the Company, the latter intended to convert the whole of the loan into shares in the Company. Upon the appellant’s objection, on 8 May 2006, the Company clarified as follows:[note: 3] [The appellant] has the choice of converting the Assigned Loan [ie, the Assigned Amount of $473,238.40] into shares in the Company at the issue price of $0.15 per share at any time prior to the ... Repayment Date on 29 September 2006 or to receive an amount equal to 75% of the Assigned Loan as full repayment of the Assigned Loan on 29 September 2006. The appellant replied stating that he would prefer that the whole of the Assigned Amount of $473,238.40 be repaid to him in cash. 9          On 17 May 2006, Lim opted to convert part of the loans due to him, amounting in total to $2,849,700.00 (which presumably included his entire interest in the Warrant Liability Amount and the SHSH Convertible Loan), into shares in the Company. The Company repaid Lim a balance sum of $75.59 in cash to avoid creating an odd lot of shares. With this conversion, approximately 79% of the SHSH Convertible Loan had been converted into shares in the Company by the Repayment Date. 10        On 22 May 2006, the chief financial officer of the Company notified the appellant (through his solicitors) that he would be entitled to repayment of only 75% of the Assigned Amount if he chose not to convert that entire amount into shares in the Company. Further correspondence ensued between the parties, but the differences between them remained. On the Repayment Date (ie, 29 September 2006, three years from the date of the Deed), the Company repaid the appellant only the sum of $354,928.80 (ie, 75% of $473,238.40). This set the stage for the present proceedings, in which the appellant sought,inter alia, an order that the Company pay him the sum of $118,309.60, being the difference between the Assigned Amount (viz, $473,238.40) and the actual sum repaid (viz, $354,928.80).",
        "The relevant provisions of the Deed": "11        I will now set out the clauses in the Deed which are germane to the issue in hand: 1.1        In this Deed (including the Schedules), unless the context otherwise requires, the following expressions shall bear the following meanings respectively:  ...Sharesissued and paid-up ordinary shares of S$0.10 each in the capital of the Company;SHSH Convertible Loanthe loan of principal amount of S$2,270,000 referred to in clause 2.2(ii) ... ... 2.2        ... (ii)        [T]he … amount of S$2,270,000.00 ... (“SHSH Convertible Loan”) shall be constituted and deemed [to be] a loan owing by the Company to SHSH with effect from the date of this Deed and on the terms and conditions set out in clause 5. ... 5.1        The SHSH Convertible Loan is interest-free ... 5.2        Subject to [c]lause 5.3 below,75% of the SHSH Convertible Loanshall be repaid in cash on the Repayment Date. 5.3Inthe event [that] the Company is unable to obtain all relevant approvalsfor the Conversion Feature or SHSH is unable to exercise the Conversion Feature by reason of such Conversion Feature not being valid or enforceable or otherwise not in full force and effect for any reason whatsoever, the SHSH Convertible Loan,100% of the SHSH Convertible Loan shall be repaid in cash on the Repayment Date. 5.4Notwithstanding anything in this [c]lause 5,the whole of the SHSH Convertible Loan shall become due and payable immediately in cash upon the occurrence of any one or more of the following events:– (i)         if any step is taken by any person with a view to the winding-up of the Company or ... the appointment of a liquidator (including a provisional liquidator), receiver, judicial manager, trustee, administrator, agent or similar officer of the Company or over any part of the assets of the Company; (ii)        if the obligations of the Company under this Deed [cease] to be valid, binding or enforceable in all respects; (iii)       if the Company commits or threatens to commit a breach of any of the terms, conditions, covenants, undertakings, provisions and/or stipulations contained in this Deed on its part to be observed and performed; or (iv)       a distress or execution or writ of seizure and sale or attachment is levied upon or issued against any of the property or assets of the Company. 5.5        Subject to clause 5.6 below, the SHSH Convertible Loan shall have a conversion feature (“Conversion Feature”) whereby SHSH may, but shall not be obliged to, at any time and from time to time from the date of this Deed up to and including the Repayment Date, convert the SHSH Convertible Loanin whole or in partinto Shares subject to the following terms: (a)        the conversion price will be S$0.15 for each Share and the relevant principal amount from the SHSH Convertible Loan shall be utilised and applied to meet such conversion price; once so utilised and applied thatrelevantprincipal amount of the SHSH Convertible Loan shall be deemed fully and effectually repaid; (b)        each exercise of such right will be by way of a Conversion Notice by SHSH to the Company, provided that: (i)         each Conversion Notice must be served between 9.00a.m. and 5.00p.m. on any Market Day falling before (but not on) the Repayment Date; and (ii)        subject to [paragraph] (iv) ... below, no Conversion Notice may be served in respect ofanyprincipal amount of the SHSH Convertible Loan which has been repaid or deemed repaid by the Company; (iii)       except for a Conversion Notice which relates to all of the balance of the SHSH Convertible Loan which can be so converted, each Conversion Notice must relate to 150,000 Shares or an integral multiple thereof; and (iv)inthe event [that] less than 25% of the SHSH Convertible Loan has been converted into Sharesas at the Repayment Date (the difference between 25% of the SHSH Convertible Loan and the actual amount of [the] SHSH Convertible Loan converted into Shares [is] to be referred to as [the] “Shortfall Conversion Amount”), a Conversion Notice is deemed to be served on the Repayment Date to convert the Shortfall Conversion Amount into Shares on the terms of this clause 5. 5.6The Conversion Feature shall be conditional upon the Company obtaining all relevant approvals for the Conversion Feature (including without limitation the approval of the Singapore Exchange Securities Trading Limited and, if necessary, [the] approval of the shareholders of the Company) in respect of such rights to convert and of the allotment, issuance and listing of Shares arising from such conversion. [emphasis added]",
        "The decisions below": "",
        "The arguments tendered by the parties in this appeal": "15The appellant submitted that the Judge was wrong in construing the Deed – in particular, cl 5 thereof – to mean that the appellant was entitled to cash repayment of only 75% of the Assigned Amount on the Repayment Date. His main points were the following: (a)        the Judge did not correctly appreciate the nature of a convertible loan; (b)        the Judge did not have sufficient regard to the factual matrix in which the Deed was entered into; and (c)        there was no basis for the Judge to hold that it was reasonable for the holder of the SHSH Convertible Loan to take a 25% “haircut” as the price or premium paid for the Conversion Feature. 16        The appellant’s basic contention was that cl 5.2 of the Deed, read with cl 5.5, reflected a scheme under which at least 25% of the SHSH Convertible Loan was to be converted into shares in the Company by the Repayment Date; once that mandatory minimum requirement was met, the Unconverted Principal Amount as at the Repayment Date (assuming that less than 100% of the Original Principal Amount had been converted into shares by that date) was repayable in full. 17        In contrast, the Company submitted that the Judge had correctly understood the nature of a convertible loan. It argued that the Judge, having carefully considered the Deed as a whole and, in particular, the relevant clauses quoted at [11] above, was correct in coming to the conclusion that, under cl 5.2 of the Deed, the appellant was not entitled to ask for cash repayment of 100% of the Assigned Amount. The Company pointed out that the Judge’s comments on the 25% “haircut” were made in response to the appellant’s argument that it would be unfair, in cases of cash repayment, for 25% of the Unconverted Principal Amount as at the Repayment Date to be forfeited. It was in that context that the Judge stated that he did not think there was anything commercially wrong or outrageous about such an arrangement. The Company also averred that there was no basis for the appellant to contend that cl 5.2 of the Deed was the counterpart of cl 5.5(b)(iv) as neither provision referred to the other, and that the appellant’s argument ignored the fact that, under cl 5.5, a minimum of 25% of the SHSH Convertible Loan had to be converted into shares in the Company by the Repayment Date.",
        "Principles governing the construction of documents": "18        It is settled principle that a document should be construed as a whole. This rule was alluded to by Lord Watson inChamber Colliery Company, Limited v Twyerould[1915] 1 Ch 268, where he said that it was a “well-known rule” (at 272) that (ibid): [A] deed ought to be read as a whole, in order to ascertain the true meaning of its several clauses; and ... the words of each clause should be so interpreted as to bring them into harmony with the other provisions of the deed, if that interpretation does no violence to the meaning of which they are naturally susceptible. 19        In addition, a document must also be construed in the context of its “factual matrix” or “surrounding circumstances” (perLord Wilberforce inReardon Smith Line Ltd v Yngvar Hansen-Tangen[1976] 1 WLR 989 (“Reardon Smith Line Ltd”) at 997 and 995 respectively). This principle was further considered in the more recent House of Lords decision ofInvestors Compensation Scheme Ltd v West Bromwich Building Society[1998] 1 WLR 896, where it was reiterated that a document ought to be construed in the light of its factual matrix. Lord Hoffmann summarised the position as to the interpretation of a document in these terms (idat 912–913): (1)        Interpretation is the ascertainment of the meaning which the document would convey to a reasonable person having all the background knowledge which would reasonably have been available to the parties in the situation in which they were at the time of the contract. (2)        The background was famously referred to by Lord Wilberforce as the “matrix of fact,” but this phrase is, if anything, an understated description of what the background may include. Subject to the requirement that it should have been reasonably available to the parties and to the exception to be mentioned next, it includes absolutely anything which would have affected the way in which the language of the document would have been understood by a reasonable man. (3)        The law excludes from the admissible background the previous negotiations of the parties and their declarations of subjective intent. They are admissible only in an action for rectification. The law makes this distinction for reasons of practical policy and, in this respect only, legal interpretation differs from the way we would interpret utterances in ordinary life. The boundaries of this exception are in some respects unclear. But this is not the occasion on which to explore them. (4)        The meaning which a document (or any other utterance) would convey to a reasonable man is not the same thing as the meaning of its words. The meaning of words is a matter of dictionaries and grammars; the meaning of the document is what the parties using those words against the relevant background would reasonably have been understood to mean. The background may not merely enable the reasonable man to choose between the possible meanings of words which are ambiguous but even (as occasionally happens in ordinary life) to conclude that the parties must, for whatever reason, have used the wrong words or syntax: seeMannai Investments Co. Ltd. v. Eagle Star Life Assurance Co. Ltd.[1997] A.C. 749. (5)        The “rule” that words should be given their “natural and ordinary meaning” reflects the common sense proposition that we do not easily accept that people have made linguistic mistakes, particularly in formal documents. On the other hand, if one would nevertheless conclude from the background that something must have gone wrong with the language, the law does not require judges to attribute to the parties an intention which they plainly could not have had. Lord Diplock made this point more vigorously when he said inAntaios Compania Naviera S.A. v. Salen Rederierna A.B.[1985] A.C. 191, 201: “if detailed semantic and syntactical analysis of words in a commercial contract is going to lead to a conclusion that flouts business commonsense, it must be made to yield to business commonsense.” [emphasis added] 20        In the recent case ofSandar Aung v Parkway Hospitals Singapore Pte Ltd[2007] 2 SLR 891, this court had the occasion to review the principles governing the construction of documents, and this was what it stated at [29]: The key concept here is that ofcontext.No contract exists in a vacuum and, consequently, its language must be construed in the context in which the contract concerned has been made. We would go so far as to state that even if the plain language of the contract appears otherwise clear, the construction consequently placed on such language should not be inconsistent with the context in which the contract was entered into if this context is clear or even obvious, since the context and [the] circumstances in which the contract was made would reflect the intention of the parties when they entered into the contract and utilised the (contractual) language [which] they did. It might well be the case that if a particular construction placed on the language in a given contract is inconsistent with what is the obvious context in which the contract was made, thenthatconstruction mightnotbe as clear as was initially thought and might, on the contrary, be evidence of an ambiguity. [emphasis in original] 21        All said, the object of construing a contract is to ascertain the objective intention of the parties as reflected in the words used when viewed in the context of the factual matrix of the contract in question. I am conscious that, inReardon Smith Line Ltd([19]supra), Lord Wilberforce said (at 996) that “when one is speaking of aim, or object, or commercial purpose, one is speaking objectively of what reasonable persons would have in mind in the situation of the parties”. Thus, there should not be too much reliance on literal interpretation. Instead, regard should be had to the commercial purpose of a transaction. The court, upon examining all the circumstances surrounding the transaction, could even conclude that the parties must, whatever the reasons, have used the wrong words (seeChitty on Contracts(H G Beale gen ed) (Sweet & Maxwell, 29th Ed, 2004) vol 1 at para 12-118). But, there is no suggestion in the present case by either party that any wrong words were used in the Deed. Having said that, I would add that it is not the function of a court to rewrite the bargain between the parties (seeMAE Engineering Ltd v Fire-Stop Marketing Services Pte Ltd[2005] 1 SLR 379at [27]). While I recognise that the line between construing a contract to determine the real objective intention of the parties and rewriting a contract can, in particular circumstances, be a fine one, the court should be astute not to impose, under the guise of construing a document, its own sense of fairness or reasonableness on a transaction entered into between two commercial parties who are well capable of taking care of their respective interests and who have obviously engaged in much bargaining before concluding the arrangement finally arrived at (as was the case in this appeal).",
        "My analysis": "",
        "Overview": "22        While I would, at the outset, state that the Deed is certainly not a model of excellent drafting, its overall sense seems reasonably clear. I recognise, however, that its sense would have been even clearer if a couple of linkages had been expressly provided for. 23        Clause 1.1 of the Deed defines the term “SHSH Convertible Loan” to mean “the loan of principal amount of S$2,270,000 referred to in clause 2.2(ii)”. Clause 2.2(ii) provides that the sum of $2,270,000 (ie, the Original Principal Amount) constitutes and is deemed to be a loan owing by the Company to SHSH which can be either utilised (in terms of being converted into shares in the Company) or repaid as set out in cl 5. Clause 5.2 provides that “[s]ubject to [c]lause 5.3 ... 75% of the SHSH Convertible Loan shall be repaid in cash on the Repayment Date”. Clauses 5.3 and 5.4 provide for repayment of 100% of the SHSH Convertible Loan (ie, repayment of 100% of the Original Principal Amount) if certain eventualities occur. None of those eventualities in fact occurred in the present case and, therefore, cll 5.3 and 5.4 have no application in this appeal. Clause 5.5(b)(iv) provides thatat least25% of the SHSH Convertible Loan shall be converted into shares in the Company at the price of $0.15 per share by the Repayment Date. The crux of the matter is how cl 5.2 should be construed in this context. Reading all the relevant clauses in the context of the arrangement between the parties, it is reasonably plain to me that cl 5.2 means that only 75% of the Unconverted Principal Amount is to be repaid in cash on the Repayment Date. At [35]–[38] below, I will examine why it is not unreasonable to forfeit 25% of the Unconverted Principal Amount where the Original Principal Amount has not been fully converted into shares in the Company by the Repayment Date.",
        "Analysis of the key provisions of the Deed": "24        I will now elaborate on my reasons for construing cl 5.2 of the Deed in the manner outlined at [23] above. As noted in that paragraph, cl 5.2 is expressly stated to be “[s]ubject to” cl 5.3. Under cl 5.3, “100% of the SHSH Convertible Loan” (ie, 100% of the Original Principal Amount) is to be repaid on the Repayment Date if: (a)        the necessary approval for the exercise of the Conversion Feature has not been obtained; or (b)        SHSH is unable to exercise the Conversion Feature by reason of that feature being invalid or unenforceable or not in full force and effect. The necessary approval is referred to in cl 5.6, and it includes the approval of the shareholders of the Company as well as that of SGX. As the necessary approval for the exercise of the Conversion Feature was obtained in the present case (as evinced by Lim’s conversion of approximately 79% of the SHSH Convertible Loan into shares in the Company (see [9] above)), cl 5.3 was not triggered and, as mentioned in the preceding paragraph, it is not relevant for the purposes of this appeal. The only faintly significant aspect about cl 5.3 is that it expressly refers to “100% of the SHSH Convertible Loan”. Arguably, one can make the point that, if the term “SHSH Convertible Loan” in cl 5.3 means the whole of the Original Principal Amount, then there would be no need for this clause to expressly include the words “100% of”. I do not think, however, that too much should be placed on this technical point. It may be that the drafters of the Deed were not absolutely consistent in the way in which they denoted the whole of the Original Principal Amount. It is the overall scheme of things as reflected in the express provisions of the Deed that is crucial. 25        Clause 5.4 is an overriding provision as far as cl 5 (taken as a whole) is concerned as it expressly provides at the outset that, “[n]otwithstanding anythingin ... [c]lause 5” [emphasis added], if any of the events mentioned in cl 5.4 occur (viz, if, stated broadly, (a) any step is taken to wind up the Company, or (b) the Company’s obligations under the Deed cease to be valid, binding or enforceable, or (c) the Company breaches any of the provisions of the Deed, or (d) execution is levied on or issued against the Company), then “thewholeof the SHSH Convertible Loan shall become due and payable immediately in cash” [emphasis added]. As none of the events specified in cl 5.4 occurred in the present case, this clause was not triggered, and it is thus not really relevant in this appeal except in so far as it uses the word “whole” when referring to the SHSH Convertible Loan. In this regard, the same point made in relation to the words “100% of the SHSH Convertible Loan” in cl 5.3 (see [24] above) may be made here. 26        At this juncture, I would pause to address what may appear to be a very important question, namely: Why did the parties agree that there should be repayment of 100% of the SHSH Convertible Loan if any of the events spelt out in cll 5.3 and 5.4 occurred? It seems to me that the answer is simple enough. In relation to cl 5.3, if the necessary approval for the exercise of the Conversion Feature were not obtained, then, contrary to what the Deed envisaged, the Company would not have the authority to issue shares and the Conversion Feature would become academic. Further, even if shares were purportedly issued (despite the lack of approval), such shares would not be allowed to be traded on SGX. In that eventuality, there being no fault on the part of SHSH, it is completely understandable why Meadow Springs (which was effectively the party in control of the Company as a result of the rescue plan) should think it fair that the Company should repay the Original Principal Amount in full to SHSH on the Repayment Date. 27        Turning to cl 5.4, if any of the eventualities set out in that clause had indeed occurred, the Company (which, as just mentioned, was effectively under the control of Meadow Springs) would have been in serious trouble. In that scenario, it would not have mattered to Meadow Springs whether 100% or less of the SHSH Convertible Loan was repayable because the debts owed by the Company would simply have become paper debts in that the Company would not, in any case, have been in a position to repay those debts. In short, the rescue plan would have failed. This explains why cl 5.4 even provides (by the use of the overriding expression, “[n]otwithstanding anything in ... [c]lause 5”) – should this eventuality indeed materialise – for thefullrepayment of the SHSH Convertible Loan irrespective of whether some portion of it has already been converted into shares in the Company under cl 5.5. 28        I note that the district judge, in reliance on cll 5.3 and 5.4, thought that those two clauses showed that it was always the intention of the parties that there should be full repayment of the SHSH Convertible Loan less the amount (if any) utilised for conversion into shares in the Company. The appellant made the same point before this court. As will be shown later (at [36]–[42] below), the appellant has not correctly understood the rationale for the arrangement set out in the Deed. In any event, it is not correct for the appellant to say that, under cl 5.4, the amount to be repaid under the SHSH Convertible Loan is the Original Principal Amount reduced by the sum (if any) utilised for conversion into shares. That is certainly not what is expressly provided for in cl 5.4 (see [27] above). 29        I now turn to the very important cl 5.5. In essence, the following substantive matters were provided for in this clause. First, under cl 5.5(a), SHSH could convert either thewhole or partof the SHSH Convertible Loan into shares in the Company at the price of $0.15 per share. Second, whatever amount of the SHSH Convertible Loan was utilised for conversion into shares was deemed to have been “fully and effectually repaid” (see cl 5.5(a)) to SHSH. Third, upon each exercise of the Conversion Feature, SHSH was required to give appropriate notice to the Company, and such notice had to relate to a minimum of 150,000 shares or an integral multiple thereof unless the notice related to the entire balance of the SHSH Convertible Loan which could be converted into shares (see cll 5.5(b)(i)–5.5(b)(iii)). Fourth, under cl 5.5(b)(iv), SHSH was required to convert at least 25% of the SHSH Convertible Loan into shares in the Company at the aforesaid price of $0.15 per share by the Repayment Date; if less than that portion of the loan had been converted into shares as at that date, the shortfall (ie, the difference between 25% of the SHSH Convertible Loan and that part of the loan which had already been converted into shares in the Company) would automatically be converted into shares on the Repayment Date. In the present instance, since approximately 79% of the SHSH Convertible Loan (viz, the portion assigned by SHSH to Lim) had already been converted into shares in the Company as at the Repayment Date, cl 5.5(b)(iv) had no application. 30        Before this court, the appellant sought to read cl 5.2 together with cl 5.5(b)(iv). He argued that the 25% reduction or “haircut” envisaged in cl 5.2 where there was cash repayment on the Repayment Date had all to do with cl 5.5(b)(iv) in that, once 25% or more of the SHSH Convertible Loan had been converted into shares in the Company, the remainder of the loan (ie, the Unconverted Principal Amount) was to be repaidin fullin cash on the Repayment Date. But, in my view, this is not what is provided for in cl 5.2. For the appellant’s argument to be tenable, cl 5.2 would have to be significantly amended to something along the following lines: Subject to [c]lause 5.3and clause 5.5(b)(iv)below,75%100% of the balanceof the SHSH Convertible Loan shall be repaid in cash on the Repayment Date. [amendments to the original text of cl 5.2 in bold and underlined] 31        I would point out that the appellant did not suggest before this court that SHSH (or the appellant as its assignee) was entitled to cash repayment of 75% of the Original Principal Amount irrespective of how much of the Original Principal Amount had already been utilised for conversion into shares in the Company. This implicitly recognised that the words “the SHSH Convertible Loan” in cl 5.2 would mean the Unconverted Principal Amount and not the Original Principal Amount. In this regard, it must be borne in mind that there is no other clause in the Deed which provides for repayment of the Unconverted Principal Amount (if any).",
        "Construction of clause 5.2": "32        It can be seen that, as alluded to earlier at [23] above, both the construction of cl 5.2 contended for by the Company (which was accepted by the Judge) and that which the appellant canvassed involved reading some words such as “the balance of” in between the words “75% of” and “the SHSH Convertible Loan” in cl 5.2. It seems to me that reading some such words into this clause is essential to make sense of it. The reasoning of the Judge as set out at [39]–[40] of the GD is persuasive and, here, I quote: 39         If indeed the words “the SHSH Convertible Loan” in cl 5.2 are meant to refer to theoriginalprincipal amount of $2,270,000 as contended by [the appellant] (and not to theoutstandingprincipal amount of the loan as at the [R]epayment [D]ate), then the repayment term in cl 5.2 makes no sense and is wholly unworkable because it totally disregards any part of the loan that might have been earlier used for conversion into shares and, hence, extinguished from the principal amount still owing. 40         An example will show why [the appellant’s] interpretation is both not sensible and not workable. If “the SHSH Convertible Loan” in cl 5.2 means theoriginalprincipal amount [of] $2,270,000, then cl 5.2 requires $1,702,500 (or 75% of $2,270,000) of the loan to be repaid in cash. This means that [the Company] will invariably have to pay out a fixed sum of $1,702,500 on the [R]epayment [D]ate in accordance with cl 5.2. But what if SHSH had, prior to the [R]epayment [D]ate, used $1,500,000 of the [SHSH] Convertible Loan [for conversion into] 10,000,000 ... shares [in the Company] at $0.15 per share? Applying [the appellant’s] interpretation [of] cl 5.2, [the Company] will still have to repay SHSH the sum of $1,702,500 in cash, being 75% of the original loan amount of $2,270,000. If so, then the total amount effectively repaid by [the Company] is $1,500,000 plus $1,702,500 making a total repayment of $3,202,500 for a convertible loan which started off with only anoriginalprincipal amount of $2,270,000. This example not only illustrates the absurdity of interpreting the relevant amount of ... “the SHSH Convertible Loan” in cl 5.2 to mean theoriginalprincipal amount of $2,270,000, but also demonstrates that cl 5.2 [was] never meant to operate on theoriginalprincipal amount. In my view, it can only logically refer to theoutstandingprincipal amount as at the date of repayment. [emphasis in original] 33        The difficulty with the appellant’s interpretation of cl 5.2 is that the insertion of the suggested three words (viz, “the balance of”) into cl 5.2 would not in itself lead to a construction of the clause that entitles the appellant to be repaid the whole of the Assigned Amount on the Repayment Date. For such a construction to be made out, “75%” in cl 5.2 would also have to read as “100%” instead, and therein lies the difficulty with the interpretation espoused by the appellant. Recognising this, the appellant argued that cl 5.2 was linked to cl 5.5(b)(iv) (see [30] above). His reasoning was this: The reference to 75% in cl 5.2 had all to do with the requirement under cl 5.5(b)(iv) that at least 25% of the SHSH Convertible Loan must be converted into shares in the Company by the Repayment Date. That accordingly meant that 75% of the Original Principal Amount would be repaid in cash, which was why cl 5.2 provided that 75% of the SHSH Convertible Loan would be repaid in cash on the Repayment Date. With respect, this argument is a non-starter as it requires the implicit meaning of cll 5.2 and 5.5 to be stretched beyond recognition. The real insurmountable difficulty with the appellant’s contention is that cl 5.5 does not say thatonly25% of the SHSH Convertible Loan may be converted into shares in the Company. On the contrary, that is the minimum which must be converted into shares in the Company by the Repayment Date. The appellant’s argument ignores the fact that the opening sentence of cl 5.5 expressly states thatthe whole or partof the SHSH Convertible Loan may be converted into shares. Therefore, it is not possible to link the specification of 75% of the SHSH Convertible Loan in cl 5.2 with the requirement in cl 5.5(b)(iv) that at least 25% of the loan must be converted into shares by the Repayment Date. In my view, it is significant that the drafters of the Deed did not expressly link the two clauses when they could easily have done so. 34        In essence, the appellant wanted this court to construe cl 5.2 to mean that the Company was to repay 100% of the Unconverted Principal Amount on the Repayment Date, regardless of whether that amount was 75% of the Original Principal Amount or less if more than 25% of the Original Principal Amount had been converted into shares. It seems to me that such an interpretation cannot be adopted without doing violence to cl 5.2. It would require this court to ignore the express reference in cl 5.2 to repayment of “75%of the SHSH Convertible Loan” [emphasis added] and, further, would involve rewriting the clause. If the interpretation of cl 5.2 asserted by the appellant was indeed what was intended, the parties could simply have stated in this clause that: Subject to [c]lause 5.3and clause 5.5below,100%ofthat part ofthe SHSH Convertible Loanwhich has not been converted into shares in the Company as at the Repayment Dateshall be repaid in cash on the Repayment Date. [amendments to the original text of cl 5.2 in bold and underlined]",
        "Justification for a 25% “haircut”vis-à-viscash repayment of the Unconverted Principal Amount": "35        Much has been made of the fact that, as SHSH would have to use $0.15 from the SHSH Convertible Loan to pay for each share in the Company if it were to exercise the Conversion Feature (ie, if it were to choose to receive repayment of the loan by way of being issued with shares in the Company), which price was a concession to Meadow Springs in that it was well above the sum of $0.0475 per share that SHSH obtained from selling its shares in the Company (ie, the S&P Shares defined at [3] above) to Meadow Springs, there was no reason to expect SHSH to take a further 25% reduction in repayment of the Unconverted Principal Amount as at the Repayment Date (which amount would be either 75% or less of the Original Principal Amount, depending on how much of the SHSH Convertible Loan had been converted into shares in the Company). Was it fair that the holder of the SHSH Convertible Loan, be it SHSH or its assignee, should still take a reduction of 25% of the Unconverted Principal Amount as at the Repayment Date in such circumstances? 36        Contrary to the district judge’s view (see [12] above), I do not think that a reduction of 25% in cash repayment in the scenario just mentioned (see [35] above) is an unreasonable condition. In this regard, it is vital that the Deed be considered against its factual matrix. It is imperative to bear in mind why the Deed was entered into in the first place. It is common ground that, at the time the Deed was executed, the Company was in a very bad financial state. At any moment, it could go under. If that should happen, not only would the capital which SHSH had invested in the Company be lost, but the loans that SHSH had given to the Company – which formed the subject matter of the arrangement under the Deed – would also have very little prospect of being recovered. That was the backdrop at the material time. It was in those bleak circumstances that a white knight was sought. Unless a fresh investor were to come in to rescue the Company, SHSH would very likely have lost everything which it had put into the Company. The white knight was Meadow Springs, which, as a condition for purchasing the S&P Shares from SHSH, required that the Deed be entered into. Understandably, Meadow Springs would not have wanted to get involved in the Company by investing in it if the existing creditors of the Company, including SHSH, could pull the rug from right under the Company’s feet by demanding for repayment of the outstanding debts and, in the event of the Company failing to make payment, by petitioning for the Company’s winding up. This concern had to be addressed, and the Deed provided the answer. This is reflected in cl 9.1 of the Deed, which reads: The Parties [ie, the Company and SHSH] acknowledge that they have entered into this Deed at the request of Meadow Springs ... (the “Purchaser”) and in connection with an option agreement entered or to be entered into between,inter alia, SHSH and the Purchaser. Accordingly, the Purchaser will enjoy the benefit[s] of and may enforce such benefits under this Deed. For the avoidance of doubt, this Deed may not be amended or modified or superseded or its effect vitiated, except with the prior written consent of the Purchaser. It is significant that cl 9.1 provides that the terms of the Deed may not be amended without the written consent of Meadow Springs. Obviously, at the time the Deed was entered into, SHSH was hardly in a strong position to bargain with Meadow Springs. The shots were essentially called by the latter. This explains why, in respect of the S&P Shares which it bought from SHSH, Meadow Springs paid only $0.0475 per share – a price which clearly reflected the poor financial state of the Company as at 29 September 2003 – whereas SHSH would have to use $0.15 from the SHSH Convertible Loan to pay for each share in the Company upon exercising the Conversion Feature. 37        Admittedly, in normal circumstances, selling a share at $0.0475 and buying it back at $0.15 would make no sense. No one in his right mind would do that. However, the circumstances surrounding the Deed were anything but normal. The arrangement set out in the Deed only makes sense when it is viewed against the aforesaid backdrop (see [36] above) –ie, at the material time, the shares in the Company were worth either very little or nothing at all, and the loans which SHSH had given to the Company were already bad. By selling the shares which it held in the Company (ie, the S&P Shares) to Meadow Springs at $0.0475 per share, SHSH at least recovered something instead of nothing at all. And, if Meadow Springs were to succeed in saving the Company, then SHSH would benefit even in respect of the shares which it acquired at $0.15 per share by exercising the Conversion Feature. The aim of the rescue plan was to tie the fortunes of SHSH to those of the Company. SHSH had not much of a choice in the face of commercial reality. The Deed gave SHSH an opportunity to salvage as much as it could in a bad situation. The whole arrangement set out in the Deed was a carefully balanced business arrangement between two parties (effectively, SHSH and Meadow Springs) who knew exactly what they were doing and/or what each party was up against. Both parties took business risk in the arrangement. If the rescue plan were to succeed, Meadow Springs would gain and so would SHSH. It would not make business sense for Meadow Spring to allow the Company to use the Company’s funds, which were likely to come from new sources connected with Meadow Springs, to pay off in full what were really bad debts of SHSH. It seems to me that the appellant had not properly appreciated the situation prevailing at the material time when he said that SHSH had granted indulgences or made concessions to Meadow Springs via the terms of the Deed. Similarly, and with respect, I also think that the district judge failed to give sufficient consideration to this particular factor. I would underscore that the Deed should be construed in the light of the conditions prevailing at the date it was entered into. Neither Meadow Springs nor SHSH knew for sure then if the rescue plan would succeed. 38        In my opinion, it is clear that the primary objective of the arrangement set out in the Deed was to encourage SHSH to convert as much of the SHSH Convertible Loan as possible (subject to a minimum of 25% thereof) into shares in the Company by the Repayment Date. The imposition via cl 5.2 of a reduction of 25% in the amount to be repaid to SHSH in respect of the Unconverted Principal Amount as at the Repayment Date was to be the disincentive for SHSH not to exercise the Conversion Feature. It seems to me equally plain that the aim behind the arrangement set out in the Deed was to ensure that, as far as possible, all the funds which SHSH had already put into the Company, whether as capital or by way of loans, should remain in the Company and be applied towards the rescue plan instead of being given back in cash to SHSH, a substantial shareholder and creditor of the Company. The provision of a period of three years for SHSH to convert the SHSH Convertible Loan into shares in the Company was to allow SHSH time to see if the rescue plan was succeeding. If it was, then converting the SHSH Convertible Loan into shares in the Company, even at the price of $0.15 per share, would make good commercial sense. If, on the other hand, it did not appear that the rescue plan was succeeding, and if SHSH should consider it unwise to convert the SHSH Convertible Loan into shares in the Company, then SHSH would have to bear a 25% “haircut” if it wished to have cash repayment of the Unconverted Principal Amount after satisfying cl 5.5(b)(iv). I would reiterate that even this outcome (viz, a reduction of 25% in the amount repaid) would be better for SHSH than the outcome if the rescue plan had not been effected at all because, in the latter scenario, the Company would very likely have gone under and SHSH would very likely not have been able to recover any of the loans which it had given to the Company; in short, there would very likely have been total or near total loss for SHSH. The rescue plan as a whole gave hope to SHSH. If Meadow Springs were to succeed in putting the Company back on an even keel, not only would Meadow Springs benefit, but so would shareholders and creditors of the Company like SHSH as SHSH would then be able to resell the shares which it acquired by exercising the Conversion Feature (as well as the shares which it would acquire using the Warrant Liability Amount (see [43] below)) at a much higher price than that which it paid for each share. Given the prevailing circumstances at the material time, SHSH did not have much of a choice and the choice was obvious. 39        It can be seen from the preceding discussion (at [36]–[38] above) that my analysis of the justification for SHSH taking a 25% reduction in the quantum of cash repayment received in respect of the Unconverted Principal Amount as at the Repayment Date is different from the analysis adopted by the Judge, who thought that the 25% reduction or “haircut” was the price or premium paid by SHSH for the Conversion Feature. At [50] and [56] of the GD, the Judge stated: 50         ... In my view, the valuable consideration agreed to be given by the lender to the borrower under the Deed in exchange for the convertibility feature [ie, the Conversion Feature] in the restructured loan is effectively provided [for] by the 25% discount on the cash repayment [of] the remainder of the unconverted loan. … 56         ... [I]t is precisely because the benefit of the convertibility feature is made available to the creditor under the new loan structure that he has to “pay” for that benefit by foregoing a part of the unconverted loan [ie, the Unconverted Principal Amount] when he gets repayment on the loan in cash. In other words, the creditor takes a “[haircut]” on the loan repayment in cash at the [R]epayment [D]ate. Having a “[haircut]” on the cash repayment in exchange for the valuable convertibility feature can hardly be said to be an unreasonable commercial result. 40        I do not disagree that an option granted by a company to a person to purchase its shares at a predetermined price within a fixed period of time is a valuable security. However, in the circumstances of this case and for the reasons which I have indicated at [36]–[38] above, the 25% reduction in cash repayment of the Unconverted Principal Amount on the Repayment Date was really the disincentive for SHSH not to convert the whole of the SHSH Convertible Loan into shares in the Company by that date. Putting it in positive terms, this “haircut” was the incentive for SHSH to convert the whole of the SHSH Convertible Loan into shares in the Company by the Repayment Date. 41        I note the appellant’s contention that a lender under a convertible loan is not normally expected to take a “haircut” or a reduction in the amount which it is repaid. In this regard, the appellant relied upon the following passage from Philip R Wood,International Loans, Bonds and Securities Regulation(Sweet and Maxwell, 1995) at para 9-5: The attraction to the investor of an equity-linked bond [which is a type of convertible loan] is that, irrespective of the performance of the underlying shares, the bond provides a fixed rate of income (albeit a lower rate than [that] on an otherwise similar non equity-linked bond) and is relatively secure, while at the same time giving the holder an option to convert into or subscribe for shares at a fixed price, and thereby benefit from any increase in the market value of the shares above that fixed price. The package provides safe debt plus speculative equity. 42        I do not disagree with these comments of Philip Wood, who is clearly referring to the case where people put good money into equity-linked bonds. That scenario is, however, completely different from the scenario in the present case, where the bad debts owed by the Company were given a new lease of life via the rescue plan, with the Deed setting out the bargain between the parties effectively involved (namely, Meadow Springs and SHSH). To compare the scenario outlined by Philip Wood (as reproduced in the preceding paragraph) with the scenario in this appeal would not be to compare like with like. I have already elaborated on this (at [36]–[38] above) and do not wish to repeat my reasoning.",
        "Comparison of the repayment schemes for the Warrant Liability Amount and the SHSH Convertible Loan respectively": "43        As mentioned at [5] above, the Deed designated the sum of $1,773,337.50 owed by the Company to SHSH as the Warrant Liability Amount. Under cl 3 of the Deed, SHSH could utilise this sum to pay for shares in the Company at the price of $0.11 per share on exercising the 16,121,250 detachable warrants which it held (see [4] above). It should be noted that the price of $0.11 per share was lower than the price of $0.15 per share which SHSH would have to pay for converting the SHSH Convertible Loan into shares in the Company. I would not be at all surprised if this price differential was meant to reflect what I believe to be the industry practice,viz, that a person subscribing for new shares through the exercise of warrant rights normally pays a price lower than the market price of those shares at the time the warrants were issued. 44        In respect of the Warrant Liability Amount, there was no corresponding provision for the repayment of any portion of that amount which was not used by SHSH to pay for the Company’s shares upon exercising its rights under its warrants (referred to hereafter as SHSH’s “warrant rights” for convenience). Instead, what I see being provided for under cl 4.1 of the Deed is that, if all or any portion of the Warrant Liability Amount was not applied by SHSH towards the exercise of its warrant rights within the period of seven months from the date of the Deed, that sum would be deemed “settled, satisfied, discharged and released”. In other words, whatever part of the Warrant Liability Amount that was not used to pay for shares in the Company upon SHSH’s exercise of its warrants rights would effectively be forfeited. The appellant sought to rely on this to contend that if, in relation to the SHSH Convertible Loan, it was the intention of the parties that SHSH (or its assignee) should forfeit 25% of the Unconverted Principal Amount on the Repayment Date, words similar to those used in cl 4.1 in relation to the Warrant Liability Amount would have been adopted in cl 5. However, the scheme of the SHSH Convertible Loan was not that, if any part of that loan was not converted into shares in the Company, the same would be treated as “settled, satisfied, discharged and released” (percl 4.1). Instead, in respect of the SHSH Convertible Loan, the Deed provided that, after the requirement that a minimum of 25% of the loan be converted into shares in the Company was satisfied, only 75% of any unconverted part of the loan –ie, only 75% of the Unconverted Principal Amount – would be repaid in cash on the Repayment Date. That was what was stated in cl 5.2. As far as the Warrant Liability Amount was concerned, SHSH had no option but to convert the whole of that amount into shares in the Company. If it did not do so, the unconverted part of the Warrant Liability Amount would simply be deemed settled and discharged; in short, it would be forfeited. In contrast, in respect of the SHSH Convertible Loan, SHSH was given a bit more flexibility, albeit with an incentive for it to convert the loan into shares or, viewing it in another way, a disincentive for it not to so convert. It seems to me that the effective parties to the Deed (ie, Meadow Springs and SHSH) had carefully devised two separate and distinct schemes in respect of the SHSH Convertible Loan and the Warrant Liability Amount. Given this context, it does not really help to compare the wording used for one scheme with that used for the other since the two schemes are different to begin with.",
        "Conclusion": "115      In the circumstances, we allow this appeal with costs to the appellant here and below. The usual consequential orders will apply. [note: 1]See theAppellant’s Core Bundle filed on 25 April 2008 (“ACB”) at vol 2, pp 54–56.[note: 2]See theRecord of Appeal, vol 3 at p 81.[note: 3]Idat vol 3, p 93.[note: 4]See theRecord of Appeal, vol 3 at p 81.[note: 5]Idat p 90.[note: 6]Idat p 93.[note: 7]Idat p 94.[note: 8]See the certified transcript of the notes of evidence of the hearing before the District Judge on 17 October 2007 (“the District Judge’s notes of evidence”) (at ACB vol 2, p 79).[note: 9]Idat p 78.[note: 10]See para 53 of the Respondent’s Case filed on 22 May 2008 (“the Respondent’s Case”).[note: 11]See para 38 of the Appellant’s Case filed on 25 April 2008 (“the Appellant’s Case”).[note: 12]Idat para 45.[note: 13]Idat p 24.[note: 14]Idat para 58.[note: 15]Idat para 50.[note: 16]See para 45 of theRespondent’s Case.[note: 17]Idat para 57.[note: 18]Idat para 64(d).[note: 19]Idat para 64(e).[note: 20]See the District Judge’s notes of evidence (at ACB vol 2, p 78).",
        "Background": "49        We shall first set out what we consider to be the relevant factual background of the present appeal since we accord a somewhat different emphasis to some of the salient facts summarised in Chao JA’s judgment. The respondent, a Singapore-incorporated company, is listed on the main board of the Singapore Exchange Ltd (“SGX”). As at September 2003, the respondent was in serious financial difficulty. According to its auditors’ report for the year ended 31 December 2003, the respondent incurred losses of $8,475,000 and its net liabilities totalled $5,008,000; as a group, the respondent and its subsidiaries incurred losses of $3,621,000 and had net liabilities of $8,508,000. 50        Against this backdrop, Meadow Springs Enterprises Ltd (“Meadow Springs”) emerged as a white knight and agreed to lead a corporate rescue of the respondent. As part of the rescue package (“the Rescue Plan”), Meadow Springs entered into a sale and purchase agreement with SHSH to acquire some 30,813,440 of the respondent’s shares from the latter at the price of $0.0475 per share. (For convenience, we shall hereafter refer to these 30,813,400 shares as “the S&P Shares”; we shall also use the terms “Share” and “Shares” to denote, respectively, a share and shares in the respondent.) Meadow Springs’ purchase of the S&P Shares was based on the premise that the respondent’s debts then owing to SHSH and to one Mr Thomas Lim (“Lim”), the respondent’s chairman at that time, would be restructured. Meadow Springs was rather concerned because those debts were repayable on demand, and the respondent was plainly not in a position to settle them if repayment were demanded. 51        In the Deed, the respondent acknowledged that it owed SHSH a total sum of $4,043,337.50 (“the SHSH Liability Amount”). Clauses 2.1 and 2.2 of the Deed provided that the SHSH Liability Amount would be deemed “settled, satisfied, discharged and revised” (percl 2.1) following its split into two loans, namely: (a)        a loan of $1,773,337.50 owing by the respondent to SHSH with effect from 29 September 2003 on the terms and conditions stated in cl 4 of the Deed (“the Warrant Liability Amount”); and (b)        a loan of $2,270,000.00 (“the Original Principal Sum”) owing by the respondent to SHSH with effect from 29 September 2003 on the terms and conditions stated in cl 5 of the Deed (“the SHSH Convertible Loan”). Under cl 3 of the Deed, SHSH could, within a period of seven months from 29 September 2003 (“the Loan Tenure”), exercise certain warrants which it held (“the Warrants”) by converting them into Shares at the price of $0.11 per Share, with the Warrant Liability Amount to be applied towards the payment of the relevant sum. Clause 4.1 stated that: At the expiry of the Loan Tenure, any portion of the Warrant Liability Amount which has not on or prior to such date been utilized and applied towards the exercise of the Warrants in accordance with [c]lause 3 shall be deemed settled, satisfied, discharged and released as at such date of expiry of the Loan Tenure ... In respect of the SHSH Convertible Loan, a similar feature to convert the loan into Shares (“the Conversion Feature”) was provided for in cl 5.5 of the Deed, as follows: Subject to clause 5.6 below, the SHSH Convertible Loan shall have a conversion feature (“Conversion Feature”) whereby SHSH may, but shall not be obliged to, at any time and from time to time from the date of this Deed up to and including the Repayment Date [defined in cl 1.1 of the Deed as “the third anniversary of the date of [the] Deed”], convert the SHSH Convertible Loan in whole or in part into Shares subject to the following terms: (a)        the conversion price will be S$0.15 for each Share and the relevant principal amount from the SHSH Convertible Loan shall be utilised and applied to meet such conversion price; once so utilised and applied that relevant principal amount of the SHSH Convertible Loan shall be deemed fully and effectually repaid; (b)        each exercise of such right will be by way of a Conversion Notice by SHSH to the [respondent], provided that: ... (iv)       in the event [that] less than 25% of the SHSH Convertible Loan has been converted into Shares as at the Repayment Date (the difference between 25% of the SHSH Convertible Loan and the actual amount of [the] SHSH Convertible Loan converted into Shares [is] to be referred to as [the] “Shortfall Conversion Amount”), a Conversion Notice is deemed to be served on the Repayment Date to convert the Shortfall Conversion Amount into Shares on the terms of this clause 5. We shall return to these provisions later in this judgment. 52        Sometime later, in or around March 2004, SHSH was placed in voluntary liquidation. At that time, Lim owned 32% of SHSH and the remaining 68% was owned by Linguafranca Co Ltd (“Linguafranca”). Both Lim and Linguafranca also concurrently held substantial equity in the respondent. As at 15 March 2004, Lim, who had by then been re-designated as the executive vice-chairman and managing director of the respondent (cfhis position as at September 2003 (see [50] above)), held 27.28% of its issued share capital (cfLim’s shareholding of 32.82% as at 29 September 2003, the date of the Deed (see [4] above)) and was its largest shareholder. Linguafranca was the third largest shareholder of the respondent and held 11.70% of its issued share capital. 53        Pursuant to the liquidation of SHSH, its assets were apportioned between Lim and Linguafranca. In particular, SHSH’s rights under the Deed were allocated between them in the following proportions:[note: 4]  The Warrant LiabilityAmountThe SHSH ConvertibleLoanLim$567,468(about 32%)$1,796,761.60(about 79%)Linguafranca$1,205,869.50(about 68%)$473,238.40(about 21%) 54        Subsequently, Linguafranca assigned all its rights, title and interest in the SHSH Convertible Loan to the appellant. The respondent was informed of the assignment by way of a notice of assignment dated 21 March 2006.[note: 5] 55        Soon after, the parties’ divergent positions on how the Conversion Feature was meant to operate became apparent. On or about 28 April 2006, the respondent informed Linguafranca’s Ms Carmen So, who was a representative of and the holder of a power of attorney from the appellant, that it intended to convert the whole of the SHSH Convertible Loan into Shares, and that the appellant could not choose otherwise because he had no option as to whether or not the loan would be thus converted. Following a letter sent by the appellant’s solicitors to the respondent on 4 May 2006 objecting to the respondent’s stance, the respondent clarified on 8 May 2006 that:[note: 6] [The appellant] has the choice of converting the Assigned Loan [ie, that part of the SHSH Convertible Loan which had been apportioned to Linguafranca, amounting to $473,238.40] into [S]hares ... at the issue price of S$0.15 per [S]hare at any time prior to the Loan Repayment Date on 29 September 2006or to receive an amount equal to 75% of the Assigned Loan as full repaymentof the Assigned Loanon 29 September 2006. [emphasis added] The appellant’s reply, through his solicitors, was that he preferred “to have his portion of the [SHSH] Convertible Loan amounting to S$473,238.40 repaid in cash as soon as possible”.[note: 7] 56Lim opted, on or about 17 May 2006, to convert part of the loans due to him (specifically, a sum of $2,849,700), which apparently included all his interest in the Warrant Liability Amount and the SHSH Convertible Loan, into Shares. To avoid creating an odd lot of Shares, a balance sum of $75.59 was repaid by the respondent to Lim in cash.With this conversion, approximately 79% of the SHSH Convertible Loan, which was the portion of the loan allotted to Lim (see [53] above), was converted into Shares. 57        On 22 May 2006, the respondent’s chief financial officer informed the appellant’s solicitors that the appellant would be repaid in cash 75% of his share of the SHSH Convertible Loan, that is, $354,928.80. The next day, the appellant’s solicitors replied stating that, as more than what we shall hereafter term “the Minimum Conversion Amount” –ie, 25% of the Original Principal Sum, which is the minimum amount that must be converted into Shares pursuant to cl 5.5(b)(iv) of the Deed – had already been thus converted, the appellant was entitled to and was requesting for cash repayment of his entire share of the SHSH Convertible Loan (ie, the full sum of $473,238.40). Further correspondence between the respective parties’ solicitors ensued. After the appellant received the sum of only $354,928.80 on 29 September 2006, which was the repayment date specified in the Deed (“the Repayment Date”), his solicitors issued a letter of demand to the respondent on 2 October 2006 for the Balance Sum. When this payment was not forthcoming, the appellant filed an originating summons in the District Court for,inter alia, an order that the respondent pay him the Balance Sum.",
        "The relevant clauses of the Deed": "58        Before we proceed further, we shall set out the critical (and problematic) clauses of the Deed, some of which we have already referred to earlier (see [51] above): 1.1        In this Deed (including the Schedules), unless the context otherwise requires, the following expressions shall bear the following meanings respectively:  ...Repayment Datein relation to the SHSH Convertible Loan, the third anniversary of the date of this Deed, provided that if such date falls on a day which is not a Market Day [defined in the Deed as “a day on which SGX ... is generally open for trading of securities”], the Repayment Date shall be the immediately preceding Market Day;...SHSH Convertible Loanthe loan of principal amount of S$2,270,000 referred to in clause 2.2(ii) ... ... 5.         CONVERTIBLE LOAN 5.1        The SHSH Convertible Loan is interest-free and accordingly no interest is payable. 5.2Subject to [c]lause 5.3 below, 75% of the SHSH Convertible Loan shall be repaid in cash on the Repayment Date. 5.3In the event [that] the [respondent] is unable to obtain all relevant approvals for the Conversion Feature or SHSH is unable to exercise the Conversion Featureby reason of such Conversion Feature not being valid or enforceable or otherwise not in full force and effect for any reason whatsoever, the SHSH Convertible Loan,100% of the SHSH Convertible Loan shall be repaid in cash on the Repayment Date. 5.4        Notwithstanding anything in this [c]lause 5,the whole of the SHSH Convertible Loan shall become due and payable immediately in cash upon the occurrence of any one or more of the following events:– (i)         if any step is taken by any person with a view to the winding-up of the [respondent] or for the appointment of a liquidator ... (ii)        if the obligations of the [respondent] under this Deed [cease] to be valid, binding or enforceable in all respects; (iii)       if the [respondent] commits or threatens to commit a breach of any of the terms, conditions, covenants, undertakings, provisions and/or stipulations contained in this Deed on its part to be observed and performed; or (iv)       a [sic] distress or execution or [a] writ of seizure and sale or attachment is levied upon or issued against any of the property or assets of the [respondent]. 5.5        Subject to clause 5.6 below, the SHSH Convertible Loan shall have a conversion feature (“Conversion Feature”) whereby SHSH may, but shall not be obliged to, at any time and from time to time from the date of this Deed up to and including the Repayment Date, convert the SHSH Convertible Loan in whole or in part into Shares subject to the following terms: (a)        the conversion price will be S$0.15 for each Share and the relevant principal amount from the SHSH Convertible Loan shall be utilised and applied to meet such conversion price; once so utilised and applied that relevant principal amount of the SHSH Convertible Loan shall be deemed fully and effectually repaid; (b)        each exercise of such right will be by way of a Conversion Notice by SHSH to the [respondent], provided that: (i)         each Conversion Notice must be served between 9.00a.m. and 5.00p.m. on any Market Day falling before (but not on) the Repayment Date; and (ii)        subject to [paragraph] (iv) ... below, no Conversion Notice may be served in respect of any principal amount of the SHSH Convertible Loan which has been repaid or deemed repaid by the [respondent]; (iii)       except for a Conversion Notice which relates to all of the balance of the SHSH Convertible Loan which can be so converted, each Conversion Notice must relate to 150,000 Shares or an integral multiple thereof; and (iv)in the event [that] less than 25% of the SHSH Convertible Loan has been converted into Sharesas at the Repayment Date (the difference between 25% of the SHSH Convertible Loan and the actual amount of [the] SHSH Convertible Loan converted into Shares [is] to be referred to as [the] “Shortfall Conversion Amount”), a Conversion Notice is deemed to be served on the Repayment Date to convert the Shortfall Conversion Amount into Shares on the terms of this clause 5. 5.6        The Conversion Feature shall be conditional upon the [respondent] obtaining all relevant approvals for the Conversion Feature (including without limitation the approval of the Singapore Exchange Securities Trading Limited and, if necessary, [the] approval of the shareholders of the [respondent]) in respect of such rights to convert and of the allotment, issuance and listing of Shares arising from such conversion. 5.7        The [respondent] hereby agrees and undertakes to SHSH that the [respondent] shall take all steps and do all things which are necessary to give full force and effect to the Conversion Feature, and the giving, maintaining, repayment, conversion, allotment and issuance of Shares and all other matters relating to the Conversion Feature, including (without limitation) [the following measures]: (a)        the [respondent] will, as soon as practicable hereafter, seek its shareholders’ approval (if applicable) to give effect to the Conversion Feature and the allotment, issuance and listing of Shares arising from any conversion; (b)        the [respondent] will, as soon as practicable hereafter, submit all necessary applications to give effect to the Conversion Feature and the allotment, issuance and listing of Shares arising from any conversion, including making the relevant applications to the Singapore Exchange Securities Trading Limited and filing the relevant statutory statements; (c)        the [respondent] will use its best endeavours to obtain and maintain the listing of such Shares arising from such conversion; and (d)        the [respondent] will at all relevant times keep available for allotment and issue such Shares arising from such conversion. [emphasis added] 59        Clause 5.2 of the Deed has caused particular difficulties; indeed, the dispute that engendered this action could have been readily avoided if this clause had been crafted with a greater degree of exactitude by the professionals involved. There are, in the final analysis, two competing interpretations. Briefly, the first is that cl 5.2 provides thatup to75% of theOriginalPrincipal Sum of $2,270,000 would be repaid in cash on the Repayment Date. The second interpretation is thatonly75% of what we shall term “the Outstanding Principal Sum” –ie, that part of the Original Principal Sum (if any) whichhas notbeen converted into Shares as at the Repayment Date – would be repaid in cash on that date.",
        "The law on interpretation of contracts": "60        The differing decisions in the proceedings below over the construction of cl 5.2 of the Deed have thrown into sharp relief not only the ambiguity surrounding that clause in particular, but also – given the pivotal role of cl 5.2 to the overall interpretation of the Deed – the ambiguity inherent in the Deed as a whole. The present impasse over the Balance Sum, in our view, should not be resolved simply by looking at the literal text of the Deed in isolation, given its apparent ambivalence. 61        InZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR 1029(“Zurich Insurance”), this court undertook a comprehensive review of the legal principles relating to the interpretation of contracts. While there was extensive discussion of the parol evidence rule, the court’s judgment also covered a broad spectrum of issues concerning the interpretation of contracts, several of which are pertinent for the purposes of the instant case and which we shall outline at [62]–[65] below. 62        First, it is trite law that the court’s fundamental task, when interpreting a contract, is to ascertain the objective intention of the parties (seeZurich Insuranceat [125]–[126]). 63        Second, inZurich Insurance(at [47]–[65]), this court examined the shift from the literal approach to the contextual approachvis-à-visthe interpretation of contracts, and affirmed that the contextual approach had a legitimate residence in Singapore law, albeit within the statutory limits of the Evidence Act (Cap 97, 1997 Rev Ed). The court stated (idat [122]): The courts are allowed to depart from the plain and ordinary meaning of the contract to some extent. The very recognition that surrounding circumstances may create ambiguity about the language used in a contract involves acceptance that words do not have fixed and clearly delineated meanings. Rather, words are sometimes penumbral;the context of the contract breaks down the rigidly-defined boundaries of meaning, introduces hues and shades, and defines the contours and limits of the penumbra.Thus, even in its ostensibly conservative reasoning inCiticorp Investment Bank (Singapore)Ltd[v Wee Ah Kee[1997] 2 SLR 759], the Court of Appeal only required that the meaning imputed by the court be one which “the words are reasonably adequate to convey” ... The question of whether this restriction has been breached is one of degree. [emphasis added] 64        The contextual approach involves, in appropriate cases, a consideration of (inter alia) the commercial purpose of the contract in question. Sir Kim Lewison in his masterly treatise,The Interpretation of Contracts(Sweet & Maxwell, 4th Ed, 2007), aptly notes (at para 7.16) that the modern emphasis given to: ... discerning (or attempting to discern) the commercial purpose of a particular transaction, and construing the contract in the light of that commercial purpose ... is perhaps the single most important change in the construction of all classes of written instrument[s] in the last hundred years. In this regard, we note that the signatories to the Deed were the respondent, which was then struggling to stay afloat, and one of its major shareholders-cum-creditors,viz, SHSH. Yet, in all probability, it was anon-signatory – Meadow Springs, the prospective white knight – that wielded the greatest bargaining power during the negotiations leading up to the execution of the Deed. Indeed, this is made apparent by cl 9.1, which states that the Deed was entered into “at the request of” Meadow Springs and could not be amended, modified, superseded or vitiated without Meadow Springs’ prior written consent. We also note that the Deed was one of several agreements concluded on 29 September 2003 amongst the respondent, Meadow Springs, Lim, Linguafranca and SHSH for the purposes of restructuring the respondent’s liabilities (see further [110] below). 65        Third, inZurich Insurance([61]supra), this court clarified the use of extrinsic evidence as an aid in contractual interpretation. The following excerpt from a summary of the preferred interpretative approach in Singapore, as restated by the court, addresses issues that are relevant to (but not decisive in) this appeal (idat [132]): [T]he approach adopted in Singapore to the admissibility of extrinsic evidence to affect written contracts is a pragmatic and principled one. The main features of this approach are as follows: ... (c)        Extrinsic evidence is admissible under proviso (f) to s 94 [of the Evidence Act] to aid in the interpretation of ... written words. Our courts now adopt, via this proviso, the modern contextual approach to interpretation, in line with the developments in England in this area of the law to date. Crucially, ambiguity is not a prerequisite for the admissibility of extrinsic evidence under proviso (f) to s 94 ... (d)        The extrinsic evidence in question is admissible so long as it is relevant, reasonably available to all the contracting parties and relates to a clear or obvious context ... However, the principle of objectively ascertaining contractual intention(s) remains paramount. Thus, the extrinsic evidence must always go towards proof of what the parties, from an objective viewpoint, ultimately agreed upon. Further, where extrinsic evidence in the form of prior negotiations and subsequent conduct is concerned ... there should be no absolute or rigid prohibition against [such] evidence ... although, in the normal case, such evidence is likely to be inadmissible for non-compliance with the requirements set out at [125] and [128]–[129] above [viz, the requirements that the extrinsic evidence must be relevant and readily available to all the contracting parties, and that the context of the contract must be clear or obvious]. (We should add that the relevance of subsequent conduct remains a controversial and evolving topic that will require more extensive scrutiny by this court at a more appropriate juncture.) ... (e)        In some cases, the extrinsic evidence in question leads to possible alternative interpretations of the written words (ie, the court determines that latent ambiguity exists). A court may give effect to these alternative interpretations, always bearing in mind s 94 of the Evidence Act. ... (f)        A court should always be careful to ensure that extrinsic evidence is used to explain and illuminate the written words, and not to contradict or vary them. Where the court concludes that the parties have used the wrong words, rectification may be a more appropriate remedy ...",
        "The District Judge’s decision": "66        The District Judge held that, on a true construction of the Deed:[note: 8] [I]t was intended for the loan to be repaid in full, [with] payment ... to be made through a minimum of 25% in [S]hares and a maximum of 75% in cash. It appears to us that what the District Judge meant by “the loan” in the above extract was the full amount of the SHSH Convertible Loan,ie, the Original Principal Sum of $2,270,000. 67        The District Judge highlighted that cll 5.3 and 5.4 of the Deed made provisions for the Original Principal Sum to be repaid in full in the event that SHSH was unable to exercise the Conversion Feature, or in the event of (inter alia) winding-up proceedings being initiated against the respondent, the respondent breaching the terms of the Deed or execution being issued against the respondent’s property. In her opinion, since the respondent was obliged to repay the Original Principal Sum in full if any of those events occurred, the parties to the Deed could not reasonably have intended that the respondent would be obliged to repay less than 100% of that sum if everything worked out well. 68        The District Judge’s view was that the respondent’s interpretation –viz, that 25% of the Outstanding Principal Sum would be extinguished on the Repayment Date – “[would lead] to a fairly unreasonable result and if the parties did intend that result, it would be necessary that they make their intention abundantly clear ... (seeTheFina Samco[[1995] 2 Lloyd’s Rep 344]).”[note: 9]In this regard, the District Judge noted that, while cl 4 of the Deed made it clear that any portion of the Warrant Liability Amount that had not been applied towards the exercise of the Warrants would be deemed to be satisfied and discharged upon the expiry of the Loan Tenure, there was no equivalent provision in respect of the discharge of 25% of the Outstanding Principal Sum on the Repayment Date.",
        "The Judge’s decision": "69        The Judge arrived at an altogether different interpretation of the Deed and reversed the District Judge’s decision on several grounds. 70        First, the Judge, adopting a narrow interpretation of cl 5.2, opined that the clause was “a stand-alone clause made subject only to cl 5.3 ... and [had] nothing to do with cl 5.5(b)(iv)” (see the GD at [35]). Second, he held that the term “SHSH Convertible Loan” in cl 5.2could notmean the Original Principal Sum since cl 5.5(a) provided that any portion of that sum which had been converted into Shares would be “deemed fully and effectually repaid” (see cl 5.5(a)). The corollary of this, in the Judge’s view, was that the words “SHSH Convertible Loan” in cl 5.2 must refer to “theoutstandingprincipal amount remaining after ... conversion” [emphasis in original] (see the GD at [38]),ie, the Outstanding Principal Sum defined at [59] above. It followed that cl 5.2 should be construed as providing that “75% of theoutstandingprincipal amount (as ascertained on the [R]epayment [D]ate) [would] be repaid in cash, and not 75% of theoriginalprincipal amount of the loan” [emphasis in original] (see the GD at [38]). The Judge thus concluded that cl 5.2 had made it “abundantly clear” (idat [53]) that 25% of the Outstanding Principal Sum would beextinguishedon the Repayment Date. 71        In the Judge’s view, the wording of cl 5.2 (see [54] of the GD): ... [did] not support any possible interpretation that it [was] to be a “maximumof 75%” ... or a range of percentages, or, for that matter, any other fixed percentage apart from 75% of the loan that “[should] be repaid in cash on the Repayment Date”. [emphasis in original] This was because cl 5.2, unlike cl 5.5(b)(iv), stated that a fixed percentage of 75% of the SHSH Convertible Loan was to be repaid in cash on the Repayment Date. 72        According to the Judge’s interpretation of cl 5.2, SHSH would be entitled to cash repayment of 100% of the Original Principal Sum only if any of the scenarios set out in cll 5.3 and 5.4 occurred (see the GD at [53]). Since none of those events had taken place in the present case, cl 5.2 must be “thesole operative clausespecifying what amount of the [SHSH Convertible] [L]oan [should] be repaid in cash on the [R]epayment [D]ate” [emphasis in original] (ibid). 73        In the Judge’s view, a premium was normally paid to obtain the benefit of a convertibility feature in a loan (see the GD at [58]). A convertible loan, the Judge noted, was “very similar” (idat [59]) to a call option or a call warrant, and the market for such financial products as well as the prices attached to them were indicative of their intrinsic value. Similarly, the Conversion Feature had an “intrinsic commercial value” (idat [58]) and, thus, the SHSH Convertible Loan should be treated as being more valuable than a simple non-convertible loan. In this instance, the payment for the Conversion Feature took the form of “a 25% reduction in the amount of the unconverted loan [ie, the Outstanding Principal Sum] redeemable in cash at the [R]epayment [D]ate” (idat [63]). The Judge reasoned that (idat [56]–[57]): 56         ... [I]t is precisely because the benefit of the convertibility feature is made available to the creditor under the new loan structure that he has to “pay” for that benefit by foregoing a part of the unconverted loan when he gets repayment [of] the loan in cash. ... 57         ... [I]f indeed 100% of the unconverted SHSH Convertible Loan [ie, 100% of the Outstanding Principal Sum] must be repaid in cash as is contended by [the appellant], it essentially means that SHSH will be getting the valuable convertibility feature for free from [the respondent]. Giving away something valuable for free without receiving any consideration in return is certainly not the normal behaviour expected of businessmen or business entities dealing at arm’s length. ... 74        Since the Judge considered the Conversion Feature to be sufficiently valuable to command a premium, he interpreted the provision in cl 5.3 for cash repayment of “100% of the SHSH Convertible Loan” as a logical outcome if the Conversion Feature were not available. The Judge explained that this was because (see [56] of the GD): Once convertibility is absent, the loan [ie, the SHSH Convertible Loan] reverts to its original form of a simple straightforward loan, in which case cl 5.3 of the Deed provides that100%of the loan shall be repaid in cash on the [R]epayment [D]ate. This ... makes ample commercial sense and accordingly, the parties have rightly provided for it in the Deed. [emphasis in original] 75        The view that the Judge settled on meant that the argument by the appellant that he should not be treated differently from Lim, who had received full repayment of his entire interest in the SHSH Convertible Loan when he opted to convert that interest into Shares (which repayment included a cash payment of $75.59 in lieu of 503.9 Shares that the respondent had not allotted so as to avoid creating an odd lot of Shares (see [56] above)), was a non-starter (see the GD at [45]).",
        "The issues on appeal": "76        The appellant put the following issues before this court: (a)        whether the lender under a convertible loan typically had to take a “haircut” –ie, a reduction in the amount to be repaid, as compared to the principal sum advanced – as payment for the benefit of the convertibility feature contained in the loan; (b)        whether, in the present case, the terms of the Deed required the lender (ie, SHSH) to take a 25% “haircut” on the amount of cash repayment which it would receive on the Repayment Datevis-à-visthe Outstanding Principal Sum so as to pay for the benefit of the Conversion Feature; (c)        whether the Judge’s construction of the Deed was consonant with the relevant factual matrix; and (d)        whether the post-contractual conduct of the parties (if relevant) could justify the Judge’s construction of the Deed.",
        "Interpretation of clause 5.2 of the Deed": "",
        "Construing clause 5.2 in the context of clause 5 as a whole": "77        A literal reading of cl 5.2 of the Deed would detract from a sensible interpretation of cl 5 in its entirety. On its face, cl 5.2 only contemplates a single scenario,viz, where exactly $567,500 (25% of $2,270,000), which is the Minimum Conversion Amount, has been converted into Shares by the Repayment Date. However, conversion of more than the Minimum Conversion Amount by that date is quite clearly envisaged under cl 5.5 (see the express statement therein that “SHSH may ... convert the SHSH Convertible Loanin whole or in partinto Shares” [emphasis added]), while cl 5.5(b)(iv) makes special provision for the scenario where less than the Minimum Conversion Amount has been converted into Shares by the Repayment Date. The parties’ submissions 78        To make sense of cl 5.2, the parties, not surprisingly, took up opposing positions on the meaning of “SHSH Convertible Loan” in that particular provision. The respondent’s position was that those words did not refer to the Original Principal Sum, but to a “‘moving’ balance”[note: 10]that would be reduced accordingly as the Conversion Feature was exercised. This was similar to the Judge’s interpretation that “SHSH Convertible Loan” referred to “theoutstandingprincipal amount (as ascertained on the [R]epayment [D]ate)” [emphasis in original] (see the GD at [38]) –ie, the Outstanding Principal Sum defined at [59] above. 79        The appellant, on the other hand, maintained that “SHSH Convertible Loan” in cl 5.2 should be interpreted according to its definition in cl 1.1, namely, “the loan of principal amount of S$2,270,000 referred to in clause 2.2(ii)”. He argued that the Judge had read cl 5.2 “too much in isolation from the rest of the Deed”[note: 11]despite taking cognisance of the canon of construction that a contractual document must be construed as a whole. The appellant submitted that: (a)        the statement in cl 5.2 that that particular provision was “[s]ubject to [c]lause 5.3” did not mean that cl 5.2 was subject to cl 5.3only; (b)        clause 5.2 was clearly also subject to cl 5.4, which provided for immediate and full cash repayment of the Original Principal Sum if the events specified therein occurred; and (c)        since the Judge considered that the words “SHSH Convertible Loan” in cl 5.2 meant “theoutstandingprincipal amount remaining after ... conversion” [emphasis in original] (see the GD at [38]), he had treated cl 5.2 as being subject to cl 5.5(a) in addition to cl 5.3 despite his assertion that “cl 5.2 [was] ... subjectonlyto cl 5.3” [emphasis added] (idat [35]). According to the appellant’s approach, in situations where more than the Minimum Conversion Amount had been converted into Shares by the Repayment Date, the operation of cl 5.2 – which wasnotsubject to cl 5.3 only – would be “tempered by”[note: 12]cll 5.5(a) and 5.5(b)(iv), and the amount repayable in cash on the Repayment Date would be correspondingly adjusted so that SHSH would not be repaid more than the Original Principal Sum. 80        The appellant asserted that cll 5.3 and 5.4 of the Deed “reinforce[d] the expectation of full repayment”[note: 13][emphasis in original omitted]. In his view, cl 5.3 mandated that, if the Conversion Feature was not available, 100% of the Original Principal Sum would be repaid in cash on the Repayment Date. As for cl 5.4, its effect was that,irrespective of whether the Conversion Feature was available, the occurrence of any of the events stated therein (ie, in cl 5.4) would cause 100% of the Original Principal Sum to become due and payable immediately in cash. The appellant’s argument proceeded as follows:[note: 14] The parties clearly intended to afford SHSH (as lender) protection if the events in Clause 5.4 should occur, by making the whole of the SHSH Convertible Loan [ie, the whole of the Original Principal Sum] due and payable immediately in cash. This is consonant with the [parties’ intention] that the unconverted balance [ie, the Outstanding Principal Sum] would likewise be paid in cash pursuant to Clause 5.2 on the Repayment Date, if the events in Clause 5.4 did not happen.The parties could not have intended to penalise the lender with a 25% “haircut” (as the “price” or “premium” for convertibility) if things went well, but to waive the “haircut” if the events in Clause 5.4 were to occur (in which case the lender would get a windfall).[emphasis added in italics and bold italics] The appellant submitted that, if the parties to the Deed had indeed intended that cl 5.2 would effectively extinguish 25% of the Outstanding Principal Sum on the Repayment Date, they would have stated so expressly in the Deed, just as they had taken the effort to state in cl 4, in “very explicit (and compendious) language”[note: 15], that any portion of the Warrant Liability Amount which had not been applied towards the exercise of the Warrants within the Loan Tenure would be extinguished, as follows (see cl 4.1 of the Deed): At the expiry of the Loan Tenure, any portion of the Warrant Liability Amount which has not on or prior to such date been utilized and applied towards the exercise of the Warrants in accordance with [c]lause 3 shall be deemedsettled, satisfied, dischargedandreleasedas at such date of expiry of the Loan Tenure ... [emphasis added] The appellant further pointed out that cl 5.5(a) likewise employed comparable language to make it clear that the amount to be repaid to SHSH under the SHSH Convertible Loan would be correspondingly reduced whenever any part of the Original Principal Sum was converted into Shares, as follows: [O]nce so utilised and applied [towards the conversion of the Original Principal Sum into Shares] that relevant principal amount of the SHSH Convertible Loan shall bedeemed fully and effectually repaid... [emphasis added] In contrast, cl 5.2 did not use any terms such as “settlement”, “satisfaction”, “discharge”, “release” or “repayment” in respect of 25% of the Outstanding Principal Sum. 81        The respondent’s counter-arguments were that, first, cl 5.2 of the Deed was the governing clause relating to repayment of the SHSH Convertible Loanin all circumstances that were not covered by cll 5.3 and 5.4. The respondent submitted that, that being so, “[c]lause 5.2 [could not] be as the Appellant assert[ed] ... the mere counterpart [of] clause 5.5(b)(iv)”.[note: 16]In the respondent’s view, cll 5.3 and 5.4 would trigger full repayment (ie, repayment of 100% of the Original Principal Sum) only “if there was no viable conversion feature or if the [respondent’s] business fail[ed]”[note: 17][emphasis in original omitted]; those clauses did not support the appellant’s contention that full repayment would be made under other circumstances. 82        In its submissions on this point, the respondent referred to the Judge’s grounds for allowing its appeal in the proceedings below. The Judge had stated in the GD: 39         If indeed the words “the SHSH Convertible Loan” in cl 5.2 are meant to refer to theoriginalprincipal amount of $2,270,000 as contended by [the appellant] (and not to theoutstandingprincipal amount of the loan as at the [R]epayment [D]ate), then the repayment term in cl 5.2 makes no sense and is wholly unworkable because it totally disregards any part of the loan that might have been earlier used for conversion into [S]hares and, hence, extinguished from the principal amount still owing. 40         An example will show why [the appellant’s] interpretation is both not sensible and not workable. If “the SHSH Convertible Loan” in cl 5.2 means theoriginalprincipal amount [of] $2,270,000, then cl 5.2 requires $1,702,500 (or 75% of $2,270,000) of the loan to be repaid in cash. This means that [the respondent] will invariably have to pay out a fixed sum of $1,702,500 on the [R]epayment [D]ate in accordance with cl 5.2. But what if SHSH had, prior to the [R]epayment [D]ate, used $1,500,000 of the [SHSH] Convertible Loan [for conversion into] 10,000,000 ... [S]hares at $0.15 per [S]hare? Applying [the appellant’s] interpretation [of] cl 5.2, [the respondent] will still have to repay SHSH the sum of $1,702,500 in cash, being 75% of the original loan amount of $2,270,000. If so, then the total amount effectively repaid by [the respondent] is $1,500,000 plus $1,702,500 making a total repayment of $3,202,500 for a convertible loan which started off with only anoriginalprincipal amount of $2,270,000. This example not only illustrates the absurdity of interpreting the relevant amount of ... “the SHSH Convertible Loan” in cl 5.2 to mean theoriginalprincipal amount of $2,270,000, but also demonstrates that cl 5.2 [was] never meant to operate on theoriginalprincipal amount. In my view, it can only logically refer to theoutstandingprincipal amount as at the date of repayment. [emphasis in original] Our analysis 83        We are of the view that the appellant’s interpretation of cl 5.2 of the Deed presents the more satisfactory solution. 84        Dealing first with the contention as to how narrowly (or otherwise) the words “[s]ubject to [c]lause 5.3” in cl 5.2 should be construed, we regard those words as setting out apreconditionfor cl 5.2 to come into operation;ie, if the Conversion Feature is unavailable due to (inter alia) the respondent being unable to obtain the requisite approval for its exercise, cl 5.2 and most of the remaining provisions of cl 5 (which deal with conversion of the Original Principal Sum into Shares in one way or another) will cease to be operative as they will be redundant, save for cl 5.3 (because of the opening words of cl 5.2 as well as the express words in cl 5.3, “[i]n the event [that] the [respondent] is unable to obtain all relevant approvals for the Conversion Feature”) and cl 5.4 (because of the words, “[n]otwithstanding anything in ... [c]lause 5”). Clauses 5.3 and 5.4 stand on their own, regardless of whether or not the Conversion Feature is available. 85        In other words, the phrase “[s]ubject to [c]lause 5.3” in cl 5.2 is intended to avoid any doubt that, if the Conversion Feature does not work out, cl 5.2 will have no effect; instead, the operative clause in that scenario will be cl 5.3, which provides for repayment of “100% of the SHSH Convertible Loan” –ie, 100% of the Original Principal Sum – in cash. Seen in this light, the words “[s]ubject to [c]lause 5.3” are not intended to additionally preclude cl 5.2 from being read in the light of the other sub-clauses of cl 5, in particular, cl 5.5. 86        Before this court, the respondent argued that cl 5.2 was the only repayment provision in the Deed. We are not persuaded by this arid argument, which is shorn of context. On the Repayment Date, one of three possible scenarios would materialise, namely: (a)        only the Minimum Conversion Amount –ie, exactly $567,500 (25% of $2,270,000) – has been converted into Shares; or (b)        less than the Minimum Conversion Amount has been so converted; or (c)        more than the Minimum Conversion Amount has been so converted. It is impossible to arrive at a meaningful construction of the respondent’s repayment obligation if cl 5.2 is read as a self-contained provision shorn of its context (see in this regard [77] above). We have also explained in the preceding paragraph why the explicit mention of cl 5.3 only in cl 5.2 does not preclude the latter from being read harmoniously with the other provisions of cl 5. In our view, construing the respondent’s repayment obligation contextually requires that cl 5.2 be juxtaposed and read together with cll 5.5(a) and 5.5(b)(iv). 87        Under cl 5.5(a) of the Deed, any part of the Original Principal Sum that is converted into Shares “once so utilised and applied ... shall be deemed fully and effectually repaid”. This provision applies to any part of the Original Principal Sum that is converted into Shares, and not just to the Minimum Conversion Amount. This easily supports the appellant’s rather logical assertion (at [79] above) that there was no question about SHSH being repaid more than the Original Principal Sum if it chose to convert more than the Minimum Conversion Amount into Shares. 88        Clause 5.5(b)(iv) sets out the requirement that at least the Minimum Conversion Amount must be converted into Shares by the Repayment Date, as follows: [I]n the event [that] less than 25% of the SHSH Convertible Loan has been converted into Shares as at the Repayment Date (the difference between 25% of the SHSH Convertible Loan and the actual amount of [the] SHSH Convertible Loan converted into Shares [is] to be referred to as [the] “Shortfall Conversion Amount”), a Conversion Notice is deemed to be served on the Repayment Date to convert the Shortfall Conversion Amount into Shares on the terms of this clause 5. 89        To sum up, the respondent’s repayment obligation as set out in the Deed is as follows: (a)        If exactly $567,500 –ie, the Minimum Conversion Amount – has been converted into Shares by the Repayment Date, the respondent must repay in cash 75% of the Original Principal Sum, which amounts to $1,702,500, on that date (see cl 5.2). (b)        If more than the Minimum Conversion Amount has been converted into Shares by the Repayment Date, the respondent must repay in cash 75% of the Original Principal Sumless whatever part of that sum which has already been converted into Shares(see cl 5.2 read with cl 5.5(a)). The amount to be repaid in cash by the respondent in this scenario will invariably be less than $1,702,500 (75% of the Original Principal Sum) since more than $567,500 (25% of the Original Principal Sum) has already been utilised for conversion into Shares. (c)        If less than the Minimum Conversion Amount has been converted into Shares by the Repayment Date, the difference between the Minimum Conversion Amount and the amount that has actually been converted into Shares will be deemed to have been converted into Shares, and (a) above will apply (see cl 5.2 read with cl 5.5(b)(iv)). In other words, the respondent will repay in cash exactly 75% of the Original Principal Sum. It can be seen from the above analysis that cl 5.2, read together with cll 5.5(a) and 5.5(b)(iv), provides for100%of the Outstanding Principal Sum to be repaid in cash on the Repayment Date. In the scenario set out in sub-paras (a) and (c) above, the Outstanding Principal Sum would be exactly $1,702,500, whereas, in the situation outlined in sub-para (b) above, the Outstanding Principal Sum would be an amount less than $1,702,500, with the precise quantum of repayment being dependent on how much of the Original Principal Sum has been converted into Shares. 90        Chao JA has rejected the appellant’s construction of cl 5.2 because, in his view, it would require substituting “100%” in cl 5.2 for “75%” and, furthermore, there is no basis to link cl 5.2 with cl 5.5(b)(iv) (see [30], [33] and [34] above). With respect, we disagree. The reasoning which we have adopted (as summarised at [84]–[87] and [89] above) does not entail rewriting cl 5.2; rather, it is premised on interpreting cl 5 as a whole, which in turn means reading cl 5.2 in conjunction with cll 5.5(a) and 5.5(b)(iv). While we do not disagree with Chao JA’s analysis (at [26] above) of why Meadow Springs (which, as the respondent’s white knight, was effectively the party in control of the respondent) could have acceded to repayment of 100% of the Original Principal Sum if any of the events specified in cll 5.3 and 5.4 occurred, in our opinion, those clausesdo notset out exhaustively those instances whereby full repayment of the Original Principal Sum would be made under the Deed. 91        Construing the Deed as a whole, as we must, we accept the appellant’s assertion that it is significant that the drafters of the Deed diligently ensured, via cl 4.1, that there would be no doubt that the respondent’s indebtednessvis-à-visany portion of the Warrant Liability Amount which was not applied towards the exercise of the Warrants within the Loan Tenure would be extinguished. The omission of a similar provision relating to the extinguishment of the Outstanding Principal Sum on the Repayment Date is, in our view, unlikely to have been an inadvertent oversight. 92        For the reasons given above (at [84]–[91]), we are of the view that the more logical interpretation of cl 5.2, and the one which would co-exist more harmoniously with the other sub-clauses in cl 5, is that advanced by the appellant and adopted by the District Judge. In other words, cl 5.2 provides for repayment in cash of 100% of the Outstanding Principal Sum on the Repayment Date; that sum will amount to a maximum of $1,702,500 (75% of the Original Principal Sum), depending on what percentage of the Original Principal Sum has been converted into Shares by that date.",
        "Making (commercial) sense of the Deed": "The parties’ submissions 93        Not surprisingly, in seeking to persuade this court that the Judge was correct in his interpretation of the Deed, the respondent relied on the former’s analysis of the commercial purpose underlying the Deed, which was as follows (see the GD at [50]–[51]): 50         ... In my view, the valuable consideration agreed to be given by the lender to the borrower under the Deed in exchange for the convertibility feature in the restructured loan [ie, the Conversion Feature in the SHSH Convertible Loan] is effectively provided by the 25% discount on the cash repayment ... of the unconverted loan. 51         Hence, reading cll 1.1, 2.2(ii), 5.5(a) and 5.2 together, and having regard to the Deed as a whole, the most sensible interpretation that will give effect to the objective business intentions of the parties to the Deed is to construe cl 5.2 to mean that75%of the remaining or outstanding SHSH Convertible Loan [ie, 75% of the Outstanding Principal Sum] shall be repaid in cash on the [R]epayment [D]ate. Clause 5.2 is the singular operative clause specifying how the outstanding SHSH Convertible Loan [ie, the Outstanding Principal Sum] is to be repaid. [emphasis in original] 94        The respondent submitted that, if its business failed, SHSH would likely not receive any repayment at all in respect of the SHSH Convertible Loan and any Shares that SHSH owned would be worthless. Thus, “SHSH obviously stood to gain more (or to be precise, stood to lose much less)”[note: 18]by agreeing to the restructuring scheme as reflected in the various agreements entered into on 29 September 2003, which included the Deed (see further [110] below). The respondent argued that, under these circumstances:[note: 19] It cannot be objectively said that a reasonable commercial person would not [make] a commercial decision to enter into the Deed ... with the 25% haircut on cash repayment in respect of the SHSH Convertible Loan; in the period of 3 years [ie, the period between the date of the Deed (viz, 29 September 2003) and the Repayment Date (viz, 29 September 2006)], there was at that time a possibility that [Meadow Springs’] effort could rescue the [respondent] and [the] [S]hares [ie, shares in the respondent] would be worth more than $0.15 per [S]hare at some point in time during the 3-year period. 95        The respondent underlined that SHSH had sold 30,813,440 Shares which it owned (ie, the S&P Shares referred to at [50] above) to Meadow Springs at the price of $0.0475 per Share, and that SHSH had then agreed,vis-à-visthe Warrant Liability Amount, that it would use that sum to exercise the Warrants at the price of $0.11 per Share. Since it was not alleged that the exercise price of $0.11 per Share in relation to the Warrants was unreasonable and since SHSH had agreed to that price, it could not be said to be unreasonable for SHSH, upon converting the SHSH Convertible Loan (or, at least, the Minimum Conversion Amount) into Shares, to pay $0.15 per Share as that was only slightly higher than the price which SHSH would pay for each Share when it exercised the Warrants. As such, in the respondent’s view, the higher price of $0.15 per Share which SHSH would have to pay when it exercised the Conversion Feature (as compared to the price at which it sold the S&P Shares to Meadow Springs)did notconstitute payment for the Conversion Feature. It followed that it was reasonable to construe cl 5.2 of the Deed as requiring SHSH to accept a 25% “haircut” on the amount of cash repayment which it would receive on the Repayment Date, with that “haircut” constituting payment for the Conversion Feature. 96        The appellant, on the other hand, highlighted the various forms of indulgences that SHSH had already granted to the respondent (and, in turn, Meadow Springs since Meadow Springs in effect had control of the respondent as its white knight (see [90] above)) under the Deed, namely: (a)        SHSH had effectively agreed to allow the respondent to repay in the form of Shares at least some 58% of the SHSH Liability Amount of $4,043,337.50 (see [51] above). This was because the Warrant Liability Amount (viz, $1,773,337.50), which effectivelyhad to beappliedin fulltowards the exercise of the Warrants in view of cl 4.1 of the Deed, and the Minimum Conversion Amount (viz, $567,500) together added up to $2,340,837.50, which constituted approximately 57.89% of the SHSH Liability Amount. (b)        SHSH had agreed to reacquire Shares at a much higher price in the future (viz, at $0.11 per Share upon exercising the Warrants and at $0.15 per Share upon exercising the Conversion Feature) than the price at which it had sold the S&P Shares to Meadow Springs (viz, $0.0475 per Share). (c)        SHSH had agreed to defer cash repayment of the Outstanding Principal Sum (which could come up to a maximum of $1,702,500 (see [92] above)) for three years (viz, the period from 29 September 2003 to 29 September 2006) without interest. The appellant contended that it did not accord with commercial sense to interpret the Deed as requiring SHSH, over and above the indulgences that it had already granted, to pay for the Conversion Feature by accepting a 25% “haircut” on the amount of cash repayment which it would receive on the Repayment Date in respect of the Outstanding Principal Sum. 97        The appellant further argued that, if the respondent’s interpretation of cl 5.2 (viz, that it provided for cash repayment to SHSH on the Repayment Date of only 75% of the Outstanding Principal Sum) were correct, it would mean that SHSH could lose up to $425,625 (ie, 25% of $1,702,500, the maximum quantum of the Outstanding Principal Sum) if it did not convert the whole of the Original Principal Sum into Shares by the Repayment Date. The appellant added that it was unrealistic to infer that SHSH had agreed to take this risk given the circumstances at the time the Deed was entered into, and given that SHSH already stood to lose up to $567,500 (ie, the Minimum Conversion Amount) if the price of the Shares on the Repayment Date was less than $0.15 per Share (viz, the price which SHSH had to pay for each Share upon exercising the Conversion Feature). The appellant also asserted that SHSH did not need to provide any consideration for the Conversion Feature to be valid. He submitted that, in any case, even if consideration were required, a creditor’s conduct in forbearing to sue or to demand immediate repayment constituted good consideration (see Andrew Phang Boon Leong,Cheshire, Fifoot and Furmston’s Law of Contract: Second Singapore and Malaysian Edition(Butterworths Asia, 1998) at p 168) and SHSH had demonstrated such forbearance by agreeing, via the provision in the Deed stipulating the date for repaying the SHSH Convertible Loan, to the three-year moratorium on repayment. Our analysis 98        In our view, from a commercial perspective, the appellant’s position is more sensible and reasonable than the respondent’s. 99        We note that the respondent did not adduce evidence that Meadow Springs considered its injection of funds into the respondent in 2003 to be a strategic, medium to long-term investment. Any concern that Meadow Springs had about leakage of cash from the respondent must be presumed to have been addressed by the stipulated three-year moratorium on repayment of the SHSH Convertible Loan. While it is understandable that the respondent wished to minimise its cash outlay for the purposes of repaying the SHSH Convertible Loan, the question is whether the same motivation could be imputed to Meadow Springs as at 29 September 2003, when the Deed was entered into. 100      There is no question that the terms of the Deed favoured the commercial interests of Meadow Springs and addressed its priority of channelling the funds which it was injecting into the respondent towards reviving the respondent’s business instead of towards repaying the respondent’s creditors. However, notwithstanding that Meadow Springs was in a stronger bargaining position than SHSH when the Deed was being negotiated, for the Deed to make commercial sense, its terms cannot be construed in a manner which is so oppressive that, when viewed objectively, it would be difficult to conceive of any reasonable party in SHSH’s position agreeing to those terms. When SHSH first disbursed the SHSH Convertible Loan to the respondent, it expected to be repaid in cash. Under the Deed, it had to postpone receiving cash repayment without charging interest for the delay. Further, as a concession to (presumably) Meadow Springs, SHSH also had to agree that a sum equivalent to at least the Minimum Conversion Amount (viz, $567,500) would be repaid in the form of Shares rather than in cash. This entailed SHSH accepting the risk that it might not be repaid the full value of at least the Minimum Conversion Amount (as a result of the high conversion price of $0.15 per Share which it had to pay for converting the SHSH Convertible Loan into Shares) in the hope that the respondent’s fortunes could be revived with the injection of much-needed funds from Meadow Springs and that SHSH would be repaid the Original Principal Sum in full in due course. Beyond that, and in view of the uncertain outlook for the respondent’s business as at September 2003, it is commercially unrealistic to say that SHSH agreed to pay a hefty premium for the Conversion Feature in the form of extinguishment of 25% of the Outstanding Principal Sum on the Repayment Date. SHSH would have done so only if it considered the Conversion Feature to be a mechanism by which it could enhance (appreciably) its return from the SHSH Convertible Loan. In our view, to infer such a consideration and such agreement on the part of SHSH, given the circumstances under which the Deed and the other related agreements set out at [110] below were entered into, would be quite far-fetched. 101      In principle, a convertibility feature could quite plausibly have intrinsic commercial value and could thus render a convertible loan more valuable to a lender than a simple non-convertible loan, as the Judge recognised (see the GD at,inter alia, [63]). However, a construction of the respondent’s repayment obligation in view of the relevant factual matrix and the commercial context of the Deed has led us away from interpreting the Deed as requiring SHSH to pay for the benefit of the Conversion Feature. In our view, the Deed does not contemplate SHSH paying a price or a premium in return for the benefit of convertibility. 102      We also would not interpret the Deed as imposing, via a 25% “haircut” on the amount of cash repayment which SHSH would receive on the Repayment Date in respect of the Outstanding Principal Sum, a practical disincentive for SHSH not to convert 100% of the Original Principal Sum into Shares (contraChao JA’s view at [40] above) because a term of this nature would tilt the balance between the signatories too far in Meadow Springs’ favour (Meadow Springs being, as we pointed out at [90] above, effectively the party in control of the respondent at the time the Deed was executed); again, this outcome, in our view, would not be commercially sensible. Only unambiguous words in the Deed providing for such a disincentive can justify this court adopting such an interpretation. If Meadow Springs had indeed intended to make it a disincentive for SHSH not to convert 100% of the Original Principal Sum into Shares, surely, it would have made more sense for Meadow Springs to provide for this explicitly in the Deed and leave SHSH in no doubt that conversion of the whole of the Original Principal Sum was the only way in which it had any prospect of receiving full repayment of that sum. At this juncture, we would reiterate that the contrast between the wording of cl 4 of the Deed in respect of that part of the Warrant Liability Amount which had not been applied towards the exercise of the Warrants and the wording of cl 5 in respect of that part of the SHSH Convertible Loan which had not been converted into Shares by the Repayment Date (see [91] above) should not be overlooked. Thus, we would, with respect, depart from Chao JA’s interpretation (at [38] above) that the Deed provided for the extinguishment of 25% of the Outstanding Principal Sumvis-à-visthe amount of cash repayment which SHSH would receive on the Repayment Date as a disincentive for non-conversion or, to put it in positive terms, as an incentive for SHSH to convert the whole of the Original Principal Sum into Shares by the Repayment Date. 103      We note too that Meadow Springs extracted some measure of forbearance from SHSH under the terms relating to the Warrant Liability Amount. The exercise price of the Warrants was pegged at $0.11 per Share. While this price was lower than the conversion price of $0.15 per Share under the Conversion Feature, it was still relatively steep compared with the price of $0.0475 per Share at which SHSH sold the S&P Shares to Meadow Springs. Furthermore, SHSH was given only seven months to exercise the Warrants (because of the way in which the Loan Tenure had been defined), failing which it would have to forgo repayment of whatever part of the Warrant Liability Amount that had not been utilised for exercising the Warrants. These were rather onerous terms, and they reinforced our view that SHSH had already paid a substantial price via these terms to secure Meadow Springs’ involvement in the Rescue Plan. To accept the respondent’s argument that SHSH was required to pay even more in the form of a 25% “haircut” on the cash repayment which it would receive on the Repayment Datevis-à-visthe Outstanding Principal Sum – whether this “haircut” is interpreted as a premium paid by SHSH for the Conversion Feature (which was the Judge’s view) or an incentive for SHSH to convert the whole of the Original Principal Sum into Shares (which was Chao JA’s view) – is, from an objective perspective, rather unreasonable, particularly since the parties could readily have made express provision, if they so wished, for a price to be paid for the Conversion Feature or for SHSH to be given an incentive to convert the Original Principal Sum in full into Shares by the Repayment Date. Concomitantly, it is highly improbable that the interpretation of cl 5.2 advanced by the respondent reflected the intention of the signatories when the Deed was entered into. 104      The interpretation put forward by the respondent, which was accepted by the Judge and Chao JA (albeit on different grounds), entails that, even if SHSH had converted as much as 90% of the Original Principal Sum by the Repayment Date, it would still have had to forgo 2.5% of the Original Principal Sum (ie, 25% multiplied by 10% of the Original Principal Sum) on that date. We are unable to agree with that position. Here, we would refer to one of the principles of contractual interpretation that Lord Hoffmann laid down in his seminal decision inInvestors Compensation Scheme Ltd v West Bromwich Building Society[1998] 1 WLR 896 (at 913), namely: The “rule” that words should be given their “natural and ordinary meaning” reflects the common sense proposition that we do not easily accept that people have made linguistic mistakes, particularly in formal documents.On the other hand, if one would nevertheless conclude from the background that something must have gone wrong with the language, the law does not require judges to attribute to the parties an intention which they plainly could not have had.Lord Diplock made this point more vigorously when he said inAntaios Compania Naviera S.A. v. Salen Rederierna A.B.[1985] A.C. 191, 201: “if detailed semantic and syntactical analysis of words in a commercial contract is going to lead to a conclusion that flouts business commonsense, it must be made to yield to business commonsense.” [emphasis added] 105      This court cited Lord Hoffmann’s principles with approval inSandar Aung v Parkway Hospitals Singapore Pte Ltd[2007] 2 SLR 891(at [35]) and again inZurich Insurance(([61]supra) at [56]). Applying these principles, the combination of two factors has left us altogether unconvinced that the Deed provides for 25% of the Outstanding Principal Sum to be extinguished on the Repayment Date: first, the absence of clear and unambiguous words to that effect; and second, the lack of any reasonable commercial sense of such an arrangement (see also [113] below). 106      In our view, a holistic perspective of the commercial sense underlying the Deed would be as follows. At the material time, SHSH, being a major shareholder of the respondent, was concerned with facilitating the latter’s survival as a going concern; in this way, SHSH could have some hope of realising some value from the Shares which it owned and of being repaid the sum which it had loaned to the respondent. To secure Meadow Springs’ involvement in the Rescue Plan, SHSH agreed to a low selling price for the S&P Shares. This not only benefited the respondent (by securing Meadow Springs’ participation as a white knight), but also enabled SHSH to liquidate part of the Shares which it owned while the respondent was still solvent. By agreeing to a conversion price (viz, $0.15 per Share) which was more than three times the price at which it had sold the S&P Shares to Meadow Springs (viz, $0.0475 per Share) when the respondent’s financial situation was dire and its prospects, tentative at best, SHSH took on the substantial risk of a “haircut” –ie, receiving less than full repayment of at least $567,500 (viz, the Minimum Conversion Amount) if the price of each Share was lower than $0.15 on the Repayment Date – when it entered into the Deed. Taking these factors cumulatively, it is improbable that SHSH also agreed, in return for having the benefit of the Conversion Feature, toadditionallyforgo 25% of the cash repayment which it was to receive on the Repayment Date in respect of the Outstanding Principal Sum. 107      In our view, it is implicit in cl 5.5(b)(iv) of the Deed that Meadow Springs would be satisfied with only the Minimum Conversion Amount being converted into Shares by the Repayment Date, even though any conversion in excess of that amount would of course benefit the respondent in terms of reducing its cash outlay when repaying the SHSH Convertible Loan. To our minds, there is little doubt that, if Meadow Springs had insisted that a higher percentage of the Original Principal Sum be converted into Shares at the very least so as to lower the respondent’s debt burden further, a stipulation to that effect would have been incorporated in the Deed. Yet, Meadow Springs took the view that its objective of reducing the respondent’s debt burden as much as possible could be met as long as at least the Minimum Conversion Amount was converted into Shares by the Repayment Date. Of course, the fact that the Minimum Conversion Amount was set at 25% of the Original Principal Sum (and not at a higher percentage) could also reflect some exertion of bargaining power on the part of SHSH during the negotiations prior to the execution of the Deed. Either explanation casts unresolved doubt on the respondent’s submission that SHSH could well have tacitly agreed, as payment for the Conversion Feature, to give up cash repayment of 25% of the Outstanding Principal Sumin addition toall the other concessions which it had already made. 108      There is another reason why we do not regard the Deed as requiring SHSH to pay for the Conversion Feature. It could be that Meadow Springs was confident of turning the respondent’s fortunes around within three years such that the price of each Share would be higher than $0.15 by the Repayment Date, but nonetheless fixed the conversion price at $0.15 per Share as a concession to SHSH in view of the forbearance that SHSH had granted to the respondent under the Deed and/or to encourage SHSH to opt for repayment in the form of Shares. An incentive to convert the Original Principal Sum into Shares in the form ofa conversion price that is lower than the expected price of each Share on the Repayment Dateis very different from a disincentive for non-conversion in the form ofa 25% “haircut” on the cash repayment which SHSH would receive on the Repayment Date in respect of the Outstanding Principal Sum. There is no reason why Meadow Springs, despite being in the ascendant position at the time the Deed was entered into, could not have designed the Conversion Feature such that all the parties to the Deed would stand to gain if the Rescue Plan succeeded. After all, Meadow Springs, as an outside investor, must have seen both value in the respondent and the prospect of a future upturn in the latter’s fortunes before it invested its funds in the respondent. As we see it, the Conversion Feature allowed SHSH to enjoy any potential rise in the price of the Shares if the debt restructuring and the Rescue Plan proved successful in returning the respondent to profitability. It has not passed unnoticed to us that Lim, the other assignee of the SHSH Convertible Loan as well as the respondent’s sometime managing director, had with evident alacrity converted his entire interest in the SHSH Convertible Loan into Shares (see [56] above). At the same time, the Conversion Feature provided the respondent with an incentive to improve its performance within a specific time frame (ie, the period between the date of the Deed and the Repayment Date) so that SHSH would be more likely to opt for repayment of the Original Principal Sum in the form of Shares. 109      Finally, the Judge stated (see the GD at [68]): I do not think it is for the court to evaluate the adequacy or inadequacy of the consideration for the valuable convertibility option [ie, the Conversion Feature] that the parties have agreed [on] for the SHSH Convertible Loan. At the same time, however, one of the premises on which the Judge based his interpretation of the Deed (viz, that it required SHSH to pay for the Conversion Feature by taking a 25% “haircut” on the amount of cash repayment which it would receive on the Repayment Datevis-à-visthe Outstanding Principal Sum) was that “the valuable convertibility feature [could not have] come free” (idat [63]). With respect, the approach which the Judge took in interpreting the Deed was not quite consistent with his statement of principle at [68] of the GD.",
        "Use of extrinsic evidence to discern the commercial context of the Deed": "110      On 29 September 2003, the respondent informed SGX by way of an announcement made on MASNET (“the MASNET announcement”) that it had entered into,inter alia, the Deed. The MASNET announcement also reported that the following events had taken place on the same day (ie, 29 September 2003), namely: (a)        Meadow Springs had entered into a sale and purchase agreement with SHSH (ie, the agreement mentioned at [50] above) to purchase the S&P Shares from the latter at the price of $0.0475 per Share. (b)        Meadow Springs had entered into a call and put option agreement with Lim in respect of all of the 36,112,500 Shares which he owned (“the TL Shares”), as well as a call and put option agreement with SHSH and Linguafranca in respect of all of the Shares which each of them owned (collectively referred to as “the SHSH & LF Shares”), which together amounted to 22,924,060 Shares (after taking into account SHSH’s sale of the S&P Shares to Meadow Springs). Under these call and put option agreements, Lim as well as SHSH and Linguafranca had granted Meadow Springs a call option, which was valid for six months from 29 September 2003 (“the Call Option Period”), to acquire the TL Shares and the SHSH & LF Shares respectively at a price of $0.0475 per Share. (c)        Meadow Springs had granted to Lim as well as to SHSH and Linguafranca a put option to sell the TL Shares and the SHSH & LF Shares respectively to Meadow Springs at the same price (ie, $0.0475 per Share) during the period of five market days immediately after the expiry of the Call Option Period. (d)        Meadow Springs, Lim and SHSH had agreed that, during the period of seven months from 29 September 2003 (the date of the call and put option agreements), Lim and SHSH had the right to sell an aggregate of 26,955,000 Shares arising from the conversion of 10,833,750 warrants held by Lim and 16,121,250 warrants held by SHSH at a price to be calculated based on a prescribed formula, with Meadow Springs having a right of first refusal in respect of the sale of those shares. (e)        The respondent had entered into a deed with SHSH (ie, the Deed) in relation to the settlement of the SHSH Liability Amount. (f)         The respondent had entered into a deed with Lim in relation to the settlement of the sum of $2,244,726.49 that it owed the latter. 111      For the purposes of construing the Deed, the information in the MASNET announcement that Lim, together with SHSH and Linguafranca, had been granted the right under the above-mentioned put and call option agreements to sell the TL Shares and the SHSH & LF Shares respectively to Meadow Springs at the price of $0.0475 per Share within a prescribed period of time is of some relevance. Presumably, SHSH (as well as Lim and Linguafranca) would only exercise this option if the market price of the Shares fell below the price of $0.0475 per Share. Since these call and put option agreements were entered into contemporaneously with the Deed, they are also helpful in fleshing out the factual matrix of the latter. A holistic view of the various arrangements entered into on 29 September 2003 suggests that Meadow Springs was prepared to make some concessions too and, although it had the strongest hand in the negotiations relating to the Rescue Plan, it did not necessarily set out at the same time to extract the maximum “price” from and/or to inflict the maximum “pain” on SHSH, Lim and Linguafranca in return for injecting funds into the respondent. This information lends some further tangential support to our view that SHSH was not as disadvantaged by the terms of the Deed as the respondent alleged; however, it is not critical to our ultimate decision in this appeal.",
        "Summary of our analysis of clause 5.2": "112      To summarise, our decision is that this appeal should be allowed on the following grounds: (a)        Clause 5.2 on its own cannot be said to entirely encapsulate the respondent’s repayment obligation under the Deed; instead, it has to be read together with cll 5.5(a) and 5.5(b)(iv). Reading these provisions harmoniously, our interpretation of cl 5 is that: (i)         the respondent must repay 100% of the Original Principal Sum, with at least the Minimum Conversion Amount to be repaid in the form of Shares rather than in cash; and (ii)        clause 5.2 does not provide for 25% of the Outstanding Principal Sum to be extinguished on the Repayment Date. (b)        Even though the Deed does not impose a 25% “haircut” on the amount to be repaid to SHSH in cash on the Repayment Datevis-à-visthe Outstanding Principal Sum, it makes commercial sense from Meadow Springs’ point of view. After all, Meadow Springs was arguably always in a position to require a higher proportion of the Original Principal Sum to be converted into Shares in order to achieve its objective of reducing the respondent’s debt burden as much as possible, but it refrained from doing so. Further, SHSH made several concessions under the Deed; it also took the risk that it would not receive full repayment of at least the Minimum Conversion Amount if the price of the Shares failed to rise to at least $0.15 per Share by the Repayment Date. Given these facts, it is commercially unreasonable to construe the Deed in the manner contended by the respondent,ie, as stipulating that 25% of the Outstanding Principal Sum would be extinguished on the Repayment Date, with this provision constituting either a premium paid by SHSH for the Conversion Feature (as the Judge held) or an incentive for SHSH to convert the whole of the Original Principal Sum into Shares (as Chao JA held). In our view, only the presence of clear and unambiguous words spelling out such a provision can justify our adopting the respondent’s rather strained interpretation of the Deed – and there were no words to this effect in the present case. 113      In the final analysis, it would not be wrong to pose the following question: While both Meadow Springs and the respondent were willing to accept the conversion of only $567,500 (ie, the Minimum Conversion Amount) into Shares, would it not have been in their interests to encourage conversion by SHSH of an even larger proportion of the Original Principal Sum by the Repayment Date so that the additional capitalisation could shore up the respondent’s parlous financial balance sheet? 114      The truth of the matter is that the present conundrum could never have been envisaged by the parties concerned (ie, the respondent, SHSH and Meadow Springs) as, at the material time, SHSH was the sole counterpart of the respondent in the Deed. We are sure that the signatories to the Deed and Meadow Springs could never have contemplated that the Conversion Feature would subsequently come to be exercised in an uncoordinated manner by two distinct parties (namely, Lim and the appellant (as Linguafranca’s assignee)) arising from the voluntary liquidation of SHSH. The solution to the present impasse is therefore to interpret the relevant provisions contextually in the commercially reasonable manner that was originally envisaged by the parties when they entered into the Deed. We agree with the District Judge that, as stated earlier at [68] above, the respondent’s stance –viz, that 25% of the Outstanding Principal Sum would be extinguished on the Repayment Date – “[would lead] to a fairly unreasonable result and if the parties did intend that result, it would be necessary that they make their intention abundantly clear”.[note: 20]It is clear to us that, once at least the Minimum Conversion Amount had been converted into Shares by the Repayment Date, the respondent was obliged to repay in cash 100% of the Outstanding Principal Sum, whatever quantum that sum might come up to."
    }
}