{
    "case_title": "Kay Swee Pin v Singapore Island Country Club",
    "ncitation": "[2008] SGCA 11",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1          This is an appeal by Mdm Kay Swee Pin (“the appellant”) against the decision of the trial judge (“the Judge”) in Originating Summons No 2125 of 2006 in which he dismissed her application to set aside the decision of the respondent, Singapore Island Country Club (“SICC” or “the Club”), in suspending her from SICC membership for one year from 19 May 2006 to 18 May 2007 and for other reliefs (see [83] below). At the conclusion of the hearing before us, we allowed the appeal. We now give our full reasons for allowing the appeal.",
        "Social clubs and natural justice": "2          This appeal is concerned with the power of the court to review the exercise of the disciplinary powers by a recreational and social club which owns very substantial assets and which allows members to buy and sell its membership subject to approval by its governing body. The legal relationship between any club and its members lies in contract, and the rights of members are determined by the terms of the contract, which are found in the constitution or the rules of the club. The traditional approach of the courts to social clubs is to leave such clubs to manage their own affairs. However, where a club expels a member, it may only do so in compliance with the rules of natural justice. In the court below, the Judge, after referring toLee v The Showmen’s Guild of Great Britain[1952] 2 QB 329 and the decision of this court inSingapore Amateur Athletics Association v Haron bin Mundir[1994] 1 SLR 47, stated the established principles in his grounds of decision ([2007] SGHC 166) at [30]: In matters relating to disciplinary tribunals of clubs which are essentially social in nature, such as the SICC, the court does not sit on appeal from their decisions. The court’s role is to ensure that the rules of natural justice have been complied with and that the disciplinary procedure set out in the club’s rules has been observed. 3          Before us, counsel for SICC contended that in accordance with established principles, this court should not interfere with the decision of the general committee of the Club (“the GC”) to suspend the appellant from membership of the Club so long as the GC had observed the rules of natural justice. He contended that the courts had no power to determine whether the GC’s decision was fair or whether the GC had come to a wrong conclusion on the facts. The GC was not sitting in judgment over matters of a trade or profession affecting an individual’s economic or property rights. What was at issue here, he pointed out, was merely the temporary cessation of the enjoyment of the privileges of a social club. He contended that the GC had not breached any of the rules of natural justice in the process of finding the appellant guilty of the charge against her (“the Charge”),viz, that of falsely declaring one Ng Kong Yeam (“NKY”) as her spouse when she applied to become a member in 1992 so as to enable him to use the Club’s facilities. 4          We, however, pointed out to counsel that this case did not involve simply the suspension of a member from the Club. It was pertinent that membership of the Club was transferable. Membership of SICC is highly sought after for its social cachet as well as for the recreational, social and sports facilities (especially golf facilities) which the Club offers. Membership of SICC is regarded as a symbol of social success by many. For these reasons, membership of SICC comes at a high price. In the present case, the appellant paid $190,000 in 1992 to purchase her transferable membership. Hence, a transferable membership has not only a social value but also an economic value. 5          The appellant’s case against the Club is based entirely on alleged breaches of natural justice in two broad areas, which her counsel has referred to as “the directed issue” and “the breach of natural justice issue”. Before we deal with these issues, we should first discuss what the rules of natural justice require in a case of this nature where an “appellate” or a “supervisory” body rejects the findings of fact of a disciplinary committee appointed to inquire into the alleged misconduct of a member. 6          A duty to act in accordance with natural justice is nowadays considered as a duty to act fairly: seeHalsbury’s Laws of Singaporevol 1 (Butterworths Asia, 1999) (“Halsbury’s”) at para 10.048 andDe Smith’s Judicial Review(Sweet & Maxwell, 6th Ed, 2007) (“De Smith’s”) at para 7-003. Its content varies with the circumstances of the case. Certain factors will increase the likelihood of the principles being applied rigorously,eg, where there is an express duty to decide only after conducting a hearing or an inquiry, or where the exercise of disciplinary powers may deprive a person of his property rights or impose a penalty on him. All disciplinary bodies have a duty to act fairly as expulsion, suspension or other punishment or the casting of a stigma may be involved:Halsbury’sat para 10.049. What fairness requires and what is involved in order to achieve fairness is for the decision of the courts as a matter of law. The issue is not one for the discretion of the decision-maker: seeDe Smith’sat para 7-009, p 361. 7          A duty to act fairly involves a duty to act impartially. Procedural fairness requires that the decision-maker should not be biased or prejudiced in a way that precludes a genuine and fair consideration being given to the arguments or evidence presented by the parties:Halsbury’sat para 10.050. It is also a cardinal principle of natural justice that no man shall be condemned unheard. Compliance with theaudi alteram partemrule requires that the party liable to be directly affected by the outcome of the disciplinary proceedings should be given notice of the allegation against him and should be given a fair opportunity to be heard. Notice includes notice of any evidence put before the tribunal. It is a breach of natural justice for evidence to be received behind the back of the party concerned:Halsbury’sat para 10.060. It will generally be a denial of justice to fail to disclose to that party specific material relevant to the decision if he is thereby deprived of an opportunity to comment on such material. Similarly, if a tribunal, after the close of the hearing, comes into possession of further evidence, the party affected should be invited to comment upon it: seeHalsbury’sat para 10.061. 8          Where a tribunal makes findings of law or fact, it must do so based on evidence having probative value:Halsbury’sat para 10.063. Where reasons are given, those reasons must be both “adequate and intelligible”:De Smith’sat para 7-109. They must therefore relate rationally to the evidence in the case and must be comprehensible in themselves:ibid. InPeter ThomasMahon v Air New Zealand Ltd[1984] AC 808 at 821, Lord Diplock stated that the finding had to be based on “some material that tends logically to show the existence of facts consistent with the finding”. 9          Before domestic tribunals, the standard of proof is normally the civil standard:Halsbury’sat para 10.063. However, where a member of a club is charged with a disciplinary offence which involves criminal intent or dishonesty or fraud, there is no reason why the court should not apply the criminal standard of proof. 10        In the present case, a more rigorous application of the rules of natural justice is called for as the rules of the Club (“the Rules”) confer on the GC very general and extensive disciplinary powers over the Club’s members. The intention of the founders of the Club can be seen in r 34(a) of the Rules, which deals with the expulsion and suspension of members as well as the imposition of lesser penalties on members. It provides that no appeal shall lie from a decision of the GC to any court of law. Such restrictions that oust the jurisdiction of the courts have been declared by the courts to be null and void as they are contrary to public policy. SICC is, of course, not relying on this provision in the present case, but its presence in the Rules is a reminder of the power which a governing body of a club can have over the club’s members under the rules of the club. 11        Having restated the rules of natural justice, we will now review the facts of the case and the arguments of counsel for the parties.",
        "Facts of the case": "12        The appellant made an application to SICC on 15 July 1992 to be approved as a member after purchasing her membership from an existing member. Item 8 of the application form required an applicant to state the name of the “spouse” to be registered as a user of the club’s facilities. The appellant named NKY as her spouse. The Club did not require her to produce a marriage certificate to verify whether NKY was her spouse. She was not asked to do so, nor was it explained to her who was considered a “spouse” for the purpose of the application. In 1994, SICC amended the application form to require the production of a marriage certificate, but the appellant was not asked to produce her marriage certificate. In the present case, one of her defences to the Charge is that she believed that NKY was her spouse in 1992 as they had been living together since 1982 after undergoing a Chinese customary marriage in Johor and had an 18-year-old daughter from the marriage. As will be seen, the significance of this defence was taken into account by the SICC’s disciplinary committee (“the DC”) in its findings and recommendations, but was ignored by the GC, which focused its attention on whether the appellant had been validly married to NKY in 1982. 13        From 1992 until 2005, the appellant and NKY were able to enjoy the facilities of the Club, especially the golf facilities, as principal member and spousal member respectively. Sometime in August 2005, the situation began to change quickly and dramatically. The appellant decided to stand for election as Lady Captain of the Lady Golfers’ Sub-Committee in late September 2005 against the incumbent Lady Captain, one Mrs Glenis Lee (“GL”), who had announced her intention to seek re-election. On the evidence before the court, it would not be an overstatement for us to say that the appellant’s decision to stand for election was regarded as a hostile act by some of the Club’s members as, immediately thereafter, rumours surfaced about the appellant’s marital status. On 12 August 2005, SICC’s Memberships Administration Manager, Ms Ong Siew Beng (“OSB”), was directed by the president of the Club (“the President”) to find out whether the Club had a copy of the appellant’s marriage certificate. She immediately directed her senior assistant, Ms Jenny Lim (“Jenny”), to find out. Jenny found that the appellant’s membership file did not contain such a certificate. OSB then instructed Jenny to ask the appellant to furnish a copy of her marriage certificate as the Club was also in the course of updating the bio-data of members. Two weeks later, Jenny was reminded by OSB about the appellant’s marriage certificate. It would appear from these events that the appellant’s marital status must suddenly have been a matter of some urgency to the Club even though she had been a member for more than 13 years. On 10 September 2005, the appellant produced a marriage certificate which showed that she had married NKY on 24 August 2005 in Las Vegas, State of Nevada. As part of her defence, the appellant later explained that she had married NKY on 12 January 1982 under Chinese customary rites, and had decided to register the marriage in Las Vegas in order to furnish the marriage certificate to satisfy the Club’s membership office[note: 1]. As will be seen, the DC took this explanation into account in making its findings and recommendations to the GC, whose members, on the contrary, ignored it. 14        On 26 September 2005, the general manager of SICC (“the GM”) received an e-mail from a member, Mr John Lee (“JL”), the husband of GL, which read: I am perturbed by news on the ground that there are concerns among members revolving around the status of Ms Kay’s marital status. As this matter involves the Club’s interest and as the member in question is seeking lofty office within the Club it would be prudent for the Club to investigate this complaint on an urgent basis to satisfy itself that these are non-issues. Needless to say I am raising this as a concerned member to prevent any loss of dignity and perhaps help to put an end to the unpleasantries currently flying fast and furious. I assume that as this is a General Committee matter you will copy this transmission as appropriate and will treat this as a confidential communication. It will be noted immediately that this e-mail did not specify the nature of the complaint other than that the appellant’s marital status needed to be investigated because she was seeking “lofty office”. Further, although the complaint did not say why it was necessary or even urgent for the GC to inquire into the marital status of the appellant more than 13 years after she had joined the Club, it would have been plain to all interested members that the urgency was the impending election of the Lady Captain. 15        The appellant was not aware of JL’s complaint until the day of the election at the end of September 2005, when the GM asked the appellant to see him urgently and told her that “there was a letter of complaint against [her] written by [JL] and he was under instruction to warn [her] that if [she] persisted in running against [GL], there would be negative consequences if [she] were elected”[note: 2]. The GM’s advice or warning, as perceived by the appellant, has not been challenged by the Club. The DC, in the first report of its findings and recommendations (“the First DC Report”) which was considered by the GC on 3 April 2006, found that “Management also made it clear that as long as she is a principal member, the Club has no right to stop her from standing for elections. The decision was to be made by her.” It would therefore appear that, even before the GC had discussed JL’s complaint formally, the Club’s “management” had already concluded that it was in the appellant’s personal interest not to contest the election as winning it might bring adverse consequences. The appellant apparently ignored the warning. As it turned out, she lost the election. 16        However, that was not the end of the trouble for the appellant. On 10 October 2005, the GC met to discuss her marital status. Paragraphs 14.3.1–14.3.3 of the minutes of the meeting state as follows: 14.3.1   GC noted that Ms Kay’s marital status declaration has been questioned. 14.3.2   GC reviewed a report dated 7 October by the Membership Admin Manager confirming that Ms Kay Swee Pin joined the club on 4 September 1992. In her application form, she had filled in the name of Mr Ng Kong Yeam as her spouse to be registered in our record. On 10 September 2005, a copy of her marriage certificate was received. It was noted that prior to 1994, the Club did not require members to provide copy of marriage certificate when they registered their spouses as family members.It would appear that Ms Kay had declared Mr Ng Kong Yeam as her spouse, to make use of Club facilities, since September 1992 when the marriage certificate submitted by her on Saturday, 10 September 2005 showed that her marriage to Mr Ng Kong Yeam was registered on 24 August 2005 in Las Vegas, State of Nevada. 14.3.3   GC decided that the matter be referred to the Disciplinary Committee for further action. [emphasis added] 17        It may be noted that even at this early stage, the GC suspected that the appellant had declared NKY as her spouse to enable him to make use of the Club’s facilities purely from the inference that NKY could not have been the appellant’s husband at the time the appellant joined the Club in 1992 since they were married only in 2005. After this meeting, the GC must have received more information about the appellant’s marital status because, on 25 October 2005, it caused a search to be made at the Registry of Marriages on the marital status of the appellant. The search revealed that the appellant had been married to one Koh Ho Ping (“Koh”) on 16 June 1977. Why the GC found it necessary to conduct this search after it had referred the matter to the DC to investigate has not been clarified. OSB stated in her affidavit filed on 15 March 2007[note: 3]that it was a consequence of the Club receiving the appellant’s Las Vegas marriage certificate on 10 September 2005. This could not be the correct sequence of events as, by 25 October 2005, JL had made his complaint and the GC had met to discuss the issue. It would appear that the GC was doing its own investigation for its own purposes. These facts are important to determine the state of mind of the GC as to what the real complaint was regarding the marital status of the appellant when it decided to refer the matter to the DC for further action. It was only more than a month later that the GC framed the Charge.",
        "Proceedings before the DC": "18        On 18 November 2005, the GM sent the appellant a notification to appear before the DC on 6 December 2005 to answer a charge that she had acted in a manner prejudicial to the interests of the Club by making a false declaration in her membership application (ie, the Charge). It was a very serious charge to make against a member who had paid $190,000 to become a member. It is no wonder that the appellant felt sufficiently aggrieved to bring her case before us. The Charge was as follows: DISCIPLINARY PROCEEDING UNDER RULE 34 You, Ms Kay Swee Pin, are required to appear before a meeting of the Disciplinary Committee on Tuesday, 6 December 2005 at 6:30 pm in the Bukit Conference Room of the Singapore Island Country Club located at 240 Sime Road, Singapore 288303 to answer a charge thatyou have acted in a manner prejudicial to the interests of the Club and its members in that, you have falsely declared Mr Ng Kong Yeam (NRIC S2504572/F) as your spouse, to make use of Club facilities since September 1992, when the marriage certificate submitted by you on Sat, 10 September 2005 showed that your marriage to Mr Ng Kong Yeam was only registered on 24 August 2005 in Las Vegas, State of Nevada. You are invited to submit your views on the charge before the meeting. Please let me have your response by 24 November 2005. You have the right to be heard in your own defence at the meeting. If you fail to appear at the meeting, the Disciplinary Committee may nevertheless proceed in your absence. The Disciplinary Committee shall subsequently report to the General Committee its findings and recommendations, and the General Committee may, after considering the findings and recommendations of the Disciplinary Committee, expel or suspend you, or impose any lesser penalty. Your attention is drawn to Rule 34 of the Club’s Rules. BY ORDER OF THE GENERAL COMMITTEE [emphasis added] 19        A number of observations are apposite. First, the assertion in the Charge that the appellant had made a false declaration was based purely on her producing a marriage certificate showing that she had married NKY only in 2005 when she had declared him as her spouse to make use of the Club’s facilities since September 1992. Second, the Charge assumed that because she had named NKY as her spouse in 1992 but had registered her marriage to him only in 2005,she must have done so in order to cheat the Club.As will be seen from our analysis of the evidence later, the GC appeared to have held on to these views in spite of the explanations given by the appellant and the DC’s contrary finding that she did not attempt to cheat the Club. This is a relevant consideration as to whether the GC’s decision was irrational or whether the GC had prejudged the appellant’s guilt. 20        The DC commenced its hearing on the Charge on 11 February 2006 in the absence of the appellant as she was still not able to attend the hearing after a number of postponements. The DC heard the evidence of two witnesses,viz, OSB and JL. The evidence of OSB was formal: she informed the DC that prior to January 1994, SICC did not require members to produce their marriage certificates, and that the appellant’s marriage certificate showed that her marriage to NKY was registered on 24 August 2005. JL’s evidence was essentially what he had stated in his e-mail of 26 September 2005 (see [14] above). He also stated that he knew the appellant while she was married to Koh, whom he also knew. We might observe at this point that it would be reasonable to infer from JL’s own evidence that JL would have known about the marital status of the appellantvis-à-visKoh since the 1980s, but did not then consider the appellant’s inclusion of NKY as a spousal member as being prejudicial to the interests of the Club or its members until the appellant stood for election in 2005 against his wife, GL. 21        At this hearing, the DC, as set out in the First DC Report, also considered the appellant’s written responses of 7 January 2006 and 3 February 2006 in which she gave an account of her Chinese customary marriage to NKY in 1982 and her explanation of why she and NKY had registered their marriage in Las Vegas in 2005 (namely, to provide a marriage certificate as requested by SICC). The DC also considered the legal opinion of Haris Azmi & Associates, a Malaysian law firm, that the appellant’s customary marriage was deemed to have been registered under s 4 of the Law Reform (Marriage & Divorce) Act 1976 (Malaysia). 22        At the conclusion of the DC’s hearing, the DC established that the crux of the matter was whether the appellant had been divorced from her first husband (ie, Koh) when she joined the Club in 1992. The DC requested the Club to write to the appellant for the relevant documents by 23 February 2006. The DC adjourned the hearing to 3 March 2006 for the appellant to present her case in person. 23        On 16 February 2006, the GM wrote to the appellant for information as to when her first marriage had been dissolved and asked her to furnish the relevant documents. On 23 February 2006, the appellant replied to the GM as follows: I refer to your letter dated Feb. 16, 2006. My marriage to Mr. Koh Ho Ping was dissolved more than 20 years ago (in the early 80s), long before I became a member of SICC. As it happened so long ago, I cannot recall the exact date nor do I have any documents. You can appreciate why I would not care to keep any mementoes of such an unhappy event in my life! The issue before the D.C. is the allegation that I falsely declared Dato Ng Kong Yeam as my spouse since Sept. 1992. Even though the club has not shown me any evidence to support the allegation, I, on the other hand, have submitted enough documents to prove that the charge against me is groundless. The details of the dissolution of my first marriage is irrelevant and the club is completely out of order to even ask me for it. The total disregard for my privacy is truly prejudicial to my interest as a member of SICC. Officials of the club are obliged to protect my privacy and not invade it. In conclusion, let me repeat that on the date of my becoming a member of SICC, Dato Ng Kong Yeam had been my spouse for more than 10 years and we continue to be happily married to date. Any suggestion from anyone that they know my personal life better than myself is ludicrous. 24        The GC must have been annoyed by the refusal of the appellant to provide the information. However, sometime between the receipt of this reply and the adjourned hearing of the DC on 3 March 2006, the GC must have obtained the divorce documents from the registry of the Supreme Court as they were made available to the DC at the adjourned hearing. The documents showed that the appellant had filed her petition only on 23 December 1982 and that the decree absolute had been granted only on 2 March 1984. 25        On 3 March 2006, the appellant appeared before the DC to answer the Charge. At the start of the investigation, the DC informed her that it had reviewed her correspondence dated 7 January 2006, 8 February 2006, 23 February 2006 and 24 February 2006, and invited her to present her evidence.",
        "The defence of the appellant": "26        The defence of the appellant was that she had undergone a Chinese customary marriage with NKY in 1982, but had decided to formally register the marriage in Las Vegas in August 2005 after she was asked to produce a copy of her marriage certificate. She said that in no way did this prove that she and NKY were only married in 2005. Everyone who knew them acknowledged that they were husband and wife and, throughout their over 20 years together, no third party had challenged the validity of their marriage. The next part of the appellant’s evidence, as summarised by the DC in the First DC report, was as follows: [The appellant] told the DC that she was shocked to be served a notice from the Clubto appear before a disciplinary hearing to answer a charge of falsely declaring [NKY] as her spouse, to make use of Club facilities since Sept 1992 because of the apparent disparity in dates of her marriage. She added that she is married to [NKY] for over 20 years and their daughter is already 18 years old. Her first marriage was dissolved more than 20 years ago, long before she became a member of the Club. As it happened so long ago, she could not recall the exact date nor did she have any documents. She ran for elections in the Lady Golfers’ Sub-Committee because she felt that she was obliged to do so. … [The appellant] stated that if the Club, upon her application for membership in 1992, had insisted on the submission of a marriage certificate before her husband could be registered as a spouse member, they could have easily complied by registering their marriage during that time. Chairman explained that prior to January 1994, the Club did not require members to provide a copy of their marriage certificates when registering their spouses as family members. Chairman then explained to [the appellant] the Club’s position in requesting for details of her dissolution of marriage to [Koh]. The request was not irrelevant. [The appellant] explained that her marriage to [Koh] was dissolved more than 20 years ago. As it happened so long ago, she could not recall the exact date nor did she have any documents. She added that she would not care to keep any memento of such an unhappy event in her life. 27        In order to appreciate the tenor of the appellant’s defence, it is important to understand her interpretation of the Charge. She understood that: (a) the Charge was that of falsely declaring in 1992 that NKY was her spouse; (b) the false declaration was allegedly for the purpose of enabling NKY to use the Club’s facilities; and (c) the declaration was falsebecauseshe had produced a marriage certificate dated 24 August 2005. 28        After considering the appellant’s arguments and the evidence, the DC made the following findings and recommendations: The DC decided that one major issue was whether there was documentation to show the dissolution of [the appellant’s] first marriage to [Koh]. Based on documents from the Registry, DC ascertained that [the appellant] filed her original Divorce Petition on 23 December 1982 and this was subsequently amended on 7 September 1983. The Decree Nisi was granted on 28 November 1983 and it was made Absolute on 2 March 1984. DC also established that [the appellant] was already divorced from [Koh] when she joined the Club in Sept 1992. DC agreed that there were sufficient evidence from [the appellant’s] submissions together with statutory declarations provided by four parties that [her] marriage to [NKY] was solemnized on 12 Jan 1982 at the New Hong Kong Restaurant, Johor Bahru according to Chinese Customary rites. The statutory declarations also confirmed that since their marriage until today they have been living as husband and wife and they have a daughter who was born on 22 May 1987.DC is however unable to confirm whether Singapore law recognizes the customary marriage of [the appellant] and [NKY] on 12 Jan 1982 in Johor Bahru as her divorce was only completed in 1984. RECOMMENDATION Upon deliberation,the DC recommended that the charge against [the appellant] be withdrawnin view of her customary marriage to [NKY] on 12 January 1982 in Johor Bahru. It was also ascertained that she was divorced from [Koh] when she joined the Club in Sept 1992. [emphasis added]",
        "JL’s e-mail to the GC on 1 April 2006": "29        The DC’s findings and recommendations were leaked to JL. On 1 April 2006, two days before the GC was due to meet to discuss the First DC Report, JL sent an e-mail to the President on a private and confidential basis. The President forwarded the e-mail to all the members of the GC on 3 April 2006. A copy, however, was not forwarded to the appellant. As the appellant has argued before us that JL’s communication to the GC was an interference with its disciplinary process (and for which the GC had taken no action against JL) and that the GC acted in breach of natural justice in not giving her an opportunity to respond to JL’s e-mail of 1 April 2006, we reproduce the text of that e-mail below: Dear Sirs I refer to the above matter in which a complaint was laid against the above member for the use of the Club and its facilities by one [NKY] whom [the appellant] claimed to be her spouse and was therefore entitled to the use of the Club and its facilities as a spouse member. The facts before the Committee stands as follows:- 1.         [The appellant] … claimed that she went through a Chinese customary marriage with [NKY] … in Malaysia in or about the month of February 1982. It is known that [NKY] was already married to his first wife. Up to March 1982 the marriage laws in Malaysia permitted customary marriages and all such customary marriages can be registered under the laws as provisions have been made for their registration. If the customary marriage is not registered, it is then deemed to be registered. In the case of a person with more than one wife the first wife becomes the principal wife and the others are secondary wives. However after March 1982 no other marriages are lawfully permitted during the subsistence of the earlier marriage or marriages contracted under customary laws before the said date (unless those marriages are lawfully dissolved by a court of competent jurisdiction). 2.         [The appellant] submitted to the Club a marriage document as proof of her marital status in late 2005. The marriage was alleged to have been contracted in Las Vegas, USA. This marriage does nothing to advance her defence as it has no retrospective effect. On the contrary it raises the question whether bigamy has been committed since the customary marriage of [February] 1982 was void because [the appellant] was still legally married to her first spouse and that as of March 1982 [NKY] was deemed to have been married only to the first wife under Malaysian laws. The defence based on her customary marriage of [February] 1982 was raised late in the proceedings when matters appeared before the Disciplinary Committee. 3.         [The appellant] is a citizen of Singapore and domiciled here in Singapore. She was in fact married to [Koh] in Singapore under the Women’s Charter. This marriage was lawfully dissolved in or about the year 1983. That being the case [the appellant] was still lawfully married to [Koh] when the customary marriage with [NKY] was contracted in February 1982. Based on the provisions of the Women’s Charter and our Penal Code, it is obvious that not only is the customary marriage of February 1982 void, but there was a contravention of the Penal Code. The issues before the General Committee are simple.Was [the appellant] a married woman within the meaning of the laws of Singapore and of Malaysia when she applied to join the Club and included [NKY] as a spouse member. Our Club is bound to interpret and apply the Laws of this country to the facts. Your decision can’t be guided by emotional or cultural considerations. The provisions of our Women’s Charter (Chapter 353) read as follows:- Section 4 Every person who on 15th September 1961 is unmarried and who after that date marries under any law, religion, custom or usage shall be incapable during the continuance of that marriage of contracting a valid marriage with any other person under any law, religion, custom or usage. Section 5 Every marriage contracted in Singapore or elsewhere in contravention of section 4 shall be void. The marriage is void ab initio. In effect, it was a non-event. Therefore as far as our law is concerned [the appellant] and [NKY] were never legally married. How they themselves or others view that relationship is of no consequence. As far as the law is concerned, they were never married and as a Club here in Singapore, we are bound by the laws of Singapore. The Club can’t recognise an illegality.Therefore, we can come to no other conclusion. I am asking the General Committee in its collective wisdom to give serious consideration to the points I have raised in making a decision on the above matter. To decide otherwise would be to open a pandora’s box and to void the terms of the Women’s Charter. [emphasis added] 30        When the GC met on 3 April 2006, it made no reference to JL’s e-mail. Mr Radakrishnan (“R”), who was a GC member and also the chairman of the DC but who (for reasons which have not been disclosed) had earlier disqualified himself from the DC hearing, presented the First DC Report to the GC. As recorded at para 5.5.2 of the minutes of the meeting (“the 3 April 2006 Minutes”), he informed the GC as follows: He said that the DC was primarily concerned with the issue of whether she was divorced from [Koh]. DC felt that there was enough evidence to show that she was already divorced when she applied for membership.The DC was also satisfied that a valid customary marriage in 1982 with [NKY] had taken place. [The appellant] therefore had not falsely declared [NKY] as her husband. [R] pointed out that it is the DC’s findings that she did not falsely declare her marital status. [emphasis added] It is important to note what R told the GC. He said that the DC had found the appellant not guilty of the Charge. He also told the GC that the DC was satisfied that there had been a valid customary marriage between the appellant and NKY. The first statement was correct. The second was a serious error as it completely changed the basis of the DC’s finding that the appellant was not guilty as charged. The DC’s finding was not based on the customary marriage being valid, but on its being satisfied on the evidence that the appellant had given a credible explanation as to why she could not have made or intended to make a false declaration as to her marital status to cheat the Club (see [28] above and [35] below). As will be seen (see [74] below), this error might have caused the vice-president of the GC, Mr Samson David Chen (“VP Chen”), to reject the findings of the DC. 31        The President summarised the case and pointed out that the appellant’s first marriage had been dissolved only in 1984 whereas her customary marriage had been entered into in 1982. He said that the relevant question was whether NKY was entitled to be a spousal member of the Club[note: 4]. He was confident that, in this instance, the appellant could not be taken as having been validly married to NKY on 15 July 1992 when she applied to join the Club. Another GC member, Mr Edwin Lee, asked if the appellant knew about her “position”[note: 5](it is not clear what he meant), and VP Chen replied that a person applying for membership had the onus to declare the truth concerning his or her spouse as the latter would enjoy material benefits and privileges of the Club. He also said that it was “highly speculative now to say in 1992, that if they were asked to produce their marriage certificate, they would produce the same SD [supporting documents] as they had presented to [the GC] now”. As will be seen, VP Chen’s remark shows that he had either never understood or refused to understand the appellant’s defence in this regard, which was that if the Club had asked her for her marriage certificate in 1992, she would not have ended up being charged by the Club for making a false declaration to cheat the Club. 32        The GC concluded on the evidence that the appellant had not validly married NKY in 1982 and decided that the case should be sent back to the DC “to deliberate further on the basis that [NKY] was not the spouse at the material time of nomination to the Club”. 33        By a letter dated 7 April 2006, the chief operating officer of the SICC (“the COO”) conveyed the decision of the GC to the DC in these terms: The GC had noted from the investigations of the DC as follows: 1          [The appellant] filed her Divorce Petition on 23 December 1982. Her Decree Nisi was granted on 28 November 1983 and made Absolute on 2 March 1984. 2          According to [the appellant], she solemnized her marriage with [NKY] on 12 January 1982 in Johor Bahru according to Chinese Customary rites. 3          From the above, [the appellant] had “married” [NKY] when she was still married to [Koh]. In fact, it was even before she filed her Divorce Petition on 23 December 1982 some 11 months later. The GC has decided that in this case: 1          It is not a question of whether Chinese customary marriage in Malaysia solemnized in 1982 should be recognized as a valid marriage and whether we require a legal opinion on it. 2          The issue, if there is one, is whether she had committed bigamy. 3          GC does not intend to pursue the issue of bigamy because it is not concerned about enforcement of the law in Malaysia. 4          The GC cannot accept that the second “marriage” to [NKY] is valid in view of the existence of her first marriage at the time. 5At the time [the appellant] joined the Club on 4 September 1992, [NKY] would not have been entitled to use Club facilities as a spouse member as their marriage was not valid. Based on the above, DC is requested to deliberate and make its recommendation on the complaint to the GC based on the fact that [NKY] was not a spouse.To be fair, the DC would also have to consider relevant mitigating factors, if any, in their deliberations as well when it makes its recommendation. [emphasis added] 34        It may be noted that the reference to mitigating factors in the last sentence of this letter is not recorded in the 3 April 2006 Minutes. It would thus appear that either the GC reconsidered its decision after its meeting on 3 April 2006 or this was an authorised interpolation or interpretation of the GC’s decision on the part of the COO. The reference to “mitigating factors” has led the appellant to argue that the GC had found her guilty of the Charge without giving her an opportunity to be heard. As will be seen, the DC also understood that the GC had found her guilty of the Charge when it convened to deliberate the matter a second time. In our view, the COO’s letter left the DC in no doubt that the GC had found the appellant guilty of the Charge on the ground that, as at 1992, NKY was not her lawful husband, and therefore, when she named NKY as her spouse in her application form, she did so to cheat the Club. 35        The DC met again on 21 April 2006 to deliberate and make recommendations on the basis directed by the GC (see [33] above), and to consider relevant mitigating factors. In its report after this meeting (“the Second DC Report”), the DC identified the following as mitigating factors: (a)        Prior to January 1994, the Club did not require members to provide a copy of their marriage certificate in order to register their spouses as family members. (b)        If the Club had required such a certificate when the appellant applied to join as a member, she and NKY could have complied with such a requirement. (c)        The appellant did not hide her marital status. Everyone who knew her acknowledged NKY and her as husband and wife. In fact, the appellant and NKY had a daughter who was already 18 years old. (d)        There was no attempt to cheat or deceive the Club. (e)        NKY had used the facilities of the Club as a spousal member, not with the intention of cheating, but as a result of a technical breach of the Rules. 36        It is clear from this list of mitigating factors that what the DC did was simply to convert the explanation given by the appellant in her defence into mitigating factors. The DC recommended that the appellant compensate the Club for the green fees that the Club could have collected from her for NKY’s golf games, amounting to $12,500, from 2001 to date as the records for the period prior to 2001 were not available. The DC was of the view that this was a sufficient penalty. 37        The DC concluded the Second DC Report by noting as follows: On a separate note, the DC was disturbed that the complainant [JL] appeared to be aware of the confidential proceedings of the disciplinary hearing before the findings and recommendations in respect of the above case were placed before the [GC] on 3 April 2006. It was noted that [JL] had emailed his views on [the] DC’s deliberations on 1 April 2006 ie two days before the [GC] meeting. DC further noted that matters of the 2ndDC meeting on 21 April were already known to members on 22 April 2006 including [JL]. We should add that when we read these two statements, we were rather perturbed by the ability of JL to have access to the deliberations of the DC at both its first and its second hearings. He was apparently a person of some influence in the Club, as we were informed by counsel for the appellant that no action had been taken against him by the GC in connection with these matters. We might observe at this juncture that, according to counsel for the appellant, the GC did not take any action then and has not taken any action since to discipline the members who were involved in the breach of confidentiality or secrecy with respect to the proceedings before the DC and the First DC Report.",
        "Reaction of the GC to the Second DC Report": "38        The GC met on 8 May 2006 to consider the Second DC Report. The President presented the findings of the Second DC Report and said that there were some mitigating factors. However, he expressed his unhappiness that the confidential proceedings of the DC had leaked before the GC’s meeting on 3 April 2006[note: 6]. VP Chen spoke next, and thereafter dominated the meeting with his strong criticisms and rejection of the findings of the DC. No other member contradicted his views. He carried the meeting with him. (VP Chen’s comments are set out at [60] below in our examination of their effect on the other members of the GC in finding the appellant guilty of the Charge.) 39        After VP Chen finished his comments, the GC discussed the sentence to be imposed on the appellant and eventually decided to suspend her from the Club for one year and to require her to pay the green fees that the Club should have collected from her for NKY’s use of the Club’s facilities. 40        On 25 May 2006, the appellant wrote to the GC expressing her shock that the GC had posted notices of her suspension of membership all over the Club without extending to her the courtesy of first notifying her of the GC’s decision. She complained that the notices did not mention the fact that she had married NKY in Malaysia in 1982 and that, under Malaysian law, the marriage was valid. She added that she and NKY had been seriously maligned by the GC. 41        On 7 June 2006, the COO replied in a letter to the appellant that it was not the practice of the Club to put up a suspension notice only after the member in question had received notification from the Club about his or her suspension. The letter went on to inform the appellant that the GC had established that her customary marriage in 1982 was invalid as she had still been married to Koh at that time and that the GC could not accept, even on the basis of Malaysian law, that there could be two valid marriages existing at the same time. The reply did not say that the appellant had been found guilty of making a false declaration in order to cheat the Club. 42        The appellant was extremely aggrieved by the COO’s reply of 7 June 2006, and on 24 June 2006, she wrote to the GC protesting her innocence once more. The following excerpts from this letter highlight what she considered to be a miscarriage of justice on the part of the GC in finding her guilty of the Charge and in suspending her: 2.         Whatever the facts may suggest and however they appear to you, it is my contention and honest belief that when I married [NKY] on Jan. 12 1982, my previous marriage was already over and as of Jan. 12, 1982, [NKY] was my only husband. I lived with him as husband and wife in spirit and in substance for 10 years before we decided to purchase a membership in SICC in Sept. 1992. I was wrongly convicted by the G.C. based on the following reasons: 1.         I cannot be guilty of making a false declaration when I did not know at the time I made the declaration that it was false. As I have explained repeatedly, the declaration that [NKY] was my spouse was made IN GOOD FAITH as I had gone through a customary marriage with him in Jan. 1982. The first time anyone had ever suggested that my marriage to [NKY] was invalid was in July 2005 when [GL] started the rumour, followed by [JL’s] letter to the G.C. 2 days before the Lady Golfers’ Sub-Committee’s General Elections, complaining about my marital status. If I really knew my customary marriage was invalid, there would be no reason for my husband and I to go through it. If [NKY] was not my spouse, why would it declare him as such? After all, the privilege granted to a spouse member is only to play golf for free. My husband is not a keen golfer and did not even make use of any other facilities in the club. We are financially strong and it is absurd that we would lie just to save monies that we can well afford. Moreover, throughout our 13 years of our association with the club, the amount of monies we have donated and contributed to the various events organized by the club, way exceeded what my husband had incurred in green fees. There is no reason at all for me to make the false declaration. 2.         In 1992, I offered to be a member of SICC and my husband paid $190,000.00. The club accepted payment of transfer fee and did the normal due diligence. My offer was accepted after the G.C. gave its approval. The acceptance included my husband [NKY] as an Associate (spouse) Member and my 2 daughters [ie, the appellant’s daughter from her previous marriage to Koh and her daughter from her marriage to NKY] as Junior Members. At the time of application, all the information submitted by me was true to the best of my knowledge. My offer to be a member of SICC would not have been made if my husband and children were not part of the package. G.C. members, in their misinformed conviction of me, would like everyone to believe that I induced SICC to enter into this contract through misrepresentation. In order to punish me so cruelly and severely, SICC must prove beyond any doubt that I had in fact committed fraud. While I have provided the G.C. with irrefutable evidence that my lifestyle from Jan. 12 1982 onwards is consistent with my assertion that [NKY] and I are husband and wife, the G.C. has yet to show proof that I dishonestly induced SICC into accepting my offer of membership with Mr. Ng as my spouse. I was honest in all the information I submitted in the normal course of application for membership. There was no misrepresentation. Even if there is any hint of misrepresentation on my part (which definitely there is not), the fact that I signed the contract with SICC in 1992 has rendered SICC incapable of pursuing any issue arising from the contract. It is time barred by Section 6 of the Limitation Act as SICC only raised the issue in Dec.2005. Since the basis of my conviction is solely due to a legal technicality and the G.C. chose to be singleminded about applying the law, the G.C. must now also be consistent and apply the law all the way. There was no evidence that the Club or the GC replied to this letter. 43        On 18 September 2006, the appellant wrote again to the Club to request that the Club’s annual general meeting (“AGM”) pass a resolution to revoke the suspension of her membership at its 43rd AGM. She pointed out that the GC had completely ignored the findings of the DC and that the GC had no right to do so. She also complained about JL’s e-mail of 1 April 2006 which had been circulated to the GC before it met –viz, that the GC had given maximum consideration to that communication instead of disallowing it. The Club replied on 20 September 2006 that the GC would not be acting on the appellant’s letter of 18 September 2006. The appellant replied on 28 September 2006 stating that the Rules allowed the AGM to discuss or review any matter in respect of which seven clear days’ notice was given and demanded the right to raise the issue of her suspension at the 43rd AGM. On 29 September 2006, the Club replied that the appellant’s attempt to argue her disciplinary case at the AGM was out of order. The appellant was also told that she would not be allowed onto the Club’s premises whilst under suspension and that, therefore, she would not be allowed to participate in the 43rd AGM.",
        "Proceedings in the High Court": "44        In these circumstances, the appellant’s application to the High Court for judicial review of the GC’s decision was to be expected. She appeared in person at the hearing. SICC was represented by counsel at that hearing. The Judge considered all the legal arguments of the appellant in the light of the factual material, particularly the First DC Report, the Second DC Report, the 3 April 2006 Minutes and the minutes of the GC meeting on 8 May 2006 (“the 8 May 2006 Minutes”). He held that SICC was a social club, and applied the established administrative law principle that the court would not interfere with the disciplinary decisions of a social club so long as the club’s disciplinary tribunal complied with the rules of natural justice. He also held that, on established principle, the court could not scrutinise the factual findings of the DC or the meaning of “spouse” given by the GC. Nevertheless, he did consider the meaning of “spouse” and held that the GC was correct in law in finding that the appellant’s Chinese customary marriage to NKY in Johor Baru in 1982 was not valid in Singapore because her former marriage to Koh, registered under the Women’s Charter (Cap 353), had not been dissolved at that time. Accordingly, the Judge held that NKY could not have properly been declared as the appellant’s spouse in the application form which the appellant submitted in 1992. He accordingly dismissed the appellant’s application. The Judge also made several rulings on the legal issues brought up by the appellant, which are examined below.",
        "The issues on appeal": "45        In this appeal, the appellant raised two broad issues which her counsel referred to as “the directed issue” and “the breach of natural justice issue” (see [5] above). The directed issue concerned the direction given by the GC to the DC to deliberate on the basis that the appellant’s Chinese customary marriage to NKY in 1982 could not have been a valid marriage. The breach of natural justice issue concerned the series of events which were said to be in breach of natural justice, namely: (a) the finding of guilt by the GC at its meeting on 3 April 2006 without giving the appellant a hearing or other opportunity to respond to JL’s e-mail of 1 April 2006; (b) the failure of the DC to hear the appellant at its second hearing (ie, the hearing on 21 April 2006); (c) the interference with due process by JL in sending his e-mail of 1 April 2006 to the President after the DC had recommended that the Charge be withdrawn; (d) the participation of R in the deliberations of the GC even though he had disqualified himself as a member of the DC; and (e) the reversal by the GC of the DC’s finding that the appellant had not attempted to cheat or deceive the Club. The appellant also raised a third issue,ie, that the Charge was inherently defective.",
        "The directed issue": "46        To appreciate the argument of the appellant on the directed issue, it is necessary to consider the scope of the disciplinary powers of the GC and the DC. They are set out in r 34(a) of the Rules under the heading “Expulsion, Suspension and Cessation of Membership”, as follows: If any member shall, in the opinion of the General Committee, act in any way prejudicial to the interests of the Club or its members thereof or shall break any Rule or Bye-Law of the Club, the General Committee shall consider the conduct of such member at a meeting of the General Committee. If at such a meeting it is considered that there is sufficient evidence to justify calling on the member to answer any charge against him, a notice in writing shall be given to such member calling on him to attend a meeting before the Disciplinary Committee for the purpose of answering such charges. … At such Disciplinary Committee meeting [in answer to the notice calling upon him to do so], the member concerned shall be informed of the charges made against him and shall have the right to be heard in his own defence. … The Disciplinary Committee, at the conclusion of such hearing shall report to the General Committee its findings and recommendations. The General Committee may, after considering the findings and recommendations of the Disciplinary Committee, expel or suspend the member or impose any other lesser penalty. Notice thereof shall thereafter be sent to such member. No appeal shall lie from the decision of the General Committee to any other meeting or to any Court of Law. 47        The appellant’s first argument is based on a literal interpretation of r 34(a). It is that where the DC has found a member not guilty of any disciplinary charge, the GC must accept its finding as, in that event, the GC’s power is limited to expelling or suspending the member or imposing any lesser penalty on receiving the report of the DC. Accordingly, the GC had actedultra viresin remitting the matter to the DC after the meeting on 3 April 2006 and directing it “to deliberate and make its recommendation on the complaint to the GC based on the fact that [NKY] was not a spouse” (see the COO’s letter to the DC dated 7 April 2006 at [33] above). 48        This argument, which was also made in the court below, was rejected by the Judge. In his view, r 34(a) did not have such a limited meaning. He held that the GC was the final decision-maker under r 34(a) and was thus entitled to send the case back to the DC for deliberation on the basis that the Chinese customary marriage between the appellant and NKY in 1982 could not have been a valid marriage. He held that, on the evidence, the GC was not directing the DC on what factual findings to make, but was merely addressing the legal poser. 49        We agree with the Judge that, applying a purposive interpretation, r 34(a) applies whether or not a member is found guilty of a disciplinary charge by a disciplinary committee. The GC is the final decision-maker on disciplinary matters and is not bound by the findings and recommendations of a disciplinary committee. Accordingly, it has the power to remit a case back to the disciplinary committee in question for certain purposes,eg, to clarify certain findings of fact and to reconsider its recommendations on the basis of such clarifications. 50        However, in our view, the GC may only reject the findings of fact and the recommendations of a disciplinary committee where it has sufficient reasons to do so. The GC may not reject the disciplinary committee’s findings and recommendations simply because it does not agree with them; otherwise, there would be no point in appointing a disciplinary committee and delegating to it the task of finding the facts and making its recommendations. In the present case, the more important question, which was not addressed before us, is whether the GC, after referring JL’s complaint to the DC, should have gone around looking for evidence in connection with the investigation into that complaint, as the GC appeared to have done in this case, instead of leaving it to the DC to do the investigation. In our view, this is not a desirable practice as it could lead to perceptions of prejudgment or the likelihood of apparent bias. The decision-maker under r 34(a) should not also be the investigator. If the GC were to institute its own investigations into a complaint, it might not be seen as an impartial body in deciding whether or not the member charged was guilty of the charge. In any case, the GC would have to bring to the attention of the member any evidence it had obtained on its own initiative so that the member could respond to it, if necessary. 51        In relation to the GC’s powers of punishment under r 34(a), the Judge said at [40] of his grounds of decision: The GC could have decided on a different penalty, whether more severe or more lenient than that recommended by the DC. It could even determine that no sanction was necessary in the circumstances. Even if the court feels that the penalty imposed was too harsh, it must be remembered that social clubs are not subordinate courts, which are subject to the revisionary powers of the High Court. With respect, this statement of the powers of the DC, or of any other social club for that matter, is much too wide if it is read outside the context of this case. We do not think that the Judge meant to imply that the GC’s power of expulsion, suspension or imposing any lesser penalty on an errant member is unrestricted by any principles of proportionality or reasonableness, and that the courts cannot interfere. We cannot accept such a proposition in the case of a club like SICC. In the present case, the GC could have expelled the appellant or could have suspended her for some years (assuming she was guilty of the Charge). If it had done so, we would have to consider whether the punishment fit the crime, so to speak. Even courts of law have to abide by principles of proportionality and reasonableness in imposing punishment on offenders. However, as this issue does not arise in this case, we will say no more on it, except that the more severe the punishment, the graver must be the disciplinary offence for which the member is being punished.",
        "Did the appellant make a false declaration in 1992 to cheat the Club?": "52        The next issue is whether the GC was wrong in law in rejecting the DC’s finding that the appellant had not falsely declared in July 1992 that NKY was her spouse. In this respect, the argument of counsel for the appellant focused on the appellant having been denied the right to be heard rather than on whether the GC was in error in finding the appellant guilty of the Charge on the basis of the evidence before the DC. It should be recalled that the appellant had already been heard by the DC on 3 March 2006, after which the DC had found her not guilty and had recommended that the Charge be withdrawn. The GC was entitled to scrutinise the findings of the DC and come to a different conclusion if it had good reasons to disagree with such findings. The crucial issue in this case is whether the GC’s decision to depart from the DC’s findings could be substantiated by an examination of the evidence before the DC. It should be remembered that the DC was the fact finder and the GC, merely the “appellate” fact finder. The DC heard the evidence of the appellant and believed that she was telling the truth in asserting that she had not falsely declared NKY as her spouse so that he could use the Club’s facilities. The GC did not hear the appellant and therefore it was not in as good a position as the DC to decide on issues of credibility based on oral evidence. So, we must examine the record of the proceedings to see whether the GC was justified in not accepting the findings of the DC. Before we do so, we must add that counsel for SICC did submit to us that the finding of the GC that the appellant was guilty of the Charge was based on the appellant’s own statements. As we shall see, the GC completely misunderstood the statements made by the appellant in her defence for reasons which we will explain.",
        "What was the essence of the Charge?": "53        The Charge was that in 1992, the appellant had falsely declared NKY as her spouse so as to enable him to make use of the Club’s facilities. In the context of the Charge, the word “falsely” implied that the appellant had made an untrue statement in order to cheat or deceive the Club into allowing NKY to use the facilities of the Club. It implied that when she filled in the name of NKY as her spouse on her application form in 1992, she knew that it was a false statement and that she made it deliberately so that NKY could use the facilities of the Club. Counsel for the appellant submitted that this was a very serious charge to make against a member and was tantamount to charging the appellant for a criminal offence. He pointed out that if such a charge were made in a criminal proceeding, it would have to be proved beyond a reasonable doubt and that, in disciplinary proceedings, the standard of proof for such a charge should be the same. We agree. But let us now examine the evidence that the Club managed to adduce to call on the appellant to answer a charge of such gravity. 54        It is clear that the GC had formed the opinion that the appellant had made a false statement that NKY was her spouse in 1992 when she produced, at its request in 2005, a Las Vegas marriage certificate of her marriage to NKY in August 2005. It would naturally have occurred to the GC to ask how NKY could have been the appellant’s spouse in 1992 when the marriage certificate showed that they were married only in 2005. The GC should then have asked the appellant to explain but, in its haste to condemn her, it concluded that she must have declared NKY as her spouse so that the latter could be a spousal member. It never occurred to the GC that the appellant might have made a mistake in making the declaration or might have genuinely believed that NKY was her spouse in 1992. Instead, the GC rushed to judgment that she must have deliberately declared NKY to be her spouse with a view to deceiving the Club, and directed that she be investigated by the DC without even bothering to ask her for an explanation, something one would expect a responsible general committee of a club to do before charging a member of the club for such a serious offence as that of cheating the club. 55        When the GC decided on 10 October 2005 to refer the matter to the DC, it did not use the word “falsely” to describe what the appellant was alleged to have done (see [16] above). It was only when the GM wrote to the appellant on 18 November 2005 requiring her to appear before the DC to answer the Charge that the word “falsely” appeared for the first time (see [18] above). The GC could have sought an explanation from the appellant between 10 October 2005 and 18 November 2005 instead of making its own inquiries about the marital history of the appellant. However, the documentary evidence shows that the GC was at no time interested in seeking an explanation from the appellant. On 7 January 2006, the appellant wrote to the Club (via one Michelle Choy), after she learnt for the first time of the disciplinary proceedings against her, to explain why and how she and NKY had married in Las Vegas in order to produce the marriage certificate which the Club wanted from her. In that letter, she also explained that she had married NKY in 1982 under customary rites and that they had been living as husband and wife for more than 20 years without anyone challenging the validity of their marriage. She also asserted that the Charge was an insult to her and NKY’s “position” in society and that she and NKY did not need the Club to raise their self-esteem, nor did they need to cheat the Club of a few dollars. There is no evidence that the Club, after receiving that letter, took any notice of it. As will be seen, the DC took this letter into consideration in its deliberations, but there is no record that the GC looked at it in its deliberations. 56        Again, on 8 February 2006, when the appellant wrote to the President in connection with the postponement of the DC hearing, she explained to the President why she felt she had been wrongly accused of cheating the Club in 1992. In this letter, she gave an explanation whose significance did not escape the attention of the DC, although it was completely ignored or misunderstood by the GC. We quote the relevant portions of this letter below: After 13 years of being [a member] of SICC, I was suddenly asked to produce a copy of my marriage certificate as [JL] (writing under the guise of a “concerned” member) had written to the Club questioning my marital status. I admitted to the GMS that I did not possess one as I was married 23 years ago under traditional customs and laws. My husband and I decided that since the Club has asked for a hard copy of a marriage certificate, we went ahead to register our marriage and subsequently, handed it to the Club. In no way did that exercise prove that we only married in 2005.If the Club, upon my application for membership in 1992, had insisted on the submission of a marriage certificate before my husband can be registered as a spouse member, we could have easily complied by registering our marriage during that time. Upon presentation of our daughter’s Birth Certificate, the Club was satisfied that my husband was entitled to be a spouse member. [emphasis added] The President showed no apparent interest in her explanation as, on 10 February 2006, he replied to her that, as regards her comments on the allegations against her, he would leave the matter entirely to the DC, and that the GC would consider the findings and the recommendations of the DC in due course. As it turned out, the evidence shows that, subsequently, the President did not leave the matter entirely to the DC as he presided over both meetings of the GC that rejected the DC’s finding that the appellant was not guilty of the Charge. This was one of the acts which the appellant argued in this appeal was a breach of natural justice, an argument which we have rejected (see [67] below). 57        In our view, it was rather unfortunate that the President did not pay sufficient attention to the appellant’s explanation. Here was the appellant trying to explain in 2006, based on her recollection of a customary marriage she had undergone with NKY in 1982, the information she had given the Club about her marital status in 1992 for the purpose of joining the Club. The appellant’s explanation was given in response to a disciplinary charge made by the GC against her (without first seeking some kind of explanation from her) that she had cheated the Club in 1992 and had continued to do so since. Leaving aside the other explanations of innocence which the appellant had given to the Club, here was a very simple and credible explanation as to why she would not have wanted to cheat and deceive the Club “to save a few dollars” when she had agreed to pay $190,000 to buy her membership – namely, on the evidence before us, the proposition cannot be denied that had the Club asked for evidence of the appellant’s marital status as a condition of approving her membership application in 1992, the appellant and NKY could have undergone another marriage ceremony at that time to procure the requisite marriage certificate as both were free to do so by then. 58        The DC accepted this explanation as one of its considerations in finding the appellant not guilty and recommending that the Charge be withdrawn. The GC was, however, fixated with the invalidity of the appellant’s customary marriage to NKY and, rejecting the DC’s findings and recommendations, directed the DC to deliberate further on the Charge on the basis that the appellant’s 1982 customary marriage to NKY was not a valid marriage and to consider any relevant mitigating factors in making its further recommendations. The direction amounted to a finding that the appellant was guilty of the Charge. To its credit, the DC made its recommendations as directed by the GC, but it reiterated its view that the appellant had not attempted to cheat or deceive the Club (and was therefore not guilty as charged). When the GC received the Second DC Report, the members of the GC once more closed their ears and eyes to the DC’s reiteration.",
        "The GC missed the wood for the trees": "59        In our view, the evidence shows that the GC’s decision in twice ignoring the DC’s finding of “not guilty” was influenced by a host of factors. The first, as we have earlier mentioned, was that the GC was fixated by the legality of the appellant’s customary marriage to NKY in 1982. Once the GC came to the conclusion that that was not a valid marriage, it also concluded that the appellant must have intended to cheat the Club by describing NKY as her spouse in the application form which she submitted in 1992. The 3 April 2006 Minutes do not show that there was any consideration given as to whether the appellant had falsely declared NKY as her spouse to use the Club’s facilities, which was what the Charge alleged. In the context of the Charge, the word “falsely” connoted a deliberate lie or deception in order to cheat the Club. However, the 3 April 2006 Minutes[note: 7]show that the President was more interested in whether the appellant had committed bigamy in Singapore at the time she married NKY. To him, the relevant question was “whether NKY was entitled to be a [spousal] member in the Club”[note: 8]and not “whether the appellant had falsely declared NKY as her spouse”, which is a very different question. The other GC members agreed with the President’s identification of the issue and also his view that the appellant could not have been married to NKY in 1982. The GC then decided to send the case back to the DC for reconsideration on that basis[note: 9].",
        "VP Chen’s comments": "60        The second factor was VP Chen’s forceful criticisms of the Second DC Report which were not contradicted by the other members of the GC. VP Chen had also formed a very negative view of the appellant’s alleged uncooperative attitude towards the Club, which, in our view, was not justified by the evidence. His comments on the Second DC Report, which are set out below, reveal his less than impartial state of mind on that report: 2.1.2     VP asked that committee to focus on the objective of the complaint and that is to decide whether [NKY] was correctly declared as the spouse. He said thatthe decision at the last GC meeting was really about the validity of their customary marriage, and today’s GC meeting is to consider the recommendation of the DC whether the sentencing imposed was fair and whether it can be said that DC have taken into account all the factors; … 2.1.4     VP noted in the second paragraph of the mitigating factors that there was no doubt [the appellant] submitted her marriage certificate upon request by the club. On the point where,“[Appellant] said that had the Club asked for a marriage certificate before, [NKY] can be registered as a spouse” VP said that there was no substantial evidence to show that this was the case; … 2.1.6     In Paragraph 4,“DC was unanimous in the view that there was no attempt to cheat or deceive the Club.”. VP was puzzled as to how DC committee could have drawn the conclusion. Unfortunately, he said that this was just a summary of the recommendations. 2.1.7     “but as a result of a technical breach,” VP asked if it is a layman or lawyer talking. He said that this does not really answer the question as to whether [the appellant] was married or not. 2.1.8     VP said that the aggravating factors in this case included [the appellant] on several occasions being very unco-operative and these factors should be taken into consideration. He said that this was an important matter. Members should correctly disclose their marital status … 2.1.11   … VP said that she did not make the effort to disclose to us that she was still legally married at the time of her customary marriage…[and]…it was only through the Management’s effort that led to [the appellant] registering her marriage at the time. In the beginning, she stood very firm on customary marriage and there were no remorse or no gesture of regret. GC found out that they were not legally married prior to her Las Vegas marriage and she was not honest, not cooperative. VP quoted from the sentence, which states that [the appellant] was unable to remember whether she was still legally married to her first husband at the time of entering into the customary marriage with [NKY]. 61        When we read these comments in the light of all the evidence, we formed the following views: (a)        VP Chen was unfair to the appellant in stating that she had been uncooperative with the Club. The fact was that the GC, without seeking any explanation from the appellant, had charged her with making a false declaration simply because she had given the Club a 2005 Las Vegas marriage certificate which might or might not be evidence that she was not married to NKY in 1992. At that point in time, the issue of whether the appellant’s customary marriage to NKY was invalid or otherwise had not arisen; similarly, the issue of her marriage to Koh did not arise until after the DC had concluded the first part of its hearing (ie, the hearing on 11 February 2006) in the absence of the appellant. (b)        VP Chen was more concerned with whether the appellant had declared her marital status correctly and with whether her customary marriage to NKY was valid or not, rather than with whether she had falsely declared NKY to be her spouse. (c)        VP Chen failed completely to understand why the DC accepted the appellant’s explanation that she would not have paid $190,000 to become a member of the Club in order to cheat it and that, if the Club had asked for her marriage certificate at the time she applied for membership in 1992, she would have procured a certificate earlier. VP Chen’s comment that there wasno substantial evidence to show that that was the caseonly goes to show his total lack of comprehension of the DC’s finding of fact on this point – of course, there was no evidence as the appellant was never asked to produce a marriage certificate in 1992. (d)        VP Chen failed to understand the difference between making an incorrect declaration and making a false declaration. 62        In our view, these comments show that VP Chen had closed his mind to the findings of the First DC Report and the Second DC Report. He appeared to have concluded that the appellant was guilty as charged on the basis that since she had made an incorrect declaration, as a result of which NKY was able to make use of the Club’s facilities, it must therefore follow that she had made the incorrect declaration falsely. It did not seem to have crossed his mind that a person could have forgotten about or could have made a mistake in her recollection of events that had happened more than 20 years ago. His mind was clouded by his judgment that the appellant had been “uncooperative and dishonest” (his own words). As we have mentioned earlier, VP Chen either did not or refused to understand the DC’s acceptance of the appellant’s explanation that there was no reason for her to pay $190,000 to become a member of the Club in order to cheat the Club. In this connection, it may be noted that the Club did ask the appellant for the birth certificate of her daughter from her marriage to NKY, which she produced, and the Club had, upon presentation of that certificate, accepted NKY as a spousal member (see [56] above). 63        The only member of the GC at the meeting who kept his eyes on the Charge was the bowling convenor. According to the 8 May 2006 Minutes[note: 10]: Bowling Convenor said that this was a simple case to handle. The first question was whether [the appellant] has falsified the records. If she had then she is in the wrong. In this case, he felt that the sentence should be more than a year. Indeed, this was a simple case. Did the appellant falsely declare her marital status? It is reasonable to infer from his comments that the bowling convenor thought she did. But, he gave no reason why he thought so, notwithstanding the DC’s firm views, after hearing her explanation, that she did not. 64        For the reasons given above, we came to the conclusion that the GC erred in law in focusing its discussion, at both the meeting on 3 April 2006 and the meeting on 8 May 2006, on whether the appellant’s customary marriage with NKY in 1982 was valid or not, and in failing to ask itself whether the Charge was made out. We were also of the view that the GC’s finding that the appellant was guilty as charged was irrational or unreasonable. Its reasoning was illogical and was based on a failure to address the Charge. The GC inferred the appellant’s intention from the consequences of her act,ie, it inferred that because NKY had enjoyed the use of the Club’s facilities as a spousal member, the appellant must have declared him as her spouse with that intention. This was irrational. In our view, the GC had wrongly concluded that the DC had addressed the wrong question when the GC itself wrongly concluded that the GC was addressing the correct question.",
        "Structure of rule 34(a) of the Rules": "65        Before we consider the second broad ground of appeal founded on the breach of natural justice issue, we would like to make a few observations on the structure of r 34(a) of the Rules. The disciplinary process under r 34(a) requires the following steps to be followed: (a)        The GC has to form an opinion that a member has acted in a way prejudicial to the interests of the Club before it can meet to consider the matter. (b)        The GC next has to consider the conduct of that member at a meeting. (c)        If the GC then considers that there is sufficient evidence to charge the member for a disciplinary offence, it may call on him or her to appear before a disciplinary committee. Rule 34(a) literally requires the GC to consider the conduct of a member twice before a disciplinary committee can be convened. This may create a situation (but we arenotsaying that it did in the present case since the point was not raised) where the GC, having taken a preliminary view that a club member has acted in a manner prejudicial to the interests of the Club, which the GC then confirms at a meeting, may find itself reluctant to agree to a subsequent disciplinary committee finding that there is no case against that member. In other words, in-built into the disciplinary process in r 34(a) is the likelihood of a residual element of prejudgment of the case against the member. Prejudgment is a form of apparent bias, and apparent bias is a breach of natural justice. 66        The other issue to be noted is that before the GC can form an opinion that a member has committed a disciplinary offence, it must have some kind of evidence before it or some other basis for that opinion. In the present case, the only evidence at the material time was “news on the ground” about the appellant’s marital status as mentioned in JL’s complaint of 26 September 2005 (see [14] above). But, there was nothing in that complaint to tell the GC what the nature of the complaint was other than that the GC should investigate the marital status of the appellant because she was seeking “lofty office”. How did the GC initially, and later at the 10 October 2005 meeting, come to the view that the appellant had falsely named NKY as her spouse in order to cheat the Club? The only evidence we have seen was that the appellant had, at the request of the Club, submitted a Las Vegas marriage certificate certifying a marriage between her and NKY in August 2005. How would this fact lead to even a preliminary view that the appellant had falsely named NKY as her spouse in 1992 to cheat the Club? We would have thought, in such circumstances, that any general committee of a club with a sense of fairness would have taken the trouble to ask the appellant for an explanation before charging her with the equivalent of a criminal offence. Instead, as the evidence showed, the appellant was advised (or warned, as understood by her) by the GM (presumably on instructions from the GC) on the day of the election (at the end of September 2005) not to contest the election as adverse consequences could result if she were elected (see [15] above). Strong forces must have been at work at management level even though the DC subsequently stated that it was not the intention of the Club to dissuade the appellant from standing for election. Thus, even before the GC met on 10 October 2005, the GC had more or less reached a view that the appellant had committed a disciplinary offence that made her unfit to be elected as Lady Captain. In our view, it is difficult for us not to view this episode as some evidence of prejudgment on the part of the GC that the appellant was guilty of a disciplinary offence that made her unfit to hold “lofty office” in the Club.",
        "Breaches of rules of natural justice or the GC’s failure to act fairly": "67        As we have mentioned earlier at [45], the appellant relied on the following events as breaches of natural justice or a failure to act fairly on the part of the GC: (a)        the finding of guilt by the GC at the 3 April 2006 meeting without giving the appellant a hearing; (b)        the failure of the DC to hear the appellant at its second hearing on 21 April 2006; (c)        the interference with due process by JL in sending his e-mail of 1 April 2006 to the President after the DC had recommended that the Charge be withdrawn; (d)        the failure of the GC to forward a copy of JL’s e-mail of 1 April 2006 to the appellant for her response, if any; and (e)        the participation of R, the chairman of the DC, in the deliberations of the GC at its meetings on 3 April 2006 and 8 May 2006 when he had disqualified himself from hearing the Charge. Counsel also argued that, in the circumstances of the case as a whole, the GC did not act fairly and honestly in reversing the repeated findings of fact by the DC that the appellant had not attempted to cheat or deceive the Club. There was one other complaint (which, in our view, had no merit whatsoever) and that was that the President had communicated with the appellant and had assured her that he would leave everything to the DC, but he in fact did the opposite. 68        Counsel for SICC submitted that we should not consider points (c), (d) and (e) in the preceding paragraph as they were not raised before the Judge, and that, in any case, the appellant had withdrawn her previous allegations of collusion and bias against the GC. As for points (a) and (b), counsel submitted that the appellant had no right to be heard at the GC as she had already been heard by the DC and, therefore, she had not been deprived of her right to be heard. 69        In our view, the appellant was entitled to raise points (c), (d) and (e) because she was not adducing new evidence, but merely relying on the evidence in the record. Furthermore, the arguments raised by her were concerned with the issue of apparent bias on the part of the GC, and not the allegations of actual bias or collusion that she had abandoned.",
        "JL’s e-mail of 1 April 2006 and the appellant’s right to be heard at the GC meeting": "70        On point (a), we have already decided that the GC was not bound by the findings of the DC, but that if it reversed the DC’s findings of fact, it must have justifiable grounds to do so, such as by showing that the evidence did not support the findings or that the DC drew the wrong inferences from the primary facts. We have earlier referred (at [8] above) to the principle that the reasons provided by a tribunal in the exercise of its discretionary powers must be both adequate and intelligible, and that they must relate rationally to the evidence in the case and must be comprehensible in themselves. Further, the finding must be based on some material that tends logically to show the existence of facts consistent with the finding. In our view, the GC’s finding of guilt against the appellant failed every one of these tests. The GC simply ignored or gave insufficient consideration to the basis of the DC’s findings because it considered the validity of the appellant’s customary marriage to NKY, and not whether she had made a false declaration about her marital status in order to cheat the Club, as the crux of the Charge. 71        However, our views in relation to the appellant’s right to be heard at the first GC meeting (ie, the meeting on 3 April 2006) are as follows. If the GC wished to be the primary fact finder (and not merely to review the findings of the DC), then it should have given a copy of JL’s e-mail of 1 April 2006 (see [29] above) to the appellant so that she could respond to the allegation that her customary marriage was null and void or explain why it did not matter if that were indeed the case. This was particularly crucial in the present case for two reasons. First, the DC had heard the appellant’s explanation as to why she had declared NKY as her spouse in 1992 and had found this explanation credible, and had concluded that she did not make a false declaration. It should be remembered that the appellant was giving, in 2006, an explanation of an event that happened in 1992 concerning another event occurring more than ten years before 1992. It was possible that she could have lied (in our view, however, it was improbable for the appellant to have paid $190,000 to join the Club but then lie about her marital status when she could have furnished proof of the validity of her marriage to NKY had she been asked to do so at the time she applied to join the Club), but she could equally well have simply forgotten about those events. The GC was in no position to come to any view on the evidence before it. The GC should have asked itself why the DC found the appellant’s explanation credible, but it did not seem to be interested in that explanation. 72        Secondly, JL, via his private and confidential e-mail to the President two days before the GC met on 3 April 2006, had planted in the minds of the GC members the impression that the only defence raised by the appellant before the DC was that of her customary marriage, which, so JL alleged, was brought up late in the DC proceedings. He also made a legal submission that that marriage was void under the Women’s Charter, that the Club could not sanction an illegality and that “[t]herefore, we can come to no other conclusion”. In other words, JL was telling the GC that the appellant had no defence to the Charge based on the customary marriage. Whether or not there was a coincidence, or whether JL’s views had influenced the GC to focus only on this issue, this was precisely the issue addressed by the GC on 3 April 2006. It is difficult to believe that JL’s e-mail did not have at least some effect on the deliberations or the minds of the GC members. The President said that the question was whether the appellant had committed bigamy (this was later rephrased to “This issue, if there was one, is whether she had committed bigamy”), and the relevant question was whether NKY was entitled to be a spousal member of the Club. The members of the GC agreed, and the DC was directed to deliberate and recommend on this basis. 73        We should also point out that JL had misled the GC on the appellant’s defence before the DC. The legality or validity of the appellant’s customary marriage was not the crucial issue before the DC. To the DC, the important question was what the appellant’s intention in 1992 was when she stated that NKY was her spouse. Was there any reason for her to do so in order to cheat the Club? The DC had copies of the appellant’s divorce papers before it. In 1992, both the appellant’s customary marriage to NKY and her divorce from Koh were history. Was she expected to remember all these things in 2006 or 1992? The appellant testified that she did not remember, but that, having lived with NKY as husband and wife for more than 20 years, she believed in 1992 that NKY was her spouse. She had never intended to make a false declaration to cheat the Club as there was no reason for her to pay $190,000 for a club membership in order to cheat the Club. The DC accepted this explanation after hearing her. To us, this was a credible defence. This was the defence which the GC ignored, or largely ignored, twice, in spite of R having told the GC that the DC had found that the appellant did not falsely declare her marital status. 74        There was, in our view, another factor which might have led the GC into error in reversing the DC’s finding that the appellant had not made a false declaration. We have earlier mentioned that R, in presenting the First DC Report, had erroneously informed the GC that the DC was satisfied that the appellant’s customary marriage to NKY was valid when that was not the DC’s position at all (see [30] above). On this erroneous basis, it was not unexpected that, faced with JL’s submissions and the President’s opinion on the legality of the appellant’s customary marriage, the other members of the GC agreed that the DC’s finding that the appellant was not guilty was based on the wrong premise,ie, the premise that the customary marriage was valid. This is also reflected at the second GC meeting (ie, the meeting of 8 May 2006) when VP Chen stated that he was puzzled as to how the DC could have drawn that conclusion,viz, how the DC could have concluded that the appellant did not attempt to cheat or deceive the Club when the customary wedding was invalid under the law. 75        In our view, the GC should have either given the appellant an opportunity to explain that JL’s version of the DC hearing was incomplete, or directed the DC to reconsider its finding (ie, that she was not guilty as charged) on the basis that the customary marriage was null and void. The GC did neither. This was a breach of the GC’s duty to give a fair hearing to the appellant.",
        "Right to be heard at the DC’s meeting on 21 April 2006": "76        In our view, the appellant’s argument, that the DC failed to hear her at its second hearing on 21 April 2006, was irrelevant in the circumstances of this case. The DC had already heard the appellant on 3 March 2006 and had accepted her defence. It had also confirmed its finding in the Second DC Report. Moreover, the DC took into account the appellant’s defence as a mitigating factor even though it was rejected by the GC.",
        "Participation of R at both GC meetings": "77        In our view, there could be no objection to R presenting the First DC Report to the GC as an administrative act, even though he had disqualified himself from hearing the complaint against the appellant at the proceedings before the DC on 3 March 2006. However, he went further and participated in the discussions. In our view, this amounted to a procedural impropriety. Furthermore, in doing so, R also misrepresented the findings of the DC, as can be seen from para 5.5.2 of the 3 April 2006 Minutes (see [30] above). 78        There are two serious errors in R’s version of what the DC had decided. It would appear that R had not understood what the DC had written in the First DC Report. The first error is that the DC was not primarily concerned with the issue of whether the appellant was divorced from Koh in 1982. The DC was concernedonlywith whether the appellant had falsely declared NKY as her spouse in 1992 as that was what the Charge alleged. R’s account of the DC proceedings (which he did not attend) tallied more with JL’s account of the DC proceedings (which JL did attend) as set out in his private and confidential e-mail dated 1 April 2006 to the President, a copy of which was circulated to R and the rest of the GC members (see [29] above). The second error, which we have already explained at [74] above, is equally serious. It probably misled the GC into believing that the DC had made a silly mistake in holding that the appellant’s customary marriage to NKY was valid. That, as we have stated earlier, was likely to have influenced the GC to reject the finding of the DC. 79        Even more serious was R’s participation at the GC meeting of 8 May 2006, where he made the following statement[note: 11]: [R] pointed out that in meting out sentences, it was essential for the DC … to list out the cases that [it had] considered. He felt that [NKY] being [a] lawyer should know better and when considering [the] sentence, this should be taken into account. This statement was irrelevant and prejudicial to the appellant in relation to the punishment to be imposed on her by the GC. The status of NKY as a lawyer had nothing to do with the Charge. Furthermore, there was no allegation that NKY had been a party to the alleged cheating by the appellant. This was clearly another breach of natural justice in so far as it took into account an irrelevant consideration.",
        "The Charge was inherently defective": "80        Counsel for SICC objected to the appellant raising this issue of the Charge being inherently defective on the ground that it amounted to a review of the merits of the GC’s decision which, it was submitted, did not fall within the supervisory jurisdiction of the court. In our view, this issue has nothing to do with the merits of the Charge, but everything to do with the legality of the Charge. 81        The appellant’s argument is that when she named NKY as her spouse, she was not yet a member of the Club. As r 34(a) of the Rules applies only to a member, she could not be charged under it for cheating the Club in her capacity as a non-member. After she was accepted as a member, she did not do any act that was prejudicial to the interests of the Club. Accordingly, the allegation in the Charge that, as a member, she had falsely named NKY as her spouse in order to cheat the Club was defective. In our view, this argument is logical and correct on the facts as found by the DC. However, it would not be correct if there is evidence to show that the appellant was aware in 1992, or at any time thereafter up to the time she was asked to furnish her marriage certificate, that her customary marriage to NKY was invalid but did not inform the Club. In our view, an “act” for the purposes of r 34(a) would include a deliberate omission to disclose an act prejudicial to the interests of the Club. However, no such allegation was made against the appellant. In the circumstances, the appellant’s argument on this point is sound on a proper construction of r 34(a). She could not be charged for cheating the Clubquamember when, at the time she named NKY as her spouse, she was not yet a member. The appellant therefore also succeeded on this ground.",
        "Conclusion": "82        It was evident from the record of the proceedings, as we indicated at the hearing of the appeal, that the GC had committed serious breaches of the rules of natural justice. It failed to give the appellant a fair hearing; its prejudgement of the appellant’s guilt led it to reject, for the wrong reasons, the finding of the DC that the appellant was not guilty of the Charge; its decision was irrational; and it failed to understand the defence of the appellant, which the DC had accepted. Furthermore, the Charge was illegal for the reason that the appellant was not yet a member of the Club when she filled up the application form in 1992. 83        We therefore allowed the appeal with costs to the appellant and declared the suspension order against the appellant invalid. We also ordered the respondent to refund all sums paid by the appellant pursuant to the GC’s decisions, and awarded the appellant damages to be assessed by the Registrar. [note: 1]At para 34 of her affidavit of 26 February 2007.[note: 2]At para 10 of her affidavit of 26 February 2007.[note: 3]At para 12.[note: 4]See para 5.5.3 of the 3 April 2006 Minutes.[note: 5]See para 5.5.4 of the 3 April 2006 Minutes.[note: 6]See para 2.1.1 of the minutes of the GC meeting on 8 May 2006.[note: 7]At para 5.5.3.[note: 8]At para 5.5.3.[note: 9]See para 5.5.6 of the 3 April 2006 Minutes.[note: 10]At para 2.1.23.[note: 11]See para 2.1.10 of the 8 May 2006 Minutes."
    }
}