{
    "case_title": "Ong Chay Tong & Sons (Pte) Ltd v Ong Hoo Eng",
    "ncitation": "[2008] SGCA 42",
    "coram": "Chan Sek Keong CJ; \n      Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Background": "2          The appellant is a family company in every sense. Incorporated on 9 March 1976, its articles of association state that membership in the company should be restricted to its founder, Ong Chay Tong (who had since passed away in 1993), the founder’s wives and his male lineal descendants and their wives. It was common ground that the object of incorporating the appellant as a limited company was for it to hold a three-storey residential development which consisted of eight apartment units at 17 Nallur Road (“Ong Mansions”). 3          Shares in the appellant were issued on or about 7 December 1976 to the founder and members of his family (which included the founder’s second wife, Mdm Chang Yueh Nu, and her only son, the respondent). On 4 January 1979, the appellant’s board passed a resolution (“the First Resolution”) authorising the appellant to sell one unit in Ong Mansions to each of the founder’s six sons (“the first generation Ongs”) at a discounted price of $100,000 per unit (“purchase price”). The resolution also specified that the sale of the units would be subjected to the following terms and conditions: (a)        The buyers of the flats are not allowed to resell the flats to any other persons except to the [appellant] at the same purchase price. (b)        The buyers of the flats will only use the flats for their own occupancy and [are] not permitted to lease [or] sub-let any part of the flats to any other persons. (c)        The sales are payable in cash on completion of the conveyance of the flats. 4          The respondent was not a director of the appellant at the time the First Resolution was passed. On 26 March 1982, units in Ong Mansions were sold to the founder’s six sons, including the respondent. Each of the sale and purchase agreements contained a special condition (“SC3”) which made direct reference to the First Resolution: In compliance with the [appellant’s] directors’ resolution dated 4th day of January 1979 the Purchaser undertakes and covenants that he shall not sell transfer or otherwise dispose off [sic] or part with possession of the said Flat or any part thereof except to the [appellant] at DOLLARS ONE HUNDRED THOUSAND ($100,000-00). 5          On 7 May 1998, after the demise of the founder, the appellant’s board of directors (“the Board”) held a meeting. The respondent did not attend this particular meeting although by that time he had been a director of the appellant for some five years. At the meeting, the members of the Board agreed that it might not have been the intention of the founder to restrict the holder of each unit to only the sons of the founder without consideration for future generations of male lineal descendants bearing the surname “Ong”. Accordingly, the Board resolved to delete conditions (a) and (b) of the First Resolution and to substitute them with the terms set out in the board resolution passed on that same day (“the Second Resolution”). The minutes of the meeting read as follows: 17A, 17B, 17C, 17D, 17E and 17F Nallur Road Mr Ong Choo Eng said that he would like to discuss the Directors’ Resolution passed on 4 January 1979 wherein it stated, inter alia, that [the first generation Ongs], each a buyer of the flat at 17A, 17B, 17C, 17D, 17E and 17F Nallur Road (now known as 17 Nallur Road #03-01, #03-02, #04-01, #04-02, #05-01 and #05-02), Singapore, respectively, is not allowed to resell his flat to any other person except to the [appellant] at the same purchase price of S$100,000/-. The meeting agreed unanimously that it may not be the intention of the late Ong Chay Tong at that time to restrict the holder of each flat to only the generation of his sons without consideration for future generations of male lineal descendants bearing the surname of “Ong”. Neither was it each buyer’s intention. They also agreed unanimously that each of them would like his flat to be sold or transferred or leased to only his own lineal descendant(s) bearing the surname of “Ong”. Accordingly, it was unanimously resolved: “That the terms and conditions (a) and (b) as set out in the Directors’ Resolution dated 4 January 1979 in respect of the 6 units of flats at 17 Nallur Road, Singapore, be deleted and substituted with the following terms and conditions: (a)        Each of [the first generation Ongs] (the “Ongs”) being the first buyer or individual owner of an apartment unit or flat at 17 Nallur Road, Singapore, is allowed to dispose of, transfer or lease his flat to only his own lineal descendants bearing the surname of “Ong” (the “Descendant Ongs”), and each of the Ongs and each of his Descendant Ongs shall procure that the transferee(s) of his flat shall execute the same undertaking; and (b)        Having regard to the following: (i)         that it is the intention of the late Ong Chay Tong to confine or restrict membership of the [appellant] to only male lineal descendants of Ong Chay Tong bearing the surname of “Ong” (including legally adopted sons) as reflected under Clause 6 of the Memorandum of Association of the [appellant]; and (ii)        that the [appellant] was established by the late Ong Chay Tong in 1976 for the purpose of holding the whole of the land and premises at 17 Nallur Road, Singapore (the “Property”) and that each flat at the Property was transferred by the [appellant] to each of the Ongs for goodwill purposes of providing a roof and home for each of the Ongs and not for monetary gain or commercial purposes, in the event that if any owner or transferee of the flats breaches or is unable to fulfill condition (a) above for whatever reason, the [appellant] shall have the irrevocable right to repossess the relevant flat at the original book cost entry of S$100,000/-.” 6At the appellant’s annual general meeting held on 15 June 1998, Ong Mui Eng, a director of the appellant, handed the said minutes to the respondent. The respondent signed the minutes. The appellant’s position was that Ong Mui Eng did not explain the minutes to the respondent but had merely handed them over to the respondent for his signature in his capacity as a director of the appellant. The respondent, on the other hand, deposed in an affidavit that “[i]nsofar as I am concern[ed], if anything, Clause 3 of the Agreement had been varied to the extent set out in the Minutes of Meeting dated 7thMay 1998”.[note: 1] 7          On 28 March 2006, a certified public accountant valued the appellant’s worth at $30 a share on the following basis:[note: 2]  Net cash at bank490,000Quoted shares at market value12,640,588Property at 17 Nallur Road #01-002,400,000------------Total assets15,530,588Less: 2.5% contingency(388,265)------------Net ValueS$15,142,32  8          Based on the net realisable value of around $15,000,000 and the fact that 500,000 shares were issued, the accountant valued each share in the appellant at $30. We would note that the valuation did not factor in the appellant’s pre-emption rights over the respondent’s property at 17 Nallur Road #04-02, which at the material time had a market valuation of about $830,000. Nor did it take into account the value of the other five units in the Ong Mansions which were similarly sold by the appellant to the respondent’s five half-siblings. 9          On 12 June 2006, the respondent agreed to sell his shares in the appellant at $24 per share to his half-siblings. A few days later, he resigned as a director of the appellant. On 14 August 2006, the appellant’s board passed a further resolution (“the Third Resolution”) to rescind the Second Resolution as well as to lodge caveats against the individual units in the Ong Mansions in which the appellant possesses pre-emption rights. The relevant portion of the Third Resolution reads as follows: The Board of Directors of the [appellant], having considered all salient issues including the interests of the [appellant], wishes (i) to rescind the resolutions passed at the Directors’ Meeting held on 7 May 1998 relating to the amendments of terms and conditions (a) and (b) of the First Directors’ Resolutions and (ii) to lodge caveat against each of the six units of flats in the Property (collectively, the “Caveats”) based on the undertaking in each Sale and Purchase Agreement dated 28 March 1982 entered into between the [appellant] and the relevant Registered Proprietor, a specimen copy is annexed hereto and marked ‘D’, whereby the relevant Registered Proprietor undertakes not to sell, transfer or otherwise dispose or part with possession of the within land described therein, except only to the [appellant] at the price of S$100,000.00. 10        On the very same day, the appellant lodged a caveat against the respondent’s property at 17 Nallur Road #04-02. Its basis for lodging the caveat was the undertaking of the respondent set out in SC3 under the sale and purchase agreement dated 26 March 1982 not to sell, transfer or otherwise dispose of or part with possession of the property except only to the appellant at the price of $100,000. The respondent challenged the lodgment of the caveat and the appellant subsequently took out an application for an order that the caveat be allowed to remain on the land register. 11        At the hearing in the High Court, the Judge held that, as a result of the Second Resolution, the appellant had abandoned its pre-emption rights under SC3 and he accordingly dismissed the appellant’s application for an order that the caveat be allowed to remain on the land register.",
        "Adduction of further evidence": "12        As a preliminary matter, the respondent applied to adduce fresh evidence in relation to the respondent’s purported reliance on the Second Resolution. It is settled law that in order to justify the reception of fresh evidence at the appellate stage, three conditions must be cumulatively fulfilled (seeLadd v Marshall[1954] 1 WLR 1489 at 1491): [F]irst, it must be shown that the evidence could not have been obtained with reasonable diligence for use at the trial; secondly, the evidence must be such that, if given, it would probably have an important influence on the result of the case, though it need not be decisive; thirdly, the evidence … must be apparently credible, though it need not be incontrovertible. 13        The fresh evidence sought to be adduced before us relates primarily to the respondent’s account that he had taken certain courses of actions in reliance on the Second Resolution. Quite clearly, such evidence was in the possession of the respondent or, at the very least, could have been easily obtained with reasonable diligence and ought to have been placed before the Judge at the proceedings below. In the circumstances, we had little alternative but to dismiss the application.",
        "Scope and effect of SC3": "14        It would be useful for us to first consider the question of the scope and effect of SC3. Mr Hwang, who appeared for the respondent, put forward the argument that the words “sell transfer or otherwise dispose [of]” in SC3 should not be construed in a manner which would prevent a testamentary transfer or a distribution in accordance with the Intestate Succession Act (Cap 146, 1985 Rev Ed). On the other hand, counsel for the appellant, Mr Menon, contended that, upon the event of the respondent’s demise, the vesting of the latter’s assets in the Public Trustee or an executor would amount to a transfer or disposition in breach of SC3. 15        It is an established principle of interpretation that where the words used in a document are ambiguous or capable of having more than one meaning, their meaning cannot be determined by looking at them in isolation. This court has on many occasions applied the contextual approach to determine their meaning as intended by the parties in such cases, for example, inSandar Aung v Parkway Hospitals Singapore Pte Ltd[2007] 2 SLR 891andZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR 1029. In the present case, the dispute between the parties is on the meaning of the word “dispose”, which is an ordinary word capable of wide meaning (seeCarter v Carter[1896] 1 Ch 62 at 67): The words “dispose” and “disposition” ... are not technical words, but ordinary English words of wide meaning; and where not limited by the context those words are sufficient to extend to all acts by which a new interest (legal or equitable) in the property is effectually created. 16        In our opinion, the words “dispose of” in SC3 are capable of referring to bothinter vivosand testamentary dispositions since they are used together with the words “transfer” and “sell” in SC3, both of which refer tointer vivosdisposals. It is therefore reasonable to infer that the words “dispose of” were intended to apply to testamentary dispositions, and less reasonable to infer that the drafters of SC3 and the appellant who adopted it had intended all three expressions to have the same meaning. 17        SC3 itself also provides the context in which the intended meaning of those words can be ascertained. SC3 was incorporated into each of the agreements for sale and purchasein compliancewith the First Resolution which provided,inter alia, that: (a) the buyers of the flats could not resell the flats to any other persons except to the appellant at the purchase price; and (b) the buyers could only use the flats for their own occupation and not for letting out to any person. When read with conditions (a) and (b) of the First Resolution, SC3 would suggest that the buyers’ interests in the flats would cease upon their deaths, and this interpretation would be consistent with their obligation not to sell the flats to anyone during their lifetimes. 18        Indeed, to hold that the words “dispose of” in SC3 were intended to refer to testamentary dispositions is also consistent with the terms of the Second Resolution which was passed by the appellant to give effect to the intention of the Ong patriarch and also that of the buyers, that the flats could be owned by not only the first generation Ongs (as set out in the First Resolution) but also by all future generations of Ong male lineal descendants. The Second Resolution accordingly deleted conditions (a) and (b) of the First Resolution and substituted therefor the following conditions: (a)        that each first generation Ong be allowed to dispose of, transfer or lease his flat to only his own lineal descendants bearing the surname of “Ong” (“the future generation Ongs”); and (b)        that each of the first and future generation Ongs should procure an undertaking from the transferee(s) of his flat to abide by condition (a), for the reason that each flat was transferred by the appellant to each of the first generation Ongs for goodwill purposes of providing a roof and home for each of the first generation Ongs and not for monetary gain or commercial purposes. The Second Resolution went on to provide that if any owner or transferee of the flats should breach or be unable to fulfil condition (a) above for whatever reason, the appellant would have the irrevocable right to repossess the relevant flat at the original book cost entry of $100,000. 19        The only other issue that needs to be considered in this connection is whether the Second Resolution (its effect on SC3 is discussed at [21]–[31] below) would allow the flats to be transmitted by intestate succession to a person other than a male Ong descendant. In our view, that would not be permissible as such an interpretation would be contrary to the intention as expressed in the Second Resolution as it would breach condition (a), thereby triggering the right of pre-emption in the appellant. 20        In our view, therefore, even if the scope of the words “dispose of” in the original SC3 were unclear, their meaning was made clear by the Second Resolution which was passed by the appellant to give effect to the intention of the Ong patriarch. The intention was that the flats were meant to provide a roof for all generations of lineal male Ongs and not for them to be sold or leased out to others. Under the Second Resolution the appellant would be entitled to ask that the flat be resold to the appellant at the original price where a lineal male Ong failed to give the undertaking specified in condition (a), or where the intestate successor in title was not a lineal male Ong descendant.",
        "Whether SC3 had been varied": "21        The parties to a contract may by mutual agreement effect a variation of the said agreement by modifying or altering its terms. In the context of the present matter, the first question to be considered is whether a board resolution of a company (like the Second Resolution) is capable of varying an existing contract to which the company is a party. 22        Such a question is, however, not novel to the Singapore courts. InGoh Kim Hai Edward v Pacific Can Investment Holdings Ltd[1996] 2 SLR 109(“Edward Goh”), the following board resolution was passed: That the employment contract of the chairman, Mr Edward Goh, subject to the terms and conditions and amendments as contained therein, renewed for another two years be and is hereby confirmed and ratified. 23        The judge inEdward Gohheld that the above resolution did not in itself constitute a new contract between the parties. Her reasoning (at 127, [57]) was: From my reading of the resolution, it is clear that, at the least, what the board did was to accept the SERC’s [Senior Executive Remuneration Committee’s] recommendation that the plaintiff’s contract be extended on the terms which they had proposed, ie the original terms plus a modification of the bonus clause. The acceptance of the recommendation did not, however, of itself constitute the new contract between the plaintiff and the defendants. It could not do so despite the somewhat peculiar way the resolution was worded and the use of the word ‘ratified’. In fact, as the plaintiff himself agreed there was nothing there to ratify since in January 1992 the SERC presented a recommendation rather than a purported contract as it had done in October 1989. Also the board was advised by its solicitors at the meeting held on 27 March 1992 that in the context of the resolution the word ‘ratified’ meant no more than ‘confirmed’ and added nothing to the effect of the resolution. 24        That aside, the judge inEdward Gohalso alluded, at 127, [58] of her decision, to the existence of a “category of resolutions which have an immediate legal effect”. There is little doubt that such a category of resolutions indeed exists. One example can be found inChristopher Richard Oakley v Osiris Trustees Limited[2008] UKPC 2, where the directors of a trust company passed a resolution resolving,inter alia, that “the proper law of the Trusts is the Law of the Isle of Man”. The Privy Council considered (at [31]) that the resolution in itself had an immediate legal effect: In paragraph 25 the Acting Deemster preferred Mr Petit’s [counsel for the appellant, Mr Oakley] view that the resolution was capable of having, and did have, immediate effect, to Mrs del Amo’s [counsel for the trust company] view that it looked forward to the execution of a further instrument which was never in fact executed. It is convenient to dispose of this point at once. The Staff of Government Division [of the High Court of Justice of the Isle of Man] agreed with the Acting Deemster on this point … and in their Lordships’ view that was plainly correct, since although some board resolutions do contemplate the execution of a further document (for instance, when a board resolves to execute a contract or transfer on behalf of the company) this resolution was, on its plain language, not of that type. 25        The following observations made by the Privy Council at [38] and [39] are likewise useful: The text of this part of the resolution was entirely unambiguous, and professional men are taken to intend that if they sign a document of some degree of formality (such as the resolution) it will have the legal effect which it purports to have. The fact that Mr Oakley later had doubts about the effectiveness of the document (doubts which emanated from advice given by a Jersey firm of advocates), and ill-advisedly sought to replace it by the unauthentic minutes, cannot alter the fact that Mr Holt and Mr Oakley signed the resolution on or very soon after 3 December 1997, and intended it to have legal effect. … All the evidence shows that Mr Oakley intended to change the proper law; his failure to consider what formalities were necessary was lamentable, but cannot alter the fact that he had the requisite intention. As Mr Petit put it during his cross-examination …, “The fact that it’s awful in terms of drafting I think doesn’t disqualify it. It might offend a trust draftsman’s sense of right and wrong but I don’t think it wins or loses the argument as a result of deficiencies in it.” 26        In the present case, it is true that the Second Resolution did not make any direct reference to SC3. But it did expressly refer to the First Resolution. It is important to bear in mind that we are here dealing with a family companypar excellence. Thus one should not take too formalistic or legalistic an approach in relation to its affairs, especially in its relationship with members of the family. It is also equally important to note that the Second Resolution sought to do no more than to clarify what was the intention of the founder of the appellant company. It would not be unreasonable to infer that the Board intended for the Second Resolution to have immediate effect in relation to the six units in Ong Mansions. This intention is consistent with the conduct of the Board in seeking to obtain the agreement of the respondent (who was absent at the Board meeting) to the minutes where the Second Resolution was set out. 27        An alternative way of viewing the position would be to say that by tendering the minutes of the board meeting for the signature of the respondent, there was an offer to vary SC3 which the respondent accepted by signing the minutes. It is trite law that an offer can be made by a party’s conduct. Since the respondent was not present at the meeting, he would not be in a position to signify his agreement that the minutes were an accurate reflection of what had transpired at that meeting. The respondent’s act of signing the minutes on 15 June 1998 had no legal significance in his capacity as a director of the appellant as, under Art 112 of the appellant’s articles of association, the minutes of any board meeting need only be signed by the chairman of the meeting and not by all the directors of the company. The approved minutes needed only be sent to the respondent for his information. The conduct of the Board in seeking the respondent’s signature to the minutes and his act of signing them must mean something. Here, we would reiterate the same point made in [26] above, which is that the appellant was a family company and the requisite degree of formality therefore need not be as high as that required in relation to other types of companies and commercial transactions. 28        Accordingly, we are of the view that the appellant’s conduct of proffering the minutes evidencing the Second Resolution to the respondent for his signature constitutes a valid offer to vary SC3 (“the new SC3”), and that the respondent signified his acceptance of the offer by initialling on the said minutes. To construe otherwise would be to say that these two acts were entirely superfluous and meaningless. 29        We turn now to the question of consideration. InSunny Metal & Engineering Pte Ltd v Ng Khim Ming Eric[2007] 1 SLR 853, Andrew Phang Boon Leong J observed at [30] that: [T]he combined effect ofWilliams v Roffey Bros & Nicholls (Contractors) Ltd[[1991] 1 QB 1] (to the effect that afactual, as opposed to a legal, benefit or detriment is sufficient consideration) and the well-established proposition that consideration must be sufficient but need not be adequate (see, for example, the Singapore Court of Appeal decision ofWong Fook Heng v Amixco Asia Pte Ltd[1992] 2 SLR 342at 348, [23]) is that (as Rajah JC had pointed out in [Chwee Kin Keong v Digilandmall.com Pte Ltd[2004] 2 SLR 594]) it will, absent exceptional circumstances, be all too easy to locate some element of consideration between contracting parties. [emphasis in original] 30        In our view, the consideration provided by the respondent is self-evident in the Second Resolution. In exchange for the freedom to lease or transfer the flatinter vivosto hisown lineal descendants, therespondent promised toprocure that the transferee of his flat would execute an undertaking to the effect that the latter would not dispose of, transfer or lease the flat save only to his own lineal descendants bearing the surname of “Ong”. In the event that the respondent failed to do so, the Second Resolution provided that the appellant wouldhave the irrevocable right to repossess the flat at $100,000. This promise by the respondent to procure an undertaking would no doubt constitute good consideration.Chitty on Contracts(Sweet & Maxwell, 29th Ed, 2004) at para 3-008A states: A person who makes a commercial promise expects to have to perform it (and is in fact under considerable pressure to do so). Correspondingly, one who receives such a promise expects it to be kept. These expectations, which can exist even where the promise is not legally enforceable, are based on commercial morality, and can properly be called a detriment and a benefit; hence they satisfy the requirement of consideration in the case of mutual promises. 31        In the premises, we are of the opinion that the tendering of the Second Resolution to the respondent for his agreement and signature constituted an offer to vary SC3, and that the respondent had accepted the offer and had provided good consideration for the variation. Accordingly, we hold that, as far as the appellant and the respondent are concerned, there was an agreement by conduct between them that SC3 was to be varied and substituted by a new clause in the terms as set out in the Second Resolution. We note that the Judge held that there was abandonment of SC3. We accept that “abandonment” is the effect of “waiver” and as Lord Hailsham of St Marylebone LC stated inBanning v Wright[1972] 1 WLR 972 at 979: In my view, the primary meaning of the word “waiver” in legal parlance is the abandonment of a right in such a way that the other party is entitled to plead the abandonment by way of confession and avoidance if the right is thereafter asserted. This appears to accord with the dictionary meaning of the term and with the two discussions of the subject, each to the same, or similar, effect inHalsbury’s Laws of England, 3rd ed., vol. 14 (1956), “Equity,” p. 637, para. 1175; vol. 37 (1962), “Tort,” p. 152, para 277. In the former of these it is said: “Waiver is the abandonment of a right. … A person who is entitled to the benefit of a stipulation in a contract or of a statutory provision may waive it, and allow the contract or transaction to proceed as though the stipulation or provision did not exist …” Of course, in the present instance, the case was not simply one of waiver or abandonment but, as pointed out above, a variation or substitution. 32        In passing, we ought also to mention that the respondent has, in the respondent’s case, made the submission that, in the circumstances, estoppel would also apply as the respondent had acted on the basis of the Second Resolution. It would be noted, as stated in [13] above, that we had refused the respondent’s application to adduce fresh evidence to establish reliance by the respondent on the Second Resolution. In the light of our ruling that SC3 had been varied, we do not propose to go into this question of whether a case of estoppel has been made out.",
        "Condition subsequent": "33        We now turn to the issue of whether SC3 or the new SC3 constitutes a condition subsequent. Here, the respondent argued that the new SC3 was a condition subsequent attached to the respondent’s interest in the property and, it being such a condition, the entire clause was void for being a restraint on alienation and/or for want of certainty. 34        A case where a similar point was raised and where the circumstances were somewhat similar to the present case is that ofTan Soo Leng David v Wee Satku & Kumar Pte Ltd[1998] 2 SLR 83(“Tan Soo Leng”). In that case, the first defendant purchased a property from the second defendant. One of the clauses in the sale and purchase agreement (“cl (f)”) provided that: The Purchaser [the first defendant] … shall not let or sub-let, sell or assign or transfer (otherwise than by way of security) the [property] without the prior written consent of the Vendor [the second defendant] which consent shall not be unreasonably withheld if the letting, sub-letting, sale or assignment or transfer is to a medical practitioner (which expression shall include a body corporate) engaged in the practice of specialist medicine. 35        Subsequently, the first defendant granted the plaintiff an option to purchase the property. The sale was conditional on the second defendant’s consent. The second defendant refused to consent to the sale and the plaintiff purported to exercise the option. The plaintiff also lodged a caveat against the property and commenced an action for,inter alia, specific performance. 36        One of the issues before the court inTan Soo Lengwas the legality of cl (f), which the plaintiff asserted was not valid as it amounted to a restraint on alienation. The judge cited, amongst others,Caldy Manor Estate Ltd v Farrell[1974] 1 WLR 1303 (“Caldy Manor”) as authority for her view, at [55]: The effect of the authorities quoted and others cited is that certain restraints on alienation are valid. Restraints for the purpose of effecting a collateral purpose which is not unlawful are valid. Restraints which are not total restraints on alienation are valid. Contractual restraints, the breach of which would only result in damages are valid. 37        The judge then upheld cl (f) and stated (at [59]) that: Additionally, cl (f) would be valid under the rule enunciated inCaldy Manor… There was nothing in the principal agreement which allowed MEH to re-enter or re-claim the property by reason of a breach or threatened breach of cl (f). Thus the only remedy of MEH [the second defendant] for such a breach would be the right to claim damages. If the first defendant had ignored that covenant and had gone ahead to assign the property to the plaintiff, that assignment would have been valid and the estate granted to the plaintiff would not have been destroyed by the breach of covenant. Of course if MEH had learnt of the proposed breach of the covenant prior to the execution of the assignment, it could have attempted to injunct the completion of the sale. But if it did not do so, the assignment once completed, would be legally effective to vest the first defendant’s estate in the property in the plaintiff and MEH would have been limited to an action for damages against the first defendant. 38        Apart fromTan Soo Leng,Caldy Manorwas also applied inNeo Hock Pheng v Teo Siew Peng[1999] 2 SLR 45(“Neo Hock Pheng”), where this court cited (at [24]) the following passage by Russell LJ (at 1307 ofCaldy Manor): There is a most important distinction to be drawn between two matters different in kind: on the one hand, an attempt to attach to a grant of an absolute interest a condition which, if valid, would upon a purported alienation in breach of the condition confer a right of re-entry or result in cesser of the absolute interest, and so destroy the very thing granted, and, on the other hand, a covenant against alienation which would have no such operation; for, if the covenant be broken, the alienation would operate, the covenantee having at law no more than a right to damages, which might well be nominal; and the covenantee could only prevent a threatened alienation in breach of covenant by obtaining an injunction, which relief might or might not be granted. In this connection, we note that in Coke’s comments to Littleton’s section 334 inCoke upon Littleton, vol. III, p. 206b, it is stated that though a condition against alienation on a feoffment in fee be repugnant and against the law and therefore inoperative, nevertheless a bond not to alienate is effective and enforceable in the sense that it will be forfeit if the feoffee alien. 39        The court inNeo Hock Phengalso stated (at [18]) that: [T]he rule on the restraint on alienation applies to instruments that devise or dispose of land or interests in land such as a conveyance, deed or grant or alternatively a will or testimony instrument. It has no application to an instrument or document which create[s] only contractual rights as contractual rights do not create propriety interests in land. 40        It bears noting that, inChitty on Contracts([30]supra) at para 12-030, a condition subsequent was described, in general, as follows: The obligation of one or both parties may be made subject to a condition that it is to be immediately binding, but if certain facts are ascertained to exist or upon the occurrence or non-occurrence of some further event, then either the contract is to cease to bind or one or both parties are to have the right to avoid the contract or bring it to an end. In such a case the contract is said to be subject to a condition subsequent. 41        In Tan Sook Yee,Principles of Singapore Land Law(Butterworths Asia, 2nd Ed, 2001), Prof Tan Sook Yee also gave an illustration of a condition subsequent (at pp 61–62) as follows: … ‘to X but if he ceases to reside in Singapore, his interest shall cease’. In this case, X will get the fee simple in Blackacre and on his ceasing to reside in Singapore, the grantor, A, has a right to re-enter and forfeit his interest. This is the gift upon a condition subsequent. On X’s breach of the condition, A has the right to re-enter. 42        In the present case, the new SC3 provides that the respondentis allowed to dispose of, transfer or lease his flat to only his own lineal descendants bearing the surname of “Ong”. In the event the said condition is breached, the appellant has an irrevocable right to purchase the flat at $100,000. The distinction between the present facts andTan Soo Leng([34]supra) is that in the former, a breach of the relevant clause would entitle the original vendor to repurchase the property at a pre-determined price, while in the latter, there is no such provision. This distinction aside, we are nevertheless of the view that the absence of a right of re-entry and forfeiture or language to the effect of bringing the original contract to an end compels us to conclude that the new SC3 is not a condition subsequent and does not constitute a restraint on alienation. 43InTiffany Investments Ltd v Bircham & Co Nominees (No 2) Ltd[2004] 2 P & CR 10 (“Tiffany Investments”), the English Court of Appeal, applyingPritchard v Briggs[1980] Ch 338 (see [47]–[51] below), held that the sale of a lease in contravention of a party’s first right of refusal would entitle that party to an equitable interest commensurate with that of a purchaser under a binding contract immediately prior to the sale. Thus, assuming if the English authorities are to be followed, all the appellant would have is an equitable interest in the property in the event that the respondent acts in a manner that is contrary to the new SC3. However, just like inTan Soo Leng, if the respondent had ignored the new SC3 and had assigned the legal interest of the property for valuable consideration to abona fidethird party without notice, that assignment would have been valid and the original estate granted to the respondent would not have been destroyed by the breach. 44The classic hallmark of a condition subsequent is that a breach of it would accord the granteethe right to bring the original contract to an end or to re-enter or forfeit the property. The new SC3, however, does not provide for such a course of action in that eventuality and we are of the view that the new SC3 amounts only to a contractual restraint, a breach of which would not result in the original grant being brought to an end. In the circumstances, we reject the respondent’s submissions that SC3, or the new SC3, was a condition subsequent and that it was void for being a restraint on alienation. 45        Notwithstanding the above finding, as inTan Soo Lengwhere the judge noted at [59] that the second defendant could have attempted to injunct the completion of the sale, the appellant in the present case is likewise not prevented from seeking a similar measure. The right may be contractual in nature but a court may in certain circumstances grant an injunction to ensure that a party’s right (particularly in land) would be given effect to. Indeed, inCaldy Manor([36]supra), Russell LJ had observed that, even in instances of a contractual restraint, the covenantee could prevent a threatened alienation in breach of the covenant by obtaining an injunction, although relief might or might not be granted (see [38] above).",
        "Whether a caveatable interest exists": "46        We now turn to consider the question of whether what is provided in SC3, or the new SC3, constitutes a caveatable interest. InHo Seek Yueng Novel v J & V Development Pte Ltd[2006] 2 SLR 742(“Novel Ho”), a decision of the High Court, Andrew Phang Boon Leong J was of the view that it was eminently fair, logical and commonsensical to allow a caveat to be lodged at any time by the holder of a valid and enforceable right of first refusal or right of pre-emption. Here, the authorities would appear to treat a right of first refusal as synonymous with a right of pre-emption, with the only essential factual difference between the two being that, in the case of a right of pre-emption, the price has been fixed. 47        In coming to his view inNovel Ho, Phang J examined extensively the Australian and English cases as well as the academic writings on the subject. He scrutinised, in particular, what seemed to be the most important case on the issue,Pritchard v Briggs, where the majority of the English Court of Appeal proffered the view (albeitobiter) that a right of pre-emption became an equitable interest in land, like that of an option proper, only upon the happening of a triggering event. Phang J also considered the position taken by the Canadian courts which seemed to favour thePritchard v Briggsapproach. 48        The reasons for the conclusion reached by Phang J were summarised by him under the following five heads. First, allowing a caveat to be lodged in such circumstances was consistent with the function of a caveat. Second, the cases that appeared to state that a right of first refusal was merely a contractual right and not an interest in land did not purport to do so conclusively. Third, the proposition of the majority inPritchard v Briggs, that a right of refusal could be transformed into an interest in land only when the grantor of that right decided to sell the property concerned, generated much uncertainty and had been correctly criticised. Fourth, an option was now widely acknowledged to create an interest in land and there appeared to be no reason why a right of first refusal could not also create an interest in land. The distinction between an option and a right of refusal was not particularly convincing. Fifth, legislation in the United Kingdom had acknowledged, in so far as registered land was concerned, that a right of first refusal constituted an interest in land. 49        However, we should hasten to add that the views enunciated by Phang J referred to above did not form part of theratio decidendiof his decision inNovel Hobecause he had earlier concluded that the defendant’s interest in the sale proceeds itself constituted a sufficient interest capable of sustaining a caveat. To this, we might add that Phang J was also very conscious of the fact that, to date, no case, other than judicial pronouncement of anobiternature, had taken a step further than that propounded by the majority inPritchard v Briggs(ie, recognising that a right of first refusal accords the grantee an equitable interest at the time of its grant).",
        "The positions adopted in leading common law jurisdictions": "50        As we have mentioned above, the leading authority on the issue is the English Court of Appeal case ofPritchard v Briggs. Until this case, the authorities seemed to hold that a right of first refusal could not constitute an interest in land sufficient to lodge a caveat (seeEudunda Farmers Co-operative Society Limited v Mattiske[1920] SALR 309;Mackay v Wilson(1947) 47 SR (NSW) 315;Re Bosca Land Pty Ltd’s Caveat[1976] Qd R 119 (“Bosca”); andRe Rutherford[1977] 1 NZLR 504). 51        Putting it simply, the issue inPritchard v Briggswas which of two registered interests, namely, the right of first refusal (which caveat was lodged first) and an option to purchase, had priority. Interestingly, at first instance, Walton J was of the view (at 361–362) that “there would appear to be no essential difference, from the point of view of creating an interest in land, between an option on the one hand and a right of pre-emption on the other”. Accordingly, he held that a pre-emption right in relation to a real property was sufficient to constitute an interest in land to warrant the lodgment of a caveat. However, the Court of Appeal thought that such a right was purely a contractual right which did not give rise to an interest in land. It thus held that the second caveat lodged to protect the option prevailed. However, the majority of the Court of Appeal (Templeman and Stephenson LJJ), went one step further and proffered the view that a right of pre-emption could be converted into an interest in land if the right was triggered by the owner’s decision to sell the property. But the caveat so lodged in respect of the right of pre-emption would only take its priority as from the date when the right of pre-emption became exercisable and the right was converted into an option. The third member of thecoram, Goff LJ, did not share that view. To him, a right of pre-emption did not create an interest in land (at 399 ofPritchard v Briggs). 52        The majority view of Templeman and Stephenson LJJ was the subject of much commentary by academics and this was alluded to by Phang J inNovel Ho. For our purpose, it will not be necessary to traverse all of that again. We propose to refer only to two highly regarded pieces of work. The first is Henry William Rawson Wade, “Rights of Pre-Emption: Interests in Land?” (1980) 96 LQR 488. Prof Wade critically remarked at 488 and 489: Still more unfortunately, all their answers [the answers from the learned Lord Justices inPritchard v Briggs] seem productive of results which are first, inequitable; secondly, contrary to the legislation of 1925; and thirdly, at variance with general principles of land law. The original decision of Walton J …, which was reversed, had avoided all these dire consequences admirably. … It [the result of the decision of the Court of Appeal inPritchard v Briggs] belongs to the class of disasters which a sound system of property law ought to strive at all costs to avoid: the defeat of a prior interest by a later purchaser taking with notice of the conflicting prior interest. 53        Next, the authors of a leading textbook, Kevin Gray & Susan Francis Gray,Elements of Land Law(Oxford University Press, 4th Ed, 2005) seemed less strident in their comment on the majority view inPritchard v Briggswhen they stated at para 9.85 that: Over the years there has been an extended debate as to the proprietary status of rights of pre-emption. On one view a right of pre-emption remains a purely personal contractual right unless and until it becomes exercisable by reason of the estate owner’s election to sell. It is only at this point – and not before – that the grantee’s entitlement is transformed into an equitable interest in the land. Until then, it was widely believed, a right of first refusal confers insufficient ‘property’ in the land to qualify its recipient as the owner of any equitable entitlement capable of protection by register entry. This analysis, although probably a correct reflection of the highly contingent nature of the unfructified right of pre-emption, attracted much criticism, not least because there remains a strong argument that potential disponees of land deserve, in fairness, to be forewarned of all sale arrangements affecting the estate which they propose to buy. 54        The adverse comments onPritchard v Briggsnotwithstanding, the courts in England, Australia and Canada have subsequently followed the approach propounded by the majority inPritchard v Brigg,eg, inKling v Keston Properties Ltd(1983) 49 P & CR 212;Bircham & Co, Nominees (2) Ltd v Worrell Holdings Ltd(2001) 82 P & CR 34;Sahade v BP Australia Pty Ltd(2004) 12 BPR 22,149;Kopec v Pyret(1983) 146 DLR (3d) 242. 55        Nevertheless this does not mean that the academic criticisms were totally disregarded by the courts. InDear v Reeves[2002] Ch 1, Mummery LJ remarked at [43] that “the reasoning in the judgments inPritchard v Briggsmay require reconsideration”. 56        However, we will at this juncture refer to a line of thinking in Australia which seems to advance the view that so long as an interest is protectable by an injunction, that interest would be sufficient to enable the owner of that interest to lodge a caveat. InJessica Holdings Pty Ltd v Anglican Property Trust Diocese of Sydney(1992) 27 NSWLR 140 (“Jessica Holdings”), Brownie J analysed the two divergent lines of Australian authorities as to whether a conditional contract vested a purchaser with a caveatable interest. The earlier line of authorities was of the steadfast view that a caveat could only be sustained by a legal or equitable interest. For instance, inBosca([50]supra), Dunn J held that a contract conditional upon first obtaining a proper subdivision of the land did not vest the purchaser with any equitable interest and “this being so I propose to order that the caveat be removed” (at 122). 57        WhileBoscahas been adopted and applied by the Australian courts in subsequent decisions, it was not without criticism. InRe C M Group Pty Ltd’s Caveat[1986] 1 Qd R 381 (“Re C M Group”) at 388–389, Dowsett J voiced his unease withBosca: It seems to me that the question for determination is the meaning to be attributed to the expression “estate or interest” where it is used in s. 98 of theReal Property Act[1861–1980 (Qld)]. Where that expression is otherwise used in the Act it clearly has a broad meaning. For example the prohibition on passing title to land other than pursuant to the Act (s. 43) uses the same expression “estate or interest”. However, it is clear that in s. 43 the reference is to estates or interests which are capable of registration. In s. 44, however, it is clear that the expression “any estate or interest” is meant to be of much wider import. The effect of the judgment inRe Bosca’s Caveatseems to be that there can be no equitable interest pursuant to a contract of sale sufficient to satisfy the minimal requirements of s. 98 of the Act unless the contract is one of which specific performance will be ordered as at the time at which the caveat is lodged or sought to be maintained. The above discussion indicates to me some difficulty in distinguishing between the “interest” necessary to support the caveat and the equity necessary to support an injunction in the auxiliary jurisdiction in support of a common law claim or in support of an equitable claim. The distinction drawn by Dunn J. inRe Pile’s[Caveats[1981] Qd R 81] between protecting a claim by caveat and protecting it by injunction is not a convincing or compelling one, particularly as its validity is dependent upon giving a narrow interpretation to the concept of “interest” for the purposes of theReal Property Act. Further, the approach taken by Mason and Deane JJ. inLegione v. Hateley[(1983) 152 CLR 406] seems, if I may say so with respect, to be justified by the authorities referred to by their Honours and inconsistent with the approach taken by Dunn J. inBoscaandPile. I do not think that the approach taken by their Honours is at all inconsistent with eitherMcWilliam[v McWilliams Wines Pty Limited(1964) 114 CLR 656] orBrown v. Heffer[(1967) 116 CLR 344] when those latter cases are seen in the respective contexts in which they were decided. If the approach taken by Mason and Deane JJ. is adopted in the future by other members of the High Court, then it seems to me to be thatBoscawill not be good law. Nonetheless, I am faced with a situation in whichBoscahas stood for almost ten years and has been followed in other cases. It is a decision which significantly narrows the circumstances in which the caveat procedure is available to protect a purchaser given the frequency with which conditional contracts are executed. It compels a purchaser under such a contract to go to the trouble and expense of seeking a discretionary remedy by way of injunction with the necessity to show threat of breach of contract when, in my view, it was clearly intended that such purchaser have the benefit of the caveat procedure. In those circumstances, I might well have considered not following the earlier decisions of this court referred to above were it not for the decision of the Full Court of South Australia inOvenden v. Palyaris Construction Pty. Ltd.(1974) 11 S.A.S.R. 65 … 58        Dowsett J then quoted fromOvendenv Palyaris Construction Pty Ltd(1974) 11 SASR 65 (“Ovenden”) and continued (at 390): Although it may be arguable that the above observations by Bray C.J. [inOvenden] are not part of the ratio of the case, and although similar observations may be made about the judgment of Hogarth J. [also inOvenden], it seems to me to be inescapable that all three members of the Court treated a conditional contract for the sale of land as not creating an interest capable of supporting a caveat. It is clear from what I have said that I have doubts about the correctness of the decision. However the case is not so clear as to lead me to refuse to follow decisions of other members of this Court when they are supported as they are by such clear observations by an appellate Court of another State. 59        Although Dowsett J inRe C M Groupultimately appliedBosca, Brownie J declined to do so inJessica Holdingsas he was of the view that, if relief by way of an injunction was available to a caveator, then that might be a sufficient basis to maintain a caveat. Brownie J premised his reasoning on the observations made by Deane and Dawson JJ inStern v McArthur(1988) 165 CLR 489 at 522, where the learned judges said: The extent of the purchaser’s interest is to be measured by the protection which equity will afford to the purchaser. That is really what is meant when it is said that the purchaser’s interest exists only so long as the contract is specifically enforceable by him. Specific performance in this context does not mean specific performance in the strict or technical sense of requiring the contract to be performed in accordance with its terms. Rather it encompasses all of those remedies available to the purchaser in equity to protect the interest which he has acquired under the contract. In appropriate cases it will include other remedies, such as relief by way of injunction, as well as specific performance in the strict sense. 60        Brownie J then continued, at 151–152 ofJessica Holdings: Additionally, as Kearney J said inBurns Philp Trustee Co Ltd v Viney[1981] 2 NSWLR 216at 224: “... enforceability is not so much a pre-condition to the existence of an equitable interest, but rather an incident or characteristic of such interest signifying its quality or extent”; and it is not to be forgotten that the relevant question is the meaning of the words in the statute. The starting point for the decisions inBoscaand [Re Premier Freehold Pty Ltd’s Caveat[1981] Qd R 547] was the proposition that one decided whether a purchaser of land had an equitable interest in the land by inquiring whether a court of equity would order specific performance of the contract, and if so, on what terms. However, it seems to me that the statements quoted above, made inMcWilliam[v McWilliams Wines Pty Limited] and inBrown[v Heffer], must now be read more widely, so as to include specific performance, not just in the primary sense of enforcing an executory contract by compelling the execution of an assurance to complete it, but also in the extended sense that the court might by injunction order the vendor to do what was necessary to enable the purchaser to obtain any necessary consent … .., ... [I]n the present case, since the defendant has an interest which, for the reasons already stated ought to be protected by an injunction, it follows that the defendant has an interest which may be protected by a caveat. 61        As we see it,Jessica Holdingsand Dowsett J’sdictainRe C M Groupclearly suggest that a caveat need not necessarily be supported by the existence of a full-fledged equitable interest as, so long as the interest falls within the protective aegis of an injunction, then, depending on the circumstances, that interest might well be protected by a caveat.",
        "Section 115 of the Land Titles Act": "62        We now turn to examine the provisions in the Land Titles Act (Cap 157, 2004 Rev Ed) (“LTA”) which govern the lodging of caveats. Section 115 of the LTA reads: (1)        Any person claiming an interest in land (whether or not the land has been brought under the provision of this Act), or any person otherwise authorised by this Act or any other written law to do so, may lodge with the Registrar a caveat in the approved form … … (3)        For the purposes of this Part, and without limiting its generality, a reference to a person claiming an interest in land shall include a reference to any of the following persons: (a)        any person who has an interest in the proceeds of sale of land, not being an interest arising from a judgment or order for the payment of money; … … Section 4 of the LTA defines an “interest” in land to mean “any interest in land recognised as such by law, and includes an estate in land”. 63        It is settled principle that a statutory provision should be given a purposive interpretation. InChief Assessor v First DCS Pte Ltd[2008] 2 SLR 724, this court stated at [10]: When construing statutory provisions, it is important to consider the purpose for which Parliament enacted the provision in question. It would be incorrect to read the provision as if it existed in a vacuum. Indeed, by virtue of s 9A of the Interpretation Act (Cap 1, 2002 Rev Ed), the courts must prefer an interpretation which supports the intended purpose of a provision over an interpretation that does not. The effect of that section is to make the purposive approach the paramount rule of construction in our jurisprudence. 64        The term “interest” in relation to land came up for consideration inChi Liung Holdings Sdn Bhd v AG[1994] 2 SLR 354(“Chi Liung”), where this court held that a contract for the sale of properties conditional upon a foreign purchaser obtaining qualifying certificates from the Controller of Housing did not contravene the Residential Property Act (Cap 274, 1985 Rev Ed) as no estate or interest in the purchaser’s favour arose until the contract had become unconditional. 65        A similar view of what would constitute an interest or equitable interest in land was expressed by Street J inMackay v Wilson([50]supra) at 325 as follows: But an agreement to give “the first refusal” or “a right of pre-emption” confers no immediate right upon the prospective purchaser. … It is not an offer and in itself imposes no obligation on the owner of the land to sell the same. He may do so or not as he wishes. But if he does decide to sell, then the holder of the right of first refusal has the right to receive the first offer, which he also may accept or not as he wishes. The right is merely contractual and no equitable interest in the land is created by the agreement. 66        If the interpretation given to the term “interest” by this court inChi Liungwere to be applied generally, as opposed to it being confined to the Residential Property Act, it would follow that a pre-emption right would not constitute an interest in land for the purposes of lodging a caveat. The critical question, however, is whether the court should hold that a pre-emption right constitutes a caveatable interest in land. 67        Different legislations have different objectives. As pertinently noted by Prof Tan inPrinciples of Singapore Land Law([41]supra) at p 263: Acceptance of the wider meaning of enforceability of a contract as a criterion for determining whether rights relating to land may be protected by caveats, does not necessarily result in such rights being classified as interest in land in all situations. ‘Interest’ is a protean term. In other words, “interest” may have different meanings in different contexts.The following observations made by Dowsett J inRe C M Group([57]supra) at 385are also apposite: Whilst not suggesting that these contexts necessarily render the decisions unhelpful for the purpose of construing the expression “an estate or interest” in s. 98 of the“Real Property Act”,it is, I believe, important to keep in mind that the word “interest” in particular may have different meanings in different context. 68        What then is the ambit of “interest” in s 115 of the LTA? As we have alluded to at [63] above, the answer should not be obtained outside the function and object of the said section. It is well settled that the function and object of a caveat is not to create any interest in the land on which the caveat is lodged. Nor is it to give notice to the world of a claim by the caveator. “Caveat”, a word from Latin meaning “let him beware”, is effectively a notice or warning. InAlrich Development Pte Ltd v Rafiq Jumabhoy[1993] 2 SLR 446at 452, [37], this court described a caveat to be: ... ‘nothing more than [a] statutory injunction to keep the property in status quo until the court has had an opportunity of discovering what are the rights of the parties[’]: per Owen J inRe Hitchcock[(1900) 17 WN (NSW) 62]. It is not for the purpose of giving notice to the world of a claim by the caveator to an estate or interest in the land, but for the purpose of prohibiting the caveator’s interest from being defeated by the registration of a dealing without the caveator having had an opportunity to invoke the assistance of the court to give effect to his interest … 69        Similarly, inLeros Proprietary Limited v Terara Proprietary Limited(1992) 174 CLR 407 at 419, the High Court of Australia unanimously determined that: [T]he purpose of a caveat against dealings is to operate as an injunction to the Registrar-General to prevent registration of dealings forbidden by the caveat until notice is given to the caveator so that he or she has an opportunity to oppose such registration. 70        In this regard we also note Prof Tan’s persuasive argument for a broader interpretation of the term “interest” under s 115 of the LTA to at least include a purchaser’s rights under a conditional contract. This is notwithstanding the fact that such conditional rights are not recognised as equitable interests. InPrinciples of Singapore Land Law([41]supra), Prof Tan states at p 262: Conditional contracts are not uncommon. From a policy point of view there is much to be gained for including the rights of a purchaser under a conditional contract as capable of sustaining a caveat under section 115 of the LTA. The caveat has been said to be a statutory injunction restraining the Registrar from registering a subsequent dealing without giving the caveator a chance to substantiate his claim. Therefore, to require the purchaser first to obtain an injunction before he can lodge a caveat, would seem to be duplicating the caveat’s function in the context of a conditional contract. 71        The practical problems that could arise if a narrow view is taken as to the meaning of the term “interest in land” for the purposes of lodging a caveat were highlighted by Phang J inNovel Ho([46]supra), where he said at [62]: If, indeed, a caveat can only be lodged at that particular point in time [upon the occurring of the triggering event], there is the distinct possibility that the party who possesses a right of first refusal might lodge his or her caveat too late. To take one obvious example, the owner (and grantor of the right of first refusal) could have simply sold the property to a third party, who would probably be ignorant of this rightsimply because it had not been the subject of a caveat yet. … [G]iven the uniqueness of land, the holder of a right of first refusal might well consider a contractual remedy in damages to be inadequate – hence, the possible remedy of an injunction or even specific performance … suggests that a right of first refusal is in factmorethan just a mere contractual right. [emphasis in original] 72        It is perhaps also of interest to note that in the early case ofManchester Ship Canal Company v Manchester Racecourse Company[1900] 2 Ch 352 at 366, Farwell J in fact held that the right of first refusal created an interest in land. On appeal, while the Court of Appeal expressly disapproved of the opinion of Farwell J, it did also say that the holder of the right of first refusal could ask for the issue of an injunction to prevent that right from being disregarded (see [1901] 2 Ch 37 at 51). It would also be recalled that it had been stated inElements of Land Law([53]supra) that “there remains a strong argument that potential disponees of land deserve, in fairness, to be forewarned of all sale arrangements affecting the estate which they propose to buy” (see [53] above). 73        It is quite clear that, unless the holder of a right of pre-emption is recognised as having a sufficient interest to lodge a caveat, more often than not, by the time he comes to know of the breach by the owner it would be too late for him to exert or protect his rights over the property. In terms of priority in equity, the English Court of Appeal inTiffany Investments([43]supra) unanimously decided (at [54]) that in the event of there being a contravention of the right of pre-emption, the holder of the right was to be regarded as having an equitable interest commensurate with that of a purchaser under a binding contract, which equitable interest would have priority over the rights of the person to whom the owner had, in breach of the covenant, sold the property to. But this is still little comfort to a holder of a right of pre-emption. Unless the holder of such a right is entitled to lodge a caveat, he would not be able to protect his right if he cannot show that the subsequent purchaser (of the legal interest) was notbona fideand had bought with notice of the holder’s right of pre-emption. Further, he may well lose priority if a third party with an equitable interest later in time lodges a caveat ahead of him, as ss 49(1) and 49(2) of the LTA provide that: (1)        Except in the case of fraud, the entry of a caveat protecting an unregistered interest in land under the provisions of this Act shall give that interest priority over any other unregistered interest not so protected at the time when the caveat was entered. (2)        Knowledge of the existence of an unregistered interest which has not been protected by a caveat shall not of itself be imputed as fraud. 74        It is therefore wholly illogical that a holder of a right of pre-emption may lodge a caveat only after a triggering event as, by then, a caveat would probably have already been lodged by the third-party purchaser whose actions triggered the said event. The net result is that unless the holder of a right of pre-emption is entitled to lodge a caveat by virtue of that right itself, there is little that he can do to effectively protect his interest in the property. 75        It is settled law that a simple option constitutes an equitable interest sufficient to lodge a caveat. What then differentiates a right of pre-emption from that of a simple option such that the holder of a right of pre-emption should not be similarly treated? InPritchard v Briggs([43]supra) at 418, Templeman LJ said: Rights of option and rights of pre-emption share one feature in common; each prescribes circumstances in which the relationship between the owner of the property which is the subject of the right and the holder of the right will become the relationship of vendor and purchaser. In the case of an option, the evolution of the relationship of vendor and purchaser may depend on the fulfilment of certain specified conditions and will depend on the volition of the option holder. If the option applies to land, the grant of the option creates a contingent equitable interest which, if registered as an estate contract, is binding on successors in title of the grantor and takes priority from the date of its registration. In the case of a right of pre-emption, the evolution of the relationship of vendor and purchaser depends on the grantor, of his own volition, choosing to fulfil certain specified conditions and thus converting the pre-emption into an option. The grant of the right of pre-emption creates a mere spes which the grantor of the right may either frustrate by choosing not to fulfil the necessary conditions or may convert into an option and thus into equitable interest by fulfilling the conditions. 76        This question was also examined extensively by Phang J inNovel Ho([46]supra) at [88] to [96]. Although in both situations, the interest of the holder of the right of first refusal and that of the option holder are contingent, in the former case, there are double contingencies (the triggering event and the decision of the holder of the right to buy the property) while in the latter case, there is only a single contingency (exercising the option). It has been suggested that the critical difference lies in the fact that in the former case the triggering event depends on the volition of the owner of the property and not the holder of the right of pre-emption. But why should that difference be so significant? The fact remains that both are contingent interests, so should the precise reasons for the contingency be relevant in relation to the issue of whether a caveatable interest is created? Perhaps, there is really a need to start from first principles. Why is it that the law should treat land so differently from other matters or objects? Basically it has all to do with the fact that land is unique and may not be replicated. Logically, therefore, if a right of pre-emption relates to land, it should receive the same treatment as an optionsimpliciter. 77        Further, to suggest – that if the law were to treat a right of pre-emption as being a caveatable interest it would lead to the register being cluttered up with all kinds of interests lodged thereon – would be a gross exaggeration, as we cannot imagine how, realistically and in good conscience, more than one unqualified right of pre-emption can be granted over a property by its owner. And even in instances where multiple qualified rights of pre-emption were to be granted, the second person accorded such a right would have his right subject to that of the holder of the first right, and it is only fair that the first person accorded such a right be given the first opportunity to exercise the same upon the occurrence of a triggering event. Clearly, recognising the caveatability of such a right would prevent unnecessary controversies from arising involving the new purchaser and would also prevent the owner from reneging on his commitment. 78        A flaw in the reasoning of Templeman LJ inPritchard v Briggswould appear to lie in his Lordship having regarded the holder of a right of pre-emption as being “in much the same position as a beneficiary under a will of a testator who is still alive, save that the holder of the right of pre-emption must hope for some future positive action by the grantor which will elevate his hope into an interest” (at 418). We find it difficult to see how it could be right to equate the holder of a pre-emption right with that of a beneficiary under a will of a testator who is still alive and kicking. A living testator is free at any time to remove a person as a beneficiary in his will but the owner of a property has no such liberty in relation to the holder of the pre-emption right. Of course, we recognise that whether a right of pre-emption may be converted to a real option depends on the determination of the owner but the holder of that right is certainly not in quite the same position as a person named as a beneficiary in the will of a living testator. 79        Having regard to all of the above, we are in agreement with Phang J’sdictainNovel Hoin so far as that a right of pre-emption should be recognised, without more, as an interest in landfor the purpose oflodging a caveat under s 115 of the LTA. In particular, we agree with Phang J that such an approach would be consistent with the purpose and function of a caveat, and that it would be fair, logical and commonsensical to allow a person with a pre-emption right over a defined piece of unique property to lodge a caveat over that property. This would avoid a situation where a pre-emption right is defeated by the stealth assignment of the legal interest or by way of s 49 of the LTA without the holder of the right having first the opportunity to invoke the court process to give effect to his right. While such a conclusion might at first blush be interpreted by some as giving undue “proprietary” reach to a “personal” right, we should nevertheless be mindful of the fact that a contractual restraint on land has long been recognised as one that is susceptible to injunctive relief (see [45] above). As also noted by Prof Tan, it would be duplicative to require a conditional purchaser to first obtain an injunction before he can lodge a caveat (see [70] above). By analogy, the same would apply to a holder of a pre-emption right. Moreover, a right of pre-emption is akin to a restrictive covenant as it gives the holder a negative right over the subject land, an important feature of a restrictive covenant. Indeed, the learned authors ofMegarry & Wade,The Law of Real Property(Sweet & Maxwell Limited, 6th Ed, 2000) at para 12-063, have expressed the view that a right of pre-emption is capable of binding successors in title as a restrictive covenant if the rules for the creation of such covenants are obeyed. However, we would hasten to add that this was doubted by Lightman J inUniversity of East London Higher Education Corpn v Barking and Dagenham London Borough Council[2005] Ch 354, who said at [28] of his judgment that “a restrictive covenant is concerned with restricting the use of land, and not with restraints on alienation”. 80        Nevertheless, a right of pre-emption is undoubtedly a right concerning land and there is no logical reason why it should not be treated as an interest in land for the purposes of s 115 of the LTA. In our view, a contingent interest such as the present is no less an interest because it remains a clog on the rights of the owner to deal with the property. All in all, we do not see any real downside to taking this progressive approach, an approach which was espoused more than a hundred years ago by Farwell J (see [72] above) and later followed by Walton J inPritchard v Briggs(see [51] above). 81        In the result, we are of the view that the new SC3 (and the original SC3 too) which accords the appellant the right to repurchase the disputed property in the event of any dealings contrary to the clause, is capable of sustaining a caveat. However, the caveat lodged in the present case was based on the original SC3 and was in the following terms: INTEREST CLAIMED [T]he Caveator claiming an ESTATE OR INTEREST in the land as Purchaser CONSIDERATION DETAILS [A]n undertaking by the Registered Proprietor pursuant to a Sale and Purchase Agreement dated 26 March 1982, not to sell, transfer or otherwise dispose or part with possession of the within land, except only to the Caveator at the price of S$100,000.00 82        Quite clearly the defect is not a minor one of form but goes to the very foundation upon which the caveat was lodged. The terms of the original SC3 and the new SC3 are different. InAlrich Development Pte Ltd v Rafiq Jumabhoy([68]supra), this court held (at 453, [45]) that a caveat lodged should not be struck out “for some minor defect of form”. It also stated (at 453, [44]) that “[s]o long as the terms of the caveat [give] a fair indication of what estate or interest the caveator claims and the ground of his claim” that should suffice. On this test, the caveat lodged must be removed. This is because the basis for the lodgment of the caveat was entirely wrong and moreover the scopes of the two undertakings are quite different. Nevertheless, there is nothing to preclude the appellant from lodging a fresh caveat on the correct basis. 83        That said, we do not see any necessity in the present appeal to consider the more general question of whether a right of pre-emption constitutes a full-fledged equitable interest at the time of its grant. This is therefore not the occasion to consider all of the reasoning inNovel Ho([46]supra), in particular theobiter dictainclining towards recognising a right of pre-emption as an equitable interest. While it may very well be the case, nevertheless, we think we should pay heed to the observation of the Federal Court of Australia inOctra Nominees Pty Ltd v Chipper[2007] FCAFC 92at [56], where it said: Considerable caution needs to be exercised when it is sought to convert an in personam contractual promise into what amounts to a new form of property right enforceable against third parties …",
        "Conclusion": "84        For the foregoing reasons, the appeal is dismissed. However, as the appellant has succeeded on the issue that a right of pre-emption constitutes a caveatable interest as well as the issue relating to condition subsequent, we would only award the respondent one-third of the costs of this appeal, with the usual consequential orders. The appellant shall have the costs in relation to the respondent’s unsuccessful application to admit fresh evidence. [note: 1]See Core Bundle vol II at p 123.[note: 2]See Record of Appeal vol III at p 339."
    }
}