{
    "case_title": "Chua Teck Chew Robert v Goh Eng Wah",
    "ncitation": "[2009] SGCA 40",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       These cross-appeals were filed by Goh Eng Wah (“Goh”) and Robert Chua Teck Chew (“Robert Chua”) (the plaintiff and the 3rd defendant respectively in Suit No. 742 of 2005/L below (“the Suit”) against the decision of the trial judge (“the Judge”) inGoh Eng Wah v Daikin Industries Ltd and others[2008] SGHC 190(“GD”). In the Suit, Goh claimed against Robert Chua and four other parties in contract for the shortfall in profit due to him as a shareholder of Daikin Airconditioning (Singapore) Pte Ltd (the 2nddefendant in the Suit, formerly known as A.C.E. Daikin (Singapore) Pte Ltd) (“Daikin Singapore”). Goh succeeded in his claim against Robert Chua but failed in his claims against the other defendants. Robert Chua appealed in Civil Appeal No 192 of 2008 (“CA 192”) against the Judge’s decision to hold him liable for the short-payment made to Goh, while Goh appealed in Civil Appeal No 197 of 2008 (“CA 197”) against the Judge’s dismissal of his claim against Daikin Industries Limited (“Daikin Japan”) (the 1st defendant in the Suit) and her refusal to order Robert Chua to pay the costs of the other successful defendants. 2       At the conclusion of the hearing of the appeals, we partially allowed the appeal in CA 192 to the extent that we held that limitation applied to Goh’s claim and capped it at $332,334 plus interest at 6% reckoned from the dates the various sums were due to Goh. We also partially allowed the appeal in CA 197 by ordering that Robert Chua should bear half the costs of the first and second defendants (i.e. Daikin Japan and Daikin Singapore respectively) for the trial below. We now give the reasons for our decisions.",
        "Background": "",
        "The Parties": "3       Goh and Robert Chua’s father, Chua Joon Nam (“CJN”), were good friends. In 1968, Goh, CJN and Robert Chua founded Daikin Singapore. They were its initial subscribers and directors. Goh was named the Chairman, CJN the Managing-Director and Robert Chua, the Executive Director. Goh’s role was essentially that of a financier. He left the running of Daikin Singapore’s day to day affairs to CJN and Robert Chua. In 1972, Daikin Japan appointed Daikin Singapore as its sole distributor in Singapore.",
        "The facts leading up to the creation of an Incentive Scheme agreement between the parties": "4       The incentive scheme agreement (“Incentive Scheme”) which was the subject of the dispute between the parties was, in a sense, precipitated by Daikin Singapore’s ill-fortunes. In 1972, one Cheng Eng Kuan (“Cheng”) was persuaded by CJN to subscribe for 250,000 shares in Daikin Singapore. As a result, Cheng held 50% of Daikin Singapore’s shares. Cheng’s involvement saw Daikin Singapore invest in the manufacturing of window air-conditioners in Indonesia. Cheng later transferred his shares in Daikin Singapore to his brother Chong Kam Sai (“Chong”). The Indonesian business failed. This unsuccessful investment, coupled with the oil crisis of the 1970s, caused Daikin Singapore to incur substantial losses. 5       In April 1976, help came in the form of Daikin Japan’s subscription of 135,000 shares in Daikin Singapore at $1 per share. This capital injection provided the latter with the needed funds and also aligned the interests of Daikin Japan with Daikin Singapore. Unfortunately, Daikin Singapore’s fortunes did not turn around and it continued to suffer losses. In May 1979, to aid Daikin Singapore, Goh infused more capital into the company by causing one of his companies, Kin Wah Co (Pte) Ltd, to subscribe for 375,000 shares in Daikin Singapore at $1 per share. In August 1980, Daikin Japan also subscribed for a further 340,000 shares at the same price. Despite these capital infusions, Daikin Singapore continued to perform dismally. 6       In 1981, Daikin Singapore decided to change its business by focusing on the supply of air-conditioners to the Singapore market following the Government’s decision to accelerate its public housing program. To obtain fresh capital, Daikin Japan was invited to become the majority shareholder by taking up 800,000 new shares. Daikin Japan accepted the invitation. Besides the injection of fresh capital, it was also envisaged that Daikin Japan, on becoming the majority shareholder, could provide financial support as well as liberal trade credit terms. In April that same year, Chong sold his 250,000 shares in Daikin Singapore to one Sim Boon Woo (“Sim”) who was CJN’s friend. 7       On 15 July 1981, an Extraordinary General Meeting was held in which Daikin Singapore’s shareholders voted to increase the company’s share capital. The existing shareholders were offered shares (800,000 in total)pro ratato their existing shareholdings. The shareholders (save for Daikin Japan), by agreement, declined to take up any of these shares. While the evidence on this was not consistent, the Judge found that there was such an understanding among the other shareholders not to take up their entitlement. Viewing the entire circumstances then, we thought the Judge was justified in making that finding. Daikin Japan accordingly acquired all 800,000 shares. Following this change, the shareholding structure in Daikin Singapore became as follows: Before Daikin Japan acquired majority stakeAfter Daikin Japan acquired majority stakeShareholderNumber ofshares% shareholdingNumber ofshares% shareholdingCJN andaffiliatesCJN255,00015.9375255,00010.625Chuas Investment Pte Ltd95,0005.937595,0003.96Robert Chua15,0000.937515,0000.625Chua Teck Meng15,0000.937515,0000.625Goh andaffiliatesGoh90,0005.62590,0003.75Eng Wah TheatresOrganisation Pte Ltd30,0001.87530,0001.25Kin Wah Co (Pte) Ltd375,00023.4375375,00015.625Sim Boon Woo250,00015.625250,00010.42Daikin Japan475,00029.68751,275,00053.125 8       After Daikin Japan’s subscription of the additional 800,000 shares, the shareholding of CJN and his affiliates was (in round numbers) reduced from 24% to 16% and that for Goh and his affiliates, from 31% to 21%. Daikin Japan, with a 53% stake, had thus assumed majority control. It then appointed nominees as Managing Director (“the nominee MD”) and sales Director (“the nominee Sales Director”). The nominee MD was made a mandatory cheque signatory to Daikin Singapore’s cheques. Daikin Japan also took over the responsibility of procuring financing for Daikin Singapore. However, CJN and his two sons, Robert Chua and Chua Teck Meng (the 4th defendant in the Suit), continued to manage Daikin Singapore. It was clear to us that the reason (as stated above at[6]) why the other shareholders of Daikin Singapore wanted Daikin Japan to be its majority shareholder was so that Daikin Japan would give Daikin Singapore more financial and technical support and liberal trade terms, which were needed badly to turn the latter around.",
        "The Incentive Scheme": "9       On the very same day of the Extraordinary General Meeting, (i.e. 15 July 1981), Daikin Japan entered into a Memorandum with CJN (“the Memorandum”). The object of the Memorandum was to motivate and encourage local shareholder directors and officers and staff of Daikin Singapore to give of their best, and it was subsequently varied by an undated variation recorded on the same document. The Memorandum formed the basis of the dispute between the parties. In the court below, the Judge seemed to think that the incentive set out in the Memorandum was a part of the understanding reached in relation to Daikin Japan becoming the majority shareholder of Daikin Singapore. 10     Under clause 1 of the Memorandum, 15 percent of Daikin Singapore’s net profits before tax (“net profits”) were to be allocated to its local directors as remuneration and this included bonuses to the company’s main officers and qualified staff. The allocation was to be decided by CJN. The undated variation changed this so that 5 percent each was to be allocated to Goh and CJN. CJN was to decide the allocation of the remaining 5 percent amongst the other 3 local directors and selected staff. 11     Clause 2 of the Memorandum limited the allocation to S$1 million net profits. It stipulated that for net profits in excess of S$1 million, the parties would negotiate on the allocation. Pursuant to clause 2, Goh, in his capacity as Chairman, wrote to a Mr. T. Morimoto (“Morimoto”) who was a director of Daikin Japan to negotiate for the allocation of net profits in excess of S$1 million. In a letter dated 16 September 1983, which Goh signed, he proposed that net profits in excess of S$1 million be allocated as follows: (a)     Next S$2 million net profits – 12.5%; and (b)     Over S$3 million net profits – 10%. 12     Morimoto replied in a letter dated 14 November 1983 and proposed that the applicable percentage in respect of the portion of the net profits in excess of $1 million would be 7.5%. Subsequently, the profits were distributed in accordance with Morimoto’s counter-offer.",
        "Subsequent changes to the shareholding and management of Daikin Singapore": "13     In October 1983, Sim sold his shares in Daikin Singapore to Chuas Investment Private Limited. With this sale, the shares in Daikin Singapore were thus held by Daikin Japan, Goh, CJN and their affiliates. 14     In 1987, Daikin Japan wanted greater management involvement in Daikin Singapore and caused some Board changes to be made. Goh resigned as Chairman and became the Vice-Chairman, while CJN instead became the Executive Chairman. Goh’s son, Goh Keng Soon, who was a director since 1979, resigned. The Board was enlarged to nine directors with five nominated by Daikin Japan. Of these five, two were executive directors,i.e., the nominee MD and the nominee Sales Director. 15     CJN passed away on 17 September 1989. Thereafter, Robert Chua assumed the role of Chairman in place of CJN while Chua Teck Meng continued as executive director. Another one of CJN’s sons, Chua Tiak Seng Charlie (“Charlie Chua”) (the 5th defendant in the Suit), became an executive director in 1990 and also partook in the Incentive Scheme. 16     It was not disputed that from 1982 to 1989, while CJN was still alive, both Goh and CJN each received one-third of the portion of Daikin Singapore’s profit that was set aside for allocation under the Incentive Scheme, save for a small underpayment of $167 which was probably attributable to mathematical rounding down of the figures. Thus in respect of the 15% of the first S$1 million net profit before tax set aside under the Memorandum, Goh and CJN each received 5% in accordance with the Memorandum. For the portion of the net profits above S$1 million where 7.5% of it was set aside for allocation, Goh and CJN would each receive a third of it,i.e., 2.5%.",
        "The Dispute": "17     From 1992 to 2001, Goh received less than a third of the profits which was due to him. This can be seen from the table below which sets out the amounts distributed to the directors from 1990 to 2002:  YearGohCJNRobert ChuaPhilip ChuaCharlie ChuaS$%S$%S$%S$%S%%1990132,00033.3366,00016.67108,90027.5089,10022.50--1991163,00033.33--147,00030.06120,00024.5459,00012.07199283,00031.80--76,00029.1262,00023.7540,00015.33199383,00031.09--77,00028.8464,00023.9743,00016.10199490,18027.00--103,54031.0083,50025.0056,78017.00199524,00015.00--57,60036.0046,40029.0032,00020.00199645,0009.91--174,00038.33130,00028.63105,00023.13199750,0007.75--260,00040.31180,00027.91155,00024.03199850,0005.91--350,00041.37236,00027.90210,00024.82199938,0005.29--300,00041.78200,00027.86180,00025.07200028,0005.31--220,00041.75147,00027.89132,00025.05200135,0005.31--275,00041.73184,00027.92165,00025.04200296,66733.33--------   18     In 2002, disagreements over how Daikin Singapore should be managed and whether the Incentive Scheme should be replaced led to Daikin Japan requesting for the Chua brothers to resign from the Board. The Chua brothers in turn sued Daikin Japan and Daikin Singapore for,inter alia, compensation for loss of office. After negotiations, Daikin Japan agreed to buy out the shares of the Chua brothers and Chuas Investment Pte Ltd and the legal proceedings were then discontinued. Later, Goh was also approached to sell his shares to Daikin Japan. In the course of negotiations, Goh requested for information and documents concerning payments made to him under the Incentive Scheme. He noted the discrepancies in the payments he had received and obtained a court order for access to and inspection of Daikin Singapore’s accounts. The inspection confirmed the shortfalls in the incentive payments made to him from 1992 to 2001. He thus brought a claim against Daikin Japan, Daikin Singapore and the Chua brothers to recover $1,097,653 which was the aggregate of the shortfalls due to him in respect of the year 1985 (the $167) and the period from 1992 to 2001.",
        "The Judge’s decision": "19     The Judge accepted that the Memorandum, its subsequent undated variation and the subsequent letter correspondence set out the Incentive Scheme for payments. She also found that this agreement on the Incentive Scheme, as we have indicated at[9]above, was part of the understanding to persuade Goh, CJN and their affiliates to refrain from taking up the new shares to which they were entitled,pro rata, to their then existing shareholdings. In other words, the Incentive Scheme was an inducement for the local shareholders of Daikin Singapore to allow Daikin Japan to become the company’s majority shareholder. 20     The Judge also found that after CJN’s death, Robert Chua assumed his father’s role of allocating the profits in accordance with the Incentive Scheme. She characterised this as a “contractual duty to allocate one-third of the profits available for distribution to [Goh] under the terms of the Incentive Scheme” and held that Robert Chua had breached this duty for which he was liable. 21     As for Daikin Japan, Chua Teck Meng and Charlie Chua, whom Goh had also sued for the breach, the Judge found that under the arrangement, there was no contractual obligation on their part to ensure that Goh receive his share under the Incentive Scheme. She found that Daikin Japan had merely agreed to allow a certain proportion of Daikin Singapore’s profits to be distributed to the local officers whereas Chua Teck Meng and Charlie Chua, like Goh, were simply recipients of the amounts allocated to them. The Judge therefore dismissed Goh’s claims against them. The Judge also dismissed Goh’s claim against Daikin Singapore since she did not regard the latter as being a party to the agreement on the Incentive Scheme. 22     With regard to costs, the Judge awarded Daikin Japan and Daikin Singapore costs on a standard basis which were to be borne by Goh. Because the Chua brothers were jointly represented, she awarded Chua Teck Meng and Charlie Chua half their taxed costs. The Judge refused to order Robert Chua to bear or contribute towards the costs of Daikin Japan, Chua Teck Meng or Charlie Chua. She found that Goh’s case against Chua Teck Meng and Charlie Chua was weak and was not seriously pursued. Also, none of the other defendants had attempted to shift any blame onto them. As for Daikin Japan and Daikin Singapore, she regarded Goh’s case against them as being separate and distinct from that against the Chua brothers. The Judge therefore found it inappropriate for Robert Chua to have to bear or contribute to the costs awarded to Daikin Japan and Daikin Singapore. 23     Robert Chua appealed against the Judge’s decision to hold him liable for the shortfalls in the incentive payments made to Goh while Goh appealed against the Judge’s dismissal of his claim against Daikin Japan and her refusal to order Robert Chua to pay or contribute towards the costs of the successful defendants.",
        "Our decision": "24     We allowed Robert Chua’s appeal in part because we agreed with his contention that the defence of limitation would apply to Goh’s claims for the shortfall in incentive payments and that those payments due more than six years before the commencement of the action ought to be time-barred. We also allowed Goh’s appeal in part and ordered Robert Chua to bear half the costs of Daikin Japan and Daikin Singapore for the trial below. These grounds will only address the issues on which the appeals had been partially allowed.",
        "The defence of limitation": "25     Robert Chua argued, on appeal, that the Judge was wrong to have rejected his defence of limitation in respect of the shortfalls due more than six years before 14 October 2005, the date on which this action was instituted. In this regard Goh relied on s 6(1)(a) of the Limitation Act (Cap 163, 1996 Rev Ed) (“the Act”) which provides that actions founded on contract shall not be brought after the expiration of 6 years from the date on which the cause of action had accrued. On this basis, Robert Chua contended that the shortfall in payments for the years up to and including 1999 would be time-barred. The payment under the Incentive Scheme for Financial Year 1999 was made on 14 June 1999. Six years would have elapsed on 14 June 2005. Goh, on the other hand, argued that s 29(1) of the Act was applicable to postpone the limitation period because his right of action had been concealed by fraud on the part of Robert Chua. 26     The relevant part of s 29(1)(b) reads as follows: Postponement of limitation period in case of fraud or mistake. 29. —(1)    Where, in the case of any action for which a period of limitation is prescribed by this Act — ... (b)    the right of action is concealed by the fraud of any such person as aforesaid; ... the period of limitation shall not begin to run until the plaintiff has discovered the fraud or the mistake, as the case may be, or could with reasonable diligence have discovered it. 27     In order to be able to rely on s 29(1), Goh had to show that Robert Chua had fraudulently concealed his right of action. If, at some point, such deception could have been discovered with reasonable diligence, the period of limitation would begin to run. It is clear that fraudulent concealment is not limited to the common law sense of fraud or deceit. It includes unconscionability in the form of a deliberate act of concealment of a right of action by the wrongdoer or if he or she had knowingly or recklessly committed a wrongdoing in secret without telling the aggrieved party (seeBank of America National Trust and Savings Association v Herman Iskandar[1998] 2 SLR 265at [73] - [75]). 28     On the question of what would constitute “reasonable diligence”, one of the earliest cases which addressed this issue wasDenys v Shuckburgh(1840) 4 Y&C Ex 42. hat case concerned shares in certain mines which were given to a mother and her son. The deed which spelt out the son’s entitlement was in his possession all along. But he appeared to have been sleeping on it, with the document kept in his drawer throughout the period when he could have made his claim. Here, Alderson B said (at 52-53): …. Both Lady Charlotte (the mother) and the plaintiff (the son) had a right to receive, and did during all the time receive, a share in these rents and profits as tenants in common. Then this seems to me to fall expressly within the statute of Anne, which gives in such cases an action of account against the co-tenant in common who has received more than his share. … I am, therefore, of opinion that the plaintiff is entitled to an account, and I shall now proceed to consider from what time such account ought to go. The plaintiff contends that he has established that this receipt has been by mistake of fact, and that this is on the same footing as fraud, and prevents the operation, … of the Statute of Limitations … I agree in that conclusion, if the circumstances of the case warrant it. But here, it seems to me that the plaintiff had the means, with proper diligence, of removing the misapprehension of fact under which I think he did labour. He had in his power the deed on which the question turns; and, although it is perhaps rather obscurely worded, still I think he has allowed too much time to elapse not to be fairly considered as guilty of some negligence; …. 29     In the later case ofPhilip Henry Dean, the owners of the Europa v Thomas Richards, the owners of the late schooner Integrity(1863) 15 ER 803. similar judicial sentiments were expressed. This was an action which concerned two vessels known asEuropaandIntegritywhich were involved in a collision on 13 December 1859 resulting in the latter vessel being sunk. The owners ofIntegrityimmediately alerted their insurers who proceeded to do everything they reasonable could be expected to arrestEuropa. Unfortunately,Europacould not be located at the ports where it was supposed to turn up. It was finally arrested on 14thJanuary 1863. The fact that there were 8 vessels by the same name in the Mercantile Navy List for 1863 also compounded the problem for the insurers ofIntegrityand their agents. There were also allegations of false representation made by the Master ofEuropaon its actual port of call. At the High Court of Admiralty, the judge, Dr Lushington said at [11]– [15]: … the sole question, therefore, is, has there been ‘reasonable diligence’? …. However, what I have to decide is, whether what has been done constitutes reasonable diligence; and the meaning of such expression is not the doing of everything possible, but the doing of that which, under ordinary circumstances and with regard to expense and difficulty, could be reasonably required. I am of the opinion that the acts done by the Plaintiffs and their agents do constitute reasonable diligence; and I must decide accordingly. 30     The case went on appeal to the Privy Council which affirmed the decision of the Admiralty Court. On the issue of due diligence, Lord Wensleydale, delivering the judgment of the Privy Council, went on to underscore the point that the agents for the respondents had made every inquiry and exertion that was within their ordinary ability to ascertain. 31     Next is the case ofEcclesiastical Commissioners for England v North Eastern Railway Co(1877) 4 Ch D 845 where two juxtaposed collieries were being worked on simultaneously. One party complained that coal from his mine was taken by the other and he had no notice of it. Limitation was an issue as the alleged fraud was supposed to have been committed outside the usual limitation period. Malins VC said at 860–863: The law therefore is, I think, clearly settled that in cases of fraud the Statute of Limitations does not begin to run until the fraud is discovered; ….. it is now clearly by these authorities settled, in my opinion, that in all cases of fraud the time for barring the statute begins to run only from the time the fraud was discovered, or by reasonable diligence might have been discovered. Then it is said that in this case by reasonable diligence this fraud might have been discovered in 1864. Now this is a part of the argument of Mr Bristower which made the most serious impression upon my mind. He says these parties carried on a long negotiation from 1862 to 1864; it was known that in 1862 there had been a mistake as to the boundaries; the Hunwick Collieries had been worked very extensively ever since; and in 1864, by reasonable diligence, they might have discovered that these particular lands had been worked under by the neighbouring colliery. Now this depends a great deal upon the inquiry a man is bound to make. … Now was there anything to lead them to believe or suspect, or were they bound to suspect or to make inquiries as to whether these boundaries which had been so formally settled by the agents of the West Hartlepool Company in 1862 had been broken into or transgressed between 1862 and 1864? …. At the time, therefore, when this correspondence was taking place, one side knew undoubtedly. The agents of the Hunwick Colliery, which is the West Hartlepool Company, knew perfectly well that they had broken the bounds, that they had worked the coal …. Did they communicate that fact? That is not pretended. Did the other side know it? There is not a particle of evidence to shew they did. … Therefore, inasmuch as one party did know it, and might have communicated it and failed to do so, and the other party did not know it, I am of opinion there was nothing calling for inquiry on their part, and that there was no want of reasonable diligence in their not discovering, in 1864, that which they might have discovered. …. The case which Mr Bristowe relied on in support of his argument was the decision of the case ofDenys v Shuckburgh4 Y&C Ex 42 which I must say appears to me to lay down the very reasonable rule that you may maintain an action after the expiration of six years, if you did not know, or had not reasonable means of knowing, the fact. 32     A more recent case which touched on the point wasPeco Arts Inc v Hazlitt Gallery Ltd[1983] 1 WLR 1315 (“Peco Arts”), a decision which was considered by the Judge. InPeco Arts, a buyer of an artwork relied on the skill and expertise of the owner of an art gallery who told her that the artwork was authentic. It turned out to be a reproduction. The court held that it was not unreasonable of her not to have undertaken any independent evaluation. Webster J said, at 1323: … reasonable diligence means not the doing of everything possible, not necessarily the using of any means at the plaintiff’s disposal, not even necessarily the doing of anything at all; but that it means the doing of that which an ordinarily prudent buyer and possessor of a valuable work of art would do having regard to all the circumstances, including the circumstances of the purchase. 33     All these cases had laid down fairly clear guidelines as to what constitutes reasonable diligence. As rightly pointed out by Webster J inPeco Arts(at 1322), “it is impossible to devise a meaning or construction to be put upon those words which can be generally applied in all contexts”. As such, at the end of the day, much would depend on the fact situation of each case. We would hasten to add that the Judge had clearly recognised this (see GD at [131]). 34     However, on examining the circumstances of this case, we had to respectfully differ from the Judge’s finding that Goh had exercised reasonable diligence and was entitled to rely on s 29(1) of the Act to postpone the period of limitation. The Judge held (at [127] of the GD) that Robert Chua “had recklessly, if not knowingly, reduced the incentive payments made to the [Goh] contrary to the terms of the Incentive Scheme”. In our view, even if Robert Chua had intended to fraudulently conceal Goh’s rightful entitlement under the Incentive Scheme, the critical question that still had to be answered was whether Goh could have, with reasonable diligence, discovered the short-payments. For the following reasons, we had concluded that he could. 35     Goh was aware of how much he was receiving by way of incentive payments. He had acknowledged receipt of the payments on the payment vouchers. Further, Daikin Singapore’s profits, on which the incentive payments were based, were made known at the company’s Annual General Meeting (“AGM”) which either Goh or his personal representative had attended. Having sight of those figures, Goh ought to have realised that the incentive payments which he was receiving were not in order and he should have embarked on an inquiry. In this regard, Goh’s counsel’s contention of discrepancies in the profit figures announced and those which were used to calculate the incentive payments failed to persuade us that Goh was not to be put on inquiry. First, while we recognised that there could well be some force in this argument in respect of the earlier years in which the shortfalls were not that significant, for the later years, say for the years 1996 to 1998, when Goh was paid so very little, any discrepancy in the profit figures announced at the AGMs and those used to calculate the incentive payments, would not have sufficiently explained why Goh was only getting that little and that would have prompted any reasonable person to start asking questions and the truth would then have surfaced. For example, for the years 1997 and 1998, Goh was only paid $50,000 for each year. Bearing in mind that Goh was entitled to 5% of the first million in profits before tax and 2.5% for profits in excess of that sum, he ought to have known that should Daikin Singapore have made more than $1 million in profits, he would have at least received $50,000 and if the profits were $2 million he would be entitled to $50,000 plus $25,000. For 1997 and 1998, Daikin Singapore’s profits before tax were well in excess of $6 million. Surely, Goh, as an experienced businessman, ought to have realised that something was amiss. He ought to have known that he should be receiving something much more than just $50,000 in respect of those years. The profit figures should have put him on inquiry. Here, we noted that the Judge found that Goh, though elderly, was an “experienced and capable businessman” who was “capable of and did look after his own interests”. 36     Second, and more significantly, there was evidence to suggest that the profit figures shown in the accounts presented at the AGM had already taken into account the payments to be made under the Incentive Scheme as those payments were treated as expenses.[note: 1]So to get the full picture as to the net profits of Daikin Singapore, the amounts deducted for incentive payments must be put back to obtain the figure for the net profits. This would only mean that the actual net profit figures would be larger than those presented at the AGM. This reinforces the point that if Goh had exercised reasonable diligence and questioned his miniscule payments, he would then have discovered what would have been his rightful entitlement. 37     Accordingly, we would respectfully disagree with the views of the Judge (expressed at [128] of the GD) that as the incentive payments were decreased very gradually from 1992, “the difference would have been impossible to notice on the basis of rough calculations”. Relying onPeco Arts, she said (at [131] of the GD) that the question was “whether a reasonable person in [Goh’s] shoes would assume that the profit incentive being allocated to him was correct”. Even if that was an assumption which an ordinary person in similar circumstances would make, he would surely, upon seeing the profit figures, have realised that he had not been given his due share or have been put on inquiry. It is pertinent to bear in mind that the financial statements of Daikin Singapore were given to Goh well before the AGM. One need not be a mathematical genius to realise something was amiss and it was not unreasonable to infer that Goh did not care much about the incentive payments. If that were the case, it would be quite different from saying that he could not, had he exercised due diligence, have discovered that he had not been paid his due. As could be seen from[32]above,Peco Artswas a different kind of a case as the facts there are clearly distinguishable. 38     Goh’s counsel had sought to explain that Goh might not have paid particular attention to the profit figures announced at the AGMs because Goh attended the meetings primarily for the good meal provided and the opportunity to catch up with friends. In that case, he could not be heard to argue that Daikin Singapore’s true state of affairs was concealed from him. As regards the fact that the statement of accounts, which set out the profit figures, were sent to Goh before the AGMs, Goh’s counsel candidly revealed that Goh did not even bother to read those letters and statements. These circumstances, to our mind, clearly showed that Goh had not exercised reasonable diligence and had he done so, he would have found out the true position and asserted his claim very much earlier. He could have discovered the existence of the allocation sheets stipulating the proportions in which the incentive payments were to be allocated to the different persons. 39     In view of the above, we found that even if we had assumed that Robert Chua had intended to fraudulently conceal Goh’s rightful entitlement and thus his right of action, which we did not think was the case as indicated in the preceding paragraph, the latter could have, with reasonable diligence, uncovered such alleged fraud as early as 1992, or latest by 1996, the year for which he should have received 33.33% of the allocated profits whereas he received only 9.9%. Not bothered or concerned is different from saying that Goh could not reasonably have uncovered the true position. We therefore allowed Robert Chua’s appeal to the extent that the defence of limitation applied to preclude Goh’s claim for the shortfall in the incentive payments which had become time-barred (i.e. those made in June 1999 and earlier).",
        "The costs order": "40     We now turn to CA 197 where Goh appealed against the Judge’s refusal to make a Sanderson order (seeSanderson v Blyth Theatre Co[1903] 2 KB 533) requiring Robert Chua to bear the costs of the successful defendants. The purpose of aSandersonorder (and likewise aBullockorder) is to avoid the injustice of a successful claimant having what he recovers in damages eroded by an order to pay costs to successful defendants whom it was reasonable for him, when he does not know which of the defendants to sue, to join (seeIrvine v Commissioner of Police for The Metropolis and others[2005] C P Rep 19 at [22]). In deciding whether to grant aSandersonorder, the court’s principal consideration is whether it would be fair and reasonable for the unsuccessful defendant to bear the costs of the successful defendant(s) (seeDenis Matthew Harte v Dr Tan Hun Hoe & Gleneagles Hospital Ltd[2001] SGHC 19at [7] (“Harte”)). 41     One of the factors for the court’s consideration is whether the unsuccessful defendant had tried to shift blame to the other defendants (Harteat [11]). This factor is of particular relevance in this appeal. Robert Chua had repeatedly tried to lay blame for the shortfall in incentive payments on Daikin Japan and Daikin Singapore. He averred in his Defence (Amendment No. 3)[note: 2](“Robert Chua’s Defence”) that he had onlyrecommendedthe proportions in which to allocate the incentive payments in his capacityas an officer of Daikin Singapore. Robert Chua also emphasised in his Defence that the incentive payments were made “directly from [Daikin Singapore].”[note: 3]He also asserted that his “recommendations” werealwayssubject to final approval by Daikin Japan’s Nominee MD. 42     On the other hand, Daikin Singapore, in its Defence (Amendment No. 2),[note: 4]stated that Goh had left it to CJN and subsequently Robert Chua to allocate the incentive payments and as such had acquiesced in the allocations made by CJN and later Robert Chua. Daikin Japan, in its Defence (Amendment No. 4),[note: 5]denied being in charge of determining the allocation amounts and averred that the distribution was solely decided by CJN and then Robert Chua. 43     Throughout the trial and in closing submissions,[note: 6]Robert Chua continued to maintain the position that Daikin Singapore and Daikin Japan were to be blamed for the shortfall in payments. Daikin Singapore and Daikin Japan in the course of the trial and in their closing submissions[note: 7]likewise continued to deny responsibility and pinned the blame wholly on Robert Chua. Daikin Japan in particular accused Robert Chua of “shifting blame” to it.[note: 8] 44     From the above, it is clear that Robert Chua sought to pin the blame for the shortfall on Daikin Singapore and Daikin Japan and had continued to do so during the course of the trial. Daikin Singapore and Daikin Japan, in turn, pinned the blame on Robert Chua. In these circumstances, it was reasonable for Goh to have also sued Daikin Singapore and Daikin Japan. On appeal, while we did not have the benefit of hearing from Daikin Singapore’s counsel, counsel for Daikin Japan revealed that half of its work done was a result of it having to address Robert Chua’s allegations. In these circumstances, we found it just to order Robert Chua to bear half of Daikin Singapore and Daikin Japan’s costs at the trial below.",
        "Conclusion": "45     We allowed Robert Chua’s appeal (CA 192) in part with the result that Goh failed in his claims for the shortfall in the incentive payments up to and including the year 1999. With regard to Goh’s claim for the shortfall in the incentive payments for the years 2000 to 2001, we gave judgment for the sum of $332,334 which was to bear interest at 6% per annum from the dates on which the component sums were due. Since Robert Chua had only succeeded on this aspect and had failed in respect of the other grounds of appeal (i.e., that he should not be liable at all to Goh as neither Robert Chua nor Goh was a party to the Incentive Scheme, and the defences of waiver and estoppel) we made no order as to costs for this appeal. The security for costs of the appeal shall be returned to Robert Chua or his solicitors. 46     We allowed Goh’s appeal (CA 197) in part and ordered Robert Chua to bear half of Daikin Singapore and Daikin Japan’s costs at the trial below. As for the costs of this appeal, we ordered that Daikin Japan’s costs be borne two-thirds by Goh (as Goh had also sought to contend in the appeal that the court below was wrong to have held that Daikin Japan was not liable to him) and one third by Robert Chua. The usual consequential orders were to follow.  [note: 1]See Notes of Evidence, 9 May 2008, p 1530. [note: 2]CA 197 of 2008/L, Appellant’s Core Bundle at p 313, [32(b)]. [note: 3]Id. at p 312, [21]. [note: 4]CA 192 of 2008/L, Record of Appeal Vol II Part B at 475, [33]. [note: 5]CA 197 of 2008/L, Appellant’s Core Bundle at p 354, [16(c)]. [note: 6]CA 192 of 2008/L, Record of Appeal Vol VI Part B at 7088, [242] - [252]. [note: 7]CA 192 of 2008/L, Record of Appeal Vol VI Part A at 6941, [122] – [135] and 6852, [147] – [171]. [note: 8]CA 192 of 2008/L, Record of Appeal Vol VI Part A at 6856, [160]."
    }
}