{
    "case_title": "Kickapoo (Malaysia) Sdn Bhd and Another v The Monarch Beverage Co (Europe) Ltd",
    "ncitation": "[2009] SGCA 63",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This is an appeal against a part of the decision of the trial judge (“the Judge”) inThe Monarch Beverage Company (Europe) Ltd v Kickapoo (Malaysia) Sdn Bhd[2009] SGHC 55(“the Judgment”) which relates to a finding of trade mark infringement under the Trade Marks Act (Cap 332, 1999 Rev Ed) (“the Act”) as well as passing off under the common law. The respondent, The Monarch Beverage Company (Europe) Limited (“Monarch”), is an Irish company and the registered proprietor of two trade marks under “non alcoholic beverages and juices” in class 32 of the Nice Classification. The trade marks are, respectively, (a) “Kickapoo Joy Juice” (TM No T86/05341I) and (b) “Kickapoo” (TM No T86/05246G) (“the Kickapoo Marks”). The first appellant, Kickapoo (Malaysia) Sdn Bhd (“KM”), is a Malaysian company that was granted anexclusivelicence (“the Licence Agreement”) by Monarch’s predecessor – The Monarch Company Inc (“TMCI”)–in 1996 to produce and sell “Kickapoo Joy Juice” in cans and polyethylene teraphthalate (“PET”) bottles. The second appellant, Kickapoo Beverage Pte Ltd (“KB”), is KM’s Singapore subsidiary which assisted KM in the sale of Kickapoo beverages in Singapore. KM also subsequently appointed Heng Sheng Company (“HSC”) as its sole distributor in Singapore, and HSC was later taken over by Heng Sheng Corporation Pte Ltd (“HSCPL”). The sale of Kickapoo beverages is extremely important to KM because it accounts for close to 95% of its total business. 2       The Kickapoo Marks were first registered in the name of TMCI which later assigned all its business and rights in the trade marks to Monarch. Consequently, Monarch also took over the Licence Agreement between TMCI and KM. Although TMCI originally intended its business relationship with KM to be a long lasting one, the relationship between Monarch and KM soured after Monarch took over the Kickapoo Marks from TMCI. Determined to end their business relationship, Monarch served six termination notices on KM between December 2001 and June 2005. KM rejected the notices and affirmed the Licence Agreement. 3       On 20 September 2002, Monarch gave HSC a licence to produce and sell Kickapoo beverages in Shanghai. There was little effort to penetrate the Shanghai market with these beverages; these beverages were, instead, imported into Singapore for sale. Just three days after the Shanghai licence was granted to HSC, Monarch informed KM on 23 September 2002 that from 1 October 2002, the price of beverage bases supplied by Monarch to KM would be raised from the current price of USD$66.25 per gallon to USD$602 per gallon. The 1,000% price increase made it impossible for KM to produce Kickapoo beverages economically. Monarch was, nevertheless, obliged to supply beverages bases to KM under the Licence Agreement and KM responded by ordering a year’s supply from Monarch, amounting to approximately 1,000 gallons at the old price of USD$66.25 per gallon. Despite this order of 1,000 gallons, Monarch supplied KM with only 200 gallons. Under the Licence Agreement, KM was only permitted to use beverage bases supplied by Monarch or from other approved sources. Facing a shortage of beverages bases, KM turned elsewhere, and ordered beverage bases from BevTech International, which was not an authorised source under the Licence Agreement. These unauthorised purchases were arranged by one Mr Joseph Norman Stutz (“Stutz”) who was familiar with the original Kickapoo recipe and who was part of the TMCI team in the 1990s. Stutz subsequently also arranged for KM to purchase beverages bases from other unauthorised sources, including Tropical International (Bahamas) Limited (which owned Kickapoo trade marks registered in Bahamas and Barbados). Stutz gave evidence that the beverage bases from these unauthorised sources were, in point of fact, the same as that produced and supplied to KM by Monarch. 4       Monarch soon suspected that KM was purchasing beverage bases from unauthorised sources as it had stopped supplying KM with beverage bases and the beverage bases that they had previously supplied to KM were near the end of their expiry dates. On 24 November 2004, officers from the Malaysian Ministry of Health raided KM’s bottling plant in Seremban, Malaysia. The officers found unauthorised beverage bases on the premises. Subsequently, on 15 June 2005, Monarch terminated the Licence Agreement under cl 18A(4), which conferred on Monarch the broad discretion to terminate the Licence Agreement immediately by written notice if KM substituted the beverages bases in any way. After Monarch terminated the Licence Agreement with KM, it appointed HSPCL (which had taken over the business of HSC (see also above at[1])) on 15 June 2005 as its bottler and distributor in the Singapore market. Interestingly, HSCPL also concurrently ceased to produce Kickapoo beverages in China under the Shanghai licence. 5       On 14 February 2005, in a trap purchase, Monarch’s representative bought a PET bottle and a can from a supermarket, which items bore the Kickapoo Marks as well as the names of KM and KB. It was stated on the beverage containers with respect to these particular items that the beverage was produced under the authorisation of “The Monarch Company”. 6       Based on the above facts, Monarch initiated an action against the appellants for trade mark infringement and passing off, on the ground that they had already terminated the Licence Agreement. KM, however, maintained that it was still Monarch’s licensee and counterclaimed against Monarch for breach of contract in not supplying beverage bases which KM had ordered (see above at[3]). KM also counterclaimed against Monarch and four other defendants under the tort of unlawful conspiracy, alleging that the latter had collectively conspired to run KM out of business and cause it damage.",
        "The decision below": "7       On the claim for trade mark infringement by Monarch, KM and KB did not plead any established defences to such infringement under the Act (see the Judgment at [29]) and the Judge rejected their defence to the effect that they were forced to use unauthorised beverage bases so as to mitigate their loss (see the Judgment at [31]). On the claim for passing off, the Judge agreed with Monarch that, by selling beverages with the Kickapoo Marks, KM and KB had represented that their goods were licensed by Monarch and thus deceived the public by not “convey[ing] the true picture” (the Judgment at [36]). The elements of goodwill and damage under passing off had also been proved. 8       In so far as the counterclaims by KM and KB were concerned, the Judge held that the claim for breach of contract was made out because Monarch had unreasonably refused to supply 800 gallons of beverage base to KM, when the latter had ordered 1,000 gallons (see the Judgment at [70]). As for the counterclaim based on the tort of conspiracy, the Judge held that the unprecedented price increase of 1,000% was evidence that Monarch and the co-defendants had conspired to run the appellants out of business. The Judge was persuaded that the Shanghai licence “was a sham that was intended to cater for the Singapore market while KM was deprived of beverage bases [by Monarch]” (the Judgment at [88]).",
        "The present appeal": "9       The questions raised in the present appeal can be crystallised into two main issues: (a)     First, whether the appellants are entitled to be excused from trade mark infringement under s 27(1) of the Act on the ground of Monarch’s breach of contract (in not supplying the beverage bases) as well as on the ground that Monarch was a party to the tort of conspiracyvis-à-visthe appellants (“the First Issue”). (b)     Second, whether there was passing off on the basis of misrepresentation as to the quality of the beverages, authority and/or trade source (“the Second Issue”).",
        "Termination of the Licence Agreement": "10     Before we address the issues just mentioned, it is necessary to determine whether and, if so, when the Licence Agreement was validly terminated as this would have implications for some of the arguments raised by the appellants. The Licence Agreement, in fact, provided for termination in a number of ways: First, by mutual agreement; second, at any time by KM on 60 days’ written notice to Monarch; third, on 30 days’ notice by Monarch for a breach of the agreement by KM, provided that the notice will be null and void if the latter can remedy the breach within 15 days; and, fourth, by written noticeimmediatelyif KM substituted the beverage bases. Although Monarch issued a total ofsixtermination notices, for the same reasons as enunciated by the Judge in the court below (see the Judgment at [43]–[62]), we are of the view that the first five notices were ineffective in terminating the agreement. The only question, in our view, is whether using unauthorised beverage bases of the same quality can constitute substitution under the fourth ground of termination. The fourth ground of termination is to be found in cl 18A(4) of the Licence Agreement and it reads as follows:[note: 1] 18 A. This Agreement may be terminated only in the following manner: … (4)Immediately on written notice by [Monarch] in the event of [KM’s] intentional substitution in whole or in part of the base of any of the Licensed Trademark Beverages in any way or manner by [KM].Upon the receipt of such written notice, or in the event of [Monarch’s] notice that [KM’s] Licensed Trademark Beverages are not prepared in strict conformity with [Monarch’s] formulae, or are adulterated, [KM] agrees to discontinue immediately the sale and/or distribution of all Licensed Trademark Beverages not in conformity with [Monarch’s] formulae or which are in any way substituted or adulterated. [KM] acknowledges that its failure to so discontinue immediately will cause [Monarch] irreparable harm. … [emphasis added] 11     Even if the beverage bases are generic[note: 2](in the sense that the beverage bases obtained from the unauthorised sources are made from exactly the same formula as the bases supplied by Monarch), we do not see how this could prevent Monarch from terminating the Licence Agreement. This is because the broad ambit of the termination clause under cl 18A(4) does not differentiate between generic and non-generic bases and its width suggests that termination is possible so long as the beverage bases are unauthorised. Indeed, the clause specifically states that termination can be immediate so long as there is “intentional substitution” of the base “inany way or manner” [emphasis added]. Termination is thereforenotconfined only to a situation when the appellants substitute the beverage base with one which is completely different in quality from that supplied by Monarch. 12     When Monarch discovered that the appellants were using unauthorised beverage bases after the raid in Malaysia (see above at[4]), the former served a notice of termination on 15 June 2005 based on cl 18A(4). For the foregoing reasons, we find that the Licence Agreement was validly terminated, albeit only on 15 June 2005. 13     We will now turn to consider the specific issuesseriatim.",
        "The First Issue": "",
        "The parties’ respective cases": "27     Both parties focused their respective cases on the element of misrepresentation. This was not surprising because (as we shall elaborate upon below at[29]) the requirements of goodwill and damage in a passing off action are easily established on the facts of the present case. 28     The appellants contended that there was no passing off because the public “[had] not been misled or deceived as to the trade source of the beverages, which as a matter of law and fact, is [KM] for the duration of the [Licence Agreement]”.[note: 5]Further, it was argued, there had also been no passing off in relation to the quality of the beverages because KM had used the same beverage base and exercised the same quality control over the production of the beverages.[note: 6]Monarch however, argued that there had been passing off because there would be deception of the public to the effect that the Kickapoo beverages sold by the appellants had “originated”[note: 7]from Monarch although “the bases used to make such beverages were not obtained from [Monarch] or its approved sources”.[note: 8]",
        "Our decision": "29     It is trite law that a claim in passing off requires three elements to be satisfied,viz, (a) goodwill; (b) misrepresentation; and (c) damage. The only issue here is whether there is misrepresentation because the requirements of goodwill and damage are both readily satisfied on the facts. To elaborate, goodwill was conceded by the Chief Executive Officer of KM on cross examination (see the Judgment at [35]). By using unauthorised beverages bases beyond the control of Monarch, the appellants were also exposing Monarch to the risk of litigation, in the event that these unauthorised beverage bases turned out to contaminated or a risk to human health. This is a head of damage recognised by the Singapore courts, in cases such as the Singapore High Court decision of Caterpillar Inc v Ong Eng Peng[2006] 2 SLR 669(at [24]) and, most recently, in the decision of this court inMobil Petroleum Company, Inc v Hyundai Mobis[2009] SGCA 38(at [102]–[105]). There is no need for Monarch to show actual damage as such, the demonstration of aprobabilityof damage being sufficient (see the Singapore High Court decision ofNation Fittings (M) Sdn Bhd v Oystertec Plc[2006] 1 SLR 712at [173]–[176]). Misrepresentation as to Quality 30     Turning to the element ofmisrepresentation, we agree with the appellants that there was no misrepresentation as to quality. On the issue of quality, evidence was given at trial by Stutz, who was a consultant to TMCI and who was also personally involved in the creation of the formula for Kickapoo beverages (including its bases and mixtures) (see[3]above). 31     According to Stutz, the unauthorised beverage bases purchased were made with theoriginalKickapoo formula and they tasted the same as those supplied by Monarch. Monarch has not adduced any convincing evidence to rebut this or to demonstrate that the unauthorised beverage bases had a different taste from the beverage bases that it had supplied to the appellants. In the Singapore High Court decision ofYunnan Baiyao Group Co Ltd v Tong Jum Chew Pte Ltd[2003] 1 SLR 62, the court emphasised (at [12]) that in passing off cases of this sort, the difference in quality is an element which must be proved: InA G Spalding & Bros v A W Gamage Ltd(1915) 32 RPC 273, the defendant was selling an inferior ball, different in quality from the then newly famous “Orb” ball, and passing off the former as the latter. InColgate-Palmolive Ltd v Markwell Finance Ltd[1989] RPC 497, the defendants were selling a much different version of the plaintiff’s reknown Colgate toothpaste. The inferior version, intended for sale in Brazil, was lacking in fluoride, had a lower quality abrasive constituent, and contained preservative not present in the superior version. All that rendered the product distinctly different from that sold by the plaintiff in the United Kingdom…These cases maintain the proposition that one cannot pass off an inferior quality product as the superior one. But the difference in quality must be proved. The printing of expiry dates is only an indicia that the product has passed its shelf life, resulting in a deterioration of the product’s quality. Passing off in such cases is not about the diligence, or accuracy, in the printing of the expiry date, but of actual differences in quality.The difference is a fact that must be proved. [emphasis added] Misrepresentation as to Authority 32     While there might not have been any misrepresentation as to quality, we agree with Monarch that there was clearly a misrepresentation to the public that the drinks sold by the appellants were produced under the authorisation of Monarch. We need not look any further than the beverage labels themselves, which expressly stated that the drinks sold were under authorisation from the Monarch Company (see the Judgment at [25]). If the beverage labels merely represented to the public that the beverages were sold under licence from Monarch, then one could hardly see how there could have been any misrepresentation since the appellants did indeed have a subsisting licence from Monarch when the trap purchases were in fact made. 33     However, we do not think that this was all that the public would have perceived from the relevant information on the labels. An irresistible inference to be drawn from such a representation is that the constituent parts of the beverage (including the beverage bases) were also manufactured and sold under the authority ofMonarch. In other words, Monarch would be perceived, by the public, to have vouched for the quality of the drinks produced by the appellants. Yet, this could not be further from the truth since Monarch had, in point of fact,nocontrol over the manufacture of theunauthorisedbeverage bases. 34     Similarly, at the heart of some decisions involving authorised dealerships, is the idea that when goods are sold under authority (whether actual or purported), there is a ready inference that the quality of the goods sold is vouched for by the manufacturer or trade mark proprietor. Therefore, in the English Court of Appeal decision ofSony K K v Saray Electronics (London) Limited[1983] FSR 302(“Sony”), when a seller made unauthorised modifications to “Sony” products and sold them by misrepresenting to the purchaser that it was an authorised dealer, the court held that there was aprima faciecase of deception because the public would expect that a seller of Sony goods would be able to provide full-back up services (including the giving of a guarantee) in relation to the goods sold. By giving its customers the impression that it could provide full back up, the defendant was misrepresenting his position. In our view, implicit in an authorised dealership of this sort (together with the guarantee to be issued to the customer) is the understanding that goods sold under authority would be of a certain quality, and the manufacturer thereby agrees to make good (whether through the authorised dealer or otherwise), any shortfalls from this expected standard. As Lawton LJ observed inSony(at 306): Part of that evidence from persons unconnected with Sony's went to the effect that nowadays, when members of the public buy electronic equipment of the kind which Sony's manufacture and Saray's sell, they expect to get what might perhaps be called the full back-up of the manufacturers: that is to say, they expect the seller to be an authorised dealer, meaning thereby that he has been approved by the manufacturers and, in the case of Sony's, that he has had the benefit of training by Sony's; and, second, that the authorised dealer will be in a position to give on behalf of the manufacturers the kind of guarantee which Sony's give and which nowadays is common in support of the purchase of these kinds of goods. 35     In the same vein, in the Ontario High Court of Justice decision ofUnited States Surgical Corp v Downs Surgical Canada Ltd(1982) 67 CPR (2d) 140, the defendant misrepresented itself as an authorised dealer and sold, instead,reconditionedsurgical staplers of the manufacturer (which had been phased out) obtained fromunauthorisedsources which were not related to the manufacturer. By selling such surgical staplers using price lists that referred to the surgical staplers by the original identification numbers propounded by the manufacturer, the court held that a reasonable inference was that themanufacturer had vouched for the qualityof the reconditioned staplers; as White J put it (at [13]): A reasonable inference from reading these letters containing price lists is that these products are identical to the products manufactured by U.S.S.C. Thus there is evidence provided in these price lists from which a court might infer that the defendant was holding out that the products sold by it, were products the good quality of which was vouched for by U.S.S.C. and its Canadian exclusive sales representative Auto Suture Canada. All that would have been needed to have included in those letters to avoid that holding out was a caveat that the stapling guns and cartridge units offered for sale had not been received for sale by Downs from U.S.S.C. but from a third party source and that it should not be assumed that U.S.S.C. or their Canadian authorized sales representative Auto Suture Canada, vouched for the quality of what was offered for sale. [emphasis added] 36     It is therefore wholly irrelevant, in the context of the present proceedings, that the Kickapoo drinks (containing the unauthorised beverage bases) also happened to taste the same because we are here concerned with the loss of authority (by Monarch) over the beverage bases, and not with the fortuitous outcome that the unauthorised beverage bases would be consistently produced to the same quality each time. Once the appellants turned to unauthorised sources, the deceit (by the appellants) was clear. In the premises, we find that the element of misrepresentation is also satisfied in so far as the issue of authority is concerned. Misrepresentation as to trade source (1)    A brief history of trade mark licences 37     At this juncture, we should also comment on the appellants’ argument that there had been no deception as to trade source. The appellants cited the House of Lords decision ofScandecor Developments AB v Scandecor Marketing AB[2002] FSR 7(“Scandecor”) and Lord Nicholls of Birkenhead’s concept of an evolving notion of trade source as support for the argument that there cannot be misrepresentation as to trade source because the public associates Kickapoo drinks with KM and not with Monarch (it should be pointed out, parenthetically, that Lord Nicholls delivered the leading judgment inScandecor). Whilst this argument does not change the outcome of the passing off claim on the facts of the present appeal, some observations are in order because this argument raises interesting (and important) questions with respect to trade mark licences generally. 38     Before the Trade Marks Ordinance 1938 (Ordinance 38 of 1938) (“the 1938 Singapore Act”) was passed in Singapore, trade mark licences were generally not permitted because “it was thought that the function of a trade mark as a badge of origin or source would be lost if the mark is applied by someone other than the proprietor, even with his consent” (see Tan Tee Jim SC,Law of Trade Marks and Passing off in Singapore(Sweet & Maxwell Asia, 2nd Ed, 2005) (“Tan Tee Jim”) at para 9.23). The idea behind such a prohibition was that by licensing the trade mark for use by someone else, the public would be deceived and might therefore “buy something in the belief that it was the make of a man whose reputation they knew, whereas it was the make of someone else” (perEarl Loreburn in the House of Lords decision ofBowden Wire Ltd v Bowden Brake Company Ltd(1914) 31 RPC 385 at 392, and cited inTan Tee Jimat para 9.23). 39     Not surprisingly, then, as trade mark licensing became an indispensable part of the managing as well as the commercial exploitation of intellectual property rights, the focus turned to the “degree of control which a trade mark proprietor had to exercise over the activities of those using his mark with his permission, in order to prevent it from becoming deceptive” (see David Kitchinet al,Kerly’s Law of Trade Marks and Trade Names(Sweet & Maxwell, 14th Ed, 2005) (“Kerly’s”) at para 13-086). 40     Therefore, with the passing of the 1938 Singapore Act (derived from the Trade Marks Act 1938 (c 22) (UK)), the concept of aregistered userallowed “[a] person other than the proprietor of a registered trade mark” (Tan Tee Jimat para 9.27) (such as a licensee) to use the registered trade mark. However, the registration of aregistered userwas not automatic and depended on several conditions set out in s 38(4)(a) of the 1938 Singapore Act, one of which was to demonstrate the “particulars showing the degree of control by the proprietor over the permitted use [of the trade mark]”. Such control ensured that there would be “a trade connection between the registered proprietor of the trade mark and the goods sold under the trade mark by the purported licensee” (see Ng-Loy Wee Loon,Law of Intellectual Property of Singapore(Sweet & Maxwell, Revised Ed, 2009) at para 27.3.3, as well as the decision of this court inRainforest Coffee Products Pte Ltd v Rainforest Café, Inc[2000] 2 SLR 549). 41     With the enactment of the Trade Marks Act 1998 (Act 46 of 1998) (“the 1998 Singapore Act”) (which constitutes the modern regime of trade mark law today), the concept of theregistered userwasremoved. Singapore courts have, nevertheless, continued to require some element of supervision before a licence can be considered valid. In the Singapore High Court decision ofWeir Warman Ltd v Research & Development Pty Ltd[2007] 2 SLR 1073, for example, V K Rajah JA stated (at [65]) that it is trite law that “to establish the requisite trade connection for a valid trade mark licence, there must be at leastsomecontrol or supervision of the use of the trade mark by the purported licensee” [emphasis in original]. In theUK, however, theremovalof provisions pertaining to theregistered userspelt asignificant changeto the law on trade mark licences, especially after the House of Lords decision ofScandecor([37]supra). Let us elaborate. (2)    The decision ofScandecorand its relevance 42     InScandecor, a claim for revocation of the registered trade mark was made on the ground that the trade mark had ceased to be distinctive because of an absence of quality control over the licensee’s use of the trade mark. The House of Lords clarified that the absence of quality control in a bare exclusive licence does not, in and of itself, render the trade mark inherently deceptive so as to result in its revocation pursuant to s 46(1)(d) of the Trade Marks Act 1994 (c 26) (UK) (“the 1994 UK Act”) (which is the equivalent, in the local context, of s 22(1)(d) of the Act). According to Lord Nicholls, the 1994 UK Act essentially did away with the traditional view that the only trade source permissible resided in the trade mark proprietor alone (with the result that “[s]o long as the licensee used the mark subject to the quality control requirements of the owner, the law continued to view the mark as identifying the owner as the source of the goods” (see Neil J Wilkof & Daniel Burkitt,Trade Mark Licensing(Sweet & Maxwell, 2nd Ed, 2005) at para 6-61)). In removing theregistered userconcept as well as the need for a connection in the course of trade between the trade mark proprietor and the goods of the licensee, the 1994 UK Act envisioned that “the “source” of the goods under the mark can be either the owner or the licensee, depending upon the circumstances” (ibid). And, as Lord Nicholls observed inScandecorin relation to exclusive licences (at [36]–[38]): 36    Against this background I turn to the question whether the use of a mark by a licensee under a bare licence is objectionable as inherently likely to deceive. I shall confine my observations to exclusive licences. What is the message which a trade mark conveys today? What does a trade mark denote? It denotes that goods bearing the mark come from one business source: the goods of one undertaking, in the words of section 1(1) of the 1994 Act. That much is clear. But what does the mark denote about that source? Must the source be the proprietor of the trade mark? On this the Act is silent. But so to read the Act would accord ill with the statutory power to grant licences. And this interpretation would turn the clock back to 1905. Even under the 1938 Act the source was not so confined. Under the 1938 Act the source could be a registered user. 37    Or is the business source the person who is for the time being entitled to use the mark, whether as proprietor or exclusive licensee? I prefer this view. … 38    Thus, the wider interpretation, according to which the source may be either the proprietor or an exclusive licensee, would not be at variance with customers’ perceptions. Customers are well used to the practice of licensing of trade marks. When they see goods to which a mark has been affixed, they understand that the goods have been produced either by the owner of the mark or by someone else acting with his consent. 43     What was also noteworthy were the following views, also by Lord Nicholls, to the effect that that this modern approach towards trade mark licences neither sacrifices nor prejudices the interests of customers at all because logic and business sense tell us that it would always be in the commercial interests of the trade mark proprietors to exercise such form of control even if the law does not require it (Scandecorat [39]): For their quality assurance customers rely on the self-interest of the owner. They assume that if a licence has been granted the owner can be expected to have chosen a suitable licensee and imposed suitable terms. They also assume that during the currency of any licence the licensee, as well as the owner, is likely to have an interest in maintaining the value of the brand name. Customers are not to be taken to rely on the protection supposedly afforded by a legal requirement that the proprietor must always retain and exercise an inherently imprecise degree of control over the licensee’s activities. 44     In so far as it endorses a broader modern approach towards trade mark licences in general and trade source in particular,Scandecorhas potentially wide ramifications. While it was decided in the context of a revocation claim and is therefore most clearly relevant in proceedings relating to s 22(1)(d) of the Act, Lord Nicholls’s concept of a changing notion of trade source may have wider implications for the law ofpassing off. To elaborate, if one extends Lord Nicholls’s views to a situation of passing off, now that both the licensee and the licensor can be a legitimate trade source (depending on the facts), the manner in which the courts assess passing off when trademark licences are involved could, in fact, be redefined. Courts will now have to determine whom the public associates the goods with,ie, whether it is the licensee or the licensor. If the public associates the goods with the licensee, it would be more difficult to show that a licensee, against whom a passing off claim has been brought, has passed off his goods as coming from the trade mark proprietor. While not expressed in exactly these terms, this was essentially the appellants’ argument as well.[note: 9] 45     Lord Nicholls’s modern view of trade mark licences is clearly a commercially sensible one inasmuch as it reflects current business attitudes and practices. This would be the most apparent benefit in adopting his Lordship’s views. However, much caution should, in our view, nevertheless be exercised in arriving at a decision as to whether or not this court should adopt Lord Nicholls’s approach, not least because there has been no authoritative determination by the European Court of Justice (“the ECJ”) as the parties in this particular case (viz,Scandecor([37]supra)) settled their dispute even before it could be referred to the ECJ. Further, Monarch’s claim in passing off in the present proceedings does not (as we shall elaborate upon below at[52]) turn on this particular point, and we do not therefore need to express any conclusive views on the matter at this particular juncture. Most importantly, however, our reservations lie in the fact that the approach inScandecorraises more questions than answers, and the House of Lords have left most of these uncertainties unresolved. Let us elaborate. 46     First, there is the uncertainty as to what happens to thedistinctivenessof the trade markonce the exclusive licence concerned comes to an end. According to Lord Nicholls, if “the former licensee ceases to carry on the business in which he used the mark, no question of deception due to lack of distinctiveness will normally arise” because “the mark will [henceforth] be distinctive of one source, namely the proprietor of the mark” (Scandecorat [43]). However, a problem arises when the former licensee continues its business as usual. In such a situation, Lord Nicholls was of the view that “there may be scope for confusion and deception” because “[a]ny customers who were aware of the identity of the source during the licence period may continue to associate goods bearing the mark with the former licensee and his continuing business” (idat [44]). In arriving at his views, Lord Nicholls likened the position after the licence has ended (where the right to use the mark reverts to the proprietor of the mark) to the assignment of a trade mark, the former being “comparable to the position which arises when a trade mark is assigned without any assignment of the assignor’s business” (idat [43]). 47     However, as has been persuasively argued by Christopher Morcom in “Trade Marks Act 1994: Making Sense of Revocation” (2001) 23 EIPR 489, if an assignment of a trade mark would not render the mark liable to be revoked under s 46(1)(d) of the 1994 UK Act (which, it will be recalled, is the equivalent of s 22(1)(d) of the Act in the Singapore context), it is anomalous for Lord Nicholls to treat the position after termination of an exclusive licence differently; as the learned author pertinently observed (idat 491): The position being discussed is (as Lord Nicholls appeared to realise) in some ways analogous to that in which a registered trade mark is assigned and the assignor continues in the same business under a new trade mark. No doubt, following an assignment in such circumstances there could well be some deception or confusion among customers. But that would be a natural and expected consequence of an assignment. Would there nevertheless be a basis in the 1994 Act for revoking the assigned trade mark registration under section 46 (1) (d)? It is submitted that there would not. First of all the assigned mark would not, during the period of the assignor's ownership, have become liable to mislead the public, “in consequence of the use made of it by the proprietor or with his consent ...”. Even if as a result of the assignment there was some degree of confusion or misunderstanding among members of the public, it could not fairly be said that in consequence of the use by the new proprietor, the assignee the mark had become “liable to mislead the public” and that the registration should therefore be revoked. So to hold would make nonsense of the provisions of the Directive and the 1994 Act removing the earlier restrictions on assignment, and would be a result which Lord Nicholls does not appear to consider to have been intended. If that is so, it may be asked whether the position following the termination of an exclusive licence of a registered trade mark should be treated any differently. 48     Accepting Lord Nicholls’s view would also mean that in every case where a trade mark is licensed, the trade mark proprietor is at potential risk of having his trade mark revoked for lack of distinctiveness. In the words of Lord Scott of Foscote, “every grant of an exclusive licence would potentially put the mark at risk [of revocation]” and this “is easily the most difficult point in the case” and “perhaps, the most important, because a decision on the point may have legal and commercial implications for a wide variety of licensing arrangements” (seeScandecorat [65]). This has prompted the learned authors inTrade Mark Licensingto suggest that all licensors in the UK should protect themselves from such uncertainty by providing unequivocally “in the license agreement that the terminated licensee enjoys no further claim of goodwill in the mark or otherwise … the ex-licensee be identified as the source of the goods” (([42]supra) at para 6-66). 49     Secondly, the views expressed by Lord Nicholls are confined to bare exclusive licences (seeScandecor([37]supra) at [36] and [42]). This raises the question as to whether or not the same position applies to other types of licences such as a sole licence or a non-exclusive licence. For example, in the case of anon-exclusivelicence, because of the presence of multiple licensees, it would be very difficult for the views of Lord Nicholls to apply and for the public to associate the goods sold under the trade mark with only one single licensee. It has therefore been observed that the traditional view (of viewing trade source as residing in the trade mark proprietor) would work better for this particular type of licence (seeTrade Mark Licensingat para 6-68): With respect to a sole licensee, both the licensor and the licensee may use the mark, while in a non-exclusive situation, there may be multiple licensees. In both these circumstances, the notion that the consumer perceives only a single source for the mark is difficult, if not impossible, to square with theScandecorrationale. Indeed, it would seem that the position under the quality control scheme with respect to the source identification function works well for both a sole and non-exclusive license, since it focuses attention on whether the licensee or licensees are subject to the quality control of the proprietor/licensor. If theScandecorcase is limited to the situation of an exclusive bare license, the result may be that there is one test for determining the source of a mark with respect to an exclusive license, theScandecorrationale, and another test, perhaps the pre-Scandecortest based on quality control, with respect to a sole or non-exclusive license. While such a result is without doubt undesirable, it cannot be ruled out. 50     We are also mindful of the fact thatScandecoralso does not appear to have gained much traction in other common law jurisdictions. Australian academics for instance, are sceptical that it would be adopted in Australia at all, given the express requirements for control in the Australian trade mark legislation. In, for example, Mark Davison, Tracey Berger & Annette Freeman,Shanahan’s Australian Law of Trade Marks and Passing Off(Lawbook Co, 4th Ed, 2008), the learned authors observe thus (at para 80.605): It is worth noting that the House of Lords [inScandecorhas held that failure by a licensor to exercise control will not necessarily result in such deception or confusion arising and it held a trade mark to be valid in spite of a lack of any control over the licensee. However, it would be a brave licensor to assume that decision would be followed in Australia given the specific references to control and authorised use in the Australian legislation and, even if it were, any decision would turn on the individual facts of the case as to whether deception or confusion has arisen. 51     Unlike the Australian legislation, however, the Act in Singapore has clearly done away with such restrictions. But this does not necessarily mean that we must therefore adopt and follow Lord Nicholls’s approach inScandecor. Given the numerous uncertainties created by the decision as well as the many practical implications adopting the decision would have for trade mark licences, it would, in our view, be preferable to wait until the law in this area develops with greater clarity before expressing any conclusive views. While the desire of the House of Lords inScandecorto bring trade mark law in line with commercial realities is commendable, the decision may, unfortunately, have in fact created more difficulties than solutions. 52     However, even if the modern approach advocated by Lord Nicholls inScandecoris adopted, it must be borne in mind that the inquiry concerned is, at its heart, heavily dependent upon the particular factual matrix concerned, the onus lying on the defendant to demonstrate that the public no longer associates the source of the goods concerned with the trade mark proprietor. We do not think however, that such an onus would, in the nature of things, be easily discharged. Convincing facts must be adduced to demonstrate that a shift of association (from the trade mark proprietor to the licensee) has occurred. Factors such as the duration of the licence, as well as efforts spent in advertising and marketing, will invariably have a significant role to play in moulding public perception. In the context of the present appeal, the appellants simply did not produce any evidence to demonstrate that the trade source resided in KM for the duration of the Licence Agreement. Hence, even if the modern approach advocated by Lord Nicholls was applied to the facts of the present appeal, the appellants would not have succeeded in any event. 53     A few concluding observations might be apposite. Although, as mentioned above (at[45]), we do not propose to express a concluded view as to which approach is preferable, our emphasis on the importance of the particular factual matrix as expressed in the preceding paragraph may, in fact, give us a clue as to whether or not both approaches (viz, the traditional approach on the one hand and the more modern approach as embodied in Lord Nicholls’s approach inScandecor([37]supra) on the other) are, in fact,whollyirreconcilable ones. It appears to us – and this is but a passing observation, and no more — thatyet another possibleapproach which might well constitute a “middle way” between both the approaches just mentioned is to adopt, as a starting-point (by way of a rebuttable presumption), the traditional approach (viz, that the source of the goods concerned is the trade mark proprietor). This presumption, however, can be rebutted by clear evidence along the lines set out in the preceding paragraph. It might well be argued that this is, insubstance, Lord Nicholls’s modern approach. – not least because, under that approach, the defendant would have (as mentioned in the preceding paragraph) to adduce convincing facts in order to demonstrate that a shift of association (from the trade mark proprietor to the licensee) has occurred. If so, then the case in favour of this “middle way” becomes ana fortiorione. However, as already emphasised above (in the preceding paragraph), this particular legal conundrum was not directly before the court and it cannot be overemphasised that,regardless of the approach applied, the result would have beenthe samein any event. Conclusion 54     In the circumstances, because the appellants have misrepresented that Monarch had authorised the use of the unauthorised beverage bases, a claim in passing off has, in our view, been made out.",
        "The Second Issue": "",
        "Conclusion": "55     The Judge ordered that damages for the infringement of the Kickapoo Marks as well as for passing off be assessed by the Registrar (see the Judgment at [40]). The issue before this court therefore only relates to that of liability. However, in addition to the facts which will be adduced at the assessment stage, the facts already established with respect to the present proceedings (which, as just mentioned, only related to the issue of liability) will undoubtedly be relevant to the issue of the assessment of damages as well. These would include, for example, the fact that this is a licence agreement under which Monarch presumably has no share in the actual profits from the appellant’s actual sale of its goods as well as the fact that the quality of the appellant’s goods sold was not adversely impacted as the beverage base utilised was exactly the same (albeit obtained from another source) (see also above at[3]). In so far as the applicable legal principles are concerned, it is, of course, the case that, in addition to the specific principles concerned, the overarching guideline is that the aim is to put the plaintiff in question (so far as is possible) in the same position it would have been if the wrong(s) had not been committed and that the plaintiff bears the burden of specifically proving its loss; put simply, the main aim is to compensate the plaintiff and not to punish the defendant (see the House of Lords decision ofGeneral Tire & Rubber Co v Firestone Tyre & Rubber Co Ltd[1975] 1 WLR 819 at 824 (which, while dealing with a patent infringement, laid down general principles which are applicable in the present context as well)). 56     We also note that a plaintiff in an action for trade mark infringement and passing off can also elect for the remedy of an account of profits instead of claiming damages (which are, unlike equitable remedies, not at the discretion of the court but are available as of right) (for trade mark infringement, see s 31 of the Act). Indeed, it would appear that Monarch has claimed for an inquiryvis-à-viseither of these remedies (at its discretion). In so far as an account of profits is concerned, on the assumption (as would appear to be the case) that it is an equitable remedy (the learned authors ofIntellectual Property Law([21]supra), for example, describe such remedy as “an equitable remedy which deprives the defendant of any profits made as a result of their infringement” and explain that since such remedy “is equitable (and therefore discretionary), the court may refuse it” (at p 1122)), it is equally clear (in our view) that the facts already established with respect to the present proceedings will also be relevant (as is the case with regard to the assessment of damages, as noted in the preceding paragraph). These would include the fact that Monarch was involved in a conspiracy against the appellants. As we have already mentioned above (at[25]), the appellants were driven to do what they did as a result of what was certainly less than desirable conduct on the part of Monarch, which consisted not only in being involved in the aforementioned conspiracy but also in raising the price of the beverage base by a clearly unreasonable as well as astronomical amount (see above at[24]). Although, once again, the issue before this court relates only to that of liability, these facts – in particular, the one just mentioned – might well prove significant, particularly in light of the well-established equitable maxim that “He who comes to equity must come with clean hands” (see, for example, John McGhee QC (ed),Snell’s Equity(Thomson Sweet & Maxwell, 21st Ed, 2005) at paras 5-15 and 12-04, Alastair Hudson,Equity and Trusts(Routledge Cavendish, 5th Ed, 2007) at para 1.4.7 and I C F Spry,The Principles of Equitable Remedies: Specific Performance, Injunctions, Rectification and Equitable Damages(Sweet & Maxwell, 7th Ed, 2007) at p 245 as well as the Singapore High Court decision ofKeppel Tatlee Bank Ltd v Teck Koon Investment Pte Ltd[2000] 2 SLR 366and the decision of this court inTownsing Henry George v Jenton Overseas Investment Pte Ltd[2007] 2 SLR 597). 57     Indeed, the brief observations made in the preceding paragraphs illustrate that the same factual matrix may – and often is — relevant to both the substantiveas well asremedial aspects. This is not surprising. After all, the law must be viewed as well as applied in a holistic and integrated fashion. At this juncture, it is not inappropriate to note, on a broader canvass, the inherent genius of the common law (as well as the allied principles of equity) – a system onlyapparentlycumbersome and haphazard but which, insubstance and reality, constitutes anorganic, coherent as well as holisticsystemout of which justice and fairness flow. That is why Prof S F C Milsom perceptively observed that the common law system developed in a strikingly systematic fashion, notwithstanding the apparent absence of a clear blueprint as such (see generally S F C Milsom, “Reason in the Development of the Common Law” (1965) 81 LQR 496). 58     In so far as the issue of liability is concerned, Monarch is – for the reasons set out above – successful both in its claim for trade mark infringement as well as for passing off. The appeal is therefore dismissed with costs and the usual consequential orders. 59     We pause to observe, however, that, consistently with the spirit of justice and fairness which flows from the principles of common law and equity referred to above (at[57]), whilst the appellants are unsuccessful in the present appeal, the overall result is both just and fair inasmuch as the appellants were successful in their claim against Monarch under the tort of conspiracy. Indeed, in the light of Monarch’s conduct, it is certainly open to the appellants to claim that they are entitled to substantial damages for the loss they have thereby sustained in this regard. The damages to be awarded to Monarch for trade mark infringement by the appellants (the subject matter of the present appeal) have also to be assessed in accordance with both the facts established thus far (see above at[55]–[57]) as well as relevant evidence to be adduced at the assessment hearing. However, as we have pointed out above (at[25]), the less than desirable conduct of Monarch did not justify the appellants infringing Monarch’s trade mark – even allowing for the desperate situation they were unfairly placed in by the conduct of Monarch (see above at[24]–[25]and[56]). Put simply, both parties have committed independent legal wrongs against each other and must be responsible for the respective wrongs accordingly (see above at[16]).  [note: 1]Appellants’ Core Bundle Vol 2 (“2ACB”) at pp 195–196. [note: 2]See the Appellants’ Case (“AC”) at paras 48–55. [note: 3]AC at paras 86–89. [note: 4]2ACB at p 195. [note: 5]AC at para 107. [note: 6]AC at para 108. [note: 7]Respondent’s Case (“RC”) at para 139. [note: 8]RC at para 139. [note: 9]AC at para 107."
    }
}