{
    "case_title": "Yong Vui Kong v Public Prosecutor",
    "ncitation": "[2009] SGCA 64",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This was an application by Yong Vui Kong (“the applicant”), a 21-year-old Malaysian Chinese male (who had been convicted of drug trafficking and sentenced to death on 14 November 2008), for an extension of time to pursue his appeal against sentence and conviction. In the event that this was refused, the applicant sought, in the alternative, an order to set aside the death sentence on the ground that the statutory provisions in the Misuse of Drugs Act (Cap 185, 2001 Rev Ed) (“MDA”) which provided for a mandatory death penalty were unconstitutional. The applicant also filed Originating Summons No 1385 of 2009 (“OS 1385/2009”) seeking,inter alia, a stay of execution of his death sentence. 2       At the conclusion of the hearing of the application, we allowed the applicant, who had previously withdrawn his appeal, to pursue his appeal with the consequence that the death sentence was stayed as an operation of law under s 51(4) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”). It was therefore unnecessary for us to consider OS 1385/2009 for a stay of execution of the sentence. We now give our reasons for so granting the application.",
        "Background": "3       The applicant was convicted of trafficking in 47.27g of diamorphine, an offence under s 5(1)(a) and punishable under s 33 of the MDA, and sentenced to suffer death (seePublic Prosecutor v Yong Vui Kong[2009] SGHC 4). The applicant appealed. Six days before the hearing of the appeal, the applicant’s counsel, Mr Kelvin Lim, in a letter dated 23 April 2009 informed us that the applicant wished to withdraw his appeal. In due course, at the hearing before this court on 29 April 2009, the appeal was withdrawn. Subsequently, the applicant petitioned the President for clemency, but this was refused on 20 November 2009. 4       The applicant’s brother was informed of the President’s decision on 23 November 2009. Soon thereafter, the applicant’s brother instructed Mr M Ravi to file the present criminal motion. The criminal motion was filed on 30 November 2009, four days before the sentence was due to be carried out on 4 December 2009. In the criminal motion filed, Mr Ravi had omitted, as one of the prayers, the extension of time sought for the applicant to pursue his appeal. The criminal motion was thus fixed to be heard by a High Court judge (“the Judge”) instead of the Court of Appeal. At the hearing of the criminal motion on 2 December 2009, Mr Ravi made an oral application for an extension of time for the applicant to pursue his appeal. He expressed the view that since only the Court of Appeal could grant the extension of time sought, the criminal motion should be heard by the Court of Appeal. The Judge agreed and thus adjourned the matter for the criminal motion to be heard by the Court of Appeal. The Judge ordered a stay of the execution of the death sentence pending that hearing and, in so doing, expressed the view that he had the jurisdiction to order the stay under s 251 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“CPC”). His written grounds of decision are set out inYong Vui Kong v Public Prosecutor[2009] SGHC 274. 5       The Prosecution informed us in a letter dated 3 December 2009 that it wished to challenge the Judge’s decision to grant the stay of execution on the ground that the Judge had no jurisdiction. At the hearing before us, the Prosecution also argued that the Court of Appeal had no jurisdiction to hear the criminal motion because the court wasfunctus officio. In this regard, the Prosecution relied,inter alia, on the fact that the applicant had sought but had been refused clemency from the President.",
        "Issues raised": "6       The issues raised for this court’s consideration were as follows: (a)     Whether this court had the jurisdiction to permit the applicant, who had previously withdrawn his appeal, to pursue his appeal. (b)     Whether the Judge had the jurisdiction to order a stay of execution of the death sentence.",
        "Whether this court had the jurisdiction to permit the applicant who had previously withdrawn his appeal to pursue his appeal": "7       It has been held by this court in four previous cases that this court had no jurisdiction to re-open and re-examine thesubstantive meritsof a criminal case either on the facts or on the law on the basis of which judgment was delivered and sentence affirmed or passed by the court, as the case may be. This court came to this conclusion on the ground that, as the jurisdiction and powers of the court are statutory in nature, the relevant statute,viz, the SCJA had not provided for further proceedings after the court had pronounced its judgment and, therefore, its jurisdiction on the case terminated at that point and the court becamefunctus officio. InAbdullah bin A Rahman v PP[1994] 3 SLR 129(“Abdullah”), this court refused to hear an application by the appellant to adduce “new” evidence which could prove that he had been wrongly convicted of the offence of abetting one Rashid in the trafficking of drugs. InLim Choon Chye v PP[1994] 3 SLR 135, the same court also held, for the same reason, that it had no jurisdiction to hear fresh evidence, thereby generating a second appeal, and that the word “appeal” in the SCJA did not mean “more than one appeal”. The court emphasised the need for finality and stability of legal proceedings in all legal systems. InJabar v PP[1995] 1 SLR 617, this court again held (at 631, [59]) that: Once the Court of Appeal has disposed of the appeal against conviction and has confirmed the sentence of death, it is functus officio as far as the execution of the sentence is concerned. It is not possessed of power to order that the sentence of death be stayed … 8       Again, inVignes s/o Mourthi v PP (No 3)[2003] 4 SLR 518, this court re-affirmed the law, as stated in the previous decisions, in dismissing an appeal against the decision of the High Court which had, inVignes s/o Mourthi v PP (No 2)[2003] 4 SLR 300, dismissed the appellant’s application for a retrial on the ground that the trial judge had admitted inadmissible evidence and also that the appellant had been denied his constitutional right to counsel under Art 9(3) of the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint) (“the Constitution”) in that the trial judge had refused an adjournment of the trial to enable him to appoint counsel of his own choice. For convenience, we will call this line of cases “theVignesline of decisions”. 9       InKoh Zhan Quan Tony v PP[2006] 2 SLR 830(“Koh Zhan Quan Tony”), this court held that theVignesline of decisions would not apply to a case where the question sought to be raised at the second hearing before the Court of Appeal was not concerned with the substantive merits of the case decided in the first hearing, but went to the jurisdiction of the court itself to hear the appeal in the first place. For example, if, at the first hearing, the Court of Appeal had decided any matter not within its jurisdiction, there would be no decision in law on that question and, therefore, the court could not befunctuson that issue, nor could its decision bind itself. 10     In that case, at the second hearing before the Court of Appeal, the applicants had argued that the court had no jurisdiction at the first hearing to hear the appeal by the Prosecution against the decision of the High Court to convict the applicants on the lesser charge of robbery with hurt instead of murder. The applicants contended that the Prosecution’s appeal was, in essence, an appeal against a conviction of the lesser offence of robbery with hurt. The applicants took the position that such an appeal fell without the ambit of s 44(3) of the SCJA (on the jurisdiction of the court to hear and determine criminal appeals) with the consequence that the court was devoid of jurisdiction at the first hearing. In response, the Prosecution argued that the court had no jurisdiction at the second hearing because the court wasfunctus, having already disposed of the appeal on the merits. The court rejected the Prosecution’s argument and held that it had the jurisdiction at the second hearing to hear and determine the issue of whether it had the jurisdiction at the first hearing to hear the Prosecution’s appeal. 11     However, the court affirmed theVignesline of decisions in cases where the court had validly assumed jurisdiction to hear an appeal and had disposed of it on the merits. Andrew Phang JA (delivering the judgment of this court) observed (at [22]) that: [If the applications before the court] involved … an attempt to adducefresh evidence and/or new arguments of law[, this] would be an attempt tore-litigate the substantive meritsof the case andre-opena decision that had already been rendered [in a previous appeal]. That would … clearly beimpermissibleas the court would befunctus officioin so far as the substantive merits of the case were concerned as this very same court had already heard and ruled on the issues associated therewith. [emphasis in original] This passage merely affirmed the decisions referred to above (at[7]–[8]) that where the court isfunctus, it could not entertain any application to re-open a case even if new evidence was discovered which could prove that the offender had been wrongly convicted or that the court had made a mistake on the law. The court’s response to such an application would follow as a matter of law and logic if, indeed, the court’s jurisdiction had ceased after it had dismissed the appeal. 12     However, we should point out that none of these cases actually involved a situation where, in fact, new evidence was discovered which showed, or might show, a probability that the accused might have been wrongly convicted, or that he might even have been innocent of an offence for which he had been convicted. The nearest case involving “new” evidence was that ofAbdullah. In that case, the applicant was convicted of the offence of abetting one Rashid to traffic in drugs. Rashid was also convicted of the substantive offence. A few days before his execution, Rashid informed the applicant that his statement to the investigating officer that the applicant had abetted him in the commission of the offence and his testimony in court were “atotalfabrication” [emphasis added]. In our view, this was not a true case of new evidence having come to light after judgment, but a case where the principal convicted offender apparently changed his mind in a last-minute attempt to help his accomplice. It was therefore unsurprising that the Court of Appeal was not receptive to the application. 13     For this, and another reason which we will discuss later (at[15]below), we do not think that these cases should be accorded a status of finality and immutability such that a future court should not reconsider the rationale of those decisions where we have an actual situation where new evidence is discovered,eg, DNA or other evidence, which shows, or may show, that the conviction is demonstrably wrong in law or that there is a reasonable doubt that the conviction was wrong. In such a case, this court will have to consider or reconsider whether it has any inherent jurisdiction to review its own decisions in order to correct any miscarriage of justice. 14     It is not uncommon in other jurisdictions, such as the United States, for new exculpatory evidence to be discovered,eg, DNA evidence which can show almost conclusively that the blood found at the scene of the crime or on the body of the deceased (in murder cases) was not that of the accused. There may be other types of evidence which could have the same effect,eg, new documentary evidence which was not discovered during the trial or the appeal. In such cases, it would be in the interest of justice that the court should have the power to correct the mistake, rather than rely on the Executive to correct what is essentially an error in the judicial process. In our context, this court should consider or reconsider whether it has the power to review its own decisions which are demonstrably found to be wrong. Indeed, if the law were otherwise (ie, the court has no jurisdiction to review the conviction on the basis of the new evidence), the court would have to dismissin limineany application for a review or to introduce newly-discovered evidence. It is reasonable to assume that the court is better placed to evaluate the merits of the new evidence than the Executive. If such a case were to arise, we will need to consider whether we have the inherent jurisdiction to correct mistakes made in or within the judicial process. 15     We note also that the main justifications of these cases, that the court isfunctusafter it has delivered judgment on the case, rest on the public interest in having finality of litigation and the absence of an express provision in the SCJA to empower the court to review its decisions. The first justification is bolstered by the fear of abuse of the judicial process and the floodgates argument (an argument which was also made to the Judge in this case). In our view, the finality principle should not be applied strictly in criminal cases where the life or liberty of the accused is at stake as it would subvert the true value of the judicial process, which is to ensure, as far as possible, that the guilty are convicted and the innocent are acquitted. The floodgates argument should not be allowed to wash away both the guilty and the innocent. Suppose, in a case where the appellate court dismisses an appeal against conviction and the next day the appellant manages to discover some evidence or a line of authorities that show that he has been wrongly convicted, is the court to say that it isfunctusand, therefore, the appellant should look to the Executive for a pardon or a clemency? In circumstances where there is sufficient material on which the court can say that there has been a miscarriage of justice, this court should be able to correct such mistakes. 16     Another argument which this court should take into account (but which has never been addressed to the court), is that Art 93 of the Constitution vests the judicial power of Singapore in the Supreme Court. The judicial power is exercisable only where the court has jurisdiction, but where the SCJA does not expressly state when its jurisdiction in a criminal appeal ends, there is no reason for this court to circumscribe its own jurisdiction to render itself incapable of correcting a miscarriage of justice at any time. We have not heard the Public Prosecutor on this point, and it will be necessary to do so in an appropriate case in the future. 17     The case before us presented a different issue altogether. Here, the applicant had withdrawn his appeal six days before the hearing on the ground that he had become a Buddhist and was at peace with himself. Counsel for the applicant at the time, Mr Kelvin Lim, wrote a letter dated 23 April 2009 (see[3]above) informing the court that: At both interviews [with the applicant prior to the appeal], the [applicant] indicated his desire not to proceed with the appeal as he had while serving [his] sentence embraced Buddhism. With his new found faith, he said he felt uneasy and had no peace of mind if he were to proceed with his appeal. Accordingly, I am now instructed to inform the Court of Appeal that at the appeal hearing on the 29 April 2009, I will be applying for leave of the Court to withdraw the appeal. 18     Mr Ravi has asked this court to treat the applicant’s withdrawal of appeal as a nullity on the ground that it was clearly vitiated by mistake or wrong advice or misapprehension because: (a)     the withdrawal was based on a misapprehension that: (i)       in order to maintain an appeal against conviction on points of law, it was necessary to lie; (ii)       an appeal against sentence could not be pursued without owning up to what one had done; and (iii)       abandoning an appeal was a way to honour religious precepts and would enable one to experience spiritual peace; (b)     the overall impression was that the applicant had become hopelessly confused and had muddled up notions of legal reasoning and argument with issues of morality and spiritual devotion. 19     Mr Ravi contended that in such circumstances, the decision to abandon the appeal was clearly vitiated by this confused state of mind, best summarised by the word “delusion”, which is defined in the Collins dictionary as “a mistaken or misleading opinion, idea or belief, etc”. He asked rhetorically what possible advantage could the applicant have achieved by a decision to withdraw an appeal against a death sentence, and argued that only a deluded mind would make such a decision. In the circumstances, counsel argued that the applicant met the English test of nullity for abandonment of an appeal as stated by the Court of Appeal inR v Medway[1976] QB 779 (“Medway”) which was followed inR v Burt (Gavin)[2004] EWCA Crim 2826 which, in referring toMedway, held (at [6]) that, “The kernel of the nullity test … was that the court must be satisfied that the mind of the applicant did not go with the act of abandonment [of the appeal].” 20     Counsel also referred to the case ofWee King Hock v Public Prosecutor[1971] 2 MLJ 96where the Federal Court of Malaysia held that it had the power to allow an abandonment (or withdrawal of an appeal) to be withdrawn, but only on the ground of special circumstances such as a mistake of fact. In that case, the court held that there was no mistake of fact. We should add that the relevant rules considered by the court in that case correspond to r 18(2) of the Supreme Court (Criminal Appeals) Rules (Cap 322, R 6, 1997 Rev Ed) (“Rules on Criminal Appeals”). 21     The Prosecution’s case was straightforward. First, the Prosecution argued, as we have mentioned earlier, that the court wasfunctusas the appeal had been terminated by the withdrawal of the appeal and its subsequent dismissal by the court. Second, the Prosecution also argued that the withdrawal was irrevocable because of r 18(2) of the Rules on Criminal Appeals, which provides that, “Upon the filing [of a notice to withdraw or discontinue an appeal,] the appeal shall be deemed to have been dismissed by the Court.” The argument here was that r 18(2) of the Rules on Criminal Appeals brought an end to the proceedings and therefore the court wasfunctus. In our view, this argument does not meet the applicant’s point. If the withdrawal of the appeal was a nullity (ie, it had no legal effect whatsoever) then this rule would not even have applied. It would also mean that the question offunctuswould not arise as the court would have yet to decide the appeal. Accordingly, we also rejected the Prosecution’s argument that the rule had the effect of making the courtfunctusin the matter. Furthermore, in our view, r 18(2) is a procedural rule that merely closes the loop, so that the withdrawn appeal is not left indeterminate,ie, hanging in the air. Hence, the rule provides that “the appeal shall bedeemedto have been dismissed by the Court” [emphasis added]. 22     The Prosecution also argued that the withdrawal of the appeal was irrevocable as all the procedures and processes set out in s 220 of the CPC had taken effect and that the applicant had had the benefit of the clemency process and, therefore, it was now not open to this court to grant an extension of time. We did not accept this argument as the jurisdiction or power of this court to grant an extension of time is not, and cannot be, affected by the decision of the President to decline to grant clemency. The President’s decision is an exercise in executive power under Art 22P of the Constitution (preserved also under s 8 of the Republic of Singapore Independence Act (Act 9 of 1965) (“RSIA”)). It has no effect and cannot have any effect on the judicial power of Singapore which is vested by Art 93 of the Constitution in the Supreme Court. 23     Nonetheless, this argument might have some purchase if it was made to object to the court exercising its discretion to grant an extension of time (assuming that it has jurisdiction or power to do so). In other words, the Prosecution might have argued (which it declined to do) that the application for an extension of time was an abuse of process since the applicant had already petitioned the President for clemency. We would only add that it was entirely appropriate and correct for the Prosecution to eschew arguing that this was an abuse of process, as seeking clemency is not only a natural thing for a condemned prisoner to do but also, in the present case, a constitutional right given to any convicted person under Art 22P of the Constitution. The fact that this right was also preserved in s 8 of the RSIA shows how important Parliament considers it to be in an appropriate case. 24     In the circumstances, there were two issues for our consideration which must be distinguished. The first was whether the withdrawal of the appeal by the applicant was a nullity. If it was, r 18(2) of the Rules on Criminal Appeals was no longer relevant. If it was not, the next question was whether the rule would deprive the court of the jurisdiction or power which it might otherwise have to grant an extension of time to the applicant to file an appeal. We address the issue of nullity first. 25     Was the applicant’s withdrawal of his appeal against conviction and sentence a nullity? In our view, the applicant’s decision to withdraw his appeal appeared to be perfectly rational to usfrom his point of view. Having become a Buddhist, he had attained peace with himself and so was content to accept his fate under the law. Mr Ravi had also explained to us that the applicant had taken the view that as a Buddhist he should not lie and had to own up to what he had done (see[18]above). In our view, the applicant’s mind conformed to his decision to withdraw the appeal. He was not deluded as his counsel had attempted to portray his decision. Nor do we think counsel was deluded: he was making the best argument for his client. This court would be deluded if we were to hold that the applicant was deluded. There was no misapprehension on the part of the applicant: on this basis, the withdrawal of the appeal was not a nullity. 26     However, we were prepared to accept that the applicant was mistaken in believing, if he did believe, that he could not appeal against his conviction and sentence on purely legal grounds,eg, wrongful admission of similar fact evidence which was prejudicial to his defence, or that the mandatory death penalty was unconstitutional. It was not necessary for him to lie to the court to rely on such defences in law. Religion, morality or the belief in reincarnation has nothing to do with this point. An appellant in a criminal case is entitled to raise all defences available in law: more so, in the case of an appellant who has been sentenced to death, a sentence which, if carried out, is irrevocable. In this sense, the applicant could be said to be “making a mistake as to his act” and not making a mistake as to his prospect of success in pursuing his appeal against conviction (see Lawton LJ’s observations inR v Joseph Douglas Peters(1974) 58 Cr App R 328 at 332). 27     In the present case, it was apparent to us that counsel for the applicant was more concerned with or interested in the constitutionality of the mandatory death sentence imposed for the offence of trafficking in more than 15g of diamorphine. His argument, in the context of the application before us, was really that the applicant was under a misapprehension that, as a matter of law, he was barred by the decision of the Privy Council inOng Ah Chuan v PP[1980-1981] SLR 48(“Ong Ah Chuan”) and the decision of this court inNguyen Tuong Van v PP[2005] 1 SLR 103(“Nguyen”), from arguing that these decisions on the constitutionality of the mandatory death sentence should not be followed or that the right to life under Art 9(1) and the right to equal protection of the law under Art 12(1) of the Constitution should be reinterpreted to take into consideration later Privy Council decisions which have rejectedOng Ah Chuanas obsolete. Counsel gave four reasons why the applicant should be allowed to re-argue the issue of the constitutionality of the mandatory death penalty: (a)     The court ought to reconsider its reliance onOng Ah Chuanin past decisions such asNguyen, in upholding the mandatory death penalty, for doubt has been expressed in subsequent Privy Council cases as to the correctness of the decision inOng Ah Chuan. (b)     It was still an open question as to whether there was a “rational justification” for the 15g differentia in determining the imposition of the death sentence for trafficking or importing diamorphine because this issue was not fully considered inOng Ah ChuanandNguyen. (c)     Article 162 of the Constitution which empowers the courts to construe laws brought into force after the commencement of the Constitution with such modifications, adaptations, qualifications and exceptions as may be necessary to bring them into conformity with the Constitution was not brought to the attention of the Privy Council inOng Ah Chuanor this court inNguyen. (d)     This court inNguyenfailed to consider the Privy Council’s pronouncement inBoyce v The Queen[2005] 1 AC 400 (“Boyce”) that no international human rights tribunal anywhere in the world has ever found a mandatory death penalty regime compatible with international human rights norms. 28     Having regard to the nature of capital punishment being final and irrevocable for the applicant, and also the public interest in its legality under the Constitution, we were prepared to accept the applicant’s position, implicit in his argument, that if he had known that he was entitled to re-argue the legality of the mandatory death sentence under the Constitution, he would have proceeded with his appeal on the law. In other words, we were prepared to accept that in withdrawing his appeal he had made a fundamental mistake in the context of the decision inMedwayand emphasised inR v Munisamy[1975] 1 All ER 910. In our view, since the right to life and equal protection of the law are fundamental rights under Arts 9(1) and 12(1) of the Constitution respectively, a mistake by the applicant as to whether he was entitled to these fundamental rights under the Constitution must be a fundamental mistake. Accordingly, we were of the view that the applicant’s withdrawal of his appeal was a nullity. 29     We turn now to the statutory provisions on the jurisdiction and power of this court to extend time to appeal. It is really unnecessary for us to examine these provisions, in view of our decision, but since we have adverted to them at the hearing, it is desirable that we clarify the scope of these provisions. The relevant sections are s 50 and ss 57(3) and 57(4) of the SCJA which provide as follows: [50]        The Court of Appeal may,in its discretion, on the application of any person desirous of appealingwho may be debarred from so doing by reason of his not having observed some formality or some requirement of this Act, permit an appeal upon such terms and with such directions as it may consider desirablein order that substantial justice may be done in the matter, and may, for that purpose, extend any period of time prescribed by section 45 or 47. [57(3)]Upon the withdrawal or discontinuance of any appeal, the Registrar shall notify the trial court accordingly and, if any stay of execution has been granted,the sentence or order of the trial court shall immediately be enforced. [57(4)]Nothing in subsection (3) shall be deemed to limit or restrict the powers of extending time conferred upon the Court of Appeal by section 50. [emphasis added] 30     Sections 57(3) and 57(4) are clear enough. Read together, they mean that notwithstanding that the sentence of the court shall be immediately enforced (even if a stay of execution pending the disposal of the appeal had been grantedpriorto its withdrawal or discontinuance), the court’s power to extend time under s 50 is not restricted. Section 50 provides the conditions upon which the court may grant an extension of time. The conditions are where the appellant is debarred from appealing by reason of his failure to observe some formality or requirement of the SCJA. The critical words are “debarred from so doing by reason of his not having observed some formality or some requirement of this Act” [emphasis added]. 31     The question therefore is whether the applicant had fulfilled any of these conditions. Did he fail to observe some formality or requirement of the SCJA? He had filed the notice of appeal and the petition of appeal in accordance with the formalities and requirements of the SCJA. He had complied with all timelines under the SCJA. On this basis, the applicant could not be said to have failed to observe some formality or requirement of the SCJA. Quite the opposite: he consciously withdrew his appeal a week before the hearing of the appeal. He abandoned the appeal, with the consequence that all the steps set out in ss 57(1) and 57(2) took effect and were complied with by the courts. Furthermore, the courts also complied with the consequential steps required under s 220 of the CPC and Art 22P(2) of the Constitution. 32     It may be noted that the power to permit an appeal under s 50 is related to the extension of any period of time prescribed by s 45 or s 47 for the filing of the notice of appeal and the petition of appeal. The power is exercised for that purpose in order that substantial justice be done. In the present case, the applicant had already complied with s 45 and s 47 before he abandoned his appeal. In the circumstances, it is not possible for this court to hold that s 50 applies in the present case. It is not possible to argue that the word “requirement” in s 50 refers to the existence of a notice of appeal or a petition of appeal in a case where both once existed but no longer exist by reason of the deliberate act of the appellant to negate their existence. In that context, the word can only refer to whether they had been filed and not to whether they had been abandoned, having regard to the reference to s 45 and s 47 in that section. 33     This would be the natural and ordinary meaning of the words “not having observed” in s 50. InVeerasingam v Public Prosecutor[1958] MLJ 76at 78, the Court of Appeal of the Federation of Malaya (perThomson CJ, sitting with Whyatt CJ (S) and Buhagiar J, a strong court) held that s 310 of the Criminal Procedure Code of the Federation of Malaya (“MCPC”) (which wasin pari materiawith s 50 of the SCJA) meant as follows: That section clearly enables indulgence to be shown to an appellant who has not given Notice of Appeal within the prescribed time or who having failed to file his Petition of Appeal within the prescribed time has accordingly been treated as if his appeal had been abandoned. In that case, the Court held that s 310 of the MCPC empowered the court to amend the petition of appeal out of time to include additional grounds of appeal in order to do substantial justice, and that the discretion could not be fettered by principles laid down by the court because the discretion was given by the section in unqualified terms (citingJones v Curling(1884) 13 QBD 262 at 271–272). However, this decision has no application to the present case where the notice of appeal and the petition of appeal had been filed but the appeal itself was abandoned. 34     However, there is one further matter we should mention, although it does not affect our decision in the present case. In deciding that the applicant could proceed with his appeal, we stated that this was an unusual case in that the apex court had not heard the merits of the case. It has been a long-established practice of our courts that where an offender has been convicted of a capital offence, an appeal against the conviction is filed automatically on his behalf, whether he is desirous of appealing or not, so that the appellate court can examine and scrutinise the record of proceedings to ensure that the offender has not been wrongfully convicted. The practice was established for the protection of the offender and also the integrity of the criminal justice system to ensure that an innocent man shall not lose his life as a result of some error in the judicial process. Where the appellant has filed his appeal, but fails to proceed with it, the same practice applies. 35     In the present case, this court did consider the petition of appeal and had gone through the record of appeal and had taken into account the applicant’s letter dated 23 April 2009 in dismissing the appeal. To that extent, the court could be said to have, on its own motion, considered the merits of the appeal in relation to the facts of the case. However, what is indisputable is that this court did not consider the merits of the appeal in relation to the alleged unconstitutionality of the mandatory death penalty (because it had not been raised). Even though the Privy Council had decided inOng Ah Chuanthat the mandatory death penalty was not unconstitutional, and this court had decided likewise inNguyenby distinguishing (at [83]–[84]) subsequent Privy Council decisions (such as that inBoyce,Watson v The Queen[2005] 1 AC 472,Matthew v State of Trinidad and Tobago[2005] 1 AC 433 andReyes v The Queen[2002] 2 AC 235) on the ground that the prohibition against cruel and inhuman punishment is not expressed in the Constitution, counsel for the applicant has argued that the applicant should be heard on the constitutional issue because of legal developments in other Commonwealth jurisdictions which have, in his view, thrown doubt on the correctness of bothOng Ah ChuanandNguyen. On our part, we did not see any particular reason why we should not allow the applicant to argue this issue as his life was at stake and the public interest requirement of finality in criminal proceedings was only of marginal importance, if not wholly irrelevant. We were not prepared to accept the floodgates argument to deny the applicant the opportunity to argue this particular issue. In our view, the public interest in having finality in court proceedings (in the present case the criminal proceedings against the applicant for drug trafficking) could not possibly outweigh the public interest in determining whether or not the mandatory death penalty was constitutional under Arts 9(1) and 12(1) of the Constitution, having regard to the reasons given by the applicant’s counsel, regardless of the validity of his reasons. The developments referred to by counsel, new or old, may or may not be relevant in the Singapore context, but due process requires us to hear the appeal in the present case.",
        "Conclusion": "36     For the above reasons, we allowed the applicant to proceed with his appeal, and ordered the Registrar to give further directions for the filing of submissions and the hearing of the appeal. We also ordered the Registrar to give further directions on the filing of amendments to the notice of appeal and petition of appeal to include any new grounds of appeal which the applicant wished to raise.",
        "Postscript: Whether the Judge had the power to grant a stay of execution": "37     In the present case, the Prosecution was very much concerned about the decision of the Judge to grant a stay of execution under s 251 of the CPC. The Prosecution was of the view that the Judge did not have such power as s 251 was applicable only to appeals from a subordinate court to the High Court and not to appeals from the High Court to the Court of Appeal. Section 251 reads as follows: Stay of execution pending appeal. 251.  No appeal shall operate as a stay of execution, but thecourts belowand theHigh Courtmay stay execution on any judgment, order, conviction or sentence pending appeal on such terms as to security for the payment of any money or the performance or non-performance of any act or the suffering of any punishment ordered by or in the judgment, order, conviction or sentence as to the court seem reasonable. [emphasis added] 38     We have already expressed our view orally that we agreed with the Prosecution’s submission on this point. Section 251 has no application to an appeal from the High Court to the Court of Appeal. The consequence of our decision on this particular point is that, in future, all such applications should be fixed before this court for hearing, together with the substantive application, and not before the High Court. In the present case, as we have mentioned earlier (at[4]above), the application was initially fixed for hearing before the High Court and not the Court of Appeal because the applicant’s counsel had omitted the prayer for an extension of time for the applicant to pursue his appeal. 39     We also take note of the fact disclosed to us by the Prosecution that despite its disagreement with the Judge’s decision under s 251 of the CPC, it had advised the President to grant a respite to the applicant until the determination of the proceedings before us, subject to the outcome of these proceedings. We acknowledge the propriety and wisdom of the President’s decision but would add that, whatever the letter of the law might be in this connection, it would have been inconceivable for the Executive to proceed with the carrying out of a death sentence when court proceedings in relation to the validity of the sentence are pending, however unmeritorious the Prosecution considered the appeal to be."
    }
}