{
    "case_title": "Kok Chong Weng and Others v Wiener Robert Lorenz and Others (Ankerite Pte Ltd, intervener)",
    "ncitation": "[2009] SGCA 7",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Background facts": "2          The salient facts are as follows. GH was formerly a Housing and Urban Development Corporation (“HUDC”) estate consisting of four blocks of 20-storey flats and six blocks of four-storey maisonettes (comprising altogether 607 residential units and one shop unit). With the exception of one block that was completed in October 1984, GH was ready for occupation in December 1984. Prior to its privatisation in 1995, GH was subject to the HUDC Housing Estates Act (Cap 131, 1985 Rev Ed) (“the HUDC Act”) which restricts,inter alia, the rights of the owners of HUDC flats to sell them without the consent of the HUDC. 3          HUDC developments or estates, unlike private developments, have usually been exempted from the requirements of the Building Control Act 1973 (Act 59 of 1973) (“the 1973 BCA”) and thus any such development may not have been issued with a temporary occupation licence (“TOL”) or a certificate of fitness (“COF”). The 1973 BCA was subsequently replaced with the Building Control Act (Cap 29, 1985 Rev Ed) (“the 1985 BCA”). The 1985 BCA was in turn amended in 1990 by the Building Control Act 1989 (Act 9 of 1989) which substituted the TOL and COF with the temporary occupation permit (“TOP”) and the certificate of statutory completion (“CSC”) respectively. GH, which was completed in 1984, was exempted from the requirements of the Building Control Act 1973 under the Building Control (Exemption) Order 1984 (S 329/84). No TOL or COF was issued upon the completion of GH or when the flat owners were allowed into occupation in 1984. 4          In 1995, Parliament added ss 126A and 126B to the Land Titles (Strata) Act (Cap 158, 1988 Rev Ed) (“the 1988 LTSA”) via the Land Titles (Strata) (Amendment) Act 1995 (Act 27 of 1995) (“the 1995 Amendments”) to allow HUDC estates to be privatised. Upon privatisation, a HUDC estate would cease to be subject to the HUDC Act, and the body corporate constituted under that Act would continue as a management corporation under the 1988 LTSA, and subsequently the Land Titles (Strata) Act (Cap 158, 1999 Rev Ed) (“the LTSA”) (see s 126B(1) of the LTSA). Effectively, a privatised HUDC estate would acquire all the legal attributes and benefits of a private strata title development with a management corporation under the LTSA. As explained by the Minister for National Development Mr Lim Hng Kiang in his second reading speech to the Land Titles (Strata) (Amendment) Bill (Bill 22 of 1995) (Singapore Parliamentary Debates,Official Report(7 July 1995) vol 64 at cols 1389–1390): The primary objective of the Bill is to amend the Land Titles (Strata) Act to provide the legal framework to enable the conversion of the leases of flats in designated HUDC estates to strata titles. This conversion will allow HUDC residents to enjoy the status and advantages of private property owners. It is part of the Government’s asset enhancement programme. It will also serve to meet the rising aspirations of Singaporeans for private housing. Upon privatisation, the HUDC owners will have ownership of their respective strata units and own, as tenants-in-common, the common property such as car parks, open landscaped areas and common parts within the buildings. This will enable them collectively to upgrade their estates to a standard comparable to private residential estates.The residents will be able to enjoy the status and privileges of private residential owners without having to uproot themselves and move elsewhere. At the same time, the privatised estates will no longer come under HDB [Housing and Development Board] rules and regulations. They will be like any other private property, subject only to the Residential Property Act. [emphasis added] 5          On 24 May 1995, the Government announced that GH would be designated for privatisation on 11 August 1995. In or around 1996, the privatisation of GH was completed and, in November 1996, GH was issued with a strata title plan under the 1988 LTSA. As part of the privatisation exercise, building works were done to the common property in the development. The works involved the building of ramps, railings, boundary fencing, fire engine hard-standing areas and fire engine access, and the installation of fire-rated doors. However, it was not until 23 October 2002 that a CSC was issued in respect of those works (“the 2002 CSC”). The description of the “building(s)/building works” in the 2002 CSC referred to “4 BLOCKS OF 20-STOREY FLATS AND 6 BLOCKS OF 4-STOREY MAISONETTES ON LOT(S) 01478C MK01 AT GILLMAN HEIGHTS”. 6          Sometime in February 2001, the subsidiary proprietors of GH contributed about $3m to construct a clubhouse, swimming pool and children’s playground. A TOP was issued on 27 November 2002 (“the 2002 TOP”) for “ADDITIONS AND ALTERATIONS OF A NEW SINGLE-STOREY CLUBHOUSE WITH SWIMMING POOL TO THE EXISTING CONDOMINIUM AT BLOCK 1A, 1B, 1C, 1D, 1E, 1F, 1G, 1H, 1J & 1K GILLMAN HEIGHTS”. 7          In 1999, Parliament amended the 1988 LTSA via the Land Titles (Strata) (Amendment) Act 1999 (Act 21 of 1999) (“the 1999 Amendments”) to allow owners of strata developments to take advantage of enhanced plot ratios to realise their full development potential. Parliament enacted Pt VA of the LTSA to facilitate the collective sale of such developments. Part VA contained,inter alia, s 84A(1) which allowed the collective sale of strata developments by majority consent, as opposed to unanimous consent which was extremely difficult to achieve in the case of many freehold and 999-year leasehold strata developments. Section 84A(1) prescribed the percentage majority consent at 90% or 80% (“the 90% consent requirement” or the “80% consent requirement”) for strata developments which were less than ten years old or more than ten years old, as the case might be, as measured by reference to the date of issue of the latest TOP or CSC, as the case might be. 8          Section 84A(1) then read as follows: 84A.—(1) An application to a Board [Strata Titles Board] for an order for the sale of all the lots and common property in a strata title plan may be made by — (a)        the subsidiary proprietors of the lots with not less than 90% of the share values where less than 10 years have passed since the date of the issue of the latest Temporary Occupation Permit on completion of any building comprised in the strata title plan or, if no Temporary Occupation Permit was issued, the date of the issue of the latest Certificate of Statutory Completion for any building comprised in the strata title plan, whichever is the later; or (b)        the subsidiary proprietors of the lots with not less than 80% of the share values where 10 years or more have passed since the date of the issue of the latest Temporary Occupation Permit on completion of any building comprised in the strata title plan or, if no Temporary Occupation Permit was issued, the date of the issue of the latest Certificate of Statutory Completion for any building comprised in the strata title plan, whichever is the later, who have agreed in writing to sell all the lots and common property in the strata title plan to a purchaser under a sale and purchase agreement which specifies the proposed method of distributing the sale proceeds to all the subsidiary proprietors (whether in cash or kind or both), subject to an order being made under subsection (6) or (7). 9          In 2007, following public feedback on the operation of the collective sale scheme, Parliament again amended the LTSA by enacting the Land Titles (Strata) (Amendment) Act 2007 (Act 46 of 2007) (“the 2007 Amendments”). Section 84A(1) was one of the sections that was amended by the 2007 Amendments. The amendments to s 84A(1) are shown in italics in the section reproduced below: 84A.—(1) An application to a Board for an order for the sale of all the lots and common property in a strata title plan may be made by — (a)        the subsidiary proprietors of the lots with not less than 90% of the share valuesand not less than 90% of the total area of all the lots (excluding the area of any accessory lot) as shown in the subsidiary strata certificates of titlewhere less than 10 years have passed since the date of the issue of the latest Temporary Occupation Permit on completion of any building(not being any common property)comprised in the strata title plan or, if no Temporary Occupation Permit was issued, the date of the issue of the latest Certificate of Statutory Completion for any building(not being any common property)comprised in the strata title plan, whichever is the later; or (b)        the subsidiary proprietors of the lots with not less than 80% of the share valuesand not less than 80% of the total area of all the lots (excluding the area of any accessory lot) as shown in the subsidiary strata certificates of titlewhere 10 years or more have passed since the date of the issue of the latest Temporary Occupation Permit on completion of any building(not being any common property)comprised in the strata title plan or, if no Temporary Occupation Permit was issued, the date of the issue of the latest Certificate of Statutory Completion for any building(not being any common property)comprised in the strata title plan, whichever is the later, who have agreed in writing to sell all the lots and common property in the strata title plan to a purchaser under a sale and purchase agreement which specifies the proposed method of distributing the sale proceeds to all the subsidiary proprietors (whether in cash or kind or both), subject to an order being made under subsection (6) or (7). Hereinafter in this judgment, all references to “s 84A(1)” of the LTSA are to s 84A(1) as contained in the 1999 Amendments, unless stated to the contrary. 10        The other 2007 Amendments relevant to the present case are the new ss 126A(6A) and 126A(6B) which are reproduced below: (6A)     Subject to subsection (6B), in the application of section 84A(1)(a) or (b) to any designated land, any reference therein to the date of the issue of the latest Certificate of Statutory Completion for any building (not being any common property) comprised in the strata title plan shall be read as a reference to the date of completion of the construction of the last building (not being any common property) comprised in the strata title plan as certified by the relevant authority. (6B)     In the application of section 84A(1)(a) or (b) to any designated land specified in the First Schedule to the HUDC Housing Estates Act (Cap. 131), any reference therein to the date of the issue of the latest Certificate of Statutory Completion for any building (not being any common property) comprised in the strata title plan shall be read as a reference to the date of the issue of the Certificate of Fitness for any building (not being any common property) comprised in the strata title plan.",
        "The Appellants’ case in the court below": "11        Before the Judge, the 40 MSPs raised a large number of issues on which they relied on eight grounds to set aside the decision of the Board (see the Judgment at [2]). They were all rejected by the Judge. As the Appellants have raised only two issues in this appeal, we will only examine the Judge’s decision on these two issues. The two issues are as follows: (a)        whether s 84A(1) applies to privatised HUDC estates; (b)        alternatively, if s 84A applies, whether the applicable provision is s 84A(1)(a) (the 90% consent requirement) or s 84A(1)(b) (the 80% consent requirement). 12        With respect to these two issues, the Appellants’ submission before the Judge was that: (a) s 84A(1) did not apply to privatised HUDC estates, such as GH; and (b) in the alternative, if s 84A(1) applied to GH, then the applicable provision was s 84A(1)(b). The submissions of the Respondents and the Intervener on the two issues were that: (a) s 84A(1) applied to GH; and (b) the applicable provision was s 84A(1)(b). The Appellants have referred to their submissions on issue (a) as “the Applicability Argument” and their submissions on issue (b) as “the Reference Date Argument”. 13        The essential elements of the Applicability Argument were as follows: (a)        When Parliament enacted s 84A(1) in 1999, it must be presumed to have known that HUDC estates did not have TOPs (or TOLs) and CSCs (or COFs). Therefore, since there was a requirement for a TOP or a CSC under s 84A(1), Parliament must have intended not to apply s 84A(1) to privatised HUDC estates. (b)        The draftsman of the 1999 Amendments adopted an inclusive approach in drafting Pt VA of the LTSA (regulating collective sales) in that the specific sections (ie, ss 84A to 84F) were provided to apply to different and specific types of estates. HUDC estates were not referred to in Pt VA. (c)        The 2007 Amendments changed the ambit of s 84A(1) by providing: (i)         under s 126A(6A), that, in respect of privatised HUDC estates, any reference to the date of the issue of the CSC in the application of s 84A(1)(a) or s 84A(1)(b) shall be read as a reference to the date of completion of the construction of the last building (not being common property) in the strata title plan; and (ii)        under s 126A(6B), that any reference to the CSC in s 84A(1) shall be a reference to the COF. These amendments showed that Parliament had deliberately excluded HUDC estates from the ambit of s 84A(1). (d)        Even if Parliament had not intended s 84A(1) to exclude privatised HUDC estates, but having done so due to an oversight, this was nevertheless not an omission which could be corrected by the courts. 14        The essential elements of the Reference Date Argument were as follows: (a)        The reference date to determine the age of GH under s 84A(1) was the latest TOP or the latest CSC, as the case might be. (b)        As both the TOP and the CSC issued with respect to GH were the 2002 TOP and the 2002 CSC dated 23 November 2002 and 20 October 2002 respectively, the reference date was 23 November 2002, with the consequence that s 84A(1)(a) was applicable and the consent requirement for the collective sale of the lots and common property of GH was 90% (which the Respondents’ application for the collective sale of GH did not satisfy).",
        "The Judge’s decision on the Appellants’ arguments": "15        The Judge rejected the Applicability Argument on the following grounds: (a)        Parliament intended s 84A(1) of the LTSA to apply to all strata developments, as confirmed by the parliamentary materials concerning the 1999 Amendments, such as the explanatory statement to the Land Titles (Strata) (Amendment) Bill (Bill 28 of 1998) (“the 1998 Amendment Bill”), the second reading speech to the 1998 Amendment Bill (“the Second Reading Speech”) by the Minister of State for Law Mr Ho Peng Kee (“the Minister of State”), the report of the Select Committee on the 1998 Amendment Bill (“the Select Committee Report”), the relevant parliamentary debates and the particular words of s 84A(1) (“the sale of all the lots and common property in a strata title plan”). (b)        The parliamentary materials show that Parliament had intended to peg the requisite majority consent needed for a collective sale (90% or 80%, as the case may be) to the age of the estate or the development (see the Second Reading Speech, the Select Committee Report and the third reading speech to the 1998 Amendment Bill). (c)        The determining factor in s 84A(1) was the age of the strata development. The references to TOP and CSC in s 84A(1) were not intended to exclude privatised HUDC estates from its operation but were merely used as a method to calculate the age of the strata development for the purpose of determining the relevant consent requirement for a collective sale. (d)        Sections 126A(6A) and 126A(6B) of the 2007 Amendments were not intended to change the existing law. Section 126A(6A) was intended to clarify the meaning of “completion” for the purpose of a phased development. Section 126A(6B) was intended to clarify that the reference to the CSC in s 84A(1) was intended to apply to a COF issued under the 1973 BCA and the 1985 BCA in response to public feedback for such a clarification. Accordingly, ss 126A(6A) and 126A(6B) were not intended as a change to the existing legal position that s 84A(1) was applicable to privatised HUDC estates (see [46] below). (e)        The 1995 Amendments (by means of ss 126A and 126B) equated a privatised HUDC estate with any other private strata development, with all its legal attributes and privileges accorded to the flat owners under the law, and free from the restrictions of the HUDC Act. (f)         HUDC estates did not have TOPs or CSCs, and GH did not have either building certification in 1986 when it was completed in 1984, when it was privatised in 1996 or when s 84A(1) was enacted in 1999. The result was that privatised HUDC estates could never meet the requirements for TOPs or CSCs in s 84A(1) if those requirements were applied literally. (g)        Nevertheless, s 9A of the Interpretation Act (Cap 1, 2002 Rev Ed) required that a construction promoting the legislative purpose be preferred over one that did not promote such a purpose. A literal interpretation of s 84A(1), as advanced by the Appellants, would not only frustrate Parliament’s intention to allow owners of privatised HUDC estates to enjoy fully all the benefits of private strata developments, it would also frustrate the legislative objective of the 1999 Amendments to promote the rejuvenation of old estates or developments as privatised HUDC estates, many of which (including GH) were more than 20 years old. (h)        For all these reasons, Parliament did not intend to exclude privatised HUDC estates from the application of s 84A(1) which was expressed to apply to all strata developments. On the contrary, Parliament intended s 84A(1) to apply to privatised HUDC estates (see the Judgment at [18]). 16        The Judge rejected the Reference Date Argument on the following grounds: (a)        Parliament intended to peg the requisite consent requirement to the age of the estate. Based on this criterion, GH was more than 20 years old as it was completed in December 1984. (b)        Even if s 84A(1) were read literally to require a TOP or a CSC, neither the 2002 TOP nor the 2002 CSC was a TOP or a CSC as required by s 84A(1), since neither of them was issued in respect of “any building comprised in the strata title plan”. Furthermore, the 2007 Amendments showed that the phrase “building comprised in the strata title plan” in s 84A(1) was not intended to include common property, and as the 2002 CSC was issued for the upgrading of the common property in GH, it was not a CSC under s 84A(1)(a). (c)        The applicable provision was therefore s 84A(1)(b) and not s 84A(1)(a),ie, the consent requirement was 80% and not 90%.",
        "Issues on appeal": "17        In the present appeal, the Appellants’ case on the two issues we have referred to earlier (see [11]–[12] above) is substantially a reiteration of their case before the Judge. Before us, the Appellants do not dispute the applicability of s 9A of the Interpretation Act. However, the Appellants dispute that a purposive interpretation may be used to determine the two issues in favour of the Respondents and the Intervener. The Appellants contend that s 84A(1) should be interpreted literally to ascertain the intention of Parliament not to apply s 84A(1) to privatised HUDC estates.",
        "The Applicability Argument": "20        In our view, the Applicability Argument rests basically on certain inferences based on the indications or pointers of intent which the Appellants have managed to cull from all the parliamentary materials relating to the 1995 Amendments (privatising HUDC estates), the 1999 Amendments (facilitating collective sales of strata developments), and the 2007 Amendments (fine-tuning the collective sale scheme). The Appellants have submitted that: (a)        When the Government introduced the 1998 Amendment Bill that became the 1999 Amendments, it only had in mind the rejuvenation of strata developments of freehold and 999-year leasehold estates, and not of 99-year leasehold estates (including privatised HUDC estates). (b)        The Government had no motivation on its part to encourage privatised HUDC estates to be solden blocas it had incurred heavy costs subsidising the privatisation exercise so as to enhance the quality of living in HUDC estates rather than to allow the subsidiary proprietors to reap super-profits over and above the right to sell their units individually. (c)        Section 84A(1) deliberately used the TOP and the CSC as reference markers to determine the qualifying age of a strata development for a collective sale so as to exclude strata developments without TOPs or CSCs, or for which TOPs or CSCs would not be issued,ie, HUDC estates. (d)        The Government or Parliament was or must be deemed to be aware that HUDC estates did not have TOPs or CSCs as they were exempted from the need to have such certification under the relevant legislation, and thus privatised HUDC estates would also not have TOPs or CSCs. (e)        These indications and pointers show that the Government had not thought of including privatised HUDC estates for collective sales, and consequently had not provided for it in s 84A(1). 21        We do not agree with the reasoning and conclusion in this submission. In our view, there are no credible indications or pointers of legislative intent in the parliamentary debates in 1995, 1998/1999 and 2007 in relation to the relevant legislation that can assist the Appellants. On the contrary, the indications of legislative intent as to the purpose of s 84A(1) support the Respondents’ position. In our view, the Applicability Argument rests entirely on only one factor and one factor alone,viz, the references to TOPs and CSCs in s 84A(1), and the implications for privatised HUDC strata developments which may not have the TOP or the CSC envisaged by that section. 22        The Appellants’ argument is based entirely on what we may call reverse logic. Because s 84A(1) uses the TOP or the CSC as the means to determine the age of a strata development, it cannot apply to any strata development which does not have a TOP or a CSC. If s 84A(1) cannot apply as such, Parliament could not have intended it to apply to such kind of strata developments. This argument is not necessarily correct because it relies on the means,viz, the TOP or the CSC (to calculate the age of the development in order to determine the consent requirement) to determine the purpose of the legislation, whereas in ascertaining the legislative object or purpose, it is more appropriate to rely on the object or purpose to determine whether the means is appropriate to achieve the object or purpose. If it were the case that Parliament has deliberately and unambiguously selected the TOP and the CSC as the only permissible means for this purpose, the argument would have greater cogency. But the related parliamentary materials show no such indication. On the contrary, they show that the drafting of s 84A(1) was wanting in many respects. 23        However, the proposition that Parliament has deliberately enacted the TOP and the CSC as the only permissible means to determine the age of a strata development lies at the heart of the Applicability Argument. The Appellants have argued that the enactment in 2007 of s 126A(6B) of the LTSA (which provides that in the case of privatised HUDC estates, any reference to the date of the CSC in s 84A(1) shall be a reference to the date of the COF for any building comprised in the strata title plan) shows that it was only in 2007 that Parliament decided to use another marker to determine the age of a strata development under s 84A(1). Without this amendment, it would not be possible to interpret s 84A(1) to equate a CSC with a COF. The Applicability Argument is therefore premised on the literal interpretation of “TOP” and “CSC”. They were the only permitted markers until s 84A(1) was amended in 2007 to provide an alternative marker, the COF. 24        Given the thrust of the Applicability Argument, it is clear that it is directed not against private 99-year strata developments but solely against privatised HUDC estates as the latter do not have TOPs or CSCs whereas the former will have them. This accounts for the Appellants’ position in these proceedings that TOLs and COFs issued for non-HUDC developments are acceptable as the equivalent of TOPs and CSCs under s 84A(1). Of course, this position implies that the references to TOP and CSC in s 84A(1) cannot be interpreted literally, but purposively, to include equivalent building certifications issued before the 1999 Amendments were made to prescribe the collective sale scheme. However, the Appellants are not prepared to go beyond this point in interpreting s 84A(1) purposively. 25        In our view, the issue of the applicability of s 84A(1) to privatised HUDC estates therefore boils down to this question: Why would Parliament want to exclude privatised HUDC estates from the collective sale scheme when the object or purpose of the scheme was to rejuvenate old estates and to improve the quality of housing in Singapore? Parliament must also know that HUDC estates would need rejuvenation sooner than private strata developments, and therefore they should be prime candidates for the scheme. With these observations, we now consider the elements of the Applicability Argument, as summarised in [20] above. 26        As to point (a), the fact that the Minister of State referred only to freehold and 999-year estates in the Second Reading Speech as developments ripe foren blocsales to take advantage of enhanced plot ratios did not mean that the Government was limiting the collective sale scheme estates with such tenures, which point (a) suggests. This point is really a non-starter as there have been many collective sales effected under s 84A(1) of many 99-year leasehold strata developments without any legal objection being raised against their eligibility. 27        In fact, the Minister of State’s statement was not intended as an explanation for the ambit of s 84A(1). A careful reading of the speech shows that the Minister of State’s statement was a response to many appeals and feedback from frustrated owners of flats in such developments. The Government was more concerned with stipulating a fair and workable consent requirement (linked to the age of the strata development) that would achieve the legislative object as well as providing adequate safeguards for minority owners. There is nothing in the explanatory statement to the 1999 Amendments, the Select Committee Report or the parliamentary debates to suggest that the Government would wish to discriminate against flat owners of strata developments with 99-year leasehold titles. 28        In the same speech, the Minister of State also said (Singapore Parliamentary Debates,Official Report(31 July 1998) vol 69 at col 601): I emphasised [referring to another speech he made in Parliament on19 November 1998] that in land-scarce Singapore, such an approach was even more imperative as it would make available more prime land for higher-intensity development to build more quality housing in Singapore. In this connection, we would refer to para 20 of the Appellants’ skeletal arguments which states: By definition, HUDC estates were built to a lower standard than private commercial developments, and upgrading works would always be necessary to bring them to a standard suitable for conversion to a private condominium. Assuming, for the sake of argument, the correctness of this assumption, it supports the Respondents’ case that HUDC estates should be allowed to be solden blocso as to create more quality housing in Singapore, as the Minister of State had emphasised in the Second Reading Speech. Therefore we would not expect the Government to exclude privatised HUDC estates from the collective sale scheme in order to realise this objective. 29        As to point (b), counsel for the Intervener has pointed out that owners of GH did not receive a substantial subsidy from the Government, as out of the conversion costs of $25,000, $20,000 was for the purchase of car park lots from the Housing and Development Board (“HDB”), and $5,000 was for legal and survey fees as well as construction costs to meet prevailing barrier-free requirements of strata-titled properties (Singapore Parliamentary Debates,Official Report(7 July 1995) vol 64 at col 1390). But this is not an important point. What is more relevant is that when the 1995 Amendments were enacted, there was no market for collective sales of 99-year leasehold strata developments, just as there was a moribund market for freehold and 999-year strata developments due to the consent requirement of 100% in order to effect such a sale. Hence, in 1999, when the 1999 Amendments were enacted, the idea of super-profits being made fromen blocsales of privatised HUDC flats by their owners would have been furthest from the minds of both the competent Ministers (the Minister for National Development and the Minister for Law). If the Government had been concerned about letting privatised HUDC flat owners make money from the resale of their flats, it would not have privatised them in the first place. And, if indeed there were instant super-profits to be made by the privatised HUDC flat owners, there would be no legitimate reason for the Government to begrudge them this windfall (having agreed to grant them all the privileges of private owners, including the right to resell their units whether individually or collectively). The Government would gain nothing from such a “dog in the manger” approach but, instead, would lose the economic and social benefits of having more quality housing being developed by private developers. 30        As to points (c), (d) and (e), it is true that s 84A(1) does use the reference markers “TOP” and “CSC”. But, whether Parliament used themdeliberatelyto indicate expressly its intention to exclude privatised HUDC estates (which enjoy the same rights as private developments), is altogether another issue. The fact that the TOP and the CSC were merely new names for the TOL and the COF under the previous corresponding legislation shows, in our view, that the reference only to the TOP and the CSC by name is more likely the product of faulty or inappropriate drafting, We have mentioned earlier (see [24] above) that the Appellants have accepted that the TOL and the COF could be treated as the TOP and the CSC for the purposes of s 84A(1). This would imply that,to this extent, those references in s 84A(1) cannot be applied literally. 31        This conclusion raises the question as to whether there are any other words in s 84A(1) or indeed in any of the other sections in Pt VA of the LTSA that cannot or should not be applied literally because of faulty or inappropriate drafting. In this connection, we should mention that inNg Swee Lang v Sassoon Samuel Bernard[2008] 2 SLR 597(“Ng Swee Lang”) at [32], this court decided that another part of s 84A(1),viz, the words “which specifies the proposed method of distributing the sale proceeds to all the subsidiary proprietors (whether in cash or kind or both)”, were mere surplusage and were includedex abundanti cautela. We accept that the reference markers “TOP” and “CSC” in s 84A(1) are not surplusage as they have the function of providing a definitive method of resolving any dispute relating to the age of a strata development for the purpose of determining the consent requirement for a collective sale. It is necessary to highlight this issue to show that s 84A(1) alone suffers from a number of problems on its drafting. 32        In our view, the critical issue before us is whether, irrespective of s 9A of the Interpretation Act, Parliament intended s 84A(1) to apply to strata developments, whatever their tenures may be. It was clear to the Judge, and it is equally clear to us, that this was the legislative intention. Indeed, the Minister of State has stated this unambiguously in the Second Reading Speech (Singapore Parliamentary Debates,Official Report(31 July 1998) vol 69 at col 605): Sir, the new scheme will apply to three types ofstratadevelopments:those registered under the Land Titles (Strata) Amendment Actwhere the owners own their units and share in the common property, which is the vast majority ... [emphasis added] It is not disputed that GH was registered as a strata development in November 1996 when it was issued with a strata title plan. Therefore, in 1999, the owners of the strata flats in GH were already members of the “vast majority” the Minister of State had in mind in the Second Reading Speech. 33        In our view, Parliament clearly intended s 84A(1) to apply to all strata developments registered under the LTSA, and therefore s 84A(1) applies to GH. Accordingly, we reject the Applicability Argument.",
        "TheReference Date Argument": "19        The Appellants’ contention here is that s 84A(1) must be applied fairly and strictly in accordance with its terms and not with the benefit of 20/20 hindsight so as to impute the intention of Parliament in 2007 to the legislation existing in 1999. Counsel for the Appellants also made the following arguments: (a)        Parliament must be assumed to know in 1998–1999 that HUDC estates would need upgrading works before they could be privatised and that new CSCs would be issued for such works. Parliament would also have known that privatised HUDC estates might add new buildings and other facilities and that that would require new TOPs to be issued for such new works. On that basis, Parliament must be deemed to know the legal consequences of using the expressions “TOP” and “CSC” in s 84A(1). The Select Committee did not change the reference date formula as it realised that “TOP” and “CSC” were technical terms, and the normal rule of interpretation is to give technical terms their full technical meaning. They cannot be used as surrogates for a broader test. It is also significant that the phrases “the latest” TOP and “the latest” CSC were used in the 2007 Amendments. (b)        The “completion” of a strata development cannot be used as a reference point (as argued by the Respondents) as there is no legislative basis for it. The word “completion” is an ambiguous term, and it is well established in the relevant legislation that “completion” is normally defined as the date of the TOP or the CSC as they mark objective points of reference. (c)        There was a gap in s 84A(1) which the 2007 Amendments filled via s 126A(6B) by deeming a COF issued under the previous building legislation as a CSC under s 84A(1).",
        "Our decision": "",
        "The Reference Date Argument": "34        The Reference Date Argument proceeds on the basis that s 84A(1) applies to privatised HUDC estates. On this basis, any application for the collective sale of any privatised HUDC estate has to meet all the requirements of s 84A(1). In the case of GH, since GH has been issued the 2002 TOP and the 2002 CSC, the references to TOP and CSC have been satisfied. But, as these certifications were issued only on 23 November 2002 and 27 October 2002, less than ten years have passed since their issue, and therefore the collective sale application falls within s 84A(1)(a) (which provides for a 90% consent requirement) and not s 84A(1)(b) (which provides for an 80% consent requirement). For this reason, the Board and the Judge were both wrong in deciding that the applicable provision was s 84A(1)(b). 35        We have mentioned earlier that the Judge rejected this argument on the ground that the 2002 TOP and the 2002 CSC were not a TOP or a CSC in terms of s 84A(1) as neither of them was issued in respect of a “building comprised in the strata title plan”. The 2002 TOP was issued only for a clubhouse and a swimming pool, neither of which was comprised in the strata title plan for GH. The 2002 CSC was issued only for the upgrading works to the common property which, under the 2007 Amendments, was excluded from the “building comprised in the strata title plan”. 36        Before us, the Appellants have made the following submissions under the Reference Date Argument: (a)        The 2002 CSC issued for GH in November 1996 referred specifically to all the residential blocks in GH. It was, self-evidently, a CSC for the buildings in GH which would have been comprised in the strata title plan issued to GH, and therefore, it was a CSC for the buildings comprised in the strata title plan. (b)        The strata title plan issued for GH in November 1996 was for all the residential units and the common property in the buildings comprised in the strata title plan. Therefore the Judge was wrong to interpret ss 126A(6A) and 126A(6B) in the 2007 Amendments to read down the meaning of the expression “strata title plan” in s 84A(1) as enacted in 1999. 37        On point (a), we agree that the Judge was correct to look at the substance rather than the form of the certification. It is our view that the 2002 CSC was not a CSC for the purposes of s 84A(1) as enacted in 1999 or amended in 2007. Although it was expressed to be for the four blocks of 20-storey flats and the six blocks of four-storey maisonettes (which undoubtedly are buildings and would be buildings comprised in the strata title plan issued for GH), the heading of the 2002 CSC was “Description of the “building(s)/building works”. Accordingly, the 2002 CSC could be for buildings or building works. It is therefore necessary to find out what the 2002 CSC actually certified and not what it described. On this question, there is no dispute that the 2002 CSC was meant to refer to the statutory completion of the upgrading works to the common areas in the buildings referred to. 38        The 2002 CSC was not a certification with respect to the completion of any building comprised in a strata title plan, but a certification of the completion of upgrading works in those buildings. The Appellants’ argument involved a literal reading of the 2002 CSC to give it an accidental fit with the CSC referred to in s 84A(1). But this does not avail the Appellants. The 2002 CSC was not a s 84A(1) CSC because it was not issuedon completion of any buildingcomprised in the strata title plan issued for GH; it was a CSC issuedon the completion of upgrading works to a completed building. 39        The dispute over the nature of the 2002 CSC shows that there are different types of CSCs issued for different purposes and different kinds of works in relation to buildings and structures which may not be buildings, such as a swimming pool, under the Building Control Act (Cap 29, 1999 Rev Ed). In this respect, it may be noted that the Appellants have not argued before us that the 2002 TOP was not a TOP referred to in s 84A(1)(a) (ie, a TOP issued on completion of any building comprised in a strata title plan.) This was an appropriate decision on the part of counsel for the Appellants, as the 2002 TOP was issued only for the clubhouse and the swimming pool which did not exist when the strata title plan was issued in November 1996. It was not a TOP under s 84A(1) in 1999 or in 2007. 40        In the light of these findings, it is not necessary for the disposal of the issues in this appeal to consider another argument of the Appellants on the meaning and effect of the references to “the latest” TOP and “the latest” CSC in s 84A(1). These words, it is argued, envisage the issue of new TOPs and CSCs for strata developments from time to time after their completion (see [19(a)] above), where the Appellants refer to new CSCs being issued for upgrading works and new TOPs for new buildings and other facilities, in the context of the privatisation of HUDC estates). It is also argued further that the effect of a new TOP or a new CSC issued for a strata development would have the effect of resetting the reference date of the age of the building under s 84A(1) to the date of the latest TOP or the latest CSC. 41        However, given the importance of this issue in relation to collective sales under s 84A(1), it is desirable that wegive ourviews on the Appellants’ submissions. In our view, there cannot be any resetting of the reference date to zero (as described by the Board) unless the latest TOP or the latest CSC is issued with reference to “the completion of any building comprised in the strata title plan” for the strata development. The references to TOP and CSC in s 84A(1) are references to a TOP and a CSC for thecompletion of an entirestrata development, and not for building works carried out in the development from time to time. The position is clear in the case of a strata development with one building. In the case of multiple buildings or a development in phases, the relevant certification would be that for the last building to be completed. Thus, in the case of a strata development that is completed in phases, the latest TOP or the latest CSC would be that issued for the completion of the last phase in that development. Applying these conclusions to GH (on the assumption that GH had been issued either a TOL or a COF on its completion), the latest TOP or the latest CSC would be that issued for the completion of the blocks in December 1984 (see [23] of the Judgment and [2] above). 42        In our view, the issue of new TOPs or CSCs to strata developments does not have the extensive effect advocated by the Appellants. A new TOP or a new CSC cannot reset the date for the calculation of the age of the development unless the TOP or the CSC is for the completion of a new development. This is a question of fact which can only be determined on a case-by-case basis, depending on the extent of the changes made to the existing development. The Board has dealt with this point in its grounds of decision (Wiener Robert Lorenz v Chua It Poh/Ng Lee Beng[2007] SGSTB 6) (in connection with determining the age of GH) with such clarity that we can do no better than to quote its words at [29]: The Board is of the view that the issuance of the [2002] TOP and the [2002] CSC did not affect the age of the estate. The [2002] CSC was issued on privatisation as the owners were now required to comply with the requirements such as fire safety. [The 2002] TOP was specifically issued when the clubhouse and swimming pool were built. With or without the last amendment to the [LTSA], the Board is of the view that the age of the development cannot be re-set back to year zero merely because parties had built a structure which required a TOP or a CSC to be issued. The “birth date” of the development cannot be rejuvenated merely because some structure is built which required a TOP or a CSC. Not every single shed or toilet built for the common good of all would restart the time line. [In the case of GH] which was initially exempted from complying with the requirements of the Building Control Act or the regulations, the date in which owners were permitted to occupy the premises must be the start time from which the Board will calculate the years whether the estate falls within section 84A(1)(a) or (b). The Board must disregard the [2002] TOP for the construction of the clubhouse and swimming pool and [the 2002] CSC for the privatisation [of] the estate issued to [GH] as being the time reference to calculate whether it was above or below 10 years. 43        There is, however, another submission in the Applicability Argument which we wish to comment on, even though, again, it is not necessary for the disposition of the main issues in the dispute before us. We refer to the argument (at [18(g)] above) that the Judge was wrong to accept the argument of the Respondents and the Intervener (see [25] of the Judgment) that the words “strata title plan” in s 84A(1) excluded the common property from any building comprised in a strata title plan, and thereby excluded the relevance of the 2002 CSC as a CSC under s 84A(1) and that this was a clarification and not an amendment. In our view, this was a clarification of the meaning of the words “strata title plan” in s 84A(1), but it was not intended to have prospective effect and was intended to apply to TOPs or CSCs issued for buildings or other parts of the strata development that were, or comprised, common property. In this sense, it may be said to be an amendment. For example, the 2002 TOP issued with respect to the clubhouse and the swimming pool would be a TOP envisaged by the 2007 Amendments. However, in our view, these amendments do not affect the meaning of the words “strata title plan” in relation to the certification of the “completion of any building ...comprised in the strata title plan” [emphasis added] in s 84A(1) as it existed in 1999.For these reasons, the Appellants’ submission that the insertion of the words “not being any common property” in s 84A(1) in 2007 cannot detract from the meaning of those words in s 84A(1) before its amendment in 2007 is correct. However, this argument does not avail the Appellants in the outcome of this appeal.",
        "GH has no TOP (TOL) or CSC (COF)": "44        The net result of our findings above is that GH has never had and still does not have a TOP or a CSC (or its equivalent, a TOL or a COF). Therefore, in spite of the concession by the Appellants that the certifications of TOL and COF are equivalent to TOP and CSC, the Respondents can never satisfy the requirements of s 84A(1) for such certifications. 45        The problem of privatised HUDC without any TOP (or TOL) or CSC (or COF) in the context of the collective sale scheme in s 84A(1) was brought to the attention of the Government in the feedback exercise. This is set out in paras 11.3 and 11.4 of the Ministry of Law’s “Response to Feedback Received from Public Consultation on Proposed Changes to the En Bloc Sale Legislation” as follows: Feedback 11.3      It was suggested that provisions be introducedto make clearthe milestones to use to determine the age of a privatised HUDC [estate] that is applying for en bloc sale assome HUDC developments may not have TOP or CSC. Response 11.4      We agreed with the suggestion andhad providedin the legislation that in determining the age of a privatised HUDC estate that is applying for an en bloc sale under the [LTSA], reference can, in addition to the date of the latest [TOP] or the latest [CSC], also be taken fromthe date of completion of construction of the building as certified by the relevant authority(eg. HDB). [emphasis added] 46        The provisions referred to by the Ministry of Law are ss 126A(6A) and 126A(6B) in the 2007 Amendments (see [10] above). It is thus clear from the feedback and the response that these amendments were meant to clarify the manner or the means to determine the age of the strata development (and also the nature of the TOP or the CSC by the omission of any TOP or CSC for the common property). However, it is not so clear that ss 126A(6A) and 126A(6B) (which do not refer to the term “TOP”) are so worded with the intention to clarify themeaningof the term “CSC” in s 84A(1). It is not disputed that the CSC is a technical term which should be given a technical meaning. Whilst it may be correct to argue that s 126A(6B) merely clarified the meaning of the term “CSC” to include the COF (and, as a matter of law, they are the same, the CSC having replaced the COF only in name), it may not be possible to argue that the phrase “the date of completion … as certified by the relevant authority” in s 126A(6A) is factually or legally the same as a CSC, unless there is evidence that this date has always been the same as the date of the COF. Accordingly, we think that s 126A(6A) was more than a clarification of themeaningof the CSC. Therefore, in spite of the Ministry’s response that the 2007 Amendments had provided the clarification of “the milestones to use to determine the age of a privatised HUDC [estate] that is applying for en bloc sale as some HUDC developments may not have TOP or CSC” (see [45] above), what the Ministry probably meant was that the clarification would have prospective rather than retrospective effect. In other words, it was more an amendment for future cases rather than a clarification of past cases. In our view, it is probable that the draftsman did not have in mind a case like the present where the privatised HUDC estate has no TOP or CSC for the purposes of s 84A(1). 47        However, we wish to emphasise that the enactment of s 126A(6A) did not show, as contended by the Appellants, that Parliament had in 1999 deliberately excluded privatised HUDC estates from the operation of s 84A(1). We do not think it is legitimate to infer past parliamentary intention in this way (see [22] above).",
        "The application of the purposive interpretation": "48        Given that the purpose of the 1999 Amendments is clear from an examination of the parliamentary materials, particularly the Second Reading Speech, but that the means to calculate the age of the strata development in order to determine whether s 84A(1)(a) (the 90% consent requirement) or s 84A(1)(b) (the 80% consent requirement) is applicable is under-inclusive, the question arises as to whether it is proper for the court to interpret s 84A(1) purposively to use some other means or reference point to determine the age of GH other than the issuance of a TOP or CSC. 49        The Judge has dealt with this question at [19] and [20] of the Judgment by first stating that s 9A of the Interpretation Act required a construction that promoted the legislative purpose or object of the legislation be preferred over one that did not. Section 9A(1) provides as follows: In the interpretation of a provision of a written law, an interpretation that would promote the purpose or object underlying the written law (whether that purpose or object is expressly stated in the written law or not) shall be preferred to an interpretation that would not promote that purpose or object. The Judge also reminded himself that the canon of “purposive interpretation” is not a password like “open sesame”, and that the court must keep an eye on what purposes were involved, and whose purposes were being served (citingPP v Low Kok Heng[2007] 4 SLR 183at [39]–[45]). He rejected the Appellants’ argument that applying a purposive interpretation to simply use the age of GH to determine the consent requirement in s 84A(1) would be a strained construction of s 84A(1)(a), as even so, there were circumstances in which a strained construction was justified. The Judge referred to the following passage from Francis Bennion,Bennion on Statutory Interpretation(Lexis Nexis, 5th Ed, 2008) (“Bennion”) at p 458: Section 158. When strained construction needed There are broadly four reasons which may justify (and in some cases positively require) the strained construction of an enactment: (a)        a repugnance between the words of the enactment and those of some other enactment; (b)        consequences of a literal construction so undesirable that Parliament cannot have intended them; (c)        an error in the text which plainly falsifies Parliament’s intention; or (d)        the passage of time since the enactment was originally drafted. COMMENT ONCODE S 158 This section states in very broad outline the main reasons why sometimes a strained construction of an enactment is necessary. In many actual cases, the reasons overlap. Each reason is related to the intention of Parliament (the only ultimate criterion). As Blackstone pointed out, it is not always enough for a lawyer to sayita lex scripta est(thus the law is written). 50        We agree with the Judge’s approach in interpreting s 84A(1) purposively to decide the two issues before us in favour of the Respondents and the Intervener. We agree that the parliamentary materials and the wording of s 84A(1) itself confirm that: (a)        the collective sale scheme in Pt VA of the LTSA was intended to apply to all strata developments, including privatised HUDC estates; (b)        the age of the development was the determinative criterion of the consent requirement in ss 84A(1)(a) and 84A(1)(b); (c)        the TOP and the CSC were merely a convenient and reliable means to determine the age of a strata development; and (d)        the lack of means should not be allowed to defeat or frustrate the legislative purpose or object of the 1999 Amendments. InNg Swee Lang([31]supra), this court emphasised at [6] that the two main qualifying conditions for a collective sale are (a) the age of the subject property; and (b) the share value and the total area held by the majority owners. 51        In our view, the Judge’s interpretation, even though somewhat strained, is justified because applying the TOP or the CSC as the only means to determine the age of a strata development would falsify Parliament’s intention (in the words ofBennion, see [49] above).It would defeat the legislative purpose of privatising HUDC estates – to accord the flat owners all the privileges enjoyed by owners of private developments. This is a case where a literal application of the TOP and the CSC prescribed by s 84A(1) would lead to the frustration of the 1995 Amendments and the 1999 Amendments. 52        The Appellants have argued that the concept of “completion” is ambiguous and to use it to determine the age of a strata development would lead to uncertainty. This is undesirable as the uncertainty could affect the freedom of flat owners to live where they like and not be subject to the wishes of the majority. We have great sympathy with this argument, and might be inclined to accept it if the concept of completion is used to apply to all strata developments. But this is not the case here. The case here concerns one type of strata development which, by legislation, had been deprived of the very means prescribed in s 84A(1) to determine its age. In the present case, the application of the concept of “completion” cannot possibly lead to any uncertainty as far as the owners of GH are concerned since in fact the last blocks of buildings in GH were completed and occupied by the residents more than 20 years ago. In our view, this is a rare case and a rare example of acasus omissuscreated by what we believe to be faulty or inappropriate drafting and, in our judgment, it is within the legitimate bounds of purposive interpretation to make good such an omission. 53        It is, of course, possible to argue that there are other means to determine the age of GH for the purposes of s 84A(1) which would be more certain than using the date of its completion as a factual criterion. For example, it may be argued that the age of GH should be determined by reference to the last date on which the residents of GH were allowed to take possession of their flats as occupiers (as this would simply be a question of fact which can be verified by a certificate from the HDB). Another reference point of sufficient certainty to determine the age of GH could be the date of the latest certification for any building comprised in a strata title plan. If this reference point is used, the reference date would be the date of the strata title plan for GH, which was issued in November 1996, which would be just over ten years past the date of the application to the Board for the collective sale of GH. 54        But we wish to emphasise that the availability of other means not expressed in s 84A(1) merely confirms that specifying the TOP and the CSC as the only reference points for determining the age of a strata development was a drafting flaw which, if not corrected by the court, would defeat the legislative purpose of the 1999 Amendments. In such a case, the court is entitled to apply the purposive construction to correct the drafting error. The Respondents have referred to a series of very recent English cases where the English courts have adopted a purposive construction to add words to a statute to achieve the purpose intended by Parliament,eg,Inco Europe Ltd v First Choice Distribution[2000] 1 WLR 586 (“Inco Europe Ltd”),Regina (Confederation of Passenger Transport UK) v Humber Bridge Board[2004] QB 310 andRegina (Government of the United States of America) v Bow Street Magistrates’ Court[2007] 1 WLR 1157. 55It is not necessary for us to rely on these decisions on purposive interpretation which are based on common law principles of interpretation since the basis for purposive interpretation in Singapore is described in s 9A of the Interpretation Act in very broad terms: seeConstitutional Reference No 1 of 1995[1995] 2 SLR 201;L & W Holdings Pte Ltd v MCST Plan No 1601[1997] 3 SLR 905;Planmarine AG v Maritime and Port Authority of Singapore[1999] 2 SLR 1;PP v Loo Kun Long[2003] 1 SLR 28;The Seaway[2005] 1 SLR 435;PP v Low Kok Heng([49]supra); andSiow Doreen v Lo Pui Sang[2008] 1 SLR 213. However, the English decisions are still useful guides on the relevant factors to take into account in order to determine when the courts will be prepared to purposively construe an Act by reading into it the words that are necessary and apt to give effect to the legislative purpose or object. 56This conclusion is consistent with the view of the Building and Construction Authority (“BCA”) as evidenced by a letter dated 23 April 2007 confirming that, for practical purposes, in the case of GH, “the date of completion of the buildings can be taken as equivalent to the [TOP] issued by the [BCA]”. In our view, this letter does not mean that the BCA was deciding, as a matter of law or statutory construction, that the date of completion was or equivalent to the TOP, but simply that, if it were necessary to determine the age of a strata development which did not have a TOP or a CSC, the date of completion of the development would, in a case such as this, be an appropriate means for that purpose. 57InWentworth Securities Ltd v Jones[1980] AC 74, Lord Diplock stated (at 105–106) that three conditions had to be fulfilled before the court could read words into an Act which were not expressly included in it,viz: (a) it was possible to determine from a consideration of the provisions of the Act read as a whole precisely what the mischief was that Parliament sought to remedy with the Act; (b) it was apparent that the draftsman and Parliament had by inadvertence overlooked, and so omitted to deal with, the eventuality that was required to be dealt with so that the purpose of the Act could be achieved; and (c) it was possible to state with certainty what the additional words would be that the draftsman would have inserted and that Parliament would have approved had their attention been drawn to the omission. InInco Europe Ltdat 592, Lord Nicholls of Birkenhead framed the third requirement in a broader fashion as follows: that the court must be abundantly sure of “the substance of the provision Parliament would have made, although not necessarily the precise words Parliament would have used, had the error in the Bill been noticed”. In our view, given the broad wording of s 9A of the Interpretation Act, the broader formulation of Lord Nicholls is more consonant with the legislative purpose of that provision. 58        Applying this test, the court must ask itself what was the substance, and not the precise words, of the provision that Parliament would have used, if the drafting error had been brought to its attention. In the present case, the substance is clear enough in the context of the function of the TOP and the CSC, the dating of which is to determine the age of the strata development. The TOP indicates that the building for which it is issued is ready for occupation. The CSC indicates that the building has satisfied all the requirements of the Building Control Act and is “completed” in terms of that Act. It is not disputed that, under the Building Control Act, if a TOP is required to be issued, it is always issued before the CSC. Therefore,in the absence ofa TOP (or its statutory equivalent, a TOL) or a CSC (or its statutory equivalent, a COF), the substance of the omitted provision should reflect the function of the TOP or the CSC and the words to be read into s 84A(1) in relation to a situation where there is neither a TOP or a CSC (or their statutory equivalent) should refer to the date when the building authority would have regarded the development as having been completed and fit or ready for occupation. This is a question of fact that can easily be determined by a certificate from the HDB. 59        In the case of GH, it was completed and ready for occupation in December 1984, more than 20 years before the date of the application for its collective sale. It is true that the references to TOP and CSC in s 84A(1) are for TOPs and CSCs in relation to the building or buildingscomprised in a strata title plan, but since no TOP or CSC has ever been issued to GH, we think that it is legitimate to use the date of completion and occupation of GH to determine its age rather than the strata title plan issued to GH in November 1996. The reason is that the 1999 Amendments were intended to permit collective sales of strata developments by reference to their age. But even if we adopt a formalistic or a literal interpretational approach in relation to the reference to the strata title plan in s 84A(1), it would still make no difference to the outcome of this appeal. The fact remains that GH would still be more than ten years old at the date of the application for its collective sale. 60        So much for purposive interpretation. We would conclude our consideration of the issues in this appeal and the arguments of counsel for the parties by adverting to one other issue that has not been raised in the proceedings below by the Respondents or the Intervener. Since, for this reason, we did not have the benefit of counsel’s arguments on this issue, we are unable to take it further except to make the observation that interpreting s 84A(1) of the LTSA to exclude only privatised HUDC estates from its operation, as contended for by the Appellants, might engage Art 12 of the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint) since it might result in the discrimination of one type of property owners,viz, privatised HUDC flat owners, even though they have the same rights and privileges as owners of any other strata developments (including 99-year leasehold developments). It is open to argument that if Parliament had deliberately excluded privatised HUDC estates from the 1999 Amendments, it could run the risk of the collective sale scheme under Pt VA of the LTSA being nullified for unconstitutionality, unless it could justify the discriminatory legislation. We only say that there is such a risk, which cannot be discounted. Given that there is such a risk, the Government might not have wished to run that risk since, as we have pointed out earlier, it had nothing to lose but everything to gain in terms of achieving the objectives of the collective sale scheme by allowing privatised HUDC estates to be solden blocunder s 84A(1) of the LTSA. 61        To summarise, our conclusions on the two issues before us are as follows: (a)        Section 84A(1) applies to all strata developments, including privatised HUDC estates. (b)        The age of the strata development is the touchstone of the collective sale scheme. (c)        The TOP and CSC referred to in s 84A(1) are merely a means to determine the age of the development and whether s 84A(1)(a) or s 84A(1)(b) is the applicable provision to a collective sale. (d)        The use of “TOP” and “CSC”(as a reference to their technical meanings) ins 84A(1) was a drafting flaw as a literal interpretation and application thereof would have created acasus omissus(in respect of privatised HUDC estates) and frustrated the legislative purpose of s 84A(1) to apply to all strata developments, which by definition included privatised HUDC estates. (e)        A purposive interpretation may be applied to rectify the flaw by reading into s 84A(1)the necessary test or words to enablethe age of GH to be determined by reference to the date on whichGH was completed and fit or ready for occupation.",
        "Conclusion": "62        In the light of the considerations summarised above, we agree with the Judge’s decision that the consent qualification for the collective sale of GH was 80% and not 90%. For this reason, the appeal is dismissed. There will be no order as to costs on appeal. With respect to the costs in the court below, the Appellants are to pay half the costs of the Respondents and the Intervener. The usual consequential orders follow."
    }
}