{
    "case_title": "ADF v Public Prosecutor",
    "ncitation": "[2009] SGCA 57",
    "coram": "Andrew Phang Boon Leong JA; \n      V K Rajah JA; \n      Woo Bih Li J",
    "sections": {
        "Introduction": "217    I have read both the above judgments by my brother judges closely and note that they have arrived at diametrically opposed conclusions in so far as the specific sentences with respect to some of the charges (viz, the ninth, 12th and 13th charges) as well as the overall sentence to be meted out to ADF are concerned. Having reflected at some length on the judgments, I have come to the conclusion that the specific sentences (in so far as the 12th and 13th charges are concerned) as well as the overall sentence ought to be enhanced by the quantum stated in the judgment of V K Rajah JA and, more importantly, for the reasons stated in that judgment. I am also of the view that Rajah JA’s decision to affirm the sentence for the 9th charge is a correct one. However, as there has been a sharp difference in views between both my brother judges, I am of the view that it would be appropriate to add a few observations of my own.",
        "The appeal against the convictions": "",
        "The relevant provisions": "14     All the convictions were in relation to s 323 of the Penal Code read with s 73(2) of the Penal Code. The relevant provisions are reproduced below: 73. —(1) Subsection (2) shall apply where an employer of a domestic maid or a member of the employer’s household is convicted of — (a)    an offence of causing hurt or grievous hurt to any domestic maid employed by the employer punishable under section 323, 324 or 325 … … (2)    Where an employer of a domestic maid or a member of the employer’s household is convicted of an offence described in subsection (1)(a), (b), (c), (d) or (e), the court may sentence the employer of the domestic maid or the member of his household, as the case may be, to one and a half times the amount of punishment to which he would otherwise have been liable for that offence. … 321.  Whoever does any act with the intention of thereby causing hurt to any person, or with the knowledge that he is likely thereby to cause hurt to any person, and does thereby cause hurt to any person, is said “voluntarily to cause hurt”. … 323.  Whoever, except in the case provided for by section 334, voluntarily causes hurt, shall be punished with imprisonment for a term which may extend to one year, or with fine which may extend to $1,000, or with both. 15     When the Penal Code was amended in 2008, the penalties for s 323 were increased to imprisonment for a term which may extend to two years, or with a fine which may extend to $5,000, or both. However, these amendments are not applicable to this case as the subject offences were committed prior to the amendments coming into force. Therefore, the maximum sentence for each of the offences on which the accused has been convicted remained one and a half years’ imprisonment or a fine of up to $1,500, or both.",
        "Appellate intervention": "Legal principles on appeal against conviction or acquittal 16     Before I deal with the appeal on the convictions, I ought to perhaps reiterate that an appellate court has a limited role when it is asked to assess findings of fact made by the trial court. In summary, the role is circumscribed as follows: (a)     Where the finding of fact hinges on the trial judge’s assessment of the credibility and veracity of witnesses based on the demeanour of the witness, the appellate court will interfere only if the finding of fact can be shown to be plainly wrong or against the weight of evidence: seePP v Mohammed Liton Mohammed Syeed Mallik[2008] 1 SLR 601at [32] andYap Giau Beng Terence v PP[1998] 3 SLR 656(“Yap Giau Beng Terrence”) at [24]. An appellate court may also intervene, if, after taking into account all the advantages available to the trial judge, it concludes that the verdict is wrong in law and therefore unreasonable:Jagatheesan s/o Krishnasamy v PP[2006] 4 SLR 45(“Jagatheesan”)at [43]. (b)     Where the finding of fact by the trial judge is based on the inferences drawn from the internal consistency (or lack thereof) in the content of witnesses’ testimony or the external consistency between the content of their testimony and the extrinsic evidence, an appellate court is in as good a position as the trial court to assess the veracity of the witness’s evidence. The real tests are how consistent the story is within itself, how it stands the test of cross-examination, and how it fits in with the rest of the evidence and the circumstances of the case: seeJagatheesanat [40]. If a decision is inconsistent with the material objective evidence on record, appellate intervention will usually be warranted. (c)     An appellate court is as competent as any trial judge to draw any necessary inferences of fact from the circumstances of the case: seeYap Giau Beng Terenceat [24]. Legal principles on appeal against sentences 17     InPP v UI[2008] 4 SLR 500, this Court summarised the legal principles relating to appellate review of sentences. The Court stated at [12] that an appellate court will not ordinarily disturb the sentence imposed by the trial court except where it is satisfied that: (a)    the trial judge erred with respect to the proper factual basis for sentencing; (b)    the trial judge failed to appreciate the materials placed before him; (c)    the sentence was wrong in principle; or (d)    the sentence was manifestly excessive or manifestly inadequate, as the case may be. 18     In relation to the question of what is manifestly excessive or manifestly inadequate, this Court accepted that the threshold would only be met if there was a need for a substantial alteration to the sentence rather than an insignificant correction to remedy the injustice.",
        "Significance of acquittal on some of the charges": "19     The Judge acquitted ADF of seven charges of sexual abuse and one charge of physical abuse. In addition, the Judge amended the first charge of physical abuse after accepting ADF’s version of events which was that the incident happened in the morning (as opposed to at night). The Defence argued that the inference to be drawn from the acquittals and amendment of charge was that the victim’s evidence was in all likelihood not unusually convincing for those charges. As such, the acquittals and amendment should seriously affect the victim’s credibility and the Prosecution’s overall case. In support of this proposition, the Defence cited my decision inXP v PP[2008] 4 SLR 686. 20     Additionally, the Defence citedJagatheesanto say that whilethere was no absolute prohibition or legal impediment in convicting an accused on the evidence of a single witness, the court had to be mindful of the inherent dangers of such a conviction, and ought to subject the evidence at hand to close scrutiny regardless of whether the witness was an accomplice or an interested witness. The witness’s testimony also had to be so compelling that the Prosecution’s case was proven beyond reasonable doubt solely on the basis of that witness’s testimony. While acknowledging that minor discrepancies in a witness’s testimony should not be held against the witness in assessing his or her credibility, ADF’s counsel argued that a “systematic and widespread pattern of many inconsistencies coming together” can destroy the credibility of that witness.[note: 11]According to his counsel, the fact that ADF was acquitted of several charges meant that there was a “systematic and widespread pattern of many inconsistencies coming together” which ought to destroy the victim’s credibility altogether.[note: 12]The Judge should not have accepted any part of her evidence unless there was corroboration from independent and extrinsic sources. 21     I do not see any force in these arguments. InXP v PP, nineteen charges were initially brought against the accused by seven different complainants, concerning outrage of modesty offences under s 354 of the Penal Code. Of these, ten charges were stood down. Out of the remaining charges, the appellant was acquitted of six and convicted of three charges. On appeal, the convictions were set aside. On the trial judge’s decision to only give grounds of decision for the three charges on which she convicted the accused, I had observed, at [65]: Procedurally, this approach cannot be technically faulted, especially considering the length of the trial and the sheer volume of evidence produced.However, in the context of this case, where all the charges were similar in nature and the Defence was strenuously arguing that all four complainants had colluded to make the accusations falsely, it was, in my view, imperative for the Judge to explain why she reached different decisions on six of the nine similar charges. Without going so far as to say that the acquittals on the six charges would themselves constitute a reasonable doubt as to the three convictions, they certainly would affect the complainants’ collective credibility and the Prosecution’s overall case. [emphasis added] 22     The facts inXP v PPwere entirely different. It was a case where several similar charges emanated from a few complainants who also gave evidence to corroborate each other. The Defence alleged collusion amongst the complainants. The district judge dismissed the allegation of collusion and convicted the accused on the allegations made by two of the complainants. She found that the evidence of these complainants was corroborated by the evidence of the other complainants. However, she had, nevertheless, apparently found the testimony of these complainants not credible in relation to the charges involving them and acquitted the accused of those charges. On appeal, I held that if the district judge did not find the testimony of the other complainants credible, she could have erred in holding that there was no collusion amongst the complainants. The district judge thus left a legal void by not stating her reasons for acquitting the appellant on the other charges especially since she had dismissed the allegation of collusion. 23     The present case concerns allegations from only one complainant. If the Judge found that a particular offence was not proven beyond a reasonable doubt, it did not mean that the Judge must have found the witness to be one who lacked credibility. By way of illustration, I refer toFarida Begam d/o Mohd Artham v PP[2001] 4 SLR 610(“Farida Begam”), where the employer was acquitted of some charges and convicted on only one, the trial judge clearly stated that the appellant’s acquittal on three other charges was not due to the complainant’s unreliability but because of the lack of specific details in her evidence. Yong Pung How CJ unhesitatingly affirmed the convictions on appeal. 24     In the present case, the Judge has lucidly stated, at [5]-[8] of GD 1: … The hearing spanned 28 days, with [the victim] being on the witness box for more than eight days. Much of the time was spent on [the victim’s] working conditions such as the diary schedules and records she had to maintain, and whether she had the means to leave the flat. She was also cross-examined extensively on her conduct during the police investigations, e.g., her statements to the police officers who dealt with her, as well as the doctors who had examined her. It came as no surprise that inconsistencies and omissions surfaced. There were inconsistencies over dates, places and events, and they led to the acquittals that followed, where the deficiencies and flaws created reasonable doubts in the prosecution’s case. For the charges on which [ADF] was convicted, and in particular the convictions which are under appeal, I was mindful that the evidence was not beyond criticism.There were inconsistencies and omissions in the narratives to the different police officers and the doctors, and variations in the narratives. However, I was satisfied that they were not critical, and they did not detract from the basis on which I have found [ADF] to be guilty on the charges. [emphasis added] Here, while the Judge noted that there were inconsistencies in the victim’s evidence, he did not say that her evidence was unbelievable or concocted. Instead, he expressly stated that the inconsistencies “were not critical, and they did not detract from the basis on which I have found [ADF] to be guilty on the charges”: at [8] of GD 1. In my opinion, it is plain that even though ADF was acquitted of some charges this does not mean that the victim was not a credible witness. Rather, it appears to me that the Judge was guided by caution and not the victim’s credibility, or lack thereof, in acquitting ADF of those charges. 25     In any event, the fact that inconsistencies in the victim’s evidence surfaced does not mean that there was a “systematic and widespread pattern of many inconsistencies coming together” which ought to destroy her credibility altogether. The following observations made by Yong CJ inGovindaraj Perumalsamy v PP[2004] SGHC 16are instructive, at [30]–[31]: Even if a few of these inconsistencies appeared to be material, it is trite law that a flawed witness does not equate to an untruthful witness. On this point, my observation inLewis Christine v PP[2001] 3 SLR 165, that innocent discrepancies must be distinguished from deliberate lies, bears remembrance. … Furthermore, the trial judge had been mindful that there were inconsistencies in [the complainant’s] evidence but, having weighed them against the totality of the evidence, he nonetheless accepted [the complainant’s] evidence on the key facts in issue. It is settled law that the trial judge is entitled to determine which part of a witness’s testimony remains credible despite its discrepancies and there is no rule of law that the testimony of a witness must be believed in its entirety or not at all. Reference may be made to the cases ofJimina Jacee d/o C D Athananasius v PP[2000] 1 SLR 205andMohammed Zairi bin Mohamad Mohtar v PP[2002] 1 SLR 344. 26     That ADF did in fact, abuse the victim on several occasions is clear beyond peradventure because of the objective evidence available,viz, photographs and medical evidence. The photographs were taken and the medical examination was completed some time after the injuries were actually inflicted. Yet, the extent of the visible injuries, as can be seen from the photographs, were substantial and obviously inflicted over a period of time. What remained to be proved were the particulars alleged in the various charges preferred against ADF. This required the Judge to assess, in relation to each charge, how the victim’s testimony measured up to ADF’s testimony against the backdrop of the established objective evidence. This matter is no different from the typical domestic maid abuse case in that the only direct evidence available is that from the victim. Nevertheless, it bears reiteration here, that the objective medical evidence partially affirms that the abuse clearly took place over a period of time. This is not a case of a one-off offender and or a single incident that was reported immediately after it occurred. Furthermore, given the trauma experienced by the victim, it is perfectly understandable that inconsistencies surfaced in her testimony in relation to some aspects of the incidents. As observed inJagatheesanat [82]: It is trite law that minor discrepancies in a witness’s testimony should not be held against the witness in assessing his credibility. This is because human fallibility in observation, retention and recollection is both common and understandable:Chean Siong Guat v PP[1969] 2 MLJ 63… at 63–64;Ng Kwee Leong v PP[1998] 3 SLR 942at [17]. 27     The trial below spanned over a period of 28 hearing days. The Judge had ample opportunity to observe both ADF and the victim and to assess their credibility. He convicted ADF on the first and ninth charge on the basis of his admissions. In relation to each of the three other charges under appeal, there was medical evidence of injuries inflicted on the victim. This medical evidence, together with the testimony from ADF and the victim, was sufficient to convince the Judge beyond a reasonable doubt that the offences did take place. In contrast, it is to be noted that there was no irrefutable medical evidence, besides the victim’s testimony, to support the allegations of the sexual offending and the Judge gave ADF the benefit of the doubt in holding that the aforesaid allegations were not made out. 28     I am satisfied that the Judge had painstakingly and correctly considered the evidence for each charge that was preferred against ADF and where a reasonable doubt remained unresolved, the Judge acquitted ADF. His reasoning and determinations in relation to the various convictions cannot be faulted. These are my detailed reasons for upholding the Judge’s findings of fact in relation to the convictions.",
        "Tenth charge": "The evidence 29     In court, the victim testified that, on the morning of 29 April 2006, she could not find the baby’s toys. ADF then repeatedly kicked the victim on both sides of her hips. She noticed that there were blue-black marks on both sides of her hips. The victim had not referred to this incident when a statement was recorded from her by the police on 5 May 2006. However, she mentioned the incident in her statement to the police on 9 May 2006. 30     The Prosecution highlighted the ecchymoses on both sides of the victim’s hips recorded by Dr Chan as having been caused by the assault on this date. The photographs of the victim taken on 5 May 2006 also show a number of serious bruises on the victim’s hips. The Prosecution claims that the bruises were a result of the assault on this day. 31     In his police interviews, ADF denied kicking her. In a statement that was recorded from him on 26 May 2006 the following exchange took place[note: 13]:  Q:According to your maid, [the victim], on one Saturday in the month of April, you scolded her as you could not find a particular toy for your daughter and you had also kicked on her thighs many times. What have you got to say?[ADF]:I did not kick her. I have never kicked her! But I ever scolded her if she did anything to my daughter. In court, ADF denied having kicked the hips of the victim on 29 April 2006. He said[note: 14]: Because I will not assault her just for this kind of minor---minor, minor things. If I were to ever hit her, I belief [sic] it must have caused my daughter to cry or injured. The above response was referred to at [20] of GD 1, where the Judge observed that they “[overlooked] the events of 29 January 2006 referred to in[14]”. The 29 January 2006 incident relates to the first charge (see[2]above). According to the victim, ADF knocked her with his knuckles repeatedly as she forgot to pack the baby’s hat and napkins when they went out that day. ADF could not recall the reason for that earlier beating. The Judge’s decision 32     The Judge accepted the victim’s testimony and convicted ADF on this charge. The victim’s evidence was that she was kicked on the hips on only one occasion, 29 April 2006. Dr Chan found that the age of all the injuries he recorded was somewhere between one to 14 days. The Judge determined that Dr Chan’s report, therefore, supported the victim’s version of events since the ecchymoses on the victim’s hips could correspond to injuries inflicted on 29 April 2006. 33     The Judge was also of the view that the victim’s failure to mention the 29 April incident in her first statement to the police given on 5 May 2006 did not mean that her evidence was inconsistent. That statement was taken on the very day of her abrupt removal from the flat, and was recorded from 10.15pm to 2.00am the next morning. The Judge concluded that this must have been a traumatic and exhausting period for her and she may not have recalled the incident. He noted she had referred to this incident in her next statement recorded on 9 May 2006. It was also apparent from the Judge’s observation at [20] of GD 1 (referred to above) that he did not find ADF’s explanation that he would hit the victim only when the latter caused his daughter to “cry or [be] injured”, to be credible, given that the victim had earlier been assaulted on 29 January 2006 for simply forgetting to pack the baby’s hat and napkins. My decision 34     ADF contended that the Judge erred in concluding that the medical evidence corroborated the victim’s evidence that she was kicked on 29 April 2006. Dr Chan had not specifically stated that the hip injuries were between one to 14 days. His opinion obviously extended to all the injuries found on the victim. ADF argued that the medical evidence could equally corroborate ADF’s version which was that he kicked her on her hips on 4 May 2006, not on 29 April 2006. 35     I accept that the medical evidence does not firmly establish the precise date when the injuries were inflicted. Nevertheless, the Judge had not mistakenly evaluated the medical evidence. At [17] of GD 1, he noted: When she was sent for medical examination by the police on 5 May 2006 at the National University Hospital, the examining doctor, Dr Chan Kim Poh, found an area of ecchymoses over her left hip greater trochanteric region and an area of ecchymoses over her right hip greater trochanteric region. Dr Chan was of the opinion that the age of the injuries was between one to 14 days which would cover injuries inflicted on 29 April 2006. His findings corroborated [the victim’s] evidence that she was kicked on both hips. [The victim’s] evidence was also that she was kicked on the hips on only one occasion, 29 April 2006. Dr Chan’s report confirmed that there were injuries on both her left and right hips. This was consistent with the testimony of the victim. Additionally, the Judge noted that an injury on 29 April 2006 would fall within the one to fourteen-day period. In this way, Dr Chan’s report affirmed the victim’s testimony. The Judge had not concluded that the medical evidence was contrary to ADF’s version. He only determined that the medical evidence supported the victim’s testimony. 36     ADF additionally argued that the Judge erred in relying on the 9 May 2006 statement. During the victim’s cross-examination, the Defence had successfully applied to adduce the victim’s 5 May 2006 statement on the ground that the statement was inconsistent with her evidence in court in relation to the charge of rape. While the 5 May 2006 statement was tendered only for the purpose of impeachment of the victim with regard to her evidence on the charge of rape, the Judge permitted the Defence to cross-examine the witness on all the other contents of the statement. The Prosecution in turn tendered the 9 May 2006 statement during the victim’s re-examination solely for the purpose of refuting any suggestion of consent in relation to the charge of rape. For this statement, the Judge only allowed the Defence to cross-examine the victim on the issue of consent for the charge of rape. The Defence therefore vigorously insisted that it was wrong for the Judge to rely on the victim’s narration of the incident on 29 April 2006 in the 9 May 2006 statement. 37     I agree with ADF’s counsel that the Judge should not have referred to the victim’s narration of events of the 29 April 2006 incident in her 9 May 2006 statement. However, the Judge had merely referred to that statement to explain that the victim’s failure to mention the 29 April 2006 incident in her earlier statement was not fatal. As observed by the Judge at [23]-[24] of GD 1: 23    The other matter raised by the defence was that [the victim] did not refer to the assault in her first statement to the police given on 5 May 2006. That statement was taken on the very day of her abrupt removal from the flat, and was recorded from 10.15pm to 2am the next morning. That must have been a traumatic and exhausting time for her. It was evident that she did not recall all the incidents of assault, including the events of 29 January 2006, which the accused admitted to.However, she referred to this incident in her next statement recorded on 9 May 2006. 24    Having observed her giving her evidence, and having considered the findings and evidence of Dr Chan, I believe the evidence of [the victim]. On the other hand, [ADF’s] defence that he kicked her hips, but only on 4 May 2006, did not raise any reasonable doubt that the offence took place. [emphasis added] 38     It is plain to me that the Judge had, at the end of the day, properly relied on her testimony and Dr Chan’s report in convicting ADF on the tenth charge. In my opinion, the Judge’s determination that the Prosecution had proved the charge beyond a reasonable doubt cannot be said to be either against the weight of evidence or incorrectly arrived at. After all, ADF himself was far from consistent in narrating his version of events in relation to this charge. Having reviewed the evidence, there were ample grounds not to accept ADF’s version of events.",
        "12th charge": "The evidence 39     The victim claimed that on the night of 4 May 2006, ADF and his wife became angry with her for allowing their child to play with a ballpoint pen. ADF then asked the victim to go to the computer room where he kicked her several times on her stomach. He also ordered her to place her hands on her head while he kicked her. The victim found the kicks painful and she attempted to shield her stomach with her hands. A hand came into contact with ADF’s leg and this further infuriated him. He reprimanded her for hurting his leg and complained to his wife about this. His wife then kicked the victim’s stomach and scratched her chest. ADF returned after his wife left and continued kicking her stomach. After this, he raised one of his legs and pressed a foot against the victim’s chest, causing her breathing difficulties. He followed up by slapping her on the left and right sides of her face. The Prosecution submits that the tenderness over the left lower chest wall of the victim and the eczematous patches over her anterior abdominal wall that were recorded by Dr Chan were caused by the assault on this date and 5 May 2006. 40     In his statements to the police, ADF denied having committed the offence. However, during examination in chief, he admitted that he physically assaulted her on the night of 4 May 2006. According to ADF, his wife informed him that they were about to dress the baby after her bath when the baby hit her head on the floor as the victim had forgotten to put a cushion behind the baby. ADF acknowledged having used his legs to kick the victim and his hands to hit her. The following exchange between ADF and his counsel is pertinent[note: 15]:  QNow did you lose control of yourself that day?AYes.QHow did you assault her? What did you assault her with?AMy hands and legs.QYou used your leg to kick her and you used your hand to hit her, right?AYes.QDo you admit that it was a bad assault?Court:Sorry?QDo you admit that it’s a bad assault?AYes. While ADF admitted to assaulting her, he did not plead guilty because he claimed that he kicked her on the hips and not in the abdomen because he did not want to cause internal injury to her. The Judge’s decision 41     The Judge found the victim’s recollection of the events more reliable than ADF’s stumbling account. He therefore found ADF guilty of the charge. In coming to this conclusion, the Judge noted that ADF had admitted to kicking and slapping the victim, though he had qualified this by saying that he kicked her hips and not her abdomen. ADF’s state of mind during that incident may have obscured his recollection. On the other hand, the victim was clear that she was kicked in the abdomen. She had complained to Dr Chan that her employer kicked her on 4 May 2006 on her lower left chest and that she had pain in the left lower ribs. The Judge felt that there was no reason for her to say that ADF kicked her in the abdomen if he had kicked her hips. My decision 42     ADF’s counsel argued that the Judge failed to consider adequately the inconsistencies in the victim’s testimony. The victim testified that she was kicked on her abdomen and that ADF pressed his leg hard against her chest. However, she had informed Dr Chan that she was kicked on her left lower chest. This, counsel submitted, was a material discrepancy. Kicking was different from pressing and there is a clear distinction between the chest area and the abdomen area. Moreover, the Judge did not give sufficient weight to the fact that the victim did not mention to Dr Su Lin Lin (“Dr Su”) that she was kicked in her abdomen or that she felt pain at her abdomen. Dr Su was an Associate Consultant at the Department of General Obstetrics & Gynaecology at the National University Hospital and she examined the victim on 9 May 2006. 43     I note that Dr Chan testified that during the medical examination, no interpreter was present. The victim communicated in simple English, a smattering of Mandarin and some simple gestures. With regard to the injury to the chest, she did not use the word “chest”. Instead, she indicated the area of pain. The following questions addressed to Dr Chan by the Prosecution are relevant[note: 16]: QNow, if you look at your medical report, the first paragraph, third line: [Reads] “She was kicked by her employer over her left lower chest…” Now, this reference to chest, did she say the word “left lower chest”? Did she use the word “chest” or did she just indicate to you where she was in pain? AI think she indicated where she was in pain. QSo she never used the word “chest”. And earlier, you mentioned that the left lower chest when you showed us where the left lower chest was,you said that part of the anatomy was actually the abdomen as well. A:That’s right. [emphasis added] 44     In assessing the victim’s testimony, consideration must be given to the fact that she was unable to effectively communicate in English. One should, therefore, be slow to split hairs over whether Dr Chan had accurately recorded the area of injury as the chest or abdomen. The victim had indicated to Dr Chan, by way of gestures, the general area where her employer had kicked her. It bears mention that Dr Chan stated that he could not remember if the victim informed him that she was kicked in the chest or he had used the term himself. As for the examination by Dr Su, I note that her focus were the alleged sexual assaults. In cross-examination, Dr Su confirmed that she did not focus on the bruises on the abdomen area because the victim had already seen the doctor at the Accident & Emergency Department. As such, the significance of the victim’s omission to mention the pain in her abdomen to Dr Su should not be overstated. 45     Mdm Lau and Jeanie were the first, of the witnesses who testified, to learn of the assaults. They confirmed that the victim clearly gestured that her employer had kicked her stomach. Both these witnesses are independent witnesses.As the Judge correctly noted, the significance of their evidence is that while the victim had informed them of the assault by ADF, she had not intended nor did she prompt them to act on her complaints. I agree that the real cogency of what she told them lies in the fact that she neither sought them out to complain nor did she request or expect Mdm Lau to notify the police. 46     Indeed, ADF himself admitted that the assault on 4 May 2006 was a bad assault as he had lost control of himself. It is pertinent to note that ADF’s counsel had as a result no alternative but to acknowledge the following in his closing trial submissions[note: 17]: [H]e lost control of himself. He used his leg to kick [the victim] and used his hand to hit her that night.He assaulted her badly that night. … … He scolded [the victim].He lost control of himself as he was very angry and frustrated. He kicked her hips. He did not tell her to lift up her hands and keep still when he kicked her. Even when she moved around to avoid his kicking, he just continued kicking her. He did not kick her abdomen as he did not want to cause her internal injuries. He also slapped her on the cheeks several times. As he assaulted her, he scolded her. He did not press his leg hard against her chest. When he assaulted [the victim], she started crying. He did not stop. He kept kicking and hitting her on and off.He could not recall exactly what he did. He assaulted her for a few minutes. [emphasis added] Like the Judge, I find it difficult to accept that after he had lost his self-control and assaulted the victim “badly”, he was still able to ensure that he only measuredly kicked her hips and not other parts of her body to prevent the infliction of internal injuries. ADF had also admitted that the victim had not kept still and was squirming when he assaulted her. The Judge rightly found the victim’s recollection more reliable and I see no basis to interfere with this finding of fact, especially when ADF’s counsel concedes that “he could not recall exactly what he did”. 47     In the circumstances, I see no basis to interfere with the conviction on the 12th charge.",
        "13th charge": "The evidence 48     In court, the victim testified that early in the morning of 5 May 2006 (the day the incidents were reported to the police), ADF’s wife had asked the victim to prepare milk for the baby. The victim inadvertently placed the wrong teat on the milk bottle. ADF and his wife were enraged with the victim over this. ADF then kicked her stomach a few times. The Prosecution contends that the tenderness over the victim’s left lower chest wall and the eczematous patches over her anterior abdominal wall that were recorded by Dr Chan were caused by the assault on this date. 49     According to the victim, after ADF kicked her in the stomach, he told her that even if she worked for two years, he would not send her to the airport but instead to prison. The victim was also told that she would not be paid her salary. 50     ADF denied having committed this offence. He claimed that this incident was a fabrication. The baby did not cry and he did not kick the victim. The Judge’s decision 51     The Judge was satisfied beyond a reasonable doubt that the victim was truthful when she alleged that ADF had kicked her abdomen that morning. The Judge felt that the evidence of Jeanie and Mdm Lau was crucial. They were independent and neutral witnesses who had no reason to lie or to help the victim by falsely incriminating ADF. When the victim informed them of the assault by ADF, she had not expected them to act on her complaints. She did not want to report the matter, and she had not expected Mdm Lau to unilaterally call the police. My decision 52     ADF’s defence was a bare denial. He also repeated the tired refrain that the victim had failed to mention the pain in the abdomen to Dr Su. I have already rejected this argument in relation to the 12th charge and do so here again. 53     ADF’s counsel also suggested that while both Mdm Lau and Jeanie were independent witnesses, the Judge had failed to appreciate that both of them were not eye-witnesses to the alleged assault. The Judge, I observe, was well aware that there were no eye-witnesses to the incident. He accepted that since the victim had been kicked in the abdomen on 4 May 2006, the injury reported in the medical report could have been due to the earlier incident. However, in the opinion of the Judge, this did not create a reasonable doubt as regards ADF’s guilt. He also took into account that Jeannie had found the victim crying that same morning and the victim had related this incident to both Jeanie and Mdm Lau. Since this conviction is certainly not against the weight of evidence, and was also arrived at after a careful assessment of the evidence, I see no basis to disturb the conviction on this charge as well.",
        "The appeal against the sentences": "",
        "Sentencing principles": "54     The classical principles of sentencing may be generally summed up in four words: retribution, deterrence, prevention and rehabilitation. A court has to keep these four principles in mind when sentencing an accused. Not all the principles apply in every case, and not infrequently, there is tension in relation to which of these considerations (or combination thereof) ought to take precedence. In every sentencing decision, a court has to judiciously assess which of the four principles apply, the interplay which these principles have with the factual matrix and how much weight they should be given before being applied to the matter at hand. 55     In a case of domestic maid abuse, ordinarily, the principles of deterrence and retribution take precedence. A deterrent sentence signifies that there is a public interest to protect over and above the ordinary punishment of criminal behaviour.The protection of domestic maids from abuse by their employers is always a matter of public interest, given their vulnerable status and the prevalence of such relationships in Singapore. No employer or household member has the right to engage in abusive behaviour against a domestic maid. All maids should be treated fairly, with dignity and respect. Indeed, domestic maid abuse not only causes harm to the victim and calls for deep public indignation; it could also harm Singapore’s bilateral relations with other countries. Domestic maids from several neighbouring countries come to Singapore to work. Maid abuse by errant employers, if left unchecked, could therefore also result in wider repercussions which could include soured diplomatic relations, quotas on domestic maids working here and so on: seeFarida Begamat [28]. Indeed, in a recent Time Magazine article, it was stated that:[note: 18] After the public outcry over [a serious maid abuse] case, in late June Indonesia temporarily blocked its domestic workers from going to Malaysia to work until the two countries hammer out additional protections to a 2006 Memorandum of Understanding (MOU) on migrant workers. I now turn to broadly explicate the relevant sentencing considerations in relation to domestic maid abuse cases before addressing more specifically the appeals on sentence. Deterrence 56     InPP v Law Aik Meng[2007] 2 SLR 814(“Law Aik Meng”), the High Court pointed out, at [18]: It has been a recurrent theme in our sentencing jurisprudence that “the dominant choice of sentence in advancing the public interest is the deterrent sentence” (seeSentencing Practice in the Subordinate Courts(Butterworths, 2nd Ed, 2003) (“Sentencing Practice”) at p 73). Yong CJ observed with his customary clarity and acuity inPP v Tan Fook Sum[1999] 2 SLR 523(“Tan Fook Sum”) at 533, [18]: The foremost significance of the role of deterrence, both specific and general, in crime control in recent years, not least because of the established correlation between the sentences imposed by the courts and crime rates, need hardly be mentioned. 57     InTan Kay Beng v PP[2006] 4 SLR 10at [31], it was explained that the deterrence principle is: premised upon the upholding of certain statutory or public policy concerns or alternatively, upon judicial concern or disquiet about the prevalence of particular offences and the attendant need to prevent such offences from becoming contagious.Deterrence, as a general sentencing principle, is also intended to create an awareness in the public and more particularly among potential offenders that punishment will be certain and unrelenting for certain offences and offenders. [emphasis added] 58     Domestic maids must be treated with respect. It is always disturbing to learn of instances of employers imposing unusual requirements on domestic maids, causing them distress or, even worse, abusing them. Abuse can be either psychological or physical or a combination of such conduct. InLim Chuan Huat Francis v PP[2002] 1 SLR 105(“Lim Chuan Huat”), the employer hit the maid on her palms with a rattan cane and pinched her cheek. The employer also required the maid to keep a diary in which she recorded all the chores she had done and any mistakes which she had made. The domestic maid would occasionally be required to read the diary aloud to the employer. The employer claimed that this would enable the maid to learn from her mistakes and not repeat the same mistakes in future. The court emphatically denounced the infliction of any manner of humiliating conduct on a maid employed in her professional capacity to assist in domestic chores, at [38]. 59     In enacting s 73 of the Penal Code in 1998, Parliament has unmistakeably singled out domestic maid abuse as a genre of offending that merits special deterrence. The courts on their part have consistently emphasised that domestic maid abuse cannot be tolerated and maid abusers who indulge in inappropriate behaviour will not just be severely chastised but, in addition, receive deterrent sentences. There are two aspects to deterrence: specific and general deterrence. These two aspects correspond to the deterrence ofthe offenderand the deterrence oflikely or potential offendersrespectively. The distinction has been explained inLaw Aik Mengas follows, at [21] and [24]: 21    Specific deterrence operates through the discouraging effects felt when an offender experiences and endures the punishment of a particular offence. Drawing from the maxim “once bitten twice shy”, it seeks to instil in a particular offender the fear of re-offending through the potential threat of re-experiencing the same sanction previously imposed. … 24    General deterrence aims to educate and deter other like-minded members of the general public by making an example of a particular offender:Meeran bin Mydin v PP[1998] 2 SLR 522at 525, [9] …. General deterrence 60     InLaw Aik Meng, the court listed out various types of offences which warrant a general deterrence sentence. One of these was offences against vulnerable victims. The Court observed, at [24]: (b)Offences against vulnerable victims: Offences against vulnerable victims often create deep judicial disquiet and general deterrence must necessarily constitute an important consideration in the sentencing of perpetrators. InPP v NF[2006] 4 SLR 849, [42], I stated as follows: [O]ur courts would be grievously remiss if they did not send anunequivocal and uncompromising message to all would-be sex offendersthat abusing a relationship or a position of authority in order to gratify sexual impulse will inevitably be met with the harshest penal consequences.In such cases, the sentencing principle of general deterrence must figure prominently and be unmistakably reflected in the sentencing equation. [emphasis added] Australian courts have taken a similar stance toward offences against vulnerable groups of victims such as the old, the young, the weak and the disadvantaged: seeR v Kane(1987) 29 A Crim R 326. The Court held that prevalence of the offence and difficulties in detection were two examples of particular circumstances which may attract general deterrence, at [25]: (a)Prevalence of the offence: In the Australian case ofR v Taylor(1985) 18 A Crim R 14, the prevalence of armed robbery in a dwelling place was a factor which precipitated to the court’s finding that deterrence was necessary. Locally, inOoi Joo Keong v PP[1997] 2 SLR 68, a “road bully” case, Yong CJ was of the view that where an offence was becoming prevalent in Singapore, such prevalence constitutes a relevant consideration in sentencing; where there are grounds for judicial concern about the prevalence of particular offences, the court will mete out a stiff sentence to show its disapproval and to deter like-minded offenders (seeSentencing Practice([18]supra) at p 73). … (d)Difficulty of detection and/or apprehension: InReg v Glenister[1980] 2 NSWLR 597, commercial crimes were committed by a financial expert who “[used] much cunning to have money taken and concealed, in the expectation that it would never be discovered”; and the difficulty of detection of such commercial crimes was regarded as a powerful factor precipitating a heavy sentence if and when such crimes are eventually uncovered through painstaking investigation: at 616. In that case, the court opined that general deterrence must play a significant part in such offences. In the unreported case ofMcKechnie(Court of Criminal Appeal, NSW) (1 October 1987), the Court further stressed the importance of deterrence in commercial cases, and this was, in part at least, based upon the difficulties and costs connected with detection. In Singapore, the obstruction of detection has been a factor relevant in enhancing sentences (seeOng Tiong Poh([25(b)]supra)). The fact that the criminal scam went undetected for 20 months inPP v Rohaazman Bin AliMagistrate’s Appeals Nos 286–288 of 2001 was a consideration that influenced the trial judge in sentencing. In my view, these cases compellingly illustrate the need for deterrence in such crimes, rendering it a crucial sentencing consideration. 61     The courts have unwaveringly recognised domestic maids as vulnerable victims and a category of persons in need of constant protection: seeFarida BegamandPP v Chong Siew Chin[2002] 1 SLR 117(“Chong Siew Chin”). Many domestic maids work within the confines of the employer’s home and have little contact with the rest of the society. Often, they are not well educated and cannot speak English or effectively communicate with the wider public. Further, not all cases of abuse come to light as some maids may be apprehensive about the consequences of seeking help in a foreign environment. Less educated maids may also not be aware of their rights and the severe view taken by the authorities here in relation to substantiated complaints. Lee Han Shih, “Silence on maid abuse must end”Business Times(27 July 2002)[note: 19], observed: Many maids come from a background which carries with it a natural fear that the police are working for the rich and, and are reluctant to seek their protection even when the opportunity presents itself. Concerned neighbours have become the only check against abusers for some maids. In the present case, the victim was subjected to months of intolerable abuse before her predicament came to light; and even then, because of a purely fortuitous meeting with a public spirited neighbour, see above at[9]. Despite the introduction of enhanced penalties for causing hurt to maids, the number of substantiated domestic maid abuse cases, in which employers inflicted bodily hurt, on the maid has not meaningfully decreased over the years. While there were eight such cases dealt with in 2001, there were 26 in 2004 and 19 in 2008. It must be acknowledged that these figures only represent matters that have been prosecuted. While surveys show that most maids are fairly treated, there are still a not insignificant number of instances of abuse that may not come to light. Indeed, as perceptively noted by Yong CJ inChong Siew Chinat [43], “[m]aid abuse usually takes place in the privacy of the home where offences are hard to detect”. In my view, it is important for this court, in its role as the final appellate court,to send an unequivocal message to all employers that any abuse of their authority and any harm caused to their domestic maids, if revealed, will inevitably be met with stiff penal consequences and denunciation. Specific deterrence 62     Specific deterrence operates through the discouraging effects felt when an offender experiences and endures the punishment of a particular offence and is usually appropriate in instances where the crime is premeditated: seeLaw Aik Mengat [22]. Specific deterrence is more relevant where the accused commits the offence deliberately as opposed to a case where the accused commits the offence on the basis of some irrational and uncontrollable impulse. It has particular significance to cases where an accused shows a propensity to repeat the offending. On specific deterrence, the High Court clarified inPP v Loqmanul Hakim bin Buang[2007] 4 SLR 753(“Loqmanul”), at [26]: A central premise underpinning such a sentencing philosophy is a belief in the ability of the person concerned to make rational choices, whether in relation to current or future conduct. In this respect, it is not surprising that considerations of specific deterrence are especially significant in situations involving premeditated crimes: seePP v Tan Fook Sum[1999] 2 SLR 523at [18]. As a corollary, it should be similarly self-evident that in most, if not all, situations involving factors outside the control of the accused, or where the accused acts on the basis of some irrational and uncontrollable impulse, specific deterrence would often be a less compelling, if not altogether irrelevant, consideration: seePP v Aguilar Guen Garlejo[2006] 3 SLR 247at [44];PP v Lim Ah Liang[2007] SGHC 34at [40]. 63     The Judge has found that ADF deliberately assaulted the victim, not once, but repeatedly. The assaults were not spontaneous lapses of self-control. Rather, they were the “vengeful reaction to [the victim’s] continued presence in his house”: see GD 2 at [23]. ADF needs to be deterred from engaging in similar conduct. 64     Therefore, both general and specific deterrence are important considerations in the sentencing of ADF.This is a disturbing case of systemic and sustained abuse of a domestic maid over a notable period. The sentence imposed on ADF should be substantial enough to both punish him fairly as well as to deter other members of the public from indulging in similar behaviour. An adequate sentence will be one that also encapsulates the wider community’s abhorrence that is evident whenever a case of domestic maid abuse (and particularly serious cases of systemic abuse) comes to light. In this regard, I reiterate the following observations made inLaw Aik Mengat [29]: It is necessary to emphasise that one precondition to ensure successful general deterrence resides in the public acknowledgement of the severity of punishment. A potential offender mustrealisethat the sanction for a particular offence is severe before deterrence can set in … [emphasis in original] Retribution 65     The essence of the retributive principle is that the offender must pay for what he has done. InPP v Tan Fook Sum[1999] 2 SLR 523at [16], Yong CJ quoted Lawton LJ inR v Sargeant(1974) 60 Cr App R 74 at p 77: The Old Testament concept of an eye for an eye and tooth for tooth no longer plays any part in our criminal law. There is, however, another aspect of retribution which is frequently overlooked: it is that society, through the courts, must show its abhorrence of particular types of crime and the only way in which the courts can show this is by the sentences which they pass. The courts do not have to reflect public opinion. On the other hand courts must not disregard it. Perhaps the main duty of the court is to lead public opinion. 66     Wrongdoing must be adequately censured as well as deterred. If appropriate punishment is not imposed, or if it is generally perceived as being proportionally inadequate, the victim, as well as the wider community, will be left with the sour taste of injustice and grievance. 67     The victim came to Singapore to work and earn an honest living. She has, however, been subjected to months of unrelenting serious psychological and physical abuse. The sentence imposed on the accused must reflect the condemnation of the wider community for such abuse. Proportionality in sentencing 68     A punitive sanction imposed in the name of deterrence and or retribution ought not to contravene the principles of proportionality. While local case law adopts in many offences a deterrent sentencing philosophy, such an approach must nevertheless be circumscribed by the notion of proportionality in relation to the severity of the offence committed as well as by the moral and legal culpability of the offender: see for instanceLaw Aik Mengat [30]. 69     In the present case, ADF’s conduct can be considered to be very serious. Domestic maid abuse not only causes harm to the victim, but could also, if let unchecked, cause harm to the wider community. By way of illustration, I need go no further than to point out to the possibility of the damage heinous cases might do to harm bilateral relations, see above at[55]. 70     ADF must take full responsibility for his reprehensible conduct even if all the consequences of his conduct had not been contemplated by him. In addition, the fact that the seriousness of the abuse escalated over time cannot be lightly dismissed, see below at [91(d)].",
        "Precedent cases on sentencing of domestic maid abusers": "71     This is the first occasion that a case on maid abuse has reached this court. In the light of this, it would be helpful to the lower courts if I examine the more notable sentencing decisions on domestic maid abuse and consider if the current sentencing framework for this genre of cases needs to be re-assessed or fine-tuned. 72     InFarida Begam, Yong CJ noted that a fine has only been imposed by the courts where no injuries or minor injuries have been caused. The trial court had imposed a sentence of three months’ imprisonment on the accused for a charge of voluntarily causing hurt to the domestic maid by hitting her head, face and chest with a wooden scrub and slipper. The victim suffered bruises on her temple, left ear pinna and shoulder and over her lower right eyelid and nasal bridge and some swelling. On appeal, Yong CJ enhanced the sentence to a term of nine months’ imprisonment. 73     Yong CJ listed out the aggravating factors that enhanced the sentence given to the accused (at [24]): (1)    [the maid] sustained rather serious injuries, concentrated on the head and face, which are vulnerable parts of the body. (2)    [The accused] did not use her bare hands, but used a wooden pole and a slipper. (3)    [The accused] was in a position of authority over [the maid]. (4)    [The maid] was a vulnerable victim. Maids have been recognised as a category of persons in need of greater protection. (5)    The attack was unprovoked. (6)    [The accused] had shown no remorse. She had not apologised to [the maid] nor paid her any compensation. She even tried to cast aspersions on [the maid’s] character during the trial. He held that the accused’s lack of antecedents did not carry much weight. 74     InChong Siew Chin, the accused was convicted of three charges of voluntarily causing hurt to the domestic maid by slapping her on three occasions. The victim suffered bruises on the left cheek and a cut to her lip. The magistrate imposed a fine of $1,500 on each charge and in default, two weeks’ imprisonment. On appeal, Yong CJ enhanced the sentence to six weeks’ imprisonment on each charge. Two of the three sentences were to run concurrently making a total of 12 weeks’ imprisonment. 75     The court emphatically declared that where mental abuse was calculatedly applied in conjunction with physical abuse to a domestic maid, this should be viewed as a serious aggravating factor (at [42]). The accused subjected the maid to a regime of threats and coached her to lie if she was ever questioned. This created in the maid, an ‘overwhelming fear’ of the accused. 76     In sentencing the accused, Yong CJ also took into account the lack of remorse on the part of the accused, the fact that the offences were committed habitually and in response to dissatisfaction over very trivial matters and that the injuries were not superficial wounds, and a great deal of force had been used which caused extensive bleeding. 77     InPP v Ong Chin Chin[2005] SGMC 16, the accused pleaded guilty on the first day of trial to two charges of voluntarily causing hurt to the domestic maid. The first was for punching the chest of the maid. The second was for slapping both her cheeks once. The victim suffered sustained a 2-cm bruise over the sternum and a 1-cm abrasion over the right side of the victim’s lower lip respectively. The accused was sentenced to three weeks’ imprisonment on each charge. Both sentences were ordered to run consecutively so that the aggregate sentence was six weeks’ imprisonment. Three other charges of voluntarily causing hurt to the victim were taken into account for the purposes of sentencing. The magistrate felt that the plea of guilt carried little mitigating value. The magistrate considered a compensation of $8,500 which was made to the victim and the accused’s medical condition (she was under medication for stress, was suffering from anxiety, depression and mood instability associated with pre-menopausal symptoms) as mitigating factors. 78     However, the magistrate then rightly highlighted the following as aggravating factors: (a)     The incidents of abuse were committed within a short span of nine days and they occurred shortly after the maid started work. (b)     The injuries, although relatively minor, were sustained on vulnerable parts of the body, namely, the head, face and chest areas and tremendous force had been used. 79     InNg Chai Imm Evelyn v PP[2001] SGMC 37, the accused pleaded guilty to two charges of voluntarily causing hurt to the domestic maid. The first was for kicking her buttocks and the second was for grabbing her neck and pushing her. The accused was sentenced to one week’s imprisonment and three weeks’ imprisonment on each charge respectively. Both sentences were ordered to run consecutively so that the aggregate sentence was 4 weeks’ imprisonment. Yong CJ referred to this case inOng Ting Ting v PP[2004] 4 SLR 53. In the latter case, the district judge sentenced the accused to one week’s imprisonment each on four charges of voluntarily causing hurt to the victim. The first charge was for pushing her and causing her to hit her head against the wall, the second was for kicking her in her thigh, the third was for pushing her and causing her to fall and injure her elbow and the last charge was for pushing her and causing her to fall on a pail. On appeal, Yong CJ noted that the sentence was at the lowest end of the sentencing range but he declined to disturb the sentence because the district judge had failed to give sufficient weight to the accused’s lack of antecedents as a mitigating factor. 80     InLim Chuan Huat, the district judge sentenced both the husband and wife to three months’ imprisonment and a fine of $1,500 (in default two months’ imprisonment). The husband had been convicted for voluntarily causing hurt to the domestic maid by hitting the latter’s back, shoulders and hands with his hands and a rattan cane. The wife was convicted for voluntarily causing hurt to the maid by pinching her cheek and pulling her ears, and by hitting her hands with a rattan cane. The victim suffered bruises over her cheek, shoulder, thigh and hands. She suffered abrasions on both forearms and earlobes. There was reddening of skin on both breasts. The husband and wife appealed on both conviction and sentence but the appeals were dismissed. 81     InPP v Foo Chee Ring[2008] SGDC 298(“Foo Chee Ring”), the district judge sentenced the accused to four weeks’ imprisonment for voluntarily causing hurt to the domestic maid by slapping her three times across both her cheeks and for kicking her lower limbs. She sentenced the accused to five weeks’ imprisonment for voluntarily causing hurt to the maid by grabbing the maid’s hair and banging her head against the wall thrice. The accused received a sentence of four weeks’ imprisonment for another charge of voluntarily causing hurt to the maid by slapping her four to five times on both her cheeks on another occasion. The sentences of imprisonment for the first and second charges were ordered to run consecutively, while those for the first and third charges were to run concurrently, making a total sentence of nine weeks’ imprisonment. The sentences were upheld on appeal. There was no evidence of any injury on the victim and the doctors said that any injury of the type allegedly inflicted was not likely to be visible by the date of medical examination. 82     InPP v Heng Kwee Huang[2002] SGDC 122(“Heng Kwee Huang”), the accused was convicted of three charges of voluntarily causing hurt to the domestic maid. The district judge sentenced the accused to seven months’ imprisonment for punching the maid’s eye and imposed a fine of $1,500 each (one week’s imprisonment in default) for firstly pulling the maid’s hair and banging her head against the table and secondly, for slapping the maid’s face. In mitigation, it was pleaded that the accused, a teacher with young triplets, was unable to cope with her job and the responsibility of looking after the triplets. She suffered from severe depression and had attempted suicide on several occasions. The District Court held that while the court sympathised with the accused’s mental condition, it could not be an excuse for domestic maid abuse. For completeness, it should also be pointed out that she was in addition sentenced to a term of ten month’s imprisonment for scalding the maid on her right thigh with hot water pursuant to s 324 of the Penal Code read with s 73. 83     InSentencing Practice in the Subordinate Courts(LexisNexis, 2nd Ed, 2003) (“Sentencing Practice”) at p 142), the unreported case ofNormi binte Darus v PP(MA 217/2007/01) (“Normi”) was discussed. InNormi, the accused claimed trial to five charges of causing hurt to her domestic maid on five occasions over a period of three months. On the first charge, she was sentenced to two weeks’ imprisonment for kicking the maid twice in the left thigh with her bare foot. On the second charge, she was given three weeks’ imprisonment for an incident a month later where she pinched the victim twice on her cheek. On the third charge, she received a two-week imprisonment sentence for punching the victim’s forearm twice a month later. For the fourth charge, she was sentenced to a one-month imprisonment term for using the earpiece end of the handset to hit the victim twice on her forehead. On the fifth charge, she received a three-month imprisonment for hitting the top of the victim’s head with a scoop for about three times until she bled. The sentences of the second, fourth and fifth charges were to run consecutively so that the aggregate sentence was four months and three weeks. The district judge held that the persistent course of physical abuse with violence that escalated with time was an aggravating factor in the case. Additionally, it was noted that the injuries indicated the degree of violence used by the accused and the consequent pain caused to the maid. Twice, the attack had been on the maid’s head – her forehead and vertex respectively. The human head, the district judge observed, was potentially vulnerable to substantial force. Such force could lead to life-threatening situations. 84     Very recently, inPP v Tong Chew Wei[2009] SGDC 202(“Tong Chew Wei”), the accused was convicted in a District Court on seven charges of voluntarily causing hurt to his domestic maid. On the first charge, the accused was sentenced to six months’ imprisonment for using a broom stick to haphazardly hit the maid. He was sentenced to six months’ imprisonment on the second charge for pulling her right hand and using a broken broom stick to hit both her legs repeatedly causing abrasions on her chest, forearm, thigh and ankle. On the third charge, he received eight months’ imprisonment for throwing a mug filled with hot water towards the maid thereby causing her to suffer a 10cm scald burn behind the knees. The accused was given a four-month imprisonment term for using his feet to stamp both the feet of the maid on the fourth charge. For the fifth and sixth charges, he received three months’ imprisonment each for wearing a pair of slippers and stamping it on the feet of the victim and using a broomstick to poke on the body of the victim respectively. On the last charge, he received a six month imprisonment term for using his right hand to punch on her left face area, grabbing and pulling her hair and using his elbow to hit her upper centre back. The sentences on the first, third and the seventh charges were ordered to run consecutively, making it a total of 20 months’ imprisonment. 85     In sentencing the accused, I note that Hamidah bte Ibrahim DJ rightly considered the following to be aggravating factors: (a)     that there was a definite pattern of abuse over a few months; (b)     while the injuries were minor and the domestic maid did not suffer any permanent disability, she suffered emotionally and was in a traumatised state when she ran away; (c)     after being subjected to constant physical abuse, the maid had developed an overwhelming fear of the accused; (d)     on the last day of abuse, the maid had been deprived of food. I am mindful that this decision was given after ADF had already been sentenced by the Judge here. However, it remains relevant for the purposes of this appeal because the sentences imposed inTong Chew Weiwere arrived at within the context of the existing sentencing framework for domestic maid abuse cases. 86     All the abovementioned cases involved convictions for voluntarily causing hurt under s 323 read with s 73 of the Penal Code. Perhaps I should also mention that offences committed against domestic maids captured by ss 324-326 of the Penal Code are outside the immediate scope of my present discussion, though many of my general observations on sentencing considerations will have relevance to such cases in future. In addition, I should also underscore the point that s 73 of the Penal Code only permits the enhancement of sentences for convictions of an employer of the domestic maid or a member of the employer’s household. Therefore, inHo Yean Theng Jill v PP[2004] 1 SLR 254(“Ho Yean Theng”), where the victim’s work permit was registered under the name of the accused’s ex-husband but the accused had moved out of the matrimonial flat together with the domestic maid before the material incidents took place, s 73 of the Penal Code was held not to be directly applicable. 87     InHo Yean Theng, the accused was convicted by the Magistrates Court on five charges of voluntarily causing hurt under s 323 of the Penal Code and sentenced to a total of four months’ imprisonment. The magistrate sentenced the accused to four weeks’ imprisonment for using a bamboo pole to hit the maid’s hand twice, two months’ imprisonment for scratching the maid’s face with keys, four weeks’ imprisonment for hitting the maid on top of her head with a high heeled shoe five times, four weeks’ imprisonment for hitting the victim on the head with a plastic bucket and two months’ imprisonment for using her right hand to scratch the maid’s face. The second and fifth sentences were to run consecutively, bringing the total term of imprisonment to four months. Yong CJ upheld the sentences on appeal. Yong CJ noted that the two most pertinent facts were that the accused was in a position of authority while the victim was a vulnerable victim. 88     In sentencing the accused, Yong CJ referred to cases where the domestic maid abuser had been charged under s 323 read with s 73 of the Penal Code. He found that the sentences meted out in those cases were relevant because the aggravating factors were similar, bearing in mind the authority the accused person wielded over the maid and the vulnerability of the maid in each case. He was of the view that the need for general deterrence is just as strong even though s 73 did not apply. 89     I agree that the need for general deterrence is just as strong in cases where the domestic maid abuser is not the employer or a member of the employer’s household. However, when sentencing an accused pursuant to s 323 of the Penal Code, reliance ought not to be placed on sentences meted out in cases where s 73 of the Penal Code is applicable. This is because, Parliament has expressly rejected the suggestion to extend s 73 to maid abusers who are not the employer or a member of the employer’s household. InSingapore Parliamentary Debates Official Report(1998) vol 68 at col 1950, (Mr Wong Kan Seng, the Minister for Home Affairs), the Minister rejected a suggestion to have a deeming provision for the purposes of s 73: As to the drafting suggestions made by [Mr Simon S.C.Tay], I have been guided by the Attorney-General that this is the way we should draft our laws. Whether or not we should deem a person who is the employer as a registered employer of the domestic worker, even though that worker may not be working in his household, and deem the person liable for the enhanced punishment, I think we take it one step at a time. If there is a trend to show that employers overcome the law by getting another person to employ that worker, and eventually allow the person to work in his home and abuse the maid, then we will amend the law to take care of the problem. So, don't worry employers, if you intend to do that, be sure the law will catch up with you in no time. 90     Currently, when a judge sentences an accused for an offence under s 323 read with s 73 of the Penal Code, he may impose a greater sentence (though still within the maximum sentence allowed under s 323 alone) than he would have given for the same offence under s 323 alone, because he has been conferred a greater sentencing leeway. Therefore, while a court may broadly consider precedents where the domestic maid abuser has been charged under s 323 read with s 73 for the sentencing principles such as aggravating factors, it would not be correct, in sentencing an offender who is not an employer or a member of the employer’s household, to directly rely on the “sentences” as appropriate precedents.",
        "Sentencing framework applicable to cases of domestic maid abuse": "91     I see no reason to depart from the existing sentencing framework though it appears to me that it will be helpful to spell out more clearly what might be considered as aggravating considerations. From the abovementioned cases, it is clear that a custodial sentence is almost invariably warranted in cases of domestic maid abuse where there has been any manner of physical abuse. Even cases where real psychological harm alone has been caused could also merit prosecution and punishment, see[148]-[149]below. Every such offence involves an abuse of authority and results in harm being caused to a vulnerable victim. An employer’s unhappiness with a domestic maid’s work or conduct should never justify any form of abuse. All such offences are, in the eyes of the law, unprovoked. Where harm to a maid has been caused, a fine will only be imposed in areallyexceptional case where, for example, there are strong mitigating considerations. Even the least serious offences (where there are no aggravating factors, but with some injuries caused) ought to attract a custodial sentence. A slap, which leaves no mark or injury, may not always merit a custodial sentence but again this, in the final analysis, would depend on all the relevant facts. The sentence must also be enhanced if there are aggravating factors present. Without attempting to exhaustively itemise all relevant aggravating factors, I suggest that a court in sentencing domestic maid abusers ought to consider these aspects of an offence: (a)The more serious the injury and or the trauma, the greater the sentence imposed. The amount of force used is a relevant factor. Injuries inflicted to vulnerable parts of the body such as the head, eye, chest, stomach region and the private parts attract enhanced sentencing. This is not to say, however, that a linear sentencing approach is to be rigidly applied. (b)The use of weapons or objects in causing hurt to the victim is an aggravating consideration. The type of weapon or object used is relevant. The use of a dangerous weapon such as a knife should result in a greater sentence than the use of a less dangerous weapon. That said, serious harm or pain caused by hands or by kicking would be viewed with similar severity as it would be covered by (a) above. A fist or a forceful kick can also cause fatal injuries, see the observations of this court inPP v Leong Soon Kheong[2009] SGCA 28at [31(c)]: “A fist can also be a lethal instrument of harm”. (c)The degree of abuse of position or authorityover the domestic maid. (d)The prolonged abuse over a period of time is an aggravating factor, especially if the severity of the abuse escalates over time. Ordinarily, subsequent similar offending ought to merit more severe sentences as they usually show not just deliberateness and maliciousness but also a profound lack of basic respect for the domestic maid’s welfare and dignity. (e)Where mental abuse takes place in conjunction with physical abuse, this inevitably ought to be also reflected in the severity of the sentence. The humiliation inflicted and the psychological trauma caused is relevant. Where mental abuse was calculatedly applied in conjunction with physical abuse to a domestic maid that would constitute a serious aggravating factor:perYong CJ inChong Siew Chinat [42]. The conditions of employment and the day-to-day relationship of the accused with the maid are also relevant. For example, if the domestic maid has not received sufficient rest and or nourishment, this ought not to be ignored. (f)The absence of genuine remorse by the domestic maid abuser is relevant. 92     Here, I should pause and highlight the sometimes overlooked distinction between sentence specific aggravating factors and cumulative aggravatingfeatures. Where multiple distinct offences have been committed, sentencing is a two-stage process. First, the sentence for each individual offence had to be determined. Second, the court has to determine whether the sentences for these multiple offences ought to run concurrently or consecutively and if consecutively, which combination of sentences ought to be made and whether the overall sentence properly comprehends the criminality of the multiple offender, see below at[141]-[146]. If sentence-specific aggravating factors are present, the sentence for each particular offence should be appropriately enhanced. Cumulative aggravating features, on the other hand, are features that ordinarily have primary relevance at the second stage of sentencing, particularly as regards to the issue of whether the global sentence should be enhanced by consecutive sentencing, when multiple distinct offences have been committed. As the possibility of an overlap may occur in some cases, care must be taken not to re-input an aggravating consideration at the second stage, if it has already been fully factored into the sentencing equation during the first stage.",
        "The Judge’s decision on the aggravating factors applicable to this case": "93     After considering some sentencing precedents on domestic maid abuse at [13]-[19] of GD 2, the Judge mentioned the following factors as pertinent in the sentencing of ADF (at [21]): (i)    the circumstances leading to each assault were the minor innocuous mistakes of a domestic maid, made without any defiance, disrespect or dishonesty; (ii)  [ADF] had harboured a deep-seated resentment against [the victim]. He had wanted to dismiss her, but was dissuaded by his wife. He then decided to make her life uncomfortable; (iii)  [ADF] abused his position as a police officer and preyed on [the victim’s] fear and respect of authority; and (iv)  [ADF] had continued his assaults on [the victim] without let-up or concern for her. 94     The Judge also considered the seriousness of the victim’s injuries. He was of the view that although there were no permanent or disabling injuries, the assaults caused the victim real pain and left marks which could be seen in the photographs. Subsequently, he observed at [27]-[28] of GD 2: In deciding on the sentences to be imposed, I did not agree with the defence counsel’s submission that fines and short sentences were appropriate, and I did not find the prosecution’s proposal that [ADF] be sentenced to 12 months’ imprisonment for each offence, with the sentence to run consecutively to be well-considered. I imposed the sentences set out in [3] which I regard to be warranted on the facts of the case which I have referred to. I also considered the effective jail term of 12 months for the five offences to be appropriate. I should add that while the Judge quite appropriately listed the various aggravating factors, he did not explain (nor is it obvious) how he applied them,ie, whether he took them into account at stage 1 of the sentencing process (when determining the sentence for each charge) or at stage 2 (when determining the cumulative sentence).",
        "My view on the sentence specific aggravating factors in the present case": "Seriousness of injuries 95     In written submissions, the Defence argued that the victim only required outpatient treatment. The injuries were not life threatening and she did not suffer any form of permanent disability or scarring from the assaults. Therefore, the injuries should not be treated as serious. 96     I find it impossible to accept such an implausible argument. This does not even begin to acknowledge that the victim had been through a harrowing experience that is difficult to accurately describe. The judge certainly cannot be faulted for concluding that an injury does not have to cause a permanent disability or scarring in order for it to be considered as serious. The photographs and medical report of the victim unmistakeably show that ADF had inflicted numerous severe injuries on the victim. There were aging as well as recent bruises all over her face, left hand and hips. The victim sustained as well, subconjunctival haemorrhage in her right eye. On my part, I have found the visible injuries on the photographs, and in particular those on her face, to be nothing short of appalling. They must have been plain to see to all who came into contact with her. Despite this, ADF did not provide her with any proper medical treatment and continued to escalate his abusive behaviour towards her as part of his campaign of psychological warfare. It should be noted that by the time the victim was rescued by the police and the photographs taken, some of her earlier injuries were either already in the process of healing or had healed. Plainly, many of these injuries when inflicted would have caused severe distress. Further, ADF has caused injuries to vulnerable parts of her body such as the abdomen and head. Such injuries to soft tissue are not always apparent to the eye. The severity of the injuries is unquestionably an aggravating factor that should be taken into account in the first stage while the escalation in this matter is relevant at the second stage of the sentencing equation here, see above at[92]and below at[105]and [147(b)]. Abuse of position or authority 97     As a member of the employer’s household, ADF was (together with wife) in a position of authority over the victim. He needlessly and relentlessly underscored his status as “boss” by imposing strict and cruel requirements on the victim. According to the victim, ADF had instructed her to record all the duties she performed and the time at which she performed these duties in a notebook. She was supposed to hang the notebook around her neck using a rubber band everyday, see above at[7]. The victim claimed that ADF had also given her another notebook in which she had to record all her mistakes. The victim had to seek permission from ADF or his wife before she had her daily meals. 98     In my opinion, such disciplinary measures are not just improper but plainly cruel. The domestic maid was given the impression that eating basic food items without ADF or his wife’s permission was tantamount to stealing. This was clearly inappropriate behaviour. All employers have an obligation to ensure that their maids receive reasonable nutrition according to their needs. It must also have been extremely humiliating and distressing for the maid to continuously carry the notebook around her neck as if she were a domestic pet. I note that she testified that she felt “sad” about such a requirement being imposed on her[note: 20]. In my opinion, ADF has undoubtedly wantonly abused his authority over the victim and this should be considered an aggravating factor. 99     This case also involves another peculiar form of abuse of authority. The Judge held that ADF had abused his position as a police officer and played on her fear and respect for authority. This was an aggravating factor that he took into account in the sentencing decision. 100    ADF’s counsel maintained on appeal that he had not abused his position as a police officer. He had not implanted fear in the victim by virtue of his occupation. While the victim was aware that ADF was a police officer, she became fearful and intimidated because of her own misperception of how the legal system here would treat her complaint against a police officer. ADF, his counsel vigorously contended, should not receive a heavier sentence for abusing his domestic maid just because he was a police officer. 101    I accept that the mere fact that ADF was a police officer cannot be an aggravating factor for sentencing him on a charge of voluntarily causing hurt to his domestic maid. A police officer who causes hurt to his maid should not receive a heavier sentence just because he is a police officer. InLoqmanul, the High Court noted, at [40]: Therealdistinction, as alluded to earlier, is whether there has been an abuse of the trust and reliance placed on the officer concerned in the commission of the crime in question. Just as it could not be said that every offence committed during the course of duty would invariably be an abuse of the trust and authority that is reposed in such officers, the converse, namely, that any offence that isnotcommitted during the course of duty wouldnotinvolve an abuse of the trust and authority reposed in these officers, is plainly not correct. [emphasis added] 102    If the victim hadirrationallydeveloped a fear that her complaints would go unheeded, or even that she would be punished, if she reported the matter to the police merely because of her knowledge that ADF was a police officer, this of course cannot be said to be an abuse of position or authority by ADF. However, here, ADF, himself, first seeded and then nourished the fear in the victim. Although ADF was off-duty when he committed the offences against the victim, he had repeatedly threatened to send her to jail for her minor oversights in attending to her household chores. ADF acknowledged making such threats of imprisonment. The Judge found that ADF had repeatedly underscored to the victim the fact that he was a police officer. When he threatened to have her imprisoned, he must have known that she would take such threats seriously because he was a police officer. It is not disputed that the victim was not well educated and unfamiliar with the legal system in Singapore. She had not been in Singapore for very long when the abuse started and had no one she could turn to despite her desperate plight. The very person who ought to have protected her had become her relentless persecutor. It bears mention again that when Mdm Lau attempted to persuade the victim to report the matter the victim tearfully declined as “her male employer was working in CID and he would put her in jail”[note: 21], see[8]above. 103    I find that ADF had indeed abused his position and authority as a police officer in creating a shroud of fear that blanketed the victim. In making the imprisonment threats, ADF evidently made use of his status as a police officer to deter the maid from complaining. The victim was obviously afraid to report the abuse to the police and if not for Mdm Lau, the victim would have suffered more abuse. It is not disputed that the victim knew that ADF was a police officer. When ADF made those threats, he must have intended them to be taken seriously, and he must have also appreciated the effect they would have on the victim. This is a pattern of abusive conduct by a public servant that should be firmly denounced and discouraged. Police officers should not be allowed to use their position to deter victims from complaining about their improper conduct. I agree with the Judge and the Prosecution that this is an aggravating factor in this matter. Prolonged abuse over a period of time with seriousness of abuse escalating 104    The victim suffered a systematic pattern of abuse over a period of four months. Significantly, the scale of the abuse escalated over time. From an incident of badly knocking her head with his knuckles, it progressed to acts of viciously and unrestrainedly kicking vulnerable parts of the body such as the abdomen. InPP v Poon Yen Nee[2004] SGDC 196, the district judge incisively observed, at [21]: What is pertinent to note from all the sentencing precedents regarding maid abuse cases is that where there was a persistent course of abuse resulting in serious injuries to the victim, the Courts have generally imposed significant terms of imprisonment on the offenders concerned. In cases involving prolonged abuse and serious injuries to the victim, a longer sentence of imprisonment is warranted: seeHo Yean Thang Jill v PP(4 months’ imprisonment for simple hurt) andFarida Begum d/o Mohd Artham v PP(9 months’ imprisonment for simple hurt). 105    This is not a case of a one-off spontaneous incident where ADF lost self-control and caused slight hurt to the victim. This consideration is certainly an aggravating factor that calls for a more severe sentencing. However, while these circumstances can be sentence specific aggravating factors, they can alternatively be factored into the sentencing equation at the second stage in cases where a number of similar charges are being assessed which is the approach I am adopting here. The fact that ADF subjected the victim to a prolonged period of abuse must sound in a heavier sentence, see below at[141]and [146(a)]. Apparent absence of remorse 106    The Defence argued that ADF has shown some remorse in admitting that he assaulted the victim on 29 January 2006, 21 April 2006 and 4 May 2006. Moreover, ADF never suggested that the injuries were self-inflicted. These arguments are misconceived. 107    In my opinion, this admission is not a sign of remorse, and even if it was, it was a case of too little, too late. ADF did not stop abusing his domestic maid on his own volition; neither did he seek medical attention for her. The Judge found that the only concern ADF experienced was “for himself and his wife in the event the assaults became known” (at [25] of GD 2). The Judge also rightly pointed out that “[t]hroughout that period [ADF] had not once apologised to [the victim] for his conduct, made any promise to stop the abuse or show any concern over the injuries inflicted on her.” Furthermore, I note that ADF did not assist with the subsequent investigations as he had told the police that he did not commit the offences (even for the ones which he later pleaded guilty to, see[119]and[123]below). Plainly, in my view, the reason why he admitted to having hurt her in these limited instances was because there was both direct testimony and objective evidence of injuries suffered by the victim. For example, in relation to the first charge, a domestic maid working for ADF’s sister in law testified that she saw a blue-red mark on the forehead of the victim on the morning of the 29 January 2006 while she was visiting ADF’s mother’s flat with her employer[note: 22]. ADF’s sister in law also confirmed that she had seen a bruise on the victim’s forehead on the same occasion.[note: 23]As highlighted inAngliss Singapore Pte Ltd v PP[2006] 4 SLR 653, even a plea of guilt will only be taken into consideration in mitigation when it was motivated by genuine remorse, contriteness or regret and/or a desire to facilitate the administration of justice. 108    The sentences imposed must therefore be greater than a case where these aggravating factors were absent. However, I also have to consider the seriousness of the physical injuries in each charge to calibrate the sentences.",
        "Some mitigating factors raised by ADF": "109    ADF’s counsel argued that the following points should be seen as mitigating factors in assessing the appropriate sentence: (a)     The reason why ADF abused the domestic maid was because he had been angry with her for shouting at his baby daughter and shaking her in anger; (b)     No instruments or objects were used during the assaults. (c)     The injuries suffered by the victim were not serious or life threatening. (d)     Some remorse was shown by ADF. (e)     Adverse impact on the appellant: The victim had made false allegations that ADF had sexually abused her. The allegations were serious, especially since there was an allegation of rape. ADF suffered a lot of mental anguish as a result of these allegations and he had to sell his HDB flat in order to raise legal fees. These can be seen as a form of revenge for the victim who has punished ADF by making all these false allegations. In written submissions, ADF’s counsel said[note: 24]: To rub salt onto the wound, [the victim] would get off scot-free for the false allegations she had made against [ADF], while [ADF] still has to face the music for the wrong he has done towards [the victim]. (f)     Personal factors: During the course of his service as a police officer, ADF had done reasonably well as shown by numerous awards and recommendations he received over the years. In written submissions, ADF’s counsel encouraged this court to give some weight to ADF’s contributions to the society through his job as a police officer. 110    I am of the opinion that none of these considerations here qualify as mitigating factors. These are my reasons. 111    With regard to point (a), I would like to emphasise that no misconduct by a domestic maid merits, as a response, abuse. Misconduct by a maid can never be viewed as provocation justifying abuse. If employers are unhappy with a maid’s work, they should repatriate the maid or refer her back to the agency for alternative employment.I cannot think of any instance where the abuse of a domestic maid can ever be justified. 112    The use of a weapon in abusing the domestic maid is certainly an aggravating factor. However, the fact that a weapon was not used is not a mitigating factor. It is a neutral factor that does not affect sentencing. I have already discussed points (c) and (d) at[95]-[96]and[106]-[107]respectively and in my view both these factors do not mitigate the sentence to be imposed on ADF. 113    I am puzzled why ADF’s counsel had considered it relevant to have raised point (e). Instead of showing sincere remorse, ADF is now blaming the victim for the “anguish” he had been subjected to because the law took its course. ADF has no basis to complain about the consequences of his misconduct. ADF’s acquittalaproposthe sexual offences did not mean that the victim had lied (see above at[24]). 114    With regard to point (f), while ADF may have performed his duties as a police officer well and, therefore, received many awards, these are irrelevant in the present context and cannot mitigate his sentences. 115    Before I proceed to consider whether the sentence for each of the five charges under appeal was either manifestly inadequate or manifestly excessive, I will briefly address a further point raised by the Defence. 116    ADF’s counsel has also argued that in sentencing ADF, the Judge continued to be sub-consciously influenced by an initial mistake about the maximum sentence applicable to each charge. When the Judge pronounced his sentence on 10 November 2008, the Judge had observed, at the outset, that a good starting point was the maximum sentence for each charge. The Judge then stated this to be three years’ imprisonment. This was an error as the maximum sentence then applicable for each of the offences was in fact 18 months’ imprisonment. Counsel contends that if the learned Judge had the correct sentencing limit in mind when assessing the sentences, he would have imposed sentences of only half the duration. The relevant portion of the notes of evidence reads as follows[note: 25]:  Court:… Now, as you know, you have been found guilty on five charges of causing hurt to the domestic maid. Now, in your both sets of written submissions, I do not find a reference to the maximum sentence. I think it is a good starting point and for these offences, the maximum sentence is 3 years’ imprisonment and/or times one-and-a-half---two times one-and-a-half.Lee:Sorry, your Honour, correction.Court:323?Lee:The offences took place before the amendments to the---in February this year so the maximum under the law back in three---back then is 1 year.Court:All right.Lee:And, therefore, the maximum becomes 1½ years, your Honour. It’s not 3 years.Court:All right, fair enough, 1½ years. 117    This is an ingenious argument that cannot, however, withstand closer scrutiny. From this exchange, it is obvious to me that the Judge had clearly appreciated the correct maximum sentence applicable before he actually sentenced ADF and this registered in his mind. While he may have started off on the wrong footing, this error was no longer operative when he pronounced the sentences. I now deal with each of the charges relevant in this appeal. First charge 118    For the first charge, ADF was sentenced to three weeks’ imprisonment for knocking the victim’s head with his knuckles several times. This was an incident on 29 January 2006, which was the first day of Chinese New Year, when the victim forgot to bring along the baby’s hat and napkin while they were visiting a relative. When they returned home that night, ADF asked her to kneel in front of him and knocked her head several times with his knuckles. The victim testified that as she was shaken after being assaulted, she had asked ADF for permission to return to Indonesia. On hearing this, ADF threatened to send her to jail. She then agreed to continue to work for ADF and his wife. The victim also said that her head was swollen and painful after this incident. 119    In his statements to the police, ADF denied having committed the offence. However, in court, he admitted that he had knocked her forehead with his knuckles but he claimed that the incident took place in the morning. Therefore, he made a qualified admission of guilt to this charge. 120    The Defence argued that the sentence was manifestly excessive and that a fine should be appropriate for this charge. A custodial sentence should not exceed two weeks’ imprisonment. 121    ADF’s counsel emphasised that ADF had effectively pleaded guilty to this charge and therefore, he should receive a lighter sentence as compared to cases where the domestic maid abuser was convicted after trial. As I have explained earlier, a plea of guilt without genuine remorse does not carry much weight. 122    The victim did not sustain a serious permanent injury as a result of this abuse. She, nevertheless, claimed that her head was swollen and painful for sometime after this incident. Pertinently, neither ADF nor his wife offered her any medical assistance or ointments to ameliorate the pain she must have felt. In the context of existing precedents (eg,Normiabove at[83], where the accused was sentenced to a one-month imprisonment term for using the earpiece end of the handset to hit the victim twice on her forehead), I cannot say that a three-week imprisonment was either manifestly inadequate or excessive, if one were only to have regard to existing sentencing benchmarks, without factoring the peculiar aggravating features identified as relevant here. Ninth charge 123    On the ninth charge, ADF was sentenced to 6 months’ imprisonment for the incident on 21 April 2006, where ADF fisted the victim’s head repeatedly. In his statement to the police, ADF denied having committed this offence. In court, he pleaded guilty but he disputed the circumstances leading to the assault. According to the victim, she had forgotten to unbutton the baby’s clothes in the bathroom when she was about to assist ADF to bath the baby. This upset ADF. He then hit her head repeatedly. The victim claimed that she cried in pain. The next morning, the back of her head and the whole right side of her face were swollen and she could not open her right eye. ADF, however, claimed that his wife told him that while bathing the child, the victim did not hold onto the child properly and as a result, the child tripped on a ledge and fell. He became angry and hit her head several times. 124    According to the Defence, the sentence is manifestly excessive and a sentence not exceeding four weeks’ imprisonment would be appropriate for this charge. The Defence argued that the Judge erred because he accepted the victim’s version of events leading to the assault on 21 April 2006 for sentencing. They submit that ADF should be sentenced based on his version of facts. 125    With respect, this argument conveniently misses the point. Whether ADF assaulted the victim for forgetting to unbutton the child’s clothes (the victim’s version) or for failing to hold the child properly as a result of which the child fell in the bathroom (ADF’s version), is entirely irrelevant. Even if ADF assaulted the maid because the child was hurt as a result of the maid’s carelessness, this could not, by any stretch, justify assaulting the victim. 126    The Prosecution claimed that the victim suffered ecchymoses over the victim’s right face, temple, maxillary and paranasal region and right eye subconjunctival haemorrhage that were a result of this assault. Photographs P13 and P14, taken some two weeks after the incident show the swelling on the right side of her face, facial bruises and a red spot in her eye. 127    InHeng Kwee Huang, the district judge imposed a sentence of seven months’ imprisonment on the accused for using the right hand to punch the maid’s eye which resulted in a bruised inferior orbital margin of her left eye. In the present case, while ADF did not punch the victim’s eye directly, yet he caused serious injury to her eye in the form of subconjunctival haemorrhage. 128    The Defence relied onHo Yean Thengto argue that a sentence not exceeding four weeks would be appropriate for this charge and therefore the sentence of six months was manifestly excessive. In that case, the accused was sentenced to four weeks’ imprisonment for hitting the victim’s head five times with a high heeled shoe and four weeks’ imprisonment on another charge for hitting the victim’s head with a plastic bucket. The accused had claimed trial and had used a weapon to assault the domestic maid. The use of a weapon was an aggravating factor. In the present case, ADF never used any weapon in the assaults. 129    However, inHo Yean Theng, the accused was charged only under s 323 of the Penal Code. Section 73 of the Penal Code was not applicable because the accused was the victim’sde factoemployer and not thede jureemployer. Therefore, the sentence imposed in that case cannot be a relevant precedent for this case. The closest precedent would be one of the sentences imposed inTong Chew Wei(see above at[84]) where the accused received a six-month imprisonment term for using his right hand to punch on the maid’s left face area, grabbing and pulling her hair and using his elbow to hit her upper centre back: see alsoHeng Kwee Huangreferred to at[82]and[127]above. For the reasons given earlier, the sentence on this charge is neither manifestly excessive nor inadequate if one were only to have regard to existing sentencing benchmarks without factoring the peculiar aggravating features identified as relevant here. 10th charge 130    ADF was again sentenced to a term of six months’ imprisonment for kicking the maid’s hips. His counsel relied onOng Ting TingandFoo Chee Ringto argue that a sentence of four weeks’ imprisonment would be appropriate. InOng Ting Ting, the accused received a one-week imprisonment for kicking the victim’s thighs. InFoo Chee Ring, the accused received four weeks’ imprisonment for slapping the maid’s cheek and kicking the lower part of her thighs. 131    The reliance placed by ADF’s counsel onOng Ting TingandFoo Chee Ringis misplaced. The nature of the abuse in these two cases is very different from the present case. InFoo Chee Ring, there was no evidence of any injury. Similarly, there was only a 0.5cm bruise on both knees of the maid inOng Ting Ting. The injury caused here was much more serious. The bruises on her hips are significantly larger (3cm x 2cm area, see above at[12]) and are clearly visible in the photographs taken on 5 May 2006 which was a week after the injury was caused. Additionally, the current case involvedrepeatedkicking on the hips with much force. In the context of existing precedents (Farida Begam(see above at[72]-[73])) where the court imposed a 9-month imprisonment for a slightly more serious charge of voluntarily causing hurt to the domestic maid by hitting her head, face and chest with a wooden scrub and slipper, andTong Chew Wei(see above at[84]) where the accused was given a four-month imprisonment term for using his feet to stamp both the feet of the maid), I cannot say that a six months’ imprisonment term was either manifestly inadequate or excessive if one were only to have regard to existing sentencing benchmarks without factoring the peculiar aggravating features identified as relevant here. 12th and 13th charges 132    For the 12th charge, ADF was sentenced to six months’ imprisonment for kicking her abdomen several times, pushing her hard on her chest with his leg and slapping her cheeks several times. For the 13th charge, ADF was sentenced to six months’ imprisonment for kicking her abdomen several times. 133    Plainly, these are the more serious charges not just in terms of the pain inflicted but the fact that it was prolonged and came hard on the heels of the earlier offences. With respect to the 12th charge, ADF himself admitted that the assault on the victim on that day was a “bad assault” because he had lost self-control, and that the assault lasted fora few minutes, and he had continued hitting the victim even after she started crying (see ADF’s closing submissions referred to at[46]above). As mentioned earlier at [91(a)], the amount of force used is certainly a relevant factor in sentencing. Having lost his self-control, it is reasonable to infer that ADF would quite definitely have used excessive force in kicking the victim’s abdomen. The abdomen and chest rank among the most vulnerable parts of the body. Injuries to these areas usually call for a heavier sentence. Moreover, the 12th charge is a combination of acts of abuse – kicking in abdomen, pushing hard on her chest with leg and slapping of cheeks. The cumulative seriousness of the abuse in this charge is greater than the first, 9th and 10th charges.Indeed, the Defence acknowledged that the 12th charge was the most serious charge and the sentence for the 12th charge should be heavier than the rest. This concession nevertheless did not resonate with the Judge. 134    The 13th charge also involved an incident of kicking in the abdomen, a vulnerable part of the body. What is more troubling is that ADF repeated the act of kicking the victim’s abdomen after a lapse of just one day, despite knowing the victim was still in a state of physical distress because of the earlier incident . He did not show any compassion for the victim. ADF did not seem to care about the possibility of the maid suffering a serious and or permanent injury because of the successive kicks directed at her abdomen. In my opinion, the 12th and 13th charges were on the whole of similar severity and similar sentences should be imposed for both charges. The Judge, I note, was focused on the physical acts that caused the injuries during these two incidents. It seems to me that the overwhelming fear, distress and subsequent pain are also highly pertinent considerations. On 5 May 2006, when Mdm Lau and Jeanie spoke to her, the victim was evidently still in real distress. Indeed, the police officers who arrived at the scene had described the victim as hysterical, trembling, crying and unable to communicate with them, see above at[10]. Further, painkillers had also to be subsequently administered to her to ease her pain, see above at[12]. 135    ADF’s counsel submitted that a sentence of 12 weeks’ imprisonment would be sufficient. I disagree. InFarida Begam, the accused received nine months’ imprisonment for using a wooden brush to hit the victim’s chest, back, face and head and then hitting the victim with a slipper on both cheeks and forehead about four to five times. The domestic maid in that case, as a result of the assault, sustained minor bruising on her head and parts of her body. No pain-killers needed to be administered. In arguing for a sentence of 12 weeks’ imprisonment, ADF’s counsel referred toFarida Begamand attempted to distinguish it from the present case on the basis thatFarida Begamwas one which resulted in a permanent injury to the maid,viza perforated ear drum. This is incorrect. Upon reviewing the lower court’s decision, I note that the perforated-ear drum “injury” was expressly stated not to be a consideration for sentencing purposes, seePP v Farida Begam d/o Mohd Artham[2001] SGMC 33at [65].Farida Begamwas a case where a nine-month sentence was imposed for not strikingly different injuries sustained during a single incident. Clearly, the 12th and 13th charges in this case are as severe, if not more so (given ADF’s loss of self-control and the great force used), and call at the very least for an equally stiff sentence. Granting that ADF did not use a weapon, he nevertheless viciously attacked vulnerable parts of the victim’s body. Additionally, most of the aggravating factors present in this case were absent inFarida Begam, see[95]–[103]and[106]–[108]above. The term of six months’ imprisonment imposed by the Judge for each of these offences, all things said and considered, were manifestly inadequate. The Judge surprisingly imposed a similar sentence for the ninth, tenth, 12th and 13th charges even though they were not all of equal seriousness and there was a disturbing pattern of escalating violence and intimidation apropos the later offences. The same sentence as that handed out for the ninth and tenth charges would be manifestly inadequate for the 12th and 13th charges. I therefore would increase the sentences for the 12th and 13th charges to nine months’ imprisonment each. 136    To summarise, I am of the opinion that the following sentences should be imposed on ADF, in this case,vis-à-vishis respective convictions on the first, ninth, tenth, 12th and 13th charges, all of which pertain to the offence of voluntarily causing hurt under s 323 read with s 73(2) of the Penal Code:  Charge NoDate of OffenceBrief Details of Offence as stated in ChargeSentenceFirst29 January 2006Knocking the victim’s head with his knuckles several times3 weeksNinth21 April 2006Hitting the victim’s head with his hands repeatedly6 monthsTenth29 April 2006Kicking the victim’s hips6 months12th4 May 2006Kicking the victim’s abdomen several times with great force, pushing her hard on her chest with his leg and slapping the victim’s cheeks several times9 months13th5 May 2006Kicking the victim’s abdomen with great force several times9 months 137    Before I turn to the issue of cumulative sentencing, I should also point out that while I earlier referred to the first, ninth and tenth charges as being in line with existing precedents (see above at[122],[129]and[131]), it is far from clear as to how the Judge had discretely incorporated into each of these sentences the numerous aggravating factors which he had earlier correctly identified as being peculiar and relevant to this matter. One would have thought that the sentences for each of these offences would, as a result of the aggravating considerations present, be significantly higher than the existing sentencing benchmarks. My review of existing sentencing precedents and my analysis above reveals that this was not the case. Notwithstanding the presence of several compelling aggravating features, the Judge apparently no more than followed the norm. Did the Judge then subsequently take these factors into account when determining the cumulative sentence? I concluded that he did not and my reasons for so doing are as follow. Consecutive sentences 138    The Prosecution invited this Court to impose an aggregate sentence of four years and six months’ imprisonment. Each of the offences, it is contended, ought to merit the maximum sentence of 18 months and furthermore, three of these sentences ought to run consecutively. ADF’s counsel, on the other hand, argued that an aggregate sentence of 12 weeks,ie, three months’ imprisonment should be imposed. 139    ADF has been convicted of five offences. Section 18 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“CPC”) states that: Where at one trial a person is convicted and sentenced to imprisonment for at least 3 distinct offences, the court before which he is convicted shall order that the sentences for at least two of those offences shall run consecutively. 140    The Judge ordered the sentences for the ninth and 13th charges to run consecutively. The sentences in the first, tenth and 12th charges were ordered to run concurrently. This was the minimum number of consecutive charges mandated by s 18 of the CPC. Undeniably, the Judge therefore did not consider the peculiar aggravating features as being a relevant consideration in assessing whether he should order further consecutive sentences. The Prosecution submitted that three of the charges should run consecutively, emphasising that while s 18 mandates that at least two of the offences ought to run consecutively, the words “at least” confers the discretion on the Court to order more offences to run consecutively. 141    The Prosecution is of course correct in stating that the Court has an unfettered discretion to order more than two sentences to follow consecutively, where multiple offences have been committed by the same offender. The object of s 18 of the CPC “is to ensure that a person who has committed multiple offences will receive a longer sentence than one who commits a single offence”, and has special relevance in cases of “persistent or habitual offenders” , see the second reading in Parliament of the Criminal Procedure Code (Amendment No 2) Bill (Bill 11 of 1984),Singapore Parliamentary Debates, Official Report(26 July 1984) vol 44 at cols 1897–1898 (Professor S Jayakumar, Second Minister for Law)), to amend the CPC by enacting s 18 of the CPC. Section 18 does not also prescribe any limit to the number of consecutive sentences a court may impose in any particular matter. As to what constitutes “distinct offences”, this Court made the following observations inPP v Fernandez Joseph Ferdinent[2007] 4 SLR 1, at [21]–[22]: What should be the meaning accorded to the term “distinct”? It should be apparent thatthe term“distinct offence” envisages an additional requirement over and above just being offences under law itself, for if so, the word “distinct” would be rendered but mere surplusage. In our view, the appropriate starting point would be F A Chua J’s astute observation in the Singapore High Court decision ofTham Wing Fai Peter v PP[1988] SLR 424at 436, [63], where he observed as follows: ‘Distinct’ means ‘not identical’. Two offences would be distinct if they are not in any way inter-related but if there is some interrelation it would depend on the circumstances of the case in which the offences were committed whether there is only one transaction and only one offence was committed. [emphasis added] In considering whether the circumstances warrant the view that distinct offences had been committed, it would beimportant to ascertain how one offence can be distinguished from another. In doing so, a leading local commentator posits the following approach (see Bashir A Mallal,Mallal’s Criminal Procedure(Malayan Law Journal Sdn Bhd, 6th Ed, 2001) at para 6051): The categories of distinct offences are … many. A distinct offence may be distinguished from another offence by one or more of the following characteristics: (i)    difference in time ie, commission on different occasions; (ii)   place; (iii)   persons aggrieved or injured; (iv) nature of acts constituting offences under different sections. [emphasis in original, emphasis in bold italics added] A “series of offences of the same or similar character” (viz, s 169 of the CPC) canalsobe distinct, as with offences committed in the “same transaction” (viz, s 170 of the CPC): seeXia Qin Lai v PP[1999] 4 SLR 343at [18]. 142    More than a decade ago, this court declared that “a decision to go beyond the stated minimum of two consecutive sentences should be taken only in exceptional cases, after a consideration of the facts of the case … [and] the one transaction rule and the totality principle”: seeMaideen Pillai v PP[1996] 1 SLR 161(“Maideen Pillai”) at [7]. 143    The “one transaction rule” states that where two or more offences are committed in the course of a single transaction, all sentences in respect of these offences should be concurrent rather than consecutive. It is, however,notan absolute rule and can be displaced, as recognised by this court inKanagasuntharam v PP[1992] 1 SLR 81(“Kanagasuntharam”) at [6], where it agreed with the English position that “consecutive sentences are necessary to discourage the type of criminal conduct being punished” in order to give effect to the principle ofdeterrence. 144    The totality principle, as explained by Dr D A Thomas inPrinciples of Sentencing(Heinemann, 2nd Ed, 1979) at p 57 is as follows: [T]he principle has two limbs. A cumulative sentence may offend the totality principle if the aggregate sentence is substantially above the normal level of sentences for the most serious of the individual offences involved, or if its effect is to impose on the offender ‘a crushing sentence’ not in keeping with his records and prospects. This definition was endorsed inKanagasuntharamat [13],Law Aik Mengat [57], and recently by Chan Sek Keong CJ inJeffery bin Abdullah v PP[2009] 3 SLR 414(at [15]). Like the one-transaction rule, the totality principle should not be seen as an inflexible rule (seeLaw Aik Mengat [60]): …but rather as a helpful guideline to remind the court that the correlation of the sentence to thegravity of the offender’s conduct and offencesis of critical importance. In short, sentences must be restrained by the principle of proportionality. [emphasis added] InChen Weixiong Jerriek v PP[2003] 2 SLR 334, Yong CJ emphasised that the totality principle should not be a shield for offenders to get around the clear and important considerations of public order and safety. He observed, at [31], that: ... But I must stress that the totality principle must not be allowed to strait-jacket the courts, such that they cannot impose severe sentences where the circumstances warrant this; it may well be necessary to do so where the public interest requires that the offender be kept in a custodial environment in order to keep our society safe from individuals who have no capacity for rehabilitation. It should not be open to offenders such as the appellant to use the totality principle as a shield to get around the clear and important considerations of public order and safety. 145    The applicability of both the one-transaction rule and the totality principle (which are essentiallycommon lawprinciples) in Singapore has been qualified by the operation of s 18 of the CPC: seeLaw Aik Mengat[51]andCriminal Procedure(LexisNexis, 2009) at XVIII [4251]. Putting aside the first limb of the totality principle (which is qualified by s 18 of the CPC: seeKanagasuntharamat [10]), the second limb of the totality principle requires the court to review the sentence and consider whether the aggregate sentence is “just and appropriate” (seeKanagasuntharamat [12]) and to avoid an aggregate sentence that is so harsh as to be “crushing” in its effect on the offender. As stated at [11] ofMaideen Pillai: [w]here consecutive sentences are imposed on an offender, the overall punishment should be in proportion to theoverall gravity of his criminal conduct, taking into account the circumstances in which he offended and also the pattern of his previous behaviour. [emphasis added] 146    It will be helpful if I clarify the position further. The discretion given by s18 of the CPC, despite the lack of manifest statutory constraints, is one that must be exercised sparingly and carefully assessed in relation to the one-transaction rule as well as the totality principle within the broad context of the material facts. A decision to impose more than two consecutive sentences ought not to be lightly made and, indeed, should usually only be imposed in compelling circumstances. Concurrent sentences are ordinarily called for when there is a single episode of criminality which results in a number of offences having been committed. For the avoidance of doubt, I stress that there is, however, no rule or principle of sentencing that distinct offences committed on the same day or in the same criminal episode must be made to run concurrently. On the other hand, the totality principle cannot be unthinkingly invoked to minimise punishment for those who maliciously pursue a deliberate course of criminal behaviour. Multiple wrongdoing by a multiple wrongdoer as a general rule must be viewed more severely than single offending involving similar offences. The community (and the victim(s)) have suffered more because of the greater harm done. Often the exercise of this discretion will involve intuitive (and not mathematical) considerations and calibration that takes into account the totality of the criminal behaviour. There is no rigid linear relationship between the severity of the offending and the length of the cumulative sentence. In my view, an order formore thantwo sentences to run consecutively ought to be given serious consideration in dealing with distinct offences when one or more of the following circumstances are present,viz: (a)     dealing with persistent or habitual offenders (see[141]above); (b)     there is a pressing public interest concern in discouraging the type of criminal conduct being punished (see[143]-[144]above); (c)     there are multiple victims; and (d)     other peculiar cumulative aggravating features are present (see[92]) above. In particular, where the overall criminality of the offender’s conduct cannot be encompassed in two consecutive sentences, further consecutive sentences ought to be considered. I reiterate that the above circumstances are non-exhaustive and should not be taken as rigid guidelines to constrain or shackle a sentencing court’s powers. Beyond this, I do not think that it will be helpful to spell out how this discretion must be exercised. Myriad permutations of offending can take place and too dogmatic or structured an approach would constrain effective sentencing. In the ultimate analysis, the court has to assess the totality of the aggregate sentence with the totality of the criminal behaviour. 147    In assessing whether I should sentence ADF to more than two consecutive sentences, I have to acknowledge that there are indeed irresistible considerations that tilt in favour of the Prosecution’s submissions. ADF should certainly be considered a persistent offender (see[104]-[105]above) whose desire to make life “miserable” for the victim never once faltered over the course of four months after he had decided to wage “psychological warfare” against her, see below at[150]. There is also a compelling need to discourage domestic maid abuse in general (see[55]above). In the present case, the following additional cumulative aggravating features, which were not sufficiently considered (if at all) by the Judge when assessing the case for consecutive sentencing, would be relevant: (a)     The fact that mental abuse took place in conjunction with physical abuse, the appalling conditions of employment and undoubted distress that the victim had to endure for a substantial period, see above at[7]and GD 1 at [14] and [15] where the Judge found that the maltreatment started on 29 January 2006 and continued until it came to light on 5 May 2006. (b)     The fact that ADF entertained a deliberate intention to make the victim’s life miserable over a prolonged period of time. (c)     The fact that ADF had not only abused her but kept her back in Singapore against her will. The victim had repeatedly requested that she be repatriated as she was deeply distressed by the treatment she was accorded by ADF and his wife. ADF had refused to do this and instead, threatened to imprison her in response to the request[note: 26]. 148    With respect to feature (a), that the victim was in a state of deep distress is indisputable. I note that she made the following plaintive entry in her notebook[note: 27]: I, [the victim] when working herealways get beaten by both my employers like an animaland I always accept the beatings from both of them and I know this could be my retribution of the wrongdoings I have made towards them butis the torture they have given me not enough[?] …” [emphasis added] InPP v Kwong Kok Hing[2008] 2 SLR 684, the Court of Appeal recognised that hurt can extend to non-physical injury such as mental harm. The Court further observed, at [28]: Thus, despite the relatively superficial physical injuries suffered by the victim, the emotional trauma callously inflicted upon her by the respondent should not have been overlooked. Psychological wounds, while invisible to the eye, can often be far more insidious and leave an indelible mark on a victim’s psyche long after the physical scars have faded. Expert psychiatric evidence could also perhaps have been tendered to evaluate the longer-term impact of the incident on the victim.In the event that the psychological harm is permanent, this would constitute an aggravating factor that would have to be taken into account during sentencing, almost invariably meriting more severe punishment. [emphasis added] 149    The victim had suffered in painful and miserable silence for a lengthy period. She did not receive any medical attention for the injuries that she suffered and had to mutely endure the pain without any respite. If not for Mdm Lau and Jeanie, the abuse may well have persisted for an even longer period of time. This was the victim’s first job experience in Singapore. It has turned out to be a traumatic, wrenching and painful nightmare that will haunt her. The physical scars may have healed. The emotional scars she has suffered will, on the other hand, take a long time to heal, if ever. 150    With respect to feature (b), it is important to note that during re-examination, ADF said[note: 28]: And the thing is, I---I---I did admit that I want to make her life miserable. I set up quite a number of rules for her.I just want her to feel miserable.I---I’m just having psychological warfare to her only. [emphasis added] 151    I am deeply troubled by this acknowledgement by ADF which can also be objectively inferred by the pattern of abuse inflicted on the victim over the relevant period. The Judge correctly found that ADF’s abuse was not the result of spontaneous lapses of self-control. He observed at [23] of GD 2: [ADF’s] hostility towards the [victim] was revealed by his admission that “… I want to make her life miserable ... I’m just having psychological warfare to her only”, which his counsel expanded on in the plea in mitigation: 19.    After that shaking incident, the relationship between [ADF] and [the victim] went downhill. He was less patient and he scolded her more. He never managed to forgive [the victim] for what she had done to Hazel and the shaking incident played on his mind subsequently. He had unwittingly allowed his deep anger and frustration with [the victim] over that shaking incident to get the better of him, and that eventually led to him losing control of himself and assaulting [the victim]. In the light of the admission, the assaults were not spontaneous lapses of self-control. They were the vengeful reaction to the [victim’s] continued presence in his house. I do not see how it can be said that he had “unwittingly” allowed this anger and frustration to get the better of him. The clear evidence is that he deliberately assaulted [the victim], not once, but on repeated occasions. He allowed himself to vent his dislike of her by violence, and made no effort to check himself. 152    I agree with the Judge that from ADF’s conduct, it is clear that he had no regard for his maid’s well-being. He did not treat her with even a modicum of respect. ADF wanted to literally and figuratively “stamp” his authority and superiority over the domestic maid by ensuring that she lived in fear and misery without being accorded any avenue to complain. The Judge thus observed, at [25] of GD 2: Throughout that period, [ADF] had not once apologised to [the victim] for his conduct, made any promise to stop the abuse or show any concern over the injuries inflicted on her. The only concern he experienced was for himself and his wife in the event the assaults became known. 153    The Judge with good reason concluded at [23] of GD 2 that the assaults “were the vengeful reaction to [the victim’s] continued presence in his house. ... [ADF] allowed himself to vent his dislike of her by violence, and made no effort to check himself”. 154    With regard to feature (c), this deplorable conduct appears to have altogether escaped the Judge’s attention. While I accept that several of the aggravating factors were mentioned by the Judge, he nevertheless failed to consider the cumulative aggravating features and the other factors mentioned at[147]above, when performing the second step of the sentencing process,ie, when determining whether the multiple offences ought to run concurrently or consecutively. 155    The cumulative aggravating features in this case are grave even though the bodily injuries caused to the victim are not permanent and no weapon was used.The Judge had not paused to consider the cumulative effect of the intentional and perverse conduct of ADF over a sustained period. The failure to do so has resulted in him imposing an aggregate sentence which is manifestly inadequate. One has only to broadly consider the sentences imposed inFarida BegamandTong Chew Weito immediately appreciate that the cumulative sentence of 12 months imposed in the present case is manifestly inadequate. InFarida Begam, a sentence of nine months was imposed and an aggregate sentence of 20 months was imposed inTong Chew Wei. Both of those cases did not have many of the peculiar aggravating factors present here. Further, even though no objects were used, on each occasion, the force exacted was considerable, blows, punches or kicks were relentlessly inflicted over a considerable period, the injuries caused were serious and the pain felt by the victim excruciating , see also[104]and[105]above. InTong Chew Wei, it is also pertinent to note that three of the sentences were ordered to run consecutively, resulting in a cumulative sentence of 20 months. The cumulative criminality of the charges inTong Chew Weiis, in my view, certainly much less severe than those prevailing in the present matter. Consequently, after assessing ADF’s overall criminality, I am satisfied that the cumulative sentence of 12 months here was manifestly inadequate. 156    These considerations inexorably coalesce to make this one of the more notable and distressing domestic maid abuse cases to have been prosecuted in Singapore. The relentless pattern of offending constrains the relevance of the one transaction rule. Crucially, the various offences were also distinct and not proximate in time. The offences were also not subsidiary to each other. My condemnation of ADF’s deplorable behaviour must be forcefully reflected by the imposition of an exemplary sentence. The Judge’s decision to sentence ADF to consecutive sentences of imprisonment on the ninth and 13th charges didnot, with respect, ultimately comprehend and reflect the criminality for the offences stated in the first, tenth and,especiallythe 12th charge. Interestingly, even the Defence conceded this was the most serious charge and warranted a heavier sentence than the rest of the charges (see[133]above). I have pointed out earlier that the sentences for the first, ninth and tenth charges did not take into account the aggravating factors present in this matter and speaking ought to have been enhanced. Nevertheless, in my opinion, condemnation of his conduct now be best comprehended by ordering the terms of imprisonment for the three most serious charges,viztenth, 12th and 13th charges, to run consecutively and the remaining sentences to run concurrently. As the other charges are to run concurrently it would be pointless to now enhance them as well. This is a sentence that appropriately encapsulates my profound aversion and disquiet with ADF’s deplorable conduct without having the effect of being crushing.",
        "Compensation for domestic maid abuse victims": "157    There is a further issue that I would like to address for completeness though it is not directly an issue in these proceedings. Section 401 of the CPC provides the Court with the discretion to make a compensation order. I think it is useful to draw attention to this useful procedure so that it may be relied on in future, in appropriate cases. Compensation orders have been made by the courts in maid abuse cases such asFoo Chee RingandTong Chew Wei. InPP v Donohue Enilia[2005] 1 SLR 220(“Donohue Enilia”), Yong CJ emphasised that a compensation order was neither punishment for the offence, nor was it part of the sentence imposed. Compensation orders are not aimed at castigating an accused but at providing redress to the victim. 158    The primary motivation for domestic workers leaving the familiarity of their home to a foreign country is undoubtedly monetary compensation. When allegations of domestic maid abuse come to light and are investigated, the typical victim would often be left without income for some time. Recovering the lost income through the civil process may be difficult given that the victim might be unfamiliar with Singapore and the legal process here, and might wish to return to her home country speedily. Here, Yong CJ, with powerful clarity, explained the strong public policy considerationsvis-à-viscompensation orders in cases where domestic maids are involved (at [55]–[58]): Our courts have taken an uncompromising stance against errant employers who exploit and abuse their foreign domestic maids. Emphasis has consistently been placed on the strong element of public interest involved when a foreign domestic maid is hurt or abused:PP v Chong Siew Chin[2002] 1 SLR 117. There have been various pronouncements in case law reiterating that foreign domestic maids have to be protected and cared for during their employment in Singapore in order that our nation evolves to become a more gracious society:Ho Yean Theng Jill v PP;Ong Ting Ting v PP[2004] 4 SLR 53. Sufficient weight must therefore be given to the public policy arguments that would favour the making of a compensation order for the victim’s unpaid salaries. … [T]he vulnerability of maids is not limited to physical abuse, but extends to financial exploitation by errant employers who default on the payment of their salaries. Maids stand in a position of vulnerabilityvis-à-vistheir employers. Because of their often impecunious status, even if maids are owed salaries by their employers, it is understandable if most would be cowed into continuing to work for the employer for fear of being repatriated and in view of the prospect of being paid at some point in the future. The maid in the present appeal earned $230 per month. Yet she was not paid at all for her services rendered. In such circumstances, she would not be likely to have the financial capability to pursue a civil claim against the respondent for her unpaid salaries. Earlier, the court had also noted that a compensation order would allow recovery where a civil suit is an inadequate remedy due to the impecuniosity of the person injured (at [19]). As also rightly pointed out by Yong CJ in the same decision, a domestic maid is often impecunious (at [57]). In the circumstances, I would agree in-principle thatif the situation so warrants, a sentencing court should not shy away from awarding compensation to an abused domestic worker pursuant to s 401 of the CPC.",
        "Conclusion": "233    Taking into account the need to underscore the court’s abhorrence of maid abuseas well asthe need to have proper regard to the situation of ADF himself (especially with respect to any relevant mitigating factors), I am of the view that both the specific sentences (which includes an enhancement of the respective sentences for conviction under the 12th and 13th charges) as well as the enhancement of the overall sentence meted out to ADF (of 24 months’ imprisonment) are both just and fair. Indeed, as Woo J pointed out (above at[179]), there was, in point of fact,nomitigating factor that operated in ADF’s favour. I agree and, hence, even though it is incumbent on me to consider ADF’s particular situation, there is nothing in his situation that went towards the mitigation of the sentence to be meted out to him. In the circumstances, the broader societal considerations with regard to maid abuse and the attendant need to prevent such conduct justified the above sentences meted out to ADF, especially where, as in the present case, the physical as well as mental and psychological abuse were both severe as well as systematic. 234    In the premises, I agree with both the reasoning and decision as well as the specific orders made by Rajah JA (above at[160]). 235    Finally, I think that it is appropriate to observe that the Prosecution conducted its case most appropriately and in the interests of justice. In particular, the many relevant factors which were directly relevant to the sentencing of ADF in this case were all raised by the Prosecution in great detail and with scrupulous accuracy (including the nature and extent of the injuries caused to the victim by ADF (which also embodied the mental trauma suffered by the victim); the fact that ADF had abused his position as a police officer to commit the various offences; as well as the systematic waging by ADF of “psychological warfare” on the victim). All this assisted the court in arriving at its decision. As Rajah JA has pointed out (in hisCodaat[169]above), the fact that we did not accept thepreciseproposals with regard to the length of the sentences to be meted out to ADF is only illustrative of the fact that sentencing is not a science. Like Rajah JA, I, too, would commend the Prosecution for pursuing – in an objective and fair manner – the case against ADF so as to establish clear boundaries in an important area of sentencing practice.  [note: 1]Record of Appeal (“ROP”) Vol 6 at pp 8-13 [note: 2]The first charge was amended by the trial court by changing the word “night” to “morning” [note: 3]ROP Vol 6 at p 156 [note: 4]Id [note: 5]ADF’s Closing Submissions dated 19 March 2008 at para 365 [note: 6]See ADF’s submissions dated 25June 2009 at paras 153 and 154. [note: 7]ROP Vol 6A – Exhibit PS 30, p 422, para 2. [note: 8]ROP Vol 6A – Exhibit PS 30, p 423, line 2. [note: 9]ROP Vol 6, p 86, Exhibit “P78”. [note: 10]ROP Vol 6, p 68. [note: 11]See ADF’s submissions dated 25 June 2009 at para 19 [note: 12]See ADF’s submissions dated 25 June 2009 at para 63 [note: 13]ROP Vol 6, p 114 [note: 14]ROP Vol 4, p1829, lines 22–25 [note: 15]ROP Vol 4, p 1835, lines 9–18 [note: 16]ROP Vol 3, p 1203, lines 8–16 [note: 17]ADF’s Closing Submissions dated 19 March 2008 at paras 277, 281 and 282. [note: 18]Time, Indonesia Pushes for Better Migrant-Worker Protection, 28 July 2009, Lisa Thomas@ <http://www.time.com/time/world/article/0,8599,1913134,00.html> (accessed 16 November 2009) [note: 19]Source: <http://www.singapore-window.org/sw02/020727bt.htm> (accessed 16 November 2009) [note: 20]ROP Vol 1, p 207 line 4 [note: 21]ROP Vol 6A – Exhibit PS 30 , p 423, line 2. [note: 22]ROP Vol 5, p 1960, lines 12-17. [note: 23]ROP Vol 5- p 2000, lines 3, 20-23 [note: 24]ADF’s submissions dated 25 June 2009 at para 197 [note: 25]ROP Vol 5, p 2279, lines 3 - 18 [note: 26]ROP Vol 1, p 90, lines 27-30 [note: 27]ROP Vol 6, Entry 56 of P84 at p 188 [note: 28]ROP Vol 5. p 1944 lines 2 – 5",
        "Coda": "164    I have had the opportunity to consider the draft judgment of Woo Bih Li J (Woo J’s GD) penned in response to my draft judgment. Woo J dissents from the reasons I have given for increasing the sentences imposed on ADF on the 12th charge (an incident where ADF forcefully kicked the victim’s abdomen several times, pushed her hard on her chest with his leg and then slapped her cheeks several times) and the 13th charge (an incident where ADF forcefully kicked the victim’s abdomen several times) to terms of nine months’ imprisonment respectively. In addition, Woo J also disagrees with my reasons for increasing ADF’s cumulative sentence to 24 months. 165    In disagreeing with my determinations, Woo J appears to have made four main points: (a)     the fact that a domestic maid is a vulnerable person and the employer and other household members are in a position of authority ought not to be viewed as an aggravating factor, at [176] of Woo J’s GD; (b)     that there is a current sentencing norm of one to six weeks imprisonment in cases where there is no serious physical injury, at [178] of Woo J’s GD; (c)     that in relation to the aggravating considerations I had adverted to at[91]above, “the seriousness of the injury is already taken into account when the appropriate sentence is considered, without any aggravating factor. It should not then be taken into account a second time as an aggravating factor”, at [191] of Woo J’s GD; (d)     that the cases ofFarida BegamandTong Chew Weishould not be used to support a higher sentence in the present matter, at [200]-[211] of Woo J’s GD as they are factually different. 166    I have considered these points and have this to say in responseseriatim: (a)     Woo J appears to have read my judgment as accepting that the fact an employer is in a position of authority and that a domestic maid is in a vulnerable positionaproposthe relationship is an aggravating factorper se. This is not correct. While Yong CJ did indeed make such an observation inFarida Begam(see[73]above), in my judgment I have, on the other hand, underscored that what is really significant is the degree of abuse of position or authority over the domestic maid and not the mere existence of the relationship, see [91(c)] of my GD. Woo J is of course correct in saying that the vulnerability of the maid and the potential for abuse of authority by an employer is an intrinsic feature of every such relationship. That, however, does not really quite address the point I made. Precisely how that vulnerability has been exploited and the extent of the abuse of authority is in every case a highly significant sentencing consideration. In every case, other than the circumstances in which the assault has taken placed and the nature of the injury sustained, the context in which the domestic maid may have been generally mistreated is highly pertinent in assessing the severity of the sentence. Surely, it cannot be said that an abusive employer who persistently mistreats and humiliates a maid and then later physically injures her should be sentenced similarly with one who ordinarily treats a maid well but then on a solitary occasion loses control of himself and then inflicts a similar injury? In my view, the greater the magnitude of the preceding abuse and victimisation by the employer, the more severe the sentence ought to be. It would not be correct to just punish an offender symptomatically for mere physical injuries caused without factoring the preceding abuse and exploitation that has taken place as well as the manner of the assault which precipitated the prosecution. An offender ought to be punished for all the conduct that a charge can reasonably encompass. Conduct that glaringly departs from ordinary behavioural norms ought to be considered as aggravating. (b)     There is certainly no sentencing norm for the particular offences which ADF has been convicted of. What is a serious physical injury? An injury need not be of a permanent nature to be a serious physical injury. Indeed the Penal Code has a separate regulating regime, and a definition in s 320 of the Penal Code, to deal with grievous injuries (most of which are of a permanent nature). For example, permanent privation of the sight of either eye, permanent privation of the hearing of either ear, destruction or permanent impairing of the powers of any member or joint and permanent disfiguration of the head or face come under the definition of grievous hurt. Does that mean that anything short of a grievous or permanent injury is not a serious injury? Almost all the injuries that the victim sustained cannot be accurately described as being anything less than serious and painfully distressing. For instance, even ADF acknowledged that the incident concerning the 12th charge was a “bad assault”, see[40]above. For what by any account were long periods of her employment, the victim was constantly in severe distress because of the frequent assaults she received. It is not helpful to clinically take a selective tissue-slicing approach in dissecting an assault and then diminish the importance of the context and peculiar distressing consequences of the offences. The sentencing patterns I have highlighted are illustrative of a pragmatic approach acknowledging that in appropriate cases of serious physical injuries, the sentences must fall to be assessed by the various considerations that I have outlined at[91]. This matter, I reiterate, after careful consideration of all the relevant decisions, is all in all, one of the more troubling cases of domestic maid abuse that has come to light and references to sentencing norms for minor injuries are neither helpful nor apt. There, is one further point. By the time the medical examination was conducted and the photographs taken some of the earlier injuries would have been either no longer visible or had healed. The medical report and the photographs, therefore, do not accurately convey the full picture of the physical abuse the victim had to endure. (c)     Plainly, the seriousness of the injury is always a pertinent sentencing consideration. The severity of the sentence should bear a relationship, though not necessarily a linear one, with the injury that has been inflicted. This, of course, is not the same as saying that after the seriousness of the injury has been factored into the sentence, the sentence should once again be enhanced. (d)     The cases ofFarida BegamandTong Chew Weihave been adverted to not so much as to justify the sentences but rather as being illustrative of the current sentencing practice and to give context to it. It is trite that the sentence must fit the crime. Precedents are particularly relevant when they embrace similar facts. My attention has not, however, been drawn to any prior decision that approximates the scale of abuse established here for convictions that relate merely to a series of offences under s 323 of the Penal Code. Woo J has emphasised that the facts of these cases are different, at [200] of Woo J’s GD. Of course, they are different. That, with respect, is not the point. The fact that a wooden scrub and slipper was not used to hit the victim here unlikeFarida Begam’scase is not a significant consideration. A blow from the fist of a man can have the same, if not more, injurious consequences than being hit by a scrub or slipper by a female as inFarida Begam’scase. In addition, the absence of a weapon is not a mitigating consideration. At the end of the day, it is crucial that the scale and pattern of abuse that ADF has been shown to have inflicted on the victim as well as the “psychological warfare” that he conducted not be glossed over. I should add that the references to earlier sentencing decisions were not made simply in some misguided attempt to justify the sentences. Rather they have been referred to so as to illustrate current sentencing patterns for this genre of offences. 167    Having carefully considered all reasons given by Woo J in his dissenting judgment I have not been persuaded to alter any of the views expressed above. This is, with due respect to Woo J, a case of heinous abuse that merits severe denunciation and tough sentencing. 168    Finally, there is one other matter that I am constrained to reluctantly address. Woo J (at [215]–[216] of Woo J’s GD) has been critical of the Prosecution’s stance in forcefully pressing for a cumulative sentence of four and a half years, describing it as “not well-considered”. Regrettably, I have to disagree with this characterisation of the Prosecution’s conduct of this appeal. That the Prosecution has pressed for a severe sentence in this matter, given the unhappy confluence of several aggravating features, is entirely understandable. The Prosecution is of course entitled to make any submission it considers appropriate on the basis of what it fairly considers to be the established facts. This, of course, does not mean that its submissions will invariably prevail. If I may adopt and adapt a rather familiar turn of phrase: counsel are at liberty to propose but in the end it will be for the Court to dispose. 169    In fairness to the Prosecution, it must be said that there can be no suggestion that it has not diligently drawn to our attention all the available authorities that may reasonably be relevant to the appeal on sentence. While one may certainly disagree with the level at which the Prosecution’s submissions have been pitched, neither the High Court nor this Court has been misled in any way by it. I am confident that the decision to make this sentencing submission to us was arrived at only after the most careful deliberation. Indeed, the length of the Prosecution’s submissions on sentence is a testament to the not inconsiderable effort it has put into this aspect of the appeal. While the Prosecution has not fully succeeded in its appeal, and may have even been incorrect on how it has perceived some of the relevant sentencing considerations, this does not mean it has been irresponsible. As Woo J has perceptively noted, (at [197] of Woo J’s GD) sentencing is not a science. I would add to this by observing that views on sentencing can, and sometimes do in difficult cases, widely diverge. Undoubtedly, this case is a good illustration of this point as Woo J has taken a decidedly different view from Phang JA and me. A serious difference of views in difficult matters of sentencing cannot be said to be “not well-considered” – even if the submissions are widely off the mark. This is of course subject to the obvious proviso that counsel has not attempted to mislead the court. I, for my part, would like to commend the Prosecution for resolutely pursuing this appeal so as to ensure that ADF receives his just desserts as well as to unequivocally signify to the public that all domestic maid abuse cases will be uncompromisingly pursued by both the Prosecution and the police alike. Woo Bih Li J: 170    The circumstances leading to this appeal by the accused person, ADF, have been set out in the judgment of V K Rajah JA which I have read. In summary, ADF was convicted on five charges being the first, ninth, tenth, 12th and 13th charges. He appealed against his conviction in respect of the tenth, 12th and 13th charges. He also appealed against the sentences imposed in respect of each of the five charges and the consecutive sentences for the 9th and 13th charges. The Prosecution also appealed in respect of each of the sentences and the totality of the sentences. 171    Each of the charges pertains to the offence of voluntarily causing hurt to the victim, a domestic maid employed by ADF’s wife. The offence of causing hurt relates to bodily hurt (see s 319 of the Penal Code (Cap 224, 2008 Rev Ed)) although a maid may suffer emotional or mental abuse as well. The offence is punishable under s 323 read with s 73(2) of the Penal Code. 172    The main medical report for the purpose of the five charges is the one dated 1 June 2006 by Dr Chan Kim Poh. The physical examination of the victim for bodily injuries was conducted on 5 May 2006. The following injuries were observed: (a)     1 x 3cm scratch mark over her left anterior chest at the second to third rib region. (b)     1 x 1cm scratch mark over the inner and upper quadrant of her left breast. (c)     Patches of ecchymoses of brownish-yellow in colour over her right face; over the temple, maxillary and paranasal region. (d)     3 x 2cm area of ecchymoses over her left hip greater trochanteric region, brownish-yellow in colour with bluish tinge. (e)     3 x 3cm area of ecchmoses over her right hip greater trochanteric region, brownish-yellow in colour with bluish tinge. (f)     Right eye subconjunctival haemorrhage laterally. (g)     Tenderness over her left lower chest wall laterally over tenth to twelfth ribs region. (h)     Eczematous patches over her anterior abdominal wall on the right, from right hypochondrium to suprapubic region. None of the injuries are permanent. 173    I agree with Rajah JA that ADF’s appeal against the said convictions is to be dismissed. However, I have a different view from Rajah JA in respect of the sentences. I will vary the decision of the judge below (“the Judge”) on sentencing to the limited extent stated below but the overall sentence of 12 months remains. Accordingly, subject to the said variation, I am of the view that both ADF’s appeal and the Prosecution’s appeal on sentencing should be dismissed. 174    The action of an employer or of a member of the employer’s household in causing hurt to the domestic maid employed is often referred to simply as “maid abuse” and I shall use that terminology for convenience. 175    However, it is useful also to bear in mind a point which the Defence had stressed. Generally speaking, maid abuse cases are treated more severely in that they are more likely to attract custodial sentences or higher custodial sentences, as the case may be, than other cases. This is because maid abuse cases are in a special category. This is in view of the vulnerability of such persons in the hands of employers, and persons in their household, who exercise authority over them not of the kind or extent usually associated with other employer-employee relationships. Hence, there is a special provision in s 73(2) of the Penal Code which stipulates that the court may sentence an accused person convicted of maid abuse to one and a half times the amount of punishment which he would otherwise have been liable for. 176    Accordingly, the fact that a maid is a vulnerable person and that the employers, and persons in the employee’s household, are in a position of authority over her is, in my view, not an aggravating factor. This is the essence of maid abuse cases which are already treated as a special category. I would add that the fact that the assault is unprovoked, in the sense of having been brought about by some minor or innocuous incident, is also not an aggravating factor. Again, that is unfortunately the essence of most maid abuse cases. 177    Before I go on, I stress that my observations above are not to be mistaken to suggest that the courts should treat maid abuse cases with a lighter touch. Such cases remain a serious concern to all right-thinking persons and civilised society. 178    The sentencing norm for maid abuse where no serious physical injury is caused is said to be one to six weeks’ imprisonment: seeOng Ting Ting([79]supra) at [48]. This has been adopted in various cases. 179    I come now to the sentences in respect of each charge before taking into account any aggravating factor. There was no mitigating factor and so I shall say no more thereon. I do not propose to repeat the facts of the various precedents cited by the Judge and during submission and by Rajah JA unless necessary. 180    The first charge was for knocking the victim’s head with knuckles several times on or about 29 January 2006. I am prepared to accept that three weeks’ imprisonment is not manifestly excessive aside from any aggravating factor, even though it appears to me to be a bit excessive. 181    The ninth charge was for hitting the victim’s head with ADF’s hands repeatedly on or about 21 April 2006. The photographs showed bruises on her face and another injury. This other injury was manifested by quite a big red spot in the victim’s right eye although there was no suggestion that ADF had targeted the eye. The medical report dated 1 June 2006 described this as subconjunctival haemorrhage laterally. 182    I am of the view that eight weeks’ imprisonment for the ninth charge is appropriate, without any aggravating factor. 183    The tenth charge was for kicking the victim’s hips on or about 29 April 2006. There were bruises around her hips and thighs. The act of kicking is, generally speaking, more deliberate and forceful than the use of a hand. I am of the view that two to three months’ imprisonment is appropriate, without any aggravating factor. 184    The 12th charge was for kicking the victim’s abdomen several times on or about 4 May 2006, pushing her hard on her chest and slapping her cheeks several times. I agree that this charge involved the most serious acts of violence and injuries. I am of the view that a sentence of four months is appropriate, without any aggravating factor. 185    The 13th charge was for kicking her abdomen several times on or about 5 May 2006. I am of the view that a sentence of two to three months is appropriate without any aggravating factor. 186    The Judge imposed a sentence of six months for each of the ninth, tenth, 12th and 13th charges after taking into account all the factors including aggravating factors. I think he approached the sentencing of ADF in the round as no injustice was done in the circumstances. I am of the view that a sentence in the round of three months for each of the tenth, 12th and 13th charges is appropriate, without any aggravating factor. For the ninth charge, I have mentioned that I would have thought that eight weeks should be the sentence, without any aggravating factor. 187    In reaching his decision on sentencing, the Judge appeared to have taken into account the following as aggravating factors: (a)    the circumstances leading to each assault were the minor innocuous mistakes of a domestic maid, made without any defiance, disrespect or dishonesty; (b)    [ADF] had harboured a deep-seated resentment against [the victim]. He had wanted to dismiss her, but was dissuaded by his wife. He then decided to make [the victim]’s life uncomfortable; (c)    [ADF] had abused his position as a police officer and preyed on [the victim]’s fear and respect of authority; and (d)    [ADF] had continued his assaults on [the victim] without let-up or concern for her. 188    On the second factor, the Judge noted that ADF had admitted that he wanted to make the victim’s life miserable. He wanted to wage psychological warfare on her. All this arose as the victim had allegedly shaken ADF’s baby on one occasion. 189    On the third factor, the Judge noted that ADF had impressed on the victim that he was a police officer and when he threatened to have her imprisoned, he must have known that she would take that seriously because he was a police officer. By so doing, he had abused his position as a police officer. 190    Rajah JA mentioned the following as some factors to be taken into account as aggravating factors (see[91](a) to (f) above): (a)     the more serious the injury and or the trauma, the greater the sentence imposed; (b)     the use of weapons or objects in causing hurt to the victim is an aggravating consideration; (c)     degree of abuse of position or authority over the maid; (d)     prolonged abuse over a period of time is an aggravating factor, especially if the severity of the abuse escalates over time; (e)     where mental abuse takes place in conjunction with physical abuse, this inevitably ought to be also reflected in the severity of the sentence; and (f)     absence of genuine remorse by the maid abuser is relevant. 191    I am of the view that the seriousness of the injury is already taken into account when the appropriate sentence is considered, without any aggravating factor. It should not then be taken into account a second time as an aggravating factor. 192    The use of weapons does not apply to the present facts. 193    As for the degree of abuse of position of authority, I have mentioned that the essence of maid abuse cases is the abuse of authority. Unless the degree of abuse is exceptional, the mere fact of abuse of authority is not an aggravating factor. In the present case, ADF had abused the fact that he was a police officer to subjugate the victim and the Judge did take this into account. I agree that this is an aggravating factor. 194    I accept that the prolonged abuse over a period of time is an aggravating factor. It may be taken into account in the specific sentence or the overall sentence. 195    I also agree that mental abuse should be an aggravating factor. In this regard, the Judge had noted that ADF was making life miserable for the victim by waging psychological warfare on her. Other instances, for example, like making her write a diary of wrong-doing and hanging the diary around her neck are, in my view, part of the overall warfare he was waging. They do not become additional factors of aggravation. Other illustrations like whether she had to ask permission to have daily meals or take food were less weighty in the overall picture even if this was his requirement as opposed to a requirement of ADF’s wife. Some members of society may not even consider the requirement to seek permission as a form of maid abuse. I need not say more on this as it is immaterial for present purposes. 196    The absence of genuine remorse seems to me to overlap with prolonged abuse. It is because there is no genuine remorse that there is a pattern of prolonged abuse. The absence of genuine remorse should not be an additional aggravating factor in cases of prolonged abuse. I would also have been sceptical of any late expression of remorse by ADF. 197    I consider ADF’s abuse of his position as a police officer, the prolonged period of physical abuse and the overall ill-treatment, including the psychological warfare, to be the significant aggravating factors. In my view, the Judge had taken into account these factors and more when he sentenced ADF for each relevant charge and when he included the two consecutive sentences he imposed, although he did not specifically identify which factor was for the specific sentences and which was for the consecutive sentences. Bearing in mind that sentencing is an art and not a science, I do not think it is necessary to draw the distinction especially when a court is only applying the minimum two consecutive sentences. 198    Taking into account the aggravating factors, I am of the view that six months for each of the tenth, 12th and 13th charges and a period of four months for the ninth charge are appropriate. I will not enhance the sentence for the first charge as it was the first of the instances of maid abuse before us and I am already of the view that it is slightly excessive, if there is no aggravating factor. 199    Accordingly, I am of the view that the Judge’s sentence for the ninth charge should be reduced from six months to four months. The consecutive sentences should be varied to apply to the 12th and 13th charges instead of the ninth and 13th charges. The total term of imprisonment remains at 12 months, as was the decision of the Judge. 200    I come now to two cases which Rajah JA highlighted. It is true that in the first case,Farida Begam([23]supra), the accused was sentenced to a total of nine months’ imprisonment by the High Court. However, the facts there were different. On the one hand, only one charge of maid abuse was the subject of the appeal there although there were allegations of other instances of abuse. Yet, there were other more aggravating factors. The accused had hit the maid on the head and upper body several times with the pole of a brush. She then hit the maid hard on the face with a slipper. A medical report noted that the maid’s injuries included: hematomas and lesions over the scalp, bruises over the temples, nose and eyelids, swelling of the eyes and a bruise over the shoulder. 201    Furthermore, at [24] there, the court considered the following as aggravating factors: (1)    PW4 sustained rather serious injuries, concentrated on the head and face, which are vulnerable parts of the body. (2)    The appellant did not use her bare hands, but used a wooden pole and a slipper. (3)    The appellant was in a position of authority over PW4. (4)    PW4 was a vulnerable victim. Maids have been recognised as a category of persons in need of greater protection. (5)    The attack was unprovoked. (6)    The appellant had shown no remorse. She had not apologised to PW4 nor paid her any compensation. She even tried to cast aspersions on PW4’s character during the trial. 202    For reasons stated above, I am of the view that some of those factors were not in fact aggravating. Bearing this in mind and the fact that a pole and a slipper were used, I am of the view thatFarida Begamshould not be used to support a higher sentence than six months for any of the tenth, 12th or 13th charges before us. 203    The second case is a recent decision of the District Court inTong Chew Wei([84]supra). The accused person was convicted of seven charges of which three of the sentences for the first, third and seventh charges were ordered to run consecutively. 204    The first charge there was for using a broom stick in December 2006 to haphazardly hit the left arm of the maid thereby causing her injuries. The sentence for this charge was six months. 205    The third charge related to mid January 2007. Here, the accused person was convicted for using a mug filled with hot water and throwing it towards the maid causing her to suffer a 10cm-scald burn on the right popliteal area and a 3cm scald-burn on the lateral left popliteal area (the popliteal area refers to the area behind the knees). The sentence for this charge was eight months. 206    The seventh charge related to an abuse which took place on 25 February 2007 in which the accused used his right hand to punch the maid’s face, grabbed and pulled her hair and used his elbow to hit her upper centre back. The sentence for this charge was six months. 207    The District Court considered the following as aggravating factors: (a)    First was the nature, extent, duration and frequency of the assaults. The court referred to many other occasions of being hit, slapped, punched and kicked besides the seven charges for which the maid could remember with sufficient clarity. (b)    Secondly, were the injuries and in particular, the scald burns at the back of her knees and the maid’s swollen feet. The doctor from Alexandra Hospital who had examined the maid said that this was the worst case of abuse he had seen while at the hospital (although it is not immediately clear to me how long he had been working at that hospital and how many cases of maid abuse he had seen). 208    The judgment had elaborated on the frequency and severity of the attacks and the injuries at [28] and [29]: 28    Dr Tan attended to Nana on the 28thof February, 2007 at 0251 at the Alexandra Hospital. She informed him through an Indonesian interpreter that she had been frequently assaulted by her employer. There was punching, pinching, stomping and scalding. She had been punched on the head and face, struck with a broomstick on her neck, left arm and torso, pinched on the back and right arm, stomped on her feet and had her head knocked against the wall. Nana had a total of 26 injuries on her body. These were listed in his medical report (P39) dated 17thApril, 2007. Dr Tan said that the injuries could have been sustained within the last 2 months. 29    The 26 injuries consisted of contusions, multiple abrasions and hematomas over Nana’s forehead, cheek, chest, thigh, knee, ankle, forearm, wrist, elbow, scalp, right and left flanks and interscapular back. These were of varying sizes and ages. There were also scald burns on her right and lateral left popliteal (behind the knees) areas. … Dr Tan added that there were so many injuries in this case that the account could not fit into the police report. He agreed, during cross-examination, that the injuries could have been caused by what Nana said or by other methods. 209    Thirdly, the use of a broomstick was an aggravating factor. 210    The District Court also noted that as regards the pouring of hot water on the maid, this was actually done twice. The District Court further observed that the accused should have considered himself fortunate that the Prosecution preferred only one charge arising from that incident and that the Prosecution decided not to proceed under the more serious s 324 of the Penal Code. The District Court considered that the accused’s act was particularly deliberate and pre-meditated as the accused had to take a mug and then pour hot water into the mug before throwing it at the maid. 211    It was in such circumstances that the District Court meted out the above sentences. No specific reason was given for some of the specific sentences or for the order that the above three (out of seven) sentences would run consecutively making a total of 20 months. Presumably the reason for three sentences to run consecutively was the many other instances of abuse over and above those contained in the seven charges as well as the fact of the seven charges. 212    I am of the view that the present case before this court is not as serious as that case. 213    As Rajah JA observed, a court is not restricted to ordering only the minimum two of the five sentences to run consecutively. However, there must be exceptional reasons to do so after taking into account the facts of the case and the one transaction rule and the totality principle (seeMaideen Pillai([142]supra)). I see no exceptional reason to order more than two sentences to run consecutively for ADF. Accordingly, I am of the view that the Judge’s decision on the specific sentences and the overall sentence was not manifestly inadequate. 214    I would add that there are also other cases referred to by the Judge or in submission or by Rajah JA which appear to be on the other side of the divide,ie, which suggest that the Judge’s specific sentences and the overall sentence were excessive. As I mentioned, I do not propose to reiterate them here. Suffice it to say that the nature of the injuries and the aggravating factors before us were not the same as in these cases. I am satisfied that the Judge’s decision was also not manifestly excessive in the light of all the circumstances. 215    There is one other observation I wish to make. In its submission on sentencing below, the Prosecution had asked that ADF be sentenced to 12 months’ imprisonment for each charge. The initial submission of the Prosecution below on sentencing also asked for the sentences to run consecutively but did not elaborate whether it was suggesting that all five sentences were to run consecutively or just more than two. In its reply submission below on sentencing, the Prosecution submitted that “more” of the sentences should run consecutively. Presumably, this meant more than the minimum two. The Judge said that he did not find the Prosecution’s proposal on sentencing to be well-considered. He also said, at [29] of GD 2: A comment on submissions on sentencing is apposite in closing. When counsel addresses a court on sentence, a degree of responsibility goes with it. The submission should take into account the applicable sentencing principles, guidelines, and the normal tariffs as well as the relevant facts of the particular case. When counsel asks the court to impose a sentence which departs from the norm, whether by being unusually light or severe, counsel should bring that to the attention of the court and give the reasons for the exceptional proposal. When that is not done, the submission would at best not assist the court, and at worst, it may mislead it. 216    Notwithstanding the Judge’s observations, the Prosecution took an even tougher stance before us. It asked for the maximum of 18 months’ imprisonment for each and every one of the five charges. No reason was given for this change of heart. In my view, these five charges cannot be said to be the worst instances of maid abuse under s 323 even with the aggravating factors. The Prosecution also asked for at least three of the sentences to run consecutively making a total of four years and six months. Although several paragraphs of its submission were in respect of its appeal on sentencing, I am of the view that the Prosecution’s submission for the specific sentences and the overall sentence was still not well-considered. Andrew Phang Boon Leong JA:",
        "General principles": "",
        "General observations": "218    The sentencing process is not – and ought not to be – a mechanistic one. Still less is a decision on sentencing in a given case arrived atmerelyby a resort to a prior precedent or precedents unless the facts as well as context in that case are wholly coincident with those in the prior case or cases. This last mentioned situation is, in the nature of things, likely to be rare. The sentencing process is a complex one where the precise factual matrix is all-important and where the court is tasked with the delicate process of balancing a number of important factors centring on both individual (in particular, in relation to the accused) and societal concerns. Indeed, the general aims of sentencing (viz, prevention, retribution, deterrence, rehabilitation and the public interest) embody these various concerns (see generally Kow Keng Siong,Sentencing Principles in Singapore(Academy Publishing, 2009) at ch 6). Having regard to the fact that the sentencing process is not a mechanistic one, it ought (as I have just mentioned) to be a holistic and integrated one that takes into accountallthe general aims of sentencingas applied to the precise factual matrix before the court itself, and in so far as they are relevant to that particular factual matrix. 219    The principalsocietalconcerns in thepresentcontext centre on the fact that, in a case involving the abuse of a domestic maid, the existing relationship between an employer and an employee has not only broken down but has deteriorated into one where the former abuses the latter in a manner that is repugnant to all notions of common humanity. That this is a situation which is abhorrent to all civilised societies is a proposition which is self-evident and rests on the premise thatallhuman beings are worthy of dignity and respect. Looked at in this light, no complex theory is needed to justify the need for employers to treat their maids with dignity and respect, and to refrain (on pain of legal sanction) from abusing them. 220    Put simply,allhuman beings ineverysociety are worthy of dignity and respect, and they therefore cannot – and must not – be subject to any form of abuse whatsoever (whether it be physical or non-physical). This is an irreducible and non-negotiable proposition and any legal contravention that departs from it will, as Rajah JA has stated emphatically above (at[159]and[169]), be dealt with accordingly. Indeed, all the members of this court are in agreement in so far as this general (and vitally important) point of principle is concerned (see alsoperRajah JA (above at[159]) andperWoo Bih Li J (above at[177])). It is fortunate that the great majority of employers scrupulously observe the basic tenets of the employer-employee relationship (which entails,inter alia, treating the employee with dignity and respect). Nevertheless, where errant employers have in fact abused their maids, there is a need for strict (and, depending on the precise facts, even severe) legal sanctions to be meted out. 221    Indeed, the important considerations as well as policies set out above find expression in the relevant parliamentary debates as well – significantly, in my view, in the parliamentary debates relating to the introduction of the present s 73 of the Penal Code (Cap 224, 2008 Rev Ed) (“s 73”), which introduced enhanced penalties for specific offences against domestic maids (and which is also discussed below at[230]). The Explanatory Statement of the Penal Code (Amendment) Bill (Bill No 13/98), which resulted in the enactment of the Penal Code (Amendment) Act 1998 (No 18 of 1998), that (in turn) introduced s 73 stated thus: This Bill seeks to amend the Penal Code … to provide that employers of domestic maids and members of the employer’s household who commit specified offences against the domestic maids will be liable to be punished with one and a half times the amount of punishment to which they would otherwise have been liable for those specified offence. More importantly, the Minister for Home Affairs, Mr Wong Kan Seng, observed thus during the Second Reading of the Bill (seeSingapore Parliamentary Debates, vol 68 (20 April 1998) at cols 1923–1924 and 1926–1927): Domestic maids are female, work within the confines of their employers’ home for 24 hours of the day, and except during their time-off, are isolated from the rest of society nearly all the time, and depend on their employer for food and lodging.Maids are therefore more vulnerable to abuse by employers and their immediate family members, than any other categories of employees. All employers have an obligation to treat their maids humanly and decently. The great majority of employers treat their maids well, but a small minority behave as if their maids are slaves. They get upset easily when their maids do not meet their expectations. Some even physically abuse them. Maid abuse could be in the form of simple assault or causing serious hurt. Some employers took advantage of their maids by outraging their modesty. … Maid abuse runs counter to Singapore’s aspiration to become a gracious and civil society. Abuse of foreign domestic maids can also damage our international reputation and bilateral relations. … … My Ministry proposes to designate certain offences in the Penal Code to carry 1.5 times the normal maximum penalties, if perpetrated upon a domestic maid (regardless of whether she is a local or a foreigner) by the employer or a member of the employer’s household.This will signal clearly to employers of domestic maids that the Government takes a serious view of maid abuse. … Sir, this Bill is intended to send a strong signal to those employers who have a tendency to abuse their domestic maids that we take a very stern view against such abuse. My Ministry will continue to monitor closely maid abuse trends after the enhanced penalties have been implemented. If necessary, we will take additional measures to tackle maid abuse, including expanding the situations when the enhanced penalties would apply. [emphasis added] 222    However, one cannot ignore thesecondprincipal (and, in some ways, contrasting) theme in sentencing,viz, the concerns surroundingthe individual accused. One basic tenet is as logical as it is fair and commonsensical: that an accused shouldnotbe punishedexcessively, even if the wider or broader societal concerns might suggest otherwise. As I have mentioned above, the court has tobalancethe factors fromboththe individualas well asthe societal perspectives. This concern – that the accused should not receive excessive punishment – is often reflected in that time-honoured adage that “the punishment should fit the crime”. Nevertheless, this particular adagecannotbe viewedsolelyfrom theindividualaccused’s point of view but must also take into account the relevantsocietal or publiccontext. On occasion, in fact, thesocietalconcerns are so important that they must be given predominant (even conclusive) effect. This brings us back to the principle ofbalance, always bearing in mind that the entire process must be applied by the court inas holistic and integrated a fashion as possible.",
        "Application of the general principles to the facts of the present case": "223    Turning to the facts of the present appeal, as Rajah JA has pointed out, there wasa systematic patternof abuse against the victim who was (in addition) not allowed to withdraw from the household in which such heinous conduct took place. As ADF himself admitted, he had wanted to wage “psychological warfare” on the victim (see also above at[8],[96],[147]and[150]-[151]). In this regard, one cannot – and indeed, must not – underestimate the severe harm that can befall someone in the mental and psychological sphere. Put crudely, mental abuse can be as bad as – if not worse than – physical abuse. That such abuse cannot be perceived from a material or physical perspective does not mean it does not exist and, on the contrary, may (as in the present case) prove as (or even more) debilitating (or even crippling) than physical abuse. 224    However,in addition tothe mental abuse which the victim endured (the details of which have been set outin extensoby Rajah JA above), she wasalsosubjected tosevere physical abuseas well. The old adage that “a picture says more than a thousand words” never rang truer than in the present case. The severe injuries sustained by the victim (both in the relevant photographs and as described) speak volumes. Indeed, it should be borne in mind that, if not for the public spiritedness of Mdm Lau and Jeanie, the victim would have remained in the clutches of ADF. That she was found with the injuries she had at that particular point in time could not demonstrate more clearly (in my view) that – far from being contrived – the physical injuries sustained by the victim were an accurate reflection of the relevant charges that had been levelled against ADF. When the severe physical injuries inflicted on the victim arecoupled withthe mental abuse which she was subjected to (all in asystematic and patternedfashion), it can be seen immediately that the sentence meted out by the Judge in the court below is, with the deepest respect, manifestly inadequate (with respect to the sentences for both the 12th and 13th charges, as well as with respect to the overall sentence). 225    As I have already observed (above at[218]), the sentencing process is not a mechanistic one. In the context, however, of the nature of the present offences (relating to maid abuse) as well as the systematic and patterned fashion in which they were committed, I am of the view that a more holistic view ought to be taken with respect to both the individual sentences for the individual charges as well as whether (and, if so, how many of) the specific sentences meted out should be consecutive in nature. Taking this last-mentioned issue first, it is clear, in my view, that the systematic and patterned abuse against a vulnerable victim who was physically confined against her will justify (in addition to the specific reasons based on the general principles set out by Rajah JA above) that ADF be sentenced based on that administered inthreeconsecutive charges. 226    Turning to the specific charges and sentences themselves, even if this court were to adopt the approach applied by Woo J (which comprised a base sentence which is varied by any relevant aggravating factors), it is clear, in my view, that there were aggravating factors that permeated each and every charge and which justified,inter alia, the decision to increase the term of imprisonment in respect of the 12th and 13th charges (from six to nine months) which Rajah JA has arrived at (and which I also agree with). I pause to observe, parenthetically, that the adoption of a base sentence by Woo J (what Rajah JA has, perhaps more appropriately described, in hisCoda(above at [166(b)]) as a “sentencing norm for the particular offences which [ADF] has been convicted of”) is, with respect, rather odd. Whilst there can be base sentences in a broad or general sense for specific offences, the approach adopted by Woo J is, with respect,too specificand tends (as Rajah JA has pointed out (id)) to “diminish the importance of the context and peculiar distressing consequences of the offences”. 227    However,assumingthat the approach adopted by Woo J in fact applies to the facts of the present case, it is my view that, although the 12th charge involved (unlike the 13th charge) not only the kicking of the victim’s abdomen several times but also involved the victim having been pushed hard on her chest and having had her cheeks slapped several times, the gravamen of both these charges, in my view, centred on the violent infliction of injury by kicking on a very vulnerable part of the body,viz, the abdomen. Indeed, it might be even possible to argue that the term of imprisonment in respect of the 12th charge might have been increased even further (ie, beyond nine months). Further, the injuries inflicted in respect of these charges were just part of a more holistic and systematic pattern of abuse inflicted on the victim and constituted, in the circumstances, an aggravating factor of the highest order (see alsoperRajah JA in hisCoda(above at [166(a)])). Other aggravating factors included the fact that ADF had abused the fact that he was a police officer in order to subjugate the victim as well as the mental abuse the victim was subjected to by the accused during the material period. In addition (and I agree), Rajah JA held that there had been an apparent absence of remorse on the part of ADF (see above at[106]-[107]). Indeed, Woo J himself acknowledged most of these aforementioned factors as aggravating considerations but thought that, even after taking them into account, the respective sentences of imprisonment (of six months each) imposed by the Judge was sufficient. In my view, I would beg to differ and, observe that, on the contrary, these aggravating factors were extremely serious ones which merited (particularly with respect to the 12th and 13th charges)enhancedsentences. With respect, therefore, I am unable to agree with Woo J that the base sentence for the 12th charge ought to be four months imprisonment and that, therefore, taking into account the relevant aggravating factors, the six months imprisonment imposed by the Judge for this particular charge was adequate. I am, for the same reasons, unable, with respect, to agree with Woo J that the base sentence for the 13th charge ought to be two to three months’ imprisonment and that, therefore, taking into account the relevant aggravating factors, the six months’ imprisonment imposed by the Judge for this particular charge was also adequate. 228    Another specific charge which Woo J thought ought to be reduced related to the ninth charge. In particular, he was of the view that the base sentence should be eight weeks imprisonment and that, therefore, taking into account the relevant aggravating factors, the original sentence imposed by the Judge ought to be reduced from six months to four months. In my view, the administering of the blows by ADF to the victim, together with the resultant injuries, merited at least the sentence which the Judge had meted out to ADF; and this would be,a fortiori, the case when we take into account the relevant aggravating factors referred to in the preceding paragraph.",
        "The prior case law": "229    I should add, at this particular juncture, that although numerous prior case precedents were cited to us by counsel, these were, in the main, judgments delivered in the Subordinate Courts. Quite apart from the fact that these precedents must be viewed in the light of the precise facts before the court concerned (see also above at[218]), it is also true that this court is not bound by them. This is not to state, having perused the cases, that I am not in broad agreement with the particular sentences arrived at by the respective courts, having regard to thespecific factual matrixin each of those cases. However, taking into account the two specific observations I have just made, attempting to utilise them in an excessively mechanistic fashion would be to miss the proverbial wood for the trees. Indeed, what is of crucial importance in so far as this court is concerned aregeneral points of principlewhich are (in turn) undergirded by logic and (above all) justice and fairness (and see, in particular, the aggravating factors set out by Rajah JA above (especially at[91])). That having been said, I am mindful of the fact that many of the prior precedents are nevertheless useful asguidance (and no more)to this court. Looked at in this light, I will proceed to consider only a couple of what appear to me to be the more salient decisions in so far as the present appeal is concerned. More generally, I also note that, in any event, Rajah JA has, in fact, dealt in some detail (and, if I may say so, insightfully) with the many other precedents in his judgment and attempting to do so would be akin to carrying the proverbial coals to Newcastle. 230    Before proceeding to do so, however, a general preliminary observation is apposite. The fact that maid abuse cases are treated more severely (as evidenced, for example, by the provision in s 73, which was referred to by both Rajah JA and Woo J above (at[59]and[175], respectively)), doesnotmean that the court should not have regard tothe precise factual matrixbefore it. As emphasised above (at[218]), the facts of each maid abuse case will, for the most part, be different. Looked at in this light, it is entirely conceivable that there will be certain fact situations which merit more severe sentences than others (see alsoperRajah JA in hisCoda(above at [166(a)]). In this regard, s 73 merely allows the court to sentence an accused person convicted of maid abuse to one and half times the amount of punishment which he or she would otherwise have been liable for. This only lays down the general structure or parameters which the court must observe. It is, in the final analysis, for the court concerned to decide what theprecisesentence must be, having regard to theprecise factual matrixbefore it (andbearing in mind the fact that, pursuant to s 73,thatsentence would be enhanced by one and a half times). 231    Turning, then, to the more significant precedents in the context of the present appeal and (in particular) to the two cases on which both Rajah JA and Woo J differed in respect of their respective application to the facts of the present appeal. The first is the Singapore High Court decision ofFarida Begam([23]supra). In particular, Woo J was of the view that in that particular case, the relevant aggravating factors were more severe. With respect, I would beg to differ. The accused inFarida Begamused both the pole of a brush as well as a slipper to hit the victim, whilst in the present case, ADF hit the victim with his fist. Although there is a literal difference in the modes of assault in the respective cases, I note that the accused in the present case is a male whose fist was as lethal a weapon as the pole and slipper utilised by the (female) accused inFarida Begam(see alsoperRajah JA in hisCoda(above at [166(d)]). Certainly, the pictures of the injuries sustained by the victim in the present case will bear testimony to this fact. There was, in my view, very little difference, insubstance, between the two cases, particularly when one has regard to the precise context in which the respective assaults took place. Of equal (if not more) importance, in my view, is the fact that, although there wereallegationsof several other instances of abuse inFarida Begam(supraat [3]), these were not considered by the court concerned, which was therefore only concerned with one (albeit serious) instance of abuse. This is to be contrasted with thesystematic pattern of abusein the present case. Looked at in this light, the circumstances in the present case are, in fact,more seriousthan those which existed inFarida Begam. 232    The second decision is that of the Singapore District Court decision ofTong Chew Wei([84]supra). Woo J was of the view that the facts of that case were more serious than that in the present appeal. Again, with respect, I would beg to differ, except in one respect (in relation to the fact that the victim inTong Chew Weiwas also scalded, twice, at the back of her knees with hot water). It is, however, of the first importance to emphasise, once again, that each case must be decided in accordance with the precise factual matrix concerned. In this regard, in the present case, I have already noted the fact that ADF had abused his position as a police officer and that the victim had been subject to systematic physical as well as mental abuse. In any event, the fact that the situation inTong Chew Weimight possibly have been more serious does not detract from the seriousness of the situation in the present case. Finally, I note that Woo J appeared to accept that it was appropriate for the court inTong Chew Weito have ordered that three (out of the seven) sentences should run consecutively as “[p]resumably the reason for three sentences to run consecutively was the many other instances of abuse over and above those contained in the seven charges as well as the fact of the seven charges” (see above at[211]). In other words, there had beensystematicabuse of the victim inTong Chew Wei(see also the judgment in that case itself at [81]), which wasprecisely the same situationwhich obtained in the present case (and for which, justifiably in my view, there ought also to be three consecutive sentences ordered (see also above at[225]))."
    }
}