{
    "case_title": "ZF\n      v\n      Comptroller of Income Tax",
    "ncitation": "[2010] SGCA 48",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This is an appeal against the decision of the\n                    judge (“the Judge”) inZF v Comptroller of\n                        Income Tax[2010] 2 SLR 350 (“ZF\n                        (HC)”) holding that certain prefabricated dormitories\n                    (“the dormitories”), which were both portable and demountable and\n                    intended to be used as temporary accommodation, were not “plant”\n                    within the meaning of ss 19 and 19A of the Income Tax Act (Cap 134,\n                    2008 Rev Ed) (“the ITA”). Although the ITA is one of the most\n                    detailed pieces of legislation in the Singapore statute book, the central\n                    concept in the present appeal, the concept of “plant”, is\n                    surprisingly not defined in the ITA. Instead, that definition has been\n                    elaborated upon in case law. The flexibility that such an approach affords is\n                    laudable in light of the myriad forms that “plant” might take.\n                    However, the flexibility afforded by such an approach does not come without its\n                    difficulties, the chief of which being that the development of case law has, in\n                    certain respects, led to the need for a little trimming and pruning as there has\n                    been a little bit of overgrowth that has generated, for a time at least, some\n                    ambiguity. 2       It is worth highlighting that it has often been\n                    said, and not without justification, that income tax law is intensely factual in\n                    its application. This stems from the very nature of this particular sphere of\n                    the law itself. The present appeal is no exception. With that in mind, let us\n                    now turn first to a brief description of the factual background of this\n                    case.",
        "The factual background": "3       The Appellant and taxpayer in this appeal is\n                    [ZF] (“the Appellant”). It was awarded a contract to build and\n                    operate workers’ dormitories on a site at [XXX] Road (“the\n                    Site”), an area located within an industrial estate. The Site was leased\n                    from the Building and Construction Authority (“BCA”) by a company\n                    called [C] Pte Ltd. [C] Pte Ltd had awarded a contract to design, build and\n                    operate the workers’ dormitories to a company named [Z] Pte Ltd in June\n                    2001. [Z] Pte Ltd did not build the dormitories itself as it wanted to put in\n                    place a professionally competent team to operate and manage the dormitories. To\n                    this end, the Appellant was incorporated as a joint venture between [Z] Pte Ltd\n                    and another company, [F] Pte Ltd. [Z] Pte Ltd then awarded the Appellant the\n                    contract to build and operate the dormitories. 4       The tenancy agreement between BCA and [C] Pte\n                    Ltd stipulated that the lease for the Site was for a term of three years\n                    beginning 1 December 2001 and that BCA could, at its absolute discretion,\n                    grant a fresh tenancy for a another three years, plus a further term of three\n                    years subject to certain terms and conditions. Crucially, the tenancy agreement\n                    also provided that BCA could require the Site to be vacated within 90 days\n                    of any notice given by it in the event that the Site was requisitioned for\n                    industrial or other use. 5       Because of the relatively short term of the\n                    lease and the 90 days’ notice period to vacate the site, the\n                    Appellant found it necessary to construct dormitories that were not permanent\n                    structures and which could be dismantled at short notice and minimum cost. Thus,\n                    the dormitories were constructed from pre-fabricated structures which were\n                    portable and demountable. These portable structures were modular in nature and\n                    could be rearranged to fit different configurations and sizes depending on\n                    requirements. This also meant that the structures could be dismantled, stored\n                    away and re-used on another site. 6       The dormitories comprised six blocks of\n                    three-storey workers’ quarters and a two-storey administration block. Each\n                    block was mounted on a concrete foundation and reinforced by steel columns. The\n                    “skeleton” of each dormitory was made of steel members assembled\n                    together with bolts and nuts, after which panels were inserted between the steel\n                    members to form walls. The floor was made of timber and a metal roof was bolted\n                    onto each dormitory. 7       The total cost of installing the dormitories was\n                    $3,755,455. From this amount, the Appellant deducted the sum of $1,100,669 as\n                    non-qualifying expenditure. Counsel for the Appellant, Mr Leung Yew Kwong\n                    (“Mr Leung”), explained at the hearing before the Income Tax\n                    Board of Review (“the Board”) that this sum of $1,100,669 related\n                    to expenditure on permanent structures which the Appellant accepted did not\n                    qualify for capital allowances. He cited examples such as the foundational works\n                    for the dormitories as well as a brick building which had been used as a canteen\n                    for the workers. A further $37,198 was also deducted by the Appellant as revenue\n                    expenditure. This left a balance of $2,617,588 which constituted capital\n                    expenditure incurred on the movable parts of the dormitories. The Appellant made\n                    a claim for capital allowances for the Year of Assessment 2004 in respect of\n                    this sum on the basis that the dormitories constituted “plant”\n                    within the meaning of ss 19 and 19A of the ITA. The claim was disallowed by\n                    the Comptroller of Income Tax (“the Respondent”) and the Appellant\n                    appealed to the Board.",
        "The Board’s decision": "8       The Board dismissed the Appellant’s\n                    appeal. In its grounds of decision (seeZF v Comptroller of\n                        Income Tax[2008] SGITBR 2 (“ZF\n                        (ITBR)”)), the Board reviewed the authorities and held (at\n                    [32]) that a building or structure may constitute “plant” where it\n                    was more appropriate to describe it as an apparatus for carrying on the\n                    business, rather than the place in which the business was conducted. Applying\n                    the law to the facts, the Board found that the Appellant’s business was\n                    the provision of accommodation to workers. The fact that the dormitories\n                    happened to be portable or demountable was of no consequence because the\n                    Appellant was not required, for the purposes of its trade, to use portable or\n                    demountable structures to construct the dormitories. Accordingly, the Board\n                    concluded (at [47]) that the dormitories were not “plant” because\n                    they remained as the buildings or premises used for the conduct of the\n                    Appellant’s trade or business.",
        "The Judge’s decision": "9       The Appellant’s appeal from the Board to\n                    the High Court was similarly dismissed. In his Judgment, the Judge held (seeZF (HC)at [11]) that for a particular asset\n                    to constitute “plant”, it had to pass two tests: (1) the\n                    “functional” or “business use” test; and\n                    (2) the “premises” test. The “functional” test\n                    entailed looking at the function of the particular asset in the context of the\n                    taxpayer’s business (seeZF (HC)at [13]).\n                    Under the “premises” test, an asset would not qualify as\n                    “plant” if it functioned as premises (seeZF\n                        (HC)at [31]). On the facts, the Judge concluded that the\n                    dormitories passed the “functional” test but failed the\n                    “premises” test because their only function was to provide\n                    accommodation, this being the typical function of premises (seeZF (HC)at [35]–[37]). 10     The Appellant had argued below that its\n                    business was not just the mere provision of accommodation but, viewed in the\n                    entire context of its business cycle, involved the dismantling and relocation of\n                    the dormitories to other sites. As such, it was argued that the portability and\n                    demountability of the dormitories was an additional function, and that,\n                    accordingly, the dormitories were not just used to provide accommodation. This\n                    argument was rejected by the Judge. Although he accepted that it was\n                    commercially necessary for the Appellant to construct portable and demountable\n                    dormitories given the nature of the lease over the Site, he held (at [37]) that\n                    the portability and demountability of the dormitories were theirpropertiesand not additionalfunctionsas such.",
        "The appeal": "",
        "The Appellant’s case": "11     The Appellant’s arguments on appeal are\n                    essentially the same as those canvassed in the High Court. Mr Leung\n                    submitted that the Judge had erred in taking a snap-shot view of the\n                    Appellant’s overall business, which was not just the provision of\n                    dormitories for the accommodation of workers, but also involved their\n                    dismantling and re-installation at future sites. Viewed in this context,\n                    Mr Leung argued that the dormitories were, in principle, no different from\n                    the scaffolding, portable toilets or pre-fabricated site offices used by a\n                    contractor at construction sites, or tents put up by a circus operator. At the\n                    end of their use, these items were dismantled to be re-used elsewhere and were\n                    very much the tools of the taxpayer’s trade. Similarly, the dormitories in\n                    the present case did not function solely as premises since their portability and\n                    demountability were additional functions crucial to the nomadic nature of the\n                    Appellant’s business.",
        "The Respondent’s case": "12     Counsel for the Respondent, Mr Irving Aw\n                    (“Mr Aw”), submitted, on the other hand, that the portable\n                    dormitories were clearly being used as premises, regardless of where they might\n                    be sited. Mr Aw pointed out that the cases in which buildings or structures\n                    were held to be “plant” were rare and that the buildings or\n                    structures in such cases functioned mainly as apparatus or equipment instead of\n                    as premises. In the present case, Mr Aw argued that the portability and\n                    demountability of the dormitories made them purpose-built buildings instead of\n                    “plant”. Insofar as the analogies drawn by Mr Leung were\n                    concerned, Mr Aw submitted that scaffoldings and portable toilets were not\n                    buildings and would not be considered premises, whereas site offices and circus\n                    tents also functioned as premises and would not qualify as\n                    “plant”. 13     Mr Aw also submitted, in the alternative,\n                    that even if this court was not minded to agree with the Board and the Judge,\n                    the question of whether the dormitories constituted “plant” was\n                    one of fact and degree. As the Board and the Judge had neither misapplied the\n                    law nor arrived at a conclusion which was clearly unreasonable, there was no\n                    basis for an appellate court to interfere with the decisions arrived at\n                    below.",
        "The applicable legal principles": "",
        "Policy background and the legislative distinction between\n                “plant” and “buildings” or\n                “structures”": "14     The relevant statutory provisions in this\n                    appeal are ss 19 and 19A of the ITA, which provide for initial and annual\n                    allowances (s 19) or accelerated allowances (s 19A) in respect of\n                    capital expenditure incurred by a person carrying on a trade, profession or\n                    business “on the provision of machinery or plant for the purposes of that\n                    trade, profession or business”. 15     Before we address these provisions in detail,\n                    it would be useful to first briefly examine thepolicygoverning this area of tax law. 16     With regard to income tax generally,\n                    Sir Wilfred Greene MR observed, in the English Court of Appeal\n                    decision ofCommissioners of Inland Revenue v British Salmson\n                        Aero Engines, Limited[1938] 2 KB 482, as follows (at\n                    498): Income tax, as has been said over and over again, is a tax on income. It\n                        does not tax capital. As the corollary to that, in ascertaining profits,\n                        payments of a capital nature may not be deducted. It is income all the time\n                        which has to be considered under the Income Tax Acts ... The above passage was also referred to in the Singapore High Court\n                    decision ofABD Pte Ltd v Comptroller of Income\n                        Tax[2010] 3 SLR 609 (“ABD Pte\n                        Ltd”), where it was clearly stated (at [40]) that any\n                    expenditure of a capital nature may not be deducted from a taxpayer’s\n                    income unless such deduction is expressly provided for in the ITA. 17     Although capital expenditure is generally not\n                    deductible for the purposes of income tax, Parliament has acknowledged that the\n                    depreciation of capital assets used in a trade, profession or business\n                    represents a real business cost to taxpayers. Hence,in\n                        addition toallowable deductions, Part VI of the ITA also\n                    grants allowances for certain types of capital expenditures made for the\n                    purposes of a taxpayer’s business. The rationale behind this scheme of\n                    capital allowances was elaborated upon by Yong Pung How CJ, in the decision\n                    of this court inComptroller of Income Tax v GE Pacific Pte\n                        Ltd[1994] 2 SLR(R) 948, as follows (at [27]): ... the cost of fixed assets like plant and machinery cannot be considered\n                        expenditure and so deducted from taxable income. However, since such assets\n                        depreciate,the Act recognises this inherent and periodic\n                            “loss” suffered by those who use machinery or plant in the\n                            course of their business and grants allowances to reflect this\n                            additional cost of producing the income. The rationale for\n                        capital allowances is the depreciation of fixed assets. Obviously, it is the\n                        taxpayer who owns and uses the plant or machinery that suffers this\n                        “loss” of depreciation and it is to him that the Act grants\n                        the allowance. [emphasis added] 18     Currently, Part VI of the ITA provides\n                    for capital allowances in respect of three broad categories of capital assets,\n                    as follows: (a)     Industrial buildings and structures\n                        (ss 16–18 ITA); (b)     Plant and machinery (ss 19, 19A, and 20–22\n                        ITA); and (c)     Certain intangible assets (ss 19B, 19C and 19D\n                    ITA). Of particular relevance to the present appeal is the\n                    fact that the ITA draws a distinction between plant and machinery, on the one\n                    hand, and buildings and structures, on the other. This distinction can be traced\n                    back to the time when capital allowances first originated in 1878. At that\n                    particular point in time, s 12 of the UK Customs and Inland Revenue Act\n                    1878 (c 15) provided for deductions from chargeable income in respect of\n                    “wear and tear ... of any machinery or plant used for the purposes of the\n                    concern”. No allowances for buildings or structures were given then and,\n                    even for plant and machinery, deductions could only be claimed in respect of\n                    physical deterioration and not depreciation in valueper\n                        se. 19     This scheme of wear and tear allowances was\n                    subsequently extended to mills, factories and similar premises by the UK Income\n                    Tax Act 1918 (c 40), under which a taxpayer was able to deduct a proportion\n                    of the annual value of the mill, factory or other premise in computing his\n                    taxable income, on the basis that the vibrations of the machinery housed therein\n                    caused wear and tear to the building. The scheme was substantially revamped by\n                    the UK Income Tax Act 1945 (c 32) (“the 1945 UK Act”) which\n                    replaced the previous system of wear and tear allowances with a new system of\n                    initial and writing-down allowances coupled with balancing allowances and\n                    charges. Under the new system, capital allowances were granted in respect of the\n                    actual decrease in an asset’s value which might not necessarily be due to\n                    physical deterioration. Capital allowances for mills and factories were also\n                    extended to encompass industrial buildings in general. 20     The new system of capital allowances found in\n                    the 1945 UK Act was eventually incorporated into Singapore’s tax\n                    legislation as ss 16–22 of the Income Tax Ordinance (No 39 of\n                    1947) (“the 1947 Ordinance”). The draftsman of these provisions,\n                    Mr R B Heasman, explained in his report (seeIncome Tax: A Report to Their Excellencies the Governors of the Malayan\n                        Union and Singapore, with Recommendations, including a Draft Bill and\n                        Proposals for Administration and Staffing(Kuala Lumpur, Malayan\n                    Union Government Press, 1947)) (“the Heasman Report”), as follows\n                    (at p 18): The purpose of the United Kingdom legislation [i.e. the 1945 UK Act] was to provide for the allowance,\n                        over a period of years, of capital expended on buildings, plant and\n                        machinery, and certain other types of asset, in the process of modernisation\n                        and re-equipment during the post-war period. I anticipate that the\n                        deductions authorised by Clauses 13 to 19 inclusive of the draft Bill\n                            [ie, ss 16–22 of the 1947\n                        Ordinance] will be found to be of considerable assistance in the\n                        regeneration and development of Malayan trade and industry. 21     It is thus clear that the term\n                    “plant” doesnotencompassbuildings or structures. Allowances for plant and\n                    machinery were initially introduced to recognise their physical deterioration as\n                    a cost of producing income. It was only after World War II, when a general\n                    scheme of capital allowances was introduced to encourage industrialisation, that\n                    buildings and structures were included as aseparatecategory. Even then, it was only industrial buildings\n                    and structures which qualified for capital allowances. This is why, even today,\n                    building allowances are not given for dwelling-houses, shops and offices (see\n                    s 18(6) ITA) even though such buildings are subject to depreciation like\n                    any other asset.Further, the allowances accorded\n                    by the ITA toplant and machineryaremuch more generouscompared to the allowances given to\n                    industrial buildings and structures, since assets belonging to thelattercategorynaturally depreciate\n                        at a much slower rate.These are points of the\n                        first importance because this basic distinction between plant on the one\n                        hand and buildings or structures on the other also constitutes, in point of\n                        fact, the crucial distinction drawn in the case law itself as the courts\n                        sought to define what constitutes “plant”. Indeed,\n                    this would be an appropriate point at which to turn to the definition of\n                    “plant” itself.",
        "The definition of “plant”": "Introduction 22     What, then, constitutes “plant”?\n                    Although the ITA does not define the term, the traditional starting-point is the\n                    following statement of principle by Lindley LJ in the English Court of\n                    Appeal decision ofYarmouth v France(1887)\n                    19 QBD 647 (“Yarmouth”) (at\n                    658): There is no definition of plant in the Act: but, in its ordinary sense, it\n                        includes whateverapparatusisusedby a business manfor\n                            carrying on his business, not his stock-in-trade which he\n                        buys or makes for sale; but all the goods and chattels, fixed or moveable,\n                        live or dead, which he keepsfor permanent employment\n                            inhis business. [emphasis added] AlthoughYarmouthconcerned the\n                    definition of “plant” under the UK Employers’ Liability Act\n                    1880 (c 42), Lindley LJ’s definition has consistently been\n                    adopted in subsequent income tax cases. Indeed, in the English Court of Appeal\n                    decision ofCole Bros Ltd v Phillips (H M Inspector of\n                        Taxes)(1981) 55 TC 188 (“Cole\n                        Bros”), Oliver LJ observed (at 210) that the passage\n                    just quoted “is the bedrock, and all subsequent cases may be regarded as\n                    glosses imposed on Lindley L.J.’s central\n                proposition”. 23     Lindley LJ’s definition of\n                    “plant” inYarmouthis admittedly a\n                    wide one, and case law has demonstrated that the term is capable of encompassing\n                    a wide variety of assets such as railway locomotives and carriages (Caledonian Railway Co v Banks(1880) 1 TC 487),\n                    knives and lasts used in the manufacture of shoes (Hinton\n                        (Inspector of Taxes) v Maden and Ireland Ltd[1959] 1 WLR\n                    875), a barrister’s law books (Munby v Furlong\n                        (Inspector of Taxes)[1977] 1 Ch 359), and decorative\n                    screens (Leeds Permanent Building Society v Procter (H M\n                        Inspector of Taxes)[1982] 3 All ER 925). Bearing in mind\n                    the general policy behind capital allowances for “plant” and\n                    machinery, as well as the distinctions the ITA draws with respect to buildings,\n                    structures and intangible assets (as set out above at[18]–[21]), we are of\n                    the view that any tangible asset (other than a building or structure, or an\n                    asset forming part of a building or structure) used permanently for the purposes\n                    of a taxpayer’s trade, profession or business can be considered\n                    “apparatus” and would thus qualify as\n                    “plant”. 24     It comes as no surprise then that the issue\n                    most often litigated upon in this branch of the law is whether a particular\n                    asset falls on the “plant” or “buildings” side of\n                    the boundary. The present appeal is no exception. As is customary with income\n                    tax law generally, whilst the legal principles are relatively easy to state, the\n                    real difficulty lies in their application. Looked at in this light, the\n                    following observation by Megarry J in the English High Court decision ofCooke (Inspector of Taxes) v Beach Station Caravans\n                        Ltd[1974] 1 WLR 1398 (“Cooke”) (at 1402) is apposite: To some extent the matter must be one of impression, though it is\n                        important that the impression should not be untutored. So, also, is the learned judge’s further (and astute)\n                    observation in the context of that case but which, in our view, would be of\n                    general application to both this as well as other cases, as follows (seeibid): Many interesting difficulties emerged during the argument which I forbear\n                        to pursue: for my duty is merely to decide this case, and not to attempt to\n                        define and rationalise the whole of this difficult branch of the law. Doing\n                        the best I can, with the aid of the authorities that I have mentioned and\n                        the other authorities that have been put before me, my conclusions are as\n                        follows. 25     This court would also do well to heed the\n                    following observations by Oliver LJ inCole\n                        Broswhere the learned judge stated thus (at 209): Whatever one might think about the ordinary meaning of the word\n                        “plant” in the English language, it is now beyond doubt that\n                        it is used in the relevant section in an artificial and largely judge-made\n                        sense. The difficulty lies in discerning what is the principle which\n                        distinguishes one item of equipment from another – a task which almost\n                        of necessity involves reviewing yet again an extensive line of authorities\n                        which have already been reviewed in previous cases but without, so far as I\n                        at any rate can see, any very clear distillation of principle. And as Oliver LJ later observed (at 211): It cannot, however, be pretended that all the authorities are all easy to\n                        reconcile. 26     In a similar vein, Stephenson LJ also\n                    observed (at 220) as follows (although, as we noted at [18]–[21], the\n                    distinction drawn between “plant” and buildings is still very much\n                    a part of the landscape of tax law): The philosopher-statesman, Balfour, is reported to have said it was\n                        unnecessary to define a great power because, like an elephant, you\n                        recognised it when you met it. Unhappily plant in taxing and other statutes\n                        is no elephant (though I suppose an elephant might be plant). It has lost\n                        what resemblance to machinery it may once have had and any contrast with\n                        buildings or structures is now misleading, however strong the temptation to\n                        go back to those simple similarities and differences which the word might\n                        have suggested before repeated difficulties of application drove judges to\n                        gloss over them. With these observations in mind, we now turn to the authorities to see\n                    how various courts have attempted to determine whether a particular asset falls\n                    to be classified as a “plant” or as a building. Preliminary observations on terminology 27     A few preliminary observations on the use ofterminologymay be apposite. Although the\n                    substantive distinction is (as we have seen) between “plant” on\n                    the one hand and buildings on the other, the case law has tended to utilise the\n                    terms “setting” and “premises” when referring to\n                    buildings. This difference in terminology is very important to note because the\n                    terms “setting” and “premises” have been used by\n                    various courts intwo different\n                senses. 28     In thefirstsense, the court, in referring to these terms, hadactually\n                        intendedto refer to a building and in this sense, the basic\n                    distinction between “plant” and buildings (as referred to above)\n                    remains unchanged. 29     Thesecondsense\n                    in which the terms “setting” and “premises” have\n                    been used centres on their ordinary (andbroader as well as\n                        more general) meaning in the English language and, in this\n                    particular regard, one must be wary of using these terms interchangeably with\n                    the term “buildings”. This is because, while the terms\n                    “setting” and “premises” are useful in describing\n                    what the typical characteristics of a building are, itdoes\n                        not followthat assets which provide the setting or premises of a\n                    business arenecessarilybuildings. It must be\n                    remembered that, under the scheme of the ITA, the only distinction is between\n                    “plant” and buildings and all other terms are merely descriptions\n                    to guide the court in its inquiry. Unfortunately, the various cases dealing with\n                    this particular issue have not been precise in the use of terminology and this\n                    has, as we will demonstrate below, resulted in not inconsiderable ambiguity. In\n                    order to avoid any further confusion, we will (for the present) refer to\n                    buildings solely as buildings, whereas the terms “setting” and\n                    “premises” will be used in their more general, ordinary English\n                    sense (ie, they mightor might\n                        notrefer to buildings as such). 30     We also note that the Judge referred to\n                    various tests, namely, the “business use” and\n                    “functional” tests (which he equated as being one and the same) as\n                    well as the “premises” test. With respect, there is, in our view,\n                    just one basic and overarching test – whether the item concerned is\n                    utilised for the purposes of the trade or business as “plant” or\n                    as a building. To the extent that the item willalwaysneed to satisfy thethreshold\n                        requirementthat it be used for the purposes of the trade or\n                    business, the term “business use” is, in our view,too broad. Indeed, this term wouldalsocover the situation where the item concerned,although a building, could also satisfy this particular\n                    criterion, simply because that building would house the trade or business of the\n                    taxpayer (and, in that sense, is used for the purposes of the trade or\n                    business).However, it wouldnotfollow that that building thereby constitutes\n                    “plant”. On thecontrary, it would\n                    be theoppositeof “plant” since it\n                    is,ex hypothesi,a\n                        building. 31     We are also of the view that the term\n                    “functional” is similarly unhelpful because whether or not a\n                    particular item “functions” as “plant” or as a\n                    building isprecisely the question that needs to be\n                        answered. Put simply the term “functional” is, at\n                    best, neutral and, at worst, circular in nature. Similarly, as we have pointed\n                    out above, the term “premises” is not interchangeable with\n                    “buildings” and, insofar as the nomenclature suggests otherwise,\n                    it is misconceived. In the circumstances, we are of the view that the various\n                    terminology utilised in the court below is, with the greatest of respect,\n                    unhelpful. Ambiguity introduced 32     A classic illustration of the ambiguity\n                    referred to earlier may be found in the decision ofCommissioner of Inland Revenue v Barclay, Curle & Co\n                        Ltd[1969] 1 WLR 675 (“Barclay\n                        Curle”) where the House of Lords held thata dry dock simultaneouslyconstituted a building or\n                    structure (in which the taxpayer’s business of inspection and ship repair,\n                    of the bottoms and sides of ships, was conducted)as well\n                        as“plant” (insofar as italsoperformed the function of a hydraulic lift for raising the\n                    ships and holding them in position). The items at issue in that case comprised\n                    the cost of the work of excavation of earth and rock to forma rectangular basinfor the dry dock as well as the cost of\n                    concrete which was used to line that basin. At first blush, it would appear that\n                    these items should have constitutedat least part\n                        ofabuilding or structureand,\n                    hence, shouldnothave constituted“plant”. Indeed, it is significant, in\n                    this regard, to note that the House held in favour of the taxpayer by abare majority of 3 to 2. 33     The majority was of the view that these items\n                    had to be viewed in aholisticmanner –\n                    together with theotherparts of the dock which\n                    constituted “plant”. In particular, Lord Reid observed, as\n                    follows (at 679): As the commissioners observed, buildings or structure and machinery and\n                        plant are not mutually exclusive... Undoubtedly this concrete dry dock is a\n                        structure but is it also plant? The only reason why a structure should also\n                        be plant which has been suggested or which has occurred to me is that it\n                        fulfils the function of plant in the trader’s operations. And, if that\n                        is so, no test has been suggested to distinguish one structure which fulfils\n                        such a function from another. I do not say that every structure which\n                        fulfils the function of plant must be regarded as plant, but I think that\n                        one would have to find some good reason for excluding such a structure. And\n                        I do not think that mere size is sufficient. Here it is apparent that there are two stages in the respondents’\n                        operations. First the ship must be isolated from the water and then the\n                        inspection and necessary repairs must be carried out. If one looks only at\n                        the second stage it would not be difficult to say that the dry dock is\n                        merely the setting in which it takes place. But I think that the first stage\n                        is equally important, and it is obvious that it requires massive and\n                        complicated equipment. ... It seems to me that every part of this dry dock\n                        plays an essential part in getting large vessels into a position where work\n                        on the outside of the hull can begin, and that it is wrong to regard either\n                        the concrete or any other part of the dock as a mere setting or part of the\n                        premises in which this operation takes place. The whole dock is, I think,\n                        the means by which, or plant with which, the operation is performed. 34     Lord Guest, who concurred with the\n                    majority, added (at 685–686): In order to decide whether a particular subject is an \"apparatus\" it seems\n                        obvious that an inquiry has to be made as to what operation it performs. The\n                        functional test is, therefore, essential at any rate as a preliminary. The\n                        function which the dry dock performs is that of a hydraulic lift taking\n                        ships from the water onto dry land, raising them and holding them in such a\n                        position that inspection and repairs can conveniently be effected to their\n                        bottoms and sides. It is unrealistic, in my view, to consider the concrete\n                        work in isolation from the rest of the dry dock. It is the level of the\n                        bottom of the basin in conjunction with the river level which enables the\n                        function of dry docking to be performed by the use of dock gates, valves and\n                        pumps. To effect this purpose excavation and concrete work were\n                        necessary. It is said that the dry dock is similar to premises like a factory\n                        building in which the trade is carried on. But this comparison is not, in my\n                        view, accurate. The factory is by itself a building or structure in which\n                        trade can be carried on. But the excavation and concrete work is useless for\n                        any trade purpose unless used in conjunction with the rest of the equipment.\n                        As Pearson LJ (as he then was) said, the subject is part of the plant\n                        with which the business is carried on as distinct from the premises in which\n                        the business is carried on. 35     Under the majority’s approach, an asset\n                    which would normally be regarded as a building or structure could also be\n                    classified as “plant” if it performed some independent operation\n                    in the taxpayer’s business beyond providing the setting or premises in\n                    which the business was carried out. On the facts ofBarclay\n                        Curle, the rectangular basin played a (albeit indirect) role in\n                    the process of raising and lowering ships alongside the rest of the dry dock and\n                    was thus more than simply the setting or premises in which the taxpayer’s\n                    business was conducted. Looked at in this light, thecharacterisationadopted by the majority resulted in the entire\n                    dry dock in this case being construed assimply a large piece\n                        of apparatus or equipment or machinery(only\n                        partof which happened to overlap with what would otherwise have\n                    been at least part of a conventional building or structure, which wouldnotconstitute\n                “plant”). 36     The decision inBarclay\n                        Curlemay be usefully contrasted with the High Court of\n                    Australia’s decision inWangaratta Woollen Mills\n                        Limited v The Commissioner of Taxation of the Commonwealth of\n                        Australia(1969) 119 CLR 1, where, although a dyehouse was\n                    held to be “plant”, itsexternal walls as well\n                        as roofwerenot. 37     On the other hand, inJarrold (Inspector of Taxes) v John Good & Sons Ltd[1963]\n                    1 WLR 214 (“John Good”), the\n                    English Court of Appeal held that movable internal partitions used by the\n                    taxpayer company to adjust its office space to cope with variations in its\n                    number of staff were “plant”. In an oft-quoted passage,\n                    Pearson LJ said (at 215): There can be no doubt, therefore, as to the main principles to be applied,\n                        and the short question in this case is whether the partitioning is part of\n                        the premisesin whichthe business is carried\n                        on or part of the plantwith whichthe\n                        business is carried on. [emphasis added] 38     A case not dissimilar toBarclay Curleis the Court of Appeal of Northern Ireland\n                    decision ofSchofield (H M Inspector of Taxes) v\n                        R & H Hall Ltd(1974) 49 TC 538\n                        (“Schofield”), which in fact\n                    cited and appliedBarclay Curle. In that case, the\n                    court held thatsilos simultaneouslyconstituted a\n                    building or structure (in which the taxpayer’s business of grain importing\n                    and distribution was conducted)as well as“plant” (insofar as theyalsoperformed the function of conveniently discharging the grain contained therein\n                    to customers). Significantly, in our view, it was observed (by Jones LJ at\n                    556) that “the silos arereally collections of\n                        built-in bins rather than buildings capable of housing binswhich\n                    could be put to any other use as buildings” [emphasis added]. In other\n                    words, as was the case inBarclay Curle, the silos\n                    in this case also constitutedlarge apparatus or equipment or\n                        machinery(as opposed to buildings proper). Indeed, it is\n                    important to note that the Crown in this case had taken the view that the silos\n                    were not “plant” but wereindustrial\n                        buildingsinstead – a view that was rejected by the\n                    court. 39     Yet another decision in whichBarclay Curlewas applied isCooke. However, that case concerneda\n                        swimming pool as well as a paddling pool, constructed on a\n                    caravan site, that were held to be “plant”. It should be noted,\n                    though, that neither would be considered to be a building in the conventional\n                    sense of the word (viz, buildings proper). A\n                    contrasting case is the English High Court decision ofDixon\n                        (Inspector of Taxes) v Fitch’s Garage Ltd[1976] 1 WLR\n                    215, where a canopy erected over a self-service petrol station to provide\n                    adequate lighting and shelter was held not to be “plant”.\n                    Brightman J held that the only purpose of the canopy was to provide shelter\n                    to motorists and was not part of the means by which the taxpayer’s\n                    operation of supplying petrol was performed. 40     Similarly, inBenson\n                        (H M Inspector of Taxes) v Yard Arm Club Ltd(1979)\n                    53 TC 67, it was held thata second-hand ship which had\n                        been converted into a floating restaurant(which was, in turn,\n                    attached to a barge, both of which were moored at a permanent site on the\n                    Victoria Embankment) didnotconstitute\n                    “plant”. It is significant to note that the ship concerned merely\n                    provided thesettingin which the business of arestaurantwas being conducted. In other\n                    words, the premisesper sedidnot –apart from functioning as a setting\n                        - constitute (simultaneously) themeans (or part of the means) by whichthe business was\n                    conducted. Put simply, although the premises did aid in housing the business, it\n                    was, in essence, abuilding. Indeed,\n                    Oliver LJ perceptively observed, at the Court of Appeal stage inCole Bros(at 212), that “no doubt if the ship\n                    had been engined and used as a vehicle for gastronomic cruises on the river, it\n                    would have qualified as plant because it would have served an additional\n                    function in a composite business of restaurateurs and carriers”. The\n                    following observations by Lord Lowry in the House of Lords decision ofInland Revenue Commissioners v Scottish & Newcastle\n                        Breweries[1982] 1 WLR 322 (“Scottish & Newcastle Breweries”) (at 333–334)\n                    with regard to the fact situation inBensonmay\n                    also be usefully noted: But the distinction is that the ship, although a chattel, was theplace in whichthe trade was carried on\n                        and was therefore the equivalent of the various premises in which the\n                        present taxpayers company carry on their trade and not of the apparatus used\n                        as an adjunct of the trade carried on in those premises. Thus the ship, with\n                        all its novelty and atmosphere, could no more be called plant than a\n                        restaurant consisting of an Elizabethan manor house, a thatched cottage, a\n                        barn or a converted windmill, although like all those buildings, it could be\n                        embellished and adorned with ‘plant’ suitable to the\n                        surroundings and to the purposes of the trade. [emphasis in original] 41     In the English High Court decision ofSt John’s School v Ward (H M Inspector of\n                        Taxes)(1974) 49 TC 524 (“St\n                        John’s School”), which was affirmed on appeal to the\n                    Court of Appeal, it was held that gymnasiums and chemical laboratories\n                    (constructed from prefabricated panels which were not fixed to the ground or a\n                    concrete base and whose layout could be rearranged) didnotconstitute “plant”. It is significant to note,\n                    however, that the business concerned related toa school and\n                        the concomitant provision of education. In the circumstances,\n                    therefore, the premises concerned merely provided thesettingin which such business was conducted and (more\n                    importantly) didnot –apart from\n                    functioning as a setting - constitute (simultaneously) themeans (or part of the means) by whichthe\n                    business was conducted. 42     Finally, inCole\n                        Bros, Oliver LJ attempted to summarise the applicable\n                    principles governing the (hitherto) decided cases. The learned judge observed\n                    (at 211): That “plant” may include not only equipment fixed to and\n                        forming part of a structure built into or permanently affixed to land, but\n                        also the structure itself, appears from three cases: [Barclay Curle;Cooke; andSchofield] – which were concerned\n                        respectively with a dry-dock, a swimming-pool and paddling pools and a grain\n                        silo, and in each of which the structure itself was held to be plant. The\n                        importance of these is, first, that they emphasise that what is important is\n                        not, or not primarily, the nature of the item in question – that is to\n                        say whether it is a “chattel” or a “structure”\n                        or a “building” – but the function that it performs in\n                        the taxpayer’s business activity; and, secondly, that in [Barclay Curle] the House of Lords adopted and\n                        affirmed the distinction propounded by Pearson L.J. in [John Good]. It is, however, important to bear in\n                        mind what Pearson L.J. was referring to when he referred to “the\n                        premises in which the business is carried on”. As indicated above,\n                        the notion which, as I read his judgment, he was seeking to convey was that\n                        of the building which did no more than “house” the business. I\n                        emphasise this because it does seem to me that in some of the later cases\n                        this has become identified (as I think, erroneously) with the specific\n                        function of providing shelter from the elements, so that it is said that\n                        nothing whose sole function is shelter can be plant. 43     Oliver LJ continued (at 212): The truth is, in my judgment, that much of the apparent difficulty of\n                        deciding whether expenditure on a particular item as allowable as\n                        expenditure on “plant” arises from attempting to treat as\n                        precise criteria tests which have been propounded as alternative\n                        formulations or expositions of the short question asked by Pearson L.J.\n                        in [John Good]. Whether the test be expressed\n                        as the provision of “shelter”, as a “building”\n                        or “premises”, as “the functional test”, or, to\n                        adopt the homely vernacular suggested by Megarry J. in [Cooke], “where it’s at”, the\n                        underlying concept is, I think, the same and comes back ultimately to that\n                        short question, upon which it is difficult to improve. At risk of\n                        propounding yet a further refinement, it seems to me that the authorities,\n                        with one possible exception, demonstrate that the question (however\n                        expressed) which the Court must ask itself is whether the particular\n                        subject-matter under consideration either itself performs, or is a necessary\n                        or integral part of that which performs, simply and solely the function of\n                        “housing” the business or whether, as its sole function or as\n                        an additional function, it performs some other distinct business\n                        purpose. 44     In summary, it appears that most of the\n                    earlier cases up toCole Brosappeared to have\n                    confused the concept of a building with the idea of “setting” or\n                    “premises”, with the unfortunate effect that the term\n                    “building” appears to have been dissolved or subsumed within the\n                    latter two terms. As we have mentioned earlier, these terms arenot necessarily interchangeable. Assets like tents and\n                    makeshift shelters for road stalls can be described as the setting or premises\n                    in which a taxpayer’s trade or business is carried on, but it would be\n                    incongruous to hence conclude that they were buildings or structures, since the\n                    idea of a building carries with it a certain connotation of magnitude and\n                    permanence. Further, as we also mentioned above, the allowances granted under\n                    the ITA to “plant” and machinery are much more generous than the\n                    allowances granted to industrial buildings because of the difference in their\n                    relative rates of depreciation. This suggests that, as a matter of policy\n                    itself, the ITA envisions “plant” and machinery generally to be of\n                    a more temporary nature than buildings or structures. Assets which merely\n                    provide the setting or premises for a business may notipso\n                        factobe of such a permanent nature. 45     Another difficulty generated by some of the\n                    cases cited above (such asBarclay CurleandSchofield) is that an asset could\n                    simultaneously be classified as a “plant” and a building. The\n                    implication is that any asset which isprima faciea building or structure can be fully depreciated as “plant” if it\n                    can be shown that these assets performed some independent business purpose\n                    besides simply acting as the setting or premises of the business. We are of the\n                    view that this approach is overly broad and should not be adopted in Singapore,\n                    where the ITA draws a clear distinction between “plant” and\n                    buildings. It is noteworthy that the judgments inBarclay\n                        CurleandSchofieldexpressly\n                    referred to s 276 of the UK Income Tax Act 1952 (c 10) and s 14\n                    of the UK Capital Allowances Act 1968 (c 3), respectively, in arriving at\n                    the conclusion that an asset could be both “plant” and a building\n                    (seeBarclay Curleat 681, 685, and 691; andSchofieldat 546). Both these provisions are\n                    similar and are based on s 13 of the 1945 UK Act, which reads as\n                    follows: Exclusion of double allowances,\n                            etc. 13.—(1) No allowance shall be made\n                        under, or by virtue of, any of the provisions of this Part of this Act\n                        [which deals with industrial buildings and structures] in respect of, or of\n                        premises including, or of expenditure on, a building or structure if, for\n                        the same or any previous or subsequent year of assessment, an allowance is\n                        or can be made under any of the provisions of Part II [which deals with\n                        machinery and plant], Part III or Part IV of this Act in respect\n                        of, or of expenditure on, that building or structure. (2) Without prejudice to the provisions of the preceding subsection, any\n                        reference in this Part of this Act to the incurring of expenditure on the\n                        construction of a building or structure does not include expenditure on the\n                        provision of machinery or plant or on any asset which has been treated for\n                        any year of assessment as machinery or plant. 46     The significance of this provision is that the\n                    UK scheme of capital allowances anticipated that a particular asset could both\n                    be “plant” and an industrial building or structure and accordingly\n                    provided that there would be no double claim to capital allowances. However,\n                    s 13 of the 1945 UK Act (or any provision to like effect) cannot be found\n                    in the ITA because it was never incorporated into Singapore’s tax\n                    legislation. Instead, the ITA simply provides for capital allowances in respect\n                    of different classes of assets. We are therefore of the view that these classes\n                    of assets should remain mutually exclusive. An asset may be considered\n                    “plant” in some respects and a building in others but, ultimately,\n                    it can only be depreciated purely as “plant”orpurely as a building for the purposes of income\n                    tax. Put simply, if it is depreciated as “plant”, the taxpayer can\n                    claim capital allowances under ss 19 or 19A of the ITA. If it is\n                    depreciated as a building, capital allowances are unavailable unless the\n                    building is industrial in nature. Since the two categories are mutually\n                    exclusive, where an asset possesses the features of both, the question is\n                    whether the asset can bemore appropriatelydescribed as “plant” or as a building. In our view, to simply ask\n                    whether the asset does anything more than to provide the setting or premises for\n                    the business does nothing to further this inquiry. 47     Fortunately, the ambiguity generated by the\n                    case law was soon clarified by a return by the courts in more recent decisions\n                    to the basic distinction between “plant” on the one hand and\n                    building on the other. It is to these more significant decisions that our\n                    attention now turns. A return to the basic distinction between “plant” and\n                buildings 48     The following observations by Hoffmann J\n                    in the English High Court decision ofWimpy International Ltd\n                        v Warland (Inspector of Taxes)[1988] STC 149 (“Wimpy”) (which was affirmed on appeal by the\n                    English Court of Appeal inWimpy International Ltd v Warland\n                        (Inspector of Taxes)[1989] STC 273 (“Wimpy (CA)”)) may be usefully noted (at\n                    170–172): The celebrated pioneer cartographer was Lindley LJ, who\n                        gave the following description of the territory inYarmouth v France(1887)\n                        19 QBD 647 at 658: ‘... in its ordinary sense, it includes whatever apparatus is\n                            used by a business man for carrying on his business,-not his\n                            stock-in-trade which he buys or makes for sale; but all goods and\n                            chattels, fixed or moveable, live or dead, which he keeps for permanent\n                            employment in his business.’ It is important to notice the various discriminations which are stated or\n                        implied in this description.First, it\n                        excludes [from the definition of plant]\n                        anything which is not used for carrying on the business.Secondly, it excludes stock-in-trade both expressly and\n                        because, although used for the purposes of the business, its use lacks\n                        permanence.Thirdly, itexcludesthings which are not ‘apparatus ... goods and\n                        chattels, fixed or moveable, live or dead’or notemployedinthe business.This\n                            excludes the premises or place in or upon which the business is\n                            conducted. Before going any further I must say something aboutthe\n                            third distinctionand the way in whichthe\n                            courts in subsequent caseshaverefined\n                            the boundarybetween plant and premises... It will be seen, therefore, that although thethree\n                            distinctionsinYarmouth v France(1887) 19 QBD 647 each\n                        involves a test which can be called functional,they are\n                            subtly different from each other. If the item is neither\n                        stock-in-trade nor the premises upon which the business is conducted, the\n                        only question is whether it is used for carrying on the business. I shall\n                        call thisthe ‘business use’\n                        test. However, under theseconddistinction, an article which passes the ‘business use’ test is\n                        excluded if such use is as stock-in-trade. And under thethirddistinction,an item used in\n                            carrying on the business is excluded if such use is as the premises or\n                            place upon which the business is conducted. The fact that an item may\n                            pass the ‘business use’ test but fail what I may call the\n                            ‘premises’ test is central to this case. ... The seeds of confusion were sown in the judgment of Uthwatt J inJ Lyons & Co v A-G[1944] Ch\n                        281. ... The contrast between ‘plant’ and ‘setting’, while\n                        perfectly intelligible in the context of that case, was not, as things have\n                        turned out, the happiest choice of words. Uthwatt J was using\n                        ‘setting’ to refer to things which were upon the premises but\n                        were neither a part of the premises nor used in carrying on the business.\n                        However, as Pennycuick J later pointed out inJarrold (Inspector of Taxes) v John Good & Sons Ltd[1962] 1 WLR 1101 at 1108 ..., the ‘setting’ in which a\n                        business is conducted can as a matter ordinary language include the plant\n                        used to carry it on. Secondly, a contrast between ‘plant’ and\n                        ‘setting’ is not the most precise tool for applying the\n                        ‘business use’ testwhen the provision of\n                            what most people would call a ‘setting’ is,as in restaurants and hotels, an important part of the way in which the business is\n                            conducted ...Thirdly, and for present\n                            purposes most significantly, the ‘setting’ would normally\n                            include the premises themselves. These are also excluded from the\n                            concept of plant, but not for the same reason as the lamps inJ Lyons & Co Ltd v A-G ... It is not because\n                            the premises are not sufficiently specific to the\n                            businessbut simply because they are\n                            premises. No matter how ‘purpose-built’ the premises may be,\n                            they are not plant if they constitute the premises or place upon which\n                            the business is conducted... The plant/setting dichotomy therefore\n                            concealsan ambiguity. Describing\n                            an item as ‘setting’ rather than ‘plant’ may\n                            mean that,however specifically adapted\n                            for the purposes of the trade, it is nevertheless part of the premises\n                            upon which the business is conducted. Orit may mean, as Uthwatt J meant,that the item is neither part of the premises nor used in\n                            carrying on the business. [emphasis added in italics and bold italics] 49     It appears from the above observations that\n                    the learned judge was referring to “premises” in the sense of\n                    “buildings” and, more importantly, that he didnotconsiderbuildings properto\n                    constitute “plant”. 50     Reference may also be made, in this regard, to\n                    the English Court of Appeal decision ofCarr (H M\n                        Inspector of Taxes) v Sayer(1992) 65 TC 15\n                        (“Carr”). In this case, the\n                    taxpayers carried on a business of providing quarantine kennels and transport\n                    services for cats and dogs. They used two types of kennels in their business.\n                    The first type consisted of movable, wooden kennels and the second type\n                    consisted of immovable kennels. These immovable kennels were permanent\n                    structures which had concrete flooring, brick and mortar walls, and built-in\n                    drainage. Although the movable and immovable kennels both served, in a sense, as\n                    the setting or premises in which the business was housed, only the former was\n                    held to be “plant”. In arriving at his decision, Sir Donald\n                    Nicholls VC articulated the following principles (at 22–23): First, in the context in which it appears in s 41(1) [of the UK\n                        Finance Act 1971], plant carries with ita connotation\n                            of equipment or apparatus, either fixed or unfixed. It does not convey a\n                            meaning wide enough to include buildings in general.The premises, whether an office or a factory or a\n                            warehouse or whatever, at which or in which a business is carried on\n                            would not normally be understood as intended to be embraced by the\n                            expression ‘machinery or plant’. ... Secondly, the expression ‘machinery or\n                            plant’ is apt to include equipment of any size. If fixed, a large\n                            piece of equipment may readily be described as a structure, but that by\n                            itself does not take the equipment outside the range of what would\n                            normally be regarded as plant. The equipment does not cease to be plant\n                            because it is so substantial that, when fixed, it attracts the label of\n                            a structure or, even, a building. Thus a dry dock which affords the\n                            means for getting large vessels into a position where work on the\n                            outside of the hull can be done can properly be regarded as\n                            plant: seeCommissioners of Inland Revenue\n                            v. Barclay, Crule & Co. Ltd. ...Likewise, a substantial concrete silo used as a means for\n                            loading grain into customers’ lorries: seeSchofield (Inspector of Taxes) v. R. & H. Hall\n                            Ltd. ... Thirdly, and this follows from the above, equipment\n                            does not cease to be plant merely because it also discharges an\n                            additional function, such as providing the place in which the business\n                            is carried out.For example, when a ship\n                            is repaired in a dry dock, the dock also provides the place where the\n                            repair work is carried out. That is no more than the consequence\n                            ofthe extensive size of a piece of fixed\n                        plant. Fourthly, and conversely, buildings, which\n                        I have already noted wouldnot normallybe\n                        regarded as plant,donotcease to be buildings and become plantsimply because they are purpose-built for a particular\n                            trading activity. Such a distinction would make no sense.\n                        Thus the stables of a racehorse trainer are properly to be regarded as\n                        buildings and not plant.A hotel building remains a\n                            building even when constructed to a luxury specification. I\n                        say nothing about particular fixtures within the building.Similarlywitha hospital for\n                            infectious diseases. Thismight require\n                            special lay-out and other features,butthis doesnotconvert the\n                        building into plant. A purpose-built building, as much as one which is not\n                        purpose-built, prima facie isno more than the premises\n                            on which the business is conducted. Fifthly,one of the functions of a building is to\n                            provide shelter and security for people using it and for goods inside\n                            it. That isa normal function of a\n                            building.A building used for those\n                            purposes is being used as a building. Thus a building does not partake\n                            of the character of plant simply, for example, because it is used for\n                            storage by a trader carrying ona storage business.This\n                            remains so even if the building has been built as a specially secure\n                            building for use in a safe-deposit business.Or, one might add,as a\n                            prison. ... [emphasis added in italics and bold italics] 51     Put simply, anybuilding(or “building\n                        proper”, in the terminology utilised in this judgment)\n                    wouldnotconstitute “plant”. Hence,\n                    in, for example, the English Court of Appeal decision ofGray\n                        (Inspector of Taxes) v Seymours Garden Centre (Horticulture)(1995) 67 TC 401, a planteria (a form of glasshouse), which was used to\n                    provide an appropriate mini-climate in its different parts for the growth and\n                    nurturing of plants, was held to be a purpose-built structure rather than\n                    “plant”. 52     Similarly, in another decision of the English\n                    Court of Appeal decision inAttwood (Inspector of Taxes) v\n                        Anduff Car Wash Ltd[1997] STC 1167, a wash hall specially\n                    designed to wash the maximum number of cars in the shortest possible time was\n                    held to be a building, although the inspector of taxes was willing to accept\n                    thatthe machineryhoused within the wash hall\n                    constituted“plant”. Peter\n                    Gibson LJ referred to Lord Lowry’s judgment inScottish & Newcastle Breweriesand noted (at 1175)\n                    that it was only in “rare” instances where an asset that would\n                    normally be described as a building or structure would be held to be\n                    “plant” instead. Indeed, an examination of these rare cases\n                    demonstrates that the assets in question were more akin to large, integrated\n                    pieces of machinery or equipment than to buildings or structures as\n                such. 53     One example of such large equipment can be\n                    found in the New Zealand Court of Appeal decision ofCommissioner of Inland Revenue v Waitaki International Ltd[1990] 3 NZLR 27 (“Waitaki”),\n                    where it was held that the entire cold-store or freezer used in the business of\n                    meat works was “plant” inasmuch as (consistently with the approach\n                    of the majority inBarclay Curle) everything was\n                    to be considered as an integrated whole. Interestingly, Richardson J also\n                    observed thus (at 32): Except for differences in relative size, the\n                        freezer and cold-storemay be likened to a domestic or\n                            commercial deep freeze. Each is essentially a refrigerator\n                        box all six walls of which are heavily insulated to facilitate efficient\n                        refrigeration. The structure is part and parcel of the process and for his\n                        part [the expert witness for the Commissioner of Inland Revenue] said that\n                        he would call [the taxpayer’s] cold-stores a freezer complex and would\n                        describe the freezer in a butcher’s shop as plant. I consider those\n                        proper concessions and that the freezer and cold-store form part of the\n                        taxpayer’s operations and are to be characterised as plant. [emphasis\n                        added] In a similar vein, Bisson J observed as follows (at 35): A small refrigerated unit such as the domestic deep freeze I would regard\n                        as a piece of equipment but when the whole building serves as a cool-store\n                        or freezing chamber as these buildings did, I regard them as plant, being\n                        used for the purpose of processing the product essential to carrying on the\n                        business of a meat works. And Hardie Boys J stated thus (at 36): The buildings in issue in this case are not only built for the purpose of\n                        a particular process but are also part of the process itself. The chilling\n                        process requires a particular kind of equipment placed in a particular kind\n                        of structure,the whole functioning as an entity. The\n                            analogy to a deep freeze is almost complete,apart from size and mechanics. I therefore conclude\n                        that the cold stores were plant for the purposes of the section. [emphasis\n                        added in italics and bold italics] 54     In other words, although one could conceivably\n                    characterise the cold-stores or freezers inWaitakias buildings proper, the New Zealand Court of Appeal\n                    took the view that these structures were in fact and in substance, in the nature\n                    oflarge apparatus or equipment or machinery.\n                    Crudely put, they werelarge\n                refrigerators. 55     The basic distinction between\n                    “plant” and buildings was also highlighted in the High Court of\n                    Australia decision ofImperial Chemical Industries of\n                        Australia and New Zealand Limited v Commissioner of Taxation of the\n                        Commonwealth of Australia(1970) 120 CLR 396\n                        (“Imperial Chemical\n                    Industries”), where it was held that the ceiling panels and\n                    electric fittings in a building didnotconstitute\n                    “plant” (reference may also be made to the English High Court\n                    decision ofJ Lyons & Company, Limited v\n                        Attorney-General[1944] 1 Ch 281 (which concerned electric\n                    lamps and fittings);Cole Bros(which also\n                    concerned the installation of electrical apparatus); as well asWimpy(which concerned,inter\n                        alia, shop fronts, light fittings and wiring, raised floors,\n                    floor and wall tiles, wall panels and mirrors, suspended ceilings, balustrading,\n                    cold water piping and water tanks, decorative brickwork, murals, built-in\n                    storage units and dispensers)). InImperial Chemical\n                        Industries, Kitto J observed,inter\n                        alia(at 398), that “[t]he ceilings are there for the sake\n                    of the building, not the building for the sake of the ceilings” and that\n                    they were “no more than parts of the shelter, so to speak, in which the\n                    Appellant chooses to carry on its activities”. The learned judge also\n                    observed that the electrical fittings were “also parts of the general\n                    equipment of the building” (ibid). In his\n                    view (at 399), “[t]he construction of the building as a building of the\n                    general type to which it belongs would be incomplete without them, and their\n                    function does not go beyond making the building a suitable general setting for a\n                    wide range of possible activities”. The cases just mentioned relate, in\n                    fact, to the issue (dealt with below at[64]–[65]) of whether\n                    or not an asset that is not a building proper as such can be so inextricably\n                    connected with a building such that it could be regarded as part of the building\n                    for income tax purposes. 56     A significant and related issue that then\n                    arises is this: what constitutes a “building” (or a\n                    “building proper” in the terminology utilised in this judgment)\n                    for the purposes of the distinction between “plant” on the one\n                    hand and building on the other? This is an issue to which our attention now\n                    turns. What constitutes a “building”? (1)   Introduction 57     Unlike Stephenson LJ’s observations\n                    inCole Bros(cited above at[26]), it is probably easier to recognise a\n                    building when we encounter it than it is in the case of “plant”\n                    (which the learned judge was concerned with). Indeed, in the vast majority of\n                    cases, we will know a building when we see it. However, with the myriad of\n                    possible permutations, there will be the so-called grey areas. Indeed, as we\n                    shall see, the assets that are the subject matter of the present appeal may well\n                    fall within such a grey area. In any event, it would, as a matter of logic as\n                    well as commonsense, be appropriate that we set out the main criteria that would\n                    guide the court in ascertaining whether or not a given asset is a\n                    “building”. (2)   The operational role of the asset in the taxpayer’s\n                business 58     As Nicholls VC aptly mentioned inCarr, “plant” carries with it a\n                    connotation of equipment or apparatus. Accordingly, an asset which operates as a\n                    large piece of equipment cannot be said to be a building or structure, since the\n                    normal purpose of the latter is to provide a setting or premises for the\n                    business (bearing in mind our earlier caution that setting and premises arenotto beautomatically\n                        equatedwith buildings or structures). Where a very large asset\n                    can be considered both equipment and the setting or premises in which the\n                    business is carried on (like the grain silo inSchofield,), the question then is whether the asset is more\n                    appropriately described as equipment (and hence “plant”)oras a building. This would in turn depend on theextentto which the asset plays the role ofequipmentin the taxpayer’s business, as\n                    well as the other factors indicated below. (3)   The physical nature of the asset 59     Another obvious criterion in determining\n                    whether an asset is a building isthe physical\n                        natureof the asset itself, which would encompass, for example,\n                    its size, shape, durability, as well as the material it is constructed of. The\n                    more an asset resembles a conventional building or structure, the more unlikely\n                    it will be held to be “plant”. If the asset concerned looks like a\n                    building and is constructed from permanent materials (such as brick and mortar),\n                    it should almost certainly be described as a “building” (unless,\n                    of course, it falls into one of those rare cases where it can be more\n                    appropriately described as a piece of equipment rather than a building).\n                    Conversely, assets which are constructed from temporary and ephemeral materials\n                    cannot, in the vast majority of cases, be said to be buildings in any sense of\n                    the word. However, there remain intermediate situations such as the present case\n                    (where the dormitories are constructed ofpre-fabricated\n                        material). In such instances, we are of the view that the\n                    intention of the taxpayer in relation to the use and location of the asset could\n                    be a decisive factor, and we will elaborate on this below. (4)   Whether the asset is intended to be only temporarily located 60     As we mentioned earlier, buildings or\n                    structures carry with them a certain connotation of permanence and, hence, an\n                    asset is less likely to be considered a building if it does not remain on any\n                    one site permanently. In such circumstances, theintentionof the person who incurred the expenditure on the\n                    asset will, in our view, be a crucial factor. If it can be demonstrated, via\n                    objective evidence, that that person only intended for the asset to betemporarilylocated and moved around from place to\n                    place, then that asset is unlikely to constitute a building. Conversely, if it\n                    can be demonstrated, again via objective evidence, that that person brought the\n                    asset into existence with the intention that it bepermanentin nature, then that asset is more likely to\n                    constitute a building, notwithstanding the fact that it may not be as\n                    permanently constructed as a normal building. Indeed (as we shall see below at[77]), this particular criterion will be\n                    of critical significance in the context of the facts of the present appeal.\n                    Insofar as the former is concerned (viz, an\n                    intention that the asset concerned was to be only temporarily located and would\n                    be moved around from place to place), reference may be made to two Australian\n                    decisions which were, in fact, cited by the Appellant. 61     In the High Court of Australia decision ofQuarries Ltd v Federal Commissioner of\n                        Taxation(1961) 106 CLR 310 (“Quarries”), the taxpayer’s business was to quarry\n                    and crush stone at various remote places. As it was required to move from site\n                    to site, part of its train of equipment consisted of portable sleeping units,\n                    which were small enclosed sheds or cubicles which were transported upon a\n                    trailer. The taxpayer claimed capital allowances on the basis that the sleeping\n                    units were ““plant” or articles owned by a taxpayer and\n                    used by him “for the purpose of producing assessable income” under\n                    s 54 of the Income Tax and Social Services Contribution Assessment Act\n                    1936–1957 (Cth). The court held in favour of the taxpayer. Taylor J\n                    observed thus (at 314): Of course, “article” cannot ordinarily be taken to\n                        comprehend a structure erected or builtin\n                            situ(cf.In the Matter of Application for\n                            the Registration of Designs by R. H. Collier & Co\n                            Ltd(1937) 54 RPC 253) though in some circumstances a\n                        structure in the nature of a building may be “plant”\n                            (The Australian Gas Light Co v The\n                            Valuer-General(1940) 40 SR (NSW) 126 at 141).However the sleeping units, are not structures in the nature of\n                            buildings in the ordinary sense of that expression; they were, as\n                            appears, designed and constructed as portable or movable equipment for\n                            use in connexion with the nomadic type of business which the taxpayer\n                            carries on. As such they were just as much\n                        “articles” as were the tents which, earlier during the year of\n                        income in question, were provided by the tax-payer. [emphasis added] 62     Similarly inCase\n                        A43(1969) 69 ATC 244, the taxpayer’s business\n                    consisted of the manufacture as well as on-site erection of power plants and,\n                    like the taxpayer inQuarries, this required the\n                    taxpayer to move from site to site. The taxpayer erected sheds on its different\n                    work sites which were used as offices, stores, workshops, changing rooms, and\n                    toiletsetc. The Australian Income Tax Board of\n                    Review held that the sheds were “plant”.\n                    Mr R E O’Neill, whom the rest of the board agreed with,\n                    stated (at [23]) that: ... At any particular time sheds upon a contract site are there only\n                        temporarily for the duration of and for the purposes of and in relation to\n                        the particular job which the company has contracted to do at that site. In\n                        such a context it seems to me that the sheds have the character of\n                        “plant” rather than that of “setting”even though like structures would be\n                            “setting” if located permanently on the company’s\n                            own business premises for similar uses in relation to its continuing\n                            operations at those premises. [emphasis added] 63     The decisions in these two cases demonstrate\n                    that an item is less likely to be classified as a building if it was not\n                    intended to remain at one particular site. The above passage (in the preceding\n                    paragraph) fromCase A43, in particular,\n                    clearly indicates that the temporary presence of an item can be the decisive\n                    factor making it “plant” whereas another item with the exact same\n                    function and physical characteristics but located permanently might not be\n                    “plant”. (5)   Parts of a building proper 64     We note that more difficult questions of\n                    application might arise in relation topartsof a\n                    building proper. Whether or not these constitute “plant” or\n                    building would depend very much upon the precise factual matrix. Given the\n                    myriad of permutations of possible fact situations, it would be invidious to\n                    generalise. Nevertheless, we are of the view that if the item (or items)\n                    concerned, although not a building proper as such, is inextricably connected\n                    with a building, it can be regarded as part of the building for income tax\n                    purposes. In this regard the following observations of Hoffmann J inWimpyare instructive (at 173): ... the question seems to me to be whether it would be more appropriate to\n                        describe the item as having become part of the premises than as having\n                        retained a separate identity. This is a question of fact and degree, to\n                        which some of the relevant considerations will be: whether the item appears\n                        visually to retain a separate identity, the degree of permanence with which\n                        it has been attached, the incompleteness of the structure without it and the\n                        extent to which it was intended to be permanent or whether it was likely to\n                        be replaced within a relatively short period. 65     Some examples of the application of this\n                    principle can be found inImperial Chemical\n                        Industries(considered above at[55]), inWimpyitself, and in the\n                    English High Court decision ofHampton (Inspector of Taxes) v\n                        Fortes Autogrill Ltd(1979) 53 TC 691, where the taxpayer\n                    carried on business as a caterer and had installed false ceilings in its\n                    restaurants to provide cladding for various pipes and electrical conduits. The\n                    court held that the false ceilings were part of the premises in which the\n                    taxpayer’s business was carried on. (6)   Some illustrations 66     Taking all the above factors into account, we\n                    would, by way ofillustration only, postulate the\n                    following examples of what, in our view, might (or might not) constitute\n                    “buildings”: (a)     A crane used to lift and lower bulky\n                        objects would qualify as “plant” even if it is permanently\n                        fixed to a certain spot and is constructed such as to last for decades. This\n                        is because it obviously functions as a giant piece of equipment or machinery\n                        and cannot be likened to a building or structure. (b)     Curtains and movable partitions in a\n                        shophouse or office would also be “plant” even if their sole\n                        purpose was simply to exist as part of the premises because they cannot be\n                        said to physically resemble buildings or structures in any way, nor would\n                        they be sufficiently connected with the shophouse or office to form an\n                        inextricable part of the building. (c)     An office put up at a construction site and made of brick\n                        and mortar would be considered a building instead of “plant”,\n                        even if the contractor or developer intended to demolish it in a couple of\n                        years after the construction is complete. This is because the office\n                        functions as premises, is constructed of permanent materials, and so\n                        obviously resembles a building. (d)     Wooden sheds and storehouses located permanently at a\n                        site would also be considered buildings instead of “plant”.\n                        Although constructed of less durable materials than concrete buildings, they\n                        have the sole function of housing and are also not meant to be moved around.\n                        Thus, they are also just as permanent as concrete\n                    buildings. (e)     Tents\n                        used for accommodation and shelter are definitely “plant”.\n                        They have very little resemblance to actual buildings or structures and are\n                        meant to be moved from place to place. 67     While it would of course be impossible to set\n                    out an exhaustive list of what is (or is not) “plant”, we are of\n                    the view that the framework we have just described should provide a principled\n                    basis for a court or tribunal concerned to decide a particular case. We also\n                    recognise that, even with this framework in place, there would inevitably be\n                    cases falling on the borderline, of which the present appeal is a perfect\n                    example. In such cases, where it is reasonable to conclude that an asset can be\n                    either “plant” or a building, an appellate court should not\n                    interfere with the decision rendered at first instance. This position is made\n                    clear by s 81(2) of the ITA which states that any appeal from the Board to\n                    the High Court (and consequently any appeal from the High Court to the Court of\n                    Appeal) can only be on a question of law or of mixed law and fact. As Judith\n                    Prakash J noted in the Singapore High Court decision ofNP v Comptroller of Income Tax[2007] 4 SLR(R) 599,\n                    s 81(2) reflects a similar rule in the United Kingdom and the rationale for\n                    such rule was explained by Lord Radcliffe inEdwards\n                        (Inspector of Taxes) v Bairstow[1956] AC 14 (at 38): As I see it, the reason why the courts do not interfere with\n                        commissioners’ findings or determinations when they really do involve\n                        nothing but questions of fact is not any supposed advantage in the\n                        commissioners of greater experience in matters of business or any other\n                        matters. The reason is simply that by the system that has been set up the\n                        commissioners are the first tribunal to try an appeal, and in the interests\n                        of the efficient administration of justice their decisions can only be upset\n                        on appeal if they have been positively wrong in law.The\n                            court is not a second opinion, where there is reasonable ground for the\n                            first. [emphasis added] 68     More specifically in relation to the issue of\n                    whether an asset is “plant” or a building, Lord Lowry said inScottish & Newcastle Breweries(at 327): (1) It is a question of law what meaning is to be given to the word\n                        “plant”, and it is for the courts to interpret its meaning,\n                        having regard to the context in which it occurs.(2) The law does not supply a definition of plant or prescribe a\n                            detailed or exhaustive set of rules for application to any particular\n                            set of circumstances, and there are cases which, on the facts found, are\n                            capable of decision either way. (3) A decision in such a case is a\n                            decision on a question of fact and degree and cannot be upset as being\n                            erroneous in point of law unless the commissioners show by some reason\n                            they give or statement they make in the case stated that they have\n                            misunderstood or misapplied the law in some relevant\n                            particular. (4) The commissioners err in point of law\n                        when they make a finding which there is no evidence to support. (5) The\n                        commissioners may also err by reaching a conclusion which is inconsistent\n                        with the facts they have found. [emphasis added] 69     This would be an appropriate juncture to draw\n                    the various threads together and summarise the applicable legal\n                    principles.",
        "A summary": "70     The applicable legal principles may be\n                    summarised as follows (bearing in mind the caveat that, in the final analysis,\n                    the precise factual matrix as well as context is of the first importance and\n                    that the following propositions are only the most basic ones and do not include\n                    the nuances that are to be found in the relevant case law): (a)     There is a basic distinction between\n                        “plant” on the one hand and buildings on the\n                    other. (b)     “Plant” consists inapparatusthat is utilisedfor carrying on the trade or business\n                        concerned. (c)     “Building”, on the other\n                        hand, consists of a permanent structure or part of a permanent structure\n                        that houses the trade or business. It is often described, in a shorthand\n                        manner, as the place in which a trade or business is carried on. To the\n                        extent that a “building” houses the trade or business, it is,\n                        to that extent, an asset with which a trade or business is carried on.\n                        However, because of their qualitative differencevis-à-vis“plant”, buildings are granted lower\n                        rates of capital allowances, and even then, capital allowances are only\n                        granted in the specific circumstances set out in the ITA. In order to\n                        ascertain whether or not a particular asset is a “building” or\n                        ““plant””, the following factors are\n                        helpful: (i)       The exact operational role\n                            which the asset plays in the taxpayer’s\n                        business. (ii)       The physical nature and characteristics of the\n                        asset. (iii)       Whether the asset concerned is intendedonlyto betemporarilylocated. (iv)       Where it appears that the asset, although not a building proper\n                            as such, is nevertheless inextricably connected with a building, it can\n                            be regarded aspartof the building for\n                            income tax purposes. (c)     In the final analysis, much will depend uponthe precise factual matrix and contextconcerned. 71     Let us now proceed to apply these legal\n                    principles to the facts of the present appeal.",
        "Our decision": "",
        "Whether this court should interfere with the conclusions of the Board\n                and the Judge": "72     We turn first to Mr Aw’s\n                    alternative argument, that the question of whether the Appellant’s\n                    dormitories were “plant” is one of fact and degree and that the\n                    answer given by the Board should be treated as decisive unless it was an\n                    unreasonable conclusion on the facts. While we agree completely with\n                    Mr Aw’s statement of the law, we are of the view that both the Board\n                    and the learned Judge below had, with respect, erred in law (as opposed to fact)\n                    by focusing on the sole factor of the dormitories being used as the\n                    “setting” or “premises” for the taxpayer’s\n                    business without taking into consideration other relevant factors. The Board, in\n                    arriving at its decision, had expressly disregarded the fact that the\n                    dormitories were portable and demountable, and that they were only intended to\n                    be situated at the Site for nine years at the most. 73     Similarly, this was the approach adopted by\n                    the Judge. Although the Judge had correctly cited the cases ofWimpyandCarr(which\n                    addressed the basic distinction between “plant” and buildings), he\n                    went on to conclude that the dormitories were not “plant” because\n                    they were used solely as the premises for the taxpayer’s business of\n                    providing accommodation and did not have any additional function (seeZF(HC)at [35]–[37]). With respect, it appears\n                    that the Judge had inadvertently applied the wrong legal test because he had\n                    reverted to the former approach of buildings being treated as beingequivalent tosetting or premises. In doing so, the\n                    learned Judge had not taken into consideration the portability and\n                    demountability of the dormitories, nor the fact that they were meant to be\n                    temporarily situated at the Site. We agree with the Judge that portability and\n                    demountability were not thefunctionsof the\n                    dormitories but this did not mean that they were irrelevant to the final\n                    enquiry. 74     If the Board or the Judge had taken into\n                    account the temporary nature and the physical characteristics of the dormitories\n                    in the context of whether or not the dormitories were “buildings” (or “buildings\n                        proper” in the context of the terminology utilised in this\n                    judgment), and still decided that the dormitories were not\n                    “plant”, we would probably not have disturbed such a finding\n                    because it would not have been clearly unreasonable on the facts. As we\n                    mentioned earlier at[67], we consider the\n                    present case to be very much on the borderline. Nevertheless, since the Board\n                    and the Judge had, with respect, not applied the correct legal test and we do\n                    not know what the result would have been if they had, we consider it open to us\n                    to arrive at our own conclusion on the facts.",
        "Whether the portable dormitories are “plant”": "75     The Judge held, in effect (and leaving aside\n                    the terminology he utilised (cfabove at[30]–[31])), that the dormitories were indeed utilised for the\n                    purposes of the Appellant’s business. We agree. Indeed, these dormitories\n                    were the very tools of trade without which the Appellant would not have been\n                    able to conduct its business at all. 76     However, could it be argued that,\n                    notwithstanding the finding referred to in the preceding paragraph, the\n                    dormitories in the present proceedings were nevertheless\n                    “buildings”, thus bringing themoutsidethe purview of “plant”? 77     Although the dormitories in the present case\n                    could reasonably have been held to be either “plant” or buildings,\n                    a final decision has to be made on the facts. Having considered the\n                    circumstances, we are of the view that the dormitories qualify as\n                    “plant” for the purposes of ss 19 and 19A of the ITA. Even\n                    though they were definitely not large pieces of equipment and also resembled\n                    buildings from a physical perspective, they were not made of such lasting\n                    materials so as to fall inextricably on the buildings side of the boundary.\n                    Further, as already noted at the outset of this judgment, the dormitories\n                    concerned were never intended to be permanent structures in the manner that\n                    buildings proper are intended to be. Indeed, the relevant conditions were such\n                    that the taxpayer might have had to dismantle the dormitories within\n                    90 days (this is to be contrasted, for example, with thepermanentquarantine kennels inCarr). In the circumstances, the dormitories were more akin to\n                    apparatus or equipment or machinery (albeit like, for example, the dry dock inBarclay Curleand the silos inSchofield, being rather large in size).Indeed, the Appellant had intended that they be located only\n                        temporarily and would be moved around from place to place when the need\n                        arose. It was clearlyneverthe\n                    intention of the Appellant to locate the dormitoriespermanentlyat the Site. They would, at the extreme end of the\n                    spectrum, be located at the Site for nine yearsat\n                        most, and could in fact even have been moved much earlier. Looked\n                    at in this light, we are of the view that the dormitories werenotbuildings proper but constituted, instead,\n                    “plant”. That an item is not necessarily precluded from\n                    constituting “plant” just because it provides temporary\n                    accommodation to actual persons is illustrated by the High Court of Australia\n                    decision ofQuarrieswhere, it will be recalled,\n                    it was held thatportable sleeping units(which\n                    comprised small enclosed sheds or cubicles constructed of galvanized iron and\n                    timber and were capable of being readily and conveniently moved by crane and\n                    which were transported by a trailer attached to a prime-mover) constituted\n                    “plant”. These sleeping units were provided for the accommodation\n                    of the taxpayer’s employees whilst they were engaged in the\n                    taxpayer’s business of quarrying and crushing stone. The duration of the\n                    operations of quarrying and crushing at each site appeared to vary between three\n                    and six months, with the average period being approximately six months. It\n                    should be noted, however, that the Income Tax Board of Review, in the present\n                    proceedings, haddistinguishedthe decision inQuarriesin the following manner (seeZF (ITBR)at [26]–[27]): 26.    However, we agree with the Respondent that, in\n                            relying on theQuarriescase, the\n                            Appellant had not given due consideration to the trade of the taxpayer\n                            in theQuarriescase. In theQuarriescase, the taxpayer was in the trade of\n                            quarrying and crushing stones, and pursuant to a contract with the South\n                            Australian highway authority, was required to win and crush stone at\n                            various, frequently remote, places. The duration of its operations at\n                            each site was on average six months, and the sleeping units in question\n                            were transported upon a trailer attached to a prime mover when it was\n                            time to relocate. It is clear that the sleeping units in theQuarriescase were deployed to enable the\n                            taxpayer to carry out its business of stone quarrying and\n                            crushing. 27.    In contrast, the Appellant does not, for the\n                            purposes of its trade, require the use of the Dormitories to be portable\n                            or demountable in order for the Appellant to carry out its business,\n                            which is the provision of accommodation to workers. The fact that the\n                            Appellant has assembled the Dormitories using Pre-Fabricated Structures\n                            is for its own convenience in the event it is required to vacate the\n                            Site at short notice. This must be distinguished from a situation where,\n                            due to the particular circumstances or nature of the Appellant’s\n                            business, the Dormitories are to be constructed using Pre-Fabricated\n                            Structures (as in the case of the portable sleeping units in theQuarriescase). In the present\n                            circumstances, the Appellant could just as well have carried on its\n                            business of providing accommodation without using Pre-Fabricated\n                            Structures, and the Dormitories are no more than the building or\n                            premises in which the Appellant carries out its trade. The fact that the\n                            Dormitories happen to be demountable or portable does not change this\n                            analysis. 78     With respect, we do not agree with the above\n                    analysis. In our view, given the specificcontextof the factual matrix in the present proceedings, the Appellantdid, in fact, require –for the purposes of its trade –that the\n                    dormitories be portable or demountable in order for it to carry out its business\n                    of providing accommodation on a temporary basis. The very nature of its\n                    business, the provision of accommodation for workers on a temporary basis,\n                    requires the Appellant to use this kind of facility. It would have made no\n                    commercial sense for the Appellant to have built, presumably at greater expense,\n                    dormitories made of permanent (as opposed to pre-fabricated) materials,\n                    particularly since it might have had to vacate the premises concerned at\n                    relatively short notice. Further, dormitories made of permanent materials could\n                    not be moved around from place to place. Looked at in this light, the factual\n                    situation in the present proceedings was not dissimilar, in substance, to that\n                    inQuarries. Indeed, the focus inQuarries(especially at 317) was on the issue as to\n                    whether or not the sleeping units were necessary in order to enable the taxpayer\n                    concerned to carry out its trade. Likewise, in the present proceedings, the\n                    dormitories were in fact necessary to enable the taxpayer to carry out its\n                    business. Indeed, these dormitories constituted the very toolswithout whichit would have beenimpossiblefor the Appellant to carry out its businessat all. Thenatureof the\n                    dormitories relates more to the issue as to whether or not they were buildings\n                    proper. And, for the reasons set out in the preceding paragraph, we are of the\n                    view that the dormitories werenotbuildings\n                    proper and constituted“plant”instead. 79     The dormitories, which are the subject of the\n                    present appeal, might, however, becontrasted with\n                        hotelswhich are,ex hypothesi,\n                    permanent structures that therefore constitute buildings proper. Indeed, absent\n                    specific statutory provision (for example, in respect of hotels on the island of\n                    Sentosa pursuant to s 18(1)(h) of the ITA), a\n                    hotel would not even qualify for capital allowances as “industrial\n                    building or structure” (see s 18(6) of the ITA). In the present\n                    case, however, the dormitories concerned were not unliketemporarystructures such astents. Similarly, if the Appellant had used cargo containers,\n                    stacked on top of one another and modified for the purposes of providing\n                    accommodation to the workers, such containers would not have been considered as\n                    buildings.",
        "Conclusion": "80     In the circumstances and for the reasons set\n                    out above, we allow the appeal with costs both here and below (both in the High\n                    Court as well as before the Board). The usual consequential orders are to\n                    follow.",
        "Postscript": "81     We also take this opportunity to clarify a\n                    peripheral issue pertaining to income tax appeals before this court in general.\n                    Counsel for the Appellant had written in to the court prior to the hearing of\n                    this appeal requesting for the appeal to be heardin\n                        camera. Counsel’s request came about as a result of the\n                    decision of this court inJD Ltd v Comptroller of Income\n                        Tax[2006] 1 SLR(R) 484 (“JD\n                        Ltd”), where the application of s 83(1) of the Income\n                    Tax Act (Cap 134, 2004 Rev Ed) (“the 2004 Act”) was\n                    considered. This provision isin pari materiawith\n                    s 83(1) of the present ITA and reads as follows: Proceedings before Board and High\n                            Court 83. —(1) Subject to subsections (2)\n                        and (3), all proceedings before the Board and in appeals to, or in cases\n                        stated for the opinion of, the High Court under the provisions of this Part,\n                        and in appeals from decisions of the High Court under section 81(5) shall be\n                        heard in camera. 82     Section 81 of the 2004 Act is alsoin pari materiawith s 81 of the present\n                    ITA and subsection (5) thereof reads as follows: Appeals to High\n                        Court 81. —(5) There shall be such further\n                        right of appeal from decisions of the High Court under this section as\n                        exists in the case of decisions made by that Court in the exercise of its\n                        original civil jurisdiction. 83     InJD Ltd, this\n                    court (at [59]) interpreted s 83(1) to mean that all proceedings before the\n                    Board and the High Court under Part XVIII of the 2004 Act were required to\n                    be heldin camera. However, Yong Pung How CJ,\n                    delivering the judgment of the court, went on to state, as follows (ibid): ... As for proceedings before the Court of Appeal, there is\n                        no blanket rule that all such appeals must be heldin\n                            camera. Indeed, s 83(1) only stipulates that\n                        “appeals from decisions of the High Courtunder\n                            section 81(5) shall be heard in camera” [emphasis\n                        added]. Section 81(5), in turn, provides that: There shall be such further right of appeal from decisions of the High\n                            Court ... as exists in the case of decisions made by that Court in the\n                            exercise of itsoriginalcivil\n                            jurisdiction. [emphasis added] It must mean, therefore, that s 83(1), read with s 81(5),\n                        provides that appeals before the Court of Appeal will only be heldin cameraif the High Court had heard the case at\n                        first instance, that is, if the High Court had heard the case in the\n                        exercise of itsoriginalcivil jurisdiction.\n                        The Act remains silent as to the case where the taxpayer appeals against the\n                        decision of the High Court exercising itsappellatejurisdiction, as is the situation in the present\n                        appeal where the case was first heard by the Board of Review. [emphasis in original] 84     What the learned Chief Justice was saying, in\n                    other words, was that s 81(5) of the 2004 Act gave a right of appeal from\n                    the High Court to the Court of Appeal if the High Court had heard an income tax\n                    appeal against the assessment of the Comptroller at first instance. Read\n                    together with s 83(1), it would mean that income tax appeals before the\n                    Court of Appeal would normally not be required to be heardin\n                        cameraunless the High Court had heard the case at first\n                    instance. Nevertheless, Yong CJ went on to state that the Court of Appeal\n                    retained the discretion to hear an appealin\n                        cameraand accordingly granted the taxpayer’s request for\n                    it to do so. The Appellant in this case had thus made a similar request on this\n                    basis. 85     With respect, we do not agree with Yong\n                    CJ’s interpretation of s 83(1) of the 2004 Act as only extending to\n                    proceedings before the Board and the High Court, but not to proceedings before\n                    the Court of Appeal. Section 81(5) provides that “[t]here shall be\n                    such further right of appeal from decisions of the High Court under this section\n                    as exists in the case of decisions made by that Court in the exercise of its\n                    original civil jurisdiction”. The words “in the exercise of its\n                    original civil jurisdiction” are not a reference to the proceedings from\n                    the Board to the High Court because the High Court would, in such a case, be\n                    exercising its appellate, not original, jurisdiction. Hence, we are of the view\n                    that the words “as exists” in that subsection simply mean that\n                    “just as” in the case of the High Court exercising its original\n                    jurisdiction in other cases, there is a further right of appeal. 86     Accordingly, for future appeals to this court\n                    in an income tax matter, it would not be necessary for any party to apply for\n                    the appeal to be heardin camera. All such appeals\n                    will be heardin camera."
    }
}