{
    "case_title": "Valentino Globe BV\n      v\n      Pacific Rim Industries Inc",
    "ncitation": "[2010] SGCA 14",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This was an appeal by Valentino Globe BV\n                    (“the Appellant”) against the decision of the High Court judge\n                    (“the Judge”) inValentino Globe BV v Pacific\n                        Rim Industries Inc[2009] 4 SLR(R) 577 (“the\n                    GD”) where the Judge rejected the Appellant’s opposition to Pacific\n                    Rim Industries Inc’s (“the Respondent”) application for the\n                    registration of the latter’s mark known as the “Emilio Valentino\n                    & V Device” (“the Application Mark”).",
        "Factual background": "2       On 18 December 2003, the Respondent of 5359\n                    Valley Blvd, Los Angeles California 90032, United States of America, filed the\n                    Application Mark for registration in respect of “Leather goods; all\n                    included in Class 18 [of the Nice Classification,ie, the International Classification of Goods and Services under\n                    the Nice Agreement]”. The registration application was accepted and\n                    advertised on 25 June 2004 in the Trade Marks Journal. On 25 August\n                    2004, a notice of opposition was filed by the Appellant, who owned trade mark\n                    registration rights in Singapore for an array of “Valentino” trade\n                    marks bearing multifarious designs. Collectively, these\n                    “Valentino” trade marks shall hereinafter be referred to as\n                    “the Valentino Marks”.[note: 1] 3       The Appellant pursued its objection to the\n                    Application Mark before the Principal Assistant Registrar (“PAR”)\n                    of the Registry of Trade Marks, relying on various grounds of opposition\n                    including,inter alia, ss 7(6) and 8(2) of\n                    the Trade Marks Act (“TMA”) (Cap 332, 1999 Rev Ed)\n                    (“TMA 1999”). At this juncture, we should explain that although\n                    the TMA 1999 was amended in 2004 by Act No 20 of 2004 (“the 2004\n                    Amendment Act”), ss 7(6) and 8(2) of the TMA 1999 were in no way\n                    affected by the 2004 Amendment Act. In July 2005, a new revised edition of the\n                    TMA, incorporating all the amendments made thereto, was published (“TMA\n                    2005”). What were ss 7(6) and 8(2) of the TMA 1999 are now the same\n                    provisions in the TMA 2005, which is the current edition of the Act in force\n                    here. For ease of reference, these two provisions will be referred to\n                    hereinafter simply as “s 7(6)” and “s 8(2)”\n                    respectively. 4       Having failed before the PAR on all the grounds\n                    of its opposition, the Appellant appealed to the High Court but proceededonlyunder ss 7(6) and 8(2). The High\n                    Court upheld the decision of the PAR, for largely the same reasons. Before this\n                    court, the Appellant again reliedonlyon\n                    ss 7(6) and 8(2). The Appellant’s arguments were essentially as\n                    follows: (a)     Pursuant to s 8(2), the\n                        registration of the Application Mark should not be allowed because there\n                        existed a likelihood of confusion on the part of the public as the\n                        Application Mark was similar to the Appellant’s Valentino Marks and\n                        was to be registered for similar or identical goods (“theConfusingly SimilarIssue”). (b)     Pursuant to s 7(6), the registration of the Application Mark should\n                        not be allowed because of the Respondent’s bad faith (“theBad FaithIssue”).",
        "The findings of the Judge": "",
        "The Confusingly Similar Issue": "5       In so far as the Confusingly Similar Issue was\n                    concerned, while the PAR found that among all the Valentino Marks, only\n                    T99/04403D and T00/21726H (“the Relevant Marks”) could be said to\n                    be similar to the Application Mark[note: 2], she eventually found, having carefully\n                    examined the marks, that the Relevant Marks were aurally and conceptually\n                    dissimilar to the Application Mark.[note: 3]The Judge agreed with the\n                    findings of the PAR. 6       The first argument raised by the Appellant was\n                    that the array of Valentino Marks evinced a “monopoly claimed [sic] to the device mark [of the word mark Valentino on\n                    its own] as well as the composite mark consisting of both the word Valentino and\n                    the V device” (the GD at [25]). In response, the Judge remarked that the\n                    Appellant could not and didnothave a monopoly of\n                    the word “Valentino” and noted that if it did, “the many\n                    marks which contain the word “Valentino” would never have been\n                    registered to begin with” (the GD at [26]). 7       The Appellant also argued that the\n                    “Application Mark, which reads “Emilio Valentino”, would\n                    result in a misimpression that it was another mark in the Valentino Mark series,\n                    thereby resulting in public confusion” (the GD at [25]). In this regard,\n                    the Judge held that (and this is an important point) (the GD at [26]): [V]iewing the Application Mark and the Appellant’s Relevant Marks\n                        holistically, I find that there is indeed little similarity, be it visually,\n                        aurally or conceptually. Even though the common denominator between the\n                        Application Mark and the Appellant’s trade marks is the word\n                        “Valentino”, the Application Mark consists of several other\n                        distinguishing features as the PAR had pointed out. Accordingly, I am of the\n                        view that the use of the Application Mark would not result in a likelihood\n                        of confusion. The most outstanding difference between the Application Mark\n                        and the Relevant Marks is, to my mind, the name “Emilio” in\n                        the former. That the name “Emilio” precedes\n                        “Valentino” is a very glaring difference between the marks\n                        because in the aural sense especially, they are very distinct from one\n                        another. One would hear the name “Emilio” before\n                        “Valentino” when pronouncing the Application Mark and\n                        reading-wise, one would very likely read the name “Emilio”\n                        first too. The Application Mark must be viewed in its entirety. Simply\n                        because it incorporates the word “Valentino” does not mean\n                        that it is so visually and aurally similar as to be confused with the\n                        Appellant’s Relevant Marks. 8       We would, at this juncture, note that in so far\n                    as the argument based on s 8(2) was concerned, the Appellant was (in its appeal\n                    to this court) relying only on the following two Valentino Marks: T89/07704E\n                    (registered under Class 25 of the Nice Classification) and T89/07703G\n                    (registered under Class 25 of the Nice Classification) (collectively,\n                    “the Appeal Marks”), instead of the Relevant Marks (see[5]above), to aver that the registration of the\n                    Application Mark would cause confusion[note: 4]. In relation to T89/07704E (with its\n                    counterpart being registered as T89/07702I under Class 18 of the Nice\n                    Classification), the Judge was of the view that this particular Valentino Mark\n                    which contained the words “valentino garavani” was dissimilar to\n                    the Application Mark. This was his reasoning at [28]: Simply because the word “valentino” is embedded within the\n                        marks does not make “Emilio Valentino” and “valentino\n                        garavani” similar to each other. Juxtaposing the “valentino\n                        garavani” trademark against the Application Mark, I am hard pressed\n                        to find any similarity save for the common constituent word\n                        “valentino”, but even that similarity is far from compelling\n                        as the Application Mark uses the capital letter “V” in\n                        spelling “Valentino” whereas the Appellant’s mark uses\n                        the lowercase letter “v”. Further, “valentino”\n                        in the Appellant’s “valentino garavani” trademark\n                        precedes the word “garavani” whereas in the Application Mark,\n                        “Valentino” only comes after the word “Emilio”.\n                        Visually and aurally, the marks are thus more distinct than similar. 9       Turning to the second Valentino Mark (ie, T89/07703G) which the Appellant relied upon for the\n                    purposes of this appeal, the Judge also rejected the contention that T89/07703G\n                    was similar to the Application Mark. He described the differences between these\n                    two marks at [29] of his GD as follows: With regard to T89/07703G, the word “valentino” is above the\n                        ‘V’ endless belt device … . The positioning of the word\n                        “Valentino” in relation to the device is thus unlike that in\n                        the Application Mark which has the words “Emilio Valentino”\n                        below, not above the stylized “V”.",
        "The Bad Faith Issue": "10     As regards the Bad Faith Issue, both the Judge\n                    and the PAR were of the view that “[s]ince it was the Appellant which had\n                    alleged bad faith on the part of the Respondent, … the burden rests upon\n                    the Appellant to prove such bad faith” (the GD at [20]). The specific\n                    instances of bad faith alleged by the Appellant were: (a) the\n                    Respondent’s hijacking of its Valentino Marks; (b) the\n                    Respondent’s lack of proprietorship with regard to the Application Mark;\n                    and (c) the Respondent’s copying of the Application Mark from a\n                    gentleman in Italy who shared an identical mark with the Respondent (see the GD\n                    at [20]). After a detailed and careful examination of the evidence before him,\n                    the Judge dismissed all the allegations.",
        "The issues in this appeal": "11     As would be apparent from what was stated\n                    above (particularly at[4]), there were, in\n                    essence, two issues in this appeal. First, the Appellant submitted that the\n                    Respondent’s application to register the Application Mark was made in bad\n                    faith pursuant to s 7(6). Second, that confusion was likely to arise in the\n                    minds of the public on account of the fact that the Application Mark was similar\n                    in particular to the Appeal Marks and was proposed to be registered for similar\n                    goods as those of the Appellant, contrary to s 8(2). Accordingly, on either\n                    or both grounds, the Appellant contended that the Application Mark should not be\n                    registered. We would also add that before us, the Appellant’s main\n                    fire-power was concentrated on s 7(6) instead of s 8(2). Accordingly,\n                    we will first deal with the Confusingly Similar Issue based on s 8(2),\n                    which we can dispose of briefly.",
        "The Confusingly Similar Issue: whether there existed a likelihood of\n                confusion on the part of the public as the Application Mark was similar to the\n                Appeal Marks and was to be registered for similar or identical goods": "12     Section 8(2) provides as follows: A trade mark shall not be registered if because\n                        – (a)    it is identical with an earlier trade mark and\n                                is to be registered for goods or services similar to those for which\n                                the earlier trade mark is protected; or (b)    it is similar to an earlier trade mark and is\n                                to be registered for goods or services identical with or similar to\n                                those for which the earlier trade mark is protected, there exists a likelihood of confusion on the part of the public. 13     For the purposes of the present case, it was\n                        para (b) of s 8(2) which was\n                    applicable and not para (a) because it was\n                    not alleged by the Appellant that the Application Mark wasidenticalwith any of the Appellant’s Valentino Marks. It\n                    would be seen that in order to establish a case under s 8(2)(b), the following requirements must be proven: (a)     The Application Mark was similar to\n                        the Appeal Marks; (b)     The Application Mark was to be registered for goods or services\n                        identical with or similar to those for which the Appeal Marks have been\n                        registered for; and (c)     On account of (a) and (b), there existed a likelihood of confusion on\n                        the part of the public. 14     As mentioned in[8]above, the Valentino Marks which the Appellant relied upon\n                    in this appeal were the Appeal Marks, both of which were registered under Class\n                    25 of the Nice Classification (which covered “clothing, footwear,\n                    headgear”). However, the Application Mark was proposed to be registered\n                    under Class 18 of the Nice Classification, that class being in respect of\n                    “Leather and imitations of leather, and goods made of these materials and\n                    not included in other classes; animal skins, hides; trunks and travelling bags;\n                    umbrellas, parasols and walking sticks; whips, harness and saddlery”. For\n                    ease of comparison, we set out below the Application Mark and the two Appeal\n                    Marks:  Application Mark aboveT89/07704E (above)T89/07703G\n                (above)Appeal Marks above15     InThe Polo/Lauren Co, LP v\n                        Shop In Department Store Pte Ltd [2006] 2 SLR(R) 690\n                        (“Polo”), this court held (at\n                    [24]) that, for the purposes of determining similarity under s 27(2) of the\n                    TMA, one must look at the mark and the sign “as a whole”. In\n                    adopting this approach, this court inPolohad\n                    regard to the following opinion expressed by Parker J inIn the Matter of an Application by the Pianotist Company Ld for the\n                        Registration of a Trade Mark(1906) 23 RPC 774 at\n                    777:You must take the two words. You must judge of them, both by their look\n                        and by their sound. You must consider the goods to which they are to be\n                        applied. You must consider the nature and kind of customer who would be\n                        likely to buy those goods. In fact, you must consider all the surrounding\n                        circumstances; and you must further consider what is likely to happen if\n                        each of those trade marks is used in a normal way as a trade mark for the\n                        goods of the respective owners of the marks.16     While we recognised that the case ofPolowas concerned with the question of confusion\n                    relating to infringement under s 27(2) of the TMA, we were unable to see\n                    why the approach to be taken for determining confusion for purposes of\n                    opposition to a proposed registration under s 8(2) should be any different\n                    from that applicable to determine confusion under s 27(2). Moreover, and\n                    more importantly, the material words of the two provisions are\n                identical.17     We had examined closely the three marks which\n                    were in issue here (see depiction of the marks in[14]above). Each of the three marks consisted of a combination\n                    of word(s) and a design. The only thing which was identical in all the three\n                    marks was the word “valentino” but even there the font for the\n                    word “valentino” in all the three marks was different. As regards\n                    the design on each of the three marks, while the designs on the two Appeal Marks\n                    were identical, they were certainly quite different from the design on the\n                    Application Mark. The most one could say about all the three designs were that\n                    they were based on the letter “V”. Only to this very limited\n                    extent could it be said that there was any similarity between the design on the\n                    Application Mark and that on the Appeal Marks. In any event, looking at the\n                    three marks as a whole, we did not think that we could reasonably hold that the\n                    Application Mark was similar to the two Appeal Marks. Thus, the first\n                    requirement set out in[13]above had not\n                    been made out.18     Turning to the second requirement set out in[13], we noted that the Appeal Marks\n                    were registered in respect of Class 25 of the Nice Classification, whereas the\n                    Application Mark was in respect of Class 18. Thus, the Application Mark was not\n                    registered in respect of the same or similar goods as the Appeal Marks. To this\n                    extent, to proceed with this appeal relying on the Appeal Marks instead of the\n                    Relevant Marks (see [14] of the GD where the Relevant Marks were depicted), the\n                    Appellant appeared to have adopted a weaker case. Accordingly, the second\n                    requirement was also not satisfied.19     In the light of our observations in the last\n                    two paragraphs, we did not think there would be any likelihood of confusion on\n                    the part of the public if the Application Mark were to be registered. In this\n                    regard, the fact that the goods sold under the Appellant’s brand were\n                    up-market goods was not lost on us. The section of the public which would make\n                    purchases of the Appellant’s goods was likely to be a fairly discernible\n                    lot, and clearly not a moron in a hurry. Accordingly, the Appellant’s\n                    ground of objection to the registration of the Application Mark based on\n                    s 8(2) failed.The Bad Faith Issue: whether the respondent’s application to\n                register the Application Mark was made in bad faith pursuant to\n                s 7(6)20     We turn now to examine the second ground\n                    advanced by the Appellant to oppose the registration of the Application Mark.\n                    Section 7(6) reads as follows:A trade mark shall not be registered if or to the extent that the\n                        application is made in bad faith.Once bad faith is established, the application for registration of a\n                    mark must be refused even though the mark would not cause any confusion: seeRothmans of Pall Mall Ltd v Maycolson International\n                        Ltd[2006] 2 SLR(R) 551 (“Rothmans”) at [29] and Tan Tee Jim SC,Law of Trade Marks and Passing Off in Singapore(Sweet\n                    & Maxwell Asia, 2nd Ed, 2005) at para 5.71.21     As was noted by this court inWing Joo Loong Ginseng Hong (Singapore) Co Pte Ltd v Qinghai\n                        Xinyuan Foreign Trade Co Ltd and another and another appeal[2009] 2 SLR(R) 814 (“Wing Joo\n                    Loong”) at [33]:It is trite law that the legal burden of proof needed to substantiate an\n                        action for revocation and/or invalidation of the registration of a trade\n                        mark lies throughout on the plaintiff.As a preliminary observation, we noted that the Appellant here was not\n                    attempting toinvalidatethe registration of the\n                    Application Mark pursuant to s 7(6) read with s 23(1) of the TMA which\n                    was what the plaintiff inWing Joo Loongdid.\n                    Indeed, in the present case, the Appellant wasopposingthe registration of the Application Mark pursuant to\n                    s 7(6). In our view, whether it is a case of opposition to registration\n                    under s 7(6) or a case of invalidation under s 23 on the ground of bad\n                    faith, it seems to us that there should not be any difference as regards the\n                    burden of proof on bad faith in both scenarios. It is in line with common sense\n                    and logic that he who asserts must prove although, depending on the evidence\n                    tendered, the evidential burden could shift to the other side. The legal burden\n                    of proof required to substantiate a ground to oppose the registration of a trade\n                    mark remains throughout on the party making the application, and this would be\n                    the Appellant in the present case.22     To reiterate, s 7(6) provides that\n                    “[a] trade mark shall not be registered if or to the extent that the\n                    application is made in bad faith”. In opposing the registration of the\n                    Application Mark, the Appellant strenuously argued that the Judge had failed to\n                    apply the proper test to determine the question of bad faith and, as a\n                    consequence thereof, had failed to take into account or failed to give the\n                    proper weight to the following relevant matters in his consideration of the\n                    issue of bad faith:[note: 5](a)     the failure of the Respondent to\n                        explain how the name “Emilio Valentino” in the Application\n                        Mark had been derived;(b)     the failure of the Respondent to explain how the\n                        ““V” device” in the Application Mark had been\n                        derived;(c)     the\n                        failure of the Respondent to explain how the name in the Application Mark\n                        was identical to the name of a living person, Mr Emilio Valentino, who had\n                        also filed an application for the identical mark in Italy in respect of the\n                        same type of goods for which the Respondent was seeking registration in\n                        Singapore;(d)     the\n                        failure of the Respondent to explain how the ““V”\n                        device” and the positioning of the ““V”\n                        device” together with a bold line above the name in the Application\n                        Mark was identical to the mark of Mr Emilio Valentino;(e)     why the word “Italy” was\n                        being used in close proximity with the Application Mark in the course of\n                        trade and why the statement “Made by top-quality Italian, these\n                        shifts are designed by European masters” was being used in the\n                        Respondent’s advertising, when the goods bearing the Application Mark\n                        were in fact being made in China and there was no evidence of any connection\n                        with Italy either in the ownership, design or manufacture of the\n                        Respondent's goods bearing the Application Mark;(f)     that the right to apply and register\n                        the Application Mark in Singapore lay with another party, namely one Hor\n                        Soon Hong (“Hor”) trading as Impressions (lnt’l) Import\n                        & Export (“Impressions”), the Respondent’s former\n                        contract manufacturer and distributor, as it was the said Hor who had first\n                        used the Application Mark in Singapore, had first applied to register the\n                        Application Mark in Singapore (without any objection from the Respondent)\n                        and had claimed the goodwill and reputation in the Application Mark in\n                        Singapore, which therefore meant Hor could rightfully claim proprietorship\n                        to the Application Mark in Singapore in precedence over the Respondent;\n                        and(g)     the failure\n                        of the court to take into account all of the circumstances in considering\n                        whether there was bad faith, and in particular, that there had been no\n                        evidence or finding that the Application Mark or the elements therein were\n                        common in the marketplace in relation to goods in Class 18 of the Nice\n                        Classification such that there could have been a coincidence in the creation\n                        of the Application Mark and the identical mark by Mr Emilio\n                        Valentino.As we saw it, this list of objections could in\n                    fact be distilled into three contentions. We need only address two of the three\n                    contentions, namely the copying and lack of proprietorship issues. The third\n                    contention, namely the allegation that the Respondent had hijacked the\n                    Appellant’s Valentino Marks because the Application Mark contained the\n                    same word “Valentino”, was anon\n                        sequiturand had absolutely no merit and we do not think there is\n                    any further need to address it. This assertion would amount to saying that the\n                    Appellant had a proprietary claim to a common name such as\n                    “Valentino”.The applicable principles of law23     At the outset, we noted that the Appellant had\n                    correctly accepted that it had the onus to show whether the application to\n                    register the Application Mark was made in bad faith.[note: 6]24     The crucial question that remained was what\n                    was the appropriate test to apply to determine bad faith under s 7(6). The\n                    Appellant had submitted that the concept of “bad faith”\n                    encompassed conduct which might be morally wrong but not legally wrong. We will\n                    now embark on a brief survey of the case law on the issue.25     Numerous English and local cases have\n                    addressed the concept of “bad faith” under s 7(6). We will\n                    begin with the leading case ofGromax Plasticulture Ltd v Don\n                        & Low Nonwovens Ltd[1999] RPC 367 (“Gromax Plasticulture”), which dealt with the\n                    Trade Marks Act 1994 (c 26) (UK) and specifically s 3(6) thereof\n                    (which is the English equivalent of s 7(6)). InGromax\n                        Plasticulture, Lindsay J observed at 379 that:Plainly [bad faith] includes dishonesty and, as I would hold, [it]\n                        includes also some dealings which fall short of the standards of acceptable\n                        commercial behaviour observed by reasonable and experienced men in the\n                        particular area [of trade] being examined. Parliament has wisely not\n                        attempted to explain in detail what is or is not bad faith in this context;\n                        how far a dealing must so fall-short in order to amount to bad faith is a\n                        matter best left to be adjudged not by some paraphrase by the courts (which\n                        leads to the danger of the courts then construing not the Act but the\n                        paraphrase) but by reference to the words of the Act and upon a regard to\n                        all material surrounding circumstances.26     The above passage of Lindley J was\n                    referred to and accepted in the decision by Geoffrey Hobbs QC inDemon Ale Trade Mark[2000] RPC 345, where the\n                    latter stated that (at 356):… the expression “bad faith” hasmoralovertones which appear to make it possible for an\n                        application for registration to be rendered invalid under section 3(6) by\n                        behaviour which otherwiseinvolves no breach of any duty,\n                            obligation, prohibition or requirement that is legally binding upon the\n                            applicant. [emphasis added]27     In the later case ofHarrison v Teton Valley Trading Co Ltd[2004] 1 WLR 2577, a\n                    decision of the English Court of Appeal, Sir William Aldous said (at [24]\n                    and [26]):24    Clearly the court, when considering bad faith,\n                            cannot apply a purely subjective test, called by Lord Hutton “the\n                            Robin Hood test”. The dishonest person or one with low standards\n                            cannot be permitted to obtain trade mark registrations in circumstances\n                            where a person abiding by a reasonable standard would not. The\n                            registration of a trade mark is designed to enable bona fide proprietors\n                            to protect their proprietary rights without having to prove unfair\n                            trading. Registration is not provided to help those with low moral\n                            standards.…26    For my part, I would accept the reasoning of Lord\n                            Hutton as applying to considerations of bad faith. The words “bad\n                            faith” suggest a mental state. Clearly when considering the\n                            question of whether an application to register is made in bad faith all\n                            the circumstances will be relevant. However the court must decide\n                            whether the knowledge of the applicant was such that his decision to\n                            apply for registration would be regarded as in bad faith by persons\n                            adopting proper standards.The other two members of the quorum concurred with these views of\n                    Sir William Aldous.28     Turning to the local case law, inRothmans, our High Court endorsed Lindsay J’s\n                    observations of the concept of bad faith inGromax\n                        Plasticulture. Further, both Lindsay J’s and Geoffrey\n                    Hobbs QC’s approaches were again adopted by another High Court judge\n                    inWeir Warman Ltd v Research & Development Pty\n                        Ltd[2007] 2 SLR(R) 1073 (“Warman”) where the judge stated at [48] that:… the term ‘bad faith’ embraces not only actual\n                        dishonesty but also dealings which would be considered as commercially\n                        unacceptable by reasonable and experienced persons in a particular trade,\n                        even though such dealings may otherwise involve “no breach of any\n                        duty, obligation, prohibition or requirement that is legally binding”\n                        upon the registrant of the trade mark …29     InWing Joo\n                        Loong, this court observed at [105] that “[t]hetestfor determining the presence of bad faith, in the\n                    context of the English Trade Marks Act, was settled by the English Court of\n                    Appeal” [emphasis in original]. It would be useful to set out in full the\n                    observations of this court at [105]–[106] which are as follows:105    Thetestfor determining the presence of bad faith,\n                            in the context of the English Trade Marks Act, was settled by the\n                            English Court of Appeal inHarrison v Teton Valley\n                                Trading Co Ltd[2004] 1WLR 2577, where Sir William\n                            Aldous, with whom Arden and Pill LJJ agreed, expressed the test as\n                            follows (at [26]):The words ‘bad faith’ suggest a mental state. Clearly when\n                            considering the question of whether an application to register is made\n                            in bad faith all the circumstances will be relevant. However the court\n                            must decide whether the knowledge of the applicant was such that his\n                            decision to apply for registration would be regarded as [being] in bad\n                            faith by persons adopting proper standards.This test, which was referred to by Sir Aldous (idat [25]) as the “combined” test of bad\n                        faith, contains both a subjective element (viz, what the particular applicant knows) and an objective\n                        element (viz, what ordinary persons adopting\n                        proper standards would think).106    Recently, this\n                            combined test of bad faith was succinctly explained inAjit Weekly Trade Mark[2006] RPC 25 as\n                            follows (at [35] and [41]):35    … Bad faith is to be judged according to\n                                the combined test of dishonesty for accessory liability [for] breach\n                                of trust set out by the majority of the House of Lords inTwinsectra Ltd v Yardley[2002] 2 A.C. 164,\n                                withGromax Plasticulture[([103]supra)] … providing the\n                                appropriate standard namely, acceptable commercial behaviour\n                                observed by reasonable and experienced persons in the particular\n                                commercial area being examined.…41    … [T]he upshot of the Privy\n                                [Council’s] decision in [Barlow Clowes\n                                    International Ltd v Eurotrust International Ltd[2006] 1 WLR 1476] is: (a) to confirm the House of\n                                Lords’ test for dishonesty applied inTwinsectra, i.e. the combined test; and (b) to\n                                resolve any ambiguity in the majority of their Lordships’\n                                statement of that test by making it clear that an enquiry into a\n                                defendant’s views as regards normal standards of honesty is\n                                not part of the test. The subjective element of the test means that\n                                the tribunal must ascertain what the defendant knew about the\n                                transaction or other matters in question. It must then be decided\n                                whether in the light of that knowledge, the defendant’s\n                                conduct is dishonest judged by ordinary standards of honest people,\n                                the defendant’s own standards of honesty being irrelevant to\n                                the objective element …This court inWing Joo\n                        Loongthen applied at [107]–[117] the combined test of bad\n                    faith which, to reiterate, contains both a subjective element (viz, what the particular applicant knows) and an\n                    objective element (viz, what ordinary persons\n                    adopting proper standards would think). It is therefore apparent to us that bad\n                    faith as a concept is context-dependent. In the final analysis, whether bad\n                    faith exists or not hinges on the specific factual matrix of each\n                case.30     Furthermore, it is pertinent to note that an\n                    allegation of bad faith is a serious claim to make and it must be sufficiently\n                    supported by the evidence (see Nautical Concept Pte Ltd v Jeffery Mark Richard\n                    and another [2007] 1 SLR(R) 1071 at [15] which we reproduce below):An allegation that a trade mark has been applied for in bad\n                        faith is a serious one. InRoyal Enfield Trade\n                            Marks[2002] RPC 508, it was held (at [31]) that:A plea of fraud should not be lightly made … and if made should\n                            bedistinctly alleged and distinctly proved. It is not\n                                permissible to leave fraud to be inferred from the facts(seeDavy v. Garett[1878] 7 Ch.D. 473 at\n                            489). In my judgment precisely the same considerations apply to an\n                            allegation of … bad faith made under section 3(6) [of the UK\n                            Trade Marks Act 1994].It should not be made unless it can be\n                                fully and properly pleaded and should not be upheld unless it is\n                                distinctly proved and this will rarely be possible by a process of\n                                inference.[original emphasis omitted; emphasis added]This principle of law was alluded to and accepted by a leading local\n                    text on Intellectual Property (Ng-Loy Wee Loon,Law of Intellectual\n                        Property of Singapore(Sweet & Maxwell Asia, Rev Ed, 2009) at\n                    para 21.4.1):An allegation of bad faith is a serious one, and it must be fully and\n                        properly pleaded and should not be upheld unless it is distinctly proved and\n                        this willrarely be possible by a process of inference.\n                        [emphasis added]The question, therefore, was whether this appeal was such a case where\n                    bad faith could be proven especially by way of aninference. We turn now to apply the above principles to the facts of\n                    the present appeal.Application of the law to the facts31     The Appellant’s case on bad faith\n                    revolved around two main contentions. The first was that the Respondent had\n                    copied the Application Mark from the trademark of one Mr Emilio Valentino.\n                    The second was that the proprietorship of the Application Mark in Singapore did\n                    not belong to the Respondent. Applying the combined test of bad faith (alluded\n                    to in[25]–[29]above), in order for the Appellant to succeed in opposing\n                    the registration of the Application Mark, it must show, not only that the\n                    conduct of the Respondent in applying for the registration of the Application\n                    Mark fell short of the normally accepted standards of commercial behaviour, but\n                    also that the Respondent knew of facts which, to an ordinary person, would have\n                    made the latter realise that what it was doing would be regarded as breaching\n                    those standards.32     On the first contention, what the Appellant\n                    had proven was that Mr Emilio Valentino had attempted to register a trade\n                    mark (“the EV Mark”) in Italy in 2007 which was identical to the\n                    Application Mark[note: 7]. This fact was not disputed. It was also not\n                    disputed that there was no connection between Mr Emilio Valentino and the\n                    Respondent. Significantly, there was also no evidence before this court that the\n                    Respondent, in deriving the Application Mark, had copied the EV Mark. Indeed,\n                    the Respondent claimed to have used the Application Mark from around\n                        1995,[note: 8]well before\n                    Mr Emilio Valentino attempted to register the EV Mark in Italy.[note: 9]33     On these facts, the point which the Appellant\n                    attempted to make was that since the Application Mark was identical with the EV\n                    mark, it would naturally follow that the Respondent had copied the Application\n                    Mark from the EV Mark. Accordingly, the Appellant argued that the burden would\n                    shift to the Respondent to show how the Application Mark was derived and in turn\n                    to explain how did it come about that the Application Mark was identical with\n                    the EV Mark. In this regard, the Appellant relied on cases such asAuvi Pte Ltd v Seah Siew Tee and another[1991]\n                    2 SLR(R) 786 (“Auvi Pte Ltd”)\n                    andIn the Matter of Trade Mark Application No 2011973\n                        by Team Lotus Ventures Ltd and In the Matter of Opposition Thereto under\n                        Opposition No 45584 by Group Lotus Ltd. What was vitally\n                    pertinent to note, and this was totally cast aside by the Appellant, was that\n                    there was no evidence before the court showing that Mr Emilio Valentino had used\n                    the EV Mark before 2007. While it might well bepossible(and we put it no higher than that) that Mr Emilio\n                    Valentino had used the EV Mark before 2007, nothing was produced before the\n                    court which could reasonably enable the court to draw such an inference or make\n                    a definite decision. Indeed, as the Judge aptly observed at [71] of the GD,\n                    there was no evidence “that Mr Emilio Valentino has been using [the\n                    EV Mark] prior to the Respondent”. It was just as possible that the EV\n                    Mark was copied by Mr Emilio Valentino from the Application Mark of the\n                    Respondent. In these circumstances, there was noprima\n                        faciecase for the Respondent to rebut. Neither had any\n                    evidential burden shifted to the Respondent.34     What was clear was that the facts of the\n                    present case were quite different from those inApplication\n                        by Brown Shoe Company Inc for Rectification of the Register in Respect of\n                        Trade Mark No B720,262[1959] RPC 29 which involved two word\n                    marks, “Naturalizer” and “Naturlizet”, and where the\n                    owner of the former mark successfully had the Register rectified by having the\n                    latter mark removed from the Register. There, the mark\n                    “Naturalizer” was extensively advertised by its owner in American\n                    periodicals before the application to register the mark\n                    “Naturlizet” was made. The judge held that there was copying on\n                    the part of the party obtaining registration for the “Naturlizet”\n                    mark. Similarly, inAuvi Pte Ltd, there was clear\n                    evidence that the logo of the plaintiff was in existence well before the\n                    defendants’ mark. In view of the close similarity between the logo and the\n                    mark and the other evidence presented, the plaintiff satisfied the court that\n                    there was copying on the part of the defendants. Accordingly, the court expunged\n                    the defendants’ mark from the Register. Ultimately, it is our view that\n                    each case would have to be decided in accordance with its own facts, and in\n                    particular, the evidence tendered.35     It was true that the EV Mark incorporated the\n                    name of Mr Emilio Valentino. That fact could notper\n                        sesuggest anything and certainly could not suggest that the\n                    Respondent had copied the Application Mark from the EV Mark. However, although\n                    no evidential burden arose for the Respondent, the latter nevertheless (through\n                    one Mr Ng Yeo Tiong) claimed that it was one Ms Diana Taylor\n                    (“Ms Taylor”), the President of the Respondent, who created\n                    the Application Mark independently.[note: 10]This assertion was\n                    certainly hearsay and it should have been made by Ms Taylor herself. Thus,\n                    it came as no surprise that the Appellant took issue with this assertion. This\n                    challenge was not lost on the Judge who observed, at [68] of the GD,\n                    that:[T]he Respondent had not called [Ms Taylor] to testify to the originality\n                        of her design nor produced further evidence that it did not copy [the EV\n                        Mark] or suggested that the identity between the Application Mark and [the\n                        EV Mark] is a mere coincidence …36     As a result, the Appellant submitted that an\n                    adverse inference should have been drawn against the Respondent pursuant to\n                        illustration (g) of s 116 of the\n                    Evidence Act (Cap 97, 1997 Rev Ed). But as we have stated above at[33], the Appellant had failed to even\n                    make out aprima faciecase of bad faith and so\n                    the burden of disproving any element of bad faith on the part of the Respondent\n                    did not arise. No adverse inference should, in the circumstances, be drawn\n                    against the Respondent or, more accurately, we should say that in the light of\n                    what was before the court there was nothing for the Respondent to rebut. We\n                    noted that the Judge at [70] of the GD remarked that the Respondent had failed\n                    to provide any credible evidence regarding the derivation of the Application\n                    Mark. We had no quarrel with that remark which was correct. However, the primary\n                    burden of showing aprima faciecase of bad faith\n                    rested with the Appellant. As the Appellant had failed to discharge that burden,\n                    the omission on the part of the Respondent to show how it derived the\n                    Application Mark was wholly immaterial.37     Turning to the second contention regarding the\n                    proprietorship of the Application Mark in Singapore, the Appellant’s case\n                    on this point centred on its averment that it was Hor (the Respondent’s\n                    former distributor (see[22]above)), and\n                    not the Respondent, who owned the goodwill and reputation in the Application\n                    Mark. Consequently, the Respondent had no right to register the Application\n                    Mark. We noted, at this juncture, that the Respondent conceded that it\n                        was[note: 11]:… the first to use the Application Mark in Singapore,albeit through a distributor, namely [Hor].\n                        [emphasis added]38     In this regard, it is useful to refer to the\n                    court’s illuminating remarks inWarmanat\n                    [49]:In the present case, it is common ground that the key issue in the\n                        determination of bad faith pivots around the fulcrum of proprietorship of\n                        the “Warman” mark in Singapore. It appears to me to be an\n                        incontrovertible proposition that if a registrant of a trade mark has\n                        proprietorship of that trade mark, or at the very least, theright to registerthat trade mark, then such\n                        registration of the trade mark should fall well within the standards of\n                        acceptable commercial behaviour observed by reasonable and experienced\n                        persons in the particular trade. Conversely, where it can be shown that the\n                        applicant knew of anexclusiveproprietary\n                        right ofanotherin relation to the trade mark\n                        it seeks to furtively register, then any such registration would, almost\n                        invariably, quite clearly fall short of the relevant standards. As such, it\n                        is important to first examine and determine the issue of proprietorship.\n                        [emphasis in original]39     To substantiate its allegation that the\n                    Respondent had no right to register the Application Mark, the Appellant relied\n                    solely on an affidavit filed by Hor in Criminal Motion No 6 of 2004 in the\n                    High Court to set aside two search warrants issued at the instance of the\n                    Appellant. It is necessary that we now set out the background as to how Hor, and\n                    his sole proprietorship, Impressions, became involved in the use of the\n                    Application Mark in Singapore.40     By way of a “Letter of\n                        Authorization”[note: 12]which took effect from\n                    1 June 1997, the Respondent authorised one Jack Lee (“Jack”)\n                    of Geveni International Co Ltd (“Geveni”) of Taiwan to be its\n                    exclusive agent in the Asian markets for a duration of 10 years from 1 June\n                    1997 to 31 May 2007. Pursuant to that Letter of Authorization, Geveni was\n                    given “the full right to use Emilio Valentino’s original logo,\n                    trademark and ability of production supervision in the area of People of\n                    Republic of China, Taiwan, Japan, Korea, Philippine [sic], Vietnam, Malasia [sic],\n                    Thiland [sic], Indonesia and\n                        Singapore.”[note: 13]41     Jack, in turn, approached Hor with a view to\n                    roping Hor into the business of manufacturing the Emilio Valentino range of\n                    apparel. To that end, a “Certificate of Authorization”[note: 14]stated that\n                    Genevi, which was the “exclusive agent for Emilio Valentino of Italy in\n                    all of the Asia with legal representation of English and Chinese logos”,\n                    granted the right to Impressions “[t]o be the legal representation anddistributionandmanufacturingagent [in] the above mentioned\n                        areas”[note: 15][emphasis added]. This Certificate of\n                    Authorization specifically stated that “[t]erritories”[note: 16]comprised of\n                    Singapore, Malaysia and Indonesia. The Certificate of Authorization took effect\n                    from 1 February 2002 to 31 May 2007.42     Hor was the sole proprietor of Impressions\n                    which was registered in 2001 and was engaged in the clothing business. It was\n                    common ground that Hor was the Respondent’s distributor in Singapore since\n                    2002. It was also the Respondent’s evidence that it had used the\n                    Application Mark since 1995.[note: 17]43     In Hor’s affidavit, he claimed that he\n                    had obtained the right to distribute and manufacture Emilio Valentino products\n                    from Geveni. This affidavit was filed by Hor after a complaint was made by the\n                    Appellant’s representative in Singapore that Impressions had committed\n                    offences under s 49 of the TMA. Hence, the Respondent argued (rightly in\n                    our view) that:[note: 18]… Hor’s claim of ownership of the goodwill and reputation of\n                        the Application Mark in Singapore was made in the context of a distribution\n                        and manufacturing agreement and in the context of denying that he had\n                        employed a false trade description.The sole purpose of Hor’s affidavit was to defend the\n                    allegations that he had,inter alia, employed a\n                    false trade description. In any event, Hor’s claim of ownership of the\n                    goodwill and reputation of the Application Mark in Singapore was made in the\n                    context of the Certificate of Authorization which, as noted above, provided that\n                    Impressions had the right to manufacture and distribute the Respondent’s\n                    goods bearing the Application Mark.44     In the light of the foregoing arrangements\n                    between the respondent and Genevi and in turn between Genevi and Hor, we noted\n                    that while Hor was the first person to seek to register in Singapore a mark\n                    which was identical with the Application Mark on 3 June 2003, it did not,\n                    however, thereby follow that the Respondent’s registration of the\n                    Application Mark was done in bad faith. Indeed, the Respondent, in any event,\n                    had at least theright to registerthe Application\n                    Mark (seeWarmanat [49], quoted at[38]above). We would further add that Hor\n                    eventually abandoned his application to register the mark.45     We now turn to address the Appellant’s\n                    assertion that there wasnotrade mark\n                    licensor-licensee relationship between the Respondent and Hor. It was our view\n                    that this assertion was a bare assertion which was contrary to documentary\n                    evidence. As noted by the High Court inWarmanat\n                    [63], “[o]ne instance of a right to sell under a trade mark being\n                    divorced from a right to protect that mark by way of trade mark registration is\n                    in the case of a trade mark licensee.” Further, the High Court there\n                    observed at [64]–[68] that:64    The test for the\n                            validity of a trade mark licence was set out inRainforest Coffee Products Pte Ltd v Rainforest Cafe,\n                                Inc[2000] 1 SLR(R) 725 where Lai Kew Chai J\n                            (at [33]), in delivering the judgment of the Court of Appeal, endorsed\n                            the English decision inBOSTITCH Trade\n                                Mark[1963] RPC 183 at 567:The key to the validity of a trade mark licence was whether or not the\n                            licence arrangement had destroyed the trade connection between the\n                            proprietor of the trade mark and the goods …Therefore, for there to be a valid trade mark licence between parties,\n                        there must be a trade connection between the purported proprietor of the\n                        trade mark (allegedly the plaintiff, in this case) and the goods ultimately\n                        sold under the mark by the licensee (the defendant’s goods, in this\n                        case).65    In the commentary of\n                            the TMA by Mr M Ravindran inButterworths’ Singapore Statutes–Intellectual Property(Butterworths, 2002)\n                            (“theButterworths’\n                            Statutes”), it is stated that whether the proprietor\n                            has any trade connection with the goods or services in question is\n                            ultimately a question of fact. Mr Ravindran, coincidentally the\n                            counsel for the plaintiff in the present case, explains in the\n                            commentary at p 126:if the proprietor does not in fact exercise control or supervise the\n                            use of his registered trade mark (notwithstanding provisions which allow\n                            him to do so), there is no trade connection between him and the goods or\n                            services for which the mark has been registered.It appears to be trite law that to establish the requisite trade\n                        connection for a valid trade mark licence, there must be at leastsomecontrol or supervision of the use of the trade\n                        mark by the purported licensee.66    The same view has been adopted inTan Tee Jim([48]supra) at p 216 in relation to the licensing of\n                            unregistered trade marks. The learned author is of the view that such\n                            licence is valid only if there is a quality control relationship between\n                            the licensor and the goods or services in question.67    The leading treatise of Wilkof and Burkitt,Trade Mark Licensing(Sweet &\n                            Maxwell, 2nd Ed, 2005) at p 252, notes that the approach in\n                            the United States of America with respect to implied licences emphasises\n                            that evidence of control is necessary for an implied trade mark licence.\n                            The authors cite the American case ofVillanova\n                                University v Villanova Alumni Educational Foundation, Inc123 F Supp 2d 293, for the proposition that the existence of\n                            an implied trade mark licence requires evidence that permission was\n                            given to use the mark, coupled with an exercise of reasonable control\n                            over such use. This requirement is assessed by the objective conduct of\n                            the parties. This seems sensible.68    Both from precedent and logic, I conclude that a\n                            trade mark licence arrangement between the plaintiff and the defendant\n                            may only be established if theplaintiff exerts some\n                                manner or form of control or supervision over the defendant’s\n                                goods…[emphasis in original in italics; emphasis added in bold italics]46     From the “Legal\n                        Contract”[note: 19]between Geveni (who as mentioned\n                    above was the exclusive agent for Emilio Valentino of Italy in Asia) and\n                    Impressions, of which the first, third, fourth, and fifth clauses were of\n                    relevance, we noted that there was indeed a trade connection between Geveni and\n                    Impressions’ goods. These clauses in that document read as\n                        follows[note: 20]:1.   LogoParty A [ie, Geveni] authorized Party B\n                            [ie, Impressions] to be the manufacturer\n                        and distributor and sales and marketer of the items as stated above.The styles of the fashions should get the approval\n                            from Party A [ie, Geveni] to use the logo of Emilio Valentino before it\n                            is to be distributed to the markets.2.   …3.   Keeping of the ReputationParty B [ie, Impressions] should try in\n                        every effort to keep Emilio Valentino in good and reputable images and\n                        meanwhile it is necessary to improve and update the design and quality\n                        regularly.4.   DistributionParty B [ie, Impressions] should maintain\n                        the distribution channels positioning in the middle to high-end markets. In\n                        any situation, Emilio Valentino should not become the low end or street\n                        vendor markets.5.   Origin of DesignParty B [ie, Impressions] is fully\n                        responsible for the designs, material selections, manufacturing and color\n                        matching, furthermore the final designs of all products should send to Party\n                        A [ie, Geveni] for record keeping. All of the\n                        designs should not violate the third party’s designs and legal rights.\n                        In the event of default, Party B [ie,\n                        Impressions] will be responsible for its own legal action.[Emphasis added]It was clear that the above clauses reserved unto Geveni the right to\n                    exercise control and supervision on the use by Impressions of the Application\n                    Mark. The Respondent’s control and supervision over Geveni was in turn\n                    provided for in the Letter of Authorisation[note: 21](see[40]above). There was nothing to suggest that\n                    control and supervision was, in fact, not exercised by the Respondent over\n                    Impressions through Genevi. No evidence was adduced by the Appellant to\n                    contradict what was set out in the Legal Contract. As noted by the Judge, a bare\n                    assertion by the Appellant that “there was no evidence of control or\n                    supervision by the Respondent over [Hor]” (the GD at [57]) could not\n                    suffice to prove that there was indeed no control exercised by the Respondent\n                    over the use of the Application Mark. The legal documents set out the rights and\n                    obligations of the parties and it would be reasonable to assume, unless proven\n                    otherwise, that the parties would, and had, observed the terms agreed upon. We\n                    would reiterate that if the Appellant alleged that there wasnosuch control, the burden of proof must surely be on the\n                    Appellant to prove exactly that. The latter had wholly failed to do so. Thus,\n                    there was nothing to show bad faith on the part of the Respondent in seeking the\n                    registration of the Application Mark. As mentioned in[30]above, an allegation of bad faith is a serious matter and\n                    ought not to be lightly inferred.47     Before we conclude this judgment, we would\n                    like to make two observations. First, the Appellant vigorously\n                        argued[note: 22]that the PAR had failed to\n                    consider the provisions of r 14 of the Trade Mark Rules (Cap 322, R 1,\n                    2008 Rev Ed) which provides as follows:Persons living or recently dead14. —(1) Where the name or representation of any person\n                        appears on a trade mark which is the subject of an application for\n                        registration, the Registrarmay, before\n                        proceeding to register the mark, require the applicant to furnish the\n                        Registrar with the consent of the person or, in the case of a person\n                        recently dead, of his legal representatives.(2) Where the consent referred to in paragraph (1) is not\n                        furnished within the time specified by the Registrar and the applicant\n                        fails to satisfy the Registrar that it is impossible or impracticable\n                        in the circumstances of the case to obtain the consent, the Registrar\n                        shall refuse to register the mark.[Emphasis added]The Appellant agreed that the requirement under r 14(1) was\n                    entirely discretionary. However, it submitted that:[note: 23]… in order for the RTM [ie, the\n                        Registry of Trade Marks] to decide whether to exercise its discretionary\n                        power, it had to have the relevant facts before it. The RTM had to be told\n                        the derivation of the Application Mark for it to then decide if consent was\n                        necessary.We, however, were unable to agree with the Appellant. The primary\n                    burden of showing aprima faciecase of bad faith\n                    rested solely with the Appellant. In the present case, the Appellant had clearly\n                    failed to discharge this burden. There was, therefore, no room for the Appellant\n                    to argue that the Registry of Trade Marks ought to have exercised its discretion\n                    under r 14(1) in the present case to require the Respondent to furnish\n                    proof of the consent of Mr Emilio Valentino.48     Secondly, we found it strange that the\n                    Appellant should choose to argue that the Respondent’s application to\n                    register the Application Mark was made in bad faith pursuant to s 7(6) when\n                    the very persons who should know best, whether there was a case to object on\n                    that ground, would be either Mr Emilio Valentino or Hor (or both) and\n                    neither of them had raised any such objection. In order to establish aprima faciecase, the Appellant should, at the very\n                    least, obtain direct evidence from either Mr Emilio Valentino or Hor, or\n                    both, to show either there was copying on the part of the Respondent and/or that\n                    the goodwill in the Application Mark did not vest in the Respondent (this would\n                    be on the assumption that Hor could explain away the position set out in the\n                    Legal Contract (see[46]above)).\n                    Presumably, the Appellant could not persuade Mr Emilio Valentino or Hor to do\n                    any of these things. As explained above at[39]and[43], the affidavit\n                    filed by Hor was for an entirely different purpose. In the premises, the\n                    Appellant had no basis whatsoever to bring an action to oppose the registration\n                    of the Application Mark on the ground of bad faith.Conclusion49     In conclusion, it was clear to us that the\n                    Appellant had no valid reasons to object to the registration of the Application\n                    Mark. What the Appellant sought to acquire, which it was not entitled to, was a\n                    monopoly over the use of a common name, “Valentino”. In the\n                    result, we dismissed the appeal with costs and the usual consequential\n                    orders.[note: 1]The range of\n                                the Valentino Marks can be found at Annex A of the Appellant’s\n                                Case (“AC”).[note: 2]See Core\n                                Bundle (“CB”) Vol II at p\n                        130.[note: 3]CB Vol II at\n                                pp 135–136.[note: 4]See AC at para\n                                259.[note: 5]AC at para\n                    12.[note: 6]AC at para 17.[note: 7]See CB Vol II at p\n                        178.[note: 8]Respondent’s Case (“RC”) at para\n                                45; see also CB Vol II at p 59.[note: 9]See CB Vol II at p\n                178.[note: 10]See CB Vol\n                                II at pp 97–100.[note: 11]RC at para 90.[note: 12]CB Vol II\n                                at pp 59–60.[note: 13]CB Vol II at p\n                        59[note: 14]CB Vol II at p 61.[note: 15]CB Vol II at p\n                        61.[note: 16]CB Vol II at p 61.[note: 17]See CB Vol\n                                II at p 59.[note: 18]RC at para\n                        97.[note: 19]CB Vol II at pp\n                            63–65.[note: 20]CB Vol II at pp\n                            63–64.[note: 21]CB Vol II\n                                at pp 59–60.[note: 22]See AC at pp\n                            79–87.[note: 23]AC at para 172.",
        "The Bad Faith Issue: whether the respondent’s application to\n                register the Application Mark was made in bad faith pursuant to\n                s 7(6)": "20     We turn now to examine the second ground\n                    advanced by the Appellant to oppose the registration of the Application Mark.\n                    Section 7(6) reads as follows: A trade mark shall not be registered if or to the extent that the\n                        application is made in bad faith. Once bad faith is established, the application for registration of a\n                    mark must be refused even though the mark would not cause any confusion: seeRothmans of Pall Mall Ltd v Maycolson International\n                        Ltd[2006] 2 SLR(R) 551 (“Rothmans”) at [29] and Tan Tee Jim SC,Law of Trade Marks and Passing Off in Singapore(Sweet\n                    & Maxwell Asia, 2nd Ed, 2005) at para 5.71. 21     As was noted by this court inWing Joo Loong Ginseng Hong (Singapore) Co Pte Ltd v Qinghai\n                        Xinyuan Foreign Trade Co Ltd and another and another appeal[2009] 2 SLR(R) 814 (“Wing Joo\n                    Loong”) at [33]: It is trite law that the legal burden of proof needed to substantiate an\n                        action for revocation and/or invalidation of the registration of a trade\n                        mark lies throughout on the plaintiff. As a preliminary observation, we noted that the Appellant here was not\n                    attempting toinvalidatethe registration of the\n                    Application Mark pursuant to s 7(6) read with s 23(1) of the TMA which\n                    was what the plaintiff inWing Joo Loongdid.\n                    Indeed, in the present case, the Appellant wasopposingthe registration of the Application Mark pursuant to\n                    s 7(6). In our view, whether it is a case of opposition to registration\n                    under s 7(6) or a case of invalidation under s 23 on the ground of bad\n                    faith, it seems to us that there should not be any difference as regards the\n                    burden of proof on bad faith in both scenarios. It is in line with common sense\n                    and logic that he who asserts must prove although, depending on the evidence\n                    tendered, the evidential burden could shift to the other side. The legal burden\n                    of proof required to substantiate a ground to oppose the registration of a trade\n                    mark remains throughout on the party making the application, and this would be\n                    the Appellant in the present case. 22     To reiterate, s 7(6) provides that\n                    “[a] trade mark shall not be registered if or to the extent that the\n                    application is made in bad faith”. In opposing the registration of the\n                    Application Mark, the Appellant strenuously argued that the Judge had failed to\n                    apply the proper test to determine the question of bad faith and, as a\n                    consequence thereof, had failed to take into account or failed to give the\n                    proper weight to the following relevant matters in his consideration of the\n                    issue of bad faith:[note: 5] (a)     the failure of the Respondent to\n                        explain how the name “Emilio Valentino” in the Application\n                        Mark had been derived; (b)     the failure of the Respondent to explain how the\n                        ““V” device” in the Application Mark had been\n                        derived; (c)     the\n                        failure of the Respondent to explain how the name in the Application Mark\n                        was identical to the name of a living person, Mr Emilio Valentino, who had\n                        also filed an application for the identical mark in Italy in respect of the\n                        same type of goods for which the Respondent was seeking registration in\n                        Singapore; (d)     the\n                        failure of the Respondent to explain how the ““V”\n                        device” and the positioning of the ““V”\n                        device” together with a bold line above the name in the Application\n                        Mark was identical to the mark of Mr Emilio Valentino; (e)     why the word “Italy” was\n                        being used in close proximity with the Application Mark in the course of\n                        trade and why the statement “Made by top-quality Italian, these\n                        shifts are designed by European masters” was being used in the\n                        Respondent’s advertising, when the goods bearing the Application Mark\n                        were in fact being made in China and there was no evidence of any connection\n                        with Italy either in the ownership, design or manufacture of the\n                        Respondent's goods bearing the Application Mark; (f)     that the right to apply and register\n                        the Application Mark in Singapore lay with another party, namely one Hor\n                        Soon Hong (“Hor”) trading as Impressions (lnt’l) Import\n                        & Export (“Impressions”), the Respondent’s former\n                        contract manufacturer and distributor, as it was the said Hor who had first\n                        used the Application Mark in Singapore, had first applied to register the\n                        Application Mark in Singapore (without any objection from the Respondent)\n                        and had claimed the goodwill and reputation in the Application Mark in\n                        Singapore, which therefore meant Hor could rightfully claim proprietorship\n                        to the Application Mark in Singapore in precedence over the Respondent;\n                        and (g)     the failure\n                        of the court to take into account all of the circumstances in considering\n                        whether there was bad faith, and in particular, that there had been no\n                        evidence or finding that the Application Mark or the elements therein were\n                        common in the marketplace in relation to goods in Class 18 of the Nice\n                        Classification such that there could have been a coincidence in the creation\n                        of the Application Mark and the identical mark by Mr Emilio\n                        Valentino. As we saw it, this list of objections could in\n                    fact be distilled into three contentions. We need only address two of the three\n                    contentions, namely the copying and lack of proprietorship issues. The third\n                    contention, namely the allegation that the Respondent had hijacked the\n                    Appellant’s Valentino Marks because the Application Mark contained the\n                    same word “Valentino”, was anon\n                        sequiturand had absolutely no merit and we do not think there is\n                    any further need to address it. This assertion would amount to saying that the\n                    Appellant had a proprietary claim to a common name such as\n                    “Valentino”.",
        "The applicable principles of law": "23     At the outset, we noted that the Appellant had\n                    correctly accepted that it had the onus to show whether the application to\n                    register the Application Mark was made in bad faith.[note: 6] 24     The crucial question that remained was what\n                    was the appropriate test to apply to determine bad faith under s 7(6). The\n                    Appellant had submitted that the concept of “bad faith”\n                    encompassed conduct which might be morally wrong but not legally wrong. We will\n                    now embark on a brief survey of the case law on the issue. 25     Numerous English and local cases have\n                    addressed the concept of “bad faith” under s 7(6). We will\n                    begin with the leading case ofGromax Plasticulture Ltd v Don\n                        & Low Nonwovens Ltd[1999] RPC 367 (“Gromax Plasticulture”), which dealt with the\n                    Trade Marks Act 1994 (c 26) (UK) and specifically s 3(6) thereof\n                    (which is the English equivalent of s 7(6)). InGromax\n                        Plasticulture, Lindsay J observed at 379 that: Plainly [bad faith] includes dishonesty and, as I would hold, [it]\n                        includes also some dealings which fall short of the standards of acceptable\n                        commercial behaviour observed by reasonable and experienced men in the\n                        particular area [of trade] being examined. Parliament has wisely not\n                        attempted to explain in detail what is or is not bad faith in this context;\n                        how far a dealing must so fall-short in order to amount to bad faith is a\n                        matter best left to be adjudged not by some paraphrase by the courts (which\n                        leads to the danger of the courts then construing not the Act but the\n                        paraphrase) but by reference to the words of the Act and upon a regard to\n                        all material surrounding circumstances. 26     The above passage of Lindley J was\n                    referred to and accepted in the decision by Geoffrey Hobbs QC inDemon Ale Trade Mark[2000] RPC 345, where the\n                    latter stated that (at 356): … the expression “bad faith” hasmoralovertones which appear to make it possible for an\n                        application for registration to be rendered invalid under section 3(6) by\n                        behaviour which otherwiseinvolves no breach of any duty,\n                            obligation, prohibition or requirement that is legally binding upon the\n                            applicant. [emphasis added] 27     In the later case ofHarrison v Teton Valley Trading Co Ltd[2004] 1 WLR 2577, a\n                    decision of the English Court of Appeal, Sir William Aldous said (at [24]\n                    and [26]): 24    Clearly the court, when considering bad faith,\n                            cannot apply a purely subjective test, called by Lord Hutton “the\n                            Robin Hood test”. The dishonest person or one with low standards\n                            cannot be permitted to obtain trade mark registrations in circumstances\n                            where a person abiding by a reasonable standard would not. The\n                            registration of a trade mark is designed to enable bona fide proprietors\n                            to protect their proprietary rights without having to prove unfair\n                            trading. Registration is not provided to help those with low moral\n                            standards. … 26    For my part, I would accept the reasoning of Lord\n                            Hutton as applying to considerations of bad faith. The words “bad\n                            faith” suggest a mental state. Clearly when considering the\n                            question of whether an application to register is made in bad faith all\n                            the circumstances will be relevant. However the court must decide\n                            whether the knowledge of the applicant was such that his decision to\n                            apply for registration would be regarded as in bad faith by persons\n                            adopting proper standards. The other two members of the quorum concurred with these views of\n                    Sir William Aldous. 28     Turning to the local case law, inRothmans, our High Court endorsed Lindsay J’s\n                    observations of the concept of bad faith inGromax\n                        Plasticulture. Further, both Lindsay J’s and Geoffrey\n                    Hobbs QC’s approaches were again adopted by another High Court judge\n                    inWeir Warman Ltd v Research & Development Pty\n                        Ltd[2007] 2 SLR(R) 1073 (“Warman”) where the judge stated at [48] that: … the term ‘bad faith’ embraces not only actual\n                        dishonesty but also dealings which would be considered as commercially\n                        unacceptable by reasonable and experienced persons in a particular trade,\n                        even though such dealings may otherwise involve “no breach of any\n                        duty, obligation, prohibition or requirement that is legally binding”\n                        upon the registrant of the trade mark … 29     InWing Joo\n                        Loong, this court observed at [105] that “[t]hetestfor determining the presence of bad faith, in the\n                    context of the English Trade Marks Act, was settled by the English Court of\n                    Appeal” [emphasis in original]. It would be useful to set out in full the\n                    observations of this court at [105]–[106] which are as follows: 105    Thetestfor determining the presence of bad faith,\n                            in the context of the English Trade Marks Act, was settled by the\n                            English Court of Appeal inHarrison v Teton Valley\n                                Trading Co Ltd[2004] 1WLR 2577, where Sir William\n                            Aldous, with whom Arden and Pill LJJ agreed, expressed the test as\n                            follows (at [26]): The words ‘bad faith’ suggest a mental state. Clearly when\n                            considering the question of whether an application to register is made\n                            in bad faith all the circumstances will be relevant. However the court\n                            must decide whether the knowledge of the applicant was such that his\n                            decision to apply for registration would be regarded as [being] in bad\n                            faith by persons adopting proper standards. This test, which was referred to by Sir Aldous (idat [25]) as the “combined” test of bad\n                        faith, contains both a subjective element (viz, what the particular applicant knows) and an objective\n                        element (viz, what ordinary persons adopting\n                        proper standards would think). 106    Recently, this\n                            combined test of bad faith was succinctly explained inAjit Weekly Trade Mark[2006] RPC 25 as\n                            follows (at [35] and [41]): 35    … Bad faith is to be judged according to\n                                the combined test of dishonesty for accessory liability [for] breach\n                                of trust set out by the majority of the House of Lords inTwinsectra Ltd v Yardley[2002] 2 A.C. 164,\n                                withGromax Plasticulture[([103]supra)] … providing the\n                                appropriate standard namely, acceptable commercial behaviour\n                                observed by reasonable and experienced persons in the particular\n                                commercial area being examined. … 41    … [T]he upshot of the Privy\n                                [Council’s] decision in [Barlow Clowes\n                                    International Ltd v Eurotrust International Ltd[2006] 1 WLR 1476] is: (a) to confirm the House of\n                                Lords’ test for dishonesty applied inTwinsectra, i.e. the combined test; and (b) to\n                                resolve any ambiguity in the majority of their Lordships’\n                                statement of that test by making it clear that an enquiry into a\n                                defendant’s views as regards normal standards of honesty is\n                                not part of the test. The subjective element of the test means that\n                                the tribunal must ascertain what the defendant knew about the\n                                transaction or other matters in question. It must then be decided\n                                whether in the light of that knowledge, the defendant’s\n                                conduct is dishonest judged by ordinary standards of honest people,\n                                the defendant’s own standards of honesty being irrelevant to\n                                the objective element … This court inWing Joo\n                        Loongthen applied at [107]–[117] the combined test of bad\n                    faith which, to reiterate, contains both a subjective element (viz, what the particular applicant knows) and an\n                    objective element (viz, what ordinary persons\n                    adopting proper standards would think). It is therefore apparent to us that bad\n                    faith as a concept is context-dependent. In the final analysis, whether bad\n                    faith exists or not hinges on the specific factual matrix of each\n                case. 30     Furthermore, it is pertinent to note that an\n                    allegation of bad faith is a serious claim to make and it must be sufficiently\n                    supported by the evidence (see Nautical Concept Pte Ltd v Jeffery Mark Richard\n                    and another [2007] 1 SLR(R) 1071 at [15] which we reproduce below): An allegation that a trade mark has been applied for in bad\n                        faith is a serious one. InRoyal Enfield Trade\n                            Marks[2002] RPC 508, it was held (at [31]) that: A plea of fraud should not be lightly made … and if made should\n                            bedistinctly alleged and distinctly proved. It is not\n                                permissible to leave fraud to be inferred from the facts(seeDavy v. Garett[1878] 7 Ch.D. 473 at\n                            489). In my judgment precisely the same considerations apply to an\n                            allegation of … bad faith made under section 3(6) [of the UK\n                            Trade Marks Act 1994].It should not be made unless it can be\n                                fully and properly pleaded and should not be upheld unless it is\n                                distinctly proved and this will rarely be possible by a process of\n                                inference. [original emphasis omitted; emphasis added] This principle of law was alluded to and accepted by a leading local\n                    text on Intellectual Property (Ng-Loy Wee Loon,Law of Intellectual\n                        Property of Singapore(Sweet & Maxwell Asia, Rev Ed, 2009) at\n                    para 21.4.1): An allegation of bad faith is a serious one, and it must be fully and\n                        properly pleaded and should not be upheld unless it is distinctly proved and\n                        this willrarely be possible by a process of inference.\n                        [emphasis added] The question, therefore, was whether this appeal was such a case where\n                    bad faith could be proven especially by way of aninference. We turn now to apply the above principles to the facts of\n                    the present appeal.",
        "Application of the law to the facts": "31     The Appellant’s case on bad faith\n                    revolved around two main contentions. The first was that the Respondent had\n                    copied the Application Mark from the trademark of one Mr Emilio Valentino.\n                    The second was that the proprietorship of the Application Mark in Singapore did\n                    not belong to the Respondent. Applying the combined test of bad faith (alluded\n                    to in[25]–[29]above), in order for the Appellant to succeed in opposing\n                    the registration of the Application Mark, it must show, not only that the\n                    conduct of the Respondent in applying for the registration of the Application\n                    Mark fell short of the normally accepted standards of commercial behaviour, but\n                    also that the Respondent knew of facts which, to an ordinary person, would have\n                    made the latter realise that what it was doing would be regarded as breaching\n                    those standards. 32     On the first contention, what the Appellant\n                    had proven was that Mr Emilio Valentino had attempted to register a trade\n                    mark (“the EV Mark”) in Italy in 2007 which was identical to the\n                    Application Mark[note: 7]. This fact was not disputed. It was also not\n                    disputed that there was no connection between Mr Emilio Valentino and the\n                    Respondent. Significantly, there was also no evidence before this court that the\n                    Respondent, in deriving the Application Mark, had copied the EV Mark. Indeed,\n                    the Respondent claimed to have used the Application Mark from around\n                        1995,[note: 8]well before\n                    Mr Emilio Valentino attempted to register the EV Mark in Italy.[note: 9] 33     On these facts, the point which the Appellant\n                    attempted to make was that since the Application Mark was identical with the EV\n                    mark, it would naturally follow that the Respondent had copied the Application\n                    Mark from the EV Mark. Accordingly, the Appellant argued that the burden would\n                    shift to the Respondent to show how the Application Mark was derived and in turn\n                    to explain how did it come about that the Application Mark was identical with\n                    the EV Mark. In this regard, the Appellant relied on cases such asAuvi Pte Ltd v Seah Siew Tee and another[1991]\n                    2 SLR(R) 786 (“Auvi Pte Ltd”)\n                    andIn the Matter of Trade Mark Application No 2011973\n                        by Team Lotus Ventures Ltd and In the Matter of Opposition Thereto under\n                        Opposition No 45584 by Group Lotus Ltd. What was vitally\n                    pertinent to note, and this was totally cast aside by the Appellant, was that\n                    there was no evidence before the court showing that Mr Emilio Valentino had used\n                    the EV Mark before 2007. While it might well bepossible(and we put it no higher than that) that Mr Emilio\n                    Valentino had used the EV Mark before 2007, nothing was produced before the\n                    court which could reasonably enable the court to draw such an inference or make\n                    a definite decision. Indeed, as the Judge aptly observed at [71] of the GD,\n                    there was no evidence “that Mr Emilio Valentino has been using [the\n                    EV Mark] prior to the Respondent”. It was just as possible that the EV\n                    Mark was copied by Mr Emilio Valentino from the Application Mark of the\n                    Respondent. In these circumstances, there was noprima\n                        faciecase for the Respondent to rebut. Neither had any\n                    evidential burden shifted to the Respondent. 34     What was clear was that the facts of the\n                    present case were quite different from those inApplication\n                        by Brown Shoe Company Inc for Rectification of the Register in Respect of\n                        Trade Mark No B720,262[1959] RPC 29 which involved two word\n                    marks, “Naturalizer” and “Naturlizet”, and where the\n                    owner of the former mark successfully had the Register rectified by having the\n                    latter mark removed from the Register. There, the mark\n                    “Naturalizer” was extensively advertised by its owner in American\n                    periodicals before the application to register the mark\n                    “Naturlizet” was made. The judge held that there was copying on\n                    the part of the party obtaining registration for the “Naturlizet”\n                    mark. Similarly, inAuvi Pte Ltd, there was clear\n                    evidence that the logo of the plaintiff was in existence well before the\n                    defendants’ mark. In view of the close similarity between the logo and the\n                    mark and the other evidence presented, the plaintiff satisfied the court that\n                    there was copying on the part of the defendants. Accordingly, the court expunged\n                    the defendants’ mark from the Register. Ultimately, it is our view that\n                    each case would have to be decided in accordance with its own facts, and in\n                    particular, the evidence tendered. 35     It was true that the EV Mark incorporated the\n                    name of Mr Emilio Valentino. That fact could notper\n                        sesuggest anything and certainly could not suggest that the\n                    Respondent had copied the Application Mark from the EV Mark. However, although\n                    no evidential burden arose for the Respondent, the latter nevertheless (through\n                    one Mr Ng Yeo Tiong) claimed that it was one Ms Diana Taylor\n                    (“Ms Taylor”), the President of the Respondent, who created\n                    the Application Mark independently.[note: 10]This assertion was\n                    certainly hearsay and it should have been made by Ms Taylor herself. Thus,\n                    it came as no surprise that the Appellant took issue with this assertion. This\n                    challenge was not lost on the Judge who observed, at [68] of the GD,\n                    that: [T]he Respondent had not called [Ms Taylor] to testify to the originality\n                        of her design nor produced further evidence that it did not copy [the EV\n                        Mark] or suggested that the identity between the Application Mark and [the\n                        EV Mark] is a mere coincidence … 36     As a result, the Appellant submitted that an\n                    adverse inference should have been drawn against the Respondent pursuant to\n                        illustration (g) of s 116 of the\n                    Evidence Act (Cap 97, 1997 Rev Ed). But as we have stated above at[33], the Appellant had failed to even\n                    make out aprima faciecase of bad faith and so\n                    the burden of disproving any element of bad faith on the part of the Respondent\n                    did not arise. No adverse inference should, in the circumstances, be drawn\n                    against the Respondent or, more accurately, we should say that in the light of\n                    what was before the court there was nothing for the Respondent to rebut. We\n                    noted that the Judge at [70] of the GD remarked that the Respondent had failed\n                    to provide any credible evidence regarding the derivation of the Application\n                    Mark. We had no quarrel with that remark which was correct. However, the primary\n                    burden of showing aprima faciecase of bad faith\n                    rested with the Appellant. As the Appellant had failed to discharge that burden,\n                    the omission on the part of the Respondent to show how it derived the\n                    Application Mark was wholly immaterial. 37     Turning to the second contention regarding the\n                    proprietorship of the Application Mark in Singapore, the Appellant’s case\n                    on this point centred on its averment that it was Hor (the Respondent’s\n                    former distributor (see[22]above)), and\n                    not the Respondent, who owned the goodwill and reputation in the Application\n                    Mark. Consequently, the Respondent had no right to register the Application\n                    Mark. We noted, at this juncture, that the Respondent conceded that it\n                        was[note: 11]: … the first to use the Application Mark in Singapore,albeit through a distributor, namely [Hor].\n                        [emphasis added] 38     In this regard, it is useful to refer to the\n                    court’s illuminating remarks inWarmanat\n                    [49]: In the present case, it is common ground that the key issue in the\n                        determination of bad faith pivots around the fulcrum of proprietorship of\n                        the “Warman” mark in Singapore. It appears to me to be an\n                        incontrovertible proposition that if a registrant of a trade mark has\n                        proprietorship of that trade mark, or at the very least, theright to registerthat trade mark, then such\n                        registration of the trade mark should fall well within the standards of\n                        acceptable commercial behaviour observed by reasonable and experienced\n                        persons in the particular trade. Conversely, where it can be shown that the\n                        applicant knew of anexclusiveproprietary\n                        right ofanotherin relation to the trade mark\n                        it seeks to furtively register, then any such registration would, almost\n                        invariably, quite clearly fall short of the relevant standards. As such, it\n                        is important to first examine and determine the issue of proprietorship.\n                        [emphasis in original] 39     To substantiate its allegation that the\n                    Respondent had no right to register the Application Mark, the Appellant relied\n                    solely on an affidavit filed by Hor in Criminal Motion No 6 of 2004 in the\n                    High Court to set aside two search warrants issued at the instance of the\n                    Appellant. It is necessary that we now set out the background as to how Hor, and\n                    his sole proprietorship, Impressions, became involved in the use of the\n                    Application Mark in Singapore. 40     By way of a “Letter of\n                        Authorization”[note: 12]which took effect from\n                    1 June 1997, the Respondent authorised one Jack Lee (“Jack”)\n                    of Geveni International Co Ltd (“Geveni”) of Taiwan to be its\n                    exclusive agent in the Asian markets for a duration of 10 years from 1 June\n                    1997 to 31 May 2007. Pursuant to that Letter of Authorization, Geveni was\n                    given “the full right to use Emilio Valentino’s original logo,\n                    trademark and ability of production supervision in the area of People of\n                    Republic of China, Taiwan, Japan, Korea, Philippine [sic], Vietnam, Malasia [sic],\n                    Thiland [sic], Indonesia and\n                        Singapore.”[note: 13] 41     Jack, in turn, approached Hor with a view to\n                    roping Hor into the business of manufacturing the Emilio Valentino range of\n                    apparel. To that end, a “Certificate of Authorization”[note: 14]stated that\n                    Genevi, which was the “exclusive agent for Emilio Valentino of Italy in\n                    all of the Asia with legal representation of English and Chinese logos”,\n                    granted the right to Impressions “[t]o be the legal representation anddistributionandmanufacturingagent [in] the above mentioned\n                        areas”[note: 15][emphasis added]. This Certificate of\n                    Authorization specifically stated that “[t]erritories”[note: 16]comprised of\n                    Singapore, Malaysia and Indonesia. The Certificate of Authorization took effect\n                    from 1 February 2002 to 31 May 2007. 42     Hor was the sole proprietor of Impressions\n                    which was registered in 2001 and was engaged in the clothing business. It was\n                    common ground that Hor was the Respondent’s distributor in Singapore since\n                    2002. It was also the Respondent’s evidence that it had used the\n                    Application Mark since 1995.[note: 17] 43     In Hor’s affidavit, he claimed that he\n                    had obtained the right to distribute and manufacture Emilio Valentino products\n                    from Geveni. This affidavit was filed by Hor after a complaint was made by the\n                    Appellant’s representative in Singapore that Impressions had committed\n                    offences under s 49 of the TMA. Hence, the Respondent argued (rightly in\n                    our view) that:[note: 18] … Hor’s claim of ownership of the goodwill and reputation of\n                        the Application Mark in Singapore was made in the context of a distribution\n                        and manufacturing agreement and in the context of denying that he had\n                        employed a false trade description. The sole purpose of Hor’s affidavit was to defend the\n                    allegations that he had,inter alia, employed a\n                    false trade description. In any event, Hor’s claim of ownership of the\n                    goodwill and reputation of the Application Mark in Singapore was made in the\n                    context of the Certificate of Authorization which, as noted above, provided that\n                    Impressions had the right to manufacture and distribute the Respondent’s\n                    goods bearing the Application Mark. 44     In the light of the foregoing arrangements\n                    between the respondent and Genevi and in turn between Genevi and Hor, we noted\n                    that while Hor was the first person to seek to register in Singapore a mark\n                    which was identical with the Application Mark on 3 June 2003, it did not,\n                    however, thereby follow that the Respondent’s registration of the\n                    Application Mark was done in bad faith. Indeed, the Respondent, in any event,\n                    had at least theright to registerthe Application\n                    Mark (seeWarmanat [49], quoted at[38]above). We would further add that Hor\n                    eventually abandoned his application to register the mark. 45     We now turn to address the Appellant’s\n                    assertion that there wasnotrade mark\n                    licensor-licensee relationship between the Respondent and Hor. It was our view\n                    that this assertion was a bare assertion which was contrary to documentary\n                    evidence. As noted by the High Court inWarmanat\n                    [63], “[o]ne instance of a right to sell under a trade mark being\n                    divorced from a right to protect that mark by way of trade mark registration is\n                    in the case of a trade mark licensee.” Further, the High Court there\n                    observed at [64]–[68] that: 64    The test for the\n                            validity of a trade mark licence was set out inRainforest Coffee Products Pte Ltd v Rainforest Cafe,\n                                Inc[2000] 1 SLR(R) 725 where Lai Kew Chai J\n                            (at [33]), in delivering the judgment of the Court of Appeal, endorsed\n                            the English decision inBOSTITCH Trade\n                                Mark[1963] RPC 183 at 567: The key to the validity of a trade mark licence was whether or not the\n                            licence arrangement had destroyed the trade connection between the\n                            proprietor of the trade mark and the goods … Therefore, for there to be a valid trade mark licence between parties,\n                        there must be a trade connection between the purported proprietor of the\n                        trade mark (allegedly the plaintiff, in this case) and the goods ultimately\n                        sold under the mark by the licensee (the defendant’s goods, in this\n                        case). 65    In the commentary of\n                            the TMA by Mr M Ravindran inButterworths’ Singapore Statutes–Intellectual Property(Butterworths, 2002)\n                            (“theButterworths’\n                            Statutes”), it is stated that whether the proprietor\n                            has any trade connection with the goods or services in question is\n                            ultimately a question of fact. Mr Ravindran, coincidentally the\n                            counsel for the plaintiff in the present case, explains in the\n                            commentary at p 126: if the proprietor does not in fact exercise control or supervise the\n                            use of his registered trade mark (notwithstanding provisions which allow\n                            him to do so), there is no trade connection between him and the goods or\n                            services for which the mark has been registered. It appears to be trite law that to establish the requisite trade\n                        connection for a valid trade mark licence, there must be at leastsomecontrol or supervision of the use of the trade\n                        mark by the purported licensee. 66    The same view has been adopted inTan Tee Jim([48]supra) at p 216 in relation to the licensing of\n                            unregistered trade marks. The learned author is of the view that such\n                            licence is valid only if there is a quality control relationship between\n                            the licensor and the goods or services in question. 67    The leading treatise of Wilkof and Burkitt,Trade Mark Licensing(Sweet &\n                            Maxwell, 2nd Ed, 2005) at p 252, notes that the approach in\n                            the United States of America with respect to implied licences emphasises\n                            that evidence of control is necessary for an implied trade mark licence.\n                            The authors cite the American case ofVillanova\n                                University v Villanova Alumni Educational Foundation, Inc123 F Supp 2d 293, for the proposition that the existence of\n                            an implied trade mark licence requires evidence that permission was\n                            given to use the mark, coupled with an exercise of reasonable control\n                            over such use. This requirement is assessed by the objective conduct of\n                            the parties. This seems sensible. 68    Both from precedent and logic, I conclude that a\n                            trade mark licence arrangement between the plaintiff and the defendant\n                            may only be established if theplaintiff exerts some\n                                manner or form of control or supervision over the defendant’s\n                                goods… [emphasis in original in italics; emphasis added in bold italics] 46     From the “Legal\n                        Contract”[note: 19]between Geveni (who as mentioned\n                    above was the exclusive agent for Emilio Valentino of Italy in Asia) and\n                    Impressions, of which the first, third, fourth, and fifth clauses were of\n                    relevance, we noted that there was indeed a trade connection between Geveni and\n                    Impressions’ goods. These clauses in that document read as\n                        follows[note: 20]: 1.   Logo Party A [ie, Geveni] authorized Party B\n                            [ie, Impressions] to be the manufacturer\n                        and distributor and sales and marketer of the items as stated above.The styles of the fashions should get the approval\n                            from Party A [ie, Geveni] to use the logo of Emilio Valentino before it\n                            is to be distributed to the markets. 2.   … 3.   Keeping of the Reputation Party B [ie, Impressions] should try in\n                        every effort to keep Emilio Valentino in good and reputable images and\n                        meanwhile it is necessary to improve and update the design and quality\n                        regularly. 4.   Distribution Party B [ie, Impressions] should maintain\n                        the distribution channels positioning in the middle to high-end markets. In\n                        any situation, Emilio Valentino should not become the low end or street\n                        vendor markets. 5.   Origin of Design Party B [ie, Impressions] is fully\n                        responsible for the designs, material selections, manufacturing and color\n                        matching, furthermore the final designs of all products should send to Party\n                        A [ie, Geveni] for record keeping. All of the\n                        designs should not violate the third party’s designs and legal rights.\n                        In the event of default, Party B [ie,\n                        Impressions] will be responsible for its own legal action. [Emphasis added] It was clear that the above clauses reserved unto Geveni the right to\n                    exercise control and supervision on the use by Impressions of the Application\n                    Mark. The Respondent’s control and supervision over Geveni was in turn\n                    provided for in the Letter of Authorisation[note: 21](see[40]above). There was nothing to suggest that\n                    control and supervision was, in fact, not exercised by the Respondent over\n                    Impressions through Genevi. No evidence was adduced by the Appellant to\n                    contradict what was set out in the Legal Contract. As noted by the Judge, a bare\n                    assertion by the Appellant that “there was no evidence of control or\n                    supervision by the Respondent over [Hor]” (the GD at [57]) could not\n                    suffice to prove that there was indeed no control exercised by the Respondent\n                    over the use of the Application Mark. The legal documents set out the rights and\n                    obligations of the parties and it would be reasonable to assume, unless proven\n                    otherwise, that the parties would, and had, observed the terms agreed upon. We\n                    would reiterate that if the Appellant alleged that there wasnosuch control, the burden of proof must surely be on the\n                    Appellant to prove exactly that. The latter had wholly failed to do so. Thus,\n                    there was nothing to show bad faith on the part of the Respondent in seeking the\n                    registration of the Application Mark. As mentioned in[30]above, an allegation of bad faith is a serious matter and\n                    ought not to be lightly inferred. 47     Before we conclude this judgment, we would\n                    like to make two observations. First, the Appellant vigorously\n                        argued[note: 22]that the PAR had failed to\n                    consider the provisions of r 14 of the Trade Mark Rules (Cap 322, R 1,\n                    2008 Rev Ed) which provides as follows: Persons living or recently dead 14. —(1) Where the name or representation of any person\n                        appears on a trade mark which is the subject of an application for\n                        registration, the Registrarmay, before\n                        proceeding to register the mark, require the applicant to furnish the\n                        Registrar with the consent of the person or, in the case of a person\n                        recently dead, of his legal representatives. (2) Where the consent referred to in paragraph (1) is not\n                        furnished within the time specified by the Registrar and the applicant\n                        fails to satisfy the Registrar that it is impossible or impracticable\n                        in the circumstances of the case to obtain the consent, the Registrar\n                        shall refuse to register the mark. [Emphasis added] The Appellant agreed that the requirement under r 14(1) was\n                    entirely discretionary. However, it submitted that:[note: 23] … in order for the RTM [ie, the\n                        Registry of Trade Marks] to decide whether to exercise its discretionary\n                        power, it had to have the relevant facts before it. The RTM had to be told\n                        the derivation of the Application Mark for it to then decide if consent was\n                        necessary. We, however, were unable to agree with the Appellant. The primary\n                    burden of showing aprima faciecase of bad faith\n                    rested solely with the Appellant. In the present case, the Appellant had clearly\n                    failed to discharge this burden. There was, therefore, no room for the Appellant\n                    to argue that the Registry of Trade Marks ought to have exercised its discretion\n                    under r 14(1) in the present case to require the Respondent to furnish\n                    proof of the consent of Mr Emilio Valentino. 48     Secondly, we found it strange that the\n                    Appellant should choose to argue that the Respondent’s application to\n                    register the Application Mark was made in bad faith pursuant to s 7(6) when\n                    the very persons who should know best, whether there was a case to object on\n                    that ground, would be either Mr Emilio Valentino or Hor (or both) and\n                    neither of them had raised any such objection. In order to establish aprima faciecase, the Appellant should, at the very\n                    least, obtain direct evidence from either Mr Emilio Valentino or Hor, or\n                    both, to show either there was copying on the part of the Respondent and/or that\n                    the goodwill in the Application Mark did not vest in the Respondent (this would\n                    be on the assumption that Hor could explain away the position set out in the\n                    Legal Contract (see[46]above)).\n                    Presumably, the Appellant could not persuade Mr Emilio Valentino or Hor to do\n                    any of these things. As explained above at[39]and[43], the affidavit\n                    filed by Hor was for an entirely different purpose. In the premises, the\n                    Appellant had no basis whatsoever to bring an action to oppose the registration\n                    of the Application Mark on the ground of bad faith.",
        "Conclusion": "49     In conclusion, it was clear to us that the\n                    Appellant had no valid reasons to object to the registration of the Application\n                    Mark. What the Appellant sought to acquire, which it was not entitled to, was a\n                    monopoly over the use of a common name, “Valentino”. In the\n                    result, we dismissed the appeal with costs and the usual consequential\n                    orders.  [note: 1]The range of\n                                the Valentino Marks can be found at Annex A of the Appellant’s\n                                Case (“AC”). [note: 2]See Core\n                                Bundle (“CB”) Vol II at p\n                        130. [note: 3]CB Vol II at\n                                pp 135–136. [note: 4]See AC at para\n                                259. [note: 5]AC at para\n                    12. [note: 6]AC at para 17. [note: 7]See CB Vol II at p\n                        178. [note: 8]Respondent’s Case (“RC”) at para\n                                45; see also CB Vol II at p 59. [note: 9]See CB Vol II at p\n                178. [note: 10]See CB Vol\n                                II at pp 97–100. [note: 11]RC at para 90. [note: 12]CB Vol II\n                                at pp 59–60. [note: 13]CB Vol II at p\n                        59 [note: 14]CB Vol II at p 61. [note: 15]CB Vol II at p\n                        61. [note: 16]CB Vol II at p 61. [note: 17]See CB Vol\n                                II at p 59. [note: 18]RC at para\n                        97. [note: 19]CB Vol II at pp\n                            63–65. [note: 20]CB Vol II at pp\n                            63–64. [note: 21]CB Vol II\n                                at pp 59–60. [note: 22]See AC at pp\n                            79–87. [note: 23]AC at para 172."
    }
}