{
    "case_title": "Xing Rong Pte Ltd (Formerly known as Huadi Projects Pte\n                Ltd)\n      v\n      Visionhealthone Corporation Pte Ltd",
    "ncitation": "[2010] SGCA 30",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Introduction": "1       The appellant, Xing Rong Pte Ltd (“Xing\n                    Rong”), appealed against the decision of the judge below (“the\n                    Judge”), who had struck out its appeal against the decision of the\n                    Assistant Registrar (“the AR”) in Summons No 5937 of 2009 where\n                    the AR granted the discovery application that the respondent, Visionhealthone\n                    Corporation Pte Ltd (“VHO”), had applied for against the Bank of\n                    China Ltd (“BOC”), a non–party to the present proceedings\n                    (“the Discovery Application”). We allowed the appeal against the\n                    Judge’s decision on the striking out order but as we also found that the\n                    AR was justified in granting the Discovery Application, we dismissed the appeal\n                    against the AR’s decision. We now give the grounds for our\n                    decision.",
        "Background": "2       The Discovery Application was made in relation\n                    to Suit No 678 of 2009 (“the Suit”). In the Suit, VHO claimed\n                    S$2.125 million (“the Sum”) from Xing Rong on the basis of an\n                    agreement dated 18 October 2003 (“the Agreement”) with Xing\n                    Rong to establish a network of medical facilities in and outside China\n                    (“the Joint Venture”). The funds for the Joint Venture were to be\n                    provided solely by VHO. 3       VHO claimed that, between December 2003 and\n                    January 2004, it remitted the Sum to Xing Rong’s bank account with BOC\n                    (“the Account”). It asserted that it was induced to remit the sum\n                    to Xing Rong through the latter’s and/or the latter’s\n                    representative’s fraudulent misrepresentations that the Sum was required\n                    for the purposes of the Joint Venture 4       Prior to March 2007, Xing Rong represented that,\n                    in or around 2004, it had in turn remitted the Sum to a third-party Chinese\n                    company, Fuzhou Huadi Hebang Construction Renovation Engineering Company Ltd\n                    (“FHH”) for the purposes of the Joint Venture. However, the FHH\n                    financial records obtained by VHO did not reflect the receipt of the sum by\n                    FHH. 5       Xing Rong, while admitting that it had received\n                    the Sum, alleged that the Sum was received pursuant to a currency exchange\n                    transaction with VHO and not pursuant to any joint venture. 6       In the Suit, VHO sought,inter alia, to recover the Sum from Xing Rong, as well as the\n                    production of all necessary accounts and enquiries relating to the movements of\n                    the Sum. Thus, Xing Rong was asked to furnish the relevant bank statements that\n                    evidenced the movements of the Sum. However, it claimed that the documents\n                    sought by VHO were not in its possession. 7       In view of Xing Rong’s claim that it did\n                    not have the bank statements in question, VHO sought the production of documents\n                    from BOC relating to and/or evidencing the movements of the Sum, or any part\n                    thereof, into and out of the Account. 8       At the hearing of the Discovery Application\n                    against BOC, BOC left it to the court to decide whether it should produce the\n                    required documents. However, Xing Rong, which had been served with the papers\n                    relating to the Discovery Application, opposed the said application. After\n                    hearing the parties, the AR granted VHO’s application and ordered that it\n                    be allowed to inspect and take copies of certain documents in BOC’s\n                    possession (“the Discovery Order”). The discovery ordered related\n                    to the following documents (“the Ordered Documents”): All bank statements, cheques, remittance slips, receipts, transfer\n                        instructions and correspondence relating to and/or evidencing the movements\n                        of the sum of S$2,125,000.00, which was deposited into account no.\n                        012XXXXXXXX (the “Account”) of\n                        Xing Rong Pte Ltd (formerly known as Huadi Projects Pte Ltd) with Bank of\n                        China Limited by way of: 1.    OCBC cheque no. 749325 dated 23 December\n                            2003 for the sum of S$400,000.00; 2.    UOB cheque no. 642852 dated 23 December\n                            2003 for the sum of S$1,100,000.00; and 3.    UOB cheque no. 642853 dated 10 January\n                            2004 for the sum of S$625,000.00, into and out of the Account. 9       BOC, which was the party subject to the\n                    Discovery Order, did not appeal against the Discovery Order within the relevant\n                    time frame (ie, by 14 December 2009).\n                    However, Xing Rong, which was dissatisfied with the AR’s ruling, filed a\n                    notice of appeal on 1 December 2009 against the Discovery Order by way of\n                    Registrar’s Appeal No 449 of 2009 (“the Registrar’s\n                    Appeal”). 10     On 4 December 2009, VHO applied, by way\n                    of Summons No 6230 of 2009, to strike out the Registrar’s Appeal\n                    (“the Striking Out Application”) on the ground that Xing Rong had\n                    nolocus standito bring the Registrar’s\n                    Appeal since there was no issue between VHO and Xing Rong with respect to the\n                    discovery in question. 11     On 11 January 2010, the Judge, on hearing\n                    the Striking Out Application, accepted VHO’s contention and struck out\n                    Xing Rong’s appeal. 12     On 9 February 2010, Xing Rong filed an\n                    appeal against the Judge’s decision.",
        "The Judge’s Decision": "13     The Judge allowed the Striking Out Application\n                    on three grounds: (a)     Xing Rong lacked thelocus standito appeal against the Discovery Order\n                        as its personal interests were neither affected nor aggrieved by it.\n                        Moreover, it was neither a party to the Discovery Application nor the\n                        subject of the Discovery Order. (b)     As BOC had not filed any appeal against the Discovery\n                        Order within the prescribed time limit, the Discovery Order was perfected\n                        between VHO and BOC. Thus, the doctrine ofres\n                            judicataprecluded Xing Rong from filing an appeal against\n                        the Discovery Order. (c)     In any event, Xing Rong’s appeal had no substantive merits as\n                        the Ordered Documents were relevant and necessary to the fair disposal of\n                        the Suit.",
        "The Appeal": "14     The issues in the appeal before this court\n                    were: (a)Whether Xing Rong hadlocus\n                                standito appeal against the Discovery\n                        Order;(b)Whether, given the fact that BOC did not file any\n                            appeal against the Discovery Order, the Order had been perfected such\n                            that Xing Rong was precluded, on the basis of the doctrine ofres judicata, from filing any appeal against the\n                            Order; and(c)Whether the appeal against the AR’s\n                            decision should, even if Xing Rong hadlocus\n                                standito file the appeal, have been struck out on the\n                            basis that it lacked substantive merit.Whether Xing Rong hadlocus standito\n                appeal against the Discovery Order15     The relevant part of O 24 r 6 of the\n                    Rules of Court (Cap 322, R5, 2006 Rev Ed) (“the Rules”)\n                    concerning discovery of documents provides that:(1)    An application for an order for the discovery of\n                            documents before the commencement of proceedings shall be made by\n                            originating summons and the person against whom the order is sought\n                            shall be made defendant to the originating summons.(2)    An application after the commencement of\n                            proceedings for an order for the discovery of documents by a person who\n                            is not a party to the proceedings shall be made by summons, which must\n                            be served on that person personally and on every party to the\n                            proceedings.…(8)    For the purpose of Rules 10 and 11, an application\n                            for an order under this Rule shall be treated as a cause or matter\n                            between the applicant and the person against whom the order is\n                            sought.16     After considering the relevant sections of\n                    O 24 r 6 of the Rules, the Judge set out, at [19] of his Grounds of\n                    Decision (“the GD”), the requirements that needed to be fulfilled\n                    before a party could demonstrate that it hadlocus\n                        standito file an appeal against an order as follows:(a)     One has to show that one is affected\n                        or aggrieved by the court order and therefore has a personal interest in\n                        seeking variation or release from the said order.(b)     Further and in addition to that, where\n                        it is in the nature of an appeal, the Judge took the view that the appellant\n                        must generally be a party to the application below that gave rise to the\n                        orders that form the subject of his appeal before he has standing to appeal\n                        against those orders.17     In our view, insofar as proposition (a) is\n                    concerned, Xing Rong had shown that it had a legitimate interest in the subject\n                    matter of the Discovery Order as well as a corresponding right to ensure that\n                    information relating to its bank account with BOC was not divulged without\n                    proper cause.18     As for the reasoning behind the Judge’s\n                    proposition (b), he stated in the GD, at [17], that the wording of O 24\n                    r 6 (1), (2), and (8) of the Rules indicates that an order for non-party\n                    discovery is directed solely against the non-party from whom discovery is sought\n                        (ie, it is clearly envisaged that an\n                    application for non-party discovery is a matter exclusively between the\n                    applicant and the non-party respondent). In addition, he stated, at [18] of the\n                    GD, that the fact that Xing Rong was served with the application for non-party\n                    discovery and that Xing Rong was heard by the AR did notipso\n                        factoconfer itlocus standito\n                    file an appeal.19     With respect, we were unable to accept the\n                    Judge’s reasoning. O 24 r 6(2) of the Rules provides that a\n                    discovery application must be made by way of summons, which must be served onevery party to the proceedings. This must mean\n                    that every party to the proceedings haslocus\n                        standito make submissions where its interests in the main suit\n                    may be affected by the court order on the discovery of documents. Insofar as\n                    Xing Rong, a defendant in the main suit, was concerned, the discovery related to\n                    its bank account with BOC and thus it had every right to oppose the Discovery\n                    Application at the hearing before the AR.20     If Xing Rong was entitled to be heard at the\n                    application before the AR to oppose it, it should also be entitled to appeal\n                    against a decision that did not favour its arguments. It must be borne in mind\n                    that in an application such as this, the bank against whom the discovery is\n                    sought will invariably, as was the case here, take a neutral stand as it\n                    normally will have no direct interest in the matter and will abide by whatever\n                    order the court may deem fit to make. If it were the case that Xing Rong had nolocus standito appeal against an adverse\n                    order of the AR, then an anomaly would arise. While VHO could have three bites\n                    of the cherry (as it could argue its case before the AR; appeal to the High\n                    Court if it were unsuccessful; and appeal again to the Court of Appeal if it\n                    were still unsuccessful), Xing Rong could only have one bite of the cherry\n                    (namely to argue its case at the hearing before the AR). It is unimaginable that\n                    the law should so discriminate between the parties. Moreover, on the\n                    Judge’s holding, a question could be raised as to whether Xing Rong would\n                    have the right to appear and oppose an appeal if it was VHO that was appealing\n                    to the High Court. The answer must obviously be yes. And if Xing Rong could\n                    oppose an appeal by VHO, why could it not then file an appeal against an\n                    unfavourable AR order? If a party has the right to appear and oppose an\n                    application, it should follow that he or she should also have the right of\n                    pursuing the matter further on appeal in accordance with the general law. It\n                    seemed to us that the Judge fell into error in thinking that just because the\n                    Discovery Order was not directed against Xing Rong, it must therefore follow\n                    that its interests were not affected by the order (see[14]above). This is clearly a much too narrow, and indeed\n                    unrealistic, view of the situation. We have not been able to find any reported\n                    decision in any common law country which supported this narrow\n                view.21     Quite clearly a party to the main suit is\n                    entitled to object to a discovery application sought by the other party against\n                    it. By logical extension, the same rule must apply when the discovery order is\n                    sought against someone who is not a party to the proceedings because that order\n                    could likewise affect the interests of the party or parties to the main suit. It\n                    seems to us thatlocus standiis not the correct\n                    issue to raise when a party to the main action wishes to appeal a discovery\n                    order made against a third party to the main action. The real matter to be\n                    determined on such an appeal are the merits of the case (ie, whether the appellant has shown a real interest in the\n                    documents sought and whether there are sufficient grounds to say that the\n                    discovery order issued is wrong).Whether the Discovery Order isres\n                    judicata22     The Judge noted, at [28] of the GD, that even\n                    if Xing Rong had standing to appeal against the AR’s decision and\n                    succeeded in its appeal, it would not be able to reap the fruits of the appeal\n                    because the Discovery Order wasres judicataas\n                    between VHO and BOC.23     In ruling that the Discovery Order wasres judicata, the Judge had assumed that Xing\n                    Rong had nolocus standito appeal against the\n                    AR’s decision. Hence, he relied onNike International\n                        Ltd and another v Campomar SL[2005] 4 SLR(R) 76 at\n                    [40] for the proposition that a decision which is not appealed against by a\n                    party entitled to do so isres judicata. However,\n                    this was not the case here as we found that Xing Rong was entitled to appeal\n                    against the AR’s decision.24     The Judge also relied onTeo Chee Yeow Aloysius and another v Tan Harry and another[2004] 3 SLR(R) 588. In that case, it was held that two\n                    co-defendants who had both successfully appealed against an award of damages\n                    assessed by an Assistant Registrar, but had appealed under different heads of\n                    damages, were not entitled to the benefits of each other’s success\n                        (ie, they could only benefit from the decision\n                    with respect to the head of damages which formed the subject matter of their own\n                    appeals). However, this reasoning was inapplicable to the present case, as Xing\n                    Rong was not seeking to benefit from the successful appeal of another\n                    party.25     In short, as the question ofres judicatadid not arise, Xing Rong was not precluded\n                    from filing an appeal against the AR’s decision.Whether the Judge was correct in striking out the Registrar’s\n                Appeal based on a lack of substantive merit26     The principles concerning the striking out of\n                    a notice of appeal were outlined by the Court of Appeal inRiduan bin Yusof v Khng Thian Huat and another[2005]\n                    2 SLR(R) 188 (“Riduan”) as\n                    follows at [17] and [21]:17    The principles\n                            applicable to striking out notices of appeal are stated inSingapore Civil Procedure 2003(Sweet &\n                            Maxwell Asia, 2003) (“the White Book”) at\n                            para 57/3/7:The Court of Appeal has the inherent jurisdiction to strike out a\n                            notice of appeal where an appeal is plainly not competent (seeAviagents Ltd v. Balstravest Investments Ltd[1955] 1 W.L.R. 150; [1966] 1 All E.R. 450; or where the appeal is\n                            frivolous, vexatious or an abuse of the process of the court (seeBurgess v. Stafford Hotel Ltd[1990] 1\n                            W.L.R. 1215; [1990] 3 All E.R. 222). An appeal can be struck out in\n                            the exercise of that jurisdiction, if there is no possibility that the\n                            grounds of appeal are capable of argument.…21    A court will only exercise its power to strike out\n                            notices of appeal in “clear and obvious\n                            cases”…27     The burden of showing that it is clear and\n                    obvious that a notice to appeal should be struck off lies with the party seeking\n                    to strike out the notice, which was VHO in the present case.28     The Judge stated, at [47] of the GD, that he\n                    struck out the appeal because apart from Xing Rong’s lack oflocus standito file the appeal, the said appeal\n                    “lacked substantive merit” in any event. However, for an appeal to\n                    be struck out, what is required is that there is “no possibility that the\n                    grounds of appeal are capable of argument” or that the appeal is\n                    “plainly not competent”, and not that the appeal lacks substantive\n                    merit. Indeed, the Judge’s finding that the “appeal lacked\n                    substantive merit” indicates that he had considered the merits of the\n                    case before deciding to strike out the application. What is also noteworthy is\n                    that the Judge did not make a finding that there was “no possibility that\n                    the grounds of appeal (were) capable of argument” or that the appeal was\n                    “plainly not competent”.29     In view of the circumstances, the Judge should\n                    have dismissed the striking out application and proceeded to hear Xing\n                    Rong’s appeal, in which case, he would have been entitled to dismiss the\n                    appeal on the ground that it lacked substantive merit.Whether the matter should be remitted to the Judge or any other judge\n                for consideration of the merits of the appeal30     As the Judge should not have struck out Xing\n                    Rong’s appeal against the AR’s decision, a question arose as to\n                    whether the matter should be remitted to him or to any other judge to consider\n                    the merits of the said appeal. In its notice of appeal, Xing Rong stated that it\n                    was dissatisfied with the Judge’s decision in the striking out application\n                    as well as the Registrar’s Appeal. In view of this, it seemed to us that\n                    it would be expedient and much judicial time would be saved if the\n                    Registrar’s Appeal was considered at this juncture so that the parties\n                    could thereafter focus on the trial rather than be bogged down by further\n                    interlocutory appeals.31     In fact, the Judge did consider the merits of\n                    the case and the crux of the present case was whether the Ordered Documents were\n                    relevant to the proceedings in the main action, and necessary for the fair\n                    disposal of the case. There was no doubt that the Ordered Documents are very\n                    relevant and necessary for the disposal of the main suit. As the Judge explained\n                    in the GD at [44] and [45]:44    ... The Ordered Documentswere\n                                vital in establishing and resolving the disputed issues raised in\n                                the main suit. Apart from substantiating the claim that\n                            there in fact was a receipt of such Sum (which was admitted by the\n                                2ndDefendant),the\n                                Discovery Order also served a wider facilitative purpose in allowing\n                                early disclosure of documents crucial to the main suit\n                                itself. For instance, if upon trial it was found that the\n                            Plaintiff’s version of facts was in fact true and correct,ie. that the Sum was paid under the\n                            Cooperation Agreement, the Ordered Documents would provide useful\n                            information pertaining to the onward application of the Sum by the\n                                2ndDefendant by allowing the court to\n                            trace its whereabouts since the transfer of the Sum into the\n                                2ndDefendant’s account, including\n                            whether or not the Sum was in fact subsequently paid over to FHH as\n                            represented by the 2ndDefendant in order to\n                            establish a medical facilities network in and outside China pursuant to\n                            the joint venture. This would assist the court in effectively\n                            determining the liability of the 2ndDefendant under the Cooperation Agreement (if any).45    In the event that the Sum was found to have been\n                            paid to the 2ndDefendant pursuant to a\n                            currency exchange transaction, there is no apparent prejudice in\n                            disclosing the Ordered Documents in respect of the\n                                2ndDefendant’s account. The\n                            movement of the Sum that the Plaintiff was allowed to question and\n                            scrutinise was limited only to those flowing from those cheques\n                            delineated by the AR (see [11] above). The Discovery Order was not by\n                            any means a blanket permission to intrude into the financial status and\n                            activities of the 2ndDefendant. The\n                            Discovery Order allowed only disclosure of documents that were necessary\n                            for the Plaintiff to establish its claim. It was never intended to\n                            warrant a fishing expedition on the Plaintiff’s part. Hence,\n                            details of the 2ndDefendant’s use of\n                            its other financial resources would not by way of the Discovery Order be\n                            exposed. As such, the financial interests of the\n                                2ndDefendant were sufficiently\n                            safeguarded.[emphasis added]32     We agreed with the Judge’s views on the\n                    relevance and necessity of the Ordered Documents for the fair disposal of the\n                    suit. It is pertinent to note that when requested by VHO to produce the Ordered\n                    Documents, Xing Rong did not say that they were not relevant or necessary.\n                    Instead, it merely stated that it did not have the Ordered\n                Documents.33     As the Ordered Documents were relevant and\n                    necessary for the disposal of the main action, the AR’s decision to allow\n                    the Discovery Application was undoubtedly correct and should not be disturbed.\n                    As such, we dismissed the Registrar’s Appeal.Costs34     While Xing Rong succeeded in having the\n                    striking out of its appeal set aside, the whole exercise had been futile as it\n                    was very obvious that the Ordered Documents are relevant and necessary for the\n                    disposal of the main action. As such, we ordered that each party should bear its\n                    own costs with regard to both this appeal and the hearing before the High\n                    Court.",
        "Whether Xing Rong hadlocus standito\n                appeal against the Discovery Order": "15     The relevant part of O 24 r 6 of the\n                    Rules of Court (Cap 322, R5, 2006 Rev Ed) (“the Rules”)\n                    concerning discovery of documents provides that: (1)    An application for an order for the discovery of\n                            documents before the commencement of proceedings shall be made by\n                            originating summons and the person against whom the order is sought\n                            shall be made defendant to the originating summons. (2)    An application after the commencement of\n                            proceedings for an order for the discovery of documents by a person who\n                            is not a party to the proceedings shall be made by summons, which must\n                            be served on that person personally and on every party to the\n                            proceedings. … (8)    For the purpose of Rules 10 and 11, an application\n                            for an order under this Rule shall be treated as a cause or matter\n                            between the applicant and the person against whom the order is\n                            sought. 16     After considering the relevant sections of\n                    O 24 r 6 of the Rules, the Judge set out, at [19] of his Grounds of\n                    Decision (“the GD”), the requirements that needed to be fulfilled\n                    before a party could demonstrate that it hadlocus\n                        standito file an appeal against an order as follows: (a)     One has to show that one is affected\n                        or aggrieved by the court order and therefore has a personal interest in\n                        seeking variation or release from the said order. (b)     Further and in addition to that, where\n                        it is in the nature of an appeal, the Judge took the view that the appellant\n                        must generally be a party to the application below that gave rise to the\n                        orders that form the subject of his appeal before he has standing to appeal\n                        against those orders. 17     In our view, insofar as proposition (a) is\n                    concerned, Xing Rong had shown that it had a legitimate interest in the subject\n                    matter of the Discovery Order as well as a corresponding right to ensure that\n                    information relating to its bank account with BOC was not divulged without\n                    proper cause. 18     As for the reasoning behind the Judge’s\n                    proposition (b), he stated in the GD, at [17], that the wording of O 24\n                    r 6 (1), (2), and (8) of the Rules indicates that an order for non-party\n                    discovery is directed solely against the non-party from whom discovery is sought\n                        (ie, it is clearly envisaged that an\n                    application for non-party discovery is a matter exclusively between the\n                    applicant and the non-party respondent). In addition, he stated, at [18] of the\n                    GD, that the fact that Xing Rong was served with the application for non-party\n                    discovery and that Xing Rong was heard by the AR did notipso\n                        factoconfer itlocus standito\n                    file an appeal. 19     With respect, we were unable to accept the\n                    Judge’s reasoning. O 24 r 6(2) of the Rules provides that a\n                    discovery application must be made by way of summons, which must be served onevery party to the proceedings. This must mean\n                    that every party to the proceedings haslocus\n                        standito make submissions where its interests in the main suit\n                    may be affected by the court order on the discovery of documents. Insofar as\n                    Xing Rong, a defendant in the main suit, was concerned, the discovery related to\n                    its bank account with BOC and thus it had every right to oppose the Discovery\n                    Application at the hearing before the AR. 20     If Xing Rong was entitled to be heard at the\n                    application before the AR to oppose it, it should also be entitled to appeal\n                    against a decision that did not favour its arguments. It must be borne in mind\n                    that in an application such as this, the bank against whom the discovery is\n                    sought will invariably, as was the case here, take a neutral stand as it\n                    normally will have no direct interest in the matter and will abide by whatever\n                    order the court may deem fit to make. If it were the case that Xing Rong had nolocus standito appeal against an adverse\n                    order of the AR, then an anomaly would arise. While VHO could have three bites\n                    of the cherry (as it could argue its case before the AR; appeal to the High\n                    Court if it were unsuccessful; and appeal again to the Court of Appeal if it\n                    were still unsuccessful), Xing Rong could only have one bite of the cherry\n                    (namely to argue its case at the hearing before the AR). It is unimaginable that\n                    the law should so discriminate between the parties. Moreover, on the\n                    Judge’s holding, a question could be raised as to whether Xing Rong would\n                    have the right to appear and oppose an appeal if it was VHO that was appealing\n                    to the High Court. The answer must obviously be yes. And if Xing Rong could\n                    oppose an appeal by VHO, why could it not then file an appeal against an\n                    unfavourable AR order? If a party has the right to appear and oppose an\n                    application, it should follow that he or she should also have the right of\n                    pursuing the matter further on appeal in accordance with the general law. It\n                    seemed to us that the Judge fell into error in thinking that just because the\n                    Discovery Order was not directed against Xing Rong, it must therefore follow\n                    that its interests were not affected by the order (see[14]above). This is clearly a much too narrow, and indeed\n                    unrealistic, view of the situation. We have not been able to find any reported\n                    decision in any common law country which supported this narrow\n                view. 21     Quite clearly a party to the main suit is\n                    entitled to object to a discovery application sought by the other party against\n                    it. By logical extension, the same rule must apply when the discovery order is\n                    sought against someone who is not a party to the proceedings because that order\n                    could likewise affect the interests of the party or parties to the main suit. It\n                    seems to us thatlocus standiis not the correct\n                    issue to raise when a party to the main action wishes to appeal a discovery\n                    order made against a third party to the main action. The real matter to be\n                    determined on such an appeal are the merits of the case (ie, whether the appellant has shown a real interest in the\n                    documents sought and whether there are sufficient grounds to say that the\n                    discovery order issued is wrong).",
        "Whether the Discovery Order isres\n                    judicata": "22     The Judge noted, at [28] of the GD, that even\n                    if Xing Rong had standing to appeal against the AR’s decision and\n                    succeeded in its appeal, it would not be able to reap the fruits of the appeal\n                    because the Discovery Order wasres judicataas\n                    between VHO and BOC. 23     In ruling that the Discovery Order wasres judicata, the Judge had assumed that Xing\n                    Rong had nolocus standito appeal against the\n                    AR’s decision. Hence, he relied onNike International\n                        Ltd and another v Campomar SL[2005] 4 SLR(R) 76 at\n                    [40] for the proposition that a decision which is not appealed against by a\n                    party entitled to do so isres judicata. However,\n                    this was not the case here as we found that Xing Rong was entitled to appeal\n                    against the AR’s decision. 24     The Judge also relied onTeo Chee Yeow Aloysius and another v Tan Harry and another[2004] 3 SLR(R) 588. In that case, it was held that two\n                    co-defendants who had both successfully appealed against an award of damages\n                    assessed by an Assistant Registrar, but had appealed under different heads of\n                    damages, were not entitled to the benefits of each other’s success\n                        (ie, they could only benefit from the decision\n                    with respect to the head of damages which formed the subject matter of their own\n                    appeals). However, this reasoning was inapplicable to the present case, as Xing\n                    Rong was not seeking to benefit from the successful appeal of another\n                    party. 25     In short, as the question ofres judicatadid not arise, Xing Rong was not precluded\n                    from filing an appeal against the AR’s decision.",
        "Whether the Judge was correct in striking out the Registrar’s\n                Appeal based on a lack of substantive merit": "26     The principles concerning the striking out of\n                    a notice of appeal were outlined by the Court of Appeal inRiduan bin Yusof v Khng Thian Huat and another[2005]\n                    2 SLR(R) 188 (“Riduan”) as\n                    follows at [17] and [21]: 17    The principles\n                            applicable to striking out notices of appeal are stated inSingapore Civil Procedure 2003(Sweet &\n                            Maxwell Asia, 2003) (“the White Book”) at\n                            para 57/3/7: The Court of Appeal has the inherent jurisdiction to strike out a\n                            notice of appeal where an appeal is plainly not competent (seeAviagents Ltd v. Balstravest Investments Ltd[1955] 1 W.L.R. 150; [1966] 1 All E.R. 450; or where the appeal is\n                            frivolous, vexatious or an abuse of the process of the court (seeBurgess v. Stafford Hotel Ltd[1990] 1\n                            W.L.R. 1215; [1990] 3 All E.R. 222). An appeal can be struck out in\n                            the exercise of that jurisdiction, if there is no possibility that the\n                            grounds of appeal are capable of argument. … 21    A court will only exercise its power to strike out\n                            notices of appeal in “clear and obvious\n                            cases”… 27     The burden of showing that it is clear and\n                    obvious that a notice to appeal should be struck off lies with the party seeking\n                    to strike out the notice, which was VHO in the present case. 28     The Judge stated, at [47] of the GD, that he\n                    struck out the appeal because apart from Xing Rong’s lack oflocus standito file the appeal, the said appeal\n                    “lacked substantive merit” in any event. However, for an appeal to\n                    be struck out, what is required is that there is “no possibility that the\n                    grounds of appeal are capable of argument” or that the appeal is\n                    “plainly not competent”, and not that the appeal lacks substantive\n                    merit. Indeed, the Judge’s finding that the “appeal lacked\n                    substantive merit” indicates that he had considered the merits of the\n                    case before deciding to strike out the application. What is also noteworthy is\n                    that the Judge did not make a finding that there was “no possibility that\n                    the grounds of appeal (were) capable of argument” or that the appeal was\n                    “plainly not competent”. 29     In view of the circumstances, the Judge should\n                    have dismissed the striking out application and proceeded to hear Xing\n                    Rong’s appeal, in which case, he would have been entitled to dismiss the\n                    appeal on the ground that it lacked substantive merit.",
        "Whether the matter should be remitted to the Judge or any other judge\n                for consideration of the merits of the appeal": "30     As the Judge should not have struck out Xing\n                    Rong’s appeal against the AR’s decision, a question arose as to\n                    whether the matter should be remitted to him or to any other judge to consider\n                    the merits of the said appeal. In its notice of appeal, Xing Rong stated that it\n                    was dissatisfied with the Judge’s decision in the striking out application\n                    as well as the Registrar’s Appeal. In view of this, it seemed to us that\n                    it would be expedient and much judicial time would be saved if the\n                    Registrar’s Appeal was considered at this juncture so that the parties\n                    could thereafter focus on the trial rather than be bogged down by further\n                    interlocutory appeals. 31     In fact, the Judge did consider the merits of\n                    the case and the crux of the present case was whether the Ordered Documents were\n                    relevant to the proceedings in the main action, and necessary for the fair\n                    disposal of the case. There was no doubt that the Ordered Documents are very\n                    relevant and necessary for the disposal of the main suit. As the Judge explained\n                    in the GD at [44] and [45]: 44    ... The Ordered Documentswere\n                                vital in establishing and resolving the disputed issues raised in\n                                the main suit. Apart from substantiating the claim that\n                            there in fact was a receipt of such Sum (which was admitted by the\n                                2ndDefendant),the\n                                Discovery Order also served a wider facilitative purpose in allowing\n                                early disclosure of documents crucial to the main suit\n                                itself. For instance, if upon trial it was found that the\n                            Plaintiff’s version of facts was in fact true and correct,ie. that the Sum was paid under the\n                            Cooperation Agreement, the Ordered Documents would provide useful\n                            information pertaining to the onward application of the Sum by the\n                                2ndDefendant by allowing the court to\n                            trace its whereabouts since the transfer of the Sum into the\n                                2ndDefendant’s account, including\n                            whether or not the Sum was in fact subsequently paid over to FHH as\n                            represented by the 2ndDefendant in order to\n                            establish a medical facilities network in and outside China pursuant to\n                            the joint venture. This would assist the court in effectively\n                            determining the liability of the 2ndDefendant under the Cooperation Agreement (if any). 45    In the event that the Sum was found to have been\n                            paid to the 2ndDefendant pursuant to a\n                            currency exchange transaction, there is no apparent prejudice in\n                            disclosing the Ordered Documents in respect of the\n                                2ndDefendant’s account. The\n                            movement of the Sum that the Plaintiff was allowed to question and\n                            scrutinise was limited only to those flowing from those cheques\n                            delineated by the AR (see [11] above). The Discovery Order was not by\n                            any means a blanket permission to intrude into the financial status and\n                            activities of the 2ndDefendant. The\n                            Discovery Order allowed only disclosure of documents that were necessary\n                            for the Plaintiff to establish its claim. It was never intended to\n                            warrant a fishing expedition on the Plaintiff’s part. Hence,\n                            details of the 2ndDefendant’s use of\n                            its other financial resources would not by way of the Discovery Order be\n                            exposed. As such, the financial interests of the\n                                2ndDefendant were sufficiently\n                            safeguarded. [emphasis added] 32     We agreed with the Judge’s views on the\n                    relevance and necessity of the Ordered Documents for the fair disposal of the\n                    suit. It is pertinent to note that when requested by VHO to produce the Ordered\n                    Documents, Xing Rong did not say that they were not relevant or necessary.\n                    Instead, it merely stated that it did not have the Ordered\n                Documents. 33     As the Ordered Documents were relevant and\n                    necessary for the disposal of the main action, the AR’s decision to allow\n                    the Discovery Application was undoubtedly correct and should not be disturbed.\n                    As such, we dismissed the Registrar’s Appeal.",
        "Costs": "34     While Xing Rong succeeded in having the\n                    striking out of its appeal set aside, the whole exercise had been futile as it\n                    was very obvious that the Ordered Documents are relevant and necessary for the\n                    disposal of the main action. As such, we ordered that each party should bear its\n                    own costs with regard to both this appeal and the hearing before the High\n                    Court."
    }
}