{
    "case_title": "NK\n      v\n      NL",
    "ncitation": "[2010] SGCA 32",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      Andrew Ang J",
    "sections": {
        "Introduction": "1       The present proceedings relate to two applications arising from orders we made (“the Court Order”) inNK v NL[2007] 3 SLR(R) 743 (“the main judgment”).",
        "Background": "2       In the main judgment, we held,inter alia, that several companies (collectively, “TFI”) were part of the matrimonial assets to be divided upon the divorce of the parties (whom we shall refer to as “the wife” and “the husband” respectively). Consequently, we made the Court Order as follows (the main judgment at [54] and [82]): 54    ... [TFI] should be valued by a valuer to be appointed by agreement between the parties. However, if the parties do not agree, they will each submit the names of up to two valuers to this court within three weeks of the date of this judgment. The court will then select a valuer, from the names submitted by the parties, whose valuation of [TFI] shall, for the purposes of the present appeal, be final. ... 82    We ... make the following orders: (a)    that the wife be awarded 40% of the matrimonial home and 60% of the other matrimonial assets (which amounts to $931,612.38),as well as 60% of the total value of [TFI] (if a positive value (overall) results from the valuation ordered at [54] above); ... (c)    that [TFI] be valued in the manner set out at [54] above (with liberty to apply); ... [emphasis added] It may be noted that the Court Order did not stipulate any particular method of valuation of TFI, but left it to the valuer to decide the proper method of valuation. 3       The dispute between the parties first came before the courts in 2004. It did not end with the main judgment. After we gave the Court Order, the parties could not agree on a valuer. Hence, on 23 October 2007, we appointed KPMG Singapore (“KPMG”) as the valuer, on the application of the wife. The husband refused to co-operate with KPMG to provide a valuation as soon as possible. On the wife’s application, we made an order authorising KPMG to investigate the financial records of TFI. We also ordered that the valuation exercise be completed within three months. This was on 14 November 2008. More than a year later, on 18 January 2010, KPMG issued its final valuation report. The report stated the value of TFI to be between $2.22m and $2.43m, with a median value of $2.32m. 4       After KPMG’s valuation was released, the husband was advised by his solicitors that the methodology used by KPMG was not in accordance with the terms of the Court Order (see[2]above). The husband appointed M/s Ferrier Hodgson (“FH”) to review and comment on KPMG’s valuation. FH’s opinion at para 2.3.12 of its report dated 12 February 2010 was that KPMG’s valuation of $2.32m for TFI was too high for the following reasons: (a)the earnings multiple applied by KPMG was too high;(b)the control premium was too high;(c)the discount for lack of marketability was too low;(d)the net debt figure was too low; and(e)the estimate of earnings was not appropriate.The instant applications5       Following from his refusal to accept KPMG’s valuation, the husband invoked the “liberty to apply” clause in the Court Order to dispute the validity of KPMG’s valuation and to seek a revaluation of TFI by way of Summons No 1092 of 2010. The wife, for her part, is applying by way of Summons No 1083 of 2010 to compel the husband to pay her share of the value of TFI as valued by KPMG. There were other prayers but in light of what follows it is not necessary to refer to them.6       The husband’s application to review KPMG’s valuation was based on two main grounds as follows:(a)     KPMG had materially departed from the terms of the Court Order in that it should have valued TFI on the basis of its net asset value or liquidation value, and not on a going concern basis as it had done; and(b)     in any case, there were manifest errors in KPMG’s valuation.In support of his arguments, counsel for the husband, Mr N Sreenivasan, referred to a number of authorities,eg,Tan Yeow Khoon and another v Tan Yeow Tat and others[2003] 3 SLR(R) 486;Riduan bin Yusof v Khng Thian Huat and another[2005] 2 SLR(R) 188;Hoban Steven Maurice Dixon and another v Scanlon Graeme John and others[2005] 2 SLR(R) 632;Evergreat Construction Co Pte Ltd v Pressscrete Engineering Pte Ltd[2006] 1 SLR(R) 634; andThe Oriental Insurance Co Ltd v Reliance National Asia Re Pte Ltd[2009] 2 SLR(R) 385. The cases cited concerned experts appointed and instructed by parties and are not directly relevant. But, for present purposes, we accept that, by analogy, a court can intervene if a court-appointed valuer does not act in accordance with his terms of reference, or if his valuation is patently or manifestly in error. This is subject to the caveat that the court will be slow to find that the valuation is in error, since by appointing an expert in the first place it has taken the position that the matter is best left to the expert. On this basis, we turn to the first ground advanced by the husband.Was KPMG’s valuation a departure from the terms of the Court Order?7       Mr Sreenivasan argued that this court had intended that TFI be valued on a net asset value or liquidation value basis as the Court Order provided for TFI to be put into the pool of matrimonial assets, only if it has a “positive” value (see[2]above). Accordingly, the purpose of the valuation was to distribute the matrimonial assets, and not for a business takeover or a court-ordered buyout in an oppression action.8       Mr Sreenivasan also referred to the cases ofHatrick v Commissioner of Inland Revenue[1963] NZLR 641 andMallet v Mallet(1984) 156 CLR 605, on the basis of which he submitted as follows:(a)     where shares are not traded on the open market, the method of valuation is based on the earnings or assets of the business;(b)     the earnings capitalisation method can be applied when the company has a history of profitable trading in a reasonably open business environment with a professional or independent management;(c)     the net asset backing basis (liquidation basis) would be appropriate when the company is not a profitable trading concern and/or there is no ready third party buyer; and(d)     in a matrimonial dispute where a valuation of family-owned companies is required for division and distribution, a liquidation approach should be used to value the companies as the predominant purpose is to distribute the existing value of assets and not to compel one party to continue the business to (maybe) recover the value paid.9       Mr Sreenivasan also pointed out that TFI is family-owned, and as such there is no recognised market for its shares. There is no evidence that TFI (or any of its component companies) could be sold to any third party buyer. Further, in the years 2004 to 2007, TFI’s working capital was in the negative, and this meant that TFI was effectively insolvent, as it was unable to pay its short-term liabilities. Hence, KPMG was wrong to value TFI on a going concern basis. Here, Mr Sreenivasan referred toJones (M) and Another v Jones (RR) and Another[1971] 1 WLR 840, where the valuer had valued shares in a company on a break-up basis when he should have used a going concern basis. In rejecting the valuation, Ungoed-Thomas J emphasised, at 856, that “if a valuation is erroneous in principle, it is vitiated and cannot be relied upon even though it is not established that the valuation figure is wrong.”10     To sum up the husband’s case: KPMG’s valuation is outside the terms of the Court Order which contemplated a valuation based on TFI’s net asset or liquidation value, and not based on its value as a going concern. Further, the valuation is also wrong in principle because it is inappropriate for a private company like TFI.11     Counsel for the wife, Ms Luna Yap, responded to Mr Sreenivasan’s arguments on two grounds. First, the Court Order, read with our further order of 23 October 2007 appointing KPMG as the valuer, stated that KPMG was to “value TFI” and not to conduct a forensic investigation of TFI. Secondly, the husband’s solicitors had in their letter dated 29 May 2008 confirmed (at para 3) as follows:For the avoidance of doubts, the valuation by KPMG is NOT to perform a valuation of [the wife’s] ... share in the entities concerned, but to value [TFI] so as to ascertain “the total overall value of [TFI]”.This letter was written in response to KPMG’s Letter of Engagement dated 23 April 2008, which stated (at p 2) that:KPMG ... will perform an independent valuation of [TFI] as at the Valuation Date and our duty is owed to [this Court]. Depending on the information made available to us, we shall use the commonly used methodologies to arrive at the value of [TFI] as at the Valuation Date.This Letter of Engagement was subsequently amended before parties signed it, but the above quoted passage on KPMG’s scope of work remained unchanged. It should be noted that, in their letter, the husband’s solicitors did not stipulate any method of valuation. They left it entirely to KPMG to choose the appropriate method. In contrast, KPMG stated in its Letter of Engagement that it would use methodologies commonly used for valuation of companies.12     In our judgment, the interpretation given to the Court Order by Mr Sreenivasan has no merit. The Court Order did not stipulate any particular methodology to be used. By necessary implication, it left the valuation to the discretion of independent experts, to be exercised on the basis of market practice and commonly accepted valuation methodologies, having regard to the circumstances relevant to private companies such as TFI. In such circumstances, it cannot be said that KPMG’s method of valuation is a departure from the Court Order, unless it can be shown that it is a method which iswholly inappropriatefor valuing shares of a private company, such as TFI, for the purposes of a division of matrimonial assets. There was no argument to this effect – as we understood him, Mr Sreenivasan only argued that it waspreferablefor KPMG to value TFI based on its net asset or liquidation value; he did not argue that KPMG’s use of the going concern basis waswholly inappropriate. In any case, we think that Mr Sreenivasan’s arguments, whatever their merits, have been made too late – the husband should have applied for directions or clarification before KPMG began the valuation process, and certainly before KPMG completed its valuation.13     There was also no expert evidence before us to show that KPMG’s methodology was inappropriate. While FH, the husband’s valuation expert, took the view that KPMG’s methodology was not supported by current literature, it stopped short of saying that the methodology was wrong. Indeed, in a later part of its report (at para 5.6), FH considered KPMG’s methodology to be appropriate:Based on these points,we consider that the approach adopted by KPMG to be appropriate. However, because of the persistence of negative earnings, the valuation is heavily reliant on the assumption that earnings will increase in the future. In other words, if earnings (measured by net profits after tax) continued to be negative in the future, then the equity in TFI would have no value on an earnings based approach. Similarly, the lack of asset backing would not provide any value if we assumed an asset based approach. [emphasis added]We therefore cannot accept that KPMG’s methodology was so wholly inappropriate for valuing TFI as to amount to a departure from the Court Order requiring our intervention.Was KPMG’s valuation manifestly wrong?14     Mr Sreenivasan also argued that KPMG’s valuation was manifestly wrong for the following reasons, which were the principal objections made by FH in its report (see[4]above):(a)     the earnings multiple of 10.47 for TFI was not based on companies that were directly comparable to TFI;(b)     the use of a control premium in the range of 20% to 30% was incorrect and distorted the value of TFI;(c)     the discount on lack of marketability (“DLOM”) of 15% to 20% for TFI was incorrect as it should be higher;(d)     the net debt of $371,000 as at 31 December 2006 was inaccurate as there was a sum of $1.56m owing to the husband; and(e)     the sum of $320,449.57 was excluded from EBITDA (ie, earnings before interest, taxes, depreciation and amortization).15     As mentioned, we agree with Mr Sreenivasan that the court may intervene to correct any manifest or patent error in a valuation. However, we do not agree that the “errors” complained of are errors, much less manifest or patent errors. Take point (a),ie, that the earnings multiple of 10.47 was too high because it was not based on companies that are directly comparable to TFI. The four companies used as comparisons are in the same line of business as TFI. Admittedly, they are not in the same situation as TFI – amongst other things, three are foreign companies, all are public companies and all are much larger than TFI. Some adjustment would therefore be needed when using these companies to determine TFI’s earnings multiple. But the precise adjustment to be made is a matter for KPMG’s expert judgment, and there is no evidence from FH to explain why KPMG’s judgment in this regard was wrong. FH’s main criticism is that the earnings multiple is too high because of TFI’s “persistence of negative earnings” (see[13]above). But KPMG took this into account when reclassifying the historical profit and loss statements of TFI in order to capture its operating and recurring incomes in the form of EBIT (ie, earnings before interest and tax) and EBITDA. FH has not criticised this procedure.16     With respect to point (b),viz, that there should be no control premium because this is a court-ordered distribution of matrimonial assets, and not an acquisition, this was not supported by FH who, as mentioned at[13]above, considered that KPMG’s method was appropriate. Without hearing FH and KPMG and further expert evidence on this issue, we are unable to say whether KPMG has made an error in applying a control premium. And, in so far as Mr Sreenivasan is arguing that a control premium between 20% and 30% was too high, this is only a difference in opinion.17     With respect to point (c), Mr Sreenivasan argued that the DLOM should be much higher because TFI is a private company, and not a public company. FH’s view is that the DLOM should be between 30% and 50%, rather than between 15% and 20% as given by KPMG. Again, this is merely a difference in opinion on the size of the discount to be applied.18     Point (d),ie, that KPMG has ignored the debt of $1.56m owing to the husband, is irrelevant – whether the $1.56m was credited to TFI or the husband, 60% would have to go to the wife under the terms of the Court Order (see[2]above). In any event, FH did not opine that this omission was an error.19     With respect to point (e),ie, that the sum of $320,449.57 was wrongly excluded from TFI’s EBITDA, KPMG’s valuation report shows that KPMG examined the supporting documents and concluded that although the item was recorded as TFI’s expenses, it was in fact the personal expenses of the husband and members of the family. We are unable to see any error in such a write-back.20     In the final analysis, Mr Sreenivasan has at the most shown some legitimate differences of opinion between experts on the valuation of TFI. This is very far from the level of a manifest or patent error by KPMG which warrants our intervention, and we therefore decline to disturb KPMG’s valuation.Selecting a value from the range given by KPMG21     We note that KPMG has given a valuation ranging from $2.22m to $2.43m and has suggested the median value of $2.32m as the value for TFI. KPMG did not state any substantive reason for preferring the median value, and the choice seems to be one of convenience. In these circumstances, it is fair to say that KPMG, applying its expert knowledge, can only give the value for TFI within a range, and not down to a precise figure. This is not surprising since valuation is hardly an exact science. More importantly, we are of the view that the court has a residual discretion in determining the precise value of TFI within the range given by KPMG. Since KPMG’s expertise only extended to giving a range for TFI’s value, and not a precise figure, the existence of the discretion does not intrude onto KPMG’s expertise. For the same reason, the exercise of the discretion cannot be governed by any consideration relating to valuation science or method, which has already reached its limits. It falls to be exercised according to the underlying purpose of the valuation, in this case the division of matrimonial assets. On the facts, we are of the view that, since the main judgment has made ample provision for the wife, it is fair for the husband to be given the benefit of any doubt in the valuation of TFI. Accordingly, we would adopt the lower limit of KPMG’s valuation of TFI, ie, $2.22m, rather than the median figure of $2.32m. Under the main judgment (see[2]above), the wife would be entitled to 60% of this value, amounting to $1.332m.Conclusion22     We will now consider how the 60% value of TFI should be paid to the wife. We note that the whole valuation exercise has been considerably delayed; indeed, almost three years have elapsed since the main judgment. We also recall our finding in the main judgment (at [60]) that the husband had undisclosed assets. At the same time, however, we do not think that the wife is in urgent need of funds, whilst the husband may need time to raise cash in order to pay the sum of $1.332m to the wife.23     In the result, and balancing the situations of both parties, we make the following orders:(a)     The husband shall pay to the wife the sum of $1.332m, being 60% of the value of TFI.(b)     The sum of $1.332m shall be paid in four equal instalments of $333,000, with the first instalment to be paid within one month from the date of this judgment, and the remaining instalments on a quarterly basis thereafter.To the extent that the parties’ prayers in their respective applications are not addressed by these orders, they are denied.24     In so far as the issue of costs is concerned, we observe, with regret, that the husband’s recalcitrance which we noted in the main judgment does not appear to have changed over time. In the circumstances, we award the wife the costs of both applications, which we fix at a total of $6,000 (including disbursements).",
        "The instant applications": "5       Following from his refusal to accept KPMG’s valuation, the husband invoked the “liberty to apply” clause in the Court Order to dispute the validity of KPMG’s valuation and to seek a revaluation of TFI by way of Summons No 1092 of 2010. The wife, for her part, is applying by way of Summons No 1083 of 2010 to compel the husband to pay her share of the value of TFI as valued by KPMG. There were other prayers but in light of what follows it is not necessary to refer to them. 6       The husband’s application to review KPMG’s valuation was based on two main grounds as follows: (a)     KPMG had materially departed from the terms of the Court Order in that it should have valued TFI on the basis of its net asset value or liquidation value, and not on a going concern basis as it had done; and (b)     in any case, there were manifest errors in KPMG’s valuation. In support of his arguments, counsel for the husband, Mr N Sreenivasan, referred to a number of authorities,eg,Tan Yeow Khoon and another v Tan Yeow Tat and others[2003] 3 SLR(R) 486;Riduan bin Yusof v Khng Thian Huat and another[2005] 2 SLR(R) 188;Hoban Steven Maurice Dixon and another v Scanlon Graeme John and others[2005] 2 SLR(R) 632;Evergreat Construction Co Pte Ltd v Pressscrete Engineering Pte Ltd[2006] 1 SLR(R) 634; andThe Oriental Insurance Co Ltd v Reliance National Asia Re Pte Ltd[2009] 2 SLR(R) 385. The cases cited concerned experts appointed and instructed by parties and are not directly relevant. But, for present purposes, we accept that, by analogy, a court can intervene if a court-appointed valuer does not act in accordance with his terms of reference, or if his valuation is patently or manifestly in error. This is subject to the caveat that the court will be slow to find that the valuation is in error, since by appointing an expert in the first place it has taken the position that the matter is best left to the expert. On this basis, we turn to the first ground advanced by the husband.",
        "Was KPMG’s valuation a departure from the terms of the Court Order?": "7       Mr Sreenivasan argued that this court had intended that TFI be valued on a net asset value or liquidation value basis as the Court Order provided for TFI to be put into the pool of matrimonial assets, only if it has a “positive” value (see[2]above). Accordingly, the purpose of the valuation was to distribute the matrimonial assets, and not for a business takeover or a court-ordered buyout in an oppression action. 8       Mr Sreenivasan also referred to the cases ofHatrick v Commissioner of Inland Revenue[1963] NZLR 641 andMallet v Mallet(1984) 156 CLR 605, on the basis of which he submitted as follows: (a)     where shares are not traded on the open market, the method of valuation is based on the earnings or assets of the business; (b)     the earnings capitalisation method can be applied when the company has a history of profitable trading in a reasonably open business environment with a professional or independent management; (c)     the net asset backing basis (liquidation basis) would be appropriate when the company is not a profitable trading concern and/or there is no ready third party buyer; and (d)     in a matrimonial dispute where a valuation of family-owned companies is required for division and distribution, a liquidation approach should be used to value the companies as the predominant purpose is to distribute the existing value of assets and not to compel one party to continue the business to (maybe) recover the value paid. 9       Mr Sreenivasan also pointed out that TFI is family-owned, and as such there is no recognised market for its shares. There is no evidence that TFI (or any of its component companies) could be sold to any third party buyer. Further, in the years 2004 to 2007, TFI’s working capital was in the negative, and this meant that TFI was effectively insolvent, as it was unable to pay its short-term liabilities. Hence, KPMG was wrong to value TFI on a going concern basis. Here, Mr Sreenivasan referred toJones (M) and Another v Jones (RR) and Another[1971] 1 WLR 840, where the valuer had valued shares in a company on a break-up basis when he should have used a going concern basis. In rejecting the valuation, Ungoed-Thomas J emphasised, at 856, that “if a valuation is erroneous in principle, it is vitiated and cannot be relied upon even though it is not established that the valuation figure is wrong.” 10     To sum up the husband’s case: KPMG’s valuation is outside the terms of the Court Order which contemplated a valuation based on TFI’s net asset or liquidation value, and not based on its value as a going concern. Further, the valuation is also wrong in principle because it is inappropriate for a private company like TFI. 11     Counsel for the wife, Ms Luna Yap, responded to Mr Sreenivasan’s arguments on two grounds. First, the Court Order, read with our further order of 23 October 2007 appointing KPMG as the valuer, stated that KPMG was to “value TFI” and not to conduct a forensic investigation of TFI. Secondly, the husband’s solicitors had in their letter dated 29 May 2008 confirmed (at para 3) as follows: For the avoidance of doubts, the valuation by KPMG is NOT to perform a valuation of [the wife’s] ... share in the entities concerned, but to value [TFI] so as to ascertain “the total overall value of [TFI]”. This letter was written in response to KPMG’s Letter of Engagement dated 23 April 2008, which stated (at p 2) that: KPMG ... will perform an independent valuation of [TFI] as at the Valuation Date and our duty is owed to [this Court]. Depending on the information made available to us, we shall use the commonly used methodologies to arrive at the value of [TFI] as at the Valuation Date. This Letter of Engagement was subsequently amended before parties signed it, but the above quoted passage on KPMG’s scope of work remained unchanged. It should be noted that, in their letter, the husband’s solicitors did not stipulate any method of valuation. They left it entirely to KPMG to choose the appropriate method. In contrast, KPMG stated in its Letter of Engagement that it would use methodologies commonly used for valuation of companies. 12     In our judgment, the interpretation given to the Court Order by Mr Sreenivasan has no merit. The Court Order did not stipulate any particular methodology to be used. By necessary implication, it left the valuation to the discretion of independent experts, to be exercised on the basis of market practice and commonly accepted valuation methodologies, having regard to the circumstances relevant to private companies such as TFI. In such circumstances, it cannot be said that KPMG’s method of valuation is a departure from the Court Order, unless it can be shown that it is a method which iswholly inappropriatefor valuing shares of a private company, such as TFI, for the purposes of a division of matrimonial assets. There was no argument to this effect – as we understood him, Mr Sreenivasan only argued that it waspreferablefor KPMG to value TFI based on its net asset or liquidation value; he did not argue that KPMG’s use of the going concern basis waswholly inappropriate. In any case, we think that Mr Sreenivasan’s arguments, whatever their merits, have been made too late – the husband should have applied for directions or clarification before KPMG began the valuation process, and certainly before KPMG completed its valuation. 13     There was also no expert evidence before us to show that KPMG’s methodology was inappropriate. While FH, the husband’s valuation expert, took the view that KPMG’s methodology was not supported by current literature, it stopped short of saying that the methodology was wrong. Indeed, in a later part of its report (at para 5.6), FH considered KPMG’s methodology to be appropriate: Based on these points,we consider that the approach adopted by KPMG to be appropriate. However, because of the persistence of negative earnings, the valuation is heavily reliant on the assumption that earnings will increase in the future. In other words, if earnings (measured by net profits after tax) continued to be negative in the future, then the equity in TFI would have no value on an earnings based approach. Similarly, the lack of asset backing would not provide any value if we assumed an asset based approach. [emphasis added] We therefore cannot accept that KPMG’s methodology was so wholly inappropriate for valuing TFI as to amount to a departure from the Court Order requiring our intervention.",
        "Was KPMG’s valuation manifestly wrong?": "14     Mr Sreenivasan also argued that KPMG’s valuation was manifestly wrong for the following reasons, which were the principal objections made by FH in its report (see[4]above): (a)     the earnings multiple of 10.47 for TFI was not based on companies that were directly comparable to TFI; (b)     the use of a control premium in the range of 20% to 30% was incorrect and distorted the value of TFI; (c)     the discount on lack of marketability (“DLOM”) of 15% to 20% for TFI was incorrect as it should be higher; (d)     the net debt of $371,000 as at 31 December 2006 was inaccurate as there was a sum of $1.56m owing to the husband; and (e)     the sum of $320,449.57 was excluded from EBITDA (ie, earnings before interest, taxes, depreciation and amortization). 15     As mentioned, we agree with Mr Sreenivasan that the court may intervene to correct any manifest or patent error in a valuation. However, we do not agree that the “errors” complained of are errors, much less manifest or patent errors. Take point (a),ie, that the earnings multiple of 10.47 was too high because it was not based on companies that are directly comparable to TFI. The four companies used as comparisons are in the same line of business as TFI. Admittedly, they are not in the same situation as TFI – amongst other things, three are foreign companies, all are public companies and all are much larger than TFI. Some adjustment would therefore be needed when using these companies to determine TFI’s earnings multiple. But the precise adjustment to be made is a matter for KPMG’s expert judgment, and there is no evidence from FH to explain why KPMG’s judgment in this regard was wrong. FH’s main criticism is that the earnings multiple is too high because of TFI’s “persistence of negative earnings” (see[13]above). But KPMG took this into account when reclassifying the historical profit and loss statements of TFI in order to capture its operating and recurring incomes in the form of EBIT (ie, earnings before interest and tax) and EBITDA. FH has not criticised this procedure. 16     With respect to point (b),viz, that there should be no control premium because this is a court-ordered distribution of matrimonial assets, and not an acquisition, this was not supported by FH who, as mentioned at[13]above, considered that KPMG’s method was appropriate. Without hearing FH and KPMG and further expert evidence on this issue, we are unable to say whether KPMG has made an error in applying a control premium. And, in so far as Mr Sreenivasan is arguing that a control premium between 20% and 30% was too high, this is only a difference in opinion. 17     With respect to point (c), Mr Sreenivasan argued that the DLOM should be much higher because TFI is a private company, and not a public company. FH’s view is that the DLOM should be between 30% and 50%, rather than between 15% and 20% as given by KPMG. Again, this is merely a difference in opinion on the size of the discount to be applied. 18     Point (d),ie, that KPMG has ignored the debt of $1.56m owing to the husband, is irrelevant – whether the $1.56m was credited to TFI or the husband, 60% would have to go to the wife under the terms of the Court Order (see[2]above). In any event, FH did not opine that this omission was an error. 19     With respect to point (e),ie, that the sum of $320,449.57 was wrongly excluded from TFI’s EBITDA, KPMG’s valuation report shows that KPMG examined the supporting documents and concluded that although the item was recorded as TFI’s expenses, it was in fact the personal expenses of the husband and members of the family. We are unable to see any error in such a write-back. 20     In the final analysis, Mr Sreenivasan has at the most shown some legitimate differences of opinion between experts on the valuation of TFI. This is very far from the level of a manifest or patent error by KPMG which warrants our intervention, and we therefore decline to disturb KPMG’s valuation.",
        "Selecting a value from the range given by KPMG": "21     We note that KPMG has given a valuation ranging from $2.22m to $2.43m and has suggested the median value of $2.32m as the value for TFI. KPMG did not state any substantive reason for preferring the median value, and the choice seems to be one of convenience. In these circumstances, it is fair to say that KPMG, applying its expert knowledge, can only give the value for TFI within a range, and not down to a precise figure. This is not surprising since valuation is hardly an exact science. More importantly, we are of the view that the court has a residual discretion in determining the precise value of TFI within the range given by KPMG. Since KPMG’s expertise only extended to giving a range for TFI’s value, and not a precise figure, the existence of the discretion does not intrude onto KPMG’s expertise. For the same reason, the exercise of the discretion cannot be governed by any consideration relating to valuation science or method, which has already reached its limits. It falls to be exercised according to the underlying purpose of the valuation, in this case the division of matrimonial assets. On the facts, we are of the view that, since the main judgment has made ample provision for the wife, it is fair for the husband to be given the benefit of any doubt in the valuation of TFI. Accordingly, we would adopt the lower limit of KPMG’s valuation of TFI, ie, $2.22m, rather than the median figure of $2.32m. Under the main judgment (see[2]above), the wife would be entitled to 60% of this value, amounting to $1.332m.",
        "Conclusion": "22     We will now consider how the 60% value of TFI should be paid to the wife. We note that the whole valuation exercise has been considerably delayed; indeed, almost three years have elapsed since the main judgment. We also recall our finding in the main judgment (at [60]) that the husband had undisclosed assets. At the same time, however, we do not think that the wife is in urgent need of funds, whilst the husband may need time to raise cash in order to pay the sum of $1.332m to the wife. 23     In the result, and balancing the situations of both parties, we make the following orders: (a)     The husband shall pay to the wife the sum of $1.332m, being 60% of the value of TFI. (b)     The sum of $1.332m shall be paid in four equal instalments of $333,000, with the first instalment to be paid within one month from the date of this judgment, and the remaining instalments on a quarterly basis thereafter. To the extent that the parties’ prayers in their respective applications are not addressed by these orders, they are denied. 24     In so far as the issue of costs is concerned, we observe, with regret, that the husband’s recalcitrance which we noted in the main judgment does not appear to have changed over time. In the circumstances, we award the wife the costs of both applications, which we fix at a total of $6,000 (including disbursements)."
    }
}