{
    "case_title": "Ong Pang Siew\n      v\n      Public Prosecutor",
    "ncitation": "[2010] SGCA 37",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This is the appeal by Ong Pang Siew (“the\n                    appellant”) against conviction for the murder of his step-daughter\n                    (“the deceased”) pursuant to s 302 of the Penal Code\n                    (Cap 224, 2008 Rev Ed) (“Penal Code”). The charge\n                    against him states: That you, ONG PANG SIEW,on the 20th day of October 2007 between 10.00 p.m. and\n                        10.30 p.m. at Block 24 Marsiling Drive #08-175, Singapore, did commit\n                        murder by causing the death of one Ong Pan Hui, and you have thereby\n                        committed an offence punishable under section 302 of the Penal Code,\n                        Chapter 224.Factual backgroundThe dramatis personae2       The appellant has worked as a bus driver for\n                    more than 20 years.[note: 1]At the material time, his employer was\n                    M/s Loh Gim Chong Transport (“M/s Loh”) whom he had\n                    worked for about seven months.[note: 2]Before his employment with M/s Loh, the\n                    appellant worked at three different transport companies for periods of 11 years,\n                    six years and one year respectively.[note: 3]He left the first company when it\n                    ceased operating but there is no evidence on record explaining why he left the\n                    other two companies within the space of a year. The appellant is the former\n                    husband of the deceased’s mother, Xiu Yanhong (“Xiu”). Both\n                    the deceased, who was 15 years old in 2007, and Xiu were formerly Chinese\n                    nationals.3       The appellant met Xiu in 1997 while she was\n                    employed as an electronic production operator in a factory. He was then\n                    providing transportation for the factory’s workers. When the factory\n                    closed down in 1998, Xiu found work in another factory. They continued to\n                    maintain contact and later developed a close relationship. When Xiu fell ill\n                    sometime in 1999, the appellant helped her during her convalescence.[note: 4]After her work permit expired in November\n                    1999, she returned to China but remained in touch with the appellant.\n                    Eventually, she divorced the deceased’s biological father sometime in\n                        2001.[note: 5]4       After her divorce, Xiu ran into serious\n                    financial difficulties and sought assistance from the appellant. He responded by\n                    visiting her in China. Once there, he rented an apartment for her and provided\n                    her with money from his savings to tide her over.[note: 6]Their relationship blossomed and she\n                    accepted his proposal for marriage. Following his return to Singapore, the\n                    appellant immediately made arrangements for Xiu to return to Singapore which she\n                    did in 2002. They married soon thereafter.5       After Xiu obtained her Permanent Resident status\n                    in late 2002, she persuaded the appellant to arrange for the deceased to\n                    continue her education in Singapore.[note: 7]In November 2002, the deceased arrived in\n                    Singapore and subsequently adopted the appellant’s surname, changing her\n                    name from “Pan Hui” to “Ong Pan Hui”. Xiu affirmed\n                    that the appellant’s relationship with the deceased was initially good and\n                    he doted on the deceased.[note: 8]6       On 8 August 2003, Xiu gave birth to their\n                    son, GHK (“GHK”). Unfortunately, the relationship between the\n                    appellant and Xiu deteriorated rapidly, soon after. Xiu had begun working as a\n                    masseuse. Subsequently, Xiu worked at three different massage parlours between\n                    2003 and 2005.[note: 9]Because the\n                    appellant was unhappy with the nature of her work, he and Xiu had frequent\n                    quarrels. In turn, she complained about his gambling habits.[note: 10]The\n                    appellant also heard from his neighbours that different men were sending Xiu\n                    home and that Xiu had become “very sexy”.[note: 11]In 2005, Xiu\n                    had two miscarriages. Following this, the appellant accused Xiu of having\n                    affairs with other men in the course of her work as a masseuse.[note: 12]This further damaged their relationship.\n                    Xiu, for her part, insisted on continuing with the same line of work. She\n                    claimed the additional income was needed to support her parents in\n                        China.[note: 13]7       In January 2006, Xiu started her own massage\n                    parlour, employing her savings as well as loans from her friends. Despite his\n                    continuing and profound misgivings, the appellant also contributed about $2,000\n                    to the business.[note: 14]Xiu operated the business without a\n                    permit and was fined twice before she terminated it. At around the same time,\n                    Xiu’s previous employer offered to sell her business to Xiu. She accepted\n                    this offer. The appellant contributed about $5,000 to this\n                        enterprise.[note: 15]Xiu subsequently spent even more time at\n                    work as she attempted to grow the business. As a result of their long working\n                    hours and loss of trust, the relationship between the appellant and Xiu\n                    inexorably broke down. Xiu testified that “sometimes his temperament was\n                    good, but sometimes it was bad.”[note: 16]However, she also affirmed that the appellant had never been\n                        violent and would never “lay a hand” on\n                        her.[note: 17]The divorce proceedings8       Sometime in March 2007, the appellant and Xiu\n                    had a heated argument because the appellant insisted that Xiu should stop\n                    working as a masseuse. More bitter recriminations followed and on 1 April\n                    2007, Xiu moved out of the matrimonial home to a rented flat\n                    (“Xiu’s flat”) with the deceased and GHK. It was also around\n                    this time that the appellant started working for M/s Loh.9       On 15 May 2007, Xiu initiated divorce\n                    proceedings citing unreasonable behaviour on the part of the\n                        appellant.[note: 18]The Statement of Particulars\n                    for the divorce alleged,inter alia, that after\n                    the marriage the appellant was easily irritated and often lost his temper.\n                    Further, it was asserted that in November 2005, the appellant made Xiu and the\n                    children leave the matrimonial home after Xiu took a lift home from a male\n                    customer late at night. He allegedly only allowed them to return home three\n                    months later.[note: 19]The appellant, who had no\n                    legal representation, did not contest the divorce proceedings. In early October\n                    2007, Xiu obtained sole custody of the deceased. She was also granted sole care\n                    and control of GHK while the appellant was granted access to GHK from 9.00am on\n                    Saturdays to 9.00pm on Sundays.[note: 20]Xiu, in the meantime, secured her Singapore\n                    citizenship in August 2007.[note: 21]10     After the divorce, the appellant and Xiu\n                    agreed that she would send GHK to City Hall MRT station every Saturday between\n                    11.00am to 12.00 noon where she would hand care and control of GHK to him. The\n                    appellant would then send GHK back to Xiu on Sunday nights.[note: 22]This arrangement soon led to further\n                    friction. The appellant stated in his police statement (and testified) that Xiu\n                    often did not allow him to have access to GHK by making up excuses at the last\n                        moment.[note: 23]Xiu, however, denied this.[note: 24]The appellant’s activities on the day of the incident11     On 20 October 2007, the appellant was\n                    entitled to have access to GHK as it was a Saturday. However, after working late\n                    into Friday night, he woke up at about 10.30am. As he did not have any driving\n                    assignment that day, he went for coffee at the market near his place until about\n                    12.00 noon.[note: 25]After that, he went home to attend to his\n                        laundry.[note: 26]At about 1.00pm, a friend invited him for a\n                    drink. He arrived at the coffee-shop at about 3.25pm. Together with four of his\n                    friends, the appellant stayed at the coffee-shop until about 9.00pm. During this\n                    period, they drank more than 20 bottles of beer, with the appellant consuming\n                    the most with another friend.[note: 27]12     After the appellant left the coffee-shop, he\n                    called Xiu to ask for access to GHK.[note: 28]However, Xiu told him that\n                    GHK was at her shop in East Coast and that if he wanted to see GHK, he would\n                    have to go to the shop.[note: 29]This upset the appellant and they heatedly quarrelled over the telephone. Xiu\n                    hung up on the appellant but the appellant called Xiu repeatedly and uttered\n                    profanities at her as he was very angry.[note: 30]13     After failing to obtain Xiu’s agreement\n                    on access to GHK that night, the appellant decided to go to Xiu’s flat.\n                    This was nearby. He walked back to his HDB block, retrieved his bicycle and\n                    cycled to Xiu’s flat. The appellant testified that he had gone to\n                    Xiu’s flat for several reasons. He wanted to know if the deceased was\n                    happy after obtaining her Singapore citizenship and to ascertain her examination\n                    results. He also hoped that when Xiu returned, he could bring GHK back to his\n                        place.[note: 31]Further, he wanted to ask the deceased why\n                    she had hit and threatened GHK.[note: 32]According to the appellant,\n                    this was not the first time he had questioned the deceased on this\n                        issue.[note: 33]These reasons were rejected by the trial\n                    judge who determined that the appellant had gone to Xiu’s flat solely to\n                    kill the deceased. We pause here to note that the Prosecution no longer supports\n                    this finding of fact by the trial judge: see[35]below.The events in Xiu’s flat leading to the homicide14     When the appellant arrived at Xiu’s\n                    place, the deceased opened the door and let him into the flat. At this time, the\n                    two sub-tenants of Xiu’s flat, Zhao Jing and Liu Qiao Xiao\n                    (“Liu”), were both in their bedroom. About two to three minutes\n                    later, Zhao Jing walked to the toilet in the kitchen to take a shower. As she\n                    did so, she saw the appellant sitting beside the deceased near the computer\n                    table in the living room and noted that they were “talking in a normal\n                    manner” and that they were “not quarrelling”.[note: 34]After her\n                    shower while returning to her room, Zhao Jing heard the appellant talking and\n                    his tone sounded like he was laughing.[note: 35]15     Soon after, Zhao Jing heard a loud scream. The\n                    deceased started calling out her name very loudly. Sensing that something was\n                    wrong, she opened her bedroom door and saw the deceased lying on the floor. The\n                    chair which the deceased was previously sitting on had toppled over and the\n                    appellant was squatting beside her. Zhao Jing moved closer to the kitchen and\n                    saw the appellant holding the deceased’s ear with one hand and her hair\n                    with his other hand. The appellant was banging the deceased’s head against\n                    the floor continuously and repeatedly shouted “Who am I” in\n                        Mandarin.[note: 36]In his testimony, the appellant claimed that\n                    the deceased was “very angry”, “disrespectful” and\n                    had suddenly taken “something” from the computer table before he\n                    grabbed hold of her.[note: 37]16     When Zhao Jing tried to persuade the appellant\n                    to release his hands, the appellant looked up at her. He stopped banging the\n                    deceased’s head against the floor but his hands were still on her ear and\n                    hair. The appellant was extremely agitated. He told Zhao Jing that he was the\n                    deceased’s father and that Xiu had abandoned him. At the same time, the\n                    deceased entreated Zhao Jing in a very weak voice to call\n                        “999”.[note: 38]Zhao Jing returned to her\n                    bedroom. Concluding that this was a case of family violence, she decided to call\n                    Xiu instead of the police. As Zhao Jing and Liu could not locate Xiu’s\n                    number on their mobile phones, Zhao Jing went to the living room to get the\n                    deceased’s mobile phone. The appellant did not prevent her from doing so.\n                    After retrieving it, Zhao Jing returned to her bedroom and called Xiu who told\n                    her that she was rushing back home and to call for the police.17     After the telephone conversation, Zhao Jing\n                    proceeded to the living room again and noticed that one of the appellant’s\n                    hands was on the deceased’s neck even though he was not applying any force\n                        then.[note: 39]He\n                    was simply sitting on the deceased who was lying on the floor.[note: 40]Zhao Jing\n                    tried to persuade him to release his hand but the appellant ignored her. He\n                    continued to complain aloud that Xiu had abandoned him and that she was a bad\n                    woman. As the appellant remained very agitated, Zhao Jing did not attempt to\n                    contradict him. She observed that, by then, the deceased had stopped moving and\n                    her face and feet had turned purplish.[note: 41]18     Zhao Jing then ran back to her room and, as\n                    she was doing so, noticed a knife handle without a blade lying by the side of\n                    the appellant. On returning to the room, Zhao Jing told Liu that she was going\n                    to the police post to seek help. When she found the police post closed, she\n                    returned to the flat and observed that the main gate had been padlocked. She\n                    gained entrance by using her keys to open the main gate and saw that the\n                    appellant was using his mobile phone whilst still sitting on top of the\n                        deceased.[note: 42]19     Zhao Jing left the flat again, without closing\n                    the gate and wooden door, to call the police using her phone. She met the police\n                    officers at the common staircase when they arrived and brought them to\n                    Xiu’s flat. As the wooden door had again been closed, she had to use her\n                    keys to open it.[note: 43]After entering the flat, she noticed that\n                    the appellant remained seated on top of the deceased. Zhao Jing then asked the\n                    appellant why he had hurt the deceased. In response, he once again started\n                    berating Xiu and all Chinese women.[note: 44]The appellant’s conduct after he strangled the\n                deceased20     It has been established that soon after the\n                    appellant strangled the deceased, he made several telephone calls using his\n                    mobile phone. He called his second brother, Ong Pang In (“Pang\n                    In”), to inform him that he had killed the deceased and that he\n                    “wanted to jump” to his death. He requested Pang In to cremate him\n                    and to throw the ashes into the sea.[note: 45]However, he was persuaded by\n                    Pang In to wait for the police to arrive. The appellant next called the sales\n                    manager of M/s Loh, Mr Loh Kian Choon (“Mr Loh”),\n                    to inform him of his actions and apologised for being unable to work for\n                    M/s Loh anymore. He also told Mr Loh that the key to the\n                    company’s bus was at his home.[note: 46]The appellant also\n                    called Xiu to tell her that he had killed the deceased. According to Xiu, he\n                    sounded calm and as if “he was the victor”.[note: 47]21     According to Staff Sergeant Lee Chee Mun\n                    Tarmizi (“Ssgt Lee”) of the Civil Defence Force, he and his\n                    crew arrived at Blk 24 of Marsiling Drive at about 10.34pm. When they\n                    reached the sixth floor staircase landing after coming out of the lift, they met\n                    a Chinese female (presumably Zhao Jing) who vigorously gestured to them and led\n                    them to Xiu’s flat.[note: 48]Ssgt Lee was the first to\n                    speak to the appellant. He asked the appellant to move aside. The appellant\n                    complied with this direction but repeatedly said to him “No hope”\n                    in Mandarin.[note: 49]22     Shortly after the police officers arrived at\n                    Xiu’s flat, the appellant gave his police statement to Sergeant Chng Chee\n                    Wee (“Sgt Chng”).[note: 50]In summary, the appellant stated\n                    that he did not go to Xiu’s flat with any intention of killing the\n                    deceased. He only formed such an intention after quarrelling with Xiu when he\n                    called Xiu whilst in the flat. The appellant then strangled the deceased (while\n                    apologising to the deceased at the same time) in order to cause Xiu to feel the\n                    pain of losing a loved one. This statement was relied upon by the trial judge to\n                    find that the appellant has gone to Xiu’s flat with the sole intention of\n                    killing the deceased.23     Three police officers testified that the\n                    appellant “smelt” of alcohol when they saw him.[note: 51]According to Sgt Chng, the\n                    appellant would suddenly alternate between laughing and crying while at\n                    Xiu’s flat.[note: 52]While the appellant was being interviewed\n                    by Station Inspector Low Soon Hoe in the temporary holding area, he appeared to\n                    be tipsy. Suddenly, he began to knock his head against the wall violently and\n                    had to be restrained.[note: 53]The appellant was subsequently given a\n                    medical examination at 1.24am on 21 October 2007, about three hours after\n                    the offence.[note: 54]His blood was also taken for alcohol testing\n                    (“BAC”) and found to contain 84 mg of ethanol per 100ml of\n                        blood.[note: 55]The autopsy report24     An autopsy was carried out on the deceased on\n                    21 October 2007.[note: 56]Dr Teo Eng Swee\n                    (“Dr Teo”), a consultant forensic pathologist at the Health\n                    Sciences Authority, certified that the deceased died from strangulation. During\n                    trial, he testified that “moderate to severe force” must have been\n                    applied to the deceased’s neck in order to cause\n                        strangulation.[note: 57]25     The autopsy report also revealed that the\n                    deceased suffered from several superficial incision and puncture wounds on her\n                    neck, limb and abdomen. Dr Teo testified that the broken blade found in\n                    Xiu’s flat was the cause of the incision and puncture wounds.[note: 58]He\n                    stated that the superficiality of the incision wounds at the neck suggested that\n                    they were not inflicted during a struggle; otherwise the incision would have\n                    been deeper or less even.[note: 59]However, he admitted that it\n                    was not possible to assert with any certainty whether these were peri or post\n                    mortem injuries.[note: 60]The trial judge’s decision26     As the fact of the killing was not disputed,\n                    the trial judge noted, inPublic Prosecutor v Ong Pang\n                        Siew[2009] 4 SLR(R) 474 (“the judgment”)\n                    (at [41]), that the only remaining issues were whether the appellant intended to\n                    cause the death of the deceased and whether he was entitled to the defence of\n                    diminished responsibility found in Exception 7 of s 300 of the Penal\n                    Code.27     The trial judge rejected the appellant’s\n                    evidence that he had gone to Xiu’s flat to wait for GHK (see [42] of the\n                    judgment). He relied on the fact that the appellant was free for the whole of\n                    that Saturday but chose to spend his time doing household chores and drinking\n                    beer with his friends for five to six hours. The trial judge found (at [43] of\n                    the judgment) that the appellant felt betrayed by Xiu after he had given her and\n                    the deceased a new life in Singapore. After the quarrel over the phone with Xiu\n                    about access to GHK, the appellant had proceeded to Xiu’s flat with the\n                    intention of killing the deceased so that Xiu could experience the pain of\n                    losing a loved one in the same way that he did after the family broke up (see\n                    [43] and [47] of the judgment).28     The trial judge took into account the\n                    following conduct of the appellant in determining that he was rational and had\n                    intended to kill the deceased:(a)     After the deceased was pinned to the\n                        floor by the appellant, he carried on hitting her head against the floor,\n                        sat on top of her and strangled her. The appellant knew what he was doing\n                        and was able to respond coherently to Zhao Jing’s pleas to let the\n                        deceased go (see [44] of the judgment).(b)     The appellant obviously used the knife’s\n                        blade to make controlled and deliberate cuts on the deceased’s body.Whether the appellant inflicted the wounds before or\n                            after the deceased’s death made no material difference since they\n                            were intentional(see [45] of the\n                    judgment).(c)     The\n                        appellant’s conversations with Mr Loh and Xiu after the\n                        deceased’s death and the subsequent communication with the police\n                        officers who arrived at Xiu’s flat,vizhis request to go to the toilet, his knowledge of how serious his actions\n                        were and that he would pay with his own life, showed his clarity of mind\n                        (see [46] of the judgment).29     As for the defence of diminished\n                    responsibility, the trial judge rejected the defence’s expert’s\n                    opinion that the appellant suffered from major depressive disorder. Instead, he\n                    accepted the Prosecution’s expert’s opinion that the appellant had\n                    no mental illness (see [53] of the judgment). He held that even if the appellant\n                    was suffering from a major depressive episode, there had been no substantial\n                    impairment of his mental responsibility for his acts that night (see [54] of the\n                    judgment). Accordingly, he found that the Prosecution had made out its case\n                    against the appellant beyond a reasonable doubt and that the defence of\n                    diminished responsibility failed on a balance of probabilities. The appellant\n                    was found guilty and convicted of murder.Submissions by the parties30     In this appeal, the appellant’s\n                    submissions centred upon three issues. It was argued that:(a)     the appellant did not intend to kill\n                        the deceased (“the s 300(a)\n                    submission”);(b)     the appellant did not intend to inflict the injury which resulted in\n                        the death of the deceased (“the s 300(c) submission”);\n                        and(c)     the\n                        appellant qualified for the defence of diminished responsibility because he\n                        was suffering from a major depressive disorder which led to a substantial\n                        impairment of his mental responsibility at the time of the offence\n                        (“the diminished responsibility\n                submission”).31     The Prosecution, on the other hand, submitted\n                    as follows:(a)     the trial judge’s finding that\n                        the appellant possessed the intention to kill the deceased should not be\n                        disturbed as the appellant was capable of rational thought at the material\n                        time. The finding of facts was not plainly wrong or arrived at against the\n                        weight of the evidence on record;[note: 61](b)     the appellant, by strangling the deceased, intended to\n                        cause the injuries to her neck which was sufficient in the ordinary course\n                        of nature to cause death;[note: 62]and(c)     the trial judge was correct in holding that the\n                        appellant was not suffering from an abnormality of mind which substantially\n                        impaired his mental responsibility at the time he killed the\n                            deceased.[note: 63]32     We preface our review of the matter by\n                    pointing out that if the defence of diminished responsibility is made out, the\n                    conviction of murder will have to be set aside and substituted by a conviction\n                    of culpable homicide not amounting to murder as provided by Exception 7 in\n                    s 300 of the Penal Code.The decision of the courtThe s 300(a) and (c) submissions33     We will first address, briefly, the trial\n                    judge’s finding of fact that the appellant had gone to Xiu’s flat\n                    with the sole intention of killing the deceased. He held that the appellant\n                    intended to cause the deceased’s death when he went to Xiu’s flat\n                    (see [42]–[47] of the judgment). However, in our view, this finding is not\n                    supported by the evidence. The appellant had called Xiu at about 8.39pm on the\n                    day of the offence to ask for access to GHK. A heated quarrel soon ensued\n                    between them. Much was made of this fact by the Prosecution in the High Court to\n                    establish that the appellant had proceeded to Xiu’s flat with the\n                    intention of killing the deceased as he was very angry with her.[note: 64]The trial judge accepted this\n                    submission and observed that if the appellant had really wanted to see GHK, he\n                    could have gone to Xiu’s shop in the East Coast to pick him\n                        up.[note: 65]34     However, it should also be noted that the\n                    appellant knew that Xiu would eventually return to the flat with GHK and he\n                    could pick GHK up from Xiu’s flat, which was only a few minutes away from\n                    his home. There was thus good reason for the appellant to go directly to\n                    Xiu’s flat in Marsiling instead of going to her shop in East Coast which\n                    was much farther away and required motorised transport to reach. Furthermore, if\n                    the appellant had indeed gone to Xiu’s flat just to kill the deceased,\n                    there was no explanation for the time he spent amiably conversing with her. He\n                    also knew that there were tenants in Xiu’s flat who would recognise him if\n                    he harmed the deceased. Zhao Jing had testified that when she first saw the\n                    appellant, he was talking to the deceased in a normal manner and they were not\n                    quarrelling. In fact, she stated that the appellant’s tone “sounded\n                    like he was laughing”.[note: 66]Further, he made no attempt to\n                    conceal his identity from Zhao Jing and Liu and in fact revealed to Zhao Jing\n                    that he was the deceased’s father. In addition, the police statement\n                    recorded by Sgt Chng at Xiu’s flat, which the trial judge relied on\n                    in concluding that the appellant had intended to cause the deceased’s\n                    death, also clearly emphasised that the appellant had gone to Xiu’s flat\n                    without any intention of killing her. Sgt Chng recorded the appellant as\n                    informing him that “[the appellant] came to the unit withno intentionto kill [the deceased] at\n                        all”[note: 67][emphasis added].35     In the course of oral submission, the\n                    Prosecution conceded, after questioning from this court, that the evidence could\n                    not support the trial judge’s finding that the appellant had gone to the\n                    flat with the intention of killing the deceased. Instead, it submitted that the\n                    appellant had probably formed the intention after he had “snapped”. This concession necessarily throws a\n                    different light on the subsequent events that led to the killing of the deceased\n                    by the appellant. We should add that if the Prosecution had not made this\n                    concession, we would have found this to be a fact.[note: 68]36     We accept that after he\n                    “snapped”, the appellant intended to seriously harm, if not kill,\n                    the deceased. He must have known that his act of strangling her might likely\n                    kill her or, at the very least, cause injuries that would in the ordinary course\n                    have been sufficient to kill her. The pathologist confirmed that moderate to\n                    severe force was used in the strangulation. The death was not an accident. There\n                    is also undisputed evidence that while strangling the deceased, the appellant\n                    also apologised to her for the harm caused. This was recorded by Sgt Chng\n                    on a piece of paper (and subsequently copied to his police patrol log sheet)\n                    when he interviewed the appellant at Xiu’s flat.[note: 69]We further note\n                    that after the deceased stopped moving, the appellant called in quick succession\n                    Pang In, Mr Loh as well as Xiu to inform them that he had killed the\n                    deceased. Certainly, at some level of consciousness the appellant was aware of\n                    what he was doing. In the circumstances, we accept that the Prosecution has\n                    established that the appellant intentionally committed an act of homicide. The\n                    crucial issue is whether he was suffering from diminished responsibility at the\n                    material time.37     The trial judge rejected this defence because\n                    he found that the appellant was “lucid and knew what he was\n                    doing”. The trial judge also thought that the appellant’s ability\n                    to respond coherently to Zhao Jing’s pleas to let go of the deceased\n                    “pointed clearly to a rational person in possession of all his\n                    senses” (at [54] of the judgment). With respect, this finding (for the\n                    reasons we give below) over-simplified a complex amalgam of issues. It failed to\n                    adequately take into account a crucial mass of evidence which unmistakeably\n                    shows that many aspects of the appellant’s conduct that night were nothing\n                    short of bizarre, if not entirely abnormal, when assessed holistically. The fact\n                    that an accused may seem to behave rationally or respond coherently at different\n                    points during an offending incident is by no means determinative of the\n                    applicability of the defence of diminished responsibility (see below at[61]). Individuals suffering from some\n                    types of serious mental illnesses do not entirely lose their ability to think or\n                    function normally throughout (or even after) an offending episode. A failure to\n                    appreciate this aspect of certain types of mental illnesses can lead to an\n                    erroneous rejection of this statutory defence.Defence of diminished responsibilityAssessment of expert evidence by an appellate court38     In this case, the expert witnesses called by\n                    the Prosecution and the appellant could not agree on whether, at the material\n                    time, the appellant was suffering from a major depressive episode that caused an\n                    abnormality of mind that substantially impaired his mental responsibility for\n                    his acts in causing the death of the deceased. The principles to be applied by\n                    an appellate court in assessing a trial judge’s findings on expert\n                    evidence have been set out inSakthivel Punithavathi v Public\n                        Prosecutor[2007] 2 SLR(R) 983 as follows:74    An appellate court will be slow to criticise\n                            without good reason a trial court's findings on expert evidence; see the\n                            Privy Council case ofAntonio Caldeira Dias v\n                                Frederick Augustus GrayAIR 1936 Journal 154 at 155, 157\n                            and 158, ...However, if the appellate court\n                                entertains doubts as to whether the evidence has been satisfactorily\n                                sifted or assessed by the trial court it may embark on its own\n                                critical evaluation of the evidence focussing on obvious errors of\n                                fact and/or deficiencies in the reasoning\n                        process.75    Where there is conflicting evidence between experts\n                            it will not be the sheer number of experts articulating a particular\n                            opinion or view that matters, but rather the consistency and logic of\n                            the preferred evidence that is paramount. Generally speaking, the court\n                            should also scrutinise the credentials and relevant experience of the\n                            experts in their professed and acknowledged areas of expertise. Not all\n                            experts are of equal authority and/or reliability. In so far as medical\n                            evidence is concerned, an expert with greater relevant clinical\n                            experience may often prove to be more credible and reliable on\n                            “hands-on” issues although this is not an inevitable rule\n                            of thumb. Having said that, there is no precise pecking order or\n                            hierarchy relating to expert evidence. Experts may sometimes be\n                            abundantly eminent while lacking credibility in a particular\n                            matter.76    What is axiomatic is that a judge is not entitled\n                            to substitute his own views for those of an uncontradicted expert's:Saeng-Un Udom v PP[2001]\n                            2 SLR(R) 1. Be that as it may, a court must not on the other\n                            hand unquestioningly accept unchallenged evidence. Evidence must\n                            invariably be sifted, weighed and evaluated in the context of the\n                            factual matrix and in particular, the objective facts. An expert's\n                            opinion “should not fly in the face of proven\n                                extrinsic facts relevant to the matter”... In\n                            reality, substantially the same rules apply to the evaluation of expert\n                            testimony as they would to other categories of witness testimony.\n                            Content credibility, evidence of partiality, coherence and a need to\n                            analyse the evidence in the context of established facts remain vital\n                            considerations; demeanour, however, more often than not recedes into the\n                            background as a yardstick.[emphasis added]Before setting out the expert witnesses’ respective opinions, it\n                    would be useful to discuss the symptoms and established guidelines for the\n                    diagnosis of a major depressive episode.Major depressive disorder – nature and guidelines for\n                diagnosis39     Both expert witnesses relied on theDiagnostic and Statistical Manual of Mental Disorders(4th Ed) (“DSM-IV-TR”). TheDSM-IV-TRis published by the American\n                    Psychiatric Association. It provides the standard classification of mental\n                    disorders used by mental health professionals around the world and is used in\n                    their diagnosis of patients across different clinical settings.[note: 70]40     In order to establish a diagnosis of major\n                    depressive episode, there are several criteria which have to be\n                        satisfied.[note: 71]In the context of this appeal,\n                    Criteria B, D and E are not relevant. Criterion B is concerned with\n                    symptoms relating to a mixed episode (consisting of both manic episode and major\n                    depressive episode). Criteria D and E deal with symptoms arising directly\n                    from the physiological effects of a substance or general medical condition and\n                    with symptoms not accounted for by bereavement. Only Criteria A and C are\n                    relevant, and they state:[note: 72]Criteria for Major Depressive EpisodeA.Five (or more) of\n                            the following symptoms have been present during the same 2-week period\n                            and represent a change from previous functioning; at least one of the\n                            symptoms is either (1) depressed mood or (2) loss of interest or\n                            pleasure.Note:  Do not include symptoms that are clearly due\n                                to a general medical condition, or mood-incongruent delusions or\n                                hallucination.(1)    depressed mood most of the day, nearly every\n                                day, as indicated by either subjective report (e.g., feels sad or\n                                empty) or observation made by others (e.g., appears tearful).\n                                …(2)    markedly diminished interest or pleasure in\n                                all, or almost all, activities most of the day, nearly every day (as\n                                indicated by either subjective account or observation made by\n                                others)(3)    significant weight loss when not dieting or\n                                weight gain (e.g., a change of more than 5% of body weight in a\n                                month), or decrease or increase in appetite nearly every day.\n                                ...(4)    insomnia or hypersomnia nearly every\n                                day(5)    psychomotor agitation or retardation nearly\n                                every day (observable by others, not merely subjective feelings of\n                                restlessness or being slowed down)(6)    fatigue or loss of energy nearly\n                                everyday(7)    feelings of worthlessness or excessive or\n                                inappropriate guilt (which may be delusional) nearly every day (not\n                                merely self-reproach or guilt about being sick)(8)    diminished ability to think or concentrate, or\n                                indecisiveness, nearly every day (either by subjective account or as\n                                observed by others)(9)    recurrent thoughts of death (not just fear of\n                                dying), recurrent suicidal ideation without a specific plan, or a\n                                suicide attempt or a specific plan for committing\n                            suicide...C.    The symptoms cause clinically significant distress\n                            or impairment in social, occupational, or other important areas of\n                            functioning.41     TheDSM-IV-TRprovides (at pp 349–350) that the essential feature of a major\n                    depressive episode is a period of at least two consecutive weeks during which\n                    there is either depressed mood or the loss of interest or pleasure in nearly all\n                        activities.[note: 73]It further states that “[f]amily\n                    members often notice social withdrawal or neglect of pleasurable\n                    avocations” and appetite is usually reduced. Many who suffer from a major\n                    depressive episode feel that they have to force themselves to eat and where\n                    appetite reduction is severe; there may be a significant loss in\n                        weight.[note: 74]42     TheDSM-IV-TRalso emphasises (at p 351) the importance of a careful interview in the\n                    elicitation of symptoms of a major depressive episode:A careful interview is essential to elicit symptoms of\n                            a Major Depressive Episode. Reporting may be compromised by difficulties\n                            in concentrating, impaired memory, or a tendency to deny, discount, or\n                            explain away symptoms. Information from additional informants can be\n                            especially helpful in clarifying the course of current or prior Major\n                            Depressive Episodes and in assessing whether there have been any Manic\n                            or Hypomanic Episodes. [emphasis added]43     In conducting a diagnosis of a patient, it is\n                    important to ensure that the interviews with the patient are carried out\n                    carefully. Additional information from people who would ordinarily interact with\n                    the patient would be especially useful. Obviously, the patient, being unwell,\n                    may not be the best source of information of his own mental state. It is also\n                    not unusual for patients to play down their difficulties or be in a state of\n                    denial.DSM-IV-TRfurther highlights that the\n                    evaluation of the symptoms of a major depressive episode is especially difficult\n                    when they occur in an individual who also has a general medical condition\n                        (eg, cancer, stroke, myocardial infarction and\n                    diabetes) due to the overlap in their signs and symptoms. Such symptoms should\n                    count towards a major depressive episode unless they areclearly and fullyaccounted for by a general medical condition.\n                    Statistics stated inDSM-IV-TRshow that up to 20%\n                    to 25% of individuals with these aforesaid medical conditions will develop a\n                    major depressive disorder during the course of their general medical\n                        conditions.[note: 75]In theClinical Practice\n                        Guidelines, Depressionpublished in March 2004 (Ministry of\n                    Health, Singapore), it is noted (at p 4) that there is a high prevalence of\n                    depression in Singapore, with a percentage of 8.6% in adults. Further,\n                    depression can co-exist with many medical conditions such as cancers\n                    (25%–38%), diabetes (24%) or coronary artery disease\n                        (16%–19%).[note: 76]44     Several other factors which may lead to or\n                    contribute to a major depressive disorder as provided in theDSM-IV-TRshould be noted at this point. First, episodes of a\n                    major depressive disorder often follow a severe psycho-social stressor, such as\n                    the death of a loved one or a divorce.[note: 77]Also, substance dependence\n                    (particularly alcohol or cocaine dependence) may contribute to the onset or\n                    exacerbation of a major depressive disorder.[note: 78]Third, a major depressive\n                    disorder is one point five to three times more common among first-degree\n                    biological relatives of persons with this disorder than among the general\n                        population.[note: 79]45     Having considered the symptoms and guidelines\n                    for the diagnostic process of a major depressive episode, we now set out the\n                    expert opinions.The appellant’s expert evidence46     At the trial, Dr Tommy Tan\n                    (“Dr Tan”), a psychiatrist of some 15 years’\n                    experience who is currently in private practice, testified on behalf of the\n                    appellant. Dr Tan graduated from the National University of Singapore and\n                    has a Master of Medicine degree in Psychiatry. He was previously the senior\n                    consultant in the Department of Forensic Psychiatry of the Institute of Mental\n                        Health.[note: 80]He has given expert evidence in the High\n                    Court on behalf of the Prosecution in capital cases on numerous\n                        occasions.[note: 81]47     Dr Tan examined the appellant on three\n                    occasions in August 2008. He communicated with the appellant in the Hokkien\n                    dialect as the appellant was more comfortable conversing in Hokkien than in\n                    Mandarin. Dr Tan said this helped him to establish good rapport with the\n                    appellant and allowed him to elicit more information from him.[note: 82]Dr Tan also interviewed Pang In, the appellant’s second sister, Sally\n                    Ong (“Sally”), and fourth sister, Ong Ah Soi. Before examining the\n                    appellant, Dr Tan read the report of the Prosecution’s expert,\n                    Dr Jerome Goh Hern Yee (“Dr Goh”), dated\n                    21 November 2007 (“Dr Goh’s first report) and the nursing\n                    observation charts at the Changi Complex Medical Centre where the appellant was\n                        remanded.[note: 83]48     In his report dated 25 August 2008\n                    (“Dr Tan’s report”), Dr Tan noted that the\n                    appellant has a “strong family history of mental\n                        disorder”[note: 84]and gave a description of the\n                    appellant’s background, his marital problems with Xiu, his psychiatric\n                    symptoms and observations of his recent behaviour by his family members.\n                    Dr Tan gave his psychiatric diagnosis as follows:[note: 85]Psychiatric DiagnosisMr Ong Pang Siew hasmajor depressive disorder,\n                            single episode of moderate severity, chronic(296.22,\n                        Diagnostic and Statistical Manual IV-TR) ormoderate\n                            depressive episode without somatic syndrome(F32.10,\n                        International Classification of Diseases, edition 10) at the time of the\n                        alleged offence.It is characterised by a moderately severe depressed mood, feelings of\n                        frustration, irritability, lethargy, insomnia, loss of appetite, loss of\n                        weight, difficulty coping with work, negative thoughts and thoughts of\n                        dying. He drank alcohol to help him to sleep and to cope with his depressed\n                        mood.He has depressed mood since 2005 or earlier. His mental disorder was\n                        exacerbated by the divorce and the difficulties of having access to his\n                        son.He hadacute alcohol intoxication(303.00\n                        DSM IV-TR; F10.0, ICD 10) at the time of the alleged offence. He and his\n                        companions had drunk more than twenty bottles of beer from afternoon until\n                        evening. He was tipsy after drinking.Mental State at the time of the alleged\n                            offencePang Siew has major depressive disorder at the time of the alleged\n                        offence. He was already depressed in mood. His depressive disorder made him\n                        irritable. His wife had refused to let him have access to his son which made\n                        him more frustrated and depressed.He had been drinking for at least 5 to 6 hours before the alleged\n                        offence.He became very agitated by his stepdaughter. When his stepdaughter took a\n                        knife, his actions were initially reactive or defensive. He was so agitated\n                        that he lost his control of his actions. He was acting impulsively. He was\n                        not aware of the consequences of his actions until after his stepdaughter\n                        died.He qualifies for the defence of diminished responsibility. He was\n                        suffering from major depressive disorder that caused an abnormality of mind\n                        that substantially impaired his mental responsibility for his acts in\n                        causing the death of his stepdaughter.[emphasis in underline and bold in original]The Prosecution’s expert evidence49     In rebuttal of Dr Tan’s evidence,\n                    the Prosecution called Dr Goh to give his expert opinion. Dr Goh has a\n                    Masters degree in Psychiatry Medicine and a Masters degree in Clinical Forensic\n                    Psychiatry & Psychology (London). He has been an associate consultant at the\n                    Institute of Mental Health for about eight years. In these eight years,\n                    Dr Goh has given expert evidence once in the High Court and five times in\n                    the Subordinate Courts.[note: 86]The evidence in the High Court was on the\n                    mental health of an accused charged with a sexual offence. This case was the\n                    first occasion when Dr Goh gave expert evidence on the mental state of an\n                    accused facing a capital charge.[note: 87]50     Dr Goh examined the appellant on three\n                    occasions in November 2007 about three weeks after the offence. Unlike\n                    Dr Tan, Dr Goh conducted his examination of the appellant in\n                        Mandarin,[note: 88]notwithstanding the fact that the appellant was\n                    “more comfortable with Hokkien”[note: 89]and had told Dr Goh\n                    that he would “like to speak in Hokkien.”[note: 90]Although\n                    Dr Goh explained to the appellant that he could seek any clarification\n                    needed, he conceded that he did not tell the appellant that he could provide an\n                    interpreter for the examination.[note: 91]51     Before diagnosing the appellant, Dr Goh\n                    spoke to Pang In and another sister of the appellant, Ong Tok May (“Tok\n                    May”), on 15 November 2007. It appears that only brief details about\n                    the appellant’s behaviour were obtained during this meeting. Dr Goh\n                    learnt that the appellant was feeling “pek\n                        chek” (frustrated) and “a bit sad” but was\n                    able to work.[note: 92]The focus of that particular interview was on\n                    the appellant’s family history of mental disorder. Pang In suffered from\n                    depression and was then undergoing follow-up sessions. In addition, Tok May was\n                    taking haloperidol, an anti-psychotic drug because “she thinks a\n                        lot”.[note: 93]Also, the appellant’s mother had taken\n                    some prescribed medication at a private clinic “to calm\n                    down”.52     Dr Goh wrote two reports. The first,\n                    earlier referenced as “Dr Goh’s first report”, was\n                    dated 21 November 2007 (see[47]above)\n                    and the other was dated 15 September 2008 (“Dr Goh’s\n                    second report”). In Dr Goh’s first report,[note: 94]he gave a\n                    brief account of the appellant’s personal background, his marital history\n                    and noted that Pang In said the appellant was not “physically or verbally\n                    aggressive by nature and that he is very responsible in his work and well liked\n                    by his bosses”.[note: 95]The material part of Dr Goh’s first\n                    report stated:Background History:This is his first contact with the psychiatric services. One of his\n                        brothers is being treated for depression. Prior to killing, his mood has\n                        been low because of his marital difficulties, but he was able to function at\n                        work and did not receive any complaints about his work performance....Personal History:... He has been a bus driver for the past twenty years, often working many\n                        years for the same company. He was with the present company for seven months\n                        at the time of the offence. He has diabetes and hypertension, followed-up at\n                        a polyclinic....Mental State Examination:He was relevant and coherent in Mandarin during the interviews. He was not\n                        depressed. The nurses did not observe any psychotic or agitated behaviour\n                        during this remand.Opinion:I am of the opinion that:1.Mr Ong Pang Siew has no mental illness.However the effects of recent ingestion of alcohol and the\n                                heightened emotions during altercations with his wife and the victim\n                                that night, in a background of severe and longstanding marital and\n                                family problems, had contributed to his actions leading to the\n                                offence.2.He was not of unsound mind at the time of the\n                                alleged offence.3.He is currently fit to plead in a Court of\n                                Law.[emphasis in bold italics and underline in original, emphasis in italics\n                        added]53     Dr Goh’s second report was written\n                    after he had the opportunity to consider Dr Tan’s report. This\n                    report, in its entirety, read:[note: 96]ONG PANG SIEWMALENRIC NO: S1573035HDOB 17 AUGUST 1962I refer to your letter dated 29th August 2008. I have read Dr Tommy\n                        Tan’s report dated 25th August 2008 and considered his findings and\n                        opinions.I interviewed Pang Siew between about three to four weeks after the death\n                        of his step-daughter. He did describe experiencing low mood prior to the\n                        killing, contributed by his marital problems and difficulty having access to\n                        his son. However, he said his appetite had been normal. He did not have any\n                        psychotic symptoms. He was also not suicidal.He described having depressive symptoms such as lethargy, guilt and poor\n                        sleep, but said these symptoms surfaced after his step-daughter’s\n                        death. He had felt very guilty and remorseful for his actions. He said he\n                        was crying while he was strangling her, because he felt hurt that they\n                        treated him poorly. When told by the ambulance crew that she had died, he\n                        cried again.The psychiatric nursing observations did not observe him to have any\n                        persistent depressive symptom during his remand. Moreover, having a major\n                        depressive episode would have impacted significantly on his functioning. He\n                        was still able to fulfil his obligations at work as a bus driver leading to\n                        the offence. He had no complaints about his work performance and did not\n                        have any accident, complaints from his passengers or conflicts with other\n                        motorists.Hence, I am of the opinion that Pang Siew did not have a major depressive\n                        disorder around the time of the offence.54     Although both Dr Tan and Dr Goh\n                    acknowledged the significance of the appellant’s family history of mental\n                    disorder, neither of them enquired deeply into the precise nature of the mental\n                    disease(s) affecting the appellant’s family members and whether they were\n                    hereditary in nature.[note: 97]As stated\n                    (at [29] above), the trial judge accepted Dr Goh’s evidence that the\n                    appellant was not suffering from a major depressive episode at the time of the\n                    offence.55     Before we evaluate the evidence of the two\n                    experts, it will be useful to set out generally the law on the defence of\n                    diminished responsibility.Law on diminished responsibility56     The defence of diminished responsibility is\n                    encapsulated in Exception 7 of s 300 of the Penal Code, which reads as\n                    follows:Culpable homicide is not murder if the offender was suffering from such\n                        abnormality of mind (whether arising from a condition of arrested or\n                        retarded development of mind or any inherent causes or induced by disease or\n                        injury) as substantially impaired his mental responsibility for his acts and\n                        omissions in causing the death or being a party to causing the death.57     Exception 7 was derived from s 2 of\n                    the English Homicide Act, 1957: see second reading of the Penal Code (Amendment)\n                    Bill,Singapore Parliamentary Debates, Official\n                        Report(24 May 1961), vol 14 at\n                    col 1509–1510 (K M Byrne, Minister for Labour and Law). The\n                    effect of this defence is that:where the [fact-finder is] satisfied that a person charged with murder,\n                        though not insane, suffered from mental weakness or abnormality bordering on\n                        insanity to such an extent that his responsibility was substantially\n                        diminished, the crime may be reduced from murder to culpable\n                        homicide.(seeReport of the Royal Commission on Capital\n                        Punishment(1949–1953) (Cmnd 8932) at para 378). The\n                    defence attempts to distinguish between different levels of control or\n                    consciousness that a particular accused may have when the homicide is committed.\n                    An accused who kills while suffering from the prescribed state of mental\n                    abnormality is seen by the law to be morally less culpable and less deserving of\n                    extreme punishment than one in full possession of his faculties. However, as\n                    Professor Glanville Williams has penetratingly observed in Glanville Williams,Textbook pf Criminal Law(Stevens & Sons,\n                    2nd Ed, 1983) at p 686:[I]t has meant that psychiatrists have been put under pressure to testify\n                        in terms that go beyond their professional competence ... [as the]\n                        requirement that the defendant’s abnormality of mind should have\n                        substantially impaired his mental responsibility, is as embarrassing a\n                        formula for a scientifically-minded witness as could be devised.58     It is trite law that the appellant bears the\n                    burden of proving the defence of diminished responsibility on a balance of\n                    probabilities: seeChua Hwa Soon Jimmy v Public\n                        Prosecutor[1998] 1 SLR(R) 601 (at [8])\n                        (“Jimmy Chua”). InTook Leng How v Public Prosecutor[2006]\n                    2 SLR(R) 70, this Court reiterated (at [46]) the three-limb test which\n                    an accused has to satisfy to establish the defence of diminished\n                    responsibility:(a)     the accused was suffering from an\n                        abnormality of mind at the time he caused the victim’s\n                    death;(b)     the\n                        abnormality of mind arose from a condition of arrested or retarded\n                        development of mind or any inherent causes, or was induced by disease or\n                        injury; and(c)     the\n                        abnormality of mind substantially impaired the accused’s mental\n                        responsibility for his acts and omissions in causing the\n                    death.59     This court held that whilst limb (b)\n                    (otherwise known as the aetiology or root cause of the abnormality) is a matter\n                    largely within the purview of expert opinion, limb (a) and limb (c)\n                    are matters which cannot be the subject of any medical opinion and must be left\n                    to the determination of the trial judge, as the finder of fact. In doing so, the\n                    trial judge is, in the words of Lord Keith of Kinkel inWalton v The Queen[1978] 1 AC 788 (at 793):entitled and indeed bound to consider not only the\n                            medical evidence but the evidence upon the whole facts and circumstances\n                            of the case. These include the nature of the killing, the conduct of the\n                            defendant before, at the time of and after it and any history of mental\n                            abnormality. … That task is to be approached in a broad common\n                            sense way. [emphasis added]60     Hence, in considering whether the defence of\n                    diminished responsibility has been established, not only does the trial judge\n                    have to consider the medical evidence, he is also required to take into account\n                    all other relevant facts and circumstances of the case, including the conduct of\n                    the accused before, during and after the offence: seeJimmy\n                        Chua(at [28]–[29]).61     What amounts to an “abnormality of\n                    mind” under the defence of diminished responsibility has been explicated\n                    inR v Byrne[1960] 2 QB 396 (at 403)\n                        (“R v Byrne”) by\n                    Lord Parker CJ as follows:“Abnormality of mind,” … means a state of mind so\n                        different from that of ordinary human beings that the reasonable man would\n                        term it abnormal. It appears to us to be wide enough to cover the\n                        mind’s activities in all its aspects, not only the perception of\n                        physical acts and matters, and the ability to form a rational judgment as to\n                        whether an act is right or wrong, but also the ability to exercise the will\n                        power to control physical acts in accordance with that rational judgment.The expression “mental responsibility for his\n                            acts” points to a consideration of the extent to which the\n                            accused’s mind is answerable for his physical acts which must\n                            include a consideration of the extent of his ability to exercise will\n                            power to control his physical acts. [emphasis added]62     This interpretation was accepted as correct\n                    and authoritative by the Privy Council inElvan Rose v The\n                        Queen[1961] AC 496 (at 507). Lord Tucker\n                    clarified (at 507–508) that the test is not necessarily “the\n                    borderline of insanity”:Their Lordships respectfully accept this interpretation of the words\n                        “abnormality of mind” and “mental\n                        responsibility” as authoritative and correct. They would not,\n                        however, consider that the Court of Criminal Appeal was intending to lay\n                        down that in every case the jury must necessarily be directed that the test\n                        is always to be the borderline of insanity. There may be cases in which the\n                        abnormality of mind relied upon cannot readily be related to any of the\n                        generally recognised types of “insanity.” If, however,\n                        insanity is to be taken into consideration, as undoubtedly will usually be\n                        the case, the word must be used in its broad popular sense. It cannot too\n                        often be emphasised that there is no formula that can safely be used in\n                        every case—the direction to the jury must always be related to the\n                        particular evidence that has been given and there may be cases where the\n                        words “borderline” and “insanity” may not be\n                        helpful.Lord Tucker correctly emphasised that “a man may know what he is doing and intend to do it and yet suffer from\n                        such abnormality of mind as substantially impairs his mental\n                        responsibility” (at 508).63     Lord Parker CJ’s\n                    interpretation inR v Byrneof the term\n                    ‘abnormality of mind’ has also been accepted by this Court inJimmy Chua(at [22]) andMansoor s/o Abdullah and another v Public Prosecutor[1998]\n                    3 SLR(R) 403 (at [13]) for the purposes of limb (a) of\n                    Exception 7. InJimmy Chua(at [23]), this\n                    court approvingly citedR v Seers(1984)\n                    79 Cr App R 261, where Griffiths LJ held that chronic reactive\n                    depression could on the evidence before him sustain the defence of diminished\n                    responsibility. We should add that the nature of the causative injury can be\n                    either physical or psychological. A reactive depression caused by extreme\n                    adversity or stress may establish the exception: seeR v\n                        Bathurst[1968] 2 QB 99;G\n                        Krishnasamy Naidu v Public Prosecutor[2006]\n                    4 SLR(R) 874 (“Naidu”);Public Prosecutor v Juminem and another[2005]\n                    4 SLR(R) 536 (“Juminem”).64     What in fact amounts to a substantial\n                    impairment of mental responsibility is largely a question of commonsense to be\n                    decided by the trial judge as the finder of fact. As a working guide,\n                    substantial does not require a total impairment; neither is it trivial nor\n                    minimal: seeJuminem(at [30]) applyingRegina v Lloyd[1967] 1 QB 175 (at 178).As stated above, while medical evidence would be\n                        important in determining the presence and/or extent of impairment, whether\n                        an accused’s mental responsibility was substantially impaired is\n                        ultimately a question to be decided by the court based on all the evidence\n                        before it: seeZailani bin Ahmad v Public\n                        Prosecutor[2005] 1 SLR(R) 356 (at [52]). The courts\n                    have flexibly construed similar provisions in England and New South Wales and\n                    have declined to confine the defence to just clinically recognised illnesses.\n                    Indeed, the phrase “abnormality of mind” is wide enough to cover\n                    all aspects of the mind’s activities including transient or ephemeral\n                    manifestations of illnesses, though as a matter of construction (and policy) the\n                    courts have excluded “mental disorders” solely attributable to the\n                    consumption or mal-administration of alcohol, drugs or other like substances.\n                    Such disorders are not due to inherent causes. The exception would also not\n                    apply to emotions of rage, prejudices, hate, passing jealousy and the like\n                    unless they are due to inherent causes rather than external stimuli alone.\n                    However, if those emotions trigger an inherent internal derangement that\n                    culminates in a pathological condition (eg, morbid\n                    jealousy), then the exception could apply: see Naidu at\n                ([9]–[10]).65     In reviewing the trial judge’s decision,\n                    we are conscious that, as an appellate court, we should be slow to overturn his\n                    findings of fact unless they can be shown to be plainly wrong or against the\n                    weight of the evidence. However, when it comes to inferences of facts to be\n                    drawn from the actual findings, a different approach will be taken. An appellate\n                    court in such cases is as competent as any trial judge to draw any necessary\n                    inferences of fact from the circumstances of the case. Intervention by an\n                    appellate court is justified when the inferences drawn by a trial judge are not\n                    supported by the primary or objective evidence on record:Jagatheesan s/o Krishnasamy v Public Prosecutor[2006]\n                    4 SLR(R) 45 (at [38]).Evaluation of the expert witnesses’ diagnosis66     Dr Goh, in his evidence, accepted that in\n                    order to diagnose the appellant’s mental condition, it was necessary for\n                    him to examine the appellant and to obtain information from those close to him\n                    on whether the appellant was suffering from any impairment of functioning in the\n                    relevant period.[note: 98]Further, when evaluating the symptoms of\n                    depression elicited from the appellant, he had to clarify whether there was any\n                    significant impairment in his social functioning, such as his interaction with\n                    friends, his time spent with his son and whether there was any occupational\n                    impairment such as inability or difficulty in carrying on with his\n                        work.[note: 99]67     This approach appears in line with the\n                    guidelines in the diagnostic process provided by theDSM-IV-TR(see above at[42]–[43]). However,\n                    instead of adhering to this requisite standard, Dr Goh merely relied upon\n                    his interviews with the appellant, Pang In and Tok May, and the nurses’\n                    psychiatric observation charts to arrive at his conclusion that the appellant\n                    was not suffering from any mental illness.[note: 100]No interviews were\n                    conducted with those who had the most recent and closest contact with the\n                    appellant, namely, Xiu, GHK, Mr Loh or even the appellant’s drinking\n                    friends. These were the people who also had frequent contact with the appellant\n                    and would have been able to provide Dr Goh with crucial information that\n                    could have shed much light on the appellant’s mental state at the time he\n                    committed the offence. We are puzzled why Dr Goh did not do this. As the\n                    Prosecution’s expert, he would have had little difficulty making\n                    arrangements to interview these persons.68     We noted earlier that the appellant’s\n                    previous periods of employment lasted 11 years, six years and one year\n                    successively and, at the time of the offence, he had been working at\n                    M/s Loh for only about seven months.It therefore\n                        appears that within a period of less than 18 months preceding the death of\n                        the deceased, the appellant had three different employers. This\n                    pattern was particularly striking since it departed starkly from his earlier\n                    employment history. No evidence was led by the Prosecution on the reasons for\n                    these rapid job changes. What happened and why did it happen? These facts could\n                    be important but they were never looked into by Dr Goh. What was his state\n                    of mind during the months leading up to the offence? After all, he was having\n                    severe marital problems around this period of time. How did this affect his\n                    work? As occupational impairment is a symptom of major depressive disorder, the\n                    reasons that led the appellant to leave or be told to leave his two earlier jobs\n                    could be significant. Although Dr Goh was told about the appellant’s\n                    employment history, he did not regard it as material. Instead,\n                    Dr Goh’s first report noted that the appellant often worked for\n                    “many years for the same company” which,[note: 101]although true\n                    for the most part of his employment history, was certainly inaccurate for the\n                    one and a half years preceding the killing.69     As for the interview with Pang In and Tok May,\n                    it was largely focused on their personal history of mental disorder with only\n                    cursory details about the appellant’s health being discussed.[note: 102]Dr Goh acknowledged that the appellant’s purported weight loss was an\n                    important issue since it is a symptom of depression; yet he did not ask the\n                    siblings about this issue at all.[note: 103]Further, Dr Goh did\n                    not try to find out the nature of the actual mental ailments afflicting Pang In,\n                    Tok May and the appellant’s mother. In Dr Goh’s first report,\n                    he merely stated that Pang In was being treated for depression, with no mention\n                    of the mental history of Tok May and the appellant’s mother.[note: 104]Despite\n                    reading Dr Tan’s report, Dr Goh did not seek further\n                    clarification or to obtain more details about the “strong family history\n                    of mental disorder” from either Pang In or Tok May.[note: 105]It\n                    appears to us that he did not consider the family history factor as significant\n                    enough to warrant a second look despite the possible increased risk (one point\n                    five to three times) of the appellant developing a major depressive disorder on\n                    the basis of this factor alone.70     We have highlighted above that it appears that\n                    20% to 25% of diabetic persons may suffer from major depressive\n                        disorder.[note: 106]It is not disputed that the appellant suffered\n                    from hypertension and diabetes.[note: 107]This was noted in\n                    Dr Goh’s first report yet the correlation between diabetes and major\n                    depressive disorder did not appear to have been properly considered by\n                    Dr Goh.71     Another worrying feature about\n                    Dr Goh’s examination of the appellant was that it was conducted in\n                    Mandarin when the appellant’s preferred language of communication was\n                        Hokkien.[note: 108]The trial judge stated (at [52] of the\n                    judgment) that the appellant must have been conversant in Mandarin since Xiu is\n                    from China and spoke to him in Mandarin. However, there is no evidence on the\n                    nature of the conversations between the appellant and Xiu or about the\n                    appellant’s level of proficiency in Mandarin. Given the difficulty in\n                    eliciting symptoms of a major depressive disorder without clear\n                        communication,[note: 109]it would have been prudent for Dr Goh to\n                    have arranged for a Hokkien interpreter to be present for the interviews,\n                    something which could have been easily done.[note: 110]We note that in the\n                    course of cross-examination, Dr Goh acknowledged the possibility of\n                    miscommunication between the appellant’s account of his mental health and\n                    Dr Goh’s comprehension of the account given the lack of a common\n                        language.[note: 111]72     In our view, Dr Goh’s diagnostic\n                    process fell short of the requisite standard prescribed under theDSM-IV-TR. In response to our concerns about the above\n                    matters, the Prosecution submitted that while there are protocols which\n                    psychiatrists bear in mind when diagnosing patients, in some cases they\n                    nevertheless rely on their own experience in their assessments, this being one\n                    of those cases. We were not impressed by this attempt to paper over the obvious\n                    shortcomings. After all, this was the first case in which Dr Goh had\n                    testified as an expert witnesson a murder charge.\n                    It would be a stretch to suggest that Dr Goh had any meaningful prior\n                    experience to fall back on. Equally significant, the submission misses the real\n                    point. Dr Goh’s diagnostic process did not even meet his very own\n                    prescriptive methodology in examining patients on their mental capability,viz, interviewing persons regularly\n                    interacting with the appellant to determine if he had any impairment of social\n                    or occupational functioning at the material time.73     Given the unsatisfactory nature of\n                    Dr Goh’s assessment, it would be unsafe, in our view, to rely on his\n                    opinion that the appellant was not suffering from any form of mental\n                    illness.74     We now turn to Dr Tan’s evidence.\n                    The defence and Dr Tan cannot be faulted for the interviews taking place\n                    some ten months after the incident. It does not appear that there was any delay\n                    attributable to counsel or the appellant. The appointment processes took some\n                    time. Unlike Dr Goh, Dr Tan conducted his examination of the appellant\n                    using Hokkien as he recognised the need to establish rapport with the\n                        appellant.[note: 112]Dr Tan also noted the history of\n                    depression concerning Pang In, Tok May and the appellant’s mother,\n                    although like Dr Goh, he was unsure of the exact nature of their mental\n                    ailments. Dr Tan’s report, compared with both Dr Goh’s\n                    first and second reports, contained a much more detailed account of the\n                    appellant’s personal history. For example, he described the circumstances\n                    which led to the deterioration of his marriage and his subsequent divorce, such\n                    as the failed pregnancies, the opening of Xiu’s massage shops, her change\n                    in dressing and their lack of communication due to their long working hours.\n                    According to the appellant, he worked long hours, as much as 15 to 17 hours on\n                        weekdays.[note: 113]Dr Tan also recorded the\n                    appellant’s family members’ descriptions of his character. According\n                    to Pang In, the appellant was quite hot-tempered but he became less so after his\n                    marriage in July 2002 at the age of 40 and he was very caring towards his\n                        family.[note: 114]Dr Tan further noted Pang In’s and\n                    Sally’s observations on the appellant’s mood prior to the offence.\n                    Dr Tan’s report stated:[note: 115]Pang In has seen Pang Siew in July, August, September 2007 before the\n                        alleged offence. Pang Siew had approached him for money to pay the lawyer.Pang In said that Pang Siew looked very depressed. He\n                            looked worried. He was also not responsive when spoken to. He was always\n                            sighing. He was very negative and kept saying “die\n                            already”. He told Pang In that he has a lot of worries, that life\n                            has no meaning and he felt very frustrated.Pang In also reported that Pang Siew was haggard\n                            looking and had lost weight when he saw him from July to September 2007.\n                            Pang Siew told Pang In that he was very depressed because he could not\n                            see his son.Sally saw him in April 2007 during her daughter’s birthday. She\n                        noticed that he was sad looking and not lively.They said that Pang Siew has been drinking more as a result of his marital\n                        problems.Pang Siew drank less after he married but drank\n                            more in the later part of his marriage. They said that when Pang Siew\n                            drank, he could become agitated when someone irritated\n                        him.[emphasis added]75     In contrast, the information elucidated from\n                    the appellant’s family members as recorded in Dr Goh’s first\n                    report merely stated that:[note: 116]Premorbid personality:His brother said he is not physically or verbally aggressive by nature and\n                        that he is very responsible in his work and well-liked by his bosses. He is\n                        very close to his son and would prepare food, bath and feed him with minimal\n                        assistance from others after he got off from work.76     Dr Tan’s range of enquiries and\n                    diagnostic process were undoubtedly more comprehensive than Dr Goh’s.\n                    The information provided by the appellant’s family members would have\n                    enabled Dr Tan to have a better picture of the appellant’s state of\n                    mind prior to the offence. However, Dr Tan’s diagnosis also fell\n                    short of being thorough. Like Dr Goh, Dr Tan did not interview Xiu,\n                    GHK, Mr Loh or the appellant’s friends. In fairness, we should\n                    mention that it would have been difficult for him (unlike Dr Goh) to have\n                    secured the assistance of Xiu (or GHK) as he was an expert for the defence. With\n                    regards to the appellant’s employment history, Dr Tan’s report\n                    merely recorded that he had “worked for several transport\n                        companies”[note: 117]without ascertaining the reasons for his\n                    departure from those companies. Although Dr Tan noted that the appellant\n                    has diabetes and hypertension,[note: 118]he did not, like Dr Goh,\n                    appear to have assessed the correlation between these medical conditions and a\n                    major depressive disorder.[note: 119]In addition, as noted\n                    above, both Dr Tan and Dr Goh were aware of the appellant’s\n                    family history of depression but did not probe further into this. Deeper\n                    inquiries into the precise nature of their mental ailments ought to have been\n                    conducted in order to determine if they were hereditary in nature.77     Hence, even though Dr Tan’s\n                    diagnostic process was more detailed than Dr Goh’s, it was not\n                    entirely satisfactory. More could and should have been done by both Dr Tan\n                    and Dr Goh (and counsel) to ensure that the trial judge was provided with\n                    detailed information of matters relevant to the appellant’s state of mind\n                    at the time of the offence. This is especially important given the nature of the\n                    offence and the mandatory punishment that would follow a conviction. Bearing in\n                    mind the above concerns, we shall now analyse in greater detail\n                    Dr Tan’s and Dr Goh’s psychiatric diagnosis of the\n                    appellant.Comparison between Dr Tan’s and Dr Goh’s\n                diagnosis78     The fundamental difference between\n                    Dr Tan’s and Dr Goh’s diagnosis lies in the number of\n                    symptoms listed under Criterion A of major depressive episode that was\n                    elicited from the appellant. Under theDSM-IV-TR,\n                    at least five of the nine listed symptoms must be present before a diagnosis of\n                    major depressive episode can be made. Dr Tan elicited eight symptoms from\n                    the appellant while Dr Goh could only elicit two.[note: 120]For\n                    ease of reference, we set out a comparison table of their findings below:Requirement of Criterion ADr Tan’s assessmentDr Goh’s assessment1Depressed mood most of the\n                                            day, nearly every day.PresentPresent2Markedly diminished interest\n                                            or pleasure in all, or almost all, activities most of\n                                            the day, nearly every day.PresentAbsent3Significant weight loss when\n                                            not dieting or weight gain (eg, a change of more than 5%\n                                            of body weight in a month), or decrease or increase in\n                                            appetite nearly every day.PresentAbsent4Insomnia or hyper-somnia\n                                            nearly every day.PresentAbsent5Psychomotor agitation or\n                                            retardation nearly every day (observable by others, not\n                                            merely subjective feelings of restlessness or being\n                                            slowed down).PresentAbsent6Fatigue or loss of energy\n                                            nearly every day.PresentAbsent7Feelings of worthlessness or\n                                            excessive or inappropriate guilt nearly every\n                                            day.PresentPresent8Diminished ability to think\n                                            or concentrate, or indecisiveness, nearly every\n                                            day.AbsentAbsent9Recurrent thoughts of death\n                                            (not just fear of dying), recurrent suicidal ideation\n                                            without a specific plan, or a suicide attempt or a\n                                            specific plan for committing\n                                    suicide.PresentAbsent79     During the appellant’s examination in\n                    chief, he affirmed various portions of his family members’ accounts to\n                    Dr Tan (as recorded in Dr Tan’s report):[note: 121]Q[Reads]\n                            “Pang Siew’s family saw him four to five times a year. Pang\n                            Siew is closest to Pang In. When Pang Siew called Pang In, he told Pang\n                            In that life has no meaning.”Is this correct?AYes.QAll\n                            right.AYes.QNow,\n                            the third paragraph:[Reads] “Pang In has seen Pang Siew in July, August, September\n                            2007 before the alleged offence. Pang Siew had approached him for money\n                            to pay the lawyer. Pang In said that Pang Siew looked very depressed. He\n                            looked worried. He was also not responsive when spoken to. He was always\n                            sighing. He was very negative and kept saying ‘die already’.\n                            He told Pang In that he has a lot of worries, that life has no meaning\n                            and he felt very frustrated.”Is this correct?AYes.QAnd then fourth\n                            paragraph:[Reads]: “Pang In also reported that Pang Siew was haggard\n                            looking and had lost weight when he saw him from July to September 2007.\n                            Pang Siew told Pang In that he was very depressed because he could not\n                            see his son.”AThat’s right.QRight. Now:...[Reads] “Sally saw him in April 2007 during her\n                            daughter’s birthday. She noticed he was ... looking sad ... and\n                            not lively”....[Reads] “They said that Pang Siew has been drinking more as a\n                            result of his marital problems. Pang Siew drank less after his marriage\n                            but drank more in the later part of his marriage. They said that when\n                            Pang Siew drank, he would become agitated when someone irritated\n                            him.”AYesQRight. Is this true?AYes.80     The appellant also affirmed his own account as\n                    recorded in Dr Tan’s report:[note: 122]Q[Reads] “He\n                            said that his wife complained that he did not talk and he would get\n                            angry for no reason.”Is this true?AYes.Q[Reads] “His wife also\n                                told him to go and see a psychiatrist at the Institute of Mental\n                                Health.”Is this true?AYes.Q[Reads] “He continued to feel depressed after\n                            his wife left the marital home and divorced him.”AYes.Q[Reads] “He feels ‘pek chek’ i.e.\n                            frustrated.”Is it true?AYes.Q[Reads] “He did not feel like working but he\n                            still went to work.”Is this true?ABecause I have to work.Q[Reads] “He was unable to sleep at night. He\n                            said his eyes would be wide open the whole night. He kept thinking of\n                            his son. He would think about why his wife had behaved in that\n                            way.”AYes.Q[Reads] “He ate less. He lost weight. He said\n                            that he used to weigh more than 200 pounds and he had a 41 inch waist.\n                            He started to lose weight from 2005.”AYes.Q[Reads] “He had no interest in doing\n                            anything. He would just sit at home if he was not\n                            working.”AYes.Q[Reads] “He had thoughts of dying but he\n                            could not commit suicide because his son is very\n                        young.”AYes.Q[Reads] “He drank 1 to 2 bottles of beer\n                            every night. He drank more on weekends ... as he did not have to work.\n                            He drank because he was depressed and he was alone at home, he kept\n                            thinking of his son and was feeling confused. He says that if he did not\n                            drink, he would have difficulty sleeping.”AYes.[emphasis added]81     The above evidence, if unchallenged by the\n                    Prosecution, would have established, apart from Requirements (1) and (7),\n                    Requirements (3), (4), (5), (6) and (9) of Criterion A. There is an\n                    established rule of evidence that if what a witness says is not challenged, the\n                    evidence is deemed to have been admitted: the rule inBrowne\n                        v Dunn(1893) 6 R 67. The purpose of the rule is to secure\n                    procedural fairness in litigation (seeYeo Kwan Wee Kenneth v\n                        Public Prosecutor[2004] 2 SLR(R) 45 (at [3])). The\n                    rule requires that matters that are challenged be put to the witness during\n                    cross-examination to give the witness an opportunity to respond. Unchallenged\n                    testimony may be considered by the court to be undisputed by the opposing party\n                    and therefore accepted.82     During the cross-examination of the appellant,\n                    the Prosecution, surprisingly, only briefly questioned a few aspects of the\n                    appellant’s evidence without probing his testimony and or ultimately\n                    putting its case to the appellant. With regard to the appellant’s\n                    purported weight loss, the cross-examination proceeded as follows:[note: 123]QAll right. Now, you also have said that you started\n                            losing weight in 2005, right?AThat’s right.QCan you tell the Court why you started losing weight\n                            in 2005?AIn 2005, I started to have a marital problem with my\n                            wife, I can say that my wife gave me pressure.QYes. When did you realise that you were suffering\n                            from hypertension and diabetes?AWell, ... I found out that ... I had high blood\n                            pressure when I was having my reservist....QYes, when was that?AIn the 1990s.QAnd then? And what about your diabetes? When did you\n                            realise you were a diabetic?AI went for medical check-up at the ... camp and the\n                            medical officer found out about it....QYes. Again, I’m asking you, you were going for\n                            outpatient for your hypertension as well as ... for your diabetes,\n                            isn’t it? You went to OPD, outpatient dispensary clinic where they\n                            told you [that] you were suffering from hypertension as well as\n                            diabetes, correct or not?AI cannot remember when but I went to ... Woodlands\n                            Polyclinic.QAnd would that be around 2004, 2005 as\n                        well?AWith regard to my health, I cannot\n                        remember.QAnd you were overweight at that time, correct? 200\n                            over pounds.AYes, 200 over.QAnd you were advised to lose weight,\n                        correct?AYes, the doctor advised me to ... lose\n                            weight.QAnd in fact, even your wife also advised you, told\n                            you that you should lose weight.ANo, she did not.QAnd even to Mr Loh, you told him that you had\n                            lost weight due to health reasons. Mr Loh has testified to that\n                            effect in Court.AWell, I did not lose weight.QWhat do you mean ... you did not lose weight? When\n                            did you not lose weight?AWell ... all along I still eat the usual amount of\n                            food. I did not go on diet.QAnd would I be right, as far as 2007 while you were\n                            working with Mr Loh, there was actually no difference in your\n                            weight. Your weight was about the same throughout that\n                        period.AYes.83     Regrettably, there was no objective evidence\n                    produced by either party to show if and when the appellant had suffered from\n                    significant weight loss even though this fact could have been easily\n                    ascertained, in particular, by the Prosecution. While the appellant stated that\n                    he did not lose weight during the period of employment before the offence, this\n                    was contradicted by one of the Prosecution’s witnesses, Mr Loh. He\n                    testified after examining a photograph taken on the day of the offence that the\n                    appellant appeared to have lost weight.[note: 124]Mr Loh’s\n                    evidence on this point was not challenged by the Prosecution and the Prosecution\n                    did not dispute that the appellant used to weigh over 200 pounds. This\n                    underscores our concern that the appellant may not be the best person to provide\n                    information about his health. More crucially, the appellant’s evidence was\n                    that he started losing weight because of the pressure from his marital problems\n                    in 2005. This point was not disputed by the Prosecution. It only asked if the\n                    appellant’s weight remained constant during his period of employment with\n                    Mr Loh in 2007.[note: 125]Further, Oon Kim Lye, a friend of\n                    the appellant, stated that the appellant had lost “quite a bit of weight\n                    after he divorced his wife.”[note: 126]Dr Goh’s evidence\n                    that the absence of significant weight loss without dieting was “not\n                    elicited” from the appellant was rather remarkable. He did not ask anyone\n                    about the issue of weight loss and did not rely on any objective evidence in\n                    assessing this criterion.[note: 127]Accordingly,\n                    Requirement 3 of Criterion A must be taken to be established.\n                    Similarly, with regards to the appellant’s reported problem of insomniaie, Requirement 4 of Criterion A,\n                    the evidence that he was unable to sleep at night as he kept thinking of his son\n                    and about why his wife had “behaved in that way” was not\n                    challenged by the Prosecution during cross-examination.84     We note that the trial judge had found (at\n                    [51] of the judgment) that the appellant’s weight loss was deliberate\n                    because of his diabetes and hypertension and that the appellant had said as much\n                    to Mr Loh. In our view, this finding is debatable considering that\n                    Mr Loh was not even aware of the actual health reason or that the appellant\n                    was diabetic.[note: 128]When asked specifically whether the\n                    appellant had told him the reason for his weight loss, Mr Loh could only\n                    state, “Er, Ithinkit’s for health\n                    reason” [emphasis added].[note: 129]Further, with regard to\n                    the finding that the appellant’s sleeping problem arose only after the\n                    incident based on his own account to Dr Goh, we have already pointed to the\n                    language barrier between the appellant and Dr Goh and the fact that he had\n                    conceded the possibility of miscommunication (see above at[71]). The appellant’s consistent evidence\n                    was that his sleeping problem arose well before the incident.[note: 130]85     In addition, the appellant verified Pang\n                    In’s and Sally’s observations (as recorded in Dr Tan’s\n                    report) that the appellant had become very negative and was unresponsive when\n                    spoken to. He had also informed Dr Tan that he did not feel like working\n                    but had to work because he needed his job. These two nuggets of information\n                    provided the basis for Dr Tan’s finding that the appellant had\n                    psychomotor retardation and was suffering from fatigue or loss of energy\n                    (Requirements 5 and 6 of Criterion A).[note: 131]Again, the Prosecution did\n                    not properly challenge the appellant’s testimony on this point. All it\n                    asked was whether the appellant had complained to Mr Loh about his long\n                    working hours,[note: 132]and whether he had any problems\n                    coping with the demands of his work.[note: 133]Here we should pause to\n                    observe that the appellant ordinarily worked 15–17 hours a day on\n                    weekdays. He would certainly have been overstretched at work. Unfortunately,\n                    this aspect of his working conditions was not explored by counsel or by the\n                    psychiatrists. It is also worth noting that Pang In was a Prosecution’s\n                    witness and yet the Prosecution did not consider it necessary to clarify whether\n                    what he had told Dr Tan about the appellant appearing depressed and worried\n                    as well as unresponsive when spoken to were true.86     As for Requirement 9 of Criterion A,\n                    that is to say the appellant having suicidal thoughts, the Prosecution did\n                    briefly attempt to cross-examine him on this issue.[note: 134]The\n                    appellant had insisted that he had been entertaining suicidal thoughts even\n                    before the offence and that he had told Xiu that he found life to be tough-going\n                    and that he was a failure.[note: 135]All the Prosecution\n                    tepidly put to the appellant was that he was merely embellishing his evidence\n                    because if he had had suicidal thoughts before the offence, he would have\n                    mentioned it to Dr Goh during his examination. However, we have already\n                    explained why Dr Goh’s investigative procedures were less than\n                    satisfactory. Many questions that should have been asked were not asked.\n                    Information that ought to have been obtained was not. In short, the fact that\n                    this information was not found in both of Dr Goh’s reports certainly\n                    does not mean that the appellant did not have suicidal thoughts before the\n                    incident.87     The appellant verified that even before the\n                    incident he was feeling very negative and had repeatedly told Pang In, in\n                    anguish, “die already”. He had also told Pang In that he had a lot\n                    of worries and that life had no meaning. Although it was established during\n                    trial that Pang In had met the appellant only once within the period of six\n                    months preceding the offence,[note: 136]the\n                    Prosecution did not dispute that they often spoke to each other on the\n                        phone.[note: 137]If the Prosecution intended to contest the\n                    appellant’s testimony on this issue, it ought to have recalled Pang In to\n                    ascertain the position. This was not done. In the circumstances, we find that\n                    Dr Tan’s finding that the appellant was entertaining suicidal\n                    thoughts even prior to the incident should have been preferred by the trial\n                    judge. Accordingly, Requirement 9 of Criterion A was also\n                    satisfied.88     Both Dr Tan and Dr Goh were of the\n                    opinion that Requirements 1 and 7 of Criterion A of a major depressive\n                    episode were displayed by the appellant. For the above reasons, we also prefer\n                    Dr Tan’s opinion that Requirements 3, 4, 5, 6 and 9 were also\n                    present. Since more than five of the listed requirements were present,\n                    Criterion A is satisfied. As for Criterion C, which requires\n                    impairment of social or occupational functioning, this point is related to\n                    Requirement 5 of Criterion A. Sally had observed that the appellant\n                    was sad-looking and was not lively when she met him at her daughter’s\n                    birthday. Also, as stated, Pang In told Dr Tan that the appellant was\n                    unresponsive when spoken to. Both accounts were not challenged by the\n                    Prosecution. According to Dr Tan, this showed that there was a change in\n                    the appellant’s behaviour and he was unable to enjoy pleasurable\n                        experiences.[note: 138]89     In the circumstances, we find that\n                    Dr Tan’s report, which opined that the criteria for making a\n                    diagnosis of a major depressive disorder had been satisfied, was preferable to\n                    Dr Goh’s. We now turn to the non-medical evidence. The evidence (in\n                    particular, the appellant’s conduct before, during and after the offence)\n                    compels us to arrive at the same conclusion.The other factors considered90     Zhao Jing testified that when the appellant\n                    hit the deceased’s head against the floor, he was very agitated and kept\n                    shouting “Who am I”. He refused to release his hands even when\n                    asked to do so by Zhao Jing (see above at[15]–[16]). In his\n                    statement recorded by Sgt Chng, the appellant stated that when he was\n                    strangling the deceased, he kept on apologising to her and said that he was left\n                    with no choice but to kill her. The appellant’s violence was not in\n                    keeping with his character and temperament. Xiu had testified that even when the\n                    appellant’s temperament was bad, the appellant would only utter nasty\n                    words but would not resort to violence.[note: 139]91     Zhao Jing had left Xiu’s flat to go to\n                    the police post soon after she called Xiu to inform her of the situation. When\n                    she returned, the main gate was padlocked and the wooden door closed even though\n                    she did not lock or close them. Upon re-entry, she saw that the appellant was\n                    still sitting on the deceased even though the deceased had stopped moving. The\n                    appellant remained in the same position when she left the flat a second time and\n                    returned with the police officers. The appellant admitted during\n                    cross-examination that he had closed the main gate on both occasions but he\n                    could not explain why he did so.[note: 140]His actions were\n                    inexplicable; twice, he closed the main gate and wooden door and then went back\n                    to sit on the deceased. He must thus have sat on the deceased for about half an\n                    hour (from the time before Xiu made the first information report at\n                        10.15pm[note: 141]to the time that the police arrived at about\n                    10.35 pm).[note: 142]There was no rational explanation for the\n                    appellant’s behaviour.92     One of the phone calls made by the appellant\n                    after he killed the deceased was to inform Mr Loh that he could no longer\n                    work for M/s Loh. He apologised for not being able to carry out his driving\n                    assignment the next day and told him that the key to the company’s bus was\n                    at his home.[note: 143]It was curious why despite having committed\n                    such a serious offence, the appellant seemed unduly concerned by such an\n                    inconsequential matter. Rather than showing clarity of mind, as the trial judge\n                    seemed to have thought,[note: 144]we\n                    are of the view that this conduct was abnormal behaviour, unless he was a\n                    cold-blooded murderer; we, however, do not think he is one. This view is\n                    reinforced by the fact that the appellant was later observed to be laughing and\n                    crying when the police officers arrived at Xiu’s flat. Later, he began\n                    banging his head against the wall in the temporary holding area (see above at[23]) while being\n                interviewed.93     The appellant’s physical condition as a\n                    result of the drinking binge he had just before the incident is also an\n                    important consideration. As noted above, the appellant had a BAC of 84 mg\n                    per 100ml of ethanol about three hours after the offence was committed. This is\n                    not an inconsiderable amount. Indeed, his BAC must have been much higher at the\n                    time of the offence.[note: 145]That the effect of the\n                    alcohol could have exacerbated his depression at the time of the offence was\n                    recognised by both Dr Tan and Dr Goh.[note: 146]We\n                    recognise that self-induced intoxication is not a specified cause under\n                    limb (b) of the defence of diminished responsibility: seeTengku Jonaris Badlishah v Public Prosecutor[1999]\n                    1 SLR(R) 800 (at [62]);Zailani bin Ahmad v Public\n                        Prosecutor[2005] 1 SLR(R) 356 (at [59]–[61]).\n                    However, what we are concerned with is the correlation between alcohol\n                    dependence and major depressive disorder as provided by theDSM-IV-TR(see above at[44]). It is true that the appellant said in cross-examination that\n                    he was a good drinker and that his drinking habit had never previously affected\n                    his daily functions.[note: 147]However, we have to also consider the not\n                    unlikely possibility of a depressed patient downplaying his own symptoms.\n                    Dr Tan’s report recorded that Pang In and Sally observed that the\n                    appellant had been drinking more as a result of his marital problems[note: 148]and that the\n                    appellant drank “1 to 2 bottles of beer every night” because he\n                    was depressed at being alone at home. He kept thinking of his son and had\n                    difficulty sleeping if he did not drink.[note: 149]This clearly revealed a serious\n                    drinking problem associated with a depressive state of mind.94     Dr Goh’s evidence on this issue in\n                    cross-examination is also revealing:[note: 150]QSimilarly, in\n                            third paragraph, you said:(Reads) “He described having depressive symptoms such as\n                            lethargy, guilt and poor sleep, but...these symptoms surfaced after his\n                            stepdaughter’s death.” Correct?AThat’s the account he gave me.Q(Indistinct) But supposing these symptoms were there\n                            before the incident, it would have changed your opinion,\n                        correct?AYes.QAnd that this happened after the\n                                stepdaughter’s death, this was at---indeed given to you by the\n                                accused in Mandarin during his interview,\n                        correct?ACorrect,\n                        yah.QYes. And since his Mandarin is\n                                not that good and your Hokkien is not that good, there could be a\n                                possibility of miscommunications, correct?AYes.And:[note: 151]QNow, you have also heard evidence that while he was\n                            strangling the stepdaughter, he was apologising to her, right, and\n                            subsequently, he started laughing, the police came. Would you say these\n                            are abnormal ... behaviour?AIt would be abnormal\n                                behaviour.QWhat do you think led to his abnormal\n                            behaviour?AIt’s very difficult for me to comment on what\n                            was going through his mind at that time.[emphasis added]95     Despite acknowledging that the appellantwas behaving abnormally at the time of the\n                        killing, Dr Goh surprisingly maintained that the appellant\n                    suffered from no mental illness. When asked for an explanation for his abnormal\n                    behaviour, Dr Goh was unable to provide a convincing answer. While\n                    Dr Goh had quite correctly observed in his first report that:the effect of [the appellant’s] recent ingestion\n                            of alcohol and the heightened emotions during altercations with his wife\n                            and the victim that night, in a background of severe and longstanding\n                            marital and family problems, had contributed to his actions leading to\n                            the offence[emphasis added](see above at[52]), he did not go\n                    on to properly analyse how the unhappy confluence of all these psycho-social\n                    pressures insidiously conspired to cause the appellant’s dysfunctional\n                    conduct that night.96     Dr Goh was plainly aware of the\n                    appellant’s “severe and longstanding” marital\n                        problems,[note: 152]as well as other factors such as his family\n                    history of mental disorder and his diabetes and hypertension.[note: 153]He knew that\n                    the appellant had consumed a lot of alcohol and had a heated altercation with\n                    Xiu for not allowing him access to GHK just before the incident.[note: 154]He was\n                    even willing to accept that the appellant was behaving abnormally at the\n                    material time. The appellant’s bizarre mood swings during the incident,\n                    banging the deceased’s head intermittently on the floor, strangling her in\n                    the presence of a witness,[note: 155]laughing and crying simultaneously,\n                    apologising to the deceased while strangling her,[note: 156]banging\n                    his head against a wall had all been observed by Zhao Jing, Sgt Chng and\n                    SSgt Lee or documented.[note: 157]The phone calls to inform\n                    Mr Loh about his inability to work the next day[note: 158]and to inform\n                    Pang In that he was going to commit suicide by jumping from Xiu’s flat and\n                    requesting Pang In to “cremate [him] and throw the ashes to the\n                        sea”[note: 159]further illustrated the abnormality of his\n                    mental state. We noted above (at [91]) that the appellant spent a long time\n                    kneeling next to or sitting on the deceased even after she had lost\n                    consciousness. When the paramedics arrived, they found the appellant still\n                    kneeling on the deceased.[note: 160]In addition, a photograph of\n                    the appellant taken some hours after the incident showed both his knees to be\n                    visibly red and sore.[note: 161]This is not an unimportant fact. Why did he\n                    spend such an inordinate amount of time kneeling on or next to the deceased even\n                    after she died?97     Dr Goh had been informed by the appellant\n                    that his emotions were “very chaotic during [the] struggle”. There\n                    was plainly objective evidence to support this assertion.[note: 162]Yet,\n                    Dr Goh adamantly maintained that the appellant had no mental illness at the\n                    material time. Given the unsatisfactory nature of his limited enquiries, his\n                    less than rigorous interviews with the appellant, his lack of experience in\n                    diagnosing persons charged with committing a capital crime and his failure to\n                    adequately analyse and holistically explain several aspects of the\n                    appellant’s conduct that fateful night, we find Dr Goh’s\n                    diagnosis of the appellant’s mental condition at the material time less\n                    convincing than that of Dr Tan’s.98     Before we conclude our analysis, we ought to\n                    address a further finding of the trial judge that led him to convict the\n                    appellant of murder. He found that the several superficial incision and puncture\n                    wounds on the deceased’s neck, limb and abdomen must have been inflicted\n                    by the appellant.[note: 163]The appellant had no recollection of\n                    this event and was adamant during trial that he did not touch the knife found at\n                    Xiu’s flat.[note: 164]His fingerprints were not found on the\n                    knife or its handle. The trial judge found that it was not material whetherthe appellant inflicted them before or after the death of\n                        the deceased. In our view, this is a material fact. According to\n                    the pathologist, the superficiality of the wounds suggested that they were not\n                    inflicted during a struggle.The blade had been applied very\n                        lightly to the skin in a controlled manner.[note: 165]If this were not so, the incisions would\n                    have been deeper or less uniform.[note: 166]We note that counsel for\n                    the appellant, quite rightly, has not suggested that these wounds were\n                    self-inflicted. More importantly, there does not appear to have been serious\n                    blood loss as a consequence of those wounds. We therefore find that they were\n                    likely to have been inflicted after the deceased had died or lost consciousness.\n                    This further reinforces our view that the appellant was behaving abnormally at\n                    the time of the offence.Conclusion99     For all the above reasons, we find that on a\n                    balance of probabilities, the appellant has made out the defence of diminished\n                    responsibility. In the result, we set aside the conviction on the charge of\n                    murder and convict him on a charge of culpable homicide not amounting to murder\n                    punishable under s 304(a) of the Penal Code and remit this case to the\n                    trial judge for sentencing.[note: 1]ROP, vol 2 at p\n                        122.[note: 2]Prosecution’s submission Annex A at\n                        [3].[note: 3]ROP, vol 2A at\n                                p 319.[note: 4]Prosecution’s Submission Annex A at\n                        [6].[note: 5]Prosecution’s Submission Annex A at [6]; ROP,\n                                vol 2 at p 315.[note: 6]ROP, vol 2 at\n                                p 180.[note: 7]Prosecution’s submission Annex A at\n                        [7].[note: 8]ROP, vol 1, day 1 at p\n                        28.[note: 9]ROP, vol 2 at p 211; Xiu’s\n                                conditioned statement at [10].[note: 10]ROP, vol 2 at p 212 at [13].[note: 11]ROP, vol 2 at p 315.[note: 12]See [14] of PW3’s conditional\n                        Statement.[note: 13]ROP, vol 2 at p\n                        316.[note: 14]ROP, vol 2 at p 212 at\n                            [15].[note: 15]ROP, vol 2 at p 213 at\n                            [16].[note: 16]ROP, vol 1,\n                                day 1 at p 21.[note: 17]ROP, vol 1, day 1 at p\n                            22.[note: 18]See Statement of Claim in\n                                D2216/2007/F.[note: 19]See Statement of Particulars in\n                                D2216/2007/F.[note: 20]Prosecution’s Submission Annex A at\n                        [13].[note: 21]Prosecution’s submission Annex A at\n                        [13].[note: 22]Prosecution’s Submission Annex A at\n                        [14].[note: 23]ROP, vol 1, day 4 at p\n                            3.[note: 24]ROP, vol 1, day 1 at p\n                21.[note: 25]ROP, vol 1, day 4 at p\n                            27.[note: 26]ROP, vol 1, day 4 at p\n                            5.[note: 27]ROP, vol 1,\n                                day 4 at p 5.[note: 28]ROP, vol 1,\n                                day 4 at p 6.[note: 29]ROP, vol 1, day 4 at p 6; see too\n                                Prosecution’s submission at [23].[note: 30]ROP, vol 1,\n                                day 4 at p 32.[note: 31]ROP, vol 1, day 4 at pp\n                            7-8.[note: 32]ROP, vol 1,\n                                day 4 at p 7.[note: 33]ROP, vol 1, day 4 at p\n                            33.[note: 34]ROP, vol 2 p 218 at [3].[note: 35]ROP, vol 2\n                                p 218 at [4].[note: 36]ROP, vol 2 p 219 at\n                        [6].[note: 37]ROP, vol 1, Day 4, p 9 lines 4-32 of\n                                appellant’s EIC.[note: 38]ROP, vol 2 p 219 at [7]; ROP vol 1 day\n                                1 at p 38.[note: 39]ROP, vol 2 p 220 at [9].[note: 40]ROP, vol 1, day 1 at p 39.[note: 41]ROP, vol 1,\n                                day 1 at p 41.[note: 42]ROP, vol 2 p 221 at\n                            [11].[note: 43]ROP, vol 2 at p 221 at\n                            [12].[note: 44]ROP, vol 2\n                                at p 221 at [12].[note: 45]ROP, vol 1,\n                                day 4 at p 50.[note: 46]ROP, vol 2\n                                pp 122, 223 at [3].[note: 47]ROP, vol 1, day 1 at p\n                20.[note: 48]ROP, vol 3\n                                at p 233.[note: 49]ROP, vol 2 pp 233, 234 at [4] of SSgt\n                                Lee’s conditioned\n                statement.[note: 50]ROP, vol 2\n                                at p 149.[note: 51]ROP, vol 2 at p 235 (Sgt Chng); p 238 (ASP Tan Yi Chun); p\n                                243 (Senior Station Inspector Ravindra s/o\n                            Subramaniam).[note: 52]ROP, vol 1, day 2 at p\n                            49.[note: 53]ROP, vol 1, day 2 at p\n                            243.[note: 54]ROP, vol 2 at p\n                        119.[note: 55]ROP, vol 2 at p\n                        94.[note: 56]ROP, vol 2 at pp\n                        84-90.[note: 57]ROP, vol 1, day 2 at p\n                            18.[note: 58]ROP, vol 1, day 2 at pp 7-9.[note: 59]ROP, vol 1,\n                                day 2 at p 10.[note: 60]ROP, vol 1, day 2 at p\n                            23.[note: 61]Prosecution’s submission at\n                            [53].[note: 62]Prosecution’s submission at\n                            [56]-[57].[note: 63]Prosecution’s submission at\n                                    [95].[note: 64]Prosecution’s submission at para\n                            [30]-[38].[note: 65]See the judgment at [42]; Prosecution’s\n                                submission at [37].[note: 66]ROP, vol 2\n                                at p 218.[note: 67]ROP, vol 2 at p\n                        149.[note: 68]Prosecution’s submission at\n                    [25].[note: 69]ROP, vol 2 at p 149.[note: 70]http://www.psych.org/MainMenu/Research/DSMIV.aspx, accessed\n                                on 8 November 2010[note: 71]ROP, vol 2 at p\n                        337.[note: 72]ROP, vol 2\n                                at p 337.[note: 73]ROP, vol 2 at p\n                        330.[note: 74]ROP, vol 2 at pp\n                            330-331.[note: 75]ROP, vol 2 at p\n                        325.[note: 76]http://www.hpp.moh.gov.sg/HPP/MungoBlobs/217/148/2004%20Depression_0.pdf,\n                                accessed on 8 November 2010[note: 77]ROP, vol 2\n                                at p 326.[note: 78]ROP, vol 2\n                                at p 326.[note: 79]ROP, vol 2 at p\n                        326.[note: 80]ROP, vol 1, day 6 at p\n                            2.[note: 81]ROP, vol 1, day 6 at p\n                            3.[note: 82]ROP, vol 1, day 6 at p 11.[note: 83]ROP, vol 2 at pp 314-\n                            321.[note: 84]ROP, vol 2 at\n                        314.[note: 85]ROP, vol 2 at pp 320-321.[note: 86]ROP, vol 1, day 7 at p\n                            2.[note: 87]ROP, vol 1,\n                                day 7 at p 16.[note: 88]ROP vol 1 day 7 at p\n                        17[note: 89]ROP, vol 1,\n                                day 4 at p 19.[note: 90]ROP, vol 1, day 7 at p 17.[note: 91]ROP, vol 1,\n                                day 7 at p 18.[note: 92]ROP, vol 2A at p\n                        328.[note: 93]ROP, vol 1, day 7 at p\n                            7.[note: 94]ROP, vol 2 at pp 121-123.[note: 95]ROP, vol 2 at p\n                        123.[note: 96]ROP, vol 2\n                                at p189.[note: 97]Dr Tan: ROP, vol 1. day 6 at p 21 ; Dr\n                                Goh: ROP, vol 1, day 7 at pp 8-9.[note: 98]ROP, vol 1, day 7 at p\n                            9.[note: 99]ROP, vol 1, day 7 at p\n                    11.[note: 100]ROP, vol\n                                1, day 7 at p 3.[note: 101]ROP, vol 2 at p 122.[note: 102]ROP, vol 2A at p 328 (see above).[note: 103]ROP, vol\n                                1, day 7 at p 23.[note: 104]ROP, vol 2 at p 122.[note: 105]ROP, vol 1, day 7 at p 21.[note: 106]ROP, vol 2 at p\n                        325.[note: 107]ROP, vol\n                                1, day 4 at p 23.[note: 108]ROP, vol 1, day 7 at p\n                            17.[note: 109]ROP, vol 2 at p\n                        323.[note: 110]ROP, vol\n                                1, day 7 at p 15.[note: 111]ROP, vol 1, day 7 at p\n                            23.[note: 112]ROP, vol 1, day 6 at p\n                            11.[note: 113]ROP, vol 1, day 4 p 22 lines\n                                21-22.[note: 114]ROP, vol 2 at\n                        p315.[note: 115]ROP, vol\n                                2 at p 318.[note: 116]ROP, vol\n                                2 at p 123.[note: 117]ROP, vol 2 at p\n                        314.[note: 118]ROP, vol\n                                2 at p 314.[note: 119]ROP, vol\n                                1, day 6 at p 7.[note: 120]ROP, vol 1, day 7 at p 32.[note: 121]ROP, vol 1, day 4 at pp\n                    13-14.[note: 122]ROP, vol\n                                1, day 4 at p 20.[note: 123]ROP, vol 1, day 4 at p 23.[note: 124]ROP, vol\n                                1, day 1 at p 51.[note: 125]ROP, vol 1, day 4 at pp\n                                23-24.[note: 126]ROP, vol\n                                2 at p 311.[note: 127]ROP, vol\n                                1, day 7 at p 31.[note: 128]ROP, vol 1, day 1 at p\n                            52.[note: 129]ROP, vol\n                                1, day 1 at p 52.[note: 130]ROP, vol 1, day 5 at p\n                9.[note: 131]ROP, vol\n                                1, day 6 at p 8.[note: 132]ROP, vol 1, day 4 at pp\n                                22-23.[note: 133]ROP, vol\n                                1, day 4 at p 24.[note: 134]ROP, vol 1, day 5 at p 4.[note: 135]ROP, vol\n                                1, day 5 at p 4.[note: 136]ROP, vol\n                                1, day 2 at p 53 and day 4 at p 50.[note: 137]ROP, vol 1, day 7 at p\n                            23.[note: 138]ROP, vol 1, day 6 at p\n                            54[note: 139]ROP, vol\n                                2 day 1 at p 21.[note: 140]ROP, vol\n                                1, day 4 at p 49.[note: 141]ROP, vol 2 at p\n                        165.[note: 142]ROP, vol 2 at p\n                        235.[note: 143]ROP, vol 2 at p\n                        122.[note: 144]See\n                                trial judge’s judgment at [46].[note: 145]Source:\n                                http://alcoholism.about.com/cs/alerts/l/blnaa35.htm accessed on 8\n                                November 2010.[note: 146]ROP vol\n                                1 day 6 at p 10; ROP, vol 2 at p 123.[note: 147]ROP, vol 1, day 4 at p\n                            25.[note: 148]ROP, vol 2 at p 318.[note: 149]ROP, vol\n                                2 at p 317.[note: 150]ROP vol\n                                1 day 7 at p 22.[note: 151]ROP, vol 1, day 7 at p\n                            33.[note: 152]ROP, vol 2 at p\n                        123.[note: 153]ROP, vol 2 at p 122.[note: 154]ROP, vol 2 at pp 121, 122.[note: 155]ROP, vol\n                                2 at p 210 (Zhao’s conditional\n                        statement).[note: 156]ROP, vol\n                                2 at pp 149-150 (Patrol Log Sheet).[note: 157]ROP, vol\n                                2 p 243 (Ravindra s/o Subramaniam conditional\n                            statement).[note: 158]ROP, vol 2 at p 140.[note: 159]ROP, vol 1, day 4 at p\n                            50.[note: 160]ROP, vol\n                                2 at p 233.[note: 161]ROP, vol 2 at p\n                        42.[note: 162]ROP, vol 2 at p 122.[note: 163]See [45] of the\n                            judgment.[note: 164]ROP, vol 1, day 4 at p\n                            16.[note: 165]ROP, vol 1, day 2 at p 9 lines 10-31,PW 7\n                            EIC.[note: 166]ROP, vol\n                                1, day 2 at p 10.",
        "Factual background": "",
        "The dramatis personae": "2       The appellant has worked as a bus driver for\n                    more than 20 years.[note: 1]At the material time, his employer was\n                    M/s Loh Gim Chong Transport (“M/s Loh”) whom he had\n                    worked for about seven months.[note: 2]Before his employment with M/s Loh, the\n                    appellant worked at three different transport companies for periods of 11 years,\n                    six years and one year respectively.[note: 3]He left the first company when it\n                    ceased operating but there is no evidence on record explaining why he left the\n                    other two companies within the space of a year. The appellant is the former\n                    husband of the deceased’s mother, Xiu Yanhong (“Xiu”). Both\n                    the deceased, who was 15 years old in 2007, and Xiu were formerly Chinese\n                    nationals. 3       The appellant met Xiu in 1997 while she was\n                    employed as an electronic production operator in a factory. He was then\n                    providing transportation for the factory’s workers. When the factory\n                    closed down in 1998, Xiu found work in another factory. They continued to\n                    maintain contact and later developed a close relationship. When Xiu fell ill\n                    sometime in 1999, the appellant helped her during her convalescence.[note: 4]After her work permit expired in November\n                    1999, she returned to China but remained in touch with the appellant.\n                    Eventually, she divorced the deceased’s biological father sometime in\n                        2001.[note: 5] 4       After her divorce, Xiu ran into serious\n                    financial difficulties and sought assistance from the appellant. He responded by\n                    visiting her in China. Once there, he rented an apartment for her and provided\n                    her with money from his savings to tide her over.[note: 6]Their relationship blossomed and she\n                    accepted his proposal for marriage. Following his return to Singapore, the\n                    appellant immediately made arrangements for Xiu to return to Singapore which she\n                    did in 2002. They married soon thereafter. 5       After Xiu obtained her Permanent Resident status\n                    in late 2002, she persuaded the appellant to arrange for the deceased to\n                    continue her education in Singapore.[note: 7]In November 2002, the deceased arrived in\n                    Singapore and subsequently adopted the appellant’s surname, changing her\n                    name from “Pan Hui” to “Ong Pan Hui”. Xiu affirmed\n                    that the appellant’s relationship with the deceased was initially good and\n                    he doted on the deceased.[note: 8] 6       On 8 August 2003, Xiu gave birth to their\n                    son, GHK (“GHK”). Unfortunately, the relationship between the\n                    appellant and Xiu deteriorated rapidly, soon after. Xiu had begun working as a\n                    masseuse. Subsequently, Xiu worked at three different massage parlours between\n                    2003 and 2005.[note: 9]Because the\n                    appellant was unhappy with the nature of her work, he and Xiu had frequent\n                    quarrels. In turn, she complained about his gambling habits.[note: 10]The\n                    appellant also heard from his neighbours that different men were sending Xiu\n                    home and that Xiu had become “very sexy”.[note: 11]In 2005, Xiu\n                    had two miscarriages. Following this, the appellant accused Xiu of having\n                    affairs with other men in the course of her work as a masseuse.[note: 12]This further damaged their relationship.\n                    Xiu, for her part, insisted on continuing with the same line of work. She\n                    claimed the additional income was needed to support her parents in\n                        China.[note: 13] 7       In January 2006, Xiu started her own massage\n                    parlour, employing her savings as well as loans from her friends. Despite his\n                    continuing and profound misgivings, the appellant also contributed about $2,000\n                    to the business.[note: 14]Xiu operated the business without a\n                    permit and was fined twice before she terminated it. At around the same time,\n                    Xiu’s previous employer offered to sell her business to Xiu. She accepted\n                    this offer. The appellant contributed about $5,000 to this\n                        enterprise.[note: 15]Xiu subsequently spent even more time at\n                    work as she attempted to grow the business. As a result of their long working\n                    hours and loss of trust, the relationship between the appellant and Xiu\n                    inexorably broke down. Xiu testified that “sometimes his temperament was\n                    good, but sometimes it was bad.”[note: 16]However, she also affirmed that the appellant had never been\n                        violent and would never “lay a hand” on\n                        her.[note: 17]",
        "The divorce proceedings": "8       Sometime in March 2007, the appellant and Xiu\n                    had a heated argument because the appellant insisted that Xiu should stop\n                    working as a masseuse. More bitter recriminations followed and on 1 April\n                    2007, Xiu moved out of the matrimonial home to a rented flat\n                    (“Xiu’s flat”) with the deceased and GHK. It was also around\n                    this time that the appellant started working for M/s Loh. 9       On 15 May 2007, Xiu initiated divorce\n                    proceedings citing unreasonable behaviour on the part of the\n                        appellant.[note: 18]The Statement of Particulars\n                    for the divorce alleged,inter alia, that after\n                    the marriage the appellant was easily irritated and often lost his temper.\n                    Further, it was asserted that in November 2005, the appellant made Xiu and the\n                    children leave the matrimonial home after Xiu took a lift home from a male\n                    customer late at night. He allegedly only allowed them to return home three\n                    months later.[note: 19]The appellant, who had no\n                    legal representation, did not contest the divorce proceedings. In early October\n                    2007, Xiu obtained sole custody of the deceased. She was also granted sole care\n                    and control of GHK while the appellant was granted access to GHK from 9.00am on\n                    Saturdays to 9.00pm on Sundays.[note: 20]Xiu, in the meantime, secured her Singapore\n                    citizenship in August 2007.[note: 21] 10     After the divorce, the appellant and Xiu\n                    agreed that she would send GHK to City Hall MRT station every Saturday between\n                    11.00am to 12.00 noon where she would hand care and control of GHK to him. The\n                    appellant would then send GHK back to Xiu on Sunday nights.[note: 22]This arrangement soon led to further\n                    friction. The appellant stated in his police statement (and testified) that Xiu\n                    often did not allow him to have access to GHK by making up excuses at the last\n                        moment.[note: 23]Xiu, however, denied this.[note: 24]",
        "The appellant’s activities on the day of the incident": "11     On 20 October 2007, the appellant was\n                    entitled to have access to GHK as it was a Saturday. However, after working late\n                    into Friday night, he woke up at about 10.30am. As he did not have any driving\n                    assignment that day, he went for coffee at the market near his place until about\n                    12.00 noon.[note: 25]After that, he went home to attend to his\n                        laundry.[note: 26]At about 1.00pm, a friend invited him for a\n                    drink. He arrived at the coffee-shop at about 3.25pm. Together with four of his\n                    friends, the appellant stayed at the coffee-shop until about 9.00pm. During this\n                    period, they drank more than 20 bottles of beer, with the appellant consuming\n                    the most with another friend.[note: 27] 12     After the appellant left the coffee-shop, he\n                    called Xiu to ask for access to GHK.[note: 28]However, Xiu told him that\n                    GHK was at her shop in East Coast and that if he wanted to see GHK, he would\n                    have to go to the shop.[note: 29]This upset the appellant and they heatedly quarrelled over the telephone. Xiu\n                    hung up on the appellant but the appellant called Xiu repeatedly and uttered\n                    profanities at her as he was very angry.[note: 30] 13     After failing to obtain Xiu’s agreement\n                    on access to GHK that night, the appellant decided to go to Xiu’s flat.\n                    This was nearby. He walked back to his HDB block, retrieved his bicycle and\n                    cycled to Xiu’s flat. The appellant testified that he had gone to\n                    Xiu’s flat for several reasons. He wanted to know if the deceased was\n                    happy after obtaining her Singapore citizenship and to ascertain her examination\n                    results. He also hoped that when Xiu returned, he could bring GHK back to his\n                        place.[note: 31]Further, he wanted to ask the deceased why\n                    she had hit and threatened GHK.[note: 32]According to the appellant,\n                    this was not the first time he had questioned the deceased on this\n                        issue.[note: 33]These reasons were rejected by the trial\n                    judge who determined that the appellant had gone to Xiu’s flat solely to\n                    kill the deceased. We pause here to note that the Prosecution no longer supports\n                    this finding of fact by the trial judge: see[35]below.",
        "The events in Xiu’s flat leading to the homicide": "14     When the appellant arrived at Xiu’s\n                    place, the deceased opened the door and let him into the flat. At this time, the\n                    two sub-tenants of Xiu’s flat, Zhao Jing and Liu Qiao Xiao\n                    (“Liu”), were both in their bedroom. About two to three minutes\n                    later, Zhao Jing walked to the toilet in the kitchen to take a shower. As she\n                    did so, she saw the appellant sitting beside the deceased near the computer\n                    table in the living room and noted that they were “talking in a normal\n                    manner” and that they were “not quarrelling”.[note: 34]After her\n                    shower while returning to her room, Zhao Jing heard the appellant talking and\n                    his tone sounded like he was laughing.[note: 35] 15     Soon after, Zhao Jing heard a loud scream. The\n                    deceased started calling out her name very loudly. Sensing that something was\n                    wrong, she opened her bedroom door and saw the deceased lying on the floor. The\n                    chair which the deceased was previously sitting on had toppled over and the\n                    appellant was squatting beside her. Zhao Jing moved closer to the kitchen and\n                    saw the appellant holding the deceased’s ear with one hand and her hair\n                    with his other hand. The appellant was banging the deceased’s head against\n                    the floor continuously and repeatedly shouted “Who am I” in\n                        Mandarin.[note: 36]In his testimony, the appellant claimed that\n                    the deceased was “very angry”, “disrespectful” and\n                    had suddenly taken “something” from the computer table before he\n                    grabbed hold of her.[note: 37] 16     When Zhao Jing tried to persuade the appellant\n                    to release his hands, the appellant looked up at her. He stopped banging the\n                    deceased’s head against the floor but his hands were still on her ear and\n                    hair. The appellant was extremely agitated. He told Zhao Jing that he was the\n                    deceased’s father and that Xiu had abandoned him. At the same time, the\n                    deceased entreated Zhao Jing in a very weak voice to call\n                        “999”.[note: 38]Zhao Jing returned to her\n                    bedroom. Concluding that this was a case of family violence, she decided to call\n                    Xiu instead of the police. As Zhao Jing and Liu could not locate Xiu’s\n                    number on their mobile phones, Zhao Jing went to the living room to get the\n                    deceased’s mobile phone. The appellant did not prevent her from doing so.\n                    After retrieving it, Zhao Jing returned to her bedroom and called Xiu who told\n                    her that she was rushing back home and to call for the police. 17     After the telephone conversation, Zhao Jing\n                    proceeded to the living room again and noticed that one of the appellant’s\n                    hands was on the deceased’s neck even though he was not applying any force\n                        then.[note: 39]He\n                    was simply sitting on the deceased who was lying on the floor.[note: 40]Zhao Jing\n                    tried to persuade him to release his hand but the appellant ignored her. He\n                    continued to complain aloud that Xiu had abandoned him and that she was a bad\n                    woman. As the appellant remained very agitated, Zhao Jing did not attempt to\n                    contradict him. She observed that, by then, the deceased had stopped moving and\n                    her face and feet had turned purplish.[note: 41] 18     Zhao Jing then ran back to her room and, as\n                    she was doing so, noticed a knife handle without a blade lying by the side of\n                    the appellant. On returning to the room, Zhao Jing told Liu that she was going\n                    to the police post to seek help. When she found the police post closed, she\n                    returned to the flat and observed that the main gate had been padlocked. She\n                    gained entrance by using her keys to open the main gate and saw that the\n                    appellant was using his mobile phone whilst still sitting on top of the\n                        deceased.[note: 42] 19     Zhao Jing left the flat again, without closing\n                    the gate and wooden door, to call the police using her phone. She met the police\n                    officers at the common staircase when they arrived and brought them to\n                    Xiu’s flat. As the wooden door had again been closed, she had to use her\n                    keys to open it.[note: 43]After entering the flat, she noticed that\n                    the appellant remained seated on top of the deceased. Zhao Jing then asked the\n                    appellant why he had hurt the deceased. In response, he once again started\n                    berating Xiu and all Chinese women.[note: 44]",
        "The appellant’s conduct after he strangled the\n                deceased": "20     It has been established that soon after the\n                    appellant strangled the deceased, he made several telephone calls using his\n                    mobile phone. He called his second brother, Ong Pang In (“Pang\n                    In”), to inform him that he had killed the deceased and that he\n                    “wanted to jump” to his death. He requested Pang In to cremate him\n                    and to throw the ashes into the sea.[note: 45]However, he was persuaded by\n                    Pang In to wait for the police to arrive. The appellant next called the sales\n                    manager of M/s Loh, Mr Loh Kian Choon (“Mr Loh”),\n                    to inform him of his actions and apologised for being unable to work for\n                    M/s Loh anymore. He also told Mr Loh that the key to the\n                    company’s bus was at his home.[note: 46]The appellant also\n                    called Xiu to tell her that he had killed the deceased. According to Xiu, he\n                    sounded calm and as if “he was the victor”.[note: 47] 21     According to Staff Sergeant Lee Chee Mun\n                    Tarmizi (“Ssgt Lee”) of the Civil Defence Force, he and his\n                    crew arrived at Blk 24 of Marsiling Drive at about 10.34pm. When they\n                    reached the sixth floor staircase landing after coming out of the lift, they met\n                    a Chinese female (presumably Zhao Jing) who vigorously gestured to them and led\n                    them to Xiu’s flat.[note: 48]Ssgt Lee was the first to\n                    speak to the appellant. He asked the appellant to move aside. The appellant\n                    complied with this direction but repeatedly said to him “No hope”\n                    in Mandarin.[note: 49] 22     Shortly after the police officers arrived at\n                    Xiu’s flat, the appellant gave his police statement to Sergeant Chng Chee\n                    Wee (“Sgt Chng”).[note: 50]In summary, the appellant stated\n                    that he did not go to Xiu’s flat with any intention of killing the\n                    deceased. He only formed such an intention after quarrelling with Xiu when he\n                    called Xiu whilst in the flat. The appellant then strangled the deceased (while\n                    apologising to the deceased at the same time) in order to cause Xiu to feel the\n                    pain of losing a loved one. This statement was relied upon by the trial judge to\n                    find that the appellant has gone to Xiu’s flat with the sole intention of\n                    killing the deceased. 23     Three police officers testified that the\n                    appellant “smelt” of alcohol when they saw him.[note: 51]According to Sgt Chng, the\n                    appellant would suddenly alternate between laughing and crying while at\n                    Xiu’s flat.[note: 52]While the appellant was being interviewed\n                    by Station Inspector Low Soon Hoe in the temporary holding area, he appeared to\n                    be tipsy. Suddenly, he began to knock his head against the wall violently and\n                    had to be restrained.[note: 53]The appellant was subsequently given a\n                    medical examination at 1.24am on 21 October 2007, about three hours after\n                    the offence.[note: 54]His blood was also taken for alcohol testing\n                    (“BAC”) and found to contain 84 mg of ethanol per 100ml of\n                        blood.[note: 55]",
        "The autopsy report": "24     An autopsy was carried out on the deceased on\n                    21 October 2007.[note: 56]Dr Teo Eng Swee\n                    (“Dr Teo”), a consultant forensic pathologist at the Health\n                    Sciences Authority, certified that the deceased died from strangulation. During\n                    trial, he testified that “moderate to severe force” must have been\n                    applied to the deceased’s neck in order to cause\n                        strangulation.[note: 57] 25     The autopsy report also revealed that the\n                    deceased suffered from several superficial incision and puncture wounds on her\n                    neck, limb and abdomen. Dr Teo testified that the broken blade found in\n                    Xiu’s flat was the cause of the incision and puncture wounds.[note: 58]He\n                    stated that the superficiality of the incision wounds at the neck suggested that\n                    they were not inflicted during a struggle; otherwise the incision would have\n                    been deeper or less even.[note: 59]However, he admitted that it\n                    was not possible to assert with any certainty whether these were peri or post\n                    mortem injuries.[note: 60]",
        "The trial judge’s decision": "26     As the fact of the killing was not disputed,\n                    the trial judge noted, inPublic Prosecutor v Ong Pang\n                        Siew[2009] 4 SLR(R) 474 (“the judgment”)\n                    (at [41]), that the only remaining issues were whether the appellant intended to\n                    cause the death of the deceased and whether he was entitled to the defence of\n                    diminished responsibility found in Exception 7 of s 300 of the Penal\n                    Code. 27     The trial judge rejected the appellant’s\n                    evidence that he had gone to Xiu’s flat to wait for GHK (see [42] of the\n                    judgment). He relied on the fact that the appellant was free for the whole of\n                    that Saturday but chose to spend his time doing household chores and drinking\n                    beer with his friends for five to six hours. The trial judge found (at [43] of\n                    the judgment) that the appellant felt betrayed by Xiu after he had given her and\n                    the deceased a new life in Singapore. After the quarrel over the phone with Xiu\n                    about access to GHK, the appellant had proceeded to Xiu’s flat with the\n                    intention of killing the deceased so that Xiu could experience the pain of\n                    losing a loved one in the same way that he did after the family broke up (see\n                    [43] and [47] of the judgment). 28     The trial judge took into account the\n                    following conduct of the appellant in determining that he was rational and had\n                    intended to kill the deceased: (a)     After the deceased was pinned to the\n                        floor by the appellant, he carried on hitting her head against the floor,\n                        sat on top of her and strangled her. The appellant knew what he was doing\n                        and was able to respond coherently to Zhao Jing’s pleas to let the\n                        deceased go (see [44] of the judgment). (b)     The appellant obviously used the knife’s\n                        blade to make controlled and deliberate cuts on the deceased’s body.Whether the appellant inflicted the wounds before or\n                            after the deceased’s death made no material difference since they\n                            were intentional(see [45] of the\n                    judgment). (c)     The\n                        appellant’s conversations with Mr Loh and Xiu after the\n                        deceased’s death and the subsequent communication with the police\n                        officers who arrived at Xiu’s flat,vizhis request to go to the toilet, his knowledge of how serious his actions\n                        were and that he would pay with his own life, showed his clarity of mind\n                        (see [46] of the judgment). 29     As for the defence of diminished\n                    responsibility, the trial judge rejected the defence’s expert’s\n                    opinion that the appellant suffered from major depressive disorder. Instead, he\n                    accepted the Prosecution’s expert’s opinion that the appellant had\n                    no mental illness (see [53] of the judgment). He held that even if the appellant\n                    was suffering from a major depressive episode, there had been no substantial\n                    impairment of his mental responsibility for his acts that night (see [54] of the\n                    judgment). Accordingly, he found that the Prosecution had made out its case\n                    against the appellant beyond a reasonable doubt and that the defence of\n                    diminished responsibility failed on a balance of probabilities. The appellant\n                    was found guilty and convicted of murder.",
        "Submissions by the parties": "30     In this appeal, the appellant’s\n                    submissions centred upon three issues. It was argued that: (a)     the appellant did not intend to kill\n                        the deceased (“the s 300(a)\n                    submission”); (b)     the appellant did not intend to inflict the injury which resulted in\n                        the death of the deceased (“the s 300(c) submission”);\n                        and (c)     the\n                        appellant qualified for the defence of diminished responsibility because he\n                        was suffering from a major depressive disorder which led to a substantial\n                        impairment of his mental responsibility at the time of the offence\n                        (“the diminished responsibility\n                submission”). 31     The Prosecution, on the other hand, submitted\n                    as follows: (a)     the trial judge’s finding that\n                        the appellant possessed the intention to kill the deceased should not be\n                        disturbed as the appellant was capable of rational thought at the material\n                        time. The finding of facts was not plainly wrong or arrived at against the\n                        weight of the evidence on record;[note: 61] (b)     the appellant, by strangling the deceased, intended to\n                        cause the injuries to her neck which was sufficient in the ordinary course\n                        of nature to cause death;[note: 62]and (c)     the trial judge was correct in holding that the\n                        appellant was not suffering from an abnormality of mind which substantially\n                        impaired his mental responsibility at the time he killed the\n                            deceased.[note: 63] 32     We preface our review of the matter by\n                    pointing out that if the defence of diminished responsibility is made out, the\n                    conviction of murder will have to be set aside and substituted by a conviction\n                    of culpable homicide not amounting to murder as provided by Exception 7 in\n                    s 300 of the Penal Code.",
        "The decision of the court": "",
        "The s 300(a) and (c) submissions": "33     We will first address, briefly, the trial\n                    judge’s finding of fact that the appellant had gone to Xiu’s flat\n                    with the sole intention of killing the deceased. He held that the appellant\n                    intended to cause the deceased’s death when he went to Xiu’s flat\n                    (see [42]–[47] of the judgment). However, in our view, this finding is not\n                    supported by the evidence. The appellant had called Xiu at about 8.39pm on the\n                    day of the offence to ask for access to GHK. A heated quarrel soon ensued\n                    between them. Much was made of this fact by the Prosecution in the High Court to\n                    establish that the appellant had proceeded to Xiu’s flat with the\n                    intention of killing the deceased as he was very angry with her.[note: 64]The trial judge accepted this\n                    submission and observed that if the appellant had really wanted to see GHK, he\n                    could have gone to Xiu’s shop in the East Coast to pick him\n                        up.[note: 65] 34     However, it should also be noted that the\n                    appellant knew that Xiu would eventually return to the flat with GHK and he\n                    could pick GHK up from Xiu’s flat, which was only a few minutes away from\n                    his home. There was thus good reason for the appellant to go directly to\n                    Xiu’s flat in Marsiling instead of going to her shop in East Coast which\n                    was much farther away and required motorised transport to reach. Furthermore, if\n                    the appellant had indeed gone to Xiu’s flat just to kill the deceased,\n                    there was no explanation for the time he spent amiably conversing with her. He\n                    also knew that there were tenants in Xiu’s flat who would recognise him if\n                    he harmed the deceased. Zhao Jing had testified that when she first saw the\n                    appellant, he was talking to the deceased in a normal manner and they were not\n                    quarrelling. In fact, she stated that the appellant’s tone “sounded\n                    like he was laughing”.[note: 66]Further, he made no attempt to\n                    conceal his identity from Zhao Jing and Liu and in fact revealed to Zhao Jing\n                    that he was the deceased’s father. In addition, the police statement\n                    recorded by Sgt Chng at Xiu’s flat, which the trial judge relied on\n                    in concluding that the appellant had intended to cause the deceased’s\n                    death, also clearly emphasised that the appellant had gone to Xiu’s flat\n                    without any intention of killing her. Sgt Chng recorded the appellant as\n                    informing him that “[the appellant] came to the unit withno intentionto kill [the deceased] at\n                        all”[note: 67][emphasis added]. 35     In the course of oral submission, the\n                    Prosecution conceded, after questioning from this court, that the evidence could\n                    not support the trial judge’s finding that the appellant had gone to the\n                    flat with the intention of killing the deceased. Instead, it submitted that the\n                    appellant had probably formed the intention after he had “snapped”. This concession necessarily throws a\n                    different light on the subsequent events that led to the killing of the deceased\n                    by the appellant. We should add that if the Prosecution had not made this\n                    concession, we would have found this to be a fact.[note: 68] 36     We accept that after he\n                    “snapped”, the appellant intended to seriously harm, if not kill,\n                    the deceased. He must have known that his act of strangling her might likely\n                    kill her or, at the very least, cause injuries that would in the ordinary course\n                    have been sufficient to kill her. The pathologist confirmed that moderate to\n                    severe force was used in the strangulation. The death was not an accident. There\n                    is also undisputed evidence that while strangling the deceased, the appellant\n                    also apologised to her for the harm caused. This was recorded by Sgt Chng\n                    on a piece of paper (and subsequently copied to his police patrol log sheet)\n                    when he interviewed the appellant at Xiu’s flat.[note: 69]We further note\n                    that after the deceased stopped moving, the appellant called in quick succession\n                    Pang In, Mr Loh as well as Xiu to inform them that he had killed the\n                    deceased. Certainly, at some level of consciousness the appellant was aware of\n                    what he was doing. In the circumstances, we accept that the Prosecution has\n                    established that the appellant intentionally committed an act of homicide. The\n                    crucial issue is whether he was suffering from diminished responsibility at the\n                    material time. 37     The trial judge rejected this defence because\n                    he found that the appellant was “lucid and knew what he was\n                    doing”. The trial judge also thought that the appellant’s ability\n                    to respond coherently to Zhao Jing’s pleas to let go of the deceased\n                    “pointed clearly to a rational person in possession of all his\n                    senses” (at [54] of the judgment). With respect, this finding (for the\n                    reasons we give below) over-simplified a complex amalgam of issues. It failed to\n                    adequately take into account a crucial mass of evidence which unmistakeably\n                    shows that many aspects of the appellant’s conduct that night were nothing\n                    short of bizarre, if not entirely abnormal, when assessed holistically. The fact\n                    that an accused may seem to behave rationally or respond coherently at different\n                    points during an offending incident is by no means determinative of the\n                    applicability of the defence of diminished responsibility (see below at[61]). Individuals suffering from some\n                    types of serious mental illnesses do not entirely lose their ability to think or\n                    function normally throughout (or even after) an offending episode. A failure to\n                    appreciate this aspect of certain types of mental illnesses can lead to an\n                    erroneous rejection of this statutory defence.",
        "Defence of diminished responsibility": "",
        "Assessment of expert evidence by an appellate court": "38     In this case, the expert witnesses called by\n                    the Prosecution and the appellant could not agree on whether, at the material\n                    time, the appellant was suffering from a major depressive episode that caused an\n                    abnormality of mind that substantially impaired his mental responsibility for\n                    his acts in causing the death of the deceased. The principles to be applied by\n                    an appellate court in assessing a trial judge’s findings on expert\n                    evidence have been set out inSakthivel Punithavathi v Public\n                        Prosecutor[2007] 2 SLR(R) 983 as follows: 74    An appellate court will be slow to criticise\n                            without good reason a trial court's findings on expert evidence; see the\n                            Privy Council case ofAntonio Caldeira Dias v\n                                Frederick Augustus GrayAIR 1936 Journal 154 at 155, 157\n                            and 158, ...However, if the appellate court\n                                entertains doubts as to whether the evidence has been satisfactorily\n                                sifted or assessed by the trial court it may embark on its own\n                                critical evaluation of the evidence focussing on obvious errors of\n                                fact and/or deficiencies in the reasoning\n                        process. 75    Where there is conflicting evidence between experts\n                            it will not be the sheer number of experts articulating a particular\n                            opinion or view that matters, but rather the consistency and logic of\n                            the preferred evidence that is paramount. Generally speaking, the court\n                            should also scrutinise the credentials and relevant experience of the\n                            experts in their professed and acknowledged areas of expertise. Not all\n                            experts are of equal authority and/or reliability. In so far as medical\n                            evidence is concerned, an expert with greater relevant clinical\n                            experience may often prove to be more credible and reliable on\n                            “hands-on” issues although this is not an inevitable rule\n                            of thumb. Having said that, there is no precise pecking order or\n                            hierarchy relating to expert evidence. Experts may sometimes be\n                            abundantly eminent while lacking credibility in a particular\n                            matter. 76    What is axiomatic is that a judge is not entitled\n                            to substitute his own views for those of an uncontradicted expert's:Saeng-Un Udom v PP[2001]\n                            2 SLR(R) 1. Be that as it may, a court must not on the other\n                            hand unquestioningly accept unchallenged evidence. Evidence must\n                            invariably be sifted, weighed and evaluated in the context of the\n                            factual matrix and in particular, the objective facts. An expert's\n                            opinion “should not fly in the face of proven\n                                extrinsic facts relevant to the matter”... In\n                            reality, substantially the same rules apply to the evaluation of expert\n                            testimony as they would to other categories of witness testimony.\n                            Content credibility, evidence of partiality, coherence and a need to\n                            analyse the evidence in the context of established facts remain vital\n                            considerations; demeanour, however, more often than not recedes into the\n                            background as a yardstick. [emphasis added] Before setting out the expert witnesses’ respective opinions, it\n                    would be useful to discuss the symptoms and established guidelines for the\n                    diagnosis of a major depressive episode. Major depressive disorder – nature and guidelines for\n                diagnosis 39     Both expert witnesses relied on theDiagnostic and Statistical Manual of Mental Disorders(4th Ed) (“DSM-IV-TR”). TheDSM-IV-TRis published by the American\n                    Psychiatric Association. It provides the standard classification of mental\n                    disorders used by mental health professionals around the world and is used in\n                    their diagnosis of patients across different clinical settings.[note: 70] 40     In order to establish a diagnosis of major\n                    depressive episode, there are several criteria which have to be\n                        satisfied.[note: 71]In the context of this appeal,\n                    Criteria B, D and E are not relevant. Criterion B is concerned with\n                    symptoms relating to a mixed episode (consisting of both manic episode and major\n                    depressive episode). Criteria D and E deal with symptoms arising directly\n                    from the physiological effects of a substance or general medical condition and\n                    with symptoms not accounted for by bereavement. Only Criteria A and C are\n                    relevant, and they state:[note: 72] Criteria for Major Depressive Episode A.Five (or more) of\n                            the following symptoms have been present during the same 2-week period\n                            and represent a change from previous functioning; at least one of the\n                            symptoms is either (1) depressed mood or (2) loss of interest or\n                            pleasure. Note:  Do not include symptoms that are clearly due\n                                to a general medical condition, or mood-incongruent delusions or\n                                hallucination. (1)    depressed mood most of the day, nearly every\n                                day, as indicated by either subjective report (e.g., feels sad or\n                                empty) or observation made by others (e.g., appears tearful).\n                                … (2)    markedly diminished interest or pleasure in\n                                all, or almost all, activities most of the day, nearly every day (as\n                                indicated by either subjective account or observation made by\n                                others) (3)    significant weight loss when not dieting or\n                                weight gain (e.g., a change of more than 5% of body weight in a\n                                month), or decrease or increase in appetite nearly every day.\n                                ... (4)    insomnia or hypersomnia nearly every\n                                day (5)    psychomotor agitation or retardation nearly\n                                every day (observable by others, not merely subjective feelings of\n                                restlessness or being slowed down) (6)    fatigue or loss of energy nearly\n                                everyday (7)    feelings of worthlessness or excessive or\n                                inappropriate guilt (which may be delusional) nearly every day (not\n                                merely self-reproach or guilt about being sick) (8)    diminished ability to think or concentrate, or\n                                indecisiveness, nearly every day (either by subjective account or as\n                                observed by others) (9)    recurrent thoughts of death (not just fear of\n                                dying), recurrent suicidal ideation without a specific plan, or a\n                                suicide attempt or a specific plan for committing\n                            suicide ... C.    The symptoms cause clinically significant distress\n                            or impairment in social, occupational, or other important areas of\n                            functioning. 41     TheDSM-IV-TRprovides (at pp 349–350) that the essential feature of a major\n                    depressive episode is a period of at least two consecutive weeks during which\n                    there is either depressed mood or the loss of interest or pleasure in nearly all\n                        activities.[note: 73]It further states that “[f]amily\n                    members often notice social withdrawal or neglect of pleasurable\n                    avocations” and appetite is usually reduced. Many who suffer from a major\n                    depressive episode feel that they have to force themselves to eat and where\n                    appetite reduction is severe; there may be a significant loss in\n                        weight.[note: 74] 42     TheDSM-IV-TRalso emphasises (at p 351) the importance of a careful interview in the\n                    elicitation of symptoms of a major depressive episode: A careful interview is essential to elicit symptoms of\n                            a Major Depressive Episode. Reporting may be compromised by difficulties\n                            in concentrating, impaired memory, or a tendency to deny, discount, or\n                            explain away symptoms. Information from additional informants can be\n                            especially helpful in clarifying the course of current or prior Major\n                            Depressive Episodes and in assessing whether there have been any Manic\n                            or Hypomanic Episodes. [emphasis added] 43     In conducting a diagnosis of a patient, it is\n                    important to ensure that the interviews with the patient are carried out\n                    carefully. Additional information from people who would ordinarily interact with\n                    the patient would be especially useful. Obviously, the patient, being unwell,\n                    may not be the best source of information of his own mental state. It is also\n                    not unusual for patients to play down their difficulties or be in a state of\n                    denial.DSM-IV-TRfurther highlights that the\n                    evaluation of the symptoms of a major depressive episode is especially difficult\n                    when they occur in an individual who also has a general medical condition\n                        (eg, cancer, stroke, myocardial infarction and\n                    diabetes) due to the overlap in their signs and symptoms. Such symptoms should\n                    count towards a major depressive episode unless they areclearly and fullyaccounted for by a general medical condition.\n                    Statistics stated inDSM-IV-TRshow that up to 20%\n                    to 25% of individuals with these aforesaid medical conditions will develop a\n                    major depressive disorder during the course of their general medical\n                        conditions.[note: 75]In theClinical Practice\n                        Guidelines, Depressionpublished in March 2004 (Ministry of\n                    Health, Singapore), it is noted (at p 4) that there is a high prevalence of\n                    depression in Singapore, with a percentage of 8.6% in adults. Further,\n                    depression can co-exist with many medical conditions such as cancers\n                    (25%–38%), diabetes (24%) or coronary artery disease\n                        (16%–19%).[note: 76] 44     Several other factors which may lead to or\n                    contribute to a major depressive disorder as provided in theDSM-IV-TRshould be noted at this point. First, episodes of a\n                    major depressive disorder often follow a severe psycho-social stressor, such as\n                    the death of a loved one or a divorce.[note: 77]Also, substance dependence\n                    (particularly alcohol or cocaine dependence) may contribute to the onset or\n                    exacerbation of a major depressive disorder.[note: 78]Third, a major depressive\n                    disorder is one point five to three times more common among first-degree\n                    biological relatives of persons with this disorder than among the general\n                        population.[note: 79] 45     Having considered the symptoms and guidelines\n                    for the diagnostic process of a major depressive episode, we now set out the\n                    expert opinions. The appellant’s expert evidence 46     At the trial, Dr Tommy Tan\n                    (“Dr Tan”), a psychiatrist of some 15 years’\n                    experience who is currently in private practice, testified on behalf of the\n                    appellant. Dr Tan graduated from the National University of Singapore and\n                    has a Master of Medicine degree in Psychiatry. He was previously the senior\n                    consultant in the Department of Forensic Psychiatry of the Institute of Mental\n                        Health.[note: 80]He has given expert evidence in the High\n                    Court on behalf of the Prosecution in capital cases on numerous\n                        occasions.[note: 81] 47     Dr Tan examined the appellant on three\n                    occasions in August 2008. He communicated with the appellant in the Hokkien\n                    dialect as the appellant was more comfortable conversing in Hokkien than in\n                    Mandarin. Dr Tan said this helped him to establish good rapport with the\n                    appellant and allowed him to elicit more information from him.[note: 82]Dr Tan also interviewed Pang In, the appellant’s second sister, Sally\n                    Ong (“Sally”), and fourth sister, Ong Ah Soi. Before examining the\n                    appellant, Dr Tan read the report of the Prosecution’s expert,\n                    Dr Jerome Goh Hern Yee (“Dr Goh”), dated\n                    21 November 2007 (“Dr Goh’s first report) and the nursing\n                    observation charts at the Changi Complex Medical Centre where the appellant was\n                        remanded.[note: 83] 48     In his report dated 25 August 2008\n                    (“Dr Tan’s report”), Dr Tan noted that the\n                    appellant has a “strong family history of mental\n                        disorder”[note: 84]and gave a description of the\n                    appellant’s background, his marital problems with Xiu, his psychiatric\n                    symptoms and observations of his recent behaviour by his family members.\n                    Dr Tan gave his psychiatric diagnosis as follows:[note: 85] Psychiatric Diagnosis Mr Ong Pang Siew hasmajor depressive disorder,\n                            single episode of moderate severity, chronic(296.22,\n                        Diagnostic and Statistical Manual IV-TR) ormoderate\n                            depressive episode without somatic syndrome(F32.10,\n                        International Classification of Diseases, edition 10) at the time of the\n                        alleged offence. It is characterised by a moderately severe depressed mood, feelings of\n                        frustration, irritability, lethargy, insomnia, loss of appetite, loss of\n                        weight, difficulty coping with work, negative thoughts and thoughts of\n                        dying. He drank alcohol to help him to sleep and to cope with his depressed\n                        mood. He has depressed mood since 2005 or earlier. His mental disorder was\n                        exacerbated by the divorce and the difficulties of having access to his\n                        son. He hadacute alcohol intoxication(303.00\n                        DSM IV-TR; F10.0, ICD 10) at the time of the alleged offence. He and his\n                        companions had drunk more than twenty bottles of beer from afternoon until\n                        evening. He was tipsy after drinking. Mental State at the time of the alleged\n                            offence Pang Siew has major depressive disorder at the time of the alleged\n                        offence. He was already depressed in mood. His depressive disorder made him\n                        irritable. His wife had refused to let him have access to his son which made\n                        him more frustrated and depressed. He had been drinking for at least 5 to 6 hours before the alleged\n                        offence. He became very agitated by his stepdaughter. When his stepdaughter took a\n                        knife, his actions were initially reactive or defensive. He was so agitated\n                        that he lost his control of his actions. He was acting impulsively. He was\n                        not aware of the consequences of his actions until after his stepdaughter\n                        died. He qualifies for the defence of diminished responsibility. He was\n                        suffering from major depressive disorder that caused an abnormality of mind\n                        that substantially impaired his mental responsibility for his acts in\n                        causing the death of his stepdaughter. [emphasis in underline and bold in original] The Prosecution’s expert evidence 49     In rebuttal of Dr Tan’s evidence,\n                    the Prosecution called Dr Goh to give his expert opinion. Dr Goh has a\n                    Masters degree in Psychiatry Medicine and a Masters degree in Clinical Forensic\n                    Psychiatry & Psychology (London). He has been an associate consultant at the\n                    Institute of Mental Health for about eight years. In these eight years,\n                    Dr Goh has given expert evidence once in the High Court and five times in\n                    the Subordinate Courts.[note: 86]The evidence in the High Court was on the\n                    mental health of an accused charged with a sexual offence. This case was the\n                    first occasion when Dr Goh gave expert evidence on the mental state of an\n                    accused facing a capital charge.[note: 87] 50     Dr Goh examined the appellant on three\n                    occasions in November 2007 about three weeks after the offence. Unlike\n                    Dr Tan, Dr Goh conducted his examination of the appellant in\n                        Mandarin,[note: 88]notwithstanding the fact that the appellant was\n                    “more comfortable with Hokkien”[note: 89]and had told Dr Goh\n                    that he would “like to speak in Hokkien.”[note: 90]Although\n                    Dr Goh explained to the appellant that he could seek any clarification\n                    needed, he conceded that he did not tell the appellant that he could provide an\n                    interpreter for the examination.[note: 91] 51     Before diagnosing the appellant, Dr Goh\n                    spoke to Pang In and another sister of the appellant, Ong Tok May (“Tok\n                    May”), on 15 November 2007. It appears that only brief details about\n                    the appellant’s behaviour were obtained during this meeting. Dr Goh\n                    learnt that the appellant was feeling “pek\n                        chek” (frustrated) and “a bit sad” but was\n                    able to work.[note: 92]The focus of that particular interview was on\n                    the appellant’s family history of mental disorder. Pang In suffered from\n                    depression and was then undergoing follow-up sessions. In addition, Tok May was\n                    taking haloperidol, an anti-psychotic drug because “she thinks a\n                        lot”.[note: 93]Also, the appellant’s mother had taken\n                    some prescribed medication at a private clinic “to calm\n                    down”. 52     Dr Goh wrote two reports. The first,\n                    earlier referenced as “Dr Goh’s first report”, was\n                    dated 21 November 2007 (see[47]above)\n                    and the other was dated 15 September 2008 (“Dr Goh’s\n                    second report”). In Dr Goh’s first report,[note: 94]he gave a\n                    brief account of the appellant’s personal background, his marital history\n                    and noted that Pang In said the appellant was not “physically or verbally\n                    aggressive by nature and that he is very responsible in his work and well liked\n                    by his bosses”.[note: 95]The material part of Dr Goh’s first\n                    report stated: Background History: This is his first contact with the psychiatric services. One of his\n                        brothers is being treated for depression. Prior to killing, his mood has\n                        been low because of his marital difficulties, but he was able to function at\n                        work and did not receive any complaints about his work performance. ... Personal History: ... He has been a bus driver for the past twenty years, often working many\n                        years for the same company. He was with the present company for seven months\n                        at the time of the offence. He has diabetes and hypertension, followed-up at\n                        a polyclinic. ... Mental State Examination: He was relevant and coherent in Mandarin during the interviews. He was not\n                        depressed. The nurses did not observe any psychotic or agitated behaviour\n                        during this remand. Opinion: I am of the opinion that: 1.Mr Ong Pang Siew has no mental illness.However the effects of recent ingestion of alcohol and the\n                                heightened emotions during altercations with his wife and the victim\n                                that night, in a background of severe and longstanding marital and\n                                family problems, had contributed to his actions leading to the\n                                offence. 2.He was not of unsound mind at the time of the\n                                alleged offence. 3.He is currently fit to plead in a Court of\n                                Law. [emphasis in bold italics and underline in original, emphasis in italics\n                        added] 53     Dr Goh’s second report was written\n                    after he had the opportunity to consider Dr Tan’s report. This\n                    report, in its entirety, read:[note: 96] ONG PANG SIEWMALE NRIC NO: S1573035HDOB 17 AUGUST 1962 I refer to your letter dated 29th August 2008. I have read Dr Tommy\n                        Tan’s report dated 25th August 2008 and considered his findings and\n                        opinions. I interviewed Pang Siew between about three to four weeks after the death\n                        of his step-daughter. He did describe experiencing low mood prior to the\n                        killing, contributed by his marital problems and difficulty having access to\n                        his son. However, he said his appetite had been normal. He did not have any\n                        psychotic symptoms. He was also not suicidal. He described having depressive symptoms such as lethargy, guilt and poor\n                        sleep, but said these symptoms surfaced after his step-daughter’s\n                        death. He had felt very guilty and remorseful for his actions. He said he\n                        was crying while he was strangling her, because he felt hurt that they\n                        treated him poorly. When told by the ambulance crew that she had died, he\n                        cried again. The psychiatric nursing observations did not observe him to have any\n                        persistent depressive symptom during his remand. Moreover, having a major\n                        depressive episode would have impacted significantly on his functioning. He\n                        was still able to fulfil his obligations at work as a bus driver leading to\n                        the offence. He had no complaints about his work performance and did not\n                        have any accident, complaints from his passengers or conflicts with other\n                        motorists. Hence, I am of the opinion that Pang Siew did not have a major depressive\n                        disorder around the time of the offence. 54     Although both Dr Tan and Dr Goh\n                    acknowledged the significance of the appellant’s family history of mental\n                    disorder, neither of them enquired deeply into the precise nature of the mental\n                    disease(s) affecting the appellant’s family members and whether they were\n                    hereditary in nature.[note: 97]As stated\n                    (at [29] above), the trial judge accepted Dr Goh’s evidence that the\n                    appellant was not suffering from a major depressive episode at the time of the\n                    offence. 55     Before we evaluate the evidence of the two\n                    experts, it will be useful to set out generally the law on the defence of\n                    diminished responsibility. Law on diminished responsibility 56     The defence of diminished responsibility is\n                    encapsulated in Exception 7 of s 300 of the Penal Code, which reads as\n                    follows: Culpable homicide is not murder if the offender was suffering from such\n                        abnormality of mind (whether arising from a condition of arrested or\n                        retarded development of mind or any inherent causes or induced by disease or\n                        injury) as substantially impaired his mental responsibility for his acts and\n                        omissions in causing the death or being a party to causing the death. 57     Exception 7 was derived from s 2 of\n                    the English Homicide Act, 1957: see second reading of the Penal Code (Amendment)\n                    Bill,Singapore Parliamentary Debates, Official\n                        Report(24 May 1961), vol 14 at\n                    col 1509–1510 (K M Byrne, Minister for Labour and Law). The\n                    effect of this defence is that: where the [fact-finder is] satisfied that a person charged with murder,\n                        though not insane, suffered from mental weakness or abnormality bordering on\n                        insanity to such an extent that his responsibility was substantially\n                        diminished, the crime may be reduced from murder to culpable\n                        homicide. (seeReport of the Royal Commission on Capital\n                        Punishment(1949–1953) (Cmnd 8932) at para 378). The\n                    defence attempts to distinguish between different levels of control or\n                    consciousness that a particular accused may have when the homicide is committed.\n                    An accused who kills while suffering from the prescribed state of mental\n                    abnormality is seen by the law to be morally less culpable and less deserving of\n                    extreme punishment than one in full possession of his faculties. However, as\n                    Professor Glanville Williams has penetratingly observed in Glanville Williams,Textbook pf Criminal Law(Stevens & Sons,\n                    2nd Ed, 1983) at p 686: [I]t has meant that psychiatrists have been put under pressure to testify\n                        in terms that go beyond their professional competence ... [as the]\n                        requirement that the defendant’s abnormality of mind should have\n                        substantially impaired his mental responsibility, is as embarrassing a\n                        formula for a scientifically-minded witness as could be devised. 58     It is trite law that the appellant bears the\n                    burden of proving the defence of diminished responsibility on a balance of\n                    probabilities: seeChua Hwa Soon Jimmy v Public\n                        Prosecutor[1998] 1 SLR(R) 601 (at [8])\n                        (“Jimmy Chua”). InTook Leng How v Public Prosecutor[2006]\n                    2 SLR(R) 70, this Court reiterated (at [46]) the three-limb test which\n                    an accused has to satisfy to establish the defence of diminished\n                    responsibility: (a)     the accused was suffering from an\n                        abnormality of mind at the time he caused the victim’s\n                    death; (b)     the\n                        abnormality of mind arose from a condition of arrested or retarded\n                        development of mind or any inherent causes, or was induced by disease or\n                        injury; and (c)     the\n                        abnormality of mind substantially impaired the accused’s mental\n                        responsibility for his acts and omissions in causing the\n                    death. 59     This court held that whilst limb (b)\n                    (otherwise known as the aetiology or root cause of the abnormality) is a matter\n                    largely within the purview of expert opinion, limb (a) and limb (c)\n                    are matters which cannot be the subject of any medical opinion and must be left\n                    to the determination of the trial judge, as the finder of fact. In doing so, the\n                    trial judge is, in the words of Lord Keith of Kinkel inWalton v The Queen[1978] 1 AC 788 (at 793): entitled and indeed bound to consider not only the\n                            medical evidence but the evidence upon the whole facts and circumstances\n                            of the case. These include the nature of the killing, the conduct of the\n                            defendant before, at the time of and after it and any history of mental\n                            abnormality. … That task is to be approached in a broad common\n                            sense way. [emphasis added] 60     Hence, in considering whether the defence of\n                    diminished responsibility has been established, not only does the trial judge\n                    have to consider the medical evidence, he is also required to take into account\n                    all other relevant facts and circumstances of the case, including the conduct of\n                    the accused before, during and after the offence: seeJimmy\n                        Chua(at [28]–[29]). 61     What amounts to an “abnormality of\n                    mind” under the defence of diminished responsibility has been explicated\n                    inR v Byrne[1960] 2 QB 396 (at 403)\n                        (“R v Byrne”) by\n                    Lord Parker CJ as follows: “Abnormality of mind,” … means a state of mind so\n                        different from that of ordinary human beings that the reasonable man would\n                        term it abnormal. It appears to us to be wide enough to cover the\n                        mind’s activities in all its aspects, not only the perception of\n                        physical acts and matters, and the ability to form a rational judgment as to\n                        whether an act is right or wrong, but also the ability to exercise the will\n                        power to control physical acts in accordance with that rational judgment.The expression “mental responsibility for his\n                            acts” points to a consideration of the extent to which the\n                            accused’s mind is answerable for his physical acts which must\n                            include a consideration of the extent of his ability to exercise will\n                            power to control his physical acts. [emphasis added] 62     This interpretation was accepted as correct\n                    and authoritative by the Privy Council inElvan Rose v The\n                        Queen[1961] AC 496 (at 507). Lord Tucker\n                    clarified (at 507–508) that the test is not necessarily “the\n                    borderline of insanity”: Their Lordships respectfully accept this interpretation of the words\n                        “abnormality of mind” and “mental\n                        responsibility” as authoritative and correct. They would not,\n                        however, consider that the Court of Criminal Appeal was intending to lay\n                        down that in every case the jury must necessarily be directed that the test\n                        is always to be the borderline of insanity. There may be cases in which the\n                        abnormality of mind relied upon cannot readily be related to any of the\n                        generally recognised types of “insanity.” If, however,\n                        insanity is to be taken into consideration, as undoubtedly will usually be\n                        the case, the word must be used in its broad popular sense. It cannot too\n                        often be emphasised that there is no formula that can safely be used in\n                        every case—the direction to the jury must always be related to the\n                        particular evidence that has been given and there may be cases where the\n                        words “borderline” and “insanity” may not be\n                        helpful. Lord Tucker correctly emphasised that “a man may know what he is doing and intend to do it and yet suffer from\n                        such abnormality of mind as substantially impairs his mental\n                        responsibility” (at 508). 63     Lord Parker CJ’s\n                    interpretation inR v Byrneof the term\n                    ‘abnormality of mind’ has also been accepted by this Court inJimmy Chua(at [22]) andMansoor s/o Abdullah and another v Public Prosecutor[1998]\n                    3 SLR(R) 403 (at [13]) for the purposes of limb (a) of\n                    Exception 7. InJimmy Chua(at [23]), this\n                    court approvingly citedR v Seers(1984)\n                    79 Cr App R 261, where Griffiths LJ held that chronic reactive\n                    depression could on the evidence before him sustain the defence of diminished\n                    responsibility. We should add that the nature of the causative injury can be\n                    either physical or psychological. A reactive depression caused by extreme\n                    adversity or stress may establish the exception: seeR v\n                        Bathurst[1968] 2 QB 99;G\n                        Krishnasamy Naidu v Public Prosecutor[2006]\n                    4 SLR(R) 874 (“Naidu”);Public Prosecutor v Juminem and another[2005]\n                    4 SLR(R) 536 (“Juminem”). 64     What in fact amounts to a substantial\n                    impairment of mental responsibility is largely a question of commonsense to be\n                    decided by the trial judge as the finder of fact. As a working guide,\n                    substantial does not require a total impairment; neither is it trivial nor\n                    minimal: seeJuminem(at [30]) applyingRegina v Lloyd[1967] 1 QB 175 (at 178).As stated above, while medical evidence would be\n                        important in determining the presence and/or extent of impairment, whether\n                        an accused’s mental responsibility was substantially impaired is\n                        ultimately a question to be decided by the court based on all the evidence\n                        before it: seeZailani bin Ahmad v Public\n                        Prosecutor[2005] 1 SLR(R) 356 (at [52]). The courts\n                    have flexibly construed similar provisions in England and New South Wales and\n                    have declined to confine the defence to just clinically recognised illnesses.\n                    Indeed, the phrase “abnormality of mind” is wide enough to cover\n                    all aspects of the mind’s activities including transient or ephemeral\n                    manifestations of illnesses, though as a matter of construction (and policy) the\n                    courts have excluded “mental disorders” solely attributable to the\n                    consumption or mal-administration of alcohol, drugs or other like substances.\n                    Such disorders are not due to inherent causes. The exception would also not\n                    apply to emotions of rage, prejudices, hate, passing jealousy and the like\n                    unless they are due to inherent causes rather than external stimuli alone.\n                    However, if those emotions trigger an inherent internal derangement that\n                    culminates in a pathological condition (eg, morbid\n                    jealousy), then the exception could apply: see Naidu at\n                ([9]–[10]). 65     In reviewing the trial judge’s decision,\n                    we are conscious that, as an appellate court, we should be slow to overturn his\n                    findings of fact unless they can be shown to be plainly wrong or against the\n                    weight of the evidence. However, when it comes to inferences of facts to be\n                    drawn from the actual findings, a different approach will be taken. An appellate\n                    court in such cases is as competent as any trial judge to draw any necessary\n                    inferences of fact from the circumstances of the case. Intervention by an\n                    appellate court is justified when the inferences drawn by a trial judge are not\n                    supported by the primary or objective evidence on record:Jagatheesan s/o Krishnasamy v Public Prosecutor[2006]\n                    4 SLR(R) 45 (at [38]). Evaluation of the expert witnesses’ diagnosis 66     Dr Goh, in his evidence, accepted that in\n                    order to diagnose the appellant’s mental condition, it was necessary for\n                    him to examine the appellant and to obtain information from those close to him\n                    on whether the appellant was suffering from any impairment of functioning in the\n                    relevant period.[note: 98]Further, when evaluating the symptoms of\n                    depression elicited from the appellant, he had to clarify whether there was any\n                    significant impairment in his social functioning, such as his interaction with\n                    friends, his time spent with his son and whether there was any occupational\n                    impairment such as inability or difficulty in carrying on with his\n                        work.[note: 99] 67     This approach appears in line with the\n                    guidelines in the diagnostic process provided by theDSM-IV-TR(see above at[42]–[43]). However,\n                    instead of adhering to this requisite standard, Dr Goh merely relied upon\n                    his interviews with the appellant, Pang In and Tok May, and the nurses’\n                    psychiatric observation charts to arrive at his conclusion that the appellant\n                    was not suffering from any mental illness.[note: 100]No interviews were\n                    conducted with those who had the most recent and closest contact with the\n                    appellant, namely, Xiu, GHK, Mr Loh or even the appellant’s drinking\n                    friends. These were the people who also had frequent contact with the appellant\n                    and would have been able to provide Dr Goh with crucial information that\n                    could have shed much light on the appellant’s mental state at the time he\n                    committed the offence. We are puzzled why Dr Goh did not do this. As the\n                    Prosecution’s expert, he would have had little difficulty making\n                    arrangements to interview these persons. 68     We noted earlier that the appellant’s\n                    previous periods of employment lasted 11 years, six years and one year\n                    successively and, at the time of the offence, he had been working at\n                    M/s Loh for only about seven months.It therefore\n                        appears that within a period of less than 18 months preceding the death of\n                        the deceased, the appellant had three different employers. This\n                    pattern was particularly striking since it departed starkly from his earlier\n                    employment history. No evidence was led by the Prosecution on the reasons for\n                    these rapid job changes. What happened and why did it happen? These facts could\n                    be important but they were never looked into by Dr Goh. What was his state\n                    of mind during the months leading up to the offence? After all, he was having\n                    severe marital problems around this period of time. How did this affect his\n                    work? As occupational impairment is a symptom of major depressive disorder, the\n                    reasons that led the appellant to leave or be told to leave his two earlier jobs\n                    could be significant. Although Dr Goh was told about the appellant’s\n                    employment history, he did not regard it as material. Instead,\n                    Dr Goh’s first report noted that the appellant often worked for\n                    “many years for the same company” which,[note: 101]although true\n                    for the most part of his employment history, was certainly inaccurate for the\n                    one and a half years preceding the killing. 69     As for the interview with Pang In and Tok May,\n                    it was largely focused on their personal history of mental disorder with only\n                    cursory details about the appellant’s health being discussed.[note: 102]Dr Goh acknowledged that the appellant’s purported weight loss was an\n                    important issue since it is a symptom of depression; yet he did not ask the\n                    siblings about this issue at all.[note: 103]Further, Dr Goh did\n                    not try to find out the nature of the actual mental ailments afflicting Pang In,\n                    Tok May and the appellant’s mother. In Dr Goh’s first report,\n                    he merely stated that Pang In was being treated for depression, with no mention\n                    of the mental history of Tok May and the appellant’s mother.[note: 104]Despite\n                    reading Dr Tan’s report, Dr Goh did not seek further\n                    clarification or to obtain more details about the “strong family history\n                    of mental disorder” from either Pang In or Tok May.[note: 105]It\n                    appears to us that he did not consider the family history factor as significant\n                    enough to warrant a second look despite the possible increased risk (one point\n                    five to three times) of the appellant developing a major depressive disorder on\n                    the basis of this factor alone. 70     We have highlighted above that it appears that\n                    20% to 25% of diabetic persons may suffer from major depressive\n                        disorder.[note: 106]It is not disputed that the appellant suffered\n                    from hypertension and diabetes.[note: 107]This was noted in\n                    Dr Goh’s first report yet the correlation between diabetes and major\n                    depressive disorder did not appear to have been properly considered by\n                    Dr Goh. 71     Another worrying feature about\n                    Dr Goh’s examination of the appellant was that it was conducted in\n                    Mandarin when the appellant’s preferred language of communication was\n                        Hokkien.[note: 108]The trial judge stated (at [52] of the\n                    judgment) that the appellant must have been conversant in Mandarin since Xiu is\n                    from China and spoke to him in Mandarin. However, there is no evidence on the\n                    nature of the conversations between the appellant and Xiu or about the\n                    appellant’s level of proficiency in Mandarin. Given the difficulty in\n                    eliciting symptoms of a major depressive disorder without clear\n                        communication,[note: 109]it would have been prudent for Dr Goh to\n                    have arranged for a Hokkien interpreter to be present for the interviews,\n                    something which could have been easily done.[note: 110]We note that in the\n                    course of cross-examination, Dr Goh acknowledged the possibility of\n                    miscommunication between the appellant’s account of his mental health and\n                    Dr Goh’s comprehension of the account given the lack of a common\n                        language.[note: 111] 72     In our view, Dr Goh’s diagnostic\n                    process fell short of the requisite standard prescribed under theDSM-IV-TR. In response to our concerns about the above\n                    matters, the Prosecution submitted that while there are protocols which\n                    psychiatrists bear in mind when diagnosing patients, in some cases they\n                    nevertheless rely on their own experience in their assessments, this being one\n                    of those cases. We were not impressed by this attempt to paper over the obvious\n                    shortcomings. After all, this was the first case in which Dr Goh had\n                    testified as an expert witnesson a murder charge.\n                    It would be a stretch to suggest that Dr Goh had any meaningful prior\n                    experience to fall back on. Equally significant, the submission misses the real\n                    point. Dr Goh’s diagnostic process did not even meet his very own\n                    prescriptive methodology in examining patients on their mental capability,viz, interviewing persons regularly\n                    interacting with the appellant to determine if he had any impairment of social\n                    or occupational functioning at the material time. 73     Given the unsatisfactory nature of\n                    Dr Goh’s assessment, it would be unsafe, in our view, to rely on his\n                    opinion that the appellant was not suffering from any form of mental\n                    illness. 74     We now turn to Dr Tan’s evidence.\n                    The defence and Dr Tan cannot be faulted for the interviews taking place\n                    some ten months after the incident. It does not appear that there was any delay\n                    attributable to counsel or the appellant. The appointment processes took some\n                    time. Unlike Dr Goh, Dr Tan conducted his examination of the appellant\n                    using Hokkien as he recognised the need to establish rapport with the\n                        appellant.[note: 112]Dr Tan also noted the history of\n                    depression concerning Pang In, Tok May and the appellant’s mother,\n                    although like Dr Goh, he was unsure of the exact nature of their mental\n                    ailments. Dr Tan’s report, compared with both Dr Goh’s\n                    first and second reports, contained a much more detailed account of the\n                    appellant’s personal history. For example, he described the circumstances\n                    which led to the deterioration of his marriage and his subsequent divorce, such\n                    as the failed pregnancies, the opening of Xiu’s massage shops, her change\n                    in dressing and their lack of communication due to their long working hours.\n                    According to the appellant, he worked long hours, as much as 15 to 17 hours on\n                        weekdays.[note: 113]Dr Tan also recorded the\n                    appellant’s family members’ descriptions of his character. According\n                    to Pang In, the appellant was quite hot-tempered but he became less so after his\n                    marriage in July 2002 at the age of 40 and he was very caring towards his\n                        family.[note: 114]Dr Tan further noted Pang In’s and\n                    Sally’s observations on the appellant’s mood prior to the offence.\n                    Dr Tan’s report stated:[note: 115] Pang In has seen Pang Siew in July, August, September 2007 before the\n                        alleged offence. Pang Siew had approached him for money to pay the lawyer.Pang In said that Pang Siew looked very depressed. He\n                            looked worried. He was also not responsive when spoken to. He was always\n                            sighing. He was very negative and kept saying “die\n                            already”. He told Pang In that he has a lot of worries, that life\n                            has no meaning and he felt very frustrated. Pang In also reported that Pang Siew was haggard\n                            looking and had lost weight when he saw him from July to September 2007.\n                            Pang Siew told Pang In that he was very depressed because he could not\n                            see his son. Sally saw him in April 2007 during her daughter’s birthday. She\n                        noticed that he was sad looking and not lively. They said that Pang Siew has been drinking more as a result of his marital\n                        problems.Pang Siew drank less after he married but drank\n                            more in the later part of his marriage. They said that when Pang Siew\n                            drank, he could become agitated when someone irritated\n                        him. [emphasis added] 75     In contrast, the information elucidated from\n                    the appellant’s family members as recorded in Dr Goh’s first\n                    report merely stated that:[note: 116] Premorbid personality: His brother said he is not physically or verbally aggressive by nature and\n                        that he is very responsible in his work and well-liked by his bosses. He is\n                        very close to his son and would prepare food, bath and feed him with minimal\n                        assistance from others after he got off from work. 76     Dr Tan’s range of enquiries and\n                    diagnostic process were undoubtedly more comprehensive than Dr Goh’s.\n                    The information provided by the appellant’s family members would have\n                    enabled Dr Tan to have a better picture of the appellant’s state of\n                    mind prior to the offence. However, Dr Tan’s diagnosis also fell\n                    short of being thorough. Like Dr Goh, Dr Tan did not interview Xiu,\n                    GHK, Mr Loh or the appellant’s friends. In fairness, we should\n                    mention that it would have been difficult for him (unlike Dr Goh) to have\n                    secured the assistance of Xiu (or GHK) as he was an expert for the defence. With\n                    regards to the appellant’s employment history, Dr Tan’s report\n                    merely recorded that he had “worked for several transport\n                        companies”[note: 117]without ascertaining the reasons for his\n                    departure from those companies. Although Dr Tan noted that the appellant\n                    has diabetes and hypertension,[note: 118]he did not, like Dr Goh,\n                    appear to have assessed the correlation between these medical conditions and a\n                    major depressive disorder.[note: 119]In addition, as noted\n                    above, both Dr Tan and Dr Goh were aware of the appellant’s\n                    family history of depression but did not probe further into this. Deeper\n                    inquiries into the precise nature of their mental ailments ought to have been\n                    conducted in order to determine if they were hereditary in nature. 77     Hence, even though Dr Tan’s\n                    diagnostic process was more detailed than Dr Goh’s, it was not\n                    entirely satisfactory. More could and should have been done by both Dr Tan\n                    and Dr Goh (and counsel) to ensure that the trial judge was provided with\n                    detailed information of matters relevant to the appellant’s state of mind\n                    at the time of the offence. This is especially important given the nature of the\n                    offence and the mandatory punishment that would follow a conviction. Bearing in\n                    mind the above concerns, we shall now analyse in greater detail\n                    Dr Tan’s and Dr Goh’s psychiatric diagnosis of the\n                    appellant. Comparison between Dr Tan’s and Dr Goh’s\n                diagnosis 78     The fundamental difference between\n                    Dr Tan’s and Dr Goh’s diagnosis lies in the number of\n                    symptoms listed under Criterion A of major depressive episode that was\n                    elicited from the appellant. Under theDSM-IV-TR,\n                    at least five of the nine listed symptoms must be present before a diagnosis of\n                    major depressive episode can be made. Dr Tan elicited eight symptoms from\n                    the appellant while Dr Goh could only elicit two.[note: 120]For\n                    ease of reference, we set out a comparison table of their findings below: Requirement of Criterion ADr Tan’s assessmentDr Goh’s assessment1Depressed mood most of the\n                                            day, nearly every day.PresentPresent2Markedly diminished interest\n                                            or pleasure in all, or almost all, activities most of\n                                            the day, nearly every day.PresentAbsent3Significant weight loss when\n                                            not dieting or weight gain (eg, a change of more than 5%\n                                            of body weight in a month), or decrease or increase in\n                                            appetite nearly every day.PresentAbsent4Insomnia or hyper-somnia\n                                            nearly every day.PresentAbsent5Psychomotor agitation or\n                                            retardation nearly every day (observable by others, not\n                                            merely subjective feelings of restlessness or being\n                                            slowed down).PresentAbsent6Fatigue or loss of energy\n                                            nearly every day.PresentAbsent7Feelings of worthlessness or\n                                            excessive or inappropriate guilt nearly every\n                                            day.PresentPresent8Diminished ability to think\n                                            or concentrate, or indecisiveness, nearly every\n                                            day.AbsentAbsent9Recurrent thoughts of death\n                                            (not just fear of dying), recurrent suicidal ideation\n                                            without a specific plan, or a suicide attempt or a\n                                            specific plan for committing\n                                    suicide.PresentAbsent   79     During the appellant’s examination in\n                    chief, he affirmed various portions of his family members’ accounts to\n                    Dr Tan (as recorded in Dr Tan’s report):[note: 121] Q[Reads]\n                            “Pang Siew’s family saw him four to five times a year. Pang\n                            Siew is closest to Pang In. When Pang Siew called Pang In, he told Pang\n                            In that life has no meaning.” Is this correct? AYes. QAll\n                            right. AYes. QNow,\n                            the third paragraph: [Reads] “Pang In has seen Pang Siew in July, August, September\n                            2007 before the alleged offence. Pang Siew had approached him for money\n                            to pay the lawyer. Pang In said that Pang Siew looked very depressed. He\n                            looked worried. He was also not responsive when spoken to. He was always\n                            sighing. He was very negative and kept saying ‘die already’.\n                            He told Pang In that he has a lot of worries, that life has no meaning\n                            and he felt very frustrated.” Is this correct? AYes. QAnd then fourth\n                            paragraph: [Reads]: “Pang In also reported that Pang Siew was haggard\n                            looking and had lost weight when he saw him from July to September 2007.\n                            Pang Siew told Pang In that he was very depressed because he could not\n                            see his son.” AThat’s right. QRight. Now: ... [Reads] “Sally saw him in April 2007 during her\n                            daughter’s birthday. She noticed he was ... looking sad ... and\n                            not lively”. ... [Reads] “They said that Pang Siew has been drinking more as a\n                            result of his marital problems. Pang Siew drank less after his marriage\n                            but drank more in the later part of his marriage. They said that when\n                            Pang Siew drank, he would become agitated when someone irritated\n                            him.” AYes QRight. Is this true? AYes. 80     The appellant also affirmed his own account as\n                    recorded in Dr Tan’s report:[note: 122] Q[Reads] “He\n                            said that his wife complained that he did not talk and he would get\n                            angry for no reason.” Is this true? AYes. Q[Reads] “His wife also\n                                told him to go and see a psychiatrist at the Institute of Mental\n                                Health.” Is this true? AYes. Q[Reads] “He continued to feel depressed after\n                            his wife left the marital home and divorced him.” AYes. Q[Reads] “He feels ‘pek chek’ i.e.\n                            frustrated.” Is it true? AYes. Q[Reads] “He did not feel like working but he\n                            still went to work.” Is this true? ABecause I have to work. Q[Reads] “He was unable to sleep at night. He\n                            said his eyes would be wide open the whole night. He kept thinking of\n                            his son. He would think about why his wife had behaved in that\n                            way.” AYes. Q[Reads] “He ate less. He lost weight. He said\n                            that he used to weigh more than 200 pounds and he had a 41 inch waist.\n                            He started to lose weight from 2005.” AYes. Q[Reads] “He had no interest in doing\n                            anything. He would just sit at home if he was not\n                            working.” AYes. Q[Reads] “He had thoughts of dying but he\n                            could not commit suicide because his son is very\n                        young.” AYes. Q[Reads] “He drank 1 to 2 bottles of beer\n                            every night. He drank more on weekends ... as he did not have to work.\n                            He drank because he was depressed and he was alone at home, he kept\n                            thinking of his son and was feeling confused. He says that if he did not\n                            drink, he would have difficulty sleeping.” AYes. [emphasis added] 81     The above evidence, if unchallenged by the\n                    Prosecution, would have established, apart from Requirements (1) and (7),\n                    Requirements (3), (4), (5), (6) and (9) of Criterion A. There is an\n                    established rule of evidence that if what a witness says is not challenged, the\n                    evidence is deemed to have been admitted: the rule inBrowne\n                        v Dunn(1893) 6 R 67. The purpose of the rule is to secure\n                    procedural fairness in litigation (seeYeo Kwan Wee Kenneth v\n                        Public Prosecutor[2004] 2 SLR(R) 45 (at [3])). The\n                    rule requires that matters that are challenged be put to the witness during\n                    cross-examination to give the witness an opportunity to respond. Unchallenged\n                    testimony may be considered by the court to be undisputed by the opposing party\n                    and therefore accepted. 82     During the cross-examination of the appellant,\n                    the Prosecution, surprisingly, only briefly questioned a few aspects of the\n                    appellant’s evidence without probing his testimony and or ultimately\n                    putting its case to the appellant. With regard to the appellant’s\n                    purported weight loss, the cross-examination proceeded as follows:[note: 123] QAll right. Now, you also have said that you started\n                            losing weight in 2005, right? AThat’s right. QCan you tell the Court why you started losing weight\n                            in 2005? AIn 2005, I started to have a marital problem with my\n                            wife, I can say that my wife gave me pressure. QYes. When did you realise that you were suffering\n                            from hypertension and diabetes? AWell, ... I found out that ... I had high blood\n                            pressure when I was having my reservist. ... QYes, when was that? AIn the 1990s. QAnd then? And what about your diabetes? When did you\n                            realise you were a diabetic? AI went for medical check-up at the ... camp and the\n                            medical officer found out about it. ... QYes. Again, I’m asking you, you were going for\n                            outpatient for your hypertension as well as ... for your diabetes,\n                            isn’t it? You went to OPD, outpatient dispensary clinic where they\n                            told you [that] you were suffering from hypertension as well as\n                            diabetes, correct or not? AI cannot remember when but I went to ... Woodlands\n                            Polyclinic. QAnd would that be around 2004, 2005 as\n                        well? AWith regard to my health, I cannot\n                        remember. QAnd you were overweight at that time, correct? 200\n                            over pounds. AYes, 200 over. QAnd you were advised to lose weight,\n                        correct? AYes, the doctor advised me to ... lose\n                            weight. QAnd in fact, even your wife also advised you, told\n                            you that you should lose weight. ANo, she did not. QAnd even to Mr Loh, you told him that you had\n                            lost weight due to health reasons. Mr Loh has testified to that\n                            effect in Court. AWell, I did not lose weight. QWhat do you mean ... you did not lose weight? When\n                            did you not lose weight? AWell ... all along I still eat the usual amount of\n                            food. I did not go on diet. QAnd would I be right, as far as 2007 while you were\n                            working with Mr Loh, there was actually no difference in your\n                            weight. Your weight was about the same throughout that\n                        period. AYes. 83     Regrettably, there was no objective evidence\n                    produced by either party to show if and when the appellant had suffered from\n                    significant weight loss even though this fact could have been easily\n                    ascertained, in particular, by the Prosecution. While the appellant stated that\n                    he did not lose weight during the period of employment before the offence, this\n                    was contradicted by one of the Prosecution’s witnesses, Mr Loh. He\n                    testified after examining a photograph taken on the day of the offence that the\n                    appellant appeared to have lost weight.[note: 124]Mr Loh’s\n                    evidence on this point was not challenged by the Prosecution and the Prosecution\n                    did not dispute that the appellant used to weigh over 200 pounds. This\n                    underscores our concern that the appellant may not be the best person to provide\n                    information about his health. More crucially, the appellant’s evidence was\n                    that he started losing weight because of the pressure from his marital problems\n                    in 2005. This point was not disputed by the Prosecution. It only asked if the\n                    appellant’s weight remained constant during his period of employment with\n                    Mr Loh in 2007.[note: 125]Further, Oon Kim Lye, a friend of\n                    the appellant, stated that the appellant had lost “quite a bit of weight\n                    after he divorced his wife.”[note: 126]Dr Goh’s evidence\n                    that the absence of significant weight loss without dieting was “not\n                    elicited” from the appellant was rather remarkable. He did not ask anyone\n                    about the issue of weight loss and did not rely on any objective evidence in\n                    assessing this criterion.[note: 127]Accordingly,\n                    Requirement 3 of Criterion A must be taken to be established.\n                    Similarly, with regards to the appellant’s reported problem of insomniaie, Requirement 4 of Criterion A,\n                    the evidence that he was unable to sleep at night as he kept thinking of his son\n                    and about why his wife had “behaved in that way” was not\n                    challenged by the Prosecution during cross-examination. 84     We note that the trial judge had found (at\n                    [51] of the judgment) that the appellant’s weight loss was deliberate\n                    because of his diabetes and hypertension and that the appellant had said as much\n                    to Mr Loh. In our view, this finding is debatable considering that\n                    Mr Loh was not even aware of the actual health reason or that the appellant\n                    was diabetic.[note: 128]When asked specifically whether the\n                    appellant had told him the reason for his weight loss, Mr Loh could only\n                    state, “Er, Ithinkit’s for health\n                    reason” [emphasis added].[note: 129]Further, with regard to\n                    the finding that the appellant’s sleeping problem arose only after the\n                    incident based on his own account to Dr Goh, we have already pointed to the\n                    language barrier between the appellant and Dr Goh and the fact that he had\n                    conceded the possibility of miscommunication (see above at[71]). The appellant’s consistent evidence\n                    was that his sleeping problem arose well before the incident.[note: 130] 85     In addition, the appellant verified Pang\n                    In’s and Sally’s observations (as recorded in Dr Tan’s\n                    report) that the appellant had become very negative and was unresponsive when\n                    spoken to. He had also informed Dr Tan that he did not feel like working\n                    but had to work because he needed his job. These two nuggets of information\n                    provided the basis for Dr Tan’s finding that the appellant had\n                    psychomotor retardation and was suffering from fatigue or loss of energy\n                    (Requirements 5 and 6 of Criterion A).[note: 131]Again, the Prosecution did\n                    not properly challenge the appellant’s testimony on this point. All it\n                    asked was whether the appellant had complained to Mr Loh about his long\n                    working hours,[note: 132]and whether he had any problems\n                    coping with the demands of his work.[note: 133]Here we should pause to\n                    observe that the appellant ordinarily worked 15–17 hours a day on\n                    weekdays. He would certainly have been overstretched at work. Unfortunately,\n                    this aspect of his working conditions was not explored by counsel or by the\n                    psychiatrists. It is also worth noting that Pang In was a Prosecution’s\n                    witness and yet the Prosecution did not consider it necessary to clarify whether\n                    what he had told Dr Tan about the appellant appearing depressed and worried\n                    as well as unresponsive when spoken to were true. 86     As for Requirement 9 of Criterion A,\n                    that is to say the appellant having suicidal thoughts, the Prosecution did\n                    briefly attempt to cross-examine him on this issue.[note: 134]The\n                    appellant had insisted that he had been entertaining suicidal thoughts even\n                    before the offence and that he had told Xiu that he found life to be tough-going\n                    and that he was a failure.[note: 135]All the Prosecution\n                    tepidly put to the appellant was that he was merely embellishing his evidence\n                    because if he had had suicidal thoughts before the offence, he would have\n                    mentioned it to Dr Goh during his examination. However, we have already\n                    explained why Dr Goh’s investigative procedures were less than\n                    satisfactory. Many questions that should have been asked were not asked.\n                    Information that ought to have been obtained was not. In short, the fact that\n                    this information was not found in both of Dr Goh’s reports certainly\n                    does not mean that the appellant did not have suicidal thoughts before the\n                    incident. 87     The appellant verified that even before the\n                    incident he was feeling very negative and had repeatedly told Pang In, in\n                    anguish, “die already”. He had also told Pang In that he had a lot\n                    of worries and that life had no meaning. Although it was established during\n                    trial that Pang In had met the appellant only once within the period of six\n                    months preceding the offence,[note: 136]the\n                    Prosecution did not dispute that they often spoke to each other on the\n                        phone.[note: 137]If the Prosecution intended to contest the\n                    appellant’s testimony on this issue, it ought to have recalled Pang In to\n                    ascertain the position. This was not done. In the circumstances, we find that\n                    Dr Tan’s finding that the appellant was entertaining suicidal\n                    thoughts even prior to the incident should have been preferred by the trial\n                    judge. Accordingly, Requirement 9 of Criterion A was also\n                    satisfied. 88     Both Dr Tan and Dr Goh were of the\n                    opinion that Requirements 1 and 7 of Criterion A of a major depressive\n                    episode were displayed by the appellant. For the above reasons, we also prefer\n                    Dr Tan’s opinion that Requirements 3, 4, 5, 6 and 9 were also\n                    present. Since more than five of the listed requirements were present,\n                    Criterion A is satisfied. As for Criterion C, which requires\n                    impairment of social or occupational functioning, this point is related to\n                    Requirement 5 of Criterion A. Sally had observed that the appellant\n                    was sad-looking and was not lively when she met him at her daughter’s\n                    birthday. Also, as stated, Pang In told Dr Tan that the appellant was\n                    unresponsive when spoken to. Both accounts were not challenged by the\n                    Prosecution. According to Dr Tan, this showed that there was a change in\n                    the appellant’s behaviour and he was unable to enjoy pleasurable\n                        experiences.[note: 138] 89     In the circumstances, we find that\n                    Dr Tan’s report, which opined that the criteria for making a\n                    diagnosis of a major depressive disorder had been satisfied, was preferable to\n                    Dr Goh’s. We now turn to the non-medical evidence. The evidence (in\n                    particular, the appellant’s conduct before, during and after the offence)\n                    compels us to arrive at the same conclusion. The other factors considered 90     Zhao Jing testified that when the appellant\n                    hit the deceased’s head against the floor, he was very agitated and kept\n                    shouting “Who am I”. He refused to release his hands even when\n                    asked to do so by Zhao Jing (see above at[15]–[16]). In his\n                    statement recorded by Sgt Chng, the appellant stated that when he was\n                    strangling the deceased, he kept on apologising to her and said that he was left\n                    with no choice but to kill her. The appellant’s violence was not in\n                    keeping with his character and temperament. Xiu had testified that even when the\n                    appellant’s temperament was bad, the appellant would only utter nasty\n                    words but would not resort to violence.[note: 139] 91     Zhao Jing had left Xiu’s flat to go to\n                    the police post soon after she called Xiu to inform her of the situation. When\n                    she returned, the main gate was padlocked and the wooden door closed even though\n                    she did not lock or close them. Upon re-entry, she saw that the appellant was\n                    still sitting on the deceased even though the deceased had stopped moving. The\n                    appellant remained in the same position when she left the flat a second time and\n                    returned with the police officers. The appellant admitted during\n                    cross-examination that he had closed the main gate on both occasions but he\n                    could not explain why he did so.[note: 140]His actions were\n                    inexplicable; twice, he closed the main gate and wooden door and then went back\n                    to sit on the deceased. He must thus have sat on the deceased for about half an\n                    hour (from the time before Xiu made the first information report at\n                        10.15pm[note: 141]to the time that the police arrived at about\n                    10.35 pm).[note: 142]There was no rational explanation for the\n                    appellant’s behaviour. 92     One of the phone calls made by the appellant\n                    after he killed the deceased was to inform Mr Loh that he could no longer\n                    work for M/s Loh. He apologised for not being able to carry out his driving\n                    assignment the next day and told him that the key to the company’s bus was\n                    at his home.[note: 143]It was curious why despite having committed\n                    such a serious offence, the appellant seemed unduly concerned by such an\n                    inconsequential matter. Rather than showing clarity of mind, as the trial judge\n                    seemed to have thought,[note: 144]we\n                    are of the view that this conduct was abnormal behaviour, unless he was a\n                    cold-blooded murderer; we, however, do not think he is one. This view is\n                    reinforced by the fact that the appellant was later observed to be laughing and\n                    crying when the police officers arrived at Xiu’s flat. Later, he began\n                    banging his head against the wall in the temporary holding area (see above at[23]) while being\n                interviewed. 93     The appellant’s physical condition as a\n                    result of the drinking binge he had just before the incident is also an\n                    important consideration. As noted above, the appellant had a BAC of 84 mg\n                    per 100ml of ethanol about three hours after the offence was committed. This is\n                    not an inconsiderable amount. Indeed, his BAC must have been much higher at the\n                    time of the offence.[note: 145]That the effect of the\n                    alcohol could have exacerbated his depression at the time of the offence was\n                    recognised by both Dr Tan and Dr Goh.[note: 146]We\n                    recognise that self-induced intoxication is not a specified cause under\n                    limb (b) of the defence of diminished responsibility: seeTengku Jonaris Badlishah v Public Prosecutor[1999]\n                    1 SLR(R) 800 (at [62]);Zailani bin Ahmad v Public\n                        Prosecutor[2005] 1 SLR(R) 356 (at [59]–[61]).\n                    However, what we are concerned with is the correlation between alcohol\n                    dependence and major depressive disorder as provided by theDSM-IV-TR(see above at[44]). It is true that the appellant said in cross-examination that\n                    he was a good drinker and that his drinking habit had never previously affected\n                    his daily functions.[note: 147]However, we have to also consider the not\n                    unlikely possibility of a depressed patient downplaying his own symptoms.\n                    Dr Tan’s report recorded that Pang In and Sally observed that the\n                    appellant had been drinking more as a result of his marital problems[note: 148]and that the\n                    appellant drank “1 to 2 bottles of beer every night” because he\n                    was depressed at being alone at home. He kept thinking of his son and had\n                    difficulty sleeping if he did not drink.[note: 149]This clearly revealed a serious\n                    drinking problem associated with a depressive state of mind. 94     Dr Goh’s evidence on this issue in\n                    cross-examination is also revealing:[note: 150] QSimilarly, in\n                            third paragraph, you said: (Reads) “He described having depressive symptoms such as\n                            lethargy, guilt and poor sleep, but...these symptoms surfaced after his\n                            stepdaughter’s death.” Correct? AThat’s the account he gave me. Q(Indistinct) But supposing these symptoms were there\n                            before the incident, it would have changed your opinion,\n                        correct? AYes. QAnd that this happened after the\n                                stepdaughter’s death, this was at---indeed given to you by the\n                                accused in Mandarin during his interview,\n                        correct? ACorrect,\n                        yah. QYes. And since his Mandarin is\n                                not that good and your Hokkien is not that good, there could be a\n                                possibility of miscommunications, correct? AYes. And:[note: 151] QNow, you have also heard evidence that while he was\n                            strangling the stepdaughter, he was apologising to her, right, and\n                            subsequently, he started laughing, the police came. Would you say these\n                            are abnormal ... behaviour? AIt would be abnormal\n                                behaviour. QWhat do you think led to his abnormal\n                            behaviour? AIt’s very difficult for me to comment on what\n                            was going through his mind at that time. [emphasis added] 95     Despite acknowledging that the appellantwas behaving abnormally at the time of the\n                        killing, Dr Goh surprisingly maintained that the appellant\n                    suffered from no mental illness. When asked for an explanation for his abnormal\n                    behaviour, Dr Goh was unable to provide a convincing answer. While\n                    Dr Goh had quite correctly observed in his first report that: the effect of [the appellant’s] recent ingestion\n                            of alcohol and the heightened emotions during altercations with his wife\n                            and the victim that night, in a background of severe and longstanding\n                            marital and family problems, had contributed to his actions leading to\n                            the offence[emphasis added] (see above at[52]), he did not go\n                    on to properly analyse how the unhappy confluence of all these psycho-social\n                    pressures insidiously conspired to cause the appellant’s dysfunctional\n                    conduct that night. 96     Dr Goh was plainly aware of the\n                    appellant’s “severe and longstanding” marital\n                        problems,[note: 152]as well as other factors such as his family\n                    history of mental disorder and his diabetes and hypertension.[note: 153]He knew that\n                    the appellant had consumed a lot of alcohol and had a heated altercation with\n                    Xiu for not allowing him access to GHK just before the incident.[note: 154]He was\n                    even willing to accept that the appellant was behaving abnormally at the\n                    material time. The appellant’s bizarre mood swings during the incident,\n                    banging the deceased’s head intermittently on the floor, strangling her in\n                    the presence of a witness,[note: 155]laughing and crying simultaneously,\n                    apologising to the deceased while strangling her,[note: 156]banging\n                    his head against a wall had all been observed by Zhao Jing, Sgt Chng and\n                    SSgt Lee or documented.[note: 157]The phone calls to inform\n                    Mr Loh about his inability to work the next day[note: 158]and to inform\n                    Pang In that he was going to commit suicide by jumping from Xiu’s flat and\n                    requesting Pang In to “cremate [him] and throw the ashes to the\n                        sea”[note: 159]further illustrated the abnormality of his\n                    mental state. We noted above (at [91]) that the appellant spent a long time\n                    kneeling next to or sitting on the deceased even after she had lost\n                    consciousness. When the paramedics arrived, they found the appellant still\n                    kneeling on the deceased.[note: 160]In addition, a photograph of\n                    the appellant taken some hours after the incident showed both his knees to be\n                    visibly red and sore.[note: 161]This is not an unimportant fact. Why did he\n                    spend such an inordinate amount of time kneeling on or next to the deceased even\n                    after she died? 97     Dr Goh had been informed by the appellant\n                    that his emotions were “very chaotic during [the] struggle”. There\n                    was plainly objective evidence to support this assertion.[note: 162]Yet,\n                    Dr Goh adamantly maintained that the appellant had no mental illness at the\n                    material time. Given the unsatisfactory nature of his limited enquiries, his\n                    less than rigorous interviews with the appellant, his lack of experience in\n                    diagnosing persons charged with committing a capital crime and his failure to\n                    adequately analyse and holistically explain several aspects of the\n                    appellant’s conduct that fateful night, we find Dr Goh’s\n                    diagnosis of the appellant’s mental condition at the material time less\n                    convincing than that of Dr Tan’s. 98     Before we conclude our analysis, we ought to\n                    address a further finding of the trial judge that led him to convict the\n                    appellant of murder. He found that the several superficial incision and puncture\n                    wounds on the deceased’s neck, limb and abdomen must have been inflicted\n                    by the appellant.[note: 163]The appellant had no recollection of\n                    this event and was adamant during trial that he did not touch the knife found at\n                    Xiu’s flat.[note: 164]His fingerprints were not found on the\n                    knife or its handle. The trial judge found that it was not material whetherthe appellant inflicted them before or after the death of\n                        the deceased. In our view, this is a material fact. According to\n                    the pathologist, the superficiality of the wounds suggested that they were not\n                    inflicted during a struggle.The blade had been applied very\n                        lightly to the skin in a controlled manner.[note: 165]If this were not so, the incisions would\n                    have been deeper or less uniform.[note: 166]We note that counsel for\n                    the appellant, quite rightly, has not suggested that these wounds were\n                    self-inflicted. More importantly, there does not appear to have been serious\n                    blood loss as a consequence of those wounds. We therefore find that they were\n                    likely to have been inflicted after the deceased had died or lost consciousness.\n                    This further reinforces our view that the appellant was behaving abnormally at\n                    the time of the offence.",
        "Conclusion": "99     For all the above reasons, we find that on a\n                    balance of probabilities, the appellant has made out the defence of diminished\n                    responsibility. In the result, we set aside the conviction on the charge of\n                    murder and convict him on a charge of culpable homicide not amounting to murder\n                    punishable under s 304(a) of the Penal Code and remit this case to the\n                    trial judge for sentencing.  [note: 1]ROP, vol 2 at p\n                        122. [note: 2]Prosecution’s submission Annex A at\n                        [3]. [note: 3]ROP, vol 2A at\n                                p 319. [note: 4]Prosecution’s Submission Annex A at\n                        [6]. [note: 5]Prosecution’s Submission Annex A at [6]; ROP,\n                                vol 2 at p 315. [note: 6]ROP, vol 2 at\n                                p 180. [note: 7]Prosecution’s submission Annex A at\n                        [7]. [note: 8]ROP, vol 1, day 1 at p\n                        28. [note: 9]ROP, vol 2 at p 211; Xiu’s\n                                conditioned statement at [10]. [note: 10]ROP, vol 2 at p 212 at [13]. [note: 11]ROP, vol 2 at p 315. [note: 12]See [14] of PW3’s conditional\n                        Statement. [note: 13]ROP, vol 2 at p\n                        316. [note: 14]ROP, vol 2 at p 212 at\n                            [15]. [note: 15]ROP, vol 2 at p 213 at\n                            [16]. [note: 16]ROP, vol 1,\n                                day 1 at p 21. [note: 17]ROP, vol 1, day 1 at p\n                            22. [note: 18]See Statement of Claim in\n                                D2216/2007/F. [note: 19]See Statement of Particulars in\n                                D2216/2007/F. [note: 20]Prosecution’s Submission Annex A at\n                        [13]. [note: 21]Prosecution’s submission Annex A at\n                        [13]. [note: 22]Prosecution’s Submission Annex A at\n                        [14]. [note: 23]ROP, vol 1, day 4 at p\n                            3. [note: 24]ROP, vol 1, day 1 at p\n                21. [note: 25]ROP, vol 1, day 4 at p\n                            27. [note: 26]ROP, vol 1, day 4 at p\n                            5. [note: 27]ROP, vol 1,\n                                day 4 at p 5. [note: 28]ROP, vol 1,\n                                day 4 at p 6. [note: 29]ROP, vol 1, day 4 at p 6; see too\n                                Prosecution’s submission at [23]. [note: 30]ROP, vol 1,\n                                day 4 at p 32. [note: 31]ROP, vol 1, day 4 at pp\n                            7-8. [note: 32]ROP, vol 1,\n                                day 4 at p 7. [note: 33]ROP, vol 1, day 4 at p\n                            33. [note: 34]ROP, vol 2 p 218 at [3]. [note: 35]ROP, vol 2\n                                p 218 at [4]. [note: 36]ROP, vol 2 p 219 at\n                        [6]. [note: 37]ROP, vol 1, Day 4, p 9 lines 4-32 of\n                                appellant’s EIC. [note: 38]ROP, vol 2 p 219 at [7]; ROP vol 1 day\n                                1 at p 38. [note: 39]ROP, vol 2 p 220 at [9]. [note: 40]ROP, vol 1, day 1 at p 39. [note: 41]ROP, vol 1,\n                                day 1 at p 41. [note: 42]ROP, vol 2 p 221 at\n                            [11]. [note: 43]ROP, vol 2 at p 221 at\n                            [12]. [note: 44]ROP, vol 2\n                                at p 221 at [12]. [note: 45]ROP, vol 1,\n                                day 4 at p 50. [note: 46]ROP, vol 2\n                                pp 122, 223 at [3]. [note: 47]ROP, vol 1, day 1 at p\n                20. [note: 48]ROP, vol 3\n                                at p 233. [note: 49]ROP, vol 2 pp 233, 234 at [4] of SSgt\n                                Lee’s conditioned\n                statement. [note: 50]ROP, vol 2\n                                at p 149. [note: 51]ROP, vol 2 at p 235 (Sgt Chng); p 238 (ASP Tan Yi Chun); p\n                                243 (Senior Station Inspector Ravindra s/o\n                            Subramaniam). [note: 52]ROP, vol 1, day 2 at p\n                            49. [note: 53]ROP, vol 1, day 2 at p\n                            243. [note: 54]ROP, vol 2 at p\n                        119. [note: 55]ROP, vol 2 at p\n                        94. [note: 56]ROP, vol 2 at pp\n                        84-90. [note: 57]ROP, vol 1, day 2 at p\n                            18. [note: 58]ROP, vol 1, day 2 at pp 7-9. [note: 59]ROP, vol 1,\n                                day 2 at p 10. [note: 60]ROP, vol 1, day 2 at p\n                            23. [note: 61]Prosecution’s submission at\n                            [53]. [note: 62]Prosecution’s submission at\n                            [56]-[57]. [note: 63]Prosecution’s submission at\n                                    [95]. [note: 64]Prosecution’s submission at para\n                            [30]-[38]. [note: 65]See the judgment at [42]; Prosecution’s\n                                submission at [37]. [note: 66]ROP, vol 2\n                                at p 218. [note: 67]ROP, vol 2 at p\n                        149. [note: 68]Prosecution’s submission at\n                    [25]. [note: 69]ROP, vol 2 at p 149. [note: 70]http://www.psych.org/MainMenu/Research/DSMIV.aspx, accessed\n                                on 8 November 2010 [note: 71]ROP, vol 2 at p\n                        337. [note: 72]ROP, vol 2\n                                at p 337. [note: 73]ROP, vol 2 at p\n                        330. [note: 74]ROP, vol 2 at pp\n                            330-331. [note: 75]ROP, vol 2 at p\n                        325. [note: 76]http://www.hpp.moh.gov.sg/HPP/MungoBlobs/217/148/2004%20Depression_0.pdf,\n                                accessed on 8 November 2010 [note: 77]ROP, vol 2\n                                at p 326. [note: 78]ROP, vol 2\n                                at p 326. [note: 79]ROP, vol 2 at p\n                        326. [note: 80]ROP, vol 1, day 6 at p\n                            2. [note: 81]ROP, vol 1, day 6 at p\n                            3. [note: 82]ROP, vol 1, day 6 at p 11. [note: 83]ROP, vol 2 at pp 314-\n                            321. [note: 84]ROP, vol 2 at\n                        314. [note: 85]ROP, vol 2 at pp 320-321. [note: 86]ROP, vol 1, day 7 at p\n                            2. [note: 87]ROP, vol 1,\n                                day 7 at p 16. [note: 88]ROP vol 1 day 7 at p\n                        17 [note: 89]ROP, vol 1,\n                                day 4 at p 19. [note: 90]ROP, vol 1, day 7 at p 17. [note: 91]ROP, vol 1,\n                                day 7 at p 18. [note: 92]ROP, vol 2A at p\n                        328. [note: 93]ROP, vol 1, day 7 at p\n                            7. [note: 94]ROP, vol 2 at pp 121-123. [note: 95]ROP, vol 2 at p\n                        123. [note: 96]ROP, vol 2\n                                at p189. [note: 97]Dr Tan: ROP, vol 1. day 6 at p 21 ; Dr\n                                Goh: ROP, vol 1, day 7 at pp 8-9. [note: 98]ROP, vol 1, day 7 at p\n                            9. [note: 99]ROP, vol 1, day 7 at p\n                    11. [note: 100]ROP, vol\n                                1, day 7 at p 3. [note: 101]ROP, vol 2 at p 122. [note: 102]ROP, vol 2A at p 328 (see above). [note: 103]ROP, vol\n                                1, day 7 at p 23. [note: 104]ROP, vol 2 at p 122. [note: 105]ROP, vol 1, day 7 at p 21. [note: 106]ROP, vol 2 at p\n                        325. [note: 107]ROP, vol\n                                1, day 4 at p 23. [note: 108]ROP, vol 1, day 7 at p\n                            17. [note: 109]ROP, vol 2 at p\n                        323. [note: 110]ROP, vol\n                                1, day 7 at p 15. [note: 111]ROP, vol 1, day 7 at p\n                            23. [note: 112]ROP, vol 1, day 6 at p\n                            11. [note: 113]ROP, vol 1, day 4 p 22 lines\n                                21-22. [note: 114]ROP, vol 2 at\n                        p315. [note: 115]ROP, vol\n                                2 at p 318. [note: 116]ROP, vol\n                                2 at p 123. [note: 117]ROP, vol 2 at p\n                        314. [note: 118]ROP, vol\n                                2 at p 314. [note: 119]ROP, vol\n                                1, day 6 at p 7. [note: 120]ROP, vol 1, day 7 at p 32. [note: 121]ROP, vol 1, day 4 at pp\n                    13-14. [note: 122]ROP, vol\n                                1, day 4 at p 20. [note: 123]ROP, vol 1, day 4 at p 23. [note: 124]ROP, vol\n                                1, day 1 at p 51. [note: 125]ROP, vol 1, day 4 at pp\n                                23-24. [note: 126]ROP, vol\n                                2 at p 311. [note: 127]ROP, vol\n                                1, day 7 at p 31. [note: 128]ROP, vol 1, day 1 at p\n                            52. [note: 129]ROP, vol\n                                1, day 1 at p 52. [note: 130]ROP, vol 1, day 5 at p\n                9. [note: 131]ROP, vol\n                                1, day 6 at p 8. [note: 132]ROP, vol 1, day 4 at pp\n                                22-23. [note: 133]ROP, vol\n                                1, day 4 at p 24. [note: 134]ROP, vol 1, day 5 at p 4. [note: 135]ROP, vol\n                                1, day 5 at p 4. [note: 136]ROP, vol\n                                1, day 2 at p 53 and day 4 at p 50. [note: 137]ROP, vol 1, day 7 at p\n                            23. [note: 138]ROP, vol 1, day 6 at p\n                            54 [note: 139]ROP, vol\n                                2 day 1 at p 21. [note: 140]ROP, vol\n                                1, day 4 at p 49. [note: 141]ROP, vol 2 at p\n                        165. [note: 142]ROP, vol 2 at p\n                        235. [note: 143]ROP, vol 2 at p\n                        122. [note: 144]See\n                                trial judge’s judgment at [46]. [note: 145]Source:\n                                http://alcoholism.about.com/cs/alerts/l/blnaa35.htm accessed on 8\n                                November 2010. [note: 146]ROP vol\n                                1 day 6 at p 10; ROP, vol 2 at p 123. [note: 147]ROP, vol 1, day 4 at p\n                            25. [note: 148]ROP, vol 2 at p 318. [note: 149]ROP, vol\n                                2 at p 317. [note: 150]ROP vol\n                                1 day 7 at p 22. [note: 151]ROP, vol 1, day 7 at p\n                            33. [note: 152]ROP, vol 2 at p\n                        123. [note: 153]ROP, vol 2 at p 122. [note: 154]ROP, vol 2 at pp 121, 122. [note: 155]ROP, vol\n                                2 at p 210 (Zhao’s conditional\n                        statement). [note: 156]ROP, vol\n                                2 at pp 149-150 (Patrol Log Sheet). [note: 157]ROP, vol\n                                2 p 243 (Ravindra s/o Subramaniam conditional\n                            statement). [note: 158]ROP, vol 2 at p 140. [note: 159]ROP, vol 1, day 4 at p\n                            50. [note: 160]ROP, vol\n                                2 at p 233. [note: 161]ROP, vol 2 at p\n                        42. [note: 162]ROP, vol 2 at p 122. [note: 163]See [45] of the\n                            judgment. [note: 164]ROP, vol 1, day 4 at p\n                            16. [note: 165]ROP, vol 1, day 2 at p 9 lines 10-31,PW 7\n                            EIC. [note: 166]ROP, vol\n                                1, day 2 at p 10."
    }
}