{
    "case_title": "Shafeeg bin Salim Talib and another\n      v\n      Fatimah bte Abud bin Talib and others",
    "ncitation": "[2010] SGCA 11",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This is an appeal against the decision of the\n                    High Court judge (“the Judge”) in Originating Summons No 1749\n                    of 2007 dismissing an application for a declaration that the estate of\n                    Obeidillah bin Salim bin Talib, deceased (“the Deceased”) was\n                    entitled to a half share in the property at 1  Farrer Road, #10-06, Tulip\n                    Garden, Singapore 268817 (the “Property”) (seeShafeeg bin Salim Talib and another (administrators of the estate of\n                        Obeidillah bin Salim bin Talib, deceased) v Fatimah bte Abud bin Talib and\n                        others[2009] 3 SLR(R) 439\n                (“GD”)).",
        "The background": "2       The Deceased died intestate on 5 May 2005,\n                    leaving a widow, two children, a sister and 10 nephews. The appellants, Shafeeg\n                    bin Salim Talib and Abdul Jalil bin Ahmad bin Talib (“the\n                    Appellants”), are the administrators of the estate of the Deceased\n                    (“the Estate”), having obtained letters of administration on\n                    22 January 2007. The respondents are Fatimah bte Abud bin Talib\n                        (“1stRespondent”), Ben Gibran and Ruth S\n                    Telyb (“2ndand 3rdRespondents”). The\n                        1stRespondent is the widow of the Deceased and the\n                        2ndand 3rdRespondents are their children. The respondents\n                    are collectively referred to as “the Respondents” in this\n                    judgment. 3       The Property was purchased by the Deceased and\n                    registered in his name and that of the 1stRespondent\n                    as joint tenants on 6 April 1998 under the provisions of the Land\n                    Titles Act (Cap 157, 1994 Rev Ed). The\n                    1stRespondent claims that her interest in the\n                    Property was a gift from the Deceased and that he told her that he wanted her to\n                    have the Property upon his death. The Appellants do not admit this allegation,\n                    but at the same time they do not wish to dispute the allegation because (as\n                    their counsel has emphasised to us) they do not want to deprive her of a half\n                    share in the Property. However, as administrators of a Muslim estate, they\n                    consider that they have an obligation to uphold Muslim law and therefore to\n                    pursue the claim for a half share in the Property which, in their view, belonged\n                    to the Estate on the death of the Deceased and fell into or reverted to the\n                    Estate and which should be distributed in accordance with Muslim law under\n                    s 112(1) of the Administration of Muslim Law Act (Cap 3, 1999 Rev\n                    Ed) (“the AMLA”). The Appellants have therefore confined their\n                    appeal to a claim for a half share in the Property (“the Half\n                    Share”). 4       Both the Deceased and the\n                        1stRespondent are Yemeni Arabs by origin and, at\n                    all material times, they were Muslims of theShafi‘ischool of Islam. The\n                        2ndand 3rdRespondents were also Muslims before their\n                    conversion to Christianity a few years before the death of the\n                Deceased. 5       On 12 May 2005, pursuant to an\n                    application of the Appellants, the Syariah Court issued an inheritance\n                    certificate (“the Inheritance Certificate”) under s 115 of\n                    the AMLA identifying 12 beneficiaries of the Estate. The\n                        1stRespondent was declared as having 10/40 shares in the Estate. The\n                        2ndand 3rdRespondents, not being Muslims at the date of\n                    death of the Deceased, were not entitled to any share in the\n                Estate. 6       On 5 July 2005, the\n                        1stRespondent\n                    filed a Notice of Death of the Deceased at the Singapore Land Registry and\n                    became registered as the sole proprietor of the Property. On 26 September\n                    2005, the 1stRespondent transferred the Property to herself and the\n                        2ndand 3rdRespondents as joint tenants by way of gift. 7       On 22 March 2007, the Appellants’\n                    solicitors wrote to the Majlis Ugama Islam Singapura (MUIS) to seek afatwathat the gift of the Deceased’s share of the\n                    Property made by the 1stRespondent is contrary tofaraid(Muslim inheritance law). The letter further\n                    stated: Our clients understand that though there is a right of survivorship to the\n                        surviving joint owner under civil law, under the Administration of Muslim\n                        Law Act, the intestate deceased’s half share in the property upon his\n                        death devolves onto his beneficiaries under the Inheritance Certificate to\n                        be dealt with under Muslim law. His widow does not take the said property of\n                        the deceased as a surviving joint owner under Faraid and to make a gift of\n                        this share. 8       In response to this letter, MUIS issued afatwaon 17 July 2007 (“the 2007Fatwa”) as follows: The Fatwa Committee is of the opinion that the estate is considered as a\n                        matrimonial property (harta sepencarian) as\n                        the deceased and his wife had jointly own [sic] it. Therefore half of the estate is considered as inheritance and should be\n                        distributed in accordance to Islamic Inheritance Law (faraidh). 9       On 17 August 2007, the Appellants’\n                    solicitors wrote to the 1stRespondent to demand\n                    that she restore the Half Share to the Estate. The\n                        1stRespondent refused, claiming that she became\n                    the sole owner of the Property upon the Deceased’s death under the right\n                    of survivorship. Consequently, the Appellants commenced the present action for a\n                    declaration that the Estate was entitled to the Half Share under Muslim law,\n                    relying on the 2007Fatwa. The Respondents\n                    contested the Appellants’ application and challenged the validity of the\n                    2007Fatwa.",
        "The decision below": "10     The Appellants’ application was\n                    dismissed by the Judge who held as follows: (a)     section 112(1) of the AMLA was\n                        concerned with thedistributionof the estate\n                        of a Muslim person according to Muslim law, and not with the determination\n                        of the assets that constitute the estate; (b)     the determination was to be made under civil\n                        law,ie, the common law, and not under Muslim\n                        law; (c)     since\n                        there was no specific legislation which prevented the operation of the right\n                        of survivorship in a joint tenancy of land held by Muslims, the Half Share\n                        passed to the 1stRespondent as the\n                        surviving joint tenant under the right of survivorship at common law and,\n                        therefore, it did not form part of the Estate; and (d)     the Deceased was not a Malay person\n                        and therefore the expression “Malay” as defined in\n                        s 112(3) of the AMLA (a point which the Appellants have not asserted),\n                        did not apply to him. 11     In relation to the Appellants’ case\n                    based on the 2007Fatwa, the Judge held that since\n                    the 2007Fatwawas requested by the Appellants\n                    under s 32(1) of the AMLA, and not by the court under s 32(7), he was\n                    not bound by the 2007Fatwa, following the\n                    decision inSaniah bte Ali and others v Abdullah bin\n                        Ali[1990] 1 SLR(R) 555 (“Saniah”) (see[30]below). The Judge also declined to seek a ruling from MUIS on the ground that\n                    the issue he had to decide,ie, whether the Half\n                    Share belonged to the Estate, was not a question of Muslim law and that\n                    s 32(7) would only be applicable where a question of Muslim law fell to be\n                    determined.",
        "Issues raised on appeal": "12     The Appellants’ case on appeal is based\n                    on the following submissions: (a)     Muslim law governs the distribution\n                        of the Property as it was part of the Estate on the death of the Deceased as\n                        the common law right of survivorship is repugnant to the fundamental tenets\n                        of Muslim law. (b)     (b)Alternatively, to the extent that the Deceased purported to give to the\n                            1stRespondent the Half Share by way of joint\n                        ownership and with any accompanying right of survivorship effective upon his\n                        death, the gift is void as between two Muslims. (c)     Alternatively, the common law is modified,\n                        pursuant to s 3 of the Application of English Law Act (Cap 7A,\n                        1994 Rev Ed) (“the AELA”), such that the right of\n                        survivorship is inapplicable to the Deceased as a Muslim. (d)     The Deceased was a Malay under\n                        s 112(3) of the AMLA, under which the (civil) court has the power to\n                        make a division of the Property in such proportions as the court thinks\n                        fit. 13     The first three submissions, (a) to (c),\n                    overlap to some extent in the detailed arguments, but the underlying argument of\n                    all three is that a joint tenancy is repugnant to Muslim law in that it operates\n                    as a testamentary gift to the surviving tenant and specifically in the case of\n                    the 1stRespondent, it would enhance her unalterable\n                    share as prescribed by Muslim law. 14     The Respondents contest every one of these\n                    submissions and contend that the Judge was correct in his findings on the\n                    law.",
        "Arguments on submissions (a) to (c)": "15     The Appellants’ arguments on submissions\n                    (a) to (c) listed in[12]above are as\n                    follows: (a)     The phrase “estate and\n                        effects” in s 112(1) of the AMLA refers to all the property of a\n                        deceased Muslim which he has power to dispose of: seeAMM\n                            Murugappa Chetty v The Official Administrator as Administrator of the\n                            Estate of Yap Chok, Deceased[1932] 1 FMSLR 305 andKirby-Smith v Parnell[1903] 1 Ch\n                        483, and the definition of “net estate” in the Inheritance\n                        (Family Provision) Act (Cap 138, 1985 Rev Ed). Further, the word\n                        “effects” must mean more than simply “estate”:\n                        the holding inSaniahthat the phrase simply\n                        means “property” should not be followed. Furthermore, the\n                        construction inSaniahturned on the\n                        interpretation of the legislative intention of the Central Provident Fund\n                        Act (Cap 36, 1988 Rev Ed) (“CPF Act”) which\n                        ring-fenced funds in CPF Accounts from attachment by creditors and thereby\n                        excluded such funds from the estate of a deceased account\n                    holder. (b)     Since the\n                        Deceased was free to sever the joint tenancy of the Property at any time\n                        before his death, the Half Share was at all times part of his “estate\n                        and effects” under s 112(1) of the AMLA. (c)     The concept of joint tenancy as\n                        understood in English law is unknown in Muslim law, andFatwa20 andFatwa41 (see[66]below) posted on MUIS’s\n                        website support the case for the Appellants that on the death of a Muslim,\n                        his half share held as a joint tenant remains for distribution according tofaraid. (d)     The right of a Muslim to make giftsinter vivosdoes not assist the Respondents as the\n                        operation of the right of survivorship does not equate to a gift of the Half\n                        Shareinter vivos. Equally, the Muslim concept\n                        ofhibah ruqbadoes not assist the Respondents\n                        because it is a concept under theHanafischool of Islam which is inapplicable to the Deceased who belonged to theShafi?ischool of\n                    Islam. (e)     The\n                        operation of the right of survivorship also transgresses the\n                        well-established rule infaraidthat a Muslim\n                        may not enhance the share of any of his legal heirs: seeMohamed Ismail bin Ibrahim and another v Mohammad Taha bin\n                            Ibrahim[2004] 4 SLR(R) 756 (“Mohamed Ismail”). (f)     The registration of the Property in the name of\n                        the Deceased and that of the 1stRespondent as\n                        joint tenants was not, or did not operate as, a giftinter vivosbecause while the Deceased was alive, both of\n                        them held the entire interest in the Property. If there was a gift, it was a\n                        gift made only or which took effect only upon the Deceased’s death\n                        – just like the gift inMohamed\n                        Ismailwhich cannot be distinguished from the present case (see[49]below). (g)     Section 3(2) of the AELA provides\n                        that the common law is subject to modifications to suit the circumstances of\n                        Singapore and its inhabitants. The local culture of Muslims makes the common\n                        law of joint tenancy inapplicable to Muslims.",
        "The Respondents’ replies to the Appellants’\n                arguments": "16     The 1stRespondent’s replies are as follows: (a)     The Judge was correct in holding\n                        that whether the Property belonged to the Estate is not a question of Muslim\n                        law, but of civil law (see the decision of LP Thean J inSaniah). Further, although the phrase “estate and\n                        effects” is not defined, the Inheritance (Family Provision) Act has\n                        defined the expression “net estate” to mean “all the\n                        property of which a deceased person had power to dispose by his will\n                        (otherwise than by virtue of a special power of appointment) less the amount\n                        of his funeral, testamentary and administration expenses, debts and\n                        liabilities and estate duty payable out of his estate on his\n                        death”. (b)     (b)The title of the 1stRespondent to the\n                        Property was conclusive under s 36(2) of the Land Titles Act\n                        (Cap 157, 2004 Rev Ed) (“the LTA”) as the Registrar\n                        of Titles had issued a Subsidiary Strata Certificate of Title to the\n                        Deceased and the 1stRespondent as registered proprietors of the\n                        Property as joint tenants; by virtue of such joint tenancy, the\n                            1stRespondent owned an absolute interest in\n                        the entire property co-extensively with the Deceased. Upon the death of the\n                        Deceased, his interest was completely extinguished, leaving the\n                            1stRespondent as the absolute owner of the\n                        Property (see E H Burn & James Cartwright,Cheshire & Burn’s Modern Law of Real Property(Oxford University Press, 17th Ed, 2006) (“Cheshire & Burn”) at\n                    p 455). (c)     Even\n                        if Muslim law were to apply to joint tenancies, the Property would not fall\n                        into the Estate for the following reasons: (i)       Muslims may make giftsinter vivos. (ii)       The right of survivorship\n                            is not repugnant to Muslim law (seeMahomed Jusab\n                                Abdulla v Fatmabai Jusab AbdullaAIR (35) 1948\n                            Bombay 53 (“Mahomed Jusab\n                            Abdulla”)). Muslim law has a concept of joint tenancy\n                            similar but not exactly the same as a joint tenancy at common law (see\n                            the expert evidence on the Muslim law concept of a gift (Musha’aandhibah\n                                ruqbainShafi?ilaw) given\n                            by the Respondent’s expert witness, Ian David Edge, Lecturer in\n                            Law and Director of the Centre of Islamic and Middle Eastern Law, School\n                            of Oriental and African Studies, University of London,\n                        UK). (iii)Fatwa20 contradicts the 2007Fatwaissued in the present\n                            case. (iv)       The creation of a joint tenancy cannot be equated to the making\n                            of a will and, accordingly, the decision ofMohamed\n                                Ismailhas no application to the present\n                        case. 17     The 2ndand\n                        3rdRespondents support the arguments of the\n                        1stRespondent. Apart from also relying on the\n                    definition of “net estate” in the Inheritance (Family Provision)\n                    Act, they contend as follows: (a)     The property of a Muslim may be\n                        excluded from the estate of a Muslim by operation of statute (seeSaniahandRe Man bin Mihat,\n                            Deceased[1965] 2 MLJ 1 (“Re\n                            Man bin Mihat, Decd”) where Suffian J held that a\n                        Muslim could create a trust of the benefit of an insurance policy in favour\n                        of his wife under s 23 of the Civil Law Ordinance, 1956 (Federation of\n                        Malaya)), or by operation of the common law. (b)     Local circumstances do not require the common law\n                        on joint tenancy to be modified as, since the founding of Singapore, Muslim\n                        couples have had the choice, available to all property owners, to hold the\n                        property as joint tenants with the right of survivorship or to hold as\n                        tenants in common. 18     It can be seen from the summary of the\n                    arguments of the parties that they raise issues not only of the application of\n                    the general law (ie, the common law and\n                    legislation) to immovable property in Singapore owned by Muslims but also the\n                    extent to which Muslim law applies to determine what a deceased Muslim’s\n                    estate and effects are under s 112(1) of the AMLA. In order to understand\n                    the intricate relationship between the common law and legislation (and in\n                    particular the legislation on the ownership and transfer of registered land in\n                    Singapore) and the law of succession and testamentary gifts under Muslim law, it\n                    is necessary that we first set out our understanding of the position of Muslims\n                    in Singapore under the general law.",
        "The status of Muslim law and the Muslims in Singapore": "19     The island of Singapore was part of the\n                    territorial domain of the Johor Sultanate before 1824 when its sovereignty was\n                    ceded to the British. As a British possession, its inhabitants were subject to\n                    English principles of law. However, it was not until 1826 when the Second\n                    Charter of Justice (“the Second Charter”) introduced the entire\n                    corpus of English law (common law, equity and English statutes of general\n                    application) to Singapore so far as it was applicable to the circumstances of\n                    Singapore and its inhabitants and subject to such modifications as those\n                    circumstances might require (as the courts later held its effect to be such).\n                    The consequence of this development was that the general law was applicable to\n                    all except where the customs and personal laws of the inhabitants required that\n                    the general law be modified to suit their circumstances. For example, the common\n                    law has been modified or held inapplicable to the Chinese and Malay communities:\n                    see L A Sheridan,Malaya and Singapore The Borneo\n                        Territories(Stevens & Sons Limited, 1961) at pp\n                    371–380 and the cases cited therein, and Tan Sook Yee, Tang Hang Wu &\n                    Kelvin F K Low,Tan Sook Yee’s Principles of\n                        Singapore Land Law(LexisNexis, 3rd Ed, 2009) at\n                    paras 1.4 and 2.7. 20     Over the years, the customs and personal laws\n                    of the various communities which were once accepted as modifications of the\n                    general law have been abrogated and replaced by legislation, except for certain\n                    areas of Muslim law (mainly in marriage, divorce, custody of children,\n                    maintenance of wives and children, succession to property and distribution of\n                    Muslim estates) which have been accorded legislative recognition by and in the\n                    AMLA. The legal regime under the Second Charter now subsists under s 3 of\n                    the AELA, s 3(2) of which provides that the common law shall continue to be\n                    in force in Singapore, as provided in subsection (1), so far as it is\n                    applicable to the circumstances of Singapore and its inhabitants and subject to\n                    such modifications as those circumstances may require. Save for these matters,\n                    the general law and legislation apply to the general population, including\n                    Muslims, except where legislation specifically exempts Muslims from its\n                    operation. Examples of such legislation are the Intestate Succession Act, the\n                    Inheritance (Family Provision) Act, the Legitimacy Act and the Women’s\n                    Charter. 21     In relation to ownership of real (immovable)\n                    property and personal (movable) property, and interests in rights in such\n                    property and things, the general law applies to determine ownership, tenures and\n                    legal rights in them. As far as land is concerned, the common law applies\n                    generally subject to ownership and tenures of land recognised by, or modified\n                    by, or subject to, overriding legislation such as the LTA, the Land Titles\n                    (Strata) Act, the Registration of Deeds Act, the State Lands Act and the\n                    Residential Property Act. The subject matter of the dispute in this appeal, the\n                    Half Share (or the Property), is subject to the common law and the LTA in so far\n                    as it preserves the common law on the interests of registered proprietors in\n                    registered land. 22     However, although title to land in Singapore\n                    is determined by the common law and the applicable statutes (in the case of\n                    common law land) and the LTA (in the case of registered land, including strata\n                    land), Muslims who own land are also subject to their personal law,ie, Muslim law, in relation to their legal capacity as\n                    Muslims to deal with it by will. 23     It is common ground that, under Muslim law, a\n                    Muslim is subject to two main restrictions in dealing with property by will.\n                    First, he may not will away more than one-third of his estate. Second, he may\n                    not increase or reduce the share of any of his legal heirs determined according\n                    to Muslim law. The restrictions against testamentary dispositions under Muslim\n                    law have been stated in many Singapore and Malaysian cases such asRe Fatimah binte Mohamed bin Ali Al Tway, Deceased[1933] 1 MLJ 211 (“Re\n                    Fatimah”),Abdul Jabbar v M Mohamed\n                        Abubacker; Re The Will of M Mohamed Haniffa, Deceased[1940]\n                    MLJ 286 (which involved aHanafi, but the\n                    applicable principles are nonetheless the same in relation to bequests) andRe Estate of Siti bte Naydeen[1983–1984] SLR(R) 682. These cases were referred to inMohamed Ismailwhere MPH Rubin J said, at [7],\n                    as follows: Muslim jurisprudence imposes two principal restrictions on testamentary\n                        power. The first restriction concerns the quantum of bequests, where the\n                        rule is that a person may not dispose by will more than one-third of his\n                        property. The second limitation upon testamentary power (recognised by all\n                        four schools of the Sunni Muslims, the Shafii school being one amongst them)\n                        is that a testator may not make a bequest in favour of any of his legal\n                        heirs. In other words, a Muslim cannot by a testamentary disposition reduce\n                        or enlarge the shares of those who by law are entitled to inherit\n                        … 24     In an earlier Federated Malay States case,viz,Shaik Abdul Latif v\n                        Shaik Elias Bux[1915] 1 FMSLR 204, the appeal court held\n                    (as stated in the headnote of the report): [U]nder Mohammedan Law a testator has the power to dispose of not more\n                        than one-third of the property belonging to him at the time of death; and\n                        that the residue of such property must descend in fixed proportions to those\n                        declared by Mohammedan Law to be his heirs unless the heirs consent to a\n                        deviation from this rule. Similarly, in a later Malaysian case,viz,Re Man bin Mihat, Decd,\n                    Suffian J not only described a Muslim’s testamentary restrictions in\n                    a similar fashion, he also stated clearly the complete freedom of a Muslim to\n                    dispose of his propertyinter vivos, even at the\n                    expense of his legal heirs under Muslim law. He said (at 3): Muslim law rigidly prescribes the share of every heir and no alteration of\n                        these shares may be made by will, for a bequest to an heir requires the\n                        consent of all co-heirs and a bequest to strangers may not take effect\n                        beyond 1/3 of the testator’s estate, but there are no restrictions\n                        beyond these two limitations.So it is lawful for a\n                            Muslim to alter the prescribed shares of his heirs by disposing outright\n                            during his lifetime part or the whole of his property to a favoured\n                            wife, either directly by way of a giftinter vivosor indirectly through trustees. If there is no legal\n                        objection to a Muslim altering his heir’s share by himself during the\n                        lifetime making a gift through trustees to a favoured wife, in my judgment\n                        equally there should be no objection in principle to the validity of a\n                        similar gift made not by himself but by statute. [emphasis added] 25     It is clear from the judgment of\n                    Suffian J that there is no restriction against a Muslim giving away all his\n                    propertyinter vivosduring his lifetime to any\n                    person he wishes, and thereby depriving his legal heirs under Muslim law of any\n                    estate which they can inherit. This brings us to the critical issue in the\n                    present case, which is whether the Deceased had made aninter\n                        vivosdisposition with respect to the Property when he purchased\n                    it and had it registered in his own name and that of the\n                        1stRespondent to hold as joint\n                tenants.",
        "What law determines the “estate and effects” of a\n                Muslim under s 112(1) of the AMLA": "26     The Judge decided that this issue did not\n                    raise a question of Muslim law but one of construction of the section to be\n                    determined by the court according to the general law. Section 112 of the\n                    AMLA provides as follows: Distribution of Muslim estate to\n                            be according to Muslim law 112. —(1) In the case of any Muslim\n                        person domiciled in Singapore dying intestate, the estate and effects shall\n                        be distributed according to the Muslim law as modified, where applicable, by\n                        Malay custom. (2)    This section shall apply in cases where a person\n                            dies partly intestate as well as in cases where he dies wholly\n                            intestate. (3)    In the case of a Malay dying intestate, the court\n                            may make an order for the division of the harta sepencarian or jointly\n                            acquired property in such proportions as to the court seems\n                        fit. 27     We agree with the Judge’s view that the\n                    meaning of the phrase “estate and effects” of the Deceased is a\n                    matter of statutory construction under the general law but, in our view, this\n                    does not mean that the court does not have to take into account Muslim law. In\n                    our view, the construction of that section involves a consideration of Muslim\n                    law on the effect of any testamentary orinter\n                        vivosdisposition of property made by a deceased Muslim. Such\n                    disposition may have no effect for lack of legal capacity or be void under\n                    Muslim law and, if so, such property would fall into his estate for distribution\n                    under that section. The question as to what assets constitute the estate and\n                    effects of a deceased Muslim has first to be determined according to his\n                    personal law, where applicable to the circumstances, and not according to the\n                    common law. 28     In this respect, the Second Charter and its\n                    successor statute, the AELA, permit the common law to be modified to suit local\n                    circumstances (see[20]above), but do not\n                    permit a statute that is of general application,eg, the Penal Code, to be modified in its application to the\n                    circumstances of local inhabitants, for the rather obvious reason that otherwise\n                    the statute would have provided for such modifications as are necessary. The\n                    Judge has described a list of such statutes which are expressed to exclude\n                    Muslims in its general or specific application (in the context of Art 12 of\n                    the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint)\n                    (“the Constitution”)),viz,\n                    s 27 of the Civil Law Act (Cap 43, 1999 Rev Ed) (onbona vacantia), the Legitimacy Act (on Muslim\n                    marriages), the Intestate Succession Act (on succession under Muslim law),\n                    s 3 of the Wills Act (Cap 352, 1996 Rev Ed) (power to dispose of\n                    property by will not applicable to Muslims), the Oaths and Declarations Act\n                    (Muslims may make affirmations) and the Women’s Charter (on marriage,\n                    divorce, and ancillary matters). Absent such exceptions, legislation must\n                    prevail over personal law, such as Muslim law, as even common law prevails over\n                    personal law where the circumstances do not require the common law to be\n                    modified in favour of personal law. By way of illustration, we refer to two\n                    decisions where the courts have held that the relevant statute had the effect of\n                    overriding Muslim law which would otherwise have been applicable to the\n                    disposition in question of thepersonalproperty\n                    of a Muslim. 29     InRe Man bin Mihat,\n                        Decd, the deceased had taken out a life assurance policy for the\n                    benefit of his wife under s 23 of the Civil Law Ordinance, 1956 (Federation\n                    of Malaya) which provided that such a policy would create a trust in favour of\n                    her and that the insurance moneys payable out of such policy would not form part\n                    the estate of the insured. The legislative policy of s 23 was two-fold:\n                    first, it vested the beneficial interest in the policy in the wife immediately\n                    for her protection. Second, since it provided that the proceeds of the insurance\n                    policy would not form part of the estate of the deceased, estate duty (then)\n                    payable on those proceeds would be reduced. But, clearly, s 23 effected a\n                    disposal of the interest of the deceased before his death to take effect upon\n                    his death. Hence, upon the death of the deceased, the proceeds of the insurance\n                    policy were not part of his estate subject to the restrictions of Muslim law\n                    upon his testamentary capacity. Suffian J held that the legislative vesting\n                    had the effect of making an immediateinter vivosgift to the wife, even though she could only enjoy it upon the death of her\n                    husband. 30     InSaniah, the\n                    deceased was the holder of a CPF Account with the CPF Board. He nominated his\n                    stepsister, the plaintiff, as the sole nominee for the moneys in his CPF\n                    Account. He died intestate. The defendant obtained from the Syariah Court an\n                    inheritance certificate declaring that he, as the deceased’s lawful\n                    brother, was entitled to his entire estate. The question arose as to whether the\n                    moneys in the deceased’s CPF Account belonged to his estate or to the\n                    plaintiff. Thean J held that on the proper construction of s 23(3) read\n                    with s 24(1) of the CPF Act, a trust was created in favour of the person or\n                    persons nominated to receive the deceased member’s moneys in the CPF\n                    Account. This being the legislative scheme, it was obvious that the statutory\n                    trust had to prevail over the application of Muslim law to that fund. This was\n                    why Thean J also held that there was no conflict between the CPF Act and\n                    the AMLA, and that even if there was such a conflict, the CPF Act would\n                    prevail. 31     With respect to thefatwaissued by MUIS that the moneys in the CPF Account belonged\n                    to the estate on the death of the deceased account holder and had to be divided\n                    in accordance tofaraid, Thean J decided, at [17],\n                    correctly in our view, that: In my opinion, thefatwais merely an\n                        opinion of the Majlis and is not binding on this court which has full\n                        jurisdiction to decide on the matter in issue.What is\n                            before me is not really a point of Muslim law on which the Majlis is\n                            empowered under s 32 to issue thefatwa. Though the parties in dispute are two Muslims, and their\n                            dispute is on the moneys paid out of the Fund on the death of a member\n                            who was a Muslim domiciled in Singapore, the true issue raised before me\n                            is which of the two parties is entitled to such moneys under the CPF Act\n                            and the AML Act, and not under any Muslim law, and the issue turns on\n                            the proper and true construction of ss 23 and 24 of the CPF Act and\n                            s 112(1) of the AML Act. For the reasons I have given\n                        and on the construction I have placed on ss 23 and 24 of the CPF Act\n                        and s 112(1) of the AML Act, I cannot, with respect, accept thefatwaas correct.[emphasis added]",
        "The applicable law to determine the ownership of the Property on the\n                death of the Deceased": "32     The Property is an apartment at Tulip Garden\n                    at Farrer Road and is registered land subject to the LTA as well as the Land\n                    Titles (Strata) Act. We might point out that even if the Property was common law\n                    land, the general law would be applicable unless local conditions require that\n                    it be not applied to land owned by Muslims. However, this is not the law in\n                    Singapore. InRe Fatimah, a Singapore case\n                    concerning a purportednasr(ie, anuzriah) of two houses in\n                    Singapore, Sproule Ag CJ said at 212 that as “the gift is of\n                    immoveables in Singapore … our own system of law [and not Muslim law] isprima facieapplicable”. 33     Under the LTA, a registered proprietor is the\n                    absolute owner of the land subject to any adverse interests that are notified on\n                    the land title folio. It is not disputed that the Property was not subject to\n                    any notification at the date of death of the Deceased. When a registered\n                    proprietor dies, his interest in the land is transmitted to his personal\n                    representatives. Thus, s 107(1) of the LTA provides as follows: Transmission on death of\n                            proprietors in severalty 107. —(1) Personal representatives or\n                        any other person claiming land of a deceased proprietor may apply in the\n                        approved form to become registered as proprietors by transmission of the\n                        land, and upon proof of their representation or claim, the Registrar shall\n                        enter on the folio a memorial of registration in accordance with\n                        section 37. Similarly, s 110 provides for the transmission of registered land\n                    on the bankruptcy of the registered owner. 34     However, there is no provision in the LTA that\n                    expressly refers to transmission of land held in joint tenancy. Instead,\n                    s 114 provides as follows: Notice of death or\n                            defeasance 114. —(1) Upon the death of a joint\n                        tenant or of a life tenant of registered land, the proprietor who has become\n                        entitled to that land consequent upon that death may apply in the approved\n                        form to have the death notified in the land-register. (2)    Upon proof to his satisfaction of such a death,\n                            the Registrar shall make such entries in the land-register as may be\n                            necessary to indicate that the interest of the deceased proprietor has\n                            determined, and that the land has become vested in the survivor or other\n                            person entitled in reversion or remainder, as the case may\n                        be. (3)    Where a person has become entitled to registered\n                            land consequent upon defeasance of the interest of the proprietor of\n                            that land, and under circumstances in respect of which no express\n                            provision is made by this Act for registration of the interest of that\n                            person, he may apply for such registration in the approved\n                        form. (4)    Section 29 of the Estate Duty Act\n                            (Cap. 96) shall apply to registered land, and upon the death of a\n                            joint tenant or a life tenant of registered land, the Commissioner of\n                            Estate Duties shall not be required to register any instrument of charge\n                            claiming an interest in the land for estate duty payable. 35     In our view, there is a sound explanation for\n                    the structure of s 114 in omitting any reference to transmission of land\n                    held in joint tenancy upon the death of a joint tenant. The reason is that there\n                    is no transmission in law. And the reason why there is no transmission is that\n                    the interest of a deceased joint tenant simply disappears into thin air. Nothing\n                    “passes” or is transmitted to the surviving tenant. In the present\n                    case, the Judge referred to the following excerpt from Robert Megarry and\n                    William Wade,The Law of Real Property(Sweet and\n                    Maxwell, 7th Ed, 2008) at paras 13–002 and 13–003: “A gift of lands to two or more persons in joint tenancy is such a\n                        gift as imparts to them, with respect to all other persons than themselves,\n                        the properties of one single owner.” Although as between themselves\n                        joint tenants have separate rights, as against everyone else they are in the\n                        position of a single owner. The intimate nature of joint tenancy is shown by\n                        its two principal features, the right of survivorship and the “four\n                        unities”. 1.The right of survivorship. This is, above\n                        all others, the distinguishing feature of a joint tenancy.On the death of one joint tenant, his interest in the\n                            landpassesto the other joint tenants by the right of survivorship\n                            (jus accrescendi). This process continues until there is one\n                        survivor, who then holds the land as sole owner. A joint tenancy cannot pass\n                        under the will or intestacy of a joint tenant. In each case the right of\n                        survivorship takes precedence. It is often said therefore that each joint\n                        tenant holds nothing by himself and yet holds the whole together with the\n                        other. Whether he takes everything or nothing depends upon whether or not he\n                        is the last joint tenant to die. … [emphasis added in italics and bold italics] 36     The loose use of the word\n                    “passes” in this passage gave the Appellants the opportunity to\n                    argue that since there is a passing of property on death by reason of the right\n                    of survivorship, that right is contrary to Muslim law because it has the\n                    consequence of enlarging the share of the 1stRespondent in the Estate as a legal heir of the Deceased. The Appellants also\n                    referred to several decisions in which the courts have said that upon the death\n                    of a joint tenant, the whole propertypassesto\n                    the survivor: seeFowler v Barron[2008]\n                    2 FLR 831 at [16],Stack v Dowden[2006]\n                    1 FLR 254 at [55] andLumley v Robinson[2002] EWCA Civ 94 at [36]. On the basis of these statements, the\n                    Appellants have argued that because the whole Propertypassesto the 1stRespondent, the\n                    right of survivorship is contrary to Muslim law. 37     Based on the same reasoning, the Appellants\n                    also argued that what was apparently aninter\n                        vivosdisposition of the Property in favour of the\n                        1stRespondent was effectively a testamentary\n                    disposition and as such it was contrary to Muslim law. Reliance was placed on\n                    the decision inMohamed Ismailfor this\n                    proposition. 38     We are unable to accept any of the\n                    Appellants’ arguments on this issue for the reasons set out\n                below.",
        "The nature of the right of survivorship": "39     The first reason is that in a joint tenancy no\n                    interest in the joint propertypassesto the\n                    survivor upon the death of the other joint tenant. Although some English courts\n                    might have used the word “passes” to describe the legal effect of\n                    the right of survivorship, the word was used as a figure of speech since under\n                    English law it would make no difference how thejus\n                        accrescendiwas described. The joint tenancy is a peculiar\n                    institution of English land law which has been received as part of the law of\n                    Singapore since 1826 under the Second Charter and which the courts have not\n                    found necessary to modify to suit the circumstances of the local inhabitants.\n                    English land law was a law of general application which was entirely suitable\n                    for local conditions as no functional system of law practically existed in\n                    Singapore at the material time. 40     The true doctrine is set out in Wayne Morrison\n                    ed,William Blackstone’s Commentaries on the Laws of\n                        Englandvol II (Cavendish Publishing Limited, 2001) at\n                    para 184, where the chronicler of the common law said: From the same principle also arises the remaining grand incident of joint\n                        estates; viz. the doctrine ofsurvivorship: by\n                        which, when two or more persons are seized of a joint estate, of\n                        inheritance, for their own lives, or pur auter vie, or are jointly possessed\n                        of any chattel interest,the entire tenancy upon the\n                            decease of any of them remains to the survivors, and at length to the\n                            last survivor; and he shall be entitled to the whole estate, whatever it\n                            be, whether an inheritance or a common freehold only, or even a less\n                            estate. This is the natural and regular consequence of the union and\n                            entirely of their interest. The interest of two joint-tenants is not\n                            only equal or similar, but also is one and the same. One has\n                        not originally a distinct moiety from the other; but, if by any subsequent\n                        act (as by alienation or forfeiture of either) the interest becomes separate\n                        and distinct, the joint-tenancy instantly ceases.But,\n                            while it continues, each of two joint-tenants has a concurrent interest\n                            in the whole; and therefore, on the death of his companion, the sole\n                            interest in the whole remains to the survivor.For the interest which the survivor originally had is clearly\n                            not divested by the death of his companion; and no other person can now\n                            claim to have ajointestate with him, for no one can now have an interest in\n                            the whole, accruing by the same title, and taking effect at the same\n                            time with his own; neither can any one claim aseparateinterest in any part of tenements; for that would be to\n                            deprive the survivor of the right which he has in all, and every part.\n                            As therefore the survivor’s original interest in the whole still\n                            remains; and as no one can now be admitted, either jointly or\n                        severally, to any share with him therein; it follows, that his own interest\n                        must now be entire and several, and that he shall alone be entitled to the\n                        whole estate (whatever it be) that was created by the original grant. [emphasis in original in italics; emphasis added in bold and by\n                        underlining] 41     InCheshire and\n                        Burn, the authors state succinctly at p 455 that “if\n                    one joint tenant dies without having obtained a separate share in his lifetime,\n                    his interest is extinguished and accrues to the surviving tenants”.\n                    Similarly, Kevin Gray & Susan Francis Gray,Elements of\n                        Land Law(Oxford University Press, 5th Ed, 2008)\n                        (“Gray”) states as follows at\n                    paras 7.4.9–7.4.11: Operation of the survivorship\n                            principle 7.4.9 The right of survivorship ensures that the\n                            entitlement of each joint tenantis eliminated on his\n                                death. … … 7.4.11    Similarly, if [joint tenant] B now predeceases\n                            [joint tenant] A, the right of survivorship operates ... B disappears\n                            from the co-ownership and the entire fee simple estate in [the co-owned\n                            property] ‘survives’ to A as sole legal and equitable owner.Under the strict theory of survivorship,\n                                A’s ownership never enlarges throughout this course of events\n                                (except to the extent that A is no longer subject to the hazard of\n                                survivorship). In reality, however, theius accrescendibrings about a ‘distinct\n                            shifting of economic interest, a decided change for the survivor’s\n                            benefit’ – regardless, incidentally, of whether the ultimate\n                            survivor made much (or any) contribution towards the initial purchase of\n                            the land. [emphasis added] 42     Finally, it may be pertinent to note that the\n                    draftsman of the original Land Titles Ordinance, John Baalman, said in his\n                    commentary,The Singapore Torrens System (Being A Commentary\n                        on the Land Titles Ordinance, 1956 of the State of Singapore)(The Government of the State of Singapore, 1961) at pp 191–192, on\n                    s 93 (now s 114 of the current LTA) on joint tenancies of registered\n                    land: The consequence which ensues upon the death of a joint\n                            tenant is not strictly a transmission. That tenant’s interest is\n                            destroyed and there is nothing left of it to transmit. The\n                        surviving tenant already had a registered interest in the land, plus the\n                        expectancy of that interest being augmented by the death of his co-tenant.\n                        In entering a notification of the death, the Registrar simply records the\n                        fact that the expectancy has occurred. … The outstanding characteristic of a joint tenancy is thejus accrescendior right of survivorship.\n                        … [emphasis added] 43     It is therefore clear from these authorities\n                    that legally no interest in the Property passed to the\n                        1stRespondent upon the Deceased’s death.\n                    Whatever interest the Deceased had in the Property simply ceased to exist, and\n                    the 1stRespondent became the sole absolute owner\n                    because she would no longer be subject to the right of survivorship. As Baalman\n                    has said, s 114 has given statutory recognition to this legal effect by\n                    providing in subsection (1) that the surviving proprietor “who has\n                    become entitled to that land consequent upon that death may apply in the\n                    approved form to have the death notified in the land-register”, and\n                    subsection (2) refers to the interest of the deceased proprietor having\n                    “determined” upon death. 44     In our view, it is therefore not arguable that\n                    the legal result of the operation of the right of survivorship under s 114\n                    of the LTA can be modified to suit the circumstances of Muslims. If the right of\n                    survivorship in a joint tenancy of registered land is contrary to Muslim law,\n                    then the statute must prevail over personal law because that must have been the\n                    legislative intent. Otherwise, the LTA would have created an exception in favour\n                    of land owned by Muslims. Where legislation is enacted to deal specifically with\n                    a subject matter, there is no room for modification to suit local circumstances\n                    pursuant to the AELA in the absence of an express direction to the contrary.\n                    This is the fatal flaw in the Appellants’ case. Because rights of\n                    ownership and possession of land in Singapore are now primarily governed by\n                    legislation over a common law foundation, there is no room for modification\n                    permitted by the AELA. Any exemption of any class of people or community from\n                    the operation of these laws can only be effected expressly or by necessary\n                    implication. All general laws have the same effect. Indeed, s 3(1) of the\n                    LTA goes even further by providing that except as provided by the LTA itself all\n                    laws and regulations and all practices relating to estates and interests in land\n                    operative at 1 March 1994 are repealed if they are inconsistent with the\n                    LTA in their application to registered land. Section 112 of the AMLA is an\n                    example of a legislative modification of the general law of succession\n                    applicable to all other persons to suit the circumstances of Muslims. But it\n                    does not apply to the determination of rights and interests in land in\n                    Singapore. Hence, if a Muslim is not prohibited by his personal law from making\n                    aninter vivosdisposition of land through a joint\n                    tenancy under the common law or the LTA, that disposition will take effect as\n                    such. If there is any repugnancy, the LTA will prevail over Muslim law in this\n                    regard, just as the CPF Act and s 23 of the Civil Law Ordinance, 1956\n                    (Federation of Malaya) prevailed over Muslim law inSaniahand inRe Man bin Mihat,\n                        Decd, respectively. 45     For these reasons, we hold that the interest\n                    of the Deceased in the Property ceased to exist or was extinguished upon his\n                    death and, accordingly, his estate and effects distributable under s 112(1)\n                    of the AMLA in accordance with Muslim law did not include the Property or the\n                    Half Share upon the death of the Deceased.",
        "Arguments on other issues": "46     The above conclusion is sufficient to dispose\n                    of this appeal. However, for completeness, we should deal with the other\n                    arguments of the Appellants, including the argument that the right of\n                    survivorship in a joint tenancy of property is repugnant to Muslim law. If this\n                    is indeed so, such a conclusion is relevant to the right of survivorship in a\n                    joint tenancy of personal property which is a pure common law right and,\n                    therefore, the argument may be made that the common law should be modified to\n                    allow Muslim law to take precedence. Moneys held in joint accounts in a bank are\n                    an example of personal property where such an issue has yet to be conclusively\n                    decided by the courts.",
        "Is a gift of personal property on joint tenancy subject to Muslim\n                law?": "47     In Malaysia, any issue relating to whether a\n                    Muslim has made a validinter vivosgift orhibahis within the exclusive jurisdiction of\n                    the syariah courts, even though that issue may arise in the course of\n                    administration of a Muslim estate under the civil law: seeLatifah bte Mat Zin v Rosmawati bte Sharibun & Anor[2006]\n                    4 MLJ 705, affirmed by the Federal Court in [2007] 5 MLJ 101 (where\n                    the dispute was whether moneys in bank accounts held jointly by the deceased and\n                    the appellant (who was the deceased’s third wife) belonged to the widow or\n                    the estate of the deceased). However, in Singapore this kind of issue is within\n                    the jurisdiction of the civil courts, applying Muslim law to determine the\n                    issue, as in the present case. 48     In this connection, the Appellants have put\n                    forward an original argument that even if the Deceased were permitted by Muslim\n                    law to make aninter vivosgift of the Property by\n                    way of joint tenancy, both the Deceased and the 1stRespondent would have been holding the entire\n                    interest in the Property under the law. Hence, during his lifetime, he gave away\n                    nothing to the 1stRespondent. As the\n                        1stRespondent became the beneficial owner of the\n                    entire interest in the Property only upon the death of the Deceased, the gift of\n                    the entire interest took effect only at that point in time. Hence, it was a\n                    testamentary gift – just like the gift inMohamed\n                        Ismailwhich, it was argued, cannot be distinguished from the\n                    present case. 49     We cannot accept this argument. It ignores\n                    altogether the legal effect of the joint tenancyvis-à-visthe 1stRespondent. By holding the Property as joint\n                    tenants with the 1stRespondent, the gift from the Deceased to the\n                        1stRespondent of the entire Property was\n                    completed. The 1stRespondent obtained an immediate interest in\n                    the entire Property, entitling her to the full rights of possession and\n                    enjoyment during her lifetime. Her interest in the entire Property would\n                    extinguish only if she passes away before the Deceased. The decision inMohamed Ismailis distinguishable on a number\n                    of grounds. First, that case was not concerned with a giftinter vivosof immovable property but with a purported gift by\n                    will of a one-third share of the deceased’s estate by way ofnuzriah(ie, an expressed\n                    vow to do any act or to dedicate property for any purpose allowed by Muslim\n                    law). Part of the gift was in favour of some of his legal heirs. The will stated\n                    that thenuzriahwould come into effect\n                    “three days before [the deceased’s] death if it is due to illness,\n                    or one hour before [his] death if it is sudden”. The judge said at\n                    [64]: However, reviewing all the learning referred to and the arguments\n                        presented, I am of the view that inasmuch as the property delineated for the\n                        purposes of the so-callednuzriahwould not\n                        leave the control, possession and ownership of the testator until after his\n                        demise, the saidnuzriahis no less than a\n                        bequest or testamentary disposition to convey an intended but invalid gift\n                        to the persons named (mostly legal heirs), and it plainly transgresses the\n                        restrictions imposed by Muslim law. Accordingly, the judge held that thenuzriahwas in substance an expression of preference to give a\n                    portion of his estate to some of his children and grandchildren which was\n                    contrary to Muslim law. InMohamed Ismail, the\n                    deceased retained full control, ownership and possession of the property up to\n                    the date of his death.",
        "Is the concept of a right of survivorship repugnant to Muslim\n                law?": "50     The Appellants additionally argue that the\n                    concept of a joint tenancy at common law is repugnant to Muslim law. But the\n                    only authoritative statements they have produced are some juristic statements\n                    that the concept is unknown to Muslim law. However, the Respondents have\n                    produced other equally authoritative writings of Muslim jurists that the concept\n                    of a right of survivorship exists in Muslim law, although with a slight\n                    difference in the nature of ownership rights of the donee during his lifetime.\n                    The equivalent concept of joint ownership in Muslim law is known ashibah ruqba. Ahibahin\n                    Muslim law is described in Faiz Badruddin Tyabji,Muslim Law,\n                        The Personal Laws of Muslims in India and Pakistan(N M\n                    Tripathi Private Limited, 4th Ed, 1968) (“Tyabji”) at p 300 as follows: The legal effect ofhibais that the\n                        immediate and absolute ownership of the subject of thehibais transferred to the donee; and where the property is\n                        purported to be transferred by way ofhibawith conditions, or restrictions, as to its use, or disposal, or alienation,\n                        the conditions or restrictions may be void … 51     InTyabji, the\n                    author defined aruqbaat p 471 as\n                    follows: Aruqbameans ahiba(or gift of the absolute ownership of some specified\n                        property) with a condition that if the donee survives the donor, the subject\n                        of thehibashall belong absolutely to the\n                        donee. Abu Hanifa and Imam Muhammad, hold that a disposition may not be\n                        lawfully made by way ofruqba. Abu Yusuf and\n                        latterly Imam Shafi‘i held that such a disposition operates as ahiba, transferring the absolute estate in\n                        the subject of gift. Shafi‘i had at first expressed a different\n                        opinion; and it is stated in theMinhajthat\n                        both of Shafi‘i’s opinions have equal currency. 52     Similarly, in Nawawi,Minhaj et Talibin, A Manual of Muhammadan Law according to the School of\n                        Shafi‘i(Thacker, Spink & Co, 1914), the author\n                    described the nature of ahibah ruqba(at\n                    p 234) as follows: By saying to some one, “I want you to live in this house of mine,\n                        and that it shall pass to your heirs after your death,” one makes a\n                        gift, as also by merely saying, “I want you to inhabit it,” at\n                        least according to the doctrine adopted by Shafii in his second period, or\n                        by saying, “After your death it will return to me.” Shafii in\n                        his first period expressed an opinion different from that adopted in his\n                        second as to the validity of a gift made in the following terms, “I\n                        grant you a life interest in this house,” or “I make you a\n                        gift of it for life”; that is if you predecease me it will return to\n                        me, but otherwise it will be yours irrevocably. Nowadays, however, in our\n                        school, both of the imam’s opinions have equal currency. 53     However, the validity of ahibah ruqbain Muslim law is not universally accepted by Islamic\n                    jurists. In Asaf A A Fyzee,Outlines of Muhammadan\n                        Law(Oxford University Press, 3rd Ed, 1964)\n                        (“Fyzee”), the author stated the\n                    following proposition at p 213: The general rule is that conditional or contingent gifts are not valid.\n                        … Acontingentgift is a gift to take effect\n                        on the happening of a contingency; and a contingency is a possibility, a\n                        chance, an event which may or may not occur. … A classical example of\n                        a contingent gift isruqba. D says: ‘My\n                        mansion is thyruqba’, that is,\n                        ‘If you die, it is mine; if I die, it is yours.’ Strictly, if it\n                        is a contingent gift, depending on the donee surviving the donor, it is\n                        void. [emphasis in original] 54     These juristic statements show that although\n                    there is a conceptual difference between ahibah\n                        ruqbaand a joint tenancy at common law (in that at common law\n                    the donor retains his entire interest in the property which cannot be the\n                    subject of a valid gift by him on his death), the concept, if not the principle,\n                    of survivorship is clearly present in ahibah\n                        ruqba. 55     Nevertheless, it would appear that inFyzeeat p 218, the author was of the\n                    view that ahibah ruqbacould be created by\n                    appropriate means: Tenancy-in-common, Joint-tenancy. English\n                        law, as we have seen, has had considerable influence in modifying certain\n                        applications – if not principles – of Muhammadan law in India.\n                        As conveyances of property in larger towns are often in English, the\n                        question arises whether, by gift or otherwise, a tenancy-in-common and a\n                        joint tenancy can be created. It has been held in Bombay that where a gift is made to two persons\n                        jointly, without specifying their individual shares, the donors took as\n                        tenants-in-common; for the Court leans heavily against a joint-tenancy. But\n                        in another case, not involving a gift, the same High Court has laid down\n                        that there is nothing in Muhammadan law against the creation of a\n                        joint-tenancy, with benefit of survivorship. It would, therefore, seem that\n                        both a tenancy-in-common and a joint-tenancy can be created by appropriate\n                        means. 56     The above passage fromFyzeerefers to a Bombay case where the High Court held that\n                    Muslim law as applied in India did not prohibit the creation of a joint tenancy\n                    of immovable property by Muslims. InMahomed Jusab\n                        Abdulla, the deceased had in her lifetime jointly purchased a\n                    property with the defendant, and the conveyance stated that they were to hold\n                    the property as “joint tenants and not as tenants in common”. The\n                    plaintiff was the deceased’s brother and was one of her rightful heirs. He\n                    claimed that as her heir, he was entitled to his share in her interest in the\n                    property. Chagla J held as follows (at [3]–[8]): [3]    Mr. Boovariwala on behalf of the plaintiff\n                            has contended that joint tenancy is an estate unknown to Mahomedan law\n                            and in this particular case the nature of the transaction is a gift and\n                            this is a gift which violates the fundamental principles of Mahomedan\n                            law inasmuch as it is a contingent gift, it is a giftin futuroand it is a gift of amusha’abecause it is a gift of an undivided share\n                            in a property which is capable of division and which was in fact not\n                            divided. As I shall presently point out, in my opinion\n                            Mr. Boovariwala is not right when he contends that the real nature\n                            of the transaction is a gift. But even assuming it was a gift, would it\n                            be true to say that in Mahomedan law a gift cannot be made to joint\n                            tenants? So authoritative a text-book on Mahomedan law as\n                            Hamilton’s Hedaya expressly refers to a gift to joint tenants and\n                            expresses the opinion that a joint tenancy can be created validly under\n                            Mahomedan law:seeHamilton’s\n                            Hedaya, Vol. III 298. The way the matter is argued by Hedaya is very\n                            interesting. The illustration taken is that of a gift of a house to two\n                            men.Now, according to Haneefa, the gift is invalid\n                                because, according to him, the gift is of half the house to each of\n                                the donees and there is a danger of a mixture of property taking\n                                place. But in the opinion of two of his disciples – and that\n                                is the opinion to be preferred – the gift is valid because the\n                                gift is of the whole of the house to each of the donees.\n                            In other words, each of the donees has an interest in the whole of the\n                            house and not in any specific share in that house. I may point out that\n                            those are exactly the incidents of joint tenancy even under English law.\n                            As has been pointed out, there are four unities among tenants: of title,\n                            interest, possession and time. The right that each joint tenant has is\n                            to claim partition against his other joint tenant, and on such a\n                            partition the joint tenancy becomes severed. But if the joint tenant\n                            dies without claiming partition, his interest does not survive to the\n                            other joint tenant but his interest becomes extinguished. [4]    Apart from Hedaya, the authorities of our Court\n                            are also clear that a gift to joint tenants has been recognized as good\n                            and valid under Mahomedan law. As far back as 1870, in [Rujabai v. Ismail Ahmed7 Bom. H.C.R.\n                                27],Sir Charles Sargent, relying on this identical\n                            passage in the Hedaya to which I have referred, held that a deed of gift\n                            in English form of a house to three persons is good under the Mahomedan\n                            law as it showed a clear intention on the part of the donor to give the\n                            property in the whole house to each of the donees. Tyabji J, who is\n                            a distinguished scholar of Mahomedan law, in [Ebrahim\n                                v. Bai Asi35 Bom. L.R. 1148] has taken the same view,\n                            that a gift to two or more persons whether as joint tenants or as\n                            tenants-in-common, if completed by possession, is a valid gift; and our\n                            Court of Appeal in [Musa v. Badesaheb39 Bom. L.R. 1108] took the same view; and as pointed out by\n                            Sir John Beaumont C.J. a gift to joint tenants really gets\n                            over the difficulty created by the principle ofmusha’abecause the gift being not of a share in\n                            the article but the gift of the whole [article] to each of the donees,\n                            the principle ofmusha’adoes not\n                            come into operation. … [7]    … this is not a case of a gift at all. It\n                            is a case of contract or a grant. …What I have therefore to\n                            construe is the grant, and on the construction of the grant I have no\n                            doubt that the interest created in favour of grantees is that of joint\n                            tenants. The question, therefore, is: Is there anything in Mahomedan law\n                            which is repugnant to the creation of a grant of joint tenancy if the\n                            parties so desire it? Mr. Boovariwala contends that although the Courts\n                            in India might have held that joint tenancy can be created, there is no\n                            decision which lays down that the incident of the benefit of\n                            survivorship which attaches to the principle of joint tenancy has been\n                            held to be good and valid under Mahomedan law. Now I cannot frankly\n                            understand a joint tenancy which does not carry with it the necessary\n                            and inevitable consequence of the benefit of survivorship. The very\n                            basis of a joint tenancy … is that no joint tenant has any\n                            specific interest in the property but has an interest in the whole of\n                            the property, which if not specified by a partition, becomes\n                            extinguished on the death of the joint tenant.It is\n                                not enough for Mr. Boovariwala to say that the benefit of\n                                survivorship is unknown to Mahomedan law. He must go further and\n                                satisfy me that it is repugnant to any principle of Mahomedan law. I\n                                failed to see why it is opposed to any principle of Mahomedan law or\n                                why it is repugnant to the conception of Mahomedan law for parties\n                                to agree that they would acquire a particular property and hold it\n                                in any particular manner as joint tenants with the benefits of\n                                survivorship rather than as tenants in common with the share of each\n                                devolving upon his own heirs. … [8]    I am, therefore, of the opinion that it is\n                            permissible to persons governed by Mahomedan law to hold a property as\n                            joint tenants with the benefit of survivorship and such an interest in\n                            the property is not opposed to or repugnant to Mahomedan law. In this\n                            case, in my opinion, the interest of [the deceased] in this property was\n                            extinguished on her death in 1944 and there is no interest of hers\n                            outstanding in this property to which the plaintiff as her heir can lay\n                            a claim. [emphasis added] 57Mahomed Jusab\n                        Abdullahas recently been followed inAzizunissa Abdurrahman Kadri v Jamila Abdul Hussein Sheikh (deceased by her\n                        LRs) & Ors2007 (NOC) 2238 (Bom). There, Anoop V\n                    Mohta J rejected the plaintiff’s argument that it was not permissible\n                    under Muslim law to hold property as joint tenants with the benefit of\n                    survivorship. Such interest in the property, he held, was not opposed to or\n                    repugnant to Muslim law. 58     To put these two decisions in the context of\n                    the present case, India also has legislation that gives effect to personal law\n                    as against the general law. Under the Muslim Personal Law (Shariat) Application\n                    Act, 1937 (Act No 26 of 1937), all questions regarding intestate succession\n                    of Muslims are governed by Muslim personal laws: 2.Application of Personal Law to Muslims– Notwithstanding any customs or usage to the contrary, in all\n                        questions (save questions relating to agricultural land) regarding intestate\n                        succession … the rule of decision in cases where the parties are\n                        Muslims shall be the Muslim Personal Law (Shariat). 59     It should be noted that inMahomed Jusab Abdulla, the property was jointly purchased, and\n                    therefore neither joint tenant made any “gift” of any interest in\n                    the property to the other because each had paid for his and her share. In the\n                    present case, the Deceased paid the purchase price of the Property and made a\n                    gift of the entire property to 1stRespondent by\n                    registering her as a joint tenant with him. Nonetheless, Chagla J did not\n                    make a distinction between these two types of transactions, nor have the\n                    opinions of the authoritative Muslim jurists. 60     In the present case, the issue we have to\n                    decide concerns only real property and not personal property. We have set out\n                    the opinions of the different schools of Islam on whether ahibah ruqbaof personal property,eg, moneys in a joint account, is valid under Muslim law. This\n                    issue is not before us and we therefore express no opinion on it. 61     We now turn to the evidentiary status of afatwaissued by the Legal Committee of MUIS,\n                    whether on its own motion or at the request of any Muslim or of the\n                    court.",
        "The fatwas": "62     Section 32 of the AMLA provides for the\n                    issue and publication offatwasgiven by the Legal\n                    Committee as constituted under s 31 and also by MUIS. Section 32\n                    provides: Ruling of Legal Committee\n                            (Fatwa) 32. —(1) Any person may, by letter\n                        addressed to the Secretary, request the Majlis to issue a fatwa or ruling on\n                        any point of the Muslim law. (2)    On receiving any such request, the Secretary shall\n                            forthwith submit the same to the chairman of the Legal\n                        Committee. (3)    The Legal Committee shall consider every such\n                            request and shall, unless in its opinion the question referred is\n                            frivolous or for other good reason ought not to be answered, prepare a\n                            draft ruling thereon. (4)    If such draft ruling is unanimously approved by\n                            the Legal Committee or those members thereof present and entitled to\n                            vote, the chairman shall on behalf and in the name of the Majlis\n                            forthwith issue a ruling in accordance therewith. (5)    If in any such case the Legal Committee is not\n                            unanimous, the question shall be referred to the Majlis, which shall in\n                            like manner issue its ruling in accordance with the opinion of the\n                            majority of its members. (6)    The Majlis may at any time of its own motion make\n                            and publish any such ruling or determination. (7)    If in any court any question of the Muslim law\n                            falls for decision, and such court requests the opinion of the Majlis on\n                            the question, the question shall be referred to the Legal Committee\n                            which shall, for and on behalf and in the name of the Majlis, give its\n                            opinion thereon in accordance with the opinion of the majority of its\n                            members, and certify such opinion to the requesting court. (8)    For the purposes of subsection (7),\n                            “court” includes the Syariah Court constituted under this\n                            Act. 63     Afatwais a\n                    ruling on a religious issue in Islam given to any Muslim who asks for it. Its\n                    authority as advice or precept depends on the moral authority and standing of\n                    the religious leader giving thefatwa. But afatwaissued on an issue of law is a scholarly\n                    opinion on what the Islamic law is on that issue. Nofatwais binding on the party seeking it or to whom it is\n                    directed, unlike a ruling of a judge on an issue in a case. For this reason, afatwastands in the same position as an expert\n                    opinion on any matter before the court and may be accepted in evidence on any\n                    issue of Muslim law on the same basis as an expert opinion on the civil law. The\n                    authority of that opinion must depend on the authority and learning of the\n                    person or institution giving thefatwa.\n                    Section 32(7) of the AMLA merely provides that the Legal Committee shall\n                    give an opinion on an issue of Muslim law if requested by the court. It does not\n                    say that such an opinion is binding on the court if requested by the\n                    court. 64     In the present case, the Judge has observed\n                    that the 2007Fatwawas issued by the Legal\n                    Committee of MUIS under s 32(1) at the request of the Appellants and not\n                    under s 32(7) at the request of the court. The implication of that\n                    observation is that it may not be reliable as it would depend on what the facts\n                    are or how the question of law is put to MUIS. A similar stance was taken by\n                    Thean J inSaniahand MPH Rubin J inMohamed Ismailwhere thefatwaswere also obtained by one of the parties to the action\n                    and not by the court. 65     Afatwaobtained\n                    by a private party for the purpose of court proceedings will not ordinarily have\n                    the same standing as afatwaobtained by the court\n                    for various reasons. First, there is a likelihood that the party may frame a\n                    question based on assumed or hypothetical facts. The 2007Fatwagiven in the present case is a good example. The question\n                    (see[7]above) was misleading because it\n                    assumed the very question to be decided,ie,\n                    whether there was any half share in the Property that was still vested in the\n                    Deceased which could pass to the Estate. The 2007Fatwawas given on that assumption, and it went further to\n                    provide a question which the Appellants had not asked,ie, whether the Property washarta\n                        sepencarian. The 2007Fatwaruled\n                    that the Property “is considered as a matrimonial property as the\n                    deceased and his wife had jointly owned it”, which is irrelevant as it\n                    had not been established that the Deceased was a Malay for the purposes of\n                    s 112(3) of the AMLA. Furthermore, the 2007Fatwamight also be inconsistent with the power of the court\n                    under s 112(3) of the AMLA which provides that it is the (civil) court (and\n                    not MUIS) which is empowered to make a division of theharta\n                        sepencarianin such proportions as the court thinks\n                fit.",
        "Fatwa 20 and Fatwa 41": "66     Counsel for both parties have referred to twofatwas: Nos 20 and 41, which were posted\n                    on the website of MUIS. They were as follows: Question 20: If a person gives his/her share of the house to the spouse\n                        while still living, for example under the joint-tenancy scheme, is this\n                        position considered under faraidh? Answer: A gift that is given during our lifetime and transferred to\n                        another party is not considered as one’s asset anymore. Therefore it\n                        is not considered as property that is to be distributed in accordance with\n                        the Law of Inheritance after one’s death. 41. Does the ruling of joint-tenancy, which gives 50/50 ownership\n                        irregardless [sic] of equal contributions from both parties, apply to the\n                        tenancy in common scheme? For tenancy in common it goes back to the original agreement made and the\n                        ruling of joint tenancy does not apply to it. 67     It can be seen that what is stated inFatwa20 corresponds to the position of a\n                    joint tenancy at common law. On the other hand,Fatwa41 implies that in Muslim law, a joint tenancy connotes a\n                    50/50 ownership of the property (which, as will be seen, may not be in accord\n                    with the views of the Islamic jurists onhibah\n                        ruqba, butFatwa41 is no longer\n                    relevant as it has been replaced by anotherfatwa– see[68]below). We note, at this\n                    point, thatFatwa41 has recently been renumbered\n                    as “question No. 20” under “Finance Matters” in the\n                    “Religious Queries” section of the\n                    “Frequently-Asked-Questions” segment of the MUIS website. With\n                    respect toFatwa20 (quoted in[66]above), the Respondents have argued that it\n                    is inconsistent with the 2007Fatwawhich states\n                    that the Property isharta sepencarianand,\n                    therefore, half of it is considered as inheritance and should be distributed in\n                    accordance withfaraid. It is not necessary for us\n                    to decide this issue. As mentioned earlier, the 2007Fatwawas given in response to a question from the\n                    Appellants’ counsel that was framed on the erroneous assumption that half\n                    the Property devolved to the beneficiaries named in the Inheritance Certificate.\n                    However, what we must emphasise is that even if Muslim law does not recognise a\n                    joint tenancy, it would have no effect on the joint tenancy of the Property in\n                    the present case as the applicable law is the general law (including the\n                    relevant legislation affecting the ownership of land) (see[21]above). In any event, the application of\n                    Muslim law under s 112(1) of the AMLA requires the court to apply Muslim\n                    lawsubjectto Malay custom. Obviously, the 2007Fatwawas given on the assumption that the\n                    Deceased was a Malay as a division of theharta\n                        sepencarianis applicable only to a Malay dying intestate by\n                    virtue of s 112(3) of the AMLA. 68     In this connection, we should mention that the\n                    English translation (by an interpreter of the Supreme Court) of the latest fatwa\n                    posted on the MUIS website,\n                    <http://www.muis.gov.sg/cms/oomweb/fatwa.aspx?id=13526&terms\n                    =joint+tenancy> (accessed on 17 March 2010), reads as follows: JOINT\n                        TENANCY Question: The Fatwa (Legal) Committee is requested to give an explanation on the\n                        Fatwa pertaining toJoint Tenancy. Answer: As a result of feedback received on problems faced by Muslims\n                        who bought property by way of joint-tenancy following the death of a joint\n                        owner, and upon taking into consideration the Islamic Law pertaining to this\n                        matter, the Fatwa Committee decrees that with regard to the issue of\n                        property bought by way of joint-tenancy: (i)    If no other arrangement or agreement has been\n                                made between the joint owners of a property, upon the death of one\n                                of the joint owners, the property is not wholly owned by the\n                                surviving joint tenant. The surviving joint owner shall only be\n                                entitled to half (50%) of the value of the property. This\n                                entitlement arises from his/her position as a joint\n                            tenant. The other heirs of the estate of the deceased cannot, however, compel\n                            the surviving joint tenant to sell the property until such time as it is\n                            suitable for the surviving joint tenant to sell it. At the same time,\n                            he/she (that is, the joint-tenant) cannot delay the sale of the property\n                            without reasonable grounds as it may encroach on the rights of other\n                            beneficiaries. (ii)   If however, other arrangements or agreements\n                                have been made between the joint tenants, either through a\n                                “hibah ruqba” (ruqba-gift) or a\n                                “nuzriah” (vow) which expressly states that the\n                                property is to be given wholly to the surviving joint tenant, in the\n                                event of the death of one of the joint tenants, then the entire\n                                property shall vest on the surviving joint tenant. This is\n                                consistent with the present laws on joint tenancy in\n                                Singapore. The minute was certified on 3 April 2008 (MJF 5 2007-2010) 69     This updatedfatwasuggests that if Muslim joint owners of property fail to\n                    make any arrangement to deal with the joint property, the surviving tenant is\n                    only entitled to 50% of the property. If thisfatwais intended to apply to immovable property in Singapore,\n                    it is inconsistent with the decision of the High Court and our decision in the\n                    present case. We would emphasise that in the case of immovable property, the\n                    right of survivorship applies on the death of a joint tenant and the surviving\n                    tenant will become the sole owner of the property. The general law will prevail\n                    against Muslim law on this issue. The only way to destroy the right of\n                    survivorship is to sever the joint tenancy. We hope that MUIS will take note of\n                    our observation. 70     However, thefatwarecognises that the concept of joint tenancy is compatible\n                    with ahibah ruqbain Muslim law. This raises the\n                    question whether in the case of a joint tenancy of personal property, such as\n                    joint bank accounts, the common law on joint tenancy should be modified to suit\n                    the circumstances of Muslims. We should however mention that if a Muslim married\n                    couple were to open a joint bank account, their relationship with the bank will\n                    be governed by the contractual documents applicable to the operation of that\n                    account,ie, the general law and not Muslim law.\n                    Whether their legal relationshipinter seis\n                    governed by Muslim law so as to affect the ownership of the account on the death\n                    of one of them for the purposes of s 112 of the AMLA is a question that\n                    will have to be decided at another time in another case.",
        "The applicability of section 111 of the AMLA": "71     The Appellants further submitted that\n                    s 111(1) of the AMLA should be construed beyond its express words such that\n                    it prohibits a gift of the Property by the device of a joint tenancy. In other\n                    words, aninter vivosgift or transaction of land\n                    in favour of Muslims to hold as joint tenants should be regarded as a disposal\n                    of property by will because the right of survivorship takes effect only on the\n                    death of a joint tenant. It is as if the deceased by creating a joint tenancy\n                    has made use of the common law to “will” his interest in the\n                    property to the surviving joint tenant. This argument is wrong for three\n                    reasons: first, it is based on the (erroneous) assumption that the donee does\n                    not have a vested interest in the property unless the donor dies first. Second,\n                    s 111(1) applies only to a disposal of property by will, and not tointer vivosdispositions. Finally,\n                        s 111(2)(a) of the AMLA provides that\n                    nothing in that section shall affect the provisions of the Wills Act, other than\n                    s 3 thereof. A will executed by a Muslim therefore has to comply with the\n                    formalities prescribed by s 6 of the Wills Act which requires a will to be\n                    in writing and executed in accordance with s 6(2). Expanding the\n                    applicability of s 111(1) of the AMLA to the right of survivorship would\n                    negate the formal requirements of a will. We reject this argument.",
        "Was the Deceased a “Malay” person under s 112(3)\n                of the AMLA?": "72     The final argument of the Appellants is that\n                    the Deceased was a Malay person under s 112(3) of the AMLA which provides\n                    as follows: In the case of a Malay dying intestate, the court may make an order for\n                        the division of the harta sepencarian or jointly acquired property in such\n                        proportions as to the court seems fit. The Appellants did not advance this argument before the Judge. Perhaps\n                    they did not wish to rely on it as it might weaken their argument based on the\n                    2007Fatwa. The expression “a Malay”\n                    is not defined in the AMLA. However, the Appellants referred to Art 39A of\n                    the Constitution to submit that even though the Deceased was not an ethnic Malay\n                    person, s 112(3) of the AMLA applied on the basis that the Deceased, having\n                    been born and raised in Singapore, had arguably been assimilated into the\n                    majority Malay-Muslim community. The Appellants further relied on the 2007Fatwawhich stated that the Property was\n                    matrimonial property (harta\n                sepencarian). 73     Article 39A of the Constitution is\n                    concerned with providing minority representation in Parliament.\n                    Article 39A(4) states: In this Article – “person belonging to the Malay community” means any person,\n                        whether of the Malay race or otherwise, who considers himself to be a member\n                        of the Malay community and who is generally accepted as a member of the\n                        Malay community by that community[.] This definition of a “Malay” is repeated in\n                    s 27A(8) of the Parliamentary Elections Act (Cap 218, 2007 Rev\n                    Ed) for the purpose of giving effect to Art 39A. It may also be noted that\n                    Art 152(2) of the Constitution provides that the Government has to\n                    “recognise the special position of the Malays, who are the indigenous\n                    people of Singapore”. This Article recognises that there is a community\n                    of people who can be called Malays, whether they are of the Malay race or\n                    otherwise. In contrast, the Malaysian Federal Constitution also defines\n                    “Malay” without reference to “race” as “a\n                    person who professes the religion of Islam, habitually speaks the Malay\n                    language, conforms to Malay custom and was before Merdeka Day born in the\n                    Federation or in Singapore …”. 74     Since both Art 39A and s 27A(8) of\n                    the Parliamentary Elections Act use the expression “Malay race”, a\n                    court may have to interpret the meaning of this expression in an appropriate\n                    case arising under these two provisions. The present case arises under\n                    s 112(3) of the AMLA which uses the word “Malay” but does not\n                    define who a Malay is (see the interesting thesis of Professor Anthony Milner on\n                    who the Malays are in his book, “The Malays” (Wiley-Blackwell,\n                    2008)). It will certainly include a person who is of the Malay race, however\n                    defined, but it is not necessary for us to enter into this issue because the\n                    Appellants do not argue that the Deceased was a person of the Malayrace. He assuredly was not, as he was of Turkish-Yemeni\n                    Arab descent. The Appellants’ argument is that the Deceased was or should\n                    be treated as a “person belonging to the Malay community” as he\n                    was born in Singapore and a lifelong practising Muslim, and therefore qualified\n                    as a Malay under s 112(3) of the AMLA. 75     In our view, this argument also fails because\n                    s 112(3) of the AMLA makes reference to the concept ofharta sepencarianwhich is derived from Malayadat,ie, the law and customs of\n                    an ethnic group of people inhabiting the Malay Peninsula, the Riau Islands and\n                    parts of Sumatra and Kalimantan who call themselves Malays and who follow Malay\n                    customs (seeZainoon v Mohamed Zain[1981]\n                    2 MLJ 111 (a Singapore Syariah Court case) and the Malaysian cases ofHujah Lijah Binti Jamal v Fatimah Bin Mat Diah[1950] 1 MLJ 63 andRoberts alias Kamarulzaman v Ummi\n                        Kalthom[1966] 1 MLJ 163 at 165). Thus, a Malay for the\n                    purposes of s 112(3) must at least follow some such customs. In the present\n                    case, it is not necessary for us to investigate what customs or cultural\n                    practices qualify a person to be a Malay under s 112(3) of the AMLA because\n                    the Appellants have adduced no evidence that the Deceased considered himself a\n                    member of the Malay community and was generally accepted by that community as a\n                    Malay. In the circumstances, s 112(3) does not apply to the\n                    Deceased.",
        "Conclusion": "76     For the above reasons, we dismiss the appeal\n                    with costs and the usual consequential orders. As these are adversarial\n                    proceedings and not constructional proceedings arising in the course of the\n                    administration of an estate, the Appellants will have to pay the costs of the\n                    Respondents from their own funds and not out of the Estate."
    }
}