{
    "case_title": "Keppel Singmarine Dockyard Pte Ltd\n      v\n      Ng Chan Teng",
    "ncitation": "[2010] SGCA 10",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This appeal arose from the decision of a High\n                    Court judge (“the Judge”) in Originating Summons No 556 of\n                    2008 (seeNg Chan Teng v Keppel Singmarine Dockyard Pte\n                        Ltd[2009] 2 SLR(R) 647 (“the GD”)). The Judge\n                    had allowed an application by the plaintiff/respondent, Ng Chan Teng, made\n                    pursuant to s 54B of the Subordinate Courts Act (Cap 321,\n                    2007 Rev Ed) (“SCA”) read with s 18 and para 10 of\n                    the First Schedule of the Supreme Court of Judicature Act (Cap 322,\n                    2007 Rev Ed), to transfer his action against the appellant, Keppel\n                    Singmarine Dockyard Pte Ltd, from the District Court to the High\n                Court. 2       Section 54B of the SCA reads as\n                    follows: General power to transfer from\n                            subordinate courts to High Court 54B. —(1) Where it appears to the High Court, on the\n                        application of a party to any civil proceedings pending in a subordinate\n                        court, that the proceedings, by reason of its involving some important\n                        question of law, or being a test case, orfor any other\n                            sufficient reason, should be tried in the High Court, it may\n                        order the proceedings to be transferred to the High Court. (2)    An order under subsection (1) may be made on\n                            such terms as the court sees fit. [emphasis added] 3       At the conclusion of the hearing before us, we\n                    allowed the appeal and set aside the Judge’s order. We now give the\n                    reasons for our decision.",
        "Background": "4       The respondent, a shipwright, was a former\n                    employee of the appellant. On 13 November 2001, the respondent was involved\n                    in an industrial accident whilst working on the premises of the appellant. He\n                    sustained severe injuries to his right arm as a consequence. The respondent\n                    subsequently instituted legal proceedings in the District Court against the\n                    appellant to recover compensation for his personal injuries and for\n                    consequential losses suffered. The respondent alleged, in the proceedings, that\n                    his injuries were caused by the negligence and/or breach of statutory duty\n                    (under the Factories Act (Cap 104, 1998 Rev Ed)) on the part of the\n                    appellant. 5       Despite the fact that the respondent’s\n                    former solicitors had quantified the total damages claimed by the respondent to\n                    be in the region of $725,000, a sum which far exceeded the jurisdictional limit\n                    of the District Court (which was capped at $250,000: see s 2 of the SCA),\n                    no steps were taken by them to transfer the matter from the District Court to\n                    the High Court. Then, without ever directly addressing the issue of the District\n                    Court’s jurisdiction for the quantum being claimed, on 7 May 2004,\n                    the parties entered a consent interlocutory judgment and agreed to a 70%:30%\n                    split in liability (in favour of the respondent), with damages to be\n                    assessed. 6       On 25 May 2006, the respondent appointed\n                    his present solicitors. They immediately recognised that his claim exceeded the\n                    District Court’s jurisdictional limit. However, in the light of the Court\n                    of Appeal’s decision inRicky Charles s/o Gabriel\n                        Thanabalan v Chua Boon Yeow[2003] 1 SLR(R) 511\n                        (“Ricky Charles”), they did not\n                    apply to transfer the action to the High Court. We will elaborate on this point\n                    below at[8]. 7       Nevertheless, on 5 April 2007, the\n                    respondent brought an application before the District Court, pursuant to\n                    O 14 r 12 of the Rules of Court (Cap 322, R 5, 2006 Rev\n                    Ed), to determine whether the deduction for contributory negligence was to be\n                    made from the District Court limit or from the actual damages assessed. This\n                    issue was eventually resolved by this court on 20 February 2008: seeKeppel Singmarine Dockyard Pte Ltd v Ng Chan\n                        Teng[2008] 2 SLR(R) 839 (“Keppel\n                        Singmarine Dockyard”).",
        "The decision in Keppel Singmarine Dockyard": "8       The present application was apparently filed as\n                    a result of certain observations made by this court inKeppel\n                        Singmarine Dockyard. After determining that the deduction for\n                    contributory negligence ought to be made from the actual damages assessed and\n                    not from the District Court limit, this court went on to make known its views in\n                    relation to the decision inRicky Charles. To\n                    facilitate understanding, we now briefly recapitulate the salient points that\n                    were decided in that matter. InRicky Charles, the\n                    appellant commenced an action in the District Court against the respondent for\n                    damages for personal injuries. The parties eventually agreed to enter a consent\n                    interlocutory judgment on liability leaving damages to be assessed by the court.\n                    Subsequently, the appellant filed an application pursuant to s 38 (as it\n                    was then, and which was the predecessor to the current s 54B) of the SCA to\n                    transfer the proceedings from the District Court to the High Court, on the\n                    ground that his damages might exceed the jurisdictional limit of the District\n                    Court. The High Court dismissed the application, and its decision was affirmed\n                    by the Court of Appeal, which held at [16]: We did not think that it is within the spirit of [s 38], which\n                        requires the matter to be “one which should be\n                            tried in the High Court”, to permit a transfer of a\n                        case where interlocutory judgment had already been obtained in the District\n                        Court, leaving only the quantum to be assessed, and what was sought to be\n                        transferred to the High Court was merely the assessment of damages. This\n                        would be to truncate a single proceeding and blur the distinction between\n                        the two jurisdictions.By obtaining an interlocutory\n                            judgment in the District Court, the appellant had affirmed his claim\n                            within the jurisdiction of that court. [emphasis in original in italics; emphasis added in bold] 9       With regard to the above, this court inKeppel Singmarine Dockyardnoted (at\n                    [32]–[39]) that: 32    In our view, the specific holding inRicky Charlesthat an action commenced in the\n                            District Court may not be transferred to the High Court where\n                            interlocutory judgment has already been entered in the former court\n                            should not be followed as it proceeded on the wrong assumptions. First,\n                            the “affirmation of jurisdiction” approach taken by the\n                            Court of Appeal in that case (at [16]) plainly extends only to the limit\n                            of the claimthenbeing sought, which\n                            limit is premised purely on an existing expectationat that point in timeby the plaintiff's counsel as to\n                            the quantum potentially recoverable. The entering of an interlocutory\n                            judgment is not a legal affirmation of a lower court’s\n                            jurisdiction over the plaintiff's claim for theentire durationof the proceedings, in the course of\n                            which the plaintiff may amend his claimvis-à-vis,\n                                inter alia, the quantum claimed. … Secondly, a\n                            defendant cannot complain of being prejudiced if the law indeed permits\n                            the plaintiff to have his claim assessed to its full extent in the\n                            proper court. If a genuine mistake has been made by the plaintiff as to\n                            the quantum of his claim or if there has been a material change in\n                            circumstances after the action is commenced … surely, it is only\n                            right that a transfer of the proceedings from the District Court to the\n                            High Court be permitted in appropriate cases so that the plaintiff\n                            receives the full amount which he is legitimately entitled to. Further,\n                            we see, in principle, no difference between a transfer of proceedings\n                            before interlocutory judgment has been entered and after such judgment\n                            has been entered. … … 35    As to what constitutes “sufficient\n                            reason” for a transfer of proceedings in the context of\n                            s 54B(1) of the [SCA] (the current equivalent of s 38 of the\n                            1999 Act), we acknowledge that, in some common law jurisdictions, it has\n                            been expressly enacted that the fact that the amount to be awarded to\n                            the claimant is likely to exceed the jurisdictional limit of the\n                            inferior court would be a proper ground for a transfer.\n                        … … 38    In a similar vein, this court in Ricky Charles\n                            … opined at [15] that the possibility of the plaintiff's damages\n                            exceeding the jurisdictional limit of the District Court would\n                            ordinarily be regarded as a “sufficient reason” for a\n                            transfer of proceedings under s 38 of the 1999 Act. As this view is\n                            in line with the practice in other common law jurisdictions and is\n                            moreover consistent with what was stated in Parliament when the\n                            Subordinate Courts (Amendment) Bill 2005 was introduced … we\n                            could not agree more. 39    To conclude, we are of the view that even if a\n                            plaintiff mistakenly enters a consent interlocutory judgment in the\n                            wrong court (ie, in the District Court instead of in the High Court),\n                            there is no reason why the assessment of damages cannot thereafter be\n                            transferred to the High Courtif no real prejudice\n                                would be caused to the defendant. In our opinion, the\n                            position in respect of the transfer of proceedings ought to be\n                            symmetrical both before and after interlocutory judgment has been\n                            entered. We would further add that the “prejudice” to the\n                            defendant from a transfer of proceedings from a District Court to the\n                            High Court cannot possibly consist of the fact that the damages awarded\n                            would exceed $250,000 if the transfer were allowed.In our view, some form of irreversible change of position or\n                                deviation from a prior express agreement on damages must be shown in\n                                order to demonstrate that the transfer of proceedings would cause\n                                the defendant real prejudice that cannot be compensated by\n                                costs. [emphasis in original in italics; emphasis added in bold] 10     This Court inKeppel\n                        Singmarine Dockyardwas, therefore, of the view that the specific\n                    holding inRicky Charles, that an action commenced\n                    in the District Court may not, as a matter of principle, be transferred to the\n                    High Court where interlocutory judgment has already been entered in the former\n                    court, was incorrect. However, as there had been no application to transfer\n                    proceedings, this court’s observations were plainly madeas an aside(or to borrow a trite Latin expression,\n                        “obiter”). Relying solely on our\n                    general observations inKeppel Singmarine\n                    Dockyard, the respondent then applied to transfer the District Court\n                    action to the High Court on 24 April 2008.",
        "The decision below": "11     After considering our observations inKeppel Singmarine Dockyard, the Judge allowed\n                    the application. These were his reasons. First, employing the broad definition\n                    of “sufficient reason” endorsed inKeppel\n                        Singmarine Dockyard, the Judge accepted that the possibility that\n                    the respondent’s damages would exceed the jurisdictional limit of the\n                    District Court was alone “sufficient reason” for the transfer of\n                    the proceedings: see [23]–[24] of the GD. Second, the Judge found that the\n                    appellant would not suffer “real prejudice” if the transfer of\n                    proceedings was acceded to. As the consent interlocutory judgment had not been\n                    set aside, the appellant would not be deprived of the respondent’s\n                    admission of 30% liability. Although the appellant might have to pay a larger\n                    amount of damages, the Judge held that this could not constitute “real\n                    prejudice” as pointed out by this court in Keppel\n                        Singmarine Dockyard: see [25] of the GD.",
        "The present proceedings": "12     At the outset, we must emphasise that although\n                    the Judge (at [12] of the GD) considered that this court’s decision inKeppel Singmarine Dockyardwas a decisionon the very facts of the present case, this\n                    was not correct. Our observations on the impact ofRicky\n                        Charlesas regards the transfer of proceedings were made in a\n                    general way without the benefit of full arguments on this issue and a proper\n                    appraisal of the facts of the present case. Indeed, we should also point out\n                    that inKeppel Singmarine Dockyard, we took pains\n                    to point out (at [39]) that although proceedings could be transferred to the\n                    High Court after interlocutory judgment had been entered, this was subject to\n                    the proviso thatno real prejudicewould be caused\n                    to the defendant. However, the issue of prejudice was neither fully canvassed\n                    before, nor addressed, by this court inKeppel Singmarine\n                        Dockyard.",
        "The issues and the arguments": "13     The only two issues raised in this appeal were\n                    (a) whether there was sufficient reason for the order of transfer of\n                    proceedings to be made, and (b) whether the appellant would be prejudiced\n                    by the transfer of proceedings. 14     First, the appellant contended that the\n                    respondent had failed to provide sufficient reason for an order of transfer to\n                    be made because the fact that the quantum of damages would exceed the\n                    jurisdiction of the District Court did not in itself constitute\n                    “sufficient reason” under s 54B of the SCA. In particular,\n                    the appellant highlighted that there was no fresh medical evidence to show that\n                    the respondent’s medical condition had worsened in the course of\n                    proceedings. Second, the appellant contended that irretrievable prejudice would\n                    be caused to the appellant if the order of transfer was allowed. This was\n                    because the appellant had agreed to forgo the right to litigate the issue of\n                    liability on the understanding that the maximum amount of damages claimable\n                    would not exceed the District Court jurisdictional limit. The appellant\n                    therefore argued that as consent judgments cannot generally be set aside, to\n                    allow the transfer proceedings would be tantamount to allowing the respondent to\n                    rescind on its implicit agreement to have the damages capped at the District\n                    Court jurisdictional limit. Furthermore, even to set aside the interlocutory\n                    judgment and re-litigate the action would not be feasible in the light of the\n                    practical difficulties arising from the significant lapse of time since the date\n                    of the accident. Particular concern was expressed in relation to the\n                    availability of witnesses. Finally, the appellant contended that the respondent\n                    should be seeking recourse against his previous solicitors (in a negligence\n                    action) instead. 15     The respondent contended that the Judge had\n                    not erred in his interpretation of the term “sufficient reason”.\n                    Further, the respondent contended that to require the appellant to compensate\n                    the full extent of the respondent’s injuries (as opposed to a sum capped\n                    by the District Court’s jurisdictional limit) did not suffice as prejudice\n                    suffered by the appellant. Finally, the respondent contended that entering an\n                    interlocutory judgment in the wrong court was a procedural defect which ought to\n                    be subservient to the need for substantive justice. The law ought to allow the\n                    respondent to receive the maximum extent of compensation possibly recoverable\n                    for the injuries he sustained.",
        "Our decision": "16     We were in agreement with the Judge that the\n                    likelihood that a plaintiff’s damages would exceed the jurisdictional\n                    limit of the District Court would, ordinarily, be regarded as “sufficient\n                    reason” for the transfer of proceedings to the High Court under\n                    s 54B of the SCA. As the respondent’s claim here was likely to exceed\n                    the $250,000 mark (see [24] of the GD), we found that the respondent had given\n                    sufficient reason toprima faciesatisfy the\n                    transfer threshold. 17     That said, the mere existence or presence of a\n                    “sufficient reason” does not automatically entitle a party to have\n                    the proceedings transferred from the District Court to the High Court. A\n                    holistic evaluation of all the material circumstances needs to be undertaken in\n                    every case where a transfer application is made; in particular, the court needs\n                    to assess the prejudice that might be visited upon the party resisting such a\n                    transfer. The words “may order” in s 54B of the SCA, at[2]above, make it abundantly clear that\n                    every transfer under the subject provision is a discretionary one requiring a\n                    principled approach that requires a balancing of the respective competing\n                    interests of the parties. Here, we were of the view that the Judge failed to\n                    consider adequately the prickly issue of what prejudice might be suffered by the\n                    appellant if the proceedings were to be transferred to the High Court. The\n                    respondent had contended that, inKeppel Singmarine\n                        Dockyard, this court held (at [39]) that\n                    “prejudice” to the defendant from a transfer of proceedings from a\n                    District Court to the High Court could not possibly consist of the fact that the\n                    damages awarded would exceed $250,000 if the transfer were allowed. This was\n                    also the position relied upon by the Judge: see [25] of the GD. Nevertheless,\n                    here, in our view, the “prejudice” suffered by the appellant was\n                    not simply that the damages awarded could exceed the District Court’s\n                    jurisdictional limit. These are our reasons. 18     First, at the time the parties entered the\n                    consent interlocutory judgment, it was thought that, followingRicky Charles, by entering the interlocutory judgment in\n                    the District Court, the parties would be taken to have affirmed the jurisdiction\n                    of the District Court and would, therefore, be barred from transferring\n                    proceedings to the High Court. Thus, as persuasively contended by the appellant,\n                    it had agreed to the consent judgment on the basis that the extent of its\n                    liability would be capped at the District Court jurisdictional limit. We were\n                    satisfied on the basis of the affidavit evidence tendered in these proceedings\n                    that it was rather unlikely that the appellant would have agreed to a consent\n                    order on the same terms had they known of this potential exposure. To allow for\n                    the transfer of proceedings now would, therefore, prejudicially expose the\n                    appellant to increased damages. The Judge did not place sufficient weight on the\n                    fact that, substantively, the basis of the agreement between the parties had\n                    changed because the 70% liability was no longer limited to the jurisdictional\n                    limit of the District Court. As an aside, we should perhaps point out that it\n                    may be more difficult for a transfer to be resisted only on this ground if an\n                    interlocutory judgment on liability alone is entered after our decision inKeppel Singmarine Dockyard. 19     Second, we could not disregard the fact that\n                    the application to transfer proceedings was made almost four years after the\n                    consent interlocutory judgment had been entered. In other words, both parties\n                    had accepted and relied on the consensual agreement for a substantial period of\n                    time. It was not an insignificant consideration that the appellant’s\n                    insurers had, after the interlocutory judgment was entered, set aside only a\n                    reserve of $250,000 (the maximum sum payable based on the District Court\n                    jurisdictional limit) pursuant to regulations prescribed by the Monetary\n                    Authority of Singapore. 20     Third, even if we were to exercise our\n                    discretion to transfer the proceedings on the condition that the consent order\n                    was to be set aside, the appellant would nevertheless still be prejudiced by the\n                    transfer. Certain interlocutory processes have already been completed since the\n                    interlocutory judgment was entered. Not only (as noted above) would the\n                    appellant be deprived of an agreement which it had relied upon for a not\n                    insubstantial period of time, the parties might also then have to re-litigate\n                    their respective liabilities. We noted that this application to transfer\n                    proceedings was made six to seven years from the date the accident took place.\n                    The appellant quite rightly underscored the fact that many practical\n                    difficulties might arise if the issue of liability had also to be re-opened,\n                    including the length of time from the date of the accident, the availability of\n                    witnesses and the ensuing prejudice. To require the appellant to defend its case\n                    on liability despite the significant lapse of time since the accident occurred\n                    would be severely prejudicial to its interests.",
        "Conclusion": "21     Notwithstanding our sympathies for the plight\n                    of the respondent, we found that in the light of the prevailing circumstances\n                    (and in particular the delay), a transfer of the proceedings from the District\n                    Court to the High Court would result in “real prejudice” to the\n                    appellant. We therefore allowed the appeal with costs here and\n                below."
    }
}