{
    "case_title": "Basil Anthony Herman\n      v\n      Premier Security Co-operative Ltd and others",
    "ncitation": "[2010] SGCA 15",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This is an appeal against the decision of the\n                    trial judge (“the Judge”) in Suit No 195 of 2007 (“the\n                    Suit”). The reasons for the decision of the Judge are found inPremier Security Co-operative Ltd and others v Basil Anthony\n                        Herman[2009] SGHC 214 (“the\n                    Judgment”).",
        "Background facts": "2       The appellant, Mr Anthony Herman Basil\n                    (“Basil”), is a former police officer. He had served in the\n                    Singapore Police Force (“the SPF”) for 24 years, and had held the\n                    rank of acting station inspector at the time of his retirement from the SPF in\n                    1987. After his retirement, he took on several jobs before joining the first\n                    respondent, Premier Security Co-operative Ltd (“Premier”), a\n                    co-operative in the business of providing security services, as a security\n                    executive on 13 April 2006. The second respondent, Mr Saraj Din s/o\n                    Sher Mohamed (“Saraj”), was the managing director of Premier at\n                    the material time. He had previously served in the SPF for 36 years, and had\n                    attained the substantive rank of deputy superintendent. The third respondent,\n                    Ms Annie Leow Cher Kheng (“Leow”), was the administration and\n                    finance manager of Premier at the material time. Saraj and Leow appear to have\n                    been the key decision makers in Premier at the material time. 3       Basil’s employment as a security executive\n                    was terminated by Premier in December 2006. The true reasons for his\n                    termination, and the facts and circumstances surrounding his termination, were\n                    hotly disputed at the trial before the Judge. Suffice to say at this juncture\n                    that Basil felt deeply aggrieved by what he perceived to be an unjust\n                    dismissal. 4       Not long after his employment was terminated,\n                    Basil wrote four letters of complaint against the respondents. The letters,\n                    which were sent between 8 January 2007 and 16 February 2007, contained\n                    a number of allegations relating to,inter alia,\n                    the circumstances of Basil’s dismissal and the quality of the security\n                    services that Premier provided to its clients – in particular, SBS Transit\n                    Ltd (“SBS”), Singapore Mass Rapid Transit (“SMRT”)\n                    (the precise member of the SMRT group of companies was not identified), and\n                    Singapore Airport Terminal Services Ltd (“SATS”). The letters were\n                    sent to a number of persons, including the Minister for Manpower, the\n                    Commissioner of Police, the chairman of the Singapore Police Co-operative\n                    Society Ltd, the head of the Security Industry Regulatory Department of the SPF\n                    (“the SIRD”), and the general manager of SATS. 5       In particular, Basil’s letter to the\n                    Minister for Manpower alleged,inter alia, that he\n                    was wrongfully dismissed. As a result, Ms Adeline Kong\n                    (“Kong”), an assistant commissioner for labour at the Ministry of\n                    Manpower (“the MOM”), requested Premier to provide information\n                    relating to Basil’s employment and dismissal. Premier’s reply, which\n                    was signed by Saraj and dated 15 February 2007, set out its complaints\n                    against Basil and enclosed,inter alia, an\n                    “anonymous letter” to Premier dated 12 August\n                        2006.[note: 1]The letter, which had not\n                    been shown to Basil previously, alleged,inter\n                        alia, that Basil was racist, incompetent, and had caused trouble\n                    in each of his prior jobs in the private sector (see [62] of the Judgment, where\n                    the letter is set out in full). Saraj claimed that he had forwarded this letter\n                    to the MOM only to prove that he had been unwilling to prejudge Basil, but it is\n                    pertinent to note that the accusation of racism was repeated in the body of\n                    Premier’s reply. Kong subsequently testified during the trial that the MOM\n                    did not enquire into the circumstances pertaining to Basil’s dismissal\n                    because his contract of employment did not come within the purview of the\n                    Employment Act (Cap 91, 1996 Rev Ed). 6       On 6 March 2007, the respondents demanded,\n                    through a letter from their solicitors, that Basil cease making statements in\n                    connection to them, make an unqualified apology, and pay damages for the\n                    statements he had already made. Basil refused. The respondents then initiated an\n                    action in defamation against Basil on 28 March 2007 (ie, the Suit). In response, Basil pleaded the defences of\n                    justification, fair comment and qualified privilege, and counterclaimed for\n                    wrongful dismissal and defamation in respect of Premier’s response to the\n                    MOM, including the enclosed anonymous letter. He asserted that the allegations\n                    relating to his alleged misconduct were contrived and had never been raised\n                    while he was in Premier’s employ, and that he had been victimised by Saraj\n                    and Leow. He also claimed that he had never been reprimanded during his time\n                    with Premier, and that his dismissal had been capricious. Further, Saraj had\n                    forwarded the anonymous letter to the MOM maliciously and with reckless\n                    disregard to the truth of its contents. 7       It ought to be pointed out that Basil was\n                    initially unrepresented. He only engaged counsel after the respondents applied\n                    for,inter alia, a determination of the natural\n                    and ordinary meaning of certain statements, via Summons No 2599 of 2007.\n                    Any incongruity in the manner in which Basil’s case was initially\n                    presented could, perhaps, be attributed to this lack of legal input at the\n                    outset. Unsurprisingly, the respondents have amplified the presence of these\n                    so-called inconsistencies.",
        "Summons No 2599 of 2007": "8       Early on in the proceedings, on 15 June\n                    2007, the respondents filed Summons No 2599 of 2007 (hereafter referred to\n                    as “SUM 2599” for convenience), which was an application for,inter alia, an order that the natural and\n                    ordinary meaning of seven selected statements in three of Basil’s four\n                    letters was as pleaded in the respondents’ Statement of Claim pursuant to\n                    O 14 R 12 of the Rules of Court (Cap 322, R5, 2006 Rev Ed)\n                    (“the Rules”), a declaration that the natural and ordinary meaning\n                    of one or more of the selected statements was defamatory, and interlocutory\n                    judgment with damages to be assessed. 9       The application was heard by a different High\n                    Court judge, who ruled that the seven statements were defamatory, but\n                    nevertheless gave unconditional leave to Basil to advance his defences at trial\n                    as he had raised triable issues. Broadly speaking, the seven statements were\n                    found to carry the defamatory meaning that (a) Premier, through Saraj and\n                    Leow, had terminated Basil and other ex-employees wrongfully and capriciously;\n                    and (b) Premier, under the management of Saraj and Leow, provided\n                    sub-standard services to its clients, both generally and specifically to SBS,\n                    SMRT and SATS. There was no appeal against the decision in SUM 2599. The\n                    trial before the Judge was therefore only in relation to Basil’s defences\n                    of justification, fair comment, and qualified privilege, which he advanced in\n                    respect of all seven defamatory statements, as well as his\n                counterclaim.",
        "The trial and the Judge’s decision": "10     The trial below was by any measure a bruising\n                    one – salted by the accusations of malice and incompetence liberally\n                    levelled by both sides against each other. The hearing was spread over nine\n                    days, of which four were spent on the cross-examination of Basil alone. The\n                    respondents called three witnesses; Basil called eleven. In the end, after\n                    considering the evidence before her, the Judge categorically rejected\n                    Basil’s defences against the respondents’ claim and dismissed his\n                    counterclaim. She then awarded the respondents aggravated damages totalling\n                    $150,000, of which $80,000 went to Premier, $50,000 to Saraj, and $20,000 to\n                    Leow. She also granted an injunction prohibiting Basil from reproducing the\n                    contents of the four letters he had sent. Costs were awarded to the respondents\n                    on the High Court scale. 11     We pause here to note that the Judge made the\n                    award of damages notwithstanding her prior direction given at the end of the\n                    trial that the parties were to submit “[p]urely on\n                        liability, vis-à-visthe defence and liability\n                        on the counterclaim” [emphasis added],[note: 2]and that the “[a]ssessment of damages, if necessary, is [to be] done by the\n                        registrar” [emphasis added].[note: 3]It seems clear from the material\n                    before us that counsel for Basil, led by Mr Singa Retnam\n                    (“Mr Retnam”), had, as they should, complied with the\n                    Judge’s direction and refrained from addressing the issue of\n                    quantification of damages in their closing submissions. On the other hand,\n                    counsel for the respondents, led by Mr Adrian Wong\n                    (“Mr Wong”), seem to have taken it upon themselves to submit\n                    on the issue of quantum of damages in their closing submissions, which were\n                    tenderedin responseto the submissions from\n                    counsel for Basil on the viability of Basil’s defences. It therefore\n                    appears to us that, in so far as the issue of the quantification of damages is\n                    concerned, the Judge only had the benefit of the submissions of counsel for the\n                    respondents before she gave her decision, and had not afforded any opportunity\n                    to counsel for Basil to make any submissions on the issue. 12     We also note that, while the Judge held (at\n                    [143] of the Judgment) that aggravated damages were awarded because of\n                    Basil’s “conduct and his malice” towards the respondents,\n                    she did not initially give separate figures for the damages flowing from\n                    Basil’s seven defamatory statements and the damages flowing from\n                    Basil’s aggravating conduct. However, in an addendum which primarily\n                    addressed the appropriate scale of costs applicable, the Judge explained (at\n                    [151] of the Judgment) that “[b]ecause of the finding of malice …\n                    , the damages awarded to the [respondents] were double what this court would\n                    have otherwise awarded to each of the [respondents]”.",
        "The issues arising on appeal": "13     In this appeal, Mr Retnam made a root and\n                    branch attack against the decision of the Judge. He took issue with,inter alia, the Judge’s setting aside of the\n                    subpoenas of five potential witnesses for the defence, several findings of fact\n                    and propositions of law stated in the Judgment, and the general conduct of the\n                    proceedings by the Judge. 14     At the hearing before us on 16 March\n                    2010, Basil had sought, via Summons No 753 of 2010, to adduce fresh\n                    evidence on appeal in the form of a private investigator’s report dated\n                    31 December 2009, which stated that Leow had since the trial left Premier\n                    in questionable circumstances. Mr Retnam failed to convince us that this\n                    application should be allowed, and it was dismissed with the issue of costs\n                    reserved.",
        "The subpoenas issue": "15     The issue of the subpoenas will be considered\n                    first. Basil had, in the course of the proceedings, attempted to subpoena the\n                    following persons: (a)     Mr Johnny Kung Leong Jin\n                        (“Kung”), who is or was with SBS as a manager at the Ang Mo\n                        Kio Bus Depot;[note: 4] (b)     Mr William Hong Charn Wai (“Hong”),\n                        who formerly was with SBS as head of the Soon Lee Bus Depot;[note: 5] (c)     Mr Augustine Wong (“Wong”),\n                        who is or was with SBS as an assistant vice president of “Rail\n                        Safety, Security & Quality”;[note: 6] (d)     Mr Sarip bin Osman (“Sarip”), who is\n                        or was with SMRT as a security executive;[note: 7]and (e)     Mr Raihan bin Supat (“Raihan”), who\n                        formerly was with Premier as a security executive.[note: 8] For convenience, we shall hereafter use the term “the disallowed\n                    witnesses” when referring to these persons collectively. Basil had also\n                    subpoenaed Kong, but that subpoena was not set aside.",
        "The attempts to subpoena the disallowed witnesses": "16     It should be stated at the outset that the\n                    disallowed witnesses were, despite several prior requests, unwilling to produce\n                    the relevant documents or swear/affirm affidavits. Basil, therefore, had no\n                    alternative but to resort to the machinery of the court and subpoena them. It is\n                    helpful to briefly outline Basil’s many attempts to seek leave for the\n                    disallowed witnesses to testify on and make discovery of relevant matters, and\n                    the strenuous efforts of the respondents to resist these attempts at every\n                    turn. 17     Basil’s first application in this regard\n                    was Summons No 3682 of 2008, in which leave to subpoena the disallowed\n                    witnesses to give oral evidence and for their affidavits of evidence-in-chief\n                    (hereafter abbreviated to “AEICs” (or, for a single affidavit of\n                    evidence-in-chief, “AEIC”)) to be dispensed with was prayed for.\n                    An assistant registrar acceded to the respondents’ objections and\n                    dismissed the application on 3 September 2008 for non-compliance with the\n                    requirements in O 39 R 14 of the Rules, but without prejudice to\n                    Basil’s ability to file a fresh application. This was, it seems to us, a\n                    relatively minor procedural oversight which could in fact have been cured by the\n                    assistant registrar without the need for a further application. 18     Basil then filed a second application,viz, Summons No 4221 of 2008\n                    (“SUM 4221”), which was to similar effect. This application\n                    was heard by another assistant registrar on 17 October 2008. During the\n                    hearing, Mr Wong again raised a procedural objection based on O 39\n                    R 14. He further argued that the application, being a repeat of the first\n                    application, was an abuse of process and that the respondents might be caught by\n                    surprise with the large number of witnesses involved. The assistant registrar,\n                    after considering these arguments, granted leave for the disallowed witnesses to\n                    give oral evidence and for their AEICs to be dispensed with, on the condition\n                    that Mr Retnam furnish to Mr Wong, by 4pm on 28 October 2008, a\n                    list of questions and issues that each of the disallowed witnesses would be\n                    giving evidence on. It is not clear from the record when the list was eventually\n                    given. However, during oral arguments before us, Mr Wong informed us that\n                    the questions were provided only in early February 2009. Mr Retnam did not\n                    dispute this. 19     On 29 January 2009, Basil issued\n                    subpoenas to the disallowed witnesses to testify and to produce documents. It\n                    should be noted that the issue of a subpoena takes place upon the administrative\n                    act of the subpoena being sealed by an officer of the Registry (see O 38\n                    R 14(2) of the Rules). 20     On 26 February 2009, the respondents\n                    filed an application,viz, Summons No 901 of\n                    2009 (“SUM 901”), to set aside the subpoenas (which were\n                    addressed to the disallowed witnesses) on the ground that they were irrelevant,\n                    oppressive, and/or an abuse of process. On the same day, Basil filed an\n                    application,viz, Summons No 905 of 2009, to\n                    vacate the original trial dates, on the ground that more time was needed to\n                    peruse the additional documents which had been belatedly given in discovery by\n                    the respondents only on 11 February 2009. Both applications were fixed for\n                    hearing before the Judge on 2 March 2009, the day the trial was originally\n                    scheduled to begin. On 2 March 2009, the Judge heard the applications. She\n                    found that no satisfactory reason could be given to justify the issuance of the\n                    subpoenas in question and ordered that they be set aside. This order was made\n                    without prejudice to Basil issuing fresh subpoenas for the disallowed witnesses\n                    to testify, with the leave of the Judge. The Judge also vacated the trial dates\n                    and rescheduled the trial to commence on 9 March 2009. 21     On 5 March 2009, Basil filed an\n                    application,viz, Summons No 1018 of 2009,\n                    for leave to issue fresh subpoenas to the disallowed witnesses. At the hearing\n                    before the Judge on 9 March 2009, Mr Retnam submitted that he was not\n                    proceeding with the application in so far as Wong was concerned. The application\n                    was vigorously opposed by counsel for the respondents, Mr Wong, who argued,inter alia, that the documents sought by way\n                    of the subpoenas should have been obtained through discovery from the\n                    respondents, that the application did not include an offer to reimburse the\n                    witnesses, that the questions proposed to be asked of the disallowed witnesses\n                    were leading, and that the whole application was a “fishing\n                    expedition”. 22     Here, we pause to make some observations on\n                    Mr Wong’s reasons for resisting the application. First, Mr Wong\n                    did not concede that the respondents had the documents that Basil sought, and\n                    indeed he could not, for such a contention would immediately render the\n                    respondents in knowing breach of their discovery obligations. If the respondents\n                    did not have the documents sought, then why should Mr Retnam proceed\n                    against them first, or indeed at all? Second, reimbursement for the subpoenaed\n                    witnesses could be ordered by the court, and was, in any event, no business of\n                    the respondents. Third, leading or irrelevant questions could be disallowed by\n                    the court, or rephrased. Fourth, it is not clear at all what Mr Wong meant\n                    in describing the application as a “fishing expedition” –\n                    Mr Retnam had prepared specific questions to be addressed to each of the\n                    disallowed witnesses. We are, therefore, of the opinion that there was no\n                    substance at all to Mr Wong’s recorded reasons for resisting\n                    Basil’s application. They were wide off the mark. 23     The Judge, nevertheless, dismissed\n                    Basil’s application. We cannot ascertain from the material before us\n                    whether she agreed with any of Mr Wong’s imaginative contentions. But\n                    it is clear from the Judge’s notes of argument that there was no proper\n                    argument addressed to her on the issue which truly mattered – whether or\n                    not the disallowed witnesses were in a position to give relevant evidence which\n                    could have materially affected the outcome of some or all of the live disputes\n                    before the court in Basil’s favour. The Judge briefly mentioned at [118]\n                    of the Judgment that she “upheld [Mr Wong’s] objections that\n                    the subpoenas were being used for the purpose of obtaining discovery and\n                    dismissed the application”. We are unable to agree with this reason.\n                    Mr Retnam, having unsuccessfully attempted to obtain the agreement of the\n                    disallowed witnesses to give evidence, had little option but to compel them to\n                    come forward to testify and produce documents. This is hardly an abuse of\n                    process. While it may have been preferable for Mr Retnam to have taken out\n                    a separate and earlier application for third-party discovery against their\n                    employers, his failure to do so was not a fatal procedural defect. Appropriate\n                    directions and costs could have redressed any prejudice allegedly suffered by\n                    the respondents.",
        "The right of a litigant to bring relevant evidence before the\n                court": "24     At this juncture, we would emphasise that\n                    every litigant has a general right to bring all evidencerelevantto his or her case to the attention of the court. This\n                    general right is so fundamental that it requires no authority to be cited in\n                    support of it; in fact, to say that the right derives from some positive\n                    decision or rule is to understate its constitutive importance to the adversarial\n                    approach to fact-finding. The importance of the right is reflected in the fact\n                    that a litigant may pray in aid the machinery of the court to compel, on the\n                    pain of contempt, all persons who are in a position to give relevant evidence,\n                    to come forward and give it. 25     The general right is, of course, subject to\n                    specific limits. For present purposes, the following limits are germane. A\n                    litigant only has the right to adducerelevantevidence, as defined by the Evidence Act (Cap 97, 1997 Rev Ed) and\n                    other applicable rules; irrelevant evidence is inadmissible and will not be\n                    considered by the court. The adduction of relevant evidence must, as far as\n                    practicable, take place in accordance with the rules of procedure whose purpose\n                    is to ensure thefair, economical, swift and\n                    orderly resolution of a dispute. Finally, a litigant is prohibited from\n                    manipulating the court’s machinery to further his ulterior or collateral\n                    motives in an abusive or oppressive manner. 26     In striking the proper balance between the\n                    general right and the specific limits, a trial judge must not only be guided by\n                    the applicable rules and decisions, but must look beyond the mechanical\n                    application of these rules and decisions, and carefully assess the interests at\n                    stake in every case to ensure that afairoutcome\n                    is reached through the application offairprocesses. It should always be borne in mind that grave consequences might flow\n                    from the wrongful exclusion of evidence (such as by shutting out a witness from\n                    testifying or preventing cross-examination). In cases where the relevance of\n                    evidence sought to be adduced is unclear, or even doubtful, we are of the view\n                    that it is usually both prudent and just to err in favour of admission rather\n                    than exclusion. With specific regard to the calling of witnesses, we would\n                    reiterate what was said inAuto Clean ‘N’ Shine\n                        Services (a firm) v Eastern Publishing Associates Pte Ltd[1997]\n                    2 SLR(R) 427 (at [17]), where this court allowed an appeal to\n                    introduce eleven new witnesses of fact after the summons for directions\n                    stage: [A] balance should be struck between the need to comply with the rules and\n                        the parties’ right to call witnesses whom they deem necessary to\n                        establish their case. It may well be that the additional evidence to be\n                        adduced by the parties may assist in illuminating the issues before the\n                        court or result in the expeditious disposal of the proceedings. If, however,\n                        it really turns out at the trial that the evidence adduced is unnecessary,\n                        irrelevant or vexatious, the trial judge is in full control and is in a\n                        position to deal with the party adducing such evidence in an appropriate\n                        way, such as by disallowing the evidence which is being elicited from the\n                        witness and/or by an order as to costs.It must always be\n                            borne in mind that the duty of the court is to examine all the evidence\n                            put forward by the parties which is material and relevant to the dispute\n                            between the parties and not to shut out potentially material and\n                            relevant evidence by a strict adherence to the rules of civil\n                            procedure. [emphasis added] 27     With these observations in mind, we now turn\n                    to examine the relevance of the testimony which the disallowed witnesses could\n                    have given, and the documents that they might have produced.",
        "The relevance of the evidence of the disallowed witnesses": "Relevancevis-à-visthe services\n                provided by Premier 28     As mentioned earlier (see[9]above), the seven defamatory statements made by\n                    Basil broadly alleged that (a) Premier, through Saraj and Leow, terminated\n                    Basil and other ex-employees wrongfully and capriciously; and (b) Premier,\n                    under the management of Saraj and Leow, provided sub-standard services to its\n                    clients, both generally and specifically to SBS, SMRT and SATS. In our view, it\n                    is obvious that the testimony of those of the disallowed witnesses who are\n                    employees or ex-employees of SBS or SMRT,ie,\n                    Kung, Hong, Wong and Sarip, areprima facierelevant for the purpose of proving the defence of justification and the factual\n                    basis for the defence of fair comment in relation to those of Basil’s\n                    defamatory statements that alleged serious lapses in the quality of the services\n                    which Premier typically provided to its clients. It is plain from their present\n                    or past designations that Kung, Hong, Wong, and Sarip were in positions of\n                    authority which would have given them oversight of security issues, and even if\n                    this was not the case, appropriate directions could be given by the court to\n                    summon the appropriate persons. 29     Further, Kung and Hong were involved in\n                    specific incidents concerning Premier. Kung was, according to Leow’s AEIC,\n                    the SBS employee who contacted her about SBS’s dissatisfaction with the\n                    deployment of one Ong Choon Hock (also known as Casino Ong or Kasino Ong)\n                    (“Casino Ong”) to its premises (an event which is also relevant to\n                    the issue of Basil’s alleged wrongful dismissal (see [35]–[36] and\n                    [44]–[49] below)). 30     The evidence of Hong, who also was an SBS\n                    employee, would appear to be particularly important. He was the author of an\n                    internal e-mail dated 21 August 2006 detailing several complaints that SBS\n                    had about the security guards supplied by Premier. The contents of the e-mail,\n                    whose authenticity was not disputed at the trial, are arresting, and the\n                    unadulterated text is set out in full as follows:[note: 9] Below feedback from our Operations staff shows another blunder by Premier.\n                        Cannot imagine if the public has taken a photo of the sleeping guard and\n                        send it to the Straits Times. I understand our new security contract do not allow SBST to issue monetary\n                        penalty to Premier. So are there any alternatives to strengthen their\n                        services to us before something unpleasant happens, now that IMF delegates\n                        are coming. Also my other incidents reported to them below, but, have not received any\n                        replies..... Jurong East interchange > I conducted a security audit this morning at 4am and found that the\n                        bollard & chain system x 3 sets at our interchange Ingress and Egress\n                        were not effected. Walked through the concourse, but, security guard was\n                        nowhere to be seen. - Please investigate why our instruction were not complied with. Soon Lee depot > Noted Relief security guard, Chua Ann Hock, was inside the security\n                        guardhouse with ear piece worn, listening to music. Informed him to remove\n                        as it may affect his alertness on the surrounding situation. Also, queried\n                        with Supervisor, Tan Tai Long why he has not given relief guard proper\n                        instructions. - Please investigate why basic security standards are not complied\n                        with. Harbourfront interchange > Received feedback site staff that our bus captain Goh Guan Chee of\n                        service 143, had a few encounters with Premier Security Guards\n                        (assigned to Harbourfront Stations) refusing to pay for fares. He could not\n                        provide the names or the profiles of the persons, but his last encounter was\n                        onSat, the 5th of Aug’06. - Please assist to remind all your security staff that being non-SBST\n                        staff, they have to pay for the bus fares. Hougang Depot> Regular security guard seen smoking outside the guard house, and their\n                        supervisor was around on 16/8. When I have settled my matter with a\n                        contractor, same guard was again holding a cigarette at buspark. [bold and underlining in original] 31     Hong was replying to another internal e-mail,\n                    dated 21 August 2006, written by one Goh Seong Lien. The contents of that\n                    e-mail are equally interesting, and the unadulterated text is set out in full as\n                        follows:[note: 10] On 17/08/2006 at 0300hrs, duty ops per Walter Hoe and Soh found indian\n                        Security Guard sleeping soundly on the bench at Jurong East\n                        Interchange. They tried waking up the said security guard but to no avail. As such, Walter Hoe called his agency Premier Security co - operative Ltd\n                        to report of the above incident. Mr John Lim of Premier after taking down the report informed Ops Per\n                        Walter Hoe that he will get somebody to check on the said security\n                        guard. The said security guard refuse to wake up and continue his sleeping\n                        despite our ops per shaking his shoulder. I think to have to send a very strong signal to the agency telling them\n                        that this type of security guard cannot be in our RGs. They are to be here to look after our property and not malingering at our\n                        compound. can we impose penalty on this? Just to wake up the agency. 32     It is evident from these two e-mails that SBS\n                    was highly dissatisfied with the services provided by Premier about six months\n                    prior to Basil’s defamatory statements. More importantly for present\n                    purposes, the e-mails unequivocally establish that Hong was in a position to\n                    give highly relevant evidence about the quality of services provided by Premier\n                    to SBS. 33     Raihan, for his part, was identified by Basil\n                    as one of the two persons (the other being one Andrew Lee (“Lee”),\n                    who eventually testified on Basil’s behalf) who told him (ie, Basil) that Premier did not conduct orientation\n                    courses for security personnel to be deployed to the premises of SATS. The\n                    purpose of the orientation course was to prepare the guards for the basic\n                    aviation security test which SATS required all guards deployed at its premises\n                    to pass. Basil further testified that Raihan had shown him a list of guards who\n                    had not taken the orientation course. In the circumstances, Raihan’s\n                    testimony would plainly be relevant for the purposes of corroborating or\n                    refuting Basil’s evidence. Raihan’s testimony would be all the more\n                    important given that the respondents had, curiously, chosen not to make out a\n                    positive case (save by giving bare oral evidence) with regard to the conduct of\n                    orientation courses and tests for the guards to be deployed to the premises of\n                    SATS. As far as we can tell, no relevant documents were discovered by the\n                    respondents with regard to the conduct of the orientation courses or the tests\n                    in 2006 – the latest test scores and statistics exhibited in Saraj’s\n                    AEIC were dated February 2005. Here, we note that the Judge had held (at [61] of\n                    the Judgment) that since Lee, from whom Basil got his information, “was\n                    told of the lack of orientation for SATS’ assignment by Raihan …\n                    who did not testify …it was a case of hearsay upon hearsay\n                    evidence” [emphasis added]. With respect, the Judge’s\n                    opinion seems to us to only confirm the need for Raihan to have been allowed to\n                    testify. Relevancevis-à-visthe alleged\n                wrongful dismissal 34     In our view, the evidence of Kung and Hong\n                    would also be relevant for the purposes of determining the circumstances\n                    surrounding Basil’s dismissal. The circumstances of Basil’s\n                    dismissal would be highly pertinent to his counterclaim for wrongful dismissal,\n                    to the truth of his defamatory statement that he was capriciously dismissed, and\n                    to the motives underlying Premier’s response to the MOM’s queries on\n                    Basil’s dismissal, which Basil claimed defamed him. In connection with the\n                    latter, if, for example, the evidence showed that Saraj had acted capriciously\n                    in dismissing Basil, his motivation in attaching the anonymous letter to\n                    Premier’s response to the MOM’s request for more information on\n                    Basil’s dismissal would naturally be called into question, with the result\n                    that the claim of qualified privilege in relation to that response might be seen\n                    to rest on a dubious footing. 35     In order to understand the relevance of the\n                    testimony of Kung and Hong, it is necessary to understand the nature of the\n                    parties’ dispute in relation to the alleged wrongful dismissal. In their\n                    Statement of Claim, the respondents pleaded,inter\n                        alia, that:[note: 11] 6.    [Basil] failed to satisfactorily account for and/or\n                            explain to the [respondents] the continued deployment of a guard, Ong\n                            Choon Hock alias Casino Ong, whom he knew did not meet the\n                            client’s requirement for a security assignment undertaken by\n                            [Premier] for SBS. … 10.    Despite receiving feedback from SBS about [Casino\n                            Ong], [Basil] failed to, omitted, and/or neglected to report the\n                            aforesaid feedback to his superiors, which included [Saraj], on a timely\n                            basis so that proper measures could be taken to respond to the\n                            client’s concerns. 11.    This was not only in breach of [Basil’s]\n                            duties as an employee of [Premier] but also exposed [Premier] to\n                            potential liability under its contractual arrangements with SBS and/or\n                            loss of goodwill with the client. 36     The incident regarding Casino Ong was the only\n                    incident specifically pleaded by the respondents in their Statement of Claim as\n                    a cause for the dismissal of Basil. Hereafter, the term “the Casino Ong\n                    incident” should be taken as a general reference to that incident. For\n                    completeness, it should be mentioned that Casino Ong was a relief guard who\n                    walked with a limp, which presumably prevented him from effectively patrolling\n                    SBS’s premises. In addition to the Casino Ong incident, the respondents\n                    also pleaded generally that:[note: 12] [Basil’s] working attitude had always been wanting. Past instances\n                        of his poor work performance included:- (1)    poor English/writing/communication skills which\n                            made him ill-equipped for the job; (2)    flagrant disregard and disdain for proper\n                            authority and procedure; (3)    frequent failure to submit weekly reports of the\n                            assignments under his charge despite repeated verbal reminders and/or\n                            warnings; (4)    noticeable absence from the office during working\n                            hours; (5)    failure to visit assignments/sites under his\n                            charge at least once every two days as required of him by the\n                            [respondents]. Instead, his attendance was erratic; [and] (6)    failure to submit proper and/or timely incident\n                            reports to clients of [Premier]. 37     In support of these general allegations, Saraj\n                    referred in his AEIC to two other incidents. The first, which will be referred\n                    to as “the Pandan Valley incident”, concerned Basil’s\n                    monthly report for November 2006 to the manager of Pandan Valley condominium,\n                    sent on 4 December 2006, which Saraj complained was drafted in poor\n                    English, riddled with incorrect facts, and sent without his authorisation. Saraj\n                    then sent a corrected copy on 6 December 2006. The second, which will be\n                    referred to as “the field book incident”, concerned Basil’s\n                    field book. Saraj deposed that he checked the field book after Basil left the\n                    employ of Premier and found it “shocking” that the last entry was\n                    recorded on 6 June 2006.[note: 13]Saraj took this to mean\n                    that Basil had stopped recording and performing his work from that date\n                    onwards. 38     Basil, for his part, pleaded in his Defence\n                    and Counterclaim that he was well aware of Casino Ong’s unsuitability for\n                    duty, and had in fact reflected this several times to Saraj and Mr Kahka\n                    Singh s/o Kernal Singh (“Kahka”), a senior supervisor at Premier\n                    who testified on behalf of the respondents. Basil further denied that he was\n                    ever given any oral warning or reminder that his performance was unsatisfactory.\n                    In relation to the field book incident, Basil asserted during cross-examination\n                    that, besides the field book that was produced at trial, he kept two other field\n                    books in which he recorded his field work, and, specifically, his objections to\n                    the deployment of Casino Ong. Basil did not apply for the production of these\n                    books, and the respondents denied their existence. 39     The Judge found that Basil was dismissed with\n                    just cause for all three incidents raised by the respondents,viz, the Casino Ong incident, the Pandan Valley incident, and\n                    the field book incident (see [38]–[50] of the Judgment). Some observations\n                    may be made in regard to the three incidents. 40     It is undisputed that Basil’s report to\n                    the management of Pandan Valley condominium had typographical errors and was\n                    sent without Saraj’s prior clearance. That said, we could see no great\n                    difference in substance between the reports sent by Basil and Saraj. Indeed, the\n                    only difference of note appears to be Basil’s greater candour about the\n                    reasons for an absentee guard; this can hardly be counted against him. We should\n                    also say, for completeness (since much time was taken up on this issue below),\n                    that complaints by Saraj about the standard of Basil’s command of the\n                    English language seem to have been greatly exaggerated as,inter alia, the defamatory letters written by Basil evinced a\n                    more than competent command of the language. At any rate, the respondents’\n                    attempt to establish Basil’s lack of language skills was considerably\n                    weakened by the complete absence of any evidence about the median language\n                    skills of the other security executives who were then in the employ of Premier.\n                    In the circumstances, we are unable to view the Pandan Valley incident, by\n                    itself, as objectively of such a magnitude as to warrant Basil’s sudden\n                    dismissal. We also find it difficult to accept that Saraj would dismiss Basil\n                    over the Pandan Valley incident alone – indeed, Saraj had deposed in his\n                    AEIC that the Casino Ong incident was the decisive consideration for dismissing\n                    Basil. 41     Three observations may be made in relation to\n                    the field book incident. First, the implications flowing from a finding that\n                    Basil did not perform or record his fieldwork since 6 June 2006 (which the\n                    Judge seemed to have made at [44] of the Judgment) do not sit well with the rest\n                    of the respondents’ case. If the respondents were right that Basil failed\n                    to conduct and record his fieldwork, it must necessarily follow that such\n                    failure (a) went undetected by the respondents for a period of six months,\n                    from 6 June 2006 to December 2006 when Basil was terminated; or\n                    (b) was detected but condoned. Both implications would be incongruent with\n                    the respondents’ case at trial. Saraj took considerable pains to emphasise\n                    that Premier was an efficient organisation with meticulous checks and balances\n                    in place which uncompromisingly strove to weed out undesirable practices. These\n                    implications are also inconsistent with Saraj’s evidence in his AEIC that\n                    he was troubled by Basil’s failure to report to him – if this is\n                    true, a most natural and logical response would be to check Basil’s field\n                    book. But Saraj did not do this until after Basil was terminated, some six\n                    months after Basil was alleged to have stopped his field work. 42     Second, the existence of the other two field\n                    books alluded to by Basil was not satisfactorily contested during\n                    cross-examination. Here, it is pertinent to refer to the evidence of\n                    Mr Jamaludin Malik bin Attan (“Jamaludin”), who was\n                    Premier’s human resource manager at the material time. He deposed in his\n                    AEIC that soon after Basil’s dismissal, he attempted to locate the\n                    A4-sized field book which Basil had used to record his investigations and\n                    movements. This A4-sized field book was one of the two which Basil said he kept,\n                    in addition to the one produced at trial (see[38]above). In cross-examination, Jamaludin was strenuously\n                    challenged on the propriety of attempting to remove the field book from the\n                    possession of Premier without notifying Saraj. Nevertheless, we find it highly\n                    significant that he was not challenged on his confirmation during\n                    cross-examination that he personally observed this A4-sized field book being\n                    used by Basil after May or June. Nor was it even put to him that the A4-sized\n                    field book did not in fact exist. 43     Third, we also find it noteworthy that the\n                    respondents’ solicitors made no mention of Basil’s alleged failure\n                    to maintain his field book after 6 June 2006 in their comprehensive letter\n                    of 6 March 2007 (see[6]above). What\n                    the respondents’ solicitors said was: “our clients have reviewed\n                    the site records and noticed that you did not visit the sites under your charge\n                    at least once every two days as required of you by our\n                        clients”.[note: 14]This is altogether different from\n                    saying that Basil had stopped maintaining records and stopped performing field\n                    work from 6 June 2006. In the circumstances, we do not think that much can\n                    be made out of the fact that the last entry in the field book discovered by\n                    Premier was dated 6 June 2006, and would disagree with the Judge’s\n                    findings in this connection. By the same token, we are not altogether convinced\n                    that the other two field books referred to by Basil did not exist. The Judge\n                    felt that Basil’s claim in relation to the other field books was simply\n                    not believable as this emerged for the first time when he was cross-examined and\n                    it was neither pleaded nor stated in his AEIC, and he had not requested the\n                    respondents’ for specific discovery of the same. On the other hand, we\n                    note that Basil’s evidence in this regard found support in the AEICs of\n                    both Jamaludin and Mr Mohd Masudi bin Haji Masuri, who was a senior\n                    security supervisor in Premier from 2004 until he left for another security firm\n                    in 2006. Further, as the respondents had insisted that there were no field\n                    records after 6 June 2006, and had not included such documentation in their\n                    list of documents, should an adverse inference have been drawn by the Judge\n                    against Basil if his counsel felt it would be pointless to ask for specific\n                    discovery? 44     It follows from our analysis in the preceding\n                    two paragraphs that the respondents are left with the Casino Ong incident, which\n                    was strikingly described by Saraj as “[t]he straw that broke the\n                    camel’s back”,[note: 15]as the main justification\n                    for their dismissal of Basil. Here, it should be emphasised that the\n                    respondents’ complaint relates to Basil’sfailure\n                        to check onCasino Ong, and to report his unsuitability for\n                    deployment to the respondents. Contrary to the Judge’s finding at [38(c)]\n                    of the Judgment, Kahka had expressly confirmed during the trial that thedeploymentof guards was done by him and his\n                    operations manager from Premier’s control room.[note: 16]The\n                    responsibility of security executives was to check on the guards and give\n                    feedback on the clients’ concerns. It would appear, therefore, that Basil\n                    was not responsible for the original deployment of Casino Ong. 45     With regard to Basil’s alleged failure\n                    to report on Casino Ong’s deployment, Leow had deposed in her AEIC that\n                    Kung of SBS had, on 13 December 2006, telephoned her to complain about\n                    Casino Ong. She then passed the information on to Saraj, who requested to see\n                    Basil the day after (ie, 14 December 2006).\n                    During that meeting, Saraj, in the presence of only Jamaludin, terminated the\n                    employment of Basil. Basil on his part insisted that he had informed both Saraj\n                    and Kahka about the unsuitability of Casino Ong for deployment at SBS’s\n                    worksites since late November. At trial, he was unable to recall whether he\n                    wrote a report to Saraj or informed him orally about this at a meeting of\n                    security executives in early December. Both Saraj and Kahka denied that Basil\n                    informed them about Casino Ong’s unsuitability for deployment. It is\n                    readily apparent that, without any corroborative material from a reliable\n                    source, this issue would turn, as it did in the trial before the Judge, on the\n                    relative credibility of each side’s witnesses. Parenthetically, we might\n                    add that it is rather puzzling, given SBS’s strict requirements and\n                    several prior complaints, that Premier (through Kahka or whoever else was the\n                    relevant person) had in the first instance deployed Casino Ong, notwithstanding\n                    his physical infirmity, at a SBS site. If the relevant people in Premier did not\n                    know about SBS’s prior unhappiness, this would raise questions about how\n                    Premier was managed. If the relevant people in Premier knew about the earlier\n                    difficulties with SBS and, despite this, proceeded with the deployment of Casino\n                    Ong, this too would raise eyebrows. 46     In regard to the question of whether Basil had\n                    informed Saraj and Kahka about Casino Ong, we are of the view that an evaluation\n                    of the evidence of Kung, as well as the relevant documentary records of SBS,\n                    could well be crucial. He would have been able to confirm or refute the evidence\n                    of Saraj and Leow that they were first informed of Casino Ong’s\n                    unsuitability for deployment only on 13 December 2006, and not earlier. He\n                    would also have been able to shed light on whether his complaint was made to\n                    Basil and/or other Premier staff. He would, in addition, have been able to give\n                    evidence on the respondents’ eventual responses (both written and oral) to\n                    his complaint. All this could have, in turn, enhanced or tarnished the credit of\n                    Saraj, Leow, and, ultimately, even Basil. If, for instance, Saraj had been\n                    informed much earlier about Casino Ong’s unsuitability for deployment, his\n                    professed main reason for dismissing Basil sometime well after the fact might be\n                    thrown into doubt; indeed, his entire credibility might well be called into\n                    question. In other words, the evidence of Kung and the relevant correspondence\n                    between Premier and SBS representsimportant corroborative\n                        materialon the Casino Ong incidentfrom an\n                        entirely independent source. This would have beenmosthelpful in deciding the outcome of the bitter\n                    contest of credibility between Saraj and Leow on one side, and Basil and his\n                    witnesses on the other. We do not understand why Mr Wong strove so\n                    strenuously to prevent such evidence from being adduced if, indeed, the\n                    respondents’ case was, as he jauntily put it during cross-examination,\n                        “Teflon”.[note: 17]Kung’s testimony could have been\n                    given without taking up much time and would not have inconvenienced either the\n                    parties or the court. 47     The testimonies of Kung and Hong are also\n                    pertinent in a more general sense. Both Kung and Hong were involved with\n                    SBS’s security arrangements. The dissatisfaction with Casino Ong was not\n                    the first time SBS was dissatisfied with the guards provided by Premier –\n                    as Hong’s e-mail (see[30]above)\n                    shows, there were already several instances of dissatisfaction in August 2006.\n                    How Kung and/or Hong conveyed SBS’s dissatisfaction to the respondents,\n                    and how the respondents responded to such complaints, both internally and\n                    externally in relation to SBS, would form an important canvas against which to\n                    evaluate Saraj’s evidence in relation to the Casino Ong incident. Saraj\n                    might, for example, be shown to have reacted in an uncharacteristically harsh\n                    manner when he dismissed Basil, in which case hisbona\n                        fidesin dismissing Basil, as well as in his subsequent actions,\n                    might again be called into question. 48     It is necessary at this juncture to reiterate\n                    the importance of the Casino Ong incident in relation to the issue of\n                    Basil’s wrongful dismissal and all the subsequent defamatory statements.\n                    The Pandan Valley incident was, by any yardstick, relatively trivial and appears\n                    to us to be an afterthought contrived as an additional peg on which to justify\n                    Basil’s abrupt dismissal. We are also, on the basis of the material before\n                    us, not entirely convinced that Basil’s additional field books did not in\n                    fact exist. In any case, because Saraj had himself confirmed that he only\n                    checked Basil’s field book after Basil was dismissed, the field book\n                    incident cannot be relied on to refute Basil’s defamatory statement that\n                    he was terminated capriciously, in the sense that the respondents had noex anteandbona\n                        fidereason for dismissing him. The Casino Ong incident is,\n                    therefore, central to the issue of Basil’s wrongful dismissal and the\n                    evidence of Kung and Hong (as well as relevant documentation from SBS) would\n                    have been crucial in assessing the credibility of the main protagonists in this\n                    matter. 49     Finally, if Saraj’sbona fidesin dismissing Basil are called into question, then,\n                    as mentioned earlier (see[34]above), his\n                    motives in crafting Premier’s response to the MOM’s query on\n                    Basil’s dismissal in the way he did would almost certainly be\n                    questionable. In this regard, we observe that it was not obviously necessary or\n                    relevant for Saraj to allege, in the communication to the MOM over Basil’s\n                    dismissal, that Basil was a racist, and further to include the anonymous letter\n                    of 12 August 2006, which alleged that Basil was racist and incompetent,\n                    amongst other things (see[5]above).\n                    Further, no credible evidence was adduced by the respondents to prove that Basil\n                    was, as alleged in the anonymous letter as well as the response to the MOM\n                    drafted by Saraj, ever motivated by racial considerations in the discharge of\n                    his duties either with Premier or in any of his previous jobs. In fact, the\n                    racism point was not mentioned in the respondents’ solicitors’\n                    letter dated 6 March 2007 (see[6]above) nor at any point in the proceedings below. These considerations, combined\n                    with a possible finding that Saraj did not actbona\n                        fidein dismissing Basil, might well support an inference that\n                    Premier’s response to the MOM was made maliciously for the purpose of\n                    discrediting Basil, thus defeating any claim of qualified privilege that the\n                    communication to the MOM might otherwise have attracted.",
        "Our decision on the subpoenas issue": "50     For the reasons given above, we are of the\n                    view that the disallowed witnesses were in a position to give oral and\n                    documentary evidence relevant to almost all the issues that were raised. In\n                    fact, we would go so far as to say that they were in a position to give what\n                    could have been crucial evidence on the key events on which the outcome of the\n                    case turned. In addition, with the exception of Raihan, who had previously been\n                    employed by Premier, the disallowed witnesses are disinterested third parties\n                    whose evidence are likely to be more credible than the partisan witnesses called\n                    by each side. The only issues that would not be directly affected by evidence\n                    from the disallowed witnesses would be the issues relating to Basil’s\n                    defamatory statement thatotheremployees were\n                    wrongfully dismissed. That said, those issues might be indirectly affected\n                    – the testimony of the present or former SBS and SMRT employees, who are\n                    disinterested third parties, would have the effect of affirming or compromising\n                    the credit of each side’s witnesses. 51     We are therefore of the opinion the Judge\n                    ought not to have set aside the subpoenas that were addressed to the disallowed\n                    witnesses.",
        "The appropriate remedy": "52     The question, then, is what would be the\n                    appropriate remedy. It is not possible for us to predict what the evidence of\n                    the disallowed witnesses would be, and therefore we cannot now reverse the\n                    decision of the Judge in favour of Basil. At the same time, it is also neither\n                    proper nor convenient for the disallowed witnesses to be examined before us, as\n                    we will be unable to contextually evaluate the evidence if it is not properly\n                    put to all the other relevant witnesses who testified below. In the\n                    circumstances, it is necessary for us to consider whether a new trial should be\n                    ordered. 53     The power of this court in the exercise of its\n                    civil jurisdiction to order a new trial is found in s 39 of the Supreme\n                    Court of Judicature Act (Cap 322, 2007 Rev Ed) (“the\n                    SCJA”), which is echoed in O 57 R 14 of the Rules.\n                    Section 39(2) of the SCJA provides that a new trial shall not be granted on\n                    the ground of improper admission or rejection of evidence, unless in our\n                    opinion, “somesubstantial wrong or miscarriage of\n                        justicehas been thereby occasioned” [emphasis added].\n                    This is “an exacting test for an appellant to satisfy” (seeReynolds v Times Newspapers Ltd[2001]\n                    2 AC 127 at 144perLord Bingham of\n                    Cornhill CJ). 54     InSusilawati v American\n                        Express Bank Ltd[2009] 2 SLR(R) 737 at [22], this\n                    court observed that the grounds on which a new trial may be ordered have not\n                    been statutorily fleshed out. The terms “substantial wrong” and\n                    “miscarriage of justice” defy precise definition. The lack of a\n                    precise formulation may well be for the better; as Lord Watson indicated inGeorge Bray v John Rawlinson Ford[1896] AC 44 at 50, it may not be possible to formulate anything\n                    useful, and it may be inexpedient to make an attempt to do so. Each case must\n                    turn on its own facts. That said, it is possible to lay down some very general\n                    guidelines, and in this regard we would respectfully refer to a passage in the\n                    judgment of Ma JA in the Hong Kong Court of Appeal decision ofKu Chiu Chung Woody v Tang Tin Sung[2003] HKEC 727 (at [24]): The Court of Appeal will not order a retrial (which inevitably involves\n                        further costs) unless some substantial wrong or miscarriage of justice has\n                        taken place. This usually involves two facets:- identifying some error that\n                        has taken place (for example the wrongful rejection of evidence) and next,\n                        determining whether the error so identified has deprived the party\n                        complaining of a substantial and realistic chance of success in the case. In\n                        other words, however serious the error, if the Court of Appeal takes the\n                        view that ultimately it would have made no difference to the outcome of the\n                        case, a new trial will not be ordered. There is a third facet to the\n                        exercise:- the Court of Appeal’s discretion. A retrial will be ordered\n                        not only where it is just to do so (see above), but where it is right to do\n                        so. If the Court of Appeal is in as good a position as the Court of First\n                        Instance to take a fresh view of the facts, a new trial will not be ordered.\n                        One sees the Court of Appeal operate in this way on a regular basis. It is\n                        only where the Court of Appeal is somehow disadvantaged in looking at and\n                        determining questions of fact that an order for a new trial will be\n                        seriously countenanced. 55     Although we have already determined that\n                    evidence was improperly rejected, it goes without saying that if the improperly\n                    rejected evidencewill not, if admitted,\n                    meaningfully vary the outcome of the case, no new trial will be ordered (see,\n                    also, s 169 of the Evidence Act). Equally, if the improperly rejected\n                    evidencewillvary the outcome of the case if\n                    admitted, but can beclearly and objectivelyestablished before the appellate court, no new trial will ordinarily be ordered,\n                    because in such a situation the outcome of the case should simply be varied\n                    accordingly. Thus, a new trial would ordinarily be ordered only where\n                    (a) the improperly rejected evidence would, if admitted, have a substantial\n                    and realistic prospect of making a meaningful difference to the outcome of the\n                    case, and (b) the appellate court is in no position to evaluate the\n                    improperly rejected evidence itself (see,eg,Chia Bak Eng and another v Punggol Bus Service\n                        Co[1965–1967] SLR(R) 270). Whether this is\n                    indeed the position would depend, of course, on the facts of each case. Whether\n                    a complete or partial retrial is necessary would also depend on the facts of\n                    each case, and, in particular, the effect of the improperly rejected evidence on\n                    the relevance and weight of the rest of the evidence. We would emphasise that an\n                    appellant seeking a new trial for the reason of improperly rejected evidence\n                    bears the heavy burden of establishing that a new trial is the appropriate\n                    remedy in the circumstances. 56     In the present case, the evidence of the\n                    disallowed witnesses would certainly have a substantial and realistic prospect\n                    of making a meaningful difference to the outcome of the case. In fact, as we\n                    have said at various points, the evidence of the disallowed witnesses might well\n                    be of decisive importance in confirming or refuting the factual positions taken\n                    by Basil and the respondents, as well as the credibility of each side’s\n                    witnesses. At the same time, it is impossible to say precisely what the evidence\n                    of the disallowed witnesses might be, whose evidence would be confirmed, and\n                    whose would be refuted. This can only be done by subjecting both parties’\n                    witnesses to the crucible of cross-examination. For the witnesses who had\n                    testified in the trial before the Judge, the difference would be that they will\n                    be confronted with the evidence of disinterested third parties this time\n                    round. 57     In these circumstances, we will set aside the\n                    decision of the Judge and order a new trial on Basil’s defences and his\n                    counterclaim.",
        "Observations on the legal issues": "58     Since we have decided to set aside the\n                    decision of the Judge and order a retrial, it is not necessary for us to\n                    consider the remainder of Mr Retnam’s arguments. We, therefore, will\n                    not address Mr Retnam’s complaints about the general conduct of the\n                    proceedings below. That said, given that the distinct requirements of the\n                    standard defences to defamation,viz,\n                    justification, fair comment and qualified privilege (all three of which were\n                    discussed recently by this court inReview Publishing Co Ltd\n                        and another v Lee Hsien Loong and another appeal[2010]\n                    1 SLR 52 (“Review Publishing v\n                        Lee”)), did not seem to have been fully appreciated in the\n                    proceedings below, we think it appropriate to make some general\n                    observations.",
        "The distinction between statements of fact and comment": "59     There is a bright line in the law of\n                    defamation distinguishing statements of fact from comments. The defence of\n                    justification applies to statements of facts, and is not defeated by malice\n                        (contra[85] and [139] of the Judgment). The\n                    defence of fair comment applies to comments, and is defeated by malice.\n                    Additionally, provided the other requirements are met, the defence of fair\n                    comment will apply if the comment is objectively capable of being made by an\n                    honest though obstinate and prejudiced person. It is, therefore, necessary to\n                    identify, in each case, whether the defamatory statement is one of fact or\n                    comment. The Judge appears to have treated all of Basil’s defamatory\n                    statements as statements of fact requiring justification. This was incorrect.\n                    There is at least one comment amongst Basil’s defamatory statements\n                    – the statement in his letter dated 24 January 2007 that Premier did\n                    not deserve the “B” grade it received from the SIRD,[note: 18]which is the\n                    industry regulatory body,[note: 19]was quite plainly a\n                    comment and not a statement of fact.",
        "The distinction between types of malice": "60     It seems to us that the Judge also failed to\n                    appreciate that there is a distinction between the type of malice which defeats\n                    the defence of qualified privilege and that which defeats the defence of fair\n                    comment. The defence of fair comment does not apply if the defamer did not\n                    honestly believe in the truth of the defamatory comment. The fact that the\n                    defamer was acting with ulterior purposes is by itself immaterial for the\n                    purposes of the defence of fair comment, though it can, depending on the facts,\n                    give rise to an inference that the defamer did not honestly believe in the truth\n                    of the comment he or she made. For the defence of qualified privilege, motive\n                    rather than honesty of belief is the essential indicator of malice. The defence\n                    of qualified privilege is not an available defence if the defamer does not make\n                    the defamatory statement for the purposes of protecting the interest or\n                    discharging the duty which gives rise to the privilege. 61     The reason for the distinction has been\n                    authoritatively explained by Lord Nicholls of Birkenhead, sitting as a\n                    non-permanent judge in the Hong Kong Court of Final Appeal, inTse Wai Chun Paul v Albert Cheng[2001] EMLR 31 (“Tse\n                    Paul”), which was quoted with approval by this court inOei Hong Leong v Ban Song Long David and\n                        others[2005] 3 SLR(R) 608. Lord Nicholls\n                    explained that the rationales for the two defences are different and this has\n                    led to the difference in the sort of malicious conduct that would serve to\n                    defeat each defence. The defence of qualified privilege is grounded on the\n                    law’s recognition that there are circumstances where one party has a duty\n                    or interest to pass on information to another party who has a duty or interest\n                    in receiving it. The rationale of the defence of fair comment is different in a\n                    material respect. It is not based on any notion of performing a duty or\n                    protecting an interest. It is meant to protect and promote the freedom of\n                    comment by everyone at all times on matters of public interest, irrespective of\n                    their particular motives. Therefore, an investigation into what is or is not a\n                    “proper purpose” would undermine the whole rationale for the\n                    defence of fair comment. With regard to spiteful or injurious motives in\n                    particular, Lord Nicholls noted (Tse Paulat\n                    [49]): The spiteful publication of a defamatory statement of fact attracts no\n                        remedy if the statement is proved to be true. Why should the position be\n                        different for the spiteful publication of a defamatory, genuinely held\n                        comment based on true fact? We respectfully agree with this observation. 62     Since the Judge apparently considered all of\n                    Basil’s statements to be statements of fact, there was naturally no\n                    finding as to whether Basil honestly believed in the truth of his statements.\n                    However, since we are of the view that there was at least one comment amongst\n                    Basil’s defamatory statements (see[59]above), the issue of fair comment would arise, and in that\n                    regard, a relevant question would be whether Basil honestly believed that\n                    Premier should not have obtained a “B” grade. Certainly, it is\n                    arguable that the other requirements of the defence were made out – issues\n                    of security involving public transport are ordinarily a matter of public\n                    interest. Saraj had to concede that “[i]solated incidents of guards being\n                    not entirely vigilant may exist”,[note: 20]and “there may be\n                    occasions where my guard had made mistake [sic]”,[note: 21]and it seems that an honest but\n                    obstinate and prejudiced man could have objectively concluded on this basis that\n                    Premier did not merit a “B” grade. On the facts, we are unable, as\n                    an appellate court, to ascertain whether Basil honestly believed in the truth of\n                    this comment, especially since material evidence had been excluded from the\n                    trial. In particular, we are unable to infer that Basil did not honestly believe\n                    that Premier did not merit a “B” grade, simply on the basis of the\n                    Judge’s finding (at [137] of the Judgment) that “[h]is motive was\n                    to ruin the reputation of Premier and cause [Saraj] and [Leow] to be dismissed\n                    from Premier’s employment just as he was dismissed”. In fact, it is\n                    not implausible that Basil embarked on a defamatory campaign to ruin the\n                    respondentsbecausehe honestly believed that\n                    Premier had skeletons in its closet.",
        "Relevancy of facts occurring after the alleged defamation": "63     There is a difference in the relevancy of\n                    events that occur after the defamation for the purposes of the defence of\n                    justification and the defence of fair comment. Such facts may be relevant to\n                    proving the former, which is concerned only with the truth of the defamatory\n                    statement, but not the latter. Regarding the former, an example can be made\n                    using an issue which featured prominently in Mr Wong’s\n                    cross-examination of Basil: the fact that several Premier’s guards were\n                    caught sleeping after his defamation may arguably support an inference that this\n                    was an existing practice which had not been remedied. The alleged\n                    defamer’s lack of knowledge of the relevant fact at the time of defamation\n                    is irrelevant since malice does not defeat the defence of justification;\n                    conversely, events that occur after the defamation are never relevant to\n                    establishing the defence of fair comment, since the defamer could not have\n                    formed an honest belief about the truth of his or her defamatory comments on the\n                    basis of facts which he or she could not, by definition, have known at the time\n                    of the defamation (seeCohen v Daily Telegraph Ltd[1968] 1 WLR 916). This difference in relevancy does not seem to have been\n                    fully appreciated by the Judge in several of her rulings during the trial\n                    proceedings as well as in the Judgment.",
        "Quantum of damages": "64     Several points should be made in relation to\n                    the Judge’s award of damages. 65     First, while damages for defamation may be\n                    given as a single award, we are of the opinion that, in awarding damages for\n                    defamation, a judge ought to demarcate and explain the damages awarded for the\n                    defamation itself and the additional damages awarded for the defamer’s\n                    aggravating conduct in relation to the defamation. The need for some form of\n                    separation is self-evident where financial loss is concerned. With regard to a\n                    solatium, it seems to us that the vindicatory value of such an award would be\n                    enhanced by a statement and explanation of the extent to which the award was\n                    increased by the defamer’s aggravating conduct. Second, given the\n                    Judge’s clarification (at [151] of the Judgment) that she doubled the\n                    damages awarded to each of the respondents because of her finding of malice, we\n                    are not at all certain that she had, in deciding on the quantum, appreciated\n                    that “[a] company [such as Premier] cannot be injured in its feelings, it\n                    can only be injured in its pocket” (Rubber Improvement\n                        Ltd and another v Daily Telegraph Ltd[1964] AC 234 at\n                    262perLord Reid). Only an individual can\n                    claim damages for distress. A corporate or business entity can only recover\n                    damages appropriate for vindication and (if pleaded) special damages for loss of\n                    business and goodwill. We also note that the ability of a corporate plaintiff to\n                    recover aggravated damages for defamation has not been authoritatively settled\n                    (see,eg, the contrasting positions taken in the\n                    English High Court cases ofMessenger Newspapers Group Ltd v\n                        National Graphical Association[1984] IRLR 397 andCollins Stewart v The Financial Times Ltd[2005] EMLR 5). These points of considerable import were not drawn to\n                    the Judge’s attention by counsel for the respondents in their terse one\n                    paragraph submissions on the appropriate awards to be made. And last, but\n                    certainly not least, it is unfortunate that the Judge made the award of damages\n                    notwithstanding the fact that counsel for Basil had complied with her directions\n                    and refrained from submitting on that issue.",
        "Other observations on the proceedings below": "66     Before we conclude this judgment, we feel it\n                    necessary to briefly comment on three aspects of the proceedings below which,\n                    while not the subject of this appeal, have given us cause for\n                concern.",
        "Segmentation of the proceedings": "67     The first aspect relates to the segmentation\n                    of the proceedings which resulted from SUM 2599, an application pursuant\n                    to,inter alia, O 14 R 12 of the Rules.\n                    As mentioned (see[8]–[9]above), in SUM 2599, another High Court judge\n                    determined the natural and ordinary meaning of Basil’s statements and\n                    found them to be defamatory of the respondents, but was of the view that Basil\n                    had raised triable issues in defence and gave him unconditional leave to\n                    prosecute his defence. This outcome had the unfortunate result that\n                    Basil’s liability for defamation for the seven statements was, in effect,\n                    determined by two different High Court judges in two distinct\n                    proceedings. 68     Such an approach would appear, at first blush,\n                    to be permissible following the decision of this court inMicrosoft Corp and others v SM Summit Holdings Ltd and another and\n                        other appeals[1999] 3 SLR(R) 465 (“SM Summit”), where it was held that the\n                    natural and ordinary meaning of allegedly defamatory words is a question which\n                    is suitable for determination under O 14 R 12 of the Rules. This\n                    conclusion was reached notwithstanding the fact that triable issues in defence\n                    were raised. 69     We do not think thatSM Summitought to be read as standing for the general\n                    proposition that the natural and ordinary meaning of allegedly defamatory\n                    words/statements is always or even generally suitable for summary determination\n                    even though there are triable defences – the judgment in that case only\n                    stated (at [51]) that “in this case, the\n                    natural and ordinary meaning of the alleged defamatory words is a question which\n                    is suitable for determination under O 14 R 12(1)” [emphasis\n                    added]. Indeed, we are of the opinion that there are a number of difficulties\n                    with having such a determination of the natural and ordinary meaning of\n                    allegedly defamatory words/statements where triable defences are raised. First,\n                    the trial judge would be put in the difficult and uncomfortable position of\n                    having to disregard the original defamatory words/statements and to confine his\n                    or her analysis to the meaning determined by the judge that heard the O 14\n                    R 12 application. This is not at all optimal or natural in an area of law\n                    where innuendoes and implied meanings feature so prominently. As an example, the\n                    trial judge may have to further interpret the pre-determined meaning to decide\n                    whether or not it was justified, with the result that the defendant would be\n                    justifying a meaning which is twice removed from the original words. Second, a\n                    segmented approach is not likely to be cost or time efficient, both in terms of\n                    the time it takes for the case to be steered through the various stages and the\n                    possibility of an appeal at each stage. On the present facts, for example, there\n                    could have been three appeals to us: one in relation to the O 14 R 12\n                    application, another in relation to the trial, and a third in relation to the\n                    assessment of damages. 70     In our view, the plaintiff in a defamation\n                    action ought to apply for an O 14 R 12 determination of the natural\n                    and ordinary meaning of allegedly defamatory words/statements only where there\n                    are clearly no triable defences (see,eg,Bank of Chia v Asiaweek[1991]\n                    1 SLR(R) 230;Chee Siok Chin and another v\n                        Attorney-General[2006] 4 SLR(R) 541;Review Publishing v Lee([58]supra)). Ordinarily, if there clearly are triable\n                    defences, the court should refrain from giving an opinion on the natural and\n                    ordinary meaning of the alleged defamatory words/statements concerned in the\n                    O 14 R 12 proceedings.",
        "Discovery": "71     The second aspect of the proceedings below\n                    which warrants comment is the scope of discovery given by the respondents. After\n                    reviewing the record for the purpose of deciding this appeal, we were not at all\n                    assured that the respondents have discharged their obligation to make full and\n                    frank disclosure of all documents relevant to the case. In fact, they seem to\n                    have been rather economical in making available relevant documents. Also, from\n                    what we had noted earlier (see[20]above),\n                    it would appear that the belated discovery of further documents delayed the\n                    start of the trial. There are a number of reasons, some of which we will now\n                    outline, for our intuitive feeling that the respondents have not been altogether\n                    forthcoming in disclosing relevant documents. 72     The SIRD, for its 2007 grading exercise, had\n                    required participating agencies to,inter alia,\n                    provide documentation to show the “[p]resence of [a] disciplinary system\n                    to penalize errant security officers.”[note: 22]To this end,\n                    Saraj included three termination letters which explained the reason for\n                    termination, two warning letters detailing the unsatisfactory performance\n                    required to be improved, and one record of absenteeism. Based on these\n                    documents, it would not be unreasonable for us to assume that some form of\n                    practice in this connection was in existence. But, curiously, to say the least,\n                    the respondents did not produce any similar documentation to support their\n                    sustained attack on the competence of Basil and the ex-employees of Premier who\n                    testified on Basil’s behalf. 73     With specific reference to Basil, the absence\n                    of personnel records is especially glaring. Saraj’s confirmation letter to\n                    Basil, dated 12 July 2006, stated that “your work performance has\n                    been very good” and exhorted Basil to “[k]eep\n                        up your good work” [emphasis added].[note: 23]We note that\n                    the record contains a draft of this letter showing that Saraj inserted these\n                    complimentary words onto a template which was noticeably bland. Beyond this\n                    letter, there was no written record relating to Basil’s employment until\n                    he was terminated by Saraj on 14 December 2006, by a letter which gave no\n                    explanation. In these circumstances, we are not at all sure that the Judge was\n                    right to dismiss the incongruity between Saraj’s scathing evaluation of\n                    Basil at trial and the attitude he evinced in writing Basil’s confirmation\n                    letter, even accepting, in this regard, Saraj’s breezy explanation that he\n                    was “trying to motivate [Basil] although [Basil] was not to [his]\n                        expectation”.[note: 24]. 74     All in all, the absence of personnel records\n                    raises a worrying number of questions. If such records existed, the respondents\n                    would be in breach of their discovery obligations. If they do not, questions\n                    would arise as to how Premier hired and managed its staff. Who called the shots\n                    in relation to the dismissal of staff? What was the dismissal process like? What\n                    was the evidence relied on in each case? Further, the absence of personnel\n                    records (contrathe image presented by Saraj in\n                    2007 to the SIRD) might well support Basil’s defamatory comment that\n                    Premier did not truly deserve the “B” grade it received from the\n                    SIRD in 2006. In this connection, the absence of Premier’s submission in\n                    2006 to the SIRD is also noteworthy. We should add that the subsequent\n                    “A” grades in 2007 and 2008 from the SIRD that impressed the Judge\n                    (see [128] of the Judgment) may not be relevant or material as they do not\n                    unequivocally indicate how Premier was managed during the material period,ie, 2006. 75     Separately, Premier also does not appear to\n                    have made any discovery of the correspondence it probably had with SBS in\n                    relation to the contents of Hong’s August 2006 e-mail (see[30]above) and the complaint from Kung about\n                    Casino Ong that Leow allegedly received on 13 December 2006. Neither has\n                    Premier made full discovery of the relevant documents in relation to several of\n                    the issues raised in Basil’s Defence and Counterclaim such as the\n                    liquidated damages it paid to SMRT and other clients in 2006 and the orientation\n                    course it purportedly conducted for the security personnel deployed to\n                    SATS. 76     It is trite law that Basil, in defending the\n                    defamation claim made against him, bore the legal burden of proving the defences\n                    he advanced. However, it should not be forgotten that the respondents, like all\n                    other litigants, are under an uncompromising obligation to give discovery of all\n                    documents in their possession, care or control which are relevant to the issues\n                    raised in their own, as well asBasil’s,\n                    pleaded case. In this regard, we hardly need to emphasise the consequences which\n                    may follow if there are suspicious and unexplained gaps in the documentation\n                    that is discoverable by a party.",
        "Application to set aside the subpoenas": "77     The third point we would like to make is in\n                    relation to the respondents’ misconceived application to set aside the\n                    subpoenas. Basil had, as said (see[18]above), succeeded in SUM 4221, and was granted leave to have the disallowed\n                    witnesses give oral evidence and for their AEICs to be dispensed with. The\n                    respondents did not file an appeal against that decision; instead, they applied,\n                    via SUM 901 (see[20]above), some four\n                    months after the decision in SUM 4221 and less than a week before the\n                    original trial dates, to set aside the subpoenas issued by Basil. We do not\n                    think that this is right. 78     A party who opposes another party’s\n                    attempt to call witnesses to give evidence-in-chief orally should, bar\n                    exceptional circumstances, raise all of his or her objections when the other\n                    party seeks leave to dispense with AEICs. Such leave is necessary in every case\n                    where a party wishes a witness to give evidence-in-chief other than by affidavit\n                    (see O 38 R 2 of the Rules), because of the judicial policy against\n                    trial by ambush, which requires the timely submission of evidence-in-chief in\n                    affidavit form. And because leave is necessary and is sought at aninter parteshearing, a party who objects to the giving\n                    of oral evidence-in-chief would always have an avenue to raise its objections\n                        (eg, on relevance). If the objections are not\n                    sustained before the assistant registrar, the objecting party should appeal to a\n                    judge in chambers. If not, he or she would have to live with the assistant\n                    registrar’s decision and deal with the witnesses at trial. The objecting\n                    party should not subsequently initiate a collateral attack against the assistant\n                    registrar’s grant of leave to dispense with AEICs. As this case\n                    illustrates, such a manoeuvre would severely disrupt the other party’s\n                    ability to plan its case, and should not be countenanced. 79     We would, of course, not preclude the\n                    possibility that there might be exceptional circumstances requiring a party to\n                    bring an application to set aside a subpoena after it has failed in its\n                    opposition to an application for leave to dispense with AEICs. But no such\n                    circumstances were alleged in this case, and we can see none.",
        "Directions and conclusion": "80     As we held earlier (see[52]–[57]above), the failure to allow the disallowed witnesses to\n                    testify and to produce documents is a sufficient reason for us to set aside the\n                    Judge’s decision and order a new trial on the viability of Basil’s\n                    defences and his counterclaim. We further direct that: (a)     Basil shall have leave to subpoena\n                        the disallowed witnesses and any other person from SBS, SMRT and SATS who is\n                        in a position to give relevant testimony or documentation to the\n                        case; (b)     the\n                        respondents shall discover, and Basil may discover from them, any\n                        documentation relevant to the case; (c)     all AEICs filed so far shall stand;\n                    and (d)     all the\n                        witnesses that had testified in the trial before the Judge shall testify\n                        again and be re-evaluated. Since we have set aside the\n                    decision of the Judge on the basis that relevant evidence had been excluded, the\n                    trial judge in the new trial ought not to have regard to any of the findings of\n                    the Judge or the evidence adduced in the trial before the Judge in coming to his\n                    or her decision. 81     The new trial should be held in the District\n                    Court, since we are of the opinion that the respondents, even if entirely\n                    successful, would not recover damages exceeding the District Court limit;\n                    indeed, the respondents submitted for a total award of $190,000 in the trial\n                    below. We therefore exercise our powers under para 10 of the First Schedule\n                    to the SCJA, and s 54C(2) of the Subordinate Courts Act (Cap 321,\n                    1999 Rev Ed) read with s 29A(3) of the SCJA, to forthwith transfer the\n                    present proceedings to the District Court save for the issue of the costs\n                    incurred to-date which we reserve to ourselves. In this connection, the parties\n                    are to let us have, within seven days of this judgment, their submissions on\n                    costs. 82     In closing, we would add that it is never a\n                    light matter for an appellate court to order a new trial. The parties will\n                    surely incur further costs, much inconvenience, and the ultimate result may not\n                    be different. Any order for a new trial must be preceded by a close scrutiny of\n                    all the available facts. At the same time, an appellate court would not hesitate\n                    to order a new trial when the appellant has been deprived of a real and\n                    substantial chance of success by a serious error in the conduct of the\n                    proceedings, and when the appellate court is in no position to decide what the\n                    outcome would be but for that error.",
        "Supplemental Judgment": "19 May 2010",
        "V K Rajah JA (delivering the grounds of decision of the court):": "",
        "Postscript on costs": "83     We heard the parties on the issue of costs on 19 May 2010. Mr Retnam argued that Basil should be awarded costs here and below on an indemnity basis. Mr Wong argued that the issue of costs should be reserved for determination by the district judge hearing the new trial. 84     Mr Wong relied on two cases where costs were reserved to the trial judge hearing a retrial,viz Ku Chiu Chung Woody([54]supra) andRichard McGivney v Rustico Summer Haven (1977) Limited(1989) 81 Nfld & PEIR 293). The two cases, in our view, provided little assistance, as the orders for new trials in both cases were not attributable to the conduct of the parties in question. In any event, costs are in the discretion of the court. 85     In contrast, the reasons for ordering a new trial in this case would be substantially attributable to the conduct of the respondents. They strenuously resisted the subpoenas of the disallowed witnesses on questionable grounds, right up to the trial (see[16]–[23]above). We were unable to accept Mr Wong’s explanation that the respondents were merely attempting to protect Premier’s relationships with its clients. The vindication of a party’s interests must not come through misguided procedural strategies of attrition, which deep-pocketed litigants will, in particular, be tempted to resort to. Nevertheless, we agreed with Mr Wong that some weight had to be given to the fact that Mr Retnam did not assist the court as comprehensively and as promptly as one might expect from counsel of his standing and experience. 86     In the result, we determined that it was appropriate to award Basil the costs of the appeal and half of his costs for the trial below on a standard basis, with the usual consequential orders to apply.  [note: 1]Core Bundle of Documents (“CBD”) vol\n                                2(B) at p 339. [note: 2]Notes of Evidence (“NE”) at p\n                            963. [note: 3]NE at p\n                                962. [note: 4]Affidavit of Basil filed on 24\n                                    September 2008 at para\n                    3. [note: 5]Affidavit of Basil filed on 24 September 2008 at para\n                                    3. [note: 6]Affidavit\n                                    of Basil filed on 24 September 2008 at para\n                            3. [note: 7]Affidavit\n                                    of Basil filed on 24 September 2008 at para\n                            3. [note: 8]Affidavit of Basil filed on 24 September 2008 at para\n                                    3. [note: 9]CBD vol 2(B)\n                                at p 304. [note: 10]CBD vol 2(B) at p\n                        305. [note: 11]Statement\n                                of Claim at paras 6, 10 and 11. [note: 12]Statement\n                                of Claim at para 12. [note: 13]AEIC of\n                                Saraj at para 48. [note: 14]Record of Appeal vol 5(A) at p\n                                3424. [note: 15]AEIC of\n                                Saraj at para 41. [note: 16]NE at pp 291–292. [note: 17]NE at p\n                                547. [note: 18]CBD vol 2(B) at p 317. [note: 19]AEIC of\n                                Saraj at para 13. [note: 20]AEIC of\n                                Saraj at para 65. [note: 21]NE at p\n                                30. [note: 22]Record of\n                                Appeal vol 5(C) at p 3785. [note: 23]CBD vol 2(B) at p 301. [note: 24]NE at p\n                    18."
    }
}