{
    "case_title": "Martek Biosciences Corp\n      v\n      Cargill International Trading Pte Ltd",
    "ncitation": "[2010] SGCA 51",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Introduction": "1       This appeal concerns an application by the\n                    appellant for leave to adduce further evidence in relation to a pending action\n                    in the High Court challenging the decision of the Deputy Registrar of Patents\n                    and the Principal Assistant Registrar of Patents (hereafter referred to\n                    collectively as “the Tribunal”) to revoke the appellant’s\n                    Singapore patent P-No 42669 (“the Patent”). The\n                    appellant’s application (“the Interlocutory Application”)\n                    was refused by the High Court judge (“the Judge”), which led the\n                    appellant to file the present appeal against the Judge’s\n                decision.",
        "Background": "2       The Patent pertains to a method for producing\n                    arachidonic acid (“ARA”) in triglyceride form for use in infant\n                    formula. One of the claims of the Patent is that “the oil [made using the\n                    patented method] comprisesat least50%\n                        ARA”[note: 1][emphasis in bold in original omitted;\n                    emphasis added in italics]. The respondent applied to have the Patent revoked on\n                    the ground that it lacked novelty or inventiveness, citing ten instances of\n                    prior art. Following a four-day hearing before the Tribunal from 9 to\n                    12 February 2009, the Tribunal reserved judgment. On 3 November 2009,\n                    the Tribunal released its written decision revoking the Patent for lack of\n                    inventiveness (seeCargill International Trading Pte Ltd v\n                        Martek Biosciences Corporation[2009] SGIPOS 12\n                    (“the Tribunal’s Judgment”)). The appellant, being\n                    dissatisfied with the decision of the Tribunal, appealed to the High Court by\n                    way of Originating Summons No 1418 of 2009\n                    (“OS 1418/2009”) filed on 15 December 2009. It was in\n                    relation to the appeal in OS 1418/2009 (“the HC Appeal”)\n                    that, on 15 January 2010, the appellant filed Summons No 234 of 2010\n                        (ie, the Interlocutory Application) requesting\n                    for leave to adduce further evidence pursuant to O 55 r 6(2) and/or\n                    O 87A r 13(2) of the Rules of Court (Cap 322, R 5,\n                    2006 Rev Ed) (“the ROC”). The evidence which the appellant\n                    wanted to adduce (“the Alleged Further Evidence”) related to a\n                    repeat of one of the experiments described in the prior art identified as\n                    “D4” (“the Experiment”). (D4 is the original\n                    description (in Japanese) of the Experiment, with “D4a” being the\n                    English translation thereof. For convenience, we will hereafter refer to this\n                    prior art as “D4a”.) On 12 March 2010, the Judge dismissed\n                    the Interlocutory Application (seeMartek Biosciences Corp v\n                        Cargill International Trading Pte Ltd[2010] 3 SLR 927\n                    (“the High Court GD”)). 3       At this juncture, we ought to explain that D4a\n                    is a patent in Japan relating to a skin cosmetic product which also uses ARA.\n                    The Experiment purports to set out how to make oil with all the features of the\n                    Patent’s claim. Particularly, it is claimed that the oil made from the\n                    Experiment comprises 72.9% ARA (for convenience, this claim will hereafter be\n                    referred to as “the D4a Claim”), which matches the claim in the\n                    Patent that the oil made using the patented method comprises at least 50% ARA.\n                    The Tribunal made certain findings on the invalidity of the Patent relying on,inter alia, D4a. 4       On 19 March 2010, the appellant’s\n                    solicitors wrote in to the Judge stating that the appellant had informed them,\n                    right after the hearing of the Interlocutory Application on 12 March 2010,\n                    that it had already conducted the Experiment and that the results showed that\n                    the oil produced from the Experiment had an ARA content of less than 50% and not\n                    72.9% as stated in the D4a Claim. The appellant’s solicitors requested for\n                    leave to make further arguments in order to persuade the Judge to reconsider the\n                    Interlocutory Application. The Judge declined the request, culminating in the\n                    present appeal by the appellant.",
        "The decision below": "5       In the High Court GD, the Judge made the\n                    following findings: (a)     The nature of an appeal from a\n                        decision of the Registrar of Patents (“the Patents Registrar”)\n                        to the High Court under O 87A r 13 of the ROC was “akin to\n                        that [of an appeal] from the High Court to the Court of Appeal under\n                        O 57 [of the] ROC” (see the High Court GD at\n                    [69]). (b)     Accordingly,\n                        the test set out inLadd v Marshall[1954]\n                        1 WLR 1489 for determining whether leave should be granted for\n                        further evidence to be adduced in an appeal before the Court of Appeal\n                        (“theLadd v Marshalltest”)\n                        should apply to an appeal under O 87A r 13, “albeit with\n                        appropriate modifications if the nature of the appeal and the factual matrix\n                        of the case so require[d]” (see the High Court GD at\n                    [74]). (c)     The appellant\n                        should have either carried out the Experiment prior to the hearing before\n                        the Tribunal, or applied for leave from the Tribunal during the hearing to\n                        carry out the Experiment and adduce the results obtained as evidence in the\n                        hearing. At the very least, the appellant should have conducted the\n                        Experiment during the period between the last day of the hearing before the\n                        Tribunal (viz, 12 February 2009) and the\n                        date on which the Tribunal’s Judgment was released (viz, 3 November 2009). The appellant’s inaction\n                        between 12 February 2009 and 3 November 2009 showed “a lack\n                        of due diligence in securing all relevant evidence before the\n                        Tribunal” (see the High Court GD at [75]). (d)     The evidence of the Experiment which\n                        the appellant was seeking leave to adduce (ie,\n                        the Alleged Further Evidence) would not have any major or significant\n                        bearing on the HC Appeal as the Tribunal had also held the Patent to be\n                        invalid in view of prior art other than D4a (see the High Court GD at\n                        [78]–[79]). (e)     The appellant had not enclosed any report or results of the\n                        Experiment (which it claimed it had already carried out) and, hence, the\n                        respondent would not be in a position to verify the credibility of the\n                        alleged results (see the High Court GD at [78]).",
        "The test to be applied for adducing further evidence under\n                Order 87A rule 13(2) of the ROC": "",
        "Comparison/Analogy with other provisions of the ROC": "6       The legal question which we have to decide in\n                    this appeal is: what is the test to be applied in deciding whether to grant\n                    leave for further evidence to be adduced pursuant to O 87A r 13(2) of\n                    the ROC in an appeal from the Patents Registrar to the High Court? As the Judge\n                    noted at [11] of the High Court GD, this question has hitherto never been\n                    decided in Singapore as the HC Appeal is the first case involving an application\n                    for leave to adduce further evidence in an appeal under O 87A\n                    r 13. 7       The applicable provision in the ROC is\n                    O 87A r 13(2), which provides that: An appeal [under O 87A r 13] shall be by way of rehearing and\n                        the evidence used on appeal shall be the same as that used before the\n                        [Patents] Registrar and, except with the leave of the Court, no further\n                        evidence shall be given. In the court below, both the parties as well as the Judge, in\n                    determining what test should be appliedvis-à-visO 87A r 13(2), drew analogies with other provisions in the ROC which\n                    similarly deal with the grant of leave to adduce further evidence in appeals\n                    (see [11] of the High Court GD). For ease of reference, tabulated below are the\n                    relevant rules in the ROC: Relevant provision of the ROCNature of the appealText of the relevant provisionTest to be applied for determining whether to grant\n                                        leave for further evidence to be adducedO 87A\n                                            r 13(2)Appeal from a decision of the\n                                            Patents Registrar to the High Court“An appeal shall be by\n                                            way of rehearing and the evidence used on appeal shall\n                                            be the same as that used before the [Patents] Registrar\n                                            and, except with the leave of the Court, no further\n                                            evidence shall be given.”No previous decision on point\n                                            in SingaporeO 87 r 4(2)Appeal from a decision of the\n                                            Registrar of Trade Marks (“the Trade Marks\n                                            Registrar”) to the High Court“An appeal shall be by\n                                            way of rehearing and the evidence used on appeal shall\n                                            be the same as that used before the [Trade Marks]\n                                            Registrar and, except with the leave of the Court, no\n                                            further evidence shall be given.”No previous decision on point\n                                            in SingaporeO 55 rr 2(1) and\n                                            6(2)Appeal from a court (other\n                                            than a subordinate court under the Subordinate Courts\n                                            Act (Cap 321, 2007 Rev Ed)), tribunal or\n                                            person to the High CourtO 55 r 2(1):\n                                            “An appeal to which this Order applies shall be\n                                            by way of rehearing …”O 55 r 6(2):\n                                            “The Court shall have power to require further\n                                            evidence on questions of fact, and the evidence may be\n                                            given in such manner as the Court may direct\n                                            …”No previous decision on point\n                                            in SingaporeO 57\n                                        r 13(2)Appeal from the High Court to\n                                            the Court of Appeal“The Court of Appeal\n                                            shall have power to receive further evidence on\n                                            questions of fact, … but, in the case of an\n                                            appeal from a judgment after [a] trial or hearing of any\n                                            cause or matter on the merits, no such further evidence\n                                            (other than evidence as to matters which have occurred\n                                            after the date of [the] trial or hearing) shall be\n                                            admitted except on special grounds.”The applicable test is theLadd v Marshalltest\n                                            as applied inSu Sh-Hsyu v Wee Yue\n                                                Chew[2007]\n                                            3 SLR(R) 673.However, inLassiter Ann Masters v To Keng Lam (alias\n                                                Toh Jeanette)[2004]\n                                            2 SLR(R) 392 (“Lassiter Ann”), it was held that a judge in\n                                            chambers hearing an appeal from a registrar’s\n                                            decision exercised a confirmatory jurisdiction and not\n                                            an appellate jurisdiction, and thus had the discretion\n                                            to admit further evidence (seeLassiter Annat [10]). It was not\n                                            necessary for the judge to apply theLadd v Marshalltest strictly,\n                                            particularly the first condition thereof,viz, the condition that the\n                                            further evidence sought to be adduced could not have\n                                            been obtained with reasonable diligence for use at the\n                                            trial (seeLassiter Annat\n                                            [24]).It was added inWBG Network (S) Pte Ltd v Sunny Daisy\n                                                Ltd[2007] 1 SLR(R) 1133\n                                                (“WBG\n                                                Network”)that in an appeal before a\n                                            judge in chambers where the hearing at first instance\n                                            did not possess the characteristics of a trial, the\n                                            party seeking leave to adduce further evidence might\n                                            still have to persuade the judge hearing the appeal that\n                                            he had satisfied all three of the conditions set out inLadd v Marshall(“the Ladd v Marshall conditions”). This\n                                            was because the judge was “entitled, though not\n                                            obliged, to employ the conditions of Ladd v\n                                                Marshall” [emphasis in\n                                                original](seeWBG\n                                                Networkat [14]).   8       It can be seen from the above that the wording\n                    of O 87A r 13(2) of the ROC (vis-à-visan appeal from a decision of the Patents Registrar to the High Court) is similar\n                    to that of O 87 r 4(2) (vis-à-visan\n                    appeal from a decision of the Trade Marks Registrar to the High Court), but is\n                    different from both the wording of O 55 r 6(2) (vis-à-visan appeal to the High Court under O 55) and that\n                    of O 57 r 13(2) (vis-à-visan appeal to\n                    the Court of Appeal under O 57). Notwithstanding this difference in\n                    wording, an appeal to the High Court under O 87A r 13 is similar to an\n                    appeal to the High Court under O 55 in so far as both types of appeals\n                    operate by way of rehearing (see, respectively, O 87A r 13(2) and\n                    O 55 r 2(1)). We must, however, point out that the prescribed regime\n                    for adducing further evidence under O 55 r 6(2) seems more liberal\n                    than the corresponding regime under O 87A r 13(2) as the former\n                    provides that “[t]he Court shall have power to require further evidence\n                    on questions of fact, and the evidence may be given in such manner as the Court\n                    may direct”. As for an appeal under O 57 from the High Court to the\n                    Court of Appealvis-à-visa decision given after a\n                    trial or hearing of any cause or matter on the merits, pursuant to O 57\n                    r 13(2), further evidence can only be admitted on “special\n                    grounds”, a condition not specified in O 87A r 13(2). Here, we\n                    must add that s 37(1) of the Supreme Court of Judicature Act (Cap 322,\n                    2007 Rev Ed) provides that an appeal from the High Court to the Court of\n                    Appeal “shall be by way of rehearing”; this same provision also\n                    appears in O 57 r 3(1) of the ROC. 9       At [67] of the High Court GD, the Judge, citingSingapore Court Practice 2009(Jeffrey\n                    Pinsler SC gen ed) (LexisNexis, 2009) at para 87A/13/2, stated that\n                    the term “rehearing” in relation to O 87 of the ROC (which,\n                    as mentioned earlier, concerns trade marks) was not to be understood as\n                    referring to a fullde novorehearing of evidence;\n                    in so ruling, the Judge drew a distinction between an appeal under O 87\n                    r 4 and an appeal under O 55. The Judge (likewise at [67] of the High\n                    Court GD) endorsed the analysis inMediacorp News Pte Ltd v\n                        Astro All Asia Networks plc[2009] 4 SLR(R) 496 andValentino Globe BV v Pacific Rim Industries\n                        Inc[2009] 4 SLR(R) 577 that “a\n                    ‘rehearing’ under O 87 r 4 [of the] ROC [was] similar to\n                    that under O 57 r 13 [of the] ROC (ie,\n                    an appeal from [the] High Court to the Court of Appeal)”. He also pointed\n                    out (at [68] of the High Court GD) that: The proceedings before the Tribunal were akin to a full trial with oral\n                        evidence having been adduced and cross-examination having taken place.\n                        … The statutory framework of the Patents Act [(Cap 221,\n                        2005 Rev Ed)] read with O 87A [of the] ROC suggests that the\n                        Tribunal is the proper forum for the taking of evidence and that the High\n                        Court sitting in its appellate capacity does not have unbridled powers to\n                        introduce fresh evidence after a decision has been rendered by the\n                        Tribunal. 10     The above reasoning of the Judge is logical.\n                    However, the problem with treating O 87 r 4(2) and, likewise,\n                    O 87A r 13(2) as being “akin to” (see [69] of the High\n                    Court GD) O 57 r 13(2) is that the latter requires the presence of\n                    “special grounds” before leave may be granted to adduce further\n                    evidence. This requirement is absent from both O 87A r 13(2) and\n                    O 87 r 4(2). Since the wording of O 87A r 13(2) and that of\n                    O 87 r 4(2) are not the same as the wording of O 55 r 6(2)\n                    and that of O 57 r 13(2), we do not think it would be appropriate to\n                    apply the rules for construing the latter two provisions (ie, O 55 r 6(2) and O 57 r 13(2)) when\n                    construing the former provisions (ie, O 87A\n                    r 13(2) and O 87 r 4(2)). While comparisons may be made between\n                    O 87A r 13(2)/O 87 r 4(2) and O 55\n                    r 6(2)/O 57 r 13(2), one should not lose sight of the basic\n                    difference in the various rules. It stands to reason that the ROC prescribed a\n                    separate set of rules, with different wording, for patent proceedings and trade\n                    mark proceedings because of their special nature. As noted by Laddie J inHunt-Wesson Inc’s Trade Mark Application[1996] RPC 233 (“Hunt-Wesson”) at 241: InLaddv.Marshallthe court was concerned with private litigation\n                        between two parties. If one of them failed to produce evidence which was\n                        relevant and helpful until too late, only it would suffer the consequences.\n                        However that is not the case here. An opposition [to the registration of a\n                        trade mark] may determine whether or not a new statutory monopoly, affecting\n                        all traders in the country, is to be created. Refusing permission to an\n                        opponent who files evidence late affects not only him but also may penalise\n                        the rest of the trade. This is an important difference between patent/trade mark proceedings\n                    and a normal private litigation between two individuals. Therefore, the\n                    considerations which are relevant in determining whether to grant leave for\n                    further evidence to be admitted in an appeal to the High Court from a decision\n                    of the Patents Registrar or a decision of the Trade Marks Registrar should be\n                    examined bearing in mind the objectives of the Patents Act (Cap 221,\n                    2005 Rev Ed) and the Trade Marks Act (Cap 332, 2005 Rev Ed)\n                    respectively.",
        "The appropriate test to be used": "11     What test, then, should the court apply when\n                    deciding whether or not to allow further evidence to be adduced pursuant to\n                    O 87A r 13(2) of the ROC? Undoubtedly, theLadd v\n                        Marshallconditions – namely, the further evidence sought\n                    to be adduced: (a) must not have been obtainable with reasonable diligence\n                    for use at the trial; (b) must be such that, if given, would probably have\n                    an important influence on the result of the case, although it need not be\n                    decisive; and (c) must be apparently credible, although it need not be\n                    incontrovertible – are useful. This is also implicit in these remarks of\n                    the Judge (at [74] of the High Court GD): I am of the view thatLadd v Marshallshould\n                        apply where leave is sought to adduce further evidence, albeit with\n                        appropriate modifications if the nature of the appeal and the factual matrix\n                        of the case so require. 12     The problem lies in determining how theLadd v Marshallconditions should apply in a\n                    proceeding such as the present and what modifications (if any) should be made.\n                    As mentioned at[8]above, an appeal from a\n                    decision of the Patents Registrar to the High Court is by way of rehearing (see\n                    O 87A r 13(2)), so too is an appeal from the High Court to the Court\n                    of Appeal (see O 57 r 3(1)). To this extent, there is similarity\n                    between these two types of appeals. Before proceeding further with our analysis,\n                    we should first address the meaning of the expression “by way of\n                    rehearing” in O 57 r 3(1). Here, we would endorse what the\n                    authors ofSingapore Civil Procedure 2007(G P Selvam chief ed) (Sweet & Maxwell Asia, 2007) state at\n                    para 57/3/1 in commenting on O 57 r 3(1): These words [ie, “by way of\n                        rehearing”] do not mean that the witnesses are heard afresh. They\n                        indicate [that] the appeal is not limited to a consideration [of] whether\n                        the misdirection, misperception of evidence or other alleged defect in the\n                        trial has taken place, so that a new trial should be ordered. They indicate\n                        that the court considers (so far as may be relevant) the whole of the\n                        evidence given in the court below and the whole course of the trial. However, it does not follow that this similarity between O 87A\n                    r 13(2) and O 57 r 3(1) (in terms of the use of the expression\n                    “by way of rehearing”) alone entails that the test established by\n                    case law for adducing further evidence under O 57 r 13(2) (ie, theLadd v Marshalltest) should be applied strictly in relation to O 87A r 13(2). This is\n                    because O 57 r 13(2) prescribes that, in the case of an appeal to the\n                    Court of Appeal from a judgment given after a trial or hearing of any cause or\n                    matter on the merits, leave to adduce further evidence should only be given on\n                    “special grounds”, a requirement which (as mentioned at[10]above) is missing from O 87A\n                    r 13(2). The requirement of “special grounds” in O 57\n                    r 13(2) must obviously be given effect to, hence the application of theLadd v Marshallconditions. 13     We should point out that what we have just\n                    said in the preceding paragraph about the difference between an appeal from a\n                    decision of the Patents Registrar to the High Court under O 87A r 13\n                    and an appeal from the High Court to the Court of Appeal under O 57 isnotto be taken as a suggestion that the test\n                    for adducing further evidence in an appeal under O 87A r 13 is akin to\n                    the corresponding testvis-à-visan appeal from a\n                    lower court (other than a subordinate court), tribunal or person to the High\n                    Court under O 55. Apart from the fact that the wording of O 87A\n                    r 13(2) is different from that of O 55 r 6(2), one must also bear\n                    in mind the special nature of patent proceedings (and also trade mark\n                    proceedings, where O 87 r 4(2) is concerned (see[10]above)). It seems to us that it would not be\n                    profitable to interpret O 87A r 13(2) by making a literal comparison\n                    with either O 55 r 6(2) or O 57 r 13(2). Instead, the\n                    starting point must be to look at O 87A r 13(2) itself. On the face of\n                    it, this provision gives the court an unfettered discretion to allow further\n                    evidence to be adduced as it does not spell out the circumstances in which the\n                    court may grant leave in this regard; neither does it set out any limitation or\n                    restriction on how the discretion to allow further evidence should be exercised\n                    by the court. 14     The Judge, having reviewed the decisions inWBG Network,Lassiter\n                        Ann,Ladd v Marshall,Ang Leng Hock v Leo Ee Ah[2004] 2 SLR(R) 361\n                    andWUNDERKIND Trade Mark[2002] RPC 45,\n                    came to the view (at [69] of the High Court GD) that: [B]y contrasting the language employed by different rules concerning\n                        adduction of further evidence under [the] ROC and taking into account the\n                        characteristics of a hearing before the [Patents Registrar], it [can] be\n                        seen that the nature of an appeal under O 87A r 13(2) [of the] ROC\n                        is akin to that [of an appeal] from the High Court to the Court of Appeal\n                        under O 57 [of the] ROC. One factor which greatly influenced the Judge in equating O 87A\n                    r 13(2) with O 57 r 13(2) was the consideration that proceedings\n                    before the Patents Registrar were “akin to a full trial with oral\n                    evidence [being] adduced and cross-examination [taking] place” (see [68]\n                    of the High Court GD (also reproduced at[9]above)). This entails that each party in a proceeding before the Patents\n                    Registrar must put its entire case before the Patents Registrar. It would be\n                    highly undesirable to freely permit parties, after the Patents Registrar has\n                    decided a matter, to adduce further evidence in an appeal from the Patents\n                    Registrar’s decision to the High Court. This would render the proceedings\n                    before the Patents Registrar highly inefficient. Up to this point, the logic\n                    behind treating an appeal under O 87A r 13 as “akin to”\n                        (per[69] of the High Court GD) an appeal\n                    under O 57 cannot be assailed. But, what still remains to be taken into\n                    reckoning is the special character of a registered patent. A patent will affect\n                    not only the parties to the particular patent proceeding in question, but also\n                    everyone else. The proprietor of a patent enjoys a monopoly within the\n                    jurisdiction. Like trade mark proceedings (and see, in this regard, the passage\n                    fromHunt-Wessonat 241 quoted at[10]above), patent proceedings have repercussions\n                    on the market at large: they concern the state of the patents register, which\n                    undoubtedly affects the public’s interest. 15     That said, while the court ought to bear in\n                    mind the special character of patent proceedings, and notwithstanding the\n                    wording of O 87A r 13(2) (which seems to accord to the court an\n                    apparently unfettered discretion to allow further evidence to be adduced in an\n                    appeal under O 87A r 13), it is also important that the discretionary\n                    power in O 87A r 13(2) is exercised in a principled manner so that\n                    there will be some certainty as to how this provision is to be applied whilst,\n                    at the same time, meeting the ends of justice in specific cases. We do not think\n                    it is feasible or desirable to lay down any rigid test for the exercise of this\n                    discretion other than to identify the factors or considerations which the court\n                    should take into account in deciding whether or not to allow further evidence to\n                    be adduced pursuant to O 87A r 13(2). 16     At this juncture, it is appropriate for us to\n                    again refer toHunt-Wesson, a case concerning an\n                    appeal against the dismissal of an opposition to a trade mark application\n                    registration. There, Laddie J first observed that the appeal before him was\n                    a rehearing, and then said (at 241–242): In my view the more appropriate course to adopt [as opposed to simply\n                        applying theLadd v Marshalltest] … is\n                        to look at all the circumstances, including those factors set out inLaddv.Marshalland to decide whether on the particular facts the\n                        undoubted power of the court to admit fresh evidence should be exercised in\n                        favour of doing so. After reviewing various precedents (which, he noted, did not offer a\n                    uniform approach), Laddie J (at 242) proffered the following factors as\n                    examples of the considerations relevant to the exercise of the court’s\n                    discretion to allow further evidence: 1.    Whether the evidence could have been filed earlier\n                            and, if so, how much earlier. 2.    If [the evidence] could have been [filed earlier],\n                            what explanation for the late filing has been offered to explain the\n                            delay. 3.    The nature of the [trade] mark. 4.    The nature of the objections to it. 5.    The potential significance of the new\n                            evidence. 6.    Whether or not the other side will be significantly\n                            prejudiced by the admission of the evidence in a way which cannot be\n                            compensated,e.g. by an order for\n                            costs. 7.    The desirability of avoiding multiplicity of\n                            proceedings. 8.    The public interest in not admitting onto the\n                            register invalid [trade] marks. The factors enumerated by Laddie J were approved by the\n                    English Court of Appeal as being relevant in the case ofE I Dupont de Nemours & Co v S T Dupont[2006] 1 WLR 2793 at [103]. 17     While the statutory provision governing the\n                    admission of further evidence inHunt-Wessonis\n                    not identical to the relevant statutory provision in the present case (ie, O 87A r 13(2) of the ROC), one significant\n                    common factor between the two provisions is that they both do not prescribe how\n                    the court’s discretion should be exercised. For this reason, it seems to\n                    us that the factors listed by Laddie J, although enunciated in the context\n                    of trade mark proceedings, are useful guidelines in patent proceedings such as\n                    the present. The only point which we must emphasise is that the list of factors\n                    set out by Laddie J is not exhaustive. Ultimately, in each case, the court\n                    must decide, based on the facts of the particular case at hand, whether it is\n                    just to admit the further evidence in question, bearing in mind also the\n                    public’s interest.",
        "Conduct of the appellant": "",
        "Circumstances relating to the Interlocutory Application": "18     At this juncture, we think it appropriate to\n                    scrutinise how the Interlocutory Application was presented to the court by the\n                    appellant. 19     As mentioned at[2]above, on 3 November 2009, the Tribunal delivered its\n                    decision revoking the Patent. On 15 December 2009, the appellant filed\n                    OS 1418/2009 to challenge the Tribunal’s decision. On 15 January\n                    2010, the appellant filed Summons No 234 of 2010 (viz, the Interlocutory Application) for leave to adduce\n                    “evidence of and relating to a repeat of an experiment described in prior\n                    art reference D4a [ie, the Experiment as defined\n                    at[2]above]”.[note: 2]The Interlocutory Application was\n                    made on the basis that the appellant had not conducted the Experiment yet, but\n                    wanted to do so. This is borne out by the supporting affidavit for the\n                    Interlocutory Application, which stated as follows:[note: 3] We [ie, the appellant’s solicitors]\n                        have been instructed that the [appellant] wishes to adduce evidence of and\n                        relating to a repeat of an experiment described in prior art reference D4a\n                            [ie, the Experiment]. In this regard, we\n                        have been instructed that the [appellant]wishes to\n                            conductthe said experiment … and to adduce evidence\n                        of and relating to the same. [emphasis added] In other words, at the time the Interlocutory Application was filed,\n                    it was presented as an application for leave to be granted to the appellant to\n                    conduct the Experiment and, subsequently, submit the results thereof to the\n                    court for the purposes of the HC Appeal. 20     That the above was the manner in which the\n                    Interlocutory Application was presented to the court is also evident from the\n                    proceedings at the hearing of the application on 12 March 2010. At that\n                    hearing, counsel for the appellant told the Judge that “[the appellant]\n                    ha[d] not done the [E]xperiment yet[;] … [it was] asking for six weeks\n                    [to] present the [E]xperiment … to the Court”.[note: 4]The purpose of the Interlocutory\n                    Application, as understood by the Judge, is set out at [9] of the High Court GD\n                    as follows: [T]he [appellant] took out Summons No 234 of 2010/Q … to apply\n                        for leave to conduct the [E]xperiment … and to adduce evidence of and\n                        relating to the same … 21     On 19 March 2010, one week after the\n                    Judge dismissed the Interlocutory Application, the appellant’s solicitors\n                    wrote in to the court requesting for leave to make further arguments before the\n                    Judge. In the letter, the appellant’s solicitors informed the court that\n                    right after the hearing of the Interlocutory Application on 12 March 2010,\n                    the appellant told them that it hadalready\n                        conductedthe Experiment and that the results obtained revealed\n                    the D4a Claim to be inaccurate. The letter also stated that the results\n                    allegedly showed that the oil produced from the Experiment had an ARA content of\n                    less than 50%,ie, less than the ARA content of\n                    72.9% alleged in the D4a Claim. The Judge declined the request for leave to make\n                    further arguments. 22     In the present appeal, at the time the appeal\n                    was filed, the Interlocutory Application was likewise presented to this court on\n                    the basis that the appellant had already conducted the Experiment, and that what\n                    the appellant wanted was leave to adduce the results of the Experiment as\n                    evidence in the HC Appeal. This is evident from the following paragraphs of the\n                    appellant’s written case (dated 10 June 2010) for the present appeal\n                    (“the Appellant’s Case”): 40.    After the hearing of the [Interlocutory\n                            Application], the [a]ppellant requested [for leave to make] further\n                            arguments and informed the Court that, after the date of the hearing,\n                            the [a]ppellant had already conducted a repeat of [the Experiment] and\n                            had obtained results of great significance. … 42.    With respect, the [a]ppellant submits that the\n                            … Judge appeared to pay more attention to the timing of this\n                            request for further arguments rather than the hard facts of the\n                            experimental data, such data being quintessential to the issues in the\n                            HC Appeal. 43.    … It was only after the hearing [of the\n                            Interlocutory Application] that the [a]ppellant came into possession of\n                            the results [of the Experiment] and only at the time of its request for\n                            further arguments could the [a]ppellant then enlighten the Court as to\n                            the relevance of the results and their important influence on the\n                            outcome of the HC Appeal. … In this regard, para 53 of the Appellant’s Case is also\n                    relevant: In response to the [r]espondent’s assertions that there was no\n                        report or result of the alleged experiment,the\n                            [a]ppellant is in a position to provide these reports to the\n                            [r]espondent as part of the evidencethat will be considered\n                        in the HC Appeal and the [a]ppellant confirms that the manner in which its\n                        experts measured the ARA (as will be described in their declarations) is\n                        consistent with what would have been done by a skilled person. The\n                        [r]espondent’s experts can then properly verify the results at [their]\n                        leisure. Notwithstanding the above, the [a]ppellant submits that the\n                        [r]espondent’s experts are not the arbiters of the credibility of the\n                        experimental data and cannot prejudge the same, this being a matter rightly\n                        falling within the dominion of the High Court. [emphasis added] 23     More significantly, in the Appellant’s\n                    Case (at paras 55–58), it was revealed for the first time that the\n                    appellant had suspicions as to the accuracy of the D4a Claim after becoming\n                    aware, sometime in the fourth quarter of 2009 (ie,\n                    after the hearing before the Tribunal), that an entity known as\n                    “DSM” (whose full name has not been disclosed by the appellant)\n                    had carried out an experiment similar to the Experiment and had filed the\n                    results which it obtained (“the DSM results”) with the European\n                    Patent Office on 6 October 2009. The Judge was not informed of this\n                    catalytic factor. 24     During the hearing before this court on\n                    20 August 2010, the appellant seemed to shift its position yet again. At\n                    that hearing, the appellant sought leave for an independent expert to conduct\n                    the Experiment and then submit the results obtained to the court. Nothing was\n                    said about producing the results of the Experiment, which the appellant claimed\n                    it had already conducted. In other words, it appears that by the time this\n                    appeal was heard, the appellant no longer wanted to proceed with the\n                    Interlocutory Application based on the premise underlying the application as\n                    presented in the Appellant’s Case, namely, the premise that the appellant\n                    had already conducted the Experiment and was seeking leave only to produce the\n                    results obtained, which would show that the D4a Claim was inaccurate (see[22]above). Why was that so? Was the\n                    appellant, at the time this appeal was heard, still trying to find more\n                    favourable evidence? 25     In the light of what has been stated at[18]–[24]above, we will now summarise the matters which give us\n                    cause for concern. First, why did the appellant not inform the Judge, at the\n                    hearing on 12 March 2010, that it had already carried out the Experiment\n                    and was seeking leave only to adduce the results obtained as evidence in the HC\n                    Appeal? As a result of this omission, the Judge was left with the impression\n                    that the Interlocutory Application was an application for leave tobothcarry out the Experimentandadduce the results obtained as evidence in the HC\n                    Appeal. 26     Second, why did the appellant not tell the\n                    Judge about the catalytic factor mentioned at[23]above? It appears to us that if the filing of the DSM\n                    results with the European Patent Office on 6 October 2009 was indeed the\n                    event which aroused the appellant’s suspicions as to the accuracy of the\n                    D4a Claim, that fact would have been relevant for the purposes of explaining, in\n                    part, why the Interlocutory Application had to be made. By its own submission,\n                    the appellant was aware of the DSM results as early as 16 November\n                        2009.[note: 5]The appellant did not,\n                    however, make the Interlocutory Application forthwith, but instead waited until\n                    15 January 2010 before doing so. No explanation was given by the appellant\n                    for this delay. Now, what is even more baffling is that the appellant offered\n                    another reason as to why it made the Interlocutory Application only on\n                    15 January 2010, namely: the appellant stated that it was only after the\n                    cross-examination of one of the respondent’s expert witnesses,\n                    Dr William R Barclay (“Dr Barclay”), during the\n                    hearing before the Tribunal, which cross-examination revealed that\n                    Dr Barclay had not personally conducted the Experiment, that the idea of\n                    conducting the Experiment crossed its (the appellant’s) mind. This\n                    alternative explanation did not find favour with the Judge, who commented in the\n                    High Court GD at [75] as follows: The [appellant]’s position that the necessity of conducting the\n                        [E]xperiment only arose during cross-examination did not explain why the\n                        application to adduce fresh evidence should only take place at the appeal\n                        stage [ie, at the stage of the HC Appeal]. The\n                        [appellant]’s inaction over the period between 12 February 2009\n                            [viz, the day on which the hearing before\n                        the Tribunal ended] to 3 November 2009 [viz, the date on which the Tribunal’s Judgment was\n                        released] shows a lack of due diligence in securing all relevant evidence\n                        before the Tribunal. We cannot help but wonder whether this allegation by the appellant\n                        (viz, that the filing of the DSM results with\n                    the European Patent Office prompted its suspicions as to the accuracy of the D4a\n                    Claim) was an afterthought. 27     Third, the appellant was rather coy in\n                    disclosing key information and evidence, such as the following: (a)     the results of the Experiment (which\n                        the appellant claimed it had already conducted), evidence that the appellant\n                        had indeed conducted the Experiment, as well as evidence on when and how the\n                        Experiment was carried out; and (b)     copies of any documents relating to the filing of the DSM\n                        results with the European Patent Office and/or the results themselves (here,\n                        we note that although the appellant claims that DSM provided it with a copy\n                        of the DSM results as filed with the European Patent Office, the appellant\n                        has chosen not to produce those results to the court). 28     In our view, the foregoing matters clearly\n                    show not only a lack of forthrightness on the part of the appellantvis-à-visthe court, but also a failure by the appellant\n                    to exercise reasonable diligence in presenting its case both before the Tribunal\n                    and before the Judge. Worse, the aforesaid matters made us doubt whether the\n                    appellant had indeed already carried out the Experiment as it claimed and\n                    whether the filing of the DSM results with the European Patent Office was truly\n                    the catalytic factor which led to the appellant’s decision to challenge\n                    the D4a Claim. In short, the way in which the appellant presented the\n                    circumstances surrounding and its reasons for making the Interlocutory\n                    Application left us unconvinced that the appellant had genuine reasons to doubt\n                    the accuracy of the D4a Claim.",
        "Acceptance of prior art at face value": "29     The appellant also made the assertion before\n                    us that it was the usual practice to accept the claims of prior art at face\n                    value. To this, we would make two observations. First, no evidence of this\n                    alleged practice has been tendered to the court; this practice is only a bare\n                    claim on the part of the appellant. Second, we find it strange that in the face\n                    of the respondent’s application to strike out the Patent on the basis of\n                    prior art, the appellant was content to simply accept the claims of the prior\n                    art cited by the respondent. Be that as it may, and even assuming that it is\n                    indeed the usual practice to accept the claims of prior art at face value, it\n                    appears to us that this alleged practice is only part of the reason why the\n                    appellant did not challenge the D4a Claim earlier. In this regard, the\n                    explanation given by the appellant’s counsel to the Judge at the hearing\n                    on 12 March 2010 is telling – namely, the appellant did not conduct\n                    the Experiment (with a view to challenging the accuracy of the D4a Claim)\n                    earlier because it was confident that it had distinguished D4a from the\n                        Patent.[note: 6]It appears that it was only after the\n                    adverse ruling by the Tribunal and after realising that D4a was one of the\n                    reasons for that ruling that the appellant sought to cast doubt (or search for\n                    some evidence which could cast doubt) on the accuracy of the D4a\n                Claim.",
        "Application of the relevant guidelines to the facts of this\n                case": "",
        "TheLadd v Marshallconditions": "30     While we are of the view that theLadd v Marshallconditions should not be applied rigidly\n                    to an application for leave to adduce further evidence in an appeal from a\n                    decision of the Patents Registrar to the High Court and that there is a need to\n                    also consider other factors (as listed at[16]above) where applicable, we think it is nevertheless useful\n                    to see to what extent this case satisfies theLadd v\n                        Marshallconditions (which, it should be observed, are consistent\n                    with the other factors just mentioned). 31     It seems to us clear that the appellant has\n                    not fulfilled the first of theLadd v Marshallconditions,viz, the condition that the further\n                    evidence sought to be adduced could not have been obtained with reasonable\n                    diligence for use at the trial. If the appellant had wanted to, it could have\n                    carried out the Experiment to verify the D4a Claim prior to the hearing before\n                    the Tribunal. Here, we note the possible argument that, perhaps, the appellant\n                    should not be faulted too much for not challenging D4a (by carrying out the\n                    Experiment) earlier: the court should understand that people usually would not\n                    challenge valid patents, which are deemed to be authentic in their claims.\n                    Putting it another way, it may be argued (in the appellant’s favour) that\n                    a reasonable person might not have thought it necessary to challenge a valid\n                    patent (in this case, D4a), and, without challenging D4a, the Alleged Further\n                    Evidence (as defined at[2]above) would not\n                    have been available for use in the proceedings before the Tribunal. However, for\n                    our present purposes, and without going into an examination of the usual\n                    practice with regard to the treatment of claims in a registered patent, there is\n                    a need for the court to examine the facts of this case more closely. It will be\n                    recalled (see[26]above) that the appellant\n                    stated that the thought of challenging the D4a Claim occurred to it only after\n                    the cross-examination of Dr Barclay; the appellant did not explain why it\n                    could not have made such a challenge earlier. As observed by the Judge at [75]\n                    of the High Court GD (and see also sub-para (c) of[5]above), the appellant should have taken one of the following\n                    steps: (a) conduct the Experiment prior to the hearing before the Tribunal;\n                    or (b) apply for leave during that hearing to conduct the Experiment and\n                    adduce the results obtained as evidence before the Tribunal; or (c) at the\n                    very least, apply sometime between the close of the hearing before the Tribunal\n                    and the date on which the Tribunal’s Judgment was released (a period of\n                    some eight months) for leave to conduct the Experiment and tender the results\n                    obtained to the Tribunal. In addition, the appellant’s counsel admitted at\n                    the hearing before the Judge that the reason why the appellant did not conduct\n                    the Experiment earlier was because it was confident that it had distinguished\n                    D4a, which related to a skin cream, from the Patent, which related to infant\n                    formula (see[29]above). The\n                    appellant’s over-confidence and complacency appear to us to be the real\n                    reasons why the appellant did not carry out the Experiment earlier. These\n                    factors hardly give the appellant a reasonable excuse for failing to adduce the\n                    Alleged Further Evidence in the proceedings before the Tribunal. The decision\n                    not to carry out the Experiment earlier was a strategic move taken by the\n                    appellant, and it now has to live by its choice. We therefore find that the\n                    appellant has not satisfied the first of theLadd v\n                        Marshallconditions. 32     As for second of theLadd v\n                        Marshallconditions (viz, the\n                    condition that the further evidence sought to be adduced must have an important\n                    bearing on the result of the case, although it need not be decisive), the Judge\n                    felt that the Alleged Further Evidence would not have had such an impact. With\n                    respect, we do not agree with the Judge on this point. In our view, looking at\n                    the decision of the Tribunal, it seems quite clear that the Tribunal regarded\n                    D4a as being central to its decision. This appears from [215] of the\n                    Tribunal’s Judgment, where the Tribunal stated: In summary, notwithstanding some findings of novelty in some of the claims\n                        [set out in the Patent], we find that the main claims [lack inventive step],\n                        namely[,] claim 1 lacks inventive step given the teachings inD4a read with D7orD4a read with\n                            D10, claim 2 lacks inventive step given the teachings inD4a read with D5aorD4a read with D7, … and … claim 35 lacks\n                        inventive step given the teachings inD4a read with\n                            D5aorD4a read with D7. All\n                        the dependent claims fail as such and we find that the invention in the\n                        … Patent is not patentable. [underlining and emphasis in bold in\n                        original omitted; emphasis added in italics] 33     The Judge cited some of the respondent’s\n                    submissions which purportedly showed that “the Tribunal’s decision\n                    was that the Patent was also invalid in view of prior artother thanD4[a]” [emphasis in original] (see the High\n                    Court GD at [78]). With respect, a plain reading of the Tribunal’s\n                    Judgment (specifically, [152] and [156] thereof) clearly shows that the Tribunal\n                    did take into account D4a, read together with other instances of prior art cited\n                    by the respondent, in arriving at its decision.Prima\n                        facie, any evidence which allegedly casts doubt on the accuracy\n                    of the D4a Claim would have a significant impact on the outcome of the case.\n                    Accordingly, the second of theLadd v Marshallconditions seems to have been fulfilled. The Judge also went on to state (at\n                    [78] of the High Court GD) that “without enclosing any report or result\n                    of the … [E]xperiment, the [r]espondent’s experts would be in no\n                    position to verify the credibility of the alleged result”. It seems to us\n                    that this point is more germane to the third of theLadd v\n                        Marshallconditions, to which we now turn. 34     The third condition set out inLadd v Marshallis that the further evidence sought to\n                    be adduced must be apparently credible, although it need not be\n                    incontrovertible. As the Judge noted (see[33]above), the appellant did not disclose any report or\n                    document which would have revealed more about the Alleged Further Evidence. The\n                    appellant was also vague in its description of this evidence, and merely made\n                    the bare assertion that “after repeating [the Experiment], it was found\n                    that the oil produced by following [the Experiment] ha[d] an Arachidonic Acid\n                    (ARA) content oflessthan50%”[note: 7][underlining in original]. Further, as noted earlier (at sub-para (a) of[27]above), the appellant did not give\n                    details as to when it conducted the Experiment, how the Experiment was carried\n                    out and, significantly, the exact ARA content of the oil produced from the\n                    Experiment (in this regard, it was not good enough for the appellant to simply\n                    state that the oil produced had an ARA content of less than 50%). Another\n                    relevant factor is that although, according to the letter from the\n                    appellant’s solicitors to the court dated 19 March 2010 (see[4]above), the appellant hadalready conductedthe Experiment by the time the Judge\n                    heard the Interlocutory Application on 12 March 2010, the appellant\n                    nonetheless presented that application to the Judge as an application for\n                        (inter alia) leaveto\n                        conductthe Experiment (see[20]above). Equally perplexing is the question of why the\n                    appellant did not inform its counsel prior to the hearing on 12 March 2010\n                    that it had already conducted the Experiment and, instead, made this known only\n                    after the said hearing. In addition, as the Judge rightly pointed out (see [76]\n                    of the High Court GD), if the Experiment had indeed been conducted prior to the\n                    hearing of the Interlocutory Application as alleged, why did the appellant not\n                    file an affidavit setting out the findings obtained from the Experiment? Even\n                    more intriguing is the fact that, at the hearing before us, the appellant asked\n                    this court to appoint an independent expert to carry out the Experiment (see[24]above). For these reasons, we have\n                    serious doubts as to whether the appellant had indeed carried out the Experiment\n                    as it claimed and, even if it had done so, whether it had conducted the\n                    Experiment properly so as to obtain credible results. In this regard, we should\n                    mention in passing that the appellant does not appear to appreciate the\n                    importance of being absolutely forthright with the court when seeking the\n                    court’s indulgence. In the result, we hold that the appellant has not\n                    satisfied the third of theLadd v Marshallconditions. 35     As discussed earlier (see[15]above), theLadd v\n                        Marshalltest should not be prescribed as a strict test for the\n                    purposes of an application to adduce further evidence under O 87A\n                    r 13(2) of the ROC. Thus, even though the appellant has not satisfied theLadd v Marshalltest, it does not follow that\n                    the Interlocutory Application must necessarily fail. We also need to consider\n                    whether there are other compelling factors which justify granting the appellant\n                    leave to adduce the Alleged Further Evidence. In this regard, the other\n                    considerations stated by Laddie J inHunt-Wessonat 242 (see[16]above) are relevant.",
        "Other considerations": "36     In our view, given the circumstances of this\n                    case, aside from theLadd v Marshallconditions,\n                    the last two of the factors stated by Laddie J inHunt-Wessonat 242 also require consideration, namely: (a)     the desirability of avoiding\n                        multiplicity of proceedings; and (b)     the public’s interest, particularly the effect of\n                        the Patent on the market. 37Vis-à-visthe\n                    first of the aforesaid factors, what is special about trade mark proceedings and\n                    patent proceedings (as opposed to a normal civil litigation) is that even after\n                    an opposing party fails in its challenge to the registration or the validity of\n                    a trade mark or patent, there is nothing to prevent another party from later\n                    opposing the same trade mark or patent. Therefore, to avoid multiplicity of\n                    proceedings, the court may be more inclined to allow the first-mentioned\n                    opposing party to adduce the best evidence available and indulge that\n                    party’s request for leave to adduce further evidence even if the request\n                    is made at a late stage of the proceedings. However, this factor may not\n                    necessarily apply the other way round,viz, the\n                    court may not be similarly inclined to grant indulgence to a party who fails to\n                    obtain registration of a patent or trade mark, but who later seeks to adduce\n                    further evidence to bolster its alleged proprietary entitlement to register the\n                    patent or trade mark in question. This difference in treatment between the two\n                    scenarios is, arguably, not without justification. The first of theLadd v Marshallconditions is meant to discourage a\n                    party from putting forth its case in a piecemeal manner and to, in turn, punish\n                    the party wishing to adduce further evidence for its failure to adduce that\n                    evidence at the proper time. The party asserting a proprietary right in a patent\n                    or trade mark has the responsibility to put forth its entire case, including all\n                    relevant material in support thereof. If it fails to do so, it has only itself\n                    to blame. On the other hand, a party which opposes the registration of a patent\n                    or trade mark is, to a certain extent, doing a public service in terms of\n                    preventing unworthy inventions and products from monopolising the market. If an\n                    unworthy invention or product is permitted to remain on the patents register or\n                    the trade marks register, another interested party can subsequently challenge\n                    that same invention or product, thus engendering further\n                litigation. 38     Turning to the second factor on public\n                    interest mentioned at[36]above, we do not\n                    think that there is anything in the present case which favours the appellant. On\n                    the contrary, we find that the following submission by the respondent (viz, that allowing the Alleged Further Evidence to be\n                    adduced would cause unnecessary delay in the HC Appeal, which would in turn have\n                    repercussions on the market) has merit:[note: 8] [T]he public will be deprived of a more cost[-]effective and non-patented\n                        substitute during this period [ie, the period\n                        pending the resolution of the HC Appeal], not only from the [r]espondent but\n                        very possibly also from other market players who will most likely be\n                        withholding the sale of close substitutes pending the outcome of the HC\n                        Appeal. 39     Thus, there is nothing in the two factors\n                    highlighted at[36]above which would\n                    persuade us to exercise our discretion in favour of granting the appellant leave\n                    to adduce the Alleged Further Evidence. 40     Over and above all the considerations\n                    discussed above, and even assuming (for the purposes of the Interlocutory\n                    Application as presented to this courtat the hearing of this\n                        appeal(see[24]above)) that\n                    the results of the Experiment (as conducted by an independent expert) will turn\n                    out to be favourable to the appellant, adducing the Alleged Further Evidence at\n                    this late stage of the proceedings will be extremely prejudicial to the\n                    respondent. As submitted by the respondent:[note: 9] The time to challenge the [D4a Claim] was during the proceedings before\n                        the Tribunal, but no action was taken by the [a]ppellant despite the fact\n                        that [it has] been aware of the [D4a Claim] for at least the last four\n                        years. … Had the [a]ppellant submitted the Alleged [Further] Evidence\n                        during the proceedings before the Tribunal, the [r]espondent could have\n                        developed its evidence differently … The [r]espondent no longer has\n                        the opportunity to do so because the [a]ppellant is only now seeking to\n                        introduce the Alleged [Further] Evidence against D4a at this late stage.\n                        This prejudice to the [r]espondent is irremediable. In the circumstances of this case (and proceeding on the basis of the\n                    Interlocutory Application as it was presented to this court at the hearing of\n                    this appeal), if the court were to allow the appellant’s request at this\n                    time for the appointment of an independent expert to conduct the Experiment and\n                    present the results obtained to the court, the court, in order to act fairly,\n                    would also have to give the respondent substantial leeway to re-run such parts\n                    of its case as may be necessary. This would inevitably re-open matters already\n                    dealt with by the Tribunal, an outcome which the court can hardly countenance.\n                    We would hasten to add that not every application for leave to adduce further\n                    evidence in an appeal would result in such an eventuality if the application\n                    were granted: much would depend on the nature of the case at hand, the decision\n                    which is under appeal as well as the nature of the further evidence sought to be\n                    adduced.",
        "Conclusion": "41     To summarise, it seems to us that the\n                    Interlocutory Application, in its final form as presented to this court at the\n                    hearing of this appeal, is not so much an application for leave to adduce the\n                    Alleged Further Evidence in the HC Appeal, but, rather, an application for leave\n                    to adduce such further evidence in aid of the appellant’s case as the\n                    appellant may be able to find. The appellant does not appear to be certain what\n                    the results of the Experiment will be, but is only speculating that they will be\n                    favourable to it. The justice of the case also does not favour the appellant\n                    (see[40]above). Therefore, we affirm the\n                    Judge’s decision and decline to grant leave either for the appellant to\n                    adduce the Alleged Further Evidence in the HC Appeal (taking the Interlocutory\n                    Application as it was presented at the time it was filed and also as it was\n                    presented to the Judge), or for an independent expert to be appointed to carry\n                    out the Experiment and then submit his findings to the court (taking the\n                    Interlocutory Application in its final form as presented to this court at the\n                    hearing of this appeal). 42     This appeal is, therefore, dismissed with\n                    costs and the usual consequential orders.  [note: 1]See the Record of Appeal dated\n                                10 June 2010 at vol 3,\n                        p 140. [note: 2]See prayer 1 of the Interlocutory\n                            Application. [note: 3]See\n                                para 6 of the affidavit of Ms Lim Ming Hui Eunice filed on\n                                15 January 2010. [note: 4]See pp 2–3 of the certified transcript of the\n                                notes of evidence of the hearing before the Judge on 12 March\n                                2010 (“the Notes of\n                        Evidence”). [note: 5]See “Chronology of events relating to the\n                                Appellant’s application to file the Evidence” dated\n                                20 August 2010. [note: 6]See p 2 of the Notes of\n                        Evidence. [note: 7]See\n                                para 45 of the Appellant’s Case. [note: 8]See\n                                para 147 of the respondent’s written case filed on\n                                9 July 2010 (“the Respondent’s\n                                Case”). [note: 9]See\n                                para 146 of the Respondent’s\n                        Case."
    }
}