{
    "case_title": "Mühlbauer AG\n      v\n      Manufacturing Integration Technology Ltd",
    "ncitation": "[2010] SGCA 6",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Facts (including a description of the Patent)": "6       The Patent describes a machine for inspecting, picking up and placing\n                    electronic components onto printed circuit boards or tape and reel packaging.\n                    The Respondent’s “CAERUS” device is also a machine that\n                    facilitates the inspection and rotation of electronic components. 7       The 10 claims countenanced by the Patent are important, and they are as\n                    follows (see also Appendix A):[note: 1] 1.    Adeviceforchecking\n                                androtating electronic components, in particular flip\n                            chips, with a pivoting part attached to a pivoting point for rotating\n                            the electronic components, on the exterior of which part afirstpickup element is fixed for taking up a\n                            single electronic component from a substrate and keeping hold of it\n                            during a rotational movement of the part, characterized in that asecondpickup element is arranged\n                            externally on the partopposite the firstpickup element in relation to the pivotal point in such a way that in\n                            each case one pickup element is facing the substrate for each rotation\n                            of the part through 180º, and that in the parta\n                                through openingis arranged between the pickup elements\n                            in such a way that the through opening is facing the substrate for a\n                            rotation of the pivoting part through 90º or 270º. 2.    Device according to Claim 1, characterized in that the first\n                            pickup element is attached on a first projection and the second pickup\n                            element on a second projection of the part. 3.    Device according to Claim 2, characterized in that the through\n                            opening is developed between the projections as a through channel open\n                            on one long side. 4.    Device according to one of the preceding claims, characterized in that\n                            on a side of the pivoting part facing the substrate a first optical\n                            facility is arranged for optical checking of surfaces and correct\n                            positions of the electronic components arranged on the substrate before\n                            being picked up. 5.    Device according to Claim 4, characterizedin\n                                that the through opening is formed in such a way that it permits an\n                                optical connection between the first optical facility and an\n                                electronic component arranged on the substrate during a rotational\n                                movement of the pivoting part. 6.    Device according to one of the preceding claims, characterized by a\n                            second optical facility for checking a correct position of the rotated\n                            and deposited electronic component. 7.Methodfor checking and rotating\n                            electronic components, in particular flip chips, which are picked up\n                            individually from a sandwich of electronic components arranged on a\n                            substrate, by means of afirstpickup\n                            element arranged on a pivoting part and are deposited in a rotated\n                            position, the pivoting part being placeable between the substrate and a\n                            first optical facility for checking the surface and the correct position\n                            of a single component arranged on the substrate, characterized in thatduringa 180º rotation of the pivoting\n                            part a pickup by the first pickup element of a single electronic\n                            component arranged on the substrate,a check of a\n                                surface and the correct position ofafurtherelectronic component arranged on the substrate,by means of the optical facility and a through\n                                opening arranged in the pivoting part, adepositing ofthe electronic componentheld by the firstpickup element on a placing\n                            facilityaftera 180º rotation of the\n                            pivoting partand at the same time a further\n                                pickupof thefurtherindividual electronic component arranged on the substrate, by asecondpickup element arranged\n                            externally opposite the first pickup element on the pivoting part, areexecuted. 8.    Method according to Claim 7, characterized in that after the 180º\n                            rotation a 180º rotation going in theotherdirection is executed. 9.    Method according to Claim 7 or 8, characterized in that by means\n                            of a second optical facility, a correct position of the turned and\n                            deposited component is checked and adjusted during or after its\n                            transport. 10.    Method according to one of the claims 7 – 9, characterized\n                            in that the first optical facility is activated with a predefinable time\n                            delay after a rotation of the through opening into an optical connection\n                            line between the first optical facility and the electronic component\n                            still arranged on the substrate. [emphasis added] 8       Put simply, the Patent describes both adevice(Claims 1 through 6, with Claims 2 to 6 being dependent claims)andamethod(Claims 7 through 10, with Claims 8 to 10 being dependent claims) in\n                    which an optical inspection of a wafer chip, a pickup of a wafer chip, a\n                    turning-around and subsequent deposit of the wafer chip all occur within asingle180-degree rotation of atwo-headedpivoting part of the device. At the end of\n                    the 180-degree rotation, the device is primed to pick up the next wafer chip in\n                    line.The device alternates between clockwise and\n                        anti-clockwise 180-degree rotations of the\n                        pivoting pickup heads. The apparent ingenuity of this device (and\n                    method) lies inits circumventing the need for separate\n                        stages for optical inspection and pickup.By\n                        means of a through opening located transversely between the two pickup\n                        heads, the top-mounted camera inspects the wafer chip below on\n                    the substrate – the base material on which semiconductor devices are\n                    fabricated – while the pivoting part, picking up another wafer chip\n                    simultaneously, rotates through an angle of 90 or 270 degrees. As optical\n                    inspection and pickup areconcurrent,the cycle time is reduced, resulting in greater\n                        productivity.[note: 2] 9       It was previously thought that since both the camera and the pickup head had\n                    to be located directly over the electronic component to carry out their\n                    respective tasks (of determining the position/orientation of the component and\n                    picking it up after correcting for any offset, respectively), this method\n                    required the pickup head to move out of the line of sight of the camera before\n                    each and every optical inspection. This was time-consuming. The device and\n                    method countenanced in the Patent, however, overcame this difficulty with\n                    apparent efficiency as well as elegance. Indeed, as we shall see, it is crucial\n                    to the present appeal that: (a)     The Patent operates with two pickup heads – and two pickup heads\n                        only. (b)     The Patent alternates between clockwise and anti-clockwise 180-degree\n                        rotations of the pivoting pickup heads, thus enabling a through opening\n                        located transversely between the two pickup heads that (in turn) facilitates\n                        visual inspection of the electronic component below. It is also important to note that thecombined\n                        resultof (a)and(b) above –\n                    from the importantpracticalperspective –\n                    isa much improved overall throughput. This has,\n                    in turn, translated tosignificant commercial success as\n                        well– a point that was acknowledged by the Judge (see the\n                    GD at [44]), although he correctly pointed out that the commercial success of an\n                    invention “alone is not conclusive” as to whether the invention is\n                    novel and/or one involving an inventive step (see the GD at [47]). But we are\n                    running ahead of the story as these (as well as other) characteristics relating\n                    to the Patent will need to be compared with the relevant characteristics in the\n                    other patents mentioned below (see[11], and\n                    which are relied upon by the Respondent as forming part of the state of the art)\n                    in order to ascertain whether or not the Patent is new and/or involved an\n                    inventive step.",
        "The decision below": "10     After considering the evidence on both sides, in particular, the testimony of\n                    two expert witnesses, the Judge found (at [48] of the GD) that: … what the [Appellant] has succeeded in inventing is not that\n                        described in its patent claims … but a more efficient utilisation of\n                        two pick up heads (perhaps by decreasing the size of the rotating parts and\n                        improving on the vacuum suction) thereby enhancing the speed of the\n                        throughput on its machine. He further commented (at [45] of the GD) that: [a]s time passes, with better equipment, throughput would naturally\n                        improve but there is no novelty or inventive step in this. 11     Chief amongst the Judge’s considerations was the fact that the Patent\n                    appeared to have been anticipated by four prior patents and a machine, as\n                    follows: (a)     Advanced Systems Automation Limited’s (“ASA”)\n                        Singapore patent No 104292 dated 30 September 2005, and which\n                        relates to a flip chip die bonder (“the\n                        ASA Patent”); (b)     Matsushita Electric Industrial Co’s United States\n                        patent No 5,839,187 dated 24 November 1998 (“the\n                        Matsushita Patent”); (c)     National Semiconductor Corporation’s United States patent\n                        No 6,364,089 B1 dated 2 April 2002 (“the National\n                        Semiconductor Patent”); (d)     Kabushiki Kaisha Shinkawa’s United States patent No 6,311,391\n                        B1 dated 6 November 2001 (“the Shinkawa Patent”);\n                        and (e)     ASA’s flip chip die bonder known as the AFC 800, which\n                        incorporates the ASA Patent (“the AFC 800”). A short note on terminology is in order at this particular juncture. A die is\n                    a small block of wafer, usually a semiconducting material, on which a given\n                    functional circuit is fabricated. “Die bonding” is the attachment\n                    of the semiconductor die either to its package or to some other substrate. The\n                    die is picked from a wafer table, aligned to a target pad on the substrate, and\n                    then permanently attached via means of a solder or epoxy bond. This process\n                    should be distinguished from that of “die sorting”, which merely\n                    involves the sorting of good and bad dies or chips on a wafer. 12     Preferring the opinion of the Respondent’s expert, Mr John Briar\n                    (“Mr Briar”), over that of the Appellant’s expert,\n                    Associate Professor Tay Meng Leong (“A/P Tay”), with\n                    respect to the state of the art as embodied in the patents and machine referred\n                    to in the preceding paragraph, the Judge found that the Patent failed on two of\n                    the three conditions governing patentable inventions in s 13(1) of the Act\n                    (as set out below at[15]), namely, that the\n                    invention must be new and must involve an inventive step. In arriving at this\n                    conclusion, the Judge was careful to highlight the fact that while Mr Briar had\n                    “extensive experience in flip chip packaging technology and equipment\n                    development for use in the semi-conductor industry” (the GD at [18]) and\n                    possessed “personal knowledge and experience of what the state of the art\n                    was at the material time” (the GD at [28]), A/P Tay was not in the\n                    semiconductor industry and was unfamiliar with flip chip machines prior to\n                    receiving his instructions from the Appellant. 13     The Judge also observed that the crux of the inventive concept in the Patent,viz, the “carrying out of vision\n                    inspection concurrently during the rotation of the pick up heads and via the\n                    through opening between the pick up heads”, was already disclosed in the\n                    state of the art. Specifically, he noted that (see the GD at [36]): [s]uch a concept was already disclosed in the ASA Patent’s two\n                        head system. Further, such a concept involving four pick up heads was also\n                        public knowledge and commonly known to a person skilled in the art,\n                        notwithstanding the narrower windows of vision available between each pair\n                        of heads. The vision inspection process in the Shinkawa Patent’s one\n                        head system … is also similar to the one contained in the\n                        [Appellant’s] patent. There can therefore be no inventive step in\n                        having two flipper heads, as further evidenced by the Matsushita Patent and\n                        the National Semiconductor Patent. 14     In the circumstances, therefore, the Patent was declared invalid and was\n                    accordingly revoked.",
        "The law on patentability": "",
        "Introduction": "15     In order for an invention to be a patentable one, it must satisfy the three\n                    conditions laid down in s 13(1) of the Act. These are that: (a)     the invention is new; (b)     it involves an inventive step; and (c)     it is capable of industrial application. The Respondent maintains on appeal that the Patent should be invalidated as it\n                    is lacking in both novelty as well as in an inventive step (viz, that conditions (a) and (b) above have not been\n                    satisfied).",
        "Novelty": "16     The conditions for novelty (or, utilising the statutory language, that the\n                    invention concerned is “new”) are set out in s 14 of the Act\n                    as follows: 14. —(1) An invention shall be\n                        taken to be new if it does not form part of the state of the art. (2) The state of the art in the case of an invention shall be taken\n                        to comprise all matter (whether a product, a process, information about\n                        either, or anything else) which has at any time before the priority date of\n                        that invention been made available to the public (whether in Singapore or\n                        elsewhere) by written or oral description, by use or in any other\n                        way. (3) The state of the art in the case of an invention to which an\n                        application for a patent or a patent relates shall be taken also to comprise\n                        matter contained in an application for another patent which was published on\n                        or after the priority date of that invention, if the following conditions\n                        are satisfied: (a) that matter was contained in\n                            the application for that other patent both as filed and as published;\n                            and (b) the priority date of that\n                            matter is earlier than that of the invention. … 17     In the English Court of Appeal decision ofThe General Tire\n                        & Rubber Company v The Firestone Tyre and Rubber Company Limited and\n                        Others[1972] RPC 457 (“General\n                        Tire”), Sachs LJ set out the test for determining the\n                    novelty in a patent under s 32(1)(e) of the Patents Act 1949\n                    (c 87) (UK) in the case of anticipation by prior publication as follows (at\n                    485–486): … the question whether the patentee’s claim is new for the\n                        purposes of section 32(1)(e) falls to be decided as a question of fact.\n                        If the prior inventor’s publication contains a clear description of,\n                        or clear instructions to do or make, something that would infringe the\n                        patentee’s claim if carried out after the grant of the\n                        patentee’s patent, the patentee’s claim will have been shown to\n                        lack the necessary novelty, that is to say, it will have been anticipated.\n                        The prior inventor, however, and the patentee may have approached the same\n                        device from different starting points and may for this reason, or it may be\n                        for other reasons, have so described their devices that it cannot be\n                        immediately discerned from a reading of the language which they have\n                        respectively used that they have discovered in truth the same device; butif carrying out the directions contained in the prior\n                            inventor’s publication will inevitably result in something being\n                            made or done which, if the patentee’s patent were valid, would\n                            constitute an infringement of the patentee’s claim, this\n                            circumstance demonstrates that the patentee’s claim has in fact\n                            been anticipated. …To anticipate the patentee’s claim the prior\n                            publication must contain clear and unmistakeable directions to do what\n                            the patentee claims to have invented … A signpost, however clear,\n                            upon the road to the patentee’s invention will not suffice. The\n                            prior inventor must be clearly shown to have planted his flag at the\n                            precise destination before the patentee. [emphasis added] In other words, in seeking to establish anticipation for the purposes of\n                    discounting (or even ruling out altogether) novelty, the directions contained in\n                    a prior publication (which constitutes part of the state of the art) must be so\n                    clear that following those directions mustinevitablylead to something that would, if the patentee’s\n                    patent were valid, infringe the patentee’s claim. Sachs LJ’s\n                    views were endorsed by this court inMerck & Co Inc v\n                        Pharmaforte Singapore Pte Ltd[2000] 2 SLR(R) 708\n                        (“Merck & Co Inc”) and inGenelabs Diagnostics Pte Ltd v Institut Pasteur and\n                        another[2000] 3 SLR(R) 530 (“Genelabs Diagnostics”) as well as by the Singapore High\n                    Court inDextra Asia Co Ltd and another v Mariwu Industrial\n                        Co (S) Pte Ltd and another suit[2006] 2 SLR(R) 154\n                        (“Dextra Asia Co Ltd”) (for\n                    related proceedings, seeMariwu Industrial Co (S) Pte Ltd v\n                        Dextra Asia Co Ltd and another[2006] 4 SLR(R) 807 andDextra Asia Co Ltd and another v Mariwu Industrial Co (S)\n                        Pte Ltd[2007] 3 SLR(R) 29). It has further been held inGenelabs Diagnosticsthat the prior\n                    publication must “not onlyidentify the\n                    subject matter of the claim in the later patent” [emphasis added] but\n                    must also be an “enabling disclosure” (at [24]). This means that\n                    an invention “would be anticipated by a piece of prior art if the\n                    teachings disclosed in this prior artare sufficiently clear\n                        and complete to allow the skilled addressee to make the\n                    invention” [emphasis added] (see Ng-Loy Wee Loon inLaw of Intellectual Property of Singapore(Sweet & Maxwell Asia, Rev Ed, 2009) at para 30.1.38 as well\n                    asSmithKline Beecham Plc’s (Paroxetine\n                        Methanesulfonate) Patent[2006] RPC 10, where the House of Lords\n                    clarified that the concepts of disclosure and enablement are distinct). 18     And, in the Singapore High Court decision ofTrek\n                        Technology (Singapore) Pte Ltd v FE Global Electronics Pte Ltd and others\n                        and other suits[2005] 3 SLR(R) 389 (“Trek Technology”) (affirmed by this court inFE Global Electronics Pte Ltd and others v Trek\n                        Technology (Singapore) Pte Ltd and another appeal[2006]\n                    1 SLR(R) 874 (“FE Global\n                    Electronics”)), Lai Kew Chai J laid down the following\n                    principles for determining anticipation by the prior art (at [87]): (a)    The prior art documents (which contain patent specifications and other\n                            literature) must beconstrued as if the court had to\n                                construe it at the date of publication, to the exclusion\n                            of information subsequently discovered by a reader skilled in the art to\n                            which they relate having regard to the state of knowledge in such art at\n                            the relevant date. Anex post factoanalysis is not appropriate. Subsequent events or matters must be\n                            disregarded. (General Tire & Rubber Company v The\n                                Firestone Tyre and Rubber Company Limited[1972]\n                            RPC 457 (“General\n                            Tire”) at 485;Minnesota Mining\n                                & Manufacturing Co v Bondina Ltd[1973] RPC 491\n                            at 522); (b)The court must not combine or\n                                “mosaic” disparate pieces of prior art in order to\n                                arrive at the invention in question. Each document should be\n                                considered separately;and (c)    The reader skilled in such art isa person of\n                                competent but average technical skill, who is\n                                unimaginative. [emphasis added] In conjunction with the observations of Sachs LJ inGeneral Tire, the principles set out by Lai J above are\n                    instructive in resolving the question of fact as to whether or not an invention\n                    may be considered “new” for the purposes of s 14 of the\n                    Act.",
        "Inventive step": "19     Section 15 of the Act defines an “inventive step” by\n                    stating that “[a]n invention shall be taken to involve an inventive step\n                    if it is not obvious to a person skilled in the art”. In the Singapore\n                    High Court decision ofNg Kok Cheng v Chua Say\n                        Tiong[2001] 2 SLR(R) 326 (“Ng Kok\n                        Cheng”), Judith Prakash J observed as follows (at\n                    [16]): The English Court of Appeal had a useful discussion on the ideas of\n                        obviousness and inventive concept inMölnlycke AB v\n                            Procter & Gamble[1994] RPC 49. The judgment of the\n                        court given by the Vice-Chancellor, Sir Donald Nicholls referred to the\n                        UK Patents Act 1977 (“the UK Act”) on which our own\n                        Patents Act is substantially based and stated that the UK Act was a\n                        statutory code which was passed to establish a new law of patents, to amend\n                        the law and to give effect to certain international conventions, most\n                        importantly, the European Patent Convention of 1973 (at p 111). The\n                        following passages from the judgment are instructive: … We do not consider that it assists to ask whether ‘the\n                            patent discloses something sufficiently inventive to deserve the grant\n                            of a monopoly’. Nor is it useful to extract from older judgments\n                            expressions such as ‘that scintilla of invention necessary to\n                            support a patent’. The statute has laid down what the criterion is\n                            to be: it is a qualitative not a quantitative test … [at\n                            p 112 lines 40–49] The Act requires the court to make a finding of\n                                fact as to what was, at the priority date, included in the state of\n                                the art and then to find again as a fact, whether, having regard to\n                                that state of the art, the alleged inventive step would be obvious\n                                to a person skilled in the art. [at p 113 lines\n                            2–6] In applying the statutory criterion and making these findings the\n                            court will almost invariably require the assistance of expert evidence.The primary evidence will be that of properly\n                                qualified expert witnesses who will say whether or not in their\n                                opinions the relevant step would have been obvious to a skilled man\n                                having regard to the state of the art. All other evidence is\n                                secondary to that primary evidence. In the past,\n                            evidential criteria may have been useful to help elucidate the approach\n                            of the common law to the question of inventiveness. Now that there is a\n                            statutory definition, evidential criteria do not form part of the\n                            formulation of the question to be decided. [at p 113 lines\n                            8–15] … Although formulated with reference to the Patents Act 1949, the\n                            analysis of Oliver LJ inWindsurfing\n                                International v Tabur Marine[1985] RPC 59 at 73\n                            continues to provide assistance. There are four steps: (1)What is the inventive step said to be\n                                        involved in the patent in suit? (2)What was, at the priority date, the state of\n                                        the art (as statutorily defined) relevant to that\n                                        step? (3)In what respects does the step go beyond, or\n                                        differ from, that state of the art? (4)Having regard to such development or\n                                        difference, would the taking of the step be obvious to the\n                                        skilled man?[at p 115 lines\n                                    1–14] … The burden of proof is upon the person attacking\n                                the validity of the patent to show that no inventive step was\n                                involved. It is therefore for him to make out the case of\n                            obviousness and prove it by appropriate expert evidence. Accordingly in\n                            any given case it will be for that person to marshal and prove those\n                            aspects of the state of the art which he alleges make the relevant step\n                            obvious. The matter will come before the court on the basis of certain\n                            allegations which have to be used for the purposes of deciding upon the\n                            answer to the second and third questions posed above. [at p 115\n                            lines 21–25] [emphasis added] 20     The four-step test for inventiveness espoused in the English Court of Appeal\n                    decision ofWindsurfing International Inc v Tabur Marine\n                        (Great Britain) Ltd[1985] RPC 59 (“theWindsurfingtest”) provides a structured approach\n                    to resolving what would be an otherwise vague inquiry, and has been followed and\n                    applied in numerous cases, both foreign as well as domestic. As set out inTrek Technology(at [94]), theWindsurfingtest may be formulated as follows: (a)     Identify the inventive concept embodied in the patent in suit. (b)     The court then assumes the mantle of the normally skilled but\n                        unimaginative addressee in the art at the priority date, imputing to him\n                        what was, at that date, common general knowledge in the art in\n                        question. (c)     Identify what, if any, differences exist between the matter cited as being\n                        “known or used” and the alleged invention. (d)     The court then asks itself the question whether, viewed without any\n                        knowledge of the alleged invention, those differences constitute steps which\n                        would have been obvious to the skilled man or whether they require any\n                        degree of invention. It should be noted that the reference to “common general\n                    knowledge” in (b) above does itself raise difficulties which were noted\n                    by this court inFirst Currency Choice Pte Ltd v Main-Line\n                        Corporate Holdings Ltd and another appeal[2008] 1 SLR(R)\n                    335 (“First Currency Choice Pte\n                    Ltd”) at [38]–[41] (for related proceedings, see the\n                    Singapore High Court decisions ofMain-Line Corporate\n                        Holdings Ltd v Overseas Bank Ltd and another[2008] SGHC 55,Main-Line Corporate Holdings Ltd v United Overseas Bank\n                        Ltd and another (First Currency Choice Pte Ltd, third party)[2010] 1 SLR 189 andMain-Line Corporate Holdings Ltd v\n                        United Overseas Bank Ltd and another[2009] SGHC 212), but\n                    which do not arise in the context of the present appeal (cfalso the proposed solution proffered by Ng-Loy Wee Loon inLaw of Intellectual Property of Singaporeat\n                    para 30.1.47). It should also be noted that whilst the various criticisms\n                    of theWindsurfingtest itself were acknowledged\n                    by this court inFirst Currency Choice Pte Ltd,\n                    V K Rajah JA, who delivered the judgment of the court observed\n                    (at [44]) that “[n]onetheless, theWindsurfingtest … appears to be here to stay”.\n                    Indeed, Rajah JA was of the view that theWindsurfingtest could also prevent erroneousex post factoreasoning (see also[101]below). He also proceeded to add thus (at [44]): … When all is said and done, theWindsurfingapproach has its advantages. The first three\n                        steps of this test lay the ground work for the final question – which\n                        is ultimately the only critical question – namely: Is the alleged\n                        invention obvious? … As aptly pointed out by Neuberger J inDSM NV’s Patent[2001] RPC 35\n                        at [58]: By adopting the structured approach, one ensures that there is a\n                            measure of discipline, reasoning and method in one’s approach.\n                            Indeed, it helps to ensure that there is consistency of approach in\n                            different cases involving the issue of obviousness. However, Rajah JA also sought (bearing in mind the various criticisms of\n                    theWindsurfingtest) to bring some practical\n                    balance to this test by observing as follows (at [45]): Be that as it may, simplicity is certainly to be appreciated, and, in\n                        assessing the obviousness of an alleged invention, it may sometimes suffice\n                        in straightforward cases to refer to the test formulated by\n                        Lord Herschell in Vickers, Sons And Co, Limited v Siddell (1890)\n                        7 RPC 292, where he stated (at 304) that an invention lacked an\n                        inventive step if what was claimed was “so obvious that it would at\n                        once occur to anyone acquainted with the subject, and desirous of\n                        accomplishing the end”. Quite often, it is difficult, in practice, to\n                        break down the Windsurfing test … into its component parts. Thus,\n                        while the Windsurfing test remains a useful guide, it is no more than that.\n                        Above all, it should be borne in mind that the Windsurfing test is merely a\n                        manifestation of judicial inventiveness on how best to pragmatically\n                        interpret and elucidate the requirements of s 15 of the Act. 21     In so far as the concept of the “notional skilled person” is\n                    concerned, Rajah JA made the following observations inFirst Currency Choice Pte Ltd(at [28]): The notional skilled person with the common general\n                            knowledge of the art 28    As stated above, the “audience” whom the patentee is\n                            addressing is the person skilled in the art (perLord Hoffman inKirin-Amgen[[2005] RPC 9] at [33];FE Global Electronics[[2006] 1 SLR(R) 874]\n                            at [14]). As a general rule, the notional skilled person should be taken\n                            to be the workman or technician who is aware of everything encompassed\n                            in the state of the art and who has the skill to make routine workshop\n                            developments, but not to exercise inventive ingenuity or think laterally\n                                (perLaddie J inPfizer Ltd’s Patent[2001] FSR 16 at\n                            [62]–[63]). His level of skill will depend on the scope of the\n                            subject matter of the patent in question (seeDyson\n                                Appliances Ltd v Hoover Ltd[2001] RPC 26\n                                (“Dyson v Hoover”) at [30]). The notional\n                            skilled person is, thus, usually defined according to the qualities\n                            which he possesses. As stated inMcGhan Medical UK\n                                Limited v Nagor LimitedCase No CH 1999 1720\n                            (28 February 2001) at [23]–[24] and followed inNg Kok Cheng v Chua Say Tiong[2001]\n                            2 SLR(R) 326 at [21]: This notional person is deemed to possess the common general knowledge\n                            of the subject matter in question. It is through the eyes of the skilled\n                            addressee that the [p]atent will fall to be interpreted. And it is by\n                            the standards of this person that the question of inventive step is to\n                            be judged when this topic is addressed in the counterclaim. A patent is addressed to persons who are likely to have a practical\n                            interest in its subject matter or to act on the directions given in it\n                            for it to be put into practice.The addressee is\n                                deemed to be unimaginative and uninventive but is equipped\n                                nevertheless with a reasonable degree of intelligence and with a\n                                wish to make the directions in the patent work. The approach taken by the notional skilled person in construing the claims\n                        in a patent specification has been broadly described in the following\n                        practical terms (seeKirin-Amgen[[2005]\n                        RPC 9] at [33]): [H]e reads the specification on the assumption that its purpose is ...\n                            both to describe and to demarcate an invention – a practical idea\n                            which the patentee has had for a new product or process – and not\n                            to be a textbook in mathematics or chemistry or a shopping list of\n                            chemicals or hardware. It is this insight which lies at the heart of\n                            “purposive construction”. [emphasis added] For the purposes of steps (b) and (d) of theWindsurfingtest for obviousness (see[20]above), the court should therefore assume the mantle ofonlya skilled but unimaginative addressee.\n                    Care must be taken not to either go beyond or fall short of this rather nuanced\n                    standard as set out above.",
        "Patent construction": "22     The courts have consistently endorsed adopting a “purposive\n                    construction” of patent claims so as to determine the essential features\n                    of any particular invention. This approach received judicial affirmation in the\n                    seminal decision of the House of Lords inCatnic Components\n                        Limited and Another v Hill & Smith Limited[1982]\n                    RPC 183, where Lord Diplock observed as follows (at\n                    242–243): [A] patent specification is a unilateral statement by the patentee, in\n                        words of his own choosing, addressed to those likely to have a practical\n                        interest in the subject matter of his invention (i.e. “skilled in the\n                        art”), by which he informs them [of] what he claims to be the\n                        essential features of the new product or process for which the letters\n                        patent grant him a monopoly. It is those novel features only that he claims\n                        to be essential that constitute the so-called “pith and\n                        marrow” of the claim. A patent specification should be given a\n                        purposive construction rather than a purely literal one derived from\n                        applying to it the kind of meticulous verbal analysis in which lawyers are\n                        too often tempted by their training to indulge. 23     This approach was reiterated more recently in the (also) House of Lords\n                    decision ofKirin-Amgen Inc v Hoechst Marion Roussel\n                        Ltd[2005] RPC 9 (“Kirin-Amgen”) as constituting the bedrock of all patent\n                    construction. Lord Hoffmann elaborated on this principle (at [32]) as\n                    follows: Construction, whether of a patent or any other document, is of course not\n                        directly concerned with what the author meant to say. There is no window\n                        into the mind of the patentee or the author of any other document.\n                        Construction is objective in the sense that it is concerned with what a\n                        reasonable person to whom the utterance was addressed would have understood\n                        the author to be using the words to mean. Notice, however, that it is not,\n                        as is sometimes said, “the meaning of the words the author\n                        used”, but rather what the notional addressee would have understood\n                        the author to mean by using those words. The meaning of words is a matter of\n                        convention, governed by rules, which can be found in dictionaries and\n                        grammars.What the author would have been understood to\n                            mean by using those words is not simply a matter of rules. It is highly\n                            sensitive to the context of, and background to, the particular\n                            utterance. It depends not only upon the words the author has chosen but\n                            also upon the identity of the audience he is taken to have been\n                            addressing and the knowledge and assumptions which one attributes to\n                            that audience. [emphasis added] 24     This sensible approach has also been adopted by this court inFE Global Electronics, where it was held (at [14]) that\n                    the purposive construction of patent claims was preferred as “it\n                    balance[d] the rights of the patentee and those of third parties” (see\n                    also the decision of this court inFirst Currency Choice Pte\n                        Ltd(at [25]–[26]) as well as the Singapore High Court\n                    decision ofMerck & Co Inc v Pharmaforte Singapore Pte\n                        Ltd[1999] 3 SLR(R) 1072 (“Merck\n                        & Co Inc (1)”) at [54] (affirmed by this court inMerck & Co Inc)). A purposive construction\n                    of the claims would give the patentee the full extent, but no more than the full\n                    extent, of the monopoly which a reasonable person skilled in the art, reading\n                    the claims in context, would think that he (the patentee) was intending to\n                    claim. 25     Clearly then, the starting point in patent construction is to ask the\n                    following threshold question: What would the notional skilled person have\n                    understood the patentee to mean by the use of the language of the claims? This\n                    question, however, is difficult to answer without first coming into possession\n                    of the knowledge that a notional skilled person would have. Accordingly, a brief\n                    excursion through the state of the art, as referred to above (at[11]), is necessary. However, a preliminary\n                    objection concerning the novelty of the ASA Patent must be dealt with\n                    first.",
        "A preliminary objection: Did the ASA Patent form part of the\n                state of the art having regard to ss 14(2) and (3) of the Act?": "26     Before proceeding to set out what the state of the art was in the context of\n                    the present appealvis-à-visthe requirements in\n                    relation to both novelty as well as an inventive step, it would be useful to set\n                    out the relevant parts of s 14 once more. Sections 14(2) and (3) of\n                    the Act provide as follows: (2)    The state of the art in the case of an invention shall be taken to\n                            comprise all matter (whether a product, a process, information about\n                            either, or anything else) which has at any time before the priority date\n                            of that invention been made available to the public (whether in\n                            Singapore or elsewhere) by written or oral description, by use or in any\n                            other way. (3)    The state of the art in the case of an invention to which an\n                            application for a patent or a patent relates shall be taken also to\n                            comprise matter contained in an application for another patent which was\n                            published on or after the priority date of that invention, if the\n                            following conditions are satisfied: (a)    that matter was contained in the application for that other patent\n                                both as filed and as published; and (b)    the priority date of that matter is earlier than that of the\n                                invention. 27     Indeed, the provisions just set out in the preceding paragraph are especially\n                    relevant in the context of a preliminary objection raised by counsel for the\n                    Appellant, Dr Stanley Lai (“Dr Lai”), to the effect that\n                    the ASA Patent did not, on a proper construction of ss 14(2) and (3)\n                    of the Act, even form part of the state of the art to begin with. Let us now\n                    turn to the detailed argument itself, commencing with the relevant factual\n                    background. 28     The ASA Patent was published on 21 June 2004 and was granted in\n                    September 2005. All this took placeafterthe\n                    Patent’s priority date of 16 February 2004.However, thepriority datefor the\n                    ASA Patent was on 7 January 2002. In other words, while the ASA Patent\n                    waspublished afterthe priority date of the\n                    Patent, it had beenfiled beforethat same\n                    priority date. 29     Section 14(3) of the Act makes it clear that the state of the art in\n                    relation to the Patent comprises matter contained in an application for another\n                    patent (ie, the ASA Patent) which was\n                    publishedon or afterthe priority date of the\n                    Patent,if bothconditions in\n                        ss 14(3)(a)and(b) of the Act are met. The\n                    condition in s 14(3)(b) of the Act is easily\n                    met in the context of the present appeal: the priority date for the\n                    ASA Patent was earlier than the priority date for the Patent. It is,\n                    however, less clear whether the requirements in s 14(3)(a) of the Act have been met. It is to this particular issue that\n                    our attention now turns. 30     The Appellant argued that the Respondent had failed to satisfy the requirement\n                    that the subject matter impugning the novelty of the Patent was contained in the\n                    application for the ASA Patentas filed and as\n                        published, pursuant to s 14(3)(a). It contended that the burden lay on the Respondent to\n                    demonstrate that all the requirements of s 14(3)(a) had been met, since it was the Respondent who was asserting\n                    that the ASA Patent was part of the state of the art. 31     In particular, the Appellant argued that in order to qualify to be considered\n                    as prior art under s 14(3)(a), the Respondent\n                    had to demonstrate that what waspublishedunder\n                    the ASA Patent correspondedexactlyto what\n                    wasfiledfor that same patent. This, however, the\n                    Respondent had apparently failed to do. 32     With respect, this particular argument is extremely technical in nature. More\n                    importantly, it appears to discount the fact that s 14(2) of the Act\n                    already provides (by way of analternative, and no less\n                        efficacious, “route”, so to speak) that the state\n                    of the art includes “all matter … which has at any time before the\n                    priority date of [the Patent] been made available to the public (whether in Singapore or elsewhere) bywritten or oral description, by use or in any other way”\n                    [emphasis added]. Under s 14(2), therefore, the ASA Patent would have\n                    already been considered as well as classified as prior art, given theinternational publication dateof its Patent Cooperation\n                    Treaty (“PCT”) application on 17 July 2003. We pause here to\n                    note the Appellant’s attempt to curtail reliance on s 14(2) on the\n                    basis that it had not been raised in the court below. Even assuming that this\n                    was the case, the nature of the argument is such that it ought to be considered\n                    by this court and would not, in any event, entail any adduction of further\n                    evidence of any kind (see also generally the decision of this court inPanwah Steel Pte Ltd v Koh Brothers Building & Civil\n                        Engineering Contractor (Pte) Ltd[2006] 4 SLR(R)\n                    571). 33     We do not, with respect, consider the Appellant’s objections to the\n                    effect that “[t]he Respondent has not satisfied proving that the PCT\n                    Application meets the publication requirement under the Act”[note: 3]to be persuasive. While the PCT system does not grant full patent\n                    protection in the same way that a national patent would, it is well-known that\n                    PCT applications, once lodged, are subject to search, examination and challenge.\n                    The PCT system permits the suspension - for up to\n                    18 months - of national or regional filing procedures\n                    while the inventor refines and assesses the prospects of his patent. Such\n                    suspension, and the corresponding delay in national registration, would only\n                    make sense if the inventor is assured of the priority of his invention. 34     In any event, during and after publication of a PCT application, written\n                    descriptions are made available to the public – whether in Singapore or\n                    elsewhere – in line with the stipulations in s 14(2). It is perhaps\n                    useful to note at this juncture that inFE Global\n                        Electronics, a published PCT application, filed by the Lexar\n                    Corporation, was considered sufficient to constitute prior art for the purposes\n                    of assessing novelty. Another PCT application in the same case, subsequently\n                    converted to a domestic Singapore patent, was also considered by this court to\n                    form part of the state of the art. 35     It is also noteworthy that the Appellant filed its own PCT application for the\n                    Patent on 31 January 2005, almost one and a half years later than\n                    ASA’s PCT application. 36     Returning to the Appellant’s concerns centring on s 14(3)(a) and relating to the possible non-correspondence of\n                    mattersfiledagainst matterspublished(see[31]-[32]above), we are of the view that this is something that can be easily verified,\n                    even by the court, by retrieving the relevant records and effecting the\n                    necessary comparisons. However, there is no necessity to adopt this particular\n                    course of action in the context of the present appeal (or, indeed, to even\n                    contemplate utilising s 14(3) in the first place), given the applicability\n                    of s 14(2) as noted above. That having been said, and although there is no\n                    necessity for us to express a concluded view on this particular argument, it\n                    would appear that, adopting an approach that looks more to the substance rather\n                    than the form, there is some doubt as to whether such an argument would be\n                    persuasive in the light of the views we expressed at the commencement of this\n                    particular paragraph. 37     With respect to the state of the art for aninventive\n                        step, s 15 states as follows: 15.    An invention shall be taken to involve an inventive step if it is not\n                            obvious to a person skilled in the art, having regard to any matter\n                            which forms part of the state of the art by virtue only of\n                            section 14(2)and without having regard to\n                                section 14(3)[emphasis added]. 38     Accordingly, given the operation of s 14(2),regardlessof the applicability of s 14(3), the Appellant\n                    cannot avail itself of the arguments contained in the preliminary objection for\n                    the purposes of assessing the state of the art under s 15. 39     Before we turn to consider what the state of the art in the context of the\n                    present appeal in fact was (which will set the appropriate backdrop required for\n                    considering the two legal issues in this appeal,viz, whether or not the Patent is new (or novel) and whether or\n                    not it involved an inventive step – both of which the Judge held were\n                    absent, thus resulting in (as we have already recounted above) judgment in\n                    favour of the Respondent in the court below), we would like to address two\n                    important preliminary points which, albeit more general in nature, are not only\n                    germane to the present appeal but also have wider implications for other cases\n                    as well. The first preliminary point relates to the role of logic and legal\n                    argument in the context of patent disputes or, to be more precise, what ought to\n                    beavoidedby counsel in relation to such disputes\n                    and (as we shall see) in relation to any other dispute in any other area of the\n                    law for that matter. The second preliminary point relates to the role of expert\n                    evidence, which evidence is almost invariably (and understandably) adduced in\n                    the context of patent disputes. Let us turn, then, to each of these preliminary\n                    pointsseriatimbefore proceeding to consider the\n                    particular issues and facts that are raised in the context of the present\n                    appeal.",
        "A first preliminary point: the importance of logic and rational\n                argument as well as the danger of over-generalisation and over-abstraction": "40     The present appeal illustrates the very importantgeneralpoint to the effect that no area of the law (including\n                    that relating to patents) is exempt from the general principles of logic and\n                    rational argument. Indeed, this point is so obvious that it is often taken for\n                    granted. In this appeal, it is illustrated (especially during oral submissions\n                    before this court) by the argument by counsel for the Respondent, Mr Foo\n                    Maw Shen (“Mr Foo”), that, because the use of pick up heads\n                    was nothing new and (more importantly) because his client’s patents had,\n                    in fact, more pick up heads, the Appellant’s claim that the Patent was\n                    novel and embodied an inventive step must fail. Such an argument is, at first\n                    blush, admittedly persuasive. However, it is our view that Mr Foo (albeit\n                    unintentionally) has pitched the argument on behalf of his client attoo high a level of abstraction(reference may also be\n                    made, in this regard, to the interesting paper by Tun-Jen Chiang,\n                        “The Levels of Abstraction Problem in Patent\n                        Law” George Mason University Law and Economics Research\n                    Paper No 09-33 <http://ssrn.com/abstract id=1434465> (accessed\n                    12 January 2010), exploring the “correct” level of\n                    abstraction in view of the tug-of-war between a patentee’s claim to a\n                    broader level of abstraction (to promote incentives) and limiting the patentee\n                    to specific embodiments (to reduce the monopoly cost of each patent)). Put\n                    simply, whilst the proposition advanced is not factually incorrect, it does not\n                    include that degree of specificity which is required under the particular\n                    principles embodied in the current law (as to which see generally[15]-[25]above). Indeed, if Mr Foo’s argument is correct,anynovelty and/or further inventive step\n                    would, literally, be (virtually, if not wholly)impossible. A moment’s reflection would reveal that this\n                    is incorrect simply because it isalways possiblefor there to be novelty and/or a further inventive step – particularly if\n                    we view the inquiry from aqualitativepoint of\n                    view. Everything would depend, in the final analysis, on the particular facts\n                    and (more importantly) the impact (if any) that the patent concerned has on the\n                    existing state of the art in that particular sphere. Indeed, one of the\n                    Respondent’s arguments, as we have just seen, centred really on thequantityof pick up heads, rather than (as we\n                    think ought to be the case)the overall qualitative\n                        difference (if any) between the Patent on the one hand and the patents\n                        relied on by the Respondent on the other. 41     It is important to emphasise, at this juncture, that the use of the general\n                    principles of logic and rational argument donot,\n                    in any way whatsoever, undermine thelegalprinciples that are germane to a particular area of the law (in this case, that\n                    relating to patents). Indeed, on one view, the legal principles themselves are\n                    the product – in part at least – of the process of logic as well as\n                    rational argument. It is no surprise, therefore, that the application and/or\n                    development of general principles of logic and rational argument must (as we\n                    shall see) beintegrated withthe particular legal\n                    principles as well. In other words, the general principles of logic and rational\n                    argument and the particular legal principles (here, in relation to the patent\n                    law) arecomplementaryin nature. 42     Turning, then, to the perspective of general principle and logic, there is an\n                    irreducible tension between universality and particularity (or, to use equally\n                    clear terminology, between generality and specificity;cfalso the decision of this court inSpandeck Engineering (S) Pte Ltd v Defence Science & Technology\n                        Agency[2007] 4 SLR(R) 100 at [28] (in the context of\n                    liability in negligence for pure economic loss)). However, as we shall see, this\n                    is not a tension that necessarily leads to paralysis or inaction; on the\n                    contrary, it (as we shall attempt to demonstrate in a moment) is, in fact,\n                    mediated via aninteractive processthat defines\n                    what the law and decision-making are all about in thepracticalsphere. Indeed, the unique combination (or, perhaps\n                    more appropriately, integration) of the universal and particular, of the general\n                    and the specific, and of the normative and the descriptive, produce not only\n                    decisions for the case at hand but also precedents for the future. 43     To elaborate, when an argument is pitched at too high a level of abstraction,\n                    it will probably attract no controversy (and may even achieve consensus) but,\n                    because it is at such a “rarefied” level, it is actually unhelpful\n                    in most cases (for example, virtually all persons will agree that it is\n                    desirable to “do good”, but, of course, once we descend into thespecifics(ie,\n                    what “doing good” means to each person), the opposite extreme will\n                    be reached, with little (if any) agreement amongst all concerned). Indeed, such\n                    an approach isespeciallyunhelpful in cases\n                    involvingpatents, simply because, in many cases\n                    (such as this), a necessary step involved in the court’s decision entails\n                    acomparisonof the competing patents. At this\n                    point,specific detailsmustnecessarilycome into play. However, it is also acknowledged\n                    that the court cannot go to the other extreme in focusing only on the trees and\n                    missing the wood. This is, however, unlikely to happen in practice because the\n                    court must perforce come toan overall conclusion,\n                    and that would entail gathering together all the relevant (andspecific) detailsand\n                        analysingthem in the context of the applicable legal rules and\n                    principlesbeforearriving atan overall conclusion. Here, we see theinteractionbetween the universal and the particular, between\n                    generality and specificity, as well as between the descriptive and the\n                    normative. It isnotsomething which can be\n                    reduced to a mechanistic formula simply because life in general and the\n                    decisions of courts (as a consequence) in particular are too complex to admit of\n                    a rigid formulaic approach. However, that does not mean that there are nogeneral principlesthat ought to guide the\n                    court. As already mentioned, there are, of course, the general principles of\n                    logic and argumentation. More importantly, each area (as well as sub-area) of\n                    the law will also embody general legal rules and principles which are to be\n                    applied to the facts at hand. In the specific sphere of patent law, we would\n                    think that, in addition to the general legal rules and principles (embodied in\n                    ss 13, 14 and 15 of the Act; see also generally[15]-[25]above), the court wouldalso need to applythose\n                    rules and principles (as well as those relating to general logic and\n                    argumentation) to thespecific claims which are contained\n                        within the patent(s) concerned. Indeed, these claims constitute\n                    thespecific factual matrix as well as contextwhich the court takes into account in arriving at its decision. Again, however,\n                    it is of the first importance to emphasise that this is aninteractionalprocess that is not susceptible of mechanical\n                    application. Put crudely, it entailsan exercise of\n                        judgment by the court concerned in applying the general principles of\n                        law as well as logic to the facts concerned, and as understood in the\n                        context in which they occur.",
        "A second preliminary point relating to the role of expert\n                evidence": "44     The difficulties engendered by the issue ofbiaswith regard to experts for the respective parties are, unfortunately, perennial\n                    in nature. Indeed, in the Singapore High Court decision ofKhoo Bee Keong v Ang Chun Hong and another[2005] SGHC 128,\n                    this difficulty, amongst others, was referred to, as follows (at [68] and\n                        [82]-[87]): 68    It is important to ascertain what precisely constituted thebasisfor the respective expert reports (and see\n                            generally Jeffrey Pinsler,Evidence, Advocacy and the\n                                Litigation Process(LexisNexis, 2nd Ed, 2003) at\n                            pp 185–187, 553–554 and 646–647;Halsbury’s Laws of Singapore… at\n                            paras 120.256 and 120.258;Sarkar’s Law of\n                                Evidence(Wadhwa and Company, 15th Ed, 1999),\n                            vol 1 at pp 878–880;Sir John\n                                Woodroffe & Syed Amir Ali’s Law of Evidence(LexisNexis Butterworths, 17th Ed, 2002), vol 2 at\n                            pp 2520–2530; Tristram Hodgkinson,Expert\n                                Evidence: Law and Practice(Sweet & Maxwell, 1990) at\n                            pp 136–138; and Ian Freckelton & Hugh Selby,\n                            “The Basis Rule” in Ian Freckelton & Hugh Selby,The Law of Expert Evidence(LBC\n                            Information Services, 1999) at ch 5; and see, by the same authors,Expert Evidencevol 1 (The Law\n                            Book Company Limited, Looseleaf Ed, 2001) at ch 11). It is both\n                            logical and commonsensical that if the basis or starting-point is either\n                            shaky or (worse still) flawed, the conclusion arrived at will be of\n                            little or no use to the court. Indeed, if there is in fact something\n                            untoward in the starting-point, even the most impeccable reasoning\n                            process will be of no avail in so far as the quest for a fair and just\n                            result is concerned. This principle is of particular importance with\n                            respect to expert reports generally – and especially in the\n                            present context of traffic accidents. Unfortunately, however, the\n                            general provisions with respect to expert evidence, ss 47 and 48 of\n                            the Evidence Act (Cap 97, 1997 Rev Ed), do not furnish us with\n                            specific guidance in this particular regard. … 82    There are alsoothermore general\n                            – yet no less intractable – difficulties with regard to\n                            expert evidence generally. One has been hinted at, but is in fact an\n                            extremely pressing problem and ought therefore to be mentioned. It would\n                            surprise no one. It relates to the alleged bias on the part of the\n                            expert concerned. It would surprise no one simply because, apart from\n                            court-appointed experts, every expert is appointed (and remunerated) by\n                            the party who has engaged his or her services. It is true that the\n                            expert concerned has, in the final analysis, an overriding duty to\n                            objective justice and to the court (see, for example, the oft-cited\n                            observations by Lord Wilberforce in the House of Lords decision ofWhitehouse v Jordan[1981] 1 WLR\n                            246 at 256–257). The principle just mentioned is now embodied, in\n                            the local context, in O 40A r 2 of the Rules of Court, as\n                            follows: Expert’s duty to the Court (O. 40A,\n                            r. 2) 2.—(1) It isthe dutyof an expertto\n                                assist the Courton the matters within his\n                            expertise. (2)    This duty overrides any obligation to the person from whom he has\n                                received instructions or by whom he is paid. [emphasis added] Reference may be made, in addition, to O 40A r 3(2)(h) as well as the views of\n                        V K Rajah JC (as he then was) in the Singapore High Court\n                        decision ofVita Health Laboratories Pte Ltd v Pang Seng\n                            Meng[2004] 4 SLR 162 at [79]–[90]. 83    All this is only to be expected as “[e]xpert witnesses are in a\n                            privileged position; indeed only experts are permitted to give anopinionin evidence” [emphasis\n                            in original] (perCazalet J in the\n                            English decision ofRe J (Child Abuse: Expert\n                                Evidence)[1991] FCR 193 at 226. To this end, the duties\n                            of experts have been set out in detail in many cases. Perhaps one of the\n                            most detailed formulations is that by Cresswell J in the English\n                            High Court decision ofThe Ikarian Reefer[1993] 2 Lloyd’s Rep 68 at 81–82, which was endorsed\n                            (with one modification) on appeal: seeperStuart-Smith LJ, delivering the judgment of the English Court of\n                            Appeal inThe Ikarian Reefer[1995]\n                            1 Lloyd’s Rep 455 at 496. Indeed, Cresswell J’s\n                            formulation has been described as “[t]he most important\n                            enunciation of the duties and responsibilities of expert\n                            witnesses” (see Freckelton & Selby,The\n                                Law of Expert Evidence([68]supra) at p 594). 84    However, one cannot be faulted for taking the views just expressed,\n                            with respect to an expert’s duty to the court and to justice, with\n                            the proverbial pinch of salt, especially when one views this proposition\n                            through the lenses of practical reality. Not surprisingly, therefore,\n                            this datum difficulty is almost always referred to in the literature and\n                            the case law which it cites (see, for example, Jeffrey Pinsler,\n                            “Expert’s Duty to be Truthful in the Light of the Rules of\n                            Court” (2004) 16 SAcLJ 407 and, by the same author,Evidence, Advocacy and the Litigation\n                                Process([68]supra) at\n                            p 650;Sir John Woodroffe & Syed Amir\n                                Ali’s Law of Evidence, vol 2 ([68]supra), especially at pp 2354–2355;\n                            and Anthony Kenny, “The Expert in Court” (1983)\n                            99 LQR 197 at 214). It has also been pointed out that “the\n                            Court may be induced to believe the expert who has succeeded in putting\n                            forward his views in the most persuasive and plausible manner”\n                            (see H A Hammelmann, “Expert Evidence” (1947)\n                            10 MLR 32 at 34). This poses no real difficulty if the expert\n                            concerned has,in fact, a persuasive case.\n                            However, where he or she does not, the intensity surrounding problems of\n                            bias (already undesirable in themselves) is driven home – in\n                            spades. 85    The real and effective solution to the difficulties centring on the\n                            alleged bias of experts probably lies in the sphere of the extra-legal\n                            and this, in itself, reflects, once again, the almost natural\n                            intractability that especially characterises the law relating to expert\n                            evidence. 86    The second related difficulty also relates more specifically to the\n                            expert himself or herself (and see generallyHalsbury’s Laws of Singapore[vol 10\n                            (Butterworths Asia, 2000)] at para 120.259). And that is the issue\n                            of the respectivequalificationsof the\n                            expert. For example, counsel for the defendants in the present case\n                            focused on the fact that PW4 did not have any certificates but was,\n                            rather, mentored by what appeared then to be the only accredited\n                            accident reconstructionist in Singapore. DW7, on the other hand, is an\n                            accredited reconstruction expert (under the US National Highway Traffic\n                            Safety Administration) and had approximately two years of working\n                            experience. Certificates are of course not imperative (see the oft-cited\n                            Singapore Court of Criminal Appeal decision ofLeong\n                                Wing Kong v PP[1994] 2 SLR 54 at 59, [15]).\n                            Further, given the relative “simplicity” of the facts\n                            involved in the present case, I was unable to ascertain whether or not\n                            formal accreditation did in fact make a significant difference. What\n                            appears clear, however, is that, as with the situation with respect to\n                            thetechniquesof accident reconstruction,\n                            there is much room for the development (in tandem) of methods of\n                            upgradingthe expertiseof practitioners\n                            in this particular field. 87    All the issues canvassed above – and more besides – point\n                            to the fact that the area of expert evidence generally is in need of\n                            re-examination. Fortunately, none of the issues raised had any impact on\n                            the resolution of the present proceedings. This was due, as already\n                            mentioned, to the fact that the case was a relatively straightforward\n                            one, where the expert evidence proffered was not (unfortunately)\n                            particularly helpful … However, Singapore is not the only\n                            jurisdiction where a review might be necessary. Significantly, the New\n                            South Wales Law Reform Commission’s Issues Paper entitledExpert witnesses(IP 25, November\n                            2004) refers (at para 1.2) to the “world-widereassessment and change relating to the\n                            management of court business generally and expert witnesses in\n                            particular” [emphasis added]. [emphasis in original] 45     The issue of the need forreviewin this area of\n                    the law referred to in the last paragraph of the passage quoted in the preceding\n                    paragraph was also alluded to by counsel for the Appellant, Dr Lai.\n                    Dr Lai emphasised that the issue in relation to the possible (or even\n                    probable) bias of experts is an especially significant one in patent cases and\n                    suggested that a new system involving impartialassessorsmight be a possible solution. The special difficulties\n                    just mentioned might well be the case, given the very nature of the inquiry in\n                    such cases, in which the court also often does not possess the requisite\n                    technical expertise. However, it is obviously also significant with respect to\n                    all other areas of the law as well. In the meantime, however, it may well be\n                    wise and prudent for the parties concerned in future cases (especially of this\n                    nature) to apply to the court to appoint an impartial and objective expert\n                    (whose views they would agree to abide by) pursuant to O 40 r 1 of the\n                    Rules of Court (Cap 322, R 5, 2006 Rev Ed) (which permits the\n                    court to appoint one or more independent experts on the application of any party\n                    which, under O 40 r 1(2) “shall, if possible, be a person\n                    agreed between the parties and, failing agreement, shall be nominated by the\n                    Court”). It should, however, also be noted that this same Rule also\n                    permits the court to appoint one or more independent experts “on its own\n                    motion”, although, in the nature of things (particularly in patent\n                    disputes), this particular avenue will probably prove to be less than\n                    practical. 46     Returning to this particular appeal, we note that one of the Appellant’s\n                    main arguments centred on the alleged bias on the part of Mr Briar. In\n                    particular, Dr Lai noted that he wasone of the actual\n                        inventors of the machine which constituted the subject matter of the\n                        Respondent’s (and, more importantly, opposing) patent.\n                    Indeed, he argued, the Judge appeared to acceptwhollythis particular expert’s views without more\n                        (cfalso[12]above). 47     However, as was observed in the Singapore High Court decision ofAsia Hotel Investments Ltd v Starwood Asia Pacific Management Pte\n                        Ltd[2007] SGHC 50 at [206]–[207], for the purposes of\n                    determining whether the evidence of an expert should be discounted, the relevant\n                    test is one ofactualpartiality, rather than\n                    merely theappearanceof partiality. In any event,\n                    however, there is insufficient evidence on the record to demonstrate that the\n                    Judge did not discount the views of Mr Briar accordingly. The mere\n                    acceptance (even in its entirety) of such views doesnot\n                        necessarilyentail theabsenceof\n                    such a discount. As it turns out, however, it is clear (for reasons that will be\n                    elaborated upon below) that the views by the experts appointed bybothparties werenot, in\n                    our view,critical,exceptin so far as they enabled this court to understand what\n                    were the precise claims in the respective patents. To this end,boththe experts’ views were helpful, bearing in\n                    mind that it is, in the final analysis,the courtwhich decides whether or not the requisite legal criteria have (or have not)\n                    been satisfied. It should also be borne in mind that the expert evidence is\n                        - in so far as the issues as to whether the Patent is\n                    novel and/or whether an “inventive step” existsvis-à-visthe state of the art - itself\n                    subject to the legal criteria contained in ss 14 and 15 of the Act,\n                    respectively (as well as the accompanying legal rules and principles). 48     In particular, the court must bear in mind the fact that the legal criteria\n                    just set out in the preceding paragraph doesnot(in the context of whether there is an inventive step within the meaning of\n                    s 15) assume knowledge and expertise that goesbeyondwhat areasonableperson\n                    “skilled in the art” would possess (see also[21]above as well asFE Global\n                        Electronics(at [22])). This is not an unimportant practical\n                    point, simply because many experts wouldnot\n                        themselvesfall within this particular category of persons\n                    “skilled in the art” as they would possessextraordinaryknowledge as well as expertise. It is therefore\n                    important for such experts to bear this particular point in mind when they\n                    tender their evidence before the court in future. It would also be wise for\n                    counsel (and, if necessary, the court) to remind the experts concerned of this\n                    point if they appear to have forgotten it.",
        "The state of the art described": "49     In light of the Appellant’s (not unwarranted) contention that\n                    “significant portions of the [Judge’s] grounds of decision\n                    originate from the evidence of the Respondent’s expert [ie, Mr Briar]”[note: 4](see also[12]and[46]above), care will be taken here to describe\n                    each and every piece of prior art as objectively and neutrally as\n                    possible.",
        "The ASA Patent and the AFC 800": "69     TheASA Patentmay be dismissed as a\n                    potential anticipator of the Patent right from the outset. Even taking the\n                    Judge’s interpretation of the inventive concept at face value –\n                    “inspection on the fly”, as noted at [12] of the GD – the\n                    ASA Patent fails to pass muster. As has already been noted at[51]above, the ASA Patent does not provide\n                    any enabling disclosure with respect to aconcurrentpickup and inspection system; it only alludes to\n                    “[o]ptically assisted pick and place systems, as will be known to one\n                    skilled in the art”.[note: 42]Even so, it sanctions these optically assisted pick and place\n                    systems in a non-imperative sense, stating that they “maybe employed to determine the location and orientation of the\n                    target location 122A [ie, the\n                        die]”[note: 43][emphasis added]. 70     The AFC 800 goes one step further in implementing a prism/mirror system\n                    to enable concurrent optical inspection and pickup of wafer dies. This falls\n                    within the “inspection on the fly” inventive concept as preferred\n                    by the Judge. More importantly, there is, as a result, someostensiblesimilarity between the AFC 800 and the Patent.However, the adoption of such an approach\n                    falls afoul of the very over-generalisation as well as over-abstraction referred\n                    to earlier in this judgment, which ought, in fact, to be assiduously avoided at\n                    all costs for the same reasons stated earlier on (see generally[40]-[43]above). Put simply, adopting “inspection on the\n                    fly” as the defining inventive concept would constitutefar too broadan approach and would, in effect, preventspecificinventions which come under thebroad “umbrella heading”of\n                    “inspection on the fly” from even being considered for the\n                    purposes of patent protection in the first instance. In other words, just\n                    because two (or more) inventions share thebroad\n                        “umbrella heading”of “inspection on the\n                    fly” doesnotmean that they cannot be\n                    novelif the specific method adoptedindeed\n                    justifies the invention concerned being considered novel. 71     A similar approach was, in fact, adopted by the expert for the defendant inDextra Asia Co Ltd, where the expert\n                    “assumed that cold forging was not new or inventive because others who\n                    had patented processes before had used the term “forging”, which\n                    could mean either hot or cold forging” (at [54]). Not surprisingly, Tan\n                    Lee Meng J rejected such an approach which was too general and, indeed, led\n                    to confusion instead (at [54]). 72     Reference may also be made to the House of Lords decision ofBiogen Inc v Medeva Plc[1997] RPC 1, where\n                    Lord Hoffmann observed as follows (at 34): Whenever anything inventive is done for the first time it is the result of\n                        the addition of a new idea to the existing stock of knowledge. Sometimes, it\n                        is the idea of using established techniques to do something which no one had\n                        previously thought of doing. In that case, the inventive idea will be doing\n                        the new thing.Sometimes, it is finding a way of doing\n                            something which people had wanted to do but could not think how. The\n                            inventive idea would be the way of achieving the goal. In yet other\n                            cases, many people may have a general idea of how they might achieve a\n                            goal but not know how to solve a particular problem which stands in\n                            their way. If someone devises a way of solving the problem, his\n                            inventive step will be that solution, but not the goal itself or the\n                            general method of achieving it. [emphasis added] 73     The learned law lord also observed (in the same decision) thus (idat 52): Those who followed, even by different routes, could have greater\n                        confidence by reason of his success. I do not think this is enough to\n                        justify a monopoly of the whole field. I suppose it could be said that\n                        Samuel Morse had shown that electric telegraphy could be done. The Wright\n                        Brothers showed that heavier-than-air flight was possible, but that did not\n                        entitle them to a monopoly of heavier-than-air flying machines. ….The technical contribution made in such cases\n                            deserves to be recognised. But care is needed not to stifle further\n                            research and healthy competition by allowing the first person who has\n                            found a way of achieving an obviously desirable goal to monopolise every\n                            other way of doing so. [emphasis added] However, much would, of course, depend on the precise facts of the case\n                    concerned itself (see, for example, the recent House of Lords decision ofGenerics (UK) Ltd v H Lundbeck A/S[2009]\n                    RPC 13). 74     Consider, also (to take an everyday example), the ubiquitous television, which\n                    inventive concept might be summarised as “a viewable screen for the\n                    projection of moving images”. Liquid crystal display\n                    (“LCD”) and plasma technology (quite apart from CRT (ie, cathode ray tube) and projection televisions) have\n                    separately attained this end through starkly contrasting processes. LCD screens\n                    are, in layperson’s terms, sandwiches made up of liquid crystal pushed\n                    into the space between two glass plates. Images are created by varying the\n                    amount of electrical charge applied to the crystals. Plasma screens, on the\n                    other hand, utilise a matrix of tiny gas plasma cells charged by precise\n                    electrical voltages to create a picture. Both technologies have their own\n                    separate patents, similar end results notwithstanding. 75     Applying the above principles to the facts of the present case, the Patent\n                    (the key characteristics of which have been set out above (at[6]-[9])) is, in our view, a genuinely different (and specific)\n                    method of achieving the desired result of “inspection on the fly”.\n                    In particular, the true inventive concept which the Patent embodies (and which\n                    is required under the first stage of theWindsurfingtest (at[20]above)) is thegenuinely concurrentinspection (as\n                    opposed tostop-start“concurrence”\n                    (see[58]above)) of a wafer diethrough a pivoting part[note: 44]located betweentwo pickup\n                        heads.[note: 45]Neitherthe ASA Patentnorthe AFC 800 achieves the said result in the same\n                    manner. 76     It shouldalsobe noted that the Patent also\n                    includes claims for amethod and process(see[8]above), which at first glance\n                    operates according to a procedure that is very markedly different from the\n                    existing art (two pickup heads only, and alternating 180-degree motion of the\n                    pickup heads, with a through opening for establishing an optical pathwithinthe pivoting portion of the device). We have\n                    already noted that Claims 1 through 6 of the Patent (see[7]above) envisage adevicethat isnot, in the final\n                    analysis, similar to the state of the art. This finding of novelty isfurtherconfirmed (as just noted) via theprocessesenshrined in Claims 7 through 10 of the\n                    Patent (see[7]above). 77     Turning now to compare both thedeviceandprocesscountenanced in the Patent with those\n                    inthe AFC 800, we see that the primarymaterialdifferences between the two lie in\n                    the following aspects: (a)     The optical inspection system described by the Patent does away with the\n                        need for a prism/mirror to bend the optical path (which is the case with the\n                        AFC 800), since the optical path is a vertical one from the camera down\n                        to the wafer table. (b)     The two pickup heads in the Patent move in a reciprocal\n                        clockwise/counter-clockwise 180-degree pivoting motion,in contrast tothe rotating pickup turret in the\n                        AFC 800, which performs unidirectional incremental rotations. 78     The differences referred to in the preceding paragraph relate to neutral and\n                    objective facts that are not - and, indeed, cannot be\n                        - disputed by either party and which are, more\n                    importantly, claimed in the Patent itself (see[7]above). Whatisdisputed are\n                    the alleged advantages of the Patent over the AFC 800 as a result of these\n                    two differences. With respect to the difference in para 77(a) above, the\n                    Appellant argued (at para 325 of the AC) that the Patent is novelvis-à-visthe state of the art as it implements: … a vision inspection system that avoids the prism/mirror\n                        arrangement altogether, therebyreducing the machine\n                            complexity and the costs of partsas well as of\n                        mounting/adjusting the prism/mirror arrangement. In addition, the invention\n                        allows for anincreased accuracy of the vision inspection\n                            by avoiding optical components (i.e. the mirror/prism) that are exposed\n                            to shock, vibration, etc. during operation of the machine. An\n                        important aspect of not having a prism/mirror in a straight optical path\n                        from the camera via the through opening in the pivoting part during its\n                        pivotal motion through 90° or 270°, is thatthe lack of\n                            the mirror allows for a longer unobstructed vision inspection or for a\n                            faster pivoting motion– thereby increasing the\n                        throughput of chips. [emphasis added] In so far as the difference in para 77(b) above is concerned, the\n                    Appellant argued that the Patent is novelvis-à-visthe state of the art, as follows (see the AC at\n                    paras 328-329): 328.  In the ASA configuration, the wheel performs unidirectional\n                            incremental angular steps. At the end of each such step, a pickup head\n                            reaches a chip on the substrate and hands over a turned chip. This\n                            motion requires an acceleration of the wheel followed by a deceleration\n                            and a precisely position-controlled stop where the pickup head is\n                            accurately positioned over the chip to be picked up.This requires a high precision servo motor with the respective\n                                closed-loop position control. The precise positioning of each of the\n                                pickup heads mounted along the circumference of the wheel results in\n                                a relatively low overall turning speed of the wheel. A\n                            restricted throughput is the consequence. 329.  In contrast, the inventors [of the Patent] have realized that areciprocal (clockwise/counter-clockwise)\n                                180°pivoting\n                                motion of the compact pivoting part allows for a simple control\n                                mechanism where the drive of the pivoting part can abut against\n                                abutments at each end of the 180°motion because it reverses its driving direction\n                                thereafter. Such a simple drive control mechanism is\n                            reliable and requires little adjustment during operation. More\n                            importantly, the motion itself can be fast and requires very little\n                            control overhead in comparison to the(1) unidirectional accelerate – (2) decelerate\n                                – (3) fine-position the pickup head – (4) stop\n                                – (5) accelerate …sequenced\n                            articulated step motion of the ASA configuration. [emphasis added in italics; bold and underlining in original] 79     The Respondent chose to respond to the above with the usual procedural\n                    arguments of “not raised before the Court below”[note: 46]and also that “A/P Tay did not give evidence on this\n                    before the court”[note: 47]. This was not, however, for want of trying to meet the\n                    Appellant’s substantive reasoning; indeed, before resorting to these\n                    technical procedural arguments, the Respondent had attempted to field its ownsubstantiverebuttals. In contrast to the\n                    Appellant’s contentions, however, these rebuttals appeared to be extremely\n                    general and lacking the convincing specificity possessed by the former. For\n                    example, the Respondent argued thus:[note: 48] It is clear that there are many factors that determine/affect the\n                        throughput of flip chip machines. And, in a similar vein, the Respondent also argued as follows:[note: 49] In any event, by February 2004 i.e. the priority date of the\n                        [Appellant’s] Patent, there would have been technological advances\n                        enabling the issues raised in the ASA Patent concerning the 2 head\n                        flipper to be resolved. 80     The disclosure in a patent claim must enable a “skilled person in the\n                    art” to make the invention (seeMerck & Co Inc\n                        (1), applying the House of Lords decision inMerrell Dow Pharmaceuticals Inc and Another v HN Norton & Co Ltd and\n                        Others[1996] RPC 76). This standard is arguably similar to\n                    that of the “normally skilled but unimaginative addressee”, as\n                    required by the second stage of theWindsurfingtest for obviousness (see[20]above). Here,\n                    however, evenwithoutassuming the mantle of a\n                    person skilled in the art, the logical arguments put forth by the Appellant (at[78]above) are, in fact, extremely\n                    clear and certainly do not require any expert clarification. A mirror/prism\n                    (that is an integral part ofthe AFC 800)isan additional, unnecessary step that\n                    results in a less efficient process. Incontrast,\n                    the 180-degree alternating rotation (that is an integral part ofthe Patent) is not only different but also results in a\n                    different (and more efficient) process. Indeed, the Respondent’s own\n                    witness, Mr Boh Teck Keong (“Mr Boh”), admitted that\n                    “[i]f you do a continuous turning [as opposed to a 180-degree alternating\n                    rotation], you will have a cumulative error that eventually affect[s] the\n                    stopping accuracy”.[note: 50] 81     In any event, regardless of the precise advantages (or disadvantages)\n                    engendered by the changes wrought in the Patentvis-à-visthe AFC 800, it is plain to see that both thedeviceand themethodenvisaged in the Patent facilitate “inspection on\n                    the fly” in a mannerdifferent fromthat\n                    countenanced by the AFC 800. When we recall the analogy furnished above (at[74]) with respect to separate patents\n                    being granted to plasma and LCD televisions, this finding becomes almost\n                    self-evident. Accordingly, we find that that there is novelty in the Patent\n                    relative to the AFC 800.",
        "The Matsushita Patent": "82     As has already been pointed out (see[56]above), the Matsushita Patent is (unlikethe\n                    Patent) capable ofonly a limited formofconcurrentinspection and pickup. As a result\n                    of thethreerotating pickup heads having to come\n                    to a halt before inspection can take place, precious time is consumed. The\n                    Patent, on the other hand, envisagesonly twopickup heads at opposite ends. When one pickup headpicks\n                        upa wafer die, theotherpickup\n                    head issimultaneously depositingthe wafer die it\n                    had already been holding onto a placing facility. When both pickup heads are in\n                    motion (ie, the pivoting part is being rotated),transferringa wafer die on one hand and\n                    returning empty to collect another wafer die on the other,concurrent inspectionvia the camera mounted above takes place\n                    through the transverse opening on the pivoting part. Therefore, instead of this\n                    relentless (1) transfer-inspect and (2) deposit-pickup cycle\n                    facilitated by the rotating two-headed pickup in the Patent, the three-headed\n                    pickup head in the Matsushita Patent requires an intermediate stage in which two\n                    pickup heads are stationary anddoing nothingwhile a wafer die is picked up.[note: 51]Indeed, in this aspect, the Matsushita Patent resembles the sort of\n                    prior art that the Patentsought precisely to\n                        avoid. This is, in fact, underscored by reference to the\n                    following part of the description of the Patent:[note: 52] In order to check the surface of the individual chip still arranged on the\n                        substrate for intactness before it is picked up, and at the same time to be\n                        able to check that it is in the correct position before it is picked up,a first optical facility, for example a camera, is\n                            arranged above the pivoting part for the inspection of the\n                            wafer. Since an optical connection line set up perpendicular\n                        to the surface of the wafer and the chip between the first optical facility\n                        and the wafer surface is important for an optimized check, the camera is\n                        arranged directly over the chip to be picked up. For this reason, the\n                        pivoting part must be rotated out of the perpendicularly running optical\n                        connection line each time before a chip is picked up, in order that a\n                        so-called wafer inspection can be performed. This results in the following sequentially occurring method sequence for\n                        each flip chip: First,a check of the surface of the chip\n                            to be picked up must be performedusing the camera.The flip head is then rotated into the optical connection line,\n                            in order to pick up the chipby its upper surface using the\n                        vacuum pipette attached to the flip head. By means of the pivoting part,\n                        whose rotational axis is arranged outside the optical connection line,the chip is now rotated through 180° in such a way\n                            that the flip head is now in a rotated position outside the optical\n                            connection line. A further check performed on the\n                        chip’s position by means of a second optical facility in the form of a\n                        camera should supply data on a flip offset of the flipped chip.The flipped or rotated chip is then transferred to a placing\n                            facility in the form of a place head, and a correction is\n                        made to the flip offset based on transferred correction values. Such asequence of successive stepsleads to\n                        a high time requirement for the overall process of checking and rotating a\n                        chip, and thereby reduces the throughput of the device. It therefore also\n                        results in higher operating costs. [emphasis added] From the above, it can be seen that the description of theprior artin the Patent corresponds closely to the operation of\n                    device exemplified by the Matsushita Patent. Accordingly, the Patent does not\n                    appear to have been properly anticipated by the Matsushita Patent. 83Another differencebetween the Matsushita Patent\n                    and the Patent lies in the fact that the former utilisesthreepickup heads (or a “plurality of nozzles”)\n                    rotating unidirectionally in increments (not unlike a ferris wheel), whereas the\n                    latter utilisestwo pickupheads alternating\n                    between 180-degree rotations in clockwise and anti-clockwise directions (not\n                    unlike a see-saw). The unidirectional movement of the pickup assembly is similar\n                    to that countenanced in the rotary pickup turret described in the\n                    ASA Patent (with its concomitant problems) (see[50]-[52]and[78]above). 84     The Respondent’s expert, Mr Briar, however, citedanotherMatsushita patent[note: 53]to demonstrate that “the clockwise/anticlockwise rotation\n                    [was] nothing novel”.[note: 54]This, however, does not the change the fact that, for the purposes\n                    of the Matsushita Patent, the description of such alternating rotation (as found\n                    in the Patent) isabsent. Indeed, this additional\n                    citation only underscores the fact that the Matsushita Patent lacks something\n                    which the Patent possesses. Further, as has already been noted, there can be no\n                    mosaicing of prior art with respect to an inquiry into novelty (see[18]and[68]above). 85     For the above reasons, therefore, it is our view that the Patent is novelvis-à-visthe Matsushita Patent as well. Even\n                    if it is the case – which has not (significantly, in our view) been argued\n                    – that the Matsushita Patent is more efficient than the Patent, the fact\n                    remains that the Patent has accomplished the same task in a markedly different\n                    manner.",
        "The National Semiconductor Patent": "86     The National Semiconductor Patent, like the ASA Patent and the Matsushita\n                    Patent, dictates a “pluralityof\n                        stations”[note: 55][emphasis added] on a wheel moving in only one direction.\n                    Additionally, the only illustration of any vision inspection system – and\n                    not even an explicitly concurrent vision inspection system at that –\n                    occurs in diagrams referring to thestate of the\n                        art. In other words, any vision inspection system, concurrent or\n                    otherwise (this is not, in fact, taught by the patent), is alluded to only in\n                    diagrams of a “conventional semiconductor device transfer\n                        machine”[note: 56]that the National Semiconductor Patent purports toimproveupon. 87     In view of the above, we are of the view that the Patent is novel with respect\n                    to the National Semiconductor Patent as well.",
        "The Shinkawa Patent": "88     As has already been noted earlier, the device envisaged by the Shinkawa Patent\n                    possessesonly onepickup head.Further, its optical inspection system utilises the same\n                    prism/mirror concept as the AFC 800, thereby being subject to the same\n                    vulnerabilities found therein (as explained at[80]above). 89     More importantly, the ingenuity of optical inspection taking placethrougha pivoting part in the Patent isabsentin the Shinkawa Patent (as noted at[64]above). Optical inspection in the Shinkawa\n                    Patent simply takes place when the single pickup arm hasmoved out of the way. This is decidedly different from the\n                    concept in relation to optical inspection enshrined in the Patent. Indeed, it\n                    would appear that the concept utilised by the Shinkawa Patent is no different\n                    from the prior art outlined and critiqued by the Patent (quoted at[82]above). Without a second pickup headandwithout a pivoting partthroughwhich vision inspection may take place, the Shinkawa\n                    Patent is condemned to the same “pickup head moves away –\n                    inspection – pickup head moves back to pick up – pickup head moves\n                    away” cycle as the prior art that the Patent has sought to distinguish\n                        - and, in our view, has in fact succeeded in\n                    distinguishing - itself from. 90     In this respect, the diagrams (ie,\n                        FIGS 9-11[note: 57]) provided by the Respondent’s own expert, Mr Briar, in\n                    his report are instructive. Inspection of the next flip chip die to be picked up\n                    can only occur (as illustrated in FIG 9), where the open window isfacingthe wafer table. At this juncture, the\n                    pickup head is facing the nine o’clock direction. The moment the\n                    pickup head movesupwardsordownwards, the angle of the half-mirror for bending the optical\n                    path is changed and the optical connection line to the next flip chip die is\n                    immediately lost. This is,a fortiori, the case\n                    when the pickup head is completely at rest pointing downwards to the wafer table\n                    (for pickup (see FIG 10)), or when the pickup head is completely at rest\n                    pointing upwards to the bonding nozzle (for deposit and bonding (see\n                    FIG 11)). In both these situations, the open window is precluded from\n                    sighting the wafer table entirely (as it points towards three o’clock\n                    in the former and nine o’clock in the latter). In short, there isnorealcontemporaneousinspection of the wafer die in the Shinkawa\n                    Patent.In contrast, suchcontemporaneousinspection, which would occur without requiring\n                    the pickup head to get out of the waycompletely,\n                    is in fact the hallmark ofthe Patent. Even so,\n                    whatever concurrent inspection that can realistically take place in the Shinkawa\n                    Patent is limited to only a scintilla of time when the pickup head is pointedexactlyin a nine o’clock direction\n                    (see FIG 9). This isquite differentfrom the\n                    process envisaged in the Patent, where, by virtue of the fixed camera position,\n                    optical inspection may take place during a broader range of the rotating\n                    movement of the pivoting two-headed pickup.[note: 58] 91     In addition, the fact of the fragile optical apparatus in the Shinkawa Patent\n                    having to rotatealongwith the pickup head surely\n                    brings with it potential complications, particularly since parts in the\n                    half-mirror and camera involve the use of mirror and glass. In any case, it is\n                    difficult to see how this rotating optical inspection system anticipates the\n                    fixed camera system implemented in the Patent. Further, it is also difficult to\n                    see how the Shinkawa Patent’sone-armedpickup head anticipates the Appellant’s eleganttwo-headedpickup solution, which solution permits the\n                    establishment of an optical connection line via a transverse opening in the\n                    middle of its pivoting part. 92     In the light of the reasons outlined above, the Patent is novel with respect\n                    to the Shinkawa Patent as well.",
        "Is the Patent novelvis-à-visthe state\n                of the art?": "68     Turning, first, to the issue as to whether the Patent is novelvis-à-visthe state of the art (which has been described\n                    at[50]-[66]above), generally speaking, it is not\n                    permissible to assemble all the pieces of prior art together into a\n                    “mosaic”, and then to compare the invention under question against\n                    this “mosaic” (see[18]above\n                    as well asDextra Asia Co Ltd(at [53])). The\n                    invention must be compared against each individual piece of prior art, and the\n                    question is repeated each time: has this particular piece of prior art\n                    anticipated the invention? Thelimited exceptionto this rule against “mosaicing” only states that where an earlier\n                    document is referred to in a later document, it is possible to refer to the\n                    earlier document; but, even then, only to the extent of the specific portions\n                    referred to by the later document. Reference may also be made, for example, to\n                    the decision of this court inGenelabs Diagnostics(at [26]–[28]). This limited exception, however, does not apply in the\n                    context of the present appeal simply because the examples of prior art under\n                    consideration do not cite one another as references.[note: 41]",
        "Does the Patent involve an inventive step over the state of the\n                art?": "93     Turning to the second main issue in this appeal (viz, whether the Patent involved an inventive step), unlike the\n                    inquiry for novelty considered in the preceding part of this judgment, it is\n                    permissible to construct a “mosaic” out of the various pieces of\n                    prior art in the inquiry for obviousness (ie, an\n                    inventive step) –unlessthe act of “mosaicing” itself\n                    is not obvious to the notional skilled person. This was made clear in the\n                    decision of this court inPeng Lian Trading Co v Contour\n                        Optik Inc and others[2003] 2 SLR(R) 560 (“Peng Lian Trading Co”) at[18], where the court cited with approval\n                    Lord Reid’s observations in the House of Lords decision ofTechnograph Printed Circuits Ltd v Mills & Rockley\n                        (Electronics) Ltd[1972] RPC 346 at 355 to the effect that\n                    the “mosaic” must be one which is “put together by an\n                    unimaginative man with no inventive capacity” (reference may also be made\n                    to the Singapore High Court decision ofASM Assembly\n                        Automation Ltd v Aurigin Technology Pte Ltd and others[2010]\n                    1 SLR 1 at [41]). In other words, as pertinently observed inLaw of Intellectual Property of Singapore(at\n                    para 30.1.50): … the skilled addressee assesses the obviousness of an invention by\n                        reference to the whole of the state of the art relevant to this invention,\n                        whereas he assesses the novelty of the invention by reference to each\n                        individual piece of prior art in this state of the art. There is, however,\n                        an exception to this scenario: ‘mosaicing’ is not permitted in\n                        the obviousness inquiry if it would not be obvious to the skilled addressee\n                        to ‘mosaic’ the different pieces of prior art. 94     In the present case, itwouldbe fair to mosaic\n                    the various pieces of prior art outlined earlier for the purposes of identifying\n                    any inventive step contained in the Patent. The ASA Patent, the Matsushita\n                    Patent, the Shinkawa Patent and the AFC 800 are all obviously concerned\n                    with the business of handling wafer dies, either for the purposes of sorting or\n                    bonding. The notional skilled addressee would not find it too far-fetched to\n                    mosaic these pieces of prior art to form a considered view of the state of the\n                    art. 95     If, however, in order to arrive at the subject-matter of a claim, it is\n                    necessary to make a mosaic of extracts from documents published over a period of\n                    time, taking suggestions from one with suggestions from others independent of\n                    it, there can be little doubt that the claim has inventive\n                    subject-matter. 96     The point in the preceding paragraph, notwithstanding, even allowing for\n                    “mosaicing”, there is still the need for the state of the art to\n                    be considered asa wholefor the purposes of\n                    locating whether any inventive step exists in the patent being considered (in\n                    this case, the Patent). To this end, a more global approach is appropriate and\n                    the pieces of prior art will therefore not be examined individuallyvis-à-visthe Patent. In any event, we pause to observe\n                    that even if the Patent was compared individually against each of the pieces of\n                    prior art, the result would have been (particularly having regard to our\n                    analysis in the context of the issue of novelty) ana\n                        fortiorione simply because (as we have seen) none of the\n                    individual patents relied upon by the Respondent was as comprehensive as a\n                    mosaic of extracts constructed from these very same patents. Indeed, as we have\n                    seen, some of these patents were, viewed from an individual perspective, clearly\n                    lacking what the Patent possessed (for example, in the context of optical\n                    inspection). Put simply, the “mosaicing” of the various extracts from the individual\n                    patents relied upon by the Respondent would, in fact, present the case for the\n                    Respondentin its strongest possible light. 97     In the Appellant’s cross-examination of Mr Briar, it was suggested\n                    that the ASA Patent “taught away” from the use of two pickup\n                    heads because of concomitant issues associated with such use. According to the\n                    Appellant, the ASA Patent proceeded on the premise that the number of\n                    pickup heads had to beincreasedto improve\n                    throughput. In other words, the more pickup heads, the more dies that could be\n                    picked up, and the greater the productivity of the machine. Accordingly, in the\n                    ASA Patent, a rotating turret which rotated 360 degrees so as to allow\n                    for apluralityof pickup heads was opted for\n                    (which isunlikethetwopickup heads which forms the basis ofthe\n                        Patent). Since the turret was to be about 20 cm in diameter,\n                    the risk of centrifugal force causing the die to fly off the pickup heads was\n                    addressed by slowing down the speed of the turret’s rotation. By going\n                    against this conventional wisdom that “taught away” from using\n                    only two pickup heads, the Appellant argued, the Patent had shown that it\n                    involved an inventive step that was not obvious to the notional skilled man. The\n                    Patent had, accordingly, passed the fourth stage of theWindsurfingtest. 98     With respect, however, the Judge appeared to have misunderstood the\n                    Appellant’s argument when he stated thus (see the GD at [41]): In answer to the[Appellant’s] criticism that the ASA Patent in\n                        fact “teaches away” from the use of two pick up heads, the\n                        [Respondent’s] expert states that the ASA Patent teaches that two\n                        heads may be employed but it also acknowledges that there is a risk of the\n                        die flying off as a result of centrifugal force where two heads are used.\n                        However, as an engineer and one skilled in the art, he would simply slow\n                        down the rotation speed to address this risk. With four heads, the distance\n                        travelled during rotation is reduced and, at the same speed, centrifugal\n                        force would also be reduced. Speed of throughput is an important concern in\n                        the semiconductor industry. Another way of addressing the risk of\n                        centrifugal force is to make improvements to the equipment used, such as\n                        increasing the strength of vacuum suction of the pick up heads. 99     The fact that the ASA Patent “teaches that two heads may be\n                    employed” doesnotmake it similar to (let\n                    alone the same as) the Patent. Indeed, as Mr Briar himself admitted (and as\n                    noted by the Judge in the passage of his judgment quoted in the preceding\n                    paragraph), the employment oftwoheads is, in\n                    fact, an apparent non-starterpreciselybecause\n                    (as the Judge noted in the same passage) the ASA Patent “also\n                    acknowledges that there is a risk of the die flying off as a result of\n                    centrifugal force where two heads are used”, as a result of which the\n                    employment offourheads was recommended instead.\n                    This same admission is also to be found in the Respondent’s Case\n                    (“the RC”), where it is stated (in a similar vein) that the use of\n                    two heads was considered a “regression”.[note: 59]In the circumstances, therefore, the Patent has indeed adopted an\n                    inventive step by choosing to go withtwopickup\n                    heads –and two pickup heads only. Interestingly, too,\n                    there appear to have been no technical hitches with the employment of two pickup\n                    heads by the Patent as evidenced by the commercial success of the Patent which\n                    we will touch upon briefly below (at[104]–[107]). 100    The fact that the ASA Patent, the Matsushita Patent and the National\n                    Semiconductor Patent all employed more than two pickup heads (advocating, for\n                    most part, the use of a “pluralityof\n                    nozzles” or a “pluralityof\n                    stations”) only serves to throw the inventive nature of the step taken by\n                    the Appellant into starker relief. As was noted by Jacob LJ in the English\n                    Court of Appeal decision ofPozzoli SpA v BDMO SA[2007] FSR 37 at [27]: Patentability is justified because the prior idea which was thought not to\n                        work must, as a piece of prior art, be taken as it would be understood by\n                        the person skilled in the art. He will read it with the prejudice of such a\n                        person. So that which forms part of the state of the art really consists of\n                        two things in combination, the ideaandthe\n                        prejudice that it would not work or be impractical.A\n                            patentee who contributes something new by showing that, contrary to the\n                            mistaken prejudice, the idea will work or is practical has shown\n                            something new. He has shown that an apparent “lion in\n                        the path” is merely a paper tiger. Then his contribution is novel and\n                        non-obvious and he deserves his patent. [emphasis added in bold\n                        italics] It should be noted thattwoprejudices were\n                    overcome here by the Appellant: the prejudiceagainstthe use of two heads,andthe prejudicein favourof multiple heads. 101    It should further be noted that Mr Briar’sremovalof two pickup heads from the ASA Patent, in order\n                    to form a two-headed ASA Patent device,[note: 60]is a classic case ofex post factoreasoning. It is trite law that the fourth step of theWindsurfingtest is to be applied without assuming knowledge of\n                    the invention. The inventor himself did not have the advantage that hindsight\n                    brings. In the House of Lords decision ofNon-Drip Measure\n                        Coy Ld v Stranger’s Ld and Others(1943) 60 RPC 135\n                        (“Non-Drip Measure Coy Ld”), for\n                    example, Lord Russell of Killowen stated (at 142): Nothing is easier than to say, after the event, that the thing was obvious\n                        and involved no invention. The words of Moulton L.J. ([in]British Westinghouse Coy. V. Braulik[(1910)\n                        27 RPC 209 at 230]) may well be called to mind in this connection:\n                            - “I confess … that I view with\n                        suspicion arguments to the effect that a new combination, bringing with it\n                        new and important consequences in the shape of practical machines, is not an\n                        invention, because, when it has once been established, it is easy to show\n                        how it might be arrived at by starting from something known, and taking a\n                        series of apparently easy steps. Thisex post\n                            factoanalysis of invention is unfair to the inventors and,\n                        in my opinion it is not countenanced by English patent law.” As Chao Hick Tin JA, delivering the judgment of this court inPeng Lian Trading Co(at [28]) observed (which views\n                    were cited and applied inDextra Asia Co Ltd(at\n                    [68])): It is all too easy to say, after the event, that the thing was obvious and\n                        involved no invention.Ex post factoanalysis\n                        can often be unfair to inventors [citingNon-Drip Measure\n                            Coy Ld]. And, in a similar vein, the learned author ofLaw of\n                        Intellectual Property of Singaporealso observes as follows (at\n                    para 30.1.49): The fourth step in theWindsurfingapproach\n                        is where the assessment for obviousness is made. In fact, the fourth step is\n                        the critical question; the first three steps merely laying the ground work\n                        for this final question. The valuable guide given in the fourth step is that\n                        the assessment must be made without the benefit of hindsight (i.e. without the benefit of the information\n                        available after the priority date). One must guard against anex post factoanalysis because this would be unfair\n                        to inventors. In the circumstances, that portion of Mr Briar’s expert report\n                    should be given little - or no -\n                    weight. 102    It should be further noted also that the upgrade fromonepickup head, as embodied in the Shinkawa Patent, to two in\n                    the Patent, also constitutes a ground for finding an inventive step on the part\n                    of the Appellant’s invention. The simplicity of the invention does not\n                    mean that the invention is obvious, or lacking in any inventive step. Simplicity\n                    is simply no bar to inventiveness, and this point has been noted in various\n                    local decisions (see, for example, the decision of this court inPeng Lian Trading Co(at [29]) and inFirst Currency Choice Pte Ltd(at [51]) as well as that of the\n                    Singapore High Court inInstitut Pasteur v Genelabs\n                        Diagnostics Pte Ltd[2000] SGHC 53 at [197] (affirmed by\n                    this court inGenelabs Diagnostics) and inDextra Asia Co Ltd(at\n                        [68]-[69])). Indeed, as a leading expert in the field has\n                    very pithily observed (seeLaw of Intellectual Property of\n                        Singapore(at para 30.1.53): The simplicity of the invention does not mean that the invention is\n                        obvious. The irrelevance of this factor has been noted in various cases, and\n                        described in various ways. Thus, it has been said that simplicity is no bar\n                        to inventiveness, that simplicity is not equivalent to obviousness, and that\n                        inventiveness is not synonymous with complexity. In this case, the inventive step comprises the insertion of a through opening\n                    in the middle of a two-headed pickup assembly, from a normal opaque one-headed\n                    assembly. 103    Finally, in doing away with the need for a mirror/prism system to establish an\n                    optical connection line to the next wafer dieand combining\n                        this methodwith the innovation of two pickup heads rotating\n                    about a transverse opening, the Appellant’s inventive step becomes a\n                    significantly larger one. The Matsushita Patent had established a system for\n                    direct vertical inspection, but this in itself did not lead to trulyconcurrentinspection and pickup. Mr Boh (see[80]above) gave evidence of the state\n                    of the art relating to two-headed pickups, stating that:[note: 61] [i]f we are adopting a two-head flipper, any experienced technical person\n                        would know when we do a clockwise and anti-clockwise, it will have a\n                        consistent stopping accuracy. If you do a continuous turning, you will have\n                        a cumulative error that eventually affect[s] the stopping accuracy. So a\n                        sound technical person, when you using a two-head flipper, we will go for\n                        clockwise and anti-clockwise motion … However, Mr Boh’s testimony didnotshow that a two-headed pickup would be able to facilitate concurrent inspection\n                    and pickup. By combining these two examples of prior art – vertical\n                    optical inspection and alternating clockwise/anti-clockwise rotation –\n                    with a new concept, the transverse openingwithinthe middle of the pivoting dual-headed pickup assembly (not merely gaps between\n                    a “plurality of nozzles”), the Appellant had come up with an\n                    invention that was not at all obvious to the notional skilled person. In other\n                    words, even “mosaicing” together myriad pieces of prior art, the\n                    Appellant was still able to come up with a patent that involved an inventive\n                    step which satisfied the requirements of theWindsurfingtest. As already emphasised above (at[101]), one must assiduously avoidex post factorationalisation. Indeed, as the popular\n                    adage goes, “Hindsight is 20/20 vision.”",
        "Commercial success of the Patent": "104    Finally, a few short observations on the role of commercial success in the\n                    context of patent disputes are in order. The Judge was careful to state in the\n                    GD (at [47]) that commercial success alone is not a conclusive for the purposes\n                    of an inquiry into novelty or the presence of an inventive step (see[9]above): Where commercial success of an invention is concerned, this factor alone\n                        is not conclusive. A product that sells well is not necessarily novel or one\n                        involving an inventive step. Good advertising, marketing and pricing could\n                        also play a part. Similarly, the Respondent asserts that the ostensibly greater\n                    productivity engendered by the Patent could also be attributed to factorsotherthan the supposed novelty or the\n                    presence of any inventive step:[note: 62] It is clear that there are many factors that determine/affect the\n                        throughput of flip chip machines. Mr Briar clearly explained that the\n                        downstream or subsequent processes (after flipping) dictate the speed of the\n                        whole system and that die sorters (like the [Appellant’s] DS 10\n                        000) would perform differently in terms of throughput compared to a die\n                        bonder (like the ASA AFC 800 or the purposes intended under the\n                        ASA Patent) even if all such machines share the same pick and place\n                        concept (i.e. concurrent vision inspection of the\n                            2ndchip to be picked up through the gap\n                        or through opening afforded between the 2 pick up heads as the\n                            1stchip is being rotated through\n                        180°). 105    It is undeniable, however, that the Patent has succeeded in increasing\n                    throughput in a significant fashion. Comparing like with like, we see that the\n                    National Semiconductor Patent, a “multi-station rotary die handling\n                        device”,[note: 63]can only manage throughputs of between 5,000 and 6,000 units\n                    per hour. The Appellant’s invention, a “device for inspecting and\n                    rotating electronic components”,[note: 64]is able to handle throughputs of up to 20,000 units per hour.\n                    Both of these are die sorters and handlers rather than bonders. 106    To date, only four units of the AFC 800 have been sold while the\n                    Appellant has sold more than 100 of its die sorter machines using the system\n                    outlined in the Patent.[note: 65] 107    While the fact of increased throughput and higher sales are arguably not\n                    conclusive as to matters of novelty and obviousness, in the light of our earlier\n                    discussion, we take the view that these factsdofunction in some measure, not least by way of confirmatory evidence of the\n                    novelty and obviousness of the Patent. Indeed, the factor of “commercial\n                    success” has been approved and applied by both this court (inFE Global Electronics(at [47])) as well as by the\n                    Singapore High Court (inTrek Technology(at\n                        [100]-[102] (affirmed inFE Global\n                        Electronics);Ng Kok Cheng(at\n                    [44]); andDextra Asia Co Ltd(at\n                        [70]-[72])) in considering and finding inventiveness. And\n                    the following observations in a leading local textbook (in the context of the\n                    issue of obviousness) succinctly describe what is, in fact, the situation in so\n                    far as the Patent is concerned (seeLaw of Intellectual\n                        Property of Singapore(at para 30.1.52)): Commercial success enjoyed by the patented invention may also indicate\n                        that the invention was not obvious. The reason why commercial success can be\n                        [a] relevant factor has been explained in this way: commercial success is an\n                        indication that the patented invention meets a long-felt need in the\n                        industry and, if the invention was obvious, why was it not done before?\n                        However, commercial success is not conclusive of the non-obviousness of the\n                        invention. The inventor who is relying on this factor must convince the\n                        tribunal that the commercial success of the patented invention is credited\n                        to the invention itself, and not because of other factors such as clever\n                        advertising gimmicks.",
        "Conclusion": "108    In any event, for the reasons we have already set out above, the Patent is\n                    both novel and non-obviousvis-à-visthe prior art\n                    in the sphere of die handling. Accordingly, full protection should be accorded\n                    to this valuable contribution to the state of the art by the Appellant. We\n                    therefore allow the appeal with costs and with the usual consequential orders.\n                    We also grant the Appellant a certificate of contested validity in respect of\n                    the Patent pursuant to s 72 of the Act. In the circumstances, it also\n                    follows that the Appellant’s correspondence with the Respondent (in\n                    particular, that embodied in its letter dated 5 July 2006[note: 66]) could not have constituted a groundless threat pursuant to\n                    s 77 of the Act. 109    We would also like to make a few observations about the length of written\n                    cases submitted to this court. In this particular appeal, for example, both the\n                    AC as well as the RC were extremely lengthy (the former exceeding 300 pages\n                    and the latter exceeding 100 pages). This court has not, in fact, placed a\n                    cap on the maximum number of pages on the respective parties’ cases. This\n                    is because it hears a myriad of cases over the entire spectrum of the law, all\n                    of which vary in complexity (both in relation to the facts as well as to the\n                    law). On occasion, therefore (particularly in a case involving a complex factual\n                    matrix and/or novel questions of law), a case may indeed be (justifiably) very lengthy.However, the key\n                        consideration in so far as this court is concerned is whether or not the\n                        central thrust(s) of the party’s appeal in the case at hand is clearly\n                        stated in as persuasive a manner as possible. To this end, anoverlylengthy submission maynot necessarilyachieve this end. On the contrary, the\n                    overall persuasiveness of the case may bediminished or\n                        dilutedby an overly lengthy submission that may well serve\n                    (instead) to cloud or obscure the central thrust(s) of the party’s case\n                    rather than advance them. Put simply, the modern adage that “Less is\n                    more” might well apply instead. There is the understandable desire for\n                    all counsel to err on the side of thoroughness. That having been said, a balance\n                    must always be struck between thoroughness on the one hand and the clarity (and,\n                    hence, persuasiveness) of the case advanced on behalf of one’s client on\n                    the other. 110    Returning to the present appeal, although both counsel were extremely thorough\n                    in the presentation of their respective cases to this court, they had, with\n                    respect, swung far too much to that particular side of the pendulum. Whilst we\n                    commend their spirit of thoroughness, we must also state (again, with respect)\n                    that the clarity of their respective cases suffered as a result. The court had\n                    to wade through far too many unnecessary pages of analysis in order to\n                    understand what, in the final analysis, were the key issues of the appeal (as\n                    outlined and decided upon above). Indeed, as Rajah JA aptly put it inFirst Currency Choice Pte Ltd(at [1]),\n                    although “[t]he courts often have the unenviable task of choosing between\n                    seemingly intractable opposing views … often, apparently complex\n                    technical issues when properly understood and assessed, do yield to common-sense\n                    and relatively straightforward answers”. As we have seen above, this case\n                    is, in fact, no exception. 111    That having been stated, we must emphasise once again that there is no magical\n                    formula as to length. The best approach is, as already mentioned above, to\n                    ensure that the central thrust(s) of one’s case are stated in as clear and\n                    as persuasive a manner as possible. In this regard, depending on the factual and\n                    legal complexity of the case, each counsel should strive to state only as much\n                    as will achieve this result. It might be helpful to both counsel as well as to\n                    the court if the former could state – in no more than one to two pages\n                    – the central issues, facts as well as arguments by way ofan executive summarywhich is appended to the case\n                    concerned, preferably at thecommencementof that\n                    case. In fairness, summaries of a rough and ready nature were to be found in the\n                    respective parties’ cases in the context of the present appeal. However,\n                    they tended to be pitched attoo generala level\n                    and did not focus on the respective nubs of the cases themselves. 112    Infactuallycomplex cases, counsel could,\n                    additionally, list – in a succinct table – the key facts that need\n                    to be considered by the court. Finally, in alegallycomplex case, counsel could also list the key legal\n                    issues as well as analysis and conclusion(s); if necessary, this could even take\n                    the form of a flow chart. All these could also be appended to the executive\n                    summary mentioned in the preceding paragraph. 113    We emphasise that these are merely suggestions that might not always apply to\n                    the myriad of situations that come before this court. However, there is, in our\n                    view, much merit in counsel being as clear as possible in as simple a manner as\n                    possible (without sliding into oversimplification or reductionism). In this\n                    respect, we do not rule out other innovative methods of presenting a case\n                    although we would emphasise that there should not be innovation only for its own\n                    sake.",
        "APPENDIX A": "The Appellant’s Patent[Source: Appellant’s Case at 48 (arrows indicating\n                        direction of rotation inserted)]APPENDIX BThe ASA Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        365]APPENDIX CThe AFC 800, incorporating the ASA Patent[Source: Appellant’s Case at 108 (observation\n                        inserted)]APPENDIX DThe Matsushita Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        297]APPENDIX EThe National Semiconductor Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        325]APPENDIX FThe Shinkawa Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        235][note: 1]Appellant’s Core Bundle (“ACB”) Vol II\n                                Part A at pp 108-110.[note: 2]For a clearer exposition, please refer to the graphical\n                                representations of these claims at pp 45-46 of the\n                                Appellant’s Case (“AC”). The key reference Nos\n                                to note in the graphical representations are: 23 (optical\n                                facility/camera), 14 (pivoting part), 19 and 20 (pickup\n                                heads located at opposite ends of the pivoting part) and\n                                17 (through opening in centre of pivoting part allowing for\n                                camera to inspect the next wafer chip in line).[note: 3]Appellant’s Skeletal Arguments at para 30.[note: 4]AC at para 376. Note, especially, the table provided\n                                comparing the correspondence of multiple portions of the GD with the\n                                relevant views tendered by the Respondent’s expert,\n                                Mr John Briar (“Mr Briar”).[note: 5]ACB Vol II Part B at p 365.[note: 6]ACB Vol II Part B at p 332.[note: 7]ACB Vol II Part B at p 336.[note: 8]ACB Vol II Part B at p 339.[note: 9]ACB Vol II Part B at pp 343-344.[note: 10]ACB Vol II Part B at p 341.[note: 11]ACB Vol II Part B at p 333.[note: 12]ACB Vol II Part B at p 353.[note: 13]See generally ACB Vol II Part B at\n                                pp 356-358.[note: 14]ACB Vol II Part B at p 353.[note: 15]AC at p 108.[note: 16]See the accompanying diagram at para 169 of the AC.[note: 17]See the expert report of the appellant’s expert witness,\n                                Associate Professor Tay Meng Leong\n                                (“A/P Tay”) in ACB Vol II Part A at\n                                p 176. According to A/P Tay, “the checking is\n                                probably done when the disc is rotated by about\n                                45 degrees”.[note: 18]See ACB Vol II Part B at p 297.[note: 19]ACB Vol II Part B at p 300A.[note: 20]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 21]See Appendix I of the expert report of Mr Briar in ACB\n                                Vol II Part B at pp 256-269 for a very useful\n                                graphical representation of this work process.[note: 22]See ACB Vol II Part A at p 137.[note: 23]See United States patent No 5,839,187 at column 6 in ACB\n                                Vol II Part B at p 301.[note: 24]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 25]See also ACB Vol II Part A at p 165.[note: 26]“Three heads are provided around a center rod of a head\n                                assembly; they horizontally rotate around the center rod.”\n                                (see Abstract, United States Patent No 5,839,187 in ACB\n                                Vol II Part B at p 293).[note: 27]See the Respondent’s Case (“RC”) at\n                                para 5.81.[note: 28]See ACB Vol II Part B at p 325.[note: 29]See Abstract, United States patent No 6,364,089 B1 in ACB\n                                Vol II Part B at p 322.[note: 30]The diagrams in ACB Vol II Part B at pp 324-325\n                                    (ie, FIGS 2 and 3) are\n                                crucial for understanding the operation of the National\n                                Semiconductor Patent.[note: 31]ACB Vol II Part B at p 227.[note: 32]See United States patent No 6,364,089 B1 at column 5 in\n                                ACB Vol II Part B at p 329.[note: 33]See ACB Vol II Part B at p 323.[note: 34]ACB Vol II Part B at pp 270-280.[note: 35]ACB Vol II Part B at p 228.[note: 36]See ACB Vol II Part B at p 233.[note: 37]See Abstract, United States patent No 6,311,391 B1 in ACB\n                                Vol II Part B at p 307. See also the diagram of the\n                                Shinkawa Patent on the same page and the larger diagrams\n                                illustrating the rotation of the vacuum suction chucking nozzle on\n                                the pages following (at pp 308-309).[note: 38]For a detailed description of this process, see United States\n                                patent No 6,311,391 B1 at column 4 in ACB Vol II\n                                Part B at p 317. The diagrams referred to in the footnote\n                                above are also helpful – observe the periscope-like nature of\n                                the optical recognition device, albeit oriented horizontally.[note: 39]For reference, see generally United States patent\n                                No 6,311,391 B1 in ACB Vol II Part B at\n                                pp 317–321 for the three different embodiments of the\n                                Shinkawa Patent.[note: 40]See ACB Vol II Part B at p 213.[note: 41]See ACB Vol II Part B at pp 293, 307, 322 and\n                                332.[note: 42]ACB Vol II Part B at p 339.[note: 43]ACB Vol II Part B at pp 343-344.[note: 44]See[66]above and[89]-[90]below, where the significance of\n                                the difference between inspectionthrough a\n                                    pivoting partand inspectionwhen\n                                    the pivoting part has moved out of the wayis\n                                explained in greater detail.[note: 45]See[97]–[100]below for a discussion on the\n                                differences between the utilisation oftwo pickup\n                                    headsand a“plurality of\n                                    nozzles”.[note: 46]RC at para 5.75.[note: 47]RC at para 6.64.[note: 48]RC at para 6.51.[note: 49]RC at para 6.60.[note: 50]See the Respondent’s Supplementary Core Bundle\n                                (“RSCB”) at p 198.[note: 51]See ACB Vol II Part B at pp 266-267.[note: 52]See “Device For Inspecting And Rotating Electronic\n                                Components” in ACB Vol II Part A at p 98. Also\n                                see[9]above, where this\n                                laborious process is described in simpler terms.[note: 53]See United States patent No 6,467,158 B1 in RSCB at\n                                p 197.[note: 54]See RC at para 5.58.[note: 55]See Abstract, United States patent No 6,364,089 B1 in\n                                ACB Vol II Part B at p 322.[note: 56]See ACB Vol II Part B at p 327.[note: 57]See ACB Vol II Part B at pp 233-235.[note: 58]See AC at paras 67-69. See also ACB Vol II Part A\n                                at pp 104 (lines 22-27) and 116 (FIG 6\n                                    - The available inspection angles during a\n                                360-degree rotation of the two-headed pickup are highlighted by the\n                                portions in the pie graph labelled 35 and 36).[note: 59]See RC at para 5.46.[note: 60]See ACB Vol II Part B at pp 236-237.[note: 61]See RSCB at p 198.[note: 62]See RC at para 6.51.[note: 63]See ACB Vol II Part B at p 322.[note: 64]See ACB Vol II Part A at p 96.[note: 65]See also the GD at [44].[note: 66]See ACB Vol II Part B at p 477.",
        "APPENDIX B": "The ASA Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        365]APPENDIX CThe AFC 800, incorporating the ASA Patent[Source: Appellant’s Case at 108 (observation\n                        inserted)]APPENDIX DThe Matsushita Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        297]APPENDIX EThe National Semiconductor Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        325]APPENDIX FThe Shinkawa Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        235][note: 1]Appellant’s Core Bundle (“ACB”) Vol II\n                                Part A at pp 108-110.[note: 2]For a clearer exposition, please refer to the graphical\n                                representations of these claims at pp 45-46 of the\n                                Appellant’s Case (“AC”). The key reference Nos\n                                to note in the graphical representations are: 23 (optical\n                                facility/camera), 14 (pivoting part), 19 and 20 (pickup\n                                heads located at opposite ends of the pivoting part) and\n                                17 (through opening in centre of pivoting part allowing for\n                                camera to inspect the next wafer chip in line).[note: 3]Appellant’s Skeletal Arguments at para 30.[note: 4]AC at para 376. Note, especially, the table provided\n                                comparing the correspondence of multiple portions of the GD with the\n                                relevant views tendered by the Respondent’s expert,\n                                Mr John Briar (“Mr Briar”).[note: 5]ACB Vol II Part B at p 365.[note: 6]ACB Vol II Part B at p 332.[note: 7]ACB Vol II Part B at p 336.[note: 8]ACB Vol II Part B at p 339.[note: 9]ACB Vol II Part B at pp 343-344.[note: 10]ACB Vol II Part B at p 341.[note: 11]ACB Vol II Part B at p 333.[note: 12]ACB Vol II Part B at p 353.[note: 13]See generally ACB Vol II Part B at\n                                pp 356-358.[note: 14]ACB Vol II Part B at p 353.[note: 15]AC at p 108.[note: 16]See the accompanying diagram at para 169 of the AC.[note: 17]See the expert report of the appellant’s expert witness,\n                                Associate Professor Tay Meng Leong\n                                (“A/P Tay”) in ACB Vol II Part A at\n                                p 176. According to A/P Tay, “the checking is\n                                probably done when the disc is rotated by about\n                                45 degrees”.[note: 18]See ACB Vol II Part B at p 297.[note: 19]ACB Vol II Part B at p 300A.[note: 20]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 21]See Appendix I of the expert report of Mr Briar in ACB\n                                Vol II Part B at pp 256-269 for a very useful\n                                graphical representation of this work process.[note: 22]See ACB Vol II Part A at p 137.[note: 23]See United States patent No 5,839,187 at column 6 in ACB\n                                Vol II Part B at p 301.[note: 24]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 25]See also ACB Vol II Part A at p 165.[note: 26]“Three heads are provided around a center rod of a head\n                                assembly; they horizontally rotate around the center rod.”\n                                (see Abstract, United States Patent No 5,839,187 in ACB\n                                Vol II Part B at p 293).[note: 27]See the Respondent’s Case (“RC”) at\n                                para 5.81.[note: 28]See ACB Vol II Part B at p 325.[note: 29]See Abstract, United States patent No 6,364,089 B1 in ACB\n                                Vol II Part B at p 322.[note: 30]The diagrams in ACB Vol II Part B at pp 324-325\n                                    (ie, FIGS 2 and 3) are\n                                crucial for understanding the operation of the National\n                                Semiconductor Patent.[note: 31]ACB Vol II Part B at p 227.[note: 32]See United States patent No 6,364,089 B1 at column 5 in\n                                ACB Vol II Part B at p 329.[note: 33]See ACB Vol II Part B at p 323.[note: 34]ACB Vol II Part B at pp 270-280.[note: 35]ACB Vol II Part B at p 228.[note: 36]See ACB Vol II Part B at p 233.[note: 37]See Abstract, United States patent No 6,311,391 B1 in ACB\n                                Vol II Part B at p 307. See also the diagram of the\n                                Shinkawa Patent on the same page and the larger diagrams\n                                illustrating the rotation of the vacuum suction chucking nozzle on\n                                the pages following (at pp 308-309).[note: 38]For a detailed description of this process, see United States\n                                patent No 6,311,391 B1 at column 4 in ACB Vol II\n                                Part B at p 317. The diagrams referred to in the footnote\n                                above are also helpful – observe the periscope-like nature of\n                                the optical recognition device, albeit oriented horizontally.[note: 39]For reference, see generally United States patent\n                                No 6,311,391 B1 in ACB Vol II Part B at\n                                pp 317–321 for the three different embodiments of the\n                                Shinkawa Patent.[note: 40]See ACB Vol II Part B at p 213.[note: 41]See ACB Vol II Part B at pp 293, 307, 322 and\n                                332.[note: 42]ACB Vol II Part B at p 339.[note: 43]ACB Vol II Part B at pp 343-344.[note: 44]See[66]above and[89]-[90]below, where the significance of\n                                the difference between inspectionthrough a\n                                    pivoting partand inspectionwhen\n                                    the pivoting part has moved out of the wayis\n                                explained in greater detail.[note: 45]See[97]–[100]below for a discussion on the\n                                differences between the utilisation oftwo pickup\n                                    headsand a“plurality of\n                                    nozzles”.[note: 46]RC at para 5.75.[note: 47]RC at para 6.64.[note: 48]RC at para 6.51.[note: 49]RC at para 6.60.[note: 50]See the Respondent’s Supplementary Core Bundle\n                                (“RSCB”) at p 198.[note: 51]See ACB Vol II Part B at pp 266-267.[note: 52]See “Device For Inspecting And Rotating Electronic\n                                Components” in ACB Vol II Part A at p 98. Also\n                                see[9]above, where this\n                                laborious process is described in simpler terms.[note: 53]See United States patent No 6,467,158 B1 in RSCB at\n                                p 197.[note: 54]See RC at para 5.58.[note: 55]See Abstract, United States patent No 6,364,089 B1 in\n                                ACB Vol II Part B at p 322.[note: 56]See ACB Vol II Part B at p 327.[note: 57]See ACB Vol II Part B at pp 233-235.[note: 58]See AC at paras 67-69. See also ACB Vol II Part A\n                                at pp 104 (lines 22-27) and 116 (FIG 6\n                                    - The available inspection angles during a\n                                360-degree rotation of the two-headed pickup are highlighted by the\n                                portions in the pie graph labelled 35 and 36).[note: 59]See RC at para 5.46.[note: 60]See ACB Vol II Part B at pp 236-237.[note: 61]See RSCB at p 198.[note: 62]See RC at para 6.51.[note: 63]See ACB Vol II Part B at p 322.[note: 64]See ACB Vol II Part A at p 96.[note: 65]See also the GD at [44].[note: 66]See ACB Vol II Part B at p 477.",
        "APPENDIX C": "The AFC 800, incorporating the ASA Patent[Source: Appellant’s Case at 108 (observation\n                        inserted)]APPENDIX DThe Matsushita Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        297]APPENDIX EThe National Semiconductor Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        325]APPENDIX FThe Shinkawa Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        235][note: 1]Appellant’s Core Bundle (“ACB”) Vol II\n                                Part A at pp 108-110.[note: 2]For a clearer exposition, please refer to the graphical\n                                representations of these claims at pp 45-46 of the\n                                Appellant’s Case (“AC”). The key reference Nos\n                                to note in the graphical representations are: 23 (optical\n                                facility/camera), 14 (pivoting part), 19 and 20 (pickup\n                                heads located at opposite ends of the pivoting part) and\n                                17 (through opening in centre of pivoting part allowing for\n                                camera to inspect the next wafer chip in line).[note: 3]Appellant’s Skeletal Arguments at para 30.[note: 4]AC at para 376. Note, especially, the table provided\n                                comparing the correspondence of multiple portions of the GD with the\n                                relevant views tendered by the Respondent’s expert,\n                                Mr John Briar (“Mr Briar”).[note: 5]ACB Vol II Part B at p 365.[note: 6]ACB Vol II Part B at p 332.[note: 7]ACB Vol II Part B at p 336.[note: 8]ACB Vol II Part B at p 339.[note: 9]ACB Vol II Part B at pp 343-344.[note: 10]ACB Vol II Part B at p 341.[note: 11]ACB Vol II Part B at p 333.[note: 12]ACB Vol II Part B at p 353.[note: 13]See generally ACB Vol II Part B at\n                                pp 356-358.[note: 14]ACB Vol II Part B at p 353.[note: 15]AC at p 108.[note: 16]See the accompanying diagram at para 169 of the AC.[note: 17]See the expert report of the appellant’s expert witness,\n                                Associate Professor Tay Meng Leong\n                                (“A/P Tay”) in ACB Vol II Part A at\n                                p 176. According to A/P Tay, “the checking is\n                                probably done when the disc is rotated by about\n                                45 degrees”.[note: 18]See ACB Vol II Part B at p 297.[note: 19]ACB Vol II Part B at p 300A.[note: 20]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 21]See Appendix I of the expert report of Mr Briar in ACB\n                                Vol II Part B at pp 256-269 for a very useful\n                                graphical representation of this work process.[note: 22]See ACB Vol II Part A at p 137.[note: 23]See United States patent No 5,839,187 at column 6 in ACB\n                                Vol II Part B at p 301.[note: 24]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 25]See also ACB Vol II Part A at p 165.[note: 26]“Three heads are provided around a center rod of a head\n                                assembly; they horizontally rotate around the center rod.”\n                                (see Abstract, United States Patent No 5,839,187 in ACB\n                                Vol II Part B at p 293).[note: 27]See the Respondent’s Case (“RC”) at\n                                para 5.81.[note: 28]See ACB Vol II Part B at p 325.[note: 29]See Abstract, United States patent No 6,364,089 B1 in ACB\n                                Vol II Part B at p 322.[note: 30]The diagrams in ACB Vol II Part B at pp 324-325\n                                    (ie, FIGS 2 and 3) are\n                                crucial for understanding the operation of the National\n                                Semiconductor Patent.[note: 31]ACB Vol II Part B at p 227.[note: 32]See United States patent No 6,364,089 B1 at column 5 in\n                                ACB Vol II Part B at p 329.[note: 33]See ACB Vol II Part B at p 323.[note: 34]ACB Vol II Part B at pp 270-280.[note: 35]ACB Vol II Part B at p 228.[note: 36]See ACB Vol II Part B at p 233.[note: 37]See Abstract, United States patent No 6,311,391 B1 in ACB\n                                Vol II Part B at p 307. See also the diagram of the\n                                Shinkawa Patent on the same page and the larger diagrams\n                                illustrating the rotation of the vacuum suction chucking nozzle on\n                                the pages following (at pp 308-309).[note: 38]For a detailed description of this process, see United States\n                                patent No 6,311,391 B1 at column 4 in ACB Vol II\n                                Part B at p 317. The diagrams referred to in the footnote\n                                above are also helpful – observe the periscope-like nature of\n                                the optical recognition device, albeit oriented horizontally.[note: 39]For reference, see generally United States patent\n                                No 6,311,391 B1 in ACB Vol II Part B at\n                                pp 317–321 for the three different embodiments of the\n                                Shinkawa Patent.[note: 40]See ACB Vol II Part B at p 213.[note: 41]See ACB Vol II Part B at pp 293, 307, 322 and\n                                332.[note: 42]ACB Vol II Part B at p 339.[note: 43]ACB Vol II Part B at pp 343-344.[note: 44]See[66]above and[89]-[90]below, where the significance of\n                                the difference between inspectionthrough a\n                                    pivoting partand inspectionwhen\n                                    the pivoting part has moved out of the wayis\n                                explained in greater detail.[note: 45]See[97]–[100]below for a discussion on the\n                                differences between the utilisation oftwo pickup\n                                    headsand a“plurality of\n                                    nozzles”.[note: 46]RC at para 5.75.[note: 47]RC at para 6.64.[note: 48]RC at para 6.51.[note: 49]RC at para 6.60.[note: 50]See the Respondent’s Supplementary Core Bundle\n                                (“RSCB”) at p 198.[note: 51]See ACB Vol II Part B at pp 266-267.[note: 52]See “Device For Inspecting And Rotating Electronic\n                                Components” in ACB Vol II Part A at p 98. Also\n                                see[9]above, where this\n                                laborious process is described in simpler terms.[note: 53]See United States patent No 6,467,158 B1 in RSCB at\n                                p 197.[note: 54]See RC at para 5.58.[note: 55]See Abstract, United States patent No 6,364,089 B1 in\n                                ACB Vol II Part B at p 322.[note: 56]See ACB Vol II Part B at p 327.[note: 57]See ACB Vol II Part B at pp 233-235.[note: 58]See AC at paras 67-69. See also ACB Vol II Part A\n                                at pp 104 (lines 22-27) and 116 (FIG 6\n                                    - The available inspection angles during a\n                                360-degree rotation of the two-headed pickup are highlighted by the\n                                portions in the pie graph labelled 35 and 36).[note: 59]See RC at para 5.46.[note: 60]See ACB Vol II Part B at pp 236-237.[note: 61]See RSCB at p 198.[note: 62]See RC at para 6.51.[note: 63]See ACB Vol II Part B at p 322.[note: 64]See ACB Vol II Part A at p 96.[note: 65]See also the GD at [44].[note: 66]See ACB Vol II Part B at p 477.",
        "APPENDIX D": "The Matsushita Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        297]APPENDIX EThe National Semiconductor Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        325]APPENDIX FThe Shinkawa Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        235][note: 1]Appellant’s Core Bundle (“ACB”) Vol II\n                                Part A at pp 108-110.[note: 2]For a clearer exposition, please refer to the graphical\n                                representations of these claims at pp 45-46 of the\n                                Appellant’s Case (“AC”). The key reference Nos\n                                to note in the graphical representations are: 23 (optical\n                                facility/camera), 14 (pivoting part), 19 and 20 (pickup\n                                heads located at opposite ends of the pivoting part) and\n                                17 (through opening in centre of pivoting part allowing for\n                                camera to inspect the next wafer chip in line).[note: 3]Appellant’s Skeletal Arguments at para 30.[note: 4]AC at para 376. Note, especially, the table provided\n                                comparing the correspondence of multiple portions of the GD with the\n                                relevant views tendered by the Respondent’s expert,\n                                Mr John Briar (“Mr Briar”).[note: 5]ACB Vol II Part B at p 365.[note: 6]ACB Vol II Part B at p 332.[note: 7]ACB Vol II Part B at p 336.[note: 8]ACB Vol II Part B at p 339.[note: 9]ACB Vol II Part B at pp 343-344.[note: 10]ACB Vol II Part B at p 341.[note: 11]ACB Vol II Part B at p 333.[note: 12]ACB Vol II Part B at p 353.[note: 13]See generally ACB Vol II Part B at\n                                pp 356-358.[note: 14]ACB Vol II Part B at p 353.[note: 15]AC at p 108.[note: 16]See the accompanying diagram at para 169 of the AC.[note: 17]See the expert report of the appellant’s expert witness,\n                                Associate Professor Tay Meng Leong\n                                (“A/P Tay”) in ACB Vol II Part A at\n                                p 176. According to A/P Tay, “the checking is\n                                probably done when the disc is rotated by about\n                                45 degrees”.[note: 18]See ACB Vol II Part B at p 297.[note: 19]ACB Vol II Part B at p 300A.[note: 20]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 21]See Appendix I of the expert report of Mr Briar in ACB\n                                Vol II Part B at pp 256-269 for a very useful\n                                graphical representation of this work process.[note: 22]See ACB Vol II Part A at p 137.[note: 23]See United States patent No 5,839,187 at column 6 in ACB\n                                Vol II Part B at p 301.[note: 24]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 25]See also ACB Vol II Part A at p 165.[note: 26]“Three heads are provided around a center rod of a head\n                                assembly; they horizontally rotate around the center rod.”\n                                (see Abstract, United States Patent No 5,839,187 in ACB\n                                Vol II Part B at p 293).[note: 27]See the Respondent’s Case (“RC”) at\n                                para 5.81.[note: 28]See ACB Vol II Part B at p 325.[note: 29]See Abstract, United States patent No 6,364,089 B1 in ACB\n                                Vol II Part B at p 322.[note: 30]The diagrams in ACB Vol II Part B at pp 324-325\n                                    (ie, FIGS 2 and 3) are\n                                crucial for understanding the operation of the National\n                                Semiconductor Patent.[note: 31]ACB Vol II Part B at p 227.[note: 32]See United States patent No 6,364,089 B1 at column 5 in\n                                ACB Vol II Part B at p 329.[note: 33]See ACB Vol II Part B at p 323.[note: 34]ACB Vol II Part B at pp 270-280.[note: 35]ACB Vol II Part B at p 228.[note: 36]See ACB Vol II Part B at p 233.[note: 37]See Abstract, United States patent No 6,311,391 B1 in ACB\n                                Vol II Part B at p 307. See also the diagram of the\n                                Shinkawa Patent on the same page and the larger diagrams\n                                illustrating the rotation of the vacuum suction chucking nozzle on\n                                the pages following (at pp 308-309).[note: 38]For a detailed description of this process, see United States\n                                patent No 6,311,391 B1 at column 4 in ACB Vol II\n                                Part B at p 317. The diagrams referred to in the footnote\n                                above are also helpful – observe the periscope-like nature of\n                                the optical recognition device, albeit oriented horizontally.[note: 39]For reference, see generally United States patent\n                                No 6,311,391 B1 in ACB Vol II Part B at\n                                pp 317–321 for the three different embodiments of the\n                                Shinkawa Patent.[note: 40]See ACB Vol II Part B at p 213.[note: 41]See ACB Vol II Part B at pp 293, 307, 322 and\n                                332.[note: 42]ACB Vol II Part B at p 339.[note: 43]ACB Vol II Part B at pp 343-344.[note: 44]See[66]above and[89]-[90]below, where the significance of\n                                the difference between inspectionthrough a\n                                    pivoting partand inspectionwhen\n                                    the pivoting part has moved out of the wayis\n                                explained in greater detail.[note: 45]See[97]–[100]below for a discussion on the\n                                differences between the utilisation oftwo pickup\n                                    headsand a“plurality of\n                                    nozzles”.[note: 46]RC at para 5.75.[note: 47]RC at para 6.64.[note: 48]RC at para 6.51.[note: 49]RC at para 6.60.[note: 50]See the Respondent’s Supplementary Core Bundle\n                                (“RSCB”) at p 198.[note: 51]See ACB Vol II Part B at pp 266-267.[note: 52]See “Device For Inspecting And Rotating Electronic\n                                Components” in ACB Vol II Part A at p 98. Also\n                                see[9]above, where this\n                                laborious process is described in simpler terms.[note: 53]See United States patent No 6,467,158 B1 in RSCB at\n                                p 197.[note: 54]See RC at para 5.58.[note: 55]See Abstract, United States patent No 6,364,089 B1 in\n                                ACB Vol II Part B at p 322.[note: 56]See ACB Vol II Part B at p 327.[note: 57]See ACB Vol II Part B at pp 233-235.[note: 58]See AC at paras 67-69. See also ACB Vol II Part A\n                                at pp 104 (lines 22-27) and 116 (FIG 6\n                                    - The available inspection angles during a\n                                360-degree rotation of the two-headed pickup are highlighted by the\n                                portions in the pie graph labelled 35 and 36).[note: 59]See RC at para 5.46.[note: 60]See ACB Vol II Part B at pp 236-237.[note: 61]See RSCB at p 198.[note: 62]See RC at para 6.51.[note: 63]See ACB Vol II Part B at p 322.[note: 64]See ACB Vol II Part A at p 96.[note: 65]See also the GD at [44].[note: 66]See ACB Vol II Part B at p 477.",
        "APPENDIX E": "The National Semiconductor Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        325]APPENDIX FThe Shinkawa Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        235][note: 1]Appellant’s Core Bundle (“ACB”) Vol II\n                                Part A at pp 108-110.[note: 2]For a clearer exposition, please refer to the graphical\n                                representations of these claims at pp 45-46 of the\n                                Appellant’s Case (“AC”). The key reference Nos\n                                to note in the graphical representations are: 23 (optical\n                                facility/camera), 14 (pivoting part), 19 and 20 (pickup\n                                heads located at opposite ends of the pivoting part) and\n                                17 (through opening in centre of pivoting part allowing for\n                                camera to inspect the next wafer chip in line).[note: 3]Appellant’s Skeletal Arguments at para 30.[note: 4]AC at para 376. Note, especially, the table provided\n                                comparing the correspondence of multiple portions of the GD with the\n                                relevant views tendered by the Respondent’s expert,\n                                Mr John Briar (“Mr Briar”).[note: 5]ACB Vol II Part B at p 365.[note: 6]ACB Vol II Part B at p 332.[note: 7]ACB Vol II Part B at p 336.[note: 8]ACB Vol II Part B at p 339.[note: 9]ACB Vol II Part B at pp 343-344.[note: 10]ACB Vol II Part B at p 341.[note: 11]ACB Vol II Part B at p 333.[note: 12]ACB Vol II Part B at p 353.[note: 13]See generally ACB Vol II Part B at\n                                pp 356-358.[note: 14]ACB Vol II Part B at p 353.[note: 15]AC at p 108.[note: 16]See the accompanying diagram at para 169 of the AC.[note: 17]See the expert report of the appellant’s expert witness,\n                                Associate Professor Tay Meng Leong\n                                (“A/P Tay”) in ACB Vol II Part A at\n                                p 176. According to A/P Tay, “the checking is\n                                probably done when the disc is rotated by about\n                                45 degrees”.[note: 18]See ACB Vol II Part B at p 297.[note: 19]ACB Vol II Part B at p 300A.[note: 20]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 21]See Appendix I of the expert report of Mr Briar in ACB\n                                Vol II Part B at pp 256-269 for a very useful\n                                graphical representation of this work process.[note: 22]See ACB Vol II Part A at p 137.[note: 23]See United States patent No 5,839,187 at column 6 in ACB\n                                Vol II Part B at p 301.[note: 24]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 25]See also ACB Vol II Part A at p 165.[note: 26]“Three heads are provided around a center rod of a head\n                                assembly; they horizontally rotate around the center rod.”\n                                (see Abstract, United States Patent No 5,839,187 in ACB\n                                Vol II Part B at p 293).[note: 27]See the Respondent’s Case (“RC”) at\n                                para 5.81.[note: 28]See ACB Vol II Part B at p 325.[note: 29]See Abstract, United States patent No 6,364,089 B1 in ACB\n                                Vol II Part B at p 322.[note: 30]The diagrams in ACB Vol II Part B at pp 324-325\n                                    (ie, FIGS 2 and 3) are\n                                crucial for understanding the operation of the National\n                                Semiconductor Patent.[note: 31]ACB Vol II Part B at p 227.[note: 32]See United States patent No 6,364,089 B1 at column 5 in\n                                ACB Vol II Part B at p 329.[note: 33]See ACB Vol II Part B at p 323.[note: 34]ACB Vol II Part B at pp 270-280.[note: 35]ACB Vol II Part B at p 228.[note: 36]See ACB Vol II Part B at p 233.[note: 37]See Abstract, United States patent No 6,311,391 B1 in ACB\n                                Vol II Part B at p 307. See also the diagram of the\n                                Shinkawa Patent on the same page and the larger diagrams\n                                illustrating the rotation of the vacuum suction chucking nozzle on\n                                the pages following (at pp 308-309).[note: 38]For a detailed description of this process, see United States\n                                patent No 6,311,391 B1 at column 4 in ACB Vol II\n                                Part B at p 317. The diagrams referred to in the footnote\n                                above are also helpful – observe the periscope-like nature of\n                                the optical recognition device, albeit oriented horizontally.[note: 39]For reference, see generally United States patent\n                                No 6,311,391 B1 in ACB Vol II Part B at\n                                pp 317–321 for the three different embodiments of the\n                                Shinkawa Patent.[note: 40]See ACB Vol II Part B at p 213.[note: 41]See ACB Vol II Part B at pp 293, 307, 322 and\n                                332.[note: 42]ACB Vol II Part B at p 339.[note: 43]ACB Vol II Part B at pp 343-344.[note: 44]See[66]above and[89]-[90]below, where the significance of\n                                the difference between inspectionthrough a\n                                    pivoting partand inspectionwhen\n                                    the pivoting part has moved out of the wayis\n                                explained in greater detail.[note: 45]See[97]–[100]below for a discussion on the\n                                differences between the utilisation oftwo pickup\n                                    headsand a“plurality of\n                                    nozzles”.[note: 46]RC at para 5.75.[note: 47]RC at para 6.64.[note: 48]RC at para 6.51.[note: 49]RC at para 6.60.[note: 50]See the Respondent’s Supplementary Core Bundle\n                                (“RSCB”) at p 198.[note: 51]See ACB Vol II Part B at pp 266-267.[note: 52]See “Device For Inspecting And Rotating Electronic\n                                Components” in ACB Vol II Part A at p 98. Also\n                                see[9]above, where this\n                                laborious process is described in simpler terms.[note: 53]See United States patent No 6,467,158 B1 in RSCB at\n                                p 197.[note: 54]See RC at para 5.58.[note: 55]See Abstract, United States patent No 6,364,089 B1 in\n                                ACB Vol II Part B at p 322.[note: 56]See ACB Vol II Part B at p 327.[note: 57]See ACB Vol II Part B at pp 233-235.[note: 58]See AC at paras 67-69. See also ACB Vol II Part A\n                                at pp 104 (lines 22-27) and 116 (FIG 6\n                                    - The available inspection angles during a\n                                360-degree rotation of the two-headed pickup are highlighted by the\n                                portions in the pie graph labelled 35 and 36).[note: 59]See RC at para 5.46.[note: 60]See ACB Vol II Part B at pp 236-237.[note: 61]See RSCB at p 198.[note: 62]See RC at para 6.51.[note: 63]See ACB Vol II Part B at p 322.[note: 64]See ACB Vol II Part A at p 96.[note: 65]See also the GD at [44].[note: 66]See ACB Vol II Part B at p 477.",
        "APPENDIX F": "The Shinkawa Patent[Source: Appellant’s Core Bundle Vol II Part B at\n                        235][note: 1]Appellant’s Core Bundle (“ACB”) Vol II\n                                Part A at pp 108-110.[note: 2]For a clearer exposition, please refer to the graphical\n                                representations of these claims at pp 45-46 of the\n                                Appellant’s Case (“AC”). The key reference Nos\n                                to note in the graphical representations are: 23 (optical\n                                facility/camera), 14 (pivoting part), 19 and 20 (pickup\n                                heads located at opposite ends of the pivoting part) and\n                                17 (through opening in centre of pivoting part allowing for\n                                camera to inspect the next wafer chip in line).[note: 3]Appellant’s Skeletal Arguments at para 30.[note: 4]AC at para 376. Note, especially, the table provided\n                                comparing the correspondence of multiple portions of the GD with the\n                                relevant views tendered by the Respondent’s expert,\n                                Mr John Briar (“Mr Briar”).[note: 5]ACB Vol II Part B at p 365.[note: 6]ACB Vol II Part B at p 332.[note: 7]ACB Vol II Part B at p 336.[note: 8]ACB Vol II Part B at p 339.[note: 9]ACB Vol II Part B at pp 343-344.[note: 10]ACB Vol II Part B at p 341.[note: 11]ACB Vol II Part B at p 333.[note: 12]ACB Vol II Part B at p 353.[note: 13]See generally ACB Vol II Part B at\n                                pp 356-358.[note: 14]ACB Vol II Part B at p 353.[note: 15]AC at p 108.[note: 16]See the accompanying diagram at para 169 of the AC.[note: 17]See the expert report of the appellant’s expert witness,\n                                Associate Professor Tay Meng Leong\n                                (“A/P Tay”) in ACB Vol II Part A at\n                                p 176. According to A/P Tay, “the checking is\n                                probably done when the disc is rotated by about\n                                45 degrees”.[note: 18]See ACB Vol II Part B at p 297.[note: 19]ACB Vol II Part B at p 300A.[note: 20]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 21]See Appendix I of the expert report of Mr Briar in ACB\n                                Vol II Part B at pp 256-269 for a very useful\n                                graphical representation of this work process.[note: 22]See ACB Vol II Part A at p 137.[note: 23]See United States patent No 5,839,187 at column 6 in ACB\n                                Vol II Part B at p 301.[note: 24]See United States patent No 5,839,187 at column 7 in ACB\n                                Vol II Part B at p 302.[note: 25]See also ACB Vol II Part A at p 165.[note: 26]“Three heads are provided around a center rod of a head\n                                assembly; they horizontally rotate around the center rod.”\n                                (see Abstract, United States Patent No 5,839,187 in ACB\n                                Vol II Part B at p 293).[note: 27]See the Respondent’s Case (“RC”) at\n                                para 5.81.[note: 28]See ACB Vol II Part B at p 325.[note: 29]See Abstract, United States patent No 6,364,089 B1 in ACB\n                                Vol II Part B at p 322.[note: 30]The diagrams in ACB Vol II Part B at pp 324-325\n                                    (ie, FIGS 2 and 3) are\n                                crucial for understanding the operation of the National\n                                Semiconductor Patent.[note: 31]ACB Vol II Part B at p 227.[note: 32]See United States patent No 6,364,089 B1 at column 5 in\n                                ACB Vol II Part B at p 329.[note: 33]See ACB Vol II Part B at p 323.[note: 34]ACB Vol II Part B at pp 270-280.[note: 35]ACB Vol II Part B at p 228.[note: 36]See ACB Vol II Part B at p 233.[note: 37]See Abstract, United States patent No 6,311,391 B1 in ACB\n                                Vol II Part B at p 307. See also the diagram of the\n                                Shinkawa Patent on the same page and the larger diagrams\n                                illustrating the rotation of the vacuum suction chucking nozzle on\n                                the pages following (at pp 308-309).[note: 38]For a detailed description of this process, see United States\n                                patent No 6,311,391 B1 at column 4 in ACB Vol II\n                                Part B at p 317. The diagrams referred to in the footnote\n                                above are also helpful – observe the periscope-like nature of\n                                the optical recognition device, albeit oriented horizontally.[note: 39]For reference, see generally United States patent\n                                No 6,311,391 B1 in ACB Vol II Part B at\n                                pp 317–321 for the three different embodiments of the\n                                Shinkawa Patent.[note: 40]See ACB Vol II Part B at p 213.[note: 41]See ACB Vol II Part B at pp 293, 307, 322 and\n                                332.[note: 42]ACB Vol II Part B at p 339.[note: 43]ACB Vol II Part B at pp 343-344.[note: 44]See[66]above and[89]-[90]below, where the significance of\n                                the difference between inspectionthrough a\n                                    pivoting partand inspectionwhen\n                                    the pivoting part has moved out of the wayis\n                                explained in greater detail.[note: 45]See[97]–[100]below for a discussion on the\n                                differences between the utilisation oftwo pickup\n                                    headsand a“plurality of\n                                    nozzles”.[note: 46]RC at para 5.75.[note: 47]RC at para 6.64.[note: 48]RC at para 6.51.[note: 49]RC at para 6.60.[note: 50]See the Respondent’s Supplementary Core Bundle\n                                (“RSCB”) at p 198.[note: 51]See ACB Vol II Part B at pp 266-267.[note: 52]See “Device For Inspecting And Rotating Electronic\n                                Components” in ACB Vol II Part A at p 98. Also\n                                see[9]above, where this\n                                laborious process is described in simpler terms.[note: 53]See United States patent No 6,467,158 B1 in RSCB at\n                                p 197.[note: 54]See RC at para 5.58.[note: 55]See Abstract, United States patent No 6,364,089 B1 in\n                                ACB Vol II Part B at p 322.[note: 56]See ACB Vol II Part B at p 327.[note: 57]See ACB Vol II Part B at pp 233-235.[note: 58]See AC at paras 67-69. See also ACB Vol II Part A\n                                at pp 104 (lines 22-27) and 116 (FIG 6\n                                    - The available inspection angles during a\n                                360-degree rotation of the two-headed pickup are highlighted by the\n                                portions in the pie graph labelled 35 and 36).[note: 59]See RC at para 5.46.[note: 60]See ACB Vol II Part B at pp 236-237.[note: 61]See RSCB at p 198.[note: 62]See RC at para 6.51.[note: 63]See ACB Vol II Part B at p 322.[note: 64]See ACB Vol II Part A at p 96.[note: 65]See also the GD at [44].[note: 66]See ACB Vol II Part B at p 477."
    }
}