{
    "case_title": "Siemens AG\n      v\n      Holdrich Investment Ltd",
    "ncitation": "[2010] SGCA 23",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Introduction": "1       This was an appeal by the defendant in the main\n                    action (“Siemens AG”) against the decision of the judge in\n                    chambers (“the Judge”) granting the plaintiff\n                    (“Holdrich”) leave to serve the originating process out of\n                    jurisdiction. The Judge’s grounds of decision are reported inHoldrich Investment Ltd v Siemens AG[2010]\n                    1 SLR 1237 (“the GD”). We dismissed the appeal after\n                    hearing oral arguments and now give our reasons for doing so.",
        "The relevant legal principles": "2       The requirements which must be met before the\n                    court will grant leave for service out of jurisdiction are well settled. For\n                    present purposes, it is sufficient to adopt the three major considerations\n                    stated by Prof Jeffery Pinsler SC inSingapore\n                        Court Practice 2009(LexisNexis, 2009) at para 11/2/5.\n                    First, the claim must come within the scope of one or more of the paragraphs of\n                    O 11 r 1 of the Rules of Court (Cap 322, R 5, 2006 Rev\n                    Ed). Second, the claim must have a sufficient degree of merit. Third, Singapore\n                    must be theforum conveniens. 3       In the court below, Holdrich sought and obtained\n                    leave for service out of jurisdiction in anex\n                        parteapplication heard by an assistant registrar. The service\n                    out of jurisdiction was resisted by Siemens AG, who succeeded in having the\n                    order set aside in aninter partesapplication\n                    heard by another assistant registrar on the ground that Singapore was not theforum conveniensor natural forum for trying\n                    the substantive dispute between the parties. The second assistant registrar also\n                    found that there had been material non-disclosure on the part of Holdrich when\n                    it applied for leave for service out of jurisdiction, but that finding was not\n                    pertinent to the disposal of this appeal. Holdrich then appealed to the Judge,\n                    who held that Singapore was theforum conveniensand, accordingly, reinstated the grant of leave for service out of\n                    jurisdiction. 4       On appeal to this court, the focus was likewise\n                    on the issue offorum conveniens; Siemens AG\n                    did not dispute that the first and second considerations referred to in[2]above were satisfied. Mr Gregory\n                    Vijayendran, on behalf of Siemens AG, made two preliminary points. First,\n                    he argued that, as a matter of approach, a Singapore court deciding the issue offorum conveniensshould compare all the\n                    connecting factors pointing towards Singapore against all the connecting factors\n                    pointing away from Singapore. We were unable to agree that that was the right\n                    way of addressing the issue. The purpose of theforum\n                        conveniensanalysis is to identify the most appropriate forum in\n                    which to try the substantive dispute. It is wrong to say that Singapore isforum non convenienssimply because the\n                    connecting factors which point to Singapore are outweighed by all the connecting\n                    factors which point away from Singapore. The connecting factors which point away\n                    from Singapore must point to a more appropriate forum than Singapore, and they\n                    might not do so if those connections are dispersed amongst several\n                    jurisdictions. Quite simply, Singapore isforum non\n                        conveniensonly if there is a more appropriate forum than\n                    Singapore. 5       Mr Vijayendran next argued that the Judge\n                    wrongly directed himself on the burden of proof when he stated the issue before\n                    him to be “whether Singapore [was] forum non conveniens, because if it\n                    [was], then the appeal should be dismissed, and vice versa” (see [2] of\n                    the GD). Mr Vijayendran correctly pointed out that Lord Goff of\n                    Chieveley, in his leading speech inSpiliada Maritime\n                        Corporation v Cansulex Ltd[1987] AC 460\n                        (“Spiliada”), thelocus classicusin this area, held (at 480) that a\n                    plaintiff who sought leave for service out of jurisdiction bore the burden of\n                    proving that the court from which leave was sought was theforum conveniens, whereas a defendant who resisted service\n                    within jurisdiction bore the burden of proving that the court whose jurisdiction\n                    was being resisted wasforum non conveniens.\n                    Mr Vijayendran also referred to various instances in Lord Goff’s\n                    speech where his Lordship spoke of the need to show that the court in question\n                    was “clearly”forum conveniensorforum non\n                        conveniens, as the case might be (see,eg,Spiliadaat 481). The short\n                    answer to Mr Vijayendran’s argument is that any error which the Judge\n                    might have made as regards the burden of proof is immaterial given his finding,\n                    which he pronounced immediately after stating the issue before him in the manner\n                    indicated above, that “Singapore wasclearlythe more appropriate forum” [emphasis added] (see\n                    [2] of the GD). 6       We would make the following further observations\n                    on the burden of proof point. The existence of a fact which shows that a\n                    jurisdiction is theforum conveniensorvice versais a question of fact, and the party who\n                    alleges the fact bears the burden of proving it. In contrast, the question of\n                    whether, on a given set of facts, a jurisdiction isforum non\n                        conveniensorvice versais a\n                    question of law, albeit not a general question since the answer necessarily\n                    depends on, and is confined to, that particular set of facts. The reason why the\n                    cases refer, perhaps confusingly, to the burden of proving that a particular\n                    jurisdiction isforum conveniensorforum non conveniensis this. The jurisdiction of the\n                    court is, in the first place, territorial, as reflected in the expression\n                    “within jurisdiction”, which neatly fuses the territorial and\n                    juridical elements (see J J Fawcett & J M Carruthers,Cheshire, North & Fawcett: Private International\n                        Law(Oxford University Press, 14th Ed, 2008) at p 354).\n                    At the same time, the law in this and other jurisdictions has come to recognise\n                    that the physical location of a defendant may not be a decisive or even material\n                    consideration in deciding whether or not the court should exercise jurisdiction\n                    over a dispute – Lord Goff inSpiliadagave (at 481) the example of a defendant whose place of residence was no more\n                    than a tax haven, and commented that “no great importance should be\n                    attached” to the defendant’s place of residence in such a\n                    scenario. 7       However, in recognition of the primarily\n                    territorial nature of the court’s jurisdiction, the court begins with the\n                    location of the defendant when it decides whether it has jurisdiction over a\n                    dispute – thus, jurisdiction over a defendant who is within the territory\n                    is as of right, while jurisdiction over a defendant who is outside the territory\n                    is discretionary. In this sense, there is a burden –viz, the burden of displacing theprima facieweight given to the location of the\n                    defendant. But, despite the use of the term, the burden is not strictly one of\n                    proof. Instead, the burden is one of demonstrating the normative weight to be\n                    given to each connecting factor in the light of all the circumstances of the\n                    case. The ease of discharging the burden would similarly depend on the facts of\n                    each case – again, as Lord Goff himself noted inSpiliada(at 481), the circumstances described in the English\n                    equivalent of our O 11 r 1 are “of great variety, ranging from\n                    cases where … the discretion would normally be exercised in favour of\n                    granting leave … to cases where the grant of leave is far more\n                    problematical”. In the same vein, Lord Goff also remarked (at 481)\n                    that the importance to be attached to any particular ground invoked by the\n                    plaintiff in seeking leave for service out of jurisdiction might vary from case\n                    to case. 8       Separately, we do not think that it is necessary\n                    for a plaintiff who seeks leave for service out of jurisdiction to show that\n                    Singapore is “clearly” theforum\n                        conveniensif, by this, it is meant that Singapore must be not\n                    only the most appropriate forum in the final analysis, but also the most\n                    appropriate forum by far. No doubt, there will be cases where theforum conveniensis clear beyond contest. But, in the\n                    case of an international dispute where the connecting factors are finely\n                    balanced, arequirementthat there must be a forum\n                    which isclearlythe most appropriate forum would\n                    necessarily condemn the dispute to jurisdictional limbo. Such a result does the\n                    doctrine offorum non conveniensno credit. In our\n                    view, therefore, it is sufficient for a plaintiff seeking leave for service out\n                    of jurisdiction to show that Singapore is, on balance and in the final analysis,\n                    the most appropriate forum to try the dispute, and it matters not whether\n                    Singapore is the most appropriate forum by a hair or by a mile.",
        "Application to the facts": "9       In this case, the connecting factors point to\n                    diverse jurisdictions. Siemens AG was incorporated in Germany and has its\n                    principal place of business there, while Holdrich was incorporated in Hong Kong\n                    and has its principal place of business there. The parties’ dispute in the\n                    main action arises from a consultancy agreement entered into between the parties\n                    on 21 August 2003 (“the Consultancy Agreement”), whereby\n                    Siemens AG agreed to pay commission to Holdrich for its consultancy\n                    services if orders were “received by SIEMENS”[note: 1]from certain entities in Sweden,\n                    Israel, Austria and India. The Consultancy Agreement was later amended to remove\n                    Israel and to include the Nordic regions, and was thereafter amended again to\n                    include Indonesia. It was expressed to be governed by Singapore law; there was,\n                    however, no express choice of forum. 10     In its statement of claim, Holdrich is\n                    claiming commission in respect of its services in helping to secure a contract\n                    between two Indonesian entities,viz,\n                    PT Hutchinson CP Telecommunications and PT Siemens Indonesia. The main\n                    issue is whether Holdrich is entitled to commission when contracts are concluded\n                    with members of the Siemens group (in this case, PT Siemens Indonesia)\n                    other than Siemens AG itself. Holdrich says “yes”, and, in\n                    support of its claim, refers to correspondence from an employee of Siemens\n                    Network GmbH & Co, KG (“Siemens GmbH”), which, according\n                    to Holdrich, amounted to an admission of liability on behalf of Siemens AG.\n                    Siemens AG says “no”, and proposes to call two of its\n                    ex-employees to explain the context in which the Consultancy Agreement was\n                    concluded. Siemens AG also intends to call the employee of\n                    Siemens GmbH who is said to have made the admission of liability. These\n                    persons are said to be located in Germany. There was some mention before the\n                    Judge of the need to call witnesses from the two Indonesian entities, but this\n                    was not emphasised by either side on appeal. In addition, Dr Ingo Gehring,\n                    a senior legal counsel of Siemens AG, deposed that Siemens AG is\n                    currently being investigated by German public prosecutors in relation to\n                    possibly illegal agreements including the Consultancy Agreement. No further\n                    details were given. 11     Against this factual backdrop,\n                    Mr Vijayendran raised several practical points which he said militated in\n                    favour of Germany as theforum conveniens. He said\n                    that the two ex-employees proposed to be called by Siemens AG as witnesses\n                    were located in Germany, and the same applied to the documentary evidence\n                    proposed to be adduced by Siemens AG. He also mentioned that there would be\n                    a need for Siemens AG’s evidence to be translated into English if\n                    that evidence were to be received by a Singapore court. We were unable to attach\n                    much significance to these points. The physical location of witnesses is no\n                    longer a vital or even very material consideration with the advent of video-link\n                    technology (see,eg,Peters\n                        Roger May v Pinder Lillian Gek Lian[2006] 2 SLR(R) 381\n                    at sub-para (e) of [26] and [27]). This appliesa\n                        fortiorito the physical location of documents. The translation\n                    point which Mr Vijayendran raised was at best ambivalent or neutral since\n                    it was not suggested that translation would pose insuperable difficulties, and\n                    since there would also be a need for Holdrich’s evidence to be translated\n                    if the trial were to take place in Germany. We also took note of the fact that\n                    the Consultancy Agreement and the documentary evidence exhibited thus far,\n                    including the documents emanating from Siemens AG itself, are all in\n                    English, thus suggesting that English is thelingua\n                        francaof the parties and that, if anything, an English-speaking\n                    forum is preferable. 12     With regard to the ongoing investigations by\n                    German public prosecutors into Siemens AG’s agreements (see[10]above), in the absence of further details, we\n                    were unable to make anything out of the fact that such investigations are\n                    currently underway. Nothing specific was shown as to how the outcome of the\n                    German investigations would impact the civil claim in the Singapore proceedings.\n                    The point was also made that the German authorities might not release the\n                    documents which were held by them. This was purely speculative and no real\n                    reasons were addressed to us as to why that would be so or why the German\n                    authorities would not allow copies of documents in their possession to be made\n                    for the purposes of foreign proceedings. 13     It seemed clear to us that the only factor\n                    which decisively connected both parties and their dispute to a jurisdiction was\n                    the parties’ choice of Singapore law as the governing law for the\n                    Consultancy Agreement. In this regard Mr N Sreenivasan argued on\n                    behalf of Holdrich that “in the absence of any express choice of\n                    jurisdiction, [the] choice of Singapore law [was] an implied choice of Singapore\n                        jurisdiction”.[note: 2]On the other hand,\n                    Mr Vijayendran argued that specifying a choice of governing law was not\n                    quite the same as specifying a choice of forum, not least because the parties to\n                    a contract might stop short of selecting a jurisdiction as the forum for dispute\n                    resolution on top of selecting that jurisdiction’s law as the governing\n                    law of the contract precisely because they did not want to litigate in that\n                    jurisdiction. While we thought that Mr Sreenivasan might have overstated\n                    his argument on this point and that the general proposition made by\n                    Mr Vijayendran was to be preferred, this would still leave the court with\n                    the task of deciding the weight to be given to the parties’ choice of\n                    governing law in all the circumstances of the case. 14     In our view, since the connecting factors to\n                    other jurisdictions were ambivalent in the present case, the parties’\n                    choice of Singapore law as the governing law of the Consultancy Agreement must\n                    necessarily and inevitably assume a greater degree of importance.\n                    Mr Vijayendran took a contrary view, arguing that the choice of Singapore\n                    law was of limited weight since there were only factual issues in dispute. We\n                    disagreed. As we mentioned earlier (see[10]above), the main issue between the parties is whether the Consultancy Agreement\n                    extends to contracts obtained by members of the Siemens group other than\n                    Siemens AG itself. This is either a question of contractual interpretation\n                    or a question on the implication of a term in fact. Both are mixed questions of\n                    fact and law – the context in which the Consultancy Agreement was\n                    concluded is a question of fact, while the interpretation to be accorded to that\n                    agreement and the terms (if any) to be implied in the light of that context\n                    involve questions of law which are to be answered with reference to the\n                    principles governing the interpretation of contracts and the implication of\n                    contractual terms. We hasten to add that these principles are, of course, not so\n                    unique or difficult that they can only be applied by a Singapore court. However,\n                    we would reiterate the oft-emphasised point that in the absence of\n                    countervailing circumstances, there is much to be said for a Singapore court\n                    applying Singapore law, and likewise for a foreign court applying its own law\n                    (seeRickshaw Investments Ltd and another v Nicolai Baron von\n                        Uexkull[2007] 1 SLR(R) 377 (“Rickshaw Investments”) at [42] andJohn Reginald Stott Kirkham and others v Trane US Inc and others[2009] 4 SLR(R) 428 at [44]). As Prof Adrian Briggs observed,\n                    when one jurisdiction seeks to apply the law of another, “there is always\n                    a risk that too much will get lost in translation” (see “A Map or\n                    a Maze: Jurisdiction and Choice of Law in the Court of Appeal” (2007)\n                    11 SYBIL 123 at p 125). 15     In this regard, the absence of any strong\n                    connecting factors here other than the parties’ choice of Singapore law as\n                    the governing law of the Consultancy Agreement can be contrasted with the\n                    circumstances in the case relied on by Mr Vijayendran,viz,Macsteel Commercial Holdings (Pty) Ltd\n                        & Anor v Thermasteel V (Canada) Inc & Anor[1996] CLC 1403. In that case, the English Court of Appeal held that\n                    the strong connections to the Canadian province of Ontario were not displaced\n                    simply because English law was the proper law of the contract in issue. This was\n                    especially so since Ontario was a common law jurisdiction and, therefore, the\n                    Ontario courts would not, presumably, encounter any great difficulty in applying\n                    English contract law. We think this was what Sir Thomas Bingham MR\n                    (with whom Millett and Pill LJJ agreed) meant when he said (at\n                    1407–1408): In certain circumstances, as Lord Goff pointed out [inSpiliada], it [ie, the\n                        parties’ choice of governing law] is a factor of importance, in\n                        particular, where there is some distinction or some arguable distinction\n                        between the law[s] of the two competing jurisdictions. But there is no\n                        suggestion in the evidence that the law of England and the law of Ontario\n                        are in any way different on the apparently straightforward issues raised by\n                        this dispute. … … … [The judge at first instance] wrongly, in my judgment, on the\n                        facts of this case, attributed much too great weight to the choice of\n                        English law in a matter in which no difference between the competing laws\n                        was shown … 16     In contrast, the alternative forum here is\n                    Germany, acivil lawjurisdiction. In the absence\n                    of more evidence than what has been shown to us, we cannot, with respect, say\n                    that the German courts would be able to fluently apply Singapore law. In any\n                    case, however fluent the German courts might be in applying Singapore law, it\n                    would surely be far more appropriate for a Singapore court to apply Singapore\n                    law. 17     Mr Vijayendran also argued that the Judge\n                    wrongly appliedRickshaw Investmentswhen he held\n                    (at [6] of the GD) that: The parties had agreed on Singapore law as the governing law and this is\n                        an important consideration even though there is no other connection to\n                        Singapore. There are many instances today where parties from different\n                        countries have decided on Singapore law as a neutral choice and due regard\n                        must be given to this factor, as was done in Rickshaw Investments… We did not agree with Mr Vijayendran on this\n                        point. It was clear to us, reading the GD as a whole, that the Judge was, as\n                        he should, deciding theforum conveniensissue\n                        on the facts of the case, and was only referring – quite correctly\n                        – to Rickshaw Investments as an example\n                        of a case where choice of law issues were closely scrutinised in order to\n                        decide a question of jurisdiction. 18     Separately, Mr Vijayendran sought to\n                    downplay the importance of the parties’ choice of Singapore law as the\n                    governing law of the Consultancy Agreement by arguing that\n                    Siemens GmbH’s authority to make admissions of liability on behalf of\n                    Siemens AG was governed by German law. Mr Vijayendran did not press\n                    this argument, and, in any event, we were unable to agree with it for two\n                    reasons. First, the admissions of liability said to be made by Siemens GmbH\n                    are, at best, only part of the circumstances to be taken into account in\n                    determining how the Consultancy Agreement should be interpreted and what implied\n                    terms (if any) should be read into it. Therefore, even assuming that German law\n                    governs the question of Siemens GmbH’s authority to make admissions\n                    of liability on Siemens AG’s behalf, it will still be of subsidiary\n                    importance to Singapore law, which governs the overall questions of contractual\n                    interpretation and implication of contractual terms. Second, we would think that\n                    there is an argument to be made that, for the purposes of a contract, questions\n                    of agency between the contracting parties ought also to be governed by the\n                    proper law of the contract. However, given that (as just mentioned) German law\n                    would in any case be of subsidiary importance to Singapore law, we do not\n                    propose to express a concluded view on the matter. 19     We therefore agreed with the Judge that\n                    Singapore was theforum conveniensand that\n                    Holdrich should be granted leave for service out of jurisdiction. In concluding,\n                    we would reiterate that the purpose of theforum non\n                        conveniensanalysis is to identify themost\n                        appropriateforum to hear the substantive dispute. It is not an\n                    exercise in comparing the sheer number of connecting factors which point to this\n                    or that jurisdiction. What matters is the weight to be given to each connecting\n                    factor in the light of all the circumstances of the case. In a finely-balanced\n                    case such as the present, a single connecting factor could well be decisive. It\n                    is also well to remember that while the connecting factors may not always point\n                    decisively to only one jurisdiction, there must in every case be a most\n                    appropriate forum in which to try the dispute – as we said earlier, theforum non conveniensdoctrine would be brought\n                    into ridicule if it yields the result that an international dispute is stuck in\n                    jurisdictional limbo because the connecting factors are finely balanced. In this\n                    regard, it bears emphasis that while the analysis in a service out of\n                    jurisdiction case must necessarily begin with the principle that the plaintiff\n                    bears the burden of persuading the court that Singapore is theforum conveniens, this should not overly detain the\n                    court as it engages in the exercise of identifying the most appropriate forum on\n                    a close scrutiny of the facts before it.",
        "Conclusion": "20     For these reasons, we dismissed the appeal\n                    with costs and the usual consequential orders. At the invitation of both\n                    parties, we fixed the costs at $12,000 including disbursements.  [note: 1]See the Appellant’s Core Bundle at vol 2,\n                                p 9. [note: 2]See para 22 of the\n                                Respondent’s Case."
    }
}