{
    "case_title": "Ang Sin Hock\n      v\n      Khoo Eng Lim",
    "ncitation": "[2010] SGCA 17",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "The background": "",
        "Facts": "2       The material facts have been comprehensively as\n                    well as helpfully set out by the Judge in the Judgment and, hence, only a brief\n                    overview of the factual background is necessary for the purposes of the present\n                    appeal. 3       As already alluded above, the Appellant was the\n                    owner of the jewellery which he collected whilst working in India. The jewellery\n                    was formally owned by REDS Gemstones and Fine Jewelry (“REDS”), a\n                    business registered solely in the name of his wife, although the Appellant was\n                    thede factoowner as well as controller of this\n                    business. 4       In August 1998, the Appellant happened to meet\n                    the Respondent by chance in Chinatown, Singapore. The Respondent had a business\n                    dealing in commodities under the name\n                    “Delta-T & Associates”. Being former colleagues, the\n                    parties renewed their friendship and even decided to go into the jewellery\n                    business together. They set up a new business called “Delta\n                    Jewellery”, the purpose of which was to procure jewellery from India for\n                    processing and subsequent re-export to other markets. 5       On 15 January 1999, the Respondent\n                    introduced the Appellant to Singh. The Respondent and Singh were in business as\n                    traders of gemstones and precious metals and, indeed, their relationship was, as\n                    noted in the court below, by no means a casual one (see the Judgment at [10]).\n                    The purpose of this meeting was to discuss a business proposition, pursuant to\n                    which the Respondent and Singh would help to procure overseas buyers for the\n                    jewellery, with the proceeds of sale being divided amongst the three men. The\n                    meeting proceeded smoothly and the parties agreed that they would meet again for\n                    the Appellant to pass the jewellery to the Respondent and Singh. 6       On 16 January 1999, the Respondent met the\n                    Appellant at the latter’s home and they went together to the bank to\n                    retrieve the jewellery. Thereafter, they went to Singh’s residence where\n                    the jewellery was handed over to Singh by the Appellant. On 26 January\n                    1999, the Appellant prepared a consignment note on the REDS letterhead\n                    confirming consignment of the jewellery to:[note: 1] … Khoo Eng Lim (P/P No. 2504969A) [the Respondent] and Ajit\n                        Singh (P/P No. 1386867J) of Delta-T & Associates for the purpose of\n                        export outside Singapore. Delay in payment 7       Under the original terms of the consignment\n                    contract, the sale of the jewellery was supposed to be completed by the end of\n                    February 1999, and the Appellant was supposed to receive approximately $300,000\n                    from the sale. However, this did not materialise. Over the next six months,\n                    the parties continued to meet and the Appellant was given repeated reassurances\n                    as to when the sale would take place. During this period, the Appellant also\n                    mentioned to the Respondent and Singh that he was prepared to take action to\n                    either recover the jewellery or the sale proceeds if he did not receive the\n                    money. 8       On 6 September 1999, the Respondent\n                    requested the Appellant to prepare an invoice from REDS to\n                    Delta-T & Associates to document the payment of the sum of\n                    $270,725 to the Appellant for the Appellant’s share of the sale proceeds\n                    for the jewellery.[note: 2]The Appellant\n                    acceded to this request even though the amount of $270,725 was lower than the\n                    $300,000 previously agreed. The first police report 9       Notwithstanding the issuance of the invoice\n                    referred to in the preceding paragraph, the Appellant did not receive any money.\n                    Finally, on 3 January 2000, the Appellant’s patience ran out. He\n                    lodged a police report in relation to the consignment of the jewellery to the\n                    Respondent and Singh, and accused them of failing to pay him the sale proceeds\n                    as promised. The undertaking to pay 10     The police report certainly had the effect\n                    that the Appellant had desired. On 6 January 2000, the Respondent and Singh\n                    met the Appellant and gave him a written undertaking (“the\n                    Undertaking”) to pay him the sums owed. The material parts of the\n                    Undertaking read as follows:[note: 3] SALE OF REDS JEWELRY Please refer to your Report Ref No. C177509 made with the Commercial\n                        Crime Division, CID [ie, Criminal\n                        Investigation Department] on 3 January 2000 at 2.45 pm. We, Ajit Singh (I/C No. 1386867J) and Khoo Eng Lim (I/C\n                        No. 2504969A) [the Respondent] undertake on behalf of our buyer in\n                        Europe that we will arrange an amount of $270,725 being payment for the\n                        abovementioned. We have also confirmed that due to delayed payment by the\n                        buyer, we will pay interest at 1% per month of this principal amount\n                        effective from 16 Aug 1999 up to the date that the money is transferred\n                        to your account. The full payment, including interest will be transferred\n                        direct from Europe to your bank account in Singaporenot\n                            later than 29 Feb 2000or as soon as the buyer has made\n                        the payment. … [emphasis added] Further delay in payment 11     Under the terms of the Undertaking, the latest\n                    date of payment to the Appellant was 29 February 2000 (as embodied in the\n                    material words italicised in the preceding paragraph). Despite this, no money\n                    was received by the Appellant even after that particular date. The conversations\n                    between the Respondent and the Appellant continued, with the Appellant pressing\n                    for payment and the Respondent reassuring him that the money was forthcoming.\n                    Some of these communications are legally significant because they may possibly\n                    amount to acknowledgements of debt under the Act, which have the effect of\n                    extending the limitation period – a point which we will elaborate upon\n                    below. 12     Throughout this period, all the parties\n                    remained in contact with the police. The Respondent wrote several e-mails to the\n                    police informing them of his willingness to pay the Appellant. The Appellant was\n                    also briefed by the police whenever the latter received any updates from the\n                    Respondent regarding the proposed payment of the sale proceeds. The arrest of Singh 13     On 9 July 2001, Singh was arrested by the\n                    police. He was charged with dishonest appropriation of property under s 403\n                    of the Penal Code (Cap 224, 1985 Rev Ed) the following day. Singh\n                    initially claimed trial to the charge. However, no trial took place as he\n                    subsequently changed his mind and pleaded guilty and was sentenced\n                    accordingly. Commencement of legal action 14     On 1 November 2001, the Appellant\n                    instructed his lawyers to send the Respondent a letter of demand, demanding the\n                    sum of $300,000, with interest. The Respondent denied liability on the ground\n                    that the consignment of the jewellery was to Singh and that he had merely played\n                    the role of an intermediary. On 25 June 2002, the Appellant’s lawyers\n                    sent a further letter to the Respondent making further requests for payment.\n                    This was met with the same reply by the Respondent’s\n                lawyers. 15     Despite the fact that the Respondent never\n                    made any payment to the Appellant, the Appellant did not (presumably due to a\n                    lack of financial resources (see the Judgment at [32])) take any further legal\n                    action until17 April 2006, when the\n                    Appellant finally commenced legal action against both the Respondent and\n                    Singh.",
        "Proceedings at trial": "16     In the court below, the Appellant made\n                    multiple claims against the Respondent. These included: (a)     a claim based on the tort of\n                        conversion; (b)     a\n                        claim based on the tort of deceit for various fraudulent misrepresentations\n                        allegedly made by the Respondent and Singh to the Appellant;\n                    and (c)     a claim in\n                        contract for the recovery of the sale proceeds based on the\n                        Undertaking. 17     In response, the Respondent raised,inter alia, the following defences: (a)     In respect of the Appellant’s\n                        claim based on the tort of conversion, the Respondent argued that the\n                        jewellery belonged to REDS and, consequently, the Appellant had no standing\n                        to sue. Further, the jewellery had been entrusted to Singh alone and the\n                        Respondent had never undertaken any responsibility for them.A fortiori, the Respondent could not be said to have\n                        conspired with Singh in any way. (b)     In respect of the Appellant’s claim based on the\n                        tort of deceit, the Respondent argued that he did not make the\n                        representations with the intent to deceive the Appellant, thereby tricking\n                        him into handing over the jewellery. (c)     In respect of the Appellant’s claim in contract,\n                        the Respondent claimed that he was not liable because he had merely played\n                        the role of an intermediary and was not a party to the\n                    contract. (d)     Finally,\n                        the Respondent submitted that the Appellant’s claims were time-barred\n                        under the relevant provisions of the Act.",
        "The decision of the Judge": "18     After considering the evidence presented by\n                    both parties, the Judge dismissed all of the Appellant’s claims against\n                    the Respondent (it should be noted that Singh did not contest the\n                    Appellant’s claims and judgment was therefore entered against him for the\n                    sum of $270,725 and interest at 12% per annum from 16 August 1999 until\n                    payment as well as costs to be taxed or agreed). In summary, the Judge held\n                    that: (a)     The Appellant was the owner of the\n                        jewellery notwithstanding the fact that it was nominally owned by REDS.\n                        Further, the jewellery had been entrusted to the Respondent and Singh as\n                        joint bailees. However, the Appellant had consigned the jewellery to them\n                        for sale, and Singh’s act of selling the jewellery could not\n                        constitute an act of conversion either by the Respondent or Singh as the\n                        Appellant had, in the circumstances, authorised both the Respondent as well\n                        as Singh to sell the jewellery (see the Judgment at [65] and [67]). In any\n                        event, it was clear that the Appellant had waived his demand for the return\n                        of the jewellery and had accepted the money offered by the Respondent\n                        instead (see the Judgment at [65] and [66]). (b)     The evidence adduced by the Appellant was\n                        insufficient to demonstrate that the Respondent and Singh had acted\n                        fraudulently in order to deceive the Appellant to part with the jewellery.\n                        The arrangement concerned was, in fact, “a pure commercial\n                        transaction” (see the Judgment at [72]). In so far as the alleged\n                        (and subsequent) representations relating to the sale of the jewellery were\n                        concerned, the Respondent and Singh had merely made statements of intention\n                        as opposed to representations of fact (see the Judgment at [69]) and the\n                        Appellant had also not demonstrated how he had relied on the alleged\n                        representations to his detriment (see the Judgment at\n                    [69]). (c)     The\n                        Appellant entered into the consignment contract with both the Respondent and\n                        Singh, and the Appellant could sue the Respondent for the recovery of the\n                        sale proceeds. However, any action in contract that the Appellant could\n                        maintain against the Respondent was time-barred, even after taking into\n                        account the Undertaking made by the Respondent as well as the subsequent\n                        acknowledgments of liability (see the Judgment at\n                [84]).",
        "Issues raised on appeal": "19     The Appellant has challenged the Judge’s\n                    decision with respect to all three claims. In particular, he argued as\n                    follows: (a)     The Judge had erred in holding that the causes\n                    of action based on both breach of bailment as well as on conversion have not\n                    been made out against the Respondent. (b)     The Judge had erred in holding that the cause\n                    of action based on the tort of deceit had not been made out against the\n                    Respondent. (c)     The Judge had erred in holding that the\n                    monetary claim against the Respondent was time-barred under the\n                Act. (d)     The Appellant ought, in any event, to be able\n                    to surmount the problem of limitationviass 26(2) and 29 of the Act. 20     The Respondent, on the other hand, relied, in\n                    the main, on the Judge’s findings as well as reasoning. Significantly,\n                    though, the Respondent, whilst maintaining that he had nothing to do with the\n                    transaction concerned, nevertheless did not wish to disturb the finding of the\n                    Judge that the Appellant had, at best, a monetary claim against him (the\n                    Respondent) jointly and/or severally with Singh. Indeed, this finding is clear\n                    on the facts and evidence and there was, in our view, no ground for mounting a\n                    challenge to this particular finding of the Judge in the first\n                place. 21     We now turn to consider each of these issues.\n                    As we shall see, afurtherissue with regard to\n                    the monetary claim (cfissue (c) above) arose\n                    in the course of oral submissions and this, as we shall also see, is an issue of\n                    the first importance in the context of the present appeal, and will therefore\n                    also be addressed accordingly. However, before proceeding to consider the\n                    various issues raised in the present appeal, we would like to observe that we\n                    agree with the other related findings by the Judge and will therefore not\n                    consider them again in the present judgment. In particular, we agree with the\n                    finding by the Judge that the Respondent was, in fact, a party to the\n                    consignment contract and was also a joint bailee of the jewellery (see the\n                    Judgment at [40]-[53]).",
        "Does the Appellant have a claim against the Respondent in\n                conversion?": "22     The Judge found that the jewellery had been\n                    sold with the authorisation of the Appellant. Consequently, there were no\n                    grounds for alleging any act of conversion by the Respondent or Singh. On\n                    appeal, the Appellant challenged the Judge’s finding that the jewellery\n                    had been sold. In the alternative, the Appellant also challenged the\n                    Judge’s finding that the jewellery was sold with the Appellant’s\n                    authority. The Appellant argued that the sale of the jewellery in a piecemeal\n                    manner was unauthorised because he had intended the jewellery to be sold to a\n                    single buyer. We deal first with the alternative argument that there had been no\n                    authorisation for the sale before proceeding to consider the argument that there\n                    had been no sale to begin with.",
        "Did the Appellant authorise the sale of the jewellery?": "23     We reject the Appellant’s argument that\n                    the sale of the jewellery by Singh was unauthorised and therefore constituted an\n                    act of conversion. 24     First, it is undisputed that when the\n                    Appellant passed the jewellery to Singh and the Respondent, he did so without\n                    knowing to whom the jewellery would eventually be sold. In fact, at that\n                    particular point in time, all the parties had a common understanding that there\n                    might not even be a sale if Singh could not find buyers for the jewellery.\n                    Further, given this factual matrix, it is hard to believe that the Appellant\n                    would have refused to proceed with the sale if Singh had managed to find\n                    multiple buyers for different parts of the jewellery. 25     Indeed, there is no evidence to demonstrate\n                    that it was a term of the consignment contract that the jewellery had to be sold\n                    to a single buyer. In fact, the available evidence points in the opposite\n                    direction. In the Appellant’s own Statement of Claim, he repeatedly stated\n                    that the Respondent and Singh had represented to him that they would be able to\n                    procure “overseas buyers” for his jewellery.[note: 4]The use of the plural suggests that the\n                    Appellant himself considered it a possibility that the jewellery would be sold\n                    to multiple buyers. Although the Appellant also utilised the phrase\n                    “overseas buyer” in the singular, this merely suggests that the\n                    Appellant regarded the question of whether the jewellery had been sold to a\n                    single buyer or to multiple buyers as inconsequential. 26     Further, even after the Respondent had\n                    represented to the Appellant that the jewellery had been sold, there was not a\n                    single instance in which the Appellant inquired about either the manner of the\n                    sale or the identity of the buyer. All that he was concerned about was when he\n                    would be given his share of the sale proceeds. This suggests that the question\n                    of whether the jewellery was sold to a single buyer or to multiple buyers was\n                    totally unimportant to him. 27     Accordingly, even if Singh had indeed sold the\n                    jewellery in a piecemeal manner, this would not have constituted an act of\n                    conversion.",
        "Was there a sale?": "28     We turn now to consider whether or not the\n                    jewellery had indeed been sold. 29     Although the Appellant challenged vigorously\n                    the Judge’s finding that the jewellery had been sold, we are of the view\n                    that the point is moot as we agree with the Judge (at [66] of the Judgment) that\n                    any potential claim in conversion which the Appellant had against the Respondent\n                    could not succeed as the Appellant hadwaivedthis\n                    claim by electing to proceed against the Respondent pursuant to a monetary claim\n                    instead. 30     The doctrine of election between alternative\n                    and inconsistent rights was succinctly summarised by Stephen J in the High Court\n                    of Australia decision ofSargent v ASL Developments\n                        Limited(1974) 131 CLR 634, as follows (at 641-642): The doctrine of election as between two inconsistent legal rights is well\n                        established but certain of is features are not without their obscurities.\n                        The doctrine only applies if the rights are inconsistent the one with the\n                        other and it is this concurrent existence of inconsistent sets of rights\n                        which explains the doctrine; because they are inconsistent neither one may\n                        be enjoyed without the extinction of the other and that extinction confers\n                        upon the elector the benefit of enjoying the other, a benefit denied to him\n                        so long as both remained in existence. As Williston points out (Contracts, 3rd ed., vol. 5, par. 683) the doctrine\n                        is not out of harmony with the general rule that a binding surrender of a\n                        right requires a sealed release or consideration; by surrendering one right\n                        the elector thereby gains an advantage not previously enjoyed, the ability\n                        to exercise to the full the other, inconsistent right. In many instances what may pass for an application of the doctrine is in\n                        truth but the inevitable consequence of the party's conduct, a consequence\n                        that would follow even if no such doctrine existed. Thus in the common case\n                        of avoidance of a contract for breach it is not any doctrine of election\n                        that prevents the avoiding party subsequently from enforcing the contract\n                        but rather the fact that the contract has, by his act of avoidance, ceased\n                        to exist; such a situation is revealed by the facts discussed by\n                        Lindley J. inEvansv.Wyatt[(1880) 43 LT 176]. On the other hand if he\n                        chooses instead to keep the contract on foot and sue for damages rather than\n                        rescind for breach recourse must be had by the other party either to\n                        election or, if the facts will support it, to an estoppel if that breach\n                        should later be sought to be relied upon so as to avoid the contract. All\n                        this is made clear in the judgment of Jordan C.J. inO'Connorv.S. P. Bray Ltd.\n                        [(1936) 36 SR (NSW) 248 at 258—261]. In the present appeals the\n                        doctrine of election is directly in question since the issue is not whether\n                        following rescission the vendors may enforce the contracts but rather\n                        whether acts on their part consistent with the continued existence of the\n                        contracts prevent their subsequent purported rescission from being\n                        effective. Reference may also be made generally to K R Handley,Estoppel by Conduct and Election(Sweet & Maxwell, 2006) at ch 14. 31     In the present case, the Appellant’s\n                    claim for conversion in respect of the jewellery is plainly one that is\n                    inconsistent with a claim for the sale proceeds under the consignment contract.\n                    A claim in conversion is premised on the claimant’s immediate right to\n                    possession. Once the claimant treats the defendant’s actions as an\n                    authorised sale, and makes a claim for the proceeds, he loses the immediate\n                    right of possession to the chattel, and any previous right to a claim in\n                    conversion is extinguished. Here, having elected to claim the sale proceeds from\n                    the Respondent and Singh (as evidenced by the invoice he issued to them, as well\n                    as by his subsequent conduct), it necessarily follows that any claim the\n                    Appellant might have in conversion was extinguished at that particular\n                    juncture.",
        "Is the Respondent liable to the Appellant for fraudulent\n                misrepresentation?": "32     The alleged misrepresentations made by the\n                    Respondent can be divided into two categories. The first category includes\n                    representations made by the Respondent for the purpose of inducing the Appellant\n                    to hand the jewellery over to Singh. The second category consists of\n                    representations made by the Respondent to the effect that the jewellery had been\n                    sold and that the proceeds would be remitted to the Appellant. Let us consider\n                    each categoryseriatim.",
        "The first category of representations": "33     The law relating to the tort of fraudulent\n                    misrepresentation or deceit was recently set out by this court inWishing Star Ltd v Jurong Town Corp[2008]\n                    2 SLR(R) 909, as follows (at [16]–[18]): 16    The classic\n                            formulation of the tort of fraudulent misrepresentation or deceit is to\n                            be found in the judgment of Lord Herschell in the leading House of Lords\n                            decision ofDerry v Peek(1889) 14 App Cas\n                            337, where the learned law lord observed as follows (at\n                        374): First, in order to sustain an action of deceit, there must be proof of\n                            fraud, and nothing short of that will suffice. Secondly, fraud is proved\n                            when it is shewn that a false representation has been made (1)\n                            knowingly, or (2) without belief in its truth, or (3) recklessly,\n                            careless whether it be true or false. Although I have treated the second\n                            and third as distinct cases, I think the third is but an instance of the\n                            second, for one who makes a statement under such circumstances can have\n                            no real belief in the truth of what he states. To prevent a false\n                            statement [from] being fraudulent, there must, I think, always be an\n                            honest belief in its truth. And this probably covers the whole ground,\n                            for one who knowingly alleges that which is false, has obviously no such\n                            honest belief. Thirdly, if fraud be proved, the motive of the person\n                            guilty of it is immaterial. It matters not that there was no intention\n                            to cheat or injure the person to whom the statement was made. 17    The principles\n                            enunciated inDerry v Peekhave, in fact, been\n                            adopted in the local context (see, for example, the Singapore High Court\n                            decisions ofChop Ban Kheng v Chop Siang Huah and Latham &\n                                Co(1925) 2 MC 69 at 71 (affirmed on appeal (id at\n                            75-80), although the appeal did not involve the issue of fraud),Baker v Asia Motor Co Ltd[1962] MLJ 425 at\n                            426,Malayan Miners Co (M) Ltd v Lian Hock & Co[1965-1967] SLR(R) 307 at [22], andRaiffeisen\n                                Zentralbank Osterreich AG v Archer Daniels Midland Co[2007] 1 SLR(R) 196 at [38]; see also the decision of this\n                            court inPanatron Pte Ltd v Lee Cheow Lee[2001]\n                            2 SLR(R) 435 at\n                            [13]). 18    In the Singapore High\n                            Court decision ofNg Buay Hock v Tan Keng Huat[1997] 1 SLR(R) 507, Warren L H Khoo J observed\n                            (at [26]) that “[t]he essence of fraud is dishonesty”. As\n                            Lord Herschell put it inDerry v Peekat\n                            375: In my opinion making a false statement through want of care falls far\n                            short of, and is a very different thing from, fraud, and the same may be\n                            said of a false representation honestly believed though on insufficient\n                            grounds. In a similar vein, the learned law lord later observed thus\n                            (idat 376): I think mischief is likely to result from blurring the distinction\n                            between carelessness and fraud, and equally holding a man fraudulent\n                            whether his acts can or cannot be justly so designated. In a similar vein, Bowen LJ, in the English Court of\n                        Appeal decision ofAngus v Clifford[1891] 2 Ch\n                        449, observed, in relation to Lord Herschell’s statement inDerry v Peek(at 374) on false representations\n                        which are made “recklessly, careless whether [they] be true or\n                        false” (see[16]above), thus (at\n                        471): It seems to me that a second cause from which a fallacious view arises\n                            is from the use of the word “reckless.” Now, what is the\n                            old common law direction to juries? And it is not because I think that\n                            common law is better than equity that I go back to it - but it is\n                            because an action for deceit is a common law action - the old direction,\n                            time out of mind, was this, did he know that the statement was false,\n                            was he conscious when he made it that it was false, or if not, did he\n                            make it without knowing whether it was false, and without caring?Not caring, in that context, did not mean not taking care,\n                                it meant indifference to the truth, the moral obliquity which\n                                consists [of] a wilful disregard of the importance of truth\n                                ...[emphasis added] 34     It is not disputed that the Respondent had\n                    made various representations to the Appellant to the effect that he and Singh\n                    had contacts who dealt with jewellery and that they would be able to find buyers\n                    for the jewellery. What is being disputed, however, for the purposes of the\n                    present appeal, is whether the Respondent had acted with a fraudulent intent at\n                    the time he made these representations. 35     The testimony given by Singh suggests very\n                    strongly that the Respondent truly believed that Singh (whom he was in\n                    partnership with) had contacts for jewellery buyers and that they would be able\n                    to sell the jewellery to overseas buyers. According to Singh, the responsibility\n                    for selling the jewellery was his, and the Respondent had no idea who the\n                    potential or actual buyer was. The Respondent’s responsibility in the\n                    transaction was to facilitate meetings between the parties as well as to\n                    distribute the proceeds of sale.[note: 5]Singh also testified that\n                    the Respondent had no idea that he was selling off the jewellery in a piecemeal\n                    manner because he never informed the Respondent of this.[note: 6]Finally, when the Appellant became\n                    impatient and started chasing the Respondent for the sale proceeds, Singh\n                    fabricated a story about how he had sold the jewellery and had not been paid by\n                    the buyer, and this story was believed by both the Respondent and the\n                        Appellant.[note: 7] 36     To a large extent, Singh’s testimony\n                    that the Respondent was just as much in the dark about Singh’s misdeeds as\n                    the Appellant is supported by some letters and statements that were written by\n                    the Appellant to the CID. 37     In a letter to the CID dated\n                        14March 2000, the Appellant had stated as\n                        follows:[note: 8] The facts will show that Ajit [Singh], as he always does, is cynically\n                        mocking everyone, myself, the law and Khoo [the Respondent]. 38     In another letter to the CID dated\n                    21 March 2000, the Appellant stated thus:[note: 9] Khoo [the Respondent] did not know about Ajit’s [Singh’s] own\n                        plans on 15.1.99. I think it was around April 99, when Khoo [the Respondent]\n                        asked me and Ajit [Singh] to contact one another directly, that he began to\n                        feel that Ajit [Singh] was up to something more fraudulent than he was\n                        prepared to venture with Ajit [Singh]. 39     During cross examination, the Appellant\n                    attempted to downplay the significance of these statements by claiming that he\n                    was merely speculating as to the role that the Respondent had played in the\n                    entire incident. Whilst it may be true that the Appellant’s own views as\n                    to the Respondent’s involvement in the incident cannot affect the legal\n                    question of whether the Respondent was indeed fraudulent, it is a relevant\n                    factor in determining whether there is sufficient evidence for the court to find\n                    that the Respondent had acted fraudulently. 40     In the absence of any other evidence\n                    demonstrating that the Respondent had intended to defraud the Appellant into\n                    parting with the jewellery right from the outset, we agree with the\n                    Judge’s finding that there was insufficient evidence to prove that the\n                    Respondent had made the first category of representations\n                fraudulently.",
        "The second category of representations": "41     With respect to the second category of\n                    representations made by the Respondent to the effect that the jewellery had been\n                    sold and that the proceeds would be remitted back to the Appellant, the Judge\n                    found that they were not actionable because they were not pure representations\n                    of fact but contained promises as to future action instead. 42     We agree with the Judge that the\n                    Respondent’s statement that the sale proceeds would be remitted back to\n                    the Appellant was a statement of intention that is not actionable unless the\n                    Appellant can demonstrate that the Respondent did not hold that view in good\n                    faith when he made that statement (see, for example, the English Court of Appeal\n                    decision ofEdgington v Fitzmaurice(1885)\n                    29 Ch D 459 at 483,perBowen LJ).\n                    However, the same cannot be said of the Respondent’s representations to\n                    the Appellant that the jewellery had been sold. Those representations are\n                    unequivocal statements of fact that could form the basis of an actionable\n                    misrepresentation. There is no reason why an actionable representation of fact\n                    should cease to be so merely because it was uttered in the same breath as a\n                    statement of intention. 43     In the Respondent’s affidavit of\n                    evidence-in-chief (dated 17 March 2008), he indicated that by\n                    28 August 1999, his faith in Singh had been shaken because there had been\n                    no development forthcoming from Singh as to the sale of the jewellery or any\n                        report.[note: 10]Yet, despite his reservations\n                    about the veracity of what Singh was telling him, up to 12 April 2000, the\n                    Respondent was still making representations to the Appellant to the effect that\n                    the jewellery had been sold and that he and Singh were in the process of\n                    obtaining payment from the buyer. Based on this alone, there is, in our view, a\n                    case to be made that the Respondent had made those representations with serious\n                    doubts about their truthfulness or was reckless as to whether or not they were\n                    true. Indeed, it might be argued that, at the very least, those representations\n                    constituted negligent misrepresentations. 44     Nevertheless, even if the Respondent had made\n                    these representations either fraudulently or negligently, this is insufficient\n                    – in and of itself – to sustain a claim based on misrepresentation.\n                    As the Judge correctly pointed out (see the Judgment at [69]), the Appellant did\n                    not provide any evidence that he relied on these representations to his\n                    detriment. On the contrary, he had already made police reports against the\n                    Respondent and Singh as early as January 2000. Hence, we agree with the Judge\n                    that the Appellant did not rely on the representations made by the\n                    Respondent. 45     The Appellant’s best case is that he\n                    forbore from commencing legal action against the Respondent and Singh because of\n                    the Respondent’s representations that the jewellery had been sold and that\n                    the proceeds would be remitted soon. Yet, even that argument is, with respect,\n                    fraught with difficulty. By July 2001, Singh had already been arrested for\n                    dishonest appropriation of property. The Appellant ought to have known by then\n                    that the representations made to him were untrue. Yet, the Appellant chose,\n                    inexplicably, to wait almost another five years before commencing legal\n                    action against the Respondent. The strongest argument in the Appellant’s\n                    favour is that the Respondent’s misrepresentations resulted in the\n                    Appellant forbearing from taking civil action against him (the Respondent) for a\n                    period of some 18 months (from 6 January 2000 (when the Undertaking\n                    was given) to 9 July 2001 (when Singh was arrested)). However, such\n                    forbearance to sue did not cause the Appellant any real loss because he still\n                    had more than four years to bring a claim against the Respondent. In the final\n                    analysis, therefore, any loss suffered by the Appellant was not due to any\n                    reliance on the Respondent’s misrepresentations. 46     In the circumstances, therefore, the\n                    Appellant’s claim for fraudulent misrepresentation or deceit\n                fails.",
        "Does the Appellant have a contractual claim against the\n                Respondent?": "47     Under the terms of the consignment, the sale\n                    of the jewellery was supposed to have been completed by the end of February\n                    1999. Hence, the earliest date at which the Appellant’s cause of action\n                    for the recovery of the sale proceeds would have accrued would have been at the\n                    end of February 1999 when the sale ought to have been completed. Even taking\n                    into account the fact that there were multiple delays in the sale of the\n                    jewellery, the latest time when the Appellant’s claim accrued was\n                    6 September 1999, when the Respondent represented to him that the jewellery\n                    had been sold and asked him to prepare the REDS invoice (see above at[8]). Such a claim is clearly time-barred under\n                        s 6(1)(a) of the Act . 48     Counsel for the Appellant, recognising that a\n                    claim based solely on the consignment contract would be time-barred, sought to\n                    overcome this hurdle by relying on s 29 of the Act as well as the doctrine\n                    of acknowledgment under s 26(2) of the Act. In so far as the former\n                    provision (viz, s 29 of the Act) is\n                    concerned, we agree wholly with the Judge’s reasoning as well as holding\n                    (see the Judgment at [75]-[83]) and we therefore reject the Appellant’s\n                    reliance on that particular provision. 49     Turning to the doctrine of acknowledgment\n                    under s 26(2) of the Act, an acknowledgment by a person liable for a debt\n                    or a liquidated pecuniary claim has the effect of restarting the limitation\n                    period at the time when the acknowledgment was given. Section 26(2) reads\n                    as follows: Where any right of action has accrued to recover any debt or other\n                        liquidated pecuniary claim, or any claim to the personal estate of a\n                        deceased person or to any share or interest therein, and the person liable\n                        or accountable therefor acknowledges the claim or makes any payment in\n                        respect thereof, the right shall be deemed to have accrued on and not before\n                        the date of the acknowledgment or the last payment. An acknowledgment under s 26(2) arises only when there is a clear\n                    admission of a claim made by the person liable under the claim (see, for\n                    example, the English High Court decision ofKamouh v\n                        Associated Electrical Industries International Ltd and Another[1980] 1 QB 199). 50     We agree with the Judge that the Undertaking\n                    given by the Respondent and Singh on 6 January 2000 (reproduced above at[10]) constitutes an acknowledgment\n                    under s 26(2). This has the effect of extending the date from which the\n                    six year time period starts to run. Apart from the Undertaking, there are\n                    two other acknowledgments which have the same effect of extending time in favour\n                    of the Appellant. The first is a letter from the Respondent to the Appellant on\n                    2 March 2000 reassuring him that payment would be made to him.[note: 11]The second is a letter from the\n                    Respondent to the Appellant on 12 April 2000 (“the 12 April\n                    Letter”, reproduced below at[65]),\n                    in which the Respondent informed the Appellant that he and Singh would be\n                    picking up a bank draft on 17 April 2000 to deliver to the Appellant on\n                    18 April 2000.[note: 12]The Judge held that the\n                    12 April Letter from the Respondent to the Appellant could possibly have\n                    had the effect of extending the date from which the six year time period\n                    starts to run (see the Judgment at [74]). However, she held that the\n                    Appellant’s claim in contract was still time-barred because his claim was\n                    filed on 17 April 2006, a date which was more than six years after\n                    12 April 2000. We pause to observe, parenthetically, that although the\n                    Judge observed that the 12 April Letter was not signed, there is no doubt,\n                    in our view, that that letter was, in fact, sent from the Respondent to the\n                    Appellant. This is, in fact, also borne out by the documentary context as well\n                    and the parties, correctly in our view, did not seek to argue to the\n                    contrary. 51     We agree with the findings of the Judge on\n                    this particular issue. However, that is not an end to the matter.",
        "Fresh contract": "52     During the course of oral submissions, another\n                    issue relating to the effect of the correspondence between the parties arose\n                    which was not canvassed before the court below. Understandably, therefore, it\n                    did not fall to be decided by the Judge. Nevertheless, that particular issue\n                    was, in our view, of great – even decisive – potential significance\n                    to the outcome of the present appeal. In the circumstances, we formulated the\n                    following questions that were to be addressed by counsel for the parties in\n                    further submissions, as follows: (1)Is\n                            paragraph 19 of the Appellant’s Reply broad enough to\n                            incorporate the contentions that as a result of the Respondent's\n                            representations, a.the limitation period has been extended;\n                                or b.the limitation period ought to be considered as\n                                having been acknowledged to run only from the expiry of the date of\n                                the last undertaking to pay; or c.there has been a fresh contract as a result of\n                                the correspondence between the parties? (2)How should the 12 April Letter be\n                            construed? (3)Assuming that the answer to (1) is in the\n                            negative, is it nevertheless open to the Court of Appeal to allow\n                            consideration of the points above? The parties’ respective further submissions have since been\n                    received. We should observe at this juncture that, having perused and carefully\n                    considered the parties’ further submissions, we are of the view that the\n                    central (or key) issue for the purpose of the present appeal is embodied in\n                    question (1)(c), as reproduced above (viz,\n                    whether or not there has been a fresh contract as a result of the correspondence\n                    between the parties), and we will therefore focus on this particular issue only\n                    (noting, by way of preliminary observation, that the conduct of the parties (in\n                    particular, that of the Appellant) will also be relevant to the determination of\n                    this particular issue).",
        "Procedural considerations": "53     However, before proceeding to consider this\n                    substantive legal issue, we need to deal, first, with a threshold issue.\n                    Although it is of a procedural nature, it is nevertheless of great importance.\n                    Indeed, both aspects of this threshold issue are, as the reader might have\n                    surmised, embodied in questions (1) and (3), which we asked counsel to\n                    address (and which have been reproduced in the preceding paragraph). In essence,\n                    the threshold issue is this: Can this court address the substantive issue as to\n                    whether or not there was a fresh contract between the parties in the light of\n                    the fact that it had not been addressed in the court below? In particular, does\n                    para 19 of the Appellant’s Reply permit this court to consider the\n                    said issue (see question (1) above)? If not, and if this is in fact a new\n                    point on appeal, can this court nevertheless proceed to consider that issue in\n                    any event (see question (3) above)? 54     We turn now to address the two last-mentioned\n                    (and specific) questions referred to at the end of the preceding paragraphseriatim. Para 19 of the Appellant’s Reply 55     Before proceeding to consider the precise\n                    scope of para 19 of the Appellant’s Reply, it might be appropriate to\n                    consider a few general points of principle first. In this regard, the following\n                    observations on the respective roles of – as well as relationship between\n                    – procedural and substantive justice in the Singapore High Court decision\n                    ofUnited Overseas Bank Ltd v Ng Huat Foundations Pte\n                        Ltd[2005] 2 SLR(R) 425 (at [4]–[9]) might be\n                    usefully noted: 4     It is axiomatic that every party ought to\n                        have its day in court. This is the very embodiment ofproceduraljustice. The appellation\n                        “procedural” is important. Procedural justice is just one\n                        aspect of the holistic ideal and concept of justice itself. In the final\n                        analysis, the achievement of a substantively just result or decision is the\n                        desideratum. It is more than that, however. It is not merely an ideal. It\n                        must be a practical outcome - at least as far as the court can aid in its\n                        attainment. 5     However, the court must be extremely wary\n                        of falling into the flawed approach to the effect that “the ends\n                        justify the means”. This ought never to be the case. The obsession\n                        with achieving a substantively fair and just outcome does not justify the\n                        utilisation of any and every means to achieve that objective. There must be\n                        fairness in theprocedure or mannerin which the final\n                        outcome is achieved. 6     Indeed, if the procedure is unjust, that\n                        will itself taint the outcome. 7     On the other hand, a just and fair\n                        procedure doesnot, in and of itself, ensure a just\n                        outcome. In other words, procedural fairness is a necessary but not\n                        sufficient condition for a fair and just result. 8     The quest for justice, therefore, entails a\n                        continuous need to balance the procedural with the substantive. More than\n                        that, it is a continuous attempt to ensure that both areintegrated, as far as that is humanly possible. Bothinteractwith each other. One cannot survive\n                        without the other. There must, therefore, be – as far as is possible\n                        – a fair and just procedure that leads to a fair and just result. This\n                        is not merely abstract theorising. It is thevery basisof what the courts do – and ought to do. When in doubt, the courts\n                        would do well to keep these bedrock principles in mind. This is especially\n                        significant because, in many ways, this is how, I believe, laypersons\n                        perceive the administration of justice to be. The legitimacy of the law in\n                        their eyes must never be compromised. On the contrary, it should, as far as\n                        is possible, be enhanced. 9     It is true, however, that in the sphere of\n                        practical reality, there is often atensionbetween the\n                        need for procedural justice on the one hand and substantive justice on the\n                        other. The task of the court is to attempt, as I have pointed out in the\n                        preceding paragraph, toresolvethis tension. There is\n                        afurthertask: it is to actually attempt,\n                        simultaneously, tointegratethese two conceptions of\n                        justice in order that justice in its fullest orb may shine forth. [emphasis in original] 56     In other words, thebalanced integrationof both procedural and substantive justice\n                    must be constantly borne in mind. One particular application of this general\n                    ideal in the context of the rules of civil procedure is to ensure that the\n                    operation of such rules does notitselfengender\n                    substantive injustice. Indeed, as V K Rajah JC very pertinently\n                    pointed out in the Singapore High Court decision ofChwee Kin\n                        Keong and others v Digilandmall.com Pte Ltd[2004]\n                    2 SLR(R) 594 at [85] (affirmed inChwee Kin Keong\n                        and others v Digilandmall.com Pte Ltd[2005]\n                    1 SLR(R) 502): Rules of court which are meant to facilitate the conduct of proceedings\n                        invariably encapsulate concepts of procedural fairplay. They are not\n                        mechanical rules to be applied in a vacuum, devoid of a contextual\n                        setting. The observations just quoted were endorsed by this court inLee Chee Wei v Tan Hor Peow Victor and others and another\n                        appeal[2007] 3 SLR(R) 537 (at [63]), where the court\n                    also observed, as follows (at [63]): InLim Eng Kay v Jaafar bin Mohamed Said[1982]\n                        2 MLJ 156, the court awarded special damages notwithstanding that they\n                        had been incorrectly pleaded as general damages, amply illustrating the\n                        pragmatic judicial approach that eschews refusal of a claim purely on\n                        account of a technical error of pleading. As aptly noted by Lai Kew\n                        Chai J, inLea Tool and Moulding Industries Pte Ltd v CGU\n                            International Insurance plc[2000]\n                        3 SLR(R) 745 at [16], “our procedural laws are\n                        ultimately handmaidens to help us to achieve the ultimate and only objective\n                        of achieving justice as best we can in every case [and should] not [be]\n                        permitted to rule us to such an extent that injustice is\n                        done”. 57     Returning to the present proceedings in\n                    general and para 19 of the Appellant’s Reply in particular, it would\n                    be appropriate to first set out para 19 itself, which reads as\n                    follows: With respect to Paragraphs 11(a) to 11(f) of the said Defence\n                        (Amendment No.23), the Plaintiff joins issue with the\n                            1stDefendant and puts the\n                            1stDefendant to strict proof.Specifically, with respect to Paragraph 11(d) of the Defence\n                            (Amendment No. 3), the Plaintiff will aver that subsequent to the\n                            acknowledgment and/or undertaking given by the Defendants, the\n                            Defendants made various representations from time to time requesting for\n                            additional time, to recover the money from the buyer of the Plaintiffs\n                            jewellery collection, so as to make payment of the monies due to the\n                            Plaintiff.Believing the said\n                            representations to be true and being induced thereby, the Plaintiff\n                            acceded to the said requests. The\n                            Plaintiff believed the said representations for the Defendants made\n                            similar representations to the police even up to September 2000, as was\n                            related to the Plaintiff by the police upon the Plaintiff making\n                            enquiries from time to time. [underlining in original;\n                        emphasis added in italics] 58     A perusal of para 19 of the\n                    Appellant’s Reply (as reproduced in the preceding paragraph) suggests\n                    (especially if we have regard to the italicised words set out in the preceding\n                    paragraph) that that paragraph is, in fact, sufficiently broad to raise the\n                    issue as to whether the parties entered into a fresh contract. Whilst it is\n                    entirely possible that the focus of this particular paragraph was on whether or\n                    not there was an acknowledgment under s 26(2) of the Act, it should be\n                    borne in mind that this paragraph was directed at para 11(d) of the\n                    Respondent’s Defence (Amendment No 3), which raised thegeneralissue of a time-bar under the Act. In the\n                    circumstances, we are of the view that the Appellant was at liberty to raise\n                    whatever arguments he thought would meet this general issue. Bearing in mind the\n                    general principles set out above, the fact that a fresh contract would overcome\n                    the Respondent’s general defence of a time-bar under the Act as well as\n                    the fact that a party is only required to plead facts (as opposed to law), we\n                    see no reason in principle why the Appellant could not raise the issue of a\n                    fresh contract based on para 19 of his Reply. This is especially the case\n                    as the Appellant was relying on hisconsent tothe\n                    Respondent’s various requests for additional time to make payment of the\n                    monies due to him. The respective issues of whether or not there was an\n                    acknowledgment under s 26(2) of the Actandwhether or not the parties had entered into a fresh contract were dependent, in\n                    the final analysis, on thesame set of factswhich\n                    had been pleaded by the Appellant in para 19 of his Reply (there is, in\n                    this regard and to this extent, some overlap, in fact, with the procedural issue\n                    to be considered in the next section of this judgment (viz, whether, in any event, a new point on appeal can be raised\n                    in the context of the present proceedings)). In the circumstances, it can hardly\n                    be said that the Respondent would be prejudiced if the latter issue is now\n                    raised and considered by this court. Indeed, it is significant, in our view,\n                    that the Appellant, in the Appellant’s Case, did refer to the fact that\n                    the Undertaking (reproduced above at[10]):[note: 13] …stands independently as a collateral contract, and more\n                            than just an acknowledgement under Section 26(2) of the Limitation\n                            Actin that the promise to pay given by Mr Khoo [the\n                        Respondent] and Mr Singh [Singh] issupported by the\n                            consideration lying in the forbearance requested and in fact granted by\n                            Mr Ang[the Appellant], ie. to wait till\n                            29thFebruary 2000 to be paid [emphasis\n                        added]. Although the Appellant had referred to the Undertaking, thesame general principleswere, in our view, potentially\n                    applicable to the 12 April Letter as construed in the context of the\n                    surrounding (and relevant) circumstances and documents as well. 59     In the circumstances, we are of the view that\n                    para 19 of the Appellant’s Reply was sufficiently wide to cover this\n                    particular issue. New point on appeal 60     In any event,even\n                        ifpara 19 of the Appellant’s Reply was not\n                    sufficiently wide and the issue as to whether or not the parties had entered\n                    into a fresh contract is treated as a new point on appeal, could it still be\n                    raised and considered pursuant to O 57 r 13(4) of the Rules of Court\n                    (Cap 322, R 5, 2006 Rev Ed)? 61     As Prof Jeffrey Pinsler SC has\n                    pertinently observed (seeSingapore Court Practice\n                        2009(LexisNexis, 2009) at para 57/13/10): Consistent with the principle of finality in litigation is the requirement\n                        that the parties should raise at trial all matters which have a bearing on\n                        the outcome of the case. The Court of Appeal will generally refrain from\n                        entertaining a new point on appeal, particularly if the circumstances are\n                        such that the court is not in as advantageous a position as the court below\n                        (with regard to the evidence as well as other matters which may have arisen\n                        if the point had been brought up in the court below), to adjudicate upon the\n                        issue. 62     The above observations (which were found in\n                    the same paragraph inSingapore Court Practice\n                        2006(Jeffrey Pinsler SC gen ed) (LexisNexis, 2006)) were, in\n                    fact, cited by this court inPanwah Steel Pte Ltd v Koh\n                        Brothers Building & Civil Engineering Contractor (Pte) Ltd[2006] 4 SLR(R) 571 (at [14]). The court proceeded to observe (at\n                    [15]–[16]): 15    The classic\n                            statement of principle is, of course, that of Lord Herschell in the\n                            House of Lords decision ofThe Owners of the Ship\n                                “Tasmania” and the Owners of the Freight v Smith and\n                                others, The Owners of the Ship “City of\n                            Corinth” (The “Tasmania”)(1890) 15 App Cas 223, as follows (at\n                        225): My Lords, I think that a point such as this, not taken at the trial,\n                            and presented for the first time in the Court of Appeal, ought to be\n                            most jealously scrutinised. The conduct of a cause at the trial is\n                            governed by, and the questions asked of the witnesses are directed to,\n                            the points then suggested. And it is obvious that no care is exercised\n                            in the elucidation of facts not material to them. It appears to me that under these circumstances a Court of\n                                Appeal ought only to decide in favour of an appellant on a ground\n                                there put forward for the first time, if it be satisfied beyond\n                                doubt, first, that it has before it all the facts bearing upon the\n                                new contention, as completely as would have been the case if the\n                                controversy had arisen at the trial; and next, that no satisfactory\n                                explanation could have been offered by those whose conduct is\n                                impugned if an opportunity for explanation had been afforded them\n                                when in the witness box. [emphasis added] The principles embodied in the above quotation have been cited and applied\n                        on a number of occasions in the local context (see, for example, the\n                        decisions of this court inCheong Kim Hock v Lin Securities\n                            (Pte)[1992] 1 SLR(R) 497 at [30];MCST Plan No 473 v De Beers Jewellery Pte Ltd[2002]\n                        1 SLR(R) 418 at [38]; andRiduan bin Yusof v Khng Thian\n                            Huat[2005] 4 SLR(R) 234 at [35]). 16    The following\n                            observations by Lord Watson in the Canadian Privy Council decision\n                            ofConnecticut Fire Insurance Company v Kavanagh[1892] AC 473 at 480 are, especially (as we shall see) in the\n                            context of the present proceedings, also apposite: When a question of law is raised for the first time in a court of last\n                            resort, upon the construction of a document, orupon facts\n                                either admitted or proved beyond controversy, it is not only\n                                competent but expedient, in the interests of justice, to entertain\n                                the plea. The expediency of adopting that course may be\n                            doubted, when the plea cannot be disposed of without deciding nice\n                            questions of fact, in considering which the Court of ultimate review is\n                            placed in a much less advantageous position than the Courts below. But\n                            their Lordships have no hesitation in holding that the course ought not,\n                            in any case, to be followed, unless the Court is satisfied that the\n                            evidence upon which they are asked to decide establishes beyond doubt\n                            that the facts, if fully investigated, would have supported the new\n                            plea. [emphasis added] [emphasis in original] Reference may also be made to the decision of this court inSusilawati v American Express Bank Ltd[2009]\n                    2 SLR(R) 737 at [46]–[54]. 63     The issue in the present proceedings is one\n                    which this court is in just as advantageous a position as the court below to\n                    adjudicate upon. No new evidence is required to be adduced. The issue turns\n                    simply upon an interpretation of the legal effect of the relevant documents in\n                    their context – in particular, whether or not a fresh contract had been\n                    entered into by the parties. Indeed, as already mentioned earlier in this\n                    judgment, we also invited the parties to tender further submissions on this\n                    particular issue in order to ensure, beyond peradventure, that all the relevant\n                    arguments were before us. Conclusion 64     In the circumstances, we are of the view that\n                    this courtcan, in fact, consider what we consider\n                    to be the key or central issue in the present appeal,viz, whether or not a fresh contract had been entered into by\n                    the parties. And it is to that particular issue that our attention now\n                    turns.",
        "Was there a fresh contract entered into by the parties?": "65     Turning, then, to the central issue in the\n                    present proceedings, one of the key documents is the 12 April Letter, which\n                    was sent by the Respondent to the Appellant and which reads as\n                        follows:[note: 14] 12 April 2000 To: Ang Sin Hock [the Appellant] Fm: Khoo Eng Lim [the Respondent] Re: Sale of REDS Jewelry goods Refer to your latest fax April 11. There wasa problemwith the transferand we are making alternative arrangement.We will pick up a draft on Monday 17 April and will\n                            arrange to deliver to you on Tuesday 18 April. Again, we regret for [sic] the\n                        inconveniences [sic] caused. Thank you. [emphasis added] 66     In so far as the 12 April Letter itself\n                    is concerned, there was, in our view, a clear (and fresh) promise by the\n                    Respondent in that particular piece of correspondence to the Appellant to pay to\n                    the latter the amount of $270,725 owed (by way of a bank draft) which the former\n                    had originally undertaken to pay (see the Undertaking referred to earlier in\n                    this judgment (and reproduced above at[10])). 67     Whether or not the 12 April Letter was\n                    (as the Respondent argued) a counter-offer or (as the Appellant argued) an offer\n                    is, in our view, of little legal moment in so far as the present proceedings are\n                    concerned – not least because a counter-offer is, in effect, an offer\n                    which can either be accepted or rejected by the offeree concerned (here, the\n                    Appellant). It is clear that the Appellant, in fact,acceptedthe offer by the Respondent in the 12 April Letter\n                    (the core of which was the fresh promise by the Respondent to pay the Appellant\n                    the amount owed which the former had originally undertaken to pay to the latter\n                    in the Undertaking reproduced above at[10]). In arriving at this conclusion, we are of the view that the\n                    Appellant had more than one legal string to his bow. Let us\n                elaborate. 68     First, it could be argued that the Appellant\n                    had accepted the Respondent’s offer contained in the 12 April Letter\n                    byconduct(and see, generally,\n                    M P Furmston,Cheshire, Fifoot and Furmston’s\n                        Law of Contract(Oxford University Press, 15th Ed, 2007)\n                        (“Cheshire, Fifoot and\n                    Furmston”) at p 48 and Edwin Peel,Treitel: The Law of Contract(Sweet & Maxwell, 12th Ed,\n                    2007) (“Treitel”) at\n                    para 2-017). The Appellant’s earlier fax dated 11 April 2000\n                    (which was, in fact referred to in the 12 April Letter (see above at[65])) clearly evinced an intention on\n                    the part of the Appellant to commence legal proceedings against the Respondent\n                    (stating, in fact, a deadline of 14 April 2000 as the last date for an\n                    amicable settlement). The 12 April Letter was clearly intended by the\n                    Respondent to prevent the initiation of such proceedings. The Appellant, in\n                    fact, refrained from commencing legal proceedings based on the\n                    Respondent’s promise to pay contained in that same piece of\n                    correspondence. That this was, in fact, the case is evidenced by a further piece\n                    of correspondence from the Appellant to the Respondent dated 18 April 2000\n                    (“the 18 April Letter”), which reads as follows:[note: 15] 18 April 2000 To: Khoo Eng Lim [the Respondent] Fm: Ang Sin Hock [the Appellant] Re: Sale of REDS Jewelry goods 1.     Please refer to your fax 12.4.2000 re. the\n                        a/m subject, and as shown above. 2.     Please call me immediately to let me know\n                        how you are delivering the draft to me today. Thank you. 69     Secondly, the letter just reproduced in the\n                    preceding paragraph (the 18 April Letter) is, in our view,itselfawritten\n                        acceptanceof the offer contained in the 12 April Letter.\n                    Although the Appellant refers in para 3 of his letter of 19 April\n                        2000[note: 16]to the Respondent to the\n                    latter’s response to the effect that he (the Respondent) had not received\n                    the 18 April Letter, it was also clear from that particular paragraph (as\n                    well as the subsequent paragraphs) in that letter that the Appellant had, in\n                    fact, spoken to the Respondent that day (viz,\n                    18 April 2000), and quite possibly even before that day as well. It is\n                    significant to note that there are no specific formalities and that, on any\n                    interpretation, the offer by the Respondent contained in the 12 April\n                    Letter had been accepted by the Appellant by 18 April 2000 at the very\n                    latest (if not earlier). 70     It is therefore clear that a valid (and fresh)\n                    contract had been entered into between the parties, pursuant to which the\n                    Respondent had promised to pay the requisite amount to the Appellant. However,\n                    the analysis thus far relates only to offer and acceptance. In order for a valid\n                    contract to have been concluded between the parties, the requirements of\n                    considerationas well asan intention to create\n                    legal relations also need to be satisfied (see also the decision of this court\n                    inGay Choon Ing v Loh Sze Ti Terence Peter and another\n                        appeal[2009] 2 SLR(R) 332 (“Gay Choon Ing”) at [46]–[72]). In our view, the\n                    latter requirement has been satisfied on the facts. 71     Turning to the (remaining) requirement ofconsideration, it is also clear, in our view,\n                    that the Appellant had furnished sufficient consideration for the\n                    Respondent’s promise of payment in the 12 April Letter inasmuch there\n                    was forbearance by the former from commencing legal action against the latter\n                    during the period 12 April 2000 to 18 April 2000. It is established\n                    law that such forbearance constitutes sufficient consideration (see, for\n                    example,Cheshire, Fifoot and Furmstonat\n                    pp 107–110;Treitelat para 3-034;\n                    the Singapore High Court decisions ofImperial Steel Drum\n                        Manufacturers Sdn Bhd v Wong Kin Heng[1997]\n                    1 SLR(R) 297;Hongkong & Shanghai Banking Corp\n                        Ltd v Jurong Engineering Ltd and others[2000]\n                    1 SLR(R) 204; andMalayan Banking Bhd v Lauw\n                        Wisanggeni[2003] 4 SLR(R) 287 as well as the\n                    decision of this court inSea-Land Service Inc v Cheong Fook\n                        Chee Vincent[1994] 3 SLR(R) 250). In any event, as the\n                    law now stands, it is not difficult to locate sufficient consideration in any\n                    given contract (see, for example, the English Court of Appeal decision ofWilliams v Roffey Bros & Nicholls (Contractors)\n                        Ltd[1991] 1 QB 1 and the decision of this court inGay Choon Ing(especially at [70],\n                    [96]–[97] and [100]–[110])). 72     In the circumstances, therefore, we find that\n                    the parties had entered into a fresh contract in which the Respondent expressly\n                    promised to pay the Appellant the sum concerned (ie, $270,725) in return for the Appellant’s forbearance\n                    not to commence legal action against the Respondent. The Respondent’s\n                    failure to deliver the bank draft to the Appellant on 18 April 2000 thus\n                    constituted a breach of contract, which entitled the Appellant to damages which\n                    would put him (the Appellant) in the same position as if the contract had been\n                    performed (see, for example, the seminal formulation by Parke B in the\n                    oft-cited English decision ofRobinson v Harman(1848) 1 Exch 850 at 855). Such damages would constitute the amount which\n                    the Respondent had promised to pay. It is also clear, therefore, that the\n                    limitation period (of six years) under s 6(1)(a) of the Actvis-à-visthis\n                    particular contract would only commence from the time the contract concerned was\n                    breached (here, 18 April 2000). Given that the writ was issued on\n                    17 April 2006, the Appellant’s claim based on this fresh contract was\n                    commenced within the limitation period and no issue of time-bar\n                arises.",
        "A coda on terminology and limitation": "73     By way of a coda, we pause to observe that\n                    whilst such a contract might be termed acollateralcontract inasmuch as it has some connection to the\n                    original contract between the parties, that is, in the final analysis, of no\n                    real practical significance. Whatisclear is that\n                    there arose, between the parties, a fresh (and independent) contract which (as\n                    we have already noted in the preceding paragraph) the Respondent had breached.\n                    That such a contract is not a collateral contract in its “typical”\n                    form is clear; in the words of a learned writer in the seminal article on\n                    collateral contracts, “in thetypicalcollateral contract case, the consideration given for the promise is no more\n                    than the act of entering into the main contract” [emphasis in original]\n                    (see K W Wedderburn, “Collateral Contracts”\n                    [1959] CLJ 58 (“Wedderburn”) at p 79). 74     It has, however, been held that a collateral\n                    contract can be a basis for liability in and of itself (see, for example, the\n                    House of Lords decision ofHeilbut, Symons & Co v\n                        Buckleton[1913] AC 30 as well as the English High\n                    Court decisions ofShanklin Pier Ld v Detel Products\n                        Ld[1951] 2 KB 854 andCity and\n                        Westminster Properties (1934) Ltd v Mudd[1958]\n                    3 WLR 312). Be that as it may, it might, nevertheless, still be argued\n                    that the factual situation inthe present\n                        proceedingsis somewhat different. Indeed, if one adopts anarrowconception of the concept of a\n                    collateral contract, it might be argued that the contract in the present\n                    proceedings is not a collateral contract inasmuch as it didnot(unlike the contracts in question in the decisions just\n                    cited) ariseprior to or contemporaneously withthe main contract (andcfalso, in this regard,\n                    the House of Lords decision ofClarke v The Earl of Dunraven\n                        and Mount-Earl, The “Satanita”[1897] AC 59). However, as we have already noted in the preceding\n                    paragraph, this is of little legal moment in the present context as the crucial\n                    issue in the context of the present appeal is that there has been a fresh\n                    contract between the parties and that the breach of this contract entitles the\n                    Appellant to a remedy in damages. 75     However,even ifthis particular contract is, indeed, viewed as constituting acollateralcontract, the main critique levelled against\n                    collateral contracts (to the effect that they generate commercial uncertainty)\n                    wouldnotapply to the contract in these\n                    proceedings (the other common critique, it might be mentioned, centring on\n                    possible artificiality (andcf Gay Choon Ing(at\n                    [61])). However, such a contractwouldengender\n                    what is considered to be the key motif as well as (more importantly) advantage\n                    of collateral contracts generally,viz, a\n                    substantively just and fair result (and seeWedderburnat pp 58 and 85). Indeed, the collateral\n                    contract has been used in a variety of different contexts in order to achieve a\n                    just and fair result. We have already noted one instance in the preceding\n                    paragraph. Taking yet another example, in the case of exception clauses, the\n                    collateral contract has been utilised to avoid the operation of such clauses\n                    (particularly where such clauses would operate unfairly against a contracting\n                    party, although there are, of course, other common law doctrines as well as a\n                    statute (viz, the Unfair Contract Terms Act\n                    (Cap 396, 1994 Rev Ed) which can also be utilised to like effect).\n                    Where a collateral contract exists, its terms and conditions may expressly\n                    override the exception clause in the main contract; in other words, the\n                    contracting party seeking to avoid the legal effect of the exception clause\n                    concerned would be relying upon the terms and conditions ofa\n                        separate and independent contractaltogether (and see, for\n                    example, the oft-cited English decisions ofCouchman v\n                        Hill[1947] 1 KB 554;Mendelssohn v\n                        Normand Ltd[1970] 1 QB 177; andJ Evans & Son (Portsmouth) Ltd v Andrea Merzario Ltd[1976] 1 WLR 1078). In yetanothercontext – that ofillegality and public\n                        policy- a collateral contract can be utilised by a contracting\n                    party to avoid the otherwise harsh effects of a holding that a contract is void\n                    as being contrary to illegality and public policy (and see the seminal English\n                    Court of Appeal decision ofStrongman (1945), Ltd v\n                        Sincock[1955] 3 All ER 90). 76     However, and on a more general level, one\n                    thing appears clear: A collateral contractcanexist,even ifa main transaction hasnotbeen entered into. Nevertheless, thecontraryview was apparently expressed by this court inHiap Huat Pottery (S) Pte Ltd v TV Media Pte\n                        Ltd[1998] 3 SLR(R) 734 (“Hiap Huat Pottery”) at [22]. However, this approach is,\n                    with respect, contrary to recent developments in other jurisdictions where abroaderapproach towards collateral contract\n                    has been adopted (see, for example, the English Court of Appeal decision ofBlackpool and Fylde Aero Club Ltd v Blackpool Borough\n                        Council[1990] 1 WLR 1195 (which was sought\n                    (unsuccessfully, with respect) to be distinguished inHiap\n                        Huat Potteryat [29]-[32]) and the Federal\n                    Court of Australia decision ofHughes Aircraft Systems\n                        International v Airservices Australia(1997) 146 ALR 1), and\n                    may therefore need to be reconsidered and clarified should the issue arise\n                    directly for consideration in a future case. Indeed, it may be mentioned that\n                    the broader approach is more consistent with thespiritof the collateral contract whose ultimate aim is, as we\n                    have seen, to achieve a just and fair result in the case at hand. There is,\n                    admittedly, the danger of too much commercial uncertainty being generated.\n                    However, this danger can be met by the court requiring clear proof that the\n                    legal requirements of a binding contract have, indeed, been satisfied on the\n                    facts (see also below at[79]-[80]), as well as (from an attitudinal perspective) being generally\n                    reluctant to find a collateral contract which ought to remain a finding of last\n                    resort. 77     As we have also noted, the fresh contract, as\n                    we have found on the facts of the present proceedings, doesnotfall within the ambit of s 6(1)(a) of the Act to begin with. On a related note, the main\n                    functions underlying statutes of limitation are well-summarised in the Report of\n                    the Law Reform Committee of England and Wales entitledLimitation of Actions in Cases of Personal Injury(Cmnd 1829, 1962), as follows (at para 17, which was also cited in the\n                    Report of the Law Reform Committee of England and Wales entitledTwenty-First Report (Final Report on Limitation of\n                        Actions)(Cmnd 6923, 1977) at para 1.7 (see also\n                    generally “The History and Policy of Limitation of Actions” in\n                    ch 1 of David W Oughton, John P Lowry &\n                    Robert M Merkin,Limitation of Actions(LLP, 1998))): In considering what recommendations we should make ... we have constantly\n                        borne in mind what we conceive to be the accepted function of the law of\n                        limitation. In the first place, it is intended to protect defendants from\n                        being vexed by stale claims relating to long-past incidents about which\n                        their records may no longer be in existence and as to which their witnesses,\n                        even if they are still available, may well have no accurate recollection.\n                        Secondly, we apprehend that the law of limitation is designed to encourage\n                        plaintiffs not to go to sleep on their rights but to institute proceedings\n                        as soon as it is reasonably possible for them to do so. ... Thirdly, the law\n                        is intended to ensure that the person may with confidence feel that after a\n                        given time he may treat as being finally closed an incident which might have\n                        led to a claim against him. 78     Whilst bearing in mind the functions set out\n                    in the preceding paragraph, we observe that, even though there would (in the\n                    context of the present proceedings) otherwise have been a lapse ofonly five daysbeyond the six-year period\n                    prescribed by s 6(1)(a) of the Act (as the\n                    12 April Letter also constituted an acknowledgment within the meaning of\n                    s 26(2) of the Act, with time running from 12 April 2000), the claim\n                    would nevertheless still be subject to the time-bar under s 6(1)(a) of the Act as the Appellant only commenced his action\n                    on 17 April 2006 (see also above at[15]and[50]). While it\n                    would have been unfortunate if the Appellant’s claim had failed on this\n                    particular basis, the court would have had no alternative but to make such a\n                    determination. Even a delay of one day would not be a good reason to allow a\n                    claim offending the requisite limitation timeline to proceed. Sympathy for a\n                    claimant has no role to play when the issue is whether or not a particular\n                    limitation timeline has been offended. However, in this matter as a fresh\n                    contract was entered into between the Appellant and the Respondent, the\n                    difficulties arising from the application of the Act (in particular,\n                        s 6(1)(a) thereof) – and, indeed,\n                    the very issue of limitation itself – do not arise.",
        "The importance of principle": "79     We do emphasise, however, that our finding\n                    that there has been a fresh contract is a finding onthe\n                        particular factsof the present proceedings and – to that\n                    extent – oughtnotto be viewed (as we\n                    emphasise once again in a moment) as a blanket precedent for the all-too-easy\n                    “construction” of contracts by way of a modern rendition of the\n                    unprincipled “principle” that is often embodied in the\n                    (derogatory) proverbial reference to justice as measured by “the length\n                    of the Chancellor’s foot”. This last-mentioned reference has, in\n                    fact, been attributed to the seventeenth century jurist, John Selden, who, in\n                    his 1689 work,Table-Talk 1689(Edward Arber ed)\n                    (Archibald Constable & Co Ltd, English Reprints, 1905), made the following\n                    observations (at p 46): Equity is a Roguish thing, for Law we have a measure, know what to trust\n                        to, Equity is according to Conscience of him that is Chancellor, and as that\n                        is larger or narrower, so is Equity. ’Tis all one as if they should\n                        make the Standard for the measure, we call a Chancellors Foot, what an\n                        uncertain measure would this be? One Chancellor has a long Foot, another a\n                        short Foot, a third an indifferent Foot. ’Tis the same thing in the\n                        Chancellors Conscience. 80     In a related vein, and perhaps more\n                    importantly, our finding isalsobased onall the legal ingredientsnecessary to\n                    constitutea valid contract. This is an important\n                    point becausethe relevant legal rules and principles –\n                        as applied, of course, to the specific facts -set theparametersas to whether or nota\n                        contractis formed in any given case; put simply, fresh contracts\n                    – and even collateral contracts, for that matter – cannot, as it\n                    were, be “conjured” out of “thin air”. Indeed, where\n                    the relevant legal criteria arenotsatisfied, the\n                    court concerned will certainlyrejectthe argument\n                    in favour of a collateral (and/or fresh) contract in no uncertain terms (see,\n                    for example, the Singapore High Court decision ofLemon Grass\n                        Pte Ltd v Peranakan Place Complex Pte Ltd[2002]\n                    2 SLR(R) 50). To adopt phrases coined by Denning LJ in a slightly\n                    different context, judges can be “bold spirits”, as opposed to\n                    “timorous souls” – butonly,\n                    we would reiterate,where there is a legal basis for such\n                        judicial boldness which would (in turn) aid in achieving a substantively\n                        just and fair result in the case at hand. Both the aforementioned\n                    terms were, of course, coined by Denning LJ in the English Court of Appeal\n                    decision ofCandler v Crane, Christmas & Co[1951] 2 KB 164 at 178. His powerful dissenting judgment (which the\n                    learned judge, significantly, refers to in an extralegal context as his\n                    “most important judgment” (see Lord Denning,\n                    “Foreword” to the inaugural volume of theDenning Law Journalat [1986] Denning LJ 1 at 1)) was, of\n                    course, ultimately vindicated by the House of Lords in the landmark decision ofHedley Byrne & Co Ltd v Heller & Partners\n                        Ltd[1964] AC 465 (which first established liability in\n                    the English context for negligent misstatements). 81     Finally, as we have also noted, the fresh\n                    contract which we have found on the facts of the present proceedings does not\n                        -unlikemany collateral contracts – create\n                    commercial uncertainty. However,likemost\n                    collateral contracts generally, it does aid in achieving a substantively just\n                    and fair result.",
        "Conclusion": "82     For the reasons set out above, we allow the\n                    appeal with costs and with the usual consequential orders. Accordingly, we enter\n                    judgment for the sum of $270,725 in favour of the Appellant, together with\n                    interest at the rate of 3% per annum from the date of the writ,ie, 17 April 2006, to date. However, having regard\n                    to the issues raised above, we are of the view that it would be appropriate to\n                    award the Appellant only half of his costs both here as well as in the court\n                    below.  [note: 1]Record of\n                                Appeal (“RA”) vol V (Part A),\n                                p 1623. [note: 2]Core Bundle (“CB”)\n                                vol II, pp 47-48. [note: 3]CB vol\n                                II, p 51. [note: 4]RA vol III (Part A), pp 176 and\n                            179. [note: 5]RA\n                                vol III (Part D),\n                        pp 974–976. [note: 6]RA vol III (Part D),\n                        p 977. [note: 7]CB vol II,\n                                pp 102–103. [note: 8]RA vol V (Part A),\n                                pp 1764–1765. [note: 9]RA vol V\n                                (Part A), p 1780. [note: 10]RA vol III (Part A),\n                                p 242. [note: 11]RA vol V (Part A),\n                        p 1762. [note: 12]CB vol II,\n                            p 97. [note: 13]Appellant’s Case,\n                                para 5.12. [note: 14]CB vol II,\n                            p 97. [note: 15]CB vol II, p 97. [note: 16]CB vol II,\n                        pp 98–99."
    }
}