{
    "case_title": "PT Makindo (formerly known as PT Makindo TBK)\n      v\n      Aperchance Co Ltd and others",
    "ncitation": "[2011] SGCA 19",
    "coram": "Chan Sek Keong CJ; \n      Chao Hick Tin JA; \n      Kan Ting Chiu J",
    "sections": {
        "Background to the dispute": "",
        "The previous proceedings": "4       On 22 November 2003, the 1stRespondent commenced Suit No 1149 of 2003 (“Suit 1149/2003”) against the Appellant and three other parties (“the 3 Defendants in Suit 1149/2003”) for repayment of US$126m. On 24 November 2003, the 1stRespondent obtained anex parteworldwide Mareva injunction against the Appellant (“the worldwide Mareva injunction”). On 27 February 2004, the worldwide Mareva injunction was set aside by the High Court on the ground that it had no jurisdiction over the Appellant and the 3 Defendants in Suit 1149/2003 (collectively, “the Defendants in Suit 1149/2003”). The 1stRespondent was ordered to pay the costs of the Defendants in Suit 1149/2003 and to serve the court order (“the 27 February 2004 Court Order”) on all parties who had earlier been notified of the worldwide Mareva injunction. 5       The 1stRespondent did not appeal against the 27 February 2004 Court Order, and subsequently complied with its terms by informing, on 5 March 2004, all the relevant parties of the setting aside of the worldwide Mareva injunction as well as by paying the costs of the Defendants in Suit 1149/2003 in September 2009.",
        "The advertisements": "6       Between 7 and 11 January 2010, the 1stRespondent placed an advertisement in five major Indonesian newspapers, includingBisnis Indonesia,KompasandKontan(“the Advertisements”). The relevant part of the Advertisements (translated into English from Bahasa Indonesia) reads: IMPEDING AND BLOCKAGETHE ENTIRE ASSETS/CAPITAL OF PT. MAKINDO. TBK., RACHMIWATY JUSUF, GUNAWAN JUSUF AND CLAUDINE JUSUF ALL OVER THE WORLD PURSUANT TO THE JUDGMENT OF THE SINGAPORE HIGH COURT NO. S. 1149/2003/H DATED 24THNOVEMBER 2003IN THE CASE BETWEEN: APERCHANCE COMPANY LIMITED (the “PLAINTIFF”) AGAINST PT. MAKINDO. TBK., RACHMIWATY JUSUF, GUNAWAN JUSUF AND CLAUDINE JUSUF (the “DEFENDANTS”)7       The information in the Advertisements may have been correct as at 24 November 2003, but it was false and misleading as at the date of their publication as the “IMPEDING AND BLOCKAGE” order had been discharged on 27 February 2004. The Advertisements were placed by the 1stRespondent in response to certain advertisements placed in December 2009 and January 2010 by the Appellant in the same Indonesian newspapers, in which the Appellant had claimed, falsely, that the 1stRespondent’s claim against the Defendants in Suit 1149/2003 had been dismissed by the Singapore High Court on the merits.8       On learning about the Advertisements, the Appellant, through its solicitors, wrote on 11 and 20 January 2010 to each of the Respondents protesting against the publication of the Advertisements, and stating that it would seek to “recover substantial damages and reliefs”. The Appellant also requested the Respondents to confirm whether they had authorised the publication of the Advertisements. The Respondents ignored the Appellant’s requests.The Appellant’s application for leave to commence committal proceedings9       This led the Appellant to apply,ex parte, in Originating Summons No 190 of 2010 for leave of court to commence committal proceedings against the Respondents for contempt of court. Leave was granted. The Appellant filed a statement pursuant to O 52 r 2(2) of the Rules of Court (Cap 322, R 5, 2006 Rev Ed), in which it was stated:[18]  However, nowhere in the advertisements was it mentioned that the worldwide Mareva Injunction had been set aside on 27 February 2004 or that the service of the Writ of Summons and Statement of Claim in Suit 1149 of 2003/H by the 1stRespondent on the Plaintiffs in Suit 1149 has [sic] been similarly set aside.[19]  This is a blatant disregard for and willful [sic] disobedience of the Order of Court dated 27 February 2004. The advertisements are utterly untrue and amount to a contempt of court. They wholly fail to mention that the worldwide Mareva Injunction has [sic] been set aside and is no longer in force. Additionally, the advertisements are in breach of the Order of Court dated 27 February 2004 requiring the 1stRespondent to serve copies of Orders of Court dated 27 February 2004 on parties who were notified of the worldwide Mareva Injunction.The basis of the Appellant’s case as set out above is that the 1stRespondent had, by placing the Advertisements, failed and/or refused to comply with the 27 February 2004 Court Order, and had thwarted and frustrated the very purpose of the said court order.The Judge’s decision10     Upon the application coming on for hearing, the Judge dismissed it on the following grounds:(a)     on the facts, the Respondents had complied with the terms of the 27 February 2004 Court Order; and(b)     the Advertisements did not amount to scandalising the court as they did not impugn the impartiality, integrity or independence of the Judiciary, and did not interfere with the administration of justice.11     The Judge was of the view that as the proceedings in Suit 1149/2003 had ended more than six years ago, the court should not trouble itself with the misleading statements of both the parties, especially when the Appellant could sue the 1stRespondent for defamation. In the GD at [24], the Judge said:... The misreporting ofcontinuingproceedings may, depending on circumstances, be a contempt of court if further proceedings are likely to be prejudiced or if this effect was intended by the misreporting but different considerations arise when the proceedings in question have already ended. If a judgment is misrepresented in a way that injures the reputation of one of the parties to the action, the remedy open to the injured party is, without more, to sue for defamation. InDunn v Bevan; Brodie v Bevan[1922] 1 Ch 276, Sargant J explained at 285:It seems to me that applications for alleged contempt ought to be very carefully scrutinised, and that the Court ought not in any way to enlarge the jurisdiction or apply it to matters which are outside the well established lines. It is suggested ... that there is a third form of contempt, not consisting either in scandalising the Court or in interfering with the course of justice; and that that form of contempt consists in a misrepresentation of the judgment of the Court and of the proceedings in Court for the purpose of injuring one of the parties. In my judgment there is not such a third class of contempt ...It seems to me that if the proceedings in a Court are ended, then, unless there is an attack on the Court itself, the mere making of statements as to the proceedings must be dealt with by the ordinary law of libel or slander if they are misrepresentations and go beyond what is legally permissible. …[emphasis in original]Our decision on the substantive issue raised in this appeal12     The Appellant raised a number of issues, but in our view, there was only one substantive issue that was material to the appeal. That issue was whether, in the circumstances of this case, the Respondents could be liable for contempt of court for publicly misrepresenting the nature or substance of the 27 February 2004 Court Order.13     Before us, counsel for the Appellant contended thatDunn v Bevan; Brodie v Bevan[1922] 1 Ch 276 (“Dunn v Bevan”) was only concerned with the specific risk of prejudicing ongoing proceedings and could not be read any wider, and that it did not decide that an interference with the administration of justice could never take place after the proceedings had ended. It was also pointed out thatDunn v Bevanwas concerned with an application for an injunction to prevent the respondent in that case from issuing circulars misrepresenting what the court had decided, and not an application to cite the respondent for contempt of court.14     Counsel also pointed out that inDunn v Bevan, the plaintiffs had issued circulars misrepresenting the proceedings in court where no order of court was made, unlike in the instant case. It was argued that the 1stRespondent had, by placing the Advertisements, misled the public into thinking that the Appellant’s assets had been frozen pursuant to an existing judgment of the High Court of Singapore. It was also argued that the 1stRespondent, in publishing the Advertisements, had falsely resurrected an order of court which has been set aside, and that the publication of that order in the Indonesian newspapers amounted to fabricating a court order to injure the commercial reputation of the Appellant. Counsel referred toRe Bineet Kumar SinghAIR 2001 SC 2018, where the Supreme Court of India held that the utilisation of a fabricated court order amounted to contempt of court. Counsel contended that for these reasons,Dunn v Bevancould be distinguished or should not be followed.15     Counsel also referred to a statement in the judgment of the Federal Court of Australia inTobacco Institute of Australia Limited v Australian Federation of Consumer Organisations Inc (No 2)(1993) 41 FCR 89 (“Tobacco Institute of Australia”), where Sheppard J declared (at 92):[T]he court will be astute to see to it that the public will not be misled by statements attributed to it and used out of context. If it emerged that that had occurred, the contempt of court which would be involved would be most serious and the punishment for it appropriate to its seriousness.In other words, as observed in a note on this case, P W Young, “Current Topics” (1993) 67 ALJ 487 at 489:[I]f a person misrepresents the decision of the court in what he or she says or in what he or she omits from saying, then there may be contempt of court which in appropriate cases will be punished severely.16     We rejected these arguments. They showed that counsel for the Appellant had misunderstood the law. The misrepresentation of a court order cannot interfere with the administration of justice. As Wills J said inR v Parke[1903] 2 KB 432 at 438, “[i]t is possible very effectually to poison the fountain of justice before it begins to flow. It is not possible to do so when the stream has ceased”.17     However, it is possible to damage the fountain of justice at any time by undermining public confidence in the administration of justice by baseless and unwarranted attacks on the integrity or impartiality of the courts and judges. Scurrilous abuse of a judgequajudge has the same effect. Scurrilous and unwarranted attacks on the Judiciary as an institution are certainly an aggravated form of contempt. Hence, in the present case, the Advertisements would only amount to a contempt of court if they amounted to scandalising the court, which they could not possibly do since they carried no suggestion as to the conduct of the court. Any person reading the Advertisements in Indonesia without any knowledge of the background would be none the wiser as to the truth or otherwise of what they purported to say. There was no question of the Advertisements amounting to disobedience of the 27 February 2004 Court Order or of thwarting its purpose (since the order was a negative order), nor could they amount to fabricating a court order.18     The decision inDunn v Bevanis clearly correct in principle. In that case, the misleading statements were made in a circular after judgment was given. The plaintiff sought an injunction to restrain the publication of the misleading statements. Sargant J refused to grant the injunction on the ground that the action being at an end and judgment having been delivered, there could be no possible interference with the course of justice by the issue of the circular, even if it misrepresented the judgment and the proceedings, or was calculated to injure one of the parties. Sargant J held that any such publication must be left to be dealt with by the ordinary law of libel. Finally, as pointed out by counsel for the Respondents, counsel for the Appellant had misread the decision inTobacco Institute of Australiaas in that case, the publication was made when proceedings were extant, and, therefore, the subject matter of the publication wassub judice.19     In our view, the Judge was correct in applyingDunn v Bevanin this case. No issue of interfering with the administration of justice arose since the court had already made its decision, in this case, more than six years ago.Conclusion20     For the foregoing reasons, we dismissed this appeal with costs.",
        "The Appellant’s application for leave to commence committal proceedings": "9       This led the Appellant to apply,ex parte, in Originating Summons No 190 of 2010 for leave of court to commence committal proceedings against the Respondents for contempt of court. Leave was granted. The Appellant filed a statement pursuant to O 52 r 2(2) of the Rules of Court (Cap 322, R 5, 2006 Rev Ed), in which it was stated: [18]  However, nowhere in the advertisements was it mentioned that the worldwide Mareva Injunction had been set aside on 27 February 2004 or that the service of the Writ of Summons and Statement of Claim in Suit 1149 of 2003/H by the 1stRespondent on the Plaintiffs in Suit 1149 has [sic] been similarly set aside. [19]  This is a blatant disregard for and willful [sic] disobedience of the Order of Court dated 27 February 2004. The advertisements are utterly untrue and amount to a contempt of court. They wholly fail to mention that the worldwide Mareva Injunction has [sic] been set aside and is no longer in force. Additionally, the advertisements are in breach of the Order of Court dated 27 February 2004 requiring the 1stRespondent to serve copies of Orders of Court dated 27 February 2004 on parties who were notified of the worldwide Mareva Injunction. The basis of the Appellant’s case as set out above is that the 1stRespondent had, by placing the Advertisements, failed and/or refused to comply with the 27 February 2004 Court Order, and had thwarted and frustrated the very purpose of the said court order.",
        "The Judge’s decision": "10     Upon the application coming on for hearing, the Judge dismissed it on the following grounds: (a)     on the facts, the Respondents had complied with the terms of the 27 February 2004 Court Order; and (b)     the Advertisements did not amount to scandalising the court as they did not impugn the impartiality, integrity or independence of the Judiciary, and did not interfere with the administration of justice. 11     The Judge was of the view that as the proceedings in Suit 1149/2003 had ended more than six years ago, the court should not trouble itself with the misleading statements of both the parties, especially when the Appellant could sue the 1stRespondent for defamation. In the GD at [24], the Judge said: ... The misreporting ofcontinuingproceedings may, depending on circumstances, be a contempt of court if further proceedings are likely to be prejudiced or if this effect was intended by the misreporting but different considerations arise when the proceedings in question have already ended. If a judgment is misrepresented in a way that injures the reputation of one of the parties to the action, the remedy open to the injured party is, without more, to sue for defamation. InDunn v Bevan; Brodie v Bevan[1922] 1 Ch 276, Sargant J explained at 285: It seems to me that applications for alleged contempt ought to be very carefully scrutinised, and that the Court ought not in any way to enlarge the jurisdiction or apply it to matters which are outside the well established lines. It is suggested ... that there is a third form of contempt, not consisting either in scandalising the Court or in interfering with the course of justice; and that that form of contempt consists in a misrepresentation of the judgment of the Court and of the proceedings in Court for the purpose of injuring one of the parties. In my judgment there is not such a third class of contempt ...It seems to me that if the proceedings in a Court are ended, then, unless there is an attack on the Court itself, the mere making of statements as to the proceedings must be dealt with by the ordinary law of libel or slander if they are misrepresentations and go beyond what is legally permissible. … [emphasis in original]",
        "Our decision on the substantive issue raised in this appeal": "12     The Appellant raised a number of issues, but in our view, there was only one substantive issue that was material to the appeal. That issue was whether, in the circumstances of this case, the Respondents could be liable for contempt of court for publicly misrepresenting the nature or substance of the 27 February 2004 Court Order. 13     Before us, counsel for the Appellant contended thatDunn v Bevan; Brodie v Bevan[1922] 1 Ch 276 (“Dunn v Bevan”) was only concerned with the specific risk of prejudicing ongoing proceedings and could not be read any wider, and that it did not decide that an interference with the administration of justice could never take place after the proceedings had ended. It was also pointed out thatDunn v Bevanwas concerned with an application for an injunction to prevent the respondent in that case from issuing circulars misrepresenting what the court had decided, and not an application to cite the respondent for contempt of court. 14     Counsel also pointed out that inDunn v Bevan, the plaintiffs had issued circulars misrepresenting the proceedings in court where no order of court was made, unlike in the instant case. It was argued that the 1stRespondent had, by placing the Advertisements, misled the public into thinking that the Appellant’s assets had been frozen pursuant to an existing judgment of the High Court of Singapore. It was also argued that the 1stRespondent, in publishing the Advertisements, had falsely resurrected an order of court which has been set aside, and that the publication of that order in the Indonesian newspapers amounted to fabricating a court order to injure the commercial reputation of the Appellant. Counsel referred toRe Bineet Kumar SinghAIR 2001 SC 2018, where the Supreme Court of India held that the utilisation of a fabricated court order amounted to contempt of court. Counsel contended that for these reasons,Dunn v Bevancould be distinguished or should not be followed. 15     Counsel also referred to a statement in the judgment of the Federal Court of Australia inTobacco Institute of Australia Limited v Australian Federation of Consumer Organisations Inc (No 2)(1993) 41 FCR 89 (“Tobacco Institute of Australia”), where Sheppard J declared (at 92): [T]he court will be astute to see to it that the public will not be misled by statements attributed to it and used out of context. If it emerged that that had occurred, the contempt of court which would be involved would be most serious and the punishment for it appropriate to its seriousness. In other words, as observed in a note on this case, P W Young, “Current Topics” (1993) 67 ALJ 487 at 489: [I]f a person misrepresents the decision of the court in what he or she says or in what he or she omits from saying, then there may be contempt of court which in appropriate cases will be punished severely. 16     We rejected these arguments. They showed that counsel for the Appellant had misunderstood the law. The misrepresentation of a court order cannot interfere with the administration of justice. As Wills J said inR v Parke[1903] 2 KB 432 at 438, “[i]t is possible very effectually to poison the fountain of justice before it begins to flow. It is not possible to do so when the stream has ceased”. 17     However, it is possible to damage the fountain of justice at any time by undermining public confidence in the administration of justice by baseless and unwarranted attacks on the integrity or impartiality of the courts and judges. Scurrilous abuse of a judgequajudge has the same effect. Scurrilous and unwarranted attacks on the Judiciary as an institution are certainly an aggravated form of contempt. Hence, in the present case, the Advertisements would only amount to a contempt of court if they amounted to scandalising the court, which they could not possibly do since they carried no suggestion as to the conduct of the court. Any person reading the Advertisements in Indonesia without any knowledge of the background would be none the wiser as to the truth or otherwise of what they purported to say. There was no question of the Advertisements amounting to disobedience of the 27 February 2004 Court Order or of thwarting its purpose (since the order was a negative order), nor could they amount to fabricating a court order. 18     The decision inDunn v Bevanis clearly correct in principle. In that case, the misleading statements were made in a circular after judgment was given. The plaintiff sought an injunction to restrain the publication of the misleading statements. Sargant J refused to grant the injunction on the ground that the action being at an end and judgment having been delivered, there could be no possible interference with the course of justice by the issue of the circular, even if it misrepresented the judgment and the proceedings, or was calculated to injure one of the parties. Sargant J held that any such publication must be left to be dealt with by the ordinary law of libel. Finally, as pointed out by counsel for the Respondents, counsel for the Appellant had misread the decision inTobacco Institute of Australiaas in that case, the publication was made when proceedings were extant, and, therefore, the subject matter of the publication wassub judice. 19     In our view, the Judge was correct in applyingDunn v Bevanin this case. No issue of interfering with the administration of justice arose since the court had already made its decision, in this case, more than six years ago.",
        "Conclusion": "20     For the foregoing reasons, we dismissed this appeal with costs."
    }
}