{
    "case_title": "Astrata (Singapore) Pte Ltd \n      v\n      Portcullis Escrow Pte Ltd and another and other\n            matters",
    "ncitation": "[2011] SGCA 20",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Background": "3       Astrata is a company incorporated in Singapore\n                    and is part of the Astrata group of companies, of which the ultimate holding\n                    company is Astrata Group Incorporated (“AGI”), a company\n                    incorporated in Nevada, USA. Astrata is in the business of designing and\n                    developing advanced location-based information technology services and solutions\n                    that combine global positioning systems, wireless communication (satellite or\n                    terrestrial) and geographical information technology. These solutions enable\n                    businesses, institutions and governments to monitor, trace and control the\n                    movement and status of machinery vehicles, personnel or other\n                assets. 4       In a Supply Agreement dated 10 April 2007\n                    (“the Supply Agreement”), Astrata agreed to develop and supply an\n                    electronic plate system to Tridex. The Supply Agreement was defined as\n                    comprising the Supply Agreement itself and any Points of Agreement\n                    (“PoA”) between Astrata and Tridex, of which 12 were eventually\n                    executed. The Supply Agreement provided for arbitration with respect to any\n                    disputes between the parties. 5       Pursuant to PoA #7 dated 10 October 2007,\n                    Astrata, Tridex and PEPL entered into a tripartite Escrow Agreement (“the\n                    Escrow Agreement”) on 23 October 2007. The Escrow Agreement\n                    designated PEPL as the Escrow Agent to hold in escrow the Comprehensive Source\n                    Code and the Comprehensive Engineering Diagrams (collectively “the Escrow\n                    Property”) which Astrata was required to deliver to Tridex under the\n                    Supply Agreement. The Escrow Agreement also stipulated in cll 7(i)(c) and\n                    7(ii)(b) a list of events on the occurrence of any of which PEPL was obliged to\n                    release the Escrow Property to Tridex (the “triggering events” or\n                    a “triggering event”, as the case may be). We will refer to these\n                    contractual arrangements in more detail later.",
        "How disputes came about": "6       Disagreements developed between Astrata and\n                    Tridex under the Supply Agreement and the Escrow Agreement. The dispute surfaced\n                    after AGI sought Chapter 11 reorganisation under the United States Bankruptcy\n                    Code on 6 August 2009, after a failed voluntary restructuring proposal. Its\n                    final Reorganisation Plan (“the Reorganisation Plan”) was\n                    confirmed by the competent United States court on 15 December 2009 and became\n                    effective on 4 January 2010 (“AGI’s Chapter 11”).\n                    AGI’s Chapter 11 resulted in a change of shareholder control of AGI and is\n                    now controlled by a new shareholder called Fame Trading Ltd holding 94.5% of the\n                    shares in AGI.[note: 1] 7       On 5 February 2010, Tridex purported to\n                    terminate the Supply Agreement on the ground that Astrata had breached its\n                    obligations under the Supply Agreement. On the same day, Tridex wrote to PEPL\n                    stating that it was invoking its rights under the Escrow Agreement on the ground\n                    that a triggering event in cl 7(i)(c) had occurred,viz, AGI’s Chapter 11 which in Tridex’s view\n                    constituted an arrangement for the benefit of AGI’s creditors. Tridex\n                    further notified PEPL that it would call for the delivery of the Comprehensive\n                    Source Code at the appropriate time. 8       Astrata objected to Tridex’s claim that\n                    AGI’s Chapter 11 was a triggering event, and in a letter dated\n                    9 February 2010, instructed PEPL not to release the Escrow Property as\n                    AGI’s scheme of arrangement was “for the purpose of a genuine\n                    amalgamation or reconstruction” (as per the language in cll 7(i)(c)\n                    and 7(ii)(b) of the Escrow Agreement: see also[11]below). In this judgment, we shall refer to this dispute as\n                    “the Bilateral Dispute”. In the same letter, Astrata also sought\n                    confirmation from PEPL that it had not delivered the Escrow Property to Tridex.\n                    When Astrata did not receive any response from PEPL, Astrata filed the\n                    Injunction Application to restrain (a) Tridex from requiring PEPL to\n                    deliver the Escrow Property, and (b) PEPL from delivering the Escrow\n                    Property, pending the determination of the Bilateral Dispute by an arbitral\n                    tribunal under the Supply Agreement. 9       PEPL responded by filing an interpleader summons\n                    which it later withdrew in order to file the Declaration Application (which also\n                    included interpleader relief). The declaration sought was whether “the\n                    conditions in cl 7(i)(c) and cl 7(ii)(b) had been satisfied”,ie, any triggering event had occurred, thereby\n                    entitling PEPL to release the Escrow Property to Tridex. In response to the\n                    filing of the Declaration Application, Astrata filed the Stay Application\n                    pursuant to s 11A of the International Arbitration Act (Cap 143A, 2002 Rev\n                    Ed) (“IAA”) to stay the hearing of the Declaration Application\n                    until the Bilateral Dispute has been determined by an arbitral tribunal to be\n                    appointed under the Supply Agreement.",
        "Material issues in this case": "10     In this judgment, instead of discussing the\n                    Judge’s decisions and his reasoning with reference to the Injunction\n                    Application, the Stay Application or the Declaration Application, we shall only\n                    consider the two material issues that have arisen from the facts of this case.\n                    The first (under Civil Appeal No 158 of 2010) is whether the Bilateral\n                    Dispute is subject to cl 29.1 (the arbitration clause) in the Supply\n                    Agreement (“the Jurisdiction Issue”). If the Bilateral Dispute is\n                    referable to arbitration, the second issue (under Civil Appeal No 159 of\n                    2010) will not arise and the proceedings in this case will be stayed pending the\n                    outcome of the arbitration which Astrata has already initiated under\n                    cl 29.1 of the Supply Agreement. If the Bilateral Dispute isnotreferable to arbitration, however, the second issue\n                    arises as to whether AGI’s Chapter 11 is a triggering event under\n                    cll 7(i)(c) and 7(ii)(b) of the Escrow Agreement (“the Substantive\n                    Issue”). If the Substantive Issue is decided against Astrata, Tridex\n                    would be entitled to call for delivery of the Escrow Property from PEPL.\n                    Conversely, if the Substantive Issue is decided in Astrata’s favour,\n                    Tridex would not be entitled to delivery of the Escrow Property. Accordingly,\n                    the disposition of Astrata’s application in Originating Summons\n                    No 1082 of 2010, for leave to appeal against the Judge’s declaration\n                    in the Judgment that cll 7(i)(c) and 7(ii)(b) had been satisfied on the\n                    facts (viz, the Leave Application), would hinge on\n                    the outcome of the Substantive Issue. 11     With respect to the Jurisdictional Issue, the\n                    Judge held that the Bilateral Dispute was not referable to arbitration under the\n                    Supply Agreement, and accordingly dismissed both the Injunction Application and\n                    the Stay Application. With respect to the Substantive Issue, the Judge proceeded\n                    on the basis that AGI’s Chapter 11 was an arrangement for the benefit\n                    of creditors and held that it constituted a triggering event under\n                    cll 7(i)(c) and 7(ii)(b) of the Escrow Agreement because (a) the\n                    saving clause “save for the purpose of a genuine amalgamation or\n                    reconstruction” (“the Saving Clause”) did not apply to that\n                    triggering event, but that even if it did, (b) AGI’s Chapter 11 was\n                    not a “reconstruction” for the purposes of the Saving Clause. We\n                    shall examine first the Jurisdictional Issue as it is logically prior to the\n                    Substantive Issue.",
        "The Jurisdictional Issue": "12     The material provisions pertaining to the\n                    Jurisdictional Issue are found in cll 21.1 and 29.1 of the Supply\n                    Agreement, PoA #7 and cll 7, 18 and 20(c) of the Escrow\n                Agreement. 13     Clause 21.1 of the Supply Agreement\n                    (which contains the entire agreement clause) provides as follows: Subject to the [PoAs] which have been executed and shall be executed\n                        between [Tridex] on one hand and [AGI] and [Astrata] on the other in\n                        relation to this Supply Agreement, this Supply Agreement constitutes the\n                        entire agreement between the Parties in relation to the subject matter\n                        herein, and supersedes all prior representations, agreements, statements and\n                        understandings, whether verbal or in writing. 14     Clause 29.1 (which contains the\n                    arbitration agreement between Astrata and Tridex) provides as follows: If there is a dispute relating to any claim or controversy arising out of,\n                        or in connection with this Supply Agreement, including any question\n                        regarding its formation, existence, validity, enforceability, performance,\n                        interpretation, breach, or termination (the “Dispute”) ...\n                        then the Dispute may at the election of either Party be finally settled\n                        under the Rules of Arbitration of the International Chamber of Commerce by\n                        one or more arbitrators appointed in accordance with the said Rules. 15     PoA #7 contains the parties’ agreement\n                    to put the Escrow Property into escrow, to be released to Tridex upon the\n                    occurrence of any of the triggering events. Clause 1(v)(c) of PoA #7\n                    provides that the Comprehensive Source Code kept by (the nominated escrow\n                    agent): 1) … shall be: v) released to Tridex ... c) If [Astrata] and/or [AGI] (but not any of its subsidiaries or\n                        associates other than Astrata (Asia Pacific) Pte Ltd or [Astrata])\n                        (hereinafter singularly or collectively referred to as “ASAG”)\n                        ceases or threatens to cease to carry on its business; if a receiver,\n                        administrator or similar officer is appointed over all or any part of the\n                        assets or undertaking of ASAG; if ASAG makes any arrangement for the benefit\n                        of its creditors or ASAG goes into liquidation save for the purpose of a\n                        genuine amalgamation or reconstruction. The Escrow Agreement was executed by Astrata and Tridex pursuant to\n                    PoA #7, with PEPL ultimately appointed as the escrow agent. 16     Clauses 7(i)(c) and 7(ii)(b) of the\n                    Escrow Agreement both prescribe the same triggering events upon the occurrence\n                    of any of which Tridex would be entitled to the delivery of the Comprehensive\n                    Source Code and the Comprehensive Engineering Diagrams respectively. For present\n                    purposes, we need only to refer to cl 7(i)(c), the text of which is\n                    reproduced below. 7)Release of Documents to Tridex i)    PEPL shall, without consultation or approval from\n                            Astrata, release to Tridex all envelopes marked “Comprehensive\n                            Source Code” together with the index which relates to the\n                            C[omprehensive] S[ource] C[ode] when either one of the following three\n                            conditions is satisfied: a)    [not applicable] b)    [not applicable] c)    on Tridex’s production of conclusive proof\n                            (including but not limited to the production of authenticated copies of\n                            publicly filed documents confirming the appointment of the receiver,\n                            administrator or similar officer as referred to in this paragraph), that\n                            [Astrata] and/or [AGI] (but not any of its subsidiaries or associates\n                            other than Astrata (Asia Pacific) Pte Ltd or [Astrata]) (hereinafter\n                            singularly or collectively referred to as “ASAG”) has\n                            ceased or threatened to cease to carry on its business orhas had a receiver, administrator or similar officer\n                                appointed over all or any part of its assetsor\n                            undertaking orhas made any arrangement for the\n                                benefit of its creditors or gone into liquidation save for the\n                                purpose of a genuine amalgamation or\n                            reconstruction. [emphasis added] 17     Clause 11 of the Escrow Agreement\n                    contains the entire agreement clause as follows: This Escrow Agreement constitutes the entire agreement between all three\n                        Parties (but not Tridex and Astrata alone) in relation to the subject matter\n                        herein, and supersedes all prior representations, agreements, statements and\n                        understandings, whether verbal or in writing. It may be noted that the words in parenthesis “(but not Tridex\n                    and Astrata alone)” make clear that the Escrow Agreement does not\n                    constitute the entire agreement between Tridex and Astrata as the Supply\n                    Agreement also constitutes the entire agreement between them with respect to the\n                    matters under the Supply Agreement. 18     Clause 18 of the Escrow Agreement\n                    provides a dispute resolution mechanism and also, specifically, for submission\n                    to the non-exclusive jurisdiction of the “court of Singapore” in\n                    relation to any Dispute (as defined therein). The clause reads as\n                    follows: a) If there is a dispute relating to any claim or controversy arising out\n                        of, or in connection with this Escrow Agreement, including any question\n                        regarding its formation, existence, validity, enforceability, performance,\n                        interpretation, breach, or termination (the “Dispute”), then\n                        PEPL shall have the right to terminate this Escrow Agreement forthwith by\n                        giving 30 days’ notice and require Tridex and Astrata to appoint\n                        another Escrow Agent to replace PEPL, failing which PEPL shall also have the\n                        right to issue an interpleader summons to place the [Escrow Property] with\n                        the Singapore Court pending the outcome of the dispute between Tridex and\n                        Astrata. Both Tridex and Astrata agree to be jointly and severally liable to\n                        indemnify PEPL for all costs and expenses arising therefrom. b) The parties hereby submit to the non-exclusive jurisdiction of the\n                        court of Singapore. c) Notwithstanding anything to the contrary, in the event of a Dispute,\n                        Tridex and Astrata shall continue to fulfil their respective obligations\n                        under this Escrow Agreement until a settlement of the Dispute has been\n                        reached. 19     In addition to cl 18(b), the Escrow\n                    Agreement also provides a general submission to the non-exclusive jurisdiction\n                    of the Singapore court in cl 20(c) as follows: Jurisdiction: The parties hereby submit to\n                        the non-exclusive jurisdiction of the court of Singapore. 20     PEPL is not involved in the Bilateral Dispute\n                    as the Singapore court has granted an order to PEPL to interplead and to place\n                    the Escrow Property in the control of the Singapore court under the Declaration\n                    Application. Accordingly, there is no trilateral dispute under the Escrow\n                    Agreement in these proceedings. In our view, since the Bilateral Dispute arises\n                    out of the Escrow Agreement, it would,prima\n                    facie, fall to be resolved under the dispute resolution mechanism in\n                    the Escrow Agreement unless it has been displaced by the arbitration agreement\n                    between Astrata and Tridex in the Supply Agreement pursuant to which the Escrow\n                    Agreement was executed (ie, specifically PoA #7).\n                    As PEPL has been allowed to interplead, it is therefore not involved in the\n                    Jurisdictional Issue.",
        "Astrata’s case": "21     Astrata’s case is that cl 29.1 of\n                    the Supply Agreement applies to any dispute between Astrata and Tridex in\n                    relation to the Escrow Property and therefore applies to the Bilateral Dispute\n                    even though the Bilateral Dispute arose under the Escrow Agreement. Astrata\n                    argues as follows: (a)     the Supply Agreement (including PoA\n                        #7) constitutes the entire agreement between Astrata and Tridex (see\n                        cl 21.1 of the Supply Agreement) and the triggering events in\n                        PoA #7 are identical to those in the Escrow\n                    Agreement; (b)     the\n                        Escrow Agreement constitutes the entire agreement between Astrata, Tridex\n                        and PEPL, “but not Tridex and Astrata alone” (see cl 11\n                        of the Escrow Agreement): these words are consistent with the Escrow\n                        Agreement being applicable to trilateral disputes and the Supply Agreement\n                        continuing to apply to bilateral disputes between Astrata and Tridex, and\n                        accordingly there is no conflict between the dispute resolution mechanism in\n                        the two agreements; (c)     any apparent conflict between them can be reconciled, and resolved by\n                        restricting the non-exclusive jurisdiction clause in the Escrow Agreement to\n                        seeking curial assistance from the Singapore courts,eg, interim orders, as was the approach of the English\n                        courts in thePaul Smithline of cases (see[30]below). Alternatively, the\n                        Supply Agreement prevails over the Escrow Agreement as it is the commercial\n                        centre of the transaction: see the approach of the court inUBS AG & Anor v HSH Nordbank AG[2010]\n                        1 ALL ER (Comm) 727; (d)     the decisions inTransocean Offshore\n                            International Ventures Ltd v Burgundy Global Exploration Corp[2010] 2 SLR 821 at [21]\n                            (“Transocean”) andL & M Concrete Specialists Pte Ltd v United Eng Contractors\n                            Pte Ltd[2000] 2 SLR(R) 852 are distinguishable on the\n                        facts.",
        "Tridex’s case": "22     Tridex’s case is that the Bilateral\n                    Dispute is not subject to arbitration under cl 29.1 of the Supply\n                    Agreement. Tridex argues as follows: (a)     Astrata and Tridex have\n                        intentionally carved out the escrow matters from the Supply Agreement and\n                        put them into the Escrow Agreement to be dealt with exclusively under that\n                        agreement; (b)     clause 11 of the Escrow Agreement provides that the Escrow Agreement\n                        constitutes the entire agreement between the three parties in relation to\n                        the subject matter covered by the Escrow Agreement, and supersedes all prior\n                        agreements between the parties; (c)     under cl 18(b) of the Escrow Agreement, the parties\n                        have agreed to submit to the non-exclusive jurisdiction of the Singapore\n                        court on any disputes relating to any claim or controversy in connection\n                        with the Escrow Agreement,ie, any dispute\n                        that arises between and/or among the three parties, or any of them, in\n                        relation to the matters connected to the Escrow\n                    Agreement; (d)     further,\n                        under cl 20(c) of the Escrow Agreement, the three parties have also\n                        agreed to submit to the non-exclusive jurisdiction of the court of Singapore\n                        generally,ie, on all matters under the Escrow\n                        Agreement; (e)     clear and specific words are required to incorporate an arbitration\n                        agreement which are absent from the Escrow Agreement: seeTransoceanat [18]; (f)     PoA #7 did not constitute an agreement to arbitrate the escrow\n                        issues: it merely provided that an escrow agreement be signed to incorporate\n                        the parties’ agreements on the disposal of the Escrow\n                    Property; (g)     clause 4(a) of the Escrow Agreement also confirms the parties’\n                        intention not to refer escrow matters to arbitration by providing that the\n                        Escrow Property “shall be transferred to Tridex notwithstanding any\n                        provisions otherwise in the earlier agreement(s), entered into between\n                        Tridex and Astrata” if the conditions in the Escrow Agreement are\n                        satisfied; (h)     in\n                        contrast with the Supply Agreement, the parties’ choice of Singapore\n                        law as the governing law of the Escrow Agreement also reinforces the\n                        parties’ intention to refer any dispute arising thereunder to court\n                        adjudication; (i)Transoceanis indistinguishable from the\n                        present case. Furthermore, the case ofDLA Piper Hong\n                            Kong v China Property Development (Holdings) Ltd[2010] HKLRD\n                        903 (“DLA Piper”) is analogous\n                        to the facts of the present case and the reasoning of the Hong Kong Court of\n                        Appeal is applicable to the present case.",
        "Our decision on the Jurisdictional Issue": "23     The Jurisdictional Issue has arisen because,\n                    contrary to the views of the Judge that “these complex agreements have\n                    been painstakingly drafted, advised and negotiated with the assistance of\n                    lawyers” (see the Judgment at [60]), the parties’ legal advisers, if any, have\n                    singularly failed to express clearly and explicitly whether any dispute between\n                    Astrata and Tridex in relation to the Escrow Property is subject to arbitration\n                    under cl 29.1 of the Supply Agreement in drafting PoA #7 and also the\n                    Escrow Agreement. It was a simple step that should have been taken. This\n                    omission has led to serious disagreement between the parties and a not\n                    inconsiderable expenditure of intellectual effort by the Judge to determine\n                    their intention by their words, or lack of them. As we shall see, this is not an\n                    isolated failure in the present case. There is also disagreement on the meaning\n                    and effect of the triggering events in cll 7(i)(c) and 7(ii)(b), because\n                    the draftsman appears to have simply incorporated (what the Judge recognises as)\n                    boilerplate clauses, drafted for use in the context of an English model of\n                    companies insolvency legislation, into a commercial agreement to which a US\n                    company is a party. 24     In this appeal, neither Astrata nor Tridex is\n                    proceeding on the basis that there is a conflict between the Supply Agreement\n                    and the Escrow Agreement. Astrata’s case is that the two agreements can be\n                    read together (as was intended by the parties) to separate trilateral disputes\n                    from bilateral disputes affecting the Escrow Property: the Supply Agreement,\n                    being the primary entire agreement between the parties, applies to all disputes\n                    between them. Tridex’s case is that the parties intended the Escrow\n                    Agreement to be a self-contained agreement on all matters relating to the Escrow\n                    Property, and that any dispute, whether trilateral or bilateral, relating to the\n                    Escrow Property ought to be resolved under the dispute resolution mechanism as\n                    set out under the Escrow Agreement. What the true answer is turns on the proper\n                    construction of the terms of the Escrow Agreement. 25     We do not agree with Astrata’s argument\n                    that since the Escrow Agreement is a trilateral agreement, the dispute\n                    resolution mechanism in cl 18 of the Escrow Agreement applies only to\n                    trilateral disputes between Astrata, Tridex and PEPL, and not to any dispute\n                    between Tridex and Astrata “alone”. This argument is not borne out\n                    by cl 18(a) of the Escrow Agreement which, as drafted, has a much wider\n                    scope in that it provides,inter alia, thatif there is a dispute relating to any claim or\n                        controversy arising out of, or in connection with this Escrow\n                        Agreement, then PEPL may interplead and place the Escrow Property\n                    with the Singapore court pending the outcome of the dispute between Tridex and\n                    Astrata. The italicised words above are not qualified in any way by reference to\n                    the identities of the disputants and, in our view, are broad enough to refer to\n                    a dispute relating to any claim or controversy arising out of the Escrow\n                    Agreement between (a) Astrata and Tridex; (b) Astrata and PEPL;\n                    (c) PEPL and Tridex; and (d) Astrata, Tridex and PEPL. There is no\n                    reason to cut down their meaning and restrict their application only to\n                    trilateral disputes. All disputes arising out of the Escrow Agreement areprima faciesubject to the non-exclusive\n                    jurisdiction of the court of Singapore as provided under cl 18(b) of the\n                    Escrow Agreement. The crucial issue is whether the presumptive exclusion of\n                    cl 29.1 of the Supply Agreement by cl 18(a) of the Escrow Agreement\n                    has been displaced by other provisions or words in the Escrow\n                Agreement. 26     In this regard, Astrata relies on the\n                    parenthetical words “(but not to Tridex and Astrata alone)” in the\n                    Entire Agreement clause of the Escrow Agreement (cl 11) to argue that those\n                    words were intended to carve out disputes between Astrata and Tridex in relation\n                    to the Escrow Property from cl 18 of the Escrow Agreement. In our view,\n                    those words do no more than to recognise that there is another separate entire\n                    agreement between Astrata and Tridex. If a carving out were intended, it would\n                    surely have been done in cl 18 itself and not in cl 11. Those words do\n                    not evince an intention that the arbitration agreement in the Supply Agreement\n                    should apply to disputes arising from the Escrow Agreement. The two agreements\n                    are consistent with each other, as each was intended to apply in their\n                    respective spheres, subject to their respective dispute resolution\n                    mechanisms. 27     Astrata has also argued that the words\n                    “pending the outcome of the dispute between Tridex and Astrata” in\n                    cl 18(a) of the Escrow Agreement refer to the outcome of the dispute\n                    between Tridex and Astrata by arbitration. We are unable to accept this argument\n                    for two reasons. First, there is no basis to read a reference to arbitration\n                    into those words as they are equally capable of referring to the outcome of\n                    court proceedings. Indeed, utilising the exact same terminology that was used to\n                    define a “Dispute” in cl 29.1 of the Supply Agreement,\n                    cl 18(a) of the Escrow Agreement goes on to provide that a\n                    “Dispute” under the Escrow Agreement is one that relates to\n                    “any claim or controversy arising out of, or in connection, with [the]\n                    Escrow Agreement, including any question regarding its formation, existence,\n                    validity, enforceability, performance, interpretation, breach, or\n                    termination”. Accordingly, the phrase cited at the start of this\n                    paragraph appears to be one capable of referring to a bilateral dispute between\n                    Astrata and Tridex relating to any claim or controversy arising out of, or in\n                    connection with this Escrow Agreement (see also above at [25]). At best, these words are neutral since\n                    they say nothing about the nature of the dispute resolution mechanism that will\n                    produce the outcome of the Bilateral Dispute. 28     Secondly, we see no rational basis in\n                    Astrata’s argument that these words have the effect of displacing the\n                    presumptive effect of the jurisdiction clause, albeit a non-exclusive one. We\n                    earlier mentioned that cl 18(a) applies to both bilateral and trilateral\n                    disputes. We can test the rationale with the following hypothesis. A dispute in\n                    category (b) or (c) (see[25]above)\n                    would arise if, for example, PEPL agrees or disagrees with Tridex that a\n                    triggering event has occurred under, say, cl 7(i)(c) and decides to act\n                    accordingly. In the first case, Astrata may dispute PEPL’s decision, and\n                    in the second case, Tridex may dispute PEPL’s decision. Assuming that it\n                    is the first case, Astrata would have to commence proceedings against PEPL for\n                    injunctive relief to restrain PEPL from delivering the Escrow Property to\n                    Tridex. This was what Astrata had to do in the present case when it did not\n                    receive confirmation from PEPL that PEPL would not deliver the Escrow Property\n                    to Tridex. 29     But let us assume further that PEPL, instead\n                    of interpleading, decides to stand its ground (backed by Tridex with a full\n                    indemnity on costs) and contests Astrata’s claim. In this situation, there\n                    would doubtless be a claim by Astrata against PEPL arising out of the Escrow\n                    Agreement. Such a dispute would be subject to the jurisdiction of the Singapore\n                    court and not referable to arbitration (since PEPL is not a party to any\n                    arbitration agreement). Now, the essence of the dispute between Astrata and PEPL\n                    in this situation is no different from the essence of the Bilateral Dispute,\n                    which is whether a triggering event under cl 7(i)(c) of the Escrow\n                    Agreement has occurred in consequence of AGI’s Chapter 11. What then, it\n                    may be asked, is the basis for Astrata’s argument that if the dispute were\n                    with PEPL, the dispute resolution clause in Escrow Agreement would be\n                    applicable, but if the dispute were with Tridex (with PEPL interpleading) the\n                    same dispute resolution clause would not apply but cl 29.1 of the Supply\n                    Agreement would apply? Astrata has given no explanation as to why it was\n                    prepared to accept court adjudication under the Escrow Agreement where it had a\n                    dispute with PEPL but not where it had a dispute with Tridex. 30     Astrata has further contended that the\n                    non-exclusive jurisdiction clauses (cll 18(b) and 20(c)) of the Escrow\n                    Agreement are limited to curial assistance in support of arbitration. We are\n                    also unable to accept this argument. Such a construction may be attractive in\n                    cases where there are arbitration as well as non-exclusive jurisdiction clauses\n                    in the same contract or, perhaps, in related contracts between the same parties,eg, as in thePaul\n                        Smithline of cases (Paul Smith Ltd v H &\n                        S International Holding Inc[1991] 2 Lloyd’s Rep 127\n                    QBD (Comm) discussed inAXA Re v Ace Global Markets\n                        Ltd[2006] 1 Lloyd’s Rep IR 683 QBD (Comm)) but it has\n                    no application in the present case. 31     In the circumstances, we would give the\n                    non-exclusive jurisdiction clauses their ordinary meaning. They have not been\n                    displaced by any provision or words in the Escrow Agreement or the Supply\n                    Agreement. So construed, and as recognised in case law (see, for instance,Transoceanat [16] andBambang Sutrisno v Bali\n                        International Finance Ltd and others[1999] 2 SLR(R) 632 at\n                        [11]), the non-exclusive\n                    jurisdiction clauses presumptively exclude other means of dispute resolution in\n                    favour of the non-exclusive forum. 32     We would also agree with Tridex’s\n                    argument that this conclusion is reinforced by the choice of Singapore law in\n                    cl 17 of the Escrow Agreement. When contrasted to the choice of English law\n                    in the Supply Agreement, the choice of Singapore law in the Escrow Agreement,\n                    which deals only with the Escrow Property, fortifies the presumption in favour\n                    of Singapore as the non-exclusive forum in respect of disputes relating only to\n                    the Escrow Property. It follows that s 11A of the IAA has no application to\n                    the Bilateral Dispute, and it is therefore unnecessary for us to decide whether\n                    or not to refer the Bilateral Dispute to arbitration.",
        "The Substantive Issue": "33     The Substantive Issue is whether any condition\n                    in cl 7(i)(c) has been triggered so as to entitle Tridex to delivery of the\n                    Escrow Property.",
        "AGI’s Chapter 11": "34     As mentioned earlier at[11], the Judge held that AGI’s\n                    Chapter 11 constituted a triggering event under cl 7(i)(c) (and also\n                    cl 7(ii)(b)) of the Escrow Agreement on the ground that it was an\n                    arrangement for the benefit of its creditors and that this condition did not\n                    come within the terms of the Saving Clause. The Judge also held that in any case\n                    AGI’s Chapter 11 was not a reconstruction for the purposes of the\n                    Saving Clause. Before we discuss the Judge’s analyses of these issues, it\n                    is necessary that we provide the background to the reasons for AGI seeking\n                    Chapter 11 reorganisation as it is, in our view, material to the question\n                    whether AGI “has made any arrangement for the benefit of its\n                    creditors” under cl 7(i)(c) of the Escrow Agreement. 35     In 2009, AGI experienced financial\n                    difficulties and proposed an out-of-court restructuring plan (“the\n                    Out-of-Court Plan”) for approval by its creditors and shareholders.\n                    Almost all creditors voted in favour of the Out-of-Court Plan. However, one Jed\n                    Frost, a shareholder and unsecured creditor, and the Vision group (comprising\n                    Vision Opportunity China Fund Limited, Vision Capital Advantage Fund LP and\n                    Vision Opportunity Master Fund Ltd, collectively “Vision”), a\n                    shareholder and purported unsecured creditor, voted against the Out-of-Court\n                    Plan. As a result, AGI could not effectuate the Out-of-Court Plan. Following\n                    some failed negotiations, AGI applied for bankruptcy protection under\n                    Chapter 11 in order to preserve AGI’s ability to restructure its\n                    debts, to preserve AGI’s business operations, and to preserve AGI’s\n                    assets for the benefit of its creditors. 36     As mentioned earlier (see[6]above), AGI’s Chapter 11 took effect from\n                    4 January 2010 resulting in 94.5% of AGI’s shares being held by Fame\n                    Trading Ltd, a white knight who had provided interim financing of US$8.5 million\n                    to AGI. The remaining 5.5% of AGI’s shares were issued to a Litigation\n                    Trust established pursuant to the Reorganisation Plan. The material provisions\n                    of the Reorganisation Plan relating to the Litigation Trustee are as\n                    follows: 1.Creation of the Litigation Trust On the Effective Date, AGI shall create the Litigation Trust\n                        for the benefit of holders of Class 3 Allowed Claims pursuant to the\n                        Plan, and the Litigation Trust Agreement shall be executed by the parties to\n                        the Litigation Trust Agreement. The Litigation Trust will be funded\n                        initially by an unused portion of the DIP Loan, but in no event less than\n                        $75,000. The Litigation Trust shall be a creditors’ Litigation Trust\n                        for all purposes, including Treasury Regulations Section 301.7701-4(d).\n                        The Litigation Trust will be organized for the purpose of investigating,\n                        prosecuting, collecting and distributing any proceeds from the Assigned\n                        Litigation of AGI and its Estate with no other objective to continue or\n                        engage in the conduct of a trade or business. As more fully set forth below,\n                        and except as set forth below, on the Effective Date, AGI shall be deemed to\n                        have transferred all of AGI’s rights to prosecute the Assigned\n                        Litigation to the Litigation Trust to prosecute and collect the proceeds\n                        thereof for the benefit of Creditors of AGI. The Litigation Trust shall\n                        receive and distribute the payments on the Cash Flow Note received by it and\n                        the recoveries on the claims, rights and causes of action of AGI and its\n                        Estate in accordance with the Plan and the Litigation Trust Agreement as\n                        promptly as is reasonably practicable, in an expeditious but orderly manner.\n                        The Litigation Trust is not a successor of AGI for purposes of incurring its\n                        liabilities. To the extent there are any inconsistencies between the Plan\n                        and the Litigation Trust Agreement, the terms of the Plan shall\n                        prevail. 2.Appointment of the Litigation\n                                Trustee. The Litigation Trustee of the Litigation Trust shall be A. John A.\n                        Bryan, Jr., the CRO of the Debtor. The Litigation Trustee shall\n                        administer the Litigation Trust pursuant to the Plan and the Litigation\n                        Trust Agreement, and in accordance with guidelines set forth by the Ninth\n                        Circuit Bankruptcy Appellate Panel inIn re Consolidated\n                            Pioneer Mortgage Entities, 248 B.R. 368 (9th Cir.\n                        B.A.P. 2000). The Litigation Trustee shall act in accordance with the Plan\n                        and the Litigation Trust Agreement. The Litigation Trustee shall perform all\n                        of the obligations of the Litigation Trustee under the Plan and the\n                        Litigation Trust Agreement. The Litigation Trustee shall serve for the\n                        duration of the Litigation Trust, subject to earlier death, resignation,\n                        incapacity or removal as provided in the Litigation Trust Agreement. The\n                        Litigation Trustee shall serve without any bond. The Litigation Trustee\n                        shall receive a flat fee equal to 3% of all recoveries received by the\n                        Litigation Trust. The Litigation Trustee shall act in accordance with the\n                        Plan and the Litigation Trust Agreement. 37     With regard to the purpose of a\n                    Chapter 11 reorganisation, there was evidence adduced before the Judge in\n                    the form of an opinion from AGI’s US attorneys which stated that (see the\n                    Judgment at [38]): Chapter 11 in the United States is a reorganization and restructuring\n                        proceeding, while Chapter 7 is a liquidation proceedings and more like\n                        the British concept of “administration”.The United States is somewhat unique because Chapter 11 is more\n                            like a financing transaction, rather than a bankruptcy, and this concept\n                            does not really exist elsewhere in the world …[emphasis added]",
        "The triggering events in cll 7(i)(c) and 7(ii)(b)": "38     The Substantive Issue concerns the meaning of\n                    two of the triggering events in cll 7(i)(c) and 7(ii)(b) of the Escrow\n                    Agreement and whether AGI’s Chapter 11 constitutes either of them. As\n                    both clauses are substantially the same, we only need to discuss cl 7(i)(c)\n                    which provides as follows: 7)Release of Documents to Tridex i)    PEPL shall, without consultation or approval from\n                            Astrata, release to Tridex all envelopes marked ‘Comprehensive\n                            Source Code’ together with the index which relates to the\n                            C[omprehensive] S[ource] C[ode] ... ... c)    on Tridex’s production of conclusive proof\n                            (including but not limited to the production of authenticated copies of\n                            publicly filed documents confirming the appointment of the receiver,\n                            administrator or similar officer as referred to in this paragraph), that\n                            [Astrata] and/or [AGI] (but not any of its subsidiaries or associates\n                            other than Astrata (Asia Pacific) Pte Ltd or [Astrata]) (hereinafter\n                            singularly or collectively referred to as “ASAG”) has\n                            ceased or threatened to cease to carry on its business or has had a\n                            receiver, administrator or similar officer appointed over all or any\n                            part of its assets or undertaking or has made any arrangement for the\n                            benefit of its creditors or gone into liquidation save for the purpose\n                            of a genuine amalgamation or reconstruction. 39     The issues we have to decide in this appeal\n                    are as follows: (a)     whether “a receiver,\n                        administrator or similar officer has been appointed over all or any part of\n                        AGI’s assets or undertaking”; (b)     whether AGI “has made any arrangement for\n                        the benefit of its creditors”; (c)     whether the Saving Clause (“save for the purpose\n                        of a genuine amalgamation or reconstruction”) applies to the making\n                        of “any arrangement for the benefit of its\n                    creditors”; (d)     whether AGI’s Chapter 11 is a “reconstruction” for\n                        the purposes of the Saving Clause. 40     Before we examine these issues, it is\n                    desirable that we consider first the general approach adopted by the Judge in\n                    interpreting the purpose and scope of the triggering events in cl 7(i)(c).\n                    In this regard, the Judge held (at [26]–[32] of the\n                    Judgment) as follows: [26]  ...\n                            Astrata’s proposed construction ignores the business objective of\n                            this commonly used standard form precedent. InBoilerplate: Practical Clauses(Richard Christou gen ed)\n                            (Sweet & Maxwell, 5th Ed, 2009), the editors provide an example\n                            of a precedent clause which deals with the disappearance of a party\n                            through dissolution, death or insolvency. The precedent clause reads as\n                            follows: The Contract may be terminated with immediate effect by\n                            either party giving notice of termination to the other party (the\n                            “Defaulting Party”): (i) if the Defaulting Party (being a company) shall pass a\n                                resolution for winding-up (otherwise than for the purposes of a\n                                solvent amalgamation or reconstruction where the resulting entity is\n                                at least as credit-worthy as the Defaulting Party and assumes all of\n                                the obligations of the Defaulting Party under the Contract) or a\n                                court shall make an order to that effect … [27]  Indeed, the\n                            editors explain the nature and effect of this precedent clause as\n                            follows: The following clause deals with the disappearance of a party through\n                            dissolution, death or insolvency. The exception relating to a solvent\n                            amalgamation or reconstruction should be noted since its absence would\n                            forbid perfectly harmless reorganizations, for instance, of the\n                            structure of a group of companies. The phrase “amalgamation or reconstruction” is commonly used\n                        as a carve-out to liquidations for this purpose. [28]  The business purpose of provisions such as\n                            cl 7(i)(c) of the Escrow Agreement is to secure the Escrow items\n                            for the purchaser, upon the occurrence to the supplier and specified\n                            entities, of clearly defined and understood commercial triggering\n                            events. It is in these clearly defined trigger events that the purchaser\n                            seeks to preserve its contractual and proprietary interests in the\n                            Escrow property against cessation of business, asset or undertaking\n                            seizures, creditor arrangements, or liquidation of the specified\n                            entities. ... ... [31]  Astrata concedes that AGI’s Chapter 11\n                            was not an amalgamation but submits that it is a\n                            “reconstruction” within the meaning of the Escrow\n                            Agreement. It should be stated at the outset that the issue before me is\n                            not whether AGI’s Chapter 11 constitutes a\n                            “reconstruction” under United States law (federal or\n                            state). The meaning of “reconstruction” in a contract\n                            expressed to be governed by Singapore law falls to be construed by\n                            Singapore law. In this Escrow Agreement, cl 7(i)(c) refers to\n                            reconstruction to apply to specified entities, several of which are\n                            Singapore incorporated companies and one is AGI incorporated in the\n                            state of Nevada. To construe this clause to mean different things under\n                            the law of each entity’s law of the place of incorporation and not\n                            the governing law of the Escrow Agreement would not be warranted under\n                            the terms of the Escrow Agreement itself. As escrow agreements deal with\n                            contingencies and precise events, business efficacy, as to the meaning\n                            of reconstruction in this Escrow Agreement, requires that this term be\n                            construed in the same way under the expressly chosen governing law, with\n                            respect to all the parties to this agreement regardless of their place\n                            of incorporation. [32]  What then is the meaning to be accorded to\n                            reconstruction in cl 7(i)(c) of the Escrow Agreement under\n                            Singapore law? Whatever else the term may mean in the United States, the\n                            meaning of “reconstruction” in a Singapore law governed\n                            document making provision for financial distress is shaped by our\n                            English common law foundations. ... 41     Our approach is as follows. While we can agree\n                    with all of what the Judge has said in the passages above – such as the\n                    business objectives of these boilerplate clauses, and that since the Escrow\n                    Agreement is governed by Singapore law, it has to be construed in accordance\n                    with Singapore law, that commonly used clauses should be given their commonly\n                    understood meanings, and that the same words used in an agreement should\n                    ordinarily be given the same meaning – the flaw in the Judge’s\n                    interpretational approach is that, as we shall see, he has conflated the meaning\n                    of words in the Escrow Agreement with their meaning under Singapore law,\n                    specifically in the context of company law. Thus, he held that the word\n                    “reconstruction” had the meaning which it bears when used in the\n                    reconstruction of a company under the Companies Act (see[63]below). 42     In our view, this approach to contextual\n                    interpretation is incorrect because the word “reconstruction” in\n                    cl 7(i)(c) of the Escrow Agreement is not necessarily used in the context\n                    of a company reconstruction under the Singapore Companies Act, but in the very\n                    different context of a commercial agreement between a US corporate group (which\n                    included a Singapore subsidiary, Astrata) and Tridex (a Singapore company). The\n                    Judge himself recognised that the word “reconstruction”, and also\n                    the word “amalgamation” are not terms of art (see below at[64]). These words must therefore mean\n                    what the parties intended them to mean. Although the Escrow Agreement is\n                    governed by Singapore law, that law does not dictate that the words used in the\n                    Escrow Agreement must bear the meanings they have in a Singapore company law\n                    context but rather in a business context. Under Singapore law, the basic\n                    principle of documentary interpretation is that words used by the parties in an\n                    agreement mean what the parties intend them to mean. The parties here may or may\n                    not have had the Singapore company law meanings in mind; regardless, even if\n                    they did have Singapore company law meanings in mind, it does not necessarily\n                    follow that these meanings are apt to cover any corporate restructuring of AGI\n                    under US law. 43     In the present case, it is all the more\n                    necessary to consider what the parties had in mind when they drafted the\n                    triggering events in cl 7(i)(c) to apply to a US corporation which can only\n                    effect a corporate restructuring or reconstruction in accordance with US law and\n                    not Singapore law. A reconstruction of a company under Singapore law may not\n                    find an exact counterpart in US law andvice\n                    versa, and similarly, with the phrase “any arrangement for the\n                    benefit of its creditors”. More generally, it is not clear to us that the\n                    purpose of cl 7(i)(c) (which is, as the Judge found, to protect\n                    Tridex’s vested rights in the Escrow Property (for whose development they\n                    had paid upfront to Astrata) against the effects of corporate insolvency events\n                    affecting AGI) is adequately served by superimposing Singapore company law\n                    concepts on a US company to which such concepts may be alien, andvice versa. It seems to us that whoever drafted\n                    cl 7(i)(c) of the Escrow Agreement had copied the boilerplate clauses\n                    applicable only to business transactions between Singapore and/or UK\n                    incorporated companies without much thought as to whether the triggering events\n                    countenanced therein would have been appropriate for AGI and non-Singapore\n                    corporate bodies. 44     For these reasons, we think that in construing\n                    the meaning of the triggering events in cl 7(i)(c), it is preferable to\n                    give more weight to the underlying commercial purpose of cl 7(i)(c),ie, to protect Tridex’s vested interest\n                    in the Escrow Property in the event that Astrata and/or AGI finds\n                    itself/themselves unable to carry on its/their business, thereby jeopardising\n                    Tridex’s rights to the Escrow Property. This is provided, of course, that\n                    giving effect to the parties’ purpose is permitted by the words used in\n                    cl 7(i)(c). In this connection, we repeat, and would elaborate below, that\n                    some of the terms under consideration are not terms of art in the context of\n                    Singapore and English company law. 45     We now turn to the specific questions set out\n                    at[39]above.",
        "Issue (a): Whether a receiver, administrator or similar officer has\n                been appointed over all or any part of AGI’s assets or undertaking": "46     This issue was argued before the Judge but he\n                    did not rule on it. Tridex argues that the appointment of the Litigation Trustee\n                    pursuant to the Reorganisation Plan is equivalent or similar to the appointment\n                    of a receiver under Singapore law, and the relevant triggering event has\n                    occurred. In support of this argument, counsel referred to the commentary inLaw and Practice of Corporate Insolvency(Andrew Chan Chee Yin gen ed) (LexisNexis, 2005) Ch V, paras 853–900\n                    (pp V-109–V-110). 47     We do not agree that the commentary referred\n                    to is relevant to Tridex’s case as it is concerned with the functions of a\n                    receiver and manager appointed by a debenture holder, and not a receiver\n                    appointed by a court. Such a receiver and manager is a different creature from a\n                    receiver appointed by a court under O 30 of the Rules of Court\n                    (Cap 322, R 5, 2006 Rev Ed). A court-appointed receiver is merely\n                    a passive and neutral custodian of the property entrusted to him, pending the\n                    resolution of the dispute between the claimants to the property. In contrast, a\n                    receiver and manager appointed under a debenture has many more functions and\n                    duties. He has a duty to bring in the assets subject to the debenture under\n                    which he was appointed, and to realise those assets for the benefit of the\n                    debenture holder. If those assets include choses-in-action he can bring actions\n                    to enforce them. 48     The Litigation Trustee certainly bears no\n                    resemblance to a court-appointed receiver, although there is some similarity\n                    between that office and that of a receiver and manager. A litigation trustee\n                    under a Chapter 11 reorganisation is under a duty to enforce and pursue the\n                    company’s rights and interests for the benefit of creditors. However, such\n                    a comparison fails to consider the different context in which each officer is\n                    appointed. In Martin R Pollner & Brian R Socolow, “The\n                    Litigation Trustee: A Major New Tool for Creditors’ Committees”\n                    American Bankruptcy Institute Journal (March 2001) (20-2 ABIJ\n                        14)[note: 2], the authors\n                    state the following: Creditors’ committees are increasingly turning to litigation\n                        trustees to handle complex litigation in chapter 11 proceedings.\n                        Although not expressly authorized in the Bankruptcy Code, litigation\n                        trustees have been appointed in several recent cases, includingIn re Pintlar, 175 B.R. 379 (Bankr. D.\n                        Idaho 1994), andIn re Rincon Island Ltd.\n                            Partnership(Bankr. C.D. Cal. 2000). The position of a litigation trustee is a relatively new tool for\n                        creditors’ committees (and shareholders) when the debtor’s\n                        assets include potential claims against third parties, such as the failed\n                        company’s former officers and directors. ... ... A litigation trustee is usually appointed by the bankruptcy court upon the\n                        recommendation of one or more creditors’ committees after a\n                        reorganization plan has been confirmed by the court. As part of the\n                        reorganization plan, a trust is formed, and assets of the debtor or the\n                        bankruptcy estate (such as all claims, rights or causes of action, as well\n                        as money to fund the litigation trustee’s efforts) are transferred to\n                        the trust. The litigation trustee's mandate is to pursue various claims,\n                        through litigation or settlement, against third parties on behalf of the\n                        trust and its beneficiaries, and to distribute, pursuant to the plan, any\n                        net proceeds of such litigation or settlement. Usually, a post-confirmation\n                        creditors’ committee will work with the trustee on strategic and\n                        settlement issues. 49     As can be seen from the above commentary, the\n                    litigation trust is established as part of a Chapter 11 reorganisation, the\n                    primary purpose of which is to sustain the company as a going concern –\n                    AGI’s US attorneys described it as “more like a financing\n                    transaction, rather than a bankruptcy” (see above at[37])[note: 3].\n                    In contrast, the receiver appointed by the court or a receiver and manager\n                    appointed by a debenture holder, in performing his respective functions is not\n                    concerned with the continued viability of the company as a going concern. In the\n                    light of the purpose of cl 7(i)(c), which is to protect Tridex’s\n                    interest in the continuing functioning of Astrata and/or AGI, this distinction\n                    is critical. Functionally, a litigation trustee in a Chapter 11\n                    reorganisation is not analogous to a receiver contemplated by cl 7(i)(c).\n                    Nor is the expression “receiver” apt to refer to a litigation\n                    trustee in the US Bankruptcy Code. Accordingly, we would hold that the\n                    Litigation Trustee appointed pursuant to the terms of the Reorganisation Plan is\n                    not a receiver contemplated by cl 7(i)(c) of the Escrow\n                Agreement.",
        "Issue (b): Whether AGI has made any arrangement for the benefit\n                of its creditors": "50     Both here and below, the parties and the Judge\n                    have proceeded on the assumption that AGI’s Chapter 11wasan arrangement for the benefit of its creditors, and\n                    also that AGIhadmade such an arrangement by\n                    undergoing the Chapter 11 reorganisation. We had our doubts about the\n                    correctness of these two assumptions. After we reserved judgment in this appeal,\n                    we invited further submissions on these two issues in the form of a composite\n                    question as expressed in issue (b) above. However, we did not find the\n                    submissions helpful. Having raised the composite question, we will now address\n                    it. 51     Is AGI’s Chapter 11 an\n                    “arrangement” for the benefit of “creditors”? The\n                    word “arrangement” is not defined in the Escrow Agreement or in\n                    the Companies Act. A different point arises with the word\n                    “creditors”. Does it mean all the creditors of AGI or only some of\n                    them, and if so, how many of them? Suppose AGI had made an arrangement for the\n                    benefit of only a minority of secured creditors – would this be an\n                    arrangement for the benefit of creditors as contemplated by cl 7(i)(c)?\n                    Many different permutations can be posited. None of these interpretative\n                    problems have been raised by Astrata, and yet they must be material to whether\n                    or not the relevant triggering event has occurred. 52     In our view, the word\n                    “arrangement” must take its meaning from the context of the Escrow\n                    Agreement and its commercial objective, as recognised by the Judge. In the case\n                    ofIn re British Basic Slag Ltd’s\n                        Application[1963] 1 WLR 727 (“British Basic Slag”), the court was concerned to\n                    interpret the meaning of the word “arrangement” in the UK\n                    Restrictive Practices Act. Wilmer LJ said at 739–740: I think it is highly significant that Parliament did not see fit to\n                        include any definition of “arrangement.” I infer from this\n                        that it was intended that the word should be construed in its ordinary or\n                        popular sense. Though it may not be easy to put into words, everybody knows\n                        what is meant by an arrangement between two or more parties. If the\n                        arrangement is intended to be enforceable by legal proceedings, as in the\n                        case where it is made for good consideration, it may no doubt properly be\n                        described as an agreement. ... For when each of two or more parties\n                        intentionally arouses in the others an expectation that he will act in a\n                        certain way, it seems to me that he incurs at least a moral obligation to do\n                        so. An arrangement as so defined is therefore something “whereby the\n                        parties to it accept mutual rights and obligations.” At 746–747, Diplock LJ said: “Arrangement” is not a term of art; and in section 6(3)\n                        of the [Restrictive Trade Practices] Act of 1956 I agree with my Lords that\n                        it bears the meaning that an ordinary educated man would ascribe to it. It\n                        involves a meeting of minds because under section 6(1) it has to be an\n                        arrangement “between two or more persons,” and since it must\n                        be an arrangement “under which restrictions are accepted by two or\n                        more parties” it involves mutuality in that each party, assuming he\n                        is a reasonable and conscientious man, would regard himself as being in some\n                        degree under a duty, whether moral or legal, to conduct himself in a\n                        particular way or not to conduct himself in a particular way as the case may\n                        be, at any rate so long as the other party or parties conducted themselves\n                        in the way contemplated by the arrangement. 53     InIn re N.F.U. Development\n                        Trust Ltd[1972] 1 WLR 1548 (“Re\n                        NFU”), the company petitioned the court to sanction a\n                    scheme of arrangement under s 206(2) of the Companies Act 1948 (“the\n                    UK Companies Act 1948”) whereby all existing members of the company\n                    except the N.F.U. Development Co. would cease to be members. Six persons, five\n                    of whom were already directors, were to be the sole individual members. All\n                    other existing members were to be deprived of their membership and forfeited all\n                    their rights, and on a winding up the surplus assets were to be distributed to\n                    another body or company to be determined by the company (and in default of such\n                    determination, to charity). The object of the scheme was to reduce\n                    administrative expenses. At a meeting directed by the court in May 1972, 85% of\n                    the members voted in favour of the scheme. On a petition seeking the court's\n                    approval, the scheme was opposed by five persons. It was held that although a\n                    majority of three-fourths in value of members in favour of the scheme as\n                    required by s 206(2) of the UK Companies Act 1948 had been obtained,\n                    nevertheless the section dealt with a “compromise” or\n                    “arrangement” between a company and its members which implied\n                    accommodation on both sides and could not apply to the present scheme whereby\n                    members rights were totally surrendered without compensation. Accordingly, since\n                    the scheme was one which no member voting in the interests of members as a whole\n                    could reasonably approve, the petition would be dismissed. 54Re NFUis an\n                    English authority for the meaning of “arrangement” under\n                    s 206(2) of the UK Companies Act 1948 which corresponds to s 210 of\n                    our Companies Act. On that authority, an “arrangement” in which\n                    members are deprived of their rights without compensation is not an arrangement\n                    but a confiscation of their rights. There is no element of “give and\n                    take” in such an arrangement. 55     Consistent with our own approach that the\n                    meaning of the words in cl 7(i)(c) should be interpreted to mean what the\n                    parties intend,British Basic Slagis helpful\n                    because it adopted the popular meaning of the word “arrangement”\n                    which requires a meeting of minds as to their mutual rights and obligations\n                    (whether the arrangement is intended to be enforceable or not).Re NFUis, however, not as helpful as the decision was\n                    concerned with the interpretation of “arrangement” in the context\n                    of a “scheme of arrangement” under the UK Companies Act\n                    1948. 56     In our view, the essence of an arrangement\n                    with creditors under cl 7(i)(c) must involve a meeting of minds of the\n                    parties to the arrangement. This is reinforced by the actual words of the\n                    condition – that AGI “has made any arrangement with ...”.\n                    AGI cannot make an arrangement with its creditors if they do not accept the\n                    arrangement or agree with it. On the facts of this case, AGI had, quite simply,notmade an arrangement with its creditors. It\n                    tried to do so when it proposed the Out-of-Court Plan, but the proposal was\n                    rejected by a small minority of its creditors,viz, Jed Frost and Vision. Because of this, AGI had to apply to the\n                    US Bankruptcy Court to sanction a Chapter 11 reorganisation under a\n                    modified plan. The Reorganisation Plan, first mentioned at[6]earlier, providedinter\n                        aliathat creditors whose claims were scheduled as disputed,\n                    contingent or liquidated and who did not file a proof of claim timeously were\n                    not to be treated as creditors for the purposes of voting or distribution. By\n                    contrasting these two events, it is apparent that (a) AGI hadfailed to makean arrangement with its creditors through\n                    the Out-of-Court Plan, and (b) AGI’s Chapter 11 was neithermade by AGI, norwith its\n                        creditors– it was sanctioned by the US Bankruptcy Court\n                    and imposed on all creditors. In our view, AGI did not make an arrangement for\n                    the benefit of its creditors as contemplated by cl 7(i)(c). 57     In the result, it would not be necessary for\n                    us to address issues (c) and (d), but since they were fully argued before\n                    us, we shall discuss them as well.",
        "Issue (c): Whether the Saving Clause applies to “any\n                arrangement for the benefit of its creditors”": "58     The Judge answered this question in the\n                    negative. He rejected Astrata’s construction that cl 7(i)(c) applies\n                    to only three categories of triggering events (see the Judgment at [23]) as follows: [Where AGI:] (i)has ceased or threatened to cease to carry on its\n                            business, or (ii)has had a receiver, administrator or similar\n                            officer appointed over all or any part of its assets or undertaking,\n                            or (iii)has made any arrangement for the benefit of its\n                            creditors, or gone into liquidation save for the purpose of a genuine\n                            amalgamation or reconstruction. The Judge held (at [25] of\n                    the Judgment) that there are four categories of triggering events, as\n                    follows: [AGI](i)has ceased or threatened to\n                        cease to carry on its businessor\n                        (ii)has had a receiver, administrator or similar officer\n                        appointed over all or any part of its assets or undertakingor (iii)has made any arrangement for the\n                        benefit of its creditorsor (iv)gone\n                        into liquidation save for the purpose of a genuine amalgamation or\n                        reconstruction. [emphasis in bold in original] The dispute was on where to put the punctuation. 59     It is possible to argue that the Judge’s\n                    interpretation as set out in the passage above does not appear to accord with\n                    its grammatical structure, because the word “has” is missing from\n                    the fourth category. Without that word, Astrata’s construction of that\n                    clause as having three categories is not unreasonable. However, we agree with\n                    the result of the Judge’s construction, not for the reason given by him,\n                    but because that was the intention of the parties as evinced in the formulation\n                    in PoA #7 and also cl 7(ii)(b) of the Escrow Agreement. The relevant clause\n                    in PoA #7 listed four categories, providing as follows: If [Astrata] and/or [AGI](but not any of its subsidiaries or associates\n                        other than Astrata (Asia Pacific) Pte Ltd or [Astrata]) (hereinafter\n                        singularly or collectively referred to as “ASAG”) ceases or\n                        threatens to cease to carry on its business; if a receiver, administrator or\n                        similar officer is appointed over all or any part of the assets or\n                        undertaking ofASAG; ifASAGmakes any arrangement for the benefit of its creditors\n                        orASAGgoes into liquidation save for the\n                        purpose of a genuine amalgamation or reconstruction. [emphasis in bold\n                        added] 60     In our view, the repetition of the word\n                    “ASAG” with reference to its liquidation has the effect of\n                    creating a fourth triggering event that includes and is qualified by the Saving\n                    Clause. This delineation is repeated in cl 7(ii)(b) which provides for the\n                    release of the Comprehensive Engineering Diagrams in similar terms: [O]n Tridex’s production of conclusive proof (including but not\n                        limited to the production of authenticated copies of publicly filed\n                        documents confirming the appointment of the receiver, administrator or\n                        similar officer as referred to in this paragraph), that [Astrata] and/or\n                        [AGI] (but not any of its subsidiaries or associates other than Astrata\n                        (Asia Pacific) Pte Ltd or [Astrata]) (hereinafter singularly or collectively\n                        referred to as “ASAG”) has ceased or threatened to cease to\n                        carry on its business; or has had a receiver, administrator or similar\n                        officer appointed over all or any part of its assets or undertaking or has\n                        made any arrangement for the benefit of its creditors orhasgone into liquidation save for the purpose of a genuine\n                        amalgamation or reconstruction. [emphasis in bold added] 61     At [24] of the Judgment, the Judge rejected Astrata’s\n                    submissions, and said, as follows: 24    In support of its proposed construction, Astrata\n                            first draws on the quite separate Supply Agreement in which semicolons\n                            have been inserted which do not exist in the parallel clause in the\n                            Escrow Agreement. It submits that the Supply Agreement discloses\n                            Astrata’s and Tridex’s agreement as to the trigger events\n                            which must dictate the construction of a parallel but not identically\n                            worded clause in the Escrow Agreement between different parties.\n                            However, I am only concerned to construe cl 7(i)(c) of the Escrow\n                            Agreement and I find no merit in this submission that the construction\n                            of a clause in one agreement between different parties is to be\n                            determined by a similar but not identical clause entered earlier between\n                            some but not all the parties. In any event, it is not my task to\n                            construe the Supply Agreement and POA#7. 62     We do not agree with this approach in a case,\n                    as here, where a clause in an agreement is ambiguous and where two clauses\n                    applying to the same subject matter are arguably inconsistent. In such a case,\n                    the court is entitled to and should examine the history and source of these\n                    clauses to determine the intention of the parties. In the present case, the\n                    triggering clauses originated from PoA #7 which required them to be\n                    incorporated into the Escrow Agreement, with the specific instruction that the\n                    Escrow Agreement must give effect,inter alia, to\n                    those clauses.",
        "Issue (d) - Whether AGI’s Chapter 11 is a\n                reconstruction": "63     The Judge held that AGI’s\n                    Chapter 11 was not a reconstruction as contemplated by cl 7(i)(c)\n                    because under Singapore law, a reconstruction must not result in the\n                    shareholding of the reconstructed company being substantially different from\n                    that of the original company. It may be recalled (see[36]above) that, under the Reorganisation Plan, 94.5% of\n                    AGI’s equity is now held by Fame Trading Ltd, a new shareholder who\n                    injected US$8.5 million into AGI, with the remaining 5.5% held by the Litigation\n                    Trust. In so holding, the Judge followed the English authorities on the meaning\n                    of “reconstruction” under English company law. He relied on the\n                    following passage in Buckley J’s judgment inIn re\n                        South African Supply and Cold Storage Company,Wild v Same Company[1904] 2 Ch 268 (“South African Supply”) at 286: ... What does “reconstruction” mean? To my mind it means\n                        this. An undertaking of some definite kind is being carried on, and the\n                        conclusion is arrived at that it is not desirable to kill that undertaking,\n                        but that it is desirable to preserve it in some form, and to do so, not by\n                        selling it to an outsider who shall carry it on–that would be a mere\n                        sale–but in some altered form to continue the undertaking in such a\n                        manner as that the persons now carrying it on will substantially continue to\n                        carry it on. It involves, I think, that substantially the same business\n                        shall be carried on and substantially the same persons shall carry it on.\n                        But it does not involve that all the assets shall pass to the new company or\n                        resuscitated company, or that all the shareholders of the old company shall\n                        be shareholders in the new company or resuscitated company. Substantially\n                        the business and the persons interested must be the same. Does it make any\n                        difference that the new company or resuscitated company does or does not\n                        take over the liabilities? I think not. I think it is none the less a\n                        reconstruction because from the assets taken over some part is excepted\n                        provided that substantially the business is taken, and it is immaterial\n                        whether the liabilities are taken over by the new or resuscitated company or\n                        are provided for by excepting from the scheme of reconstruction a sufficient\n                        amount to answer them. It is not, therefore, vital that either the whole\n                        assets should be taken over or that the liabilities should be taken over.\n                        You have to see whether substantially the same persons carry on the same\n                        business; and if they do, that, I conceive, is a reconstruction. 64     It will be noticed that Buckley J\n                    acknowledged that “reconstruction”, by itself, is not a term of\n                    art (at 281–282): Neither of these words, “reconstruction” and\n                        “amalgamation,” has any definitelegalmeaning. Each is a commercial and not a legal term,\n                        and, even as a commercial term, bears no exact definite meaning. In each\n                        case one has to decide whether the transaction is such as that, in the\n                        meaning of commercial men, it is one which is comprehended in the term\n                        “reconstruction” or “amalgamation.” 65     We have earlier stated that the company law\n                    meaning of “reconstruction” (assuming it is the same as its\n                    meaning under English and Australian case law) may not be the same as its\n                    popular meaning or the meaning intended in cl 7(i)(c) in its application to\n                    a US company (if it is capable of being reorganised or\n                    “reconstructed” under the US Bankruptcy Code in a different way).\n                    It is not necessary for us to decide in this appeal (a) whether the meaning\n                    of “reconstruction” given by English or Australian case law (see,\n                    for example,In re Mytravel Group plc[2005]\n                    1 WLR 2365 andRe Opes Prime Stockbrocking Ltd (recs and\n                        mgrs apptd) (in liq) and ors[2009] 258 ALR 362) should be\n                    followed by our courts; (b) how substantial the corporate changes should be\n                    before a reorganisation ceases to be a reconstruction; or (c) whether the\n                    meaning of “reconstruction” intended by the parties is the same as\n                    the meaning given in the case law. 66     The English and Australian cases are not\n                    necessarily determinative of the meaning of the word\n                    “reconstruction” under Singapore law. At least, before the\n                    decision of the Judge in the present case, there has been no local decision on\n                    the point. The problem with the English position – that “the\n                    essential character of corporate reconstruction is that substantially the same\n                    business is carried on and substantially the same persons continue to carry it\n                    on” (per Millett J citingSouth African\n                        SupplyinIn re Courage Group’s Pension\n                        Schemes Ryan and Others v Imperial Brewing & Leisure Ltd. And\n                        Others[1987] 1 WLR 495 at 509) – is that a company\n                    which has lost all its capital and which needs an injection of new capital from\n                    new investors can never be reconstructed unless the existing shareholders whose\n                    shares are worthless shares have to be given new (funded) shares to enable them\n                    to retain a substantial shareholding in the reconstructed company. For now, it\n                    is only necessary to observe that the Saving Clause in cl 7(i)(c) is not\n                    intended to apply to a company undergoing a Chapter 11 reorganisation as\n                    that clause is premised on a company being liquidated. A Chapter 11\n                    reorganisation does not involve the liquidation of the corporation that is being\n                    reorganised or reconstructed. Of course, if the Saving Clause were applicable to\n                    Astrata or AGI making any arrangement for the benefit of its creditors, then it\n                    would not be inconceivable that AGI’s Chapter 11 might well have been\n                    contemplated by the parties as a form of reconstruction.",
        "Waiver": "67     In view of our conclusions above, it is not\n                    necessary for us to decide Astrata’s argument that Tridex has by its\n                    conduct waived its right to invoke the triggering events under cll 7(i)(c)\n                    and 7(ii)(b) of the Escrow Agreement.",
        "Summary of conclusions": "68     In respect of the Jurisdictional Issue, we\n                    hold that the parties have submitted to the jurisdiction of the Singapore court\n                    with respect to the Bilateral Dispute by reason of the non-exclusive\n                    jurisdiction clause in favour of Singapore. 69     In respect of the Substantive Issue, we hold\n                    that Tridex is not entitled to delivery of the Escrow Property as neither of the\n                    two relevant triggering events in cll 7(i)(c) and 7(ii)(b) of the Escrow\n                    Agreement it has relied on has occurred. We find that : (a)     the Litigation Trustee is not a\n                        “receiver” or “similar officer appointed over all or\n                        any part of its assets or undertaking” as contemplated by\n                        cll 7(i)(c) and 7(ii)(b) of the Escrow Agreement; (b)     AGI’s Chapter 11 is not an\n                        “arrangement for the benefit of its creditors”, nor has AGI\n                        “made any arrangement with its creditors” as contemplated by\n                        cll 7(i)(c) and 7(ii)(b) of the Escrow Agreement.",
        "Disposition": "70     For the above reasons, we (a)     grant Astrata’s application\n                        for leave to appeal in Originating Summons No 1082 of 2010 and declare\n                        that Tridex is not entitled to delivery of the Escrow Property;\n                    and (b)     dismiss Astrata’s appeals in Civil Appeal No 158 of 2010 and\n                        Civil Appeal No 159 of 2010. Astrata and Tridex\n                    shall bear their own costs both here and below. PEPL shall be paid its costs\n                    here and below on an indemnity basis to be borne equally by Astrata and Tridex.\n                    The usual consequential orders shall apply.  [note: 1]Appellant’s Case at paras 39, 41,\n                                44 and 47. [note: 2]See\n                                http://journal.abi.org/content/litigation-trustee-major-new-tool-creditors-committees\n                                accessed on 18 April 2011. [note: 3]Appellant’s Core Bundle Vol 2 Part G at p 1587 (letter dated\n                                20 August 2009 from AGI’s attorneys to Anthony J Harrison,\n                                Astrata’s Chief Executive Officer)."
    }
}