{
    "case_title": "Lim Mey Lee Susan\n      v\n      Singapore Medical Council",
    "ncitation": "[2011] SGCA 66",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This is an appeal against the decision of the\n                    High Court Judge (“the Judge”) inLim Mey Lee\n                        Susan v Singapore Medical Council[2011] 4 SLR 156\n                    (“the HC Judgment”) dismissing the application by the appellant,\n                    Dr Susan Lim Mey Lee (“the Appellant”), in Originating\n                    Summons No 1252 of 2010 (“OS 1252/2010”) for leave to\n                    apply for (inter alia): (a)     a quashing order to quash the\n                        decision of the respondent, the Singapore Medical Council (“the\n                        SMC”), appointing a second Disciplinary Committee (“the Second\n                        DC”) to hear 94 disciplinary charges against her arising out of a\n                        complaint made against her (“the Quashing Order”);\n                    and (b)     a prohibiting\n                        order to prohibit the SMC from taking any steps to bring further\n                        disciplinary proceedings with respect to the aforesaid disciplinary charges\n                        (“the Prohibiting Order”).",
        "Background to the present appeal": "2       The material facts, as found by the Judge, are\n                    as follows. On 18 July 2007, officials from the Ministry of Health, Brunei\n                    (“MOHB”) met with Prof Kandiah Satkunanantham\n                    (“Prof Satku”), the Director of Medical Services (“the\n                    DMS”) at that time. During the meeting, Prof Satku was informed of\n                    the fees charged by the Appellant for the medical treatment of a member of the\n                    royal family of Brunei (“the Patient”), which fees MOHB found\n                    unacceptable. Prof Satku invited MOHB to write in officially to the\n                    Ministry of Health, Singapore (“MOHS”) for the matter to be looked\n                    into. Thereafter, the Permanent Secretary of MOHB (“PS-MOHB”) sent\n                    a letter dated 27 August 2007 to the Permanent Secretary of MOHS\n                    complaining of the “unacceptable and extremely high”[note: 1]fees charged by the\n                    Appellant for treating the Patient and “seek[ing] the intervention of\n                    [MOHS] in [the] matter”.[note: 2] 3       Upon receipt of PS-MOHB’s complaint\n                    (“the Complaint”), MOHS conducted a preliminary investigation into\n                    the Complaint. Prof Satku was also involved in that preliminary\n                    investigation. On the basis of its preliminary investigation, MOHS referred the\n                    Complaint to the chairman of the SMC’s Complaints Panel (“the\n                    CP”) on 3 December 2007 with respect to three issues: (a)     whether the invoices issued by the\n                        Appellant demonstrated a pattern of overcharging and/or improper\n                        billing; (b)     whether\n                        some charges imposed by the Appellant were for services which she did not\n                        provide; and (c)     whether there was any conflict of interest as the invoices in question were\n                        issued by various clinics managed by the Appellant. 4       The chairman of the CP in turn laid the\n                    Complaint before a Complaints Committee (“the CC”). The CC sent a\n                    letter dated 18 December 2007 to the Appellant inviting her to furnish a\n                    written explanation of the allegations against her. The Appellant, through her\n                    then solicitors, provided a letter of explanation dated 4 February 2008.\n                    After considering the Complaint and the Appellant’s explanation, the CC\n                    made an order on 17 November 2008 that a formal inquiry be held by a\n                    Disciplinary Committee (“the CC’s Order). Accordingly, the SMC\n                    appointed a Disciplinary Committee (“the First DC”) comprising the\n                    following persons: Assoc Prof Chin Jing Jih, Prof Ong Biauw Chi,\n                    Dr Wong Yue Sie and Ms Serene Wee. Mr Giam Chin Toon SC was\n                    appointed as the legal assessor. 5       Before the First DC, the SMC preferred 94\n                    disciplinary charges against the Appellant for overcharging the Patient as well\n                    as for making false representations in invoices rendered to the Patient. The\n                    first tranche of the hearing took place from 28 January 2010 to\n                    9 February 2010. At the close of the SMC’s case, counsel for the\n                    Appellant informed the First DC that he would be making a submission of no case\n                    to answer. Directions were then given for such submission to be filed by\n                    4 June 2010, with a reply from the SMC due on 16 July 2010. Counsel\n                    for the respective parties were given leave to make oral submissions at the\n                    reconvened hearing. 6       On 28 May 2010, a member of the first DC,viz, Dr Wong Yue Sie, died. As a result,\n                    a vacancy arose, which was filled by the appointment of Assoc Prof Anette\n                    Jacobsen (“A/Prof Jacobsen”) on 9 July 2010. At the\n                    reconvened hearing on 29 July 2010, the chairman of the First DC announced\n                    to the parties at the start of the hearing as follows:[note: 3] We have read the written submissions and I understand from my colleagues\n                        in the panel that we have no further questions to raise. Does either party\n                        have anything else to add or submit before we deliver our decision at this\n                        stage? This statement led the Appellant’s counsel to venture the view\n                    that the First DC might have prejudged the Appellant’s submission of no\n                    case to answer. The First DC nonetheless continued with the hearing. Eventually,\n                    the Appellant’s counsel made an application for the First DC to recuse\n                    itself on the ground that its chairman’s remarks showed that it had\n                    prejudged the Appellant’s submission of no case to answer. Counsel for the\n                    SMC, finding himself in a somewhat difficult position, informed the First DC\n                    that he would not object to the Appellant’s application, whereupon the\n                    First DC recused itself. 7       After the First DC recused itself, the SMC\n                    sought legal advice on how to proceed further with the matter. This led the SMC\n                    to revoke the appointment of the First DC and appoint the Second DC comprising\n                    the following members: Prof Tan Ser Kiat, Prof C Rajasoorya,\n                    Dr Abraham Kochitty and Assoc Prof Koh Ming Choo Pearlie.\n                    Mr Vinodh Coomaraswamy SC was appointed as the legal\n                assessor. 8       The revocation of the First DC’s\n                    appointment and the appointment of the Second DC were effectuated via two\n                    e-mails sent to all the members of the SMC (referred to hereafter as either the\n                    “SMC members” or a “SMC member”, as may be\n                    appropriate to the context), except for Dr Wilmot R Rasanayagam\n                    (“Dr Rasanayagam”), who received hard copies of those\n                    e-mails. The first e-mail was sent on 3 September 2010 by Serene Wong (the\n                    senior manager of the Professional Conduct and Professional Standards Division\n                    of the SMC) to seek the approval of the SMC members to revoke the appointment of\n                    the First DC. That e-mail (“the 3 September 2010 e-mail”)\n                    read as follows:[note: 4] Subject:Revoke the\n                            appointment of a Disciplinary Committee … Dear Council Members, 1.    We refer to the\n                            inquiry against [the\n                            Appellant]. 2.    At the hearing on\n                            29 Jul 2010, the [Appellant’s] Counsel made a procedural\n                            application for the Disciplinary Committee (DC) [ie, the First DC] to recuse itself. Details of this case\n                            can be givenonlyat the conclusion of\n                            the inquiry and until then, we seek your kind understanding and patience\n                            on this matter. 3.    As the result\n                            of the DC having recused itself, it is now necessary for the [SMC] to\n                            revoke the appointment of the current DC hearing this inquiry and\n                            appoint a new DC pursuant to Section 42(5) of the Medical\n                            Registration Act [(Cap 174, 2004 Rev Ed)], i.e. “The Medical Council may at any time revoke\n                                the appointment of any Disciplinary Committee or may remove any\n                                member of a Disciplinary Committee or fill any vacancy in a\n                                Disciplinary Committee.” 4.    The new DC will be appointed in due course and a\n                            separate email will be sent to you shortly. 5.    Council’s approval is sought on this\n                            administrative matter to revoke the current DC to allow [the] SMC to\n                            move forward on this matter. 6.    We will take it that members have no objections if\n                            we do not hear from you byTuesday, 7 September\n                                2010. … [underlining, emphasis in bold and emphasis in italics in original] 9       The second e-mail was sent on 13 September\n                    2010 to the same SMC members to seek their approval for the appointment of the\n                    Second DC. That e-mail (“the 13 September 2010 e-mail”)\n                        read:[note: 5] Subject:Proposed\n                            appointment of a Disciplinary Committee … Dear Council Members, 1.    I refer to my email\n                            below where a new Disciplinary Committee (DC) has to be appointed for\n                            the inquiry for [the\n                            Appellant]. 2.    The DC proposed to\n                            hear the case [is] as follows: Proposed Members for DC –[the\n                            Appellant]:– Prof Tan Ser Kiat (Chairman) Prof C Rajasoorya Dr Abraham Kochitty A/Prof Koh Ming Choo Pearlie (Layperson) Mr Vinodh Coomaraswamy SC (Legal Assessor) 3.    All proposed DC members have declared that they\n                            have no conflict of interests and are agreeable to the appointment. In\n                            the meantime, we would be grateful that members do not discuss or\n                            mention this case (despite of [sic] what\n                            has been reported in the papers) so that the DC inquiry is not\n                            compromised. 4.    Members’ approval is sought for the\n                            appointment of the above DC. We will assume that members have no\n                            objections if we do not hear from you by5pm,\n                                Tuesday, 14 Sep 2010. … [underlining and emphasis in bold in original] 10     On 16 September 2010, the SMC informed\n                    the Appellant’s solicitors of the appointment of the Second DC. On\n                    22 September 2010, the SMC’s solicitors informed the Appellant that\n                    the Second DC had been appointed in accordance with ss 41 and 42 of the\n                    Medical Registration Act (Cap 174, 2004 Rev Ed) (“the\n                    MRA”). 11     On 17 December 2010, the Appellant filed\n                    OS 1252/2010 for leave to apply for: (a)     the Quashing Order on the basis that\n                        the SMC’s decision to appoint the Second DC was (i) illegal under\n                        the MRA and (ii) tainted by actual or apparent bias on the part of the\n                        SMC; and (b)     the\n                        Prohibiting Order on the basis that it was unreasonable according to the\n                        well-established principles enunciated inAssociated\n                            Provincial Picture Houses, Limited v Wednesbury Corporation[1948] 1 KB 223 (“Wednesbury”) –ie, it was irrational, unfair, prejudicial and\n                        oppressive – for the SMC to appoint the Second DC to continue the\n                        disciplinary proceedings against the Appellant in respect of the 94\n                        disciplinary charges laid before the First DC. The\n                    Appellant also sought leave to apply for a declaration that the Medical\n                    Registration (Amendment) Regulations 2010 (S 528/2010) (“the\n                    S 528/2010 Amendment Regulations”) were null and void on the grounds\n                    that they were, in their entirety, contrary to natural justice.",
        "The Judge’s decision": "12     The Appellant advanced a large number of\n                    arguments in support of her application in OS 1252/2010. It is not\n                    necessary for us to set out those arguments in detail as they were addressed\n                    comprehensively by the Judge in the HC Judgment. The Judge’s rulings on\n                    the Appellant’s arguments may be summarised as follows: (a)     The SMC had the power under\n                        s 41(3) of the MRA to appoint the Second DC after revoking the\n                        appointment of the First DC under s 42(5) of the MRA (see [36] and [98]\n                        of the HC Judgment). (b)     The appointment of the Second DC complied with the requirement of\n                        immediacy under s 41(3) of the MRA as the relevant time frames for this\n                        purpose were 7 September 2010 (the date of the SMC’s decision to\n                        revoke the appointment of the First DC) and 14 September 2010 (the date\n                        of the SMC’s decision to appoint the Second DC) (see [37] and [40] of\n                        the HC Judgment). (c)     Even if time had begun to run from 17 November 2008 (the date of\n                        the CC’s Order), in view of the objects of the MRA, the unusual\n                        recusal of the First DC and the revocation of its appointment by the SMC as\n                        well as the absence of any evidence of substantial prejudice to the\n                        Appellant, the time requirement was directory (see [44] of the HC\n                        Judgment). (d)     The\n                        Appellant’s argument that the SMC should have referred the Complaint\n                        to a fresh Complaints Committee first before appointing a new Disciplinary\n                        Committee (viz, the Second DC) after the\n                        recusal of the First DC did not comport with the structure and objectives\n                        contemplated by the disciplinary process set out in the MRA. As there was\n                        already the CC’s Order on the record, no practical purpose would be\n                        served by sending the same complaint (viz, the\n                        Complaint) to another Complaints Committee (see [45] of the HC\n                        Judgment). (e)     As\n                        s 12(5) of the MRA expressly empowered the SMC to make rules for the\n                        conduct of its business, the SMC could conduct its business either with or\n                        without physical meetings. Accordingly, the Appellant’s argument that\n                        the SMC must hold a physical meeting in order to revoke the First DC’s\n                        appointment and appoint the Second DC was devoid of merit (see [46] and [98]\n                        of the HC Judgment). (f)     None of the circumstances raised by the Appellant (as set out below)\n                        in support of her argument that there was a reasonable apprehension of bias\n                        on the SMC’s part met the legal test of whether there were\n                        circumstances which would give rise to a reasonable suspicion or\n                        apprehension on the part of a fair-minded reasonable person, with knowledge\n                        of the relevant facts, that the decision-making body in question was biased\n                        (see [52] of the HC Judgment): (i)       There could be no legal\n                            objection, and no inherent conflict of interest, arising only from the\n                            fact that the DMS, who was a member of the SMC by virtue of\n                                s 4(1)(a) of the MRA, had\n                            multiple statutory roles, provided he was not a member of any Complaints\n                            Committee or Disciplinary Committee hearing and investigating a\n                            complaint against a registered medical practitioner (see [57], [59] and\n                            [99] of the HC Judgment). (ii)       In view of the non-fact-finding nature of the\n                            SMC’s role in appointing a Disciplinary Committee to inquire into\n                            a complaint and (in the present case) the SMC members’ unanimous\n                            decision to appoint the Second DC by reason of the absence of any\n                            response by any SMC member to the 13 September 2010 e-mail by the\n                            return date (so the Judge thought (see,eg, [61] of the HC Judgment), although Dr Rasanayagam\n                            actually objected to the appointment of the Second DC as well as the\n                            revocation of the First DC’s appointment (see sub-para (e) of[26]below)), the fact that the\n                            DMS, the First DC’s members and an expert witness in the First DC\n                            received that e-mail in their capacity as SMC members did notper segive rise to a reasonable apprehension of\n                            bias on the part of the whole of the SMC. There was countervailing\n                            factual evidence to the contrary on the record, in that the SMC had\n                            approved the appointment to the Second DC of two newly-elected SMC\n                            members who had not previously been SMC members when the First DC was\n                            appointed, with one being a private sector medical practitioner (see\n                            [57] and [62] of the HC Judgment). (iii)       The Appellant’s complaint\n                            that those members of the First DC who were registered medical\n                            practitioners did not inform her that they were employed by Ministry of\n                            Health Holdings Pte Ltd (“MOHH”), which was affiliated to\n                            MOHS (thereby giving rise to a potential conflict of interest), had no\n                            merit because that complaint had not been raised before the First DC. In\n                            any case, s 40(11) of the MRA provided that no SMC member who was\n                            employed by MOHS would be disqualified from being a member of a\n                            Complaints Committee or a Disciplinary Committee by reason only that he\n                            was so employed. This applieda fortioriin relation to SMC members who were employed by restructured corporate\n                            hospitals owned by MOHH.Further, the\n                            Appellant failed to establish any nexus between the composition of the\n                            First DC and all the other SMC members (who were not members of the\n                            First DC) so as to infect their “unanimous” decision to\n                            appoint the Second DC (see [57] and [63] of the HC\n                        Judgment). (iv)       The independent decision of the First DC to recuse itself in the\n                            light of the Appellant’s allegation of prejudgment carried no\n                            necessary connection to the decision by the other SMC members (who were\n                            not members of the First DC) to appoint the Second DC (see [57] and [64]\n                            of the HC Judgment). (v)       The Appellant’s postulation that the SMC\n                            ought to have first conducted an inquiry into the First DC’s\n                            recusal before appointing the Second DC and that the SMC’s failure\n                            to do so created a reasonable apprehension of bias on the SMC’s\n                            part had no foundation because there was no statutory obligation on the\n                            SMC to conduct such an inquiry. The holding of such an inquiry was also\n                            not a statutory precondition to the appointment of the Second DC (see\n                            [57] and [65] of the HC Judgment). (vi)       The presence of the SMC’s\n                            in-house counsel in the private room where the First DC (together with\n                            the legal assessor) had retired to for a hearing break had been\n                            ill-judged, even if the SMC’s in-house counsel had been there for\n                            logistical and/or administrative purposes. If the First DC had\n                            thereafter proceeded to issue its findings and decision, those\n                            circumstances might have justified a quashing of its findings. However,\n                            the Appellant was unable to show how the conduct of the SMC’s\n                            in-house counsel was linked to all the SMC members so as to infect their\n                            “unanimous” decision to appoint the Second DC (see [57]\n                            and [66]–[99] of the HC Judgment). (vii)       The Appellant, in relying on\n                            Dr Rasanayagam’s letter dated 16 September 2010 which\n                            recorded the SMC’s in-house counsel as having made the remark that\n                            the members of the First DC were “on our\n                                side”,[note: 6]interpreted that remark\n                            out of context. In any case, the Appellant was unable to show how that\n                            remark of the SMC’s in-house counsel was linked to all the SMC\n                            members so as to infect their “unanimous” decision to\n                            appoint the Second DC (see [57] and [66]–[99] of the HC\n                            Judgment). (viii)       The Appellant’s complaint that the\n                            3 September 2010 e-mail misrepresented the nature and significance\n                            of the recusal of the First DC was unfounded. At the minimum, the\n                            3 September 2010 e-mail had to state the decision that the SMC\n                            proposed to take and the reason why it was necessary for that decision\n                            to be taken. The SMC members could have asked for more details, but none\n                            of them did so (see [69]–[70] of the HC\n                        Judgment). (ix)       The brevity of the 3 September 2010 e-mail was explained in\n                            the e-mail itself as being necessary to preserve confidentiality. Such\n                            brevity protected the integrity of the disciplinary process and\n                            preserved the confidentiality of the deliberations of the First DC. That\n                            was critical because the Second DC was to be appointed by the SMC to\n                            hear the very same complaint which had been before the First DC\n                                (viz, the Complaint). Releasing the\n                            entire transcript of the First DC’s hearing would have prejudiced\n                            the Appellant because under s 42(1)(a) of the MRA, at least two members of the Second DC would\n                            be SMC members (see [71] of the HC Judgment). (x)       There could be no real\n                            objection to the First DC’s recusal being characterised as a\n                            procedural matter as the Appellant’s counsel had indeed made a\n                            procedural application to the First DC for it to recuse itself (see [69]\n                            and [71] of the HC Judgment). (g)     A decision would only be considered irrational\n                        in theWednesburysense if the decision-making\n                        body in question took into consideration matters that it should not have\n                        taken into account and/or failed to take into consideration matters that it\n                        was bound to consider, or, alternatively, if the decision was so absurd that\n                        no reasonable decision-making body could have made such a decision (see [73]\n                        of the HC Judgment). (h)     The SMC’s decision to appoint the Second DC was not a decision\n                        that touched on the substance or merits of the Complaint. The SMC also did\n                        not consider matters that it should not have considered, nor did it fail to\n                        consider any matter that it was bound to consider (see [76], [77] and [100]\n                        of the HC Judgment). (i)     The Appellant’s argument on considerations of unfairness,\n                        prejudice and oppression was taken out of context and did not independently\n                        support the grant of the Prohibiting Order. In any event, any unfairness,\n                        prejudice or oppression did not arise from any inaction or delay on the part\n                        of the SMC or the First DC. They were, instead, unavoidable consequences of\n                        the recusal of the First DC (see [78] and [100] of the HC\n                    Judgment). (j)     The\n                        Appellant’s argument at the high level of abstraction that the SMC had\n                        a legal obligation to ensure a fair disciplinary process did not cohere with\n                        the structure and provisions of the MRA. The structure of the disciplinary\n                        process was not set by the SMC. Instead, the structure was set by Parliament\n                        in enacting the MRA. In the operation of the statutory disciplinary process,\n                        fairness was ensured by the court’s supervision to ensure that fair\n                        processes were followed in every case. The fact that the MRA provided that\n                        the DMS was statutorily the Registrar of the SMC and a member of the SMC did\n                        not in any way detract from the statutory disciplinary process being a fair\n                        one (see [79], [81] and [99] of the HC Judgment). (k)     The Appellant’s application to\n                        declare the S 528/2010 Amendment Regulations illegal on the grounds\n                        that they were contrary to natural justice was misconceived. As those\n                        regulations were not applicable to the Second DC, the issue was hypothetical\n                        (see [84], [90] and [101] of the HC Judgment).",
        "The issues and arguments on appeal": "13     The arguments of the Appellant’s counsel\n                    before this court were largely an elaboration of arguments which had been\n                    rejected by the Judge. Before we examine those arguments, it is desirable that\n                    we first describe the statutory framework regulating disciplinary proceedings\n                    against registered medical practitioners that is applicable to the present case.\n                    An understanding of the statutory framework will lead to a better appreciation\n                    of some of the issues of procedural justice and fairness that were raised by the\n                    Appellant. According to the Appellant, procedural justice and fairness were\n                    lacking generally under the applicable statutory framework, and in particularvis-à-visher case.",
        "The statutory framework applicable to the present case": "14     The statutory framework that applies to the\n                    present case is set out in ss 38–43 in Pt VII of the MRA. That\n                    statutory framework has since been amended by the Medical Registration\n                    (Amendment) Act 2010 (Act 1 of 2010) (“the 2010 Amendment\n                    Act”), which is not relevant in the present case as it came into\n                    operation only on 1 December 2010 (in this regard, we should clarify that\n                    the term “the MRA” as used in this judgment refers to the Medical\n                    Registration Act (Cap 174, 2004 Rev Ed) as it stood prior to the\n                    coming into force of the 2010 Amendment Act). The statutory provisions\n                    applicable to the present case establish four regulatory bodies to deal with\n                    complaints against registered medical practitioners, each with different\n                    functions and duties. These four bodies consist of the SMC, the CP, the\n                    Complaints Committee and the Disciplinary Committee. 15     The SMC is constituted under s 4 of the\n                    MRA, and consists of: (a)     the DMS; (b)     two registered medical practitioners\n                        appointed by the Minister for Health (“the Minister”) on the\n                        nomination of the council of the National University of Singapore, one of\n                        whom shall be the Dean of the Faculty of Medicine of that\n                    university; (c)     nine\n                        registered medical practitioners resident in Singapore, who are to be\n                        elected by the fully-registered medical practitioners resident in Singapore;\n                        and (d)     seven\n                        registered medical practitioners resident in Singapore, who are to be\n                        appointed by the Minister. 16     The CP is appointed by the SMC pursuant to\n                    s 38 of the MRA, and consists of: (a)     not less than ten SMC\n                        members; (b)     not\n                        less than ten and not more than 40 registered medical practitioners of at\n                        least ten years’ standing who are not SMC members;\n                    and (c)     not less than\n                        six and not more than 40 laypersons nominated by the\n                    Minister. The chairman of the CP is appointed by the SMC from\n                    among those SMC members who are members of the CP. 17     A Complaints Committee is appointed from time\n                    to time by the chairman of the CP pursuant to s 39(5) of the MRA. Each\n                    Complaints Committee comprises: (a)     a chairman, being a member of the CP\n                        who is a SMC member; (b)     two members of the CP who are registered medical practitioners, at\n                        least one of whom must not be a SMC member; and (c)     a member of the CP who is a\n                    layperson. The Complaints Committee is a standing committee\n                    and not an ad hoc committee. 18     A Disciplinary Committee is appointed from\n                    time to time by the SMC pursuant to s 42(1) of the MRA to inquire into any\n                    complaint which a Complaints Committee has decided requires a formal inquiry by\n                    a Disciplinary Committee. Each Disciplinary Committee is appointed from among\n                    the members of the CP, and consists of: (a)     not less than three registered\n                        medical practitioners of at least ten years’ standing, at least two of\n                        whom must be SMC members; and (b)     one observer who is a layperson. 19     The sequence of references from the making of\n                    a complaint to a hearing of that complaint by a Disciplinary Committee is as\n                    follows: (a)     Under s 39(1)(a) of the MRA, any complaint concerning “the\n                        conduct of a registered medical practitioner in his professional capacity or\n                        … his improper act or conduct which brings disrepute to his\n                        profession” shall be made to the SMC, which “shall” [emphasis added] refer the complaint\n                        to the chairman of the CP. (b)     Under s 39(7) of the MRA, where any complaint is\n                        referred to the chairman of the CP, the chairman of the CP “shall” [emphasis added] lay the complaint\n                        before a Complaints Committee. (c)     Under s 40(1)(a) of\n                        the MRA, a Complaints Committee “shall” [emphasis added] inquire into any complaint laid\n                        before it and complete its inquiry not later than three months from the date\n                        on which the complaint was laid before it. (d)     Under s 41(1)(b)(ii) of the MRA, upon due inquiry into a complaint, the\n                        Complaints Committee, if it is of the view that a formal inquiry is\n                        necessary, “shall” [emphasis\n                        added] order that an inquiry be held by a Disciplinary\n                    Committee. (e)     Under\n                        s 41(3) of the MRA, where a Complaints Committee has ordered that a\n                        formal inquiry be held by a Disciplinary Committee, “the [SMC]shall immediatelyappoint a Disciplinary\n                        Committee whichshallhear and investigate the\n                        complaint” [emphasis added]. 20     It can be seen from these provisions that once\n                    a complaint against a registered medical practitioner for professional\n                    misconduct is received by the SMC, the statutory procedures take effect as a\n                    matter of course as mandated by these provisions. The only precondition for the\n                    appointment of a Disciplinary Committee is a finding by a Complaints Committee,\n                    after due inquiry into a complaint, that a formal inquiry by a Disciplinary\n                    Committee is necessary. With this statutory framework in mind, we shall now\n                    address the Appellant’s arguments on the Quashing Order, followed by her\n                    arguments on the Prohibiting Order.",
        "The Quashing Order": "",
        "Whether the appointment of the Second DC complied with the statutory\n                framework": "21     The Appellant raised no objection to the\n                    legality or validity of the appointment of the First DC or the composition of\n                    its members, whether in terms of compliance with the provisions of the MRA or in\n                    terms of apparent bias. In contrast, she raised issues of legality and apparent\n                    bias againstthe SMCin relation to the\n                    appointment of the Second DC, although she did not make any allegation of\n                    apparent bias against any member ofthe Second DC.\n                    When asked by this court to clarify the Appellant’s stance on the issue of\n                    apparent biasvis-à-visthe Second DC, counsel for\n                    the Appellant replied that the issue was not relevant in this appeal and that he\n                    wished to reserve the Appellant’s position on the issue. 22     The argument by the Appellant’s counselvis-à-visthe appointment of the Second DC was\n                    that the appointment: (a) was not in accordance with the provisions of the\n                    MRA; and (b) was vitiated by apparent bias on the SMC’s part. In the\n                    course of his submissions before us, counsel for the Appellant also asserted\n                    that the SMC had no jurisdiction to even refer the Complaint to the chairman of\n                    the CP as the Appellant’s alleged overcharging of the Patient was not a\n                    disciplinary matter, but a commercial dispute between the Appellant and the\n                    Patient. The aftermath of the First DC’s recusal 23     As we mentioned earlier, after the First DC\n                    recused itself, the disciplinary proceedings against the Appellant came to a\n                    stop. At that point in time, the SMC had called all its evidence and had closed\n                    its case. The Appellant had yet to call any evidence as her counsel had decided\n                    to make a submission of no case to answer. The First DC’s conduct in\n                    recusing itself without ruling on the Appellant’s submission of no case to\n                    answer resulted in the disciplinary proceedings being left in limbo, but not\n                    terminated. The disciplinary proceedings were not at an end yet as the First DC\n                    had not made any ruling on the merits of the SMC’s case against the\n                    Appellant and also had not dismissed the Complaint. Instead, the First DC walked\n                    away from the disciplinary proceedings because it received no support from\n                    counsel for the SMC to carry on with the proceedings after the Appellant’s\n                    counsel submitted that the First DC had prejudged his submission of no case to\n                    answer. 24     The result of the First DC’s recusal, it\n                    could be argued, was either that the First DC extinguished itself as a\n                    disciplinary body, or that its entire membership became vacant. Whatever the\n                    legal consequence of the First DC’s recusal might be, it did not\n                    automatically discharge the CC’s Order (which was made under\n                        s 41(1)(b)(ii) of the MRA) for a formal\n                    inquiry to be held by a Disciplinary Committee. The CC’s Order was not\n                    spent, as found by the Judge (and with which we agree). Hence, in our view,\n                    despite the vigorous submissions by counsel for the Appellant that the Complaint\n                    should have been laid before a fresh Complaints Committee after the First DC\n                    recused itself, such an approach was not necessary and would not accord with the\n                    statutory framework. The CC’s Order remained in force under the MRA and\n                    had to be acted upon by the SMC. Consequently, the SMC had a statutory duty to\n                    take steps to complete the disciplinary proceedings against the Appellant as\n                    required by the CC’s Order. It only remained for the SMC had to decide how\n                    to proceed further with those proceedings. In our view, the SMC really had only\n                    two choices. It could appoint new members to fill the vacancies in the First DC\n                    resulting from its original members’ recusal (as it did when it appointed\n                    A/Prof Jacobsen to fill the vacancy arising from the death of Dr Wong\n                    Yue Sie), or it could appoint a new Disciplinary Committee. The SMC sought legal\n                    advice on the matter (see[7]above). This\n                    led to the revocation of the First DC’s appointment and the appointment of\n                    the Second DC. 25     No argument was made before us as to whether\n                    it was even necessary for the SMC to revoke the appointment of the First DC. As\n                    we stated earlier, it could be contended that the First DC’s recusal from\n                    the disciplinary proceedings resulted in the extinguishment of the First DC as a\n                    disciplinary body. If that was indeed the consequence, then it would not even\n                    have been necessary for the SMC to revoke the First DC’s appointment as\n                    there would have been no extant body to revoke. In other words, the purported\n                    revocation would have no effect in law. Be that as it may, whichever way the SMC\n                    went about the matter, the CC’s Order was still in effect, and the\n                    Complaint had to be referred to a Disciplinary Committee for inquiry. Hence, the\n                    appointment of the Second DC was in compliance with the MRA. The Appellant’s arguments (1)   Whether the SMC members met to approve the revocation of the\n                First DC’s appointment and the appointment of the Second DC 26     The Appellant’s first argument as to why\n                    the revocation of the First DC’s appointment and the appointment of the\n                    Second DC via the 3 September 2010 e-mail and the 13 September 2010\n                    e-mail (collectively, “the Two E-mails”) were not in accordance\n                    with the MRA consisted of the following strands: (a)     There was no true consultative\n                        meeting of minds among the SMC members, and, therefore, no lawful meeting\n                        was held to revoke the First DC’s appointment and appoint the Second\n                        DC. (b)     Crucial\n                        facts were misrepresented to or withheld from the SMC members. The Two\n                        E-mails erroneously asserted that the SMC wasobligedto revoke the appointment of the First DC and that\n                        the appointment of the Second DC was an administrative\n                    matter. (c)     The manner\n                        in which the SMC made the two decisions revoking the First DC’s\n                        appointment and appointing the Second DC – namely, with silence on the\n                        part of the SMC members taken to mean assent – conveniently dispensed\n                        with a consultative decision-making process. (d)     There was no evidence that all the SMC members\n                        received, read and/or considered the Two E-mails so as to appreciate their\n                        importance, or to understand that they would be deemed by their silence to\n                        have assented to the SMC’s proposal to revoke the First DC’s\n                        appointment and appoint the Second DC. (e)     Dr Rasanayagam, the only SMC member who replied to\n                        the Two E-mails, voted against the proposed decisions, but the other SMC\n                        members were not informed of this. Another SMC member said that he had\n                        received the Two E-mails but had not participated in the SMC’s\n                        proposed decisions. (f)     No SMC member actually approved the SMC’s proposed decisions,\n                        whether in the light of full or adequate information on the circumstances\n                        then faced by the SMC or otherwise. 27     Except for the argument in sub-para (d)\n                    of the preceding paragraph, all the other aforesaid arguments were canvassed\n                    before the Judge, who ruled that they, even if made out, would not have the\n                    effect of nullifying the appointment of the Second DC. Before us, counsel for\n                    the Appellant did not explain where the Judge erred in rejecting those\n                    arguments. The Judge rejected those arguments on the basis that the SMC had a\n                    statutory duty (and thereforeno discretionin the\n                    matter) to appoint a new Disciplinary Committee to complete the disciplinary\n                    proceedings against the Appellant which the First DC had failed to complete. In\n                    contrast, the arguments of the Appellant’s counsel were made on the\n                    assumption that the SMChad the discretion notto\n                    continue those proceedings, and that the SMC members could vote to terminate\n                    those proceedings. In our view, the position taken by the Appellant’s\n                    counsel was neither consistent with nor supported by the statutory framework.\n                    The SMC had no power to disregard the CC’s Order, which was still\n                    operative. So long as the CC’s Order remained alive, the SMC’s\n                    statutory duty also remained alive. The SMC thus had no choice but to appoint\n                    another Disciplinary Committee to continue the disciplinary proceedings against\n                    the Appellant after the First DC recused itself. If the SMC had failed to\n                    appoint another Disciplinary Committee, it would have been open to the Minister,\n                    under s 41(8) of the MRA, to order the SMC to immediately appoint a new\n                    Disciplinary Committee to hear and investigate the Complaint. 28     Given these circumstances, the\n                    Appellant’s complaint about the absence of a consultative decision-making\n                    process in respect of the revocation of the First DC’s appointment and the\n                    appointment of the Second DC was beside the point. There was no need for any\n                    consultation as to whether or not the appointment of a new Disciplinary\n                    Committee was necessary or wise as the SMC had no discretion in the matter. The\n                    approval of the SMC members was a procedural requirement of a formal nature,\n                    and, in this regard, their approval by a majority was sufficient. We should add\n                    that Dr Rasanayagam’s objection to the revocation of the First\n                    DC’s appointment and the appointment of the Second DC did not affect the\n                    validity of any decision made by the SMC on these two matters so long as the\n                    decision was approved by a majority of the SMC members. 29     Although the SMC had a statutory duty to\n                    appoint a new Disciplinary Committee after the First DC recused itself, it had\n                    to discharge that duty in accordance with the substantive and procedural\n                    requirements of the law. Procedurally, this meant that the SMC had to secure the\n                    approval of at least a majority of the SMC members to its proposal to revoke the\n                    First DC’s appointment and appoint the Second DC. How such approval was to\n                    be obtained was entirely a matter for the SMC to determine. For this purpose, an\n                    approval given by circular would be just as valid as a formal approval given at\n                    a formal meeting. With current technology, a meeting of minds via e-mails would\n                    be sufficient for this purpose. Hence, in our view, the sending of the Two\n                    E-mails, both of which stated that the SMC members would be deemed to have\n                    agreed to the proposals set out therein if they did not respond by the\n                    stipulated deadline, was a proper way for the SMC to seek the assent of the SMC\n                    members to the revocation of the First DC’s appointment and the\n                    appointment of the Second DC. (2)   Whether all the SMC members received, read and/or considered\n                the Two E-mails 30     Before us, counsel for the Appellant argued\n                    that the SMC had not produced any evidence that the Two E-mails had been\n                    received, read and/or considered by all the SMC members, and, accordingly, the\n                    SMC had not established that there had been a meeting of the SMC members to\n                    revoke the First DC’s appointment and appoint the Second DC, or that the\n                    SMC members had agreed to the proposals set out in the Two E-mails. The\n                    SMC’s response to this argument was that the Appellant had not alleged in\n                    the court below that the Two E-mails might not have been received, read and/or\n                    considered by all the SMC members. If that argument had been raised before the\n                    Judge, counsel for the SMC submitted, the SMC would have applied to adduce\n                    evidence (in the form of affidavits from the SMC members) to rebut the argument.\n                    Counsel for the SMC stated that to his understanding, the Appellant’s\n                    argument in the court below centred on whether the omission of the SMC members\n                    to respond to the Two E-mails was sufficient to constitute assent to the\n                    proposals set out in those e-mails. In the SMC’s view, it was sufficient\n                    since the Two E-mails made it clear that the SMC members would be assumed to\n                    have agreed to the proposals set out therein if they did not reply by,\n                    respectively, Tuesday 7 September 2010 (vis-à-visthe 3 September 2010 e-mail) and 5pm on Tuesday,\n                    14 September 2010 (vis-à-visthe\n                    13 September 2010 e-mail). Counsel for the Appellant disagreed with this\n                    submission by the SMC’s counsel, and contended that he had indeed argued\n                    before the Judge that the SMC had not shown that all the SMC members had\n                    received, read and/or considered the Two E-mails, but counsel for the SMC had\n                    not responded to that argument. 31     In the light of this factual dispute, we\n                    examined the Appellant’s skeletal arguments for the hearing in the court\n                    below and found that they did not contain any submission that there might have\n                    been SMC members who had notreceivedthe Two\n                    E-mails. Instead, the argument set out in those skeletal arguments was that\n                    there was no evidence that all the SMC members hadread\n                        and/orconsideredthe contents of\n                    those e-mails. After reserving judgment, we also examined the certified\n                    transcript of the oral submissions before the Judge by counsel for the\n                    respective parties. The certified transcript shows that counsel for the\n                    Appellant said, in the course of his argument that there must be a meeting of\n                    the SMC members in order to revoke the First DC’s appointment and appoint\n                    the Second DC, that: (a) there was no evidence as to whom the Two E-mails\n                    had been addressed to, who had received them and who had read and/or considered\n                    them; and (b) if not all the SMC members had received, read and/or\n                    considered the Two E-mails, there could not have been a decision by the SMC\n                    members on the proposals set out in those e-mails.[note: 7]The\n                    Judge’s response to this argument, as recorded in the certified\n                    transcript, was that the Appellant’s allegation that there might have been\n                    SMC members who had not received, read and/or considered the Two E-mails was\n                        “hypothetical”,[note: 8]and that the\n                    only material issue before the court was whether the decision-making process\n                    effectuated by means of the Two E-mails was valid in law. We interpret this\n                    observation by the Judge to mean that the Appellant’s argument in the\n                    court below focused on the validity of that decision-making process, and not on\n                    the point that there might have been SMC members who had not received, read\n                    and/or considered the Two E-mails. In this regard, it is pertinent to note that\n                    in the HC Judgment, the Judge did not deal with the Appellant’s argument\n                    relating to the absence of any evidence that all the SMC members had received,\n                    read and/or considered the Two E-mails. 32     To resolve this disputed issue of fact of\n                    whether all the SMC members had received, read and /or considered the Two\n                    E-mails, we directed the SMC to file affidavits of the SMC members to address\n                    the point. The affidavits have since been filed. However, counsel for the\n                    Appellant now contends that the affidavits confirm that: (a) the\n                    decision-making process effectuated via the Two E-mails did not yield a valid\n                    decision in law; and (b) the SMC members were “unable to state on\n                    oath that they had read and understood the emails [viz, the Two E-mails], and [had] decided to approve the proposed\n                    decisions by not raising any objections … within the timelines stated in\n                    the emails”.[note: 9]Accordingly, counsel for the Appellant seeks\n                    leave to cross-examine the SMC members on their affidavits if this court is\n                    minded, on the evidence, to reach a conclusion contrary to that asserted by the\n                    Appellant (as stated earlier in this paragraph). 33     In our view, the only material point in\n                    connection with the Appellant’s submissions on the Two E-mails is whether\n                    the SMC membersreceivedthem. If the SMC members\n                    did receive them, their omission to respond by the stipulated deadlines is\n                    sufficient in law to constitute their assent to – and, thus, a valid\n                    decision on – the revocation of the First DC’s appointment and the\n                    appointment of the Second DC. As we decided earlier, the approval of the SMC\n                    members to these two measures was merely a formality as the law required the SMC\n                    to appoint a new Disciplinary Committee to complete the disciplinary proceedings\n                    which were left in limbo after the First DC recused itself. 34     Finally, we would add that the Appellant has,\n                    in our view, attempted to make too much out of this issue. The basic principle\n                    of evidence in our adversarial process of adjudication is that he who asserts\n                    must prove. Hence, the Appellant, in asserting that the SMC did not make a valid\n                    decision in law with respect to the revocation of the First DC’s\n                    appointment and the appointment of the Second DC, must prove that assertion, and\n                    that includes proving that not all the SMC members received the Two E-mails. In\n                    our view, the Appellant’s argument on this point fails. 35     We should add that even if the\n                    Appellant’s argument that there was no proper decision to revoke the First\n                    DC’s appointment and appoint the Second DC were correct, it would not\n                    bring an end to the disciplinary proceedings against the Appellant in respect of\n                    the 94 disciplinary charges laid before the First DC. It would simply mean that\n                    the SMC would have to start the process all over again by appointing another\n                    Disciplinary Committee to continue the disciplinary proceedings against her as\n                    ordered by the CC. 36     We accordingly affirm the Judge’s\n                    decision that the SMC had held a valid meeting to revoke the appointment of the\n                    First DC and appoint the Second DC. (3)   Whether the immediacy requirement in section 41(3) of\n                the MRA was satisfied 37     The Appellant next argued that the immediacy\n                    requirement in s 41(3) of the MRA (the provision under which the Second DC\n                    was appointed) was not satisfiedvis-à-visthe\n                    appointment of the Second DC. This was because s 41(3) required the SMC to\n                    appoint a Disciplinary Committee “immediately” [emphasis added] upon a Complaints Committee\n                    ordering that a formal inquiry into a complaint be held, whereas in the present\n                    case, some 22 months elapsed from the date of the CC’s Order (ie, 17 November 2008) before the Second DC was\n                    appointed. This argument was also made before the Judge, who rejected it on the\n                    grounds that the relevant starting time for the purposes of s 41(3) of the\n                    MRA was the date of the SMC’s decision to revoke the appointment of the\n                    First DC, and not the date of the CC’s Order. The Judge further held that\n                    even if time had begun to run from the date of the CC’s Order, the\n                    requirement of immediacy was directory as (inter\n                        alia) there was no evidence of substantial prejudice to the\n                    Appellant (see [44] of the HC Judgment; see also sub-para (c) of[12]above). 38     The SMC’s reply to the above argument by\n                    the Appellant was that the CC’s Order remained alive, and that since the\n                    SMC had complied with s 41(3) of the MRA when it appointed the First DC,\n                    the requirement of immediacy had been satisfied. The Second DC, the SMC argued,\n                    had been appointed for the sole purpose of completing the disciplinary\n                    proceedings that the First DC had left uncompleted. We agree with these\n                    submissions. They are entirely consistent with the objective that disciplinary\n                    proceedings under the MRA should be commenced and completed with due expedition.\n                    This is not a case where a Disciplinary Committee was appointed only 22 months\n                    after the CC’s Order. It is, instead, a case where a Disciplinary\n                    Committee (viz, the First DC) was appointed\n                    timeously, but its recusal led to the disciplinary proceedings against the\n                    Appellant being left in limbo, hence giving rise to the need to appoint a fresh\n                    DC (viz, the Second DC). 39     In relation to the legal basis of the\n                    Judge’s holding that the immediacy requirement in s 41(3) of the MRA\n                    is directory (apparently followingChai Chwan v Singapore\n                        Medical Council[2009] SGHC 115), we would observe (as\n                    the Judge also noted) that the dichotomy between the mandatory effect and the\n                    directory effect of words (used in statutory provisions) which areex faciemandatory (eg,\n                    the word “shall”) has been abandoned by the English courts in\n                    favour of the practical approach of determining Parliament’s intention in\n                    each case so as to ascertain whether or not a failure to comply with a\n                    “shall” requirement would result in a nullity (seeRegina v Soneji and another[2006] 1 AC 340).\n                    Our courts should follow suit. 40     In the case of s 41(3) of the MRA, we are\n                    of the view that Parliament could not have intended that an untimely appointment\n                    of a Disciplinary Committee to hear a complaint would render the appointment\n                    null and void, with the consequence that the SMC’s power to appoint a\n                    Disciplinary Committee for the purposes of that particular complaint would be\n                    exhausted. The word “immediately” in s 41(3) is intended to\n                    be no more than a direction to the SMC to carry out its duties expeditiously. If\n                    an untimely appointment of a Disciplinary Committee has the potential to cause\n                    injustice to the registered medical practitioner whose conduct is being inquired\n                    into, it would be a material factor which that Disciplinary Committee has to\n                    take into account in determining whether the disciplinary charges against that\n                    registered medical practitioner have been proved.",
        "Whether there was apparent bias on the SMC’s part in appointing\n                the Second DC": "41     The next set of arguments advanced by the\n                    Appellant apropos the Quashing Order concerned the allegation of apparent bias\n                    on the SMC’s part in appointing the Second DC. It was alleged that such\n                    bias was evident from the SMC’s actions and inactionvis-à-visthe Appellant and, thus, the court should prohibit\n                    further prosecution of the Complaint. The elements of this argument (as taken\n                    from the Appellant’s skeletal arguments for the present appeal) were as\n                    follows: (a)     Prof Satku, the DMS at the\n                        material time and also the Registrar of the SMC, effectively acted as\n                        complainant, investigator and prosecutor in the disciplinary proceedings\n                        against the Appellant. When carrying out his overlapping functions, he\n                            “formed a personal\n                            view”[note: 10][emphasis in original] on the fees\n                        charged by the Appellant. He instigated PS-MOHB to file the Complaint and\n                        thereby escalated what was merely a commercial dispute between the Appellant\n                        and the Patient to a disciplinary matter. For these reasons, he should not\n                        have played a part in appointing the Second DC. (b)     The involvement of the First DC’s members\n                        and the SMC’s witnesses in the appointment of the Second DC was a\n                        fatal defect because of the inherent conflict of interest in such a\n                        situation. (c)     The\n                        SMC’s downplaying of the SMC’s in-house counsel’s conduct\n                        in retiring to a private room with the First DC and the legal assessor\n                        during a hearing break showed the SMC’s dismissive attitude towards\n                        important procedural safeguards that were necessary for a fair and proper\n                        disciplinary inquiry. It was clear law that the presence of a non-member of\n                        a disciplinary tribunal during the tribunal’s deliberations on the\n                        complaint before it was, without more, sufficient to invalidate the\n                        tribunal’s proceedings, particularly when that person was the\n                        prosecutor of the complaint. (d)     Dr Rasanayagam’s letter of 16 September\n                        2010 stating that the SMC’s in-house counsel had commented that the\n                        First DC was on the SMC’s side only served to compound the appearance\n                        of bias manifested by the aforesaid conduct of the SMC’s in-house\n                        counsel. The failure of the SMC to inquire into this issue demonstrated that\n                        it was not interested in establishing a disciplinary process that was both\n                        fair and seen to be fair. (e)     The SMC further failed to address the reasonable\n                        apprehension of bias created by its misrepresentation about the procedural\n                        defects in the proceedings before the First DC. Those defects were as\n                        follows: (i)       The First DC indicated at\n                            the start of the reconvened hearing on 29 July 2010 that it was\n                            ready, on the basis of the respective parties’ written\n                            submissions, to deliver its decision on the Appellant’s submission\n                            of no case to answer. However, at that point in time, the First DC had\n                            yet to hear the respective parties’ oral arguments on this issue\n                            and also had not asked the legal assessor any questions at\n                        all. (ii)       As\n                            at 29 July 2010, A/Prof Jacobsen, who had been appointed to\n                            the First DC following Dr Wong Yue Sie’s death, had had less\n                            than 14 days’ access to the full set of papers relating to the\n                            disciplinary proceedings against the Appellant. Yet,\n                            A/Prof Jacobsen was apparently able, despite these circumstances,\n                            to come to a decision on the complex arguments made apropos the\n                            Appellant’s submission of no case to answer. (iii)       The First DC subsequently\n                            recused itself on the basis of the Appellant’s contention that it\n                            had prejudged her submission of no case to answer. The foregoing were all gravely serious failings which prejudiced the\n                        Appellant and undermined the disciplinary process administered by the SMC.\n                        The assertion that the SMC was not statutorily required to inquire into\n                        these matters or inform the SMC members of what had transpired in the\n                        proceedings before the First DC was absurd when the SMC itself acknowledged\n                        that the MRA did not provide for the appointment of a new Disciplinary\n                        Committee following the First DC’s recusal. 42     The Appellant’s purpose in detailing the\n                    above elements, many of which were not material to the issues in this appeal\n                        (eg, elements (c), (d) and (e)), was to\n                    make the point that the SMC had failed in its statutory obligation to provide a\n                    disciplinary process that was fair and seen to be fair, and that operated in\n                    accordance with the lawwith respect to her case.\n                    In other words, the Appellant presented herself as taking a personal stand in\n                    the matter, which, she contended, wasfor the benefit of the\n                        medical profession. 43     In reply to the Appellant’s allegations\n                    against Prof Satku, counsel for the SMC contended that the evidence showed\n                    that Prof Satku did not instigate PS-MOHB to lodge the Complaint against\n                    the Appellant. The fact was that officials from MOHB went to see Prof Satku\n                    (in the latter’s capacity as the DMS at that time) after receiving the\n                    Patient’s complaint about the Appellant’s high charges, and\n                    Prof Satku invited MOHB to file a formal complaint so that the matter could\n                    be looked into. Contrary to what the Appellant alleged, Prof Satku did not\n                    divert MOHB’s complaint about the Appellant’s charges away from\n                    civil resolution of the dispute to resolution by the disciplinary process. This\n                    could be seen from the fact that PS-MOHB filed the Complaint onlyafter(inter alia)\n                    officials from MOHB had met the chief executive officer of Parkway Hospital\n                    Group, which owned the hospital where the Appellant treated the Patient, about\n                    the Appellant’s charges. 44     As for the other elements of apparent bias\n                    alleged by the Appellant to present the picture that the SMC had failed to\n                    provide a fair disciplinary process in her case, our view is that they were\n                    concerned more withthe Appellant’s\n                        perceptionof certain irregularities which occurred in the course\n                    of the proceedings before the First DC. For example, the Appellant raised the\n                    point that the SMC’s in-house counsel had retired to a private room with\n                    the First DC and the legal assessor during a hearing break. However, as the\n                    Judge found, there was no allegation by the Appellant that the SMC’s\n                    in-house counsel had taken any part in the First DC’s deliberations on any\n                    of the matters raised in the proceedings before it. The Appellant also brought\n                    up the remark by the SMC’s in-house counsel that the First DC was on the\n                    SMC’s side. In our view, that remark was taken out of its proper context\n                    and misconstrued as indicating that the First DC was biased against the\n                    Appellant. That remark was actually made by the SMC’s in-house counsel in\n                    response to Dr Rasanayagam’s concern, upon receiving the\n                    3 September 2010 e-mail, that the SMC’s proposal to revoke the First\n                    DC’s appointment might lead to the First DC’s members suing the SMC\n                    (presumably for defamation) as they might regard such revocation as “[a]\n                    blemish on their professional or personal reputation”.[note: 11]What the Appellant appeared to be arguing was that because the First DC recused\n                    itself for the reason which it did (viz, on the\n                    basis of the Appellant’s contention that it had prejudged her submission\n                    of no case to answer), the SMC must address the reasonable apprehension of bias\n                    created by or evident from such recusal. We are unable to see how any reasonable\n                    apprehension of bias could have arisen from that incident. The Appellant failed\n                    to show us how the procedural failures of the First DC supported her allegation\n                    that the SMC created an unfair disciplinary process in her case when the SMC has\n                    nothing to do with the statutory framework for disciplinary proceedings against\n                    registered medical practitioners (see[46]below). 45     The Appellant also argued that there was a\n                    reasonable apprehension of bias on the SMC’s part as the SMC, in sending\n                    out the 3 September 2010 e-mail, merely described the Appellant’s\n                    application to disqualify the whole of the First DC as aproceduralapplication, instead of pointing out to the SMC\n                    members that it was a unique application of considerable seriousness to both the\n                    Appellant and the SMC’s reputation. Counsel for the Appellant further\n                    argued that in so describing the Appellant’s application, the SMC\n                    misrepresented crucial facts to or withheld such facts from the SMC members. We\n                    see no merit in these arguments. In our view, the Appellant’s recusal\n                    applicationwaspurely procedural in nature, and\n                    there was thus no misrepresentation by the SMC in so describing that\n                    application. Further, counsel for the Appellant did not explain to us how the\n                    contents of the 3 September 2010 e-mail could have given rise to a\n                    reasonable suspicion of bias on the part of the SMC. All that the SMC did in\n                    sending out that e-mail was to give the SMC members the background as to why\n                    there was a need to appoint a new Disciplinary Committee. In the court below,\n                    the Judge rejected the Appellant’s arguments concerning the\n                    3 September 2010 e-mail on the grounds that the SMC’s decision not to\n                    disclose the reasons why the First DC had recused itself was a precautionary\n                    measure to guard against influencing the SMC members in their decision on\n                    whether or not to assent to the appointment of the Second DC. We agree with this\n                    reasoning. In our view, whatever the First DC did and why it did what it did\n                    were of no concern to the SMC members apropos the appointment of the Second DC.\n                    They were merely being asked to agree formally to the revocation of the First\n                    DC, as well as to the appointment of the Second DC and the composition of its\n                    members. 46     In our view, the Appellant was attempting to\n                    cast a cloud of suspicion over the conduct of Prof Satku by alleging that\n                    he either administered or endorsed an unfair disciplinary process for the formal\n                    inquiry into the Complaint. In our view, the Appellant attacked the wrong\n                    target. While s 5 of the MRA vests the SMC with authority to regulate the\n                    ethical standards of registered medical practitioners, the SMC is not\n                    responsible for establishing the disciplinary framework applicable to registered\n                    medical practitioners. The framework has instead been established by Parliament\n                    via ss 38–43 of the MRA. The SMC’s duties under these\n                    provisions are all “ministerial” or administrative in nature. The\n                    SMC has no discretion in the matter once it receives a complaint (whether from\n                    the DMS, MOHS or other sources) against a registered medical practitioner (see\n                    s 39(1) of the MRA). The SMC merely acts as a conduit in such\n                    circumstances, and, therefore, no issue of bias can arise with respect to the\n                    SMC discharging its statutory duties. This is also the case when the SMC\n                    appoints a Disciplinary Committee upon receiving a Complaints Committee’s\n                    order that a formal inquiry into a complaint should be held by a Disciplinary\n                    Committee (see s 41(3) of the MRA). 47     Early cases on administrative law referred to\n                    duties of the kind outlined above as “ministerial” duties because\n                    they did not involve the exercise of any discretion or judgment. Reference may\n                    be made to Lord Woolf, Jeffrey Jowell & Andrew Le Sueur,De Smith’s Judicial Review(Sweet & Maxwell,\n                    6th Ed, 2007) at para B-008 for an explanation of the use of the term\n                    “ministerial” to describe statutory duties or functions which do\n                    not involve the exercise of any discretion or judgment. 48     In the present case, the only discretion which\n                    the SMC has in the chain of ministerial duties or functions set out in\n                    ss 38–43 of the MRA is in respect of the selection of the members of\n                    a Disciplinary Committee. In the context of this statutory framework, the\n                    allegation that Prof Satku (the DMS at the material time) was biased\n                    against the Appellant, had formed an adverse opinion on the Appellant’s\n                    charges and had multiple roles to play in the disciplinary process could not\n                    give rise to any unfairness or perception of unfairness in the disciplinary\n                    process. In the present case, the critical issue is not the role of the DMS as a\n                    member of the SMC, but whether there was a reasonable apprehension that\n                    Prof Satku caused the SMC to appoint, as members of the Second DC, persons\n                    in respect of whom there was a reasonable suspicion that they would or might,\n                    for whatever reason, be biased against the Appellant. Neither the DMS nor the\n                    SMC has any role to play in the disciplinary proceedings before the Second DC or\n                    the outcome of those proceedings, both of which are entirely matters for the\n                    Second DC. Hence, any allegation of bias (or other grounds of disqualification)\n                    should have been directed against the members of the Second DC. However, no\n                    allegation of this nature has been made by the Appellant thus far. When asked by\n                    this court whether the Appellant would be making any allegation of bias against\n                    the members of Second DC, counsel for the Appellant did not wish to commit his\n                    client to any position (see[21]above).\n                    Until the Appellant takes a position on this issue, there is no legal basis on\n                    which a court can consider granting the Quashing Order sought by the\n                    Appellant. 49     In short, the Appellant’s case before\n                    the Judge and on appealvis-à-visthe Quashing\n                    Order was, in our view, entirely misconceived.",
        "The Prohibiting Order": "50     We turn now to the Prohibiting Order. As\n                    originally pleaded, the Appellant’s case on the Prohibiting Order was that\n                    the SMC’s decision to appoint the Second DC was unreasonable or irrational\n                    in theWednesburysense. As we explained earlier,\n                    the position is in fact the contrary –ie, it would be irrational (and also a dereliction\n                    of duty) for the SMC not to have appointed another Disciplinary Committee to\n                    continue the disciplinary proceedings against the Appellant after the First DC\n                    recused itself. 51     Before us, the Appellant advanced a new\n                    argument based on the recent judgment of the Court of 3 Judges inLaw Society of Singapore v Andre RavindranSaravanapavanArul[2011] SGHC 224 (“Arul”).\n                    Relying on certain observations of the Court of 3 Judges inArulon the legal nature of overcharging by an advocate and\n                    solicitor for professional services, counsel for the Appellant argued that the\n                    SMC had no jurisdiction to prefer charges of overcharging against the Appellant\n                    on the sole basis of “numbers” and/or was irrational in doing so.\n                    What the Appellant’s counsel meant was that in the absence of any\n                    allegation that the Appellant rendered her bills to the Patient dishonestly,\n                    improperly or in abuse of the doctor-patient relationship, the fact that she\n                    charged an apparently exorbitant sum for her services (whatever the amount might\n                    be) would not found a charge of professional misconduct. 52     The Appellant’s counsel pointed out that\n                    in the present case, there wasprima facieevidence of a fee agreement between the Appellant and the Patient as the\n                    Appellant had previously informed the Patient that she would be charged around\n                    $100,000 to $200,000 a day for her medical care and treatment, and the Patient\n                    had expressed no disagreement. It was also argued that the evidence on the\n                    record showed that in the five years prior to 2007, the Patient was content to\n                    pay and did pay fees of equivalent magnitude to those which were the subject\n                    matter of the Complaint. All of those previous bills were checked, verified and\n                    paid in full by the office of the Sultan of Brunei and MOHB. Given those\n                    circumstances, the Appellant’s counsel submitted, there was no reason to\n                    escalate the dispute between the Appellant and the Patient into a disciplinary\n                    matter. 53     The SMC’s reply to this argument was\n                    that the Patient had not agreed to the Appellant’s estimated fees as the\n                    occasion when the Appellant had mentioned her estimated fees to the Patient had\n                    not been an appropriate or conducive occasion for the latter to agree to any\n                    particular fee or level of fees for her medical care and treatment. The SMC\n                    disputed the Appellant’s version of the alleged discussion with the\n                    Patient on fees. 54     In our view, whether there was indeed a fee\n                    agreement between the Appellant and the Patient is an issue of fact for the\n                    Second DC to decide. Similarly, the issue of whether or not there was any\n                    overcharging by the Appellant and, if so, whether it would amount to\n                    professional misconduct are matters to be resolved by the Second DC. In the\n                    present proceedings, the role of the court is limited to deciding whether, as a\n                    matter of law, the SMC had the power to appoint the Second DC to continue the\n                    disciplinary proceedings against the Appellant and, if so, whether the power was\n                    exercised in accordance with the law. On both of these issues, we have ruled in\n                    favour of the SMC. The Appellant’s arguments based onArulare premature, and should be raised before the Second DC\n                    for its consideration. 55     Be that as it may, it is necessary that we\n                    correct any suggestion that inArul, the Court of\n                    3 Judges decided that an allegation of overcharging for professional services\n                    should, in law, be viewed as a commercial dispute and not as a matter of\n                    professional ethics. In the general context of professional services, if the\n                    service provider and the client agree on the fee payable for the services to be\n                    rendered, and if the services are rendered in accordance with the terms of the\n                    agreement, no issue of overcharging would normally arise, however high the fee\n                    may seem to another client or another service provider in the same profession.\n                    But, as held by the Court of 3 Judges inArul,\n                    overcharging can still arise even where there is a fee agreement if the service\n                    provider pads his bill or does unnecessary work of a kind not specified in his\n                    fee agreement with his client. Overcharging for professional services simply\n                    means either charging, in respect of services rendered, an amount beyond what is\n                    reasonably chargeable for those kinds of services, or charging for unnecessary\n                    services or services not rendered at all. In the last-mentioned instance,\n                    overcharging might even amount to dishonesty and/or cheating. Whether or not\n                    overcharging in a particular profession crosses the threshold of acceptable\n                    professional conduct into the realm of punishable professional misconduct is a\n                    matter for the relevant professional body to decide in the first instance, and,\n                    if there is an appeal, ultimately by a court of law, on the facts of each case.\n                    The decision of the Court of 3 Judges inArulis\n                    not an authority for the proposition that professionals are entitled to\n                    overcharge their clients. It actually affirms the law to the\n                contrary. 56     Finally, we should add that even if the\n                    Appellant’s arguments on overcharging have any substance, they would not\n                    touch on those disciplinary charges against her which relate to making false\n                    representations in invoices rendered to the Patient.",
        "Conclusion": "57     For the above reasons, this appeal is\n                    dismissed with costs and the usual consequential orders.  [note: 1]See vol 2(A), p 32 of the Core Bundle dated\n                                9 September 2011 filed by the Appellant\n                                (“ACB”). [note: 2]See ACB\n                                vol 2(A), p 33. [note: 3]See ACB vol 2(A),\n                    p 17. [note: 4]See ACB vol 2(A),\n                                pp 6–7. [note: 5]See ACB vol 2(A),\n                        p 6. [note: 6]See ACB vol 2(A),\n                                        p 8. [note: 7]See the Record\n                                of Appeal vol 3(5) at p 235. [note: 8]Ibid. [note: 9]See para 4 of the Appellant’s\n                                letter to the court dated 25 November\n                        2011. [note: 10]See\n                                    para 43 of the Appellant’s skeletal arguments dated\n                                    31 October 2011 for the present\n                            appeal. [note: 11]See ACB vol 2(A), p 8."
    }
}