{
    "case_title": "Holcim (Singapore) Pte Ltd\n      v\n      Precise Development Pte Ltd and another application",
    "ncitation": "[2011] SGCA 1",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "8       Turning to the relevant factual background\n                    (which is crucial to the interpretation as well as application of cl 3),\n                    the Appellant entered into the Contract with the Respondent on 10 November\n                    2006 for the supply of RMC for a warehouse project.[note: 2]The Respondent is the main\n                    contractor for the project. The Appellant is in the business of manufacturing\n                    and supplying RMC to construction companies, and it uses concreting sand and\n                    aggregates as source materials to manufacture RMC. 9       The Contract consists of a quotation dated\n                    10 November 2006 and a page of Terms and Conditions. The Contract required\n                    the Appellant to supply 90,000 cubic metres (+/- 15%) of concrete to\n                    the Respondent for the project. Amongst the grades of concrete included in the\n                    Contract was Grade 30, for which the Appellant quoted a price of\n                    $65 per cubic metre. In the quotation dated 10 November 2006,\n                    paragraph 3 states as follows: All prices fixed till 31stDec\n                        2007. 10     The salient clauses in the Terms and\n                    Conditions of the Contract included cl 3 (set out above at[4]), and cl 10 and cl 15 which read as\n                    follows: Clause 10 The supplier reserves the right to terminate the contract giving one\n                        month’s written notice to the Purchaser stating the reasons for the\n                        termination. Clause 15 For concrete order that exceed 100[cu m], two day[s] advance booking\n                        is required.All bookings are to be accepted by the\n                            Supplier. In no event shall the Supplier be liable for any\n                        liquidated damages arising from any cause whatsoever loss of profits\n                        consequential or otherwise. [emphasis added]",
        "Factual background": "",
        "Announcement of the Sand Ban": "11     The Indonesian government suddenly announced\n                    on or about 23 January 2007[note: 3]that it would impose a Sand\n                    Ban from 6 February 2007. This had an immediate impact on the availability\n                    and prices of sand. The Appellant wrote to the Respondent on 26 January\n                    2007 to inform it of the Sand Ban, and that this would lead to a shortage of\n                    materials to manufacture RMC.[note: 4]The Appellant stated that it was\n                    meeting the Building & Construction Authority (“the BCA”) to\n                    discuss alternative options for the supply of sand. The Appellant stated that it\n                    might have to cease the supply of concrete and advised the Respondent to seek\n                    alternative avenues of supply. 12     Subsequently, in a Circular dated\n                    1 February 2007,[note: 5]the BCA announced that it would\n                    release sand from its stockpiles, priced at $25 per tonne.However, only main contractors such as the Respondentwould have access to the BCA’s sand stockpiles, and under which system the\n                    BCA would supply sand directly to the main contractors (such as the Respondent)\n                    for “onward delivery” to RMC suppliers (such as the Appellant).It is therefore common ground that the Appellant had no\n                        access to the BCA’s stockpiles. The same Circular stated\n                    that the amount of concrete, grade of concrete, andconcreting sandrequired for the February weekly demand would\n                    have to be certified by the Professional Engineer of the project. It is\n                    pertinent to note that there isno mention of manufactured\n                        sand in this Circular.",
        "The Appellant’s Letter and Quotation of 1 February\n                2007": "13     The Appellant informed the Respondent by way\n                    of a letter dated 1 February 2007 that:[note: 6] the sudden announcement by Indonesia of the ban on sand, soil and topsoil\n                        exports to Singapore resulted in an immediate scarcity of materials and\n                        escalating prices that were totally beyond [the Appellant’s]\n                        control. The letter also mentioned a meeting with the Minister of National\n                    Development on 30 January 2007, where the Minister had apparently stated\n                    that the Sand Ban was an abnormal situation that was beyond anyone’s\n                    control. The Appellant stated that it had been notified by the BCA that sand\n                    would be released from the BCA’s stockpile from 1 February 2007 and\n                    that there should beconcreting sandavailable,\n                    albeit at higher prices.[note: 7]The Appellant\n                    informed the Respondent in this letter that it was unable to supply RMC at the\n                    prices agreed upon in the Contract (“the contracted prices”) due\n                    to the shortage of sand caused by the Sand Ban. In addition, the letter of\n                    1 February 2007 stated that: In light of all the factors mentioned above that is beyond our control, we\n                        have no alternative but to revise our concrete prices. Please find attached\n                        our quotation for the supply of concrete effective 1 February 2007 for\n                        your consideration. 14     The quotation referred to in this letter and\n                    attached (“the 1 February Quotation”)[note: 8]quoted prices of RMC which were\n                    30% to 50% higher than the contracted prices. The Respondent, however, did not\n                    agree to the prices stated in the 1 February Quotation, and hence did not\n                    sign the quotation.",
        "Events leading up to the implementation of the Sand Ban": "15     On 5 February 2007, a day before the Sand Ban\n                    came into effect, one of the Appellant’s sand suppliers, Huat Shua Company\n                    Pte Ltd (“Huat Shua”), informed the Appellant that it was unable\n                    to supply sand to the Appellant, and that the supply agreement between Huat Shua\n                    and the Appellant had been terminated under itsforce\n                        majeureclause with immediate effect.[note: 9]It is noteworthy that the\n                    Appellant’s other sand supplier, Bibright Shipping Pte Ltd\n                    (“Bibright”), had informed the Appellant on 2 February 2007\n                    that Bibright’s sand stockpile had been taken over by the BCA, and that\n                    Bibright could only release their concreting sand supply based on the\n                    BCA’s approval. Bibright also ceased its obligation to supply sand to the\n                    Appellant based on theforce majeureclause in\n                    their supply agreement.[note: 10] 16     By a letter dated 5 February 2007 from\n                    the Respondent to the Appellant, the Respondent stated that there would beno disruption to the supply of RMC within the meaning of\n                        cl 3, since the BCA would be releasing sand from its\n                    stockpiles in the following terms:[note: 11] Clause 3 of the ... supply contract provides that you shall be under\n                        no obligation to supply if the said supply has been disrupted by factors\n                        arising through circumstances beyond your control. However, as BCA would be releasing the government sand stock pile from\n                        1 February 2007, there would be no disruption in supply within the\n                        meaning of Clause 3. The Respondent insisted in this letter that the Appellant was\n                    therefore still obliged to supply RMC at the contracted prices.",
        "The Appellant’s letter dated 9 February 2007": "17     By a letter dated 9 February 2007, the\n                    Appellant informed the Respondent that it had no access to BCA’s sand\n                    stockpiles, as follows:[note: 12] … the Indonesian Government’s decision to ban sand exports to\n                        Singapore was totally beyond our control resulting in an immediate scarcity\n                        of materials and escalating prices. Our production was severely curtailed by\n                        the immediate shortage of materials following the announcement [of the Sand\n                        Ban] … In our effort to extend support to a good customer, we offered to try and\n                        source the sand from the open spot market. The increase in price of the\n                        concrete was to enable us to source for alternative supplies at higher\n                        prices and we sent to your company a revised quotation … on\n                        1 February 2007 [the 1 February Quotation (above at[14])] for consideration but to date have not\n                        received your acceptance. Even with the announcement by BCA on the release of national stockpiles\n                        from 1 February 2007,the mechanism implemented does\n                            not permit us to order any sand directly, further\n                        complicating our production planning. It is not our intention to disrupt supply but this is an abnormal\n                        situation that is totally beyond our control ... [emphasis added] 18     In that same letter, the Appellant explained\n                    that the increase in the prices of concrete as stated in the 1 February\n                    Quotation (see above at[14]) was to allow\n                    the Appellant to source for alternative supplies of sand at higher prices. It is\n                    common ground that the Respondent did not reply to this letter. The Appellant\n                    contended that this failure to reply demonstrates clearly that the Respondent\n                    was not willing to help the Appellant procure sand from the BCA.",
        "The BCA’s Circular dated 15 February 2007": "19     On 15 February 2007, the BCA announced\n                    that the price of sand from the stockpile would be increased to $60 per\n                    tonne from 1 March 2007.[note: 13]There was afixed limiton the amount of sand that\n                    could be released from the BCA’s stockpile because, as the BCA’s\n                    Circular stated, there was aweekly quotafor the\n                    BCA’s sand stockists. The Circular stated that the sand would be released\n                    on a “first come first serve” basis, and that once the weekly\n                    quota of sand had been reached, the BCA wouldstopreleasing sandimmediately. The Circular stated\n                    that only main contractors of projects with concreting works to be carried out\n                    in the month of February 2007 were allowed to request for sand to be released\n                    from the stockpile from February. Again, there was no mention of manufactured\n                    sand in this Circular. 20     On 26 February 2007, the Appellant wrote\n                    a letter to inform the Respondent that the supply of aggregates (another\n                    material required to manufacture RMC) had stopped. Subsequently, the BCA\n                    announced on 28 February 2007 that RMC companies (including the Appellant)\n                    could purchase aggregates from the BCA’s stockpile at a fixed price of\n                    $70 per tonne.[note: 14]",
        "The Appellant’s letter and quotation dated 1 March\n                2007": "21     On 1 March 2007, the Appellant wrote to\n                    the Respondent to inform it that the BCA had increased the price of sand and\n                    aggregates to $60 per tonne and $70 per tonne,\n                        respectively.[note: 15]The Appellant stated that they\n                    were taking steps to look for other sources of sand and aggregates, and that,\n                    “for the time being”, they had no choice but to revise the prices\n                    of RMC. The same letter informed the Respondent that the Appellant was willing\n                    to credit back to the Respondent the cost incurred for procuring sand and\n                    aggregates from the BCA, in the following terms:[note: 16] If you [the Respondent] areable toprovidethe sandand 20 mm aggregate, we willcredit back to youthe sand at\n                        S$63 per tonne delivered and 20 mm aggregate at S$73 per\n                        tonne delivered, in accordance to the BCA price. [emphasis added] 22     Attached to the same letter was a quotation\n                    (“the 1 March Quotation”).[note: 17]The price for normal mix\n                    Grade 30 concrete was stated to be $185.00 per cubic metre (about a\n                    180% increase from the contracted price of $65.00 per cubic metre for\n                    normal mix Grade 30 concrete). The unit price of Grade 40 Normal Mix\n                    Concrete and Grade 50 Normal Mix Concrete were offered in the quotation at\n                    $190.00 and $199.00, respectively.It is important to note\n                        that these were the same prices that the Respondent paid when it bought RMC\n                        from Buildmate (Singapore) Pte Ltd (“Buildmate”) in March\n                        2007(see below at[86]). The\n                    quoted prices (found in the 1 March Quotation) are reproduced, as\n                    follows: Grade 15 Normal Mix\n                                            concrete at Unit Price of $179.00Grade 30 Normal Mix\n                                            concrete at Unit Price of $185.00Grade 35 Normal Mix\n                                            concrete at Unit Price of $187.00Grade 40 Normal Mix\n                                            concrete at Unit Price of $190.00Grade 50 Normal Mix\n                                            concrete at Unit Price of $199.00",
        "The Respondent’s purchase of sand through Buildmate": "23It was revealed at the\n                        trial that the Respondent had actually supplied sand to\n                    Buildmate. Buildmate’s director, Mr Peh Ah See\n                    (“Mr Peh”), admitted that the Respondent had used Buildmate\n                    to purchase RMC from the Appellant.[note: 18]It was revealed by Mr Peh\n                    that Buildmate was not itself a source of RMC. The Respondent would supply sand\n                    to Buildmate, whereupon Buildmate would (in turn) supply the sand to the\n                    Appellant. The Appellant would buy the sand from Buildmateat\n                        the same price offered to the Respondent,viz, at $63 per tonne.[note: 19]The Appellant would\n                    then use the sand to make RMC and sell it to Buildmate.[note: 20]Buildmate would (in turn) sell\n                    the RMC and deliver it to the Respondentat the same price at\n                        which they had bought it from the Appellant, with no extra\n                        charge.[note: 21] 24     In addition, Mr Peh Chong Eng, the\n                    Respondent’s project manager, gave evidence that the Respondent had\n                    purchased Grade 40 Normal Mix concrete and Grade 50 Normal Mix\n                    Concrete from Buildmate at the unit price of S$190.00[note: 22]and\n                        S$199.00,[note: 23]respectively.These were exactly the same prices that the Appellant had\n                        quoted in the 1 March Quotation. 25     There was no evidence adduced on the\n                    commercial motivations for the Respondent to obtain RMC through Buildmate. It\n                    was undisputed that there were common directors between the Respondent and\n                    Buildmate. It was also revealed at the trial that Buildmate did not pay the\n                    Appellant for the RMC supplied by the Appellant.[note: 24]Buildmate\n                    had owed the Appellant approximately $600,000 for RMC supplied.[note: 25]However, instead of\n                    making payment, Buildmate offered to supply sand to the Appellant as a\n                    substitute for payment,[note: 26]which the Appellant\n                    refused to accept. The Appellant’s claim against Buildmate has since been\n                        settled.[note: 27]",
        "The meeting of 19 March 2007": "26     The Appellant and Respondent had a meeting on\n                    19 March 2007. The Respondent’s position is that there was no\n                    agreement arrived at between the parties at this meeting. The Appellant’s\n                    original position was that the parties had agreed to discharge the Contract and\n                    had entered into a new arrangement in which the Respondent would supply sand and\n                    aggregates to the Appellant free of charge, and in which the Appellant would\n                    supply RMC to the Respondent at a reduced price.[note: 28]The Appellant contended that\n                    the quotation dated 2 April 2007 (see below at[28]) was sent to the Respondent pursuant to what had been\n                    agreed to between the parties at the meeting of 19 March 2007. However, the\n                    Appellant has sinceshiftedfrom this position by\n                    stating that “the meeting (of 19 March 2007) failed to resolve the\n                    differences of the parties”.[note: 29]Hence, it is now common ground\n                    between the Appellant and the Respondent that there had beenno new agreementarrived at between the parties during the\n                    meeting of 19 March 2007.In the circumstances, this\n                        particular issue (or, rather, defence raised by the Appellant) at the trial\n                        is no longer an issue in the present appeal(see also above at[6]). 27     On 20 March 2007, the Respondent replied\n                    to the Appellant’s letter of 1 March 2007 and the 1 March\n                        Quotation.[note: 30]The Respondent stated that the Appellant\n                    was bound by the price agreed in the Contract. Nevertheless, the Respondent\n                    accepted,under protest, the prices of concrete in\n                    the 1 March Quotation in the following terms:[note: 31] ... in order to avoid disruption to the project…we [the Respondent]\n                        shall pay you [the Appellant] under protest, the increased price of the\n                        concrete mix as set out by you [ in the letter dated 1 March 2007]\n                        without prejudice to all our rights and objections against the increased\n                        price. 28     The Appellant sent another quotation dated\n                    2 April 2007 (“the 2 April Quotation”) to the\n                        Respondent.[note: 32]The quoted prices were\n                    lower than the contracted prices (the normal mix Grade 30 concrete was\n                    quoted at $55.00 per cubic metre).However,\n                    cl 2 of the Standard Terms & Conditions of this particular\n                    quotation stated that:[note: 33] The above [quoted] prices exclude the cost ofConcreting Sandand 20mm Aggregates which are to be supplied\n                        by [the Respondent] to [the Appellant] batching plantsfree of charge. [emphasis added] 29     The Respondent did not reply to the\n                    2 April Quotation. Instead, the Respondent wrote to the Appellant a letter\n                    dated 26 April 2007,[note: 34]which stated that Mr Oh Beng Hwa (one of the Respondent’s directors)\n                    had proposed in the meeting of 19 March 2007 that the Respondent would\n                    supply the sand and aggregates based on “the same old rate as that\n                    agreed” for the Appellant to supply RMC at the contracted prices. The\n                    same letter stated that, unless the Appellant agreed to this particular proposal\n                    by 27 April 2007, the Respondent would hold the Appellant liable for all\n                    damage suffered. 30     The Appellant replied on the same day (by a\n                    letter dated 26 April 2007), and clarified that the meeting on\n                    19 March 2007 was to discuss the possibility of the supply ofmanufactured sand(as opposed to concreting sand) and\n                        aggregates.[note: 35]The Appellant did\n                    not agree with the Respondent’s proposal and reiterated that the Sand Ban\n                    was an abnormal situation covered by the terms of the Contract (pursuant to\n                    cl 3, quoted above at[4]).",
        "The decision of the court below": "31     The Appellant relied on three defences to the\n                    Respondent’s claim. First, the Appellant claimed that the Contract had\n                    been discharged by mutual agreement at the meeting of 19 March 2007.\n                    Second, the Appellant claimed that cl 10 permitted it to terminate the\n                    Contract upon giving one month’s written notice and that it had given such\n                    notice by its letter to the Respondent dated 1 February 2007. Third, the\n                    Appellant claimed that its obligation to supply concrete at the prices\n                    stipulated in the Contract was discharged under cl 3 when the Sand Ban\n                    disrupted its supply of raw materials. 32     As also noted above (at[6]and[26]),\n                    there is no need to deal with the first defence. It is now common ground between\n                    both parties that there had been no new agreement made at the meeting of\n                    19 March 2007. 33     In so far as the second defence is concerned,\n                    we have already noted, at the outset of this judgment (above at[6]), that we find the Judge’s reasoning as\n                    well as decision in relation to the issue of termination pursuant to cl 10\n                    to be persuasive and correct. Put simply, we agree with the Judge’s\n                    finding that the Appellant’s letter of 1 February 2007 could not\n                    amount to a notice of termination within the meaning of cl 10. The Judge\n                    was clearly correct to find that the requirement of unequivocal communication\n                    from the Appellant of its intention to terminate the Contract was not satisfied,\n                    as the letter of 1 February 2007 had only made it known to the Respondent\n                    that the Appellant had “no alternative but to revise [the] concrete\n                    prices”. This phrase was ambiguous as it could have meant that the\n                    Appellant was exercising its right to suspend the supply of RMC under cl 3,\n                    and not cl 10. Indeed, the same letter of 1 February 2007 had used\n                    language which parallels that in cl 3. Paragraph 1 of the letter dated\n                    1 February 2007 (also reproduced in part above at[13]) states as follows:[note: 36] As we have notified you … the sudden announcement by Indonesia of\n                        the ban on sand…resulted in an immediatescarcity\n                            of materialsand escalating prices that were totallybeyond our control. [emphasis\n                        added] And, at paragraph 5 of the same letter, the Appellant stated, in\n                    a similar vein, thus:[note: 37] In light of all the factors mentioned above that isbeyond our control, we haveno\n                            alternative but to revise our concrete prices. [emphasis\n                        added] 34     The language just reproduced in the preceding\n                    paragraph suggests strongly that the Appellant was, in fact, referring to\n                    cl 3. The use of the phrase “scarcity of materials” parallels\n                    the phrase “shortage of material” in cl 3, while the phrase\n                    “beyond our control” is found in the language of cl 3 itself.\n                    The use of the phrase “revise our concrete prices” suggests an\n                    offer to vary contractual terms, not to terminate the contractual relationship.\n                    A reasonable interpretation would be that the Appellant was, in fact, relying\n                    upon theforce majeureclause (viz, cl 3) to cease supplying RMC to the\n                Respondent. 35     This leaves us with the remaining defence\n                    based upon cl 3 itself which, because of its vital importance to the\n                    outcome of the present appeal, is reproduced again as follows: The Purchaser must provide sufficient advance notice in confirming each\n                        order. The Supplier shall be under no obligation to supply the concrete if\n                        the said supply has beendisruptedby virtue\n                        of inclement weather, strikes, labour disputes, machinery breakdowns, riots,\n                        andshortage of material[,\n                            acts] of God or any other factorsarising\n                            through circumstances beyond the control of the Supplier.\n                        [emphasis added] 36     The Judge was of the view that the Appellant\n                    could only rely on cl 3 if the following two conditions had been\n                    met: (a)     the Appellant’s ability to\n                        supply concrete had been disrupted by any of the events mentioned in\n                        cl 3; and (b)     the event arose through circumstances beyond the Appellant’s\n                        control. 37     The Judge had no doubt that the Sand Ban was\n                    beyond the Appellant’s control. The question that the Judge focused on was\n                    whether there had been a “disruption” within the meaning of\n                    cl 3. The Judge interpreted the word “disrupt’ by reference to\n                    its ordinary meaning, as well as by considering the need to achieve a\n                    commercially viable and reasonable result (see [34] of the Judgment). On this\n                    basis, the Judge held (see [42] of the Judgment): [T]here will be a “disruption” within the meaning of\n                        clause 3 only when an event occurred that made it difficult for the\n                        defendant to supply concrete to the plaintiffbut it\n                            excluded a rise in the price of the raw materials used by the defendant\n                            to produce concrete. [emphasis added] 38     The Judge held that a price rise of raw\n                    materials was immaterial to the issue whether the supply of concrete was\n                    disrupted by a shortage of material (here sand) by reference to English case law\n                    (which will be dealt with at[51]–[52]below). 39     The Judge further held on the evidence that it\n                    was not difficult for the Appellant to supply concrete to the Respondent as it\n                    did not ask the Respondent to assist it by requesting for sand from the BCA\n                    stockpiles. In failing to make the request, the Appellant had failed to make\n                    reasonable efforts to ensure that the supply of concrete would not be disrupted.\n                    In other words, the proximate cause of the disruption in the supply of concrete\n                    was not the Sand Ban but the Appellant’s own failure to source the supply\n                    of sand from or through the Respondent. Accordingly, there was no disruption\n                    beyond the control of the Appellant within the meaning of\n                cl 3. 40     The Judge found that the Respondent had beenwilling to assistthe Appellant in this regard\n                    based on two facts,viz: (a)     the Respondent knew that, as between\n                        the parties, only it had access to BCA’s\n                    stockpiles; (b)     the\n                        Respondent had stated in its letter (to the Appellant) dated 5 February\n                        2007 (see above at[16]) that there was\n                        no disruption of supply because sand was available from the BCA\n                        stockpiles. 41     The Judge found that the fact that the\n                    Respondent had reminded the Appellant that sand was available from the BCA\n                    stockpile despite knowing that the Respondent had access to the BCA sand, and\n                    not the Appellant, demonstrated that the Respondent was willing to help the\n                    Appellant procure sand from the BCA. Further, the Judge found that the Appellant\n                    had not taken any steps to ask the Respondent to request for sand from the BCA.\n                    In the circumstances, the Judge found that the Appellant could not (unlike the\n                    Singapore High Court decision inHolcim (Singapore) Pte Ltd v\n                        Kwan Yong Construction Pte Ltd[2009] 2 SLR(R) 193\n                        (“Kwan Yong”) which related,inter alia, to an identical clause) rely on\n                    cl 3, and therefore held that the Appellant was in breach of the Contract\n                    when it failed to supply RMC to the Respondent at the contracted\n                prices.",
        "Our decision": "",
        "Issues raised": "42     There is one main – or umbrella\n                        - issue in respect of the present appeal,viz, whether or not the Appellant can avail itself of\n                    cl 3 in order to defeat the Respondent’s claim against it for breach\n                    of contract. The interpretation of cl 3 – as well as its application\n                    to the facts of the present case - raise (in turn) two\n                    sub-issues, both of which must be satisfied. 43     The first sub-issue is whether any of the\n                    events stated in cl 3 had “disrupted” the supply of concrete. The meaning of the word\n                    “disrupted” has to be ascertained before the first sub-issue can\n                    be fully determined by applying that meaning to the facts of the present\n                    proceedings. 44     The second sub-issue is whether the event (or events concerned) were\n                        “beyond the controlof” the\n                    Appellant. This raises the question of whether the Appellant is required to take\n                    all reasonable steps to avoid the operation of cl 3. The Appellant bears\n                    the burden of proof with respect to both sub-issues. 45     We will commence by setting out thegeneral legal principlesrelating to the construction\n                    and interpretation offorce majeureclauses in\n                    relation to each of the two sub-issues set out above. 46     We will then proceed to apply the general\n                    legal principles to both the construction and interpretation of the language of\n                    cl 3 itself as well as its application to the specific facts at hand. For\n                    ease of analysis and understanding, we will apply the relevant general legal\n                    principles to the specific facts intwo stages – which\n                        correspond to the two sub-issues, respectively.",
        "A preliminary point – the need to adopt a holistic\n                interpretation of both sub-issues": "47     This preliminary point arises, in no small\n                    part, because the Appellant had sought to argue that the last part of cl 3\n                    (centring on the phrase “arising through circumstances beyond the control\n                    of the Supplier”) ought to be readseparatelyfrom the rest of that particular clause so that a\n                    disruption of supply because of shortage of material whether within the control\n                    of the Appellant or not would bring cl 3 into operation. If the phrase was\n                    indeed to be read separately from the rest of cl 3, no issue would arise\n                    with regard to whether the Appellant is required to take all reasonable steps to\n                    avoid the operation of that particular clause (which, it will be recalled, is in\n                    fact the second sub-issue (see above at[44])). 48     With respect, we are unable to accept the\n                    Appellant’s argument as it is not only inconsistent with a plain reading\n                    of cl 3 itself but is also contrary to the general intent of that clause as\n                    well (reference may also be made to the English High Court decision ofFrontier International Shipping Corp v Swissmarine Corporation Inc\n                        (The “Cape Equinox”)[2005] 1 Lloyd’s\n                    Rep 390 as well asChitty on Contractsvol 1 (Sweet & Maxwell, 30th Ed, 2008)\n                        (“Chitty on Contracts”) at\n                    para 14-138). In this last-mentioned regard, it flies against all notions\n                    of commercial intent as well as commonsense to interpret cl 3 in the manner\n                    that the Appellant has just argued because it would mean that the parties\n                    intended,inter alia, even a\n                    “disruption” that was created by the Appellant itself to permit\n                    the Appellant to avail itself of the benefit of cl 3. It would take only a\n                    moment’s reflection to conclude that this could not, objectively speaking,\n                    have been the intention of the parties at the time they entered into the\n                    Contract. In the circumstances, therefore, aholisticinterpretation ought to be adopted with regard to both\n                    sub-issues.",
        "The governing or umbrella principle relating to the construction and\n                interpretation of force majeure clauses": "49     Stripped to its essence, thegoverninglegal principle in the context of the\n                    construction and interpretation offorce majeure\n                        clausesis a simple – albeit not simplistic\n                        - one that is embodied within the following statement of\n                    principle by this court inRDC Concrete Pte Ltd v Sato Kogyo\n                        (S) Pte Ltd[2007] 4 SLR(R) 413 (“RDC Concrete”) as follows (at [54]): The most important principle with respect toforce\n                            majeureclauses entails, simultaneously, a rather specific\n                        factual inquiry: theprecise constructionof\n                        the clause is paramount as it would define theprecise\n                            scope and ambitof the clause itself. The court is, in\n                        accordance with the principle of freedom of contract, to give full effect to\n                        the intention of the parties in so far as such a clause is concerned.\n                        [emphasis in original]",
        "The first sub-issue: whether or not any of the events stated in\n                cl 3 itself had “disrupted” the supply of RMC within the meaning\n                of that clause": "(1)   Interpretation of the word\n                “disrupted” 50     In order to invoke cl 3, the Appellant\n                    must demonstrate that the supply of concrete has been “disrupted” by the shortage of material. In the\n                    circumstances, therefore, the meaning of the word “disrupted” must\n                    first be ascertained. Although there is, to the best of our knowledge, no case\n                    law in the Commonwealth (apart from the decision in the court below) with\n                    respect to the meaning of the word “disrupted”, it is nevertheless\n                    useful to have regard to prior decisions which have interpretedsimilarwords used in the context offorce majeureclauses (for example, the word\n                    “hindered”). These decisions are helpful in so far as they furnish\n                    guidance on thegeneral meaningnot only of the\n                    word itself but also ofotherwords (in this\n                    latter respect, from a comparative perspective). The ascertainment of such\n                    general meaning itself isnot, of course,\n                    conclusive simply because theapplicationof that\n                    meaning to theoverall languageof theforce majeureclauseas well as to\n                        the precise factual contextis of signal\n                importance. 51     In the recent Hong Kong Court of Final Appeal\n                    decision ofGoldlion Properties Limited v Regent National\n                        Enterprises Limited[2009] HKCFA 58 (“Goldlion Properties”), the appellant, in order to\n                    invoke theforce majeureclause, had to\n                    demonstrate that it was unable to complete the sale of the property concerned\n                    due to any matter which in the appellant’s reasonable opinion\n                    “materially hinders, prevents or obstructs” the completion of the\n                    sale. Ribeiro PJ (with whom Nazareth and Brennan NPJJ agreed, Bokhary\n                    and Chan PJJ delivering a joint (and separate) concurring judgment),\n                    endorsed the House of Lords decision ofTennants\n                        (Lancashire), Limited v C S Wilson and Company, Limited[1917] AC 495 (“Tennants”).\n                    Ribeiro PJ cited with approval (at [82]) a passage fromTennantsto the effect that “‘[p]reventing’\n                    delivery means ... rendering delivery impossible” and\n                    “‘hindering’ delivery means something less than this, namely,\n                    rendering delivery more or less difficult, but not impossible” (perLord Atkinson, at 518). Ribeiro PJ further\n                    observed that: [a]s a matter of language, it is clear that the word\n                        “hinders” sets a substantially lower threshold than the word\n                        “prevents” (with the word “obstructs” occupying\n                        a position perhaps somewhere in between) (See alsoGoldlion Propertiesat [94]).\n                    Ribeiro PJ did, however, also refer (at [82]) to the observations of\n                    Earl Loreburn inTennants(at 510), observing\n                    that the learned law lord “put the bar somewhat higher, interpreting\n                    ‘hindering’ to mean “interposing obstacles which it would be\n                    really difficult to overcome”; however, the learned judge proceeded to\n                    observe (also at [82]) that, nevertheless, “‘hindering’ wason any view nota concept requiring the\n                    supplier to show that some contingency hadpreventeddelivery” [emphasis added]. We agree that the\n                    word “prevented” connotes a much higher degree in relation to\n                    obstacles to performance of the contract compared to the word\n                    “hindered”. 52     We also note thatTennantsalso laid down the (related) general principle to the\n                    effect that even a great or huge increase in price wouldnot, in and of itself, constitute a “hindrance”.\n                    It is not, however, altogether irrelevant. As Lord Dunedin observed inTennants(at 516): Price may be evidence, but it is only one of many kinds of evidence as to\n                        shortage. If the appellants had alleged nothing but advanced price they\n                        would have failed. But they have shown much more. They have shown a total\n                        failure of what after all was the main source of supply to their business\n                        … All these principles were also endorsed and applied in another English\n                    decision that has often been cited together withTennants,viz, the English Court\n                    of Appeal decision ofPeter Dixon & Sons, Limited v\n                        Henderson, Craig & Co, Limited[1919] KBD 778\n                        (“Peter Dixon”). 53     We pause to observe, in this regard, that\n                    whilst a mere increase in price is generally insufficient (in and of itself) to\n                    constitute a “hindrance” or “prevention”, we leave\n                    open the issue as to what the legal position would be if the increase in price\n                    isastronomical(cfthe reference by Denning LJ in the English Court of Appeal decision ofBrauer & Co (Gt Britain), Ltd v James\n                        Clark (Brush Materials), Ltd[1952] 2 Lloyd’s\n                    Rep 147 at 154 (“Brauer”) to\n                    the fact that, if in that case, the price increase wasone\n                        hundred timesas much as the contract price, then “that\n                    would be a “fundamentally different situation” which had\n                    unexpectedly emerged, and he [the seller] would not be bound to pay [for the\n                    licence concerned]”). Indeed, the general legal principle in relation to\n                    a mere increase in price in the context of whether or not a\n                    “hindrance” or “prevention” has occurredvis-à-visaforce majeureclause mirrors the general principle in relation to the common law doctrine of\n                    frustration (under which, generally speaking, a mere increase in price willnotconstitute a frustrating event (cfalsoRDC Concrete(at\n                        [70]-[74])). Indeed, even in so far as the latter general\n                    principle is concerned, at least two judges in the House of Lords decision ofTsakiroglou & Co Ltd v Noblee Thorl\n                        GmbH[1962] AC 93,viz,\n                    Lord Reid and Lord Hodson, appeared to at least briefly hint that\n                    increased costs might constitute a possible ground for frustration where they\n                    were so extreme as to be “astronomical” (at 118 and 128–129,\n                    respectively) – a proposition that, in fact, appears to find some support\n                    in the local context in the decision of this court inGlahe\n                        International Expo AG v ACS Computer Pte Ltd[1999]\n                    1 SLR(R) 945 (especially at [24]). 54     As mentioned above, the crucial word in the\n                    context of the present proceedings is “disrupt”. From linguistic\n                    as well as logical and contextual perspectives, it is clear, in our view, that,\n                    like the word “hinder”, the word “disrupt” doesnotmean “prevent”. In the same\n                    vein, an increase in costs alone will not constitute a\n                    “disruption”. More specifically, however, what (general) meaning\n                    ought to be attributed to the word “disrupt”, bearing in mind the\n                    fact that the particular factual matrix and context will also need to be\n                    considered by the court before arriving at a final decision in any given\n                    case? 55The Oxford English\n                        Dictionary(2nd Ed, Clarendon Press, Oxford, 1989)\n                        (“OED”) defines the word\n                        “disrupt” (at p 832) as\n                    follows: “To break or burst asunder; to break in pieces, shatter; to\n                    separate forcibly”. The same work defines the word “hinder” (at p 242) in various ways,\n                    including the following: “To put or keep back”; “To do harm\n                    to; to injure, impair, damage”; and “To keep back, delay, or stop\n                    in action; to put obstacles in the way of; to impede, deter, obstruct,\n                    prevent”. Although there is, in the last-mentioned phrase, a reference to\n                    the word “prevent”, that word itself\n                    is defined in theOEDquite differently (as is to\n                    be expected since the presumption is that no word in the English language ought\n                    to be redundant) and,inter alia, as follows (at\n                    p 445): “To forestall, balk, or baffle by previous or precautionary\n                    measures”; “To cut off beforehand, debar, preclude (a person or\n                    other agent)from, depriveofa purpose, expectation, etc.”; and (perhaps, most\n                    appropriately, having regard to the legal context as well as case law considered\n                    above) “To frustrate, defeat, bring to nought, render void or nugatory\n                    (an expectation, plan, etc.)” [emphasis in original]. 56     The definitions of the words\n                    “disrupt” and “hinder” are – at a general\n                    level at least – not dissimilar. Both words connote a lower degree of\n                    negativity compared to the word “prevent”. And, perhaps more\n                    importantly, both words suggest a datum measure of difficulty that interferes\n                    with the successful completion of the transaction concerned. However, unlike a\n                    situation involving “prevention”, the “disruption”\n                    or “hindrance” does not render further performance by one party\n                    (or both parties) impossible (which would be akin to a situation of (legal)\n                    frustration). It is also clear that difficulty that manifests itself in the form\n                    of an increase in costs is – in and of itself – insufficient to\n                    result in a finding of “disruption” or “hindrance”.\n                    However, the level of guidance at this point is, unfortunately, not very\n                    helpful. One can explain this, in part, by the fact that there are myriad\n                    situations of “disruption” or “hindrance”.\n                    Nevertheless, we are of the view that a further (if minimal) attempt at defining\n                    what might constitute a “disruption” or “hindrance”\n                    would be helpful. In this regard, where acommercial\n                        transactionis involved, the process of ascertaining whether or\n                    not a particular set of circumstances constitutes a “disruption”\n                    or “hindrance” within the meaning of theforce\n                        majeureclause concerned ought to be informed by considerations\n                    ofcommercial practicability(bearing in mind, of\n                    course, the particularcontextin which the\n                    contract had been entered into (including any relevant\n                        commercial practice in the trade and/or resultant dislocation in the\n                        trade)). Hence, if, for example, events occurred which, whilst\n                    not preventingliteralperformance of the contract\n                    as such, were such as would render continued performance commercially\n                    impractical, there would, in our view, generally be a “disruption”\n                    or “hindrance” within the meaning of theforce\n                        majeureclause in question. Still less would those events need to\n                    render further performance of the contractimpossible, which would be more akin to a situation of\n                    “prevention” (as explained above). 57     The following observations by\n                    Earl Loreburn inTennants(at 510–511)\n                    may also be usefully noted: To place a merchant in the position of being unable to\n                            deliver unless he dislocates his business and breaks his other contracts\n                            in order to fulfil one surely hinders delivery. In my view this hindered delivery. It did not prevent delivery or make it\n                        impossible, but it hindered delivery within the meaning of the contract now\n                        under consideration ... [emphasis added] 58     In a similar vein, we would also note the\n                    following observations by Swinfen Eady MR inPeter\n                        Dixon(at 785): [I] think in substance the question is this: Having regard to the facts as\n                        set out in the award, was there evidence upon which the arbitrators as\n                        reasonable men could come to the conclusion at which in fact they arrived?Having regard to the general dislocation of trade, to\n                            the need for entering into fresh contracts to obtain tonnage, to the\n                            fact that all standing contracts by all parties in the trade were no\n                            longer able to be carried out, I am of opinion that upon these facts\n                            much more than merely an increase in price was proved, andit is no answer to say to the sellers: “It was\n                            possible to carry out your contract and you could have got rid of the\n                            obstacle or difficulty by obtaining tonnage at an increased price, or by\n                            paying Beckers an increased sum for them to supply\n                            you.”In my judgment\n                        there was ample evidence before the arbitrators on which they could arrive\n                        at the conclusion, at which they did in fact arrive, that the sellers were\n                        hindered in the delivery of the pulp within the meaning of the contract.\n                        [emphasis added] And the following observations by Bankes LJ in the same case (at\n                    786) are also helpful: I think two rules were certainly laid down in that case [viz,Tennants]. One\n                        was thata rise in price would not in itself constitute a\n                            hindranceto delivery within the meaning of such a contract\n                        as this;andI think thesecond rule may be gathered from the language of Lord\n                            Dunedin[inTennants; see also\n                        above at [52]], where, in speaking of the judgment of Neville J.,he says … that the learned judge read the word\n                            “hinder” “in the general sense of in any way\n                            affecting to an appreciable extent the ease of the usual way of\n                            supplying the article…..”[emphasis\n                        added] 59     Another illustration may be found in the House\n                    of Lords decision ofOwners of Steamship Matheos v Louis\n                        Dreyfus and Company[1925] AC 654 (“Louis Dreyfus”). Although this particular decision\n                    related to a prohibition clause, the same general points of principle would be\n                    applicable. InLouis Dreyfus, the plaintiff\n                    shipowner brought a claim against the defendant charterer for demurrage. The\n                    charterer was unable to load goods onto the vessel owing to a severe frost which\n                    had caused the dock to be completely frozen over. The charterer relied upon a\n                    clause in the charterparty which effectively suspended the charterer’s\n                    obligation to load goods under circumstances where there had been\n                    “detention by frost or ice”. The shipowner argued that that clause\n                    could not be invoked by the charterer as it was still possible to load the goods\n                    onto the vessel by the use ofmanual labour. The\n                    House rejected this argument. In particular, Viscount Cave LC was of the\n                    view (at 660) that, given the icebound conditions, “loading by hand\n                    during the frost was in the commercial sense impracticable”. Indeed, the\n                    expenses of manual loading were prohibitive, the charterers would run the risk\n                    of losing the goods and no insurer would have been willing to cover such a\n                    dangerous method of loading. More generally, however, this is merely an\n                    illustrative situation and much would (as was already alluded to above) depend\n                    upon the precise factual matrix. However, thegeneral\n                        principleas such seems to us to be not only sound but also just\n                    and fair. (2)   Whether the present circumstances, seen in its commercial\n                context, present sufficient difficulty to constitute a “disruption”\n                within cl 3 60     The circumstances in the present case did\n                    present considerable difficulties for the Appellant. First, it is undisputed\n                    that, since the Indonesian Government announced the Sand Ban, the BCA had\n                    implemented a system that only entitled contractors (such as the Respondent) to\n                    have access to the BCA’s sand stockpiles (see also above at[12]). The Appellant hadnoaccess to these stockpiles. Secondly, when the Sand Ban came\n                    into effect, the Appellant’s own sand suppliers, Bibright and Huat Shua,\n                    stopped supplying sand to the Appellant and relied upon theforce majeureclauses found in their respective supply contracts\n                    (see above at[15]). The situation was\n                    exacerbated by the fact that Bibright’s sand stockpile at the Tuas\n                    Aggregate Terminal had beentaken over by the\n                        BCA,[note: 38]with the result that Bibright\n                    Shipping could only release sand with the BCA’s approval and could no\n                    longer supply sand to the Appellant. 61     Thirdly, even if the Respondent were to help\n                    procure sand from the BCA’s sand stockpiles, there wasno guaranteethat the Respondent would have received the\n                    requisite quantities of sand. This was confirmed by Mr Ng Cher Cheng, the\n                    deputy director of procurement policies department at the BCA.[note: 39]Further, there was afixed limiton the amount of sand that could be released from\n                    the BCA’s sand stockpiles. The BCA’s circular dated 16 February\n                        2007[note: 40]stated\n                    that there was aweekly quotafor the BCA’s\n                    sand stockists. The circular stated that the sand would be released on a\n                    “first come first serve” basis, and that once the weekly quota of\n                    sand had been reached, the BCA wouldstopreleasing sandimmediately(see also above at[19]). In addition, the BCA circular\n                    dated 1 February 2007[note: 41]stated that only projects with concreting works to be carried out in the month\n                    of February 2007 were allowed to request sand to be released from stockpile from\n                    February. 62     Given the above circumstances, there can be no\n                    doubt that there were sufficient difficulties to constitute a\n                    “disruption” within the meaning of cl 3. The\n                    Appellant’s traditional sources of sand from Indonesia were effectively\n                    cut off by the system implemented by the BCA as well as by the reliance by its\n                    own suppliers upon theforce majeureclauses in\n                    their respective contracts with the Appellant (noting that the BCA had in fact\n                    taken over one of the supplier’s sand stockpiles). Given that the BCA only\n                    granted access of sand supplies to main contractors, these contractors\n                    (including the Respondent) would be in a “monopolistic” position.\n                    The Respondent could take advantage of its position to charge an exorbitant\n                    price for its services in assisting to procure sand from the BCA. Under these\n                    circumstances, the Appellant was faced with two stark choices. If it had chosen\n                    to stop performing the Contract, it would have been liable for damages to the\n                    Respondent (assuming that cl 3 did not apply). If it had chosen to perform\n                    the Contract by supplying concrete at the contracted prices, it would have\n                    fallen prey to any potential exorbitant demands of main contractors who had\n                    access to sand supplies. This left the Appellant in the unsatisfactory situation\n                    in which the Respondent could insist that the Appellant adhere to the Contract\n                    (thus obtaining RMC at pre-Sand Ban prices) and, at the same time, earn a profit\n                    for its services of procuring sand from the BCA. If the Appellant was to adhere\n                    to its contractual obligations, it would have had no choice but to seek sand\n                    supplies from the Respondent for whatever price the Respondent might have\n                    charged for it. Such a commercially impracticable situation constituted, in our\n                    view, a “disruption” within the meaning of cl 3. It must be\n                    cautioned that this analysis is not focused on the prices of sand but, rather,\n                    on the difficulties faced by the Appellant in the present overall commercial\n                    context. Further, it did not matter whether the Respondent did in fact seek\n                    exorbitant prices for its services in procuring sand (in this regard, and as\n                    will be seen below, the Respondent did not even offer to help procure sand from\n                    the BCA for the Appellant). It was sufficient that the Appellant was placed in a\n                    commercially impracticable situation, as explained above. 63     The Respondent did contend (in passing and\n                    without argument or evidence)[note: 42]that the Appellantcould haveobtained sand from\n                    countries other than Indonesia. Although it can be said that it waspossiblefor the Appellant to procure sand from\n                    non-traditional sources, it would have been commercially impracticable to do so,\n                    given that cl 15 of the Contract (“cl 15”) (see above at[10]) envisaged orders exceeding 100\n                    cubic metres of concrete to be deliveredwithin two\n                        daysafter the order has been placed, and the Appellant would not\n                    have been able to do so if it had had to seek supplies of sand from\n                    non-traditional sources. This commercial impracticability is reinforced by the\n                    fact that cl 15 provided that the Appellant must accept all orders for\n                    concrete. Indeed, the present situation may have gone beyond that of commercial\n                    impracticability. Given that it would beimpossibleto deliver concrete to the Respondent within two days\n                    even if the Appellant had sought alternative sources of sand from\n                    non-traditional sources, a case of frustration would have been made out had it\n                    been pleaded and argued in the Court below. We surmise that this was perhaps why\n                    the Appellant sought to amend its pleadings to include an alternative defence in\n                    frustration (although this has not been allowed for the reasons stated in[103]–[105]below). 64     We are therefore, of the view that the clear\n                    shortage of sand resulting from the Sand Ban had created genuine difficulties so\n                    as to constitute a “disruption” within the scope and meaning of\n                    cl 3. However, as already noted above, this is not an end to the matter in\n                    so far as the present appeal is concerned. We need now to turn to considerthe second sub-issue,viz, whether or not the event (or events concerned) were\n                        “beyond the controlof” the\n                    Appellant.",
        "The second sub-issue: whether or not the event was “beyond the\n                control of” the Appellant": "(1)   Is there an independent legal principleinherent in allforce majeureclauses to the effect that the affected\n                party, in order to avail itself of the benefit of theforce\n                    majeureclause, must have taken all reasonable steps to avoid theforce majeureeffects of the event in\n                question? 65     An interesting legal issue that arises in the\n                    context of the present proceedings in general and the second sub-issue in\n                    particular is whether or not there is, as Ribeiro PJ put it inGoldlion Properties(at [98]), “a free-standing\n                    legal principle” to the effect (as counsel for the respondents argued,\n                    relying on the English decision ofChannel Island Ferries Ltd\n                        v Sealink UK Ltd[1988] 1 Lloyd’s Rep 323\n                        (“Channel Island Ferries”))\n                    that: ... there isinherentin the concept of aforce majeureclause the principle that\n                        the person who seeks to rely upon it must prove that, even if a qualifying\n                        event had occurred which could materially impede or hinder completion,such person had taken all reasonable steps to\n                            avoidthe force majeure effects of that event. [emphasis\n                        added in italics and bold italics] The learned judge was of the view – in no uncertain terms\n                    – that such a legal principle didnotexist;\n                    as he observed (at [99]): I am unable to accept that argument. I see no juridical basis for positing\n                        any free-standing legal principle of the type urged. What conditions must be\n                        satisfied for a party to bring himself within a force majeure clause depends\n                        simply on its construction and, properly understood,Channel Island Ferriessays nothing different. 66     We agree with these observations of\n                    Ribeiro PJ inGoldlion Propertiesthat there\n                    cannot be any blanket principle to the effect that there is a requirement to\n                    take all reasonable steps before theforce majeureclause can be relied on (which language embodies the intention of the parties\n                    themselves). In this regard, we note that the proposition stated inChitty on Contracts(at para 14-140) supports such\n                    a blanket principle: It is for a party relying upon a force majeure clause to provide the facts\n                        bringing the case within the clause ... He must further prove ... that there\n                        were no reasonable steps that he could have taken to avoid or mitigate the\n                        event or its consequences. In our view, this proposition is too wide. Whether the affected party\n                    must have taken all reasonable steps before he can rely on theforce majeureclause depends, in the final analysis, on\n                    the precise language of the clause concerned. Nevertheless, it might well be the\n                    case that,at least where the clause in question relates to\n                        events that must be beyond the control of one or more of the parties, then\n                        the party or parties concerned ought to take reasonable steps to avoid the\n                        event or events stipulated in the clause. In such a situation (as\n                    is in fact the case in the present proceedings), there is, in our view, a\n                    persuasive case for requiring the affected party to take reasonable steps to\n                    avoid the effects of the event in question. The rationale for this approach is a\n                    simple and commonsensical one:to the extent that the party\n                        or parties concerned do not take reasonable steps to avoid the event or\n                        events in question, it cannot be said that the occurrence of the event or\n                        events was beyond the control of the party or parties concerned – in\n                        which case the clause would not apply. In this regard, it is\n                    pertinent to note that in cases where it was held that the affected party was\n                    required to take reasonable steps to avoid the effects of the event in question\n                    before it could rely on theforce majeureclause\n                    (see, for example,RDC Concreteat [64];Channel Island Ferries Ltd v Sealink UK Ltd[1987]\n                    1 Lloyd’s Rep 559 at 570; and the English Court of Appeal\n                    decision ofB & S Contracts and Design Ltd v\n                        Victor Green Publications Ltd[1984] ICR 419), the legal issue\n                    that arose centred onforce majeureclauses which\n                    related to events specified therein that werebeyond the\n                        control of the party concerned. It should also be noted that\n                    these cases were also decided with respect to the precise factual matrix\n                    concerned in general and on the construction of the precise language of eachforce majeureclause in particular. We would\n                    observe, parenthetically, that there are resonances here with the principle\n                    under the doctrine of frustration that there can beno\n                        self-induced frustration. Indeed, the proscription against\n                    self-induced frustration has a similar rationale inasmuch as it is necessary, in\n                    order for the doctrine of frustration to operate, thatneithercontracting party is at fault. 67     However, the focus ought to be on the\n                    substance as opposed to the form. Hence, in the English High Court decision ofTrade and Transport Incorporated v Iino Kaiun Kaisha Ltd\n                        (The Angelia)[1973] 1 WLR 210, for example, the court held,inter alia(and, as it turned out, by way ofobiter dicta), that the party concerned ought\n                    to have taken steps to ascertain (and therefore discovered) the non-availability\n                    of vehicles before the contract was concluded and could not avail itself of theforce majeureclause as a consequence. Theforce majeureclause itself referred,inter alia, to “unavoidablehindrances” as well as to “hindrances\n                    happeningwithout the fault of the charterer[the\n                    party seeking to rely on theforce majeureclause\n                    in this particular case], shippers or suppliers of\n                        cargo” [emphasis added] (reference may also be made to the\n                    English High Court decision ofBolckow, Vaughan, and Co v\n                        Compania Minera de Sierra Manera(1916)\n                    114 LT 758). 68     In so far as the exception referred to above\n                    (at[66]) is concerned, one might argue that\n                    it isinherentwithin the meaning of concepts such\n                    as “hinder” and “prevent” in the context offorce majeureclauses that such concepts would\n                    only operate in a situation where the event or events concerned arebeyond the controlof the party or parties concerned.\n                    Alternatively, it might be argued that the requirement to take reasonable steps\n                    ought to be established based on theinterpretation of the\n                        precise language of the clause itself(cf, for example,Brauer). The\n                    former is analogous (albeit not identical to) a “term implied inlaw”, whilst the latter is analogous\n                    (albeit, again, not identical to) a “term implied infact” (and see generally the local decisions ofForefront Medical Technology (Pte) Ltd v Modern-Pak Private\n                        Ltd[2006] 1 SLR(R) 927 (at\n                    [29]-[44]) andJet Holding Ltd v Cooper\n                        (Singapore) Pte Ltd[2006] 3 SLR(R) 769 (at\n                        [89]-[91]) with regard to the relationship between these\n                    two categories of implied terms). Indeed, the latter argument is consistent with\n                    the more general approach adopted by Ribeiro PJ inGoldlion Properties(see above at[65]). However, we do not need to express a concluded view on\n                    the former argument in the present appeal, particularly in the light of the view\n                    we have just expressed – in the preceding paragraph -\n                    with regard to thenarrowersituation (where thereisanexpressreference to the event or events concerned beingbeyond the\n                        controlof the party or parties concerned). It is interesting,\n                    however, to note that Ribeiro PJ, inGoldlion\n                        Properties, was of the view (at[100]) thatChannel Island Ferrieswas distinguishable on the basis that that case related to the “prevention” – andnotthe “hindrance”\n                    - of the contractual performance; in the learned\n                    judge’s words (at [102]): One can readily accept that if the wording of a force majeure clause makes\n                        it operative only if the qualifying event has prevented performance it is\n                        necessarily implicit that the clause does not apply if performance could in\n                        fact have been rendered by the taking of reasonable steps. Such a clause\n                        justifies a construction which places an obligation on the party relying on\n                        it to show that he has taken all reasonable steps to render performance. But\n                        no such obligation is implicit in the proposition that a particular matter\n                        has materiallyhinderedperformance. [emphasis\n                        in original] 69     With respect, although the above reasoning is\n                    not unpersuasive, we are of the view that such an approach is too narrow and\n                    that, even in a situation where there is merely “hindrance” of\n                    performance, the party relying on theforce\n                        majeureclause concerned ought also to be required to show that\n                    it has taken all reasonable steps to avoid the event or events concernedifthere is the requirement that the event or\n                    events must be “beyond the control”\n                    of that particular party. 70     We pause to observe – parenthetically\n                    – that it might well be the case that the majority offorce majeureclauses would incorporate (in substance and/or\n                    form) the requirement that the event or events concerned must bebeyond the controlof the party or parties concerned. If\n                    so, then the requirement to take reasonable steps might well be the rule rather\n                    than (as alluded to above at[66]) the\n                    exception. However, whatever theactualposition,\n                    thegeneral principleis, in our view, clear. To\n                    reiterate,where the clause in question relates to events\n                        that must be beyond the control of one or more of the parties, then the\n                        party or parties concerned ought to take reasonable steps to avoid the event\n                        or events stipulated in the clause. However, absent this\n                    particular situation, this requirement to take reasonable steps isnotablanketone as such\n                    and whether or not such a requirement obtains in the particular situation at\n                    hand would depend on the precise language of the clause itself (which language\n                    embodies the intention of the parties themselves). 71     Where the affected party seeking to rely upon\n                    theforce majeureclause must takereasonable stepsto avoid the event or events stipulated\n                    in theforce majeureclause, whether he has done\n                    so will, of course, bea question of fact; it is\n                    alsonotanabsolute\n                        dutyasonly reasonable stepsneed\n                    to be taken. We are here in the sphere of theapplicationof the law to the precise factual matrix concerned.\n                    Hence, in the Singapore High Court decision ofMagenta\n                        Resources (S) Pte Ltd v China Resources (S) Pte Ltd[1996]\n                    2 SLR(R) 316, for example, it was held that there was no duty to\n                    mitigate; as S Rajendran J observed (at\n                    [96]-[97]): 96    The present case is clearly one where arrangements\n                            by a supplier higher up the string to ship the goods had already been\n                            made when the delay by reason offorce\n                                majeurehappened. There was, therefore, no obligation on\n                            the part of the plaintiffs to try and obtain the requisite urea through\n                            an alternative source. 97    But even apart from the fact that this was a case\n                            where the contract with the suppliers higher up the chain had been\n                            entered into at the time of theforce\n                                majeure, this was not a contract under which the sellers\n                            were at liberty to buy goods afloat. The plaintiffs here were not merely\n                            obliged to deliver prilled urea of USSR origin but were in addition\n                            required to (a) mark the goods with specific shipping marks\n                            provided by the defendants; (b) ship the goods only in certain\n                            vessels not specifically prohibited by the contract; and (c) ship the\n                            goods from a specified port. I agree with the submission of the\n                            plaintiffs that, in such a situation, there was no question of buying\n                            goods afloat. This is further reinforced by the fact that the contract\n                            here was not a CIF contract since, by the contract, the defendants were\n                            to provide insurance for the goods from the port of\n                        loading. (2)   Application to the facts of the present appeal (A)   The Issue 72     The issue is, in essence, a simple one. Given\n                    the fact that cl 3 expressly stipulates that the shortage of material\n                    (here, sand to manufacture concrete) must have arisen through circumstances\n                    beyond the Appellant’s control in order for the clause to operate, the\n                    burden is on the Appellant to show that it had taken all reasonable steps to\n                    avoid the operation of cl 3. We are of the view that there is sufficient\n                    evidence to demonstrate that the Appellant had, on the balance of probabilities,\n                    taken reasonable steps to avoid the operation of cl 3. Let us\n                    elaborate. (B)   Reasonable steps taken by the Appellant but rejected by the\n                Respondent 73     It is common ground that when the Sand Ban\n                    came into effect, the BCA implemented a mechanism in which only main contractors\n                    (such as the Respondent) would have access to BCA’s sand stockpiles. The\n                    Appellant had no access to the BCA’s sand stockpile. The Appellant took\n                    the effort to notify the Respondent of this fact, by way of its letter dated\n                    9 February 2007 (reproduced above at[17]),[note: 43]which clearly\n                    informed the Respondent that the mechanism implemented by the BCA meant that the\n                    Appellant could not have access to the BCA’s stockpiles. However, the\n                    Respondent’s lack of willingness to assist the Appellant is demonstrated\n                    by the fact that the Appellant’s letter of 9 February 2007 was\n                    ignored. It is undisputed that there was no response to this letter. If the\n                    Respondent had been willing to help procure sand from the BCA, it would have\n                    replied to this letter. This is in stark contrast to the mechanism implemented\n                    by the BCA in which it had encouraged contractors to assist in the procurement\n                    and supply of sand to RMC companies, by way of its “onward\n                    delivery” mechanism as stated in the BCA’s Circular dated\n                    1 February 2007. 74     In addition, the Appellant had written a\n                    letter dated 1 March 2007 (see above at[21]) in which it had offered to credit back to the Respondent\n                    the cost of the sand, calculated at $63 per tonne of sand in accordance to\n                    the BCA price, if the Respondent was able to provide the Appellant with sand\n                    (“the Appellant’s offer”).[note: 44]This was,in\n                        substance, as good as a requestfor the Respondent to help\n                    procure sand from the BCA stockpiles. However, the Respondent simply ignored the\n                    Appellant’s request. 75     The Judge, however, was unconvinced that the\n                    Respondent’s rejection of the Appellant’s offer meant that the\n                    Respondent was unwilling to help supply sand to the Appellant. In particular,\n                    the Judge was concerned that the Appellant’s offer to credit back the\n                    costs of procuring sand had a catch – the offer included a rise in the\n                    price of concrete found in the 1 March Quotation.[note: 45]In this regard,\n                    the Judge observed as follows (see the Judgment at [50]–[52]): 50    ... the [Appellant] claimed that it had made an\n                            offer to the [Respondent] on 1 March 2007 indicating that it would\n                            credit back to the [Respondent] the cost of any sand and aggregates that\n                            the [Respondent] was able to provide at $63 per ton and\n                            $73 per ton respectively. The gist of the [Appellant’s]\n                            argument seemed to be that the [Respondent’s] rejection of its\n                            offer showed that the [Respondent] was unwilling to help the [Appellant]\n                            apply for BCA sand for the manufacture of concrete. 51    I reject the [Appellant’s] argument. The\n                            [Appellant’s] offer of crediting back the cost of any sand and\n                            aggregates provided by the [Respondent] was premised on the assumption\n                            that the [Respondent] would obtain the supplies from the BCA, since its\n                            offer price of $63 and $73 tracked the BCA price ($60 and $70\n                            respectively excluding the cost of delivery). Had this been a standalone\n                            offer which the [Respondent] rejected, I would have regarded it as\n                            strong evidence that the [Respondent] was unwilling to help the\n                            [Appellant] apply for sand from the BCA stockpile.However, the [appellant’s] offer had a catch – it\n                                included a rise of almost 200% in the price of concrete as compared\n                                to the prices stated in the Contract. 52The [Appellant] had no right to\n                                impose higher prices of concrete on the [Respondent]. The common\n                                thread that ran through the cases cited earlier is that a rise in\n                                the price of raw materials is not sufficient to trigger a force\n                                majeure clause like clause 3. If the [Respondent] was willing to\n                                assist the [Appellant] by applying for BCA sand (where the\n                                [Appellant] pays for the BCA sand), the [Appellant] was\n                            obliged to accept the sand and perform the Contract without imposing\n                            further conditions .... [emphasis added] 76     In our view, and with respect, we find (from\n                    the Judge’s observations quoted in the preceding paragraph, in particular,\n                    those portions that have been emphasised) that the Judgeconflatedseveral questions. There are in fact three separate\n                    questions raised in the Judge’s observations: (a)     Whether the Appellant has the right\n                        to impose higher prices for concrete; (b)     Whether a rise in the price of sand is sufficient to\n                        trigger aforce majeureclause;\n                    and (c)     Whether the\n                        Respondent had demonstrated its willingness to assist the Appellant to\n                        procure sand. As we will elaborate upon in a moment, the\n                    only question that ought to have been addressed by the Judge was the one in (c)\n                    above. 77     In our view, whether the Appellanthas the rightto impose higher prices for concrete (see\n                    [76(a)] above) is irrelevant at this particular stage. This question is onlyconsequentialupon therealinquiry, which is whether the Appellant can invoke\n                    cl 3 in the first place (see [76(b)] above). If the Appellant can invoke\n                    cl 3, the Respondent and Appellant are discharged from performing their\n                    contractual obligations under the Contract and are free to form a new contract\n                    with new prices. Hence, whether the Appellant has a right to impose higher\n                    prices for concrete cannot assist us in determining whether the Appellant can\n                    avail itself of the benefit of cl 3, for that is the very question which\n                    the present inquiry seeks to answer. 78     As explained earlier (at[42]–[44]), whether the Appellant can avail itself of the benefit of\n                    cl 3 is dependent on whether the circumstances constituted a\n                    “disruption” within the meaning of cl 3,andwhether the shortage of material was beyond the\n                    appellant’s control. We have already explained (at[50]–[53]) that a mere increase in price is insufficient to trigger\n                    cl 3 in so far as it is ordinarily insufficient to constitute a\n                    “disruption”. We have, however (at[53]), left open the issue as to what the legal position would\n                    be if the increase in price wasastronomical. In\n                    addition, we have determined earlier (at[60]–[64]) that the\n                    present circumstances were sufficiently difficult to constitute a\n                    “disruption” within the meaning of cl 3. 79     In so far as the second sub-issue as to\n                    whether the shortage of material was beyond the Appellant’s control is\n                    concerned, a vital question would be whether the Appellant had taken reasonable\n                    steps to avoid the effects caused by the shortage of material. In this regard,\n                    one specific question is whether the Respondent was willing to assist the\n                    Appellant to procure sand from the BCA (see [76(c)] above). As is evident from\n                    the Judge’s observations above (at[75]), the Judge was concerned that the Appellant’s offer\n                    had included a 1 March Quotation with increased prices of concrete. We\n                    would be inclined to agree with the Judge if the Respondent had rejectedboththe increased prices offered in the\n                    1 March Quotationas well asthe\n                    Appellant’s offer to credit back the cost of obtaining sand. If the\n                    Respondent had indeed rejected the 1 March Quotation, it would have been\n                    consistent with the Judge’s concern that the Respondent did not agree to\n                    the Appellant’s offer because it would have been forced to accept the\n                    increased prices in the quotation.However, the\n                    Judge didnot, with respect, consider the fact\n                    that the Respondent hadindeed acceptedthe prices\n                    in the 1 March Quotation as evidenced in the Respondent’s letter\n                    dated 20 March 2007[note: 46]in which the Respondent agreed\n                    to pay the increased prices set out in the 1 March Quotation. Even though\n                    the Respondent had accepted the increased prices, itdid not\n                        respondto the Appellant’s offer in the 1 March 2007\n                    letter tocredit backthe Respondent the costs of\n                    procuring sand from the BCA. The 1 March Quotation wasattached tothe 1 March 2007 letter which contained the\n                    Appellant’s offer.[note: 47]Having accepted the\n                    prices offered in the 1 March Quotation, the only reason why there was no\n                    response to the Appellant’s offer, read together with the similar\n                    “silence” from the Respondent after receiving the\n                    Appellant’s letter of 9 February 2007,[note: 48]is\n                    that the Respondent had been unwilling to help the Appellant procure sand from\n                    BCA. 80     It is important to emphasise that the\n                    Appellant’s offer to credit the cost of obtaining the sand from BCA at the\n                    price of $63 per tonne of sand back to the Respondent, demonstrates the\n                    lengths to which the Appellant was prepared to go in order to ensure its\n                    continued ability to manufacture RMC. The price of $63 per tonne of sand\n                    was$3 morethan the price at which the\n                    Respondent could obtain sand from the BCA. This means that for every tonne of\n                    sand that the Respondent procured for the Appellant, the Respondent would obtain\n                    an extra $3. 81     Further, since the price of Grade 30 RMC\n                    quoted by the Appellant was $185 per cubic metre (see above at[22]), the effective selling price of RMC was\n                    $182 per cubic metre (viz, the quoted price\n                    of $185 - $3 reimbursement to the Respondent for procurement\n                    of sand). This isbelowthe cost price of the RMC\n                    which was $183.85 per cubic metre (the cost price was revealed at a meeting\n                    between the Construction Industry Joint Committee and the BCA held on\n                    25 April 2007[note: 49]). This again emphasises the\n                    efforts that the Appellant was willing to make in order to meet its obligation\n                    to manufacture and supply RMC to the Respondent. This also demonstrates that the\n                    Appellant was not attempting to profiteer from the shortage of sand caused by\n                    the Sand Ban. 82     The above analysis is also reinforced by\n                    further evidence which will be dealt with in detail below (at[83]–[90]). (C)   The Respondent had been unwilling to supply sand to the\n                Appellant 83     There was no documentation evidencing the fact\n                    that the Respondent had offered to help supply sand to the Appellant. Whilst the\n                    Respondent had obtained sand from the BCA from as early as February 2007, it had\n                    chosen, instead, to give the sand to a third party – an entity known as\n                    “Group Industries at Sungei Kadut”. The director of the\n                    Respondent, Mr Peh Chong Eng, admitted in the court below that\n                    “somewhere [sic] in February”, the\n                    Respondent had applied for sand from the BCA andhad indeed\n                        obtained some supply of sand.[note: 50]Since the Respondent had\n                    known that, as between the parties,only ithad\n                    access to the BCA’s stockpiles, it ought to have informed the Appellant\n                    that it had obtained sand from the BCA. Instead of thus informing the Appellant,\n                    the Respondent ignored the Appellant’s letter of 9 February 2009, in\n                    which (as we have seen) the Appellant made it clear that it could not obtain\n                    sand from the BCA. 84     It was further revealed in the court below\n                    that Respondent had supplied sand to Buildmate. Mr Peh, Buildmate’s\n                    director, revealed that the Respondent would supply sand to Buildmate, and\n                    Buildmate would (in turn) supply sand to the Appellant at the same price as that\n                    offered by the Appellant to the Respondent (see above at[23]) at $63 per tonne. The Appellant would\n                    use the sand to manufacture RMC and sell it to Buildmate, whereupon Buildmate\n                    would (in turn) supply the same RMC to the Respondent. Unfortunately, it was not\n                    placed on record as to what the commercial reasons were behind this strange and\n                    roundabout way for the Respondent to obtain RMC. 85     There was however, some hint that Buildmate\n                    was used as an entity to obtain RMC from the Appellant without payment: it was\n                    revealed that Buildmate did not pay the Appellant for the RMC supplied to\n                        it[note: 51](which RMC was, in\n                    turn, supplied by Buildmate to the Respondent). Buildmate owed the Appellant\n                    approximately $600,000 for RMC supplied[note: 52]and, instead of making payment,\n                    Buildmate had offered to supply sand to the Appellant as substitute\n                        payment,[note: 53]which the Appellant\n                    refused to accept. Since only contractors such as the Respondent could have\n                    access to sand at that particular point in time, and Buildmate had offered to\n                    use sand as substitute payment for the RMC, there is a suggestion that the\n                    Respondent had been using Buildmate to obtain RMC without payment. At the same\n                    time, the Respondent refused to supply sand to the Appellant and had chosen to\n                    supply it to Buildmate instead; the Appellant’s hands were tied inasmuch\n                    as it could not manufacture RMC pursuant to the Contract. If so, the Respondent\n                    would be having its cake and eating it: by obtaining RMC without payment, and by\n                    insisting on claiming against the Appellant for its breach of contract for\n                    failure to provide RMC under its contract. Given that this is not a pleaded\n                    issue, and in view of the fact that the prior dispute between Buildmate and the\n                    Appellant has been settled, we shall, however, refrain from making any\n                    determination on this matter. 86     Notwithstanding the above, one thing remains\n                    clear from this puzzling arrangement. It reinforces the finding that the\n                    Respondent was unwilling to assist in supplying sand to the Appellant. This is\n                    because Mr Peh Chong Eng, the Project Manager, revealed that the Respondent\n                    had purchased Grade 40 Normal Mix Concrete and Grade 50 Normal Mix\n                    Concrete from Buildmate at the unit price of S$190.00 and S$199.00,\n                    respectively; these wereexactly the same pricesfor RMC as those offered by the Appellant in the 1 March Quotation. Since\n                    the Respondent had accepted the prices offered by the Appellant, there is no\n                    explicable reason why it had chosen to supply sand to a third party (Buildmate)\n                    and not to the Appellant, except for the fact that the Respondent had beenunwillingto supply sand to the Appellant,\n                    whatever the underlying commercial motivations might have been. 87     Apart from supplying sand to “Group\n                    Industries at Sungei Kadut” and Buildmate (instead of the Appellant),\n                    Mr Peh Chong Eng actually gave evidence that the Respondent did not inform\n                    the Appellant that it was willing to help because it believed that the Appellant\n                    was already sourcing for alternative supplies of sand.[note: 54]This demonstrates, in fact,\n                    that the Respondent hadthought, rightly or\n                    wrongly, that there wasno needto help the\n                    Appellant. 88     The Respondent also sought to argue that it\n                    had, by virtue of its letter to the Appellant dated 26 April\n                        2007[note: 55](see\n                    also above at[29]), offered to supply sand\n                    to the Appellant. The letter stated that Mr Oh Beng Hwa (the\n                    Respondent’s director) had proposedduring the meeting\n                        of 19 March 2007that the Respondent would “supplythe sandand aggregate” to the\n                    Appellant at pre-sand ban prices in exchange for the Appellant to supply RMC at\n                    contracted prices. The material parts of the Respondent’s letter of\n                    26 April 2007 are reproduced below, as follows:[note: 56] On19thMar[ch]\n                            2007, our Mr Oh [Beng Hwa] met with your Mr Leong\n                        and Mr Soh …to discuss the matter of your demand for increase in\n                        price of concrete mix … Our Mr Oh [Beng Hwa] proposed, without prejudice, that to resolve the\n                        matter, we supplythe sandand aggregate to\n                        you based on the same old rate as that agreed by you, for you to supply the\n                        concrete mix at the same fixed price as in the aforesaid contract contained\n                        in [the] quotation dated 10 November 2006 … [emphasis added] 89     However, this letter does not advance the\n                    Respondent’s case in this particular regard simply because it was\n                    conditional on the Appellant supplying concrete to the Respondent at the\n                    contracted prices. Indeed, this particular letter was no more than an ultimatum\n                    issued by the Respondent to the Appellant, which the latter rejected (see also[30]above). 90     Even more crucially, the Respondent’s\n                    purported offer to supply sand was in fact only an offer to supplymanufactured sand. There was no offer to supplyconcretingsand. This was confirmed by\n                    Mr Oh Beng Hwa when he gave evidence that the Respondent had proposed at\n                    the 19 March 2007 meeting (referred to in the Respondent’s letter\n                    dated 26 April 2007) to supply manufactured sand, as opposed to concreting\n                        sand.[note: 57]The Respondent\n                    re-confirmed this position that it had offered the Appellant manufactured sand\n                    at the meeting of 19 March 2007 in its closing submissions.[note: 58] (D)   The Respondent had offered to supply manufactured sand to\n                the Appellant but this was not a viable alternative 91     The Appellant did not accept the\n                    Respondent’s offer to supply sand. In a letter dated 26 April 2007,\n                    the Appellant highlighted that the Respondent’s offer was confined only to\n                    the supply ofmanufactured sand.[note: 59]We note\n                    that the Judge did not consider this a material aspect of the Appellant’s\n                    letter of 26 April 2007 (see [18] of Judgment); neither was there any\n                    discussion on the issues relating to manufactured sand in the Judgment. In our\n                    view, if manufactured sand had been a viable alternative to concreting sand\n                    available to the Appellant for use in the manufacture of RMC, and there was no\n                    good or justifiable reason why the Appellant did not accept the\n                    Respondent’s offer to supply this viable alternative, it cannot be said\n                    that the Appellant had taken reasonable steps to avoid the operation of\n                    cl 3.However, theundisputedevidence adduced in the proceedings in the court\n                    below demonstrates that the Respondent’sofferto supply manufactured sand was a contrived one. There was\n                    in fact, at the time when the offer was made on 19 April 2007 (which was\n                    reiterated in the Respondent’s letter of 26 April 2007), no approval\n                    granted to use manufactured sand as part of the sand component to produce RMC.\n                    In any event, the undisputed evidence demonstrates that it has never been the\n                    case that manufactured sand could constitute 100% of the sand component to\n                    manufacture RMC. This means thatconcreting sand would still\n                        be required in any event. In so far as the offer to supply\n                    manufactured sand simply evades the pertinent questions of how and from where\n                    the Appellant could obtainconcretingsand,\n                    without which the Appellant isunableto produce\n                    RMC, we are of the view that the Respondent’s offer to supply only\n                    manufactured sand cannot be said to be a genuine offer. We now turn our\n                    attention to the specific evidence. 92     First, the evidence from theRespondent’s own witnessesshows that there was,\n                    in fact,no approvalto usemanufacturedsand. The Respondent’s Project Manager,\n                    Mr Peh Chong Eng, gave evidence that approval of the Qualified Person had\n                    to be obtained before manufactured sand can be used to manufacture\n                        RMC.[note: 60]As such, it follows that such\n                    approval to use manufactured sandshouldhave been\n                    obtained at the very latest by the meeting of 19 March 2007 when the\n                    Respondent had offered to supply manufactured sand to the Appellant. On the\n                    contrary, the evidence shows that no such approval had been obtained at the\n                    material time. When Mr Oh Beng Hwa (the Respondent’s director) was\n                    asked whether the use of manufactured sand was approved only inDecember 2007, he at first answered that he was\n                        unsure,[note: 61]after which he made reference\n                    to the concrete mix design dated 22 November 2006 exhibited in his\n                        AEIC.[note: 62]However, Mr Oh Beng Hwa admitted\n                    that the words “manufactured sand” were not found in that\n                        design.[note: 63]As such, the reference to\n                    that design is of no relevance to show that there had been approval to use\n                    manufactured sand before the meeting of 19 March 2007. 93     Second, the Respondent’s offer to supply\n                    sand on 19 March 2007 (reiterated in the Respondent’s letter dated\n                    26 April 2007) was mademore than eleven weeks before\n                        approval was grantedto usemanufacturedsand. Mr Oh Beng Hwa admitted, in\n                        cross-examination,[note: 64]that the request for approval to\n                    use manufactured sand was actually found in the concrete mix design proposal\n                    dated1 June 2007attached with a letter\n                    dated8 June 2007,[note: 65]which had been sent to the Qualified Person,\n                    Mr Lai Kin Sin. Clearly, this request for approval to use manufactured sand\n                    came too late; there was no such approval to use manufactured sand at the time\n                    when the Respondent had made an offer to supply manufactured sand at the meeting\n                    of 19 March 2007. 94     Third,even ifthere was approval to use manufactured sand, it was common ground that the\n                    approved use of manufactured sand wasonly up to\n                        50%of the sand component in RMC, as shown in paragraphs 5.5\n                    and 5.6 of the concrete mix design proposal dated 1 June 2007.[note: 66]In\n                    other words, there was no approval for manufactured sand to be used as the 100%\n                    sand component to manufacture RMC. There was therefore still a need to obtain\n                    concreting sand to make up the other 50% of the sand component required to\n                    manufacture RMC. 95     Fourth, there is substantial undisputed\n                    evidence that, although the industry did use manufactured sand even before the\n                    Sand Ban, it wasnever used as a 100% sand\n                        componentto produce RMC. Concreting sand would still be required\n                    in any event. In other words, manufactured sand has never been used as afullsubstitute for concreting sand. In\n                    particular, Dr Ghosh (the Appellant’s Chief Executive Officer with a\n                    Canadian PhD degree in concrete technology and civil engineering\n                        materials[note: 67]) testified that the\n                    quality of the RMC suffers when a greater percentage of manufactured sand is\n                    used in its production. Dr Ghosh’s evidence is that as a general\n                    practice in the construction industry, in manufacturing RMC, the use of\n                    manufactured sand would not exceed 20% to 30% of the sand component; it was\n                    never used as a 100% substitute for concreting sand.[note: 68]Dr Ghosh’s evidence is\n                    strongly corroborated by the supporting evidence, not least of which was\n                    Mr Oliver Ong Yan Wah’s (the Project Director’s) revealing\n                    evidence that at the material time, it was “unknown” whether the use of manufactured sand as a 100%\n                    sand component for RMC was allowed.[note: 69]Further, it is clear that the two BCA Circulars dated 1 and 15 February\n                    2007, released after the news of the Sand Ban was made known, makenomention of manufactured sand. Before the Sand Ban was\n                    announced, the BCA encouraged the construction industry to use alternative\n                    materials toreduce the needfor concreting sand,\n                    in its media release dated 29 January 2007 (“BCA’s media\n                    release”), in the following terms:[note: 70] … we [the BCA] strongly encourage the [construction] industry to\n                        adopt alternative construction materials toreduce the\n                            needfor concreting sand. [emphasis added] 96     The BCA’s media release shows that\n                    alternative construction materials were not meant to be full substitutes for\n                    concreting sand, but had played the role of reducing the need for concreting\n                    sand. This supports Dr Ghosh’s evidence that manufactured sand has\n                    not been used as a full replacement of concreting sand to manufacture RMC. The\n                    contents of BCA’s media release have been confirmed by Mr Ng Cher\n                    Cheng, the Deputy Director of procurement policies department at the\n                        BCA.[note: 71]We are also aware\n                    that the letter dated 13 June 2007 by the materials specialist,[note: 72]MAPEI, stated that at that particular\n                    point in time, all commercial RMC suppliers were using onlyapproximately 50%of manufactured sand to manufacture concrete.\n                    The other 50% required concreting sand, which the Respondent had failed to offer\n                    to procure from the BCA. 97     In view of the evidence set out above, it is\n                    clear thatmanufacturedsand wasnota viable alternative. Put simply, the Appellant\n                    simplycould not have usedmanufactured sand to\n                    produce RMC without the requisite approval to do so. The Respondent’s\n                    offer to supply manufactured sand was therefore a mereempty\n                        gestureas there was in fact no approval for the use of\n                    manufactured sand at the time of the offer, and, even assuming that approval had\n                    been granted,concretingsand was still required\n                    in any event for about 50% of the sand component to produce RMC. The Respondent\n                    was presumably more than aware of the futility of its own offer as it kept\n                    silent and did not reply to the Appellant’s letter dated 26 April\n                    2007.We conclude this part of the judgment by observing that there was a\n                    disingenuous attempt by the Respondent to utilise the pleadings in a\n                    “creative” fashion in order to bolster its case on this particular\n                    issue. In particular, the Respondent made averments in paras 9 and 11 of\n                    its statement of claim that created the misleading impression that a proper\n                    offer to supply (concreting) sand had been made to\n                    the Appellant, as follows: 9. To persuade the Defendant to honour its obligations under the Contract,\n                        the Plaintiff’s Peh Chong Engproposed to the\n                            Defendant’s Messrs Leong and Soh to supply sandand\n                        aggregate to the Defendant. This proposal was communicated to the Defendant\n                        at a meeting on 19 March 2007. The Defendant did not agree to this\n                        proposal. ... 11. Bya letter dated 26 April 2007,\n                        the Plaintiffreiterated its previous proposal to supply\n                            sandand aggregate to the Defendant. The Plaintiff gave the\n                        Defendant until 2pm 27 April 2007 to accept the proposal, failing which\n                        it would accept its repudiation of the Contract ... [emphasis added] 98     The averments made in the statement of claim\n                    (set out in the preceding paragraph) are obviously very different from the\n                    actual proposal (as is the Respondent’s present argument) to supplyonly manufacturedsand. Indeed, we surmise\n                    that the Judge was (unfortunately) under the (erroneous) impression that the\n                    Respondent was making an argument based on the former (as opposed to the\n                    latter), as it was stated in the Judgment that the Respondent had offered tosupply sandto the Appellant (see [17] and\n                    [53] of the Judgment), in whichno mentionwas\n                    made of manufactured sand. We add here, parenthically, that the Respondent had\n                    not pleaded that an offer of manufactured sand constituted a fair and reasonable\n                    offer. (E)   The Appellant took other reasonable steps to avoid the\n                operation of Cl 3 99     Before the BCA has made the announcement under\n                    which the Appellant would be denied access to the BCA sand stockpiles, the\n                    Appellant had, in fact, met other concrete suppliers and the BCA to discuss\n                    alternative supplies of sand.[note: 73]On 30 January 2007, the\n                    Appellant had a meeting with the Ministry of National Development to discuss the\n                    sand ban situation. In addition, the Appellant stated in its letters to the\n                    Respondent dated 9 February 2007 and 1 March 2007 that the Appellant\n                    had been sourcing for supplies of sand and aggregates. (F)   Conclusion 100    Based on the totality of the evidence, we\n                    conclude that Appellanthadtaken reasonable steps\n                    to avoid the operation of cl 3. In the final analysis, it is important to\n                    emphasise that the reasonable steps that the Appellant could have taken to avoid\n                    the operation of cl 3 were limited, in the particular context, to a\n                    situation where only the Respondent had access to the BCA’s sand\n                    stockpiles. The Appellant had done what it could in the difficult circumstances\n                    it found itself placed in: it had informed the Respondent of its inability to\n                    procure sand from the BCA and it had offered to credit back to the Respondent\n                    the price of sand at a price higher than the cost of procuring sand from the\n                    BCA. However, time and again, the Respondent had been unwilling to assist to\n                    procure sand from the BCA. In addition, the Respondent did not adduce any\n                    evidence that there were alternative supplies of concreting sand from local or\n                    overseas sources (apart from its failed contention with regard to manufactured\n                    sand). Since the Appellant’s inability to perform the Contract was due\n                    largely to the Respondent’s unwillingness to assist, it follows that the\n                    triggering of cl 3 is not insubstantially due to the Respondent’s own\n                    actions. As such, it does not lie in the Respondent’s mouth to insist that\n                    the Appellant is unable to rely upon cl 3. In the circumstances, cl 3\n                    applies in the context of the present proceedings as we had earlier found that\n                    there had indeed been a “disruption” within the meaning of the\n                    clause itself. Consequently, the Appellant is not in breach of contract as\n                    cl 3 discharged the Appellant from its obligation to supply RMC to the\n                    Respondent. 101    We would like conclude with the following\n                    observation. This case illustrates the importance of drafting contractual\n                    clauses in general andforce majeureclauses in\n                    particular with clarity and precision. Althoughforce\n                        majeureclauses often take the form of\n                    “boilerplate” clauses, lawyers and their clients would do well to\n                    pay more attention to the precise language used in drafting the clause(s)\n                    concerned. In the present case, for example, cl 3 was phrased too\n                    generally; the dispute between the Appellant and Respondent could have been\n                    efficaciously resolved if there had been a more specific clarification of its\n                    terms found in cl 3, not least with regard to the meaning of the word\n                    “disrupted”.",
        "The Appellant’s application to amend its pleadings": "102    As mentioned above (at[7]), the Appellant sought to amend its pleadings\n                    (by way of SUM 697/2010) in order to raise – for the first time\n                    before this court - the argument that, in any event, the\n                    Contract had beenfrustrated. Given our decision\n                    with regard to the two sub-issues, the Appellant need not in fact have made this\n                    application. 103    The legal principles governing an\n                    application of this nature have been set out in a number of recent local\n                    decisions. In particular, in the recent decision of this court inReview Publishing Co Ltd v Lee Hsien Loong[2010]\n                    1 SLR 52, Chan Sek Keong CJ, delivering the judgment of the\n                    court, set out a comprehensive overview of this area of the law, as follows (at\n                    [110]–[114]): 110    … O 20\n                            r 5(1) of the Rules of Court (Cap 322, R 5, 2006 Rev\n                            Ed) gives the court a wide discretion to allow pleadings to be amended\n                            at any stage of the proceedings on such terms as may be just.\n                            Order 20 r 5(1) reads: Subject to Order 15, Rules 6, 6A, 7 and 8, and this Rule,\n                            the Court mayat any stage of the\n                                proceedingsallow the plaintiff to amend his writ, or any\n                            party to amend his pleading,on such terms as to\n                                costs or otherwise as may be just and in such manner (if any) as it\n                                may direct. [emphasis added] 111    InChwee Kin Keong v Digilandmall.com Pte Ltd[2005] 1 SLR 502 (“Chwee Kin\n                                Keong”), this court said at [101]: Under O 20 r 5(1) of the Rules of Court (Cap 322,\n                            R 5, 2004 Rev Ed), the court may grant leave to amend a\n                            pleading atanystage of the proceedings.This can be before or during the trial, or after\n                                judgment or on appeal. [emphasis added] 112    Indeed, local case\n                            law shows that our courts have allowed amendments to be made to\n                            pleadings even: (a)    at the final stages of a trial after the\n                                parties have made their closing submissions (seeChwee Kin Keongat [101]–[103] andLee Siew Chun v Sourgrapes Packaging Products Trading\n                                    Pte Ltd[1993] 2 SLR 297 at 323–325,\n                                [91]–[96]); (b)    after summary or interlocutory judgment has\n                                been obtained (seeInvar Realty Pte Ltd v Kenzo\n                                    Tange Urtec Inc[1990] SLR 791 at\n                                797–798, [21]–[22]); and (c)    pending an appeal or in the course of an\n                                appeal itself (seeSoon Peng Yam v Maimon bte\n                                    Ahmad[1996] 2 SLR 609 at 618,\n                                [25]–[30],Asia Business Forum Pte Ltd v\n                                    Long Ai Sin[2004] 2 SLR 173\n                                    (“Asia Business\n                                Forum”) at [17] andSusilawati\n                                    v American Express Bank Ltd[2009]\n                                2 SLR 737 (“Susilawati”) at [56]; see also O 57\n                                r 13(1) of the Rules of Court, which states that “the\n                                Court of Appeal shall have all the powers and duties as to amendment\n                                and otherwise of the High Court”). ... 113    The guiding\n                            principle is that amendments to pleadings ought to be allowed if they\n                            would enable the real question and/or issue in controversy between the\n                            parties to be determined… However, an important caveat to\n                            granting leave for the amendment of pleadings is that it must be just to\n                            grant such leave, having regard to all the circumstances of the case.\n                            Thus, this court held inAsia Business\n                                Forumthat the court, in determining whether to grant a\n                            party leave to amend his pleadings, must have regard to “the\n                            justice of the case” (at [12]) and must bear in mind (at least)\n                            two key factors, namely, whether the amendments would cause any\n                            prejudice to the other party which cannot be compensated in costs and\n                            whether the party applying for leave to amend is “effectively\n                            asking for a second bite at the cherry” (at [18]). These two key\n                            factors were endorsed recently again by this court inSusilawatiat\n                            [58]. 114    It cannot be\n                            over-emphasised that all the relevant circumstances of the case at hand\n                            should be considered by the court in deciding whether or not to allow an\n                            amendment to pleadings, and that delay in bringing the application for\n                            leave to amendper sedoes not constitute\n                            prejudice to the other party. As this court stated inWright Normanat [23]: ... In our opinion, at the end of the day, the most important question\n                            which the court must ask itself is, are the ends of justice served by\n                            allowing the proposed amendment. Pleadings should not be used as a means\n                            to punish a party for his errors or the errors of his solicitors. All\n                            relevant issues should be investigated, provided the other party will\n                            not be prejudiced in a way which cannot be compensated by costs. All\n                            relevant circumstances should be considered by the court before it\n                            exercises its discretion [as to] whether it would allow an amendment.While the time at which an amendment is made is a\n                                relevant consideration it is not necessarily decisive. Delay per se\n                                does not equal prejudice or injustice. We do not think\n                            any rigid rule should or can be laid down on this. [emphasis\n                            added] 104    Reference may also be made to the decision\n                    of this court inHwa Lai Heng Ricky v DBS Bank Ltd[2010] 2 SLR 710, which cited and applied the abovementioned\n                    principles. 105    Having regard to the principles set out in\n                    the preceding paragraphs, we are of the view that the Respondent’s\n                    argument to the effect that, if the doctrine of frustration had been canvassed\n                    in the court below, more evidence would need to have been called and that it\n                    would now be prejudiced if the Appellant’s application were to succeed, is\n                    persuasive. The principles as well as rationale governingforce majeureclauses on the one hand and the doctrine of\n                    frustration on the other are – notwithstanding possible overlaps\n                        - quite different. And, when we add to this the fact that\n                    it would appear that the Appellant has a strongprima\n                        faciecase in the context of the doctrine of frustration (seeKwan Yong(especially at [76]–[77])), it\n                    is clear, in our view, that it would be unfair to the Respondent to grant the\n                    Appellant’s application to amend its pleadings at this late stage. That\n                    having been said, the Appellant did not need (in the light of our decision on\n                    both sub-issues above) to rely upon the doctrine of frustration. In the event,\n                    we dismiss the Appellant’s application with costs.",
        "Conclusion": "106    For the reasons stated above we allow the\n                    appeal with costs and with the usual consequential orders. However, we reject\n                    the application in SUM 697/2010 with costs.  [note: 1]SeeThe Jakarta\n                                    Postdated 24 January 2007 in the Record of\n                                Appeal (“ROA”) vol III Part M,\n                                p 4860. [note: 2]See the\n                                Appellant’s Core Bundle, vol II (“2ACB”),\n                                pp 33-34. [note: 3]SeeThe Straits Timesdated 25 January 2007\n                                at ROA vol III Part M (“ROA(3M)”),\n                                p 4861. [note: 4]2ACB,\n                                p 35. [note: 5]Ibid,\n                                p 36. [note: 6]Ibid,\n                    p 39. [note: 7]Ibid,\n                                p 39, para 4. [note: 8]Ibid,\n                            pp 40-41. [note: 9]Ibid,\n                        p 37. [note: 10]Ibid,\n                                p 38. [note: 11]Ibid,\n                    p 42. [note: 12]Ibid,\n                                p 43. [note: 13]Ibid, p 44. [note: 14]Ibid,\n                                p 46. [note: 15]Ibid,\n                                p 47. [note: 16]Ibid. [note: 17]Ibid,\n                        pp 48–49. [note: 18]See the\n                                Notes of Evidence (“NE”) (7 July 2009),\n                                p 47. [note: 19]See Peh Ah\n                                See’s Affidavit of Evidence-in-Chief (“AEIC”) in\n                                ROA(3M), p 4831. [note: 20]See NE (7 July 2009),\n                        pp 20–21. [note: 21]See Peh Ah See’s AEIC in\n                                ROA(3M), p 4830. [note: 22]See Peh Chong Eng’s AEIC in ROA(3A),\n                                pp 199–202. [note: 23]See Peh Chong Eng’s AEIC in\n                                ROA(3A), p 203. [note: 24]See NE\n                                (7 July 2009), p 85. [note: 25]See NE (7 July 2009), p 85, and NE (8 July 2009),\n                                pp 118 and 120. [note: 26]See NE (8 July 2009), p 120,\n                                lines 22–27. [note: 27]See NE (7 July 2009), pp 20\n                                and 67 and NE (8 July 2009),\n                        p 120. [note: 28]See the\n                                Defence (Amendment No 1), ROA vol 2, p 53,\n                                para 9. [note: 29]See the\n                                Appellant’s Case, p 21,\n                        para 29. [note: 30]See 2ACB,\n                        p 50. [note: 31]Ibid. [note: 32]Ibid,\n                                pp 51–52. [note: 33]Ibid,\n                                p 51. [note: 34]Ibid, p 53. [note: 35]Ibid,\n                                p 48, para 2. [note: 36]See 2ACB,\n                                p 39. [note: 37]Ibid. [note: 38]Ibid,\n                                p 38 (where Bibright Shipping declared aforce majeureevent on the appellant. Bibright\n                                Shipping had also explained that its sand supplies had been taken\n                                over by BCA). [note: 39]See the Supplemental Core Bundle,\n                        p 26. [note: 40]See 2ACB, p 44. [note: 41]Ibid, p 36. [note: 42]See\n                                Plaintiff’s Closing Submissions dated 14 August 2009\n                                found in ROA Vol IV at p 5393. [note: 43]Ibid,\n                                p 43, para 3. [note: 44]Ibid, p 47,\n                        para 3. [note: 45]See 2ACB, p 48. [note: 46]Ibid,\n                                p 50. [note: 47]Ibid,\n                                pp 48–49. [note: 48]Ibid, p 43. [note: 49]See ROA(3M),\n                            p 4992. [note: 50]See NE\n                                (7 July 2009), p 32,\n                        lines 3–6. [note: 51]See NE (7 July 2009), p 85,\n                                lines 27–29. [note: 52]See NE\n                                (7 July 2009), p 85, and NE (8 July 2009), p 118\n                                and 120. [note: 53]See NE (8 July 2009), p 120,\n                                lines 22–27. [note: 54]See NE (7 July 2009), p 43, lines 21 and\n                                28–29. [note: 55]See 2ACB, p 53. [note: 56]CB Vol 2 at\n                    p CB-53. [note: 57]Oh Beng Hwa’s AEIC at ROA, Vol 3(A) at\n                                p 79, para 20. [note: 58]ROA Vol 4 at p 5394, para 38 and p 5417,\n                                para 64. [note: 59]CB Vol 2 at p CB-54. [note: 60]See NE (7 July 2009), p 11,\n                                line 22. [note: 61]See NE (7 July 2009), p 19,\n                                line 9. [note: 62]ROA Vol 3(A) at\n                        p 52. [note: 63]See NE (7 July 2009), p 79,\n                                line 11. [note: 64]See NE (8 July 2009),\n                                p 95. [note: 65]See CB vol 2, p CB-77 and\n                        CB-78. [note: 66]See CB vol 2, p CB-78. [note: 67]See NE (8 July 2009), p 107,\n                                lines 5–6. [note: 68]See NE (8 July 2009),\n                        p 110. [note: 69]See NE\n                                (Day 2), p 99, line 14. [note: 70]See 1AB at\n                                p 4726, para 4, found in ROA Vol V part K, at\n                                p 10313. [note: 71]See NE (10 July 2009), p 189,\n                                lines 3–6. [note: 72]ROA Vol 4 at p 5499(32),\n                        para 6. [note: 73]See the\n                                letter dated 26 January 2007, 2ACB, p 35,\n                                para 4."
    }
}