{
    "case_title": "Larsen Oil and Gas Pte Ltd\n      v\n      Petroprod Ltd (in official liquidation in the Cayman Islands and in\n                compulsory liquidation in Singapore)",
    "ncitation": "[2011] SGCA 21",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       Arbitration and insolvency processes embody, to\n                    an extent, contrasting legal policies. On the one hand, arbitration embodies the\n                    principles of party autonomy and the decentralisation of private dispute\n                    resolution. On the other hand, the insolvency process is a collective statutory\n                    proceeding that involves the public centralisation of disputes so as to achieve\n                    economic efficiency and optimal returns for creditors. The appeal before us\n                    raised an interesting and novel point of law relating to the interfacing of\n                    these two policies where private proceedings could have wider public\n                    consequences. To what extent ought claims involving an insolvent company be\n                    permitted to be resolved through the arbitral process? We now give the reasons\n                    why we dismissed this appeal with costs.",
        "Background facts": "2       The facts of this case are relatively\n                    straightforward and have been succinctly summarised by the judge at first\n                    instance (“the Judge”) in his grounds of decision\n                    (“GD”) inPetroprod Ltd (in official\n                        liquidation in the Cayman Islands and in compulsory liquidation in\n                        Singapore) v Larsen Oil and Gas Pte Ltd[2010] 4 SLR 501. We\n                    will therefore set out here, only a broad overview of the factual background\n                    that would be helpful in explaining our decision. 3       The respondent, Petroprod Ltd\n                    (“Petroprod”), a Cayman Islands company, and its four wholly-owned\n                    subsidiaries (“the four subsidiaries”), which had no employees,\n                    entered into a Management Agreement (“the MA”) with the appellant,\n                    Larsen Oil and Gas Pte Ltd (“Larsen”) on 21 December 2006.\n                    Pursuant to the MA, Larsen was to provide management services to Petroprod and\n                    the four subsidiaries. Petroprod pleaded that as a result of the MA and\n                    subsequent amendments, Larsen gained control over its finances as well as those\n                    of the four subsidiaries. Petroprod also claimed to be a creditor of the four\n                    subsidiaries. 4       On 17 July 2009, Petroprod was placed in\n                    official liquidation in the Cayman Islands by an Order of the Grand Court of the\n                    Cayman Islands. It was subsequently placed in compulsory liquidation in\n                    Singapore by an order of the High Court on 3 August 2009. On\n                    3 September 2009, the Singapore liquidators of Petroprod commenced\n                    proceedings against Larsen: (a)     to avoid a number of payments that\n                        Petroprod made to Larsen on the ground that these payments amounted to\n                        unfair preferences or transactions at an undervalue within the meaning of\n                        ss 98 and 99 of the Bankruptcy Act (Cap 20, 2009 Rev Ed)\n                        (“BA”), read with s 329(1) of the Companies Act\n                        (Cap 50, 2006 Rev Ed) (“Companies Act”);\n                    and (b)     to avoid a\n                        number of payments made by the four subsidiaries to Larsen pursuant to\n                        s 73B of the Conveyancing and Law of Property Act (Cap 61,\n                        1994 Rev Ed) (“CLPA”) on the ground that they were made\n                        with the intent to defraud it as a creditor of the\n                    subsidiaries. 5       On 2 December 2009, Larsen filed a summons\n                    applying for a stay of all further proceedings brought by Petroprod pursuant to\n                    s 6(2) of the Arbitration Act (Cap 10, 2002 Rev Ed)\n                    (“AA”). The basis of its application was that an arbitration\n                    clause (cl 18) in the MA (“the Arbitration Clause”) required\n                    the parties to resolve their disputes through arbitration. The Arbitration\n                    Clause reads as follows: This Agreement shall be construed and enforced in accordance with and\n                        governed by the laws of Singapore. Disputes which cannot be resolved\n                        amicably shall be resolved by arbitration in Singapore in accordance with\n                        the provisions of the Singapore Arbitration Act, Chapter 10. Larsen’s application for a stay of further proceedings was heard\n                    by the Judge on 26 March 2010, and judgment was given together with the GD\n                    on 30 June 2010. The Judge dismissed Larsen’s stay application on the\n                    basis that the issues were (a) non-arbitrable; and, further, that\n                    (b) Petropod’s claim pertaining to s 73B CLPA should be resolved\n                    in the same forum (see GD at [22] and\n                        [24]).",
        "Issues arising in this appeal": "6       The issues that arose in the appeal were as\n                    follows: (a)     whether Petroprod’s claims\n                        against Larsen fell within the scope of the Arbitration\n                    Clause; (b)     whether the\n                        Court’s discretion to grant a stay of proceedings pursuant to\n                        s 6(2) of the AA was dependent on the arbitrability of the dispute in\n                        question; (c)     if the\n                        Court’s discretion was dependent on the arbitrability of the dispute,\n                        whether Petroprod’s claims against Larsen were\n                    arbitrable.",
        "Our decision": "",
        "The scope of the Arbitration Clause": "The proper characterisation of Petroprod’s claims against\n                Larsen 7       Larsen contended that Petroprod’s claims\n                    against it were founded on Larsen’s alleged breach of the MA, and that\n                    such a claim fell within the scope of the Arbitration Clause. It claimed that\n                    Petroprod could only show that the payments made to Larsen by Petroprod and the\n                    four subsidiaries were preferential payments by relying on the terms of the MA,\n                    and proving that the payments were made with the intent to prefer Larsen over\n                    the other creditors rather than in accordance with the MA. As a corollary,\n                    Larsen also argued that Petroprod could only show that the payments made to\n                    Larsen by Petroprod and the four subsidiaries were undervalue\n                    transactions/fraudulent conveyances if the amounts paid were more than what\n                    Petroprod (and the four subsidiaries) were obliged to pay under the MA.\n                    Therefore, all of Petroprod’s claims were intimately connected to the MA\n                    and any disputes relating to the payments under the MA fell within the scope of\n                    the Arbitration Clause. 8       The Judge rejected Larsen’s arguments. He\n                    held at [16] of the GD that: [T]he rights created by the avoidance provisions exist for the benefit of\n                        the general body of creditors in an insolvency or insolvency-related\n                        context. This is why avoidance rights may be exercised even if the relevant\n                        transaction is binding under general law on the company. It is also\n                        pertinent to note that undervalue transactions and undue preferences can be\n                        avoided only when the company is being wound up. In my view, the policy\n                        underlying the avoidance provisions in question would be compromised if\n                        their enforcement is subject to private arrangements, including an agreement\n                        to arbitrate, between the company and the wrongfully advantaged creditor or\n                        transferee. In this regard, a company’s rights under the avoidance\n                        provisions should be contrasted with its rights under the general\n                        law. 9       We agreed with the Judge’s\n                    characterisation of Petroprod’s claims against Larsen. Petroprod’s\n                    Statement of Claim against Larsen revealed that Petroprod did not allege that\n                    Larsen had breached the MA by causing Petroprod to make the payments to Larsen.\n                    Rather, all that Petroprod claimed was that it had made certain payments to\n                    Larsen within two years of its insolvency, and that the law presumed that the\n                    payments were made with an intention to prefer Larsen as a creditor because of\n                    Larsen’s control over the management of Petroprod. Similarly,\n                    Petroprod’s claims against Larsen based on an undervalued transaction and\n                    a fraudulent conveyance were entirely independent of the question of whether\n                    Larsen had breached the MA. 10     In our opinion, Petroprod’s claims\n                    against Larsen were founded entirely on the avoidance provisions of the BA and\n                    Companies Act.The focus of these avoidance provisions is to\n                        address situations where value has been subtracted from the insolvent\n                        company to the detriment of the general creditors, independent of the nature\n                        of the relationship between the parties. These provisions allow\n                    for the adjustment of concluded transactions upon the onset of insolvency. The\n                    only relevance of the MA to Petroprod’s claims against Larsen was that it\n                    provided some evidence that the payments made from Petroprod to Larsen could\n                    have been for some legitimate commercial reason other than to prefer Larsen as a\n                    creditor. The question of whether Larsen had committed a breach of the MA by\n                    causing Petroprod to make those payments was irrelevant. Accordingly, we\n                    rejected Larsen’s claim that Petroprod’s claims were pure\n                    contractual claims merely because of the MA. Rather, we found that\n                    Petroprod’s claims against Larsen were avoidance claims that sprung from\n                    the special regime created by the BA and Companies Act. The proper approach towards the construction of arbitration\n                clauses 11     Of course, the mere fact that\n                    Petroprod’s claims against Larsen were avoidance claims did not preclude\n                    them from falling within the scope of the Arbitration Clause. The scope of any\n                    arbitration clause is based on the parties’ expressed intention, and it is\n                    conceivable that the parties to a contract may agree that all disputes between\n                    them, including disputes arising out of avoidance actions in the event of\n                    insolvency, should fall within the scope of the arbitration clause. This would\n                    be a matter of documentary construction. 12     The traditional approach of the English courts\n                    was to determine the scope of an arbitration clause by looking at the precise\n                    words used in it. Hence, the use of expansive words such as “any\n                    dispute” between the parties were often regarded as wide enough to\n                    include any matter related to the contract, even if the action brought was based\n                    in tort (see generallyAstro Vencedor Compania Naviera SA of\n                        Panama v. Mabanaft GmbH, The Damianos[1971] 2 QB 588). On\n                    the other hand, words such as “arising under the contract” were\n                    held to be of narrower scope, and there was a divergence of views between courts\n                    as to whether such a clause could include a tort claim that was related to the\n                    contract (seeHeyman and another v Darwins,\n                        Limited[1942] AC 356;Union of India v EB\n                        Aaby’s Rederi A/s, The Evje[1974] 2 All ER\n                    874). 13     The case ofPremium Nafta\n                        Products Ltd & Ors v Fili Shipping Co Ltd & Ors[2007]\n                    2 CLC 553 (“Premium Nafta”)\n                    heralded a change in how arbitration clauses ought to be construed. The dispute\n                    in that case was whether an arbitration clause that purported to cover\n                    “any dispute arising under this charter” was wide enough to cover\n                    claims involving the tort of conspiracy, breach of fiduciary duty and fraud,etc. The House of Lords eschewed the\n                    traditional technical approach towards the construction of arbitration clauses\n                    in favour of a commonsensical one based on the presumed intention of the\n                    parties. Lord Hoffman with his customary acuity noted (at [13]) that: [T]he construction of an arbitration clause should start from the\n                        assumption that the parties, as rational businessmen, are likely to have\n                        intended any dispute arising out of the relationship into which they have\n                        entered or purported to enter to be decided by the same tribunal. The clause\n                        should be construed in accordance with this presumption unless the language\n                        makes it clear that certain questions were intended to be excluded from the\n                        arbitrator's jurisdiction. 14     ThePremium\n                        Naftaapproach suggests that an arbitration clause should be\n                    construed widely so as to include all disputes relating to the contract, whether\n                    the underlying cause of action is based on tort or contract, unless the language\n                    used in the arbitration clause clearly excludes the particular\n                dispute. 15     Other jurisdictions have also favoured a\n                    generous approach towards the construction of arbitration clauses. The Supreme\n                    Court of the United States has taken the view that “any doubts concerning\n                    the scope of arbitrable issues should be resolved in favor of\n                    arbitration” (seeMoses H Cone Memorial Hospital\n                        v Mercury Construction Corporation460 US 1 (1983) at\n                        [12]-[14]). Further, inMitsubishi Motors\n                        Corporation v. Soler Chrysler-Plymouth, Inc473 US 614\n                    (1985), Blackmun J held (at [2]–[3]) that with\n                    regard to the construction of an arbitration clause, “as with any other\n                    contract, the parties' intentions control, but those intentions are generously\n                    construed as to issues of arbitrability”. 16     InFrancis Travel Marketing\n                        Pty Ltd v Virgin Atlantic Airways Ltd[1996] 39 NSWLR 160,\n                    the Court of Appeal of the Supreme Court of New South Wales had to consider\n                    whether an arbitration clause was wide enough to cover a claim by the plaintiff\n                    under the Australian Trade Practices Act 1974. The court, in holding that the\n                    arbitration clause should be generously interpreted to include such claims,\n                    reasoned (at 165) that: When the parties to a commercial contract agree, at the time of making the\n                        contract, and before any disputes have yet arisen, to refer to arbitration\n                        any dispute or difference arising out of the agreement, their agreement\n                        should not be construed narrowly. They are unlikely to have intended that\n                        different disputes should be resolved before different tribunals, or that\n                        the appropriate tribunal should be determined by fine shades of difference\n                        in the legal character of individual issues, or by the ingenuity of lawyers\n                        in developing points of argument. 17     Similarly, inOnex Corp. v.\n                        Ball Corp. (1994) 12 BLR (2d) 151 at [24], the Ontario Court of Justice reasoned\n                    that: [W]here the language of an arbitration clause is capable of bearing two\n                        interpretations, and on one of those interpretations fairly provides for\n                        arbitration, the courts should lean towards honouring that option\n                        … This approach was cited with approval by the Ontario Court of Appeal\n                    inCanadian National Railway Co et al v Lovat Tunnel\n                        Equipment Inc(1999) 174 D.L.R. (4th) 385. 18     This generous approach towards the\n                    construction of the scope of arbitration clauses has received widespread\n                    support. Gary Born concludes that such an approach “best achieves the\n                    parties’ objective, good faith intentions” (Gary B Born,International Commercial Arbitration\n                        vol 1(Wolters Kluwer, 2009) at p 1083). Other writers\n                    such as Julian Lew, Loukas Mistelis and Stefan Kroll also support this approach\n                    on the grounds that restrictive interpretations of arbitration clauses tend to\n                    cause “cumbersome” and unfair results (see\n                    Julian D M Lew et al,Comparative\n                        International Commercial Arbitration(Kluwer Law Internationa,\n                    2003) at p 152). 19     There are, all in all, strong reasons for\n                    supporting a generous approach towards the construction of the scope of\n                    arbitration clauses, given that such an approach has received widespread\n                    acceptance among the leading commercial jurisdictions, and is strongly supported\n                    by the academic community. Such an approach is also consistent with this\n                    court’s philosophy of facilitating arbitration (see, for instance, the\n                    case ofTjong Very Sumito and others v Antig Investments Pte\n                        Ltd[2009] 4 SLR(R) 732 where we adopted a\n                    generous interpretation of the word “dispute” in an arbitration\n                    clause). Accordingly, we agree that the preponderance of authority favours the\n                    view that arbitration clauses should be generously construed such that all\n                    manner of claims, whether common law or statutory, should be regarded as falling\n                    within their scope unless there is good reason to conclude\n                otherwise. Whether the Arbitration Clause covered Petroprod’s avoidance\n                claims against Larsen 20     The underlying basis for a generous approach\n                    towards construing the scope of an arbitration clause is the assumption that\n                    commercial parties, as rational business entities, are likely to prefer a\n                    dispute resolution system that can deal with all types of claims in a single\n                    forum. This assumption is reasonable in relation to private remedial claims,\n                    which may arise either before or during the period when a company becomes\n                    insolvent. It is conceivable that the company’s pre-insolvency management\n                    would prefer all these claims to be dealt with in a single forum. However, this\n                    reasoning cannot be applied to avoidance claims pursued during insolvency\n                    proceedings. The commencement of insolvency proceedings results in the\n                    company’s management being displaced by a liquidator or judicial manager.\n                    Since avoidance claims can only be pursued by the liquidators or judicial\n                    managers of insolvent companies, there is no reason to objectively believe that\n                    a company’s pre-insolvency management would ordinarily contemplate\n                    including avoidance claims within the scope of an arbitration\n                agreement. 21     For the reasons stated above, it makes sense\n                    to draw a line between private remedial claims (either common law or statutory),\n                    which the company’s pre-insolvency management have good reason to be\n                    concerned about, and claims that can only be made by a liquidator/judicial\n                    manager of an insolvent company, to which they are completely indifferent. We\n                    therefore hold that arbitration clauses should not ordinarily be construed to\n                    cover avoidance claims in the absence of express language to the contrary (on\n                    this issue see[46]below) and that the\n                    Arbitration Clause did not cover Petroprod’s claims against\n                Larsen. 22     Our holding that the Arbitration Clause did\n                    not cover Petroprod’s claims against Larsen would have been enough to\n                    dismiss the appeal. However, in the light of the fact that the question of the\n                    arbitrability of insolvency-related claims has never been raised in the local\n                    courts, and would certainly be of great importance to arbitration and insolvency\n                    practitioners, we consider it appropriate for us to explicate our views on what\n                    would be the proper judicial approach towards an arbitration agreement that\n                    expressly includes insolvency-related claims such as avoidance\n                claims.",
        "The concept of arbitrability and s 6(2) of the AA": "23     Before the Judge, the parties did not address\n                    the question of whether the concept of arbitrability of the claim should be a\n                    factor when a court is considering whether to grant a stay of proceedings in\n                    favour of arbitration under s 6(2) of the AA. However, the Judge correctly\n                    identified this as an important issue, and held that although the AA did not\n                    make any explicit reference to the concept of arbitrability, this should be\n                    taken into account when a court is asked to exercise its discretion to grant a\n                    stay of proceedings under s 6(2) of the AA. He stated, at [12] of the GD: In the IAA, the concept of arbitrability is recognised in s 11(1),\n                        which provides that any dispute which the parties have agreed to submit to\n                        arbitration under an arbitration agreement may be determined by arbitration\n                        unless it is contrary to public policy to do so. In contrast, there is no\n                        explicit reference to the concept of arbitrability in the Arbitration Act.\n                        Even so, this concept ought to be taken into account when a court is asked\n                        to exercise its discretion to grant a stay under s 6(2) of the\n                        Arbitration Act. With this in mind, the specific nature of Petroprod’s\n                        claims in the main action will now be considered. 24     We agree with the Judge’s view that\n                    arbitrability is an important factor that ought to be taken into consideration\n                    when determining whether to grant a stay under s 6(2) of the AA. However,\n                    the Judge’s observation that the AA does not make explicit reference to\n                    the concept of arbitrability is incorrect. Section 48(1)(b)(i) of the AA, which deals with the setting aside of an\n                    arbitral award, makes it clear that the courts can set aside an arbitral award\n                    if “the subject-matter of the dispute is not capable of settlement by\n                    arbitration.” This is a clear reference to the concept of arbitrability.\n                    However, the AA does not include any provision that explains what disputes are\n                    arbitrable. It has been left to the courts to shape the contours of the\n                    arbitrability exception. 25     In our opinion, there are two reasons why a\n                    stay should not be granted under s 6(2) of the AA if the claim is not an\n                    arbitrable one. First, as the Judge pointed out, s 11(1) of the\n                    International Arbitration Act (Cap 143A, 2009 Rev Ed)\n                    (“IAA”) explicitly states that parties may only agree to submit a\n                    dispute to arbitration if the dispute is an arbitrable one. It would be\n                    anomalous if a dispute that was non-arbitrable and hence not entitled to a stay\n                    of proceedings under the IAA, could be stayed in favour of arbitration under\n                    s 6(2) of the AA. The anomaly is even more striking considering that the\n                    Courts are expected to take a more interventionist approach in domestic\n                    arbitrations under the AA than international arbitrations under the IAA (seeNCC International AB v Alliance Concrete\n                        Singapore Pte Ltd[2008] 2 SLR(R) 565 at [51]). 26     Second, it is important to remember that\n                    arbitration is not an end in itself. Parties engage in arbitration in order to\n                    obtain an arbitral award that can be enforced. An arbitral award in respect of\n                    an non-arbitrable claim is abrutum fulmenas it\n                    can be set aside under s 48(1)(b)(i) of the\n                    AA even if the issue of arbitrability is not raised by the parties. It is an\n                    utter waste of time for parties to incur time and cost through arbitration, only\n                    to obtain an arbitral award that is later set aside for non-arbitrability, and\n                    to have the entire litigation process repeated again to have their dispute\n                    sorted out. Accordingly, even though s 6(2) of the AA does not make\n                    arbitrability of the dispute a pre-condition for the grant of a stay of\n                    proceedings, it cannot be seriously argued that a non-arbitrable claim should be\n                    allowed to proceed to arbitration.",
        "Whether avoidance claims are arbitrable": "Statutory provisions 27     The question of whether avoidance claims are\n                    arbitrable cannot be answered without a proper understanding of the relationship\n                    between the concept of arbitrability and the essential principles of\n                    insolvency/bankruptcy law. Guidance can also be obtained from the provisions of\n                    the BA and the AA (and the IAA) to understand how Parliament has struck a\n                    balance between the competing policy considerations of facilitating arbitration\n                    and enforcing insolvency law. (1)   The AA and the IAA 28     The AA makes only one reference to the concept\n                    of arbitrability in s 48(1)(b)(i), which\n                    deals with the setting aside of an arbitral award. As for the IAA, the concept\n                    of arbitrability is mentioned twice, first in s 11, which deals with the\n                    enforcement of an arbitration agreement, and in s 31(4), which deals with\n                    the enforcement of a foreign arbitral award. Neither statute provides any\n                    guidelines as to the type of claims that are arbitrable. 29     Nevertheless, the legislative history of the\n                    AA and the IAA provides some clues as to how the drafters of the statutes viewed\n                    the concept of arbitrability. In 1997, the Attorney-General set up a Review of\n                    Arbitration Act Committee (“the Committee”) to review arbitration\n                    legislation in Singapore. In 2000, the Committee published its final report,Review of Arbitration Laws, LRRD\n                        No 3/2001(“the Report”) as well as the draft\n                    Arbitration Bill 2001. Section 2.37.17 of the Report states that: Clause 48(1)(b) gives to the Court on its own motion the power to\n                        refuse enforcement of the award if the subject matter in dispute is not\n                        arbitrable. Subject matter arbitrability has a direct impact on the\n                        jurisdiction of the tribunal and is also arguably a matter of public policy\n                        as to which subject matters are incapable of arbitral resolution.It is generally accepted that issues, which may have public\n                            interest elements, may not be arbitrable, e.g., citizenship\n                        or legitimacy of marriage, grants of statutory licenses, validity of\n                        registration of trade marks or patents, copyrights,winding-up of companies, bankruptcies of debtors,\n                        administration of estates. [emphasis added] The Report also makes it clear that the policy of encouraging\n                    arbitration as encapsulated in the AA is subject to other competing policy\n                    considerations, especially insolvency and bankruptcy issues. Section 2.3.3 of\n                    the Report states that: The Bill makes no reference to the insolvency of companies or other bodies\n                        corporate. Reference must be made to the Companies Act and other relevant\n                        statutory instruments relating to the capacities of such bodies in cases of\n                        winding-up or insolvency. [The Law Reform and Co-ordinating\n                        Committee’s] suggestion that the Companies Act be mentioned in the\n                        Bill was not adopted as we felt that such matters should properly remain\n                        within the Companies Act or for that matter any subsequent insolvency\n                        legislation. 30     It can be seen from the Report that the\n                    drafters of the AA and IAA regarded the question of arbitrability as being\n                    subject to public interest considerations. More importantly, they recognised\n                    that insolvency/bankruptcy law is an area replete with public policy\n                    considerations that were too important to be settled by parties privately\n                    through the arbitral mechanism. However, the Report did not clarify what type of\n                    claims relating to insolvency could not be arbitrated. (2)   The BA 31     The relevant section of the BA that deals with\n                    enforcement of an arbitration agreement by/against a bankrupt party is\n                    s 148A which reads as follows: Arbitration agreements to which bankrupt is a\n                            party 148A. —(1) This section shall\n                        apply where a bankrupt had become party to a contract containing an\n                        arbitration agreement before the commencement of his bankruptcy. (2)    If the Official\n                            Assignee adopts the contract, the arbitration agreement shall be\n                            enforceable by or against the Official Assignee in relation to matters\n                            arising from or connected with the\n                            contract. (3)    If the Official\n                            Assignee does not adopt the contract and a matter to which the\n                            arbitration agreement applies requires to be determined in connection\n                            with or for the purposes of the bankruptcy proceedings\n                        — (a)    the Official\n                                Assignee; or (b)    any other party\n                                to the agreement, may apply to the courtwhich may, if it thinks fit in\n                            all the circumstances of the case, order that the matter be referred to\n                            arbitration in accordance with the arbitration\n                        agreement. [emphasis in bold italics added] 32     Section 148A of the BA is as a relatively\n                    new provision. It originally appeared as s 5 of the AA until 2001, when\n                    Parliament decided to re-enact this provision in the BA pursuant to the earlier\n                    mentioned reforms to the AA. The parliamentary debates do not reveal the\n                    legislature’s reasons for doing so, but it is likely that this was done to\n                    ensure that the new s 148A of the BA could apply to arbitration agreements under\n                    both the AA or the IAA, thus creating a unified scheme for the enforcement of an\n                    arbitration agreements by/against bankrupt parties. (SeeSingapore Parliamentary Debates, Official Report (5 October\n                    2001) vol 73 at cols 2213–2218)\n                    (Associate Professor Ho Peng Kee, Minister of State for\n                Law)). 33     It bears mention that the re-enactment of the\n                    old s 5 of the AA as the present s 148A of the BA was accompanied by\n                    significant textual changes. The old s 5 of the AA contained only two\n                    sub-sections and read as follows: Provisions in case of bankruptcy. 5. —(1) Where it is provided by a\n                        term in a contract to which a bankrupt is a party that any differences\n                        arising thereout or in connection therewith shall be referred to\n                        arbitration, the said term shall, if the Official Assignee of debtor’s\n                        estates adopts the contract, be enforceable by or against him so far as it\n                        relates to any such differences. (2)    Where a person who has been adjudged bankrupt had,\n                            before the commencement of the bankruptcy, become a party to an\n                            arbitration agreement, and any matter to which the agreement applies\n                            requires to be determined in connection with or for the purposes of the\n                            bankruptcy proceedings, then, if the case is one to which subsection (1)\n                            does not apply, any other party to the agreement or the Official\n                            Assignee of debtors’ estates may apply to the court having\n                            jurisdiction in the bankruptcy proceedings for an order directing that\n                            the matter in question shall be referred to arbitration in accordance\n                            with the agreement, and that court may, if it is of opinion that, having\n                            regard to all the circumstances of the case, the matter ought to be\n                            determined by arbitration, make an order accordingly. 34     Given the substantial textual differences\n                    between these two provisions, it is inappropriate to interpret s 148A(2) of\n                    the BA by reference to the original s 5 of the AA. In any event, there are\n                    no reported cases that deal with the application of s 5 of the AA. Neither\n                    does it appear that there are any reported authorities on the United\n                    Kingdom’s equivalent of the original s 5 of the AA (the original\n                    s 5 of the AA was based on, and ispari\n                        materiawith, s 3 of the United Kingdom’s Arbitration\n                    Act 1950 (14 Geo. 6, c.27), as well as its progenitor, s 2 of the\n                    United Kingdom’s Arbitration Act 1934 (24 & 25 Geo. 5, Ch.14)).\n                    Therefore, we will interpret s 148(2) of the BA according to legal\n                    principles as tempered by public policy. 35     Section 148A contains two main sub-limbs.\n                    The first sub-limb deals with a situation where the Official Assignee chooses to\n                    adopt the contract, while the second sub-limb deals with a situation where the\n                    Official Assignee chooses not to do so. In relation to the first sub-limb,\n                    s 148A(2) provides that if the Official Assignee adopts the contract, the\n                    arbitration agreement shall be enforceable by or against the Official Assignee\n                    in relation to matters arising from or connected with the contract. The purpose\n                    of this section is to compel the Official Assignee (or Liquidator) to adopt the\n                    contract in its entirety, without having the power to cherry pick the desirable\n                    portions of the contract while eschewing or discarding the undesirable parts. In\n                    relation to the second sub-limb, s 148A(3) of the BA provides that even if\n                    the Official Assignee (or Liquidator) does not adopt the contract, the courts\n                    retain a residual discretion to refer a dispute involving an insolvent/bankrupt\n                    party to arbitration if the court “thinks fit in all the circumstances of\n                    the case.” 36     Section 148A does not provide any clear\n                    guidelines for determining how the court should exercise its residual discretion\n                    in deciding whether a claim involving an insolvent party should be referred to\n                    arbitration when the underlying contract is not adopted. Neither does it provide\n                    any clues as to how to determine if a particular claim is arbitrable. These are\n                    areas that have been left for the courts to decide. Case law (1)   Singapore 37Four Pillars Enterprises Co\n                        Ltd v Beiersdorf Aktiengesellschaft[1999] 1 SLR(R) 382 (“Four\n                        Pillars”) is the only local case that deals directly with\n                    the question of whether an insolvency related dispute can be arbitrated. In that\n                    case, the appellant and the respondent had set up a joint venture company (JVC)\n                    pursuant to a joint venture agreement. In 1998, the respondent, as creditor and\n                    shareholder of the JVC, presented a petition to wind up the JVC on grounds that\n                    the JVC was insolvent and that it was just and equitable that the JVC be wound\n                    up. The appellant sought an order for a stay of the winding-up proceedings on\n                    the basis that the joint-venture agreement contained an arbitration clause\n                    requiring the respondent to refer all disputes to arbitration. 38     This Court found that the winding up petition\n                    did not fall within the scope of the arbitration clause and refused to grant the\n                    stay sought by the appellants.Four Pillars,\n                    however, does not provide us with much help on the question of the arbitrability\n                    of insolvency related disputes because that case was dealt with primarily as a\n                    question dealing with the construction of the scope of an arbitration\n                    clause. (2)   England 39     There are no direct English authorities on\n                    whether an avoidance claim is arbitrable. The respondent cited the case ofExeter City Association Football Club Ltd v Football\n                        Conference Ltd and another[2004] 1 WLR 2910\n                        (“Exeter City”) at [23] as standing for the proposition that\n                    there are certain statutory rights that are “inalienable and cannot be\n                    diminished or removed by contract or otherwise”. In that case, the court\n                    held that an action under s 459 of the English Companies Act that the\n                    company’s affairs were being conducted in a manner prejudicial to the\n                    shareholder’s interest was non-arbitrable. In our opinion,Exeter Cityis not a useful case because it merely\n                    states that certain statutory rights are non-arbitrable, without giving any\n                    guidelines as to how this determination is even made. 40     On a more general note, s 130(2) of the\n                    UK Insolvency Act 1986 provides that no proceedings shall be proceeded with or\n                    commenced against an insolvent company except with the leave of court. The\n                    English courts have interpreted this provision as applying to arbitral\n                    proceedings as well (seeEnron Metals & Commodity Limited\n                        v HIH Casualty & General Insurance Limited[2005] EWHC 485\n                    (Ch)). InIn re Atlantic Computer Systems Plc[1992] 2 WLR 367 (“Re\n                    Atlantic”), the Court of Appeal held that the stay should only\n                    be lifted if the creditor could make out a good case against the insolvent\n                    debtor. Where the creditor’s claim did not relate to proprietary rights,\n                    the court had to conduct a balancing exercise between the interest of the\n                    claimant in exercising its rights, and those of the other creditors. In doing\n                    so, the court had to consider the loss that the creditor would suffer if leave\n                    was not granted, compared with the loss potentially suffered by the other\n                    creditors if leave was granted. 41     TheRe Atlanticapproach requires the judge to conduct a balancing exercise between the interest\n                    of the particular claimant in enforcing the arbitration clause, and those of the\n                    other creditors. Under this approach, an English court may enforce an\n                    arbitration clause if it is of the opinion that the interest of the particular\n                    claimant in enforcing the arbitration clause outweighs the interest of the other\n                    creditors in resisting such enforcement. (3)   Australia 42     The arbitrability of avoidance claims was the\n                    subject of discussion inNew Cap Reinsurance Corporation\n                        Limited v A E Grant & Ors, Lloyd's Syndicate\n                        No 991[2009] NSWSC 662 (“New Cap\n                        Reinsurance”). In that case, the plaintiff company had\n                    brought an avoidance action against the defendants to recover certain payments\n                    made to it, on the grounds that these payments were unfair preferences under the\n                    Australian Corporations Act 2001. The defendants objected to having these claims\n                    litigated in court on the basis that they fell within the scope of an\n                    arbitration agreement between the parties. Barret J held that the scope of\n                    the arbitration clause could not include an avoidance claim brought by the\n                    plaintiff against the defendants (at [87]–[88]): [E]ven on the most generous interpretation of the words “[a]ll\n                        matters in difference between the parties arising under, out of or in\n                        connection with this Reinsurance”, they do not extend to the present\n                        proceeding under s 588FF(1) of theCorporations\n                            Actin which the liquidator of one party to the reinsurance\n                        contract seeks an order for the payment of money to that contracting party\n                        by the other contracting party. This proceeding has nothing to do with the\n                        reinsurance contract. It is a proceeding upon a statutory cause of action\n                        maintainable by the liquidator of one of the former contracting parties.The cause of action is not available to the\n                            contracting party itself. Its liquidator, when suing upon the statutory\n                            cause of action, does not attempt to enforce some right of the\n                            contracting party. Furthermore, the event giving rise to the\n                        proceeding is not anything done under, by reference to or in relation to the\n                        reinsurance contract. The relevant event is the making of a payment by one\n                        of the parties to the reinsurance contract to the other of them pursuant to\n                        a new and separate contact by which they agreed to compromise and release\n                        the rights and obligations created by the reinsurance contract. In summary, the “matters in difference” in these present\n                        proceedings are matters between NCRA’s liquidator and the defendants.\n                        They are matters arising from events that happened after the agreed\n                        termination of the reinsurance contract and, following the commencement of\n                        NCRA’s winding up, caused a statutory cause of action to become vested\n                        in the liquidator.There was no cause of action and no\n                            claim upon the defendants until the winding up of NCRA\n                            intervened. The arbitration provision in the reinsurance\n                        contract – which ceased to be in force between NCRA and the defendants\n                        when, in December 1998, they became parties to the commutation agreement\n                        – has no bearing on the statutory right that the subsequently\n                        appointed liquidator of NCRA subsequently acquired to seek orders against\n                        the defendants under s 588FF(1). [emphasis added] 43     Barret J’s judgment inNew Cap Reinsuranceappears to conflate the question of\n                    arbitrability, which deals with the question of whether a particular type of\n                    claim can be arbitrated, with the question of the scope of the arbitration\n                    clause, which is essentially an issue of construction. We are unable to agree\n                    with this approach because we regard these issues as being conceptually\n                    separate. Despite this, Barret J’s insightful analysis that the scope\n                    of the arbitration clause could not include the plaintiff’s avoidance\n                    claims, because they were only available to the liquidator of the company upon\n                    the commencement of insolvency, seems to us to be a practical approach in\n                    evaluating the kind of claims that ought not to be arbitrable.",
        "Analysis": "",
        "The concept of non-arbitrability": "44     The concept of non-arbitrability is a\n                    cornerstone of the process of arbitration. It allows the courts to refuse to\n                    enforce an otherwise valid arbitration agreement on policy grounds. That said,\n                    we accept that there is ordinarily a presumption of arbitrability where the\n                    words of an arbitration clause are wide enough to embrace a dispute, unless it\n                    is shown that parliament intended to preclude the use of arbitration for the\n                    particular type of dispute in question (as evidenced by the statute’s text\n                    or legislative history), or that there is an inherent conflict between\n                    arbitration and the public policy considerations involved in that particular\n                    type of dispute. Disputes involving an insolvent company due to the operation of the\n                insolvency regime 45     A distinction should be drawn between disputes\n                    involving an insolvent company that stem from its pre-insolvency rights and\n                    obligations, and those that arise only upon the onset of insolvency due to the\n                    operation of the insolvency regime. Many of the statutory provisions in the\n                    insolvency regime are in place to recoup for the benefit of the company’s\n                    creditors losses caused by the misfeasance and/or malfeasance of its former\n                    management. This is especially true of the avoidance and wrongful trading\n                    provisions. This objective could be compromised if a company’s\n                    pre-insolvency management had the ability to restrict the avenues by which the\n                    company’s creditors could enforce the very statutory remedies which were\n                    meant to protect them against the company’s management. It is a not\n                    unimportant consideration that some of these remedies may include claims against\n                    former management who would not be parties to any arbitration agreement. The\n                    need to avoid different findings by different adjudicators is another reason why\n                    a collective enforcement procedure is clearly in the wider public\n                    interest. 46     We, therefore, are of the opinion that the\n                    insolvency regime’s objective of facilitating claims by a company’s\n                    creditors against the company and its pre-insolvency management overrides the\n                    freedom of the company’s pre-insolvency management to choose the forum\n                    where such disputes are to be heard. The courts should treat disputes arising\n                    from the operation of the statutory provisions of the insolvency regimeper seas non-arbitrable even if the parties\n                    expressly included them within the scope of the arbitration\n                agreement. Disputes involving an insolvent company that stem from its\n                pre-insolvency rights and obligations 47     On the other hand, different considerations\n                    apply in relation to disputes involving an insolvent company that stem from its\n                    pre-insolvency rights and obligations. These disputes are binding on liquidators\n                    who, although not parties to such agreements, have stepped into the shoes of the\n                    company on liquidation. Such disputes differ from those arising on the onset of\n                    insolvency because they do not involve public policy considerations such as the\n                    protection of creditors. Nonetheless, there are other policy issues that may\n                    militate against giving effect to them. 48     First, compelling parties to arbitrate\n                    inevitably deprives them of their fundamental right of access to the courts.\n                    Such deprivation can only be justified if the parties who are compelled to\n                    arbitrate had previously consented to waiving their right to judicial remedies\n                    in lieu of arbitration. Thus, non parties to an arbitration agreement cannot be\n                    compelled to arbitrate their disputes pursuant to an arbitration agreement. When\n                    a company becomes insolvent, its assets are impressed with a statutory trust\n                    that is administered by the liquidator for the benefit of the company’s\n                    creditors (seeNg Wei Teck Michael and others v\n                        Oversea-Chinese Banking Corp Ltd[1998] 1 SLR(R) 778). That\n                    being so, the creditors of the insolvent company are the parties with the real\n                    interest in any dispute that involves the insolvent company, since they are the\n                    ones who stand to lose or gain from any diminution or augmentation of the\n                    company’s assets. Since these creditors are not parties to the arbitration\n                    agreement between the insolvent company and its arbitral counterparties, it is\n                    very hard to justify why the liquidator (who represents the creditors) should be\n                    compelled to give up its rights to judicial remedies in favour of\n                    arbitration. 49     Second, there is a well established principle\n                    that a company cannot contract with some of its creditors for the\n                    non-application of certain insolvency rules (see generallyJoo Yee Construction v Diethelm Industries[1990] 2 MLJ 66;National Westminster Bank Ltd. v. Halesowen Presswork\n                        & Assemblies Ltd. [1972] AC 785;British\n                        Eagle International Air Lines Ltd. v Compagnie Nationale Air\n                        France[1975] 1 WLR 758). The Companies (Winding Up) Rules\n                    (Cap 50, Rule 1, 2006 Rev Ed) (“CR”) creates a\n                    highly specialised form of dispute resolution in respect of claims brought\n                    against an insolvent party. Under the CR, every creditor is required to submit a\n                    proof of debt to the liquidator (r 78), and all costs relating to the\n                    proving of debts are to be borne by the creditor (r 84). The liquidator may\n                    admit or reject the proof or may require further evidence to be taken\n                    (r 92). If dissatisfied with the liquidator’s decision, a creditor\n                    may apply to the Court to reverse or vary the liquidator’s decision\n                    (r 93). Arguably, allowing an insolvent company’s creditor to\n                    arbitrate a dispute against the company falls foul of this principle, since that\n                    creditor is in effect contracting out of the proof of debt\n                process. 50     In our view, such agreements should not be\n                    allowed to be enforced against the liquidator where the agreement affects the\n                    substantive rights of other creditors. Otherwise it will undermine the policy\n                    aims of the insolvency regime. InRe Rasmachayana Sulistyo\n                        (alias Chang Whe Ming), ex parte The Hongkong and Shanghai Banking Corp Ltd\n                        and other appeals[2005] 1 SLR(R) 483, the High Court had\n                    the opportunity to consider whether a pre-bankruptcy agreement between a debtor\n                    and its creditor on service of process for court proceedings amounted to an\n                    improper contracting out of the service provisions of the Bankruptcy Rules\n                    (Cap 20, R 1, 2006 Rev Ed) (“BR”), and held that\n                    the agreement was enforceable (at [20]): There is nothing in the BR or BA pointing to the existence of a\n                        legislative scheme for an exclusive code of procedure for personal service.\n                        More importantly, there is nothing in the BR that precludes or militates\n                        against consensual arrangements for service of processes.In my view, the freedom to contract should not be fettered unless there\n                            is a clear contrary indication from the language used or from the\n                            purport of the relevant legislative provisions and/or underpinning\n                            public interest considerations. The objectives of insolvency\n                        legislation will continue to be well served by sanctioning agreements\n                        between competent contracting parties on personal issues such as the\n                        modalities of service and notice. The principal purposes of such legislation\n                        are to prevent fragmentation of assets and to sterilise certain legal rights\n                        of an insolvent debtor and these objectives are clearly not contravened or\n                        impeded by consensual arrangements on such issues. [emphasis added] 51     However, in instances where the agreement is\n                    only to resolve the prior privateinter sedisputes between the company and another party there will usually be no good\n                    reason not to observe the terms of the arbitration agreement. The proof of debt\n                    process is merely a substituted means of enforcing debts against the company,\n                    and does not create new rights in the creditors or destroy old ones (seeWight and others v Eckhardt Marine GmbH[2004]\n                    1 AC 147). Hence, even if the claim is subsequently proved to be valid and\n                    enforceable against the liquidator, the pool of assets available to all\n                    creditors at the time of the liquidation of the company is not affected. For the\n                    same reason, allowing a creditor to arbitrate his claim against an insolvent\n                    company in such circumstances does not undermine the insolvency regime’s\n                    underlying policy aims.",
        "Whether Petroprod’’s claims against Larsen are\n                arbitrable": "Petroprod’s claim against Larsen based on ss 98 and 99 of\n                the BA read with s 329(1) of the Companies Act 52     Petroprod’s claims against Larsen that\n                    are based on ss 98 and 99 of the BA read with s 329(1) of the\n                    Companies Act are only available to it at the commencement of its insolvency.\n                    They are derived from the insolvency regime and are\n                non-arbitrable. Petropod’s claim against Larsen under s 73B of the\n                CLPA 53     The analysis in relation to Petroprod’s\n                    claims against Larsen that are based on s 73B of the CLPA is, however, not\n                    as straightforward. As mentioned above at[4], these claims are brought by Petroprod in its capacity as a\n                    creditor of the four subsidiaries. The essence of these claims lies in the fact\n                    that Larsen caused the four subsidiaries to have made payments to itself when\n                    they were already insolvent, thus causing prejudice to Petroprod.\n                    Section 73B of the CLPA reads as follows: Voluntary conveyances to defraud creditors voidable.\n                            Cf. 13 Eliz. c.5 (1571) Law of Property Act 1925,\n                        s.172. 73B. —(1) Except as provided in\n                        this section, every conveyance of property, made whether before or after\n                            12thNovember 1993, with intent to\n                        defraud creditors, shall be voidable, at the instance of any person thereby\n                        prejudiced. (2)    This section does not affect the law relating to\n                            bankruptcy for the time being in force. (3)    This section does not extend to any estate or\n                            interest in property disposed of for valuable consideration and in good\n                            faith or upon good consideration and in good faith to any person not\n                            having, at the time of the disposition, notice of the intent to defraud\n                            creditors. 54     InQuah Kay Tee v Ong and\n                        Co Pte Ltd[1996] 3 SLR(R) 637 (“Quah Kay Tee”), this Court had the opportunity to\n                    consider the nature of s 73B of the CLPA in some detail. Lai Kew\n                    Chai J, who delivered the decision of the Court, traced the history of\n                    s 73B of the CLPA as being derived from s 172 of the English Law of\n                    Property Act 1925 (c 20), which in turn was based on the Statute of\n                    Elizabeth 1571 (c 5). The court held that s 73B of the CLPA was not\n                    directed merely against transfers of property that are made with the express\n                    intention of defrauding creditors, but also covered situations of constructive\n                    fraud. Furthermore, the very idea of constructive fraud was intrinsically\n                    connected to the insolvent/bankrupt status of the debtor (at [25]–[26] and [29]): 25    It is apparent from a trilogy of cases decided by\n                            Lord Hardwicke LC that \"indebtedness\" at the time of the\n                            voluntary conveyance is the all important criterion in invoking\n                            constructive fraud and thereby holding a transaction void. InTownshend v Windham(1750) 2 Ves Sen 1 at\n                            10; 28 ER 1, his Lordship stated, “the testator being\n                            indebted at the time of the appointment, it is void as against his\n                            creditors”; and inRussell v\n                                Hammond(1738) 1 Atk 13 at 15; 26 ER 9, he\n                            observed that the only voluntary settlements which are not fraudulent\n                            are those \"where the person making, is not indebted at the time\"; and inWalker v Burrows(1745) 1 Atk 93\n                            at 94; 26 ER 61, he spoke of indebtedness at the time, or soon\n                            after, as a circumstance from which a fraudulent intention might be\n                            collected. 26    These decisions lay down the one great object of\n                            the Elizabethan Statute, which is to prevent debtors from dealing with\n                            their property in any way to the prejudice of their creditors. It in\n                            fact considers a man deeply indebted as no longer the true owner of his\n                            property but rather, a trustee of it for the benefit of his creditors.\n                            Therefore, the statute gives priority to debts over voluntary and\n                            fraudulent conveyances and attempts to prevent a man in his lifetime\n                            from delaying, hindering or defrauding his just creditors. … 29    Thus, actual insolvency is not always necessary.\n                            Neither is the mere existence of some indebtedness, at the time of the\n                            gift, sufficient to invalidate the voluntary transaction.But if it can be proved that the donor, at the time he made\n                                the gift, was indebted to the extent of insolvency, or that he\n                                became so by the abstraction of the property comprised in the gift,\n                                then that is enough to invalidate the transfer\n                            … [emphasis added] 55     Therefore, properly understood, a s 73B\n                    CLPA claim is one that may straddle both a company’s pre-insolvency state\n                    of affairs, as well as its descent into the insolvency regime. For example, a\n                    debtor may try to dissipate its local assets in anticipation of a creditor\n                    obtaining judgment against him. The debtor may have other foreign assets such\n                    that it remains solvent even after such dissipation, the only problem being the\n                    creditor’s ability to enforce its judgment debt against the debtor in\n                    those foreign jurisdictions. In such a case, a s 73B CLPA claim commenced\n                    by the creditor has nothing to do with the insolvency regime. It is simply an\n                    allegation that the debtor has deliberately tried to dissipate his local assets\n                    with the intention of frustrating the creditor’s attempt to enforce any\n                    judgment against the debtor. Such an intention is the basis of a finding of an\n                    express fraudulent intention on the part of the debtor. 56     On the other hand, for cases likeQuah Kay Tee, where the creditor’s claim is based\n                    on the debtor’s conveyance of property despite of (or causing) its\n                    insolvency, there is no need for any finding of express fraudulent intention in\n                    order to sustain a claim under s 73B of the CLPA. Instead, the essence of\n                    the claim is that the debtor has transferred property to another despite (or\n                    thereby causing) its insolvent status, to the detriment of the creditor. This\n                    makes it similar to a claim based on unfair preference or transaction at\n                    undervalue under ss 98 and 99 of the BA respectively, where the\n                    prerequisite is that the debtor must be either insolvent at the time of the\n                    transaction, or had became insolvent in consequence of it (s 100(2) of the\n                    BA). In our opinion, a s 73B CLPA claim framed in such a manner must be\n                    regarded as one that is intimately intertwined with insolvency, since it is\n                    entirely contingent on the insolvent status of the debtor. 57     In the present case, it is apparent from\n                    Petroprod’s Statement of Claim dated 30 October 2009 that its\n                    s 73B CLPA claim against Larsen is based on the insolvency of the four\n                    subsidiaries when the money was paid from them to Larsen: 7.4.2 The Liquidators have received from the Defendant\n                            a set of accounts including a balance sheet as at 31 March 2009 in\n                            respect of the Relevant Subsidiaries (“The Relevant Subsidiaries\n                            March 2009 Accounts”)which show each of the\n                                Relevant Subsidiaries were insolvent at the relevant period in\n                                question. ... 8.2Section 73B of the\n                                Conveyancing and Law of Property Act (Cap. 61): constructive\n                                fraud 8.2.1By reason of the matters set out in paragraph\n                            7.4.1 above,the Relevant subsidiaries was each\n                                insolvent at the time at which each of the paymentsset\n                            out in paragraph 8.1 abovewas madein that each of the Relevant Subsidiaries was, at the time of or as a\n                            consequence of each respective payment referred to in paragraph 8.1\n                            above, unable to pay its respective debts as they fell\n                        due. [emphasis in underline in original, emphasis in italics added] 58     Accordingly, we held that Petroprod’s\n                    s 73B CLPA claim against Larsen was an in fact an insolvency claim that is\n                    non-arbitrable.",
        "Conclusion": "59     Petroprod’s claims against Larsen do not\n                    fall within the scope of the Arbitration Clause (see[7]–[22]above). Even\n                    if they do, these claims are non-arbitrable because they are in essence\n                    insolvency claims. 60     For these reasons, we dismissed Larsen’s\n                    appeal with costs."
    }
}