{
    "case_title": "Yeo Chong Lin\n      v\n      Tay Ang Choo Nancy and another appeal",
    "ncitation": "[2011] SGCA 8",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       These are two related appeals filed by the\n                    Husband, Yeo Chong Lin, and Wife, Nancy Tay Ah Choo, respectively, against the\n                    decision of a judge of the High Court (“the Judge”) relating to\n                    the division of matrimonial assets following an interim judgment\n                        (“decree nisi”) granted by the\n                    Family Court. The Judge granted 35% of the matrimonial assets to the Wife and\n                    65% to the Husband. CA 81 of 2010 is filed by the Husband and CA 82 of 2010, the\n                    Wife. Both parties are dissatisfied with various aspects of the Judge’s\n                    decision. The decision of the Judge may be found at [2010] SGHC 126\n                    (“GD”). 2       The marriage of the parties is among the longest\n                    to come before the courts in recent years. It was a 49 year marriage. The\n                    parties were married in 1956. The Husband was the breadwinner and the Wife was a\n                    full-time homemaker throughout the entire marriage. In April 2005, the Wife\n                    petitioned for divorce on the ground of adultery. Adecree\n                        nisiwas granted in July 2005.There are four children from the\n                    marriage and they are all grown-up, the youngest having been born in 1967. At\n                    the time thedecree nisiwas granted, the Husband\n                    was aged 73 and the Wife 71. An exceptional feature of this case is that the\n                    matrimonial assets are huge, estimated by the Judge to be in the region of about\n                    S$116,560,000. It was not disputed that the accumulation of this large amount of\n                    wealth was due largely to the efforts, business sense and acumen of the Husband,\n                    who came from a rather poor background. In the words of the Judge, “[d]ue\n                    to the Husband’s unceasing and tireless efforts, he was able to build up\n                    an extremely profitable and diverse business in the marine industry” (GD\n                    at[10]). His assets included a substantial\n                    shareholding (held through his company, Yeo Holding Pte Ltd\n                    (“YHPL”)) in a publicly listed company, Swissco International\n                    Limited (“SIL”). 3       The shares in YHPL which are held by the Husband\n                    constitute a large proportion of the matrimonial assets. As at 30 May 2006, the\n                    Accounting and Corporate Regulatory Authority (“ACRA”) records\n                    showed that the shares in YHPL were held by the following members of the\n                    family: Husband - 5,592,298 shares; Two daughters,\n                        Catherine Yeo Lee Twan (“Catherine”) and Margaret Yeo Lee\n                        Hiang (“Margaret”) - 1,516,556 shares (758,278 shares each);\n                        and Son, Alex Yeo Kian Teong (“Alex”) –\n                        2,369,618 shares. 4       As at 16 September 2009, ACRA records showed\n                    that the shares in YHPL were held by the following persons: Husband – 5,213,160 shares; Husband’s\n                        brother, Yeo Chong Boon (“Yeo Chong Boon”) – 947,847\n                        shares; Husband’s sister, Anna Yeoh Ai Tin (“Anna\n                        Yeoh”) – 947,847 shares; and Son, Alex–\n                        2,369,618 shares. 5       After the Wife had filed for divorce, the\n                    Husband acquired additional assets which he contends should not be regarded as\n                    part of the matrimonial assets to be divided. These assets are the\n                    following: (a)property at 202A Lornie Road, which was purchased\n                            in May 2005, and which was sold before the hearing of the ancillary\n                            matters;(b)property at 9 Wak Hassan Drive purchased in\n                            November 2005 in his name and the party cited and where there was an\n                            outstanding loan;(c)property at 74 Andrews Terrace bought in 2008 in\n                            his name and the party cited and where there was an outstanding\n                            loan;(d)a number of luxury vehicles bought in 2008 and\n                            2009 on hire purchase;(e)800,000 shares in Roxy Pacific Holdings Ltd\n                            allegedly acquired after March 2008;(f)option to subscribe for 500,000 shares in\n                            SIL;(g)614,000 shares in SIL; and(h)6 Chestnut Close, which was purchased in October\n                            2007 by YHPL.The Husband argues that these assets should not be regarded as\n                    matrimonial assets because after the Wife left the matrimonial home, and in any\n                    case after the divorce proceeding was filed, the marriage had effectively come\n                    to an end. He contended that the cut-off date (“operative date”)\n                    for determining matrimonial assets should be the date when the parties separated\n                    or, at the latest, when the divorce proceeding was filed. This point, in turn,\n                    raises the issue as to whether, under the Women’s Charter, there ought to\n                    be an operative date for determining what assets would fall within the pool of\n                    matrimonial assets for division and what that operative date should be. These\n                    are issues which we will consider.6       Other issues which also arise in these appeals\n                    are:(a)How the shares in YHPL given by the Husband to\n                            the son and two daughters ought to be regarded; the Judge decided that\n                            these shares should be regarded as belonging to the\n                        Husband.(b)How the jewellery given by the Husband to the\n                            Wife during the marriage ought to be regarded; the Husband has alleged\n                            that during the marriage he gave the Wife a considerable number of\n                            jewellery items.(c)Whether the apportionment of matrimonial assets\n                            at 35:65 in favour of the Husband is just and equitable.Summons 3287/2010 – Husband’s application to adduce\n                further Evidence on Appeal7       Before we examine the question of division of\n                    matrimonial assets, we should first refer to Summons No 3287/2010/D (“SUM\n                    3287”), filed by the Husband seeking leave to adduce fresh evidence by\n                    affidavit for the purposes of the hearing of the two appeals. The fresh evidence\n                    relates to the fact that their two daughters, Catherine and Margaret, have filed\n                    High Court Suit No S373/2010/C (“S 373/2010”) on\n                        21stMay 2010 claiming beneficial ownership of\n                    the 1,516,556 shares in YHPL (“Daughters’ Shares”) which the\n                    Judge at GD [28] had held to belong to\n                    the Husband and placed them in the pool as matrimonial assets to be divided. The\n                    Daughters’ Shares are estimated to have a value of\n                $14,512,086.03.8       The Husband averred that the further evidence\n                    should be admitted as it relates directly to the heart of the matter in these\n                    appeals – who possesses the beneficial ownership of the 1,516,556 shares.\n                    Clearly, if the shares belong to the two daughters, they cannot be considered as\n                    part of the matrimonial assets to be divided even though the Husband had claimed\n                    at the hearing of the ancillary matters before the Judge that the beneficial\n                    ownership to the shares vested in him (although they are registered under the\n                    daughters’ names) because the daughters had not provided any consideration\n                    for the same. The hearing of the ancillary matters was held on 16 to\n                    17 September 2009 and the decision of the Judge was released 26 April\n                    2010. The two daughters commenced S 373/2010 only in May 2010. As the documents\n                    relating to S 373/2010 only came into being after the decision had been\n                    rendered, they are, therefore, not subject to the requirements as set out inLadd v Marshall[1954] 1 WLR 1489\n                        (“Ladd v Marshall”). Moreover,\n                    even ifLadd v Marshallshould apply, the facts in\n                    this case would have satisfied the criteria for accepting fresh evidence on\n                    appeal as laid down in that case.9       The Wife initially disputed the admission of the\n                    further evidence on the ground that the evidence related to a matter which had\n                    already been brought to the attention of the Judge. She pointed to the fact that\n                    on 16 September 2009, she found from an ACRA search that the daughters were\n                    no longer listed as shareholders of YHPL and that their shares had been\n                    transferred to the Husband’s sister, Anna Yeoh and the Husband’s\n                    brother, Yeo Chong Boon. These facts were brought to the attention of the Judge\n                    on 17 September 2009. On 22 September 2009, with the leave of court,\n                    the daughters filed an affidavit to confirm that the shares were transferred\n                    without their consent and that the daughters would be “taking up this\n                    matter in due course to investigate”. This affidavit of the two daughters\n                    was served on the Husband the next day. Accordingly, the Wife asserted that what\n                    was sought to be admitted as fresh evidence was already brought to the\n                    court’s attention before the decision was made by the Judge and that it\n                    did not fulfil the conditions laid down inLadd v\n                        Marshall. We should add that while the two daughters’\n                    shares in YHPL were purportedly transferred out without their consent, for the\n                    purposes of these appeals, the shares will be treated as still being registered\n                    under their names.10     It is true that the dispute between the\n                    Husband and two daughters over the beneficial ownership of the Daughters’\n                    Shares was already highlighted to the Judge and many of the documents filed as\n                    evidence for the daughters’ High Court suit were already admitted in this\n                    case. Moreover, at the hearing before the Judge, the daughters had also\n                    indicated that they would challenge their father’s act in taking away\n                    their legal and beneficial ownership in the Daughter’s Shares. Therefore,\n                    in a sense, by instituting S 373/2010 nothing really new has happened, only that\n                    the daughters have taken the matter one step further as they had earlier\n                    indicated.11     However, the fact of the matter is that the\n                    filing of S 373/2010 was certainly an event which occurred after the judgment\n                    was delivered. The documents filed in the writ would not have been documents\n                    which the Husband could have produced to the Judge. It cannot be gainsaid that\n                    the institution of this writ is directly relevant to the question as to whether\n                    the Judge is correct to have treated the Daughters’ Shares as belonging to\n                    the Husband and thus formed part of the matrimonial assets. Let us assume for a\n                    moment that the decision of the Judge on this question is affirmed and let us\n                    further assume that at the trial of S 373/2010 the court held that the\n                    Daughters’ Shares belonged to them beneficially as gifts given by their\n                    father and that their father was not entitled to take away their shares without\n                    their consent. Where would that scenario leave the Husband? The Husband has\n                    accused the daughters of aiding their mother (the Wife) in trying to have the\n                    shares classified as matrimonial assets by only filing a lawsuit after the\n                    decision was released when they could have filed the writ in the four-year\n                    period when the ancillary matters were pending. Without going into the merits of\n                    this accusation made against the daughters, what we see is that the Husband now\n                    faces a real prospect of a lose-lose situation. We note that while the daughters\n                    did not realise that their father had removed their names as owners of those\n                    shares until the day of the hearing of the ancillary matters,ie, 16 September 2009, it seems to us that if their stand\n                    had been that the shares in any event belonged to them beneficially then they\n                    should have made their position definite and clear to their parents ahead of\n                    time so that they would not need to argue unnecessarily over those shares. To\n                    bring the action only after the Judge had ruled that the Daughters’ Shares\n                    constituted part of the matrimonial assets to be distributed between their\n                    parents would be to inflict a double whammy upon their father, the Husband.\n                    Having said that, obviously nothing is certain until the disposal of S 373/2010,\n                    as the mere filing of the suit does not mean that the daughters will succeed in\n                    their claim. They alleged that the shares were given to them in consideration of\n                    their years of service working for their father’s companies as well as in\n                    lieu of bonuses they were entitled to. The Husband is defending the\n                    daughters’ claim for the shares and if he should succeed in his defence,\n                    it would still be correct to include the shares in the pool of matrimonial\n                    assets.12     Under s 37(2) of the Supreme Court\n                    Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”),\n                    this Court has “full discretionary power” to receive further\n                    evidence on appeal. Under ss 37(3) and 37(4) of the SCJA, further evidence\n                    “as to matters which haveoccurred after the date of\n                        the decisionfrom which the appeal is brought” (emphasis\n                    added) are distinguished from matters which occurred before the date of decision\n                    and does not need to satisfy the requirement of special grounds (ie, the conditions laid down inLadd\n                        v Marshall) to be admitted. These provisions are also reflected\n                    in O 57 r 13(2) of the Rules of Court (Cap 322, R 5,\n                    2006 Rev Ed). The fresh evidence which the Husband seeks to adduce\n                    clearly relates to events which occurred after the decision of the Judge and\n                    thus do not need to satisfy the requirement of special grounds. The fact that\n                    the daughters’ claim to be entitled to those shares was a matter which was\n                    brought to the attention of the Judge does not mean that S 373/2010, which was\n                    instituted after the decision of the Judge, is not an event which occurred after\n                    the decision.13     Obviously while this Court has the general\n                    discretion to allow a party to adduce fresh evidence, the principle offinis litiumshould not be lightly disregarded. In the\n                    English House of Lord cases ofMulholland v\n                        Mitchell[1971] AC 666 andMurphy v\n                        Stone-Wallwork (Charlton) Ltd[1969] 1 WLR 1023, it was\n                    held that no precise formulation should be laid down regarding the admission of\n                    further evidence on matters that occurred after the decision. Clearly, further\n                    evidence which will materially alter the basis of the decision should be\n                    allowed. It stands to reason that the conditions governing the admission of\n                    further evidence on matters that occurred after trial should not be more\n                    restrictive than the special grounds laid down inLadd v\n                        Marshall. The second special ground enunciated inLadd v Marshallonly requires the further evidence to\n                    have an important influence on the outcome of the appeal, but it need not be\n                    determinative. Therefore, perhaps, the test should be: would the further\n                    evidence have aperceptible impacton the decision\n                    such that it is in the interest of justice that it should be\n                admitted?14     In this case, the further evidence which was\n                    sought to be admitted by the Husband clearly goes to the heart of the decision,\n                    and could alter the basis of the decision regarding the matrimonial assets. If\n                    the outcome of S 373/2010 is that the beneficial ownership of the\n                    Daughters’ Shares belongs to the daughters and not the Husband, then they\n                    should not form part of the pool of matrimonial assets for division. We should,\n                    at this juncture, place on record that at the commencement of the hearing by\n                    this court of SUM 3287, the Wife quite rightly recanted and withdrew her\n                    objection to the admission of the fresh evidence for the purposes of the hearing\n                    of the appeal. Accordingly, we granted the application made in SUM\n                3287.The operative date for division of matrimonial assets15     Section 112(10)(b) of the Women’s\n                    Charter (Cap 353, 2009 Rev Ed) (“the Charter”)\n                    defines a “matrimonial asset” as “any ... asset of any\n                    nature acquired during the marriage by one party or both parties to the\n                    marriage”. In the present case, given the long lapse of some four years\n                    between the date of thedecree nisiand the\n                    hearing of the ancillary matters, the question of the operative date for\n                    determining the matrimonial assets becomes of importance. As stated in[5]above, some assets were bought by the Husband\n                    after thedecree nisihad been granted and the\n                    Wife has contended that those assets should still be treated as matrimonial\n                    assets. The Wife alleged that the delay was due to the Husband’s\n                    persistent refusal to make full and frank disclosure and his constant change of\n                    solicitors.16     The Judge, having consideredYap Hwee May Kathryn v Geh Thien Ee Martin and another[2007] 3 SLR(R) 663 (“Yap Hwee May\n                        Kathryn”) andLim Ngeok Yuen v Lim Soon\n                        Heng Victor[2006] SGHC 83, held that the operative\n                    date for the purposes of determining matrimonial assets should be the date on\n                    which thedecree nisiwas issued (see GD [33]). In this case, the Judge held that the\n                    operative date would be July 2005, when thedecree\n                        nisiwas granted.17     The Husband submits that, in any event, it\n                    would only be just that at the very latest, the operative date should be the\n                    date on which the divorce petition was filed,ie,\n                        20thApril 2005. His basic reasoning is that once\n                    a spouse has decided to leave the matrimonial home or file a Petition for\n                    divorce (whichever shall be the earlier), the marriage has effectively ended and\n                    the moral or emotional support which the spouses have for each other would also\n                    have ceased and it would be unjust for the party who wanted to end the marriage\n                    to demand, as of right, any asset which the other party accumulates\n                    thereafter.18     The Wife submits that the starting point is\n                    that all assets, whether acquired during the course of marriage or after the\n                    breakdown of the marriage, fall within the pool of matrimonial assets. The date\n                    of thedecree nisishould not be taken as the\n                    operative date. The Wife, while recognising that some authorities were against\n                    her, effectively contended that until thedecree\n                        absoluteis made, the “marriage” still exists in\n                    law and any assets acquired by any party until then should be regarded as\n                    matrimonial assets. In this regard, the Wife relies on the decision of this\n                    Court inYeo Gim Tong Michael v Tianzon Lolita[1996] 1 SLR(R) 633 (“Tianzon”) for the proposition that assets acquired by a\n                    spouse after the breakdown of the marriage should still be included as\n                    matrimonial assets. WhileTianzonwas a case\n                    decided under the previous version of the Charter, the phrase in question,\n                    “during the marriage”, was also present in that earlier version.\n                    This Court in interpreting the phrase “during the marriage” in the\n                    previous Section 106 (1) and (3) of the Women’s Charter (which is similar\n                    to the present s120(10)(b)) held that the marriage “is only dissolved\n                    when thedecree nisi is made absolute”\n                    (emphasis added). In this regard, we note that the High Court inLeong Mei Chuan v David Chan Teck Hock[2001] SGHC 80 (“Leong Mei\n                    Chuan”) appliedTianzonto the\n                    current s 112 of the Charter and held that the meaning accorded to the\n                    phrase “during the marriage” inTianzonwould similarly apply to the same phrase in the present\n                    s 112(10)(b). The court there held that the fact that the husband was\n                    allotted shares after the breakdown of the marriage was a factor to determine\n                    the Wife’s entitlement to them. Although the court inLeong Mei Chuanheld that even shares vested after the breakdown\n                    of the marriage were matrimonial assets, the wife in fact restricted her claims\n                    to shares vested in the husband up to the date of thedecree\n                        nisi. What is clear fromLeong Mei\n                        Chuanis that under s 112 of the Charter, assets acquired by\n                    a party after the breakdown of marriage should still be regarded as matrimonial\n                    assets.19     There are a number of ways one can look at the\n                    phrase “during the marriage”. First, one could say that until a\n                    marriage is dissolved finally by adecree\n                    absolute, the marriage still subsists in law and therefore anything\n                    obtained by a spouse before then should be regarded as an asset acquired during\n                    the marriage. The second is to regard the grant of thedecree\n                        nisias effectively the end of the marriage and any assets\n                    acquired thereafter should not be treated as having anything to do with the\n                    marriage. The third is to treat the marriage as having ended even earlier when\n                    the marriage has irretrievably broken down, and the parties have stayed apart\n                    and gone their separate ways, as the Husband contends here.20     In the recent case ofAJR v\n                        AJS[2010] 4 SLR 617 (“AJR”), the High Court had the occasion again to consider\n                    the question of the operative date and decided in favour of the date of thedecree nisi. The judge there reasoned that thedecree nisieffectively put an end to the\n                    marriage and that event indicated that the parties “no longer intend to\n                    participate in the joint accumulation of matrimonial assets nor in any further\n                    joint investment in any matrimonial assets with the associated market risk of a\n                    fall in the value of those joint investments”, unless a contrary\n                    intention was demonstrated by them (AJRat\n                        [4]). In coming to that view, the\n                    judge inAJRnoted what this Court stated inSivakolunthu Kumarasamy v Shanmugam Nagaiah and\n                        Anor[1987] SLR(R) 702 (“Sivakolunthu”) at [25]:The grant of a decreenisiis a recognition\n                        by the “court that the marriage is at an end”. When such a\n                        decree is pronounced, there is, as Lord Wright said [inFender v St John-Mildmay[1938] AC 1 at 45-6], no\n                        longer any matrimonial home, noconsortium\n                            vitaeand no right on either side to conjugal rights.21     Returning toYap Hwee May\n                        Kathryn, we note that the judge there reasoned that adopting the\n                    date of thedecree nisias the operative date is\n                    more appropriate than that of the date of thedecree\n                        absolutebecause (i) if all the relevant facts were before the\n                    court at the grant of thedecree nisi, there would\n                    have been no reason why the division of the matrimonial assets could not or\n                    should not have been decided at that point in time, and (ii) the date of thedecree absolutecould not have been\n                    ascertained at the time of division of matrimonial assets since thedecree absolutewould only be granted after the\n                    ancillary matters had been settled. Adopting thedecree\n                        absolutedate as the operative date would clearly cause\n                    unnecessary uncertainty as it would necessarily be a date in the future. As\n                    such, such an operative date would be impracticable. In the nature of things,\n                    the latest operative date would have to be the date of the hearing. Even on this\n                    basis, we need to make one clarification. For example, if on that day it is\n                    known that a spouse is likely in the future to receive an employment benefit due\n                    to his past services, it does not follow that the court may not take that into\n                    account in its division.Positions in some other common law jurisdictions regarding operative\n                date22     Counsel for the parties had, at our request,\n                    done some further research into the law and/or practice in other common law\n                    jurisdictions on the question of the operative date for the division of\n                    matrimonial assets. The positions in Malaysia, England, Hong Kong, Scotland,\n                    Australia, New Zealand and Canada were explored.23     In Malaysia, the Law Reform Marriage and\n                    Divorce Act 1976 provides in s 76(1) that the court has the power, when\n                    granting a decree of divorce, to order the division between the parties of\n                    “any assets acquired by them during the marriage”, a set of\n                    wording very similar to ours. InChew Ling Hang v Aw Ngiong\n                        Hwa[1997] 3 MLJ 107 at 113, the Malaysian court held\n                    that a party seeking the division of matrimonial assets must make the\n                    application “before the decree nisi or at least before it was made\n                    absolute”. This would appear to suggest that the relevant date in\n                    Malaysia could not be the time when thedecree\n                        nisiis made absolute.24     In England, under s 24(1) of the\n                    Matrimonial Causes Act 1973, orders for property division may be made upon the\n                    grant of a decree of divorce, nullity of marriage or judicial separation as well\n                    as even after a decree of divorce or nullity of marriage is made absolute. Leave\n                    of court is required to apply for ancillary relief post-decree absolute. It does not appear that in England the date of\n                    separation is the necessary operative date. There is a suggestion that the date\n                    the court exercises the power to apportion assets would be a “natural\n                    date” – seeCowan v Cowan[2001] EWCA 679 at [132]. Invariably, the circumstances of the case\n                    will determine the approach the court would take to reach a just\n                result.25     In Hong Kong, the assets of the spouses which\n                    can be divided upon divorce are the same as those in England. They encompass\n                    property and other financial resources which each spouse “has or is\n                    likely to have in the foreseeable future”: s 7 of the Matrimonial\n                    Proceedings and Property Ordinance. Thus, even property acquired by a party\n                    before marriage will be put in the pool. The court will determine the assets\n                    (and their values) to be taken into account as at the date of hearing. We should\n                    add that even though assets acquired by one spouse before marriage, as well as\n                    gifts, (which are classified as non-matrimonial) may be taken into account by\n                    the court, the discretion rests with the court as to whether they should be\n                    shared and in what proportion. It would seem that “the longer the\n                    marriage the more likely non-matrimonial property will become merged or\n                    entangled with matrimonial property” and where the marriage is short\n                    “non-matrimonial assets are not likely to be shared unless needs require\n                    this”: seeKMD v PIB[2010] HKFamC 14 (“KMD”).\n                    Assets acquired post-separation may or may not qualify as\n                    “non-matrimonial” property. Fairness will be the order of the\n                    day.26     In Australia, by s 79(1) of the Family\n                    Law Act 1975, the court is mandated to “make such orders as it considers\n                    appropriate”. The position in Australia is similar to that in England and\n                    Hong Kong as all assets owned by the parties at trial are under the purview of\n                    the Court for equitable distribution. While England and Hong Kong have no\n                    statutory definition for matrimonial assets to limit the assets under the\n                    Courts’ purview, Australia has a statutory definition for matrimonial\n                    assets. Under s 4 of Family Law Act 1975, “property” in\n                    relation to parties to a marriage means “property to which those parties\n                    are, or that party is, as the case may be, entitled, whether in possession or\n                    reversion”. It is a broad definition that leaves all assets owned by the\n                    parties under the Court’s purview as, unlike ours, it does not seek to\n                    carve out non-matrimonial property. It seems to us that the Family Law Act 1975\n                    leaves it entirely open as to where the line should be drawn or what property of\n                    either spouse should be brought into the pool for division, leaving it to the\n                    court to decide in the light of the circumstances of each case what would be an\n                    appropriate order to make to achieve a just result: seeScott\n                        v Scott[2006] FamCA 1379 at [113].27     In Scotland, the operative date is statutorily\n                    provided. Under s 10(4) of Family Law (Scotland) Act 1985, “the\n                    matrimonial property” is defined as “all the property belonging to\n                    the parties or either of them at the relevant date”. The “relevant\n                    date” is defined under s 10(3) of Family Law (Scotland) Act 1985 to\n                    mean whichever date is earlier (a) the date which the parties ceased to cohabit\n                    or (b) date of service of the summons in the action for divorce.28     In New Zealand, the operative date is also\n                    statutorily provided. The general operative date is the date of separation.\n                    Under s 9(4) of the Property (Relationships) Act 1976, the parties’\n                    assets are treated as “separate property” (non-matrimonial assets\n                    in our context) if they are acquired “while they are not living together\n                    as husband and wife”. However, s 8 of the New Zealand statute\n                    singles out the “family home” and “family chattels”\n                    as unique matrimonial assets that will be relationship property “whenever\n                    acquired”. Thus, such properties in New Zealand have no operative\n                    date.29     In Canada, the provinces do not appear to have\n                    taken a uniform approach. In British Columbia’s Family Relations Act and\n                    Yukon’s Family Property and Support Act (RSY 2002), matrimonial property\n                    is identified on the basis of whether the property was “ordinarily used\n                    for a family purpose”. In the other provinces, generally they have\n                    classes of property that are excluded from the pool of assets subject to\n                    distribution. In Ontario, the operative date is likely to be the same as the\n                    valuation date. By virtue of s 4(1) of Ontario’s Family Law Act 1990,\n                    property for division is usually valued as at the date of separation, and\n                    presumably that would also be the cut-off date, but the court is not precluded\n                    from adopting a later date if the circumstances warrant it and the eventual\n                    outcome will be equitable: seeTran v Ma(2007) NWTSC 33.30     In Alberta, there is no clear operative date\n                    as under s 7 (3)(c) of the Matrimonial Property Act (RSA 2000), property\n                    acquired after adecree nisiis liable to be\n                    distributed. Under s 7(2) of the Matrimonial Property Act (RSA 2000), in\n                    respect of a property acquired before marriage, the market value of the property\n                    at the time of marriage is exempted from distribution. Similarly for gifts\n                    received during marriage, the market value of the gift at the time thereof will\n                    be exempted. What is of interest to note is that under s 7(3) the court is\n                    required to distribute matrimonial property in a manner that it considers\n                    “just and equitable”. Further, under s 8(f), one of the\n                    factors which the court has to take into account in making distribution is\n                    “whether the property was acquired when the spouses were living separate\n                    and apart”.31     What this review of the law and practice in\n                    some common law jurisdictions shows is that there is no uniformity of approach.\n                    It seems to this court that there is no one single formula or test which is\n                    adopted generally. What is clear is that in every jurisdiction, in its own way,\n                    the court seeks to achieve a just result.Should there be an operative date for division of matrimonial assets\n                in Singapore32     It seems to us that Parliament has very aptly\n                    recognised that it would not be wise to lay down a fixed date for the purposes\n                    of determining what assets would fall within the pool of matrimonial assets and\n                    what would not. A fixed cut-off date may not necessarily secure a just result in\n                    every case. The simple truth is that the circumstances under which an asset\n                    could be acquired by a spouse are so varied that it would be best to leave it to\n                    the court to determine where the line should be drawn after taking into account\n                    all the circumstances. It may be useful to illustrate the problems through\n                    several examples.33     Take a case like the present, where the\n                    husband buys a property jointly with his new companion after thedecree nisi. Clearly, they are planning for their\n                    future. It would be wholly unreal to treat this property as a matrimonial asset\n                    when that would be the last thing on their mind. It seems to us that there could\n                    be two reasons why a spouse seeks to contend that such a property is\n                    nevertheless matrimonial property. First, there is the belief that if such a\n                    property is not regarded as a matrimonial property, it would be all too easy for\n                    a spouse to reduce the matrimonial assets to be divided by merely buying a\n                    property after thedecree nisiis granted. In our\n                    opinion, this belief overlooks one fact. The funds which that spouse has used to\n                    buy the property do not cease to be matrimonial assets and it must be put back,\n                    at least notionally, for the purposes of division so that the other spouse would\n                    not lose out. By so restoring the funds into the pool, fairness is achieved.\n                    Second, it is assumed that the value of property will always go up. What if it\n                    goes down? There were instances in the past when property prices dipped. Why\n                    should the spouse who has nothing to do with the purchase bear the loss? The\n                    possible downside to a property purchase is often overlooked.34     Next, let us take a variant of the same\n                    example. Let us say that the property was not bought after thedecree nisibut before the grant of that decree. How\n                    should the property be viewed? The answer can hardly be a straightforward one.\n                    Admittedly, the same arguments can be made to say that the property should not\n                    be regarded as a matrimonial asset. All the circumstances would have to be\n                    considered before a final decision is taken.35     Again, let us say that the asset bought is not\n                    a real property but shares in a company (whether listed or otherwise). Because\n                    of the inherent volatility of share values, an even stronger case can be made\n                    that the purchasing spouse should bear the risk relating to the purchase,\n                    subject always to that spouse restoring to the common pool the funds he had\n                    taken to make the purchase of the shares.36     It seems to us that practicality would suggest\n                    that there should be an operative date. However, the problem is in determining\n                    what that operative date should be, bearing in mind the possible diverse assets,\n                    and the different circumstances under which they were acquired. Indeed, it does\n                    not follow that there can only be one operative date. Multiple dates are\n                    distinctly possible, depending on the nature of the assets and the circumstances\n                    surrounding their acquisition. Ultimately, perhaps the adoption of an operative\n                    date or dates may not really be that critical as compared to arriving at a just\n                    and equitable division.What should be the operative date in this case?37     In his submission to us, the Husband avers\n                    that in the context of the Charter, the operative date for the division of\n                    matrimonial assets should be the date of filing of the divorce petition because\n                    there would be certainty as to that date. In his contention, any later date\n                    would be unjust because following the filing of the petition, the spouses would\n                    have nothing to do with each other and the marriage would have effectively ended\n                    save for the formal dissolution. Earlier, the husband took the position that it\n                    should be the date the parties separated.38     On the other hand, the Wife submits that even\n                    assets acquired by one party after the breakdown of the marriage should fall\n                    within the pool of matrimonial assets. If there needs to be a cut-off date, it\n                    should be the date of the final hearing,ie,\n                    hearing of the ancillary matters after thedecree\n                        nisi. She argues that adopting the date of the hearing as the\n                    cut-off date would produce the fairest result.39     In our opinion, Parliament obviously\n                    appreciated that it would be unwise, and difficulties could arise, if a definite\n                    cut-off date is prescribed. Any prescribed adherence to a timeline may not\n                    necessarily be conducive towards attaining a just and equitable outcome.\n                    Moreover, as indicated earlier at[36], even\n                    in a case where a court is inclined to adopt a particular point in time as the\n                    cut-off date for dividing the matrimonial assets, it does not follow that that\n                    date should necessarily apply across the board to all categories of assets which\n                    the court is expected to divide. Speaking broadly, and as indicated at[19], there are possibly four timelines which a\n                    court could conceivably adopt. The first is the date of separation. The second\n                    is the date on which the petition of divorce is filed. The third is the date on\n                    which adecree nisiis granted. The fourth is the\n                    date of hearing of ancillary matters (including the date of the hearing of an\n                    appeal). As stated in[21], we have ruled\n                    out the date of the grant of thedecree absoluteas an option because it is a date in the future and cannot realistically be\n                    applied. Of the four possible cut-off dates, it seems to us that generally\n                    speaking it would be sensible to apply either the date of thedecree nisior the date of the hearing of the ancillary matters.\n                    Much would depend on the fact-situation. As indicated at[36], there is nothing to preclude the court from\n                    applying different cut-off dates to different categories of assets if the\n                    circumstances so warrant. The argument that it is wholly unreal to treat assets\n                    acquired after thedecree nisias\n                    “matrimonial assets”, when the marriage contract has for all\n                    practical purposes come to an end and there is no longer any marriage, is not\n                    without merit, subject always to the proviso that the spouse who made the\n                    purchase should restore to the common pool whatever money he had taken to fund\n                    the purchase. Once an asset is regarded as a matrimonial asset to be divided,\n                    then for the purposes of determining its value, it must be assessed as at the\n                    date of the hearing.40     Reverting to the present case, we do not think\n                    that the Judge was wrong to have held that the operative date should be the date\n                    on which thedecree nisiwas granted. The adoption\n                    of this operative date would not bring about an unjust result. Between the date\n                    of thedecree nisiand the determination of the\n                    ancillary matters, there was a lapse of some four long years. The spouse\n                    undertaking any new investment should be made to bear the consequences of his or\n                    her act provided that he or she restores to the common pool the funds which\n                    he/she had used to acquire the new asset. But this is where the difficulty lies\n                    as far as the present case is concerned. The Husband has not disclosed clearly\n                    in respect of the assets acquired after the filing of the divorce petition how\n                    much funds he had taken out from his savings to acquire each of these assets so\n                    that the same may be restored to the common pool. Given the adverse inferences\n                    that might be drawn in these circumstances, we think it would be best to deal\n                    with this group of assets in connection with the Husband’s failure to make\n                    full and frank disclosure (see[57]below).Shares in YHPL given by the Husband to the son and two\n                daughters41     We have earlier referred to the\n                    Daughters’ Shares which are very much in dispute (see[7]above). The position taken by the Husband\n                    before the Judge was that the Daughters’ Shares were shares which the\n                    daughters held on trust for him because they have yet to provide any\n                    consideration for the same. Interestingly, the Husband has not made a similar\n                    assertion in respect of the shares which were transferred to the son Alex\n                    (“Alex’s Shares”). The Judge not only held that the Husband\n                    was the beneficial owner of the Daughters’ Shares but also held that the\n                    Husband was the beneficial owner of Alex’s Shares. Alex’s 2,369,618\n                    shares in YHPL were valued at$22,675,127.24. The\n                    Judge’s reasoning was that the position of Alex’s Shares was\n                    analogous to that of the Daughters’ Shares. She said at [28] of the GD: “There is no direct\n                    evidence as to how the husband regards the shares in his son’s name but it\n                    is probable that he has a similar attitude to them and that as far as he is\n                    concerned, the son holds the shares at the husband’s pleasure”. The\n                    approach taken by the Judge seems to be that since there was evidence that the\n                    Husband regarded himself as the beneficial owner of the Daughters’ Shares\n                    it was logical to conclude that he would treat Alex’s Shares in the same\n                    way as the circumstances surrounding the transfer of the shares to the son were\n                    no different from those relating to the transfer of the Daughters’ Shares\n                    to the daughters.42     It is settled law that an appellate court\n                    should defer to the trial judge’s finding of fact unless it can be\n                    established that the finding of fact is plainly wrong or unjustified on the\n                    totality of the evidence before the trial judge (Peh Eng Leng\n                        v Pek Eng Leong[1996] 1 SLR(R) 939). However, the\n                    appellate court would be in as good a position as the trial judge to make\n                    finding of facts when it is not based on the veracity and credibility of the\n                    witness (as in this case where the evidence was adduced in affidavits) but on an\n                    inference drawn from the facts or the evaluation of primary facts (seeTat Seng Machine Movers Pte Ltd v Orix Leasing Singapore\n                        Ltd[2009] 4 SLR(R) 1101 at [41]).43     As stated in[41]above, the Judge’s finding as regards Alex’s\n                    Shares was based on a simple deduction from her finding as regards the\n                    Daughters’ Shares. On the evidence before the court, we could not help but\n                    believe that the Husband made the assertion that the daughters held their shares\n                    on trust for him because he took umbrage with the fact that the daughters,\n                    instead of taking a neutral stance, sided with their mother (the Wife) in the\n                    current matrimonial dispute between the parties. However, the fact of the matter\n                    is that the questions regarding the beneficial ownership of the Daughters’\n                    Shares were never fully explored. The daughters did not intervene in the\n                    proceedings. Neither did they file any affidavit in response to their\n                    father’s (the Husband’s) claims that the daughters were bare\n                    trustees of those shares. The question of the transfer of the shares to the\n                    daughters could very well be regarded as gifts, where the presumption of\n                    advancement would apply, and that was not addressed by the Judge. What is more\n                    significant is that, as stated before, shortly after the Judge had given her\n                    verdict, the daughters took out S 373/2010 claiming beneficial ownership of the\n                    Daughters’ Shares. Now that the Husband is facing a distinct prospect that\n                    the court in S 373/2010 could declare that the 1,516,556 shares belong to the\n                    daughters, it would be wholly inequitable to require the Husband to share\n                    something as a matrimonial asset when the very thing could very well be held not\n                    to belong to him (if the court were to hold in S 373/2010 that the\n                    Daughters’ Shares were given by the Husband to the daughters as\n                    gifts).44     Admittedly, some aspects of the\n                    Husband’s conduct pertaining to the shares in YHPL left much to be\n                    desired. He had in November 2004 forged the Wife’s signature on a share\n                    transfer form to transfer 1,885,996 shares in YHPL which were registered in the\n                    Wife’s name to himself and allegedly a daughter (in respect of 195,273\n                    shares - however, it is not clear to whom these shares in fact went). He had\n                    also transferred the Daughters’ Shares (without their consent) to his\n                    brother and a sister on the pretext that the latter were each entitled to\n                    947,847 of the shares pursuant to two trust documents executed in November 2004.\n                    The Husband first mentioned these trust documents only in July 2008. The Judge\n                    did not accept this assertion and treated the shares transferred to the\n                    Husband’s siblings as his. The Husband had also not been entirely\n                    forthright in disclosing his assets so much so that the Judge drew an adverse\n                    inference against him. Several injunctions had also been obtained against the\n                    Husband to restrain him from dissipating matrimonial assets. For example, there\n                    was a court order granted on 21 June 2005 to restrain the Husband in his\n                    capacity as managing director and shareholder of YHPL from disposing the assets\n                    of YHPL – namely, the matrimonial home at No. 14 Lornie Road. However, on\n                    6 March 2006, the Husband called for an extraordinary general meeting\n                    (“EGM”) of YHPL and passed a resolution approving the sale of No\n                    14 Lornie Road. He was the sole attendee at the EGM.45     In view of the foregoing, the Judge found the\n                    Husband to be someone who would manipulate the shareholdings of YHPL for his own\n                    purposes and thus YHPL should be considered the Husband’s alter ego.\n                    Relying on the observations of Munby J inW v\n                        H[2001] 1 All ER 300 (“W v\n                        H”), where he opined that the Family Division was entitled\n                    to pierce the corporate veil and hold a company to be an alter ego of the\n                    husband even where there was insignificant minority interest, the Judge here\n                    found that the Husband should be treated as the beneficial owner of the shares\n                    in his children’s names (see GD at [29]).46     With respect, we have some reservations as to\n                    whether it would be appropriate to apply the views expressed inW v Hto the circumstances of the present case. InW v H, as the company was the alter ego of the\n                    husband, the court was able to pierce the corporate veil to regard a property\n                    owned by the company as belonging to the husband for the purposes of granting an\n                    interlocutory relief in order to preserve the status quo.W v\n                        Hdid not decide the ownership of shares, as the wife there was\n                    only asking for an injunctive relief to stop the Company and a third party (to\n                    whom the husband had transferred his shares in the company) from disposing of\n                    the matrimonial property before its true ownership could be decided in the\n                    ancillary proceedings between the wife and the husband. For the purposes of the\n                    injunctive relief, the property owned by the company was treated as having been\n                    vested in the husband, but it did not mean the property owned by the company\n                    therefore actually belonged to the husband. The observation on piercing the\n                    corporate veil was to justify the grant of the interlocutory relief without\n                    requiring the company to be joined as a party. Here we are dealing with shares\n                    in YHPL which the Husband had already transferred to his son Alex and the two\n                    daughters and the question which is now in issue is whether those shares were\n                    intended as gifts to the children or whether the children are just bare\n                    trustees. We do not see how the principle of piercing the corporate veil arises\n                    or is relevant here.47     Returning to the issue of the Daughters’\n                    Shares, the status of those shares would have to await the outcome of S\n                    373/2010. As for Alex’s Shares, the outcome of the daughters’ suit\n                    should not affect Alex’s shares since rebutting the presumption of\n                    advancement for the daughters does not equate to rebutting the presumption of\n                    advancement for Alex. Although the Husband claims that he gave shares to his\n                    family members as the Company Act did not allow him to be the sole shareholder,\n                    that claimper semay not necessarily suffice to\n                    rebut the presumption of advancement to the son. Furthermore, the Judge erred in\n                    treating the Daughters’ shares and Alex’s shares analogously since\n                    it was clear from the facts that the Husband treated the daughters and Alex\n                    differently.48     The facts suggest that the shares were given\n                    by the Father not just as gifts to his children but as recognition of their\n                    contributions in his companies because no shares were ever given to his oldest\n                    son who did not work for his companies. Alex had played a very different role as\n                    compared to the daughters in YHPL and SIL. Alex is the current Chief Executive\n                    Officer of SIL and occupies a more senior managerial role than the\n                    daughters’ previous clerical positions. The daughters also recognised in\n                    their affidavits filed for Suit 371/2010 that the Father had treated Alex as his\n                    future successor in SIL. As Alex and the daughters clearly hold their shares in\n                    different capacities, the Judge should not have automatically applied the\n                    reasoning for the Daughters’ shares to Alex. Presently, neither the\n                    Husband nor Alex disputes that Alex is the beneficial owner of his shares and\n                    thus Alex’s shares should be excluded from the pool of matrimonial\n                    assets.Shares in YHPL given to the Wife49     As mentioned in[44]above, the Husband forged the signature of the Wife in\n                    transferring the 1,885,966 shares in YHPL held in the Wife’s name back to\n                    himself and allegedly a daughter (in respect of 195,273 shares). It is not clear\n                    to whom the 195,273 shares had actually gone. But that is hardly important. In\n                    any case, for the purposes of the division of matrimonial assets, it would make\n                    no difference whether those shares are held in the name of the Wife or the\n                    Husband or his nominee. They will remain as matrimonial assets to be divided\n                    between the parties.50     Thus, excluding Alex’s Shares and the\n                    Daughters’ Shares, the undisputed total shareholding which the Husband\n                    holds in YHPL amounts to 5,787,570 shares, consisting of 3,901,604 shares in the\n                    Husband’s name plus the 1,885,966 shares taken from the Wife. This\n                    constituted 61% of the total shareholding in YHPL (the total shares issued in\n                    respect of YHPL being 9,478,472).Whether the Wife’s jewellery is part of the Matrimonial\n                Assets51     The next issue which we need to address is the\n                    Husband’s claim that the Wife’s jewellery should be included in the\n                    pool of matrimonial assets. The Wife had not given details of her jewellery\n                    collection in her affidavits and the Husband submits that an adverse inference\n                    should be drawn against her under Section 116(g) of the Evidence Act. InTianzon, this Court said (at [13]) that it saw “no reason why gifts\n                    of substantial value such as a motor car, landed property and investments, which\n                    were acquired by one spouse during the marriage and given to the other”\n                    should not be considered matrimonial assets. However, “for practical\n                    purposes, minor items of gift such as dresses and even jewellery of no\n                    substantial value, are normally consideredde\n                        minimisand are not taken into account” (Tianzonat [13]).52     The Judge believed the Wife, who had generally\n                    made full and frank disclosure of her assets, that her jewellery collection was\n                    not of substantial value. The Husband gave no evidence to substantiate his claim\n                    that the Wife’s jewellery collection was valuable, and since he was the\n                    one who gave the jewellery to the Wife, it does not seem unreasonable for him\n                    to, at least, give some evidence on the individual jewellery pieces which the\n                    Wife owned or an estimate of their value. The Judge exercised her discretion and\n                    excluded the jewellery from being taken into account because in her view,\n                    relative to the matrimonial assets as a whole, “even if the jewellery was\n                    worth something in the range of a quarter million to half a million\n                    dollars” this would not add a substantial value to the pool of\n                    matrimonial assets (GD at [48]). We are\n                    not minded to disturb this exercise of discretion by the Judge.The total matrimonial assets53     The Judge at [46]-[47] of the GD held\n                    that the Husband’s matrimonial assets totalled$111,429,816. This was rounded up to $111.5m. Both the Husband\n                    and Wife are in agreement that the Judge’s calculation of $111,429,816 had\n                    an arithmetic error and this was probably due to the double-counting of the\n                    amount of $524,970 for the 614,000 shares in SIL (see table at[62]below). In the subsequent paragraphs, we will\n                    also be addressing some other errors of computation.Double counting of assets of YHPL54     A total sum of$11,689,762.04 was deposited in the High Court, made up as\n                    follows:S/NoItemValue(a)Net Sale Proceeds of No 14 Lornie Road\n                                            (registered under YHPL’s\n                                    name)$8,688,372.58(b)Dividends on 98,160,765 shares in SIL\n                                            together with interest (owned by\n                                    YHPL)$426,259.49(c)Dividends on 98,160,765 shares in SIL\n                                            together with interest (owned by\n                                    YHPL)$381,290.90(d)Net Sale Proceeds of 202A Lornie Road\n                                            (owned by Husband)$1,960,121.12(e)Proceeds from Sale of Husband’s\n                                            300,000 shares in SIL$142,384.72(f)Interest and part of fixed deposits held\n                                            by CTCL Law Corporation which Husband treated as\n                                            belonging to YHPL$91,333.2355     The Husband does not dispute that items (d)\n                    and (e) in the table above, are assets beneficially owned by him. However, as\n                    regards the other items, it seems to us that there is double counting. Those\n                    sums of money belong to YHPL. The approach taken by the Judge seems to be that\n                    as she regarded the Husband as the effective owner of all the shares of YHPL,\n                    she treated the moneys listed under items (a),(b),(c) and (f) as belonging to\n                    the Husband. Quite apart from the question as to whether in circumstances like\n                    the present, where there is no allegation that YHPL was a sham entity or was\n                    just a device (seeWin Line (UK) Ltd v Masterpart (Singapore)\n                        Pte Ltd and another[1999] 2 SLR(R) 24) it is proper to\n                    pierce the corporate veil to treat these sums of money of YHPL as belonging to\n                    the Husband, it would be quite unfair in the fact-situation here to so regard\n                    those moneys. This is because since those sums were taken into account in\n                    determining the worth and value of YHPL, to have them regarded as the assets of\n                    the Husband would necessarily lead to double-counting. Therefore, only$2,102,505.84 (items (d) and (e) in the table above) of\n                    the deposit of $11,689,762.04 with the High Court should be included in the pool\n                    of matrimonial assets to be divided.Sale of 22.5 million shares that YHPL held in SIL56     Another instance of double-counting relates to\n                    22.5 million shares in SIL which were held by YHPL and which the latter sold for\n                    the sum of $6 million. The Judge, on the basis that the Husband owned all the\n                    shares in YHPL, held that the $6 million belonged to the Husband. For the\n                    reasons alluded to in[55]above, the sale\n                    proceeds of $6 million should not be treated as something belonging to the\n                    Husband. As we have said, the valuation of the shares in YHPL would have\n                    included this sum.Assets the Husband argue should not be Matrimonial Assets57     At[40]above, we upheld the Judge’s finding that the operative date in this case\n                    was the date of thedecree nisi. It must therefore\n                    follow that the assets the Husband acquired after the date of thedecree nisiwere not matrimonial assets. However, as the\n                    Husband has failed repeatedly to make full and frank disclosure of his assets\n                    and to furnish evidence that the assets he acquired after the date of decree was\n                    not funded from the common pool of matrimonial assets, an adverse inference that\n                    these assets were acquired from funds from the common pool of matrimonial assets\n                    will be made against him.58     We now turn to the 614,000 SIL shares which\n                    the Husband allegedly bought in April 2005, after the Wife left the matrimonial\n                    home and which have a value of $524,970. There is no evidence as to the precise\n                    date on which they were bought by the Husband. The Husband contends that as the\n                    shares were acquired after the Wife had left the matrimonial home, they should\n                    not be regarded as a matrimonial asset. For the reasons which are alluded to in[40], this contention is clearly\n                    untenable. By the Husband’s logic it would be all too simple for a spouse\n                    to exclude assets which are part of the common pool for division by simply\n                    making fresh purchases after the date of separation. As the Husband has not\n                    indicated how much he had spent to pay for the shares, we are in no position to\n                    restore what was taken by him from the common pool for that purpose and as the\n                    Wife also wishes to treat the shares as matrimonial assets, it is only just the\n                    court should do so. The Husband has not shown that the shares had been bought\n                    with resources which he had independently amassed after the grant of thedecree nisi. Therefore, an adverse inference\n                    will be drawn and the entire value of the 614,000 shares will be notionally\n                    placed into the pool of matrimonial assets.59     The proceeds from the 202A Lornie Road\n                    property will be included in the pool of matrimonial assets. It was acquired in\n                    May 2005 before the date of thedecree nisi.\n                    However, the property at 6 Chestnut Close bought by YHPL will be excluded from\n                    the pool of matrimonial assets as it would be double-counting. Unlike 202A\n                    Lornie Road, for which the Husband subsequently asserted had been bought for him\n                    by YHPL as a trustee, 6 Chestnut Close remains YHPL’s\n                property.60     The property at 9 Wak Hassan Drive was bought\n                    after the date of thedecree nisiin November 2005\n                    with the party cited. The Husband in his affidavit stated that he made a direct\n                    financial contribution of $600,000 to its purchase. An adverse inference is\n                    drawn because there is no evidence that this was independently amassed after the\n                    grant of thedecree nisiand $600,000 will be\n                    notionally returned to the pool of matrimonial assets. Similarly, 74 Andrews\n                    Terrace was bought after the date of thedecree\n                        nisiin August 2008 with the party cited. The Husband in his\n                    affidavit stated that he made a direct financial contribution of about\n                    $1,000,000 to its purchase. An adverse inference is also drawn because there is\n                    no evidence that this was independently amassed after the date of thedecree nisiand $1,000,000 will be notionally returned\n                    to the pool of matrimonial assets.61     The Husband was granted in April 2009 an\n                    option to subscribe for 500,000 shares in SIL. This was acquired four years\n                    after thedecree nisiand should not be regarded\n                    as a matrimonial asset. It is also likely that this was given to the Husband for\n                    the work he did after the date of thedecree nisiand therefore no adverse inference should be drawn. As regards the 800,000\n                    shares in Roxy Pacific Holdings Ltd, the Husband has provided no evidence as to\n                    when those shares were acquired. The company was listed in March 2008. While\n                    these shares were likely acquired after the date of thedecree nisi, the Husband provided no evidence as to what funds\n                    he had used to acquire these shares and an adverse inference will be drawn to\n                    place the value of these shares into the matrimonial pool. The cars bought on\n                    hire-purchase in 2008 and 2009 are disregarded because of indications that they\n                    are of negative value.List of matrimonial assets62     In the light of what is stated above, the full\n                    list of matrimonial assets is set out in the table below:Final Table of Matrimonial AssetsS/NoItemValue ($)(a)5,787,570 shares in\n                                    YHPL55,381,874.29(b)300,000 shares in Swissco\n                                        Marine1,800,000(c)20,000 shares in Asia\n                                        Enterprise4,800(d)614,000 shares in\n                                    SIL524,970(e)1,360 shares in\n                                    SingTel4,025(f)1 share in Swissco Structural Mechanical\n                                            Pte Ltd1(g)UOB Bank account no\n                                        134-xxx-xxx-192,364(h)CPF account34,915(i)Club memberships53,500(j)Cars owned at date of thedecree\n                                    nisiUnknown(k)Half share in 6 Shamah\n                                        TerraceUnknown(l)Property in Gold Coast,\n                                        AustraliaUnknown(m)Net Sale Proceeds of 202A Lornie Road\n                                            (monies deposited with the High\n                                    Court)1,960,121.12(n)Proceeds from Sale of Husband’s\n                                            300,000 shares in SIL (monies deposited with the High\n                                            Court)142,384.72(o)All of Wife’s\n                                    assets860,000(p)Husband’s direct financial\n                                            contribution to 9 Wak Hassan Drive600,000(q)Husband’s direct financial\n                                            contribution to 74 Andrews Terrace1,000,000(r)800,000 shares in Roxy Pacific Holdings\n                                            Ltd208,000Total (not including assets whose values\n                                            are unknown):62,666,955.1363     If in S 373/2010 the Daughters’ Shares\n                    are held to belong to the Husband, an additional $14,512,086.03 will be added to\n                    the pool of matrimonial assets.Adverse InferencesAdverse Inference as to the Husband’s Undisclosed\n                Assets64     The Judge found that the Husband had breached\n                    his duty of making full and frank disclosure of his assets and attributed a\n                    “further $11m or ten percent of the disclosed assets as being the value\n                    of the husband’s undisclosed assets” (GD at [47]). The Judge took a broad brush approach\n                    in adding 10% more as representing the Husband’s undisclosed assets. The\n                    Judge seemed to be following the mode suggested by the High Court inLau Loon Seng[1999] 2 SLR(R) 688, where it\n                    was held that when quantifying “undisclosed assets”, the court\n                    should make a finding of the value of the undisclosed assets on the available\n                    evidence and it would be for the other party to prove that such a value is\n                    unreasonable. This approach was reiterated inTay Sin Tor v\n                        Tan Chay Eng[1999] 2 SLR(R) 385 (“Tay Sin Tor”).65     InNK v NL[2007] 3 SLR(R) 743 (“NK v\n                        NL”), this court had the occasion to consider the approach\n                    adopted inTay Sin Torand held that while that\n                    approach was sound, it was but one of at least two alternatives. Much would\n                    depend on the fact-situation of each case. This court also cautioned against\n                    “unnecessary speculation” with regard to the specific values of\n                    the undeclared assets (NK v NLat [61]). InNK v\n                        NL, what was in contention was that the husband was not able to\n                    account for the disappearance of some $2.7 million. Rather than adding a\n                    specific sum into the matrimonial pool for division, this court held that in\n                    those circumstances (the unaccountability of $2.7 million) it “might be\n                    more just and equitable (not to mention, practical) to order a higher proportion\n                    of the known assets to be given to the wife” (NK v\n                        NLat [62]).66     In this connection, we would like to emphasise\n                    one aspect where a party is regarded as not having made full and frank\n                    disclosure of his or her assets. In the nature of things, whichever approach the\n                    court adopts in such a situation, it is undoubtedly to a large extent\n                    speculative; whether it decides to give a value to what it considers to be\n                    “undisclosed assets” or to give a higher percentage of the\n                    disclosed assets to the other party. Either approach would translate to giving\n                    something more to the other spouse by way of a specific sum. The very fact that\n                    the court is confronted with the problem of “undisclosed assets”\n                    means that the position is unclear and far from certain. In the final analysis,\n                    it is for the court to decide, in the light of the fact-situation of each case,\n                    which approach would in its view best achieve an equitable and just result. What\n                    must be clearly recognised is that when the court makes such a determination it\n                    is not undertaking an exercise based on arithmetic but a judgmental exercise\n                    based, in part at least, on feel.67     To take 10% of the disclosed assets as being\n                    the value of the Husband’s undisclosed assets could be said to be\n                    arbitrary. In the present case, the arbitrariness of this approach is perhaps\n                    illustrated when one considers that if some of the trial judge’s findings\n                    on matrimonial assets are overturned (as happened here), the pool of disclosed\n                    matrimonial assets would shrink and in turn the 10% representing the undisclosed\n                    assets would similarly shrink. Of course, this is not to say that, in a like\n                    scenario, taking the other approach of giving a higher percentage of the\n                    matrimonial assets as determined by the Judge would not have had a similar\n                    effect. If an appellate court were to remove some assets from the pool of\n                    matrimonial assets, then the ultimate assets which the Wife would obtain by way\n                    of the higher percentage would also be reduced. Thus, in each case the court\n                    would have to decide on the facts which approach would best enable it to achieve\n                    a just and equitable result. We would further add that in the present case,\n                    there is one further complication which must be factored into the equation. Here\n                    we are dealing with not only undisclosed assets but also with disclosed assets\n                    in respect of which values are not disclosed. This is an aspect to which we will\n                    now turn.Husband’s disclosed assets with unknown values68     It would be seen from the assets listed in the\n                    table at [62] that a number of them have\n                    unknown values: item (j), cars owned at date of thedecree\n                        nisi; item (k), a half share in 6 Shamah Terrace and item (l),\n                    property in Gold Coast, Australia. The Judge did not attempt to give a value to\n                    each of these items. Neither did she include these items in the final\n                    computation of the total value of the matrimonial assets. Item (k) was in fact\n                    sold and the profits given to charity, but the Husband did not give information\n                    as to the price at which 6 Shamah Terrace was sold. In view of these omissions,\n                    the Judge was within her rights to draw an adverse inference against the Husband\n                    and to give a value to each of these items as she deemed\n                reasonable.69     InKoh Kim Lan Angela v\n                        Choong Kian Haw[1993] 3 SLR(R) 491 (“Koh Kim Lan Angela”), this court drew such an\n                    adverse inference against the husband when it ascribed a value to disclosed\n                    assets with unknown values. The husband inKoh Kim Lan\n                        Angeladeliberately gave an inflated value of the shares which\n                    was obviously not the true value of the shares as this value was attributed\n                    before the structural reorganisation of the family business and the shares would\n                    in consequence be worth less. The husband thought the Court would thus not be\n                    able to divide the shares because the true value of the shares was not known at\n                    the ancillary hearing. However, the Court drew an adverse inference and ordered\n                    the division of the shares using the inflated value the husband provided. It\n                    should be noted that to counterbalance the inflated values, the court gave the\n                    wife only 15% of the matrimonial assets as so determined.70     The problem which the court was confronted\n                    with in the present case was that with insufficient evidence, the court could\n                    not reasonably ascribe a value to those disclosed assets (with no indicated\n                    values). Of course, the Judge could have ordered the assets to be assessed by an\n                    independent valuer, whose costs could have been ordered to be borne equally\n                    between the parties. From the GD at [47], it would appear that the Judge had lumped the undisclosed\n                    assets together with the disclosed assets (with no values indicated) and\n                    accorded them a value based on 10% of the disclosed assets (with values). We\n                    cannot say that this approach is necessarily wrong or that the approach of\n                    giving a higher percentage of the total matrimonial assets would necessarily\n                    give a more accurate and just figure. Thus, 10% of the disclosed assets will be$6,266,695.51and an additional $1,451,208.60if the Daughter’s Shares in YHPL are\n                    eventually held, following the action in S 373/2010, to belong beneficially to\n                    the Husband.71     Adding these figures ($62,666,955.13and$6,266,695.51)\n                    will give a sum of $68,933,650.64, which sum\n                    amounts to the total value of the matrimonial assets. This figure excludes the\n                    value of the Daughter’s Shares. Although the Judge deducted $6.8 million,\n                    being YHPL’s overdraft liability which the Husband took responsibility for\n                    as guarantor and shareholder of YHPL, this is incorrect as that sum cannot be\n                    treated as the Husband’s own liability. To deduct YHPL’s liabilities\n                    from the matrimonial assets would be to make the same error as double-counting\n                    YHPL’s assets into the pool of matrimonial assets. All of these are\n                    already reflected in YHPL’s share value.Division of Matrimonial AssetsJust and Equitable Division72     The Judge divided the matrimonial assets in\n                    the proportions of 35:65 in favour of the Husband. Both parties are unhappy,\n                    with the Husband arguing that the Wife should not get more than 20% while the\n                    Wife submits that the matrimonial assets should be divided equally. The question\n                    before us is whether this division is “just and\n                equitable”.73     At this juncture, we will briefly revisit the\n                    findings of the Judge as to what each party has done for the family as well as\n                    towards the accumulation of the family fortune. She found that the Wife’s\n                    contributions were “being a parent, a homemaker and a caregiver”\n                    and her contributions “were confined to the domestic sphere” (GD\n                    at [51]). She regarded the Wife’s\n                    earlier contributions when the Husband first started out his business such as\n                    helping to entertain customers’ wives, answering phone calls and even\n                    procuring an alleged loan of $20,000 for the business start-up as\n                    “peripheral” and of “minimal” significance (GD at\n                        [50]). While the Wife’s\n                    contributions were only indirect contributions in the domestic sphere, the Judge\n                    nevertheless emphasised that the Wife “contributed to the family and the\n                    marriage to thebest of her abilityby taking on\n                    the role of homemaker and mother” (emphasis added) (GD at [56]). Although the family is extremely\n                    well-off now, they were poor in the early years and therefore the Wife’s\n                    role must have been “more arduous” then (GD at [56]). Of course as the family fortune\n                    improved, the physical demands on the Wife would be less (with perhaps the help\n                    of a maid). But her duty to maintain the home and attend to the needs of\n                    children would have continued.74     The Husband sought to lessen the significance\n                    of the Wife’s contribution by saying that after their youngest child left\n                    for United Kingdom in 1981 to study in a boarding school, there was not much for\n                    her to do. He claimed that from then on, “she had led a luxurious life\n                    engaging in ballroom dancing, singing lessons and having tea with her\n                    friends” (GD at [51]). We are not\n                    persuaded that this argument should be given much weight. The Judge also thought\n                    so. It stands to reason that in all long marriages, where the wife is a\n                    full-time homemaker, there will come a point in time when the children will\n                    become independent as adults and their demands on the Wife, as a mother, will\n                    decrease. But her duty to maintain the home would undoubtedly continue. It would\n                    be grossly inequitable to minimise her contributions just because the children\n                    have grown up and left the coop.75     However, the Judge recognised the\n                    Husband’s “unusual drive and ability” in building up an\n                    extremely successful business in the marine industry literally from scratch (GD\n                    at [57]). It cannot be gainsaid that the\n                    success was due largely to the Husband’s “special skills” in\n                    the marine industry. What is clear is that all the direct financial\n                    contributions to the family’s wealth have been made by the Husband while\n                    the indirect non-financial contributions have substantially been made by the\n                    Wife. What is also not disputed is that the Husband has been meeting all the\n                    expenses of the family, including the children’s education overseas. This\n                    is very much a traditional family as far as the roles of the spouses are\n                    concerned.76     Section 112(2) of the Charter provides a\n                    non-exhaustive list of factors which a court is required to have regard in\n                    determining how the matrimonial assets are to be divided. A wide discretion is\n                    conferred upon the court. The section does not prescribe the weight which should\n                    be attributed to each factor or how each factor should be regarded as against\n                    another factor. In most instances, the difficulty lies in evaluating the\n                    non-financial contributions of the homemaker wife as such contributions are not\n                    easily reducible into monetary terms. InLock Yeng Fun v Chua\n                        Hock Chye[2007] 3 SLR(R) 520 (“Lock Yeng Fun”) this Court noted (at [39]) that non-financial contributions were by\n                    their very nature “difficult to measure because they are, intrinsically,\n                    incapable of being measured in precise financial terms”. That having been\n                    said, the court went on to state that such difficulty should never be a ground\n                    to refuse that spouse his or her equitable share in the matrimonial\n                    assets.77     InLock Yeng Funat [40], this court had also observed\n                    that the legislative mandate in s 112 of the Charter was to treat all\n                    matrimonial assets as “community property”. Adopting this view of\n                    the matrimonial assets, counsel for the Wife argued that she should be given an\n                    equal share of the matrimonial assets. In support of her contention, the Wife\n                    relies on the following statement expressed by the High Court inYow Mee Lan v Chen Kai Buan[2000]\n                    2 SLR(R) 659 at [43]\n                        (“Yow Mee Lan”):[M]arriage is not a business where, generally, parties receive an economic\n                        reward commensurate with their economic input. It is a union in which the\n                        husband and wife work together for their common good and the good of their\n                        children. Each of them uses (or should use) his or her abilities and efforts\n                        for the welfare of the family and contributes whatever he or she is able to.\n                        The parties often have unequal abilities whether as parents or income\n                        earners but, as between them, this disparity of roles and talents should not\n                        result in unequal rewards where the contributions are made consistently and\n                        over a long period of time.At this juncture, we would wish to point out that the judge who made\n                    the above quoted remarks inYow Mee Lanwas also\n                    the same judge who in the present case decided to accord the Wife only 35% of\n                    the matrimonial assets.78     The views expressed inYow\n                        Mee Lanwas endorsed by this court inLim\n                        Choon Lai (mw) v Chew Kim Heng[2001] 2 SLR(R) 260\n                    where it said that in determining the division of matrimonial assets all\n                    relevant circumstances must be taken into account, particularly those matters\n                    listed out under s 112(2). But the court is not expected to make an exact\n                    calculation of each spouse’s contributions, whether financial or\n                    non-financial. Ultimately, the court must take a broad brush approach to reach\n                    what in its view is a just and equitable division.79     As observed in[76]above, Parliament has very appropriately refrained from\n                    laying down more specific considerations in s 112 other than listing out a\n                    non-exhaustive list of factors which the court should take into account.\n                    Similarly, we do not think it falls within the province of the court to fill in\n                    the blanks which Parliament has deliberately left open. Thus the exact division\n                    which the court will make in each particular case will necessarily be fact\n                    sensitive and that must have been intended by Parliament. The only guidance\n                    which Parliament has laid down is “just and equitable” and that is\n                    the objective which the court must in each case seek to achieve. The division\n                    made in an earlier case is no more than an illustration which subsequent cases\n                    can take into account as guides, always bearing in mind the difference in\n                    circumstances and that no two cases are identical.80     In order for this court to disturb the\n                    division ordered by the Judge of 35:65 in favour of the Husband, it must be\n                    shown that the Judge had erred in law or had clearly exercised her discretion\n                    wrongly or had taken into account irrelevant considerations or had failed to\n                    take into account relevant considerations: seeKoh Bee Choo v\n                        Choo Chai Huah[2007] SGCA 21 at [46]. She specifically stated that she had\n                    taken into account all the circumstances, including the length of the marriage\n                    as well as the size of the pool of the matrimonial assets. We note the\n                    Judge’s observation that the Husband’s contributions to the\n                    family’s fortunes have been “extraordinary” (GD at [57]).81     At this point, we would refer toAJRwhere the High Court advanced an 8-step approach as\n                    a countercheck to see if the apportionment arrived at by using the broad brush\n                    approach to the division of matrimonial assets is just and equitable. All we\n                    wish to say is that the 8-step approach is much too detailed and seeks to make\n                    it appear as if the court’s determination of the division of matrimonial\n                    assets is an exercise which is capable of being reduced to mathematical\n                    precision when in fact it is not so. Indeed, the High Court judge had to makecertain assumptionsin order to find that the\n                    importance of total direct contributions and indirect contributions to the\n                    overall welfare of the family was in the ratio of 65-35. Section 112 of the\n                    Charter is concerned with dividing surplus matrimonial assets between the\n                    Husband and Wife based ontheirrespective\n                    contributions. To make a finding that both parties contributed 65% by total\n                    direct contributions and 35% by total indirect contributions to the welfare of\n                    the family adds little value to the final determination. The 8-step approach is\n                    a fine brush approach rather than a broad brush approach. As the two approaches\n                    are quite distinct and different, we have reservations as to whether it will\n                    really be appropriate to use the result of one approach to verify the\n                    correctness of the other. At the end of the day, we wish to underscore the point\n                    that the broad brush approach, as stated in[66], is all about feel and the court’s sense of\n                    justice.82     The Judge in making the division had viewed\n                    the matrimonial assets on a global basis. Having regard to all the\n                    circumstances, she felt that a division at 35:65 was just and equitable. The\n                    Wife’s case is basically that as this is a long marriage and she has given\n                    all she has to the family, by way of maintaining the home and taking care of the\n                    children, she should be entitled to a half share of the matrimonial assets. But\n                    that is not the scheme of things under the Charter. Neither is it what the\n                    Charter says. What the court is being asked is to weigh the various factors and\n                    to give the appropriate weightage to each. The Judge did that and felt that an\n                    apportionment at 35:65 was right. We cannot find any specific basis to question\n                    that division. Neither can we say that 35% of a large pool of matrimonial assets\n                    would be unjust to a spouse whose contributions were all in the domestic sphere.\n                    In the result, we are not inclined to overturn the division made by the\n                    Judge.Conclusion83     For the above reasons, the appeal in CA 81 of\n                    2010 is partially allowed to the extent that the position of the\n                    Daughters’ Shares would have to await the outcome in S 373/2010. We have\n                    also removed the instances of double-counting in considering the pool of\n                    matrimonial assets. In the meantime, the total value of the matrimonial assets\n                    shall be as stated in[71]and that is the\n                    amount to be divided between the parties in the ratio of 35:65 in favour of the\n                    Husband. The sum of$11,689,762.04 paid into court\n                    has already been paid out to the Wife towards satisfying her share of the\n                    matrimonial assets. In addition, the $860,000 which she currently holds and the\n                    maintenance she has received must also be brought into account. The remainder of\n                    the Wife’s entitlement should be paid by the Husband to her within three\n                    months from the date hereof.84     In the event that following the final outcome\n                    in S 373/2010 (including any appeal to this court), the Daughters’ Shares\n                    are to be regarded as belonging to the Husband, then the values of those shares\n                    shall be added to constitute part of the matrimonial assets and the Husband\n                    shall pay to the Wife her due share of the enlarged matrimonial assets (which\n                    should include the 10% mark-up for non-disclosure – see[70]above) within six months of that final\n                    outcome.85     CA 82 of 2010 is substantially dismissed as\n                    the Wife has not succeeded on the two main issues raised, the value of the\n                    matrimonial assets and the Wife’s share of those assets. Of course, we\n                    also recognise that these issues replicate some of those in CA 81 of 2010. In\n                    the result, we order that there shall be no order as to costs of the appeals,\n                    including the two interlocutory applications, SUM 3287 of 2010 (to adduce fresh\n                    evidence) and SUM 5494 of 2010 (application for stay of execution pending the\n                    delivery of this judgment). There will be the usual consequential\n                orders.",
        "Summons 3287/2010 – Husband’s application to adduce\n                further Evidence on Appeal": "7       Before we examine the question of division of\n                    matrimonial assets, we should first refer to Summons No 3287/2010/D (“SUM\n                    3287”), filed by the Husband seeking leave to adduce fresh evidence by\n                    affidavit for the purposes of the hearing of the two appeals. The fresh evidence\n                    relates to the fact that their two daughters, Catherine and Margaret, have filed\n                    High Court Suit No S373/2010/C (“S 373/2010”) on\n                        21stMay 2010 claiming beneficial ownership of\n                    the 1,516,556 shares in YHPL (“Daughters’ Shares”) which the\n                    Judge at GD [28] had held to belong to\n                    the Husband and placed them in the pool as matrimonial assets to be divided. The\n                    Daughters’ Shares are estimated to have a value of\n                $14,512,086.03. 8       The Husband averred that the further evidence\n                    should be admitted as it relates directly to the heart of the matter in these\n                    appeals – who possesses the beneficial ownership of the 1,516,556 shares.\n                    Clearly, if the shares belong to the two daughters, they cannot be considered as\n                    part of the matrimonial assets to be divided even though the Husband had claimed\n                    at the hearing of the ancillary matters before the Judge that the beneficial\n                    ownership to the shares vested in him (although they are registered under the\n                    daughters’ names) because the daughters had not provided any consideration\n                    for the same. The hearing of the ancillary matters was held on 16 to\n                    17 September 2009 and the decision of the Judge was released 26 April\n                    2010. The two daughters commenced S 373/2010 only in May 2010. As the documents\n                    relating to S 373/2010 only came into being after the decision had been\n                    rendered, they are, therefore, not subject to the requirements as set out inLadd v Marshall[1954] 1 WLR 1489\n                        (“Ladd v Marshall”). Moreover,\n                    even ifLadd v Marshallshould apply, the facts in\n                    this case would have satisfied the criteria for accepting fresh evidence on\n                    appeal as laid down in that case. 9       The Wife initially disputed the admission of the\n                    further evidence on the ground that the evidence related to a matter which had\n                    already been brought to the attention of the Judge. She pointed to the fact that\n                    on 16 September 2009, she found from an ACRA search that the daughters were\n                    no longer listed as shareholders of YHPL and that their shares had been\n                    transferred to the Husband’s sister, Anna Yeoh and the Husband’s\n                    brother, Yeo Chong Boon. These facts were brought to the attention of the Judge\n                    on 17 September 2009. On 22 September 2009, with the leave of court,\n                    the daughters filed an affidavit to confirm that the shares were transferred\n                    without their consent and that the daughters would be “taking up this\n                    matter in due course to investigate”. This affidavit of the two daughters\n                    was served on the Husband the next day. Accordingly, the Wife asserted that what\n                    was sought to be admitted as fresh evidence was already brought to the\n                    court’s attention before the decision was made by the Judge and that it\n                    did not fulfil the conditions laid down inLadd v\n                        Marshall. We should add that while the two daughters’\n                    shares in YHPL were purportedly transferred out without their consent, for the\n                    purposes of these appeals, the shares will be treated as still being registered\n                    under their names. 10     It is true that the dispute between the\n                    Husband and two daughters over the beneficial ownership of the Daughters’\n                    Shares was already highlighted to the Judge and many of the documents filed as\n                    evidence for the daughters’ High Court suit were already admitted in this\n                    case. Moreover, at the hearing before the Judge, the daughters had also\n                    indicated that they would challenge their father’s act in taking away\n                    their legal and beneficial ownership in the Daughter’s Shares. Therefore,\n                    in a sense, by instituting S 373/2010 nothing really new has happened, only that\n                    the daughters have taken the matter one step further as they had earlier\n                    indicated. 11     However, the fact of the matter is that the\n                    filing of S 373/2010 was certainly an event which occurred after the judgment\n                    was delivered. The documents filed in the writ would not have been documents\n                    which the Husband could have produced to the Judge. It cannot be gainsaid that\n                    the institution of this writ is directly relevant to the question as to whether\n                    the Judge is correct to have treated the Daughters’ Shares as belonging to\n                    the Husband and thus formed part of the matrimonial assets. Let us assume for a\n                    moment that the decision of the Judge on this question is affirmed and let us\n                    further assume that at the trial of S 373/2010 the court held that the\n                    Daughters’ Shares belonged to them beneficially as gifts given by their\n                    father and that their father was not entitled to take away their shares without\n                    their consent. Where would that scenario leave the Husband? The Husband has\n                    accused the daughters of aiding their mother (the Wife) in trying to have the\n                    shares classified as matrimonial assets by only filing a lawsuit after the\n                    decision was released when they could have filed the writ in the four-year\n                    period when the ancillary matters were pending. Without going into the merits of\n                    this accusation made against the daughters, what we see is that the Husband now\n                    faces a real prospect of a lose-lose situation. We note that while the daughters\n                    did not realise that their father had removed their names as owners of those\n                    shares until the day of the hearing of the ancillary matters,ie, 16 September 2009, it seems to us that if their stand\n                    had been that the shares in any event belonged to them beneficially then they\n                    should have made their position definite and clear to their parents ahead of\n                    time so that they would not need to argue unnecessarily over those shares. To\n                    bring the action only after the Judge had ruled that the Daughters’ Shares\n                    constituted part of the matrimonial assets to be distributed between their\n                    parents would be to inflict a double whammy upon their father, the Husband.\n                    Having said that, obviously nothing is certain until the disposal of S 373/2010,\n                    as the mere filing of the suit does not mean that the daughters will succeed in\n                    their claim. They alleged that the shares were given to them in consideration of\n                    their years of service working for their father’s companies as well as in\n                    lieu of bonuses they were entitled to. The Husband is defending the\n                    daughters’ claim for the shares and if he should succeed in his defence,\n                    it would still be correct to include the shares in the pool of matrimonial\n                    assets. 12     Under s 37(2) of the Supreme Court\n                    Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”),\n                    this Court has “full discretionary power” to receive further\n                    evidence on appeal. Under ss 37(3) and 37(4) of the SCJA, further evidence\n                    “as to matters which haveoccurred after the date of\n                        the decisionfrom which the appeal is brought” (emphasis\n                    added) are distinguished from matters which occurred before the date of decision\n                    and does not need to satisfy the requirement of special grounds (ie, the conditions laid down inLadd\n                        v Marshall) to be admitted. These provisions are also reflected\n                    in O 57 r 13(2) of the Rules of Court (Cap 322, R 5,\n                    2006 Rev Ed). The fresh evidence which the Husband seeks to adduce\n                    clearly relates to events which occurred after the decision of the Judge and\n                    thus do not need to satisfy the requirement of special grounds. The fact that\n                    the daughters’ claim to be entitled to those shares was a matter which was\n                    brought to the attention of the Judge does not mean that S 373/2010, which was\n                    instituted after the decision of the Judge, is not an event which occurred after\n                    the decision. 13     Obviously while this Court has the general\n                    discretion to allow a party to adduce fresh evidence, the principle offinis litiumshould not be lightly disregarded. In the\n                    English House of Lord cases ofMulholland v\n                        Mitchell[1971] AC 666 andMurphy v\n                        Stone-Wallwork (Charlton) Ltd[1969] 1 WLR 1023, it was\n                    held that no precise formulation should be laid down regarding the admission of\n                    further evidence on matters that occurred after the decision. Clearly, further\n                    evidence which will materially alter the basis of the decision should be\n                    allowed. It stands to reason that the conditions governing the admission of\n                    further evidence on matters that occurred after trial should not be more\n                    restrictive than the special grounds laid down inLadd v\n                        Marshall. The second special ground enunciated inLadd v Marshallonly requires the further evidence to\n                    have an important influence on the outcome of the appeal, but it need not be\n                    determinative. Therefore, perhaps, the test should be: would the further\n                    evidence have aperceptible impacton the decision\n                    such that it is in the interest of justice that it should be\n                admitted? 14     In this case, the further evidence which was\n                    sought to be admitted by the Husband clearly goes to the heart of the decision,\n                    and could alter the basis of the decision regarding the matrimonial assets. If\n                    the outcome of S 373/2010 is that the beneficial ownership of the\n                    Daughters’ Shares belongs to the daughters and not the Husband, then they\n                    should not form part of the pool of matrimonial assets for division. We should,\n                    at this juncture, place on record that at the commencement of the hearing by\n                    this court of SUM 3287, the Wife quite rightly recanted and withdrew her\n                    objection to the admission of the fresh evidence for the purposes of the hearing\n                    of the appeal. Accordingly, we granted the application made in SUM\n                3287.",
        "The operative date for division of matrimonial assets": "15     Section 112(10)(b) of the Women’s\n                    Charter (Cap 353, 2009 Rev Ed) (“the Charter”)\n                    defines a “matrimonial asset” as “any ... asset of any\n                    nature acquired during the marriage by one party or both parties to the\n                    marriage”. In the present case, given the long lapse of some four years\n                    between the date of thedecree nisiand the\n                    hearing of the ancillary matters, the question of the operative date for\n                    determining the matrimonial assets becomes of importance. As stated in[5]above, some assets were bought by the Husband\n                    after thedecree nisihad been granted and the\n                    Wife has contended that those assets should still be treated as matrimonial\n                    assets. The Wife alleged that the delay was due to the Husband’s\n                    persistent refusal to make full and frank disclosure and his constant change of\n                    solicitors. 16     The Judge, having consideredYap Hwee May Kathryn v Geh Thien Ee Martin and another[2007] 3 SLR(R) 663 (“Yap Hwee May\n                        Kathryn”) andLim Ngeok Yuen v Lim Soon\n                        Heng Victor[2006] SGHC 83, held that the operative\n                    date for the purposes of determining matrimonial assets should be the date on\n                    which thedecree nisiwas issued (see GD [33]). In this case, the Judge held that the\n                    operative date would be July 2005, when thedecree\n                        nisiwas granted. 17     The Husband submits that, in any event, it\n                    would only be just that at the very latest, the operative date should be the\n                    date on which the divorce petition was filed,ie,\n                        20thApril 2005. His basic reasoning is that once\n                    a spouse has decided to leave the matrimonial home or file a Petition for\n                    divorce (whichever shall be the earlier), the marriage has effectively ended and\n                    the moral or emotional support which the spouses have for each other would also\n                    have ceased and it would be unjust for the party who wanted to end the marriage\n                    to demand, as of right, any asset which the other party accumulates\n                    thereafter. 18     The Wife submits that the starting point is\n                    that all assets, whether acquired during the course of marriage or after the\n                    breakdown of the marriage, fall within the pool of matrimonial assets. The date\n                    of thedecree nisishould not be taken as the\n                    operative date. The Wife, while recognising that some authorities were against\n                    her, effectively contended that until thedecree\n                        absoluteis made, the “marriage” still exists in\n                    law and any assets acquired by any party until then should be regarded as\n                    matrimonial assets. In this regard, the Wife relies on the decision of this\n                    Court inYeo Gim Tong Michael v Tianzon Lolita[1996] 1 SLR(R) 633 (“Tianzon”) for the proposition that assets acquired by a\n                    spouse after the breakdown of the marriage should still be included as\n                    matrimonial assets. WhileTianzonwas a case\n                    decided under the previous version of the Charter, the phrase in question,\n                    “during the marriage”, was also present in that earlier version.\n                    This Court in interpreting the phrase “during the marriage” in the\n                    previous Section 106 (1) and (3) of the Women’s Charter (which is similar\n                    to the present s120(10)(b)) held that the marriage “is only dissolved\n                    when thedecree nisi is made absolute”\n                    (emphasis added). In this regard, we note that the High Court inLeong Mei Chuan v David Chan Teck Hock[2001] SGHC 80 (“Leong Mei\n                    Chuan”) appliedTianzonto the\n                    current s 112 of the Charter and held that the meaning accorded to the\n                    phrase “during the marriage” inTianzonwould similarly apply to the same phrase in the present\n                    s 112(10)(b). The court there held that the fact that the husband was\n                    allotted shares after the breakdown of the marriage was a factor to determine\n                    the Wife’s entitlement to them. Although the court inLeong Mei Chuanheld that even shares vested after the breakdown\n                    of the marriage were matrimonial assets, the wife in fact restricted her claims\n                    to shares vested in the husband up to the date of thedecree\n                        nisi. What is clear fromLeong Mei\n                        Chuanis that under s 112 of the Charter, assets acquired by\n                    a party after the breakdown of marriage should still be regarded as matrimonial\n                    assets. 19     There are a number of ways one can look at the\n                    phrase “during the marriage”. First, one could say that until a\n                    marriage is dissolved finally by adecree\n                    absolute, the marriage still subsists in law and therefore anything\n                    obtained by a spouse before then should be regarded as an asset acquired during\n                    the marriage. The second is to regard the grant of thedecree\n                        nisias effectively the end of the marriage and any assets\n                    acquired thereafter should not be treated as having anything to do with the\n                    marriage. The third is to treat the marriage as having ended even earlier when\n                    the marriage has irretrievably broken down, and the parties have stayed apart\n                    and gone their separate ways, as the Husband contends here. 20     In the recent case ofAJR v\n                        AJS[2010] 4 SLR 617 (“AJR”), the High Court had the occasion again to consider\n                    the question of the operative date and decided in favour of the date of thedecree nisi. The judge there reasoned that thedecree nisieffectively put an end to the\n                    marriage and that event indicated that the parties “no longer intend to\n                    participate in the joint accumulation of matrimonial assets nor in any further\n                    joint investment in any matrimonial assets with the associated market risk of a\n                    fall in the value of those joint investments”, unless a contrary\n                    intention was demonstrated by them (AJRat\n                        [4]). In coming to that view, the\n                    judge inAJRnoted what this Court stated inSivakolunthu Kumarasamy v Shanmugam Nagaiah and\n                        Anor[1987] SLR(R) 702 (“Sivakolunthu”) at [25]: The grant of a decreenisiis a recognition\n                        by the “court that the marriage is at an end”. When such a\n                        decree is pronounced, there is, as Lord Wright said [inFender v St John-Mildmay[1938] AC 1 at 45-6], no\n                        longer any matrimonial home, noconsortium\n                            vitaeand no right on either side to conjugal rights. 21     Returning toYap Hwee May\n                        Kathryn, we note that the judge there reasoned that adopting the\n                    date of thedecree nisias the operative date is\n                    more appropriate than that of the date of thedecree\n                        absolutebecause (i) if all the relevant facts were before the\n                    court at the grant of thedecree nisi, there would\n                    have been no reason why the division of the matrimonial assets could not or\n                    should not have been decided at that point in time, and (ii) the date of thedecree absolutecould not have been\n                    ascertained at the time of division of matrimonial assets since thedecree absolutewould only be granted after the\n                    ancillary matters had been settled. Adopting thedecree\n                        absolutedate as the operative date would clearly cause\n                    unnecessary uncertainty as it would necessarily be a date in the future. As\n                    such, such an operative date would be impracticable. In the nature of things,\n                    the latest operative date would have to be the date of the hearing. Even on this\n                    basis, we need to make one clarification. For example, if on that day it is\n                    known that a spouse is likely in the future to receive an employment benefit due\n                    to his past services, it does not follow that the court may not take that into\n                    account in its division.",
        "Positions in some other common law jurisdictions regarding operative\n                date": "22     Counsel for the parties had, at our request,\n                    done some further research into the law and/or practice in other common law\n                    jurisdictions on the question of the operative date for the division of\n                    matrimonial assets. The positions in Malaysia, England, Hong Kong, Scotland,\n                    Australia, New Zealand and Canada were explored. 23     In Malaysia, the Law Reform Marriage and\n                    Divorce Act 1976 provides in s 76(1) that the court has the power, when\n                    granting a decree of divorce, to order the division between the parties of\n                    “any assets acquired by them during the marriage”, a set of\n                    wording very similar to ours. InChew Ling Hang v Aw Ngiong\n                        Hwa[1997] 3 MLJ 107 at 113, the Malaysian court held\n                    that a party seeking the division of matrimonial assets must make the\n                    application “before the decree nisi or at least before it was made\n                    absolute”. This would appear to suggest that the relevant date in\n                    Malaysia could not be the time when thedecree\n                        nisiis made absolute. 24     In England, under s 24(1) of the\n                    Matrimonial Causes Act 1973, orders for property division may be made upon the\n                    grant of a decree of divorce, nullity of marriage or judicial separation as well\n                    as even after a decree of divorce or nullity of marriage is made absolute. Leave\n                    of court is required to apply for ancillary relief post-decree absolute. It does not appear that in England the date of\n                    separation is the necessary operative date. There is a suggestion that the date\n                    the court exercises the power to apportion assets would be a “natural\n                    date” – seeCowan v Cowan[2001] EWCA 679 at [132]. Invariably, the circumstances of the case\n                    will determine the approach the court would take to reach a just\n                result. 25     In Hong Kong, the assets of the spouses which\n                    can be divided upon divorce are the same as those in England. They encompass\n                    property and other financial resources which each spouse “has or is\n                    likely to have in the foreseeable future”: s 7 of the Matrimonial\n                    Proceedings and Property Ordinance. Thus, even property acquired by a party\n                    before marriage will be put in the pool. The court will determine the assets\n                    (and their values) to be taken into account as at the date of hearing. We should\n                    add that even though assets acquired by one spouse before marriage, as well as\n                    gifts, (which are classified as non-matrimonial) may be taken into account by\n                    the court, the discretion rests with the court as to whether they should be\n                    shared and in what proportion. It would seem that “the longer the\n                    marriage the more likely non-matrimonial property will become merged or\n                    entangled with matrimonial property” and where the marriage is short\n                    “non-matrimonial assets are not likely to be shared unless needs require\n                    this”: seeKMD v PIB[2010] HKFamC 14 (“KMD”).\n                    Assets acquired post-separation may or may not qualify as\n                    “non-matrimonial” property. Fairness will be the order of the\n                    day. 26     In Australia, by s 79(1) of the Family\n                    Law Act 1975, the court is mandated to “make such orders as it considers\n                    appropriate”. The position in Australia is similar to that in England and\n                    Hong Kong as all assets owned by the parties at trial are under the purview of\n                    the Court for equitable distribution. While England and Hong Kong have no\n                    statutory definition for matrimonial assets to limit the assets under the\n                    Courts’ purview, Australia has a statutory definition for matrimonial\n                    assets. Under s 4 of Family Law Act 1975, “property” in\n                    relation to parties to a marriage means “property to which those parties\n                    are, or that party is, as the case may be, entitled, whether in possession or\n                    reversion”. It is a broad definition that leaves all assets owned by the\n                    parties under the Court’s purview as, unlike ours, it does not seek to\n                    carve out non-matrimonial property. It seems to us that the Family Law Act 1975\n                    leaves it entirely open as to where the line should be drawn or what property of\n                    either spouse should be brought into the pool for division, leaving it to the\n                    court to decide in the light of the circumstances of each case what would be an\n                    appropriate order to make to achieve a just result: seeScott\n                        v Scott[2006] FamCA 1379 at [113]. 27     In Scotland, the operative date is statutorily\n                    provided. Under s 10(4) of Family Law (Scotland) Act 1985, “the\n                    matrimonial property” is defined as “all the property belonging to\n                    the parties or either of them at the relevant date”. The “relevant\n                    date” is defined under s 10(3) of Family Law (Scotland) Act 1985 to\n                    mean whichever date is earlier (a) the date which the parties ceased to cohabit\n                    or (b) date of service of the summons in the action for divorce. 28     In New Zealand, the operative date is also\n                    statutorily provided. The general operative date is the date of separation.\n                    Under s 9(4) of the Property (Relationships) Act 1976, the parties’\n                    assets are treated as “separate property” (non-matrimonial assets\n                    in our context) if they are acquired “while they are not living together\n                    as husband and wife”. However, s 8 of the New Zealand statute\n                    singles out the “family home” and “family chattels”\n                    as unique matrimonial assets that will be relationship property “whenever\n                    acquired”. Thus, such properties in New Zealand have no operative\n                    date. 29     In Canada, the provinces do not appear to have\n                    taken a uniform approach. In British Columbia’s Family Relations Act and\n                    Yukon’s Family Property and Support Act (RSY 2002), matrimonial property\n                    is identified on the basis of whether the property was “ordinarily used\n                    for a family purpose”. In the other provinces, generally they have\n                    classes of property that are excluded from the pool of assets subject to\n                    distribution. In Ontario, the operative date is likely to be the same as the\n                    valuation date. By virtue of s 4(1) of Ontario’s Family Law Act 1990,\n                    property for division is usually valued as at the date of separation, and\n                    presumably that would also be the cut-off date, but the court is not precluded\n                    from adopting a later date if the circumstances warrant it and the eventual\n                    outcome will be equitable: seeTran v Ma(2007) NWTSC 33. 30     In Alberta, there is no clear operative date\n                    as under s 7 (3)(c) of the Matrimonial Property Act (RSA 2000), property\n                    acquired after adecree nisiis liable to be\n                    distributed. Under s 7(2) of the Matrimonial Property Act (RSA 2000), in\n                    respect of a property acquired before marriage, the market value of the property\n                    at the time of marriage is exempted from distribution. Similarly for gifts\n                    received during marriage, the market value of the gift at the time thereof will\n                    be exempted. What is of interest to note is that under s 7(3) the court is\n                    required to distribute matrimonial property in a manner that it considers\n                    “just and equitable”. Further, under s 8(f), one of the\n                    factors which the court has to take into account in making distribution is\n                    “whether the property was acquired when the spouses were living separate\n                    and apart”. 31     What this review of the law and practice in\n                    some common law jurisdictions shows is that there is no uniformity of approach.\n                    It seems to this court that there is no one single formula or test which is\n                    adopted generally. What is clear is that in every jurisdiction, in its own way,\n                    the court seeks to achieve a just result.",
        "Should there be an operative date for division of matrimonial assets\n                in Singapore": "32     It seems to us that Parliament has very aptly\n                    recognised that it would not be wise to lay down a fixed date for the purposes\n                    of determining what assets would fall within the pool of matrimonial assets and\n                    what would not. A fixed cut-off date may not necessarily secure a just result in\n                    every case. The simple truth is that the circumstances under which an asset\n                    could be acquired by a spouse are so varied that it would be best to leave it to\n                    the court to determine where the line should be drawn after taking into account\n                    all the circumstances. It may be useful to illustrate the problems through\n                    several examples. 33     Take a case like the present, where the\n                    husband buys a property jointly with his new companion after thedecree nisi. Clearly, they are planning for their\n                    future. It would be wholly unreal to treat this property as a matrimonial asset\n                    when that would be the last thing on their mind. It seems to us that there could\n                    be two reasons why a spouse seeks to contend that such a property is\n                    nevertheless matrimonial property. First, there is the belief that if such a\n                    property is not regarded as a matrimonial property, it would be all too easy for\n                    a spouse to reduce the matrimonial assets to be divided by merely buying a\n                    property after thedecree nisiis granted. In our\n                    opinion, this belief overlooks one fact. The funds which that spouse has used to\n                    buy the property do not cease to be matrimonial assets and it must be put back,\n                    at least notionally, for the purposes of division so that the other spouse would\n                    not lose out. By so restoring the funds into the pool, fairness is achieved.\n                    Second, it is assumed that the value of property will always go up. What if it\n                    goes down? There were instances in the past when property prices dipped. Why\n                    should the spouse who has nothing to do with the purchase bear the loss? The\n                    possible downside to a property purchase is often overlooked. 34     Next, let us take a variant of the same\n                    example. Let us say that the property was not bought after thedecree nisibut before the grant of that decree. How\n                    should the property be viewed? The answer can hardly be a straightforward one.\n                    Admittedly, the same arguments can be made to say that the property should not\n                    be regarded as a matrimonial asset. All the circumstances would have to be\n                    considered before a final decision is taken. 35     Again, let us say that the asset bought is not\n                    a real property but shares in a company (whether listed or otherwise). Because\n                    of the inherent volatility of share values, an even stronger case can be made\n                    that the purchasing spouse should bear the risk relating to the purchase,\n                    subject always to that spouse restoring to the common pool the funds he had\n                    taken to make the purchase of the shares. 36     It seems to us that practicality would suggest\n                    that there should be an operative date. However, the problem is in determining\n                    what that operative date should be, bearing in mind the possible diverse assets,\n                    and the different circumstances under which they were acquired. Indeed, it does\n                    not follow that there can only be one operative date. Multiple dates are\n                    distinctly possible, depending on the nature of the assets and the circumstances\n                    surrounding their acquisition. Ultimately, perhaps the adoption of an operative\n                    date or dates may not really be that critical as compared to arriving at a just\n                    and equitable division.",
        "What should be the operative date in this case?": "37     In his submission to us, the Husband avers\n                    that in the context of the Charter, the operative date for the division of\n                    matrimonial assets should be the date of filing of the divorce petition because\n                    there would be certainty as to that date. In his contention, any later date\n                    would be unjust because following the filing of the petition, the spouses would\n                    have nothing to do with each other and the marriage would have effectively ended\n                    save for the formal dissolution. Earlier, the husband took the position that it\n                    should be the date the parties separated. 38     On the other hand, the Wife submits that even\n                    assets acquired by one party after the breakdown of the marriage should fall\n                    within the pool of matrimonial assets. If there needs to be a cut-off date, it\n                    should be the date of the final hearing,ie,\n                    hearing of the ancillary matters after thedecree\n                        nisi. She argues that adopting the date of the hearing as the\n                    cut-off date would produce the fairest result. 39     In our opinion, Parliament obviously\n                    appreciated that it would be unwise, and difficulties could arise, if a definite\n                    cut-off date is prescribed. Any prescribed adherence to a timeline may not\n                    necessarily be conducive towards attaining a just and equitable outcome.\n                    Moreover, as indicated earlier at[36], even\n                    in a case where a court is inclined to adopt a particular point in time as the\n                    cut-off date for dividing the matrimonial assets, it does not follow that that\n                    date should necessarily apply across the board to all categories of assets which\n                    the court is expected to divide. Speaking broadly, and as indicated at[19], there are possibly four timelines which a\n                    court could conceivably adopt. The first is the date of separation. The second\n                    is the date on which the petition of divorce is filed. The third is the date on\n                    which adecree nisiis granted. The fourth is the\n                    date of hearing of ancillary matters (including the date of the hearing of an\n                    appeal). As stated in[21], we have ruled\n                    out the date of the grant of thedecree absoluteas an option because it is a date in the future and cannot realistically be\n                    applied. Of the four possible cut-off dates, it seems to us that generally\n                    speaking it would be sensible to apply either the date of thedecree nisior the date of the hearing of the ancillary matters.\n                    Much would depend on the fact-situation. As indicated at[36], there is nothing to preclude the court from\n                    applying different cut-off dates to different categories of assets if the\n                    circumstances so warrant. The argument that it is wholly unreal to treat assets\n                    acquired after thedecree nisias\n                    “matrimonial assets”, when the marriage contract has for all\n                    practical purposes come to an end and there is no longer any marriage, is not\n                    without merit, subject always to the proviso that the spouse who made the\n                    purchase should restore to the common pool whatever money he had taken to fund\n                    the purchase. Once an asset is regarded as a matrimonial asset to be divided,\n                    then for the purposes of determining its value, it must be assessed as at the\n                    date of the hearing. 40     Reverting to the present case, we do not think\n                    that the Judge was wrong to have held that the operative date should be the date\n                    on which thedecree nisiwas granted. The adoption\n                    of this operative date would not bring about an unjust result. Between the date\n                    of thedecree nisiand the determination of the\n                    ancillary matters, there was a lapse of some four long years. The spouse\n                    undertaking any new investment should be made to bear the consequences of his or\n                    her act provided that he or she restores to the common pool the funds which\n                    he/she had used to acquire the new asset. But this is where the difficulty lies\n                    as far as the present case is concerned. The Husband has not disclosed clearly\n                    in respect of the assets acquired after the filing of the divorce petition how\n                    much funds he had taken out from his savings to acquire each of these assets so\n                    that the same may be restored to the common pool. Given the adverse inferences\n                    that might be drawn in these circumstances, we think it would be best to deal\n                    with this group of assets in connection with the Husband’s failure to make\n                    full and frank disclosure (see[57]below).",
        "Shares in YHPL given by the Husband to the son and two\n                daughters": "41     We have earlier referred to the\n                    Daughters’ Shares which are very much in dispute (see[7]above). The position taken by the Husband\n                    before the Judge was that the Daughters’ Shares were shares which the\n                    daughters held on trust for him because they have yet to provide any\n                    consideration for the same. Interestingly, the Husband has not made a similar\n                    assertion in respect of the shares which were transferred to the son Alex\n                    (“Alex’s Shares”). The Judge not only held that the Husband\n                    was the beneficial owner of the Daughters’ Shares but also held that the\n                    Husband was the beneficial owner of Alex’s Shares. Alex’s 2,369,618\n                    shares in YHPL were valued at$22,675,127.24. The\n                    Judge’s reasoning was that the position of Alex’s Shares was\n                    analogous to that of the Daughters’ Shares. She said at [28] of the GD: “There is no direct\n                    evidence as to how the husband regards the shares in his son’s name but it\n                    is probable that he has a similar attitude to them and that as far as he is\n                    concerned, the son holds the shares at the husband’s pleasure”. The\n                    approach taken by the Judge seems to be that since there was evidence that the\n                    Husband regarded himself as the beneficial owner of the Daughters’ Shares\n                    it was logical to conclude that he would treat Alex’s Shares in the same\n                    way as the circumstances surrounding the transfer of the shares to the son were\n                    no different from those relating to the transfer of the Daughters’ Shares\n                    to the daughters. 42     It is settled law that an appellate court\n                    should defer to the trial judge’s finding of fact unless it can be\n                    established that the finding of fact is plainly wrong or unjustified on the\n                    totality of the evidence before the trial judge (Peh Eng Leng\n                        v Pek Eng Leong[1996] 1 SLR(R) 939). However, the\n                    appellate court would be in as good a position as the trial judge to make\n                    finding of facts when it is not based on the veracity and credibility of the\n                    witness (as in this case where the evidence was adduced in affidavits) but on an\n                    inference drawn from the facts or the evaluation of primary facts (seeTat Seng Machine Movers Pte Ltd v Orix Leasing Singapore\n                        Ltd[2009] 4 SLR(R) 1101 at [41]). 43     As stated in[41]above, the Judge’s finding as regards Alex’s\n                    Shares was based on a simple deduction from her finding as regards the\n                    Daughters’ Shares. On the evidence before the court, we could not help but\n                    believe that the Husband made the assertion that the daughters held their shares\n                    on trust for him because he took umbrage with the fact that the daughters,\n                    instead of taking a neutral stance, sided with their mother (the Wife) in the\n                    current matrimonial dispute between the parties. However, the fact of the matter\n                    is that the questions regarding the beneficial ownership of the Daughters’\n                    Shares were never fully explored. The daughters did not intervene in the\n                    proceedings. Neither did they file any affidavit in response to their\n                    father’s (the Husband’s) claims that the daughters were bare\n                    trustees of those shares. The question of the transfer of the shares to the\n                    daughters could very well be regarded as gifts, where the presumption of\n                    advancement would apply, and that was not addressed by the Judge. What is more\n                    significant is that, as stated before, shortly after the Judge had given her\n                    verdict, the daughters took out S 373/2010 claiming beneficial ownership of the\n                    Daughters’ Shares. Now that the Husband is facing a distinct prospect that\n                    the court in S 373/2010 could declare that the 1,516,556 shares belong to the\n                    daughters, it would be wholly inequitable to require the Husband to share\n                    something as a matrimonial asset when the very thing could very well be held not\n                    to belong to him (if the court were to hold in S 373/2010 that the\n                    Daughters’ Shares were given by the Husband to the daughters as\n                    gifts). 44     Admittedly, some aspects of the\n                    Husband’s conduct pertaining to the shares in YHPL left much to be\n                    desired. He had in November 2004 forged the Wife’s signature on a share\n                    transfer form to transfer 1,885,996 shares in YHPL which were registered in the\n                    Wife’s name to himself and allegedly a daughter (in respect of 195,273\n                    shares - however, it is not clear to whom these shares in fact went). He had\n                    also transferred the Daughters’ Shares (without their consent) to his\n                    brother and a sister on the pretext that the latter were each entitled to\n                    947,847 of the shares pursuant to two trust documents executed in November 2004.\n                    The Husband first mentioned these trust documents only in July 2008. The Judge\n                    did not accept this assertion and treated the shares transferred to the\n                    Husband’s siblings as his. The Husband had also not been entirely\n                    forthright in disclosing his assets so much so that the Judge drew an adverse\n                    inference against him. Several injunctions had also been obtained against the\n                    Husband to restrain him from dissipating matrimonial assets. For example, there\n                    was a court order granted on 21 June 2005 to restrain the Husband in his\n                    capacity as managing director and shareholder of YHPL from disposing the assets\n                    of YHPL – namely, the matrimonial home at No. 14 Lornie Road. However, on\n                    6 March 2006, the Husband called for an extraordinary general meeting\n                    (“EGM”) of YHPL and passed a resolution approving the sale of No\n                    14 Lornie Road. He was the sole attendee at the EGM. 45     In view of the foregoing, the Judge found the\n                    Husband to be someone who would manipulate the shareholdings of YHPL for his own\n                    purposes and thus YHPL should be considered the Husband’s alter ego.\n                    Relying on the observations of Munby J inW v\n                        H[2001] 1 All ER 300 (“W v\n                        H”), where he opined that the Family Division was entitled\n                    to pierce the corporate veil and hold a company to be an alter ego of the\n                    husband even where there was insignificant minority interest, the Judge here\n                    found that the Husband should be treated as the beneficial owner of the shares\n                    in his children’s names (see GD at [29]). 46     With respect, we have some reservations as to\n                    whether it would be appropriate to apply the views expressed inW v Hto the circumstances of the present case. InW v H, as the company was the alter ego of the\n                    husband, the court was able to pierce the corporate veil to regard a property\n                    owned by the company as belonging to the husband for the purposes of granting an\n                    interlocutory relief in order to preserve the status quo.W v\n                        Hdid not decide the ownership of shares, as the wife there was\n                    only asking for an injunctive relief to stop the Company and a third party (to\n                    whom the husband had transferred his shares in the company) from disposing of\n                    the matrimonial property before its true ownership could be decided in the\n                    ancillary proceedings between the wife and the husband. For the purposes of the\n                    injunctive relief, the property owned by the company was treated as having been\n                    vested in the husband, but it did not mean the property owned by the company\n                    therefore actually belonged to the husband. The observation on piercing the\n                    corporate veil was to justify the grant of the interlocutory relief without\n                    requiring the company to be joined as a party. Here we are dealing with shares\n                    in YHPL which the Husband had already transferred to his son Alex and the two\n                    daughters and the question which is now in issue is whether those shares were\n                    intended as gifts to the children or whether the children are just bare\n                    trustees. We do not see how the principle of piercing the corporate veil arises\n                    or is relevant here. 47     Returning to the issue of the Daughters’\n                    Shares, the status of those shares would have to await the outcome of S\n                    373/2010. As for Alex’s Shares, the outcome of the daughters’ suit\n                    should not affect Alex’s shares since rebutting the presumption of\n                    advancement for the daughters does not equate to rebutting the presumption of\n                    advancement for Alex. Although the Husband claims that he gave shares to his\n                    family members as the Company Act did not allow him to be the sole shareholder,\n                    that claimper semay not necessarily suffice to\n                    rebut the presumption of advancement to the son. Furthermore, the Judge erred in\n                    treating the Daughters’ shares and Alex’s shares analogously since\n                    it was clear from the facts that the Husband treated the daughters and Alex\n                    differently. 48     The facts suggest that the shares were given\n                    by the Father not just as gifts to his children but as recognition of their\n                    contributions in his companies because no shares were ever given to his oldest\n                    son who did not work for his companies. Alex had played a very different role as\n                    compared to the daughters in YHPL and SIL. Alex is the current Chief Executive\n                    Officer of SIL and occupies a more senior managerial role than the\n                    daughters’ previous clerical positions. The daughters also recognised in\n                    their affidavits filed for Suit 371/2010 that the Father had treated Alex as his\n                    future successor in SIL. As Alex and the daughters clearly hold their shares in\n                    different capacities, the Judge should not have automatically applied the\n                    reasoning for the Daughters’ shares to Alex. Presently, neither the\n                    Husband nor Alex disputes that Alex is the beneficial owner of his shares and\n                    thus Alex’s shares should be excluded from the pool of matrimonial\n                    assets.",
        "Shares in YHPL given to the Wife": "49     As mentioned in[44]above, the Husband forged the signature of the Wife in\n                    transferring the 1,885,966 shares in YHPL held in the Wife’s name back to\n                    himself and allegedly a daughter (in respect of 195,273 shares). It is not clear\n                    to whom the 195,273 shares had actually gone. But that is hardly important. In\n                    any case, for the purposes of the division of matrimonial assets, it would make\n                    no difference whether those shares are held in the name of the Wife or the\n                    Husband or his nominee. They will remain as matrimonial assets to be divided\n                    between the parties. 50     Thus, excluding Alex’s Shares and the\n                    Daughters’ Shares, the undisputed total shareholding which the Husband\n                    holds in YHPL amounts to 5,787,570 shares, consisting of 3,901,604 shares in the\n                    Husband’s name plus the 1,885,966 shares taken from the Wife. This\n                    constituted 61% of the total shareholding in YHPL (the total shares issued in\n                    respect of YHPL being 9,478,472).",
        "Whether the Wife’s jewellery is part of the Matrimonial\n                Assets": "51     The next issue which we need to address is the\n                    Husband’s claim that the Wife’s jewellery should be included in the\n                    pool of matrimonial assets. The Wife had not given details of her jewellery\n                    collection in her affidavits and the Husband submits that an adverse inference\n                    should be drawn against her under Section 116(g) of the Evidence Act. InTianzon, this Court said (at [13]) that it saw “no reason why gifts\n                    of substantial value such as a motor car, landed property and investments, which\n                    were acquired by one spouse during the marriage and given to the other”\n                    should not be considered matrimonial assets. However, “for practical\n                    purposes, minor items of gift such as dresses and even jewellery of no\n                    substantial value, are normally consideredde\n                        minimisand are not taken into account” (Tianzonat [13]). 52     The Judge believed the Wife, who had generally\n                    made full and frank disclosure of her assets, that her jewellery collection was\n                    not of substantial value. The Husband gave no evidence to substantiate his claim\n                    that the Wife’s jewellery collection was valuable, and since he was the\n                    one who gave the jewellery to the Wife, it does not seem unreasonable for him\n                    to, at least, give some evidence on the individual jewellery pieces which the\n                    Wife owned or an estimate of their value. The Judge exercised her discretion and\n                    excluded the jewellery from being taken into account because in her view,\n                    relative to the matrimonial assets as a whole, “even if the jewellery was\n                    worth something in the range of a quarter million to half a million\n                    dollars” this would not add a substantial value to the pool of\n                    matrimonial assets (GD at [48]). We are\n                    not minded to disturb this exercise of discretion by the Judge.",
        "The total matrimonial assets": "53     The Judge at [46]-[47] of the GD held\n                    that the Husband’s matrimonial assets totalled$111,429,816. This was rounded up to $111.5m. Both the Husband\n                    and Wife are in agreement that the Judge’s calculation of $111,429,816 had\n                    an arithmetic error and this was probably due to the double-counting of the\n                    amount of $524,970 for the 614,000 shares in SIL (see table at[62]below). In the subsequent paragraphs, we will\n                    also be addressing some other errors of computation. Double counting of assets of YHPL 54     A total sum of$11,689,762.04 was deposited in the High Court, made up as\n                    follows: S/NoItemValue(a)Net Sale Proceeds of No 14 Lornie Road\n                                            (registered under YHPL’s\n                                    name)$8,688,372.58(b)Dividends on 98,160,765 shares in SIL\n                                            together with interest (owned by\n                                    YHPL)$426,259.49(c)Dividends on 98,160,765 shares in SIL\n                                            together with interest (owned by\n                                    YHPL)$381,290.90(d)Net Sale Proceeds of 202A Lornie Road\n                                            (owned by Husband)$1,960,121.12(e)Proceeds from Sale of Husband’s\n                                            300,000 shares in SIL$142,384.72(f)Interest and part of fixed deposits held\n                                            by CTCL Law Corporation which Husband treated as\n                                            belonging to YHPL$91,333.23   55     The Husband does not dispute that items (d)\n                    and (e) in the table above, are assets beneficially owned by him. However, as\n                    regards the other items, it seems to us that there is double counting. Those\n                    sums of money belong to YHPL. The approach taken by the Judge seems to be that\n                    as she regarded the Husband as the effective owner of all the shares of YHPL,\n                    she treated the moneys listed under items (a),(b),(c) and (f) as belonging to\n                    the Husband. Quite apart from the question as to whether in circumstances like\n                    the present, where there is no allegation that YHPL was a sham entity or was\n                    just a device (seeWin Line (UK) Ltd v Masterpart (Singapore)\n                        Pte Ltd and another[1999] 2 SLR(R) 24) it is proper to\n                    pierce the corporate veil to treat these sums of money of YHPL as belonging to\n                    the Husband, it would be quite unfair in the fact-situation here to so regard\n                    those moneys. This is because since those sums were taken into account in\n                    determining the worth and value of YHPL, to have them regarded as the assets of\n                    the Husband would necessarily lead to double-counting. Therefore, only$2,102,505.84 (items (d) and (e) in the table above) of\n                    the deposit of $11,689,762.04 with the High Court should be included in the pool\n                    of matrimonial assets to be divided. Sale of 22.5 million shares that YHPL held in SIL 56     Another instance of double-counting relates to\n                    22.5 million shares in SIL which were held by YHPL and which the latter sold for\n                    the sum of $6 million. The Judge, on the basis that the Husband owned all the\n                    shares in YHPL, held that the $6 million belonged to the Husband. For the\n                    reasons alluded to in[55]above, the sale\n                    proceeds of $6 million should not be treated as something belonging to the\n                    Husband. As we have said, the valuation of the shares in YHPL would have\n                    included this sum. Assets the Husband argue should not be Matrimonial Assets 57     At[40]above, we upheld the Judge’s finding that the operative date in this case\n                    was the date of thedecree nisi. It must therefore\n                    follow that the assets the Husband acquired after the date of thedecree nisiwere not matrimonial assets. However, as the\n                    Husband has failed repeatedly to make full and frank disclosure of his assets\n                    and to furnish evidence that the assets he acquired after the date of decree was\n                    not funded from the common pool of matrimonial assets, an adverse inference that\n                    these assets were acquired from funds from the common pool of matrimonial assets\n                    will be made against him. 58     We now turn to the 614,000 SIL shares which\n                    the Husband allegedly bought in April 2005, after the Wife left the matrimonial\n                    home and which have a value of $524,970. There is no evidence as to the precise\n                    date on which they were bought by the Husband. The Husband contends that as the\n                    shares were acquired after the Wife had left the matrimonial home, they should\n                    not be regarded as a matrimonial asset. For the reasons which are alluded to in[40], this contention is clearly\n                    untenable. By the Husband’s logic it would be all too simple for a spouse\n                    to exclude assets which are part of the common pool for division by simply\n                    making fresh purchases after the date of separation. As the Husband has not\n                    indicated how much he had spent to pay for the shares, we are in no position to\n                    restore what was taken by him from the common pool for that purpose and as the\n                    Wife also wishes to treat the shares as matrimonial assets, it is only just the\n                    court should do so. The Husband has not shown that the shares had been bought\n                    with resources which he had independently amassed after the grant of thedecree nisi. Therefore, an adverse inference\n                    will be drawn and the entire value of the 614,000 shares will be notionally\n                    placed into the pool of matrimonial assets. 59     The proceeds from the 202A Lornie Road\n                    property will be included in the pool of matrimonial assets. It was acquired in\n                    May 2005 before the date of thedecree nisi.\n                    However, the property at 6 Chestnut Close bought by YHPL will be excluded from\n                    the pool of matrimonial assets as it would be double-counting. Unlike 202A\n                    Lornie Road, for which the Husband subsequently asserted had been bought for him\n                    by YHPL as a trustee, 6 Chestnut Close remains YHPL’s\n                property. 60     The property at 9 Wak Hassan Drive was bought\n                    after the date of thedecree nisiin November 2005\n                    with the party cited. The Husband in his affidavit stated that he made a direct\n                    financial contribution of $600,000 to its purchase. An adverse inference is\n                    drawn because there is no evidence that this was independently amassed after the\n                    grant of thedecree nisiand $600,000 will be\n                    notionally returned to the pool of matrimonial assets. Similarly, 74 Andrews\n                    Terrace was bought after the date of thedecree\n                        nisiin August 2008 with the party cited. The Husband in his\n                    affidavit stated that he made a direct financial contribution of about\n                    $1,000,000 to its purchase. An adverse inference is also drawn because there is\n                    no evidence that this was independently amassed after the date of thedecree nisiand $1,000,000 will be notionally returned\n                    to the pool of matrimonial assets. 61     The Husband was granted in April 2009 an\n                    option to subscribe for 500,000 shares in SIL. This was acquired four years\n                    after thedecree nisiand should not be regarded\n                    as a matrimonial asset. It is also likely that this was given to the Husband for\n                    the work he did after the date of thedecree nisiand therefore no adverse inference should be drawn. As regards the 800,000\n                    shares in Roxy Pacific Holdings Ltd, the Husband has provided no evidence as to\n                    when those shares were acquired. The company was listed in March 2008. While\n                    these shares were likely acquired after the date of thedecree nisi, the Husband provided no evidence as to what funds\n                    he had used to acquire these shares and an adverse inference will be drawn to\n                    place the value of these shares into the matrimonial pool. The cars bought on\n                    hire-purchase in 2008 and 2009 are disregarded because of indications that they\n                    are of negative value. List of matrimonial assets 62     In the light of what is stated above, the full\n                    list of matrimonial assets is set out in the table below: Final Table of Matrimonial Assets S/NoItemValue ($)(a)5,787,570 shares in\n                                    YHPL55,381,874.29(b)300,000 shares in Swissco\n                                        Marine1,800,000(c)20,000 shares in Asia\n                                        Enterprise4,800(d)614,000 shares in\n                                    SIL524,970(e)1,360 shares in\n                                    SingTel4,025(f)1 share in Swissco Structural Mechanical\n                                            Pte Ltd1(g)UOB Bank account no\n                                        134-xxx-xxx-192,364(h)CPF account34,915(i)Club memberships53,500(j)Cars owned at date of thedecree\n                                    nisiUnknown(k)Half share in 6 Shamah\n                                        TerraceUnknown(l)Property in Gold Coast,\n                                        AustraliaUnknown(m)Net Sale Proceeds of 202A Lornie Road\n                                            (monies deposited with the High\n                                    Court)1,960,121.12(n)Proceeds from Sale of Husband’s\n                                            300,000 shares in SIL (monies deposited with the High\n                                            Court)142,384.72(o)All of Wife’s\n                                    assets860,000(p)Husband’s direct financial\n                                            contribution to 9 Wak Hassan Drive600,000(q)Husband’s direct financial\n                                            contribution to 74 Andrews Terrace1,000,000(r)800,000 shares in Roxy Pacific Holdings\n                                            Ltd208,000Total (not including assets whose values\n                                            are unknown):62,666,955.13   63     If in S 373/2010 the Daughters’ Shares\n                    are held to belong to the Husband, an additional $14,512,086.03 will be added to\n                    the pool of matrimonial assets.",
        "Adverse Inferences": "Adverse Inference as to the Husband’s Undisclosed\n                Assets 64     The Judge found that the Husband had breached\n                    his duty of making full and frank disclosure of his assets and attributed a\n                    “further $11m or ten percent of the disclosed assets as being the value\n                    of the husband’s undisclosed assets” (GD at [47]). The Judge took a broad brush approach\n                    in adding 10% more as representing the Husband’s undisclosed assets. The\n                    Judge seemed to be following the mode suggested by the High Court inLau Loon Seng[1999] 2 SLR(R) 688, where it\n                    was held that when quantifying “undisclosed assets”, the court\n                    should make a finding of the value of the undisclosed assets on the available\n                    evidence and it would be for the other party to prove that such a value is\n                    unreasonable. This approach was reiterated inTay Sin Tor v\n                        Tan Chay Eng[1999] 2 SLR(R) 385 (“Tay Sin Tor”). 65     InNK v NL[2007] 3 SLR(R) 743 (“NK v\n                        NL”), this court had the occasion to consider the approach\n                    adopted inTay Sin Torand held that while that\n                    approach was sound, it was but one of at least two alternatives. Much would\n                    depend on the fact-situation of each case. This court also cautioned against\n                    “unnecessary speculation” with regard to the specific values of\n                    the undeclared assets (NK v NLat [61]). InNK v\n                        NL, what was in contention was that the husband was not able to\n                    account for the disappearance of some $2.7 million. Rather than adding a\n                    specific sum into the matrimonial pool for division, this court held that in\n                    those circumstances (the unaccountability of $2.7 million) it “might be\n                    more just and equitable (not to mention, practical) to order a higher proportion\n                    of the known assets to be given to the wife” (NK v\n                        NLat [62]). 66     In this connection, we would like to emphasise\n                    one aspect where a party is regarded as not having made full and frank\n                    disclosure of his or her assets. In the nature of things, whichever approach the\n                    court adopts in such a situation, it is undoubtedly to a large extent\n                    speculative; whether it decides to give a value to what it considers to be\n                    “undisclosed assets” or to give a higher percentage of the\n                    disclosed assets to the other party. Either approach would translate to giving\n                    something more to the other spouse by way of a specific sum. The very fact that\n                    the court is confronted with the problem of “undisclosed assets”\n                    means that the position is unclear and far from certain. In the final analysis,\n                    it is for the court to decide, in the light of the fact-situation of each case,\n                    which approach would in its view best achieve an equitable and just result. What\n                    must be clearly recognised is that when the court makes such a determination it\n                    is not undertaking an exercise based on arithmetic but a judgmental exercise\n                    based, in part at least, on feel. 67     To take 10% of the disclosed assets as being\n                    the value of the Husband’s undisclosed assets could be said to be\n                    arbitrary. In the present case, the arbitrariness of this approach is perhaps\n                    illustrated when one considers that if some of the trial judge’s findings\n                    on matrimonial assets are overturned (as happened here), the pool of disclosed\n                    matrimonial assets would shrink and in turn the 10% representing the undisclosed\n                    assets would similarly shrink. Of course, this is not to say that, in a like\n                    scenario, taking the other approach of giving a higher percentage of the\n                    matrimonial assets as determined by the Judge would not have had a similar\n                    effect. If an appellate court were to remove some assets from the pool of\n                    matrimonial assets, then the ultimate assets which the Wife would obtain by way\n                    of the higher percentage would also be reduced. Thus, in each case the court\n                    would have to decide on the facts which approach would best enable it to achieve\n                    a just and equitable result. We would further add that in the present case,\n                    there is one further complication which must be factored into the equation. Here\n                    we are dealing with not only undisclosed assets but also with disclosed assets\n                    in respect of which values are not disclosed. This is an aspect to which we will\n                    now turn. Husband’s disclosed assets with unknown values 68     It would be seen from the assets listed in the\n                    table at [62] that a number of them have\n                    unknown values: item (j), cars owned at date of thedecree\n                        nisi; item (k), a half share in 6 Shamah Terrace and item (l),\n                    property in Gold Coast, Australia. The Judge did not attempt to give a value to\n                    each of these items. Neither did she include these items in the final\n                    computation of the total value of the matrimonial assets. Item (k) was in fact\n                    sold and the profits given to charity, but the Husband did not give information\n                    as to the price at which 6 Shamah Terrace was sold. In view of these omissions,\n                    the Judge was within her rights to draw an adverse inference against the Husband\n                    and to give a value to each of these items as she deemed\n                reasonable. 69     InKoh Kim Lan Angela v\n                        Choong Kian Haw[1993] 3 SLR(R) 491 (“Koh Kim Lan Angela”), this court drew such an\n                    adverse inference against the husband when it ascribed a value to disclosed\n                    assets with unknown values. The husband inKoh Kim Lan\n                        Angeladeliberately gave an inflated value of the shares which\n                    was obviously not the true value of the shares as this value was attributed\n                    before the structural reorganisation of the family business and the shares would\n                    in consequence be worth less. The husband thought the Court would thus not be\n                    able to divide the shares because the true value of the shares was not known at\n                    the ancillary hearing. However, the Court drew an adverse inference and ordered\n                    the division of the shares using the inflated value the husband provided. It\n                    should be noted that to counterbalance the inflated values, the court gave the\n                    wife only 15% of the matrimonial assets as so determined. 70     The problem which the court was confronted\n                    with in the present case was that with insufficient evidence, the court could\n                    not reasonably ascribe a value to those disclosed assets (with no indicated\n                    values). Of course, the Judge could have ordered the assets to be assessed by an\n                    independent valuer, whose costs could have been ordered to be borne equally\n                    between the parties. From the GD at [47], it would appear that the Judge had lumped the undisclosed\n                    assets together with the disclosed assets (with no values indicated) and\n                    accorded them a value based on 10% of the disclosed assets (with values). We\n                    cannot say that this approach is necessarily wrong or that the approach of\n                    giving a higher percentage of the total matrimonial assets would necessarily\n                    give a more accurate and just figure. Thus, 10% of the disclosed assets will be$6,266,695.51and an additional $1,451,208.60if the Daughter’s Shares in YHPL are\n                    eventually held, following the action in S 373/2010, to belong beneficially to\n                    the Husband. 71     Adding these figures ($62,666,955.13and$6,266,695.51)\n                    will give a sum of $68,933,650.64, which sum\n                    amounts to the total value of the matrimonial assets. This figure excludes the\n                    value of the Daughter’s Shares. Although the Judge deducted $6.8 million,\n                    being YHPL’s overdraft liability which the Husband took responsibility for\n                    as guarantor and shareholder of YHPL, this is incorrect as that sum cannot be\n                    treated as the Husband’s own liability. To deduct YHPL’s liabilities\n                    from the matrimonial assets would be to make the same error as double-counting\n                    YHPL’s assets into the pool of matrimonial assets. All of these are\n                    already reflected in YHPL’s share value.",
        "Division of Matrimonial Assets": "",
        "Just and Equitable Division": "72     The Judge divided the matrimonial assets in\n                    the proportions of 35:65 in favour of the Husband. Both parties are unhappy,\n                    with the Husband arguing that the Wife should not get more than 20% while the\n                    Wife submits that the matrimonial assets should be divided equally. The question\n                    before us is whether this division is “just and\n                equitable”. 73     At this juncture, we will briefly revisit the\n                    findings of the Judge as to what each party has done for the family as well as\n                    towards the accumulation of the family fortune. She found that the Wife’s\n                    contributions were “being a parent, a homemaker and a caregiver”\n                    and her contributions “were confined to the domestic sphere” (GD\n                    at [51]). She regarded the Wife’s\n                    earlier contributions when the Husband first started out his business such as\n                    helping to entertain customers’ wives, answering phone calls and even\n                    procuring an alleged loan of $20,000 for the business start-up as\n                    “peripheral” and of “minimal” significance (GD at\n                        [50]). While the Wife’s\n                    contributions were only indirect contributions in the domestic sphere, the Judge\n                    nevertheless emphasised that the Wife “contributed to the family and the\n                    marriage to thebest of her abilityby taking on\n                    the role of homemaker and mother” (emphasis added) (GD at [56]). Although the family is extremely\n                    well-off now, they were poor in the early years and therefore the Wife’s\n                    role must have been “more arduous” then (GD at [56]). Of course as the family fortune\n                    improved, the physical demands on the Wife would be less (with perhaps the help\n                    of a maid). But her duty to maintain the home and attend to the needs of\n                    children would have continued. 74     The Husband sought to lessen the significance\n                    of the Wife’s contribution by saying that after their youngest child left\n                    for United Kingdom in 1981 to study in a boarding school, there was not much for\n                    her to do. He claimed that from then on, “she had led a luxurious life\n                    engaging in ballroom dancing, singing lessons and having tea with her\n                    friends” (GD at [51]). We are not\n                    persuaded that this argument should be given much weight. The Judge also thought\n                    so. It stands to reason that in all long marriages, where the wife is a\n                    full-time homemaker, there will come a point in time when the children will\n                    become independent as adults and their demands on the Wife, as a mother, will\n                    decrease. But her duty to maintain the home would undoubtedly continue. It would\n                    be grossly inequitable to minimise her contributions just because the children\n                    have grown up and left the coop. 75     However, the Judge recognised the\n                    Husband’s “unusual drive and ability” in building up an\n                    extremely successful business in the marine industry literally from scratch (GD\n                    at [57]). It cannot be gainsaid that the\n                    success was due largely to the Husband’s “special skills” in\n                    the marine industry. What is clear is that all the direct financial\n                    contributions to the family’s wealth have been made by the Husband while\n                    the indirect non-financial contributions have substantially been made by the\n                    Wife. What is also not disputed is that the Husband has been meeting all the\n                    expenses of the family, including the children’s education overseas. This\n                    is very much a traditional family as far as the roles of the spouses are\n                    concerned. 76     Section 112(2) of the Charter provides a\n                    non-exhaustive list of factors which a court is required to have regard in\n                    determining how the matrimonial assets are to be divided. A wide discretion is\n                    conferred upon the court. The section does not prescribe the weight which should\n                    be attributed to each factor or how each factor should be regarded as against\n                    another factor. In most instances, the difficulty lies in evaluating the\n                    non-financial contributions of the homemaker wife as such contributions are not\n                    easily reducible into monetary terms. InLock Yeng Fun v Chua\n                        Hock Chye[2007] 3 SLR(R) 520 (“Lock Yeng Fun”) this Court noted (at [39]) that non-financial contributions were by\n                    their very nature “difficult to measure because they are, intrinsically,\n                    incapable of being measured in precise financial terms”. That having been\n                    said, the court went on to state that such difficulty should never be a ground\n                    to refuse that spouse his or her equitable share in the matrimonial\n                    assets. 77     InLock Yeng Funat [40], this court had also observed\n                    that the legislative mandate in s 112 of the Charter was to treat all\n                    matrimonial assets as “community property”. Adopting this view of\n                    the matrimonial assets, counsel for the Wife argued that she should be given an\n                    equal share of the matrimonial assets. In support of her contention, the Wife\n                    relies on the following statement expressed by the High Court inYow Mee Lan v Chen Kai Buan[2000]\n                    2 SLR(R) 659 at [43]\n                        (“Yow Mee Lan”): [M]arriage is not a business where, generally, parties receive an economic\n                        reward commensurate with their economic input. It is a union in which the\n                        husband and wife work together for their common good and the good of their\n                        children. Each of them uses (or should use) his or her abilities and efforts\n                        for the welfare of the family and contributes whatever he or she is able to.\n                        The parties often have unequal abilities whether as parents or income\n                        earners but, as between them, this disparity of roles and talents should not\n                        result in unequal rewards where the contributions are made consistently and\n                        over a long period of time. At this juncture, we would wish to point out that the judge who made\n                    the above quoted remarks inYow Mee Lanwas also\n                    the same judge who in the present case decided to accord the Wife only 35% of\n                    the matrimonial assets. 78     The views expressed inYow\n                        Mee Lanwas endorsed by this court inLim\n                        Choon Lai (mw) v Chew Kim Heng[2001] 2 SLR(R) 260\n                    where it said that in determining the division of matrimonial assets all\n                    relevant circumstances must be taken into account, particularly those matters\n                    listed out under s 112(2). But the court is not expected to make an exact\n                    calculation of each spouse’s contributions, whether financial or\n                    non-financial. Ultimately, the court must take a broad brush approach to reach\n                    what in its view is a just and equitable division. 79     As observed in[76]above, Parliament has very appropriately refrained from\n                    laying down more specific considerations in s 112 other than listing out a\n                    non-exhaustive list of factors which the court should take into account.\n                    Similarly, we do not think it falls within the province of the court to fill in\n                    the blanks which Parliament has deliberately left open. Thus the exact division\n                    which the court will make in each particular case will necessarily be fact\n                    sensitive and that must have been intended by Parliament. The only guidance\n                    which Parliament has laid down is “just and equitable” and that is\n                    the objective which the court must in each case seek to achieve. The division\n                    made in an earlier case is no more than an illustration which subsequent cases\n                    can take into account as guides, always bearing in mind the difference in\n                    circumstances and that no two cases are identical. 80     In order for this court to disturb the\n                    division ordered by the Judge of 35:65 in favour of the Husband, it must be\n                    shown that the Judge had erred in law or had clearly exercised her discretion\n                    wrongly or had taken into account irrelevant considerations or had failed to\n                    take into account relevant considerations: seeKoh Bee Choo v\n                        Choo Chai Huah[2007] SGCA 21 at [46]. She specifically stated that she had\n                    taken into account all the circumstances, including the length of the marriage\n                    as well as the size of the pool of the matrimonial assets. We note the\n                    Judge’s observation that the Husband’s contributions to the\n                    family’s fortunes have been “extraordinary” (GD at [57]). 81     At this point, we would refer toAJRwhere the High Court advanced an 8-step approach as\n                    a countercheck to see if the apportionment arrived at by using the broad brush\n                    approach to the division of matrimonial assets is just and equitable. All we\n                    wish to say is that the 8-step approach is much too detailed and seeks to make\n                    it appear as if the court’s determination of the division of matrimonial\n                    assets is an exercise which is capable of being reduced to mathematical\n                    precision when in fact it is not so. Indeed, the High Court judge had to makecertain assumptionsin order to find that the\n                    importance of total direct contributions and indirect contributions to the\n                    overall welfare of the family was in the ratio of 65-35. Section 112 of the\n                    Charter is concerned with dividing surplus matrimonial assets between the\n                    Husband and Wife based ontheirrespective\n                    contributions. To make a finding that both parties contributed 65% by total\n                    direct contributions and 35% by total indirect contributions to the welfare of\n                    the family adds little value to the final determination. The 8-step approach is\n                    a fine brush approach rather than a broad brush approach. As the two approaches\n                    are quite distinct and different, we have reservations as to whether it will\n                    really be appropriate to use the result of one approach to verify the\n                    correctness of the other. At the end of the day, we wish to underscore the point\n                    that the broad brush approach, as stated in[66], is all about feel and the court’s sense of\n                    justice. 82     The Judge in making the division had viewed\n                    the matrimonial assets on a global basis. Having regard to all the\n                    circumstances, she felt that a division at 35:65 was just and equitable. The\n                    Wife’s case is basically that as this is a long marriage and she has given\n                    all she has to the family, by way of maintaining the home and taking care of the\n                    children, she should be entitled to a half share of the matrimonial assets. But\n                    that is not the scheme of things under the Charter. Neither is it what the\n                    Charter says. What the court is being asked is to weigh the various factors and\n                    to give the appropriate weightage to each. The Judge did that and felt that an\n                    apportionment at 35:65 was right. We cannot find any specific basis to question\n                    that division. Neither can we say that 35% of a large pool of matrimonial assets\n                    would be unjust to a spouse whose contributions were all in the domestic sphere.\n                    In the result, we are not inclined to overturn the division made by the\n                    Judge.",
        "Conclusion": "83     For the above reasons, the appeal in CA 81 of\n                    2010 is partially allowed to the extent that the position of the\n                    Daughters’ Shares would have to await the outcome in S 373/2010. We have\n                    also removed the instances of double-counting in considering the pool of\n                    matrimonial assets. In the meantime, the total value of the matrimonial assets\n                    shall be as stated in[71]and that is the\n                    amount to be divided between the parties in the ratio of 35:65 in favour of the\n                    Husband. The sum of$11,689,762.04 paid into court\n                    has already been paid out to the Wife towards satisfying her share of the\n                    matrimonial assets. In addition, the $860,000 which she currently holds and the\n                    maintenance she has received must also be brought into account. The remainder of\n                    the Wife’s entitlement should be paid by the Husband to her within three\n                    months from the date hereof. 84     In the event that following the final outcome\n                    in S 373/2010 (including any appeal to this court), the Daughters’ Shares\n                    are to be regarded as belonging to the Husband, then the values of those shares\n                    shall be added to constitute part of the matrimonial assets and the Husband\n                    shall pay to the Wife her due share of the enlarged matrimonial assets (which\n                    should include the 10% mark-up for non-disclosure – see[70]above) within six months of that final\n                    outcome. 85     CA 82 of 2010 is substantially dismissed as\n                    the Wife has not succeeded on the two main issues raised, the value of the\n                    matrimonial assets and the Wife’s share of those assets. Of course, we\n                    also recognise that these issues replicate some of those in CA 81 of 2010. In\n                    the result, we order that there shall be no order as to costs of the appeals,\n                    including the two interlocutory applications, SUM 3287 of 2010 (to adduce fresh\n                    evidence) and SUM 5494 of 2010 (application for stay of execution pending the\n                    delivery of this judgment). There will be the usual consequential\n                orders."
    }
}