{
    "case_title": "Motor Image Enterprises Pte Ltd\n      v\n      SCDA Architects Pte Ltd",
    "ncitation": "[2011] SGCA 58",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This appeal arises from a decision of a High\n                    Court judge (“the Judge”) dismissing an appeal against a domestic\n                    arbitration award (seeMotor Image Enterprises Pte Ltd v SCDA\n                        Architects Pte Ltd[2011] 1 SLR 497 (“the\n                    Judgment”)). In dismissing the appeal, the Judge held that it was not\n                    appropriate for her to make a ruling on a question of law for which she had\n                    earlier granted leave to appeal under s 49(5) of the Arbitration Act\n                    (Cap 10, 2002 Rev Ed) (“AA”). The Judge had also held\n                    that the question of law had not properly arisen as it had not been premised on\n                    the facts that the arbitrator had found. 2       This appeal presents an opportunity to this\n                    Court to clarify the statutory regime for appealing against domestic arbitration\n                    awards under s 49 of the AA.",
        "Background facts and procedural history": "",
        "The dispute before the arbitrator": "3       The appellant, Motor Image Enterprises Pte Ltd\n                    (“Motor Image”), is in the business of distributing and selling\n                    motor vehicles and spare parts and providing workshop services for motor\n                        vehicles.[note: 1]The respondent, SCDA Architects Pte\n                    Ltd (“SCDA”), supplies architectural services.[note: 2] 4       Motor Image engaged SCDA to provide\n                    architectural services for retrofitting and alterations works at Motor\n                    Image’s premises at 25 Leng Kee Road (“the\n                        Project”).[note: 3]The contract between SCDA and Motor Image (“the Architectural\n                    Contract”) was subject to the Singapore Institute of Architects\n                    Conditions of Appointment and Architects Services and Mode of Payment\n                    (“the SIA Terms”).[note: 4]The Project was never completed\n                    because Motor Image abandoned it. 5       SCDA then commenced arbitration proceedings\n                    against Motor Image for the balance of the fees allegedly due to it. Motor Image\n                    counterclaimed for a refund of interior design fees and damages for SCDA’s\n                    alleged breach of contract, negligence, breach of statutory duties, professional\n                    duties and/or ethical duties.[note: 5] 6       The counterclaim was based on SCDA’s\n                    alleged failure to ensure that its drawings complied with relevant laws and\n                    regulations, and its failure to properly advise Motor Image on whether its\n                    intended designs complied with the Use Quantum Requirement prescribed by the\n                    Urban Redevelopment Authority (“the URA”).[note: 6]The Use Quantum\n                    Requirement was that “only 40% of [Motor Image’s] premises could be\n                    used as a showroom or for ancillary purposes such as for offices or\n                    storerooms” (see the Judgment at [7]). 7       SCDA had submitted three sets of drawings to the\n                    URA for approval. The first and second submissions to the URA were rejected\n                    because they did not comply with the URA’s Use Quantum\n                        Requirement.[note: 7]However, the URA\n                    accepted the third set of drawings that SCDA submitted to it (“the Third\n                    URA Submission”). To complicate matters, SCDA sent adifferentset of drawings (“the 29 June 2005\n                    Drawings”) to Motor Image just one day after it submitted its second\n                    submission to the URA. 8       In a detailed written award dated\n                    9 February 2009 (“the Award”), the arbitrator, who was a\n                    practising architect at the time of the arbitration, allowed SCDA’s claim\n                    for its fees for architectural services but disallowed its claim for interior\n                    design fees. The arbitrator also dismissed Motor Image’s\n                    counterclaim. 9       It was not disputed during the arbitration\n                    proceedings that the parties had fixed the architectural fees at 8.5% of the\n                    “total construction costs” (as defined in the SIA Terms) with a\n                    minimum lump sum of $200,000.[note: 8]Motor Image had, however, abandoned\n                    the Projectbeforea contract was awarded to\n                    building contractors but after tenders were called and received. In such a\n                    situation, condition 1.3(3)(b) of the SIA Terms provides that the\n                    “total construction costs” for the purpose of determining the\n                    architect’s fees was the “lowestbona\n                        fidetender received by the [a]rchitect”.[note: 9]Another provision of the SIA Terms\n                        (condition 2.3(3)[note: 10]) states that where\n                    a project is abandoned, the architect’s fees would be\n                    “commensurate” with the services that he provided. It was also not\n                    disputed that, at the time when Motor Image abandoned the Project, SCDA had\n                    completed 57.5% of the works it was obliged to complete under the Architectural\n                        Contract.[note: 11]Accordingly, reading condition 1.3(3)(b)\n                    with condition 2.3(3), SCDA was entitled to architectural fees according to\n                    the following formula: 8.5% x 57.5% x lowestbonafidetender 10     SCDA called for two tenders after the URA\n                    approved the Third URA Submission: (a)     The lowest tender under the first\n                        tender exercise (“the First Tender”) was $9,480,000. The\n                        arbitrator found that the First Tender was based on the 29 June 2005\n                        Drawings, which had an “expanded scope of works”.[note: 12]According to the arbitrator, SCDA was\n                        balancing two concurrent processes: SCDA was making submissions to the URA\n                        for approval while, at the same time, preparing drawings (ie, the 29 June 2005 Drawings, which were used for the\n                        First Tender) to achieve Motor Image’s desired design. The arbitrator\n                        held that it is “common\n                        practice” for drawings on which tenders are called to be\n                        different from the drawings submitted to the URA for approval.[note: 13]The project could have been regularised at a later stage by submitting an\n                        amendment. (b)     The\n                        lowest tender under the second tender exercise (“the Second\n                        Tender”) was $3,782,912. The arbitrator found that the Second Tender\n                        was based on a “reduced scope of works” after Motor Image\n                        found out that the scope envisaged in the First Tender was not cost\n                            effective.[note: 14] 11     Unsurprisingly, SCDA contended that the lowestbonafidetender\n                    for the purpose of computing its fees was $9,480,000.[note: 15]Motor Image\n                    disagreed. It argued that the lowestbona fidetender was $3,782,912. 12     The arbitrator found thatbothtenders werebona fidebecause they were both carried out with Motor Image’s knowledge and\n                        consent.[note: 16]The arbitrator also agreed with SCDA\n                    that the First Tender ought to be used for calculating the fees due. The\n                    arbitrator’s reasons for reaching that conclusion are set out at p 15\n                    of the Award:[note: 17] In arriving at my decision, I had taken into consideration that [Motor\n                        Image] did agreed [sic] with all the\n                        submissions including calling of [the First Tender] and [the Second Tender].\n                        At no time was [SCDA] stopped for unsatisfactory service. And as [the Second\n                        Tender] was what [Motor Image] wanted and which could be legally\n                        constructed. [sic] It is not reasonable for\n                        [Motor Image] having agreed to [the Second Tender], having obtained what\n                        they wanted and that could be legally constructed and that cost was not an\n                        issue, then decided [sic] not to proceed with\n                        the works and to use the lowest tender to argue the bases [sic] for computing the fees. In our view, what the arbitrator was saying in this paragraph is that\n                    SCDA had done what Motor Image had requested it to do in terms of providing\n                    architectural services and that having got what it wanted and “that could\n                    be constructed” it was unfair of Motor Image to deprive SCDA from\n                    claiming a higher fee simply because it had decided to abort the\n                works.",
        "The proceedings before the High Court": "Leave to appeal a question of law arising out of the Award\n                (“the Leave Stage”) 13     Dissatisfied with the arbitrator’s\n                    decision, Motor Image sought leave from the High Court to appeal a question of\n                    law arising out of the Award[note: 18]. Motor Image framed the question\n                    of law in the following manner (“the original Contractual Interpretation\n                        Question”):[note: 19] “Where an architect who is engaged under the [SIA Terms] has agreed\n                        with his client and/or is otherwise obliged to call for tenders based on\n                        drawings and/or designs which are or would be approved by the [URA] but\n                        instead calls for and receives tenders (“Tenders”) based on\n                        drawings and/or designs which are not and/or would not have been approved by\n                        the URA, is the architect entitled to fees based on the Tenders under or by\n                        reference to clause 1.3(3)(b) of the [SIA Terms]?” [original\n                        emphasis omitted] 14     SCDA argued,inter\n                        alia, that the question of law that Motor Image had framed was\n                    flawed because it was premised on a finding of fact that the arbitrator had not\n                    made; the question had wrongly assumed that SCDA agreed with Motor Image to call\n                    for tenders based only on drawings that had been approved or would be approved\n                    by the URA.[note: 20]The Judge granted leave to appeal but\n                    modified the question framed by Motor Image to read as follows (“the\n                    modified Contractual Interpretation Question”):[note: 21] “Where an architect who is engaged under the [SIA Terms] has agreed\n                        with his client to call for tenders based on an agreed set of drawings but\n                        instead calls for and receives tenders (“Tenders”) based on a\n                        different set of drawings, is the architect entitled to fees based on the\n                        lowest of the Tenders under or by reference to clause 1.3(3)(b) of the\n                        [SIA Terms]?” [original emphasis omitted] 15     SCDA objected to this modified question on the\n                    ground that the arbitrator had not found that the parties agreed to use the\n                    Third URA Submission drawings for the tender exercise.[note: 22]In\n                    addition, the modified question presupposed that the disputed issue of whether\n                    SCDA had used the wrong set of drawings for the tender exercise had already been\n                    decided by the arbitrator when it had not.[note: 23]These\n                    objections to the modified question are referred to as the Erroneous Factual\n                    Premise Argument. Application for leave to appeal against the Judge’s decision to\n                grant leave to appeal on the modified Contractual Interpretation Question 16     SCDA then filed Summons No 5332 of 2009\n                    (“SUM 5332/2009”) under s 49(7) of the AA for leave to\n                    appeal the Judge’s decision at the Leave Stage on the ground that leave\n                    should not have been granted on the modified Contractual Interpretation Question\n                    because it failed to state correctly the factual basis of the arbitrator’s\n                    Award. The Judge heard and dismissed SUM 5332/2009 without providing any\n                        grounds.[note: 24]The Judge later explained in\n                    the Judgment that she dismissed this application because she followed English\n                    authorities which took the view that leave to appeal under the English\n                    equivalent of s 49(7) of the AA should only be granted if the statutory\n                    guidelines under the equivalent of s 49(5) of the AA required elucidation\n                    (see the Judgment at [30], followingAntaios Naviera Compania SA v Salen Rederierna AB (The\n                        Antaios)[1985] AC 191 (“The\n                        Antaios”) at 205E).",
        "The Judge’s decision relating to the modified Contractual\n                Interpretation Question (“the Appeal Stage”)": "",
        "Preliminary objections raised at the Appeal Stage": "17     The modified Contractual Interpretation\n                    Question was later placed before the Judge. At this stage, SCDA raised the\n                    Erroneous Factual Premise Argument (see[15]above).[note: 25]In response, Motor Image made\n                    three preliminary objections.[note: 26]First, issue estoppel\n                    prevented SCDA from raising issues that were considered at the Leave Stage.\n                    Second, a respondent to an appeal under s 49 of the AA could not challenge\n                    the factual premises of a question of law for which leave had been granted.\n                    Third, it would be an abuse of process to allow SCDA to make arguments it had\n                    already raised during the hearing of SUM 5332/2009 (ie, the application for leave to appeal against the\n                    Judge’s decision to grant leave to appeal on the modified Contractual\n                    Interpretation Question, see[16]above). 18     The Judge rejected all of Motor Image’s\n                    preliminary objections. The Judge considered that the doctrine of issue estoppel\n                    was not applicable because she did not make a final and conclusive judgment on\n                    the merits of the Erroneous Factual Premise Argument at the Leave\n                        Stage.[note: 27]Next, the Judge rejected the argument that SCDA was not permitted to challenge\n                    the factual premises of the modified Contractual Interpretation Question at the\n                    Appeal Stage. In the Judge’s view, the court at the Appeal Stage may have\n                    to revisit the factual premises of the question referred to it in order to\n                    determine whether the award manifests an error of law.[note: 28]The Judge also felt that\n                    the objective of the Leave Stage would be undermined if the court at the Leave\n                    Stage had to make a final and conclusive determination of the factual premises\n                    underlying the questions of law.[note: 29]As\n                    for Motor Image’s argument on abuse of process, the Judge held that there\n                    was no abuse of process in raising the Erroneous Factual Premise Argument at the\n                    Appeal Stage even though it was raised at the hearing of SUM 5332/2009\n                    (which had been dismissed on the ground that it was not necessary for the Court\n                    of Appeal to elucidate s 49(5) of the AA[note: 30]).",
        "The Judge’s decision at the Appeal Stage": "19     Having rejected Motor Image’s\n                    preliminary objections, the Judge proceeded to consider whether the modified\n                    Contractual Interpretation Question had properly arisen on the basis of the\n                    facts found by the arbitrator. The Judge observed that the modified Contractual\n                    Interpretation Question was premised on the fact that SCDA used a different set\n                    of drawings (ie, the 29 June 2005 Drawings)\n                    for the First Tender from those which the parties had agreed to use (ie, the Third URA Submission).[note: 31]The Judge next reviewed the Award in\n                    detail and found that the arbitrator had not found that the Third URA Submission\n                    was to be used for the First Tender.[note: 32]She accordingly found that\n                    the modified Contractual Interpretation Question was not appropriate because it\n                    was premised on facts that were not found by the arbitrator and ignored his\n                    factual findings. As a result, the Judge dismissed the appeal.",
        "The Judge’s decision to grant leave to appeal to the Court of\n                Appeal": "20     After the dismissal of Motor Image’s\n                    appeal on the question of law arising out of the Award (in particular, the\n                    modified Contractual Interpretation Question), Motor Image applied via Summons\n                    No 4555 of 2010 for leave under s 49(11) of the AA to appeal to the\n                    Court of Appeal on twonewquestions of law. The\n                    first question is reproduced as follows: (a)    “Where, under section 49(5) of the\n                            Arbitration Act (Cap. 10), the High Court determines that a\n                            question of law arises out of an award and is a question which the\n                            arbitral tribunal was asked to determine (“Finding”) and\n                            grants leave to appeal, does the High Court, on hearing the appeal\n                            against the award, have the power to review and overturn the Findingon the basis that the question of law does not\n                                arise out of the award and was not a question which the arbitral\n                                tribunal was asked to determine?” [original\n                            emphasis omitted, emphasis added in italics] 21     The second question was essentially a redraft\n                    of the modified Contractual Interpretation Question: (b)    “Where an architect who is engaged under\n                            the Singapore Institute of Architects Conditions of Appointment and\n                            Architect’s Services and Mode of Payment (“SIA Conditions\n                            of Appointment”) has agreed with his client to call for tenders\n                            based on [an] agreed set of drawings but instead calls for and receives\n                            tenders (“Tenders”) based on a different set of drawings,\n                            is the architect entitled to fees based on the lowest of the Tenders\n                            under or by reference to clause 1.3(3)(b) of the SIA Conditions of\n                            Appointment?” 22     With respect to the first question, the Judge\n                    granted leave to appeal the question as modified by removing the italicised\n                    words shown at[20]above (“the\n                    Referred Question”), reproduced as follows:[note: 33] “Where, under section 49(5) of the Arbitration Act\n                        (Cap. 10), the High Court determines that a question of law arises out\n                        of an award and is a question which the arbitral tribunal was asked to\n                        determine (“Finding”) and grants leave to appeal, does the\n                        High Court, on hearing the appeal against the award, have the power to\n                        review and overturn the Finding?” [original emphasis omitted] 23     With respect to the second question, the Judge\n                    refused leave to appeal on the ground that it would be a hypothetical question\n                    as it was contingent upon the Court of Appeal ruling in favour of Motor Image on\n                    the Referred Question. She felt that referring both questions would\n                    unnecessarily increase the costs of the appeal and suggested that this Court\n                    remit the case to her if we found in favour of Motor Image on the Referred\n                        Question.[note: 34]",
        "Issue on appeal": "24     The Referred Question seeks this court’s\n                    decision on whether in a case where the High Court, having determined under\n                    s 49(5) of the AA that a question of law has arisen out of an award which\n                    the arbitral tribunal was asked to determine (“Finding”) and\n                    having granted leave to appeal, had the power, on hearing the appeal against the\n                    award, to review and overturn the Finding on the basis that the question of law\n                    does not in fact arise out of the award. 25     In this appeal, counsel for Motor Image\n                    contended that the High Court does not have any such power because when leave is\n                    granted, even erroneously, it vests an irrevocable right of appeal in the\n                    applicant. Counsel for SCDA contended the contrary. Before we consider their\n                    respective arguments, we should first set out the scope of s 49 of the AA\n                    which provides as follows: Appeal against\n                        award 49.—(1) A party to arbitration\n                        proceedings may (upon notice to the other parties and to the arbitral\n                        tribunal) appeal to the Court on a question of law arising out of an award\n                        made in the proceedings. … (3)    An appeal shall not\n                            be brought under this section except — … (b)    with the leave\n                                of the Court. … (5)    Leave to appeal\n                            shall be given only if the Court is satisfied that — (a)    the determination of the question will\n                                substantially affect the rights of one or more of the\n                                parties; (b)    the question is one which the arbitral\n                                tribunal was asked to\n                                    determine; (c)    on the basis of the findings of fact\n                                in the award — (i)    the decision of the arbitral tribunal on\n                                    the question is obviously wrong; or (ii)   the question is one of general public\n                                    importance and the decision of the arbitral tribunal is at least\n                                    open to serious doubt; and (d)    despite the\n                                agreement of the parties to resolve the matter by arbitration, it is\n                                just and proper in all the circumstances for the Court to determine\n                                the question. (6)    An application for\n                            leave to appeal under this section shall identify the question of law to\n                            be determined and state the grounds on which it is alleged that leave to\n                            appeal should be granted. (7)    The\n                            leave of the Court shall be required for any appeal from a decision of\n                            the Court under this section to grant or refuse leave to\n                        appeal. (8)    On an appeal under this\n                            section, the Court may by order — (a)    confirm the\n                                award; (b)    vary the\n                                award; (c)    remit the award\n                                to the arbitral tribunal, in whole or in part, for reconsideration\n                                in the light of the Court’s determination; or (d)    set aside the\n                                award in whole or in part. (9)    The Court shall not exercise its power to set\n                            aside an award, in whole or in part, unless it is satisfied that it\n                            would be inappropriate to remit the matters in question to the arbitral\n                            tribunal for reconsideration. (10)  The decision of the Court on an appeal under this\n                            section shall be treated as a judgment of the Court for the purposes of\n                            an appeal to the Court of Appeal. (11)  The Court may give leave to appeal against the\n                            decision of the Court in subsection (10) only if the question of\n                            law before it is one of general importance, or one which for some other\n                            special reason should be considered by the Court of\n                        Appeal. 26     As can be seen from the terms of s 49(5),\n                    four conditions have to be satisfied before the High Court may grant leave to\n                    appeal. For the purposes of the present case, only two considerations are\n                    material. They are: (a) whether the question of law is one which the\n                    arbitral tribunal was asked to determine; and (b) whether on the basis of\n                    the findings of fact in the award – (i) the decision of the arbitral\n                    tribunal on the question is obviously wrong, or (ii) the question is one of\n                    general public importance and the decision of the arbitral tribunal is at least\n                    open to serious doubt. 27     With respect to condition (a), the Judge found\n                    that this condition was not satisfied in that the question of law,ie, the modified Contractual Interpretation Question,\n                    was not a question that the arbitrator was asked to determine. She made no\n                    comment in her Judgment on her finding at the Leave Stage that condition (b) was\n                    satisfied, but it seems to us that on the facts found by the arbitrator on the\n                    basis of which he made the award, we would have found it difficult to conclude\n                    that the award was obviously wrong, if we had to decide this question, or that\n                    the question of law was one of general importance.",
        "Motor Image’s arguments on the Referred Question": "28     The case for Motor Image on the Referred\n                    Question ran as follows. The grant of leave of the High Court to appeal against\n                    an arbitrator’s award under s 49(5) of the AA (ie, at the Leave Stage) vests the applicant with an\n                    unconditional right of appeal, and that once the Court has conferred on him such\n                    a statutory right (ie, by giving him leave to\n                    appeal), that right cannot be taken away by the Court unless the statute gives\n                    the Court the power to do so. Counsel referred to the following decisions in\n                    support of this argument,viz,Moore, Nettlefold & Co v The Singer Manufacturing Company[1904] 1 KB 820 at 823 (“Moore”),John Robinson and Company Limited\n                        v The King[1921] 3 KB 183 (“John Robinson”) at 204; andWan Sagar\n                        bin Wan Embong v Harun bin Taib & Ors[2008]\n                    4 MLJ 474 (“Wan Sagar”) at\n                        [7]. For convenience, we shall call\n                    this theMooreprinciple. 29     It was further argued that this right of\n                    appeal, once vested, will subsist until and unless the matter is resolved by the\n                    Court of Appeal on an appeal against the High Court decision at the Leave\n                    Stage. 30     Counsel’s argument based on theMooreprinciple in relation to the present\n                    case is novel and ingenious. InMoore, the issue\n                    was whether the appellant had a right of appeal under the Supreme Court of\n                    Judicature (Procedure) Act 1894 (57 & 58 Vict. c 16) (UK) (“the\n                    1894 Act”). The Court of Appeal held that as the appellant had been given\n                    leave to appeal by the judge, the grant of leave created a right of appeal under\n                    the 1894 Act. Mathew LJ said (at 823): I think there are two classes of cases coming within the sub-section (of\n                        the 1888 Act): those in which leave to appeal was not necessary, and those\n                        in which it was necessary;but, leave having been\n                            obtained, the case stands on the same footing as if there had been a\n                            right of appeal ab initio. [emphasis added] Although the other two more senior judges of the Court did not express\n                    themselves in the same way, the italicised words do suggest that a right of\n                    appeal is crystallised upon the granting of leave to appeal. If such a right of\n                    appeal (by leave) is the same as an ordinary right of appeal, then there should\n                    be no reason why if the latter cannot be taken away except by the statute (seeJohn RobinsonandWan\n                        Sagar), the former can be “taken away”,ie, revoked by the Court without a hearing on the merits\n                    of the appeal. Counsel for Motor Image also pointed out that if the High Court\n                    makes a mistake in granting leave to one party, the other party should appeal\n                    against the order under s 49(7) of the AA. In the present case, SCDA could\n                    have applied for leave to appeal under s 49(7). It had in fact done so but\n                    leave was denied (see[16]above). 31     We find counsel’s argument to be\n                    persuasive and cogent and we accept theMooreprinciple that ordinarily a right of appeal cannot be revoked, even where the\n                    right has accrued by reason of leave having been given. However, our acceptance\n                    of theMooreprinciple does not conclude this\n                    appeal in favour of Motor Image. Two further questions arise. The first is\n                    whether the Motor Image’s right of appeal was abrogated by the Judge\n                    revisiting the basis on which she had granted leave to appeal, and declining to\n                    decide the modified Contractual Interpretation Question that was before her. If\n                    Motor Image’s right of appeal was not abrogated by the Judge’s\n                    decision, then its whole argument of having acquired a vested and irrevocable\n                    right of appeal would not be relevant. Second, if she had, then it may be\n                    necessary to consider whether theMooreprinciple,\n                    which was established for court actions, would be applicable to arbitrations\n                    where issues of jurisdictional facts are relevant as they are the basis on which\n                    leave may be granted to appeal against an arbitrator’s\n                award.",
        "What exactly did the Judge decide?": "32     Before we turn to consider SCDA’s\n                    arguments, it is necessary to examine closely what the Judge actually decided.\n                    First, she decided that she was not estopped from revisiting, at the hearing of\n                    the substantive appeal, the factual basis of the award to determine whether it\n                    was the same basis on which she granted leave to appeal for the question of law,ie, the modified Contractual Interpretation\n                    Question. At [26]–[28] of the Judgment, she held: 26    The discussion in relation to estoppel has,\n                            however, established that the arguments and issues relevant at the leave\n                            to appeal stage can still be relevant at the substantive appeal stage.\n                            It all depends on the circumstances. Whilst the task of the judge on\n                            hearing the appeal is to decide whether, asThomasstates, the award manifests an error of law - in\n                            order to make that determination, the appellate judge has to be\n                            satisfied regarding the factual basis from which the alleged error\n                            stems. Therefore, the appellate judge may, depending on the arguments,\n                            need to relook at the factual premises of the question. Further, while\n                            the judge at the leave to appeal stage forms provisional views on\n                            merits, the appellate judge must form final and conclusive views on the\n                            merits. Therefore, the arguments on issues at the leave stage may very\n                            well be relevant at the appeal stage as well. 27    There is a precedent for this approach in the case\n                            ofNg Huat Foundations Pte Ltd v Samwoh Resources Pte\n                                Ltd[2006] SGHC 43 (\"Ng Huat\n                                Foundations\") which I decided. In that case, I allowed\n                            challenge of the factual premises of the question of law which the\n                            appellant was granted leave under s 49(3)(b) to appeal on. I noted at [16] that \"the parties took\n                            different positions on what had been found by the Arbitrator as a\n                            question of fact\", as is the case here, and went on to find at [29] that\n                            the question of law was \"misconceived\" because it was premised on facts\n                            that had not been found by the arbitrator and ignored both his views on\n                            the facts and his factual findings. Although there were no arguments on\n                            this point inNg Huat Foundations, I\n                            consider that the approach taken there was correct. If Motor Image was\n                            right, it would mean that the court is asked at the leave stage to make\n                            final and conclusive determinations at least regarding the factual\n                            premises underlying the questions of law which the court gives leave to\n                            appeal on. It is not appropriate to ask this of the court at the leave\n                            stage. 28    The leave stage functions as a time and cost-saving\n                            filter against cases which are not even open to serious doubt. (SeeAntaios Compania Naviera SA v SalenRederierna AB[1985] AC 191 (\"The Antaios\") at\n                            206G-207C, where Lord Diplock holds up the practice of the House of\n                            Lords in dealing with petitions for leave to appeal from judgment of the\n                            Court of Appeal in civil actions as an example to be followed:\n                            \"[G]enerally a brief oral hearing inter partes is permitted of which the\n                            average duration is ten to fifteen minutes; the parties are not allowed\n                            to use the hearing as an opportunity to argue the appeal that is the\n                            subject of the petition.\") Whilst arguments for leave in the courts here\n                            generally take somewhat longer than 15 minutes, the court should hear\n                            only enough at the leave stage to adopt a provisional view on the merits\n                            which allows it to decide whether a full-dress hearing is warranted. To\n                            ask the court to hear enough at the leave stage to make final and\n                            conclusive determinations would undermine the utility of the leave stage\n                            as a filter. 33     Secondly, upon revisiting the basis on which\n                    she granted leave to appeal, she found that the factual premise of the modified\n                    Contractual Interpretation Question was not the same factual premise on which\n                    the arbitrator made his award. The Judge held at [49]–[51] as\n                    follows: 49    Having mined the Award several times, I am unable\n                            to find a finding of fact that would support the premise of the\n                            [modified Contractual Interpretation] Question. On the hearing of the\n                            leave to appeal application, whilst this issue was raised, I was more\n                            concerned with the proper interpretation of Condition 1.3(3)(b) and\n                            this concern was part of the reason for allowing the\n                        application. 50    Having now had the time and opportunity to consider\n                            the position and the Award in more detail, I am satisfied that the\n                            [modified Contractual Interpretation] Question is not appropriate\n                            because it is premised on facts that were not found by the Arbitrator\n                            and ignores his factual findings as well as his view of the facts. The\n                            difficulty that Motor Image faced on the appeal is that the case it now\n                            seeks to run was not foreshadowed in its pleadings and submissions for\n                            the arbitration. Indeed, some of the points it made before the\n                            Arbitrator are inconsistent with its present stand. Conclusion 51    In the event this appeal must be dismissed with\n                            costs. I do not express any opinion on the substantive questions of\n                            interpretation raised in the course of the appeal as an interpretation\n                            exercise can only be conducted in the light of relevant facts. There are\n                            no such facts at present.",
        "SCDA’s arguments on appeal": "34     Before us, counsel for SCDA, in addition to\n                    referring toNg Huat Foundations Pte Ltd v Samwoh Resources\n                        Pte Ltd[2006] SGHC 43, supported the Judge’s\n                    decision and referred to three judicial and textbook authorities in support of\n                    the Judge’s decision. InThe “Ocean\n                        Crown”[2010] 1 Lloyd’s Rep 468, Gross J\n                    commented that the court at the appeal stage might conclude that “in\n                    reality there is no question or error of law at all” (at [53]). InCommercial Arbitration Law and Practice(Marcus Jacobs) (Lawbook Co, Looseleaf Ed, Update 105, 2010) it is suggested all\n                    “jurisdictional facts”, including a determination of whether or\n                    not a question of law arises from the award, may be revisited at the appeal\n                    stage (at [35.621]). In our view, the reference to this issue as a\n                    “jurisdictional fact” issue correctly suggests this issue goes to\n                    the very heart of the jurisdiction of the court to grant leave to appeal (at\n                    [35.620]). 35     The third authority is the unreported decision\n                    of the New South Wales Court of Appeal inWarley Pty Ltd v\n                        Adco Constructions Pty Ltd(No 359 of 1988). In that case,\n                    the Court revisited the issue of whether it had properly granted leave on\n                    whether there was a question of law arising from the award in that case.\n                    Ultimately, the Court found that the question that it had earlier given leave to\n                    appeal was a question of fact, and accordingly dismissed the appeal, with the\n                    implication that there was no appealable issue before the court.",
        "Our decision on the Referred Question": "36     In our view, the issue of whether the\n                    Judge’s decision to dismiss the substantive appeal for the reasons she had\n                    given has abrogated or “taken away” Motor Image’s vested\n                    right of appeal requires us to determine the threshold question as to whether\n                    there was a valid appeal in the first place. If the Judge had no jurisdiction to\n                    grant leave to appeal under s 49(5) of the AA with respect to the modified\n                    Contractual Interpretation Question, then there would be no vested right of\n                    appeal to abrogate. Under s 49(5) of the AA, leave to appealshallbe given only if the Court is satisfied that the\n                    question is one which the arbitral tribunal was asked to determine. The Judge\n                    was satisfied that this requirement was met when she gave leave, but, in our\n                    view, she was mistaken as to that jurisdictional fact. At the Appeal Stage, she\n                    realised that the arbitrator was not asked to determine the modified Contractual\n                    Interpretation Question. Similarly, at the Leave Stage, she was satisfied thaton the basis of the finding of facts in the\n                        award, the decision of the arbitral tribunal on the question was\n                    obviously wrong, or that the question was one of general public importance and\n                    the decision of the arbitral tribunal was at least open to serious doubt. It is\n                    implicit in this jurisdictional fact that the question of law for which leave is\n                    granted must be premised on the same facts on which the arbitrator made his\n                    award. The Judge only appreciated at the Appeal Stage that this was not the\n                    case. In other words, she had earlier mistakenly given leave to appeal a\n                    question of law which the arbitrator did not decide on the facts found by him in\n                    the arbitration. 37     In our view, if the modified Contractual\n                    Interpretation Question was not the question which the arbitrator was asked to\n                    determine, then it was a question on which no appeal could have been brought\n                    under s 49(5) of the AA, and the Judge had no jurisdiction to grant leave\n                    to appeal on such a question on the basis that it was an appealable question.\n                    The Judge had mistakenly conferred upon herself a jurisdiction on a question of\n                    law which did not arise from the award. The modified Contractual Interpretation\n                    Question was not an appealable question because the question was not one which\n                    the arbitral tribunal was asked to determine. It follows from this conclusion\n                    that the Judge, in refusing to determine the modified Contractual Interpretation\n                    Question, did not abrogate any right of appeal vested in Motor Image because no\n                    such right could have been properly vested in it by reason of the Judge’s\n                    earlier jurisdictional error. 38     For these reasons, we answer the Referred\n                    Question in the affirmative to the extent that the High Court may, on hearing an\n                    appeal on a question of law with respect to which it has granted leave to\n                    appeal, review the factual premise on which such leave was granted, and to\n                    dismiss the appeal if it finds that the leave was granted as a result of a\n                    jurisdictional error, as in that case, there is no proper or valid appeal before\n                    the Court. 39     If the Referred Question were answered in the\n                    negative, it would be a travesty of the judicial process and lead to an absurd\n                    result. It would mean that where an arbitrator makes an award in favour of a\n                    party, on the basis of facts 1, 2 and 3, the Judge is compelled to answer a\n                    question of law arising from such an award on the basis of facts 4, 5 and 6\n                    which were never found by the arbitrator. In our view the High Court has no\n                    jurisdiction under s 49(5) of the AA to give leave to appeal against an\n                    arbitrator’s award on the basis of facts which were not found by the\n                    arbitrator and which did not form the basis of his award. Otherwise, this would\n                    allow the High Court to arrogate to itself the jurisdiction to decide on the\n                    correctness or legality of an arbitrator’s award on a factual premise\n                    different from that on which the award was made. We are unable to accept that\n                    this is what is contemplated by s 49(5) of the AA. 40     It would follow from this conclusion that it\n                    is not necessary for us to decide whether theMooreprinciple is applicable to the Judge’s decision to\n                    dismiss Motor Image’s appeal.",
        "Conclusion": "41     For the above reasons, this appeal is\n                    dismissed with costs. Save that there should be no order for the costs of the\n                    High Court proceedings in respect of the application for leave to appeal under\n                    s 49(11) of the AA, the Judge’s costs order at [51] of the Judgment\n                    is to stand. The usual consequential orders are to follow.  [note: 1]Respondent’s Supplementary Core\n                                Bundle (“RSCB”) at Tab 2, p 22 (Affidavit of Samuel\n                                Lee). [note: 2]Ibid. [note: 3]Judgment at [2] and RSCB at Tab 1, p 1. [note: 4]Judgment at\n                                    [6]. [note: 5]Judgment at\n                                    [10] and RSCB at Tab 1,\n                                p 1. [note: 6]Judgment at [10]. [note: 7]Judgment at [7]. [note: 8]RSCB at Tab 1,\n                                p 2. [note: 9]Judgment at [6]\n                                (Condition 1.3(3) is reproduced in this\n                        paragraph). [note: 10]RSCB at Tab\n                                2, p 37 (Affidavit of Motor Image’s representative (Condition\n                                2.3(3) is reproduced)). [note: 11]RSCB at Tab 1, p\n                        7. [note: 12]RSCB at Tab 1, p 12; also see Judgment at\n                                [44]. [note: 13]RSCB at Tab 1, pp 4 and 12. [note: 14]RSCB at Tab 1, p\n                            12. [note: 15]RSCB at Tab 1, p 11. [note: 16]RSCB at Tab 1, pp 12, 14 and\n                                15. [note: 17]RSCB at Tab 1, p\n                        15. [note: 18]Appellant’s Core Bundle (“ACB”) Vol II at Tab\n                                8, p 51. [note: 19]Ibid. [note: 20]ACB Vol II at Tab 10, p\n                            60. [note: 21]ACB Vol II at Tab 7, pp\n                    46–48. [note: 22]ACB Vol II at Tab 16, pp 80-81. [note: 23]Ibid. [note: 24]ACB Vol II at Tab 14, pp\n                                73–75. [note: 25]ACB Vol II at Tab 16, pp\n                                80–81. [note: 26]ACB Vol II\n                                at Tab 17, p 85. [note: 27]Judgment at [21]–[24]. [note: 28]Judgment at [26]. [note: 29]Judgment at\n                                    [27]–[28]. [note: 30]Judgment at\n                                    [30]. [note: 31]Judgment at [34] and\n                                [44]. [note: 32]Judgment at\n                                [44] and [49]. [note: 33]ACB Vol II\n                                at Tab 4, p 37. [note: 34]ACB Vol II at Tab 5, p\n                            39."
    }
}