{
    "case_title": "Khor Soon Lee\n      v\n      Public Prosecutor",
    "ncitation": "[2011] SGCA 17",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       The accused, Khor Soon Lee (“the Appellant”), was charged with\n                    and convicted of importing 27.86 grams of diamorphine into Singapore (seePublic Prosecutor v Khor Soon Lee[2009] SGHC\n                    291 (“the GD”)). He now appeals against his conviction.",
        "Background and facts": "2       The Appellant, 36 years of age, was charged with the following\n                    offence: That you, Khor Soon Lee, on the 9thday of\n                        August 2008 at about 2.00 p.m. at the Woodlands Immigration Checkpoint,\n                        Singapore, did import into Singapore on motorcycle JGF 9461, a\n                        controlled drug specified in Class “A” of the First Schedule\n                        to the Misuse of Drugs Act (Cap 185), to wit, one packet of\n                        granular/powdery substance containing not less than 27.86 grams ofdiamorphine, without any authorization\n                        under the Misuse of Drugs Act or the regulations made thereunder, and you\n                        have thereby committed an offence under section 7 and punishable under\n                        section 33 of the said Act [emphasis in the original] 3       On 9 August 2008, the Appellant entered into Singapore on a motorcycleviathe Woodlands Immigration Checkpoint\n                    (“Woodlands Checkpoint”). As the immigration officer on duty\n                    scanned the Appellant’s passport, the computer system indicated that the\n                    Appellant ought to be referred to the Arrival Car Secondary Team office. The\n                    immigration officer alerted the officers of the Quick Response Team and he\n                    stopped the Appellant. A search was conducted and the officers found a black\n                    sling bag (“sling bag”) in the front carrier basket of his\n                    motorcycle. Therein, under some spare clothes, a further white plastic bag\n                    (“the White Outer Plastic Bag”) was found. Inside this White Outer\n                    Plastic Bag were two smaller plastic bags: a white plastic bag imprinted with\n                    purple flowers (“the Purple Plastic Bag”) and a black plastic bag\n                    (the “Black Plastic Bag”), respectively. None of the plastic bags\n                    was sealed.[note: 2] 4       Three bundles wrapped in black masking tape were found in the Purple Plastic\n                        Bag.[note: 3]The Appellant was questioned as to what these bundles contained, to\n                    which he replied in Malay, “barang”\n                    (meaning “things”). When questioned further, he said that they\n                    were (again, in Malay) “ubat”\n                    (meaning “medicine”).[note: 4]These bundles were unwrapped in the Appellant’s presence and\n                    the Appellant was again asked what the revealed substances were. The Appellant\n                    then replied that they were “E5” (Erimin), “K”\n                    (Ketamine) and “Ecstasy”, respectively. It should be pointed out\n                    that these controlled drugs are not the subject of the present charge or appeal.\n                    Instead, the Appellant was charged with, and convicted of, what was in the\n                    package contained in the Black Plastic Bag. In that particular plastic bag,\n                    there was a black bundle also wrapped with black masking tape which contained a\n                    packet of white granular/cuboidal substance. After identifying the contents in\n                    the three bundles which were in the Purple Plastic Bag, when asked what the\n                    substance in this fourth bundle was, the Appellant stated that he did not know\n                    what it was. Later, he ventured to say that it could be “Ice”\n                    because of its colour.[note: 5]It should be noted that this substance was subsequently analysed and\n                    was determined to be diamorphine. Returning to the factual background, the\n                    Appellant was then placed under arrest. 5       While the Appellant acknowledged that all the seized bundles were found in his\n                    bag, he claimed that the bundles belonged to one “Tony” (also\n                    known as Ong Heng Hor, a Malaysian). The Appellant came to know Tony in a hair\n                    salon a year prior to the events and, due to an unpaid consignment of Ice the\n                    Appellant took from Tony, ended up owing Tony RM1,600. Unemployed, the Appellant\n                    became Tony’s drug courier in July 2008 to pay off his debts. Tony\n                    informed the Appellant he was looking to transport Erimin, Ketamine, Ice and\n                    Ecstasy into Singapore. For each delivery, the Appellant was paid between RM200\n                    to RM300. The delivery that led to the Appellant’s arrest was his sixth\n                    job for Tony. 6       During the consequent investigation, the Appellant revealed and explained the\n                    mechanics of the prior deliveries. The Appellant stated that when he received\n                    the drugs from Tony, he was sometimes told that the bundles contained\n                    “5” (Erimin) and “K” (Ketamine), whilst, at other\n                    times, he was not told of their contents.[note: 6]Additionally, Tony also instructed the Appellant not to open the\n                    bundles to check their contents.[note: 7]Nevertheless, it was never disputed that the Appellant knew that the\n                    bundles contained drugs. The Appellant, however, further asserted that he had\n                    asked Tony in July 2008 whether heroin (diamorphine) would be involved in the\n                    deliveries as he was afraid of the death penalty.[note: 8]Tony’s response was that he never placed heroin inside the\n                    packages that the Appellant was told to carry.[note: 9]The Prosecution did not challenge the Appellant’s\n                        evidence on Tony’s response. The Appellant also added that\n                    both of them had always travelled together into Singapore in a taxi or on a\n                    motorcycle during their previous deliveries although the Appellant was always\n                    the one carrying the drugs.[note: 10] 7       The Appellant then recounted the events leading up to his arrest. On\n                    8 August 2008, Tony called the Appellant and told him to look for a\n                    motorcycle to make a delivery (which he did). The next day, the Appellant met\n                    Tony at a petrol station in Johor Bahru. Tony was seated on a motorcycle\n                    himself, and Tony handed him the White Outer Plastic Bag. Apparently, given\n                    their previous practice of travelling together (see above at[6]), this was the first time that the Appellant\n                    and Tony travelled in separate vehicles.[note: 11]This made the Appellant suspicious but he did not question Tony\n                    about it as Tony appeared to be in a rush and the Appellant wanted to complete\n                    the delivery.[note: 12]The Appellant then took the White Outer Plastic Bag and kept it in\n                    his sling bag without checking its contents.[note: 13]No questions were asked.[note: 14]The two men then rode their respective motorcycles to the Johor\n                    Bahru Check Point separately and they agreed to meet at the Kranji Mass Rapid\n                    Transit station (“Kranji MRT”) once they cleared the Singapore\n                    customs. 8       That rendezvous at Kranji MRT naturally failed to materialise when the\n                    Appellant was arrested at the Woodlands Checkpoint. Nevertheless, after the\n                    Appellant’s arrest, he cooperated with the authorities to lure Tony out,\n                    and Tony was arrested at Kranji MRT a few hours later. As things eventually\n                    turned out, the Prosecution took the view that there was a lack of evidence\n                    against Tony and, when both sets of counsel attended a Pre-Trial Conference\n                    (“PTC”) on 26 May 2009, the decision to apply for a discharge\n                    not amounting to an acquittal (“DNAQ”) was made known to the\n                    court. The next day, 27 May 2009, Tony was granted a DNAQ and was\n                    repatriated to Malaysia (approximately nine months after being charged). 9       After hearing the appeal, we directed counsel to file further submissions to\n                    address us on the issue of what could have been done to secure Tony’s\n                    attendance as a witness at the trial of the Appellant and the effect of\n                    Tony’s absence at the trial. Both parties have helpfully clarified the\n                    chronology of events leading to the granting of Tony’s DNAQ.[note: 15]On the record, there had been no objection to, or application to\n                    delay, the DNAQ; nor was there any other application by the Appellant’s\n                    then counsel to secure Tony as a witness for the Appellant at the PTC of\n                    26 May 2009. To be fair to both sets of counsel, it appeared that no one at\n                    that stage thought that Tony was a going to be a material witness for either\n                    party. From the Appellant’s own Further Written Submissions dated\n                    21 December 2010, the first time that the Appellant’s counsel had\n                    made an application pertaining to Tony was approximately two weeks after the PTC\n                    of 26 May 2009, on 8 June 2009, when the then Appellant’s\n                    counsel requested for an inspection of Tony’s passport. When that request\n                    could not be accommodated, the then Appellant’s counsel responded on\n                    19 June 2009 to say that his client’s case was, as a result,\n                    prejudiced. It was only on 24 June 2009 that the position pertaining to\n                    Tony changed and it was thought that Tony would be required as a witness for the\n                    Appellant. The Respondent tried to re-call Tony as a witness and sought the help\n                    of the Investigation Officer (“IO”) in this matter to locate Tony.\n                    Tony was finally contacted over the phone in Malaysia but (not surprisingly) he\n                    dismissed the idea of returning to Singapore to testify at the Appellant’s\n                    trial. Several attempts were subsequently made to contact Tony but Tony could no\n                    longer be reached over the phone and his whereabouts remain unknown\n                    since.",
        "The decision below": "10     The trial judge (“the Judge”) was of the view that the Appellant\n                    was presumed to know the nature of the controlled drug (ie, diamorphine) that he possessed by virtue of\n                    section 18(2) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed)\n                    (“the Act”), and held that the Appellant was unable to rebut the\n                    presumption. The Judge reasoned that the Appellant could not rely on his belief\n                    that the bundles contained the usual drugs (viz,\n                    Erimin, Ketamine and Ecstasy) he had been carrying into Singapore for Tony since\n                    the accused bore the risk that Tony could go back on his word. Additionally,\n                    even if the Appellant opened the bundles and was later given a false answer by\n                    Tony, the Appellant also bore the risk that the answer given to him would turn\n                    out to be false. In any event, the Judge found the accused was conscious of the\n                    fact that he was in possession of controlled drugs and there was ample\n                    opportunity for him to take a look inside the unsealed White Outer Plastic Bag\n                    at the four bundles in the Purple Plastic Bag and the Black Plastic Bag. No\n                    inspection was done, and in the circumstances, the Judge found the Appellant to\n                    be wilfully blind. 11     Further, the Judge observed that the delivery on 9 August 2008 was\n                    peculiar in itself since Tony had suddenly decided to travel on his own instead\n                    of travelling with the accused as had always been the case on numerous previous\n                    occasions. 12     The Judge also did not find any merit in counsel for the Appellant’s\n                    submission that an adverse inference should be drawn against the Prosecution for\n                    not producing Tony at trial. The Prosecution had decided against proceeding\n                    against Tony and there was consequently no reason to keep Tony in remand in\n                    Singapore. The Judge further held that, in any event, had Tony testified, his\n                    testimony would not have altered his findings on the Appellant’s knowledge\n                    and culpability (see the GD at [32]).",
        "The issues": "13     In the present appeal, we note that the Appellant is not disputing that he was\n                    carrying a controlled drug. Rather, what he took issue with both in the court\n                    below and on appeal washis knowledgepertaining\n                    to the nature of the controlled drug he was carrying. Put simply, whilst he knew\n                    he was carrying and importing controlled drugs into Singapore, he submitted that\n                    he had no knowledge that one of the plastic bags contained diamorphine. 14     The relevant provision is s 18 of the Act, which reads as follows: Presumption of possession and knowledge of controlled\n                            drugs 18. —(1) Any person who is proved\n                        to have had in his possession or custody or under his control — (a)    anything containing a controlled drug; (b)    the keys of anything containing a controlled drug; (c)    the keys of any place or premises or any part thereof in which a\n                                controlled drug is found; or (d)    a document of title relating to a controlled drug or any other\n                                document intended for the delivery of a controlled drug, shall, until the contrary is proved, be presumed to have had that drug in\n                        his possession. (2)    Any person who is proved or presumed to have had a controlled drug in\n                            his possession shall, until the contrary is proved, be presumed to have\n                            known the nature of that drug. (3)    The presumptions provided for in this section shall not be rebutted by\n                            proof that the accused never had physical possession of the controlled\n                            drug. (4)    Where one of 2 or more persons with the knowledge and consent of the\n                            rest has any controlled drug in his possession, it shall be deemed to be\n                            in the possession of each and all of them. 15     The main issue that was raised before this court in the present appeal is\n                    whether the Appellant has rebutted, on a balance of probabilities, the\n                    presumption of knowledge contained in s 18(2) of the Act, bearing in mind\n                    the fact that mere assertions of ignorance alone may be insufficient to rebut\n                    the presumption. 16     We pause, however, to also observe, parenthetically, that it is, of course,\n                    open to the Prosecution to prove that the accused had actual knowledge on the\n                    facts of the case itself, in which case it would then be unnecessary to rely on\n                    the presumptions under (in this instance) s 18 of the Act (seeTan Kiam Peng v PP[2008] 1 SLR(R) 1\n                        (“Tan Kiam Peng”) at [171]). However, especially in the nature ofthisoffence itself, proving the mental\n                    element of actual knowledge would often be an extremely difficult task; hence,\n                    the need for the presumptions that have just been referred to. That having been\n                    said, we should think that, if the accused is able to rebut, on a balance of\n                    probabilities, the relevant presumption(s), it would follow that the Prosecution\n                    wouldnotbe able to prove that the accused had\n                    actual knowledge in the case concerned. Conversely, if there is clear evidence\n                    that the accused had actual knowledge on the facts of the case, it would follow\n                    that the accused wouldnotbe able to rebut, on a\n                    balance of probabilities, the relevant presumption(s). Indeed, the Prosecution\n                    might not – as alluded to at the outset of the present paragraph –\n                    even need to rely on the presumption(s) in order to establish knowledge on the\n                    part of the accused. It is important to emphasise that much would, of course,\n                    turn on the precise factual matrix concerned. 17     In the present appeal, it is clear that no issue of actual knowledgeper sehas arisen. Indeed, as this court noted inTan Kiam Peng(at [106]), “the practical reality [is]\n                    that a finding of actual knowledge is likely to be rare”. 18     In the court below, in the process of finding that the Appellant had failed to\n                    rebut the presumption of knowledge, the Judge observed that the\n                    Appellant’s failure to make inquiries was tantamount to being wilfully\n                    blind (see the GD at [30]). The second\n                    related issue before this court is therefore whether the Appellant has proved,\n                    on a balance of probabilities, that he was not wilfully blind in the\n                    circumstances of this case.",
        "Our decision": "The applicable principles 19     The issues faced by this court are first and foremost a determination of fact,\n                    and, given the capital nature of the offence, necessitates a rigorous analysis\n                    of the evidence in the Record of Proceedings. The relevant principles pertaining\n                    to wilful blindness, as set out by this court inTan Kiam\n                        Peng(at [137]-[141]), are as follows: 137First, although the statutory contexts\n                            under [Warner v Metropolitan Police\n                                Commissioner[1969] 2 AC 256\n                            (“Warner”)] and under the Act are different, the\n                            explication by the House of Lords inWarnerof thegeneralconcept ofpossession(which was adopted\n                            locally in [Tan Ah Tee v PP [1979-1980] SLR(R)\n                                311] and a myriad of other Singapore decisions) is\n                            helpful and, in fact, supports the first interpretation of s 18(2) of\n                            the Act to the effect that knowledge in s 18(2) is a reference to\n                            knowledge that the drug concerned is a controlled drug. 138Secondly, there is a second\n                            interpretation which states that the reference to knowledge in\n                            s 18(2) isnot onlyto a controlled\n                            drugbut alsoto thespecific drugwhich it turns out the accused is in\n                            possession of. The strongest arguments for this second interpretation\n                            are as follows. First, there is the literal language of that provision.\n                            Secondly, because of the possibility of harsh punishments (including the\n                            death penalty) being imposed, even if it is argued that an ambiguity in\n                            the statutory language exists, the fact of such ambiguity suggests that\n                            the benefit of the doubt ought to be given to the accused. However,\n                            although the second interpretation appears to us to be more persuasive,\n                            we express no conclusive view in this particular appeal simply because\n                            this particular issue was not argued fully before us. 139Thirdly, whilst the concept of knowledge\n                            in s 18(2) of the Act entailsactualknowledge, the doctrine ofwilful\n                                blindnessshould also be emphasised and is also included\n                            within the concept of knowledge in s 18(2) simply because wilful\n                            blindness is thelegal equivalentofactualknowledge. However, the\n                            reference, particularly in the court below, to the varioustheoreticaldegrees of knowledge is, in our\n                            view, unhelpful and might even have anadverseimpact in the sphere ofpracticalapplication. This brings us to a closely\n                            related point. 140    In so far as the doctrine ofwilful\n                                blindnessis concerned, the evidence required to be\n                            adduced by the accused to rebut the presumption of knowledge of the\n                            nature of the controlled drug under s 18(2) of the Act is by no\n                            means a mere formality, even though the standard required is the civil\n                            standard (of proof on a balance of probabilities). Such an approach is\n                            not only just and fair but is also consistent with the underlying policy\n                            of the Act itself. However, we have also demonstrated that in situations\n                            where the accused truly does not know the nature of the controlled drug\n                            in his or her possession, it is clear that the accusedwillbe able to rebut the presumption of\n                            knowledge of the nature of the controlled drug under s 18(2) on a\n                            balance of probabilities. This will be the situation where, for example,\n                            the controlled drugs in question were slipped into a package the accused\n                            was carrying without his or her knowledge (see also above at [35] and\n                            [132]), or where the accused is otherwise devoid of actual knowledge and\n                            finds himself or herself in a situation in which the facts and\n                            circumstances donotgive rise to that\n                            level of suspicion that would entail further investigation lest a\n                            finding of wilful blindness results. All this, again, is consistent with\n                            the underlying policy of the Act. 141Fourthly, therefore (and still on the\n                            issue of knowledge in s 18(2) of the Act), whilstgeneralregard ought to be had to the concept ofactualknowledge (includingthe doctrine ofwilful\n                                blindness), themainfocus\n                            ought always to be on thespecific or particular\n                                factual matrixin the case at hand. The principal\n                            difficulty lies in the attempt to divine a universal legal norm tocomprehensivelygovern what is\n                            essentially and, at bottom, afactualinquiry. This is not to state that, in certain areas of the law, such an\n                            approach is inappropriate. However, in a situation such as the present,\n                            such an approach is less than satisfactory simply because thefocusisprimarily factual\n                                and (more importantly) the permutations of the factual matrices are\n                                too numerous, varied and complexto admit of a perfect\n                            legal solution. It is, of course, axiomatic that a universal legal normisnecessary. What, however, should be\n                            eschewed is the attempt to formulate a universal legal norm that\n                            purports tocomprehensivelygovern the\n                            various (and variegated) fact situations. This leads, as we shall see,\n                            toexcessive refinements and fine distinctions that\n                                hinder (rather than facilitate) the task at hand. Indeed,\n                            that s 18(2) of the Act is formulated at a fairly high level of\n                            generality is an acknowledgment of the danger just mentioned. In the\n                            circumstances, theuniversalnorm with\n                            respect to knowledge in s 18(2) is that it would encompassactualknowledge in both its purest\n                            formas well asin the form ofwilful blindnessand would apply to thespecific factual matrixconcerned -\n                            with the focus being, in the nature of things, on thelatter. [emphasis in original] 20     Importantly, particularly for the purposes of this appeal, it bears\n                    emphasising that negligence or recklessness doesnotamount to wilful blindness (seeTan Kiam\n                        Pengat [129]). It is a\n                    high threshold to be met and a finding of wilful blindness oughtnotto be madeunlessthere is a strongfactualbasis for doing\n                    so. Analysis 21     The Judge had found in the court below that there had been wilful blindness on\n                    the part of the Appellant. Before this court, counsel for the Appellant,\n                    Mr Rupert Seah, argued that there had been no wilful blindness on the part\n                    of the Appellant for the following (related) reasons: (a)     The Appellant had only ever assisted in importing Erimin, Ketamine, Ice\n                        and Ecstasy (“the Controlled Drugs”). This was clear from his\n                        own Statements made. It is important to note that counsel for the\n                        Prosecution, Mr Aedit Abdullah, confirmed that no evidence had been led\n                        in the court below to the contrary. (b)     The Appellant had been careful to confirm with Tony that the package of\n                        drugs in the present case contained – as before (see above at[6]) – only the Controlled\n                        Drugs andnotdiamorphine. It is significant\n                        to note that this package containedboththe\n                        Controlled Drugsandheroin, the latter of\n                        which constituted the (capital) charge that is the subject of the present\n                        appeal. (c)     The Appellant had a close and personal relationship with Tony generally\n                        and thereforetrustedhim. This was especially\n                        (but not confined to) the case in relation to the confirmation he had sought\n                        at (b) above. (d)     The fact that Tony had been unavailable as a witness had prejudiced the\n                        Appellant’s defence generally (including the submission that he (the\n                        Appellant) had not been wilfully blind to the heroin in the package). 22     The arguments set out in the preceding paragraph are not only related but must\n                    also, in our view, be considered asa whole,\n                    having particular regard to theparticular facts as well as\n                        the contextin which such facts occurred. 23     In this regard, the fact that the Appellant had assisted in transportingonlyControlled Drugs on asignificant numberof occasions inthe\n                        pastdoes weigh in favour of the Appellant.Importantly, as we have noted above, this particular factual aspect of the\n                        Appellant’s account was uncontroverted by the Prosecution in the court\n                        below as well as on appeal. The delivery that led to his arrest\n                    was at least the Appellant’s sixth for Tony[note: 16]and, in the previous deliveries, the Appellant averred that he was\n                    told that the drugs intended to be shipped were only the Controlled\n                        Drugs.[note: 17]Indeed, when the Appellant began assisting Tony, Tony informed him\n                    that he (Tony) wanted to bring in only the Controlled Drugs into Singapore (and,\n                    where applicable, in quantities that did not attract the death\n                        penalty).[note: 18]No mention of diamorphine was made. Additionally, it is also vital\n                    to emphasise that the Appellant sought assurances from Tony that the deliveries\n                    would not involve diamorphine. The Appellant claimed that he wanted these\n                    assurances since he was afraid of the death penalty (see also above at[6]),[note: 19]and it was only logical that, because these assurances were\n                    subsequently given, that the Appellant agreed to proceed with the deliveries.\n                    Tony assured the Appellant that he did not place diamorphine in the packages\n                    that the Appellant carried.Again, the Appellant’s\n                        account here was uncontroverted. Put simply, aconsistent patternof assisting in importing Controlled Drugs\n                    that didnotcarry the sanction ofcapital punishment(for those controlled drugs that did,\n                    the quantity imported was not high enough to attract capital punishment) had in\n                    fact been established by the Appellant. To the detriment of the Appellant, the\n                    transaction that is the subject matter in thepresent\n                        appealwas one thatdeviated fromthis pattern. 24     That having been established, it is, however,alsonecessary to consider whether the Appellant ought to have\n                    neverthelesscheckedthe package on this\n                    particular occasion. In particular, in not so checking, had the Appellant beenwilfully blindto the diamorphine contained in\n                    the package (which was found in the Black Plastic Bag)? In our view, and\n                    notwithstanding the (unfortunate) complacency exhibited on the part of the\n                    Appellant, it was – in light ofthe consistent pattern\n                        and the relationshipthat had hitherto existed between himself\n                    and Tony – understandable why he had not checked the package. It would, of\n                    course, have been ideal if he had. However, the Appellant had no reason, in\n                    light of thespecific facts and (especially) consistent\n                        pattern that had been established(which we will explain below),\n                    tostrongly suspectthat the package containeddiamorphine. The same could also be said about\n                    the fact that the Appellant and Tony travelled separately on their own instead\n                    of travelling together as had been the case on numerous previous occasions. A\n                    mere suspicion it could have been, but it was far from being a distinct enough\n                    peculiarity (in and of itself) to raise a strong suspicion.At the very least, the suspicion must bear a reasonable connection to the\n                        specific drug at issue. In both instances, his failure to check\n                    the contents of the package would, at best, constitute onlynegligence or recklessness. As we have indicated above at[20], these instances are insufficient\n                    to amount to wilful blindness. 25     It will be recalled that the Appellant had submitted that he had a close and\n                    personal relationship with Tony and that he (the Appellant) had thereforetrustedhim (see above at[21(c)]). If the Appellant could make good\n                    this submission, this would buttress hisuncontrovertedclaim that he had thought that he was only\n                    carrying the Controlled Drugs, having regard to the fact that he had been\n                    carrying only the Controlled Drugs during the previous occasions he had\n                    participated in. That measure of trust would lend further basis to hisuncontrovertedclaim that Tony did not deal in\n                    diamorphine, and would also provide a sufficiently cogent reason why he adhered\n                    to Tony’s instructions not to open up the bundles. It is also important to\n                    note that, without having had the benefit of Tony’s testimony, it would\n                    only be fair to the Appellant to assume that what he (the Appellant) stated with\n                    regard to his relationship with Tony, was true. With the limited evidence on\n                    record, all we can conclude at this moment is that Tony was indeed involved in\n                    the transaction as his deoxyribonucleic acid (commonly known as\n                    “DNA”) evidence was found on the package.[note: 20]This, we consider, to be a crucial fact. It objectively corroborates\n                    the Appellant’s assertion that Tony had a significant role in the\n                    transaction. Further, Tony was in fact subsequently apprehended on the same day\n                    as the Appellant’s arrest,withthe\n                    Appellant’s cooperation. In our view, whilst we ought not – and,\n                    indeed, cannot – make any observations with regard to Tony’s guilt\n                    as such, the very fact of Tony’s existence and his seeming involvement\n                    corroborated with the Appellant’s version of the events in general and,\n                    more importantly, thenatureof his relationship\n                    with Tony in particular. In his evidence, the Appellant testified that he met\n                    Tony in 2007 at a hair salon and, thereafter, met him once or twice a week.\n                    Usually, the pair would meet at the hair salon every week and they would have a\n                    “chit chat” with each other. On several occasions, Tony would take\n                    him to the discotheque, and, on other occasions, they would go out for food.\n                    When the Appellant lost his job sometime in April 2008, it was Tony who offered\n                    him an opportunity to sell on drugs (that Tony supplied) to one of his friends.\n                    That friend failed to pay for the consignment and the Appellant, as a result,\n                    owed Tony money. The Appellant avoided Tony at first but unfortunately chanced\n                    upon each other in a discotheque subsequently. There, Tony reminded the\n                    Appellant of the debt and, soon after, offered the Appellant several jobs (to\n                    courier controlled drugs) which could assist the Appellant’s repayment of\n                    the money owed to him (Tony). It was in this context that the Appellant agreed\n                    to deliver the Controlled Drugs for Tony, and also believed Tony when he said\n                    that he did not deal with heroin. In our view, it could further be the case\n                    that, because Tony consistently provided him with the Controlled Drugs as\n                    claimed, there was no real reason for the Appellant to be suspicious and\n                    disbelieve Tony. As far as first impressions go, it would appear that the\n                    Appellant and Tony shared a friendly relationship, and giving the benefit of the\n                    doubt to the Appellant, that friendship formed a sufficient basis for his\n                    assertion that the Appellant trusted Tony. 26     However, as already noted, Tony was released pursuant to a DNAQ. We should\n                    observe, at the outset, that we do not even hint at any impropriety in the\n                    procedure adopted by the Prosecution with regard to Tony. However, whilst the\n                    Prosecution might have had valid reasons for releasing Tony, the fact remains\n                    that Tony might have furnished valuable evidence that would have buttressed the\n                    Appellant’s defence, one possible aspect of which was the relationship of\n                    trust between the Appellant and Tony referred to above. In this regard, it is in\n                    our view unsafe to assume in the circumstances, without more, that any evidence\n                    furnished by Tony would not have altered the Judge’s findings with regard\n                    to the Appellant’s knowledge and culpability (contrathe GD at [32]).\n                    The central difficulty facing this court in this particular regard is that we\n                    obviously do not know what precisely Tony’s testimony would have been had\n                    he been called as a witness. However, given this situation, we are of the view\n                    that, at the very least, the Appellant oughtnotto be prejudiced by the absence of Tony’s testimony as a result of the\n                    Prosecution’s decision to apply for a DNAQ. Notably, this is unlike some\n                    other situations where some, but not all, accomplices are arrested while the\n                    rest evaded arrest and could not subsequently be called (if applicable) to give\n                    evidence. In our view, therefore, given the exceptional circumstances of this\n                    case, we found that the benefit of the doubt ought to be given to the Appellant\n                    and that necessarily means that this court has to assume that Tony’s\n                    evidence could have assisted the Appellant’s defence insofar as the\n                    element of knowledge was concerned. 27     Returning to the issue at hand, we have to do the best we can, based on the\n                    available evidence which has been set out above. Tosummarise, the Appellant has adduced evidence to the effect that\n                    he had hitherto always been dealing in the Controlled Drugs, which (in turn)\n                    constitute evidence of aconsistent pattern of\n                        conductthat wasnot contradicted by the\n                        Prosecution in the court below. He had also argued that he had\n                    taken precautions throughout not to deal in drugs (such as diamorphine) which\n                    would have resulted in charges carrying the death penalty. In the context of the\n                    present appeal, he had confirmed with Tony that the package did not contain\n                    diamorphine and had trusted his answer that it did not in light of their close\n                    and personal relationship. We pause to note – parenthetically – that\n                    the Appellant must have simultaneously taken into account his experience on the\n                    previous occasions (when he had, as we have just noted, dealt only in the\n                    Controlled Drugs). As mentioned above, we must – in the absence of any\n                    actual testimony by Tony to the contrary – assume that any testimony\n                    furnished by Tony would have buttressed the Appellant’s defence. The Judge\n                    observed that the Appellant did not look at the items contained in the plastic\n                    bags and took the risk that Tony “could one day play him out” (see\n                    the GD at [29]). Whilst this view may be\n                    of general relevance, we emphasise once again that the circumstances of this\n                    case are exceptional and that the Judge’s view should, with respect, have\n                    been mitigated by the cumulative effect of the Appellant’suncontrovertedevidence as to theconsistent pattern of conduct and his trust in Tony. 28     In the circumstances, we would respectfully differ from the finding of the\n                    Judge to the effect that the Appellant had been wilfully blind to the fact that\n                    the package contained diamorphine. Given theparticular\n                        factual matrixset out above, we are of the view that the\n                    Appellant was, at most, either negligent or reckless in not checking the\n                    package, butnotwilfully blind. Given his\n                    relationship with Tony and (especially) the previous occasions when he had\n                    assisted in importing ice (which were not insignificant in number), there wasan absenceof astrong\n                        suspicionto which the Appellant had turned a blind eye. 29     As a result of our finding above, and given theparticular\n                        factual matrixset out above, it would also follow that the\n                    Appellant has succeeded in rebutting, on a balance of probabilities, the\n                    presumption of knowledge under s 18(2) of the Act. It bears emphasising\n                    that each case will, of course, depend on its own precise facts. The facts of\n                    the present appeal, it might be observed, are rather unusual: in particular, the\n                    consistent pattern of conduct referred to above (which centred on dealing in\n                    drugs which didnotinvolve the death penalty) was\n                    admitted by the Prosecution, and, further, the testimony of a significant\n                    witness (Tony) was not available (for which we have therefore assumed that such\n                    testimony, if given, would have buttressed the Appellant’s case). In the\n                    circumstances, a strong cautionary note ought to be sounded. Given the finely\n                    balanced set of facts in the present appeal, nothing in this case sets a\n                    precedent for future cases (which ought, in any event, to turn on their own\n                    particular facts). Still less will future courts countenance accused persons\n                    seeking to “manufacture defences” in order to effect a similar\n                    fact pattern.",
        "Conclusion": "30     For the reasons set out above, we allow the appeal on the charge as it stands.\n                    We would like to note the exemplary manner in which the Prosecution and Defence\n                    had conducted their respective cases in the present appeal and would like to\n                    commend them accordingly. In particular, the Prosecution conducted its case in\n                    the spirit of its overall mission, which is encapsulated in the following\n                    observation of this court inBachoo Mohan Singh v Public\n                        Prosecutor[2010] 1 SLR 966 (at [103]) that “the Prosecution ... [is\n                    the] guardian of the people’s rights,including those\n                        of the accused” (emphasis in original). 31     Pending submissions from the Prosecution on whether we ought to,inter alia, amend the charge, we will adjourn the\n                    matter. The Prosecution has 21 days to let us have its submissions on what\n                    courses of action are open to us on the established facts. Counsel for the\n                    Appellant will have 21 days thereafter to respond. We will then hear the\n                    parties on the issues that have arisen. Until then, the Appellant will continue\n                    to be in custody.",
        "Postscript": "32     We have already noted that it was unfortunate that Tony had been released\n                    prior to the trial of the Appellant. However, there appears to be no hard and\n                    fast rule that will ensure that such a difficulty does not arise in future\n                    cases. All we can state, at the present time, is that, where there are at least\n                    two co-accused who have been charged in relation to the same transaction, the\n                    Prosecution should endeavour, if (as was the case here with regard to Tony) it\n                    proposes to release one of the co-accused, to inform counsel for the other\n                    co-accused as expeditiously as possible. Likewise, counsel for theotherco-accused should also act with equal expedition\n                    in determining whether the evidence of the co-accused (to be released) is\n                    necessary for his or her client’s defence. If deemed necessary, counsel\n                    ought to make the necessary applications to secure the co-accused’s\n                    attendance at the trial of his or her client.  [note: 2]Notes of Evidence (“NE”) Day 1 at p 12,\n                                lines 1–3. [note: 3]Record of Proceedings (“ROP”) vol 2 at\n                                p 6, [6] (Statement of Agreed Facts). [note: 4]NE Day 4 at p 15, lines 19–27 and ROP\n                                vol 2 at p 253. [note: 5]NE Day 4 at p 32, lines 26–31 and ROP\n                                vol 2 at p 253. [note: 6]ROP vol 2 at p 249. [note: 7]Ibid. [note: 8]NE Day 4 at p 29, lines 13–18. [note: 9]NE Day 4 at p 29, lines 8–10. [note: 10]ROP vol 2 at p 263. [note: 11]NE Day 4 at p 14, lines 4–8. [note: 12]ROP vol 2 at p 264. [note: 13]ROP vol 2 at p 252. [note: 14]ROP vol 2 at p 264. [note: 15]Appellant’s Further Written Submissions dated\n                                21 December 2010 at [85] and Respondent’s Further Written\n                                Submissions dated 5 January 2011 at [4]. [note: 16]ROP vol 2 at p 254. [note: 17]NE Day 4 at p 29, lines 4–10 and ROP\n                                vol 2 at p 263. [note: 18]NE Day 4 at pp 29–30. [note: 19]NE Day 4 at p 29, lines 12–18. [note: 20]NE Day 3 at p 54, lines 6–7."
    }
}