{
    "case_title": "Teo Wai Cheong\n      v\n      Crédit Industriel et Commercial",
    "ncitation": "[2011] SGCA 13",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This is an appeal against the decision of a\n                    Judicial Commissioner to allow a claim by the respondent, Crédit Industriel et\n                    Commercial (“CIC”), a French bank, against the appellant,\n                    Mr Teo Wai Cheong (“Teo”), its former private banking client,\n                    for sums due under five financial products known as “accumulators”\n                    (“the Disputed Accumulators”) (seeCrédit\n                        Industriel et Commercial v Teo Wai Cheong[2010] 3 SLR 1149\n                    (“GD”)).",
        "Background": "2       Ms Ng Su Ming (“Ng”) was\n                    Teo’s banking relationship manager (“RM”) at CIC. Ng and Teo\n                    have known each other since 2004. Ng was also Teo’s RM when she was\n                    working at Citibank Singapore. Teo became a private banking customer of CIC when\n                    Ng moved to CIC in 2006.[note: 2] 3       Teo’s financial products made with or\n                    through CIC were initially in foreign exchange options, equity linked notes and\n                        shares[note: 3]. In June 2007, Ng introduced Teo to\n                    accumulators which were, at that time, new financial products.[note: 4] 4       The features of an accumulator are not\n                        disputed.[note: 5]An accumulator\n                    is essentially a transaction in which an investor agrees to periodically\n                    purchase a quantity of shares of a specified counter from a counterparty at a\n                    discount to the market price of the counter at the beginning of the transaction.\n                    We will refer to the market price of the counter at the beginning of the\n                    transaction as “the Spot Price” and the discounted price as\n                    “the Forward Price”. The documents sometimes refer to the Spot\n                    Price as “the Initial Price” and the Forward Price as “the\n                    Strike Price”. The investor’s obligation to periodically purchase\n                    shares may be prematurely terminated by agreement. The accumulator will also\n                    terminate if the market price of the shares rises above a specified price known\n                    as “the Knock-out Price”. The accumulator will, however, continue\n                    for a specified period if it provides for a guaranteed purchase\n                    (“Guaranteed Purchase”).[note: 6] 5       The amount of shares that the investor is\n                    required to purchase under the accumulator will depend on the market price of\n                    the shares at the end of each period. The length of each period may be a day, a\n                    week or a month. If the market price at the end of a particular period closes at\n                    or above the Forward Price, the investor must purchase a specified quantity of\n                    shares at the Forward Price[note: 7]. If, however, the market price on that day\n                    falls below the Forward Price, the investor must purchasedoublethe specified quantity of shares at the Forward Price\n                    (“the Doubling Feature”).[note: 8] 6       A numerical example will help in understanding\n                    how an accumulator operates. The following table summarises the key terms of a\n                    typical accumulator involved in the present appeal:[note: 9] Table 1 TermParticularsSpot\n                                    PriceS$1.7950Forward\n                                    PriceS$1.6335Knock-out\n                                    PriceS$1.8489Share accumulations per\n                                            day1,000 shares if the market\n                                            price closes at or above the Forward\n                                        Price.2,000 shares if the market\n                                            price closes below the Forward\n                                    Price.   If the market price at the end of a particular period (in this\n                    accumulator, the period is a day) is S$1.70, the investor will have to\n                    accumulate 1,000 shares at the price of S$1.6335 per share. This is because the\n                    market price at the end of the day was higher than the Forward Price but lower\n                    than the Knock-out Price. However, if the market price at the end of the day is\n                    S$1.60, which is a figure that is less than the Forward Price, the investor will\n                    have to accumulate 2,000 shares at the same price of S$1.6335 per share. If the\n                    market price at the end of the day is S$1.90, the accumulator will be\n                    knocked-out. The obligations of the investor will cease. However, he is entitled\n                    to retain any shares that he has accumulated before the accumulator is\n                    knocked-out. 7       Another feature of an accumulator which should\n                    be noted is the maximum liability of an investor under an accumulator. Assuming\n                    that the accumulator does not knock-out prematurely, the investor’s\n                    maximum obligation under the accumulator in dollar terms is the cost of any\n                    Guaranteed Purchase plus his cost of purchasing double the specified quantity of\n                    shares at the Forward Price for each period (“the Maximum\n                        Obligation”).[note: 10]",
        "The process for establishing accumulators": "8       CIC did not structure the accumulators that are\n                    the subject of this appeal entirely by itself. CIC first entered into\n                    accumulators with other banks. CIC then entered into accumulators with its\n                    clients. It is necessary for us to describe CIC’s process for establishing\n                    accumulators for its clients because the process is relevant to Teo’s\n                    defence that he had never authorised the purchase of the five accumulators which\n                    is the subject matter of CIC’s claim. 9       CIC’s order process, so far as relevant to\n                    the issues on appeal, is as follows. If a client decides to enter into an\n                    accumulator transaction, he will instruct his RM to establish an accumulator at\n                    a range of prices and for an approximate range of Maximum\n                        Obligation.[note: 11]The RM will then place the order\n                    with CIC’s private bank advisory office (“PBA”).[note: 12]It should be noted that the RM’s conversations with PBA’s officers\n                    are recorded. Before placing the order with PBA, the RM may consolidate orders\n                    placed by the client with orders placed by other clients.[note: 13]Mr Jean Luc-Anglada\n                    (“Anglada”), CIC’s regional manager for the Asia Pacific\n                    region, deposed that it is common for RMs to consolidate orders placed by their\n                    clients because some banks have a minimum order requirement.[note: 14]PBA will then place the RM’s order with CIC’s\n                        counterparty.[note: 15]It should be noted that the\n                    conversations between PBA’s officers and the officers of CIC’s\n                    counterparty are also recorded. If the order is successful, the RM will provide\n                    a customer services officer (“CSO”) with a breakdown of the\n                    individual orders placed by each of his clients if the order was a consolidated\n                        order.[note: 16]The CSO will enter the\n                    breakdown into CIC’s database to establish accumulators between CIC and\n                    each client.[note: 17]CIC will then generate\n                    and send confirmation notes for the transaction to each client.[note: 18]",
        "The Disputed Accumulators": "10     Ng entered into 20 accumulators on behalf of\n                    Teo. The particulars of those accumulators are summarised in the following\n                        table:[note: 19] Table 2 Serial\n                                    NumberTrade\n                                    dateShares to be\n                                        accumulatedStatus120 July\n                                        2007Noble Group\n                                        LimitedKnocked-out on 23 July\n                                            2007225 July\n                                        2007Noble Group\n                                        LimitedKnocked-out on\n                                            24 September 200731 August\n                                        2007Keppel Corporation\n                                            LimitedKnocked-out on 3 August\n                                            2007413 August\n                                        2007Keppel Corporation\n                                            LimitedKnocked-out on 27 August\n                                            2007515 August\n                                        2007Keppel Corporation\n                                            LimitedKnocked-out on 23 August\n                                            2007610 September\n                                        2007Keppel Corporation\n                                            LimitedKnocked-out on\n                                            12 September 2007713 September\n                                        2007DBS Group Holdings\n                                            LimitedKnocked-out on\n                                            19 September 2007813 September\n                                        2007DBS Group Holdings\n                                            LimitedKnocked-out on\n                                            20 September 2007918 September\n                                        2007DBS Group Holdings\n                                            LimitedKnocked-out on\n                                            19 September 20071025 September\n                                        2007Neptune Orient Lines Limited\n                                            (“NOL”)Knocked-out on 1 October\n                                            20071125 September\n                                        2007Cosco Corporation (S) Limited\n                                            (“Cosco”)Knocked-out on\n                                            26 September 20071227 September\n                                        2007China Energy Limited\n                                            (“CE”)Knocked-out on\n                                            28 September 2007131 October\n                                        2007CEKnocked-out on 2 October\n                                            2007141 October\n                                        2007CoscoKnocked-out on 2 October\n                                            2007152 October\n                                        2007CETerminated prematurely;\n                                            disputed in these proceedings.162 October\n                                        2007CETerminated prematurely;\n                                            disputed in these proceedings.172 October\n                                        2007CETerminated prematurely;\n                                            disputed in these proceedings.182 October\n                                        2007CETerminated prematurely;\n                                            disputed in these proceedings.193 October\n                                        2007Sembcorp Marine Limited\n                                            (“Sembcorp”)Knocked-out on\n                                            18 October 2007203 October\n                                        2007CETerminated prematurely;\n                                            disputed in these proceedings.   Teo does not dispute that he authorised CIC to enter into 14 of those\n                    accumulators (“the Undisputed Accumulators”).[note: 20]We should add that Teo\n                    claims that Ng entered into two of the Undisputed Accumulators without obtaining\n                    his prior instruction.[note: 21]These were the\n                    accumulators on Cosco and NOL shares (serial numbers 10 and 11 in Table 2,\n                    above, respectively). However, Teo later accepted those accumulators when they\n                    were knocked-out.[note: 22]Of the remaining six\n                    accumulators, only five are the subject of the present appeal (serial\n                    numbers 15, 16, 17, 18 and 20 in Table 2, above). The sixth\n                    accumulator was to accumulate Sembcorp shares (serial number 19 in\n                    Table 2, above) (“the Disputed Sembcorp\n                        Accumulator”).[note: 23]As indicated in Table 2, that\n                    accumulator was knocked-out 15 days after it was entered into.[note: 24] 11     The five accumulators that are the subject of\n                    this appeal were all for the accumulation of shares in CE. These are the\n                    accumulators mentioned at serial numbers 15–18 and 20 of\n                    Table 2. We will refer to the individual Disputed Accumulators as\n                    “the First Disputed Accumulator”, the “Second Disputed\n                    Accumulator” and so forth. It should be noted that two of theUndisputedAccumulators were also for the accumulation\n                    of shares in CE (“the Undisputed CE Accumulators”).[note: 25] 12     The particulars of the Disputed Accumulators\n                    are summarised in the following table:[note: 26] Table 3 AccumulatorDate when entered\n                                        intoSpot\n                                    PriceForward\n                                    PriceThe First Disputed\n                                            Accumulator2 October\n                                        2007S$1.7946S$1.6017The Second Disputed\n                                            Accumulator2 October\n                                        2007S$1.8109S$1.6162The Third Disputed\n                                            Accumulator2 October\n                                        2007S$1.7950S$1.6335The Fourth Disputed\n                                            Accumulator2 October\n                                        2007S$1.7400S$1.5834The Fifth Disputed\n                                            Accumulator3 October\n                                        2007S$1.6800S$1.5238",
        "The alleged authorisation for the Disputed Accumulators": "13     CIC claims that Ng received Teo’s\n                    authorisation for the First, Second, Third and Fourth Disputed Accumulators\n                    during a telephone conversation between Ng and Teo at 9.34am on 2 October\n                    2007 (“the First Disputed Conversation”). The First Disputed\n                    Conversation lasted 2 minutes and 22 seconds. The First Disputed\n                    Conversation was not recorded. The First Disputed Conversation occurred just\n                    six seconds after Teo received the following short messaging service\n                    (“SMS”) message:[note: 27] Ok, last night us very gd. Rally shld continue. Can I do somemore? Looking\n                        at china energy, cosco and ferrochina. 14     CIC claims that Ng received authorisation for\n                    the Fifth Disputed CE Accumulator during a conversation between Ng and Teo at\n                    10.27am on 3 October 2007 (“the Second Disputed\n                    Conversation”). The Second Disputed Conversation lasted for 1 minute\n                    and 15 seconds. The Second Disputed Conversation was also not\n                    recorded. 15     Because these two conversations were not\n                    recorded, Ng and Teo gave different accounts of what was said between them.\n                    Turning first to the First Disputed Conversation, Ng’s evidence in her\n                    affidavit of evidence-in-chief (“AEIC”) was that Teo instructed\n                    her to establish the First, Second, Third and Fourth Disputed CE Accumulators\n                    after she informed Teo of the maximum amount of shares that he would be obliged\n                    to accumulate undereachof those\n                        accumulators.[note: 28]Ng also claimed that she informed\n                    Teo of the Maximum Obligation for each of those accumulators.[note: 29]In her testimony during cross-examination, Ng claimed that Teo instructed her to\n                    enter into an accumulator for CE shares with a Maximum Obligation of\n                    approximately S$6m and at a Spot Price between S$1.75 to S$1.82.[note: 30] 16     As for the Second Disputed Conversation, in\n                    her AEIC, Ng claimed that Teo instructed her to enter into a CE accumulator and\n                    a Sembcorp accumulator after she informed Teo of the maximum quantity of shares\n                    that he would be obliged to accumulate under each accumulator.[note: 31]Ng also claimed that she informed Teo of thespecific figurefor the Maximum Obligation of\n                    each accumulator.[note: 32]In her testimony during\n                    cross-examination, Ng said she was instructed to enter into an accumulator for\n                    CE shares with a Maximum Obligation of between S$4m and S$5m and at a Spot Price\n                    between S$1.64 and S$1.70.[note: 33]This order was later\n                    converted into the Fifth Disputed Accumulator. Ng was not cross-examined on her\n                    account of the Second Disputed Conversation in relation to the Disputed Sembcorp\n                    Accumulator. 17     Teo disputed Ng’s evidence on the First\n                    and Second Disputed Conversations. In his AEIC, Teo did not specifically address\n                    each conversation. Teo simply deposed that Ng told him on or about 2 or\n                    3 October 2007 that one of the Undisputed CE Accumulators and a Cosco\n                    accumulator had knocked-out.[note: 34]Teo also claimed that he discussed share\n                    price movements for the purpose of selling shares accumulated under accumulators\n                    that had been knocked-out.[note: 35]When\n                    questioned on his recollection of the First Disputed Conversation, Teo\n                    acknowledged that it was possible that he discussed establishing a CE\n                    accumulator but he could not recall if there was actually such a\n                        discussion.[note: 36]Teo also maintained his\n                    assertion that he spoke to Ng about shares accumulated under accumulators that\n                    had been knocked-out,viz, Cosco, NOL and CE\n                        shares.[note: 37]As for the Second Disputed\n                    Conversation, Teo’s evidence during cross-examination was that it was not\n                    possible that the conversation was about establishing a CE accumulator or a\n                    Sembcorp accumulator.[note: 38]He also initially testified\n                    that the Second Disputed Conversation was about the share price movements of NOL\n                    and CE shares.[note: 39]When pressed further, Teo said\n                    that he could not recall what was discussed during the Second Disputed\n                        Conversation.[note: 40] 18     Teo also claimed that he gave Ng two\n                    instructions on limiting his exposure to accumulators: (a) on 20 July\n                    2007, Teo instructed Ng that his exposure on accumulators should not exceed the\n                    net asset value of his account with CIC and that the share counters to be\n                    accumulated must be “blue chips”;[note: 41]and (b) on 27 September\n                    2007, Teo instructed Ng that his exposure on accumulators should not exceed S$1m\n                    and that the share counters to be accumulated must be “blue\n                        chips”.[note: 42]",
        "The decision of the Judicial Commissioner and our\n                directions": "19     The Judicial Commissioner gave judgment for\n                    CIC on its claims. He held that Teo authorised the Disputed Accumulators during\n                    the First Disputed Conversation and the Second Disputed Conversation on the\n                    basis of the following findings: (a)     Ng’s testimony on the contents\n                        of the First Disputed Conversation and the Second Disputed Conversation,\n                        which the Judicial Commissioner found more credible than Teo’s\n                            testimony;[note: 43] (b)     Teo’s prior experience with the\n                        Undisputed Accumulators, which included the Undisputed CE Accumulators, and\n                        his retention of shares accumulated under those Undisputed CE\n                            Accumulators;[note: 44] (c)     CIC and Teo’s conduct after the\n                        Disputed Accumulators were entered into;[note: 45]and (d)     Teo’s equivocation in rejecting\n                        the Disputed Accumulators.[note: 46] 20     These were essentially findings of fact based\n                    on the Judicial Commissioner’s assessment of credibility and demeanour of\n                    the witnesses, and also the documentary evidence adduced by the parties. In the\n                    course of reviewing the record after we reserved judgment, we noted that certain\n                    transcripts of telephone conversations and other documents in the possession of\n                    CIC were not disclosed and also those produced had certain portions redacted. We\n                    were informed by counsel that the redactions were not objected to by Teo’s\n                    counsel and were accepted by the Judicial Commissioner on the ground that the\n                    redacted portions or undisclosed documents related to CIC’s other clients,\n                    and that any disclosure of the said information would have contravened s 47\n                    of the Banking Act (Cap 19, 2008 Rev Ed) (“the Banking\n                    Act”) on banking secrecy. These clients were identified as “Client\n                    A”, “Client B” and “Client C”. 21     We also noted from the disclosed materials\n                    that the orders that Teo was alleged to have placed during the Disputed\n                    Conversations did not correspond with the orders that Ng placed with CIC’s\n                    PBA office. We knew this because, unlike the Disputed Conversations, Ng’s\n                    conversations with CIC’s PBA office were recorded and transcribed (see\n                        [9]). Hence, there was objective\n                    evidence of Ng’s execution of all orders with CIC’s PBA office.\n                    CIC’s explanation for the lack of correspondence was that Ng consolidated\n                    orders placed by her other clients (viz, Clients\n                    A, B and C) with Teo’s orders. She then placed the consolidated orders\n                    with CIC’s PBA office. CIC’s PBA office executed the consolidated\n                    orders by entering into accumulators with other banks. After accumulators for\n                    the consolidated orders were established between CIC and the other banks, Ng\n                    would issue instructions to establish accumulators between CIC and each client\n                    for the amount they each ordered. 22     We were of the view that the evidence relating\n                    to the orders placed by the other clients was relevant in the light of this\n                    practice of consolidating orders. Moreover, there was also evidence that\n                    one/some of these clients had also disputed that they had authorised Ng to\n                    purchase CE accumulators for them. 23     In any case, we were of the view that the\n                    redacted portions should not have been redacted, and that all materials relating\n                    to Ng’s placing of the orders for the Disputed Accumulators should have\n                    been disclosed so that the court could have all the relevant evidence to show\n                    whether Ng or Teo was telling the truth as to whether he had authorised her to\n                    purchase the five Disputed Accumulators. In our view, s 47(1) of the\n                    Banking Act does not prohibit the disclosure of “customer\n                    information” where the customer cannot be identified, for the reason that\n                    that term is defined in s 40A of the Banking Act as follows: “customer information” , in relation to a bank, means\n                        — (a)    any information relating to, or any particulars\n                            of, an account of a customer of the bank, whether the account is in\n                            respect of a loan, investment or any other type of transaction, butdoes not include any information that is not\n                                referable to any named customer or group of named\n                                customers; or (b)    deposit information; [emphasis added in bold italics] In our view, on a plain reading of s 47, disclosure of all the\n                    telephone conversations and other records where the customers are named\n                    “Client A”, “Client B” and “Client C”\n                    would merely be disclosure of “any information that is not referable to\n                    any named customer or group of named customers” and would not, thus,\n                    constitute a disclosure of “customer information”. 24     Accordingly, we exercised our powers under\n                    s 37(4) of the Supreme Court of Judicature Act (Cap 322,\n                    2007 Rev Ed) and directed[note: 47]CIC to produce copies\n                    of the following transcripts/documents (with only the names of CIC’s\n                    clients or former clients and/or account numbers redacted where necessary to\n                    prevent their identification): (a)     Transcripts of all instructions and\n                        discussions that Ng had with CIC’s clients (or former clients) who\n                        were identified as “Client A” and “Client B”, as\n                        well as any other clients (or former clients), in relation to CE\n                        accumulators discussed, quoted or purchased on 2 and 3 October\n                        2007. (b)     Transcripts of all instructions (if oral) given and discussions that Ng had\n                        with PBA and/or any other present (or former employee) of CIC in relation to\n                        CE accumulators discussed, quoted or purchased on 2 and 3 October 2007.\n                        All written communications, including emails, in connection with these\n                        matters should also be produced. (c)     Transcripts of telephone conversations and any emails or\n                        written communications between PBA and/or any other present (or former)\n                        employees of the respondent with any of CIC’s counterparties relating\n                        to CE accumulators discussed, quoted or purchased on 2 and 3 October\n                        2007. (d)     Transcripts, any internal memoranda, emails and/or written communications\n                        between employees of CIC as well as any internal reports made in relation to\n                        any matter, transaction or issue involving CE accumulators established on 2\n                        and 3 October 2007 with any client or former\n                    clients. (e)     Any\n                        internal memoranda, emails and/or written communications between any present\n                        or former employee of the respondent in relation to the handwritten note\n                        found at Record of Appeal Vol IV, Part A at\n                    p 6511. 25     These materials were duly disclosed and the\n                    parties were invited to make submissions on these materials.",
        "Our decision": "26     Having examined some of the new materials and\n                    also the parties’ submissions on their relevance to the Disputed\n                    Accumulators, we find that we are unable to conclude that the findings of fact\n                    of the Judicial Commissioner would have been the same if he had seen these\n                    materials, or if they had been subjected to cross-examination by counsel for\n                    Teo. Amongst the newly disclosed documents are documents relevant to determining\n                    whether Teo was telling the truth in denying that he gave instructions to Ng, or\n                    what kind of instructions he gave to Ng on 2and/or 3 October 2007. One of them is a draft email update\n                    meant to be sent to Teo, but which was never sent. The document was attached to\n                    a blank email dated 19 November 2007 that Ng sent to her CSO, Paul\n                        Neo.[note: 48]The document read: Hi Mr Teo, Just wanted to write you a short update on both China Energy as well as\n                        your current position in the bank. Firstly, with regards [sic] to our\n                        conversation last week on Tues [sic] evening,\n                        I would like to thank you foracknowledging that due to\n                            our almost 3 years partnership you would be seeing through the\n                            accumulators on the China Energy shares as per our\n                        discussion. I have sold off 150,000 worth of China Energy Shares\n                        on 16thof November at a share price of 1.1628\n                        per share as per our conversation on 15thof\n                        November. Going forward, I will still be updating you consistently and\n                        discussing with you how we will move forward as the market unfolds in the\n                        coming months. You may not be aware that one of China Energy’s biggest shareholders\n                        is the *ASEAN China Investment Fund Limited which is actually a SINO-SWISS\n                        partnership between a [sic] Swiss Government\n                        and UOB Venture Management Limited. They have 95,000,000 shares. The biggest\n                        shareholder of the ASEAN China Investment Fund Limited is China Development\n                        Bank. This is a good indication of the positive direction of China’s\n                        alternative energy sector as the world and China continues its search for\n                        alternative fuel sources as oil prices continue to rise. And China Energy\n                        Limited’s position as one of the biggest Dimethanol producers would\n                        mean that it is poised to capitalize on this. Currently, you have already picked up 404,000 shares of China Energy. We\n                        are accumulating 13500 shares per day for 360 days at a strike price of an\n                        average of S$1.60. As I have mentioned to you previously, the collateral\n                        shortfall is currently at USD 4,500,000 and it is the Bank’s view that\n                        you could mitigate this shortfall with the greatest urgency. … [emphasis added] 27     It may be recalled that the Judicial\n                    Commissioner accepted Ng’s evidence that Teo had given her instructions to\n                    purchase the five Disputed Accumulators, and rejected Teo’s denial of the\n                    existence of such instructions. In relation to this finding, the italicised\n                    words in the second paragraph of the above passage may or may not support\n                    Ng’s evidence. They are ambiguous and Ng should testify and be\n                    cross-examined on what she meant by those words. 28     Another newly disclosed document may be\n                    material to the finding of the Judicial Commissioner against Teo in relation to\n                    his conduct after he had allegedly disputed Ng’s authority to purchase the\n                    Disputed Accumulators.[note: 49]Teo had meetings with Mr Paul Kwek\n                    (“Kwek”), CIC’s Managing Director and Head of Private\n                    Banking, and Anglada on 20 and 28 November 2007 (GD at [67]–[73]). Kwek sent an email dated 20 November 2007 to his\n                    superiors in which he recorded what transpired at the 20 November 2007\n                    meeting. That email recorded that Teo had said he was not denying the Disputed\n                    Accumulators. The Judicial Commissioner accepted that Kwek’s email\n                    correctly recorded the contents of the meeting (GD at [72]). He further held that Teo’s own\n                    emails to CIC on 21 and 23 November 2007 were similar to Kwek’s\n                    contemporaneous internal record of the 20 November 2007 meeting (GD at\n                        [70]). 29     However, a newly disclosed internal document\n                    that CIC’s Credit and Risk Department sent to its head office seems to\n                    give a different account of this event. The document bears the title\n                    “Watchlist and Provisions Report as at 30 November 2007”\n                    (“the November Watchlist Report”).[note: 50]The November Watchlist Report was prepared for Teo’s account. It appears\n                    to have been sent by CIC’s Credit and Risk Department via email on\n                    24 December 2007 to one Marie Rose Fenet.[note: 51]The following portion in\n                    the November Watchlist Report, under the section entitled “reasons for\n                    watchlist/provisions”, is material: RM booked equity accumulator transactions above approved credit limit and\n                        pending adequate funding. When the equity market corrected severely,\n                        unrealized losses escalated.Matter is tenuous as the\n                            client is arguing that he did not authorize the outstanding 5 equity\n                            accumulator trades that caused that huge under margin and asset\n                            shortfall position. Top up requirement as at end Nov 07 was\n                        USD4.920k based on internal guidelines for the full funding of the maximum\n                        potential number of shares that may be picked up during the life of the\n                        equity accumulator. Based on estimated unwinding cost of the equity as at\n                        end Nov 07, against the market value of the customer’s asset held by\n                        the bank, there is a shortfall of USD1,372.88k. [emphasis added] The italicised words would suggest that on 30 November 2007 CIC\n                    was aware that Teo was alleging that the Disputed Accumulators were\n                    unauthorised. The November Watchlist Report contradicts Kwek’s\n                    20 November 2007 email and also the evidence of Kwek and Anglada during\n                    cross-examination that Teo did not argue that the Disputed Accumulators were\n                    unauthorised when he met with CIC’s management on 20 and 28 November\n                        2007.[note: 52]Just two days after the\n                    28 November 2007 meeting, CIC’s internal documents recorded or seemed\n                    to suggest that CIC knew that Teo was alleging that the Disputed Accumulators\n                    were unauthorised. Again, Kwek and Anglada may well have a valid explanation for\n                    these apparent discrepancies. In this connection, CIC has in fact argued in its\n                    written submissions that the November Watchlist Report was sent on\n                    24 December 2007 to state CIC’s exposure as at 30 November\n                        2007.[note: 53]CIC also argued that the reference to a\n                    lack of authorisation in the Watchlist Report referred to Teo’s complaint\n                    over the level of his exposure.[note: 54]We are unable\n                    to determine the truth of this explanation simply by reading the November\n                    Watchlist Report. 30     If it were the case or if it could be\n                    established that these two documents lent some support to Teo’s defence,\n                    it might or might not have influenced the Judicial Commissioner’s other\n                    findings of fact against Teo. These were findings which depended on the Judicial\n                    Commissioner’s evaluation of the credibility of the witnesses. There are\n                    also other matters in the newly discovered materials which counsel for Teo is\n                    entitled to raise in support of Teo’s defence. The question on which we\n                    have deliberated is whether in the circumstances, we should remit the case back\n                    to the Judicial Commissioner to consider the new materials or to order a retrial\n                    of the case. We have decided that in all the circumstances of this case a fresh\n                    trial is the better solution, notwithstanding that a fresh trial may take more\n                    time.",
        "Conclusion": "31     Accordingly, we set aside the judgment of the\n                    Judicial Commissioner and order that a new trial be fixed for CIC’s claim\n                    and Teo’s counterclaim in this case. We order that costs of the trial\n                    below and this appeal be costs in the cause. There will be the usual\n                    consequential orders.  [note: 2]Record of Appeal (“ROA”)\n                                Vol III Part E at 2881 (Ng’s AEIC) and ROA Vol III Part F at\n                                3620 (Teo’s AEIC). [note: 3]ROA Vol III Part E at 2891 (Ng’s\n                            AEIC). [note: 4]ROA Vol III Part E at 2892 (Ng’s\n                        AEIC). [note: 5]ROA Vol IV Part B at 7324–7330\n                                (Joint Statement on the Features of the Accumulator dated 8 October\n                                2009; marked as Exhibit A). [note: 6]ROA Vol IV\n                                Part B at 7325, [2(f)] (Joint Statement on the Features of the\n                                Accumulator dated 8 October 2009; marked as Exhibit\n                            A). [note: 7]ROA Vol IV\n                                Part B at 7325, [2(g)] (Joint Statement on the Features of the\n                                Accumulator dated 8 October 2009; marked as Exhibit\n                            A). [note: 8]ROA Vol IV\n                                Part B at 7325, [2(h)] (Joint Statement on the Features of the\n                                Accumulator dated 8 October 2009; marked as Exhibit\n                            A). [note: 9]Appellant’s Core Bundle (“ACB”) Vol II Part A\n                                at 265 (Table summarising all accumulators done for Teo since July\n                                2007). [note: 10]ROA Vol IV Part B at 7326, [3] (Joint\n                                Statement on the Features of the Accumulator dated 8 October\n                                2009; marked as Exhibit A). [note: 11]ROA Vol III Part G at 4272–4273,\n                                [10(c)] (Supplementary AEIC of Anglada dated 19 October\n                                2009). [note: 12]Ibid. [note: 13]ROA Vol III Part G at 4272–4273, [10(d)] (Supplementary\n                                AEIC of Anglada dated 19 October\n                        2009). [note: 14]Ibid. [note: 15]ROA Vol III Part G at 4273, [10(e)]\n                                (Supplementary AEIC of Anglada dated 19 October\n                            2009). [note: 16]Ibid. [note: 17]Ibid. [note: 18]Ibid. [note: 19]ACB Vol II Part A at\n                            265. [note: 20]ROA Vol II at 260, [15] (Teo’s Defence and Counterclaim\n                                (Amendment No 4)). [note: 21]ACB Vol II Part A at 194, [53]\n                                (Teo’s AEIC). [note: 22]Ibid. [note: 23]ROA Vol II\n                                at 264, [28] (Teo’s Defence and Counterclaim (Amendment No\n                                4)). [note: 24]ACB Vol II Part A at 265 (Table summarising all accumulators\n                                done for Teo since July\n                2007). [note: 25]Ibid. [note: 26]Ibid. [note: 27]ACB Vol II\n                                Part A at 217. [note: 28]ROA Vol III Part E at 2933 (Ng’s\n                                AEIC). [note: 29]Ibid. [note: 30]ROA Vol III Part H at 4604, lines 9–10 (Ng’s\n                                evidence on\n                cross-examination). [note: 31]ROA Vol III Part E at 2935 (Ng’s\n                        AEIC). [note: 32]Ibid. [note: 33]ACB Vol II\n                                Part B at 432–434 (Ng’s evidence on\n                                cross-examination). [note: 34]ROA Vol III\n                                Part F at 3645–3646 (Teo’s\n                        AEIC). [note: 35]Ibid. [note: 36]ROA Vol III Part J at 5928–5936\n                                and 5977 (Teo’s evidence on\n                        cross-examination). [note: 37]ROA Vol III Part J at 5932, 5975 and\n                                5980 (Teo’s evidence on\n                        cross-examination). [note: 38]ROA Vol III Part J at 5954\n                                (Teo’s evidence on\n                        cross-examination). [note: 39]ROA Vol III Part J at 6035\n                                (Teo’s evidence on\n                        cross-examination). [note: 40]ROA Vol III Part J at 6036\n                                (Teo’s evidence on\n                        cross-examination). [note: 41]ROA Vol II\n                                at 261, [15(d)] (Defence and Counterclaim Amendment No 4); ROA Vol\n                                III Part I at 5482, lines 3–9 (cross-examination of\n                                Teo). [note: 42]ROA Vol II at 262, [20] (Defence and\n                                Counterclaim Amendment No 4). [note: 43]GD at\n                                [35]–[48]. [note: 44]GD at\n                                [49]–[53]. [note: 45]GD at\n                                    [54]–[73]. [note: 46]GD at\n                                    [74]–[81]. [note: 47]See the\n                                Supreme Court Registry’s letter to WongPartnership LLP dated\n                                22 October 2010. [note: 48]RSBD Vol I at 92 (Draft\n                        email). [note: 49]GD at [54]–\n                        [73]. [note: 50]RSBD Vol I\n                                at 153 (Watchlist and Provisions Report). [note: 51]RSBD Vol I\n                                at 152 (Email). [note: 52]ROA Vol III Part I at 5320, lines 5–7\n                                (Kwek’s cross examination) and ACB Vol II Part B at 607, lines\n                                6–11 (Anglada’s cross\n                        examination). [note: 53]CIC’s Rebuttal Submissions at\n                            [7]. [note: 54]CIC’s\n                                Rebuttal Submissions at [6]."
    }
}