{
    "case_title": "Coöperatieve Centrale Raiffeisen-Boerenleenbank BA (trading as Rabobank\n                International, Singapore Branch)\n      v\n      Jurong Technologies Industrial Corp Ltd (under judicial\n                management)",
    "ncitation": "[2011] SGCA 48",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This is an appeal by Coöperatieve Centrale\n                    Raiffeisen-Boerenleenbank BA, trading as Rabobank International, Singapore\n                    Branch (“Rabobank”) against the decision of the trial judge\n                    (“the Judge”) in setting aside a total payment of US$2,775,149.37\n                    made by Jurong Technologies Industrial Corporation Ltd (under judicial\n                    management) (“JTIC”) to Rabobank on 22 December 2008 (\n                    “the Payment”) on the ground that it was an unfair preference\n                    under s 227T of the Companies Act (Cap 50, 2006 Rev Ed)\n                    (“CA”), read with s 99 of the Bankruptcy Act\n                    (Cap 20, 2000 Rev Ed) (“BA”) (seeJurong Technologies Industrial Corp Ltd (under judicial management) v\n                        Coöperatieve Centrale Raiffeisen-Boerenleenbank BA (trading as Rabobank\n                        International, Singapore Branch) [2011] 2 SLR 413\n                    (“the GD”)).",
        "Background facts": "2       The background facts of this case are as\n                    follows. JTIC was an investment holding company which carried on the business of\n                    providing electronic manufacturing services (“EMS”) through\n                    wholly-owned operating subsidiaries. Its principal operating subsidiary was\n                    Jurong Hi-Tech Industries Pte Ltd (under judicial management)\n                    (“JHTI”). Most of the business operations of JTIC and JHTI\n                    (collectively, “the Companies”) were carried out by\n                JHTI. 3       JTIC’s business activities were financed\n                    by loans from Rabobank and other banks (“Creditor Banks”), which\n                    included ABN AMRO Bank NV (“ABN-AMRO”), Bank of Tokyo-Mitsubishi\n                    UFJ (“BTMU”), KBC Bank NV (“KBC”), DBS Bank Ltd\n                    (“DBS”), Malayan Banking Berhad (“Maybank”),\n                    Oversea-Chinese Banking Corporation Ltd (“OCBC”), RHB Bank Berhad\n                    (“RHB”) and United Overseas Bank Ltd (“UOB”). All\n                    the bank facilities, including those granted by Rabobank to the Companies, were\n                    unsecured, but each Creditor Bank was given a negative pledge and apari passuundertaking. Except for BTMU, Maybank and\n                    RHB, which had granted facilities solely to JTIC, all the other Creditor Banks\n                    granted facilities to the Companies jointly and severally. 4       Rabobank was not the first Creditor Bank to\n                    grant facilities to the Companies. When it first offered credit facilities to\n                    the Companies, initially of up to US$13m to JTIC in September 2004, the\n                    Companies had already given their existing Creditor Banks negative charges andpari passuundertakings with respect to the\n                    unsecured facilities. Rabobank agreed to grant facilities on the same terms.\n                    Additionally, Rabobank also granted receivables financing of up to US$20m under\n                    a Master Receivables Purchase Agreement on 15 February 2007 (“the\n                    MRPA”). 5       When Ms Joyce Lin Li Fang\n                    (“Ms Lin”), a founding member of JTIC and a director since\n                    26 April 1986, and also a director of JHTI since 26 August 2003, was\n                    appointed Chairman of JTIC in March 2006, she began to be concerned with the\n                    level of the Companies’ debts to the Creditor Banks. Sometime in April or\n                    May 2008, Ms Lin made a presentation to DBS of the Companies’\n                    financial position and told DBS that some of the Companies’ assets could\n                    be “monetised”,ie, sold, to reduce\n                    the Companies’ loans. These assets included the Companies’ EMS\n                    business, shares in MAP Technology Holdings Limited (“MAP”) and\n                    shares in Min Aik Technology Co Ltd (“the Min Aik Shares”). From\n                    September 2008 to November 2008, the other Creditor Banks, including Sumitomo\n                    Mitsui Banking Corporation, were also informed of the possible sale of these\n                    assets. 6       By 30 June 2008, the Companies’ total\n                    borrowings had reached the level of S$340m, of which about S$87m was owing to\n                    DBS, S$70m to UOB, S$60m to OCBC and the remainder to the other Creditor Banks.\n                    In July 2008, JHTI deposited with ABN-AMRO at its request 18.6m of the MAP\n                    shares which it (JHTI) held. They were subsequently released to JHTI for\n                    conversion into scripless shares. JHTI acquired more MAP shares, bringing its\n                    total investment to 74,411,620 MAP shares (slightly below 20% of the paid-up\n                    capital of MAP). Between August and October 2008, ABN-AMRO requested that the\n                    74,411,620 MAP shares (“the MAP Shares”) be put in a custodian\n                    account with it. The October 2008 request was made as a “non-negotiable\n                    condition” for ABN-AMRO to refrain from recalling its facilities. JHTI\n                    refused to do so for the reason that, as stated by Dr Chung Siang Joon\n                    (“Dr Chung”), JTIC’s executive director of finance,\n                    “this can trigger off and become a risk factor should the other\n                    [Creditor] Banks come to learn about it”. He pleaded for support:\n                    “I do hope you can understand my difficulty and obligation to the other\n                    [Creditor] Banks”. 7       From September 2008 onwards, the Companies\n                    encountered significant financial difficulties, due primarily to the global\n                    recession and credit crunch, which had resulted in reduced orders from their\n                    customers. During this period, the Companies’ trade creditors were chasing\n                    for payment of their debts, and so were all the Creditor Banks. The Companies\n                    could only make payments in the ordinary course of business from trade\n                    receivables or by drawing on credit lines. The Companies continued to promise\n                    the Creditor Banks that they would pay their loans and facilities from the\n                    proceeds of sale of the MAP Shares, the Min Aik Shares and the EMS business.\n                    Although the Companies were defaulting in the payment of debts due to the\n                    Creditor Banks, they continued to roll over the debts. The Creditor Banks really\n                    had no choice but to wait for the Companies to sell their assets in order to pay\n                    their debts to the Creditor Banks. 8       On 11 September 2008, Rabobank requested\n                    that the Companies reduce the amount of invoices sent for discounting to avoid\n                    exceeding the MRPA’s limit of US$20m. On 22 September 2008,\n                    Rabobank’s relationship manager, Mr Richard Lee Seow Hong\n                    (“Mr Lee”), informed Ms Lin that the bank wished to exit\n                    from financing non-core markets (ie, the\n                    telecommunications and electronics sectors) and to end its relationship with the\n                    Companies in an orderly fashion. Ms Lin then requested that Rabobank reduce\n                    or cancel the banking facilities gradually and allow the Companies to pay\n                    according to the maturity dates of those facilities. After the limit was reached\n                    by the end of September 2008, no further invoices were sent to Rabobank for\n                    discounting. 9       The Companies first defaulted on their\n                    facilities with Rabobank on 7 October 2008, when they failed to pay over\n                    receivables that were due to be paid by Motorola Electronics\n                    (“Motorola”) to JHTI on that date. Besides this, JHTI failed to\n                    make payment on other amounts, including invoices under the MRPA facility and\n                    trade bills which had fallen due for payment in early October 2008. When the\n                    Companies failed to settle trust receipts which were due on 16 October\n                    2008, Rabobank force-debited JHTI’s current account, causing it to be\n                    overdrawn. 10     Sometime in November 2008, Mr Lee asked\n                    Ms Lin whether the MAP Shares could be placed in an escrow account with\n                    Rabobank, but Ms Lin said that this could not be done and that the loans\n                    due to Rabobank could be repaid instead from the sale proceeds of the Min Aik\n                    Shares. Later that month, Mr Lee told Ms Lin that Rabobank wanted the\n                    Min Aik Shares to be placed in an escrow account with it to ensure that the sale\n                    proceeds of those shares would be paid to it. 11     On 17 November 2008, Rabobank demanded\n                    from JHTI payment of the unpaid receivables under the MRPA facility. On\n                    25 November 2008, Ms Lin signed and issued a letter of undertaking to\n                    set up an escrow account with Rabobank to hold the Min Aik Shares and to credit\n                    the sale proceeds of the Min Aik Shares directly to the escrow account. However,\n                    the escrow account was not set up, nor were the Min Aik Shares deposited with\n                    Rabobank. In November and December 2008, Mr Lee sent numerous e-mails and\n                    made various telephone calls to the Companies’ officers to ask them to\n                    sell the Min Aik Shares and remit the proceeds to Rabobank. There were also\n                    meetings between Rabobank and the Companies where the bank made the same\n                    demands. 12     On 14 October 2008 JTIC signed a\n                    non-binding term sheet with Global Emerging Markets (“GEM”) to\n                    sell part of JTIC’s EMS business (“the GEM Deal”). The\n                    announcement made by JTIC the next day on the Singapore Exchange was as\n                    follows: The Board of Directors of [JTIC] wishes to announce that [JTIC] has\n                        received and signed a non-binding term sheet with [GEM] … pursuant to\n                        which GEM, together with various investors … have proposed the\n                        formation of a special purpose vehicle… to acquire a significant\n                        interest in selected electronic manufacturing services businesses and assets\n                        … for cash consideration. Shareholders should note that the Proposed Disposal will be subject to,inter alia, the negotiation and execution\n                        of definitive agreements and the conduct of a due diligence ... The Creditor Banks were informed that the GEM Deal could bring in as\n                    much as US$160m. Two officers from GEM had visited Singapore in October 2008 to\n                    evaluate the deal, and KPMG was to conduct the necessary due diligence in\n                    January 2009. 13     During this period, the Companies were in\n                    default in paying certain short-term loans given by DBS, which continuously\n                    pressed for payment by the deadline of 14 November 2008 from the proceeds\n                    of sale of the MAP Shares, as Ms Lin had promised. On 13 November\n                    2008, at a meeting with DBS, Ms Lin signed a security document which\n                    created a charge on the MAP Shares in favour of DBS (“the\n                    Charge”). The security document was fully executed on 17 November\n                    2008. The validity of the Charge as an unfair preference has been considered in\n                    the judgment of the High Court reported inTam Chee Chong and\n                        another v DBS Bank Ltd[2011] 2 SLR 310 and the judgment of\n                    this court in Civil Appeal No 230 of 2010 (seeDBS Bank\n                        Ltd v Tam Chee Chong and another (judicial managers of Jurong Hi-Tech\n                        Industries Pte Ltd (under judicial management))[2011] SGCA 47\n                        (“DBS Bank v Tam Chee\n                    Chong”)). 14     On 8 December 2008, JTIC made a public\n                    announcement that its audit committee had commenced an investigation into\n                    alleged irregularities in the administration of the receivables financing\n                    facilities extended by Rabobank and OCBC to the Companies. On 9 December\n                    2008, KordaMentha Pte Ltd, JTIC’s financial advisers, called a meeting of\n                    all the Creditor Banks and informed them of JTIC’s outstanding debts. On\n                    10 December 2008, DBS registered the particulars of the Charge with the\n                    Accounting and Corporate Regulatory Authority. By the end of December 2008, the\n                    Companies had received letters of demand from KBC (on 7 November 2008),\n                    Maybank (on 2 and 22 December 2008), ABN-AMRO (on 18 December 2008),\n                    OCBC (on 26 December 2008) and BTMU (on 29 December 2008).\n                    Additionally, the Companies had also received letters of demand from their trade\n                    creditors, some of whom had filed actions in court as early as 12 December\n                    2008 to recover their debts. 15     In the meantime, JTIC was making preparations\n                    to sell the Min Aik Shares, the proceeds of which Rabobank continued to make\n                    demands for. On 17 December 2008, Rabobank sent a letter to the Companies\n                    which demanded the payment of US$2m and S$0.8m within five business days, and\n                    reserved the right to demand payment of other debts of US$12.3m and S$10.9m. On\n                    the same day, Mr Lee continued to press for the immediate sale of the Min\n                    Aik Shares. On 18 December 2008 and 7 January 2009, JTIC sold the Min\n                    Aik Shares for a total of US$2,819,093.03, part of which,ie, the Payment, was remitted to Rabobank on 22 December\n                    2008 in two tranches. By way of a letter dated 26 December 2008, Rabobank\n                    informed JTIC that the Payment had been set off against the moneys due and owing\n                    by the latter. 16     On 19 January 2009, DBS applied to court\n                    to place JHTI under judicial management. Subsequently, four Creditor Banks (not\n                    including Rabobank) applied to court on 3 February 2009 to place JTIC under\n                    judicial management. These applications were granted by the Judge on\n                    20 February 2009. 17     On 29 June 2009, JTIC applied to recover\n                    the Payment from Rabobank on the ground that it was an undue preference under\n                    s 227T of the CA, read with s 99 of the BA. 18     JTIC’s case was that it had been\n                    influenced in deciding to make the Payment to Rabobank by a desire to produce\n                    the effect of putting Rabobank in a position which, in the event of JTIC’s\n                    insolvency, would be better than the position that Rabobank would have been in\n                    if the Payment had not been made. 19     Rabobank took the position that: (a)     JTIC did not possess the requisite\n                        state of mind envisaged under the unfair preference regime as it did not\n                        know that it was actually or imminently insolvent at the material\n                        time. (b)     JTIC had\n                        not proved that it had, at the material time, the requisite desire to\n                        improve Rabobank’s position in the event of its (JTIC’s)\n                        insolvency. Furthermore, even if JTIC had possessed the requisite desire,\n                        this desire was not operative in its mind in making the decision to make the\n                        Payment; rather, the Payment was made in response to the commercial pressure\n                        exerted by Rabobank on JTIC’s management for the repayment of its\n                        facilities. 20     In a reserved judgment delivered on\n                    9 December 2010 (ie, the GD), the Judge\n                    allowed JTIC’s application, holding that: (a)     the Payment was an unfair preference\n                        under s 227T of the CA, read with s 99 of the BA\n                        (“Finding (a)”); (b)     JTIC was insolvent on the basis of the balance sheet test\n                        and the liquidity test at the time when it made the Payment;\n                    and (c)     JTIC’s\n                        directors knew that the company was facing imminent liquidation by\n                        22 December 2008 (the date on which the Payment was made) as it had\n                        already received letters of demand from KBC, Maybank, ABN-AMRO and various\n                        trade creditors, which letters of demand had not been fully met\n                        (“Finding (c)”).",
        "The Judge’s findings": "21     In respect of Finding (a), the Judge said\n                    at [41]–[44] of the GD: 41    It was Ms Lin’s clear evidence given on\n                            behalf of [JTIC] that she had agreed to pay the proceeds of the sale of\n                            the Min Aik Shares to [Rabobank] as she had felt that [Rabobank] had\n                            been supportive of the Companies. Despite her initial concern that\n                            Rabobank would terminate the banking facilities extended to [JTIC] and\n                            demand immediate repayment, [Rabobank] had continued to finance the\n                            Companies and allowed for gradual reduction of the\n                        facilities. 42    Ms Lin’s subjective view that [Rabobank]\n                            had been supportive of the Companies is also objectively borne out by\n                            the surrounding circumstances. Despite the Companies’ defaults,\n                            [Rabobank] continued to invite the Companies to roll over the term loans\n                            and refrained from withdrawing the facilities, even assuring [JTIC] that\n                            it would exit the relationship gradually in an orderly and responsible\n                            fashion. According to [Mr] Lee’s evidence on\n                            cross-examination, the First Letter was either a\n                            “friendly” letter of demand, or even “not a letter\n                            of demand”. Even if [Rabobank] had indeed intended it to be a\n                            letter of demand, doubts were raised as to whether [JTIC] ever received\n                            it. Furthermore, when asked on cross-examination whether\n                            [Rabobank’s] conduct could reasonably be viewed as supportive,\n                            [Mr] Lee agreed that it could be so construed. 43    Not only was it clear that [Rabobank’s]\n                            treatment of [JTIC] in the midst of its financial difficulties was less\n                            threatening than the treatment by most of its other [Creditor Banks], it\n                            was also clear that [JTIC] had treated [Rabobank] more favourably. Even\n                            though the Companies had informed all their creditors in various\n                            presentations that they would be raising funds to repay or reduce their\n                            outstanding loans through the sale of the EMS business, the MAP Shares\n                            and the Min Aik Shares, [JTIC] chose to pay the proceeds from the sale\n                            of the Min Aik Shares to [Rabobank] alone. This is despite the fact that\n                            the other [Creditor Banks] were also pressing for repayment from the\n                            Companies. In fact, the other [Creditor Banks] had served formal letters\n                            of demand on [JTIC], threatening to cancel the facilities forthwith.\n                            Moreover, the knowledge that the payment of the sale proceeds of the Min\n                            Aik Shares to [Rabobank] would have caused [JTIC] to be in breach of its\n                            obligations under the negative pledge andpari\n                                passuclauses in the facilities with the other [Creditor\n                            Banks] did not deter [JTIC] from making the Payment. 44    All these indicate that the decision to make the\n                            Payment was influenced by [JTIC’s] subjective desire to prefer\n                            [Rabobank] in the event of the former’s insolvency by putting the\n                            latter in a better position than it would be in if the Payment was not\n                            made. [Rabobank] maintained, however, that whatever desire [JTIC] had to\n                            prefer [Rabobank] was vitiated by the pressure that it had placed on\n                            [JTIC] to repay. 22     On the question of whether JTIC’s desire\n                    to prefer Rabobank was vitiated by the pressure put on it by Rabobank, the Judge\n                    was of the view that commercial pressure could provide a good defence to a claim\n                    of unfair preference, but that (at [48]\n                    of the GD): 48    … in my view, there must be a limit to the\n                            defence of pressure exerted by creditors. InInsolvencyvol 2 (Peter Totty and Gabriel\n                            Moss QC ed) (Sweet & Maxwell, Looseleaf Ed, 1986, August 2008\n                            release) at para H4-08, it was suggested that the limit is provided\n                            by a reference to commercial purpose. Thus, in circumstances where the\n                            directors of a debtor company bow to creditor pressure in order to act\n                            in the commercial interests of the company as a viable going concern,ie, for “proper commercial\n                            considerations” (seeRe [MC] Bacon... at 336 andRe Fairway Magazines Ltd; Fairbairn v\n                                Hartigan[1993] BCLC 643 at 649), the requisite desire\n                            will not be established.Conversely, if there is no\n                                commercial benefit to the company at all in paying any creditor,\n                                then the court should be extremely slow to find that pressure from\n                                the creditor is a defence to the claim of unfair\n                                preference. [emphasis added] 23     In respect of Finding (c), the Judge said\n                    at [32] of the GD: 32    ... In [Amrae Benchuan Trading\n                                Pte Ltd (in liquidation) v Tan Te Teck Gregory[2006]\n                            4 SLR(R) 969  ], Menon JC was of the view (at [56])\n                            that the lack of knowledge or expectation on the part of the\n                            company’s controllers that it would be wound up imminently,\n                            coupled with the fact that the impugned transaction had occurred\n                            “a little less than two years before a petition for the winding\n                            up of the plaintiff was in fact presented”,pointed away from the probabilitythat those making the\n                            payment were doing so with the relevant desire. In other words, lack of\n                            knowledge of the company’s imminent winding up could be one factor\n                            to be considered in deciding whether the statutory presumption has been\n                            rebutted. I find nothing in his judgment that makes knowledge of the\n                            company’s imminent winding up arequirementto be satisfied in order for an unfair\n                            preference to be made out. If, however, that was the intended effect of\n                            Menon JC’s judgment, I respectfully differ. [emphasis in\n                            original]",
        "The law on unfair preference": "24     Before we consider the parties’\n                    arguments on the issues canvassed in this appeal, we set out below the\n                    principles of law applicable to unfair preferences under s 227T of the CA,\n                    read with s 99 of the BA, which we have summarised in our judgment inDBS Bank v Tam Chee Chong. These principles\n                    restate the law as enunciated by Millett J inRe MC\n                        Bacon Ltd[1990] BCLC 324 (“MC\n                        Bacon”), a judgment which has been approved and followed\n                    in a number of decisions of the Singapore courts. They are as follows: (a)     The test is not whether there is a\n                        dominant intention to prefer, but whether the debtor’s decision was\n                        influenced by a desire to prefer the creditor. (b)     The court will look at the desire (a subjective\n                        state of mind) of the debtor to determine whether it had positively wished\n                        to improve the creditor’s position in the event of its own solvent\n                        liquidation. (c)     The requisite desire may be proved by direct evidence or its existence may\n                        be inferred from the existing circumstances of the case. (d)     It is sufficient that the desire to\n                        prefer is one of the factors which influenced the decision to enter into the\n                        transaction; it need not be the sole or decisive factor. (e)     A transaction which is actuated by\n                        proper commercial considerations may not constitute a voidable preference. A\n                        genuine belief in the existence of a proper commercial consideration may be\n                        sufficient even if, objectively, such a belief might not be\n                        sustainable. 25     In this appeal, Rabobank has not raised the\n                    issue as to whether an unfair preference is a void, as distinguished from a\n                    voidable, transaction under s 227T(1) of the CA: see s 329 of the CA.\n                    We assume that this omission was a deliberate decision by reason of the fact\n                    that the former Bankruptcy Act (Cap 20, 1985 Rev Ed), which had\n                    created such a distinction, was repealed on 15 July 1995 by the new\n                    Bankruptcy Act No 15 of 1995 on the same day that the then equivalent of\n                    s 329 of the CA was amended to refer expressly to,inter\n                        alia, the then equivalent of s 99 of the BA. In other words,\n                    the retention of the distinction in s 329 between a void transaction and a\n                    voidable one was a drafting oversight (see the apt comments of Lim Teong\n                    Qwee JC inBuildspeed Construction Pte Ltd (in\n                        liquidation) v Theme Corp Pte Ltd and another[2000]\n                    1 SLR(R) 287 at [50]–[52] and\n                    also our decision inDBS Bank v Tam Chee Chongat\n                        [15]–[17]).",
        "The issues in this appeal": "26     The main issue in this appeal is whether the\n                    finding of the Judge that JTIC, in deciding to make or in making the Payment,\n                    was influenced by the desire to prefer Rabobank to the other Creditor Banks is\n                    correct. The sub-issues arising in this appeal are: (a)     whether the Judge erred in holding\n                        that JTIC was not required to prove that its controllers had knowledge of\n                        its actual or imminent insolvency at the material time\n                        (“Sub-Issue (a)”); (b)     whether the time at which the existence and influence of\n                        the requisite desire is to be determined is the time when the alleged\n                        preference was actually granted, or the time when the decision to grant the\n                        alleged preference was made (“Sub-Issue (b)”);\n                    and (c)     whether the\n                        Judge erred in holding that JTIC was influenced by the requisite desire in\n                        deciding to make the Payment to Rabobank when the preponderance of evidence\n                        showed that Rabobank had applied pressure on JTIC to repay its facilities\n                        (“Sub-Issue (c)”).",
        "Our decision on the sub-issues raised in this appeal": "27     We shall consider, first, the sub-issues of\n                    law (ie, Sub-Issue (a) and\n                    Sub-Issue (b)) for the reason that it is Rabobank’s case that its\n                    submissions on these sub-issues, if accepted by this court, would negative any\n                    argument by JTIC that it had, at the material time, the desire to prefer\n                    Rabobank, which decision had influenced its decision to make or its making of\n                    the Payment.",
        "Sub-Issue (a): Knowledge of the prospect of insolvency": "Whether it is a legal requirement 28     Rabobank’s argument before this court on\n                    Sub-Issue (a) is a reiteration of the argument which the Judge rejected.\n                    The argument is that knowledge by the company giving the alleged preference\n                    (referred to hereafter as “the debtor” for convenience) of its\n                    impending or actual insolvency at the material time is a legal requirement which\n                    must be established in all claims of unfair preference by reason of the phrase\n                    “in the event of the [debtor’s insolvency]” in\n                        s 99(3)(b) of the BA. According to\n                    Rabobank, s 99(4), read together with s 99(3)(b), requires that the decision to enter into the transaction\n                    must have been influenced by a desire to produce the relevant effect. It is\n                    argued that the rationale is that knowledge of the debtor’s impending or\n                    actual insolvency will apprise the debtor’s directors that because of the\n                    insufficiency of the debtor’s assets, the effect of the transaction would\n                    be to prefer the creditor. Reference was made to the decisions inRe Beacon Leisure Ltd[1992] BCLC 565 andAmrae Benchuan Trading Pte Ltd (in liquidation) v Tan Te Teck\n                        Gregory[2006] 4 SLR(R) 969, where the lack of knowledge of\n                    the debtor’s directors was the key reason, or one of the reasons, for the\n                    court’s finding that the statutory presumption of a desire to prefer had\n                    been rebutted. 29     Counsel for Rabobank also contends that the\n                    trilogy of cases relied on by the Judge,viz,Katz & Ors v McNally & Ors[1999] BCC\n                    291,Wills and another v Corfe Joinery Ltd (in\n                        liq)[1998] 2 BCLC 75 (“Wills v\n                        Corfe Joinery”) andRe Libra Industries\n                        Pte Ltd (in compulsory liquidation)[1999] 3 SLR(R) 205, are\n                    distinguishable in that they involved the operation of the statutory presumption\n                    of a desire to prefer; therefore, proof of knowledge on the part of the debtor\n                    would have been unnecessary in those cases. Counsel pointed out that in the two\n                    cases which did not involve associates (and which therefore did not involve the\n                    aforesaid statutory presumption),viz,Re Living Images Ltd[1996] BCC 112 andRe Agriplant Services Ltd[1997] BCC 842 (which the\n                    Judge also cited), it was held that the debtor’s knowledge of its imminent\n                    insolvency was “instrumental” in proving the requisite\n                    desire. 30     This argument was rejected by the Judge at the\n                    following passages of the GD: 33    ... To my mind, Wright QC inRe Beacon Leisuremerely found that the\n                            statutory presumption had been rebutted by the directors’ denials,\n                            backed by their lack of knowledge of the debtor company’s imminent\n                            winding up, that they had the relevant desire. There was no necessity\n                            for the learned deputy judge to make a positive finding that the\n                            directors knew of their company’s imminent winding up because the\n                            requisite desire had been presumed against them. To my mind, bothRe Beacon LeisureandAmrae Benchuan... are examples of how the lack\n                            of knowledge of the debtor company’s insolvent state of affairs is\n                            one of the factors that should be considered in deciding whether the\n                            statutory presumption under s 99(5) has been rebutted, but the\n                            converse proposition, that knowledge of the company’s winding up\n                            is required before unfair preference is made out, hasnotbeen laid down as a rule by the\n                        courts. … 36    … In my judgment, to require the judicial\n                            manager to prove that the company’s controllers must have known\n                            that the company was insolvent or imminently insolvent at the material\n                            time before a transaction can be avoided as an unfair preference would\n                            place too onerous a burden on the judicial manager. 37    Indeed, the English Court of Appeal inKatz & Ors v McNally & Ors[1999] BCC\n                            291 made it clear (at 296) that it is “not necessary to establish\n                            that the directors of the company knew or believed that it was\n                            insolvent” in order to prove unfair preference. It is sufficient\n                            that the directors were influenced by the desire to put the creditor\n                            into a position “which in the event of the company going into\n                            insolvent liquidation” would be a better position than if no\n                            payment was made. In another English case,Wills and\n                                another v Corfe Joinery Ltd (in liq)[1998] 2 BCLC\n                            75, Lloyd J held (at 79) that it is not necessary, in order to show\n                            such desire, to demonstrate that the directors knew that the company\n                            would go into insolvent liquidation, or when it would do so.\n                            Lloyd J’s judgment was cited with approval by Kan Ting\n                            Chiu J inRe Libra Industries Pte Ltd[1999] 3 SLR(R) 205 at [43]. [emphasis in original] 31     We agree with the Judge’s view as set\n                    out at [36]–[37] of the GD and disagree with\n                    counsel’s argument. The decisions involving the statutory presumption\n                    cited by Rabobank are relevant in the present context. As pointed out by counsel\n                    for JTIC, the statutory presumption merely reverses the burden of proof and does\n                    not alter the substantive elements of a claim of unfair preference. In our view,\n                    as was pointed out by Lee Eng Beng in “The Avoidance Provisions of\n                    the Bankruptcy Act 1995 and their Application to Companies” (1995) SJLS\n                    597 at p 616, a literal interpretation of s 99(4) of the BA provides\n                    that “the desire to prefer relates to the producing of the effect of a\n                    preference and has nothing to do with knowledge of one’s own\n                    insolvency”. In other words, s 99(4) only requires that there must\n                    be a desire on the debtor’s part to improve the creditor’sabsolutepositionat the time the\n                        preference is granted(which would be the case if,eg, the creditor obtains cash payment or a security\n                    interest – from that point onwards, he is better off, regardless of what\n                    happens afterwards to the debtor). Relevance of knowledge of insolvency 32     In our view, the critical question for the\n                    court is whether or not the relevant desire existed and influenced the\n                    debtor’s decision to enter into the impugned transaction. An inference of\n                    the requisite desire should not be drawn too readily from thepresenceof knowledge of insolvency because such knowledgein itselfwill not be sufficient to support\n                    that inference, given that desire is subjective in nature: seeMC Baconat 335E–336A. However, it is also\n                    possible that the relevant desire existed and influenced the debtor’s\n                    decision despite the lack of actual knowledge,eg,\n                    where the desire was to improve the creditor’sabsolutepositionat the time that the\n                        preference was granted. As Lloyd J pointed out inRe Conegrade Ltd[2003] BPIR 358 at 372H, if the debtor\n                    did desire a particular result, it matters not that it thought that bankruptcy\n                    was a remote risk.",
        "Sub-Issue (b): The material time to determine the influence of\n                the requisite desire": "33Vis-à-visSub-Issue (b), Rabobank has argued that the relevant time to determine the\n                    existence of a desire to prefer which influenced the debtor’s decision is\n                    either the time when the decision to give the alleged preference was made (which\n                    would be 25 November 2008 in the present case) or the time when the alleged\n                    preference was actually given (which would be 22 December 2008 in the\n                    present case). Rabobank does not take a view as to which should be the correct\n                    time for the purposes of s 99(4) of the BA as its argument is that there\n                    was no requisite desire on either date. With respect to 25 November 2008,\n                    the only Creditor Bank which had served a letter of demand as at that date was\n                    KBC (which received US$1m subsequent to the demand). With respect to\n                    22 December 2008, JTIC’s balance sheet as at 30 September 2008\n                    and 31 December 2008 clearly showed that JTIC was solvent then, and its\n                    directors had signed solvency statements to that effect. Furthermore, it is\n                    argued, the GEM Deal was still in the pipeline at that time and was envisaged to\n                    fetch US$160m. 34     In our view, as a general principle, the\n                    relevant time to determine whether a debtor had the requisite desire to prefer\n                    is the time when the creditor received the preference, and not when it was\n                    promised the preference. In the case of a promise or commitment to pay money, it\n                    is the time of payment that is material. The reason is that the debtor may\n                    change its mind at any time prior to making payment. In the case of a promise or\n                    commitment to create a security, it is the time of the creation (or the first\n                    act of creation,eg, Ms Lin signing the\n                    security document which created the Charge in the case ofDBS\n                        Bank v Tam Chee Chong) of the security that is relevant, unless\n                    the execution of the security is done pursuant to a prior promise or commitment\n                    to do so. InMC Bacon, Millett J held (at\n                    336E) that the relevant time was the time when the decision to create the\n                    debenture in issue in that case was made (and not the time when the debenture\n                    was actually created). However, he also said that on the facts, it did not\n                    matter which point in time was taken as the relevant time because if “the\n                    requisite desire was operating at all, it was operating throughout”,ie, from the time of the agreement to create\n                    the debenture to the time of the execution of the debenture. InRe Fairway Magazines Ltd; Fairbairn v Hartigan[1993]\n                    BCLC 643 (“Re Fairway Magazines”) at\n                    649H, Mummery J accepted Millett J’s proposition. InWills v Corfe Joinery, Lloyd J held (at\n                    77G–78C) that the relevant date for considering the mental state of the\n                    debtor was the date on which the preference was actually granted because that\n                    was the effective time when the decision to prefer was made. In our view, it\n                    stands to reason that the critical time cannot be the time when the decision to\n                    prefer was made unless the desire operates throughout (as inMC Bacon). In a case where the debtor’s liquidator or\n                    judicial managers may not be able to prove the requisite desire on the date of\n                    the decision to give a preference, there is no reason why they are prevented by\n                    the terms of s 99 of the BA from proving the existence of the requisite\n                    desire at the date when the preference was actually granted. That will be\n                    sufficient to establish this element of an unfair preference. In the present\n                    case, the Payment was promised on 25 November 2008, but actually made on\n                    22 December 2008.",
        "Sub-Issue (c): The commercial pressure exerted by Rabobank on\n                JTIC": "35     Rabobank’s submission on\n                    Sub-Issue (c) is that the courts have accepted that a crucial factor which\n                    shows that the debtor was not influenced by a desire to prefer is commercial\n                    pressure. The greater the pressure (eg, if it is\n                    backed by a threat to take action which might jeopardise the survival of the\n                    debtor), the less likelihood there is of a desire to prefer. The rationale is\n                    that the giving of a preference predicates an act of free will and pressure\n                    negates free will. Reference was made to para 1256 of the Report of the\n                    Review Committee on Insolvency Law and Practice (Cmnd 8558, 1982) (which\n                    recommended the abolition of the requirement of a dominant intention to prefer),\n                    which stated that genuine pressure by a creditor should continue to afford a\n                    defence to a preference claim on the practical basis that “[t]he creditor\n                    who is active to obtain payment of his own debt ought in principle to be allowed\n                    to retain the fruits of his diligence. He ought not to be made to refund them\n                    for the benefit of others who were less diligent”. 36     The Judge did not disagree with these\n                    statements as, at [46]–[47] of the GD, he said: 46    That is not to say\n                            that commercial pressure will never provide a good defence to a claim of\n                            unfair preference. Since Lord Mansfield’s judgment inThompson and Others, Assignees of Jane Wiseman v\n                                Freeman(1786) [1 TR 155;] 99 ER 1026 where his\n                            Lordship held (at [157;] 1028) that: A bankrupt when in contemplation of his bankruptcy cannot by his\n                            voluntary act favour any one creditor; but if under fear of legal\n                            process he gives a preference, it is evidence that he does not do it\n                            voluntarily. It has been a principle of English law that preferential transactions\n                        entered into because of pressure will not be set aside. InRe [MC] Bacon..., Millett J found (at 337)\n                        that the debtor company’s decision to grant a debenture to its bank\n                        creditor had been made as part of the directors’ decision to\n                        “continue trading in a genuine belief that the company could be\n                        pulled round” and they had “no choice but to accede to the\n                        bank's request for a debenture”. InRe\n                            Ledingham-Smith (a bankrupt), ex parte the trustee of the bankrupt v\n                            Pannell Kerr Forster (a firm)[1993] BCLC 635, Morritt J\n                        held (at 642) that “[i]t may be that pressure does not displace\n                        desire in the way that it formerly displaced a dominant intention to prefer\n                        but it can certainly affect the question of desire”. 47    In Andrew\n                            R Keay,McPherson’s Law of Company\n                                Liquidation(Sweet & Maxwell, 2nd Ed, 2009)\n                            …, it is explained (at para 11.035) that: The reason why pressure prevents a transfer from being a voidable\n                            preference is that a preference predicates an act of free will and\n                            pressure negatives free will. It has been held that as long as pressure\n                            is genuine and not fraudulent then no transfer can be regarded as a\n                            preference. It could be said that if there is pressure then the debtor\n                            company, in granting a preference, could not have been influenced by a\n                            desire to benefit the creditor. ... 37     Accordingly, it seems to us that what Rabobank\n                    is contending here is that the commercial pressure in the present case was so\n                    overwhelming or preponderant that the Judge should have inferred that JTIC could\n                    not and did not have the requisite desire to prefer Rabobank. This is, however,\n                    a question of fact, in respect of which the Judge has found against Rabobank on\n                    the evidence before him, particularly, the testimony of Ms Lin that she\n                    wanted JTIC to make the Payment because Rabobank had been good to the Companies.\n                    We shall consider this issue later to determine whether the Judge was wrong in\n                    making this finding of fact. 38     Rabobank has also submitted that the Judge was\n                    wrong in law to have held (at [48] of\n                    the GD) that there must be a limit to the defence of pressure exerted by\n                    creditors, and that that limit is provided by reference to commercial purpose.\n                    It is submitted that a commercial purpose (or a good commercial reason) would be\n                    a sufficient, but not a necessary, condition to rebut a desire to prefer. We\n                    agree with this submission. However, in our view, the Judge’s view is also\n                    the same. All that the Judge meant by his statement (at [48] of the GD) that there must be a limit to\n                    the defence of pressure by creditors is that, in his own words, “if there\n                    is no commercial benefit to the [debtor] at all in paying any creditor, then the\n                    court should be extremely slow to find that pressure from the creditor is a\n                    defence to the claim of unfair preference” (see [48] of the GD (reproduced at[22]above)). 39     In the present case, although the Judge found\n                    as a fact that the Payment was not made for proper commercial considerations, he\n                    did not hold that that was,ipso facto, sufficient\n                    to show that JTIC had the desire to prefer Rabobank to the other Creditor\n                    Banks. Whether the Payment was influenced by the requisite desire to\n                prefer 40     Rabobank submits that the pressure which it\n                    put on JTIC to repay its facilities was preponderant. By the time the Payment\n                    was made on 22 December 2008, Rabobank’s general manager in Singapore\n                    and its regional head of Telecommunications, Media and Internet had both become\n                    personally involved in applying pressure on Ms Lin to obtain repayment.\n                    Furthermore, Rabobank had discovered irregularities in the way in which the\n                    Companies had conducted business in relation to the set-off arrangements between\n                    JHTI and Motorola, and the double-financing of the receivables by Rabobank and\n                    OCBC. The GEM Deal was still on and the Companies expected to obtain US$160m,\n                    enough to pay about two-thirds of the Companies’ debts to all the Creditor\n                    Banks. Ms Lin had no reason to expect that the GEM Deal would fall through\n                    or that the Companies’ insolvency was inevitable. The Companies owed\n                    Rabobank about S$40m, and Ms Lin agreed that JTIC would make the Payment to\n                    forestall any drastic action and to avoid scuttling the GEM Deal. Ms Lin\n                    became personally involved in ensuring that the Min Aik Shares were sold\n                    promptly and that the sale proceeds were transmitted to Rabobank. Rabobank had\n                    definitely put pressure on the Companies as it had sent letters of demand on\n                    13 November 2008 and 17 December 2008 to demand repayment of its\n                    loans. 41     We agree with Rabobank’s submission that\n                    it did put pressure on the Companies to repay their loans. But, so did the\n                    following other Creditor Banks, which had issued letters of demand to the\n                    Companies before 22 December 2008,viz,\n                    (a) KBC (on 7 November 2008 for US$12.3m and S$2m to be paid by\n                    11 November 2008); (b) Maybank (on,inter\n                        alia, 2 December 2008 for S$15.25m to be paid by\n                    16 December 2008); and (c) ABN-AMRO (on 18 December 2008 for\n                    S$17.75m to be paid by 20 December 2008). Furthermore, by 22 December\n                    2008, the Creditor Banks, including Rabobank, would have known that DBS had\n                    obtained a charge over the MAP Shares (ie, the\n                    Charge as defined at[13]above) to secure\n                    the Companies’ debts to it in breach of the Companies’ negative\n                    pledges, and Ms Lin would not have expected the Creditor Banks not to do\n                    anything and to allow the Companies to continue to carry on business as usual.\n                    It was in those circumstances that Ms Lin directed that the proceeds of\n                    sale of the Min Aik Shares be paid to Rabobank to honour her earlier agreement\n                    on 25 November 2008 to do so. 42     During this period,viz, from 25 November 2008 to 22 December 2008, the\n                    great pressure put on JTIC to sell the Min Aik Shares and pay the proceeds to\n                    Rabobank, as Ms Lin had earlier agreed JTIC would do, would have been much\n                    attenuated by the fact that so many other Creditor Banks were also demanding\n                    payment of their debts. Any expectation that Ms Lin had that the Payment\n                    would save the Companies was probably unrealistic. Just as in the case of DBS,\n                    Ms Lin wanted to honour her promise to Rabobank that JTIC would pay the\n                    proceeds of sale of the Min Aik Shares to Rabobank. She did honour her promise,\n                    but, at the same time, she consistently said that JTIC made the Payment to\n                    Rabobank because the latter had been very supportive of the Companies in giving\n                    them indulgence after indulgence to pay their long overdue debts. 43     The Judge found as a fact that JTIC did have a\n                    desire to prefer Rabobank because the latter had been supportive of the\n                    Companies, and that this was partly why Ms Lin agreed that JTIC would pay,\n                    and did cause JTIC to pay, the proceeds of sale of the Min Aik Shares to\n                    Rabobank. The Judge did not find that Rabobank did not put any pressure on JTIC\n                    because, clearly, the bank did; but, at no time did Rabobank actually threaten\n                    to recall all its facilities if JTIC did not agree to sell the Min Aik Shares\n                    and pay the proceeds to the former. What the Judge found was that other Creditor\n                    Banks had put equal or even greater pressure on the Companies and, yet, JTIC had\n                    paid the proceeds of sale of the Min Aik Shares to Rabobank despite promising to\n                    monetise the Companies’ assets (including the Min Aik Shares) to pay all\n                    the Creditor Banks. The Judge held that these circumstances were inferential\n                    evidence that JTIC had desired to prefer Rabobank, and that this inference was\n                    consistent with the direct evidence of Ms Lin, which he\n                accepted. 44     The Judge’s findings suggest that he\n                    applied the principle that so long as there is some evidence that a debtor had\n                    the requisite desire to prefer, even though it was under some or great pressure\n                    from a creditor to pay its debts, the influence of such desire is sufficient to\n                    support a claim of unfair preference under s 99 of the BA. If the preferred\n                    creditor is unable to show that its commercial pressure was overwhelming or that\n                    the commercial pressure was “proper”, in the sense that it had\n                    some value to the debtor (or that the debtor believed that it had some value to\n                    it), then such pressure cannot negate the requisite desire, even though the\n                    desire may, relatively speaking, be weaker than the pressure. 45     We accept this principle. InRe Fairway Magazines, Mummery J said (at\n                    649G–H): “If a desire to prefer is present, however, it is\n                    sufficient that it influences the decision. It does not have to be the sole or\n                    decisive influence on the decision.” In our view, this was precisely the\n                    situation here. 46     Having regard to all the circumstances leading\n                    up to the Payment and, in particular, the Judge’s acceptance of\n                    Ms Lin’s testimony of JTIC’s desire to prefer Rabobank, we are\n                    of the opinion that there were insufficient grounds to overturn the\n                    Judge’s finding of fact that the making of the Payment was influenced by\n                    the requisite desire.",
        "Our observations on the negative pledges and thepari passuclauses": "47     In concluding our judgment inDBS Bank v Tam Chee Chong, we made some observations (at\n                        [48]–[54]) on the relevance of\n                    the negative pledges and thepari passuundertakings given by the Companies in proceedings by JHTI’s judicial\n                    managers to set aside the Charge on the basis that it was an unfair preference\n                    under s 227T of the CA, read with s 99 of the BA. Those observations\n                    are equally apt to apply to the present case as Rabobank was fully aware of the\n                    existence of both of these contractual terms, which bound JTIC not to prefer any\n                    one Creditor Bank to any other Creditor Bank in terms of giving security and\n                    repaying existing debts in circumstances where the Companies were insolvent and\n                    were facing imminent liquidation or the prospect of being put into judicial\n                    management. 48     However, in the present case, as no security\n                    was granted to Rabobank, only thepari passuundertaking would be engaged. In our view, for the reasons given inDBS Bank v Tam Chee Chong, any inducement by Rabobank of\n                    the breach of this undertaking by JTIC would likewise amount to an unlawful\n                    interference with the contractual rights of the other Creditor\n                Banks. 49     Hence, we cannot help but observe the irony in\n                    this case (an observation which we also made inDBS Bank v\n                        Tam Chee Chongat [55]), where, even if Rabobank had succeeded in\n                    defending the validity of the Payment on the ground that it was not an unfair\n                    preference, it might nonetheless have had to forego the benefits of the Payment\n                    under the overall contractual framework of thepari\n                        passuundertakings it had agreed with the Companies, in the light\n                    of the undertakings of the latter to the other Creditor Banks.",
        "Conclusion": "50     For the above reasons, the appeal is dismissed\n                    with costs and the usual consequential orders."
    }
}