{
    "case_title": "Norwest Holdings Pte Ltd (in liquidation)\n      v\n      Newport Mining Ltd and another appeal",
    "ncitation": "[2011] SGCA 42",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       These were appeals by both Norwest Holdings Pte\n                    Ltd (“Norwest”) and Newport Mining Ltd (“Newport”)\n                    (respectively, “CA 151/2009” and\n                    “CA 153/2009”) against the decision of the trial judge\n                    (“the Judge”) in Suit No 28 of 2009 (seeNorwest Holdings Pte Ltd (in liquidation) v Newport Mining Ltd[2010] 3 SLR 956 (“the GD”)) concerning the sale by the\n                    liquidator of Norwest of the entire share capital of its wholly-owned subsidiary\n                    Norwest Chemicals Pte Ltd (“Norwest Chemicals”) to Newport. The\n                    Judge dismissed Norwest’s claim for S$5.6475m as damages arising from\n                    Newport’s failure to complete the purchase of the shares and allowed\n                    Newport’s counterclaim for recovery of the S$102,500 deposit it had placed\n                    with Norwest. Norwest appealed against the entirety of the Judge’s\n                    decision whilst Newport appealed against the Judge’s specific finding that\n                    there was a binding contract between Newport and Norwest for the sale and\n                    purchase of the entire share capital of Norwest Chemicals (“the\n                    Shares”). 2       After hearing submissions from both parties, we\n                    were satisfied that there was no binding contract between Newport and Norwest\n                    and that Newport was therefore under no obligation to complete the purchase of\n                    the Shares. That being the case, we dismissed Norwest’s appeal in\n                    CA 151/2009 and allowed Newport’s appeal in CA 153/2009. Even\n                    though we arrived at the same result as the Judge below, we respectfully\n                    differed in terms of the reasoning. We now set out below the detailed grounds\n                    for our decision.",
        "The background facts": "3       Norwest is a company incorporated in Singapore.\n                    It was placed under compulsory liquidation on 11 January 2008 pursuant to\n                    an order of court. Mr Lai Seng Kwoon (“the Liquidator”) was\n                    appointed the sole liquidator of Norwest. 4       Norwest Chemicals is a wholly-owned subsidiary\n                    of Norwest. At the material time Norwest Chemicals owned 100% of the share\n                    capital of Sichuan Mianzhu Norwest Phosphate Chemical Company Limited\n                    (“Norwest China”), a company incorporated in the People’s\n                    Republic of China (“China”). Norwest China owns a 30,000 mtpa\n                        (ie, metric tonnes per annum) sodium and\n                    potassium phosphate production facility and a 6,000 mtpa facility for acid\n                    production located in the Sichuan province in China (“Production\n                    Facilities”) as well as the mining rights to two phosphate rock mines\n                    (“the Mines”) for a period up to 2015 (collectively referred to as\n                    the “Chinese Business”). 5       Newport is an Australian publicly listed company\n                    which was at the material time actively looking to acquire phosphate assets. In\n                    response to an information memorandum prepared by the Liquidator (“the\n                    Information Memorandum”) for the intended sale of the entire share\n                    capital of Norwest Chemicals, Taylor Collison Limited (“Taylor\n                    Collison”), acting as sharebrokers and investment advisers to Newport,\n                    indicated Newport’s interest in acquiring the Shares in a letter dated\n                    27 February 2008[note: 1]addressed to the\n                Liquidator. 6       The purpose of the Information\n                        Memorandum[note: 2]prepared by the Liquidator in\n                    relation to the proposed sale of the Shares was to inform interested buyers of\n                    the conditions of the proposed sale (on an “as is where is” basis)\n                    so that those interested buyers could submit an Expression of Interest and\n                    “non-binding offer” to the Liquidator and to allow the Liquidator\n                    to determine which parties would be involved in the second stage of due\n                    diligence in order to finalise the sale process. Interested buyers had to carry\n                    out independent investigations at their own expense and make their own\n                    independent assessment of the potential value of Norwest Chemicals. It was\n                    further stated in the Information Memorandum (at para 3.0) that the\n                    intention of the Liquidator was to sell Norwest Chemicals together with Norwest\n                    China in its “present state and condition on an ‘as is, where\n                    is’ basis and subject to a Sale and Purchase\n                        Agreement”.[note: 3] 7       The following timeline was provided for at\n                    para 3.1 of the Information Memorandum. As it contains several important\n                    pieces of information, it is reproduced in full as follows: ItemProposed\n                                                DeadlineiInterested parties to revert with an\n                                            Expression of Interest on [Norwest Chemicals] in the\n                                            format as appendixed hereto (See Appendix\n                                                A).[note: 4]6 April 2008iiLiquidator to inform shortlisted parties\n                                            of his intention to proceed with them to the due\n                                            diligence stage and to request them to confirm their\n                                            participation by submitting a refundable Cashier’s\n                                            Order equivalent to 1% of their proposed offer or\n                                            S$25,000, whichever is higher.15 April 2008iiiShortlisted parties to reply to the\n                                            Liquidator’s invitation to proceed to due\n                                            diligence stage by the remittance of arefundable cashier’s order amounting\n                                                to 1% of their proposed preliminary offeror S$25,000, whichever is higher. Shortlisted parties\n                                            are also required to submit a list of documents that\n                                            they would like to inspect at the due diligence\n                                            process.22 April 2008ivDue diligence in Singapore and\n                                            China.28 April 2008 – 11 May\n                                        2008vInterested parties to deliver to the\n                                            Liquidator a firm letter of offer in the format as\n                                            annexed hereto (see Appendix B).[note: 5]16 May 2008viLiquidator responds withacceptance subject to agreement on terms\n                                                and conditions. Negotiation and conclusion of Sale\n                                                and Purchase Agreement with successful\n                                                bidder.23 May 2008 – 3 June\n                                        2008viiTransfer of title in [Norwest Chemicals]\n                                            and close of sale.13 June 2008   [emphasis added] 8       In a letter dated 4 April 2008, Taylor\n                    Collison submitted an Expression of Interest (in the form of Appendix A to\n                    the Information Memorandum) to the Liquidator, making an offer of S$5.5m for the\n                    Shares on behalf of Newport. 9       On 2 May 2008, Newport submitted a Firm\n                    Letter of Offer (in the form of Appendix B to the Information Memorandum)\n                    (“First Firm Letter of Offer”), offering to purchase the Shares\n                    for S$10m. This was followed by a subsequent Firm Letter of Offer dated\n                    9 May 2008 (“Second Firm Letter of Offer”), increasing the\n                    offer to S$10.25m. The material portions of the Second Firm Letter of Offer read\n                    as follows: We have conducted our independent assessment of the available information\n                        and we hereby offer to purchase the shares held by you in [Norwest\n                        Chemicals] at Singapore Dollars10,250,000 (ten million\n                            two hundred and fifty thousand)subject to the terms and\n                        conditions in the Sale and Purchase Agreementto be\n                            negotiated. In the event our offer is accepted, we agree to the aforesaid purchase\n                        price and will pay the balance of the purchase price, less the\n                        Cashier’s Order of Singapore Dollars55,000 (fifty\n                            five thousand)that has been submitted to you, in accordance\n                        to the terms and conditions set out in the Sale and Purchase Agreementto be negotiated. This offer is irrevocable and is valid for a period of 45 days from\n                        2 May 2008. [emphasis added] The words in italics were added by Newport to the standard form set\n                    out in Appendix B to the Information Memorandum. 10     On 12 May 2008, at 2.28pm (Singapore\n                    time), a massive earthquake, measuring 7.9 on the Richter scale, struck the\n                    Sichuan province (“the Sichuan Earthquake”). On the very same day,\n                    at 4.20pm (Singapore time), the Liquidator sent an email to Newport, attaching a\n                    letter purporting to accept the offer made in the Second Firm Letter of Offer\n                    (“Acceptance Letter”).[note: 6]In the Acceptance Letter, the\n                    Liquidator stated that: We hereby accept your offer of Singapore Dollars Ten Million Two Hundred\n                        Fifty Thousand (SGD10,250,000) for all the shares that we hold in [Norwest\n                        Chemicals]. A formal Sale and Purchase Agreement is to be negotiated and\n                        executed between [Newport] and [Norwest]. As previously indicated, the sale\n                        is on an “as is, where is” basis and we make no warranties,\n                        representations or undertakings as regards the assets and liabilities of\n                        [Norwest Chemicals] or its subsidiary [Norwest China]. In the Acceptance Letter, the Liquidator also requested that Newport\n                    provide an additional sum of S$47,500 to make up for the shortfall in the 1%\n                    deposit (out of which Newport had already paid S$55,000). 11     Newport replied the following day, 13 May\n                    2008, at 2.36pm, via email, thanking the Liquidator for his Acceptance Letter.\n                    Newport also stated that it would work towards the deadline of 1 June 2008,\n                    adhering to the revised timetable enclosed in a 10 April 2008\n                        letter[note: 7]from the\n                    Liquidator to Taylor Collison, and requested the Liquidator to advise on the\n                    condition of the “mine and plant” as well as any information with\n                    respect to casualties and injuries amongst the staff and workers. On 14 May\n                    2008 Newport transferred S$47,500 to Norwest. 12     No news regarding the damage caused by the\n                    Sichuan Earthquake to the Chinese Business was forthcoming from the Liquidator.\n                    The completion date of 1 June 2008 came but Newport did not complete the\n                    purchase of the Shares. 13     On 2 June 2008, Norwest’s\n                    solicitors sent a letter to Newport’s solicitors, stating that Newport had\n                    failed to fulfil its contractual obligation to complete the purchase of the\n                    Shares by 1 June 2008 and gave Newport a final extension of up to 4pm on\n                    5 June 2008 to do so.[note: 8]The next day, on 3 June\n                    2008, Newport’s solicitors replied, disavowing the existence of any\n                    “binding and enforceable contract in place for the sale and\n                    purchase” of the Shares.[note: 9] 14     By a letter dated 6 June 2008, Norwest\n                    purported to accept Newport’s repudiation of the contract and gave notice\n                    that it would be seeking to mitigate its loss by seeking alternative buyers for\n                    the Shares. In August 2008, the Liquidator sold the Shares to Hwa Hong Edible\n                    Oil Industries (“Hwa Hong”) for S$4.5m. Hwa Hong was the main\n                    shareholder of Norwest (holding 49.5% of Norwest shares) and also the main\n                    creditor which put Norwest in liquidation because of unpaid management fees to\n                    the tune of S$4.9m. 15     In January 2009, Norwest commenced this suit\n                    against Newport claiming damages for breach of contract.",
        "The Judge’s decision": "16     The Judge dismissed Norwest’s claim for\n                    damages and allowed Newport’s counterclaim for the deposit. In arriving at\n                    this conclusion, she made the following findings: (a)     When Norwest accepted\n                        Newport’s Second Firm Letter of Offer, parties had agreed on the\n                        price, subject-matter and the risk and had therefore reached substantial\n                        agreement. The contract was only incomplete as to the mechanics of the sale\n                        but that did not prevent any contract from coming into existence (at\n                            [31] of the\n                    GD); (b)     Newport\n                        evinced an intention to enter into legal relations immediately upon\n                        Norwest’s acceptance of the Second Firm Letter of Offer (at [38] of the GD); (c)     The subject-matter of the contract was\n                        the Chinese Business, not the Sharesin vacuo.\n                        After the Sichuan Earthquake, the Shares did not present the same value as\n                        offered on 9 May 2008 and the Liquidator was not able to deliver the\n                        value that was bargained for when Newport made the offer in the Second Firm\n                        Letter of Offer (at [43] of the GD); (d)     Since Newport would not be receiving what it offered to\n                        buy, it was not bound to accept the Shares or make payment (at [50] of the\n                        GD); (e)     As the\n                        change in the Chinese Business as a result of the Sichuan Earthquake was\n                        unknown to both Newport and Norwest at the time the Acceptance Letter was\n                        sent, the parties were operating under a common mistake as to the\n                        subject-matter of the contract (viz, control\n                        over the Chinese Business), which resulted in the contract being voidab initio(at [67] of the GD);\n                    and (f)     Newport was\n                        entitled to recover the 1% deposit it placed with Norwest due to the total\n                        failure of consideration from the latter (at [71] of the\n                GD).",
        "The issues": "17     In these appeals, Norwest essentially made the\n                    following arguments: (a)     The Second Firm Letter of Offer was\n                        not “subject to contract” as there were very strong and\n                        exceptional reasons not to give the phrase “subject to\n                        contract” itsprima faciemeaning. In\n                        any case, following Norwest’s acceptance of Newport’s offer, the\n                        essential terms of the contract had been agreed upon and a contract had been\n                        concluded between the parties; (b)     The subject matter of the contract was the Shares, which\n                        were not damaged or destroyed by the Sichuan Earthquake in any way. Since\n                        Norwest was ready and willing to perform its obligation to sell the Shares,\n                        in failing to tender the purchase price Newport had acted in breach of its\n                        obligations under the contract; (c)     It is not part of Singapore law that a condition\n                        precedent is implied by law in all offers that the subject matter of the\n                        contract must remain materially and substantially unchanged at the time of\n                        acceptance, failing which the offer would be incapable of being accepted;\n                        and (d)     On\n                        Newport’s pleaded case regarding the rules set out in the Information\n                        Memorandum, Norwest was not obliged to return the 1%\n                deposit. 18     In response, Newport contended that there wasno binding legal contractbetween Norwest and\n                    Newport for the following reasons: (a)     The Second Firm Letter of Offer was\n                        “subject to contract” and was not a legally binding offer that\n                        could be accepted by Norwest; (b)     Even if the Second Firm Letter of Offer constituted a\n                        legally binding offer, it lapsed after the underlying business of Norwest\n                        China was destroyed by the Sichuan Earthquake, and could no longer be\n                        capable of acceptance; (c)     Even if there was a binding contract between the parties,\n                        Norwest was unable to perform the contract as the Production Facilities and\n                        the Mines had been severely damaged by the Sichuan Earthquake;\n                    and/or (d)     Even if\n                        parties had reached any form of agreement, such contract was void by reason\n                        of common mistake between the parties as to the subject matter of the\n                        contract at the time of contract. Newport also contended\n                    that as the 1% deposit was paid on the basis that a contract would be executed\n                    between the parties, the absence of any completed contract should result in the\n                    refund of the deposit by Norwest. 19     Therefore, the dispute between Norwest and\n                    Newport boiled down to the following issues: (a)Whether there was a binding contract between\n                            Norwest and Newport;(b)The characterisation of the subject-matter of the\n                            contract between Norwest and Newport (ie,\n                            whether the subject matter was the Shares or the Chinese Business);\n                            and(c)Whether the 1% deposit should be refunded to\n                            Newport.After hearing the parties’ submissions, we decided issue\n                    (a) in the negative for the reasons given below, at[20]–[35]. Consequently, it was unnecessary for us to make a decision\n                    on issue (b), and issue (c) was answered in the affirmative. Since\n                    there was no binding contract between Norwest and Newport, the 1% deposit ought\n                    to be refunded because there has been a total failure of\n                consideration.The “subject to contract” issue20     Newport’s first response to\n                    Norwest’s claim for damages was that there was no concluded contract\n                    between the two parties owing to the insertion of a “subject to\n                    contract” clause by Newport in both the First and Second Firm Letters of\n                    Offer. Newport contended that after the Second Firm Letter of Offer, it still\n                    needed to negotiate with the Liquidator several conditions precedent, including\n                    one stipulating that the Chinese Business should remain in the same operating\n                    state as observed by Newport during the due diligence stage, before it could\n                    enter into a binding agreement with Norwest. Newport’s position was that\n                    under these circumstances, owing to the absence of a concluded Sale and Purchase\n                    Agreement, theprima faciemeaning of a\n                    “subject to contract” clause should be applied,ie, there was no binding and enforceable contract between\n                    them.21     Norwest took the position that all the\n                    essential terms of the contract had been agreed upon and nothing remained to be\n                    negotiated between the parties. In particular, since it was a liquidation sale,\n                    the Liquidator was not in a position to give any representations or warranties.\n                    Norwest also submitted that the “subject to contract” clause\n                    should not be given itsprima faciemeaning\n                    because of the “very strong and exceptional context” which gave\n                    rise to the inference that parties had intended to be bound upon acceptance of\n                    the Second Firm Letter of Offer. These circumstances included:(a)Newport’s procuring of third party funding,\n                            under which its own obligations were triggered upon Norwest’s\n                            acceptance of its Second Firm Letter of Offer;(b)Newport’s decision to call a trading halt\n                            the day after the Sichuan Earthquake in anticipation of its making an\n                            announcement concerning the acquisition of an asset in China;\n                        and(c)Newport’s topping up of its deposit by\n                            S$47,500 despite having full knowledge of the occurrence of the Sichuan\n                            Earthquake.22     According toChitty on\n                        Contractsvol 1 (Sweet & Maxwell,\n                    30th Ed, 2008) (“Chitty”) at\n                    para 2-118, agreements for the sale of land are usually made\n                    “subject to contract” and such agreements are normally regarded as\n                    incomplete until the terms of a formal contract have been settled and approved\n                    by the parties. While such “subject to contract” clauses are\n                    well-known in conveyancing transactions, they are not peculiar to that area and\n                    are often used in commercial transactions (see M P Furmston and\n                    G J Tolhurst,Contract Formation: Law and\n                        Practice(Oxford University Press, 2010) (“Furmston and\n                    Tolhurst”) at para 9.15).23     In the local context, it was held in the\n                    Singapore High Court decision ofGround & Sharp Precision\n                        Engineering Pte Ltd v Midview Realty Pte Ltd[2008] SGHC 160 that\n                    (at [18]):The meaning of “subject to contract” is clear. This\n                        expression simply means that “unless and until a formal written\n                        contract has been executed and exchanged by the parties there is no binding\n                        and enforceable contract between them. That is so even if the parties are in\n                        agreement as to all the terms.” (Thomson Plaza\n                            (Pte) Ltd v Liquidators of Yaohan Department Store Singapore Pte\n                            Ltd[2001] 3 SLR 437 at [27].)In the Singapore High Court decision ofUnited\n                        Artists Singapore Theatre Pte Ltd and another v Parkway Properties Pte Ltd\n                        and another[2003] 1 SLR(R) 791 (“United Artists”) (affirmed by the Court of Appeal inParkway Properties Pte Ltd and another v United Artists\n                        Singapore Theatre Pte Ltd and another[2003] 2 SLR(R) 103\n                    (where this particular point was not in issue)), it was similarly held (at [57])\n                    that:It is well settled that the phrase “subject to contract”\n                        makes it clear that the intention of the parties is that neither of them is\n                        to be contractually bound until a contract is signed. The negotiations\n                        remain subject to and dependent upon the preparation of a formal contract.\n                        Either party may withdraw from the negotiations before a final agreement has\n                        been concluded.24     While the holding inUnited\n                        Artistsquoted above seems to suggest that the phrase\n                    “subject to contract” isconclusiveof the intention of the parties, in our judgment, the better view is that the\n                    question whether there is a binding contract between the parties should be\n                    determined by considering all the circumstances, not just the inclusion of the\n                    stock phrase “subject to contract” (on the basis that thesubstanceof the situation must always\n                    prevail). These would include what was communicated between the parties by words\n                    or conduct. In this regard, we are in agreement with the recent decision of the\n                    UK Supreme Court inRTS Flexible Systems Ltd v Molkerei Alois\n                        Müller GmbH & Co KG (UK Production)[2010]\n                    1 WLR 753 in which it was held that (at [56]):Whether in such a case [ie, concerning an\n                        agreement that is “subject to contract”] the parties agreed to\n                        enter into a binding contract, waiving reliance on the “subject to\n                        [written] contract” term or understanding will againdepend upon all the circumstances of the case,\n                        although the cases show that the courtwill not lightly\n                            so hold. [emphasis added]25     The documentary evidence of the communication\n                    between the parties pertaining to the transaction contained several indications\n                    to an objective observer that they had not intended to be contractually bound\n                    until a formal Sale and Purchase Agreement was negotiated and executed. Right at\n                    the outset, the Information Memorandum stated expressly at para 3.0 that\n                    the intention of the Liquidator was to sell Norwest together with Norwest China\n                        “subject to a Sale and Purchase\n                        Agreement” [emphasis added]. In the “Events and\n                    Timeline” outlined at para 3.1 of the Information Memorandum, the\n                    Liquidator’s acceptance was expressly “subject\n                        to agreement on terms and conditions” [emphasis\n                    added].26     Apart from the Information Memorandum, the\n                    letters that Newport sent to the Liquidator contained several variations of\n                    “subject to contract” clauses. The Expression of Interest\n                    (following the template in Appendix A to the Information Memorandum) that\n                    Taylor Collison sent to the Liquidator expressly stated that:In the event we should decide to make a firm offer for [Norwest Chemicals]\n                        and this offer is in turn accepted by you, we agree to pay the balance of\n                        the purchase price (less this deposit)in accordance to\n                            [sic] the terms and conditions set out in the Sale and Purchase\n                            Agreement. [emphasis added]The Second Firm Letter of Offer provided that Newport’s offer\n                    price of S$10.25m was “subject to the terms and\n                        conditions in the Sale and Purchase Agreement to be\n                    negotiated” [emphasis added]. In that same letter, Newport\n                    reiterated that in the event that its offer was accepted, it would pay the\n                    balance of the purchase price less the deposit of S$55,000 that had been\n                    submitted to Norwest, “in accordance with the terms and conditions set\n                    out in the Sale and Purchase Agreementto be\n                        negotiated”.27     In the Acceptance Letter, the Liquidator\n                    stated that “[a] formal Sale and Purchase Agreement is to benegotiated and executedbetween [Newport] and\n                    [Norwest]” [emphasis added].28     Given the various references in the\n                    communications between the parties to the negotiation of a Sale and Purchase\n                    Agreement after acceptance, Norwest’s argument that there wasnothingleft to be negotiated seemed somewhat\n                    disingenuous. Any objective reading of the documents would lead to the inference\n                    that the parties had intended to negotiate the terms and conditions of a Sale\n                    and Purchase Agreement under which Newport’s obligation to pay the\n                    purchase price would be fulfilled. The force of that argument was diminished\n                    further when we considered that the internal email correspondence between the\n                    Liquidator and Hwa Hong evinced Norwest’s contemplation that the terms and\n                    conditions of the Sale and Purchase Agreement still needed to be negotiated\n                    before the agreement could be executed. In an email from Simon Ong, chief\n                    financial officer of Hwa Hong, to the Liquidator dated 8 May 2008, at\n                    3.43pm, he expressed his concern that:... the deal cannot be counted as completed until we receive the money.\n                        That means thatthey [ie, Newport] may still walk away\n                            from the deal if certain conditions precedent (if any are to be\n                            introduced) are not met or waived. ......In this connection, as a first step, can you share with us your proposed\n                        draft sales [sic] and purchase agreement? We\n                        will get our lawyers to help and suggest amendments to tighten the agreement\n                        to improve our chances of obtaining a successful completion of the\n                        transaction.We must not allow too many condition\n                            precedents [sic] to be introduced into the sales [sic] and purchase\n                            agreementand also not allow any delay to the completion of\n                        the transaction as stipulated in the timetable.[emphasis added]In response, the Liquidator replied in an email dated 8 May 2008\n                    at 4.12pm, saying that:... in any deal of this nature and size, and as you have correctly pointed\n                        out, there is always the possibility that things may fall apart and yes,\n                        until the money is in the bank, there is no certainty that this is\n                        done....... Given that the sale is on a “as is, where is” basis,I think there shouldn’t be too many conditions\n                            precedents[sic]to go through. ...[emphasis added]If there was indeed nothing left to be negotiated, neither the\n                    Liquidator nor Simon Ong needed to have worried about the conditions precedent\n                    that Newport might have sought to include in the eventual Sale and Purchase\n                    Agreement to be executed between the parties. After receiving the First Firm\n                    Letter of Offer on 2 May 2008 and prior to the occurrence of the Sichuan\n                    Earthquake and sending their Acceptance Letter on 12 May 2008,\n                    Norwest’s view—while not conclusive, but by no means\n                    irrelevant—appeared to be that there were terms to be negotiated before\n                    the Sale and Purchase Agreement could be executed between the\n                parties.29     Even if the essential terms of a contract have\n                    been agreed upon, and thus needed no further negotiation regarding those terms,\n                    parties who enter into an agreement which is expressly “subject to\n                    contract” may be taken to have intended for legal relations to be\n                    deferred until the execution of a formal contract, unless there is strong and\n                    exceptional evidence to the contrary. In the Malaysian High Court decision ofLow Kar Yit & Ors v Mohamed Isa & Anor[1963] MLJ 165 (“Low Kar\n                    Yit”), the defendants granted an option to the plaintiffs to\n                    purchase a piece of land, providing in the option that if it was exercised, it\n                    would be subject to both a formal contract agreed upon by both parties, and the\n                    approval of the sale and contract by the High Court at Kuala Lumpur. After the\n                    plaintiffs exercised the option, a contract reflecting the terms agreed between\n                    the parties was prepared by the defendants’ solicitors and sent to the\n                    plaintiffs’ solicitors, but one of the defendants subsequently refused to\n                    execute the contract. In an action for specific performance or alternatively\n                    damages for breach of contract, the High Court of Kuala Lumpur held that the\n                    stipulation that the option was to be subject to a formal contract to be agreed\n                    upon meant that there was no binding contract between the parties until such a\n                    formal contract was entered into. At 173, Gill J held that:[E]ven where there is nothing in the agreement to suggest that the parties\n                        contemplate that the subsequent contract shall contain any new or different\n                        terms, nevertheless if it appears that the parties do not intend to bind\n                        themselves contractually by the agreement but only by the subsequent conduct\n                        is in words which according to their natural construction import a\n                        condition, this will almost invariably be conclusive that the agreement\n                        itself was not intended to be a contract. To my mind this was true of this\n                        case.It will bear repetition if I say that when the\n                            actual phrase “subject to contract” is used, the courts\n                            tend to give effect to those words unless there is strong evidence to\n                            the contrary. The result is that the agreement which is made\n                            “subject to contract” is of no legal effect.\n                        Perhaps I should add that the plaintiffs in this case are asking the court\n                        to order the defendants to execute the draft agreement agreed upon, which\n                        amounts in effect to asking the court to enforce an agreement to enter into\n                        an agreement. That is an order which the court clearly has no power to make\n                        in the circumstances of the case. [emphasis added]30     The Singapore High Court decision ofThomson Plaza (Pte) Ltd v Liquidators of Yaohan Department Store\n                        Singapore Pte Ltd (in liquidation)[2001] 2 SLR(R) 483\n                    concerned the grant of a new tenancy by the applicant Thomson Plaza to Yaohan\n                    Department Store, “subject to all the terms and conditions as contained\n                    in the specimen Lease Agreement”, which was not executed.\n                    G P Selvam J held (at [29]) that there was no tenancy, following Gill J’s\n                    reasoning inLow Kar Yit, as the “subject\n                    to contract” provision made it clear that the execution of a lease\n                    agreement was a condition precedent to the tenancy coming into being.\n                    Selvam J further explained (at [28]) that:Parties who contract on the basis of “subject to contract”\n                        do so because they want an escape route in case they wish to call the\n                        transaction off. They do not consider it a wrong way of business. It is a\n                        last-chance escape route in case they find it impossible or undesirable to\n                        fulfil the contract.31     We turn next to the question whether there was\n                    a “very strong and exceptional context” which would override theprima faciemeaning of the various\n                    “subject to contract” provisions contained in the correspondence\n                    between the parties. Looking at all the circumstances in their proper context,\n                    we were of the view that they did not constitute a strong and exceptional\n                    context sufficient to override the plain meaning of the “subject to\n                    contract” provisions for the following reasons.32     First, third party funding was the\n                    subject-matter of agreements between Newport and Newport’s funding\n                    partners such as Lawrence Asset Management Inc (“the funding\n                    letters”), which agreements Norwest was not privy to. The funding\n                    letters, dated 8 May 2008, must be read in the context of Newport’s\n                    confirmation in the cover letters accompanying the First Firm Letter of Offer\n                    and the Second Firm Letter of Offer that Newport had “sufficient funding\n                    to complete the/this transaction”.[note: 10]The confirmation of sufficient funding was\n                    certainly an attempt to bolster Newport’s chances of eliciting\n                    Norwest’s acceptance of its offer. The fact that, pursuant to the terms of\n                    the funding letters, Newport’s obligations to the third party funding\n                    partners under the funding letters would be triggered by Norwest’s\n                    acceptance did not imply that Newport had similarly intended to be bound to\n                    fulfil the separate and distinct contract with Norwest upon Norwest’s\n                    acceptance of Newport’s offer. We accepted Newport’s explanation\n                    that it had needed the funds to be in so that it could be in a position to\n                    complete the transaction with Norwest once the negotiations on the terms and\n                    conditions of the Sale and Purchase Agreement were completed. Indeed, by their\n                    very terms the funding letters had provided for an exit procedure should the\n                    transaction with Norwest not go through, in spite of Norwest’s acceptance.\n                    Clause 8 of the funding letters made it clear that if “for any\n                    reason” the Shares are not acquired by Newport, the parties to the\n                    funding letters could recover their full contribution with no drawdown on the\n                    amount previously committed. In any case, there was no drawdown on any funding\n                    partner’s contribution since Newport had not completed the transaction to\n                    acquire the Shares.33     Second, Newport’s announcement of a\n                    trading halt of its shares simply stated that “[Newport] intends to make\n                    an announcement regarding the acquisition of an asset in China”. On its\n                    face, the announcement did not suggest that there was already a concluded\n                    contract with Norwest. Indeed, in a subsequent announcement on 21 May 2008,\n                    Newport explained that after the media reports regarding the Sichuan Earthquake\n                    on 12 May 2008, subsequent news of the damage and casualties of the Sichuan\n                    Earthquake was far worse than earlier reported, and Newport had\n                    “requested the ASX [ie, the Australian\n                    Securities Exchange] to suspend securities of [Newport] to enable it to be\n                    better informed of the situation in China with respect to the\n                        asset”.[note: 11]34     Third, Newport’s payment of the\n                    remaining sum of S$47,500 of its deposit to Norwest on 14 May 2008 was at\n                    the Liquidator’s request, in order to comply with the terms in the\n                    Information Memorandum that were reiterated in the Acceptance Letter,viz, that all offers should be accompanied by a deposit\n                    of 1% of the offer price. At the time the sum of S$47,500 was paid,ie, 14 May 2008, Newport had not received definite\n                    confirmation from the Liquidator or other executives in Norwest as to the extent\n                    of the damage to the Chinese Business caused by the Sichuan Earthquake. In order\n                    that its offer would not be rejected in the event that the Mines and the\n                    Production Facilities turned out to have emerged unscathed by the Sichuan\n                    Earthquake, Newport decided to pay the balance of its 1% deposit so as to comply\n                    with the express terms of the Information Memorandum. This was on the\n                    understanding that the 1% deposit was refundable if the negotiations did not\n                    result in the execution of the Sale and Purchase Agreement. Thus, the payment of\n                    the 1% deposit indicated Newport’s willingness to negotiate the terms and\n                    conditions of the Sale and Purchase Agreement. It did not indicate\n                    Newport’s intention to create legal relations upon Norwest’s\n                    acceptance of its Second Firm Letter of Offer.35     For all these reasons, we were of the view\n                    that the plain meaning of the “subject to contract” provisions in\n                    the Information Memorandum, the First Firm Letter of Offer, the Second Firm\n                    Letter of Offer and the Acceptance Letter should be applied in this case. The\n                    facts that Norwest relied on for its claim that the plain meaning should be\n                    displaced did not constitute a very strong and exceptional context in which to\n                    do so. In the circumstances, therefore, there was no binding contract entered\n                    into between the parties.36     However, we noted that the Judge considered\n                    and rejected the implied term approach adopted by the English Court of Appeal ofFinancings Ltd v Stimson[1962]\n                    1 WLR 1184 (“Financings”)\n                    and by the New Zealand Supreme Court decision ofDysart\n                        Timbers Limited v Roderick William Nielsen[2009]\n                    3 NZLR 160 (“Dysart\n                    Timbers”). According to the Judge (at [63]), “Financingswas based on the implication of a condition\n                    into the offer that the subject matter of the offer must remain in substantially\n                    the same condition it was in at the time of the offer, failing which the offer\n                    lapses”.Dysart Timbersappeared to qualify\n                    the approach inFinancingsby requiring that the\n                    change in circumstances must be fundamental in order to justify the court\n                    holding that an offer had lapsed where a change of circumstances had arisen\n                    between the time an offer was made and the time it was purportedly accepted.\n                    However, differing views were expressed as to the precise juridical basis that\n                    ought to be adopted.37     The Judge was doubtful that the implied term\n                    approach inFinancingsprovides a satisfactory\n                    juristic basis on which to approach the formation problems. Basically, she was\n                    of the view (having regard, presumably, to the facts of the present appeal) that\n                    an implied term is an artificial solution to unanticipated changes of\n                    circumstances, and the formulation of the precise term to be implied is also\n                    likely to be fraught with artificiality and indeed arbitrariness, and therefore\n                    the usual objective approach to offer and acceptance, or the doctrine of common\n                    mistake, is more than adequate to provide a principled approach to changes in\n                    circumstances occurring after an offer was made and before the offer is\n                    purported to be accepted.38     These conceptual problems may well be\n                    pertinent in considering whether the court should apply theFinancingsapproach to the facts of a particular case. But it is\n                    not necessary to express our views on this matter as we have found that there\n                    was no binding contract between the parties on the ground that the offer was\n                    subject to contract.Conclusion39     For the reasons set out above, we dismissed\n                    Norwest’s appeal in CA 151/2009 and allowed Newport’s appeal in\n                    CA 153/2009, and awarded costs for both appeals to Newport. The usual\n                    consequential orders will apply.[note: 1]CA 151/2009, Appellant’s Core\n                                Bundle (“ACB”) vol 2B,\n                        p 412.[note: 2]CA 151/2009, ACB vol 2A,\n                                pp 64ff.[note: 3]CA 151/2009, ACB vol 2A,\n                                p 66.[note: 4]CA 151/2009, ACB vol 2A,\n                                                  p 79.[note: 5]CA 151/2009, ACB vol 2A,\n                                                  p 81.[note: 6]CA 151/2009, Respondent’s Supplemental Core Bundle\n                                (“RSCB”),\n                        pp 54–56.[note: 7]Joint Record of Appeal, vol 5B,\n                                pp 4023–4025.[note: 8]CA 151/2009, RSCB,\n                                p 61.[note: 9]CA 151/2009, RSCB,\n                p 62.[note: 10]CA 151/2009, ACB vol 2B, pp 415 and\n                            417.[note: 11]CA 151/2009, RSCB,\n                                p 60.",
        "The “subject to contract” issue": "20     Newport’s first response to\n                    Norwest’s claim for damages was that there was no concluded contract\n                    between the two parties owing to the insertion of a “subject to\n                    contract” clause by Newport in both the First and Second Firm Letters of\n                    Offer. Newport contended that after the Second Firm Letter of Offer, it still\n                    needed to negotiate with the Liquidator several conditions precedent, including\n                    one stipulating that the Chinese Business should remain in the same operating\n                    state as observed by Newport during the due diligence stage, before it could\n                    enter into a binding agreement with Norwest. Newport’s position was that\n                    under these circumstances, owing to the absence of a concluded Sale and Purchase\n                    Agreement, theprima faciemeaning of a\n                    “subject to contract” clause should be applied,ie, there was no binding and enforceable contract between\n                    them. 21     Norwest took the position that all the\n                    essential terms of the contract had been agreed upon and nothing remained to be\n                    negotiated between the parties. In particular, since it was a liquidation sale,\n                    the Liquidator was not in a position to give any representations or warranties.\n                    Norwest also submitted that the “subject to contract” clause\n                    should not be given itsprima faciemeaning\n                    because of the “very strong and exceptional context” which gave\n                    rise to the inference that parties had intended to be bound upon acceptance of\n                    the Second Firm Letter of Offer. These circumstances included: (a)Newport’s procuring of third party funding,\n                            under which its own obligations were triggered upon Norwest’s\n                            acceptance of its Second Firm Letter of Offer;(b)Newport’s decision to call a trading halt\n                            the day after the Sichuan Earthquake in anticipation of its making an\n                            announcement concerning the acquisition of an asset in China;\n                        and(c)Newport’s topping up of its deposit by\n                            S$47,500 despite having full knowledge of the occurrence of the Sichuan\n                            Earthquake.22     According toChitty on\n                        Contractsvol 1 (Sweet & Maxwell,\n                    30th Ed, 2008) (“Chitty”) at\n                    para 2-118, agreements for the sale of land are usually made\n                    “subject to contract” and such agreements are normally regarded as\n                    incomplete until the terms of a formal contract have been settled and approved\n                    by the parties. While such “subject to contract” clauses are\n                    well-known in conveyancing transactions, they are not peculiar to that area and\n                    are often used in commercial transactions (see M P Furmston and\n                    G J Tolhurst,Contract Formation: Law and\n                        Practice(Oxford University Press, 2010) (“Furmston and\n                    Tolhurst”) at para 9.15).23     In the local context, it was held in the\n                    Singapore High Court decision ofGround & Sharp Precision\n                        Engineering Pte Ltd v Midview Realty Pte Ltd[2008] SGHC 160 that\n                    (at [18]):The meaning of “subject to contract” is clear. This\n                        expression simply means that “unless and until a formal written\n                        contract has been executed and exchanged by the parties there is no binding\n                        and enforceable contract between them. That is so even if the parties are in\n                        agreement as to all the terms.” (Thomson Plaza\n                            (Pte) Ltd v Liquidators of Yaohan Department Store Singapore Pte\n                            Ltd[2001] 3 SLR 437 at [27].)In the Singapore High Court decision ofUnited\n                        Artists Singapore Theatre Pte Ltd and another v Parkway Properties Pte Ltd\n                        and another[2003] 1 SLR(R) 791 (“United Artists”) (affirmed by the Court of Appeal inParkway Properties Pte Ltd and another v United Artists\n                        Singapore Theatre Pte Ltd and another[2003] 2 SLR(R) 103\n                    (where this particular point was not in issue)), it was similarly held (at [57])\n                    that:It is well settled that the phrase “subject to contract”\n                        makes it clear that the intention of the parties is that neither of them is\n                        to be contractually bound until a contract is signed. The negotiations\n                        remain subject to and dependent upon the preparation of a formal contract.\n                        Either party may withdraw from the negotiations before a final agreement has\n                        been concluded.24     While the holding inUnited\n                        Artistsquoted above seems to suggest that the phrase\n                    “subject to contract” isconclusiveof the intention of the parties, in our judgment, the better view is that the\n                    question whether there is a binding contract between the parties should be\n                    determined by considering all the circumstances, not just the inclusion of the\n                    stock phrase “subject to contract” (on the basis that thesubstanceof the situation must always\n                    prevail). These would include what was communicated between the parties by words\n                    or conduct. In this regard, we are in agreement with the recent decision of the\n                    UK Supreme Court inRTS Flexible Systems Ltd v Molkerei Alois\n                        Müller GmbH & Co KG (UK Production)[2010]\n                    1 WLR 753 in which it was held that (at [56]):Whether in such a case [ie, concerning an\n                        agreement that is “subject to contract”] the parties agreed to\n                        enter into a binding contract, waiving reliance on the “subject to\n                        [written] contract” term or understanding will againdepend upon all the circumstances of the case,\n                        although the cases show that the courtwill not lightly\n                            so hold. [emphasis added]25     The documentary evidence of the communication\n                    between the parties pertaining to the transaction contained several indications\n                    to an objective observer that they had not intended to be contractually bound\n                    until a formal Sale and Purchase Agreement was negotiated and executed. Right at\n                    the outset, the Information Memorandum stated expressly at para 3.0 that\n                    the intention of the Liquidator was to sell Norwest together with Norwest China\n                        “subject to a Sale and Purchase\n                        Agreement” [emphasis added]. In the “Events and\n                    Timeline” outlined at para 3.1 of the Information Memorandum, the\n                    Liquidator’s acceptance was expressly “subject\n                        to agreement on terms and conditions” [emphasis\n                    added].26     Apart from the Information Memorandum, the\n                    letters that Newport sent to the Liquidator contained several variations of\n                    “subject to contract” clauses. The Expression of Interest\n                    (following the template in Appendix A to the Information Memorandum) that\n                    Taylor Collison sent to the Liquidator expressly stated that:In the event we should decide to make a firm offer for [Norwest Chemicals]\n                        and this offer is in turn accepted by you, we agree to pay the balance of\n                        the purchase price (less this deposit)in accordance to\n                            [sic] the terms and conditions set out in the Sale and Purchase\n                            Agreement. [emphasis added]The Second Firm Letter of Offer provided that Newport’s offer\n                    price of S$10.25m was “subject to the terms and\n                        conditions in the Sale and Purchase Agreement to be\n                    negotiated” [emphasis added]. In that same letter, Newport\n                    reiterated that in the event that its offer was accepted, it would pay the\n                    balance of the purchase price less the deposit of S$55,000 that had been\n                    submitted to Norwest, “in accordance with the terms and conditions set\n                    out in the Sale and Purchase Agreementto be\n                        negotiated”.27     In the Acceptance Letter, the Liquidator\n                    stated that “[a] formal Sale and Purchase Agreement is to benegotiated and executedbetween [Newport] and\n                    [Norwest]” [emphasis added].28     Given the various references in the\n                    communications between the parties to the negotiation of a Sale and Purchase\n                    Agreement after acceptance, Norwest’s argument that there wasnothingleft to be negotiated seemed somewhat\n                    disingenuous. Any objective reading of the documents would lead to the inference\n                    that the parties had intended to negotiate the terms and conditions of a Sale\n                    and Purchase Agreement under which Newport’s obligation to pay the\n                    purchase price would be fulfilled. The force of that argument was diminished\n                    further when we considered that the internal email correspondence between the\n                    Liquidator and Hwa Hong evinced Norwest’s contemplation that the terms and\n                    conditions of the Sale and Purchase Agreement still needed to be negotiated\n                    before the agreement could be executed. In an email from Simon Ong, chief\n                    financial officer of Hwa Hong, to the Liquidator dated 8 May 2008, at\n                    3.43pm, he expressed his concern that:... the deal cannot be counted as completed until we receive the money.\n                        That means thatthey [ie, Newport] may still walk away\n                            from the deal if certain conditions precedent (if any are to be\n                            introduced) are not met or waived. ......In this connection, as a first step, can you share with us your proposed\n                        draft sales [sic] and purchase agreement? We\n                        will get our lawyers to help and suggest amendments to tighten the agreement\n                        to improve our chances of obtaining a successful completion of the\n                        transaction.We must not allow too many condition\n                            precedents [sic] to be introduced into the sales [sic] and purchase\n                            agreementand also not allow any delay to the completion of\n                        the transaction as stipulated in the timetable.[emphasis added]In response, the Liquidator replied in an email dated 8 May 2008\n                    at 4.12pm, saying that:... in any deal of this nature and size, and as you have correctly pointed\n                        out, there is always the possibility that things may fall apart and yes,\n                        until the money is in the bank, there is no certainty that this is\n                        done....... Given that the sale is on a “as is, where is” basis,I think there shouldn’t be too many conditions\n                            precedents[sic]to go through. ...[emphasis added]If there was indeed nothing left to be negotiated, neither the\n                    Liquidator nor Simon Ong needed to have worried about the conditions precedent\n                    that Newport might have sought to include in the eventual Sale and Purchase\n                    Agreement to be executed between the parties. After receiving the First Firm\n                    Letter of Offer on 2 May 2008 and prior to the occurrence of the Sichuan\n                    Earthquake and sending their Acceptance Letter on 12 May 2008,\n                    Norwest’s view—while not conclusive, but by no means\n                    irrelevant—appeared to be that there were terms to be negotiated before\n                    the Sale and Purchase Agreement could be executed between the\n                parties.29     Even if the essential terms of a contract have\n                    been agreed upon, and thus needed no further negotiation regarding those terms,\n                    parties who enter into an agreement which is expressly “subject to\n                    contract” may be taken to have intended for legal relations to be\n                    deferred until the execution of a formal contract, unless there is strong and\n                    exceptional evidence to the contrary. In the Malaysian High Court decision ofLow Kar Yit & Ors v Mohamed Isa & Anor[1963] MLJ 165 (“Low Kar\n                    Yit”), the defendants granted an option to the plaintiffs to\n                    purchase a piece of land, providing in the option that if it was exercised, it\n                    would be subject to both a formal contract agreed upon by both parties, and the\n                    approval of the sale and contract by the High Court at Kuala Lumpur. After the\n                    plaintiffs exercised the option, a contract reflecting the terms agreed between\n                    the parties was prepared by the defendants’ solicitors and sent to the\n                    plaintiffs’ solicitors, but one of the defendants subsequently refused to\n                    execute the contract. In an action for specific performance or alternatively\n                    damages for breach of contract, the High Court of Kuala Lumpur held that the\n                    stipulation that the option was to be subject to a formal contract to be agreed\n                    upon meant that there was no binding contract between the parties until such a\n                    formal contract was entered into. At 173, Gill J held that:[E]ven where there is nothing in the agreement to suggest that the parties\n                        contemplate that the subsequent contract shall contain any new or different\n                        terms, nevertheless if it appears that the parties do not intend to bind\n                        themselves contractually by the agreement but only by the subsequent conduct\n                        is in words which according to their natural construction import a\n                        condition, this will almost invariably be conclusive that the agreement\n                        itself was not intended to be a contract. To my mind this was true of this\n                        case.It will bear repetition if I say that when the\n                            actual phrase “subject to contract” is used, the courts\n                            tend to give effect to those words unless there is strong evidence to\n                            the contrary. The result is that the agreement which is made\n                            “subject to contract” is of no legal effect.\n                        Perhaps I should add that the plaintiffs in this case are asking the court\n                        to order the defendants to execute the draft agreement agreed upon, which\n                        amounts in effect to asking the court to enforce an agreement to enter into\n                        an agreement. That is an order which the court clearly has no power to make\n                        in the circumstances of the case. [emphasis added]30     The Singapore High Court decision ofThomson Plaza (Pte) Ltd v Liquidators of Yaohan Department Store\n                        Singapore Pte Ltd (in liquidation)[2001] 2 SLR(R) 483\n                    concerned the grant of a new tenancy by the applicant Thomson Plaza to Yaohan\n                    Department Store, “subject to all the terms and conditions as contained\n                    in the specimen Lease Agreement”, which was not executed.\n                    G P Selvam J held (at [29]) that there was no tenancy, following Gill J’s\n                    reasoning inLow Kar Yit, as the “subject\n                    to contract” provision made it clear that the execution of a lease\n                    agreement was a condition precedent to the tenancy coming into being.\n                    Selvam J further explained (at [28]) that:Parties who contract on the basis of “subject to contract”\n                        do so because they want an escape route in case they wish to call the\n                        transaction off. They do not consider it a wrong way of business. It is a\n                        last-chance escape route in case they find it impossible or undesirable to\n                        fulfil the contract.31     We turn next to the question whether there was\n                    a “very strong and exceptional context” which would override theprima faciemeaning of the various\n                    “subject to contract” provisions contained in the correspondence\n                    between the parties. Looking at all the circumstances in their proper context,\n                    we were of the view that they did not constitute a strong and exceptional\n                    context sufficient to override the plain meaning of the “subject to\n                    contract” provisions for the following reasons.32     First, third party funding was the\n                    subject-matter of agreements between Newport and Newport’s funding\n                    partners such as Lawrence Asset Management Inc (“the funding\n                    letters”), which agreements Norwest was not privy to. The funding\n                    letters, dated 8 May 2008, must be read in the context of Newport’s\n                    confirmation in the cover letters accompanying the First Firm Letter of Offer\n                    and the Second Firm Letter of Offer that Newport had “sufficient funding\n                    to complete the/this transaction”.[note: 10]The confirmation of sufficient funding was\n                    certainly an attempt to bolster Newport’s chances of eliciting\n                    Norwest’s acceptance of its offer. The fact that, pursuant to the terms of\n                    the funding letters, Newport’s obligations to the third party funding\n                    partners under the funding letters would be triggered by Norwest’s\n                    acceptance did not imply that Newport had similarly intended to be bound to\n                    fulfil the separate and distinct contract with Norwest upon Norwest’s\n                    acceptance of Newport’s offer. We accepted Newport’s explanation\n                    that it had needed the funds to be in so that it could be in a position to\n                    complete the transaction with Norwest once the negotiations on the terms and\n                    conditions of the Sale and Purchase Agreement were completed. Indeed, by their\n                    very terms the funding letters had provided for an exit procedure should the\n                    transaction with Norwest not go through, in spite of Norwest’s acceptance.\n                    Clause 8 of the funding letters made it clear that if “for any\n                    reason” the Shares are not acquired by Newport, the parties to the\n                    funding letters could recover their full contribution with no drawdown on the\n                    amount previously committed. In any case, there was no drawdown on any funding\n                    partner’s contribution since Newport had not completed the transaction to\n                    acquire the Shares.33     Second, Newport’s announcement of a\n                    trading halt of its shares simply stated that “[Newport] intends to make\n                    an announcement regarding the acquisition of an asset in China”. On its\n                    face, the announcement did not suggest that there was already a concluded\n                    contract with Norwest. Indeed, in a subsequent announcement on 21 May 2008,\n                    Newport explained that after the media reports regarding the Sichuan Earthquake\n                    on 12 May 2008, subsequent news of the damage and casualties of the Sichuan\n                    Earthquake was far worse than earlier reported, and Newport had\n                    “requested the ASX [ie, the Australian\n                    Securities Exchange] to suspend securities of [Newport] to enable it to be\n                    better informed of the situation in China with respect to the\n                        asset”.[note: 11]34     Third, Newport’s payment of the\n                    remaining sum of S$47,500 of its deposit to Norwest on 14 May 2008 was at\n                    the Liquidator’s request, in order to comply with the terms in the\n                    Information Memorandum that were reiterated in the Acceptance Letter,viz, that all offers should be accompanied by a deposit\n                    of 1% of the offer price. At the time the sum of S$47,500 was paid,ie, 14 May 2008, Newport had not received definite\n                    confirmation from the Liquidator or other executives in Norwest as to the extent\n                    of the damage to the Chinese Business caused by the Sichuan Earthquake. In order\n                    that its offer would not be rejected in the event that the Mines and the\n                    Production Facilities turned out to have emerged unscathed by the Sichuan\n                    Earthquake, Newport decided to pay the balance of its 1% deposit so as to comply\n                    with the express terms of the Information Memorandum. This was on the\n                    understanding that the 1% deposit was refundable if the negotiations did not\n                    result in the execution of the Sale and Purchase Agreement. Thus, the payment of\n                    the 1% deposit indicated Newport’s willingness to negotiate the terms and\n                    conditions of the Sale and Purchase Agreement. It did not indicate\n                    Newport’s intention to create legal relations upon Norwest’s\n                    acceptance of its Second Firm Letter of Offer.35     For all these reasons, we were of the view\n                    that the plain meaning of the “subject to contract” provisions in\n                    the Information Memorandum, the First Firm Letter of Offer, the Second Firm\n                    Letter of Offer and the Acceptance Letter should be applied in this case. The\n                    facts that Norwest relied on for its claim that the plain meaning should be\n                    displaced did not constitute a very strong and exceptional context in which to\n                    do so. In the circumstances, therefore, there was no binding contract entered\n                    into between the parties.36     However, we noted that the Judge considered\n                    and rejected the implied term approach adopted by the English Court of Appeal ofFinancings Ltd v Stimson[1962]\n                    1 WLR 1184 (“Financings”)\n                    and by the New Zealand Supreme Court decision ofDysart\n                        Timbers Limited v Roderick William Nielsen[2009]\n                    3 NZLR 160 (“Dysart\n                    Timbers”). According to the Judge (at [63]), “Financingswas based on the implication of a condition\n                    into the offer that the subject matter of the offer must remain in substantially\n                    the same condition it was in at the time of the offer, failing which the offer\n                    lapses”.Dysart Timbersappeared to qualify\n                    the approach inFinancingsby requiring that the\n                    change in circumstances must be fundamental in order to justify the court\n                    holding that an offer had lapsed where a change of circumstances had arisen\n                    between the time an offer was made and the time it was purportedly accepted.\n                    However, differing views were expressed as to the precise juridical basis that\n                    ought to be adopted.37     The Judge was doubtful that the implied term\n                    approach inFinancingsprovides a satisfactory\n                    juristic basis on which to approach the formation problems. Basically, she was\n                    of the view (having regard, presumably, to the facts of the present appeal) that\n                    an implied term is an artificial solution to unanticipated changes of\n                    circumstances, and the formulation of the precise term to be implied is also\n                    likely to be fraught with artificiality and indeed arbitrariness, and therefore\n                    the usual objective approach to offer and acceptance, or the doctrine of common\n                    mistake, is more than adequate to provide a principled approach to changes in\n                    circumstances occurring after an offer was made and before the offer is\n                    purported to be accepted.38     These conceptual problems may well be\n                    pertinent in considering whether the court should apply theFinancingsapproach to the facts of a particular case. But it is\n                    not necessary to express our views on this matter as we have found that there\n                    was no binding contract between the parties on the ground that the offer was\n                    subject to contract.Conclusion39     For the reasons set out above, we dismissed\n                    Norwest’s appeal in CA 151/2009 and allowed Newport’s appeal in\n                    CA 153/2009, and awarded costs for both appeals to Newport. The usual\n                    consequential orders will apply.[note: 1]CA 151/2009, Appellant’s Core\n                                Bundle (“ACB”) vol 2B,\n                        p 412.[note: 2]CA 151/2009, ACB vol 2A,\n                                pp 64ff.[note: 3]CA 151/2009, ACB vol 2A,\n                                p 66.[note: 4]CA 151/2009, ACB vol 2A,\n                                                  p 79.[note: 5]CA 151/2009, ACB vol 2A,\n                                                  p 81.[note: 6]CA 151/2009, Respondent’s Supplemental Core Bundle\n                                (“RSCB”),\n                        pp 54–56.[note: 7]Joint Record of Appeal, vol 5B,\n                                pp 4023–4025.[note: 8]CA 151/2009, RSCB,\n                                p 61.[note: 9]CA 151/2009, RSCB,\n                p 62.[note: 10]CA 151/2009, ACB vol 2B, pp 415 and\n                            417.[note: 11]CA 151/2009, RSCB,\n                                p 60.",
        "Conclusion": "39     For the reasons set out above, we dismissed\n                    Norwest’s appeal in CA 151/2009 and allowed Newport’s appeal in\n                    CA 153/2009, and awarded costs for both appeals to Newport. The usual\n                    consequential orders will apply.  [note: 1]CA 151/2009, Appellant’s Core\n                                Bundle (“ACB”) vol 2B,\n                        p 412. [note: 2]CA 151/2009, ACB vol 2A,\n                                pp 64ff. [note: 3]CA 151/2009, ACB vol 2A,\n                                p 66. [note: 4]CA 151/2009, ACB vol 2A,\n                                                  p 79. [note: 5]CA 151/2009, ACB vol 2A,\n                                                  p 81. [note: 6]CA 151/2009, Respondent’s Supplemental Core Bundle\n                                (“RSCB”),\n                        pp 54–56. [note: 7]Joint Record of Appeal, vol 5B,\n                                pp 4023–4025. [note: 8]CA 151/2009, RSCB,\n                                p 61. [note: 9]CA 151/2009, RSCB,\n                p 62. [note: 10]CA 151/2009, ACB vol 2B, pp 415 and\n                            417. [note: 11]CA 151/2009, RSCB,\n                                p 60."
    }
}