{
    "case_title": "Tan Kheng Chun Ray\n      v\n      Public Prosecutor",
    "ncitation": "[2012] SGCA 10",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      Choo Han Teck J",
    "sections": {
        "Introduction": "1       This was an appeal against the sentence imposed\n                    by the High Court Judge (“the Judge”) inPP v\n                        Tan Kheng Chun Ray[2011] SGHC 183 (“the\n                    GD”). The Appellant pleaded guilty to seven charges under the Misuse of\n                    Drugs Act (Cap 185, 2008 Rev Ed) (“the Act”). The\n                    charges, as well as the sentences meted out by the Judge in respect of each\n                    charge (which have been placed in parentheses), were as follows:[note: 1] First Charge(22 years’\n                        imprisonment and 15 strokes of the cane) That you, Tan Kheng Chun Ray, on the\n                            10thday of\n                        October 2009 at about 11.45 p.m., at the Woodlands Checkpoint Arrival Car\n                        Green Channel, Singapore, did import into Singapore a controlled drug\n                        specified in Class ‘A’ of the First Schedule to the Misuse of\n                        Drugs Act, Chapter 185, to wit, four (04) packets of\n                        granular/powdery substance containing not less than 14.99 grams of\n                        Diamorphine, without any authorisation under the said Act or the Regulations\n                        made thereunder, and you have thereby committed an offence under\n                        section 7 and punishable under section 33 of the Misuse of Drugs\n                        Act, Chapter 185. Second Charge(5 years’\n                        imprisonment and 5 strokes of the cane) That you, Tan Kheng Chun Ray, on the\n                            10thday of\n                        October 2009 at about 11.45 p.m., at the Woodlands Checkpoint Arrival Car\n                        Green Channel, Singapore, did import into Singapore a controlled drug\n                        specified in Class ‘A’ of the First Schedule to the Misuse of\n                        Drugs Act, Chapter 185, to wit, two (02) packets of crystalline\n                        substance containing not less than 1.12 grams of Methamphetamine,\n                        without any authorisation under the said Act or the Regulations made\n                        thereunder, and you have thereby committed an offence under section 7\n                        and punishable under section 33 of the Misuse of Drugs Act,\n                        Chapter 185. Third Charge(8 months’\n                        imprisonment) That you, Tan Kheng Chun Ray, sometime on the\n                            10thday of October 2009, in Malaysia,\n                        did consume a Specified Drug listed in the Fourth Schedule to the Misuse of\n                        Drugs Act, Chapter 185, to wit, Methamphetamine, without any\n                        authorisation under the said Act or the Regulations made thereunder, and you\n                        have thereby committed an offence under section 8(b)(ii) read with\n                        section 8A and punishable under section 33 of the Misuse of Drugs\n                        Act, Chapter 185. Fourth Charge(3 months’\n                        imprisonment) That you, Tan Kheng Chun Ray, on the\n                        10thday of October 2009 at about 11.45\n                        p.m., at the Woodlands Checkpoint Arrival Car Green Channel, Singapore, did\n                        have in your possession utensils intended for the consumption of a\n                        controlled drug, to wit, one (01) glass tube, one (01) empty\n                        glassware with one (01) insert and one (01) glass pipe, and one\n                        (01) empty straw which were found to be stained with Methamphetamine,\n                        without any authorisation under the said Act or the Regulations made\n                        thereunder, and you have thereby committed an offence under section 9 and\n                        punishable under section 33 of the Misuse of Drugs Act, Chapter 185. Fifth Charge(3 months’\n                        imprisonment) That you, Tan Kheng Chun Ray, on the 10thday\n                        of October 2009 at about 11.45 p.m., at the Woodlands Checkpoint Arrival Car\n                        Green Channel, Singapore, did have in your possession utensils intended for\n                        the consumption of a controlled drug, to wit, five (05) empty glassware\n                        and eighteen (18) glass pipes, without any authorisation under the said Act\n                        or the Regulations made thereunder, and you have thereby committed an\n                        offence under section 9 and punishable under section 33 of the\n                        Misuse of Drugs Act, Chapter 185. Sixth Charge(3 months’\n                        imprisonment) That you, Tan Kheng Chun Ray, on the\n                        11thday of October 2009 at about 7.46 p.m.,\n                        at No. 1, Queensway #08-63, Queensway Tower, Singapore, did have in\n                        your possession utensils intended for the consumption of a controlled drug,\n                        to wit, one (01) empty glassware with two (02) inserts which were found to\n                        be stained with Methamphetamine, without any authorisation under the said\n                        Act or the Regulations made thereunder, and you have thereby committed an\n                        offence under section 9 and punishable under section 33 of the\n                        Misuse of Drugs Act, Chapter 185. Seventh Charge(3 months’\n                        imprisonment) That you, Tan Kheng Chun Ray, on the 11thday\n                        of October 2009 at about 7.46 p.m., at No. 1, Queensway #08-63,\n                        Queensway Tower, Singapore, did have in your possession a controlled drug\n                        specified in Class ‘C’ of the First Schedule to the Misuse of\n                        Drugs Act, Chapter 185, to wit, three (03) tablets containing Nimetazepam,\n                        without any authorisation under the said Act or the Regulations made\n                        thereunder, and you have thereby committed an offence under section 8(a) and\n                        punishable under section 33 of the Misuse of Drugs Act, Chapter 185. 2       The Judge sentenced the Appellant to a total\n                    sentence of 27 years’ imprisonment with 20 strokes of the cane.\n                    In arriving at this decision, the Judge ordered the sentences in respect of the\n                    First and Second charges to be served consecutively pursuant to s 18 of the\n                    Criminal Procedure Code (Cap 68, 1985 Rev Ed (see now s 307 of\n                    the Criminal Procedure Code (No 15 of 2010)), with the sentences in respect\n                    of the Third to Seventh charges to run concurrently with the sentences in\n                    respect of the First and Second charges. We allowed the appeal to the extent\n                    that the total sentence was reduced to 22 years and 8 months’\n                    imprisonment with 20 strokes of the cane, and now give the detailed grounds\n                    for our decision.",
        "The Facts": "3       The Appellant is a 30 year old Singaporean\n                    who was educated in Perth, Australia. At the time of his arrest, he was a\n                    regular with the Republic of Singapore Navy. He had no antecedents prior to\n                    committing the present offences. The facts pertaining to the commission of the\n                    offences may be summarised as follows.[note: 2]On 10 October\n                    2009, at approximately 11.45pm, the Appellant drove his motor car alone into\n                    Singaporeviathe Woodlands Checkpoint. At the\n                    Woodlands Checkpoint, the Appellant was directed by an officer of the\n                    Immigration and Checkpoints Authority (“ICA”) to Lane 6 of\n                    the Arrival Car Green Channel Zone for an inspection. 4       During the inspection, the ICA officers\n                    discovered a box of tissues on the floor behind the driver’s seat. Various\n                    glassware and glass pipes were found inside the tissue box. The ICA officers\n                    then activated officers of the Central Narcotics Bureau (“CNB”)\n                    for assistance. Upon inspection by the CNB officers, the following items were\n                    found within the vehicle: (a)     One red plastic bag behind the radio\n                        console containing two packets of granular/powdery substances wrapped in a\n                        newspaper; (b)     One\n                        orange plastic bag inside the compartment below the handbrake, which also\n                        contained two packets of granular/powdery substances wrapped in a newspaper;\n                        and (c)     One black\n                        pouch in the compartment below the radio console, which contained two\n                        packets of crystalline substance, a glass tube, a glass pipe and a\n                        straw. 5       The aforesaid items were seized by the CNB\n                    officers and the Appellant was placed under arrest. Analysis of the exhibits\n                    seized from the Appellant during his arrest at the Woodlands Checkpoint revealed\n                    the following contents: 30.91 grams of diamorphine;[note: 3]1.12 grams of\n                        methamphetamine;[note: 4]and two sets of\n                    utensils intended to be used for consumption of drugs. These exhibits formed the\n                    subject matter of the First, Second, Fourth and Fifth charges\n                        (see[1]above). 6       After his arrest, the Appellant was accompanied\n                    by CNB officers to his residence. Upon searching his residence, three tablets\n                    (which were subsequently analysed and found to contain nimetazepam) and one\n                    glassware with two inserts (which was subsequently analysed and found to be\n                    stained with methamphetamine) were found. The Appellant was also subjected to a\n                    urine test which revealed that he had consumed methamphetamine. The Third, Sixth\n                    and Seventh charges arose from this set of facts (see[1]above). 7       According to the Appellant, he was in financial\n                    difficulties in the years 2008 and 2009. These difficulties emanated from\n                    escalating credit card and mobile phone bills which amounted to approximately\n                    $13,000. In order to settle his bills, the Appellant borrowed money from family\n                    and friends. The Appellant was subsequently approached by a person by the name\n                    of Eric on 10 October 2009 in Johor Bahru. Eric proposed that the Appellant\n                    import drugs into Singapore in exchange for payment of $2,500. The drugs were to\n                    be passed on to a courier after the Appellant arrived in Singapore. The\n                    Appellant was acquainted with Eric prior to 10 October 2009 as they used to\n                    have drinks together. The Appellant agreed to Eric’s proposal as he was\n                    keen to obtain the sum of $2,500. Thereafter, the Appellant gave Eric the keys\n                    to his car for the latter to load drugs onto the car. After Eric had loaded\n                    drugs onto the Appellant’s vehicle, the Appellant drove back to Singaporeviathe Woodlands Checkpoint where he was\n                    arrested. Investigations further revealed that the Appellant had consumed\n                    methamphetamine in Johor Bahru prior to his arrest, and that he had admitted\n                    ownership over the drug utensils which formed the subject matter of the Fourth\n                    to Seventh charges.",
        "The Judge’s decision on the appropriate sentence": "8       The factors weighted by the Judge in arriving at\n                    the sentences imposed were succinctly stated at [17] of the GD, as follows: The circumstances and conduct of the [Appellant] before and\n                        after his arrest are also important matters to be considered. I kept in mind\n                        the mitigating factors, i.e that he had pleaded guilty to all the charges,\n                        that he had co-operated in the investigations and that he had no\n                        antecedents. I also took into account other factors: (a)    at 30 years old he is in the prime of his\n                                life; (b)    he is reasonably well-educated; (c)    he has a steady job; (d)    his accumulated debt of $13,000 was not large,\n                                and was incurred by him in credit card and mobile phone\n                                expenses; (e)    he was not put under pressure to commit the\n                                offences, but was tempted by the allure of quick cash, as his\n                                counsel put it; and (f)    he would have faced the death penalty on\n                                conviction if the quantity of diamorphine was not reduced by the\n                                prosecution. 9       The Judge also clearly explained his decision\n                    not to impose the minimum sentence in respect of the First Charge\n                        (at [19] of the GD). In doing\n                    so, the Judge considered that the actual quantum of diamorphine imported by the\n                    Appellant (30.91 grams) was considerable and was actually more than twice\n                    the quantity which could have attracted the mandatory death sentence, and that\n                    there were no compelling extenuating circumstances in the commission of the\n                    offence. 10     Crucially, and most relevantly to the present\n                    appeal, the Judge held (at [21] of\n                    the GD) that the one-transaction rule (discussed at[13]below) did not apply in respect of the First and Second\n                    charges. As such, the Judge was of the view that he was not constrained in\n                    ordering the sentences in respect of the First and Second charges to be served\n                    consecutively. In the Judge’s view, a total sentence of\n                    27 years’ imprisonment with 20 strokes of the cane was\n                    appropriate. The Judge’s reasoning was primarily set out at [29] of the\n                    GD, as follows: In the present case, the [Appellant] had rendered his services to Eric to\n                        import a substantial quantity of diamorphine from Johor Bahru into\n                        Singapore. In addition to that, he was importing methamphetamine into\n                        Singapore on his own account, he was consuming drugs, and he had other drugs\n                        in his residence and was in possession of utensils for drug consumption. He\n                        was fortunate that the prosecution reduced the quantity of diamorphine in\n                        Charge 1 so that the capital punishment would not be imposed. Looking\n                        at all the circumstances, an effective sentence of 27 years\n                        imprisonment is not disproportionate to the [Appellant’s] total\n                        culpability.",
        "The issues before this court": "11     As already mentioned at the outset of this\n                    judgment, the appeal is one in relation to sentence. In this regard, the law as\n                    to when appellate courts will interfere with sentences meted out by trial courts\n                    was succinctly stated by Chan Sek Keong CJ, delivering the grounds of\n                    decision of this court in PP v UI [2008] 4 SLR(R) 500 (“PP v\n                    UI”), as follows (at [12]): It is, of course, well established (see,inter alia,Tan Koon Swan v PP[ 1985-1986] SLR(R) 976 andOng Ah Tiong v\n                            PP[2004] 1 SLR(R) 587) that an appellate court\n                        will not ordinarily disturb the sentence imposed by the trial court except\n                        where it is satisfied that: (a)    the trial judge erred with respect to the\n                                proper factual basis for sentencing; (b)    the trial judge failed to appreciate the\n                                materials placed before him; (c)    the sentence was wrong in principle;\n                            or (d)    the sentence was manifestly excessive or\n                                manifestly inadequate, as the case may be. 12     Counsel for the Appellant, Mr Subhas\n                    Anandan (“Mr Anandan”), informed this court thatnochallenge was being mounted against theindividualsentences meted out by the Judgevis-a-viseach charge. Rather, the thrust of the\n                    Appellant’s arguments was that the Judge should not have ordered the\n                    sentences meted out in respect of the First and Second charges to be served\n                    consecutively. What the Appellant was seeking, therefore, was a reduction of the\n                    overall sentence by reconfiguring the sentences which the Appellant was to serve\n                    consecutively. This approach to the appeal by Mr Anandan was, in our view,\n                    fair and eminently sound as the sentences metedvis-a-viseach individual charge were, in our view, consistent\n                    with the relevant sentencing precedents and could not be challenged on any of\n                    the grounds stated inPP v UI(at[11]above). Two specific issues arose from the\n                    contention put forth by Mr Anandan: firstly, whether the one-transaction\n                    rule applied in respect of the First and Second charges; and secondly, if the\n                    one-transaction rule applied, whether the total sentence meted by the Judge\n                    could nevertheless be justified.",
        "Whether the one-transaction rule applied in respect of the First and\n                Second charges": "13     The nature of the one-transaction rule was\n                    discussed by V K Rajah J in the Singapore High Court decision ofPP v Law Aik Meng[2007]\n                    2 SLR(R) 814 (“Law Aik\n                    Meng”), as follows (at [52]): The one-transaction rule requires that where two or more\n                        offences are committed in the course of a single transaction, all sentences\n                        in respect of those offences should be concurrent rather than consecutive:Maideen Pillai v PP[1995]\n                        3 SLR(R) 706;Kanagasuntharam v PP[1991] 2 SLR(R) 874 (“Kanagasuntharam”). Prof Andrew Ashworth inSentencing and Criminal Justice[(24(f)]\n                        supra) at p 245 interpreted theraison\n                            d’êtrefor the “single transaction”\n                        principle in terms of proximity in timeandproximity in type of offence. Such an interpretation\n                        was also adopted by Dr D A Thomas inPrinciples of Sentencing(Heinemann, 2nd Ed, 1979)\n                            (“Principles of\n                        Sentencing”), who opined at p 54: The concept of ‘single transaction’ may be held to cover a\n                            sequence of offences involving a repetition ofthe\n                                same behaviourtowards thesame\n                                victim... provided the offences are committedwithin a relatively short space of time.\n                            [emphasis added] 14     And, in the Singapore High Court decision ofPP v Firdaus bin Abdullah[2010]\n                    3 SLR 225 (“Firdaus”),\n                    Chan Sek Keong CJ observed thus (at [27]–[28]): 27     The “one transaction” rule,\n                        together with the totality principle, provides a useful guide for the court\n                        to assess whether concurrent or consecutive sentences should be imposed when\n                        an offender has done a criminal act or acts which have resulted in a\n                        plurality of offences. A related principle that should be borne in mind is\n                        where an offender is convicted of various offences arising from what is\n                        essentially one incident, his overall sentence should reflect his role and\n                        culpability in the incident as a whole.The rationale\n                            underpinning these principles is that of proportionality in\n                            punishment: seeJeffery bin Abdullah v\n                            PP[2009] 3 SLR(R) 414 at [16] andPP v Law Aik\n                            Meng[2007] 2 SLR(R) 814 (“Law Aik Meng”) at [60]. 28    Put simply, the\n                            essence of the “one transaction” rule is that where two or\n                            more offences are committed in the course of a single transaction, all\n                            sentences in respect of these offences should be concurrent rather than\n                            consecutive (the rule is, however, subject to the qualification in\n                            s 18 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed)\n                            in Singapore). The English Court of Appeal observed inR v Peter John Kastercum(1972) 56 Cr App R\n                            298 at 299-300 that: [W]here several offences are tried together and arise out of the same\n                            transaction, it is a good working rule that the sentences imposed for\n                            those offences should be made concurrent.The reason\n                                for that is because if a man is charged with several serious\n                                offences arising out of the same situation and consecutive sentences\n                                are imposed, the total very often proves to be much too great for\n                                the incident in question. That is only an ordinary working\n                                rule; it is perfectly open to a trial judge in a case\n                            such as the present to approach this in one of two ways. If he thinks\n                            that the assault on the police officer is really part and parcel of the\n                            original offence and is to be treated as an aggravation of the original\n                            offence, he can reflect it in the sentence for the original offence. If\n                            he does that, it is logical and right that any separate sentence for the\n                            assault should be made concurrent. On the other hand, and, as this Court\n                            thinks, a better course, in cases where an offender assaults the police\n                            in an effort to escape, the sentence for the principal offence can be\n                            fixed independently of the assault on the constable, and the assault on\n                            the constable can be dealt with by a separate and consecutive sentence.\n                            [emphasis added] This approach was approved by the Court of Appeal inV\n                            Murugesan v PP[2006] 1 SLR(R) 388\n                            (“Murugesan”) at [34]. InLaw Aik Meng, the court also endorsed Prof\n                        Andrew Ashworth's remarks inSentencing and Criminal\n                            Justice(Cambridge University Press, 4th Ed, 2005) at\n                        p 244 that the “one transaction” rule “seems to be\n                        little more than a pragmatic device for limiting overall sentences rather\n                        than a reflection of a sharp category distinction”, which\n                        consequently hindered the definition of what constituted a single\n                        transaction (at [56]). In that sense, the rule is really just another\n                        way of formulating the totality principle. [emphasis in original] 15     Much would, however, depend onthe precise facts and circumstances of the casethat are\n                    before the court concerned. Hence, none of the elements of proximity referred to\n                    in the preceding paragraph is conclusive (see, for example, the Singapore High\n                    Court decisions ofMeeran bin Mydin v PP[1998]\n                    1 SLR(R) 522, especially at [12] andFricker Oliver v PP[2011] 1 SLR 84, especially at [25]). This is perhaps why Chan CJ\n                    observed, inFirdaus(at [31]), that\n                    “[r]ecent case law illustrates the uncertain boundaries of the\n                    ‘one-transaction’ principle”. As importantly, the\n                    one-transaction rule ought to be applied in acommonsensicalway as well (see, for example,perChan CJ inFirdaus(at [38]), where the learned Chief Justice observed that\n                    “[u]ltimately, any analysis must take a commonsensical view as to what\n                    forms part of a single transaction”.). 16     A qualification must, however, be noted in\n                    respect of the one-transaction rule: that it is not meant to be an inflexible\n                    rule which inhibits the imposition of deterrent consecutive sentences when\n                    appropriate. As Rajah J pertinently observed inLaw Aik\n                        Meng(at [55] and [56]): 55    It is also\n                            appropriate to reiterate that the one-transaction rule should not be\n                            construed as a hard and fast rule rigidly applied across the board. In\n                            this context, inKanagasuntharam([52]supra), Yong CJ observed at\n                            [6]: The general rule, however, is not an absolute\n                                rule. The English courts have recognised that there are\n                            situations where consecutive sentences are necessary to discourage the\n                            type of criminal conduct being punished: seeR v\n                                Faulkner(1972) 56 Cr App R 594, R v\n                                Wheatley(1983) 5 Cr App R (S) 417 andR v Skinner(1968) 8 Cr App R (S) 166.The applicability of the exception is said to depend on the\n                                facts of the case and the circumstances of the offence.\n                            It is stated in broad and general terms and although it may be\n                            criticised as vague, it is necessarily in such termsin order that the sentencer may impose an appropriate sentence in\n                                each particular case upon each particular offender at the particular\n                                time the case is heard. [emphasis added] Further, in recognising that the one-transaction rule is not\n                        carved in stone and should be applied sensibly, the Court of Appeal inV Murugesan v PP[2006]\n                        1 SLR(R) 388 (“V\n                        Murugesan”) also referred to the case ofR v Peter John Kastercum(1972) 56 Cr App R\n                        298, where the English Court of Appeal had considered the principles for\n                        determining whether sentences for convictions of a substantive offence and\n                        of assault on a police officer should run concurrently or consecutively. The\n                        English Court of Appeal had rationalised the one-transaction rule, at\n                        299-300, in the following terms (seeV\n                            Murugesanat [34]): [W]here several offences are tried together and arise out of the same\n                            transaction, it is a good working rule that the sentences imposed for\n                            those offences should be made concurrent. The reason for that is because\n                            if a man is charged with several serious offences arising out of the\n                            same situation and consecutive sentences are imposed, the total very\n                            often proves to be much too great for the incident in question.That is only an ordinary working rule;\n                                ...[emphasis added] 56    Indeed, inSentencing and\n                                Criminal Justice([25(b)]supra), Prof Ashworth has also perceptively remarked\n                            that one stumbling block in constructing a workable definition of a\n                            “single transaction” for the one-transaction rule is that\n                            “it seems to be little more than a pragmatic device for limiting\n                            overall sentences rather than a reflection of a sharp category\n                            distinction”: see p 244. Therefore, where consecutive\n                            sentences are in keeping with the gravity of the offences, courts should\n                            not impose concurrent sentences simply because they feel fettered by the\n                            presumed operation of the one-transaction rule. I am persuaded in any\n                            event that even if the offences in the present case might conceivably be\n                            perceived as part of a single transaction, consecutive sentences are\n                            nonetheless not only more appropriate here, they are in fact dictated by\n                            the gravity of the offences involved. Reference may also be made toFirdaus(at [29] and [38]). 17     The Judge in the present case considered that\n                    the one-transaction rule did not apply in respect of the First and Second\n                    Charges because the drugs in respect of each of the two charges were imported\n                    for different purposes: the diamorphine was imported for the specific purpose of\n                    passing on to a drug courier whilst the metamphetamine was imported for the\n                    Appellant’s own consumption. During the hearing before us, the Prosecution\n                    – not surprisingly – supported this reasoning of the Judge. On\n                    closer analysis, however, such reasoning yields, with respect, counterintuitive\n                    results. We elaborate by considering a hypothetical situation. If the Appellant\n                    had imported the methamphetamine for the purpose of passing it on to a drug\n                    courier (the same purpose for which he had imported the diamorphine), the\n                    one-transaction rule would apply in his favour. This, in our view, would be an\n                    unsatisfactory application of the one-transaction rule because importing drugs\n                    for the purpose of trafficking is more serious than importation of drugs for\n                    one’s own consumption. Such a view is founded upon the fact that\n                    trafficking in drugs generally carries stiffer penalties as compared to\n                    possession and/or consumption of drugs (see the Second Schedule to the Act for\n                    the prescribed penalties). Given that it is trite that motive in committing an\n                    offence is a relevant sentencing consideration (see, for example, the Singapore\n                    High Court decision ofZhao Zhipeng v PP[2008]\n                    4 SLR(R) 879 at [37]), it would, with respect, be wrong, on the facts\n                    of this particular case, to reject the one-transaction rule and sentence a less\n                    culpable offender to a more severe sentence – especially when we bear in\n                    mind the fact (already referred to above at[15]) that the application of the one-transaction rule is also\n                    an exercise in commonsense. It also bears repeating that the application of this\n                    rule depends very much on the precise facts and circumstances of the case at\n                    hand (see also above at[15]). Looked at\n                    from the perspectives of logic, commonsense as well as the facts and\n                    circumstances of the present case, although counsel for the Prosecution,\n                    Mr Anandan Bala (“Mr Bala”), argued forcefully that\n                    there was a distinction between the offences brought against the Appellant\n                    pursuant to the First and Second Charges, this was, in our view, only aliteraldistinction. When the precise facts\n                    and circumstances are viewed in relation to theirsubstance(as opposed to mere form) in the context of both logic\n                    as well as commonsense, it seemed to us that there was indeed one transaction in\n                    so far as the Appellant’s actions with regard to the First and Second\n                    Charges were concerned. 18     In the circumstances, we are of the view that\n                    the one-transaction rule applies in respect of the First and Second charges as\n                    the offences underlying these charges were committed in one instance in so far\n                    as the Appellant had imported both the diamorphine and metamphetamine into\n                    Singapore at the same timeviathe same modus by\n                    transporting them in his vehicle. As a consequence, we are of the view that the\n                    sentences meted out in respect of the First and Second charges should be ordered\n                    to be served concurrently.",
        "Whether the total sentence meted by the Judge could still be\n                justified": "19     During the hearing before us, the Prosecution\n                    argued that, even if the one-transaction rule could be applied in favour of the\n                    Appellant, the total sentence meted out by the Judge may not necessarily be\n                    manifestly excessive. The Prosecution submitted (in accordance with the\n                    principle stated at[16]above) that courts\n                    are not inexorably constrained by the one-transaction rule, and that the\n                    severity of the present offences called for a deterrent sentence which may be\n                    meted out by ordering the sentences in respect of the First and Second charges\n                    to be served consecutively. In particular, the Prosecution relied upon in the\n                    Singapore High Court decision ofPP v Tan Kiam\n                        Peng[2007] 1 SLR(R) 522 (“Tan Kiam Peng”) (affirmed inTan Kiam\n                        Peng v PP[2008]1 SLR(R) 1 (“Tan Kiam Peng (CA)”)) where V K Rajah J\n                    highlighted the severity of drug related offences, as follows (at [8] (and see observations to like effect inTan Kiam Peng (CA)at [27]–[28] and\n                    [179]–[181])): The drug trade is a major social evil. While drug peddlers may not be\n                        visibly seen or caught taking away or damaging lives, they nonetheless\n                        inflict alarmingly insidious problems on society that have the potential to\n                        destroy its very fabric if left unchecked. Each successful trafficker has\n                        the disturbing potential to inflict enormous and enduring harm over an\n                        extremely wide circle of victims. Apart from the harm that drugs inflict on\n                        an addict’s well-being, drug trafficking engenders and feeds a vicious\n                        cycle of crime that inexorably ripples through the community. 20     Mr Bala further submitted that sentencing\n                    precedents in relation to offences of importing or trafficking in not less than\n                    14.99 grams of diamorphine (as was the case in relation to the First\n                    Charge) demonstrated that courts have meted out terms of imprisonment ranging\n                    from the statutory minimum sentence of 20 years’ imprisonment up to\n                    25 years’ imprisonment along with 15 to 20 strokes of the cane.\n                    In addition, Mr Bala argued that courts had previously calibrated sentences\n                    in the same manner as the Judge did. As such, it was argued that the total\n                    sentence of 27 years’ imprisonment and 20 strokes of the cane\n                    meted out by the Judge in this case was not manifestly excessive. In advancing\n                    this argument, the Prosecution relied, in the main, on two precedents. We will\n                    now address each of them in turn. 21     The first case relied upon by the Prosecution\n                    wasPP v Ng TengKianin criminal case no 5 of 2010 (unreported)\n                        (“Ng Teng Kian”) where the\n                    offender pleaded guilty to three charges under s 7 of the Act for importing\n                    not less than 14.99 grams of diamorphine, 15.58 grams of\n                    methamphetamine and one tablet containing nimetazepam. The offender was\n                    sentenced to 22 years’ imprisonment and 15 strokes of the cane\n                    for the charge of importing diamorphine, 5 years’ imprisonment and\n                    5 strokes of the cane for importing methamphetamine, and\n                    3 years’ imprisonment and 5 strokes of the cane for the\n                    remaining charge. The sentence of 22 years’ imprisonment and\n                    15 strokes of the cane was ordered to be served consecutively with the\n                    sentence of 5 years’ imprisonment and 5 strokes of the cane. The\n                    total sentence meted out was thus 27 years’ imprisonment and\n                    24 strokes of the cane. The offender inNg Teng\n                        Kianhad a dissimilar antecedent of attempting to enter a\n                    protected place without permission. A factor which immediately distinguishes the\n                    culpability of the Appellant from the offender inNg Teng\n                        Kianwas the difference in the quantities of methamphetamine\n                    imported: the offender inNg Teng Kianimported\n                    close to 15 times the amount of methamphetamine imported by the\n                    Appellant. 22     The second case relied upon by the Prosecution\n                    wasPP v Irzan Azhar bin Mohd Roziin criminal\n                    case no 22 of 2008 (unreported) (“Irzan Azhar bin\n                        Mohd Rozi”). The offender had pleaded guilty to two\n                    charges of engaging in conspiracies to traffic in not less than 14.99 grams\n                    of diamorphine and 8.36 grams of methamphetamine which were offences under\n                    section 5(1)(a) read with section 12 of the Act. For the charge of\n                    conspiring to traffic in not less than 14.99 grams of diamorphine, the\n                    offender was sentenced to 25 years’ imprisonment and 15 strokes\n                    of the cane. 5 years’ imprisonment and 5 strokes of the cane was\n                    meted out in respect of the remaining charge. Both sentences were ordered to be\n                    served consecutively thus resulting in a total sentence of 30 years’\n                    imprisonment with 20 strokes of the cane. By way of antecedents, the\n                    offender inIrzan Azhar bin Mohd Rozihad\n                    significant drug related antecedents, having previously trafficked in\n                    diamorphine – the very same offence he had been charged with inIrzan Azhar bin Mohd Rozi– and also had\n                    previously consumed morphine and methamphetamine, as well as possessed utensils\n                    for drug taking. The significant antecedents present inIrzan\n                        Azhar bin Mohd Roziwere completely absent in the present case as\n                    the Appellant, as already noted, is a first time offender. This fact, in and of\n                    itself, suffices in distinguishing the precedential value ofIrzan Azhar bin Mohd Rozifrom the present case. However, during\n                    the hearing before us, Mr Bala very fairly highlighted a further\n                    distinguishing factor which was not readily apparent: that the offender inIrzan Azhar bin Mohd Roziwas embroiled in a\n                    drug syndicate and that this factor featured prominently when the sentence was\n                    calibrated. 23     In view of the significant distinguishing\n                    factors between the present case and the precedents cited by the Prosecution (as\n                    discussed at[21]and[22]above), we were of the view that there were\n                    no significant aggravating factors in the present case which warranted the\n                    imposition of consecutive sentences in respect of the First and Second\n                    charges.",
        "Our decision on the appropriate sentence": "24     We are well aware of the evils of the drug\n                    trade and fully endorse the observations inTan Kiam\n                        Peng(reproduced above at[19]). However, for the reasons set out above, the appeal\n                    against the sentence imposed by the Judge is allowed and the sentence in respect\n                    of the First charge is to be served consecutively with the sentence in respect\n                    of the Third charge, while the terms of imprisonment imposed by the Judge in the\n                    court below in respect of the remaining charges are to be served concurrently.\n                    The total sentence is therefore 22 years and 8 months’\n                    imprisonment with 20 strokes of the cane.  [note: 1]See Record of Proceedings (“ROP”), Vol II,\n                                pp 1–4, and the GD at [18]. [note: 2]The Statement\n                                of Facts to which the Appellant pleaded guilty is found at ROP,\n                                Vol II, p 5. [note: 3]See ROP, Vol II,\n                        pp 11–17. [note: 4]Ibid,\n                                pp 18–21."
    }
}