{
    "case_title": "Lee Wei Kong (by his litigation representative Lee Swee\n                Chit)\n      v\n      Ng Siok Tong",
    "ncitation": "[2012] SGCA 4",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This is an appeal against the assessment of\n                    damages made by the High Court Judge (“the Judge”) in a suit\n                    instituted by the Appellant, who was injured in a motor accident where the\n                    Appellant was a pedestrian and the Respondent was the driver of a\n                taxi.",
        "Background": "2       On 2 January 2005, the Appellant was\n                    crossing Jurong East Ave 1 at a pedestrian crossing when he was knocked down by\n                    the Respondent’s taxi. At the time of the accident, the Appellant was aged\n                    18 and was just about to commence his second and final year at Anglo-Chinese\n                    Junior College (“ACJC”). He was severely injured and was admitted\n                    to the National University of Singapore Hospital (“NUH”) where an\n                    emergency craniotomy was carried out to remove large blood clots from his brain.\n                    He was in a coma for some 17 days. On 15 February 2005, he was transferred\n                    to Tan Tock Seng Rehabilitation Centre where he remained for rehabilitation\n                    until 10 June 2005. 3       On 11 April 2006, the Appellant commenced\n                    Suit No 215 of 2006 against the Respondent. On 31 January 2008, by consent,\n                    interlocutory judgment was entered in the Appellant’s favour with the\n                    Respondent being held 75% liable for the accident. On 12 March 2009, as the\n                    Appellant still could not manage himself and his affairs, his father was\n                    appointed, pursuant to the Mental Disorders and Treatment Act (Cap 178,\n                    1985 Rev Ed), as his Committee of Person and Estate. 4       The assessment of damages was carried out by the\n                    Assistant Registrar (“the AR”) in 2009 and damages were eventually\n                    assessed at a total of $1.3m (on a 100% liability basis). Both parties were\n                    dissatisfied with the AR’s decision, with the Respondent filing an appeal\n                    in Registrar’s Appeal No 440 of 2009 (“RA 440/2009”) and the\n                    Appellant filing an appeal in Registrar’s Appeal No 445 of 2009\n                    (“RA 445/2009”).",
        "The medical evidence": "5       As to be expected, much of the evidence adduced\n                    at the assessment was of a medical nature. Dr Lai Chan See\n                    (“Dr Lai”), a specialist in occupational medicine engaged by\n                    the Respondent’s lawyers, stated that the physical injuries suffered by\n                    the Appellant from the accident were the following: •\n                Severe traumatic head injuries, with (a) fracture of the left zygoma and fracture of the left temporal bone\n                            that extended to the base of skull (b) large left parieto-temporal extradural haematoma with severe mass\n                            effect that caused a midline shift of the brain, (c) bilateral frontal subdural haematomas (d) subarachnoid haemorrhage (e) right brain contusion, and •\n                Fracture of the\n                                6thcervical vertebra Emergency craniotomy was done to remove the extradural and subdural\n                        haematomas. Post-operative scans revealed that the massive extradural\n                        haematoma had caused a kinking of the posterior cerebral artery as it ran\n                        over the tentorium, leading to infarction [tissue death due to lack of\n                        oxygen] of that part of the brain supplied by this artery. During the post-operative period, he developed bacteraemia, pneumonia and\n                        urinary tract infection requiring antibiotic therapy. He also had seizures\n                        that required anticonvulsants for control. Tracheostomy was done on\n                        12.01.2005 so that he could be mechanically ventilated through a respirator.\n                        ... 6       In December 2008, nearly four years after the\n                    accident, Dr Lai noted that the following physical and cognitive\n                    disabilities still remained[note: 1]: [C]ognitive impairment affecting his memory, concentration and\n                        reasoning [S]peech impairment with dysphasia and dysarthria [L]eft lateral squint [R]ight homonymous hemianopia [blindness in right visual field] [S]light muscle incoordination of the limbs affecting his balance [I]mpairment of sphincteric control resulting in urinary and bowel\n                        urgency Dr Lai stated that these impairments were permanent. For a better\n                    understanding of the Appellant’s continuing cognitive disabilities, the\n                    following part of Dr Lai’s report is pertinent: His memory is poor – he recalled only two out of six shopping items\n                        given to him after a lapse of ten minutes. His concentration is also poor.\n                        He gave up doing the serial-7 subtraction test after only four attempts\n                        (100, 93,87,69, then gave up). He expects a return of $1.30 change on\n                        giving a $10.00 note to buy a bottle of coffee powder costing $8.90. He\n                        tires easily, yawning repeatedly during the latter half of the consultation.\n                        Although his passion is in art and after studying a year in an art school he\n                        cannot name a single Singaporean artist. He knows the names of a few western\n                        artists – Dali, Monet, Rambrandt [sic],\n                        Van Gogh – but cannot give a simple description of their painting\n                        styles. On a couple of occasions he talked about God, which was out of\n                        context with the topic at hand. [emphasis in bold italics in original] 7       A psychometric test using the Weschler Adult\n                    Intelligence Scale – Third Edition in September 2008 had the following\n                        results[note: 2]: [The Appellant’s] skills in understanding verbal information,\n                        thinking with words and expressing thoughts in words (VIQ) are classified as\n                        being in the ‘Borderline’ to ‘Low Average’ range and\n                        ranked in the 10th percentile. His skills in solving non-verbal problems, in\n                        working quickly and efficiently with visual information (PIQ) are classified\n                        as being in the ‘Average’ range and ranked in the\n                            42ndpercentile. ... Based on an analysis of the individual subtests, it appears that [the\n                        Appellant]fared much better on tasks that tapped on\n                            nonverbal reasoning... and that required\n                            him to recall facts that he had learnt previously…. Howeverwhen it came\n                            to tasks that required verbal reasoning and expressive language... [the Appellant’s] performances\n                            on these subtests was significantly weaker. Moreover he also displayed\n                            significant difficulties with tasks that tapped on attention and working\n                            memory. [emphasis added] 8       As for psychological disabilities,\n                    Dr Adrian Wang Chee Cheng (“Dr Wang”), a consultant\n                    psychiatrist, testified that when he first examined the Appellant in August 2008\n                    (about three and a half years after the accident), the latter had a diminished\n                    sense of self-restraint, impaired judgment, increased impulsivity and occasional\n                    temper outbursts[note: 3].\n                    Dr Wang diagnosed the Appellant as suffering from “organic brain\n                    syndrome” with an increased risk of developing depressive, anxiety and\n                    psychotic disorders. In a subsequent consultation in October 2008, Dr Wang\n                    concluded that the Appellant had, in addition, developed “organic\n                    psychosis” which manifested itself in disorganised speech and rambling,\n                    and undue suspicion and paranoia[note: 4].",
        "Decisions Below": "9       In this appeal, only the awards in respect of\n                    four heads of claim are being challenged by the Appellant. For convenience, they\n                    are set out in the table below, together with an indication as to the amount\n                    given by the AR for each head of claim as well as the variations made by the\n                    Judge: Head of damageThe ARThe JudgePain and suffering$285,000$160,000Loss of earning\n                                    capacity$600,000$250,000Future psychiatric\n                                    treatment$144,000$90,000Mother’s pre-trial loss of\n                                            income$72,600Award set asideTotal$1,101,600$500,000   We will examine each of these four heads of claimseriatim.",
        "Pain and suffering": "10     In determining the damages for pain and\n                    suffering, the AR preferred the component approach over the global approach\n                    where, as in this case, “the resultant deficits are identifiable and\n                    discrete”. She awarded damages in the sum of $285,000, made up as\n                    follows: (a)     in respect of structural damage to\n                        the whole body, $80,000. She added that the Appellant’s head injuries\n                        were no less serious than those inTan Yu Min Winston (by\n                            his next friend Tan Cheng Tong) v Uni-Fruitveg Pte Ltd[2008]\n                        4 SLR(R) 825 (“Winston\n                        Tan”); (b)     in respect of psychological damage, $60,000. She noted\n                        that the injury to the frontal lobe of the brain left the Appellant with\n                        mood instability and changes in personality and outlook; (c)     in respect of cognitive damage and\n                        post-traumatic amnesia, $80,000. She noted that there was no way that the\n                        Appellant could resume mainstream education and that he struggled to cope\n                        with his art course at LaSalle College of the Arts\n                        (“LaSalle”); (d)     for bladder and bowel dysfunction, $20,000;\n                    and (e)     for loss of\n                        motor function and residual spasticity, $45,000. 11     However, the Judge held that this award of\n                    $285,000 was “unjustified” (seeLee Wei Kong\n                        (by hislitigation representative Lee Swee\n                        Chit) v Ng Siok Tong[2010] SGHC 371\n                    (“Judgment”) at [20]). He\n                    stated that the component approach and the global approach were not functionally\n                    distinct: while the global approach arrives at a global figure after taking into\n                    account the component figures, the component approach starts by adding up the\n                    component figures and ends by ensuring that the aggregate amount is reasonably\n                    reflective of the totality of the injury (Judgment at [15]). 12     The Judge noted that, as inWinston Tan, no precedents were cited by the AR in support of\n                    her awards on the various components (Judgment at [17]). He found that there were five helpful precedents where\n                    the awards were arrived at on a global basis. Of the five cases, two were\n                    particularly helpful.Toon Chee Meng Eddie v Yeap Chin\n                        Hon[1993] 1 SLR(R) 407 (“Eddie Toon”) presented the most serious injuries, and the\n                    plaintiff was awarded $160,000 for pain and suffering in 1993.ChongHwaYin (committee of person and estate ofChongHwaWee, mentally disordered) v Estate of Loh Hon Fock,\n                        deceased[2006] 3 SLR(R) 208 presented injuries which\n                    were most similar to that suffered by the Appellant, and the plaintiff there was\n                    awarded $120,000 in 2006. After considering the cases, taking into account the\n                    different types of injuries and residual disabilities, their respective degrees\n                    of severity, the vintage of the awards and the ages of the plaintiffs in those\n                    cases, the Judge reduced the AR’s award to $160,000, representing a\n                    reduction of $125,000 (Judgment at [20]). 13     Before us, the Appellant advances two\n                    arguments against the reduction made by the Judge on this head of damage: (a)     that the Judge erred in law by\n                        having regard to cases which were decided using the “global\n                        approach” and/or which were not comparable to the injuries and\n                        disabilities suffered by the Appellant; and (b)     that the Judge erred in fact by failing to\n                        accord sufficient weight to the injuries and disabilities suffered by the\n                        Appellant. On the other hand, the Respondent argues that\n                    the Judge was not manifestly wrong in his factual finding: he had clearly taken\n                    into account the severity of the Appellant’s injuries and residual\n                    disabilities, and the fact that the Appellant had made great improvements since\n                    the accident. 14     The decision of this court inChai Kang Wei Samuel v Shaw Linda Gillian[2010]\n                    3 SLR 587 (“Samuel Chai”)\n                    (at [48]) established that the component\n                    approach is no more than a systematic instrument to aid the court to determine\n                    what would be a fair and reasonable quantification for a particular injury or\n                    disability, having regard to precedents. Therefore, previous cases will still\n                    remain relevant insofar as the particular injuries or post-accident residual\n                    disabilities are sufficiently similar: they provide the backdrop in which the\n                    court can place the award in order to determine whether it represents a\n                    reasonable sum reflective of the totality of the injury. We, therefore, are\n                    unable to accept the Appellant’s argument that the Judge was wrong in law\n                    to have considered cases that had been decided using the global\n                approach. 15     The remaining issue which we need to consider\n                    is whether the Judge had failed to accord sufficient weight to the injuries and\n                    residual disabilities suffered by the Appellant in coming to his decision. It is\n                    well-settled that this court will not interfere with an award of damages merely\n                    because it is of the opinion that a different amount might be more appropriate:\n                    seeChow Khai Hong v ThamSekKhow and another[1991]\n                    2 SLR(R) 670 and Jeffrey Pinsler SC gen ed,Singapore Court Practice 2009(LexisNexis, 2009) at\n                    para 57/1/16. Of the cases reviewed by the Judge,MuhamadIlyas Bin Mirza Abdul Hamid v KwekKhimHui[2004] SGHC 12 (“MuhamadIlyas”), where only $80,000\n                    was awarded, was a case where the residual mental disabilities suffered by the\n                    plaintiff were significantly less severe (ie, he\n                    was still highly intelligent and suffered no deterioration in IQ, except for\n                    some memory deterioration) and he suffered little residual physical\n                    disabilities. In contrast, the injuries suffered by the plaintiff inEddie Toon(at[12]above), a case decided in 1993, were comparatively the most serious. There, the\n                    plaintiff, who was seven and a half years of age at the time of the accident,\n                    had suffered a fractured left skull with underlying brain damage, was paralysed\n                    on the right side of his body, and was unable to walk or speak. He also suffered\n                    from epilepsy, minimal control over his bladder and bowels, and had the\n                    intellectual ability of a six-month to one-year old child. The High Court upheld\n                    an award of $160,000. Lastly, inKoh Chai Kwang v Teo Ai Ling\n                        (by her next friend, Chua Wee Bee)[2011] 3 SLR 610\n                        (“Teo Ai Ling (CA)”) (at [68]),\n                    this court held that a total award of $110,000 to the plaintiff for pain and\n                    suffering (comprising $70,000 for physical injuries and $40,000 for cognitive\n                    injuries) was not manifestly excessive. 16     There has not been any case where, for pain\n                    and suffering, an award close to $285,000 had been made. While we recognise that\n                    the physical injuries and mental disabilities suffered by the Appellant here are\n                    not the same as those in the three cases discussed above, some aspects are more\n                    severe while other aspects are less severe. Taking a broad view of things, we do\n                    not think that the Judge’s award of $160,000 could be regarded as being\n                    manifestly inadequate. We thus will not disturb the Judge’s finding on\n                    this head of claim.",
        "Loss of earning capacity/Loss of future earnings": "17     As regards whatseemed to\n                        be an award for loss of earning capacity, the AR explained her\n                    award of $600,000 as follows: … Given the current state of the patient, I think it is fair to\n                        assume that he will not be able to undertake any employment that requires\n                        advanced cognitive skill or fine motor skills. This effectively rules out a\n                        professional course. ... In my opinion, the greatest deficit for the patient\n                        is mental rather than physical. ... It would appear that the patient might\n                        however, with perhaps some assistance, be able to take on some routine or\n                        rudimentary work in future that would provide some minimum wage. I have also considered that the patient is of a very young age, 22 years\n                        old, and has a long road ahead of him. In this regard, I am making an award\n                        of $600,000. We will explain later (at[27]below) why we say this “seemed to be an award for loss of earning\n                    capacity” and its significance. 18     The Judge noted that the AR did not explain\n                    how she arrived at the amount of $600,000 and that the Appellant had failed to\n                    cite a single precedent to support his claim for $800,000 before the AR. In\n                    arriving at his decision, the Judge stated that the salient features of the\n                    present case were as follows (Judgment at [39]): (a)     the Appellant could undertake simple\n                        undemanding employment, but would not be able to work and earn at the level\n                        of a person who had completed his secondary education (which he had) or\n                        junior college education (which he probably would have, but for the\n                        accident); (b)     the\n                        Appellant’s ability to work was significantly diminished and this\n                        diminution extended over the whole of his working life;\n                    and (c)     the\n                        Appellant’s potential earning level without the diminution was\n                        uncertain. The Judge also took into account four recent\n                    cases in which awards of between $100,000 and $180,000 were made for loss of\n                    earning capacity (“LEC”). He noted that before these cases, such\n                    awards were conservative, citingAssessment of Damages:\n                        Personal Injuries and Fatal Accidents(LexisNexis, 2001, 1st Ed)\n                    which listed 52 awards made between the years 1990 and 2000, with the highest at\n                    $75,000. The Judge accordingly substituted the AR’s award of $600,000 with\n                    an award of $250,000 (Judgment at [40]). 19     Before us, the Appellant’s essential\n                    point is that the Judge erred in law by relying on cases with dissimilar facts,\n                    and by failing to have regard toWinston Tan(at[10]above),Samuel\n                        Chai(at[14]above) and the\n                    High Court’s decision inTeo Ai Ling (by her next\n                        friend Chua Wee Bee) v Koh Chai Kwang[2010] 2 SLR 1037\n                        (“Teo Ai Ling (HC)”). The\n                    Appellant also argues that the Judge erred by failing to accord sufficient\n                    weight to the evidence of the Appellant’s severe handicap in the labour\n                    market. 20     The Respondent argues that the High\n                    Court’s approach inTeo Ai Ling (HC)cannot\n                    be applied in this case because there was insufficient evidence here to adopt a\n                    multiplier/multiplicand method of calculation. The Respondent also argues that\n                    the precedents which dealt with LEC are instructive in establishing the pattern\n                    and limits of such awards. He emphasised that the AR’s award was wholly\n                    out of line with the precedents and that the Judge’s award of $250,000 is\n                    now the highest reported award for LEC. 21     We agree with the Judge thatprima facie, the AR’s award of $600,000 for LEC\n                    does in fact appear manifestly excessive in light of the previous case law where\n                    a maximum of $180,000 was awarded inNirumalan V KanapathiPillay v Teo Eng Chuan[2003]\n                    3 SLR(R) 601 (“Nirumalan”). Indeed, the Judge noted that his award of\n                    $180,000 inNirumalan“was higher than it\n                    should have been” (Judgment at [38]). At this point, we observe that in examining the amounts\n                    awarded in past cases, especially those made before 2000, one must not overlook\n                    the significant changes in the purchasing power per unit of currency and the\n                    state of the labour market. 22     Awards of $100,000 for LEC were made inTan Siew Bin Ronnie v Chin Wee Keong[2008]\n                    1 SLR(R) 178 (“Ronnie\n                    Tan”),MuhamadIlyas(at[15]above) andWinston Tan(at[10]above).Ronnie\n                        Tanwas a case involving a lawyer who was earning $10,000 monthly\n                    before the accident and whose cognitive abilities and knowledge were not\n                    impaired. By contrast, inNirumalan, the plaintiff\n                    was a lawyer who was earning an even greater amount of $35,000 per month. While\n                    he did not suffer any immediate loss of income, the court found that the\n                    injuries suffered by the plaintiff inNirumalandid affect his ability to work. For this reason, the court awarded him $180,000\n                    for LEC. InMuhamadIlyas, the plaintiff (who was serving his National Service) was\n                    still very intelligent after the accident and he still possessed the\n                    prerequisites to be exceptionally successful at whatever career he chose to\n                    pursue, although there was some deterioration in his memory function. InWinston Tan, the High Court found that, after\n                    the accident, the plaintiff continued to perform slightly above average in his\n                    ‘O’ Level examinations and at his polytechnic. Although the\n                    plaintiff inWinston Tanwas slightly handicapped\n                    in terms of memory function and cognitive ability, the court found that these\n                    residual disabilities were not a major stumbling block preventing the plaintiff\n                    from making further progress and achieving his employment goals. In comparison\n                    with these four precedents, two distinguishing features must be noted as regards\n                    the Appellant. First, at the time of the accident, the Appellant was only a\n                    junior college student and had yet to embark upon any employment. Secondly, the\n                    Appellant’s cognitive and psychological disabilities were much more severe\n                    than those suffered by the plaintiffs in each of those four precedents. These\n                    are factors which would have a bearing on the quantum of LEC to be awarded to\n                    the Appellant or would have a bearing on the grant of damages under a different\n                    basis, such as that for loss of future earnings\n                (“LFE”). 23     At this juncture, we refer to two more recent\n                    cases for illustrative purposes,viz,Samuel Chai(at[14]above) andTeo Ai Ling (CA)(at[15]above). Both cases were not referred to by\n                    the Judge. However, we must add that this court’s decision inTeo Ai Ling (CA)was published after the Judge had made\n                    his decision in this case. InSamuel Chai, the AR\n                    awarded A$15,000 for LEC, but this was increased to A$50,000 by the High Court.\n                    On appeal, this court reinstated the AR’s award of A$15,000, primarily on\n                    the basis that the plaintiff was not really disadvantaged by her injuries. As\n                    such, there was a low risk that she would be unable to obtain another job. The\n                    long-term disabilities suffered by the plaintiff inSamuel\n                        Chaiwere primarily physical in the sense that she found\n                    sustained periods of work to be too painful and exhausting. More importantly,\n                    the plaintiff there did not suffer from long-term cognitive or psychological\n                    disabilities because she had an excellent recovery after the\n                accident. 24Teo Ai Ling (CA)involved a polytechnic student who failed to complete her course because of her\n                    head injuries. The AR in that case awarded $120,000 for LEC. The High Court\n                    substituted this award with one for LFE valued at $492,000. On further appeal by\n                    the defendant, this court reinstated the AR’s award for LEC at $120,000 on\n                    a provisional basis, invoking the power conferred upon the court under paragraph\n                    16 of the First Schedule to the Supreme Court of Judicature Act (Cap 322,\n                    2007 Rev Ed) to make such an award. The effect of the provisional award was\n                    that if the plaintiff’s monthly income should, in four to six years’\n                    time, be shown to be less than $1,832, the damages due to the plaintiff would be\n                    recomputed on the basis of LFE, with a deduction being made for the sum of\n                    $120,000 already paid provisionally as LEC to the plaintiff. This approach would\n                    ensure that there is minimal likelihood of overpayment. 25     InTeo Ai Ling\n                        (CA), the plaintiff suffered from significant cognitive\n                    impairment to the extent that she had difficulty finding her way around her\n                    polytechnic campus even with the aid of a map. The AR in that case, after\n                    hearing the medical evidence, thought that there was a real possibility that she\n                    might fail her polytechnic examinations (as she in fact did) due to her\n                    cognitive impairment. Her ability to remember things was significantly affected.Prima facie,Teo Ai Ling\n                        (CA)resembles the present case more closely than all the other\n                    cases cited. As indicated earlier (at[24]above), the award given by the AR in that case for LEC at $120,000 was\n                    substituted by the High Court with an award for LFE at $492,000. 26     Having reviewed the precedents, it would\n                    appear that the Judge’s award of $250,000 in the present case as LEC is\n                    high. But viewed in the context of the disabilities suffered by the Appellant,\n                    where his capacity to work and earn has been almost destroyed, except for the\n                    ability to carry out some very simple tasks, the quantum is inadequate. It seems\n                    to us that the present case may not be an instance where damages should be\n                    awarded on the basis of LEC; it should instead be awarded on the basis of LFE\n                    (see[30]and[33]below). As mentioned (at[18]above), the Appellant’s memory and cognitive\n                    abilities are so badly impaired that he can no longer do the work which a person\n                    with ‘O’ Level qualifications could have done. Indeed, based on the\n                    evidence from the principal of ACJC (see[36]below), it is reasonable to assume that the Appellant would\n                    have, but for the accident, passed the ‘A’ Level examinations.\n                    Following from that, the Appellant would have had a fair chance of pursuing\n                    tertiary education. This is a relevant factor towards determining the kind of\n                    employment that the Appellant would have, in all likelihood, been able to engage\n                    in but for the accident. 27     We will now turn to consider some\n                    circumstances which suggest that the parties, as well as the AR, regarded LEC\n                    and LFE as being similar or synonymous. In the statement of claim, the Appellant\n                    claimed damages for “loss of earning capacity”. In his closing\n                    submissions before the AR, the Respondent stated (at para 66) that\n                    “counsel for the [Appellant] had informed the Court that the [Appellant]\n                    is looking at a sum of $800,000.00 for loss of future earnings/loss of earning\n                    capacity based on the case of [Winston\n                    Tan]” and went on to state (at para 73) that “the\n                    [Respondent] submits that an award made to the [Appellant] for loss of earning\n                    capacity/loss of future earnings should not exceed a sum of $150,000.00 to\n                    $180,000.00”. In the AR’s grounds of decision, she held that\n                    “In terms of [the Appellant’s] future earnings, I accept that an\n                    appropriate award in this case should be one for loss of earning capacity,\n                    rather than loss of future earnings”. Yet, in the formal judgment that\n                    was extracted, this sum was listed as: (iii)Loss of future earnings (k) $600,000.00 for loss of future earnings Although the AR did not expressly state the basis upon\n                    which she arrived at the sum of $600,000, we are inclined to think that she must\n                    have adopted the multiplicand/multiplier method, which is what the courts would\n                    typically do when making an award for LFE. Otherwise, we are unable to see the\n                    basis upon which she could simply leap from $180,000 (the highest sum to date\n                    quoted to her for LEC awards) to the sum of $600,000. From the foregoing, it\n                    would appear that counsel for the parties, as well as the AR, did not quite\n                    appreciate the distinction between LEC and LFE. What was clear was that the\n                    parties, as well as the AR, were seeking to work out the appropriate sum to\n                    compensate the Appellant for the losses arising from the fact that he can no\n                    longer do any real work, apart from the simplest of tasks, in view of the severe\n                    impairment of his memory and cognitive abilities. In other words, the\n                    Appellant’s capacity to work has effectively been destroyed. While there\n                    is no evidence of this, common sense tells us that only a very exceptional\n                    employer, prompted perhaps by compassion (such as a charitable institution),\n                    will employ someone like the Appellant (who is so mentally impaired) to do the\n                    simplest of tasks. While the appeal filed by the Appellant is against the\n                    decision of the Judge to reduce the sum of $600,000 awarded by the AR to the sum\n                    of $250,000 for what is seemingly LEC, we would regard the present appeal as one\n                    seeking to enhance the amount either on the basis of LEC or LFE. 28     Although the Appellant took the position that\n                    the award should be for LEC, the proper characterisation of his loss is one for\n                    the courts to decide ultimately. There is no injustice to the Respondent because\n                    he had in fact argued before the AR and the Judge that an award for LFE (and not\n                    LEC) should be made. The Respondent’s position was that the LFE award\n                    should not exceed an amount between $150,000 and $180,000 (taking into account a\n                    multiplicand of between $300 and $600, a multiplier of between 15 to 18 years,\n                    CPF contributions and the award given inEddie\n                        Toon(at[12]above))[note: 5].",
        "Distinction between LEC and LFE": "29     This court, inSamuel\n                        Chai(at[14]above),\n                    examined the difference between an award for LFE and that for LEC. Ordinarily,\n                    an award for LFE is granted where the plaintiff is in employment at the time of\n                    trial, but because of his injuries, is unable to earn as much as what he earned\n                    prior to the accident. The difference in earnings would form the basis of the\n                    multiplicand. However, if at the time of the trial his earnings are the same as,\n                    or even higher than, what he earned before the accident and, if he should lose\n                    his current job, he would suffer a disadvantage in getting re-employed due to\n                    the injuries sustained, then he would be entitled to claim for LEC, but not for\n                    LFE. InSamuel Chai, this court even postulated\n                    (at[25]) the possibility of a plaintiff, in\n                    appropriate circumstances, being awarded both LFE and LEC. 30     In a case such as the present which concerns a\n                    young person who was still studying when he was injured and whose earning\n                    capacity has either been seriously curtailed or destroyed, the traditional\n                    manner of awarding LEC or LFE (as described at[29]above) poses a challenge as it is premised on the injured\n                    victim being already in employment at the time of the accident. However, the law\n                    is dynamic and has developed to meet the demands of justice in particular cases.\n                    The fact that the injured person is young and has not commenced work at the time\n                    of the accident should not be an impediment to the grant of an award for LFE.\n                    The courts have in fact so ruled. InCroke and another v\n                        Wiseman and another[1982] 1 WLR 71, the injured victim\n                    was only 21 months of age at the time of the accident and seven and a half years\n                    old at the time of the trial. The English Court of Appeal adopted a\n                    multiplier/multiplicand approach to determine the proper quantum of damages,ie, the award was for LFE. Griffiths LJ stated\n                    (at 83D–E): The judge assessed the future loss of earnings at £5,000 per annum.\n                        He arrived at this figure by taking thenational average\n                            wagefor a young man. In my view, he was justified in doing\n                        so. This child came from an excellent home, the father is an enterprising\n                        man starting his own business and the mother is a qualified teacher; they\n                        have shown the quality of their characters by the care they have given their\n                        child and their courage by the fact they have continued with their family\n                        even after this disaster befell them. The defendants cannot complain that\n                        they are unfairly treated if against this background the judge assumes the\n                        child will grow up to lead a useful working life and be capable ofat least earning the national average wage. [emphasis added] 31     A similar multiplier/multiplicand approach was\n                    also adopted in several other cases,eg,Cassel v Riverside Health Authority[1992] PIQR Q168\n                        (“Cassel”) (injured at birth;\n                    eight years old at trial) andA (suing by her litigation\n                        friend Mrs H) v Powys Local Health Board[2007] EWHC 2996 (injured at birth; 16 years old at trial). In some\n                    cases, the English courts took into account the plaintiff’s good family\n                    background by increasing the multiplicand beyond the average national wage,eg,Cassel(about two and a half times the average national wage for male non-manual\n                    workers) andAlmond v Leeds Western Health\n                        Authority[1990] 1 Med LR 370 (one and a half times the average\n                    national wage). 32     However, it has been suggested that the\n                    importance of family background should diminish if the child plaintiff is older\n                    at the time of the accident. Goldrein QC and de Haas QC gen eds,Butterworths Personal Injury Litigation Service(LexisNexis, June 2011) states (at [6001]): As the child gets older, the process of calculating loss of earnings gets\n                        easier. Family background remains relevant, but this diminishes as a picture\n                        of the claimant’s own potential can be obtained through his/her\n                        academic achievements. It is essential that school reports and test results\n                        are obtained along with witness statements from school teachers. This suggestion makes sense because as the child grows older and\n                    attends school, his intellectual capacity will show in his school results. Thus,\n                    reliance on his school results, rather than family background, would be a more\n                    reliable gauge to assess his potential and, in turn, determine what vocation or\n                    profession he is likely to embark on, if his earning capacity had not been\n                    impaired or destroyed by the accident. 33     In Singapore, the courts have also, in\n                    appropriate cases, awarded LFE to injured plaintiffs who were young at the time\n                    of the accident and had yet to commence work at the time of the trial: see,eg,Peh Diana and another v\n                        Tan Miang Lee[1991] 1 SLR(R) 22 andEddie Toon(at[12]above).\n                    As is to be expected, the main difficulty with quantifying LFE in such cases is\n                    in determining the multiplicand, as many imponderables come into play.\n                    Undeniably, in this exercise, the court is being asked to look into the\n                    future.",
        "The Appellant’s position": "34     The Appellant was a junior college student\n                    whose ‘A’ Level studies were brought to a halt due to the accident.\n                    Instead, he pursued something which he had an interest in and thus enrolled for\n                    the Diploma in Arts at LaSalle. He passed the first year, obtaining the\n                    following results: ModuleOverall markStudio Practice45Contemporary and Contextual\n                                        Studies69   Ms Juliet Choo Lay Hiok (“Ms Choo”), an\n                    educational guidance officer, testified that all the written academic work for\n                    the first year had not been done by the Appellant personally[note: 6].\n                    During the second year, he obtained the following results for two\n                        modules[note: 7]: ModuleOverall markPainting 1A54Complementary Practice\n                                    1A54   The maximum mark was 100, while the passing mark was 40[note: 8]. His parents testified\n                    that the Appellant had struggled and required constant guidance and assistance.\n                    He found it difficult to understand what was being taught and had memory\n                    problems. Dr Lai concluded that it was uncertain if the Appellant could\n                    complete his course because the latter had experienced difficulties dealing with\n                    the theoretical and conceptual aspects of art which would be of greater emphasis\n                    in the more senior years[note: 9]. Dr Lai also opined that even if the\n                    Appellant managed to become a professional painter eventually, he would not be\n                    able to manage his business properly. If the Appellant was unable to succeed as\n                    a painter, he would not be able to work as an art instructor due to his\n                    cognitive impairments, dysarthria (slurring of speech) and dysphasia (difficulty\n                    selecting words to use). Ms Choo suggested that although the Appellant\n                    passed the two modules in his second year, this was done on compassionate\n                    grounds by LaSalle in light of the accident and because his skills in painting\n                    were “reasonably ok”[note: 10]. She also testified that she had\n                    discussed with LaSalle the possibility of “annotating his certificate to\n                    indicate that it’s not a real degree or diploma, if he finishes after\n                    three years”. This was supported by a letter from LaSalle which stated\n                    that “[s]pecial consideration and support were given” to the\n                        Appellant[note: 11]. 35     It was not really in doubt that but for the\n                    accident, the Appellant had the intellectual capacity to obtain his\n                    ‘A’ Level qualifications. His secondary school[note: 12]and junior college\n                    teachers testified that he was a bright and determined person. His\n                    ‘O’ Level results were as follows[note: 13]: SubjectGradeEnglish LanguageA2Combined HumanitiesA2MathematicsA2Additional\n                                    MathematicsB3PhysicsB3ChemistryB3BiologyB3Art & DesignA1ChineseC5   His results for the “Promotional” examinations at the end of his first year of\n                    junior college were as follows[note: 14]: SubjectGradeMathematicsFEconomics (Revised)CEnglishEArt and DesignBGeneral PaperC5Chinese\n                                    ‘AO’C5   36     Ms Kelvyna Tan Swee Ai\n                    (“Ms Tan”), the principal of ACJC, explained that the\n                    first-year “Promotional”\n                    examinations are “strict and conservative” and that it is taken by\n                    students who have completed only one year of education with another year to go\n                    before taking the ‘A’ Level examinations. She stated that a guiding\n                    principle for predicting the expected grades in the ‘A’ Level\n                    examinations was that they should beat leasttwo\n                    grades up from the“Preliminary”examination results (which is the examination taken by second-year students two\n                    to three months before the actual ‘A’ Level\n                        examinations)[note: 15]. As\n                    such, the Appellant’s predicted grades for the actual examinations would\n                    at least be as follows: SubjectGradeMathematicsDEconomics (Revised)AEnglishCArt and DesignAGeneral PaperB3   We observe that these predicted grades may be an underestimate as they\n                    are based on the Appellant’s“Promotional”examination results, which were held\n                    about ten months before the “Preliminary” examinations. 37     Ms Tan testified that the Appellant took\n                    Mathematics for the ‘A’ Level examination as he intended to become\n                    an architect and that he was a student who was able to balance his hectic\n                    schedule as a key rugby player with his academic studies[note: 16]. His junior college art\n                    teacher testified that the Appellant was passionate about art and was an\n                    expressive artist with well-developed skills[note: 17]. We recognise that there is an element\n                    of speculation as to whether the Appellant would have, but for the accident,\n                    become an architect. But as a matter of probabilities, it would not be without\n                    any foundation for this court to hold that in the circumstances, he had more\n                    than an even chance of obtaining a university degree. 38     It can be seen (from[34]above) that on his own, the Appellant will unlikely be able\n                    to obtain his Diploma in Arts from LaSalle. Besides his parents helping him with\n                    the theoretical aspects of the course work, the indications are that LaSalle\n                    will be awarding him the Diploma in Arts out of sympathy. As his memory and\n                    cognitive functions are not likely to get any better, he is not likely to be\n                    able to work as a professional art teacher. Of course, as Dr Lai pointed\n                    out, it is not necessary to have a diploma in painting to become a successful\n                    professional painter. However, it is likely that the Appellant will not be able\n                    to do well as a professional painter either, given his severe cognitive and\n                    psychological disabilities as well as his being blind in the right eye. The\n                    Appellant’s situation is more similar to that inLai\n                        Chi Kay and others v Lee Kuo Shin[1981–1982] SLR(R) 71 at [27], where it was held that the LFE of the plaintiff had\n                    clearly crystallised because he, a fourth-year medical student, was no longer\n                    able to work as a doctor and it was “highly improbable” that he\n                    would ever be gainfully employed. Whereas the plaintiff inTeo Ai Ling (CA)was gainfully employed at the time of the\n                    hearing, here, given that the Appellant has not been employed and is unlikely\n                    ever to be, his earning capacity has been effectively destroyed. 39     We turn next to consider the more difficult\n                    question of arriving at an appropriate multiplicand. This court observed inTeo Ai Ling (CA)(at [35]) that the court would adopt a particular\n                    occupation as the appropriate career model where (a) the plaintiff had indicated\n                    a clear intention to enter that particular occupation, (b) there was a strong\n                    probability that he would be able to enter that occupation, and (c) that\n                    occupation provided a sufficiently certain career model for the estimation of\n                    LFE. In this case, unlike the situation inTeo Ai Ling\n                        (CA)where the plaintiff there had, at the time of the accident,\n                    already embarked on a business course at a polytechnic, the Appellant has not\n                    been admitted into an architectural school. It may therefore be too speculative\n                    to hold that he would likely have qualified as an architect but for the\n                    accident. Nonetheless, it seems to us fair, and not too optimistic, to hold that\n                    he was likely to obtain a university degree, and accordingly, to determine the\n                    multiplicand on that basis. 40     According to the Ministry of Manpower Report\n                    on Wages in Singapore 2009, the median monthly gross starting salary for\n                    university graduates was $2,700. InTeo Ai Ling\n                        (CA), this court took into account themaximumsalary which a polytechnic diploma holder could earn on\n                    the civil service scale. In the present case, there is no evidence at all which\n                    would enable this court to come to a conclusion as to the average or median\n                    earnings of a university graduate, say, over a period of 20 years. Indeed,\n                    recognising the innumerable pursuits which a university graduate could undertake\n                    and their varying successes, we do not think there will likely be any useful\n                    statistics. Of course, the pay scales applicable in the civil service (being the\n                    biggest employer in the country) to a university graduate could be of some\n                    assistance. But this evidence is not before the court. In the circumstances, we\n                    are left with only $2,700 as the national median starting pay of a university\n                    graduate. 41     The next consideration which we must take into\n                    account is the likely income that the Appellant will, after the accident, be\n                    able to earn from any pursuit which he may embark in the future. We have held\n                    (at[26]above) that in view of the\n                    Appellant’s disabilities, he is unlikely to be able to obtain any\n                    employment. We further explored (at[38]above) the possibility of the Appellant being employed as a professional artist\n                    or painter and here again, we do not think the prospects are that bright. Even\n                    if we take an optimistic view of the situation and say that the Appellant will\n                    be able to sell his works and earn some income, the figure which we can\n                    attribute to this pursuit will be highly speculative, to say the least. In any\n                    event, the multiplicand which we should adopt is really $2,700, plus an\n                    additional amount (“$x”) representing the sum which should be\n                    added to ensure that the total multiplicand will represent the average salary of\n                    a university graduate over a period of years (and not just the medianstartingsalary). On the evidence before us, what this\n                    additional $x sum should be cannot reasonably be ascertained. The same can be\n                    said about the income which the Appellant will likely earn, after the accident,\n                    as an artist or painter. For these reasons, we think, in the circumstances, that\n                    the fairest approach will be to offset these two factors, leaving us to take\n                    $2,700 as the reasonable multiplicand. 42     Finally, there remains the question of the\n                    appropriate multiplier. InTeo Ai Ling (HC), the\n                    multiplier used by the High Court was 20 years for a 23-year old female\n                    polytechnic student at the time of the hearing. However, as we have indicated\n                    (at[24]above), inTeo\n                        Ai Ling (CA), this court substituted the High Court’s award\n                    for LFE with a provisional LEC award without disapproving the multiplier adopted\n                    by the High Court in that case. In the present case, the Appellant was 22 years\n                    old at the time of the hearing before the AR. A multiplier of 20 years does not\n                    seem to be inappropriate in this appeal given that the Appellant here was (at\n                    the time of assessment before the AR) of nearly the same age as the plaintiff inTeo Ai Ling (CA). Therefore, the total award\n                    for LFE should be $2,700 x 12 months x 20 years = $648,000.",
        "Future psychiatric treatment": "43     We will now turn to consider the third\n                    disputed head of claim. The Judge noted that although the Appellant claimed only\n                    $121,200 (at $505 per month for 20 years), the AR awarded him $144,000 (at $600\n                    per month for 20 years). The Judge accepted Dr Wang’s testimony that\n                    there was a 70% to 80% probability that the Appellant would require long-term\n                    medication for five to ten years and that if after that period the\n                    Appellant’s condition remained unchanged, he would require the medication\n                    for life. The Judge, however, noted that Dr Wang did not state the cost of\n                    the treatment, and that the Respondent had calculated, based on charges incurred\n                    by the Appellant in 2008 and 2009, that the cost of treatment amounted to about\n                    $350 to $400 per month. 44     On the other hand, the Judge did not accept\n                    the Respondent’s argument that the award of expenses should be reduced\n                    because, if the Appellant were to receive treatment at a government-structured\n                    hospital instead of a private specialist, the expenses could be less than $350\n                    to $400 a month. In this regard, the Judge held that (Judgment at [42]): ... It is for the injured party to decide on the treatment that he is to\n                        receive, and he is entitled to claimreasonablecosts of treatment. He is not obliged to seek\n                        treatment or receive damages at the lowest costs available. ... [emphasis in italics in original] Thus, the Judge allowed the Respondent’s appeal by reducing the\n                    amount awarded under this head from $144,000 to $90,000 (at $375 per month for\n                    20 years).",
        "Analysis": "45     In considering this head of damage, we need to\n                    set out some essential facts. Dr Wang testified that he prescribed the\n                    following medication to the Appellant[note: 18]: (a)     between 14 October 2008 and\n                        9 December 2008, 2 mg of “Risperdal” per day;\n                    and (b)     between\n                        9 December 2008 and 31 January 2009, 5 mg of “Zydis”\n                        per day and 20 mg of “Magrilan” per day. 46     Dr Wang stopped prescribing\n                    “Risperdal” because the Appellant was not responding well to it.\n                    Although the new combination of “Zydis” and\n                    “Magrilan” had in fact worked well, Dr Wang switched the\n                    medication again because the Appellant complained of drowsiness and grogginess.\n                    Dr Wang then prescribed 10 mg of “Abilify” per day and 20 mg\n                    of “Magrilan” per day between 31 January 2009 and 4 July\n                    2009. Based on the invoices from Dr Wang, the average monthly costs of the\n                    different courses of medication were as follows: MedicationAverage monthly cost“Risperdal”$72“Zydis” and\n                                            “Magrilan”$189 + $27 = $216“Abilify” and\n                                            “Magrilan”$375 + $27 = $402   The total cost of consultation between 9 December 2008 and\n                    4 July 2009 was $1,260, which works out to be about $180 per\n                month. 47     The Respondent made the following arguments in\n                    support of his contention that the amount of $144,000 awarded by the AR under\n                    this head is not justified. First, the Appellant in fact claimed only for\n                    $121,200 as the cost of future treatment and $9,600 for transport to and from\n                    the hospital, making a total of $130,800. Secondly, the AR did not explain the\n                    basis upon which she adopted the multiplicand of $600 in calculating this head\n                    of damage and the Appellant’s contention that the multiplicand of $600 was\n                    based on the later invoices tendered cannot be substantiated. The following was\n                    all that the AR explained in relation to this point: ... I accept the evidence of Dr Wang that the patient’s organic\n                        brain syndrome may lead to certain psychoses which will require medical\n                        attention, and that there is a 70-80% chance that he will require long term\n                        medication and/or psychiatric attention. In this regard, I am making an\n                        award of $600 per month for psychiatric consultation and medication, where\n                        this is required. Based on a multiplier of 20 years, this works out to\n                        $144,000. 48     Thirdly, the Respondent argued that the award\n                    for future psychiatric expenses should be based not on more recent invoices for\n                    medicine which was more effective and had less side-effects, but on the invoices\n                    for the whole course of medication that had been prescribed regardless of the\n                    side-effects of any particular cocktail of medicines. On this basis, the\n                    Respondent argues that the Judge was right to adopt the figure of $350 to $400\n                    per month, which was the average cost of medication prescribed for the Appellant\n                    between 14 October 2008 and 4 July 2009. In the absence of any\n                    evidence from Dr Wang as to a fair estimate of the cost of future\n                    treatment, the only reliable source of evidence would be to look at past\n                    invoices. 49     On the other hand, the Appellant argues that\n                    the calculation advanced by the Respondent should not be accepted because it was\n                    based partly on medication that was discontinued by Dr Wang as being not\n                    effective or as a result of side-effects. The assessment should be based on the\n                    cost of medication which is best suited to the Appellant, meaning the last set\n                    of medication prescribed by Dr Wang. 50     We are unable to accept the arguments advanced\n                    by the Respondent for the simple reason that it would be wrong to make an award\n                    for future psychiatric treatment based on the cost of medication which has been\n                    found to be unsuitable to address the ailment and was therefore discontinued. It\n                    stands to reason that the court should only adopt the cost of medication which\n                    is regarded as being reasonably effective in remedying the ailment with minimal\n                    side effects. We have (at[46]above) stated\n                    the reason why Dr Wang switched medication from the combination of\n                    “Zydis” and “Magrilan” (“the first\n                    combination”) to that of “Abilify” and\n                    “Magrilan” (“the second combination”). While we note\n                    Dr Wang’s evidence that both combinations were of equivalent\n                        effectiveness[note: 19], we\n                    cannot disregard the fact that the first combination of medicine caused the\n                    Appellant drowsiness or grogginess, whereas the second combination did not. This\n                    at least indicates that the second combination is more suitable for the\n                    Appellant. Therefore, it is not unreasonable to adopt the cost of the second\n                    combination to work out the future cost of psychiatric treatment. 51     Besides the cost of the second combination of\n                    medicine (which is $402 per month and which we will round down to $400), there\n                    is the additional cost of consultation. The average cost of consultation between\n                    9 December 2008 and 4 July 2009 was $180 per month. The cost of\n                    consultation would naturally vary according to the frequency and length of each\n                    visit to the psychiatrist. Arguably, one may visit the psychiatrist only once a\n                    year in order to obtain a year’s supply of medication. However, this would\n                    clearly not be prudent in light of the fact that psychiatric medication often\n                    consists of drugs with a powerful effect on the central nervous system, and that\n                    therefore, the use of such drugs should be monitored periodically. The fee\n                    charged by Dr Wang for a short consultation was $90 per visit. However, it\n                    is also true that over time, the need for consultation will be reduced.\n                    Provision for one consultation per month would be adequate. The Appellant also\n                    claimed transport cost of $40 per month, seemingly based on two consultations\n                    per month. One consultation per month will require half that amount. Thus the\n                    cost of consultation and transport will add up to $110 per month. Adding this to\n                    the cost of medicine at $400, we arrive at the figure of $510 per\n                month. 52     Thus, the appropriate multiplicand here is\n                    $510 per month. Both the AR and the Judge used a multiplier of 20 years. As the\n                    Appellant was 22 years old at the time of the assessment, this means that he\n                    will be 42 years old when the amount awarded for future psychiatric costs is, in\n                    theory, depleted. In this regard, we note that inAng Leng\n                        Hock v Leo Ee Ah[2004] 2 SLR(R) 361, the High Court\n                    held (at [59]) that an award of future\n                    medical costs, unlike LFE, should be based on life expectancy rather than the\n                    retirement age. We agree. InDe Cruz Andrea Heidi v Guangzhou\n                        Yuzhitang Health Products Co Ltd and others[2003]\n                    4 SLR(R) 682, the High Court held (at [211]) that taking into account\n                    the vicissitudes of life, a fair multiplier would be two-thirds of the expected\n                    remaining 51 years of life (the 51 years was based on the average life\n                    expectancy of 80 years for females in Singapore). In the present case, there was\n                    no evidence before the court as to the average life expectancy of males in\n                    Singapore. Assuming that the Appellant is expected to live until 75 years of\n                    age, he would have had approximately 53 remaining years of life as at the time\n                    of the assessment. Two-thirds of this would be approximately 36 years. Given\n                    that Dr Wang testified that there was a possibility that life-long\n                    psychiatric treatment mightnotbe needed (see[43]above) and the fact that the entire\n                    sum forfuturepsychiatric treatment will be paid\n                    upfront as a lump sum, the multiplier of 20 years adopted by the AR and the\n                    Judge (which was not challenged by both parties) does not seem unreasonable.\n                    Thus, the total award for this head of claim is $510 x 12 months x 20 years =\n                    $122,400.",
        "Loss of income of the Appellant’s mother": "53     It is well-established that this head of\n                    damage is recoverable not because it is the mother’s loss, but because it\n                    isthe Appellant’s loss, being the\n                    reasonable cost of meeting the need created by the tort: seeDonnelly v Joyce[1974] 1 QB 454 (“Donnelly”) andKuanKian Seng v Wong Choon Keh[1995] SGHC 43. As Megaw LJ stated inDonnelly(at 461H–462C): We do not agree with the proposition ... that the plaintiff’s claim,\n                        in circumstances such as the present, is properly to be regarded as being\n                        ... “in relation to someone else’s loss,” merely because\n                        someone else has provided to, or for the benefit of, the plaintiff—the\n                        injured person—the money, or the services to be valued as money, to\n                        provide for needs of the plaintiff directly caused by the defendant’s\n                        wrongdoing. The lossisthe plaintiff’s\n                        loss. ... The plaintiff’s loss, to take this present case, is not the\n                        expenditure of money to buy the special boots or to pay for the nursing\n                        attention. His loss is the existence of the need for those special boots or\n                        for those nursing services, the value of which for purposes of\n                        damages—for the purpose of the ascertainment of the amount of his\n                        loss—is the proper and reasonable cost of supplying those needs. That,\n                        in our judgment, is the key to the problem. So far as the defendant is\n                        concerned, the loss is not someone else’s loss. It is the\n                        plaintiff’s loss. [emphasis in italics in original]",
        "Pre-trial loss of income": "54     We will now consider the final head of\n                    dispute. The basis upon which the AR made this award of $72,600 was explained in\n                    these terms: I accept the evidence of the parents that [the Appellant] required full\n                        time care at home after the accident. As a result, she [ie, the mother] had to give up her part-time employment as a\n                        teacher. I will therefore allow the claim for $72,600, for the period 2005\n                        – 2008. Two letters were produced in support of this claim[note: 20]. The first letter\n                    was sent on 31 December 2004 by the principal of Yuhua Education Centre\n                    (“the Centre”), a PAP Community Foundation kindergarten, to the\n                    Appellant’s mother, stating that her part-time employment had been\n                    converted to full-time employment from 1 January 2005 and that her monthly\n                    salary was to be increased from $550 to $1000. This letter was sent to the\n                    mother two days before the accident occurred on 2 January 2005. The second\n                    letter was sent on 4 May 2009 by the principal of the Centre. It stated\n                    that the mother resigned in June 2005 after taking six months ofunpaidleave to look after the Appellant. The principal\n                    of the Centre went on to state that the mother had been using the Centre’s\n                    facilities to conduct tuition classes in the evening since January\n                1994. 55     In RA 440/2009, the Respondent appealed\n                    against this award. The Judge allowed the appeal and set aside the award because\n                    he felt it was quantified “without an explanation or documentation on how\n                    that figure was arrived at” (Judgment at [47]). The Judge found that there was no evidence to support\n                    this claim because the two letters were not properly proved in\n                evidence. 56     The Appellant concedes that the two letters\n                    were not properly admitted into evidence for the purpose of proving the truth of\n                    their contents because the letters were just exhibits in the Appellant’s\n                    father’s affidavit of evidence-in-chief (“AEIC”) and the\n                    father was neither the writer nor the recipient of the letters. The Appellant\n                    argues, however, that both parties had agreed to the admission of the letters at\n                    the hearing before the AR. This argument is unfounded. As the Respondent points\n                    out, there was no agreement to admit the contents of the letters. In his closing\n                    submissions before the AR, the Respondent had clearly objected to the letters on\n                    the ground that they were hearsay evidence[note: 21]. 57     However, the Appellant contends that even if\n                    the letters were not properly admitted in evidence, there was, in any case,\n                    sufficient evidence before the AR upon which the award could have been made.\n                    First, the Appellant’s mother gave evidence in her AEIC that she had in\n                    fact resigned from her job to look after the Appellant. Secondly, the\n                    Appellant’s father testified that the mother,ie, his spouse with whom he was living, had in fact done so.\n                    These statements are not hearsay evidence but are direct evidence that the\n                    Appellant’s mother did, in fact, give up her full-time job to care for\n                    him. There is no good reason why such evidence of the Appellant’s parents\n                    should not be accepted. 58     The next issue relates to the remuneration\n                    which the Appellant’s mother had received from the job that she gave up.\n                    The Respondent argues that the mother’s evidence, that she was earning\n                    $550 per month as a part-time teacher before the accident, was self-serving and\n                    was uncorroborated by any documentary evidence. However, this argument goes to\n                    the weight of the evidence and will depend considerably on the finder of\n                    fact’s impression of the witness and her behaviour on the stand. As the AR\n                    evidently believed the evidence of the Appellant’s parents (see[54]above), there is no reason to disturb this\n                    finding in the absence of compelling evidence to the contrary. Moreover, being\n                    paid $550 a month for a part-time job as a teacher in a kindergarten in 2004 can\n                    hardly be viewed as extravagant. This remuneration does not appear to be\n                    unreasonable. The Respondent is unable to provide any plausible reason, other\n                    than a bare assertion, that the mother’s evidence is self-serving and\n                    should not be accepted. It bears noting that the mother’s evidence was not\n                    challenged during cross-examination. 59     A second ground advanced by the Respondent on\n                    this head of claim rests on the fact that the AR had already allowed an award\n                    for the engagement of a maid (which was affirmed by the Judge) and there was no\n                    evidence that two full-time caregivers were needed to care for the Appellant.\n                    Here, we note that the Appellant’s mother testified that a maid was needed\n                    first, to help in the Appellant’s physiotherapy and to move the Appellant\n                    around, and secondly, to help with the housework because she (ie, the mother) was preoccupied with taking care of the\n                        Appellant[note: 22]. This evidence was not challenged\n                    during cross-examination. Again, we cannot see any basis to interfere in this\n                    finding of the AR when there was evidence before the AR which supported\n                    it. 60     Therefore, there was evidence before the AR\n                    which could have supported an award for pre-trial loss of income. With respect,\n                    we think the Judge erred in stating that the award was made without factual\n                    basis. However, there is one aspect of the Respondent’s argument on this\n                    award which, in our view, merits consideration. This relates to the quantum.\n                    First, the mother did not suffer a complete loss of income because she still\n                    managed to give tuition at night, making an average of $1,000 a\n                        month[note: 23]. Before\n                    the accident, she taught at the Centre in the morning only. The housework and\n                    grocery shopping would be done in the afternoon while she would give tuition at\n                        night[note: 24]. If the mother were to commence full-time\n                    teaching at the Centre, it would not be unlikely that she would have to either\n                    give up some of the tuition classes at night in order to do the housework, or\n                    hire a maid to do the housework. This would mean that any additional income she\n                    would have earned as a full-time teacher would essentially be negated (or\n                    reduced substantially) by either losing part of the tuition income (through a\n                    reduction in tuition hours) or having to pay for a maid to do the\n                    housework. 61     Secondly, the award of $72,600 made by the AR\n                    in respect of the four-year period (from 2005 to 2008) amounted to approximately\n                    $1,500 per month. This figure cannot be supported from the evidence. The\n                    Appellant’s father admitted that the mother had been earning about $1,000\n                    a month from giving tuition at night before the accident, and that these classes\n                    continued after the accident. In other words, there was no reduction in tuition\n                    income after the accident. As for her salary at the Centre, if the accident had\n                    not occurred, she would have earned $1,000 per month as a full-time teacher.\n                    Although the two letters from the principal of the Centre were not properly\n                    adduced in evidence, both parents testified that this was the truth. We would\n                    also observe that earning $1,000 per month as a full-time kindergarten teacher\n                    is hardly excessive. However, as we have explained (at[60]above), the mother would have needed some domestic help if\n                    she were to take on the full-time job in the Centre. Thus, for the mother to\n                    earn $2000 per month, she would have to incur expenses to engage domestic help.\n                    Alternatively, she would have to cut down on the tuition classes and earn less.\n                    In either event, her net monthly income would have been less than $2000. Bearing\n                    in mind that post-accident the mother was still earning $1000 a month from\n                    giving tuition, and for the reasons alluded to in this paragraph and above (at[60]), it would not be unreasonable to\n                    assume that her actual loss was somewhere around $550 a month (ie, what the mother earned as a part-time teacher) and\n                    not $1000 a month. In the result, the loss of income of the mother for the four\n                    year period would have been only $26,400 (ie, $550\n                    x 12 months x 4 years). Thus, the AR’s award of $76,200 is manifestly\n                    excessive. 62     In the result, we hold that the Judge’s\n                    decision on this head of damage should be set aside. The AR’s award should\n                    be reinstated, but with the quantum reduced to $26,400.",
        "Future loss of income": "63     The AR rejected the Appellant’s claim\n                    for $251,802 as the mother’s future loss of income: the claim was computed\n                    at about $1,650 per month for 13 years (until the mother was 62 years old). We\n                    should, at this juncture, reiterate that (see[53]above) the rationale for this claim is not so much for the\n                    Respondent to pay compensation to the mother as such, who has suffered no\n                    injury, but rather to compensate the Appellant for the cost of having someone\n                    take care of him in the future, which role the mother is fulfilling. The\n                    mother’s loss of income, which she would otherwise have earned, is taken\n                    as the starting point to compute the reasonable expense which the Appellant\n                    would have to incur to obtain such care. The Appellant in RA 445/2009 appealed\n                    against the AR’s refusal to make an award for this head of claim. This\n                    appeal was rejected by the Judge on the basis of lack of evidence as the two\n                    letters from the principal of the Centre (see[54]above) constituted hearsay evidence. In the Notice of\n                    Appeal filed against the Judge’s decision, the Appellant appealed against\n                    that part of the Judge’s decision that decided that: 1.The award for pain and suffering and loss of\n                            amenities is reduced to $160,000.00; 2.The award for the loss of earning capacity is\n                            reduced to $250,000.00; 3.The award for costs of future psychiatric treatment\n                            is reduced to $90,000.00; 4.The award for the mother’s\n                                loss of income is set aside; and 5.The [Appellant] pays to the [Respondent] cost\n                            totaling $12,000.00 plus disbursements. [emphasis added] 64     What was set aside by the Judge was the\n                    mother’spre-trialloss of income. As\n                    regards the mother’s loss of future income, the Judge upheld the\n                    AR’s decision not to make any award on that. It would appear from the\n                    Appellant’s Case (at para 148) that the Appellant was under the\n                    mistaken impression that the Judge had also set aside the claim for the\n                    mother’s loss of future income of $251,802. Therefore, there may be a\n                    question mark as to whether the claim for the mother’s loss of future\n                    income is under appeal. However, when we examine the Appellant’s Case, we\n                    hardly see any submissions on this aspect of the claim. This is evident from the\n                    following extract of the Appellant’s Case (at paras 150 to\n                    152): 150. We respectfully submit that the order for the mother’s pre\n                        trial loss of income should be allowed because the Learned Registrar was in\n                        a position to assess the evidence of the mother and the witnesses and\n                        experts who testified that the mother was Wei Kong’s primary care\n                        giver. 151. Additionally, as he is not fit to manage his estate or his affairs,\n                        the mother would have to continue to be his primary care giver and should be\n                        compensated for the loss shehadsuffered on\n                        account of the accident that her son was involved in. 152. The Learned AR’s computation of pre trial loss of income is\n                        almost equivalent to the income she would have earned for six months at\n                        $1,000.00 a month. ($1,000 X 12 X 6 = $72,000). Taking into account that Wei\n                        Kong was in hospital for more than 5 months and there is evidence that he\n                        had to be rehabilitated at home with the mother’s close involvement,\n                        the award made for pre trial loss of income is fair and should stand. Although the Appellant is cognitively and psychologically impaired, he\n                    is now physically mobile and is able to perform basic domestic functions. He is\n                    not likely to require constant care by the mother. In the circumstances, we will\n                    not make any award on this item of claim.",
        "Judgment": "65     For the above reasons, we will allow the\n                    appeal in respect of the following heads of claim: (a)     the award by the Judge for loss of\n                        earning capacity at $250,000 is substituted by an award for loss of future\n                        earnings at $648,000; (b)     the award by the Judge for future psychiatric treatment is enhanced\n                        from $90,000 to $122,400; and (c)     there shall be an award for the Appellant’s\n                        mother’s pre-trial loss of income assessed at\n                    $26,400. In view of the fact that the Appellant has\n                    substantially succeeded in this appeal, the Appellant shall have two-third of\n                    the costs for this appeal as well as for the hearing before the Judge. There\n                    will be the usual consequential orders.  [note: 1]Record of\n                                Appeal (“RA”) 3 (B)\n                    539 [note: 2]RA 3 (B) 504 [note: 3]RA 3 (B) 498 [note: 4]RA 3 (B)\n                                506 [note: 5]RA 3 (E) 1354-1355; RA 3 (F)\n                        1464-1466 [note: 6]Core Bundle (“CB”) 83 [note: 7]RA 4 1775-1776 [note: 8]RA 3 (D) 1092 [note: 9]RA 3 (B)\n                        517-518 [note: 10]RA 3 (D)\n                                1078 [note: 11]RA 4\n                    1773 [note: 12]RA 3 (A) 306 [note: 13]RA 3 (A)\n                                307 [note: 14]RA 4\n                                1772 [note: 15]RA 4 1771 [note: 16]RA 3 (A) 140 [note: 17]RA 3 (A)\n                                175 [note: 18]CB\n                                61 [note: 19]CB 110 [note: 20]RA 3 (C) 961-962 [note: 21]Respondent’s Core Bundle 47, para\n                        164 [note: 22]RA 3 (A) 85-86, paras 11-12; RA 3 (D)\n                                1003-1004 [note: 23]RA 3 (C) 642, para 8 [note: 24]RA 3 (D) 1003 line 29 - 1004 line\n                        5"
    }
}