{
    "case_title": "Rainforest Trading Ltd and another\n      v\n      State Bank of India Singapore",
    "ncitation": "[2012] SGCA 21",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       This was an appeal against the\n                    decision of the judge (“the Judge”) inState Bank of India\n                        Singapore v Rainforest Trading Ltd and another[2011] 4 SLR 699\n                    (“the Judgment”). We dismissed the appeal and now give the detailed grounds for\n                    our decision.",
        "Factual background": "2       The facts relevant to the\n                    resolution of this appeal are not disputed (see the Judgment at[3]–[35]) and\n                    are set out briefly below.",
        "The parties": "3       The Respondent is a banking\n                    institution governed and regulated by the Monetary Authority of\n                    Singapore. 4       The First Appellant is a company\n                    incorporated in the British Virgin Islands. The Second Appellant is a private\n                    company incorporated in Singapore and a wholly owned subsidiary of the First\n                    Appellant. Mr Vikas Goel (“Mr Goel”) was previously the majority shareholder of\n                    the Second Appellant (see below at[7]),\n                    holding 99.99% of the issued share capital of the Second\n                Appellant. 5       Teledata Informatics Limited\n                    (“Teledata”) is a publicly listed company incorporated in India.\n                    Mr P K Padmanabhan (“Mr Padmanabhan”) is the founder and managing director of\n                    Teledata. 6       Baytech Inc (“Baytech”) is a\n                    company incorporated in the British Virgin Islands and is a wholly owned\n                    subsidiary of Teledata.",
        "The Facility Agreement": "7       On 10 November 2006, Teledata\n                    expressed to the Second Appellant its interest in investing in the Second\n                    Appellant. A share subscription agreement (“SSA”) dated 29 November 2006 was\n                    entered into between Mr Goel, the Second Appellant and Teledata.[note: 1]The SSA basically provided for\n                    a share swap arrangement. The First Appellant was to be incorporated for the\n                    purposes of the SSA. Mr Goel was to transfer his majority shareholding in the\n                    Second Appellant to the First Appellant in return for a 49% shareholding in the\n                    First Appellant. Teledata would invest approximately US$65m in equity in the\n                    First Appellant and would extend a further loan of US$40m to the First\n                    Appellant. The First Appellant would, in turn, use the monies and extend loans\n                    of up to US$60m to the Second Appellant. After payment of the requisite sums,\n                    Teledata would hold 51% of the shares in the First Appellant. 8       The SSA was subsequently amended\n                    four times.[note: 2]Under the amended SSA, Baytech was\n                    to be appointed as Teledata’s nominee for the purposes of subscribing to shares\n                    in the First Appellant pursuant to the SSA. 9       Around December 2006, Teledata\n                    decided to obtain financing from the Respondent. Upon the conclusion of\n                    negotiations, the Respondent entered into a Facility Agreement dated 22 February\n                    2007 (“the Facility Agreement”) with Baytech.[note: 3]Under the Facility Agreement, the\n                    Respondent agreed,inter alia, to provide a US$80m\n                    loan facility to Baytech. Clause 3.1 of the Facility Agreement states that the\n                    purpose of the Facility Agreement was for Baytech to use the monies borrowed\n                    under the Facility to obtain majority shareholding in the Second Appellant by\n                    acquisition of 51% of the shares in the First Appellant. 10     Numerous securities were\n                    provided to the Respondent pursuant to clause 4 of the Facility Agreement.\n                    Crucially, under clause 4(vi) of the Facility Agreement, 10,200,000 shares in\n                    the Second Appellant (representing 51% of the Second Appellant’s share capital)\n                    (“the Pledged Shares”) were to be “pledged” by the First Appellant to the\n                    Respondent. Clause 4(vi) states as follows:[note: 4] 4Security The facility shall be secured by the following: ... vi)    Pledge of 51% of the paid up share capital of [the\n                            Second Appellant] to be acquired out of the facility, which pledge shall\n                            be completed and duly registered as a charge in favour of the Lender\n                            within 30 days of the execution of this Agreement.",
        "The Pledged Shares": "11     On 23 February 2007, Baytech\n                    fully drew down on the US$80 million facility.[note: 5] 12     By a letter dated 5 April 2007\n                    addressed to the Respondent,[note: 6]the First Appellant\n                    delivered 5 share certificates representing the Pledged Shares (“the Share\n                    Certificates”) to the Respondent.[note: 7]The First\n                    Appellant also sent a signed blank share transfer form with a cover letter dated\n                    5 April 2007 to the Respondent.[note: 8]The Second Appellant\n                    sent a letter to the Respondent on 5 April 2007, indicating that it had noted\n                    the Respondent’s interest in the Register of Members.[note: 9]On\n                    10 December 2007, the First Appellant and Baytech each registered a charge over\n                    the Pledged Shares in favour of the Respondent.[note: 10] 13     Subsequently, Baytech failed to\n                    make payment on US$13 million due and owing to the Respondent on 20 February\n                    2009. By a letter dated 25 March 2010 to Baytech, the Respondent declared that\n                    an event of default had occurred under the Facility Agreement and that all\n                    outstanding sums became immediately due and payable within seven days of receipt\n                    of that letter.[note: 11] 14     Baytech did not pay within the\n                    prescribed period. The Respondent sought to enforce its security over the\n                    Pledged Shares by commencing Originating Summons No 958 of 2010 (“the\n                    OS”). 15     The parties involved in the\n                    present dispute have also commenced proceedings against or with each other in\n                    other jurisdictions. It should be noted that the Respondent is not involved in\n                    any of these proceedings. 16     In the course of proceedings in\n                    India, Mr Padmanabhan filed an affidavit[note: 12]exhibiting a version of the\n                        SSA[note: 13]and claimed in his affidavit that this\n                    version was the basis for the Facility Agreement. The Appellants claim that they\n                    first became aware of this version of the SSA through this affidavit and that\n                    this version of the SSA was a forgery. The Appellants allege that Teledata\n                    submitted this version to the Respondent to obtain the Facility Agreement, and\n                    the Respondent was put on notice and was complicit in an alleged fraud\n                    perpetrated on the Appellants. The Appellants argued that the OS should be\n                    converted to a writ Action because of these allegations of fraud.",
        "The decision below": "17     The Judge refused to convert the\n                    OS to a writ Action (see[37]of the\n                    Judgment). He opined that, upon consideration of the allegations of fraud made\n                    by the Appellants, there was no reason why the matter could not be disposed of\n                    through the OS. He comprehensively addressed and rejected the Appellants’\n                    various allegations of fraud (see [47]–[77] of the Judgment). 18     The Judge held that an equitable\n                    mortgage carrying an implied power of sale was created over the Pledged Shares\n                    in favour of the Respondent through the deposit of the Share Certificates and\n                    the signed blank share transfer form with the Respondent. An event of default\n                    had occurred under the Facility Agreement and the Respondent could therefore\n                    exercise its power of sale in compliance with the Second Appellant’s articles of\n                    association. 19     Consequently, the Judge granted\n                    the following declarations: (a)     An event of default\n                        had occurred pursuant to,inter alia,\n                        clause 21 of the Facility Agreement. (b)     The Respondent was entitled to enforce its\n                        security by selling the Pledged Shares subject to the provisions of the\n                        Second Appellant’s articles of association. 20     The Judge directed that a\n                    valuation of the Pledged Shares was to be conducted and that the parties were to\n                    agree on the joint appointment of an independent auditor within three weeks of\n                    4 August 2011 and, failing such agreement, the parties were at liberty to seek\n                    the court’s assistance to appoint an auditor on behalf of the parties. The Judge\n                    awarded the costs of the OS to the Respondent.",
        "The parties’ arguments": "",
        "The Appellants’ arguments": "21     The Appellants appealed against\n                    the Judge’s decision on two points. Firstly, they argued that the equitable\n                    mortgage over the Pledged Shares was invalid and unenforceable because the\n                    consideration provided for the mortgage was past consideration. This is a new\n                    point that was not raised before the Judge. Secondly, the Appellants argued that\n                    the OS should be converted to a writ Action and that the Judge was wrong in not\n                    allowing a conversion. 22     In so far as the first point was\n                    concerned, the Appellants argued that the equitable mortgage was not supported\n                    by valid consideration and was hence invalid. The consideration furnished by the\n                    Respondent, namely the entrance into the Facility Agreement or alternatively the\n                    disbursement of the loan, was past consideration because the equitable mortgage\n                    was created on 5 April 2007, after the Respondent entered into the Facility\n                    Agreement on 22 February 2007 and the loan facility was fully drawn down on\n                    23 February 2007. The exception to the rule against past consideration\n                    established in the Hong Kong Privy Council decision ofPao On\n                        and others v Lau Yiu Long and others[1980] AC 614 (“Pao On”) was not applicable on the facts. In particular,\n                    the first and second conditions of the exception were not established on the\n                    facts of the case. The grant of and entrance into the loan facility by the\n                    Respondent was not done at the request of the First Appellant. The First\n                    Appellant was never involved in any negotiations or discussions regarding the\n                    loan facility and had no dealings with the Respondent before 5 April 2007, when\n                    the Share Certificates and signed blank share transfer form were deposited with\n                    the Respondent. There was no understanding between the First Appellant and the\n                    Respondent when the Facility Agreement was entered into and when the loan\n                    facility was fully drawn down that the First Appellant would grant the equitable\n                    mortgage to the Respondent. 23     In so far as the second point\n                    was concerned, the Appellants submitted, firstly, that disputes of fact and\n                    triable issues exist as to whether the First Appellant intended to create an\n                    equitable mortgage over the Pledged Shares as well as to the exact nature and\n                    extent of the security provided by the First Appellant. Secondly, a perusal of\n                    the version of the SSA obtained from the Indian proceedings alone should have\n                    put the Respondent on notice. Thirdly, the issue as to whether there had been\n                    complicity on the part of the Respondent with Teledata in relation to the\n                    allegedly forged SSA was a matter that called for further enquiry. Fourthly,\n                    there were substantial disputes of fact, allegations of fraud or both and the\n                    court ought therefore to convert the OS to a writ Action. The Appellants relied\n                    onWoon Brothers Investments Pte Ltd v Management Corporation\n                        Strata Title Plan No 461 and others[2011] 4 SLR 777 (“Woon Brothers”).",
        "The Respondent’s arguments": "24     In so far as the first point was\n                    concerned, the Respondent argued that valid consideration had been provided by\n                    the Respondent. Clause 4(vi) of the Facility Agreement clearly provided that the\n                    equitable mortgage over the Pledged Shares was to be created within 30 days of\n                    the execution of the Facility Agreement. Hence, the parties intended that the\n                    equitable mortgage be created only after the loan facility was drawn down and\n                    the funds were used to acquire the shares in the Second Appellant. The delivery\n                    of the Share Certificates and signed blank share transfer form was part of the\n                    same transaction as the Facility Agreement. The contemporaneous letters that\n                    accompanied the Share Certificates and signed blank share transfer form\n                    supported this as they demonstrated that the Appellants intended to, and did,\n                    create the equitable mortgage with reference to the Facility Agreement and the\n                    equitable mortgage was part of the same transaction as the Facility Agreement.\n                    The consideration provided by the Respondent was therefore not past\n                    consideration. The Respondent relied onSim Tony v Lim Ah\n                        Ghee (trading as Phil Real Estate & Building Services)[1994]\n                    2 SLR(R) 910 (“Sim Tony HC”) andSim Tony v Lim Ah Ghee (trading as Phil Real Estate & Building\n                        Services)[1995] 1 SLR(R) 886 (“Sim Tony\n                        CA”). 25     In so far as the second point\n                    was concerned, the Respondent submitted that it was clear law that a deposit of\n                    share certificates created an equitable mortgage of the shares. The question of\n                    the exact nature of the security created over the Pledged Shares was one of law\n                    which could be decided without a trial on the facts. The Appellants had\n                    conflated the legal issue of the nature of the security created by the deposit\n                    of the Share Certificates with the factual issue of what the parties’ intentions\n                    were at the material time. At any rate, the contemporaneous documents\n                    surrounding the deposit of the Share Certificates demonstrated that the parties\n                    had intended to create an equitable mortgage over the Pledged Shares. The\n                    Appellants had not alleged that the Respondent was complicit in, or had\n                    knowledge of, the alleged forgery of the SSA. The Appellants’ argument that\n                    patent errors in the version of the SSA relied upon in the Indian proceedings\n                    would have put the Respondent on notice was purely speculative. The Appellants\n                    had not addressed the Judge’s findings,inter\n                    alia, that no evidence had been adduced to demonstrate that the\n                    Respondent received the original SSA and that the execution of the SSA was not a\n                    condition precedent to the Facility Agreement. The Respondent’s unequivocal\n                    evidence was that its decision to enter into the Facility Agreement was not\n                    premised on the SSA. The Respondent distinguishedWoon\n                        Brotherson the basis that the Respondent’s case was\n                    straightforward and that the mere assertion of fraud cannot justify the\n                    conversion of an originating summons into a writ Action.",
        "Issues": "26     The issues before this court\n                    were as follows: (a)     Was valid\n                        consideration given for the equitable mortgage over the Pledged\n                        Shares? (b)     Should the OS be converted to a writ Action?",
        "Our decision": "",
        "Past consideration": "27     Turning first to the issue of\n                    past consideration, this was clearly an argument that had not been raised before\n                    the Judge in the court below. Counsel for the Appellants, Mr Samuel Chacko\n                    (“Mr Chacko”), sought to introduce this argument pursuant to O 57 r 13(4) of the\n                    rules of Court (Cap 322, R 5, 2006 Rev Ed). The general principles governing\n                    such a situation were set out by this court inAng Sin Hock v\n                        Khoo Eng Lim[2010] 3 SLR 179 (at [61]–[62]): 61    As Prof Jeffrey\n                            Pinsler SC has pertinently observed (seeSingapore\n                                Court Practice 2009(LexisNexis, 2009) at\n                            para 57/13/10): Consistent with the principle of finality in litigation is the\n                            requirement that the parties should raise at trial all matters which\n                            have a bearing on the outcome of the case. The Court of Appeal will\n                            generally refrain from entertaining a new point on appeal, particularly\n                            if the circumstances are such that the court is not in as advantageous a\n                            position as the court below (with regard to the evidence as well as\n                            other matters which may have arisen if the point had been brought up in\n                            the court below), to adjudicate upon the issue. 62    The above\n                            observations (which were found in the same paragraph inSingapore Court Practice 2006(Jeffrey\n                            Pinsler SC gen ed) (LexisNexis, 2006)) were, in fact, cited by this\n                            court inPanwah Steel Pte Ltd v Koh Brothers Building\n                                & Civil Engineering Contractor (Pte) Ltd[2006]\n                            4 SLR(R) 571 (at [14]). The court proceeded to observe (at\n                            [15]-[16]): 15    The classic\n                                statement of principle is, of course, that of Lord Herschell in the\n                                House of Lords decision ofThe Owners of the Ship\n                                    ‘Tasmania’ and the Owners of the Freight v Smith and others, The\n                                    Owners of the Ship ‘City of Corinth’ (The ‘Tasmania’)(1890) 15 App Cas 223, as follows (at 225): My Lords, I think that a point such as this, not taken at the\n                                trial, and presented for the first time in the Court of Appeal,\n                                ought to be most jealously scrutinised. The conduct of a cause at\n                                the trial is governed by, and the questions asked of the witnesses\n                                are directed to, the points then suggested. And it is obvious that\n                                no care is exercised in the elucidation of facts not material to\n                                them. It appears to me that under these circumstances\n                                    a Court of Appeal ought only to decide in favour of an appellant\n                                    on a ground there put forward for the first time, if it be\n                                    satisfied beyond doubt, first, that it has before it all the\n                                    facts bearing upon the new contention, as completely as would\n                                    have been the case if the controversy had arisen at the trial;\n                                    and next, that no satisfactory explanation could have been\n                                    offered by those whose conduct is impugned if an opportunity for\n                                    explanation had been afforded them when in the witness\n                                    box. [emphasis added] The principles embodied in the above quotation have been cited and\n                            applied on a number of occasions in the local context (see, for example,\n                            the decisions of this court inCheong Kim Hock v Lin\n                                Securities (Pte)[1992] 1 SLR(R) 497 at[30];MCST Plan No 473\n                                v De Beers Jewellery Pte Ltd[2002] 1 SLR(R) 418 at[38]; andRiduan bin Yusof v Khng Thian Huat[2005]\n                            4 SLR(R) 234 at[35]). 16    The following\n                                observations by Lord Watson in the Canadian Privy Council decision\n                                ofConnecticut Fire Insurance Company v\n                                    Kavanagh[1892] AC 473 at 480 are, especially (as we\n                                shall see) in the context of the present proceedings, also\n                                apposite: When a question of law is raised for the first time in a court of\n                                last resort, upon the construction of a document, orupon facts either admitted or proved beyond\n                                    controversy, it is not only competent but expedient, in the\n                                    interests of justice, to entertain the plea. The\n                                expediency of adopting that course may be doubted, when the plea\n                                cannot be disposed of without deciding nice questions of fact, in\n                                considering which the Court of ultimate review is placed in a much\n                                less advantageous position than the Courts below. But their\n                                Lordships have no hesitation in holding that the course ought not,\n                                in any case, to be followed, unless the Court is satisfied that the\n                                evidence upon which they are asked to decide establishes beyond\n                                doubt that the facts, if fully investigated, would have supported\n                                the new plea. [emphasis added] [emphasis in original] Reference may also be made to the decision of this court inSusilawati v American Express Bank Ltd[2009] 2 SLR(R) 737 at [46]–[54]. 28     Applying the principles set out\n                    in the preceding paragraph, we were of the view that this court was in just as\n                    advantageous a position as the court below to consider this particular issue. It\n                    was also clear that no new evidence was required to be adduced. 29     Turning to the substantive issue\n                    proper, there was a fundamental – and fatal – flaw in the Appellants’ argument.\n                    It was fundamentally inconsistent for Mr Chacko to advance the argument that the\n                    equitable mortgage granted over the Pledged Shares should be unenforceable\n                    because the consideration provided was past, while stating simultaneously that\n                    the First Appellant had no negotiations and discussions with the Respondent\n                    whatsoever. If, as Mr Chacko argued, the First Appellant had nothing whatsoever\n                    to do with the Respondent, then this particular argument must fail since any\n                    argument based on past consideration must necessarily be premised on what would\n                    otherwise have been a separate contractual relationship between,inter alia, the First Appellant and the Respondent.\n                    Indeed, although there was no evidence of an express contract between the\n                    Appellants and the Respondent (as would traditionally be the case in the context\n                    of a guarantee), an implied contract with the Respondent would also falsify the\n                    First Appellant’s claim that it had nothing whatsoever to do with the\n                    Respondent. At this juncture, any argument based on past consideration would\n                    fail because, as we shall see in a moment, the doctrine of past consideration\n                    would not apply and the exception to the rule against past consideration\n                    established inPao Onwould apply instead. Indeed,\n                    the analysis proffered below would applyequallyto the situation where there was an express contract between the\n                parties. 30     The doctrine of past\n                    consideration and the exception to the rule against past consideration\n                    established inPao Onare clearly a part of\n                    Singapore law (see,eg,Sim\n                        Tony HCandSim Tony CA). A concise\n                    summary and exposition of the law in this area particularly in relation to the\n                    conditions of thePao Onexception is found in the\n                    decision of this court inGay Choon Ing v Loh Sze Ti Terence\n                        Peter and another appeal[2009] 2 SLR(R) 332 at [83]–[84]\n                        (“Gay Choon Ing”), as follows: 83    It should also be\n                            noted that an absence of linkage between the parties can also occur if\n                            the consideration ispast– hence, the\n                            oft-cited principle that “past consideration is no consideration”.\n                            However, the courts look to the substance rather than the form. Hence,\n                            what looks at first blush like past consideration will still pass legal\n                            muster if there is, in effect, asingle(contemporaneous) transaction (the common understanding of the parties\n                            being that consideration would indeed be furnished at the time the\n                            promisor made his or her promise to the promisee). This was established\n                            as far back as the 1615 English decision ofLampleigh\n                                v Braithwait(1615) Hob 105; 80 ER 255 and, whilst often\n                            referred to as an exception to the principle, is not really an exception\n                            for (as just stated) its application results in what is, in substance, a\n                            single transaction to begin with. A somewhat more recent decision is\n                            that of the English Court of Appeal inIn re Casey’s\n                                Patents[1892] 1 Ch 104, and a modern statement of this\n                            particular legal principle can be found in the Hong Kong Privy Council\n                            decision of [Pao On], where Lord Scarman,\n                            delivering the judgment of the Board, observed thus\n                        (at 629): An Act done before the giving of a promise to make a payment or to\n                            confer some other benefit can sometimes be consideration for the\n                            promise.The Act must have been done at the\n                                promisors’ request: the parties must have understood that the Act\n                                was to be remunerated either by a payment or the conferment of some\n                                other benefit: and payment, or the conferment of a benefit, must\n                                have been legally enforceable had it been promised in\n                                advance. [emphasis added] 84    The element of request (see above at [82]) may also\n                            be usefully noted. It bears mention that the statement of principle inPao Onquoted in the preceding\n                            paragraph has, in fact, been affirmed in the local context. Indeed, in\n                            the Singapore High Court decision of [Sim Tony\n                                HC], Lai Siu Chiu J also referred to this particular\n                            statement of principle (at [51]) as being “oneapparentexception” [emphasis added] to the general rule\n                            that past consideration cannot constitute sufficient consideration in\n                            law. This court affirmed Lai J’s decision and endorsed her view to the\n                            effect that a court should not takea strict view\n                                from literal chronologyin ascertaining whether the\n                            consideration concerned was past: see [Sim Tony\n                                CA], especially at [16]. [emphasis in original] 31     In the circumstances, we saw no\n                    reason why the conditions laid down inPao On(as\n                    cited in the preceding paragraph) would not be satisfied on the facts before us.\n                    Put simply, the very nature of the contractual relationship between the\n                    Appellants and the Respondent viewed in its context would necessarily assume\n                    that there was both a request by the Appellants that the Respondent enter into\n                    the Facility Agreement with Baytech and that there was a common understanding\n                    between the parties that this (entry into the Facility Agreement by the\n                    Respondent) would be compensated for by,inter\n                        alia, the grant of an equitable mortgage over the Pledged Shares\n                    by the First Appellant – which would, of course, fulfil the aforementioned first\n                    and second conditions. Clause 4(vi) of the Facility Agreement (set out above at[10]) clearly demonstrates that the\n                    equitable mortgage over the Pledged Shares was to be granted pursuant to and\n                    only after the entrance into and execution of the Facility Agreement. Indeed,\n                    both of the Appellants’ letters dated 5 April 2007 addressed to the Respondent\n                    in relation to the deposit of the Pledged Shares with the latter as well as the\n                    cover letter dated 5 April 2007 accompanying the signed blank share transfer\n                    form sent by the First Appellant to the Respondent serve to underscore (and,\n                    more importantly, confirm) this analysis. The letter dated 5 April 2007 sent by\n                    the First Appellant to the Respondent clearly demonstrates in unequivocal terms\n                    that the First Appellant deposited the Share Certificates pursuant to the\n                    Facility Agreement: Sub:Pledge of shares with regard to[the Facility Agreementfor] USD 80 Million granted to\n                            [Baytech] .... As per the terms of the [F]acility [A]greement, we have\n                            to pledge the sharesof [the Second Appellant] standing in\n                        the name of [the First Appellant] with your office and we have handed over\n                        the following share certificates standing in the name of the company to your\n                        office vide our separate letter ... [emphasis added] Similarly, the following letter dated 5 April 2007 sent by the Second\n                    Appellant to the Respondent demonstrates that the Second Appellant also knew\n                    that the Share Certificates were deposited in accordance with the Facility\n                    Agreement: Sub:Pledge of shares standing in the name of[the First\n                            Appellant]–[the\n                            Facility Agreementfor]USD 80 Million granted to Baytech\n                            Inc ... The beneficiary of the shares viz., the First Appellant has advised thatthe above share certificates have been\n                            pledge[sic]in favour of[the Respondent] aspart of security for the said[Facility\n                            Agreement]. In this connection, we confirm having noted the\n                        interest of [the Respondent] in the shares in the Register of Members. We\n                        note to obtain the clearance from [the Respondent], Singapore, before\n                        effecting any change in the name/s of beneficiary of the above\n                        shares. [emphasis added] The cover letter dated 5 April 2007 accompanying the signed blank share\n                    transfer form sent by the First Appellant to the Respondent also confirms our\n                    analysis of the transaction: Syndicated Term Loan of US$80\n                            Million availed by [Baytech]– Facility Agreement\n                            dated 22/02/07 As one of the securities for the above loan,\n                        we had tendered to you five share certificates (representing 10.2 million\n                        shares) issued by [the Second Appellant] for in favour of [the First\n                        Appellant]. In continuation of this, we now present the blank share transfer\n                        form duly signed. Please acknowledge. [emphasis added] It was hence clear beyond peradventure that the Appellants understood, as the\n                    Respondent did, that the deposit of the Share Certificates and signed blank\n                    share transfer form was made pursuant to the Facility Agreement. It also bears\n                    emphasising that, by the very nature of the contract between the parties, the\n                    grant of an equitable mortgage over the Pledged Shares by the First Appellant\n                    could only have taken place after the entry by the Respondent into the Facility\n                    Agreement with Baytech. The substance and reality of the matter is that the\n                    relevant consideration and promise constituted part of a single transaction\n                    between the parties. We therefore accepted the Respondent’s arguments on this\n                    point. On a more general (and practical) level, the analysis just referred to\n                    would be wholly consistent with the commercial purpose of all the contracts\n                    concerned – a point that is also embodied in the letters referred to\n                    above. 32     That the Appellants fail here\n                    does not mean that the Appellants had no other legal recourse in so far as the\n                    present Action was concerned. This is not surprising in the least, for, as this\n                    court has observed, the common law (and the allied principles of equity)\n                    comprise “anorganic, coherent as well as holistic system out\n                        of which justice and fairness flow” (see the decision of this\n                    court inKickapoo (Malaysia) Sdn Bhd and another v The\n                        Monarch Beverage Co (Europe) Ltd[2010] 1 SLR 1212 at [57]\n                    [emphasis in original]). However, these other legal routes would not find their\n                    source in the law of contract. That this is the case is evident from the very\n                    arguments proffered by the Appellants in the court below. For example, the\n                    Appellants attempted to argue in the court below (and before this court) that\n                    the Pledged Shares had been deposited pursuant to a fraudulent transaction (this\n                    constitutes the crux of the second issue,viz,\n                    whether the OS ought to be converted into a writ Action). They had also sought\n                    to argue (unsuccessfully) in the court below (albeit not before this court) that\n                    only a contractual lien instead of an equitable mortgage had resulted from the\n                    deposit of the Share Certificates. 33     Before proceeding to consider\n                    (in the briefest of fashions, for the reasons set out below at[41]–[42]) the\n                    second issue in this appeal, it might be appropriate to proffer a few\n                    observations on the doctrine of past consideration (ie, that past consideration is not valid consideration) as well\n                    as the apparent exception to such a doctrine. 34     As is the case for the wider\n                    umbrella doctrine of consideration that it falls under, the doctrine of past\n                    consideration is (for better or worse) a firmly established part of both the\n                    English and Singapore law of contract (see,eg,\n                    the oft-cited English decisions ofEastwood v\n                        Kenyon(1840) 11 Ad & E 438; 113 ER 482 (“Eastwood v Kenyon”);Roscorla v\n                        Thomas(1842) 3 QB 234 (“Roscorla v\n                        Thomas”);In re McArdle, decd[1951] 1 Ch 669; as well as the decision of the Singapore courts inSim Tony HCandSim Tony\n                        CA). 35     The doctrine has the effect of\n                    preventing an otherwise valid contract from being formed. For example, inRoscorla v Thomas, the defendant promised the\n                    plaintiff that the horse bought by the plaintiff from him was free from vice\n                    only after the sale was completed. The court held that the guarantee was\n                    unenforceable because consideration was past. The same result was arrived at on\n                    similar facts inThorner v Field(1611) 1 Bulst\n                    120; 80 ER 816. Similarly, inEastwood v Kenyon, a\n                    promise made by a young woman’s husband to repay the loan previously taken out\n                    by the woman’s guardian to pay for her maintenance and education and improve her\n                    estate was held to be unenforceable because the consideration provided was\n                    past. 36     Subsequent cases ameliorated the\n                    potential harshness of the doctrine of past consideration. In particular, an\n                    apparent exception was created and has its genesis in the old English decision\n                    ofLampleigh v Braithwait(1615) Hob 105; 80 ER\n                    255. In that case, the promisor was accused of a crime and subsequently asked\n                    the promisee to procure a king’s pardon for him, which the latter did at\n                    considerable expense and effort. In gratitude, the promisor then promised to pay\n                    the promisee a certain sum of money but failed to do so. The promisee sought to\n                    enforce the promise. The court held that the promisee was entitled to enforce\n                    the promise because even though the consideration was past in chronological\n                    terms, the consideration (that is, the procurement of the pardon) was provided\n                    at the request of the promisor. This case was followed in the subsequent English\n                    Court of Appeal decision ofIn re Casey’sPatents[1892] 1 Ch 104. In that\n                    case, the joint owners of certain patents promised the manager who previously\n                    worked on the patents a one-third share of the patents. The court held that the\n                    promise was enforceable since it was understood that at the time the previous\n                    work on the patents was rendered it was to be subsequently paid for and the\n                    subsequent promise to pay merely fixed the amount to be paid. 37     The exception was given its\n                    modern restatement inPao On(see above at[30]) and has been received as a part of\n                    our law (seeSim Tony CAandSim Tony HC). As suggested inGay Choon\n                        Ing(see above at[30]), it\n                    is eminently arguable that this exception, upon further analysis, is not a true\n                    exception, for the element of request establishes a link between the\n                    consideration and promise which results in what is in substance one single\n                    contemporaneous transaction between the parties. Interestingly, it has also been\n                    observed that the seminal English decision ofWilliams v\n                        Roffey Bros & Nicholls (Contractors) Ltd[1991] 1 QB 1 (which\n                    introduced the concept of “practical benefit” constituting good consideration)\n                    has made further inroads into the doctrine of past consideration but only in the\n                    context of a past,executorypromise since “it is\n                    now arguable that Actual performance or even an increased chance of performance\n                    of that past promise confers practical benefits and [thereby] imports valid\n                    consideration” (see Mindy Chen-Wishart, “Consideration: Practical Benefit and\n                    the Emperor’s New Clothes” inGood Faith and Fault in\n                        Contract Law(Jack Beatson & Daniel Friedmann eds) (New York:\n                    Oxford University Press, 1995) at p 139). 38     If there is a unifying,practicaltheme emerging from a consideration\n                    of the exception (as well as observation) discussed above, it would appear to us\n                    to be that, while the doctrine of past consideration remains part of our law, it\n                    would generally be difficult for a party to successfully argue that a perfectly\n                    sensible and legitimate commercial transaction is unenforceable simply because\n                    the consideration provided for the promise was past. It has already been\n                    previously observed in the Singapore High Court decision ofChwee Kin Keong and others v Digilandmall.com Pte Ltd[2004]\n                    2 SLR(R) 594 at [139] that “[t]he modern approach in contract law requires very\n                    little to find the existence of consideration” (this case was affirmed on\n                    appeal, but without consideration of this particular point: seeChwee Kin Keong and others v Digilandmall.com Pte Ltd[2005] 1 SLR(R) 502). The courts are understandably (and justifiably) reluctant\n                    to invalidate otherwise perfectly legitimate and valid commercial transactions\n                    on as technical a basis as consideration. A strictly chronological approach in\n                    determining whether consideration is past or not is deeply unrealistic and\n                    unnecessarily restrictive; it also undermines the freedom of contracting parties\n                    as well as the sanctity of commercial transactions. As mentioned already inGay Choon Ingat [83] (see above at[30]), the court looks to the substance rather\n                    than the form of the transaction. If the earlier Act which is said to constitute\n                    the consideration for the later promise is part of substantially one and the\n                    same transaction and there was a common understanding between the parties that\n                    the former was to be compensated for by the latter, the consideration is valid\n                    and hence the later promise is enforceable, notwithstanding the fact that, in\n                    strictly chronological terms, the consideration was provided before the promise\n                    was made. This would often be the case for many commercial arrangements,\n                    particularly loan transactions. Arguments based on past consideration will\n                    invariably be looked upon by the courts with great circumspection and even\n                    scepticism when they are raised in the context of legitimate, sensible and\n                    commonplace commercial transactions, as was the case here. In this regard, we\n                    agree that the doctrine of past consideration should not be allowed to introduce\n                    “considerable incoherence into the law governing lenders and borrowers and …\n                    frustrate normal business expectations” (see Mark B Wessman, “Should We Fire the\n                    Gatekeeper? An Examination of the Doctrine of Consideration” (1993)\n                    48 U Miami L Rev 45 at p 103). 39     The present legal position does,\n                    in our view, strike the right balance between theory and practice. Indeed,\n                    notwithstanding the trenchant criticisms of the doctrine of past consideration\n                    stretching back almost seventy five years (see the UK Law Revision Committee,Sixth Interim Report (Statute of Frauds and the Doctrine\n                        of Consideration)(Cmd 5449, 1937) (“the 1937 Report”) at\n                    paras 21 and 32), this doctrine is still very much part of the legal landscape\n                    not only in Singapore but also in other jurisdictions where a different result\n                    could in fact have been arrived at by the courts. In Malaysia, for example, a\n                    strong argument could be made to the contrary. The language of s 2(d) of the Malaysian Contracts Act 1950 (Act 136)\n                    (“Contracts Act”) might suggest – at first blush at least – that past\n                    consideration could nevertheless constitute valid consideration in the eyes of\n                    the law (see,eg, the Malaysian High Court\n                    decision ofGuthrie Waugh Bhd v Malaippan\n                        Muthuchumaru[1972] 1 MLJ 35 at 39–40,perSharma J, which was reversed inGuthrie\n                        Waugh Bhd v Malaiappan Muthuchumaru[1972] 2 MLJ 62 but not on\n                    this particular point which was apparently endorsed by at least one judge (seeibid at 67) and the Malaysian Privy Council\n                    decision ofKepong Prospecting Ltd & Ors v\n                        Schmidt[1968] 1 MLJ 170).However,\n                    in the more recent Malaysian Supreme Court decision ofSouth\n                        East Asia Insurance Bhd v Nasir Ibrahim[1992] 2 MLJ 355, s\n                        2(d) was interpreted as recognising the\n                    principles laid down at common law inPao On(reference may also be made to the Malaysian Court of Appeal decision ofWong Hon Leong David v Noorazman bin Adnan[1995] 3 MLJ 283; the Malaysian High Court decisions ofGBH\n                        Ceramics Sdn Bhd v How It @ Low Aik & Ors[1989] 2 CLJ 427;Hongkong and Shanghai Banking Corporation v Syarikat\n                        United Leong Enterprise Sdn Bhd & Anor[1993] 2 MLJ 449; andAffin Bank Berhad v Precision Tube Product (Malaysia) Sdn\n                        Bhd & Ors[2010] MLJU 119; as well asCheshire, Fifoot and Furmston’s Law of Contract – Second Singapore and\n                        Malaysian Edition(Butterworths Asia, 1998) (“Cheshire, Fifoot and Furmston”) at pp 155–157 and Dato’ Seri\n                    Visu Sinnadurai,Law of Contract(LexisNexis,\n                        4thEd, 2011) vol 1 (“Sinnadurai”) at pp 160–165). That having been said, s\n                        26(b) of the Contracts Act “may pose even\n                    greater difficulties” (seeCheshire, Fifoot and\n                        Furmstonat p 157). However, it has been observed, in so far as\n                    this particular provision is concerned, that “it would appear that recovery by\n                    the promisee is not premised on the enforcement of a past consideration as such\n                    but, rather, on a special (statutory) rule ofrestitution” (seeibid[emphasis\n                    in original] as well as generallyibidat\n                    pp 157–159 andSinnaduraiat\n                pp 165–167). 40     Finally, it is interesting to\n                    note that, had Lord Mansfield inPillans and Rose v Van\n                        Mierop and Hopkins(1765) 3 Burr 1663; 97 ER 1035 prevailed in\n                    establishingmoralconsideration as constituting\n                    sufficient consideration in law, the common law position today might well have\n                    been different as it could, at least where the relevant facts were present, be\n                    argued that an expression of gratitude, whilst constituting past consideration,\n                    ought nevertheless be recognised pursuant to the concept of moral consideration\n                    (see generally Lord Wright, “Ought the Doctrine of Consideration to be Abolished\n                    from the Common Law?” (1936) 49 Harvard L Rev 1225 at pp 1239–1246;\n                    Kevin M Teeven,Promises on Prior Obligations at Common\n                        Law(Greenwood Press, 1998) (“Teeven”) at chh 7–11); and Koo Zhi Xuan, “Envisioning the\n                    Judicial Abolition of the Doctrine of Consideration in Singapore” (2011)\n                    23 SAcLJ 463 (“Koo”) at pp 472–476 and 487–488;\n                    see also K C T Sutton,Consideration Reconsidered – Studies\n                        on the Doctrine of Consideration of the Law of Contract(University of Queensland Press, 1974) at pp 242–243, where,inter alia, the American position pursuant to theRestatement (Second) of Contracts(see the various\n                    “exceptions” to past or moral consideration listed in§86) is also referred to and where a distinction is drawn\n                    between cases involving mere gratitude or sentiment (which wouldnotconstitute sufficient consideration in law) and\n                    those involving restitution (which would constitute sufficient consideration in\n                    law;cfalso, the preceding paragraph; the\n                    comprehensive discussion inTeevenat chh 10 and\n                    11; as well as Steve Thel & Edward Yorio, “The Promissory Basis of Past\n                    Consideration” (1992) 78 Virginia L Rev 1045, which argues for a promissory\n                    (instead of restitutionary) basis of recovery instead). As a not altogether\n                    irrelevant aside, it is significant, perhaps, that Lord Mansfield has been\n                    described by one writer as being “a civilian at heart” (seeTeevenat p 76; see alsoibidat\n                    pp 79 and 85), for the concept of moral consideration has never been a problem\n                    in civil law countries (seeKooat pp 487–488).\n                    However, the concept of moral consideration has been decisively rejected in\n                    England (see, in particular,Eastwood v Kenyon;\n                    the 1937 Report at para 19; as well as the perceptive analysis inTeevenat ch 8) and it is, in our view, too late to turn\n                    the clock back, so to speak, in Singapore as well (see also the Singapore High\n                    Court decision ofRe Low Gim Har Janet[1995]\n                    2 SLR(R) 208 at [162]–[163]). Nevertheless, given the principles laid down inPao On(which, in our view, are consistent\n                    with logic, practicality and commonsense), this is by no means a crucial\n                    setback. It ought to be pointed out (in addition to the modified position\n                    adopted in America and which has just been alluded to in the briefest of\n                    fashions) that the situation in Malaysia may – in this particular regard – be\n                    somewhat different, having regard, in particular, to s 26(a) of the Contracts Act. This particular provision is, however,\n                    not without difficulties, and the various issues that arise therefrom is outside\n                    the purview of the present judgment (see generallyCheshire,\n                        Fifoot and Furmstonat pp 147–148 andSinnaduraiat pp 179–184, as well as the authorities cited in\n                    both these works).",
        "Should the OS be converted to a writ Action?": "41     This particular issue was dealt\n                    with in meticulous detail by the Judge in the court below (see the Judgment at[37]and [47]–[77]). We agreed with the\n                    reasons given by the Judge and found no merit whatsoever in the arguments\n                    proffered by the Appellants to this court. 42     At this point, we would like to\n                    make some observations on converting an originating summons to a writ Action.\n                    While it was stated by this court inWoon Brothersat[30]that a writ Action is usually more\n                    appropriate when allegations of fraud are made, itcannotbe the case that a conversionmustbe ordered the moment allegations of fraud are made by a\n                    defendant, for this would allow defendants to unnecessarily prolong and\n                    complicate otherwise straightforward and legitimate claims made against them,\n                    which is precisely the case here. Mr Chacko is wrong to citeWoon Brothersfor the overly broad proposition that an\n                    originating summonsmustbe converted the moment\n                    there are allegations of substantial disputes of fact, allegations of fraud or\n                    both. The alleged disputes of fact as well as allegations of fraud must be\n                    accompanied by the existence of at least a credible matrix of facts and must be\n                    relevant to the dispute at hand, which was not the case here.",
        "Conclusion": "43     For the reasons set out above,\n                    we dismissed the appeal with costs and the usual consequential\n                orders.  [note: 1]Record of Appeal (“RA”), vol III Part A at\n                                pp 266–276. [note: 2]RA vol III Part A at\n                            pp 277–283. [note: 3]Respondent’s Supplemental Core Bundle (“RSCB”) at\n                            pp 11–72. [note: 4]RSCB at p 22. [note: 5]RA vol III Part C at p 135. [note: 6]RSCB at p 97. [note: 7]RA vol III Part A at pp 129–133. [note: 8]RSCB at pp 99–100. [note: 9]RSCB at p 98. [note: 10]RSCB at pp 101–106. [note: 11]RA vol III Part A at\n                                pp 231–232. [note: 12]RA vol III Part A at pp 285–300 and RA vol III Part B at\n                                pp 1–19. [note: 13]RA vol III Part B at\n                            pp 8–19."
    }
}