{
    "case_title": "Centillion Environment & Recycling Ltd (formerly known as Citiraya Industries Ltd)\n      v\n      Public Prosecutor and others and another appeal",
    "ncitation": "[2012] SGCA 65",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       The appeal before this court,viz, Civil Appeal No 114 of 2011 (“CA 114/2011”) and cross-appeal,viz, Civil Appeal No 115 of 2011 (“CA 115/2011”), are appeals against several orders of the High Court Judge (“the Judge”) made under the Corruption, Drug Trafficking and Other Serious Crimes (Confiscation of Benefits) Act (Cap 65A, 2000 Rev Ed) (“CDSA”), inPublic Prosecutor v Ng Teck Lee (Centillion Environment & Recycling Ltd (formerly known as Citiraya Industries Ltd) and another, other parties) (Ung Yoke Hooi, intervener) and another matter[2011] 4 SLR 906 (“the Judgment”).",
        "Background": "2       The appellant in CA 114/2011 is Centillion Environment & Recycling Ltd (“Centillion”), formerly known as Citiraya Industries Ltd (“Citiraya”), a company whose shares were publicly listed on the Singapore Stock Exchange. The respondents in CA 114/2011 are the Public Prosecutor (“PP”), one Ung Yoke Hooi (“UYH”) and one Ng Teck Lee (“NTL”). 3       The appellant in CA 115/2011 is the PP and the respondents are Centillion and UYH. These parties are rival claimants to the properties set out in the PP’s List of Realisable Assets at Appendix A to the Judgment (“PP’s List of Realisable Assets”), although NTL did not appear in the proceedings here and below to present his claims. As stated by the Judge at [2] of the Judgment: In essence, this case concerned an application by the [PP] for the confiscation of the benefits derived by [NTL] from his criminal conduct and the realisation of property to satisfy the confiscation order. … 4       NTL was Citiraya’s Chief Executive Officer and President. Citiraya, which was engaged in the business of recovering precious metals from sub-standard computer chips (“electronic scrap”), entered into agreements with a number of chip manufacturers which required Citiraya to return to them the precious metals extracted from the electronic scrap consigned to it by the chip manufacturers. Instead of carrying out the terms of the agreements, NTL misappropriated and sent the electronic scrap to syndicates in Taiwan and Hong Kong for repackaging and sale as standard products. NTL was assisted in this scam by one Gan Chin Chin (“Gan”), the Chief Financial Officer of Citiraya and NTL’s personal financial advisor. The electronic scrap was sold under the names of a number of business entities,ie, Neat World Trading, Pan Asset International (“Pan Asset”), Multi Comm Parts & Trading, Compunet Trading, DCP Corporation Singapore Pte Ltd, Poly Create Limited and Rich Nature Limited (“Rich Nature”). Pan Asset was a British Virgin Islands company whose sole shareholder was Gan as NTL’s nominee. 5       Between April 2003 and November 2004, NTL diverted 62 shipments of electronic scrap which he sold to overseas syndicates for a total sum of US$51,196,938.52 (“the Illegal Proceeds”). Under NTL’s instructions, Gan credited the Illegal Proceeds to three bank accounts: US$24,897,394.43 into Pan Asset’s Credit Suisse Hong Kong account, US$20,349,608.09 into Pan Asset’s UBS Hong Kong account (collectively, the “Pan Asset’s Accounts”) and US$5,949,936.00 into NTL’s personal or Rich Nature’s Credit Suisse Hong Kong account. NTL’s misdeeds were uncovered at the end of 2004 when the Corrupt Practices Investigation Bureau (“CPIB”) commenced investigations against him for,inter alia, criminal breach of trust as a servant under s 408 of the Penal Code (Cap 224, 2008 Rev Ed) (“Penal Code”), which came within the definition of a “serious offence” under the Second Schedule to the CDSA. NTL was not charged or prosecuted for any serious offence as he had left Singapore on 19 January 2005 and his whereabouts remain unknown to date. 6       Following NTL’s departure from Singapore, various efforts were made to locate him, including: (a) an immigration stop-list issued on 24 January 2005, (b) a Police Gazette issued on 15 February 2005, (c) a Singapore Warrant of Arrest issued on 24 February 2005, and (d) an International Warrant of Arrest issued through Interpol on 8 April 2005; but despite these measures, his whereabouts (and the whereabouts of his wife, Thor Chwee Hwa (“TCH\")) remain unknown. In the circumstances, NTL was deemed under s 26(3) of the CDSA to have absconded in connection with two counts under s 408 of the Penal Code (ie, each being a serious offence), and he was therefore also deemed under s 26(1) to be convicted of a serious offence. 7       The PP commenced proceedings on 10 June 2008 in Originating Summons No 785 of 2008 (“OS 785/2008”) for: (a)     a confiscation order against NTL under s 5 of the CDSA for US$51,196,938.52 being the value of benefits known to be derived by him from criminal conduct (“the Confiscation Order”); (b)     a certificate under s 10(2) of the CDSA that the amount to be recovered under the confiscation order be assessed at S$28,832,725.14 and US$1,008.66; (c)     an order that NTL pay S$28,832,725.14 and US$1,008.66 to the State; (d)     an order that properties identified as realisable properties be realised and applied on NTL's behalf towards the satisfaction of the confiscation order; and (e)     an order that the PP be at liberty to apply for supplementary confiscation and realisation orders. For the purpose of item (d) above, the PP produced a list of 28 classes/items of properties as set out in the PP’s List of Realisable Assets, which itemised 28 classes/items of properties held in the name of NTL or TCH and in various other names but held in trust or for the account of NTL. The total value of the PP’s List of Realisable Assets was then assessed at S$28,832,725.14 and US$1,008.66. 8       On 11 July 2008, Centillion filed Suit No 484 of 2008 against NTL for breach of fiduciary duties to the company as a director and sought an account of profits and equitable compensation or damages for losses occasioned to the company. Centillion subsequently obtained a default judgment against NTL on 3 November 2008 (“the 2008 Judgment”) for payment of S$51,196,938.52, being the value of the electronic scrap misappropriated by NTL. 9       Centillion also intervened on 11 July 2008 in OS 785/2008 to assert its interests in certain properties contained in the PP’s List of Realisable Assets. On 21 October 2008, UYH and Thor Beng Huat (“TBH”), the brother of TCH, also intervened to assert their respective interests in other properties listed in the PP’s List of Realisable Assets. Both NTL and TCH did not appear, and were not represented, in the proceedings. The Judge made a provisional Confiscation Order under s 5 of the CDSA against NTL for the value of the Illegal Proceeds on 4 May 2009 without prejudice to the claims of Centillion, UYH and TBH to the properties listed in the PP’s List of Realisable Assets. 10     Centillion then applied for discovery against the PP for evidence on the movement of funds from Hong Kong to Singapore and sought an order of court that the PP produce all the documents that could enable Centillion to establish the links between the Pan Asset’s Accounts in Hong Kong and the Singapore properties (contained in the PP’s List of Realisable Assets). The PP objected to the discovery application on the ground that it was too extensive and that CPIB’s policy was only to allow a party access to documents that had been seized from that party in the course of investigations. 11     Centillion and the PP subsequently reached a compromise whereby the PP would produce the evidence in the form of an affidavit to be filed by a CPIB officer listing the properties in the PP’s List of Realisable Assets that were directly traceable to the Illegal Proceeds (“the Traceable Properties”). On 12 July 2010, CPIB Principal Special Investigator, Tok Thiam Soon Frederick, filed the said affidavit (“Tok’s Affidavit”), whereupon Centillion withdrew its discovery application. The Judge heard oral evidence from witnesses and made his orders on each party’s application on 26 August 2011.",
        "The Judge’s findings in OS 785/2008": "",
        "The Judge’s findings on the PP’s application": "12     The Judge held at [33] of the Judgment that the PP, in order to claim the 28 classes/items of properties listed in the PP’s List of Realisable Assets, had to show that they were in law or in fact realisable properties as defined in s 2(1) of the CDSA,ie, they were (a) properties held by NTL; or (b) properties held by a person to whom NTL had “made a gift caught by [the CDSA]”. Properties in category (a) would include (i) properties held in NTL’s name, and (ii) properties that were held on trust for NTL. On this basis, the Judge held at [34] of the Judgment that only the properties listed in Appendix B to the Judgment were realisable properties as defined in s 2(1) of the CDSA (the “Ordered List of Realisable Assets”). The Traceable Properties (see [11] above) listed in the PP’s List of Realisable Assets were also excluded from the Ordered List of Realisable Assets. 13     The Judge further excluded properties held in the name of TCH (set out in Annex A to this court’s judgment (“Annex A”)) – either solely or jointly with NTL or other third parties – from the Ordered List of Realisable Assets as the Judge found that the PP had failed to produce sufficient evidence to show that the properties were either acquired with gifts made by NTL within the period of 6 years prior to 10 June 2008 (ie, the date of the PP’s application for the Confiscation Order) or that they were derived from the Illegal Proceeds, under s 12(8) of the CDSA (at [40] of the Judgment). 14     The Judge also excluded various properties held by a company called Ventures Trust Pte Ltd (“Ventures Trust”) from the Ordered List of Realisable Assets on the ground that the evidence adduced by the PP to establish that the Ventures Trust properties were held on trust for NTL was hearsay evidence (at [41] of the Judgment).",
        "The Judge’s findings on UYH’s application": "15     UYH had five bank accounts in his name. As at 9 January 2009, the credit amount in these accounts totalling S$671,832.66 were as follows: (a) Standard Chartered Bank (“SCB”) Account – S$291,108.28; (b) SCB Investment Account – S$188,691.04 (collectively, the “two SCB Accounts”); (c) DBS account – S$73,730.65; (d) DBS account – S$18,302.69; and (e) DBS account – S$100,000.00 (collectively, the “three DBS Accounts”). 16     The Judge found on the evidence that the monies in these accounts were the balance of S$2 million received by UYH as part payment for sale to NTL of UYH’s 40% shareholdings in Citiraya Teknologi Sdn Bhd (\"CTSB\"), of which Citiraya was a 60% shareholder. Accordingly, he held that the sums totalling S$671,832.66 were not realisable properties and that UYH was entitled to retain them.",
        "The Judge’s findings on Centillion’s application": "17     Centillion’s application was based on two grounds: (a) it was a judgment creditor under the 2008 Judgment and was therefore entitled to execute on all residual properties which belonged to NTL and were not traceable to the Illegal Proceeds (the “Executable Properties”, set out in Annex B to this court’s judgment (“Annex B”)), (“ground (a)”); and (b) it was a beneficiary under constructive trusts in relation to properties traceable to the Illegal Proceeds (“ground (b)”). It was argued that Centillion accordingly held an “interest” in these properties under s 13 of the CDSA. On ground (a), the Judge held that an unexecuted judgment was not an interest in relation to property as defined under s 2 of the CDSA. At [50] of the Judgment, the Judge explained: When s 2 of the CDSA defines “interest” to include “any right”, it uses the words “‘interest’ ... in relation to property”. The “right” referred to must be a right relating to the property in dispute. In a situation where an application for a realisation order is made in respect of specified properties, “any right” asserted by a third party under s 13 must relate to those specified properties. A general right to take out enforcement proceedings pursuant to a judgment is not a right in any specific property. It can be argued that when enforcement proceedings are commenced with regard to specified properties, the judgment creditor has a potential interest in the properties, and when the right of enforcement is obtained, the judgment creditor would have an actual interest in those properties. However, on these facts Centillion had not taken out any enforcement proceedings in relation to the properties in question, and no explanation was given for that. Could it be that Centillion was not able to take out enforcement proceedings against those properties? As the onus was on Centillion to show that it had an interest in the properties in question, Centillion had not discharged the onus simply by referring to the judgment in its favour against NTL. 18     On ground (b), the Judge held that Centillion could recover the properties listed in Appendix C to the Judgment (the “Constructive Trust Properties”) on the ground that it was entitled to assert a constructive trust over these assets. After referring to the decisions inAttorney-General for Hong Kong v Charles Warwick Reid[1994] 1 AC 324 (“AG v Reid”) andThahirKartikaRatna v PT PertambanganMinyakdan Gas Bumi Negara (Pertamina)[1994] 3 SLR(R) 312 (“Pertamina”) as authority for the principle that a principal was entitled to assert a beneficial interest in a bribe received by an agent or fiduciary on the basis of a constructive trust over the bribe (and property traceable from the bribe), the Judge said at [56] of the Judgment as follows: AG v ReidandPertaminarelated to a form of trust which does not exist until the bribes are received by a fiduciary in breach of his duties, as contrasted to cases where property is entrusted onto the wrongdoer from the outset, prior to the wrongdoing. The decision of the English Court of Appeal inJ J Harrison (Properties) Ltd v Harrison[2002] 1 BCLC 162 (\"Harrison\") dealt with a trust of the second form. In that case, a director of a company disposed of the company's property in breach of his fiduciary duties. Chadwick LJ held at [27]: [27]   It follows, also, from the principle that directors who dispose of the company's property in breach of their fiduciary duties are treated as having committed a breach of trust that, a director who is, himself, the recipient of the property holds it upon a trust for the company. He, also, is described as a constructive trustee. But, as Millett LJ explained inParagon Finance plc v D B Thakerar & Co[1999] 1 All ER 400 at 408-409, his trusteeship is different in character from that of the stranger. He falls into the category of persons who, in the words of Millett LJ ([1999] 1 All ER 400 at 408) ... ‘though not strictly trustees, were in an analogous position and who abused the trust and confidence reposed in them to obtain their principal's property for themselves.’ This passage applies squarely to NTL. The trust of the type in Harrison conforms to the conventional view on trust, while the bribe-related trusts inAG v ReidandPertaminareflect a more recent development in the law of trust. Both forms of trust are recognised in Singapore. Under both types of constructive trust, I found on the basis of Tok's evidence (see [51]–[52] above) that NTL held the properties in the List of Constructive Trust Properties (Appendix C) on trust for Centillion.",
        "The Judge’s findings on TBH’s application": "19     One of the realisable properties listed in the PP’s List of Realisable Assets was TCH’s 60% share of a property at 95A Paya Lebar Crescent. Although TBH claimed that TCH held the 60% share on a resulting trust for him, he admitted in his oral evidence that he had intended TCH to have full beneficial ownership of the said property (at [67] of the Judgment). The Judge accordingly dismissed TBH’s application. TBH has not appealed against the dismissal of his claim.",
        "Costs orders made by the Judge": "20     The Judge awarded costs against the PP with respect to UYH’s successful application and Centillion’s partially successful application on the ground that O 59 of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“ROC”) was applicable to the proceedings, and that the general rule under O 59 r 3(2) was that costs follow the event. Even though the PP was performing a public function in the proceedings, the Judge considered that the exception to the general rule did not apply as the PP had not acted reasonably in the manner in which he had dealt with the applications taken out by UYH and Centillion (at [88] of the Judgment).",
        "Issues raised in CA 114/2011 and CA 115/2011": "21     The PP raised four issues in CA 115/2011 as follows: (a)     whether properties in TCH’s name (videAnnex A) were realisable properties; (b)     whether the monies held in UYH’s bank accounts were realisable properties; (c)     whether the category of Constructive Trust Properties were realisable properties; and (d)     whether the PP should be held liable to pay the costs of Centillion and UYH in these proceedings. At the hearing of this appeal, the PP withdrew his appeal with respect to issue (c) above. 22     Centillion raised two issues in CA 114/2011 as follows: (a)     whether its right to execute the unexecuted 2008 Judgment gives it an “interest” in the Executable Properties (videAnnex B) under s 13 of the CDSA; and (b)     whether certain properties held under the names of Ventures Trust, Gan and UYH are held on a constructive trust for Centillion as they are traceable to the Illegal Proceeds.",
        "Our decision": "",
        "The policy and principles of the CDSA": "23     As the issues raised before us call for the application of certain provisions of the CDSA, we shall first discuss the legislative policy of the CDSA and the scope of these provisions,viz, s 2 (definition of “realisable property”), s 4 (confiscation orders for benefits derived from drug trafficking offences), s 5 (confiscation orders for benefits derived from criminal conduct amounting to a serious offence), s 13 (protection of the rights of third parties) and s 12(8) (“gifts” that are caught by the CDSA). 24     The CDSA is a consolidation of two precursor provisions, the Corruption (Confiscation of Benefits) Act 1989 (Act No 16 of 1989) and the Drug Trafficking (Confiscation of Benefits) Act 1992 (Act No 29 of 1992) (“the 1992 Act”), with the extension of the asset confiscation and anti-money laundering regime to cover a general range of serious offences. The overarching rationale of statutes dealing with the confiscation of benefits of criminal conduct is an intuitive one – it gives effect to the policy that crime does not pay and prevents criminals and their associates from enjoying the benefits of their crimes. As stated by Professor S Jayakumar, the then Minister for Home Affairs, during the second reading of the Drug Trafficking (Confiscation of Benefits) Bill (Bill No 17 of 1992) (“the 1992 Bill”), the aim of confiscation is to “deny drug traffickers the enjoyment of the benefits of their crime by confiscating their assets which are derived from drug trafficking” and to “render drug trafficking an unprofitable venture” (see Singapore Parliamentary Debates, Official Report (20 March 1992) vol 59 at cols 1375 and 1379). This aim applies equally to serious offences under the CDSA. The objective may be punitive, deterrent or simply an expression of the visceral objection that offenders should not be allowed to enjoy the fruits of their crime at the expense of society. Hence, a confiscation order under the CDSA is directed at the offender, not innocent third parties. 25     The CDSA regime mirrors the approach in the UK, where “confiscation” is not understood in the conventional sense. The specific fruits of crime are not subject to seizure or forfeiture, but the defendant is ordered to pay a sum equivalent in value to the benefits derived from his criminal conduct under s 4 (for drug trafficking offences) or s 5 (for other serious offences) of the CDSA, as the case may be. In the words of Lord Hobhouse inIn re Norris[2001] 1 WLR 1388 (“Norris”) at [12], the term “confiscation orders” is “a misnomer” as the means adopted is value-based rather than property-based and the confiscation order itself operatesin personam. The confiscation order is made against the offender personally and not against his assets. However, to give effect to a confiscation order, the law must, of course, also address the enforcement of the confiscation order through the appropriation or realisation of specific assets of the defendant towards payment of the order. 26     The relevant provisions of the CDSA for the purpose of enforcement are found in Part III thereof in ss 17, 18, 19 and 20. It is at this stage of enforcement that the law provides, and the courts must recognise, that the purpose of attaching assets is to strip wrongdoers of their ill-gotten gains, and not to deprive innocent third parties of their legitimate proprietary rights. The ostensibly draconian reach of a confiscation order does not and cannot logically extend to someone who has not knowingly benefited financially from the defendant’s criminal activities. Again, as observed by Lord Hobhouse (at [16] ofNorris) in relation to a provision in the Drug Trafficking Offences Act 1986 (c 32) (UK) mandating a receiver to exercise his powers to realise property with a view to allowing an innocent third party “to retain or recover the value of any property held by him”: ... This would be implicit even in the absence of an express provision since the confiscation order only applies to the convicted defendant and, indirectly through such defendant, donees caught by the Act.To apply it so as to confiscate the property of innocent third parties would be not only exorbitant but also outside the purpose of the Act.... [emphasis added] 27     The intended purpose of s 13 of the CDSA is to balance the efficacy of the enforcement of the confiscation order and the interests of third parties. This was explained by Professor S Jayakumar in response to a concern expressed by a Member of Parliament that a matrimonial home may be the subject of “seizure” (see Singapore Parliamentary Debates, Official Report (20 March 1992) vol 59 at cols 1382–1383): The second point was his concern of seizure of assets like houses. He mentioned HDB flats where the wife may be the co-owner and she may be completely innocent. I would like to assure him, first, that if you examine the provisions in detail, there is a very elaborate provision (I think it is clause 9) which protects the interest of innocent third parties. And if it was true that the wife in that particular case had no knowledge or was innocent, then her rights would be protected under clause 9. 28     Clause 9 (of the 1992 Bill) referred to by Professor S Jayakumar in the passage above was subsequently enacted as s 9 of the 1992 Act. In this respect, s 13 of the CDSA re-enacted s 9 of the 1992 Act with an expanded application to encompass “criminal conduct”, and is an express mechanism to protect the interests of innocent third parties who have acquired an interest in the realisable assets. Such claimants must show that they have not been involved in the drug trafficking or criminal conduct of the offender (as the case may be) and had acquired their interest in the property for sufficient consideration without notice or reasonable suspicion that the property came from an illegal source, see s 13(2) of the CDSA. It is only when a third party fails to satisfy the court of his interest in the property that the property may be realised by the State and the proceeds directed towards payment of the confiscation order. Hence, the State is a default beneficiary of the offender’s ill-gotten gains or his legitimate property to satisfy the ill-gotten gains that have been dissipated.  The PP’s entitlement to realise any property held by the offender is a default right. This principle should be borne in mind when the court considers the burden of proof in confiscation proceedings under the CDSA. 29     With respect to gifts, s 12(8) provides that certain gifts are “caught” by the CDSA,ie, any gifts made within the 6-year period preceding the date on which criminal proceedings were instituted against the defendant (or, if no such proceedings were instituted, the date of the confiscation order) and gifts made at any time that are traceable to the defendant’s ill-gotten gains. This is read together with the definition of “realisable property” in s 2 to determine the scope of realisable propertyvis-à-visthe donee and operates to prevent the dissipation of value by the defendant through gifts made to his associates. 30     With these broad principles briefly mapped out, we now turn to consider the interpretation of specific provisions in the CDSA. Realisable property and gift caught by the CDSA 31     The expression “realisable property” is defined in s 2(1) as: (a)     any property held by the defendant; and (b)anyproperty held by a person to whom the defendant has, directly or indirectly, made a gift caught by this Act; [emphasis added] 32     The expression “a gift caught by this Act” in relation to a gift made by a defendant involved in the commission of a serious offence is in turn defined in s 12(8) of the CDSA: (8)    A gift (including a gift made before 13th September 1999) is caught by this Act if – (a)    it was made by the defendant at any time since the beginning of the period of 6 years ending when the proceedings for a serious offence were instituted against him or, where no such proceedings have been instituted, when an application under section 5 for a confiscation order is made against him; or (b)    it was made by the defendant at any time and was a gift of property which is or is part of the benefits derived by the defendant from criminal conduct. 33     The expression “gift” also has an extended meaning under s 12(9) to include properties transferred at an undervalue to the extent of the undervalue. This extended meaning is not relevant to this case. 34     In the present case, since NTL was not prosecuted for any serious offence caught by the CDSA, and only an application for a Confiscation Order was made against him by the PP under s 5 on 10 June 2008, the 6-year period under s 12(8) would stretch back to 10 June 2002. Since NTL’s misappropriation of Citiraya’s electronic scrap started only in April 2003, a reasonable inference is that all the assets acquired by NTL before April 2003 would have been acquired from his lawful gains from employment, investment or other sources, and most of the assets acquired by him after the ill-gotten gains were paid into the Pan Asset’s Accounts (see [5] above) would have been acquired from his unlawful activities, having regard to the fact that NTL’s benefits from criminal conduct were assessed at US$51,196,938.52 and the total value of the realisable assets in the PP’s List of Realisable Assets amounted only to S$28,832,725.14 and US$1,008.66. Interest in relation to property under s 13 of the CDSA 35     Section 13 of the CDSA provides as follows: Protection of rights of third party 13.—(1) Where an application is made for a confiscation order under section 4 or 5, a person who asserts an interest in the property may apply to the court, before the confiscation order is made, for an order under subsection (2). (2)    If a person applies to the court for an order under this subsection in respect of his interest in property and the court is satisfied – (a)    that he was not in any way involved in the defendant’s drug trafficking or criminal conduct, as the case may be; and (b)    that he acquired the interest – (i)    for sufficient consideration; and (ii)   without knowing, and in circumstances such as not to arouse a reasonable suspicion, that the property was, at the time he acquired it, property that was involved in or derived from drug trafficking or criminal conduct, as the case may be, the court shall make an order declaring the nature, extent and value (as at the time the order is made) of his interest. (3)    Subject to subsection (4), where a confiscation order has already been made, a person who asserts an interest in the property may apply under this subsection to the court for an order under subsection (2). (4)    A person who – (a)    had knowledge of the application under section 4 or 5 for the confiscation order before the order was made; or (b)    appeared at the hearing of that application, shall not be permitted to make an application under subsection (3) except with the leave of the court. (5)    A person who makes an application under subsection (1) or (3) shall give not less than 7 days’ written notice of the making of the application to the Attorney-General who shall be a party to any proceedings on the application. The word “interest” is defined in s 2(1) as “in relation to property, includes any right”. 36     In relation to the present case, s 13 provides the means for a person who claims a right to the realisable properties (which the PP wishes the court to make a realisation order) to intervene in the proceedings to assert his “interest” in relation to such properties. The burden of proof is on the claimant to prove the nature, extent and value of his interest. As mentioned at [28] above, he must satisfy the court that (a) he was not in any way involved in the defendant’s criminal conduct, and (b) he acquired the interest (i) for sufficient consideration, and (ii) without knowing, and in circumstances such as not to arouse a reasonable suspicion, that the property was, at the time he acquired it, involved in or derived from criminal conduct. In other words, his position is akin to that of a purchaser for value without any notice of any defect in the property he acquired or that of an equity’s darling. 37     We shall now consider the submissions of the parties on the issues raised in CA 114/2011 and CA 115/2011 before us.",
        "Issue I: Whether an in personam judgment give the judgment creditor an interest in relation to property which it may assert under s 13 of the CDSA": "38     Before us, Centillion has contended that the Judge was wrong in holding (at [50] of the Judgment) that as a judgment creditor of NTL, it did not have an interest in relation to the Executable Properties. Centillion argues that the right to execute the 2008 Judgment against all the assets of NTL constitutes such an interest contemplated by the CDSA and relies onABSABank Limited v Trent Gore Fraser(Case No. 286/05), a decision of the Supreme Court of South Africa (“ABSA Bank (Supreme Court)”) (which was approved by the Constitutional Court of South Africa inFraser v ABSA Bank Limited(Case No. CCT 66/05) (“ABSA Bank (Constitutional Court)”), which held that under the South African Prevention of Organised Crime Act 1998 (Act No 121 of 1998) (“South African POCA”) relating to the “confiscation” of the proceeds of crime, a judgment creditor has standing to object to the release of an offender’s assets subject to a restraint order under the said Act. We shall collectively refer to these two cases as the “ABSA Bankcases”. 39     In rebuttal, the PP contends that the words “any right” in s 2(1) of the CDSA mean any right to property,ie, a proprietary right in property, and not any other right, such as the right of attachment of property under an executable judgment. The PP relies onDirector of Serious Fraud Office v Lexi Holdings plc and anor[2009] QB 376 (“Lexi Holdings”) where the English Court of Appeal held that anin personamjudgment did not confer rights over property which could form the basis for varying a restraint order over assets that had been restrained pending the making of a confiscation order. The ABSA Bank cases and Lexi Holdings 40     TheABSA Bankcases involved an application by a bank which was a judgment creditor of one Trent Gore Fraser (“Fraser”). Fraser was indicted of charges relating to racketeering, money laundering and drug trafficking, and a restraint order was granted in relation to Fraser’s property under the South African POCA. Fraser then took out an application under s 26(6) of the South African POCA seeking an order for thecurator bonisof the restrained property to sell a portion of his property to pay for legal expenses in his criminal trial. The bank applied to intervene and oppose Fraser’s application on the basis of the judgment it had obtained against Fraser. The Supreme Court of South Africa held (at [21] ofABSA Bank(Supreme Court)) that s 31(1) of the South African POCA authorised the High Court to direct “such payment” out of the realised proceeds of the defendant’s property before the proceeds are applied in satisfaction of the confiscation order. The intention of this provision was to provide creditors with a means of bringing their claims to the court’s attention to be taken into account before satisfaction of the confiscation order, and the High Court must accordingly retain the power to entertain applications by such creditors with claims in the restrained property (at [22] ofABSA Bank (Supreme Court)). This power was equally exercisable when the court exercised its wide discretion under s 26(6) to release restrained property to meet legal expenses incurred by the defendant (at [28] ofABSA Bank (Supreme Court)). The decision of the Supreme Court was thus premised on the construction of particular provisions and the overall structure of the South African POCA, which differs materially from the CDSA. 41     The Constitutional Court of South Africa affirmed the reasoning of the Supreme Court in relation to the position of a judgment creditor under the South African POCA but added the caveat that not all creditors would be entitled to intervene in s 26(6) proceedings. It held that the court would have to exercise its discretion in deciding whether to admit a creditor in the circumstances of the case (at [72] ofABSA Bank (Constitutional Court)), and an order permitting a creditor to intervene does not necessarily ring-fence its claim against the applicant’s right to use the funds for legal proceedings (at [77] ofABSA Bank (Constitutional Court)). 42     Similarly, the judgment creditor inLexi Holdings, a company in administration named Lexi Holdings plc (“Lexi”), sought to vary a restraint order that had previously been made against the judgment debtor to enable the judgment to be complied with. The judgment debtor had received funds fraudulently paid out to him by a director of Lexi, and it was pleaded in Lexi’s claim that the judgment debtor knew that the payments had been made in breach of trust and accordingly held the payments on constructive trust for Lexi or was liable to account for them. The Court of Appeal held that the restraint order could be varied to take into account an equitable charge that Lexi held over two banks accounts which contained sums that derived from the misappropriated trust funds (at [58] ofLexi Holdings) as this was an “interest” under the Proceeds of Crimes Act 2002 (c 29) (UK) (“the English POCA”). A restraint order could not, however, be varied so as to take into account the right of a third party unsecured creditor (which included abona fidejudgment creditor) as s 69(2)(c) of the English POCA directed the court to exercise its powers in relation to,inter alia, restraint orders “without taking account of any obligation of the defendant ... if the obligation conflicts with the object of satisfying any confiscation order that has been made or may be made against the defendant”. It was the clear intention of the legislature that restraint orders should be made or varied without regard to debts owed to third party unsecured creditors (at [88] ofLexi Holdings). 43     We do not find either of these cases relevant to the question before us as they were decided in the context of different statutory provisions and for the purpose of considering whether the applicants were entitled to vary interim restraint orders (or to intervene in an application to do so) against the judgment debtor’s pool of assets before confiscation orders were made. TheABSA Bankcases are instructive for the courts’ views (see, for example, at [24] ofABSA Bank (Supreme Court)) that the legislative purpose of statutes dealing with the confiscation of the proceeds of crime is not to enrich the State but to punish the criminal by depriving him of the fruits of his crime. The reasoning inLexi Holdingsis also instructive in illuminating the distinction between a claim to an equitable charge on property that the judgment creditor can properly point to as proceeds attributable to assets misappropriated from him in breach of trust and a right to execute a judgment against the entirety of the judgment debtor’s assets. Where the judgment creditor asserts an equitable charge or a constructive trust over property presently held in the name of the judgment debtor, these are proprietary remedies independent of any rights that the creditor derives from the judgment itself. As explained by Lord Millett inFoskett v McKeown and others[2001] 1 AC 102 (“Foskett”) at 130G–H: The simplest case is where a trustee wrongfully misappropriates trust property and uses it exclusively to acquire other property for his own benefit. In such a case the beneficiary is entitledat his optioneither to assert his beneficial ownership of the proceeds or to bring a personal claim against the trustee for breach of trust and enforce an equitable lien or charge on the proceeds to secure restoration of the trust fund. … [emphasis in original] In contrast, the right to execute a judgment against the entirety of a judgment debtor’s assets is only a rightin personamthat does not, without more, give the judgment creditor a proprietary interest in any assets of the debtor. Does a judgment creditor satisfy the requirements of an “interest” under s 13 of the CDSA? 44     In our view, the position under s 13 of the CDSA is very clear,ie, a judgment creditor’s interest does not fall under the ambit of this provision. The reason is that a judgment creditor cannot satisfy the requirements of the provision as under s 13(2), he must have “acquired” the interest for sufficient consideration without knowledge or reasonable suspicion that the property was, at the time he acquired it, involved in or derived from drug trafficking or criminal conduct, as the case may be. Unlike the holder of an equitable charge or a beneficiary of a constructive trust, the judgment creditor has not acquired any such interest in the properties of the judgment debtor. The CDSA excludes only properties which have been acquired under such conditions as envisaged in s 13 from being realised to feed a confiscation order. This is consistent with the policy of the CDSA to punish the offender and his associates by depriving them of his ill-gotten gains. 45     On the other hand, a creditor whose debt has been paid by the defendant-debtor from his ill-gotten gains or a judgment creditor whose debt has been satisfied by execution proceedings on the judgment against the assets (including his ill-gotten gains) of the judgment debtor before the making of the realisation order can plead that the property received in satisfaction of the debt or judgment debt, as the case may be, is not a gift from the judgment debtor as defined under s 12(8), or that it is an interest under s 13(2) that was acquired for sufficient consideration because his debt or judgment debt would have been extinguished. 46     For the above reasons, we affirm the Judge’s decision that Centillion’s unsatisfied judgment debt does not give Centillion an “interest” for the purposes of s 13 of the CDSA in the Executable Properties.",
        "Issue II: Whether TCH’s properties were realisable properties": "47     The PP did not make arguments before the Judge in relation to the “realisability” of TCH’s properties apart from his rebuttal of TBH’s claim to TCH’s 60% share in 95A Paya Lebar Crescent. The Judge held that all of TCH’s properties were not realisable and explained at [40] of the Judgment as below: Even if it was assumed that TCH's wealth was derived from NTL, there was no evidence that those properties were direct gifts from NTL or that TCH had acquired the properties in question with gifts that she had received from NTL within the six years prior to 10 June 2008. TCH may have acquired those properties with money gifted to her by NTL before the six-year period. There was also no evidence that TCH used money that was gifted to her by NTL out of the benefits derived from his criminal conduct to acquire those properties. NTL was engaged in legitimate business and it could not be assumed that any gift he made to TCH was derived from his criminal activities. 48     Before us, the PP has argued that NTL had instructed Gan to make unexplained transfers of the sums of S$2,501,465.48 and US$1,249,414.10 from Pan Asset’s Credit Suisse account to TCH’s Credit Suisse Hong Kong account and TCH and NTL’s joint account with Merrill Lynch Pierce Fenner & Smith. These transfers were made between 10 July 2003 and 17 October 2003.[note: 1]It was argued that these transfers were either “gifts caught by [the] Act” under s 12(8) or held on resulting trust for NTL. The PP submitted that the Judge’s finding that TCH’s properties were not realisable was wrong as it was based on the reasoning that there was no evidence that the properties were themselves gifts or acquired using gifts of money from NTL. In the PP’s submission, no such evidence was necessary as all property held by a donee of a “gift caught by [the] Act” is realisable. 49     We agree with this submission. Section 2(1)(b) of the CDSA defines “realisable property” to mean “anyproperty held by a person to whom the defendant has, directly or indirectly, made a gift caught by this Act” [emphasis added]. The legislative scheme is clear. Once it is determined that the defendant has made a gift to a third party under either limb of s 12(8),ie, “a gift caught by [the] Act” as defined therein, it operates as a trigger such that all property held by the third party, whenever he acquired it, is now realisable property. Accordingly, for example, the fact that TCH’s 60% share in 95A Paya Lebar Crescent might have been acquired outside the period stipulated in s 12(8)(a) with lawful funds (it was acquired in March 2002 on the evidence before the court), does not take it out of the scope of “realisable property” under s 2(1) of the CDSA if it can be shown thatanygift made to TCH falls within s 12(8). 50     Thus, the question we have to determine is whether NTL has made a gift to TCH that is “caught by [the] Act”. The evidence clearly shows that NTL has made transfers of the sums of S$2,501,465.48 and US$1,249,414.10 to TCH. There is no evidence as to what happened to these moneys, but by operation of the presumption of advancement, these sums would be treated as gifts to her, unless it is proved otherwise. Neither NTL nor TCH has come forward to prove otherwise. Moreover, there is a whole list of assets in the name of TCH that must have been acquired by her through gifts from NTL, for example, her half share in 49A and 84 Binjai Park, Singapore. Again there is no evidence as to where the funds came from for TCH to purchase her respective half share in these properties. But since they were purchased after NTL had begun his criminal activities,[note: 2]the likelihood is that the source of funds would have been the Illegal Proceeds. 51     We accordingly hold that all the properties held in the name of TCH as shown in Annex A are realisable properties. However, we wish to add two qualifications to what might appear to be a fairly harsh result. First, Mr Chan for the PP correctly conceded that the value of the properties held by TCH exceeded the value of the gifts made to her by NTL (which totalled about S$4 million). Under s 21(3) of the CDSA, the Public Trustee shall exercise the powers to realise the properties “with a view to realising no more than the value of the gift”. While any property held by the donee may potentially be realised, no more than the value of the gift can go towards the satisfaction of the confiscation order. The total value of the properties held in TCH’s name exceeds S$5.5 million. Hence, the Public Trustee should not realise more than is sufficient to meet the claim of the PP. 52     Secondly, in the present case, we understand that all the properties have been realised or sold and that the proceeds of sale are held by the Public Trustee. In our view, if they had not been sold, we would have directed the Public Trustee, as a matter of principle, not to sell TCH’s matrimonial home, whichever property it was. However, there is no evidence before the court on this matter. 53     We note that the English courts have held, in relation to competing claims for the enforcement of confiscation orders and the making of ancillary orders under matrimonial proceedings, that the court may exercise its discretion to determine which claim should take priority, seeCustoms & Excise Commissioners v A[2003] 2 WLR 210,Webber v Webber and CPS[2006] EWHC 2893 andCPS v Richards[2006] EWCA Civ 849. We nevertheless express no concluded opinion on whether a balancing exercise between the public policy to deprive a defendant of the fruits of his crime and the protection of innocent third party interests may be of equal relevance in determining how and what property should be realised from the pool of realisable assets. But, it should be noted that under s 19(6) of the CDSA, “[t]he High Court may empower the Public Trustee or any receiver to realise any realisable property in such manner as the Court may direct”, which implies that the High Court may, in the exercise of its discretion, refuse to empower the Public Trustee to sell the matrimonial home where there are other assets of sufficient value to satisfy the value of the gifts to the spouse.",
        "Issue III: Whether the monies held in UYH’s bank accounts were realisable properties": "54     The Judge accepted UYH’s submissions and rejected the PP’s submissions that the monies in UYH’s bank accounts (the two SCB Accounts and the three DBS Accounts: see [15] above) were realisable properties. The Judge’s findings on this issue are set out at [42]–[46] of the Judgment as follows: 42    UYH asserted that the monies in his bank accounts were the balance of $2m received as part payment due under an oral agreement for NTL to buy from him, Ung Yoke Khim (“UYK”) and Soon Ah Lan (“SAL”) four million shares in a company, Citiraya Teknologi Sdn Bhd (“CTSB”), which major shareholder was Centillion. 43    The PP disputed the existence of the agreement. Questions were raised over the fact that the agreement was not evidenced in writing and that no shares were transferred to NTL (UYH's evidence was that it was agreed that the shares were to be transferred only upon full payment). UYH had produced affidavits from UYK and SAL which confirmed that there was to be a sale of the shares. These affidavits exhibited letters from UYK and SAL appointing UYH to represent them in the negotiations. UYK gave oral evidence at the hearing and he was not questioned on the letter of authority he issued to UYH. SAL's attendance in court was dispensed with when it was disclosed that she was hospitalised in Malaysia and was uncontactable. 44    I found on a balance of probabilities that there was an agreement for the sale of the shares as described by UYH. There was no dispute that UYH, UYK and SAL owned four million shares in CTSB which they were prepared to sell to NTL. On the other hand, the PP did not put up any plausible reason for UYH to be holding the money on trust for NTL, or for NTL to have made gifts of the money to UYH. 45    I found that UYH had established his interest in the money in his bank accounts. There was no allegation that s 13(2)(a) or s 13(2)(b)(ii) of the CDSA applied to him. As for the issue of consideration under s 13(2)(b)(i), there was no allegation that the purchase price of $1 a share (as stated by UYH) was insufficient consideration. However, I did not declare that the money belonged to UYH beneficially because the money may be refundable as the sale of the shares was aborted because CTSB was wound up subsequently. That question should be determined in separate proceedings between NTL, UYH, UYK and SAL. I limited myself to declaring that the money in the accounts as stated at para 5.18 of OS 785/2008 was not realisable property. 46    It should be stated that the PP had included the monies in two of the five bank accounts of UYH (corresponding to paras 5.18(i)–(ii) of OS 785/2008) in an affidavit listing properties that were traceable to the proceeds of sale of the misappropriated chips (see [51] below), and this list was accepted by Centillion. However, UYH had not accepted the list, and he was not bound by any admissions contained in it. As the inclusion of the two accounts in the list was not supported by any evidence, there was no proof, as far as UYH was concerned, that the money in the two accounts was traceable to the proceeds of sale of the misappropriated chips. Before us, the PP has argued that the Judge erred in finding that there was an agreement between NTL and UYH for the purchase of UYH’s 40% CTSB shares for the following reasons: (a) there was no proper documentation of the sale, which was most unusual for a sizable sale of this nature, (b) NTL was alleged to have agreed to pay S$4 million for 40% CTSB shares with a nominal value of RM4 million, that is to say, at more than twice their value, and (c) there was no reason why NTL would want to purchase 40% CTSB shares personally since Citiraya owned the other 60% and he was then thede factocontroller of Citiraya and had control of CTSB as the dominant shareholder. 55     We are unable to accept the PP’s argument on this issue. Before the Judge, UYH had explained that NTL had agreed to pay a high price for his 40% CTSB shares because NTL had told him that he wanted to have full control of CTSB in order to bid for large recycling projects in Malaysia, but that on hindsight, he thought that NTL’s intention was to use CTSB as a vehicle to recycle as good products the electronic scrap which he intended to steal from Citiraya. Although the Judge made no express finding on this part of UYH’s evidence, this explanation is not improbable because it might be more profitable for NTL to use CTSB to recycle the electronic scrap rather than to use his Taiwanese or Hong Kong associates for the same purpose. 56     In any case, Mr Chan has not produced a convincing argument on why we should overturn a finding of fact of the Judge based on his evaluation of the oral evidence before him. We accordingly affirm the Judge’s finding on this issue. 57     In the circumstances, we also hold that Centillion’s claim to the monies in UYH’s two SCB Accounts (which had a total sum of S$479,799.32 as at 9 January 2009) fail for the same reason as Centillion cannot demonstrate that UYH was not abona fidepurchaser of the property derived from the Illegal Proceeds.",
        "Issue IV: Whether Gan’s properties were held on constructive trust for Centillion": "58     Gan was NTL’s chief financial advisor, and she handled the bulk of the impugned transactions related to NTL’s Illegal Proceeds. Gan co-operated with CPIB in its investigations, and appeared before the Judge below to give evidence. The two properties in issue are: (a)     the right to recover a loan of S$3,496,678.37 made from NTL to Gan; and (b)     the monies in a Post Office Savings Bank account held under Gan’s name (“Gan’s POSB account”). 59     The Judge made an order that both properties were realisable, but did not declare that Centillion was entitled to claim them on the basis of a constructive trust (see Appendix B and Appendix C to the Judgment). Centillion argued that there was sufficient evidence of traceability to find that Centillion had a constructive trust over the properties. The PP conceded that the loan and most part of the monies in Gan’s POSB account were traceable, but had been inadvertently left out from the list of Traceable Properties in Tok’s Affidavit. 60     The sole disputed property before us is the sum of S$651,997.82 transferred by Gan to her POSB account from a Hongkong and Shanghai Banking Corporation Ltd account held by New Media Assets, which the PP argued could not be shown to be traceable to the Illegal Proceeds. Mr Ang for Centillion made the oral submission that while there was no direct evidence that the S$651,997.82 was traceable to the Illegal Proceeds, it could be inferred that the money had, on a balance of probabilities, come from Pan Asset given the circumstances, and that only the PP had the relevant documents to ascertain the source of the S$651,997.82. 61     Centillion accepted – correctly in our view – that the burden of proof was on the party asserting an interest under s 13 of the CDSA. We are nonetheless cognisant of the fact that the compromise between Centillion and the PP in relation to discovery had created an evidential gap, whereby the only evidence that Centillion could present before this court and the court below on traceability were the assertions in Tok’s Affidavit. For this reason, the PP is estopped by the admissions of its own witness in relation to the traceability of the undisputed properties. We also accept Centillion’s argument and find that an inference may be drawn that the sum of S$651,997.82 is traceable to the Illegal Proceeds. We did not have any information before us on NTL’s legitimate sources of income nor the purpose for which New Media Assets was used, but as we now know with the benefit of hindsight, many shell companies were incorporated and controlled by NTL for the purpose of channelling the proceeds from the sale of the electronic scrap. We can only draw the most commonsensical and natural inference that New Media Assets was yet another one of such conduits. In our view, it would be implausible to conclude that New Media Assets was used to manage NTL’s legitimate income instead of acting as a vehicle for laundering the Illegal Proceeds. 62     We therefore find that the two properties are traceable to the Illegal Proceeds and hold that Centillion has a constructive trust over the chose in action in the form of the right to recover the loan of S$3,496,678.37 and all the monies in Gan’s POSB account save for the S$500 deposit paid by Gan and the interest accruing on the S$500.",
        "Issue V: Whether the Ventures Trust properties were held on constructive trust for Centillion": "63     Ventures Trust was a company that was alleged to have been set up by one Wee Kok Keng (“Wee”), who made a statement to CPIB Investigating Officer Fong Wai Kit (“Fong”) that some monies and shares held by Ventures Trust belonged beneficially to NTL. This statement was recorded in an affidavit filed by Fong. On that basis, the PP sought to realise the Ventures Trust properties, which consisted of: (a)     (4,500,000 / 6,633,360 x 100) percent of 29,600,000 China Enersave Ltd shares and 8,946,000 China Enersave Ltd W110112 in Ventures Trust Pte Ltd’s CDP account; and (b)     the sum of S$153,475.54 in a DBS account maintained under the name of Ventures Trust Pte Ltd (“Ventures Trust’s DBS account”). Wee stated that Ventures Trust had purchased 29,600,000 China Enersave Ltd shares for S$6,633,360 on behalf of NTL and other investors. 8,964,000 China Enersave Ltd W110112 shares were later issued to Ventures Trusts in relation to the 29,600,000 China Enersave Ltd shares. Gan confirmed in her affidavit that NTL had instructed her to transfer the sum of S$4,500,000 from Pan Asset’s UBS account to Ventures Trust for the purchase of the China Enersave Ltd shares. The relevant proportions of these shares were therefore held on trust for NTL. 64     The Judge held that Wee’s statement to Fong on the beneficial ownership of the properties held in the name of Ventures Trust was hearsay and therefore inadmissible. The Judge thus concluded (at [41] of the Judgment) that the Ventures Trust properties were not realisable as there was no direct evidence to establish that these properties were held beneficially by NTL. 65     The PP did not appeal this specific finding in CA 115/2011. However, Centillion submitted that the Venture Trusts properties were realisable, and as they were traceable to the Illegal Proceeds, they were further held on constructive trust for Centillion. Centillion argued that direct evidence was not required in an application for a confiscation or realisation order under O 89A r 2(4) of the ROC which states as follows: Application for confiscation order (O. 89A, r. 2) ... (4)    Unless the Court otherwise directs, the supporting affidavit may containstatements of information or belief with the sources and grounds thereof.[emphasis added] 66     In our view, O 89A r 2 permits a party to rely on hearsay evidence as otherwise there would be no point for the rule to allow such kinds of statements in the supporting affidavit. It is for the court to direct otherwise,ie, not to allow such affidavit evidence to be used. The Judge was wrong to apply the hearsay rule when there was no real dispute between the relevant parties on the beneficial ownership of the Ventures Trust properties. We therefore hold that the Ventures Trust properties are realisable on the basis that these properties were attributable to or purchased using money provided by NTL and were held on trust for NTL. The China Enersave Ltd shares purchased using the S$4,500,000 provided by NTL remain in Ventures Trust’s CDP account and must be traceable to these sums. Further, if the directors or controllers of Ventures Trust have not come forward to claim the properties despite having been served with notice during the initial commencement of proceedings in July 2008, it may reasonably be inferred that they did not wish to claim these properties because they did not have a beneficial title to them. 67     As the PP has conceded that the Ventures Trust properties are traceable to the Illegal Proceeds, we also find that these properties are held on a constructive trust for Centillion.",
        "Issue VI: Whether the PP should be liable to pay costs in a successful application under s 13 of the CDSA": "68     The PP has appealed against the Judge’s order of costs in respect of UYH’s application on the ground that he was performing a public duty. The PP submits that, therefore, the default rule that costs follow the event should not apply on the basis of this court’s decision inLaw Society of Singapore v Top Ten Entertainment Pte Ltd[2011] 2 SLR 1279 (“Top Ten”), which followed the decision of the English Court of Appeal inBaxendale-Walker v Law Society[2008] 1 WLR 426 (“Baxendale-Walker”). In his Judgment, the Judge discussed extensively the decisions in these two cases and held, on the basis of another English Court of Appeal decision inR (Perinpanathan) v City of Westminster Magistrates’ Court and another[2010] 1 WLR 1508 (“Perinpanathan”) that the court would be justified in ordering the police in that case to pay the costs of a successful claimant if the police had conducted the proceedings unreasonably (although the Court of Appeal did not in that case), at [88] of the Judgment as follows: There was no question that the PP was performing a public function in making an application under the CDSA against NTL and in relation to properties connected to him. However, for the reasons stated above, in the circumstances the starting point on costs in this case was that costs follow the event, as prescribed in O 59 r 3(2) of the Rules of Court. That, however, was only the starting point: it did not have to be adhered to if the circumstances justified a departure. The fact that the PP was carrying out his public duty to proceed under the CDSA against NTL was a relevant factor, but it was not a conclusive factor. The manner in which the PP dealt with the applications of UYH and Centillion also had to be considered. The PP's conduct of the proceedings had to be reasonable for me to consider not awarding costs against him, but as I have noted above (eg, at [43]–[44] and [57]–[63]), some of the positions taken by the PP fell short of that. That led to the continuation of hearings which may have been unnecessary if a more careful approach had been taken. In the circumstances, it was appropriate that costs be ordered to follow the event. 69     The Judge ordered that the PP pay the costs of the proceedings on the ground that counsel for the PP had conducted the proceedings in a manner that fell short of being reasonable in that he had prolonged the hearing unnecessarily. We, of course, are not in a position to disagree with the Judge on the utility of the forensic services of counsel for the PP to the court, nor are we prepared to hold that he had set “too exacting a standard” in this respect: see Lord Neuberger’s statement at [77] ofPerinpanathan. We can accept his assessment on these matters. However, in so far as the Judge relied onPerinpanathanto condemn the PP in costs, we think that he has erred for two reasons. First, although the case ofPerinpanathanalso involved proceedings under a similar statute,ie, the English POCA, the factual matrix there was quite different from that of the present case. In that case, the police had detained the claimant’s cash on arrival in London on the suspicion that it was for use in unlawful conduct,ie, terrorism. The police applied under the English POCA to forfeit the cash, but the application was dismissed by a Magistrates’ Court which made no order as to costs. The claimant sought judicial review of the order of no costs, but did not challenge the finding that the police had reasonable grounds for suspicion throughout. The Divisional Court dismissed the claimant’s application accordingly. 70     Secondly, it is also necessary to point out that inPerinpanathan, Lord Neuberger articulated the conceptual difficulty in distinguishing between assisting the court and actively opposing an application of this nature. Lord Neuberger said at [67] –[68] ofPerinpanathan: 67    [Counsel for the claimant] contended that the combined effect of those three decisions is that one must distinguish between cases where the police simply assist the court (and should not be at risk on costs), and cases where they take an active part in the proceedings (and should be at risk on costs). … 68    Further, [counsel’s] contention strikes me as somewhat inconsistent and inconvenient. It is a little inconsistent to say that the police should not be liable for costs if their actions require a person to incur the expense of seeking relief from the court and they turn up to assist the court, but that they should be liable for costs if they go a little further and oppose the grant of the relief. The reason for not making a costs order in the former case is that the police are reasonably performing their duty, but, if that is right, I find it hard to see why it should not also apply in the latter case. The inconvenience, if [counsel’s] contention is right, arises from the fact that assisting the court and opposing the application can sometimes merge or overlap: the police might be neutral, while seeing it as their duty to produce evidence and arguments against the claimant in order to assist the court. 71     We are unable to agree with the Judge’s approach. Although confiscation proceedings under the CDSA are civil proceedings and therefore the determination of costs in such proceedingsprima faciefalls under O 59 of the ROC, it should be remembered that the rule that costs follow the event was an established rule even before O 59 came into existence. Confiscation proceedings under the CDSA are different from ordinary civil proceedings because they are initiated by the PP under the CDSA for a public purpose and in the public interest – to prevent defendants and their associates from enjoying the fruits of their crime. Before confiscation proceedings can be initiated, the State would have incurred considerable resources in order to investigate, collect or seize the assets of the defendant. The PP’s List of Realisable Properties would give an indication of the amount of time and effort expended in collecting and seizing these assets. 72     For these reasons, we do not agree with the Judge that the starting point in determining the issue of costs in confiscation proceedings is that costs follow the event and that the PP’s role in such proceedings is only a factor to be taken into account in determining whether he should be made to pay the costs of a successful claimant. As the PP is required by the CDSA to take the necessary proceedings to confiscate the proceeds of crime of any defendant, he is carrying out a function in the public interest and the ordinary rule under O 59 that costs follow the event does not apply to confiscation proceedings under the CDSA. The proper rule to apply is that given the nature of confiscation proceedings where claimants of an interest in realisable properties have the right to intervene in the confiscation proceedings to prove their entitlement to such properties, and given the interest of the State in realising such properties, the rule on costs should either be that the costs of all claimants and the PP should come out of the pool of realisable properties, or alternatively, that each party should pay his own costs. In our view, the fairer and more efficient rule on costs is that each party should pay his own costs. Accordingly, we so order. 73     As regards the Judge’s order of half costs against the PP in favour of Centillion, this order should be set aside in the light of the principle which we have laid down at [72] above. However, as the PP had agreed with Centillion that he would not be appealing against this order, we shall not disturb the Judge’s order.",
        "Conclusion": "74     For the reasons above, we allow the appeals in CA 114/2011 and CA 115/2011 in part. 75     In relation to CA 115/2011, we hold that: (a)     TCH’s properties (see Annex A) are realisable properties. (b)     All the bank accounts held by UYH,viz, the two SCB accounts and the three DBS accounts are not realisable properties. (c)     The ordinary rule that costs follow the event does not apply to confiscation proceedings under the CDSA, and the proper rule is that each party pays his or its own costs. 76     In relation to CA 114/2011, we hold that: (a)     Centillion’s right to execute a judgment is not an interest in the Executable Properties (see Annex B) under s 13 of the CDSA. (b)     The properties held by Gan and Ventures Trust are held on constructive trust for Centillion. 77     Each party will pay its or his own costs here and below. The orders of the Judge that were not appealed will stand according to their own terms. ANNEX A: THOR CHWEE HWA’S PROPERTIES Properties held under the joint names of Ng Teck Lee and Thor Chwee Hwa: PropertyEstimated value as at 9 January 2009[note: 3]Post Office Savings Bank (“POSB”) accountno. [xxx]S$176,091.99Oversea-Chinese Banking Corporation Ltd(“OCBC”) account no. [xxx]S$3,216.07The Hongkong and Shanghai Banking CorporationLtd (“HSBC”) account no. [xxx]S$8.91United Overseas Bank Limited (“UOB”)account no. [xxx]S$14,293.01UOB account no. [xxx]S$7,853.24Balance of proceeds of the sale of 49A Binjai Park, Singapore 589851S$4,517,143.40Balance of proceeds of the sale of 97 Paya Lebar Crescent, Singapore 536181S$1,112,522.85   Properties held under Thor Chwee Hwa’s sole name: PropertyEstimated value as at 9 January 2009[note: 4]POSB account no. [xxx]S$152,415.06DBS account no. [xxx]Closing balance credited into POSB account no. [xxx]OCBC account no. [xxx]S$317,777.60Insurance policies issued by Prudential Assurance Co. Singapore Pte Ltd:(a) policy no. [xxx](b) policy no. [xxx](c) policy no. [xxx](d) policy no. [xxx](e) policy no. [xxx](f) policy no. [xxx].(g) policy no. [xxx]S$423,742.35Insurance policies issued by The Great Eastern Life Assurance Company Ltd under policy no. [xxx]S$108,670.00Insurance policies issued by American International Assurance Company Ltd:(a) policy no. [xxx](b) policy no. [xxx]S$17,927.50Balance of the proceeds of the sale of 84 Binjai Park, Singapore 589879, jointly owned by Thor Chwee Hwa and her mother See Siew GeokS$932,696.56Thor Chwee Hwa’s 60% share in the property 95A Paya Lebar Crescent, Singapore 536180S$1,135,800   ANNEX B: EXECUTABLE PROPERTIES PropertyEstimated value as at 9 January 2009[note: 5]First Commercial Bank account no. [xxx] under Ng Teck Lee’s nameSS$98,391.80First Commercial Bank account no. [xxx] under the name of Ng Teck Lee General TradingS$1,401.11First Commercial Bank account no. [xxx] under the name of Ng Teck Lee General TradingUS$1,008.66Insurance policies issued by Prudential Assurance Co. Singapore Pte Ltd:(a) policy no. [xxx] (life assured: Ng Teck Lee)(b) policy no. [xxx] (life assured: Ng Teck Lee(c) policy no. [xxx] (life assured: Ng Jing Ling)S$82,768.45Insurance policies issued by American International Assurance Company Ltd:(a) policy no. [xxx] (life assured: Ng Teck Lee)(b) policy no. [xxx] (life assured: Ng Teck Lee)(c) policy no. [xxx] (life assured: Ng Teck Lee)(d) policy no. [xxx] (life assured: Ng Teck Lee)(e) policy no. [xxx] (life assured: Ng Teck Lee)S$90,572.22Proceeds of the sale of 49A Binjai Park, Singapore 589851, owned jointly with Thor Chwee Hwa.S$4,517,143.40POSB account no. [xxx] under the name of Kwok Seng HwaS$676,609.19279,000 Citiraya Industries Ltd shares in Goh Lik In’s CDP account no. [xxx]S$2,790.001,630,000 Global Voice shares in Goh Lik In’s margin account no. [xxx] with UOB Kay Hian Pte LtdS$24,450.00350,000 Addvalue Technologies Ltd shares in Goh Lik In’s margin account no. [xxx] with OCBC Securities Pte LtdS$19,250.00500,000 China Enersave Ltd shares (and 151,125 China Enersave Ltd W110112) in Goh Lik In’s margin account no. [xxx] with OCBC Securities Pte LtdS$8,255.62586,000 ISG Asia Ltd shares in Goh Lik In’s margin account no. [xxx] with OCBC Securities Pte LtdS$54,180.00300,000 KLW Holdings Ltd shares in Goh Lik In’s margin account no. [xxx] with OCBC Securities Pte LtdS$7,500.00250,000 NTI International Limited shares in Goh Lik In’s margin account no. [xxx] with OCBC Securities Pte LtdS$3,750.004,256,000 Santak Holdings Ltd shares in Goh Lik In’s margin account no. [xxx] with OCBC Securities Pte LtdS$468,160.00Deposit no. 7727 in the OCBC client account no. [xxx] of M/s Allen & Gledhill LLPS$711,722.04    [note: 1]CA 114/2011 Appellant’s Core Bundle at p 16. [note: 2]Ibidat pp 30 and 33. [note: 3]Affidavit of Fong Wai Kit filed in OS 785/2008 on 11 February 2009. [note: 4]Ibid. [note: 5]Ibid."
    }
}