{
    "case_title": "AQS\n      v\n      AQR",
    "ncitation": "[2012] SGCA 3",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This was an appeal against the ancillary orders made by the High Court Judge\n                    (“the Judge”) inAQR v AQS[2011] SGHC 139 (the “GD”) pursuant to the\n                    parties’ divorce. The appellant is the wife (“the wife”) and\n                    the respondent is the husband (“the husband”). The parties had\n                    their marriage dissolved by Interim Judgment on 30 March 2010. The Judge\n                    made her ancillary orders on 14 January 2011. We heard the parties on\n                    30 September 2011 and allowed the appeal in part. We now set out the\n                    grounds for our decision.",
        "Facts": "",
        "The marriage": "2       The husband is an American citizen of German origin. The wife is a Vietnamese\n                    citizen. Both have been Singapore Permanent Residents since 18 January\n                    2002. At the time of the ancillaries, the husband was 50 years old and the wife\n                    42 years old. 3       The parties met in 1993 in Hanoi where the husband was working for a foreign\n                    company and the wife was employed as a hotel bar waitress. They married in Hanoi\n                    on 22 August 1996. 4       At the time, the wife was a single parent with a daughter, [C]), whom she had\n                    had in 1990 out of wedlock. At the time of the hearing before us, [C] was 20\n                    years old. It was undisputed that the husband financially supported and cared\n                    for [C] as part of the matrimonial household since the parties married. 5       The parties moved to Singapore in February 1998 when the husband found a job\n                    in Singapore. Their only child, [B] was born in Singapore in July 1999. At the\n                    time of the hearing before us, she was 12 years old. 6       During the subsistence of the marriage, the wife was a full-time homemaker and\n                    the husband worked as a director of sales in an American company in\n                    Singapore.",
        "The matrimonial home and the Memorandum signed by husband on\n                5 April 2006": "7       The matrimonial home at [address redacted] (“the matrimonial\n                    flat”) was acquired between 2005 and 2006. The Option to Purchase the\n                    matrimonial flat (“the Option”), dated 14 December 2005, was\n                    originally in the husband’s sole name.[note: 1]The exercise of the Option, dated 28 December 2005, was however\n                    in the names of both the husband and wife.[note: 2]Subsequently, the husband’s solicitors wrote a letter dated\n                    27 February 2006 to the solicitors of the vendors of the matrimonial flat,\n                    stating that they had received instructions from the husband and wife that the\n                    conveyance was to be in the wife’s sole name. The reason for this was a\n                    “private family arrangement” between the husband and wife.[note: 3]The husband also wrote a letter, dated 20 March 2006, to his\n                    property agent directing that the matrimonial flat be transferred to the sole\n                    name of the wife.[note: 4]Significance was placed by the wife as to the aforesaid sequence of\n                    events. 8       Furthermore, on 5 April 2006, the husband signed a memorandum “To\n                    Whom It May Concern” (“the 5 April 2006 Memorandum”)\n                    where he stated that:[note: 5] I, [the husband], hereby certify that, in case of a divorce between my\n                        wife, [the wife], and me, the paramount decision on dividing assets is the\n                        future wellbeing of our children, [C] and [B]. Therefore, I will commit to leaving 70% of our common assets at the time\n                        of divorce at the disposal of my wife and my children. 9       The 5 April 2006 Memorandum was signed only by the husband. The wife\n                    relied heavily on this 5 April 2006 Memorandum in the ancillaries below and\n                    in the appeal before us.",
        "The breakdown of the marriage": "10     The husband left the matrimonial flat in December 2006 after a domestic\n                    conflict. 11     Unusually, [C] left the matrimonial flat to live with him. [C] gave evidence\n                        that[note: 6]: When I found out the [husband] was moving out of the home, I had\n                        voluntarily asked him if I could move out together with him as I have been\n                        very traumatised by the [wife’s] behaviour and abuse, pushing me into\n                        depression, and I no longer wanted to live in constant fear of being\n                        attacked by her everyday. 12     However, the husband continued to return to the matrimonial flat and\n                    interacting with the wife and [B], including helping [B] with her homework and\n                    even having sexual relations with the wife,[note: 7]though their relationship continued to be problematic. The\n                    husband’s Statement of Particulars in the divorce suit (see below at[13]) – in both the original and\n                    amended versions – included lengthy details of the wife’s\n                    unreasonable behaviour both before and after December 2006 when he left the\n                    matrimonial flat. 13     The husband filed for divorce on 25 April 2008 on the basis of\n                    s 95(3)(b) of the Women’s Charter (Cap 353, 1997 Rev\n                    Ed)(the “Women’s Charter”),ie, that the wife had behaved in such a way that the husband could\n                    not reasonably be expected to live with her. The wife initially contested the\n                    divorce and filed a defence on 13 June 2008. Subsequently, however, parties\n                    agreed to an Amended Statement of Particulars[note: 8], and the husband’s suit proceeded on an uncontested basis on\n                    the ground of the wife’s unreasonable behaviour. Interim Judgment was\n                    granted on 30 March 2010.",
        "The ancillary proceedings": "14     As at the date of the ancillary hearing, the husband resided at rented\n                    premises which he had leased at $2,700 per month for his own and [C]’s\n                    accommodation. The wife resided at the matrimonial flat with [B], and it was\n                    undisputed that the husband nevertheless continued to pay for all the outgoings\n                    of the matrimonial flat. 15     The custody, care and control and access to [C] were never issues in the\n                    ancillary proceedings. The wife requested that no order be made in respect of\n                    the custody, care and control, and access of [C].[note: 9]At the time of the hearing before us, [C] was still living with the\n                    husband and being financially supported by the husband. 16     The ancillary matters that came up for hearing before the Judge pertained\n                    to: (a)     Custody, care and control of [B]; (b)     Division of the matrimonial assets including the matrimonial flat;\n                        and (c)     Maintenance for the wife. 17     The husband and wife eventually consented to joint custody of [B] with care\n                    and control to the wife.",
        "The assets": "18     Only four assets were really in contention in the ancillaries. 19     The first asset was the matrimonial flat. Both the husband and wife claimed a\n                    100% share of this in the division of matrimonial assets. 20     The second and third assets were two properties the parties had acquired in\n                    Australia (“Gracemere Gardens” and “Gracemere\n                    Waters” respectively; collectively “the two Australian\n                    Properties”). The husband asked for a 100% share in these properties\n                    whereas the wife asked for 70%, allegedly in accordance with the 5 April\n                    2006 Memorandum, or in the alternative at least 50% as a “just and\n                    equitable” division. 21     The fourth asset was the various bank accounts of the partiesother thanthe bank accounts for the mortgage loans\n                    taken out for the matrimonial flat and the two Australian properties. One bank\n                    account was in the husband’s sole name, one in the wife’s sole name\n                    and the remaining four were in their joint names, but it was undisputed that the\n                    husband was the exclusive source of funds in all. The wife asked for an equal\n                    division of all the accounts in credit. 22     The remaining properties owned by either or both parties – namely, the\n                    wife’s properties in Vietnam, the bank accounts for the mortgage loans\n                    taken out for the matrimonial flat and the two Australian properties, and the\n                    parties’ respective CPF accounts – were not in dispute. 23     The wife alleged that husband had not disclosed certain assets[note: 10]such as bonuses, incentives, and other financial benefits under his\n                    employment contract; insurance policies; other bank accounts; rental income from\n                    Gracemere Gardens property; tax refunds; and stock options under Clause IIIA of\n                    his Employment Contract[note: 11]. She also denied that he was liable to pay tax to the US\n                    authorities, as he had claimed in his affidavits. However, the Judge rightly\n                    held that the wife provided completely no documentary evidence to back up such\n                    allegations, and the husband provided cogent rebuttals of her assertions in the\n                    Plaintiff’s 3rdAffidavit (see GD at [34]). The wife quite rightly dropped these\n                    assertions in the appeal before us. However, the one matter she did pursue was\n                    her allegation that the husband failed to disclose his stock options under\n                    Clause IIIA of his Employment Contract. The Judge in [34] of the GD accepted the husband’s\n                    explanation that his stock options had no value because the company had not gone\n                    public – his company was a small start-up company and had no plans to go\n                    public and therefore had not attached any monetary value to its stock. We will\n                    address this further at[45]below.",
        "Decision Below": "24     Other than the matters pertaining to the custody, care and control of [B], the\n                    Judge made,inter alia, the following\n                    orders: (a)     The wife was to transfer to the husband all her rights, title, and\n                        interest in the matrimonial flat as well as her rights, title and interest\n                        in two Australian properties without consideration. The cost of transfer for\n                        all three properties was to be borne by the husband; (b)     The husband was to pay the wife a lump sum maintenance of $250,000 as well\n                        as a one-off payment of $10,000 to assist her in shifting out of the\n                        matrimonial flat, totalling $260,000; (c)     The husband was to meet [B]’s expenses, including but not limited to\n                        schools, tutors, school bus operators, guitar tutor, life and accident\n                        insurance companies, handphone service operator, doctors and dentists, by\n                        direct payment to these third parties or by GIRO arrangements; (d)     The husband was to continue to maintain [C] who was at liberty to continue\n                        to reside with the husband; (e)     The wife, at the husband’s expense, was to seek counselling for\n                        anger management for a period of six months from a psychiatrist whose\n                        services should first be approved by the husband; (f)     Other than the transfer of the properties set out in (a) above, the\n                        parties were to retain their assets which were in their sole names including\n                        the wife’s two properties in Ho Chi Minh City, Vietnam. (g)     The wife was to remove her name from the two[note: 12]joint accounts maintained by the husband.",
        "Parties’ arguments": "25     In the appeal before us, the wife argued: (a)     The Judge erred in holding that the wife had a violent disposition as\n                        alleged by the husband and [C]; (b)     The Judge erred by placing undue weight on the contents of the affidavit\n                        of [C]; (c)     The Judge erred in ordering all the matrimonial assets to be transferred\n                        to the husband with no consideration to the wife; (d)     The Judge erred in concluding that the wife had failed to contribute\n                        towards the welfare of the family for the duration of the marriage of 14\n                        years; (e)     The Judge erred in concluding that the 5 April 2006 Memorandum was\n                        signed by the husband under blackmail and as such was not binding; (f)     The Judge erred in finding that the transfer of the matrimonial flat to\n                        the wife’s sole name was procured under duress and blackmail and was\n                        therefore invalid; (g)     That the transfer of the matrimonial flat was a gift from the husband to\n                        the wife; (h)     The Judge erred in finding that the wife had not made any contribution\n                        towards the acquisition and improvement of the matrimonial assets; (i)     That the sum of $260,000 ordered to be paid as lump sum maintenance to the\n                        wife was not fair or reasonable; (j)     That the Judge failed to give due weight to the wife’s expenditure,\n                        needs and lifestyle when awarding $260,000 as lump sum maintenance for her;\n                        and (k)     The Judge erred by failing to make a maintenance order in respect of [B]\n                        and ordering instead that the husband pays directly to third parties for her\n                        expenses. 26     The husband argued: (a)     That the Judge was right in ordering the transfer of the matrimonial\n                        properties to the husband with no consideration to the wife; (b)     That the matrimonial flat was not a gift to the wife; (c)     That the lump sum maintenance of $260,000 was fair and reasonable;\n                        and (d)     That the Judge’s order that the husband pay for [B]’s expenses\n                        directly to third parties should be upheld.",
        "Issues before this Court": "27     As was apparent from the issues raised by the wife (at[25]above), and the parties’ written\n                    submissions before us, there was extensive dispute between the parties as to\n                    many aspects of their marriage, and many allegations on both sides as to the\n                    conduct of the other. These ranged from whether the wife had a violent\n                    disposition and whether the husband had many affairs and used prostitutes to\n                    whether [C] chose to live with the husband because she had been alienated by the\n                    wife’s violent behaviour or because the husband was having a sexual\n                    relationship with her.We should stress that these were\n                        irrelevant to the real issues before us.Ancillary proceedings\n                    should hardly encourage parties, and should not be used by the parties, to\n                    engage in mudslinging and dwelling on each other’s misconduct. However,\n                    the Judge did make many findings of fact on the conduct of the parties,\n                    including finding that the husband’s version of events was more credible\n                    than the wife’s (see GD at [29]),\n                    that the wife was vindictive (see GD at [32]) and selfish (see GD at [37]) whereas the husband was “not only selfless but\n                    magnanimous” (see GD at [38]).\n                    This perhaps explained why the parties’ characters and conduct featured so\n                    significantly in the wife’s appeal. Insofar as these findings of fact\n                    formed the basis of the Judge’s order for the division of matrimonial\n                    assets, we will elaborate below as to why we thought this was wrong in law. For\n                    now, we stress that despite the various issues framed by the parties, there were\n                    really only four issues before us: (a)     Whether the Judge’s orders with regard to the division of the\n                        matrimonial assets should be upheld; (b)     Whether the Judge’s order for lump sum maintenance of $260,000\n                        should be upheld; (c)     Whether the Judge’s order that the husband pay for [B]’s\n                        expenses directly to third parties should be upheld; and (d)     Whether the Judge’s order that the wife attend anger management\n                        counselling with a psychiatrist approved by the husband, at the\n                        husband’s expense, should be upheld;",
        "Our decision": "",
        "Division of matrimonial assets": "28     When it comes to the division of matrimonial assets, an appellate court will\n                    only overturn an order if it can be shown that the judge below had erred in law\n                    or had clearly exercised his discretion wrongly or had taken into account\n                    irrelevant considerations or had failed to take into account relevant\n                    considerations (Yeo Chong Lin v Tay Ang Choo Nancy and\n                        another appeal[2011] 2 SLR 1157 at [80]\n                        (“Nancy Tay”)). In this case,\n                    before we turn to consider the question of what a just and equitable division of\n                    the matrimonial assets should be, we first deal with the wife’s arguments\n                    that (i) the matrimonial home should be solely allotted to her because it was a\n                    gift from the husband and (ii) 70% of all other matrimonial assets should be\n                    given to her either because they were gifts to her or because they were the\n                    subject of the 5 April 2006 Memorandum – more particularly, whether\n                    these precluded the court from dividing the matrimonial assets in proportions we\n                    held to be just and equitable. Whether the matrimonial flat and 70% of all other matrimonial assets\n                were gifts to the wife and/or the subject of an agreement made in contemplation of\n                divorce The matrimonial flat 29     The wife’s position was that she should be allowed to\n                    ‘retain’ the matrimonial flat wholly because it was in her sole\n                    name, it being a gift from the husband. 30     First and foremost, insofar as the wife’s arguments relied on the mere\n                    fact that the matrimonial flat was in her sole name, they were irrelevant to the\n                    question of division of matrimonial assets. Matrimonial assets by definition\n                    include assets owned only by one party (s 112(10) of the Women’s Charter),\n                    which are liable to division upon divorce. Moreover, while the wife was the sole\n                    legal owner of the matrimonial flat, the husband was the sole equitable owner\n                    because it was undisputed that he made all the financial contributions towards\n                    its purchase.The material question was whether placing the\n                        matrimonial flat in his wife’s sole name evinced an intention on the\n                        part of the husband to make a gift to the wife. The Judge held\n                    that the husband had no such intention. She accepted the husband’s\n                    explanation that at that time he had only transferred the matrimonial flat to\n                    the wife’s sole name because he feared that if he did not give in to her\n                    demands, she would subject him to physical and mental torture and not allow him\n                    to see the two children (see GD at [35]). 31     In our view, the wife’s explanation of the husband’s intention to\n                    gift her the matrimonial home was somewhat unbelievable: she alleged that after\n                    the Option was exercised in both their names, she “spoke to the Plaintiff\n                    and reminded him of his assurances [made before their marriage, to provide her\n                    with a house in their country of residence], and the Plaintiff gladly,\n                    voluntarily, gave specific instruction to our solicitors to have the matrimonial\n                    home registered in my name only.”[note: 13]Be that as it may, it was not necessary for us to make any specific\n                    finding as to whether the husband only transferred the matrimonial flat to her\n                    solely on account of duress (however see[35]below) becauseeven if the husband did\n                        intend to make a gift of the matrimonial flat to the wife, this did not in\n                        law preclude it from being regarded as a matrimonial asset to be\n                        divided(Yeo Gim Tong Michael v Tianzon\n                        Lolita[1996] 1 SLR(R) 633 at [12]). Where the courts have exercised their discretion and not\n                    divided gifts made by one spouse to another, circumstances were exceptional in\n                    the sense that the gift was made for a specific purpose such that it would be\n                    inequitable to allow the giving party to renege on the gift: for example, inWong Ser Wan v Ng Cheong Ling[2006]\n                    1 SLR(R) 416 (see [75]-[78]), the husband made the gift to induce the\n                    wife to halt the divorce proceedings against him; inLee LehHua v Yip Kok Leong[1999]\n                    1 SLR(R) 554 (“Lee LehHua”), the husband made the gift specifically as\n                    compensation for abandoning his wife. That the circumstances inLee LehHuawere\n                    exceptional was affirmed inYow MeeLan v Chen Kai Buan[2000] 2 SLR(R) 659 at [62],\n                    which also affirmed the general rule that where one spouse makes a gift to the\n                    other, the court can still exercise its powers to divide the gift as a\n                    “matrimonial asset” falling within s 112(10) of the\n                    Women’s Charter. Ultimately, whether the court should decide to exercise\n                    those powers depends on the particular circumstances before it, with the aim of\n                    achieving a just and equitable division of matrimonial assets between the\n                    parties. 32     In this case, there was no evidence that the husband gifted the matrimonial\n                    flat to the wife for a specific purpose such that it would be inequitable for\n                    the court to now divide the matrimonial flat between the parties. Of course, we\n                    noted that the wife had argued that she originally married the husband in 1996\n                    only on the basis of his promise to provide her with a house in her country of\n                    residence and 70% of all matrimonial assets, but she adduced no objective\n                    evidence of this whatsoever, other than what she asserted. In fact, we found it\n                    difficult to believe her claim for the reasons which we elaborate at[34]-[35]below. 70% of all other matrimonial assets 33     The wife further argued that she was entitled to 70% of all common assets\n                    because the husband had expressly so promised her. According to her, this\n                    agreement was evidenced by the 5 April 2006 Memorandum (referred to at[8]-[9]above). 34     First, even accepting the fact that the husband had voluntarily agreed to give\n                    the wife 70% of the matrimonial assets as gifts, as we already explained at[31]above, those gifts were also liable\n                    to division as matrimonial assets save for exceptional circumstances which did\n                    not arise in this case. Second, insofar as this argument pertained to an\n                    agreement in contemplation of divorce, the credibility of this argument was\n                    somewhat undermined by the wife’s inconsistent accounts of the purported\n                    agreement. The wife argued below that she agreed to marry the husband “on\n                    the assurances” that he would provide her with a house in her country of\n                    residence and a 70% share in all other assets acquired during the\n                        marriage”.[note: 14]However, there was completely no evidence that this was the original\n                    basis of the marriage, with the wife’s only evidence being the\n                    5 April 2006 Memorandum[note: 15]. In the first place, this begged the question as to why the\n                    memorandum was only signed some ten years later on 5 April 2006 if it were\n                    the basis of the marriage in 1996. In the second place, and more importantly, if\n                    her position was that the agreement to give her a 70%-share in all common assets\n                    was the basis of the marriage in 1996, this was fundamentally inconsistent with\n                    what was clearly stated in the 5 April 2006 Memorandum that it was an\n                    agreement madein contemplation of divorce, for\n                    the purposes of s 112(2)(e) of the Women’s Charter.[note: 16] 35     In any case, an agreement between the parties made in contemplation of divorce\n                    could not be decisive. It is only one of the factors listed in s 112(2) of\n                    the Women’s Charter that the court must take into account as part of its\n                    overarching duty to reach a just and equitable division in light of all the\n                    circumstances of the case. This Court affirmed inTQ v TR and\n                        another appeal[2009] 2 SLR(R) 961 at [75] that\n                    even though post-nuptial agreements could be accorded more weight than\n                    pre-nuptial agreements, how much weight was to be allocated to a postnuptial\n                    agreement must ultimately depend on the precise circumstances of the case. In\n                    this case, we were of the view that the 5 April 2006 Memorandum should be\n                    accorded little weight because it seemed dubious. Its form was somewhat unusual:\n                    it was not really an agreement between both parties in the usual form but a\n                    unilateral declaration of intent signed by the husband with the heading,\n                    “To Whom it May Concern”, without further elaboration as to what\n                    the context of such a unilateral memorandum was. Furthermore, the wife’s\n                    inherently incredible explanation of how the memorandum came about (ie.that it was made pursuant to the parties’\n                    agreement prior to marriage) did seem to suggest that the only possible\n                    conclusion was per the husband’s version of eventsiethat he had only signed the memorandum under some sort of\n                        duress.[note: 17] 36     Therefore, in our opinion little or no weight should be accorded to the\n                    5 April 2006 Memorandum. It could not preclude this Court from dividing the\n                    matrimonial assets in a manner which was just and equitable. It is to this\n                    question which we now turn. Just and equitable proportions 37     This case was straightforward in the sense that it was undisputed that the\n                    husband made all financial contributions towards the acquisition of assets\n                    during the marriage. The only issue was to determine what a just and equitable\n                    division should be where, as in this case, the husband made all the financial\n                    contributions and the wife’s contributions were exclusively\n                    non-financial. 38     Case law has established that a homemaker wife can receive a significant\n                    proportion of the matrimonial assets even if she has made no financial\n                    contributions whatsoever. This is especially so if the couple has children. It\n                    has been observed that generally, the proportion ordered for a homemaker wife\n                    has not fallen below 35% (Leong Wai Kum,Elements of Family\n                        Law in Singapore(LexisNexis, 2007) at pp 741-745). In the\n                    recent decision of this Court inNancy Tay, the\n                    proportion ordered for the homemaker wife was 35% even when the husband’s\n                    financial contributions were deemed to be “extraordinary” [emphasis added] (Nancy\n                        Tayat [80]). There is only one qualification which we would add.\n                    It does not follow that this will be the appropriate division in all situations.\n                    The length of the marriage is very much a relevant and important consideration.\n                    The parties married in August 1996 and the marriage effectively broke down in\n                    December 2006. The husband filed for divorce in April 2008. An interim judgment\n                    to dissolve the marriage was made in March 2010. If one takes the date of\n                    effective breakdown to determine the length of the marriage, it was a ten year\n                    plus marriage, not entirely a short marriage. But neither could it be regarded\n                    as a long marriage. If one takes the date of the interim judgment as the cut-off\n                    date, then it would be a thirteen-and-a-half year marriage. Whichever view one\n                    might take as to the length, even it were just ten years as the Judge seemed to\n                    take, we could not fail to note that her grant of 0 % to the wife was of\n                    unprecedented severity, bearing also in mind that there was one child to the\n                    marriage. As for the Vietnamese properties in her sole name, and which the wife\n                    was allowed to retain, the fact was that these were not part of the pool of\n                    matrimonial assets in the first place because they were assets “acquired\n                    by one party…by gift or inheritance and that has not been substantially\n                    improved during the marriage by the other party or by both parties to the\n                    marriage” (s 112(10) of the Women’s Charter). It seemed to us that\n                    the grant of 0% to the Wife could be justified only on the basisthat the wife had made no contributions to the marriage\n                        whatsoever.In implicitly making this finding, the Judge relied\n                    on two grounds: (i) the wife’s character flaws and misconduct which made\n                    the husband’s marriage to her “a misery”; and (ii) that she\n                    had domestic help and there “one wonders how large a role she played as a\n                    homemaker bearing in mind her other roles as wife and mother left much to be\n                    desired” (see GD at [33]). 39     With respect to the first ground, while we note that divorce is no longer\n                    based on fault, conduct of the parties in relation to the family is nevertheless\n                    a relevant consideration in the division of matrimonial assets. Here, we would\n                    refer to s 112(2)(d) of the Women’s Charter which provides that the\n                    court, in determining the division of matrimonial assets, shall have regard to\n                    “the extent of the contributions made by each party to the welfare of the\n                    family, including looking after the home or caring for the family...”. In\n                    this case, as the wife did not make any financial contributions towards the\n                    acquisition of the matrimonial assets, her contributions would have to be in\n                    respect of “the welfare of the family, including looking after the home\n                    or caring for the family”. The Judge was, therefore, not wrong to\n                    consider her contributions in that regard. The fault which the Judge found\n                    against the wife was her temperament. Besides the husband, her older daughter,\n                    [C], also confirmed that. While her temperament might have made the\n                    husband’s life miserable, the fact remained that he was, during the\n                    marriage, holding a full-time employment which sometimes required him to travel.\n                    It would have been the wife, a full-time homemaker, who attended to the home and\n                    the needs of the children while he was at work. These contributions must be\n                    worth something and should be given their due credit. Of course, on an issue\n                    such as this relating to the care of the family by a spouse, it is very much\n                    fact-sensitive. No two cases will be the same. But the court should be conscious\n                    of the need to exercise caution when confronted with allegations of this nature\n                    made by one spouse against the other. To find a wife, a full-time home-maker,\n                    particularly where there are children, to have made zero contributions to the\n                    family, the facts must be extreme and also undisputed. Where parties were\n                    clearly in a highly acrimonious relationship and they have alleged various\n                    counts of misconduct against each other, the court should not too readily sift\n                    through the facts and evidence in order to assign relative blame for the\n                    purposes of dividing matrimonial assets. The temptation by the parties to make\n                    such allegation, whether with or without foundation, will be great. As stated by\n                    Woo Bih Li J inYG v YH[2008] SGHC 166\n                    at [32]), the court has a\n                    “reluctance to engage in minute scrutiny oftheconduct and contributions of both\n                        spouses.”In relation to the present case, although the\n                    husband alleged that the wife was abusive and violent, it should be noted that,\n                    by the husband’s own admission[note: 18], the allegations of abuse set out in the Amended Statement of\n                    Particulars did not involve actual violence: rather they consisted of behaviour\n                    such as threatening to beat the children, issuing threats to the husband,\n                    throwing the husband out of the house, picking fights with the husband in front\n                    of the children, threatening the husband that he would never see the children\n                    again if there was a divorce and shouting at the husband that he was a bad\n                    father. Of course, such behaviour was far from ideal in a marriage – and\n                    indeed that was why it founded a divorce on the basis of the wife’s\n                    unreasonable behaviour – but it does not quite make out the Judge’s\n                    finding that the wife had a “violent disposition” of which the\n                    husband and children were victims (see GD at [29]). There was only one instance of actual physical assault on\n                    the husband – this was the incidence where the photographic evidence\n                    thereof was relied upon by the Judge in [28] of the GD – but this occurred only in 2009 after the\n                    husband had left the matrimonial flat in 2006. In the light of other disturbing\n                    facts such as the wife’s counter-allegations of the husband’s\n                    violence and the PPO against the husband and the troubling question as to why,\n                    if the wife’s violence was really so bad, the husband never applied for a\n                    PPO on behalf of himself and his children, we found that the wife’s\n                    abusive nature was not of an extreme one-sided nature or undisputed such that\n                    the court could comfortably find that itcompletely negated\n                        her contributions as a homemaker. Ultimately, where the evidence\n                    shows a marital relationship as acrimonious and dysfunctional as the\n                    parties’ here, it is inappropriate for a court to make findings as to how\n                    good or bad a wife and mother a party was (as the Judge did at [33] of the GD or how good or bad a husband or\n                    father a party was. In our opinion, in the circumstances here, we did not think\n                    that the Judge should have found that the wife contributed nothing at all to the\n                    family purely on the basis that she made the husband’s life a “a\n                    misery”. His life could not have been a misery from day one otherwise the\n                    marriage would not have lasted until December 2006 when the husband walked out\n                    of the home. There would have been an early period of happiness. When the change\n                    occurred was not something we needed to go into. 40     The second ground relied upon by the Judge,iethat it was doubtful how much of a homemaking role the wife played because she\n                    always had domestic help, was also, with respect, erroneous. Having domestic\n                    help does not mean the wife made no contributions as a homemaker at all,\n                    especially when the parties’ household here included two children. InLee Chung Meng Joseph v Krysgman Juliet Angela[2000] 3 SLR(R) 965, Tay Yong Kwang J rejected the husband’s\n                    argument that thewife did not make indirect contributions as\n                        a main caregiver to the children because they had domestic help.\n                    In Tay J’s words at [41] of\n                    the judgment, “Having a maid in the household, or a number of maids for\n                    that matter, does not meanabdication of parental\n                        responsibility” [emphasis added]. Once again, we must\n                    stress that the last thing a court should embark upon is to adjudicate upon\n                    snipes and counter-snipes between the parties as demonstrated in this case: the\n                    husband argued that the wife merely shouted at the maids to do work, and the\n                    wife countered as to how much she had supervised the maids, and so on and so\n                    forth. 41     Therefore, with respect, the Judge erred in holding that the wife made no\n                    contributions at all to the family, especially when this could not be said to be\n                    a short marriage of just a couple of years and when the wife bore one child and\n                    the marital partnership included the raising of two children. It might well be\n                    that in the later years, the wife’s traits as a mother left something to\n                    be desired, but that could not render her contributions to the family as being\n                    zero. 42     All considered, we held that a just and equitable division would be to give\n                    the wife a 20% share of the matrimonial flat and the two Australian properties,\n                    the total value of which was assessed to be approximately $2.5m. We indicated at[21]above that there was one more asset\n                    being disputediethe bank accounts, but as the\n                    total value of these six bank accounts together was very low (ieless than $4000), we felt it unnecessary to divide it. We\n                    further ordered that the 20% share of the matrimonial flat and the two\n                    Australian properties be paid by the husband to the wife within 6 months from\n                    date of our order on 30 September 2011. Stock Options 43     At this point, we would briefly address the wife’s contention that the\n                    pool of matrimonial assets should have included the stock options which the\n                    husband had in the company he worked in, and that the Judge should have drawn an\n                    adverse inference against the husband for failing to disclose these\n                        assets[note: 19]. While it is undisputed that certain categories of stock options can\n                    constitute matrimonial assets (Chan Teck Hock David v Leong\n                        Mei Chuan[2000] SGHC 150), the husband had already\n                    explained in his affidavits that that his stock options had no value because the\n                    company had not gone public – his company was a small start-up company and\n                    had no plans to go public and therefore could not attach any monetary value to\n                    those options. The wife provided no evidence to prove otherwise, and we held\n                    that the Judge was right in accepting the husband’s explanation (see GD at\n                        [34]) by not regarding the options\n                    as an asset of value.",
        "Maintenance": "The facts and parties’ positions 44     We now turn to examine the maintenance question. It was undisputed that the\n                    family’s only source of income was from the husband, who earned $12,600 a\n                    month excluding variable commission. He gave affidavit evidence that his monthly\n                    expenses totalled $20,373, comprising the following including [C]’s and\n                    [B]’s expenses: Personal expenses$4,323[B]’s expenses$1,636.65[C]’s expenses$2,735Expenses at the rented flat$3,504The matrimonial flat$3,545Gracemere Gardens$2,176Gracemere Waters$2,454   45     The wife gave evidence that her monthly expenses totalled $13,562.70,\n                    comprising the following: Mortgage$2500Property tax/TV license$1083Repair and upkeep of the matrimonial flat$150Maintenance of the matrimonial flat$1,246.70Groceries and household expenses$1,200Transport$1,500Utilities$350Telephone/internet/mobile telephone$200Food$1000Maid$300Personal grooming/toiletries$400Clothing and shoes$400Entertainment$1000Cablevision subscription$100Holidays ($10,000 for 4 holidays a year)$833Festive expenses$100Medical and dental expenses$1200   46     On this basis, at the hearing before the Judge, the wife asked for maintenance\n                    of $12,000 for herself and $4000 a month for [B][note: 20]. On appeal before us, however, she moderated this claim downwards to\n                    “at least $5000 a month”.[note: 21] 47     The husband asserted that the wife’s monthly expenses were inflated, and\n                    that the wife’s monthly expenditure – as evidenced by how much she\n                    withdrew from the joint account into which he banked money every month –\n                    was $1250 (consisting of transport, food, maid, toiletries, clothing, and\n                    medical expenses).[note: 22]He also asserted that many of the items listed in the table at[46]above were paid every month by him\n                    and should not be reckoned as part of the wife’s expenses.[note: 23] The Judge’s order 48     As stated at[24]above, the Judge’s\n                    order was for the husband to pay the wife a lump sum maintenance of $250,000 as\n                    well as a one-off payment of $10,000 to assist her in shifting out of the\n                    matrimonial flat, making a total of $260,000. As for the maintenance of [B], the\n                    Judge granted the husband’s request to pay for all of [B]’s expenses\n                    directly to third parties rather than to the wife. The order for the\n                    wife’s maintenance was based on a base figure of $1000 per month computed\n                    over 20 years, totalling $240,000, which would “serve as adequate\n                    provision for the wife’s maintenance until she turned 62 on the basis she\n                    would work and continue working until she reached that age”. The Judge\n                    then added $10,000 to this figure to assist the wife in meeting the expenses of\n                    shifting out of the matrimonial flat into rented premises if she so desired (see\n                    GD at [44]). The appeal 49     There were two issues to be determined on appeal with respect to maintenance:\n                    (i) whether the Judge’s order that the husband pay for [B]’s\n                    expenses directly to third parties should be upheld; (ii) whether the\n                    Judge’s order for lump sum maintenance of $260,000 should be\n                    upheld. 50     On the first issue, we found there to be no particular reason to disturb the\n                    Judge’s order. Although the wife raised it as an issue[note: 24], she did not actually make any arguments as to why this order should\n                    be overturned. In our view, the Judge was entitled to take into account the\n                    husband’s fear that the wife would use the money for herself. More\n                    importantly, [B]’s needs were not prejudiced by this order – in fact\n                    her needs were more comprehensively provided for than if a round figure were\n                    ordered to be paid to the wife every month. For these reasons, we were of the\n                    view that the Judge did not exercise her discretion wrongly, and upheld her\n                    order. 51     As for the lump sum maintenance of $260,000 for the wife, we thought this\n                    amount appeared low, especially when she was not given any share of the\n                    matrimonial assets. She would need to find accommodation for herself. We agree\n                    with the Judge that the wife is not at an age where she will be unable to find\n                    work. She has skills in the beauty industry and there is no reason why she could\n                    not put those skills to profitable use. However, in our opinion, given our award\n                    of 20% share of the matrimonial assets to the wife that would make a difference\n                    to the picture (see s 114(1)(a) of the Women’s Charter andBG v BF[2007] 3 SLR(R) 233 at [75]). The table at[46]above does suggest that the Judge\n                    was right to hold that the wife had deliberately inflated her maintenance claim\n                    (see GD at [25]) – transport\n                    expenses of $1500 and entertainment expenses of $1000 are two clear examples. It\n                    is also clear that items such as mortgage expenses, property tax, utilities and\n                    telephone expenses, maintenance of the matrimonial flat, were attempts to\n                    inflate her expenses, given that the husband paid for these. Her claims for\n                    groceries and household at $1200 and for food at $1000 seemed to us also\n                    inflated. By the husband’s estimate, the wife’s monthly expenses\n                    amounted to approximately $1250 (see above at[48]), which made a sum of $1000 a month slightly low, but when\n                    it is viewed against the fact that the maintenance for the wife is to be paid in\n                    a lump sum up-front and further we have, in this appeal, granted her 20% of the\n                    matrimonial assets, we did not think that the circumstances called for an\n                    intervention in the maintenance award made by the Judge. 52     Although the wife was right to argue that under s 114(1)(c) of the\n                    Women’s Charter, the court in arriving at a maintenance sum must take into\n                    account the standard of living that she was accustomed to[note: 25]and that s 114(2) directs the court to endeavour to place the\n                    parties in the financial position in which they would have been had the marriage\n                    not broken down[note: 26], these are not absolute considerations but are subject to “so\n                    far as it is practicable”, “having regard to their conduct”\n                    and “just to do so”. In this regard, we should further point out\n                    that those considerations must also be balanced against the husband’s\n                    financial needs and obligations (s 114(1)(b)). In this respect, we noted that\n                    the husband is solely responsible to provide for both [C] and [B].",
        "Order to attend anger management counselling": "53     The last issue to be dealt with is the Judge’s order for the wife to\n                    attend anger management counselling with a psychiatrist to be approved by the\n                    husband, at the husband’s expense. In our view, there was sufficient\n                    evidence that it would be in [B]’s best interests for the wife to attend\n                    the same – even discounting the evidence given by [C] and the husband,\n                    which the wife hotly disputed, there was sufficient evidence in the agreed\n                    Amended Statement of Particulars founding the divorce (see[13]above) for the Judge to have found that the\n                    wife “had serious anger management issues that needed to be\n                    addressed” (see GD at [29]). In\n                    light of [B]’s best interests and the fact that the husband was to bear\n                    the cost of such counselling, we upheld the Judge’s order. We further\n                    directed that this was to take the form of four (4) quarterly sessions with the\n                    psychiatrist for the period of a year starting in October 2011.",
        "Conclusion": "54     In summary, we ordered the following: (a)     The wife was awarded 20% of the matrimonial assets (consisting of the\n                        matrimonial flat and the two Australian properties assessed at $2.5m). This\n                        was to be paid by the husband to the wife within 6 months from date of this\n                        order; (b)     The outstanding maintenance paymentsie$200,000 was to be paid in four (4) equal quarterly instalments commencing\n                        on 31 October 2011; (c)     The Judge’s order that the wife was to attend anger management\n                        counselling with a psychiatrist approved by the husband and at the\n                        husband’s expense was to remain. We further directed that this was to\n                        take the form of four (4) quarterly sessions with the psychiatrist for the\n                        period of a year starting in October 2011. (d)     The wife was to move out of the matrimonial flat and hand over the keys to\n                        the husband on or before 30 November 2011; (e)     All other orders made below remained; and (f)     The wife was awarded costs of $5000 plus disbursements; 55     We heard parties again on 8 November 2011 at the wife’s request and\n                    granted the wife an extension of time till 15 February 2012 to vacate the\n                    matrimonial flat and hand over the keys to the husband. We indicated that there\n                    would be no further extension of time.  [note: 1]Core Bundle (vol II) at pp14-19. [note: 2]Core Bundle (vol II) at p20. [note: 3]Core Bundle (vol II) at p22. [note: 4]Core Bundle (vol II) at p21. [note: 5]Core Bundle (vol II) at p13. [note: 6]Record of Appeal Vol III Part A p 124 para 15 [note: 7]Core Bundle (vol II) at p63 [note: 8]Available at Core Bundle (vol II) at p54. [note: 9]RA (vol IV) at p 15 [note: 10]RA (vol III part C) at pp 60-61 [note: 11]Employment Contract available in Core Bundle (vol II) at p\n                                70 [note: 12]See [2] of the\n                                    GD [note: 13]Defendant’s 1stAffidavit, RA\n                                (vol III part B) at pp 138-139 [note: 14]Defendant’s Written Submissions at [7.1], in Record of\n                                Appeal (vol IV) at p16 [note: 15]Defendant’s Written Submissions at [7.2] [note: 16]Appellant’s Case at [85] [note: 17]Plaintiff’s 2ndAffidavit at\n                                    [41]. [note: 18]Respondent”s Case at [29] [note: 19]Appellant’s Case at [92]-[98] [note: 20]Defendant’s 1stAffidavit at\n                                    [25], RA (vol III part\n                                B) at p 123 [note: 21]Appellant’s Case at [149] [note: 22]Plaintiff’s 2ndAffidavit, RA\n                                (vol III part C) at p 8 [note: 23]Plaintiff’s 2ndAffidavit, RA\n                                (vol III part C) at p 7 [note: 24]Appellant’s Case at [9(xi)] [note: 25]Appellant’s Case at [133] [note: 26]Appellant’s Case at [146]"
    }
}