{
    "case_title": "The Royal Bank of Scotland NV (formerly known as ABN Amro Bank NV) and others\n      v\n      TT International Ltd and another appeal",
    "ncitation": "[2012] SGCA 53",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       On 31 January 2012, we released our detailed grounds of decision (The Royal Bank of Scotland NV (formerly known as ABN Amro Bank NV) and others v TT International and another appeal[2012] SGCA 9 (“the GD”)) explaining why we allowed the appeals of the appellant creditors for the scheme of arrangement (“the Scheme”) of the respondent company (“the Company”) to be put to a re-vote on 27 August 2010. We held,inter alia, that a scheme manager has a quasi-judicial role and owes a duty to be objective, independent, fair and impartial (see [75] of the GD). The GD also included our brief grounds of decision of 13 October 2010 (see Annexure II of the GD) where the members and powers of the Monitoring Committee (“MC”) were set out to ensure that it could fairly and effectively oversee the implementation of the Scheme. 2       On 27 January 2012, just a few days prior to the release of the GD, the solicitors of the MC, Rajah & Tann LLP (“R&T”), informed this Court of the existence of a fee arrangement which required the Company to pay to nTan Corporate Advisory Pte Ltd (“nTan”) a “Value-Added Fee” (“VAF”) (ie, a success-based fee) for the latter’s professional services to the Company. nTan is owned by the scheme manager Mr Nicky Tan Ng Kuang (“the SM”). R&T requested this Court to direct that the VAF be assessed in court. We should clarify that the propriety or reasonableness of this VAF was not considered by this Court in sanctioning the Scheme and in the GD, as full submissions had not been made to us earlier by the parties. 3       R&T’s letter prompted the solicitors of the Company, Wong Partnership LLP (“WongP”) and the solicitors of the SM, Allen & Gledhill LLP (“A&G”) to write to this Court stating their clients’ respective positions on the VAF as well. After this, we directed all parties to file written submissions giving their views on the power of this Court to resolve this issue and how the balance between the various competing interests might be fairly struck in assessing the SM’s remuneration. The key issue which has now clearly crystallised is whether the VAF should have been disclosed to the creditors or/and the Court prior to the sanction of the Scheme. The pertinent facts are as follows.",
        "The facts": "",
        "The nature of the VAF": "4       In R&T’s letter dated 27 January 2012, the MC drew our direct attention to the VAF for the very first time: 6.The MC wasrecently informedby the Company that there is a success fee arrangement between the Company and [nTan] as Financial Advisor, that is, for work done prior to the sanction of the Scheme. Under this arrangement, a “Value-Added Fee” became payable to nTan upon the sanction of the Scheme. The terms of this arrangement are set out in Appointment Letters dated 28 October 2008 and 15 May 2009 (collectively, the “Appointment Letters”) … 7.Pursuant to paragraphs 7 and 8 of the Appointment Letter dated 15 May 2009, a “Value-Added Fee” is payable to nTan if “Successful Completion” occurs, that is, if a scheme “is agreed and approved by the Company and the requisite majority of creditors of the Company, and sanctioned by the High Court of Singapore”. [underline in original, emphasis in italics added] 5       The MC’s description of the VAF is substantiated by the appointment letter between the Company and nTan dated 15 May 2009 (“the Appointment Letter”), which sets out in detail the fee arrangements between the Company and nTan (including the various components of the VAF) as follows: 1.Our fees for the engagement comprises:- (a)Our time costs which shall be determined in accordance withSchedule Aattached thereto; and (b)A Value-Added Fee (“Value-Added Fee”) which shall be computed in accordance with paragraphs 3, 4 and 5 below. 2.In addition to the fees set out in paragraph 1 above, you will also be required to pay for our out-of-pocket expenses (including fees of any experts or professionals). Our time costs and out-of-pocket expenses shall be paid promptly and on a monthly basis. 3.TheValue-Added Feeshall comprise: - (a)7.5% of theNet Value of Debt Resolved(as defined in paragraph 4 below); and (b)5.0% ofTotal Gross Transaction Value(as defined in paragraph 5 below). 4.“Net value of Debt Resolved” means the total value of the Group’s actual and contingent liabilities as at 31 October 2008, inclusive of contractual accrued interest and other charges thereon (“Total Debt”) which, uponSuccessful Completion… are waived, written off, extinguished, forgiven or avoided (“Extinguished”), such liabilities to be valued as at the date that each such liability isExtinguished.… 5.“Total Gross Transaction Value” meansthe aggregate of (i)the aggregate value of those parts of theTotal Debt, other than those that have been taken into account asNet Value of Debt Resolved, which, uponSuccessful Completionare: - a)converted to equity in the Company, including inter alia issuance of warrants or options by the Company that are exercisable into equity in the Company (“Converted to Equity”); and b)restructured, including but not limited to, inter alia restructuring by payment of a liability either partially or in full except for amounts paid under paragraph 4 above, conversion into term loans or by rescheduling of payments (in which case the entire amount of those parts of theTotal Debtthat are rescheduled) shall be calculated as part of theTotal Gross Transaction Value… … (ii)new funds raised by us for the Group by the issuance of any equity or debt instruments (“New Investors”); and (iii)the sum of new loans or other new financing from banks and/or non-financial institutions successfully obtained by us for the Group (“New Loans”); and (iv)the fair value of any assets and/or businesses acquired or to be acquired by the Group which have been advised by us following a written confirmation between us that we would provide such advice. … [emphasis in bold in original; emphasis added in italics] The linkage of professional fees to,inter alia, the “Net Value of Debt Resolved” makes it plain that the greater the amount of the debt due to creditors that is “waived, written off, extinguished, forgiven or avoided” or converted into equity, the greater the quantum of the remuneration received by nTan (see paras 3 and 4 in the Appointment Letter above). For ease of reference, we have appended the Appointment Letter in its entirety to this Judgment as Annex A. 6       In reality, the VAF immediately became a contingent liability of the Company in favour of nTan when the Appointment Letter was entered into. As the VAF is a “success-based fee”, it crystallises only at the moment of the “successful completion” of the Scheme. The parties now estimate the quantum of the VAF to be in the region of some $15m to $30m.[note: 1]By any standard, this is an extraordinary amount that will leave many breathless. Notably, the Appointment Letter was neither disclosed to the creditors whose rights were affected by the Scheme (“the scheme creditors”) nor the Court prior to the sanctioning of the Scheme; indeed, it was not even disclosed when the appeal was heard. As nTan was listed as one of the various “excluded creditors” under the terms of the Scheme,[note: 2]the debt restructuring plans in the Scheme did not apply to arrangements with nTan which were to be “paid in the ordinary course of business as and when any amount owing to [the excluded creditor] falls due”.[note: 3]In short, both the drawing up of this arrangement and the intended payment of the fees appear to have confidently proceeded on the basis that both the scheme creditors and the Court had no interest or say in the same, despite the potentially remarkable fees involved. This is troubling as it is plainly evident that the scheme creditors would certainly have a very tangible ongoing interest in a fee arrangement that would result in the SM’s fees increasing proportionately to the quantum of losses they would suffer as a consequence of the “successful” implementation of the Scheme. Put another way, the greater the pain endured by the scheme creditors, the greater the gain of the SM (see [5] above). This undisclosed arrangement raises an issue of considerable importance to the scheme creditors and nTan,viz, whether it is now enforceable by the latter against the Company.",
        "How and when the VAF was disclosed": "7       The crucial dates leading up to the sanction of the Scheme (ie, 13 October 2010) are the scheme meetings on 16 October 2009 and 24 September 2010. It is not disputed by the parties that the scheme creditors werenot informedof the liability of the Company to pay the VAF during or prior to any of the above material dates.[note: 4]This was despite the fact that some scheme creditors (including,inter alia, ABN AMRO Bank N.V., Singapore; BNP Paribas, Singapore Branch and Oversea-Chinese Banking Corporation Limited (“OCBC”)) had earlier written to WongP (ie, the Company’s solicitors) specifically for more information regarding nTan’s professional fees.[note: 5]No information was given by the Company. For instance, on 4 October 2010, WongP responded to one such request by bluntly stating: Our clients do not see the need to justify or explain to you the costs of each and every professional engaged in the matter. They would point out that your clients’ actions have caused or contributed to our clients having to incur professional fees to deal with your clients’ unjustified attacks on the proposed scheme … [emphasis added] 8       During a hearing before us on 5 October 2010, the Company provided a breakdown of the sum of S$31m that, according to the Company’s unaudited financial statements as at 31 March 2010, had been incurred as restructuring expenses and professional fees. However, the VAF was not part of the sum of $31m disclosed to this Court on 5 October 2010.[note: 6] 9       It was only close to a yearafterthe Scheme was sanctioned that details of the VAF were disclosed piecemeal to the MC. On 12 August 2011, the Company convened a meeting to update the scheme creditors on its financial results for the year ended 31 March 2011. The Company informed the scheme creditors that a provision of $63m had been made in the Company’s financial statement for the year ended 31 March 2011 in respect of potential liabilities andother scheme-related expenses. According to the SM and the Company, the $63m as disclosed included the VAF payable to nTan.[note: 7]However, the MC claimed that there was no reference or mention made at the meeting on the 12 August 2011 with regard to the VAF.[note: 8]Indeed, no objective evidence has been produced by the SM or the Company showing that the VAF wasexplicitly disclosedas a “scheme-related expense” during the meeting on 12 August 2011. 10     At a subsequent meeting on 22 September 2011, some information pertaining to the VAF was eventually disclosed. During this meeting, the Company finally acknowledged that the VAF “can be a large amount depending on the total amount of restructured debts”; and that the $63m provision disclosed on 12 August 2011 included the VAF payable to nTan as well.[note: 9]The minutes of the meeting on 22 September 2011 also revealed that the MC had immediately expressed concern and had requested for more details of the VAF to be disclosed – in particular, disclosure of the Appointment Letter between the Company and nTan.[note: 10] 11     Hence, the evidence shows that the MC only became aware of the existence of the VAF on or around 22 September 2011 – around a year after the Scheme was sanctioned. In fact, it was onlyafterthe meeting on 22 September 2011, when the Appointment Letter was finally disclosed to the MC, that the MC could make a proper estimate of the potential liability of the Company in relation to the VAF –ie, an estimated figure of around $15m to $30m.",
        "The prevailing practice amongst scheme managers in relation to success-based fees": "12     When this matter was brought to this Court’s attention, we requested submissions by all three parties on the prevailing practice of success-based fee remunerations of scheme managers both in Singapore and abroad.[note: 11]From the parties’ submissions, it appears that it is not uncommon for some scheme managers (or financial advisors) to include a success-based element of their fees for the debt restructuring works which they have carried out.[note: 12] 13     More importantly, it also appears that there is no established practice in Singapore of such success-based fees of scheme managers beingvoluntarily disclosedto the creditors or the courts. Both the Company and the SM have tendered actual scheme documents of previous schemes of arrangement which do not deal with the exact remuneration of scheme managers in detail.[note: 13]The SM thus submitted that based on the prevailing practice, companies are not obliged to disclose the engagement letters and/or the professional fees of their professional advisors to their creditors prior to the court sanction hearing.[note: 14] 14     We note that the MC has notpositivelydeniedthe SM’s claim that in the restructuring projects mentioned by the SM, VAFs were indeed similarly charged but were also not disclosed to the creditors or the Court. In the circumstances, it appears that often where success-based fees are to be paid to scheme managers, such arrangements are notvoluntarilydisclosed by companies to their creditors or the Court, save in jurisdictions where a disclosure regime has been statutorily mandated. This, however, from a legal point of view counts for little.A commercial practice, no matter how widespread, does not have the force of law either by dint of accident of vintage or absence of protest if it is contrary to legal principle.We now turn to consider the legal issues.",
        "The issues": "15     The issues which arise for our consideration are as follows: (a)     Notwithstanding that there may be a commercial practice not to disclose the VAF to the scheme creditors and/or to the Court, was the practice contrary to law? (b)     If it is contrary to law, what ought the consequences of non-disclosure to the scheme creditors and/or the Court be in the present case?",
        "Our decision": "",
        "The Company’s duty to disclose material information to the scheme creditors and the Court": "16     In the GD, this Court unequivocally declared that transparency in the affairs of a distressed company through making available all material information that could impinge on the financial interests of creditors was essential (see the GD at [73]). The principle that “an informed voting process can only take place if all material information a creditor might need to determine how to vote is made available” (see the GD at [77]) was also affirmed. There is a secure legal underpinning to this obligation to make full disclosure of material information in relation to the dealings of an insolvent company. This duty of disclosure on the Company has been emphatically declared to be “an independent principle of law” [emphasis added] (Wah Yuen Electrical Engineering Pte Ltd v Singapore Cables Manufacturers Pte Ltd[2003] 3 SLR(R) 629 (“Wah Yuen”) at [24]) entirely distinct from the disclosure requirements mandated by statute (ie, the explanatory statement in s 211(1) of the Companies Act (Cap 50, 2006 Rev Ed)). Company directors and their professional advisors should not be allowed to conceal any material information from scheme creditors in order to secure their support to rescue a distressed company. 17     InWah Yuen, the respondent creditor was dissatisfied with the lack of disclosure by the appellant company in relation to the company’s audited accounts for the relevant periods. The audited accounts were necessary for the creditors to determine the circumstances under which the alleged related party debts arose. This Court ruled in favour of the respondent, on the basis that the information sought was material for the creditors to “determine whether the returns under the proposed scheme of arrangement werein factgreater than what they could expect in a liquidation” [emphasis in the original] (Wah Yuenat [37]). On the ground that material information was not provided due to the appellant’s lack of transparency, this Court inWah Yuendeclined to approve the scheme. 18     The principle thatallmaterial information should be disclosed has taken firm root in other Commonwealth jurisdictions as well. In the United Kingdom, it has been held that a creditor ought to be given such up to date information explaining how the scheme will affect him commercially as can reasonably be provided by the company (Re Heron International NV and others[1994] 1 BCLC 667 (“Re Heron”)). The learned authors in Ian M Fletcher, John Higham, William Trower (gen eds),Corporate Administrations and Rescue Procedures, (LexisNexis, 2nd Ed, 2004) at para 13.10 have understoodRe Heronas laying down the practical rule that it is “safer [for a company] to provideas much information as possiblein the [explanatory] statement” [emphasis added]. 19     In Australia, the company is also obliged to “make full and fair disclosure of all material facts known to them or reasonably accessible to them which it is relevant for the creditors to know” (Re Pheon Pty Ltd(1986) 11 ACLR 142 at 155). This principle is reinforced by the regulatory guidelines of the Australia Securities & Investments Commission (“ASIC”). The ASIC has very relevantly (for our present case) highlighted that “[t]he explanatory statement should also disclose how a scheme administrator will be remunerated” (in Regulatory Guideline 60.53). 20     Applying this broad commonsensical legal principle to our present case, we are of the view that the Company’s obligation to disclose all material information should certainly cover contingent liabilities such as the VAF which it had incurred immediately prior to the sanction of the Scheme. As mentioned above at [6], the VAF was a contingent liability incurred by the Company which would crystallize the moment the Scheme was successfully implemented. Ordinarily, such contingent liabilities would have been disclosed at the stage where all scheme creditors have to submit their proofs of debt to the chairman. However, nTan was conveniently an excluded creditor and therefore did not have to submit a proof of debt which would have publicly highlighted its contingent claim against the Company to the rest of the creditors.In our view, thecurrent practice of companies making use of the device of “excluded creditors” in order not to reveal to other creditors actual or contingent liabilities, which may be very substantial, has nothing to commend it.It would be contrary to law and an affront to commonsense to permit the directors of an insolvent company to commit the company to a substantial contingent financial commitment that will come from an unguarded pocket (seeRe Econ Corp Ltd (in provisional liquidation)[2004] 2 SLR(R) 264 (“Re Econ Corp Ltd (No 2)”) at [65]). The law does not allow such a practice as it can be used to conceal all kinds of financial arrangements which may adversely affect the interests of scheme creditors and which may have a material impact on their decision whether or not to support the scheme of arrangement. The voting decision of scheme creditors is crucial to the success or otherwise of the scheme of arrangement as it is the most important factor that determines whether the Court will sanction the scheme or not. It must therefore be an informed decision. 21     In the present case, it is clear that because the Company did not disclose the VAF and its enormous financial implications to the scheme creditors, their majority decision was not a fully informed decision. We agree with the MC that “given the substantial quantum of the VAF, the triggering of the obligation to pay the VAF has a material impact on the financial position of the Company and its ability to carry out the terms of the Scheme”.[note: 15]Indeed, it is only commercially sensible to understand “material information” in these circumstances as connoting not only information which would allow the creditors to determine how their expected returns under the proposed scheme of arrangement would be derived, but also information relating to the commercial viability of the implementation of the scheme as a whole.In our view, scheme creditors are rightfully entitled to expect to receiveaccurate information which would allow them to make a holistic assessment as to whether the proposed scheme manager and/or the proposed terms of the scheme are appropriate for the Company both in the short and long run.Such information is material because many schemes of arrangement, as in the present Scheme (see the GD at [14]–[15]), involve not merely an immediate, one-off debt reduction plan; but also staggered repayment or conversion arrangements which could last for some time. For example, the present Scheme involves the restructuring of $150m worth of debt into “Sustainable Debt” which was to be repaid within five years of the Scheme’s effective date (see the GD at [14]). For a scheme creditor to assess the viability of such arrangements, he would need to be informed of any contingent liability which could affect the ability of the Company to “carry out the terms of the Scheme”. Any substantial payments under a VAF would certainly meaningfully affect the amount that scheme creditors bound by the Scheme could ultimately recover. 22     We should also stress that in the present case, the material information which should have been disclosed (ie, the contents of the VAF) was wholly within the knowledge and control of the Company. Unlike the situation inWah Yuenwhere, to fulfil its duty of disclosure, the appellant company would have had to go the extra mile to obtain and furnish an audited set of accounts (seeWah Yuenat [30]), there was no conceivable impediment to the Company in the present case that would prevent the disclosure of the contents of the Appointment Letter to the scheme creditors or the Court. However, the Company adamantly refused to provide the requisite information even after repeated requests by some scheme creditors for the professional fees of nTan to be disclosed (see above at [7]). A reasonable inference from the Company’s conduct would be that its directors might have thought that if the VAF was disclosed, it would give the scheme creditors an additional reason to vote against the Scheme and/or to appoint the proposed SM. 23     To sum up, the Company was under a legal obligation to disclose all material information to the scheme creditors to enable them to make informed decisions on whether or not to support the Scheme. The Company breached this obligation by failing to disclose the VAF to the scheme creditors. For the avoidance of doubt, we must also state that this information ought to have been disclosed to the Court as well when sanction for the Scheme was first sought (see [8] above).",
        "The proposed scheme manager’s duty to ensure that the Company has disclosed his fees to the scheme creditors and the Court": "24     In the GD, this Court also elaborated on the general duties of a scheme manager as follows (at [74]–[77]): 74    … The proposed scheme manager is engaged by a company that is usually in a parlous financial position. He formulates a scheme of arrangement to save the company and pitches it to the creditors to secure approval of his plan. At that stage of the process, he owes no direct duties to the creditors, save of course that he must act in good faith andmust not mislead creditors or suppress material information from them. It is trite law that the court will not sanction a scheme if the company and/or its majority creditors are not actingbona fide(seeDaewoo Singapore Pte Ltd v CEL Tractors Pte Ltd[2001] 2 SLR(R) 791 at [36]). It follows that before the scheme is sanctioned, the proposed scheme managerhas a good faith obligation to the company and the body of creditors as a whole as well. 75    As stated above at [67], the proposed scheme manager’s duties are then amplified when he assumesthe quasi-judicial roleof adjudicating on the admission and rejection of the proofs of debts. We mentioned [Fustar Chemicals Ltd (Hong Kong) v Liquidator of Fustar Chemicals Pte Ltd[2009] 4 SLR(R) 458 at [18]] earlier … for the proposition that “[a] liquidator must never favour the interests of his appointers over that of the other legitimate claimants to the company's assets” [original emphasis omitted]. The same is true for a proposed scheme manager in the discharge of his responsibility of adjudicating proofs. In his quasi-judicial role, heowes duties to be objective, independent, fair and impartial… . 76    As for his duties upon appointment as scheme manager, we again think it fitting to refer to the office of the liquidator as a comparator. It is well-established that liquidators are fiduciaries, owing duties to,inter alia, the company and its creditors. In this regard, see Andrew R Keay,McPherson’s Law of Company Liquidation(Sweet & Maxwell, 2ndEd, 2009) (\"McPherson\") at para 8.018: 1. Fiduciary duties From the practical point of view it does not seem to matter much whether the liquidator is treated as a trustee in the strict sense or simply as an agent,for in either capacity a fiduciary position in relation to the company, its creditors and contributories is occupied.... In addition, two further duties of major importance follow from the fiduciary relationship: (a) that the liquidator must not allow private interests to come into conflict with duties,and (b) that in discharging the duties he or she must at all times act with complete impartiality as between the various persons interested in the property and liabilities of the company. ... [emphasis added] Earlier versions of the same passage (without material differences) were approved by the Federal Court of Australia inPace and another v Antlers Pty Ltd (in liq)[1998] 26 ACSR 490 at 501 and Olney J inRe G K Pty Ltd (in liq); Ex parte Deputy Commissioner of Taxation(1983) 7 ACLR 633 at 639 respectively. In our view,the proposed scheme manager’s duties to administer the approved scheme take on a fiduciary nature upon his appointment as the scheme manager. Conflict of interest 77    To an extent, the proposed scheme manager is inherently in a position of conflict because if he successfully resuscitates the company, he is remunerated,inter alia, for managing the scheme and reviving the company. Therefore, there are undeniable incentives for the proposed scheme manager to prefer the interests of his appointers (not infrequently, the company itself as is the case here) over those of their creditors from the outset. He must, nevertheless, seek to strike theright balanceand manage the competing interests of successfully securing the approval of his proposed scheme and uncompromisingly respecting the procedural rights of all involved in the scheme process. … [emphasis in original in italics, emphasis added in bold] 25     It is therefore clear that the proposed SM has to act in good faith towards the scheme creditors. He must not mislead the scheme creditors or suppress material information from them or be a party to any attempts by the Company to do so prior to his appointment by the scheme creditors. 26     The proposed SM’s duties are further amplified when he assumes the quasi-judicial role of adjudicating on the admission and rejection of the proofs of debts. In his quasi-judicial role, he owes duties to be objective, independent, fair and impartial (see the GD at [75]). He must not place himself in a position of conflict. In the present case, such a conflict had clearly arisen: - although the SM was the controlling shareholder of nTan, the quantum of the VAF which would accrue to nTan was dependent on the value of the debts which would be adjudicated upon by the proposed SM himself. In our view, this conflict could only have been satisfactorily resolved by theinformed consentof the scheme creditors. There was no informed consent here because of the SM’s (and also the Company’s) failure to inform the scheme creditors of the VAF. 27     In coming to our decision, we consider irrelevant the distinction which the SM has sought to draw between the VAF accruing to nTan in its role as a “financial advisor” vis-à-vis that of a “scheme manager”.[note: 16]The SM has also attempted to convince us that because the VAF accrued to nTanbeforethe SM was appointed as scheme manager, the aforementioned obligations of a scheme manager do not apply as “the fees of financial advisors [should be] regulated by free market forces”.[note: 17]In our view, the SM’s argument is founded on the entirely misconceived premise that mandating a proposed scheme manager’s disclosure of the remuneration benefits that he would stand to gain is somehow equivalent to this Courtinterfering with free market forcesdeterminingthe quantum of such remuneration. This premise is demonstrably wrong. Both logically and practically, the SM’s submission that a financial advisor’s remuneration should “be governed by contract and market forces only”[note: 18]is not one bit inconsistent with our narrow holding that a scheme manager has an obligation to ensure that such remuneration (whether it had been agreed upon prior to or after his appointment as scheme manager) is disclosed to the scheme creditors or the Court prior to the sanction of the Scheme. The parties are free to negotiate any agreement on remuneration that they see as commercially sensible. All we are saying is that there must be full disclosure before such an arrangement can be implemented.",
        "The duty of disclosure strikes a sound balance between rewarding the work done by financial advisors and safeguarding the interests of the creditors": "28     The duty of disclosure described above is all the more necessary when a financially distressed company proposes to enter into a scheme of arrangement. In a scheme of arrangement, the ordinary legal rights of many scheme creditors of the company would usually end up being heavily compromised or varied; and involuntarily so at times (ie, when the scheme creditor is a minority creditor). The company is able to survive only because a requisite majority of scheme creditors have agreed (in varying degrees) to release the company from itsordinaryobligations to pay off thefull sumof its debts. It is in the context of such dire circumstances that the VAF would have been proposed by the would-be SM to the Company. Given the Company’s position, itmightnot have been in its commercial interest to negotiate for a lower (or fairer) sum, especially when this sum would come, realistically speaking, not from its present coffers or the purses of the directors sanctioning such an arrangement, but from the financial losses absorbed by its creditors. The parties with agenuine interestto ensure that the proposed SM is being reasonably remunerated would be the scheme creditors who would determine whether the Scheme is commercially viable (and preferable to liquidation) and thus deserving of their support. If this Court were to sanction the lack of disclosure of the VAF to the creditors, we would in effect be legitimising a state of affairs where there exist no legal or commercial constraints as to the remuneration a scheme manager (or his firm) could charge, at the very expense of the creditors of the company. It is only fair, reasonable and right that both the Company and the SM disclose to scheme creditors and the Court the terms of the proposed SM’s appointment prior to the sanction of the Scheme. 29     We are therefore emphatically of the view that the Company ought to have promptly disclosedall benefits accruing to the proposed SM (or his firm)to the scheme creditors and the Court. This would certainly include the VAF, which was material information. Further, the SM should also have personally taken steps to ensure that this was done. 30     We pause once more to stress that this Court is not discounting any value preserved and/or created for the Company and the scheme creditors by the SM or nTan,[note: 19]nor is this Court indirectly regulating the type of contractual arrangements that can exist between a financially distressed company and its financial advisor or scheme manager.What we are underlining is the uncompromising need for transparency in relation to material information. Pertinently, we note that calls have previously been made for greater regulation of the fees and practices of “restructuring experts” (see “Need for greater scrutiny on fees, practices of restructuring experts”,The Business Times Singapore(8 July 2009)):[note: 20] … It appears that corporate rescue is fast becoming a boon for professionals and a bane for distressed companies.The issue of fees get thornier when advisers take a slice of the funds raised. But hard-pressed for solutions,some companies still enter into unfavourable contracts with their financial advisers. Costly restructurings, however, can leave companies in a severely weakened position. As companies are increasingly challenged in this economic climate,it may be time to scrutinise the fees charged by turnaround artists. Restructuring – whether informally, through a scheme of arrangement under a provision of the Companies Act or by judicial management – seeks to preserve value for all stakeholders. While restructuring specialists have the unenviable task of dealing with angry creditors and coming up with a proposal that is widely acceptable to creditors with vastly different interests,it remains highly debatable if that service justifies exorbitant fees. [emphasis added in italics and bold italics] 31     Plainly, the issue of fairly remunerating insolvency practitioners is a matter of public interest.Central to this problem is the fact that their fees come from an unguarded pocket that in reality belongs to the creditors and not the financially distressed company.Unfortunately, the wildly divergent interests of the stakeholders often allow insolvency practitioners almostcarte blancheto determine (without rigorous oversight) their levels of remuneration even for the most mundane tasks. There is also not infrequently a careless lack of transparency as to how fees are assessed and this “has led to a widely held perception in commercial circles that the fees of insolvency practitioners are sometimes arbitrarily fixed and are not commensurate with either the efforts rendered or value contributed” (seeRe Econ Corp Ltd (No 2)at [4] and [62]). As a matter of general principle, it should bethe value contributedto the process in terms of tangible results for the creditors and the company, as opposed to the mere quantum of debt involved or the time spent, which ought to be the determinative consideration as to thefair and reasonable remunerationfor financial advisors/scheme managers. What constitutes the “value contributed” has of course to be assessed contextually. 32     All things considered, we are firmly of the view that in the present circumstances, the common law duty of disclosure on the part of the Company and the proposed SM strikes a sufficiently sound balance between valuing the work done by financial advisors/scheme managers and safeguarding the interests of the creditors. For the Company to discharge its duty of disclosing material information, and for the proposed SM to avoid a conflict of interest, the existence and estimated quantum of the VAF should have been disclosed to the scheme creditors and the Court prior to the sanction of the Scheme.",
        "Consequences of the breach of duty": "33     In our view, the breach of the duty to disclose by the Company and the SM inevitably raises the question as to whether the Scheme should be set aside as a material aspect of it was not disclosed to the scheme creditors and to the Court before sanction for its implementation was given. Ordinarily, the Scheme should be set aside and put to a fresh vote because it might not have been approved by the scheme creditors if they had known about the VAF. However, because the Scheme has been implemented for more than two years, it is not practical to set it aside without causing more harm to the Company and the creditors. 34     Therefore, in light of the prevailing circumstances, we direct that the relevant parties to this dispute (ie, the SM/nTan, the Company and the MC) are to endeavour to reach an agreement as to what ought to be the proper amount of professional fees awarded for nTan’s efforts in reviving the Company to date. In the event the parties are unable to reach an agreement, we order that nTan’s global fees (before and after the SM’s appointment) will be assessed by a High Court Judge. While this is not an ideal means of resolving the present impasse, it strikes the right balance between the interests of all the parties having an interest in this matter. In making this order, we also take into account nTan’s avowed willingness to negotiate the quantum of the VAF with the Company that “takes into account the financial situation of the [Company] post-restructuring”.[note: 21]We would also invite the MC to act fairly towards nTan/SM in their negotiations in order to reach an amicable solution. 35     However, should this matter proceed for assessment, the Court shall have regard to the principles stated inRe Econ Corp Ltd (No 2)which are also applicable to scheme managers (seeRe Econ Corp Ltd (No 2)at [48]) in arriving at the quantum of fees reasonably due to nTan in successfully reviving the Company. InRe Econ Corp Ltd (No 2), the High Court laid down certain principles to be taken into account in determining the remuneration of insolvency practitioners. Bearing these in mind, the Court shall first and foremost consider the value (in this case the benefits, from a holistic and not mathematical standpoint, accruing to the Company and the creditors) contributed by nTan. Other factors to be taken into consideration would include,inter alia, the nature of the work involved, the time spent, the assistance provided by the employees working in nTan, the scope of work and reasonable disbursements incurred. It will be the duty of the Court, should the parties fail to reach an agreement, to ensure that nTan will be “fairly, reasonably and adequately remunerated” (Re Econ Corp Ltd (No 2)at [74]). 36     For future cases, however, where the creditors or the Court have approved of a scheme of scheme of arrangement without the company having disclosed material information of this nature, the scheme ought to be set aside. The scheme manager might also be deprived of his costs. Accordingly, directors of companies seeking relief under schemes together with the proposed scheme manager must be mindful of the interests of the creditors and discharge their duties to them faithfully.",
        "Observations": "37     Finally, we are constrained to express our concern on learning that the professional advisors and the Company’s directors involved in the VAF arrangement appear to have opted for covertness rather than transparency in attempting to impose this arrangement on the scheme creditors, see [7] above. We find it troubling that any director of the Company could even have contemplated the non-disclosure, much less allowed it to be effectuated: in his or her position, he or she should have been completely candid with the creditors, to whom the assets of the Company in effect belonged since the Company was effectively insolvent. Finally, we would also add that the current commercial practice of not disclosing the fee arrangements of proposed scheme managers is contrary to the public interest because it could readily lead to abuse and dilution of the scheme creditors’ rights. This is also true of arrangements made with other types of insolvency practitioners. When discovered later, the existence of such covert arrangements will only bring disrepute to the profession and might even lead to the public questioning the honesty and integrity of all insolvency practitioners.Transparency must therefore be the guiding principle of all corporate actions when creditors’ interests are affected, as is the case in a scheme of arrangement.",
        "Costs": "38     Given that this is the first matter on this particular issue that has been brought to the attention of the courts in Singapore, we make no order as to costs. However, if this were to occur again, the Court hearing the matter could very justifiably pin responsibility for costs on all parties responsible for the failure to be transparent about such dealings.",
        "Annex A": "[note: 1]See R&T’s submissions dated 14 March 2012 at [9]; A&G’s submissions dated 14 March 2012 at [86]. [note: 2]Appendix 4 of the Scheme. [note: 3]The Scheme at p 31, para 6.2. [note: 4]See R&T’s letter dated 27 January 2012 at [11(b)]; WongP’s letter dated 10 February 2012; A&G’s letter dated 14 February 2012. [note: 5]R&T’s letter dated 14 February 2012 at [6]. [note: 6]R&T’s letter dated 27 January 2012 at [11(c)]. [note: 7]A&G’s letter dated 7 February 2012 at [13]. [note: 8]R&T’s letter dated 14 February 2012 at [4]. [note: 9]WongP’s letter dated 3 February 2012 at “Annexure 2”. [note: 10]WongP’s letter dated 3 February 2012 at “Annexure 2” (paras 2.6 and 2.7 of the minutes of meeting on 22 September 2011). [note: 11]Court of Appeal’s letter dated 20 February 2012 at [5]. [note: 12]A&G’s submissions dated 14 March 2012. [note: 13]WongP’s submissions dated 14 March 2012. [note: 14]A&G’s letter dated 14 February 2012 at [9]. [note: 15]R&T’s submissions dated 14 March2012 at [14]. [note: 16]A&G’s submissions dated 14 March 2012. [note: 17]A&G’s submissions dated 14 March 2012 at [154]. [note: 18]A&G’s submissions dated 14 March 2012 at [14]. [note: 19]A&G’s submissions dated 14 Mar 2012 at [142] [note: 20]See WongP’s submissions dated 14 March 2012 at “Annex 2”. [note: 21]A&G’s submissions dated 14 March 2012 at [88]–[89]."
    }
}