{
    "case_title": "ADP \n      v\n      ADQ",
    "ncitation": "[2012] SGCA 6",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      Tan Lee Meng J",
    "sections": {
        "Introduction": "1       This appeal raised the novel issue of whether\n                    the Singapore courts have the jurisdiction under the Women’s Charter\n                    (Cap 353, 2009 Rev Ed) (“the Act”) to order the division\n                    of matrimonial assets and maintenance if the marriage between the parties is\n                    found to be void. The High Court Judge (“the Judge”) held that the\n                    Singapore courts have neither jurisdiction (seeADP v\n                        ADQ[2011] 3 SLR 370 (“the Judgment”)).\n                    We allowed the appeal after hearing arguments from the Appellant (as we explain\n                    below, the Respondent was not present at the hearing). We now provide the\n                    detailed grounds for our decision.",
        "Background": "",
        "The parties and the void marriage": "2       The Appellant, a Philippines national, had\n                    married the Respondent, a United Kingdom (“UK”) national, in Hong\n                    Kong on 26 October 1995 (“the Hong Kong\n                        Marriage”).[note: 1] 3       The Appellant had previously married a Japanese\n                    man on 1 December 1989 (“the Japanese Marriage”).[note: 2]The\n                    Japanese Marriage resulted in a divorce, which was finalised in Japan only on\n                    7 December 1995.[note: 3]It should be noted that the Hong\n                    Kong Marriage was contractedbeforethe Japanese\n                    Marriage was terminated. This meant that the Hong Kong Marriage was void due to\n                        bigamy.[note: 4] 4       The Appellant filed a petition for divorce on\n                    25 March 2003. The divorce proceedings resulted in an uncontested hearing\n                    on 26 August 2003 at which adecree nisiwas\n                        granted.[note: 5] 5       The parties later found out that the Hong Kong\n                    Marriage was void. The Respondent then filed an application (Summons-in-chambers\n                    No 651299 of 2004) on 11 August 2004 seeking,inter\n                        alia, to set aside thedecree nisiand to declare that the Hong Kong Marriage was void (“the Rescission\n                        Proceedings”).[note: 6]The Appellant also took\n                    out a nullity petition on 15 October 2004.",
        "The Rescission Proceedings": "6       The Rescission Proceedings were heard by a\n                    District Judge (“the first District Judge”). In a written\n                    judgment, the first District Judge rescinded thedecree\n                        nisi.[note: 7]She declined, however, to grant the\n                    declaration (to the effect that the Hong Kong marriage was void) sought by the\n                    Husband for three reasons:[note: 8] (a)     The Family Court did not have the\n                        jurisdiction to make the declaration. (b)     The application for a declaration should be heard by the\n                        High Court through an originating summons and not through an application\n                        within the divorce proceedings. (c)     Even if the correct procedures were followed and the\n                        Family Court was the correct forum to hear the application for a\n                        declaration, it was more appropriate for the validity of the Hong Kong\n                        Marriage to be determined in a nullity petition. Importantly, the first\n                        District Judge proceeded to elaborate that one of the reasons why she\n                        thought a nullity petition was more appropriate was thatancillary relief is available to parties to a void and voidable\n                            marriage.[note: 9]She noted,\n                        however, that there might be an issue of whether maintenance may be ordered\n                        to a wife in a void marriage because she was, arguably, never a\n                        “wife”. She did not elaborate because she thought that the\n                        availability of maintenance was an issue that she did not have to decide at\n                        that point.[note: 10] The\n                    third reason is important because, as will be seen below, it has given rise to\n                    an argument ofresjudicata. 7       The Respondent appealed the first District\n                    Judge’s decision to the High Court. The High Court Judge dismissed the\n                    appeal without issuing written grounds.[note: 11]",
        "The present proceedings": "8       The Family Court later declared in the nullity\n                    petition that the Hong Kong Marriage was void. The court then directed that\n                    ancillary matters were to be adjourned for a further hearing. 9       The ancillary matters came before another\n                    District Judge (“the second District Judge”) who ruled,inter alia, that the court did not have the power to\n                    order the payment of maintenance or the division of matrimonial assets because\n                    the judgment for nullity had been granted on the ground that the marriage was\n                    void (seeADP v ADQ[2009] SGDC 489).[note: 12] 10     The Appellant appealed that decision to the\n                    High Court. The High Court’s decision with regard to the particular issue\n                    set out in the preceding paragraph is the subject of the present appeal (as for\n                    the issue that was not appealed, see below at[14]).",
        "Decision Below": "11     The Judge began his analysis by examining the\n                    wording of the relevant provisions of the Act,viz, ss 112(1) and 113 of the Act. It would be useful, in this\n                    regard, to set out these provisions in full: Power of court to order division\n                            of matrimonial assets 112.—(1)  The court shall\n                        have power, when granting or subsequent to the grant of a judgment of\n                        divorce, judicial separation or nullity of marriage, to order the division\n                        between the parties of any matrimonial asset or the sale of any such asset\n                        and the division between the parties of the proceeds of the sale of any such\n                        asset in such proportions as the court thinks just and equitable. … Power of court to order\n                            maintenance 113.The court may order a man to pay maintenance\n                        to his wife or former wife — (a) during the course of any matrimonial\n                            proceedings; or (b) when granting or subsequent to the grant of a judgment of divorce,\n                            judicial separation or nullity of marriage. The Judge noted that the use of the phrase “nullity\n                    of marriage” in s 112(1) of the Act has caused uncertainty because\n                    it encompasses two types of marriages,viz, void\n                    and voidable marriages (see the Judgment at [8]). The Judge explained that under the Act, a judgment of\n                    nullity may be obtained for both void and voidable marriages (see the Judgment\n                    at [9]). He then briefly described the\n                    differences between void and voidable marriages (see the Judgment at [10]–[12]). He concluded that the wording of s 112(1) does not\n                    offer any indication as to whether “nullity of marriage” refers to\n                    both void and voidable marriages. He was, however, prepared to take the view\n                    that the court has the power to divide matrimonial assets in the context of avoidablemarriage on the ground that assets\n                    acquired up to the point of dissolution are matrimonial assets (see the Judgment\n                    at [12]). 12     The Judge proceeded to express his view that\n                    it is not appropriate for a court to determine the effects of a void marriage\n                    (see the Judgment at [14]). This is\n                    because a marriage may be found to be void for various reasons. For example, a\n                    party may have acted in good faith or he/she might have been deceptive. These\n                    different factual situations would require different treatment and would require\n                    a consideration of “legal, sociological and public policy\n                    considerations” (see the Judgment at [14]). 13     The Judge nevertheless proceeded to rule that\n                    a division of matrimonial assets is not possible where the marriage is void. He\n                    reasoned that a void marriage is not a marriage and so there are no\n                    “matrimonial assets” to divide. Assets acquired in the course of\n                    the marriage will have to be divided according to property, contract, trust or\n                    other relevant principles of law (see the Judgment at [15]). Similarly, the Judge ruled that it was\n                    not possible to order maintenance because s 113 of the Act refers to\n                    maintenance of a “wife or former wife”. A claimant in a void\n                    marriage is neither (see the Judgment at [16]). The Judge further commented that it might have been\n                    argued that there is another basis for seeking maintenance if the parties had\n                    maintained their relationship in the belief that they had a legal marriage. The\n                    Judge observed, however, that this possibility “must remain as food for\n                    thought” because the Appellant did not raise such a possibility (see the\n                    Judgment at [18]). 14     It should be noted that the decision below\n                    also addressed an issue of maintenance for the Appellant’s child from a\n                    previous relationship. The Judge’s decision on this issue was not\n                        appealed.[note: 13]",
        "The arguments": "15     The Appellant raised a preliminary argument\n                    that the issues of whether the court has jurisdiction under the Act to order the\n                    division of matrimonial assets and maintenance areresjudicataas between the parties\n                    because they were conclusively decided by the first District Judge whose\n                    decision was upheld on appeal (“theResJudicataArgument”).\n                    Incidentally, it should be noted that the Appellant’s counsel had raised\n                    theResJudicataArgument at the hearing before the Judge.[note: 14]The Judge did not,\n                    however, address the argument in the Judgment. 16     The Appellant raised the following arguments\n                    on the substance of the appeal in her Appellant’s Case: (a)     The Judge erred in holding that the\n                        phrase “nullity of marriage” under s 112 of the Act\n                        refers only to a voidable marriage and not to a void marriage.[note: 15] (b)     The Judge erred in adopting an unduly\n                        restrictive interpretation of s 112 of the Act.[note: 16] (c)     Recognising that the court has the\n                        jurisdiction to order the division of matrimonial assets and maintenance\n                        would accord the court the discretion to take into account the particular\n                        facts of the case in order to arrive at a fair decision.[note: 17]In this case, the\n                        fact that the Appellant was unaware of her legal impediment to marriage\n                        could be taken into account.[note: 18] (d)     On the issue as to whether the court has the\n                        power to order maintenance, the Appellant should be accorded all rights that\n                        she would have had if the marriage was legal because she did not deceive the\n                        Respondent and the parties lived together for a long time believing\n                        themselves to be husband and wife.[note: 19]The\n                        Appellant argued that, in this regard, the English cases which take the view\n                        that a wife should be entitled to ancillary relief under the English\n                        equivalent of the Act if she had nomensreafor the crime of bigamy\n                        should be followed. The English cases should be followed because the Act is\n                        adapted from English law.[note: 20] (e)     On the issue as to whether the court has the power to\n                        divide matrimonial assets, whatever issues there may be with the ordering of\n                        maintenance in a void marriage, the court should have the power to order the\n                        division of matrimonial assets because the same issues and problems that the\n                        parties need to resolve in relation to their property arise whether or not\n                        their marriage is void or voidable.[note: 21] (f)     The parties lived as husband and wife for the\n                        duration of the marriage. The Appellant made substantial contributions\n                        towards the marriage and the acquisition of the matrimonial assets. The\n                        needs of the children also have to be considered.[note: 22] (g)     The wording of s 112 of the Act does not distinguish\n                        between void and voidable marriages.[note: 23] (h)     Any claim by the Appellant under property law\n                        would not take into account her indirect contributions.[note: 24] 17     At the hearing before us, counsel for the\n                    Appellant, Prof Tan Cheng Han SC (“Prof Tan”),\n                    raised the following additional arguments: (a)     The fact that s 113 of the Act\n                        uses the words “wife” or “former wife” does not\n                        mean that maintenance may not be ordered in favour of the female party to a\n                        void marriage. This is apparent from s 104 of the Act which provides\n                        that any “husband or wife” may file a writ claiming a judgment\n                        of nullity in respect of his or her marriage. This suggests that the words\n                        “wife” or “former wife” in s 113 of the Act\n                        are simply labels used to denote the female party to the void\n                        marriage. (b)     It\n                        may be argued (in this instance,contraryto\n                        the Appellant’s case) that interpreting s 113 of the Act as\n                        allowing an award of maintenance even if a marriage is found to be void will\n                        render s 113 of the Act incongruous with s 69 of the Act.\n                        Section 69 of the Act concerns an order for maintenance to a\n                        “married woman” while the marriage is still subsisting. The\n                        phrase “married woman” is defined in s 2 of the Act as a\n                        woman “validly married under any law, religion, custom or\n                        usage”. In other words, a woman in a void marriage is not a\n                        “married woman” and, hence, would not be able to claim\n                        maintenance under s 69 of the Act. An argument could be made that it\n                        would be incongruous to say that a woman is not entitled to maintenance\n                        while a void marriage is “subsisting” but yet is entitled to\n                        maintenance under s 113 of the Act after she obtains a judgment of\n                        nullity. Prof Tan submitted that this incongruity may be explained away\n                        by the fact that s 113 of the Act uses the words “wife or former\n                        wife”, a phrase which is not defined in the Act, whereas s 69 of\n                        the Act uses the phrase “married woman”, which, as just\n                        mentioned, is defined in s 2 of the Act. (c)     The court has the power to take into account all\n                        the relevant circumstances of the case in deciding on the division of\n                        matrimonial assets and in ordering maintenance. This means that the court\n                        may take into consideration any egregious conduct on the part of one of the\n                        parties to the marriage. (d)     The Women’s Charter (Cap 47, 1970 Rev Ed)\n                        (“the 1970 Rev Ed”) did not draw a distinction between\n                        void and voidable marriages. Section 91 of the 1970 Rev Ed simply\n                        provided for the grounds for seeking a decree of nullity, including the\n                        ground “that the former husband or wife of either party was living at\n                        the time of the marriage and the marriage with such former husband or wife\n                        was then in force”. Significantly, s 107(1) of the 1970 Rev\n                        Ed provided,inter alia, that on any decree\n                        for nullity of marriage, “the court may, if it thinks fit, order that\n                        the husband shall, to the satisfaction of the court, secure to the wife such\n                        gross sum of money or such annual sum of money for any term not exceeding\n                        her life”. Prof Tan submitted that the effect of these\n                        provisions was that under the 1970 Rev Ed, the court could order\n                        maintenance even in the context of an annulled marriage. Prof Tan argued\n                        that Parliament could not have intended to change the legal position when\n                        the distinction between void and voidable marriages was later introduced. It\n                        would be unusual for Parliament to have made such a drastic change in the\n                        law without expressly saying so. 18     The Respondent did not file his case for the\n                    present proceedings. Incidentally, his solicitors at the proceedings below had\n                    applied to discharge themselves (in Summons No 3258 of 2011) on the ground\n                    that they have not been able to contact him for instructions on the conduct of\n                    the appeal.[note: 25]A High Court Judge had\n                    granted leave to the Respondent’s solicitors to discharge\n                        themselves.[note: 26]The appeal papers\n                    were then served on the Respondent at his last known e-mail address pursuant to\n                    an order of court for substituted service.[note: 27] 19     The Respondent also did not appear at the\n                    hearing of the appeal. At the hearing itself, one of the Respondent’s\n                    previous solicitors, Mr Imran Hamid Khwaja\n                    (“Mr Khwaja”), who was present in the public gallery at the\n                    hearing before us, informed us that the Respondent had been informed via e-mail\n                    of the week in which the appeal was fixed to be heard.[note: 28]Mr Khwaja added that he had\n                    previously communicated with the Respondent via that particular e-mail\n                        address.[note: 29]Counsel for the Appellant\n                    then advised the court that his instructing solicitor had communicated with the\n                    Respondent through the same e-mail address without any response.[note: 30]The Appellant’s solicitors have not received any notification that their\n                    e-mails had not been delivered to the Respondent.[note: 31]We proceeded\n                    with the hearing (it should be noted, in this regard, that this court may\n                    proceed with an appeal in the absence of a respondent unless it, for any\n                    sufficient reason, sees it fit to adjourn the hearing (see O 57\n                    r 18(2) of the Rules of Court (Cap 322, R 5, 2006 Rev\n                    Ed))).",
        "Issues before this Court": "20     Three issues arose for this court’s\n                    consideration in view of the Appellant’s arguments: (a)     Are the issues of whether the court\n                        has jurisdiction to order maintenance and division of matrimonial assets in\n                        a void marriageresjudicataas between the parties because they were decided by\n                        the first District Judge? (b)     Do Singapore courts have jurisdiction under s 112 of\n                        the Act to order the division of matrimonial assets in a void\n                        marriage? (c)     Do\n                        Singapore courts have jurisdiction under s 113 of the Act to order\n                        maintenance in a void marriage?",
        "Our decision": "",
        "Res judicata": "The applicable law 21Resjudicatacomprises cause of action estoppel, issue\n                    estoppel and abuse of process (see the decision of this court inWing JooLoong Ginseng Hong\n                        (Singapore) Co Pte Ltd v Qinghai Xinyuan Foreign Trade Co Ltd and another\n                        and another appeal[2009] 2 SLR(R) 814\n                        (“Wing JooLoong\n                        Ginseng Hong”) at [165]). Of relevance in the present\n                    appeal is the question of issue estoppel, which requires the following elements\n                    to be shown (ibid, citingLee\n                        Tat Development Pte Ltd v MCST Plan No 301[2005]\n                    3 SLR(R) 157 at [14]–[15]): (a)     a final and conclusive judgment on\n                        the merits of the issue allegedly estopped; (b)     the judgment was made by a court of competent\n                        jurisdiction; (c)     the parties in the two actions are identical; and (d)     the subject matter of the two actions\n                        are identical. 22     In relation to the requirement of identical\n                    subject matter, three matters ought to be borne in mind (seeWing JooLoong Ginseng Hongat\n                    [167] citingGoh Nellie v Goh Lian\n                    Teck[2007] 1 SLR(R) 453 at [34]–[35], [38]). First, the\n                    prior decision must “traverse the same ground”. Second, the\n                    determination of the issue allegedly estopped “must have been fundamental\n                    and not merely collateral to the previous decision”. Third, the issue\n                    allegedly estopped should have been raised and argued. Our view 23     It would be helpful to explain the context of\n                    theResJudicataArgument. According to the Appellant, in the Rescission Proceedings, both the\n                    first District Judge and the High Court Judge on appeal considered the\n                    parties’ detailed submissions and held that the courts have the power to\n                    make ancillary orders under Pt X of the Act even for void\n                        marriages.[note: 32]As noted above, one\n                    of the reasons for the first District Judge’s refusal to grant a\n                    declaration that the Hong Kong Marriage was void was that she thought that a\n                    nullity petition would be a more appropriate avenue for making such a\n                    determination (see [6(c)] above). In elaborating on this reason, the first\n                    District Judge opined that ancillary relief may be obtained for void as well as\n                    voidable marriages.[note: 33] 24     Our view was that the second and third\n                    elements of issue estoppel are certainly satisfied. The parties to the\n                    Rescission Proceedings and the present proceedings (an appeal against a\n                    Judge’s determination on ancillary matters) are identical and the\n                    decisions of the first District Judge (and the High Court Judge on appeal) were\n                    made by courts of competent jurisdiction. The issue is with the first and final\n                    elements. 25     We did not think, however, that the first and\n                    final elements were satisfied. In respect of the final element, there was no\n                    identity in the subject matter of the Rescission Proceedings and the present\n                    proceedings. In the Rescission Proceedings, the first District Judge was asked\n                    to rescind thedecree nisiand declare that the\n                    Hong Kong Marriage was void. The first District Judge gave three reasons why it\n                    was inappropriate to grant a declaration. In explaining just one of her reasons,\n                    she expressed a view on the availability of ancillary relief. In contrast, the\n                    present proceedings raised squarely for decision the issue of whether ancillary\n                    relief is available. In other words, the first District Judge’s view that\n                    ancillary relief is available in void marriages wascollateralto the issue that she had to decide. She was not\n                    required to express such a view. In fact, the first District Judge herself\n                    appeared to recognise that it was not her role to decide on whether ancillary\n                    relief is available for void marriages. On the issue as to whether maintenance\n                    is available in void marriages, the first District Judge qualified her\n                    observation with a comment that the possibility of obtaining maintenance was an\n                    issue that she “[did] not have to decide now”.[note: 34]For\n                    the same reasons, the first District Judge (and the High Court Judge on appeal)\n                    did not conclusively decide on the issues raised in this appeal and the first\n                    element was not satisfied. The first District Judge was merely expressing a view\n                    on the issues in order to bolster her conclusions on the matter that was before\n                    her (which was different from the subject matter of this appeal). 26     We therefore found that there was noresjudicatain respect of\n                    the remaining two issues before us.",
        "Do Singapore courts have the power to divide matrimonial assets and\n                order maintenance in the context of a void marriage?": "27     It would be convenient to consider the second\n                    and third issues together. 28     Since these two issues are, essentially,\n                    issues of statutory interpretation, we will begin our analysis with an\n                    examination of the wording of the relevant provisions. We will then test our\n                    interpretation of the provisions against the legislative and historical\n                    background. Finally, general policy and principle will be\n                considered. The statutory language 29     It is now axiomatic that apurposiveapproach ought to be taken in the context of statutory\n                    construction (see, for example, s 9A of the Interpretation Act (Cap 1,\n                    2002 Rev Ed) as well as the decision of this court inJoseph Mathew and another v Singh Chiranjeev and another[2010]\n                    1 SLR 338 at [32] and that of\n                    the Singapore High Court inPP v Low Kok Heng[2007] 4 SLR(R) 183). In this regard, the first port of call ought to\n                    be the statutory language of the provision or provisions being construed. If the\n                    meaning of the statutory language is plain and clear, then the court ought to\n                    give effect to that meaning. What the court oughtnotto do is tosuperimposewhatitfeelsoughtto be the meaning of the statutory provision concerned,notwithstandingthe plain meaning of the statutory\n                    language. 30     Turning to the statutory language of both\n                    ss 112(1) and 113(b) of the Act, the critical\n                    reference is the presence in both provisions of the phrase “nullity of\n                    marriage”. The Judge seemed to take the view that there ought to be read\n                    into this phrase a referenceonlyto avoidable(as opposed to a void) marriage. With respect,\n                    this is inconsistent with the manner in which the phrase “nullity of\n                    marriage” has been utilised by the Singapore Parliament in the Act\n                    itself. Indeed, this very phrase constitutes the heading which helms the\n                    preceding chapter of Pt X of the Act, which relates tobothvoidandvoidable marriages.\n                    In our view, if Parliament had intended the phrase “nullity of\n                    marriage” in the aforementioned provisions to refer tovoidablemarriagesonly, it would\n                    have stated soexpressly. Lest it be thought that\n                    such a plain reading of both provisions would militate against the tenor and\n                    spirit of the Act in general and the specific provisions therein in particular,\n                    we elaborate on the legislative background in more detail below (at[34]–[45]). Nevertheless, even if we look only at the provisions\n                    themselves, it is clear, in our view, that Parliamentintended, in no uncertain terms, that the courts exercise their\n                    powers pursuant to ss 112(1) and 113(b) in\n                    all cases relating to nullity of marriage (which, as already noted above in this\n                    paragraph, includes both void as well as voidable marriages).That is theplain and\n                        unambiguousmeaning of the phrase “nullity of\n                    marriage”, readbothliterallyas well asin the context alluded to briefly above.\n                    Further, no absurdity results from such a construction. Whilst courts have long\n                    discarded a dogmatic as well as mechanistic approach towards statutory\n                    interpretation, they simultaneously oughtnotto\n                    swing to the other extreme as well. Put simply, courts are not – and ought\n                    to not act as if they are – “mini-legislatures”. With\n                    respect, the Judge should have tried to discern Parliament’s intention\n                    from the provisions as a whole and their context instead of focusing on other\n                    parts of the same provisions (see the Judgment at [15]–[16]). In so\n                    doing, the Judge hadsuperimposeda meaning on the\n                    relevant statutory language which Parliament had never intended. That having\n                    been said, thelegislativeintention or purpose\n                    that the phrase “nullity of marriage” encompassesbothvoidandvoidable\n                    marriages is madeeven clearerby,inter alia, thelegislative\n                        backgroundas well. And it is to that background that our\n                    attention now turns. 31     However, before proceeding to do so, we should\n                    observe that a similar approach has been adopted in England in so far as the\n                    phrase “nullity of marriage” is concerned. Put simply,nodistinction is read into this phrase between void\n                    marriages on the one hand and voidable marriages on the other. 32     We note first that, in so far as thedivision of matrimonial assetsis concerned, there is no\n                    direct UK equivalent of s 112 of the Act. However, it bears noting that the\n                    UK provisions dealing with the division of matrimonial assets throughout the\n                    years (the latest of which are ss 23 and 24 of the Matrimonial Causes Act\n                    1973 (c 18) (UK) (“the 1973 UK Act”))have alwaysencompassed situations relating\n                        to nullity of marriage as well. More importantly, English case\n                    law has consistently recognised the availability of ancillary relief even in the\n                    context ofvoidmarriages (see, for example, the\n                    English Court of Appeal decision ofRampal v Rampal\n                        (No 2)[2002] 1 Fam 85 (“Rampal”) which was, in fact, cited to this court by\n                    counsel for the Appellant (we note, parenthetically, thatRampalwas also followed in the Hong Kong Court of Appeal\n                    decision ofL v C[2007] 3 HKLRD 819, a case\n                    involving bigamy, where the court held that, under s 6 of the Hong Kong\n                    Matrimonial Proceedings and Property Ordinance (Cap 192) (HK), the same\n                    right to ancillary relief as applies in a divorce applies where a decree of\n                    nullity is obtained (at [96])). Incidentally, the court inRampalwas primarily concerned with whether the doctrine ofex turpicausa non orituractioprecluded a bigamist from\n                    seeking ancillary relief under the 1973 UK Act. The court held that there\n                    was no blanket rule that precludes a bigamist from being entitled to seek\n                    ancillary relief (Rampalat [27]). We express no opinion on this aspect of\n                    the decision, which is beyond the scope of the present appeal. 33     In so far asmaintenance\n                        for the wifeis concerned, we note that s 1(1) of the UK\n                    Matrimonial Causes Act 1907 (c 12) (UK) (“the 1907 UK Act”)\n                    permitted the court to make an order for such maintenance in situations ofnullity of marriageas well. As a learned\n                    author observed (correctly in our view), this particular provision manifested\n                    “[t]he same tendency to treat void and voidable marriages as if they were\n                    valid marriages that had been dissolved” (see E J Cohn,\n                    “The Nullity of Marriage – A Study in Comparative Law and Legal\n                    Reform” (1948) 64 LQR 324 at p 327). This is significant\n                    in the local context because s 1 of the 1907 UK Act isin parimateriawith s 113 of\n                    the Act. Indeed, the English courts have also interpreted the phrase\n                    “nullity of marriage” in s 1 of the 1907 UK Act as referring\n                    tobothvoidandvoidable marriages (seeRamsay v Ramsay (otherwise\n                        Beer)[1913] 108 LT 382 (“Ramsay”); reference may also be made toRampal, cited in the preceding paragraph, as well as the\n                    Royal Commission on Marriage and Divorce,Report\n                        1951–1955(Cmd 9678, 1956) (“the1951–1955 Report”), especially at\n                    para 516 (“[w]here the marriage is ended by divorceor annulmentwe think that the court should havethe widest possible discretionas to the kind\n                    of financial provision it can order one spouse to make for the other.”\n                    [emphasis added]). Incidentally, the Supreme Court of Canada inGeorge HubertPowell v Viola M\n                        Cockburn[1977] 2 SCR 218 has also held (at 236–237)\n                    that a party to a void marriage was entitled to seek maintenance under s 1\n                    of the Matrimonial Causes Act (RSO 1970, c 265) (Ont) (this provision\n                    also used the phrase “nullity of marriage”). The legislative background (1)   The background to the original Bill 34     It is interesting to note that when the Bill\n                    in which the legislative precursors to ss 112 and 113 were first introduced\n                    (via the Women’s Charter (Amendment) Act 1980 (Act 26 of 1980)\n                    (“the 1980 Amendment Act”)) was first presented to\n                    Parliament,bothclauses concerned didnotcontain the phrase “nullity of\n                    marriage”. Indeed, a perusal of theComparative\n                        Tableattached to the Bill reveals why this was so (see the\n                    Women’s Charter (Amendment) Bill (Bill No 23/79) (“the\n                    1980 Bill”) at p 45 as well as theExplanatory Statementat pp 39–40). In particular,\n                    the respective provisions were based, as theComparative\n                        Tableclearly states, on the corresponding provisions in theMalaysianLaw Reform (Marriage and Divorce)\n                    Act 1976 (Act 164 of 1976) (Malaysia) (“the Malaysian Act”). An\n                    excellent account of the history of the Malaysian Act has been given elsewhere\n                    (see B C Crown, “Property Division on Dissolution of Marriage”\n                    (1988) 30 Mal LR 34 (“Crown”)\n                    at pp 37-41). What is crucial for the purposes of the present judgment,\n                    however, is the fact that the relevant provisions in the Malaysian Act didnotcontain the phrase “nullity of\n                    marriage” (see ss 76 and 77 of the Malaysian Act which relate to the\n                    division of matrimonial assets and the power for the court to order maintenance\n                    of a spouse, respectively) and that this wasalso\n                        reflectedin the 1980 Bill which, as just noted, drew upon\n                    the aforementioned provisions of the Malaysian Act. It is clear, in our view,\n                    that the Malaysian Parliamentintendedtoexcludenullity of marriage(whether involving void or voidable marriages)\n                        from the purview of ss 76 and 77 of the Malaysian Act(see\n                    also theReport of the Royal Commission on Non-Muslim\n                        Marriage and Divorce Laws(Kuala Lumpur, 1971) (“theMalaysian Royal Commission Report”) at\n                    p 57 and Ahmad Ibrahim, “The Law Reform (Marriage and Divorce) Bill,\n                    1975” [1975] JMCL 354 at p 360 (also published in [1975]\n                    2 MLJ lxix at lxxi); thoughcfMimi\n                    Kamariah Majid,Family Law in Malaysia(Malayan\n                    Law Journal Sdn Bhd, 1999) at pp 329–330 (adopting an approach that\n                    is not dissimilar to that adopted by the Judge in the court below in relation to\n                    the issue of maintenance pursuant to s 77 of the Malaysian Act, but which,\n                    with respect, is erroneous because, as explained above, it superimposes an\n                    additional meaning that was not intended by the clear and unambiguous statutory\n                    language)).More importantly, this was also theoriginal intentionwhich wasembodied within the 1980 Bill in the Singapore context.\n                    On a related note, the fact that the Malaysian Parliament clearly intended\n                    – particularly when viewed incontext\n                        –to excludeallforms ofnullity of marriagefrom the purview of\n                    ss 76 and 77 of the Malaysian Act buttresses our view (set out above and\n                    based on the clear and unambiguous statutory language) that, bysubsequently insertingthe phrase “nullity of\n                    marriage” into the corresponding provisions in the Act, the Singapore\n                    Parliament must have not only intended toreverseits previous decision to adopt the Malaysian position but must have alsointended to include nullity of marriage in all its\n                        forms(viz, as encompassing both\n                    void as well as voidable marriages). 35     Indeed, the relevant background as to why the\n                    Singapore Parliament ultimately inserted,contraryto its original intention as reflected in the 1980 Bill (which followed the\n                    Malaysian position in excluding nullity of marriage from the scope of both the\n                    division of matrimonial assets as well as the power of the court to order\n                    maintenance for the wife), the phrase “nullity of marriage” in the\n                    relevant Singapore provisions lendsfurther\n                        supportto the construction we have adopted of this phrase with\n                    regard to both ss 112 and 113 of the Act. We refer, in particular, tothe proceedings before the Select Committee,\n                    which took place between the promulgation of the 1980 Bill and the ultimate\n                    enactment of the 1980 Amendment Act by the Singapore Parliament. The 1980\n                    Amendment Act adopted the suggestions of the Select Committee. 36     Before turning to consider the Select\n                    Committee proceedings, we pause to note – parenthetically – that the\n                    provisions that were introduced via the 1980 Amendment Act were (at least\n                    in so far asthe division of matrimonial assetswas concerned)not the same asthecurrentprovisions. In particular, the\n                    1980 Amendment Act introduced s 106 of the Women’s Charter\n                    (Cap 353, 1985 Rev Ed) (“the 1985 Rev Ed”). That\n                    particular provision was subsequently amended via the Women’s Charter\n                    (Amendment) Act 1996 (Act 30 of 1996), which came into effect on 1 May\n                    1997, and the resultant provision is (including some very minor amendments\n                    pursuant to the Statutes (Miscellaneous Amendments) (No 2) Act 2005\n                    (Act 42 of 2005)) identical in all respects to the provision that is the\n                    subject of the present appeal in so far as the division of matrimonial assets is\n                    concerned,viz, s 112 of the Act. However,\n                    whatisthe same (and this is crucial for the\n                    purposes of the present appeal) is thatboths 106 of the 1985 Rev Edas well ass 112 of the (present) Act contain the phrase “nullity of\n                    marriage”. Hence, the analysis contained in the present judgment would\n                    applyequallytoboththese provisions. (2)   Proceedings before the Select Committee (A)   Prof Leong’s paper 37     It is useful to begin our consideration of the\n                    Select Committee proceedings with a paper that was presented to the Select\n                    Committee by a leading academic in the field. In this paper, a number of points\n                    were raised by Prof Leong Wai Kum (“Prof Leong”). The\n                    one that is germane to the present appeal relates to her suggestions with regard\n                    to the omission in the 1980 Bill of petitions of nullity in relation to the\n                    clauses pertaining to the division of matrimonial assets as well as financial\n                    provision for the wife (a point noted above at[34]). In her view (seeReport of the Select\n                        Committee on the Women’s Charter (Amendment) Bill [Bill\n                        No. 23/79](Parl 1 of 1980, 25 February 1980)\n                    (“theSelect Committee Report”) at\n                    pp A7–A8): 1.    These sections [relating to the division of\n                            matrimonial assets and financial provision for the wife (presently ss\n                            112 and 113 of the Act)] do not include petitions for nullity. This\n                            omission isunfortunate because the existing statute\n                                in Sections 107 and 114clearly\n                                allow[sic]the court to order financial provision for the\n                                “wife” in a nullity petition. And, although there is\n                                not an existing section on the division of matrimonial assets, there\n                                is no reason to believe that our courts would not follow the English\n                                practice of giving her an interest in the matrimonial assets\n                                whenever they have felt it just. The Bill would thus be taking away\n                                the right of a “wife” of an annulled marriage to\n                                financial provision and a share of the family\n                            property. 2.As a matter of principle, on the\n                                question whether she ought to be given part of the family property\n                                and/or ought to be given financial provision, there is no reason why\n                                a woman who is incapable of consummating her marriage (for which her\n                                husband can obtain a decree of nullity) should be treated any\n                                differently from a woman with whom her husband finds intolerable to\n                                live (for which he may obtain a decree of divorce). Thus it is\n                                submitted that the present law empowering the court to make such\n                                orders is to be preferred. [emphasis added] 38     In a similar vein, Prof Leong observed\n                    thus (in a legislative comment on the 1980 Bill in Leong Wai Kum, “ATurning Pointin Singapore Family Law:\n                    Women’s Charter (Amendment) Bill 1979” (1979) 21 Mal LR\n                    327 at p 339): Agrave omissionof the Bill is that the\n                        grant of decrees ofnullityisnotincluded in these provisions which empower the\n                        court to divide family assets and to order support payments for the\n                        wife’s benefit. The Act allows the court to do so; it is most\n                        undesirable that this power be removed.Whether the\n                            family unit is disintegrated pursuant to the grant of a decree of\n                            divorce or a decree of nullity the spouses have to attend to the same\n                            concernsviz.dividing up the family\n                            assets and arranging the maintenance of the wife and children and\n                            custody of the children.… [original emphasis omitted;\n                        emphasis added in italics] Reference may also be made toCrownat\n                    p 37. 39     The point made by the learned author is even\n                    clearer in the passage just quoted. Indeed, her focus is – rightly, if we\n                    may say so – on the substance (as opposed to the form) of the matter. And\n                    it is that the family unit can disintegrate in at least two main ways,viz, by divorce or through a petition for nullity. The\n                    main point of substance, however, ispreciselythat the family unit has in factdisintegrated,\n                    andthatconstitutes thecommonalitybetween the parties,which ought\n                        (in fairness) to be addressed. Once this is admitted, it is\n                    clear, in our view, that the Singapore Parliamenthad\n                        appropriately added the phrase “nullity of marriage” (although\n                        absent in the 1980 Bill), inter alia,\n                        into ss 112 and 113 of the Act.Indeed, we would add that,\n                    to achieve the full purpose of providing forallconcerned in the event of thedisintegration of the family\n                        unit(forwhatever reason), the\n                    phrase “nullity of marriage” which was ultimately inserted into\n                    ss 112 and 113 of the Actmustbe givenits plain meaning(viz, thatbothvoidas well asvoidable marriages are encompassed within the\n                    meaning of,inter alia, ss 112 and 113 of the\n                    Act). 40     The views by the same author in her textbook\n                    ought also to be noted. Consistent with her views set out above, the learned\n                    author argues thatancillary reliefought to be\n                    available with regard tovoidmarriages (see Leong\n                    Wai Kum,Elements of Family Law in Singapore(LexisNexis, 2007) (“Leong Wai Kum”)\n                    at p 76). She explains that although a judgment of nullity is conceptually\n                    meaningless where a marriage is voidabinitio, obtaining such a judgment is useful in practice\n                    because it allows the parties access to the court’s jurisdiction to order\n                    ancillary relief (ibid). Prof Leong also\n                    points out that there is no case law discussing whether the court’s\n                    exercise of its ancillary powers should be “attenuated” where a\n                    marriage is void, as compared to the more conventional situation of a\n                    termination by divorce (ibid). 41     Although the reason for\n                    Prof Leong’s view in her textbook is not immediately apparent in this\n                    particular portion of her work, another part of the book may, however, provide\n                    an explanation as to why parties to a void marriage should, in her view, be\n                    entitled to ancillary relief (seeLeong Wai Kumat\n                    pp 40–44). Prof Leong explains that a distinction should be\n                    drawn between a “non-marriage” and a “void marriage”\n                    (see also Joseph Jackson,The Formation and Annulment of\n                        Marriage(2nd Ed, Butterworths, 1969) (“Jackson”) at pp 85–86). She uses the\n                    term “non-marriage” to refer to a situation where the parties have\n                    no marital relationshipwhatsoever(the example\n                    Prof Leong gives is a stranger coming up to a person and claiming that he is\n                    married to her). In contrast, parties to a void marriage may have conducted\n                    themselves as if the marriage was valid. Prof Leong proceeds to argue that\n                    a workable distinction between “void marriages” and\n                    “non-marriages” is that the former category of marriages fulfils\n                    the fundamental contractual requirements of marriage:viz, there must be credible evidence of an exchange of a mutual\n                    intention to marry (seeLeong Wai Kumat\n                    p 41). In our view, Prof Leong’s argument is persuasive and\n                    constitutes an answer to any conceptual difficulties that may arise in holding\n                    that a void marriage has legal consequences. (B)   The Select Committee proceedings 42     We would observe at the outset that the\n                    relevant part of the Select Committee proceedings confirms in no uncertain terms\n                    the construction we have adopted with regard to both ss 112 and 113 of the\n                    Act. 43     The relevant part of theSelect Committee Reportis to be found at pp C6–C10,\n                    with the following extract from pp C8–C10 being of especial\n                    significance (which therefore merits setting out in full): Dr Ahmad\n                                    Mattar:Mr Chairman, Sir, we are now at\n                                            amendment (10) which deals with the new\n                                            section 101(1). This section states\n                                            that:“The court shall have power,\n                                            when granting a decree of divorce or judicial\n                                            separation, to order the division between the parties of\n                                            any assets acquired by them during the marriage by their\n                                            joint efforts or the sale of any such assets and the\n                                            division between the parties of the proceeds of\n                                            sale.”In my amendment,I am suggesting that we should add the\n                                                words “or nullity of\n                                                marriage”.Mr Selvadurai:So if the marriage is\n                                                null and void, there cannot be any question of\n                                                marital property, can\n                                    it?Dr Ahmad\n                                    Mattar:We are talking about\n                                                the assets acquired by them during the marriage. So\n                                                if the marriage is nullified later on, should not\n                                                the assets be so divided\n                                        also?Mr Selvadurai:If acquired through their joint\n                                            efforts.Dr Augustine\n                                    Tan:Mr Chairman, I think the implication\n                                            of this amendment goes beyond the immediate application\n                                            in section 101, because sections 102 and 103 go\n                                            further and talk about maintenance. And if the court is\n                                            empowered to deal with division of assets under\n                                            section 101, then the law could easily be extended\n                                            by the courts to cover sections 102 and 103. I am\n                                            not a legal man on this but perhaps the Member for Kuo\n                                            Chuan could tell us whether such a thing could\n                                            happen.The Chairman:At the moment, we are dealing with\n                                            amendment (10). You are going forward to\n                                            amendment (11) now.Dr Augustine\n                                    Tan:No. I am not trying to be ahead of the\n                                            Committee, Sir. I am just drawing the Committee’s\n                                            attention to a possible implication and the consequence\n                                            of amending section 101.Dr Ahmad\n                                    Mattar:We are not amending the existing\n                                            section 102 of the Bill. We are only amending the\n                                            existing section 101 by adding the words “or\n                                            nullity of marriage”.Mr Selvadurai:I think it is all right, Mr Chairman.\n                                            The opening words of section 102 merely say,\n                                            “The court may order …”. It is not\n                                            a mandatory provision at all. In other words, if the\n                                            court feels that maintenance is not allowed then it\n                                            would not allow it. It has the discretion\n                                        anyway.Dr Augustine\n                                    Tan:It has the discretion.But what I am asking is: What is the legal\n                                                implication on sections 102 and 103 by amending\n                                                section 101 to include the words “or nullity\n                                                of marriage”?What is the court\n                                            likely to interpret sections 102 and 103?\n                                            Logically, to my mind, if the court is empowered to\n                                            divide the assets on grounds of nullity of marriage as\n                                            well as the other two grounds of divorce or judicial\n                                            separation, by the same token, maintenance can also be\n                                            required —Mr Selvadurai:You are thinking of\n                                                nullity of marriage as one being null and void abinitio, i.e. right\n                                                from the word “go”.There\n                                            have been cases in the past where a couple after having\n                                            been married for two to three years discovered that\n                                            something has gone wrong. Finally they go to court and\n                                            get an order and the court makes an order saying that\n                                            the marriage is null and void for various reasons. It\n                                            means that in the process, for about two to three years,\n                                            they had lived as man and wife and acquired marital\n                                            property by joint efforts.Dr Augustine\n                                    Tan:I see the point in\n                                                respect of assets acquired in the course of\n                                                marriage.My point relates to the\n                                            maintenance.Mr Selvadurai:Even on the question of\n                                                maintenance, for example, it says, “The court\n                                                may order maintenance.” It does not say\n                                                “shall”.Dr Augustine\n                                    Tan:Here again, you are leaving so much\n                                            discretion to the court.Mr Selvadurai:Oh, yes. You must leave it to the\n                                            court.The Chairman:He wants to control the\n                                        court!Mr Selvadurai:You cannot.You will\n                                                shackle the court.Amendment agreed\n                                                to.Dr Ahmad\n                                    Mattar:Sir, I beg to move,In\n                                            page 19, line 4, to leave out “or\n                                            judicial separation”, and insert “,\n                                            judicial separation or nullity of\n                                            marriage”.Sir, this amendment is\n                                            consequential to the one proposed and discussed\n                                            earlier.Amendment agreed\n                                                to.4.30\n                                    p.m.Dr Ahmad\n                                    Mattar:Sir, I beg to move,In\n                                            page 19, to leave out lines 32 to 40 inclusive\n                                            and insert —“Power of court to\n                                            order maintenance101. The court may order a\n                                            man to pay maintenance to his wife or former wife\n                                            —(a)\n                                            during the course of any matrimonial proceedings;\n                                            or(b) when\n                                            granting or subsequent to the grant of a decree of\n                                            divorce, judicial separation or nullity of\n                                            marriage.”.Sir, in this particular\n                                            instance I agree that paragraph (c) of 102 of the\n                                            Bill be deleted. Now, if a wife who is presumed to be\n                                            dead is found to be alive, then she is entitled to apply\n                                            for maintenance under paragraph (b) of section 102 of the\n                                            Bill.Dr Augustine\n                                    Tan:I notice that under the proposed amendment\n                                            of section 101, paragraph (b), the words “nullity of\n                                            marriage” have been included, whereas in the\n                                            original amendment there were no such words.I think it is this particular section here\n                                                which causes me concern, thus the objection which I\n                                                lodged earlier on when I drew the attention of the\n                                                Committee to this particular\n                                            section.Mr Selvadurai:The same reasoning applies. The same\n                                            consideration applies. I thought we discussed it a few\n                                            minutes ago.Dr Augustine\n                                    Tan:Let us take the case of\n                                                a woman who comes from Malaysia. She is already\n                                                married to somebody there, but she goes to the\n                                                Registrar and declares that she is single.\n                                                Subsequently she is found out. Are you going to make\n                                                the man responsible for her\n                                            financially?Mr Selvadurai:The court has the\n                                        discretion.Dr Ahmad\n                                    Mattar:The court will\n                                    decide.Dr Augustine\n                                    Tan:I am not sufficiently convinced. If the\n                                            Committee wishes to proceed, it can carry\n                                        on.The Chairman:Well, leave it to the court. The Member\n                                            for Whampoa does not believe in\n                                    that!Amendment agreed\n                                                to.[original emphasis\n                                            omitted; emphasis added in italics and bold\n                                            italics]   44     The above extract demonstrates that the\n                    committee had intended the phrase “nullity of marriage” in the\n                    predecessor provisions to both ss 112 and 113 of the Act to allow the\n                    courts thediscretionto order division of\n                    matrimonial assets and maintenance in void marriages as well. In\n                    particular: (a)     In relation to the division of\n                        matrimonial assets, the members appear to have been persuaded by\n                        Dr Ahmad Mattar’s response (immediately after\n                        Mr Selvadurai’s reference to a “null andvoidmarriage” [emphasis added]) that assets\n                        may have been acquired in a nullified marriage. It should be noted that it\n                        does not appear that the members were using the word “void”\n                        loosely. The members seem to have appreciated that a void marriage is one\n                        that is voidabinitio. Indeed, Mr Selvadurai used the phrase\n                        “voidabinitio” in one of his comments in the extract\n                        above. (b)     In so\n                        far as the issue of maintenance is concerned, it appears that the majority\n                        of the committee were satisfied with Mr Selvadurai’s explanation\n                        that the court should have the discretion to order maintenance in void\n                        marriages. Again, the members do not appear to be using the word\n                        “void” loosely. In fact, Dr Augustine Tan (the sole\n                        dissenter) referred to a situation ofbigamyin his attempt to convince the members that a man should not be responsible\n                        for maintaining a bigamous wife. 45     During the third reading of the Bill, the\n                    amendments recommended by the Select Committee were accepted by Parliament\n                    without any debate. There was only an introductory speech by Dr Ahmad\n                    Mattar (seeSingapore Parliamentary Debates, Official\n                        Report(25 June 1980) at cols 1458–1462,perDr Ahmad Mattar, Acting Minister for Social\n                    Affairs). Although there is no express mention in Dr Ahmad Mattar’s\n                    speech of the deliberations of the Select Committee concerning the introduction\n                    of the words “nullity of marriage” in the clauses that would\n                    become the predecessor provisions to ss 112 and 113 of the Act, these\n                    deliberations are nevertheless valuable in furnishing us with the relevant\n                    background that confirms the interpretation we have adopted with regard to the\n                    phrase “nullity of marriage” in ss 112 and 113 of the Act.\n                    More importantly, it is both logical as well as reasonable to assume, in these\n                    circumstances, that the Singapore Parliament must haveacceptedthe changes proposed by the Select\n                Committee. The historical background 46     We turn now to consider the historical\n                    background to the distinction between void and voidable marriages. The purpose\n                    of this exercise is to ascertain whether or not our interpretation of the term\n                    “nullity of marriage” in ss 112 and 113 of the Act is\n                    inconsistent with the historical rationales for the distinction between void and\n                    voidable marriages. (1)   The origins of the distinction between void and voidable\n                marriages in English law 47     The basic concept of nullity of marriage in\n                    general and its specific elements of void and voidable marriages in particular\n                    can in fact be traced historically back to the ecclesiastical courts in England\n                    (seeperLord Morris of Borth-y-Gest in the\n                    House of Lords decision ofRoss Smith v Ross Smith[1963] AC 280 (“Ross\n                    Smith”) at 313-314 and 317 as well asJackson, especially at p 72). Indeed, the concept of\n                    nullity of marriage arose as a result of the fact that the courts in England\n                    could not then grant decrees of divorce because marriage was (at that particular\n                    point in time) considered a sacrament, which (in turn) resulted in the\n                    indissolubility of marriage (see, for example,\n                    N V Lowe and G Douglas,Bromley’s Family Law(10th Ed, Oxford University\n                    Press, 2007) (“Lowe & Douglas”) at pp 67–68).\n                    However, in addition to divorcesa mensa et thoro(or judicial separation), the courts could grant decrees of nullity instead in\n                    order to mitigate the hardships engendered by the indissolubility of marriage\n                    (see, for example, the English Court of Appeal decision ofAdams v Adams[1941] 1 KB 536 at 541,perScott LJ and the Royal Commission on Divorce\n                    and Matrimonial Causes,Report of the Royal Commission on\n                        Divorce and Matrimonial Causes(Cd 6478, 1912) (“the1912 Report”) at para 13)\n                    – one practical (and desirable) result of which was that remarriage was\n                    permitted during the lifetime of a spouse. As a leading legal historian aptly\n                    put it, the ecclesiastical courts “could not break the chains, but they\n                    could declare that the chains were never there” (see J H Baker,An Introduction to English Legal History(4th Ed, Butterworths, 2002) at p 491). 48     How, then, did the distinction between void\n                    and voidable marriages arise? The reasons for such a distinction are not wholly\n                    clear, but it would appear that they werehistoricaland arose as a result of atussle, so to speak, between the royal courts on the one hand\n                    and the ecclesiastical courts on the other. The following extract from a leading\n                    English textbook on family law concisely explains this conflict (seeLowe & Douglasat p 68): By the beginning of the seventeenth century, however, the royal courts\n                        were becoming concerned at the ease with which marriages could be set aside\n                        and the issue bastardised. This was more likely to work injustice after the\n                        parties’ death, when relevant evidence might no longer be available.\n                        Accordingly, theycut downthe ecclesiastical\n                        courts’ jurisdiction by forbidding them to annul marriages in certain\n                        cases after the death of either party.This had the\n                            result of dividing impediments into two kinds: civil and\n                            canonical. If the impediment wascivil– for example, the fact that one of the parties\n                        was married to a third person at the time of the ceremony – the\n                        marriage was stillvoid ab initioand its validity could be put in issue by anyone at any time,\n                            whether or not the parties were still alive. If the\n                        impediment wascanonical– for example,\n                        the fact that one of the parties was impotent –the validity of the marriage could not be questioned\n                            after either party had died. The rule thus developed that such a\n                            marriage must be regarded as valid unless it was annulled during the\n                            lifetime of both parties. Until that time it had the capacity to be\n                            turned into a void marriage: in other words, it wasvoidable. [emphasis added in bold italics; emphasis\n                        in italics in original] Reference may also be made to Paul J Goda, “The\n                    Historical Evolution Of The Concepts of Void And Voidable Marriages”\n                    (1967) 7 J Fam L 297 (where the learned author was of the view that\n                    the distinction between void and voidable marriages turned on whether or not the\n                    main issue was property – in which case the temporal courts would have\n                    jurisdiction in the context of a void (as opposed to a voidable) marriage; this\n                    view is not, we note, inconsistent with the observations ofLowe & Douglaswhich have just been quoted above) and\n                    D Tolstoy, “Void and Voidable Marriages” (1964) 27 MLR\n                    385 (“Tolstoy”) at p 387,\n                    note 14 (where the learned author furnished two reasons as to why the royal\n                    courts interfered with the ecclesiastical courts’ power to declare some\n                    marriages to be void: first, to protect the issue from being bastardised and\n                    disinherited because they (ie, the issue) might\n                    not be able to defend the marriage as well as the parties might have if they\n                    were both alive; and second, the ecclesiastical courts were permitted to\n                    separate parties to marriages suffering from canonical disabilities because such\n                    marriages were considered to be sinful; however, after the death of one of the\n                    parties, the royal courts would not permit the ecclesiastical courts to\n                    interfere because any separation “could no longer contribute to the good\n                    of their [ie, the parties’]\n                    souls”). 49     After the passing of the Matrimonial Causes\n                    Act 1857 (c 85) (UK) (“the 1857 UK Act”), the concept of\n                    judicial divorce was introduced. However, the concept of nullity of marriage as\n                    well as the distinction between void and voidable marriages remained. Indeed,\n                    even prior to the 1857 UK Act, the distinction between void and voidable\n                    marriages occasionally appeared even in statutes (see, for example, the Marriage\n                    Act 1835 (c 54) (UK), as well as the observations by Lord Morris\n                    inRoss Smith(at 316)). What is clear, however,\n                    is that the distinction between void and voidable marriages was more ahistoricalone. (2)   The legal significance of the distinction between void and\n                voidable marriages 50     That having been said, it cannot be doubted\n                    that, in so far asconsequencesare concerned,\n                    distinguishing between void and voidable marriages does havelegalsignificance, especially wherethird\n                        partiesare concerned (see alsoLowe & Douglasat pp 70–71). As, for\n                    example, Lord Greene put it in the following (and oft-cited) passage in the\n                    English Court of Appeal decision ofDe Reneville v De\n                        Reneville[1948] P 100 (at 111): … [A] void marriage is one that will be regarded by every court in\n                        any case in which the existence of the marriage is in issue as never having\n                        taken place and can be so treated by both parties to it without the\n                        necessity of any decree annulling it: a voidable marriage is one that will\n                        be regarded by every court as a valid subsisting marriage until a decree\n                        annulling it has been pronounced by a court of competent jurisdiction.\n                        … 51     What this means is that, in so far asvoidmarriages are concerned,third partieswhohave a proper\n                        interestin the mattercan rely on\n                    the fact that the marriage concerned is void in order to help make out their\n                    case against the other party or parties. Where, however, the marriage is onlyvoidable, the right to raise the fact that the\n                    marriage concerned is voidable ispersonalto the\n                    partiesonlyand can only be raisedduring the lifetime of the other spouse(see, for\n                    example, the English High Court decisions ofA v B and\n                        Another(1868) LR 1 P&D 559 at 561-562,perSir J P Wilde andFowke v Fowke[1938] 1 Ch 774 at 781,perFarwell J; the English Court of Appeal\n                    decisions ofIn re Eaves, Eaves v Eaves[1940]\n                    1 Ch 109 at 119,perGoddard LJ andRe Roberts (deceased), Roberts v Roberts[1978] 1 WLR 653 at 655-657,perWalton J (at first instance) and 663,perGoff LJ; andRoss Smithat 306,perLord Reid); put simply,third partieswould havenooperative rights in so far asvoidablemarriages\n                    are concerned. Reference can also be made to the significant Singapore High\n                    Court decision ofTan Ah Thee and another (administrators of\n                        the estate of Tan KiamPoh (alias Tan Gna\n                        Chua), deceased) v Lim SooFoong[2009] 3 SLR(R) 957 (see also the valuable commentary in Leong Wai\n                    Kum, “Clarity in the Law of Valid, Void and Voidable Non-Muslim\n                    Marriages” (2009) 21 SAcLJ 575 (“Leong”) and Debbie Ong, “Marriages Produces A\n                    Husband and A Wife – The Law on Void and Voidable Marriages and the Legal\n                    Regulation of the Husband and Wife Relationship” in Yeo Tiong Min, Hans\n                    Tjio and Tang Hang Wu (Gen Eds),SAL\n                        Conference 2011: Developments in Singapore Law Between 2006 and 2010 –\n                        Trends and Perspectives(Academy Publishing, 2011),\n                    pp 272-301 (“Ong”) at\n                    pp 272-283). (3)   The origins of the grounds for nullity 52     It would be useful to note the historical\n                    origins of the grounds for nullity. It appears that the grounds upon which a\n                    decree of nullity could be granted after the 1857 UK Act were already\n                    relatively satisfactory. However, further grounds were added, statutorily, via\n                    s 7 of the Matrimonial Causes Act 1937 (c 57) (UK) (“the\n                    1937 UK Act”), giving effect to the recommendations of the1912 Report(these grounds rendering the marriage\n                    voidable (see alsoJacksonat pp 75 and\n                    97–98 as well as the1951–1955 Report, especially at para 25)). These\n                    grounds also comprise, in theSingaporecontext,\n                    what is presently ss 106(b), (c) (as modified after the 1971 UK developments, see\n                    below at[57]–[58]), (e) and (f) of the Act (see below at[61]). Indeed, and returning to the English position, although\n                    there was a further landmark statutory amendment in 1971, thestatutory groundsas we know them today (in Singapore as well)\n                    were – subject to one significant exception which will be discussed in a\n                    moment – settled, in the main, circa 1937. 53     It is also interesting to note that statutory\n                    groundsfor nullity of marriageexisted in thelocalcontextas far back\n                        as 1910.In particular, s 14 of the Straits Settlements\n                    Divorce Ordinance 1910 (Ordinance 25 of 1910) (“the\n                    1910 Ordinance”) read as follows: 14.Such decree [of nullity of marriage] may\n                        be made on any of the following grounds:- (a)that the respondent\n                            was impotent at the time of the marriage, and at the time of the\n                            institution of the suit; (b)that the parties are\n                            within the prohibited degrees of consanguinity or affinity whether\n                            natural or legal; (c)that either party\n                            was a lunatic or idiot at the time of the marriage; (d)that the former\n                            husband or wife of either party was living at the time of the marriage,\n                            and the marriage with such former husband or wife was then in\n                            force; (e)that the consent of\n                            either party to the marriage was obtained by force or fraud in any case\n                            in which the marriage might be annulled on this ground by the law of\n                            England; (f)that the marriage is\n                            invalid by the law of the place in which it was\n                        celebrated. 54     The provision just quoted was, presumably,\n                    based on the then English law, although there was no indication – unlike\n                    the present law in Singapore – as to which grounds rendered the marriage\n                    void and which rendered the marriage voidable (for the present law, see\n                    ss 105 and 106, respectively (also, referred to below at[60]and[61],\n                    respectively)). That the provision was based on the then English law is\n                    confirmed by theObjects and Reasonsto the Bill\n                    upon which the 1910 Ordinance was based, where it was stated thus (see theStraits Settlements Government Gazette,\n                    17 June 1910 at p 1369): The object of this Bill is to confer upon the Supreme Court a jurisdiction\n                        in divorce and matrimonial causessimilar to that\n                            exercised by the High Court of Justice in England, subject tothe limitations, relating to the religion, domicile and residence of the\n                        parties and the place of celebration of the marriage ... Appended to the Bill, but not forming part of it, is a Table of Reference\n                        to provisions of the English Acts and of Indian and East African Acts\n                        analogous to the provisions contained in the various clauses of the\n                        Bill. [emphasis added] 55     The relevant proceedings of the Legislative\n                    Council of the Straits Settlements are also instructive. As the then\n                    Attorney-General observed at the first reading of the Bill (seeProceedings of the Legislative Council of the Straits\n                        Settlements 1910at p B82 (19 August\n                    1910)): … The bill is really by way of supplying what appears to be a gap\n                        or hiatus in the legislation of this Colony, and I submit that it is not to\n                        be regarded as in any way a controversial measure, but that the justice and\n                        propriety of introducing a measure on this subject will be admitted by all\n                        members of this Council. In the United Kingdom and other parts of the Empire\n                        and in most other civilised countries some provision of this kind is found\n                        necessary and has long existed. ... It appears to be an anomaly that for\n                        some persons in this Colony there should be no way of relief by divorce from\n                        the difficulties of an unhappy marriage. … This history of this measure is that in 1907, when the measure now known\n                        as “The Courts Ordinance 1907” was before this Council, the\n                        hon’ble and learned member who sits on the other side of the table\n                        (Mr. Fort) observed that it contained\n                        no provision for jurisdiction in divorce cases being exercised by the\n                        Supreme Court. ... The remarks of the hon’ble member on that occasion\n                        received the consideration of the Government, with the result that in the\n                        following year a bill was drafted by Mr. Maxwell, who was then performing the duties of\n                        Attorney-General.He took as his guide the principles of\n                            divorce law as established in England and he also had recourse to a\n                            measure in force in the Protectorate of East Africa, and to the Divorce\n                            Act of British India. ... Reference to the terms of the bill will show that no novelties are\n                        intended to be introduced here and thatthe principles\n                            proposed to be introduced correspond to principles established in\n                            England. … [emphasis added] 56     The Indian Act referred to above appears to be\n                    the Divorce Act  (Act 4 of 1869) (India), in particular, s 19\n                    (with which s 14 of the 1910 Ordinance (reproduced above at[53]) appears to be identical save that s 19\n                    omits the grounds for nullity found in ss 14(e) and (f) of the\n                    1910 Ordinance). Of relevance, too, is the annotation to this Act inThe Unrepealed General Acts of the Governor General in\n                        Council – From 1868 to 1878, both inclusive, vol II\n                    (4th Ed, Calcutta, Superintendent Government Printing, India, 1909) at\n                    p 5, note 1, which reads as follows: This Act extends to India the principal provisions of the [UK] Matrimonial\n                        Causes Act, 1857 ..., as amended by the [UK] Matrimonial Causes Act, 1859\n                        ..., the Matrimonial Causes Act, 1860 ..., and the Matrimonial Causes Act,\n                        1866 ... It also embodies many rulings of Sir Cresswell Cresswell and\n                        Lord Penzance. 57     There were, in fact,furtheramendments in thelocalcontext to the 1910 Ordinance. Section 6 of the Straits Settlements Divorce\n                    (Amendment No 2) Ordinance 1941 (Ordinance 25 of 1941), for example,\n                    amended s 14 (then numbered as s 13) of the 1910 Ordinance (reproduced\n                    above at[53]) to incorporate the new\n                    grounds of nullity of marriage that were introduced in the English context by\n                    the 1937 UK Act (see above at[52]).\n                    The law in Singapore in relation to the various grounds of nullity remained the\n                    same thereafter as those in the English context and were, in fact, re-enacted in\n                    the Women’s Charter when that statute was first promulgated (see theExplanatory Statementto the Women’s\n                    Charter Bill (Bill No 67 of 1960) in theState of\n                        Singapore Government Gazette Supplement1960(17 March 1960) at p 361), which remained the law\n                    in Singapore until the 1980 Amendment Act which, whilst ostensibly based on\n                    the Malaysian Act, was in substance based on the English position after the\n                    enactment of the Nullity of Marriage Act 1971 (c 44) (UK) (“the\n                    1971 UK Act”). Indeed, it is clear that the relevant provisions in\n                    the Malaysian Act themselves had “[adopted] the recommendations of the\n                    England and Wales Law Commission’s Report on Nullity of Marriage”\n                    (see theMalaysian Royal Commission Reportat\n                    p 56). It is to these developments in the English context that our\n                    attention now briefly turns. 58     There was, as mentioned above, a major review\n                    undertaken by the Law Commission for England and Wales that resulted in the\n                    1971 UK Act (see generally the Law Commission,Working\n                        Paper – Nullity of Marriage(Working Paper No 20,\n                    1968) and the Law Commission,Family Law – Report on\n                        Nullity of Marriage(Law Com No 33, 1970) (“the1970 Report”), as well as the\n                    helpful commentaries (on the latter) by Stephen Cretney, “The Nullity of\n                    Marriage Act 1971” (1972) 35 MLR 57 and J C Hall,\n                    “The Nullity of Marriage Act 1971” [1971] CLJ 208). The relevant\n                    provisions (later consolidated as part of the 1973 UK Act) do form, in\n                    fact, the basis of our current provisions in the Act on nullity of marriage. The\n                    1971 UK Act also clarified the law pursuant to suggestions in the1970 Report–inter alia, by making it clear that a lack of\n                    consent ought to render the marriage concerned voidable as well as making it\n                    clear that the effect of a decree of nullity of marriage was to be prospective\n                    inasmuch as the marriage concerned would end as from the date of the decree\n                    absolute. (4)   Our interpretation of ss 112 and 113 of the Act is not\n                inconsistent with the historical rationale for the distinction between void and\n                voidable marriages 59     The historical background to the law on\n                    nullity of marriages tells us that despite the difference inlegal consequencesbetween void and voidable marriages,\n                    there is in fact nothing in the origins of the concept of nullity of marriages\n                    that justifies – in point of general principle and/or logic – the\n                    conclusion that, in construing s 112 of the Act, a division of matrimonial\n                    assets ought only to be effected in relation to voidable marriages, but not in\n                    relation to void marriages. In this regard, we find persuasive the analysis and\n                    logic of Prof Leong set out above (at[41]). We also note the observation of Lord Hodson inRoss Smith(at 329) that “[w]hether the\n                    marriage is void or voidable the question to be determined is always the same,\n                    that is to say, was it or was it not a valid marriage”. 60     As we have noted above (at[48]), the distinction between void and voidable\n                    marriages arose from ahistoricaltussle which\n                    resulted, in turn, in a “division” between civil and canonical\n                    jurisdictions – a “division” that is no longer relevant\n                    today.However, the rationale for, as well as the\n                    result of, such a “division” was not an incoherent one. In\n                    particular,civilimpediments were those which\n                    went tothe very formationof the marriage itself\n                    and, from the perspective of a “division” of jurisdiction, were\n                    appropriate for thecivilsphere as they related\n                    (in the main) to impediments that were moreformalin nature (see also the observation in a leading work that “[t]he real\n                    distinction is not so much between a void marriage and a voidable marriage as\n                    between a voidceremonyand a voidable\n                    marriage” (seeJacksonat\n                    pp 84–85 [emphasis added]; see alsoTolstoyat pp 385–386). Reference may also be made toLeongat p 588 (“The law ofsolemnisationof marriage would not be\n                    complete if there were no sanctions for its breach. The most serious sanction is\n                    that the result is a void marriage,ie, a union\n                    that lacks legal validity. It will not be possible to ensure due compliance with\n                    the statutory requirements of the law ofsolemnisationif not for this most serious sanction for\n                    breach” [emphasis added in bold italics; emphasis in italics in\n                    original]) andOngat p 278). And, from the\n                    perspective oflegal result, treating marriages\n                    that do not comply with the requirements for solemnisation asvoid(as opposed tobeingvoidable) was also both logical and commonsensical. Hence, where the veryceremonyitself was flawed, there was\n                    justification in treating the marriage itself as beingvoid\n                        abinitio– as being fatally\n                    flawed, so to speak, right fromits outset. So,\n                    also, there was similar justification in treating the marriage concerned as\n                    beingvoid abinitiowhere one of the parties wasalready marriedat\n                    the time the marriage purportedly took place. Indeed, legal impediments of this\n                    natureare now embodied, statutorily, withins 105 of the Act(which\n                    encompasses not only invalid ceremonies of marriage but also other formal\n                    matters such as non-age and prohibited degrees). Section 105 of the Act\n                    itself reads as follows: Grounds on which marriage is\n                            void 105.A marriage which takes place after 1st June 1981\n                        shall be void on the following grounds only: (a) that it is not a valid marriage\n                            by virtue of sections 3(4), 5, 9, 10, 11, 12 and 22; or (b) where the marriage\n                            was celebrated outside Singapore, that the marriage is\n                            invalid — (i) for lack of capacity; or (ii) by the law of the place in which it was\n                                celebrated. 61     Incontrast,\n                    however, thecanonicalimpediments, whilst\n                    impacting the status of the marriage concerned, were nevertheless of a somewhat\n                    different cast. In particular, none would benecessarilyknown at the time the parties entered into their\n                    marriage and therefore wouldnot necessarilygo\n                    towards theformationof the marriage as such (as\n                    a learned author observed, “the grounds on which a marriage is voidable\n                    may even be supervening causes, and none affect the validity of the marriage at\n                    its inception” (seeOngat p 278)).\n                    Looked at in this light, such impediments were, understandably,\n                    “allotted” to the ecclesiastical courts (as opposed to the royal\n                    courts). Hence, for example, where the marriage cannot be consummated owing to\n                    the incapacity of one party or to the refusal by one party to consummate the\n                    marriage, or where there is some other incapacity on the part of one of the\n                    parties (such as the absence of valid consent, the presence of mental disorder\n                    or venereal disease of a communicable nature, or being pregnant by some person\n                    other than the petitioner), the marriage concerned is rendered null and voidonly at the option of the petitioneronce he or she is aware of the impediment concerned, not\n                    least because, as just mentioned, these impediments willnot\n                        necessarilygo towards theformationof the marriage. Significantly, once again, this\n                    particular situation isin fact embodied, statutorily, withins 106of\n                        the Act.Section 106 of the Act reads as follows: Grounds on which marriage is\n                            voidable 106.A marriage which takes place after 1st June\n                        1981 shall be voidable on the following grounds only: (a) that the marriage has not been\n                            consummated owing to the incapacity of either party to consummate\n                            it; (b) that the marriage has not been\n                            consummated owing to the wilful refusal of the defendant to consummate\n                            it; (c) that either party to the\n                            marriage did not validly consent to it, whether in consequence of\n                            duress, mistake, mental disorder or otherwise; (d) that at the time of the\n                            marriage either party, though capable of giving a valid consent, was\n                            suffering (whether continuously or intermittently) from mental disorder\n                            within the meaning of the Mental Health (Care and Treatment) Act 2008 of\n                            such a kind or to such an extent as to be unfit for marriage; (e) that at the time of the\n                            marriage the defendant was suffering from venereal disease in a\n                            communicable form; (f) that at the time of the\n                            marriage the defendant was pregnant by some person other than the\n                            plaintiff. 62     However, it is important to emphasise a point\n                    alluded to earlier – that there is nothing in the analysis in the\n                    preceding two paragraphs which militates against permitting the court to divide\n                    the matrimonial assets between the parties in the situation of avoidmarriage (as opposed to avoidablemarriage). Hence,even the\n                        historical backgrounddoesnotdetract from the construction of s 112 of the Act that we have adopted in\n                    the present judgment. And we would add that there isalsono reason in principle why the court should not be given\n                    the power (pursuant to s 113 of the Act) to award the wife maintenance even\n                    in the situation of avoidmarriage (again, as\n                    opposed to avoidablemarriage). 63     We now turn to consider – in the\n                    briefest of fashions – why general policy and principlealso supportthe construction that we have adopted with regard\n                    to ss 112 and 113 of the Act. General policy and principle 64     We have, in fact, already touched on why the\n                    construction we have adopted is consistent with the general policy underlying\n                    the division of matrimonial assets as well as of maintenance to the wife\n                    pursuant to ss 112 and 113, respectively, of the Act. To recapitulate,\n                    there is nothing in the historical development of the law relating to nullity of\n                    marriage which militates against the courts being granted the powers in these\n                    specific areas. It is therefore not surprising that the Singapore Parliament\n                    intentionally conferred these powers, which were in fact absent in the 1980\n                    Bill, by the insertion of references to “nullity of marriage” in\n                    the respective provisions. That this was a deliberate and intentional act by\n                    Parliament has already been demonstrated by reference to the relevant materials\n                    (in particular, the Select Committee proceedings). 65     Turning to the approach fromprinciple, it also seems to us that, in so far as the\n                    division of matrimonial assets is concerned, there is – having regard to\n                    the broad brush approach which has been well-established by the relevant local\n                    case law – a strong case to be made out in favour of treating s 112\n                    of the Act as covering the entire spectrum of nullity (viz, both voidableas well asvoid\n                    marriages). Put simply, there is sufficient flexibility within the broad brush\n                    approach so that, in the situation of avoidmarriage in which the factual circumstances are such as to make it just and\n                    equitable that a particular spouse be given a low or (in extreme circumstances\n                    such as where the marriage is an exceedingly short one) little or no proportion\n                    of the matrimonial assets. This is, of course, wholly consistent with the broad\n                    brush approach just mentioned. 66     Secondly, if the approach of the Judge in the\n                    court below is adopted, there is nothing precluding the spouse in avoidmarriage to nevertheless have recourse tothe general law(a point that was also referred to by\n                    the Judge himself (see the Judgment at [15]). We do not see how this can improve either the efficiency\n                    or quality of justice on both a general level and as between the parties. From\n                    the perspective of principle, the broad brush approach adopted in s 112 of\n                    the Act with a view towards the attainment of a just and equitable distribution\n                    of matrimonial assets between the parties is the most appropriate one,\n                    particularly when viewed in the matrimonial context, and (more importantly for\n                    the purposes of this appeal) is eminently suitable with respect tovoidmarriages as well as voidable\n                marriages. Summary 67     It is clear, fromeveryaspect (viz, legislative\n                    intention, logic, language, history as well as general policy and principle),\n                    that the phrase “nullity of marriage” in ss 112 and 113 of\n                    the Act encompassesbothvoidandvoidable marriages. It followed from our decision (and as\n                    the Appellant had submitted) that the case should be remitted to the second\n                    District Judge to decide the issues of both the division of matrimonial assets\n                    as well as that of maintenance on their merits.",
        "Conclusion": "68     For all these reasons, we allowed the appeal\n                    with costs and the usual consequential orders.  [note: 1]Appellant’s Core Bundle\n                                (“ACB”) Vol I at\n                        p 5. [note: 2]ACB Vol II at p 17. [note: 3]ACB Vol II at\n                            p 18. [note: 4]ACB Vol I at\n                    p 6. [note: 5]ACB Vol II at\n                    p 18. [note: 6]ACB Vol II at\n                                pp 8–9. [note: 7]ACB Vol II at\n                            p 23. [note: 8]ACB Vol II at\n                            p 24. [note: 9]ACB\n                                    Vol II at p 31. [note: 10]ACB Vol II at\n                                    pp 31–32. [note: 11]ACB\n                                Vol II at p 49. [note: 12]ACB\n                                Vol 1 at p 7. [note: 13]See the Notice of Appeal (ROA\n                                Vol II at\n                pp 4–5). [note: 14]Certified\n                                Transcript of proceedings on 4 March 2010 at\n                                pp 1–2. [note: 15]Appellant’s Case (“AC”) at\n                                        [43]–[47]. [note: 16]AC at [48]–[62]. [note: 17]AC at [55]. [note: 18]AC at\n                                        [63]. [note: 19]AC at\n                                    pp 37–40; 45–49. [note: 20]AC at\n                                    pp 41–44;\n                        49–54. [note: 21]AC at\n                                    [71]. [note: 22]AC at\n                    [72]–[73]. [note: 23]AC at\n                                    [74]. [note: 24]AC at\n                [80]. [note: 25]Affidavit of Guy Bte Ghazali dated\n                                25 July 2011 at [11]. [note: 26]Minute Sheet of Woo Bih Li J\n                                dated 5 August 2011. [note: 27]Minute\n                                Sheet of Steven Chong J dated 26 August\n                            2011. [note: 28]Minute Sheet of the Court of Appeal dated 18 October\n                                2011. [note: 29]Ibid. [note: 30]Ibid. [note: 31]Ibid. [note: 32]AC at [33]. [note: 33]ACB Vol II at\n                            p 31. [note: 34]ACB Vol II at p 32."
    }
}