{
    "case_title": "Azman bin Mohamed Sanwan\n      v\n      Public Prosecutor",
    "ncitation": "[2012] SGCA 19",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This is an appeal brought by Azman bin Mohamed\n                    Sanwan (“the Appellant”) against the decision of a High Court\n                    judge (“the Trial Judge”) convicting him of a capital charge\n                    brought under the Misuse of Drugs Act (Cap 185, 2001 Rev\n                        Ed)[note: 1](“the MDA\n                    (2001 Ed)”) while acquitting his two co-accused, namely, Tamil\n                    Salvem (“Tamil”) and Balasubramaniam s/o Murugesan\n                    (“Bala”), of the same capital charge (seePublic Prosecutor v Azman bin Mohamed Sanwan and others[2010]\n                    SGHC 196 (“the Judgment”)). That charge reads as\n                        follows:[note: 2] YOU ARE CHARGEDat the instance of the\n                        Attorney-General as Public Prosecutor and the charges against you\n                        are: That you,1) AZMAN BIN MOHAMED SANWAN 2) TAMIL SALVEM 3) BALASUBRAMANIAM S/O MURUGESAN on the 28th day of April 2007 at or about 8.20 a.m., at the\n                        carpark in front of Block 108 Yishun Ring Road, Singapore, in\n                        furtherance of the common intention of the three of you, did traffic in a\n                        controlled drug specified as a Class “A” Controlled Drug\n                        listed in the First Schedule to the Misuse of Drugs Act (Chapter 185),\n                        to wit, by having in your possession for the purpose of trafficking,1525.7 grams of cannabis, in motor vehicle\n                        bearing the registration number SGT 809X, without any authorisation\n                        under the said Act or the regulations made thereunder, and you have thereby\n                        committed an offence under section 5(1)(a) read with section 5(2)\n                        of the Misuse of Drugs Act, read with section 34 of the Penal Code,\n                        Chapter 224, and punishable under section 33 of the Misuse of\n                        Drugs Act. [emphasis in bold in original] 2       Having heard the submissions for the appeal, we\n                    reserved judgment and now deliver our judgment.",
        "The background facts": "3       The arrest of the Appellant, Tamil and Bala was\n                    made on 28 April 2007 at the car park in front of Block 108 Yishun\n                    Ring Road (“the Yishun car park”). The Appellant, Tamil and Bala\n                    were friends. At the time of the arrest, the Appellant was running an operation\n                    of collecting carton boxes at Tekka Market for a living, while Bala was\n                    operating a shop in the same vicinity. Tamil had been released from a Singapore\n                    prison almost a year earlier and had no settled occupation. 4       On 27 April 2007, the Appellant, Tamil and\n                    Bala, together with three other friends (viz,\n                    Sundrammurthy s/o Vellasamy (“Sundrammurthy”),\n                    Sundrammurthy’s brother, Kumaran s/o Vellasamy (“Kumaran”),\n                    and Kumaranathan s/o Silvasamy (“Kumar”)), met in Johor Bahru for\n                    a night of drinks and karaoke. Their means of transport from Singapore to Johor\n                    Bahru for the night out were two motor vehicles: a blue Mitsubishi Lancer motor\n                    car bearing vehicle registration number SGT 809 X rented by the\n                    Appellant one month before his arrest,[note: 3]and a black Honda\n                    Civic motor car bearing vehicle registration number SCQ 143 X owned by\n                        Sundrammurthy.[note: 4]According to the Appellant, all six\n                    persons stayed at a karaoke lounge in Johor Bahru until around 6.30am the\n                    following morning (ie, the morning of\n                    28 April 2007). All six persons returned to Singapore at around 7.25am that\n                    same morning[note: 5]in the two said cars without any\n                    incident at the Singapore customs checkpoint. At the time, the Appellant was\n                    driving SGT 809 X (with Bala and Tamil as passengers), while\n                    Sundrammurthy was driving SCQ 143 X (with Kumaran and Kumar as\n                    passengers). 5       Upon returning to Singapore on 28 April\n                    2007, the drivers of the two cars drove directly to the Yishun car park. Upon\n                    reaching the Yishun car park at around 7.55am, Sundrammurthy handed the keys to\n                    SCQ 143 X over to Tamil, who, according to the Appellant, had borrowed\n                    SCQ 143 X from Sundrammurthy.[note: 6]Sundrammurthy,\n                    Kumaran and Kumar were then given a lift in SGT 809 X by the Appellant\n                    and dropped off at a nearby main road. Bala was also present in\n                    SGT 809 X during the drop-off. Tamil alone stayed behind at the Yishun\n                    car park while the drop-off was taking place. 6       The events that followed were observed by\n                    several Central Narcotics Bureau (“CNB”) officers (“the CNB\n                    surveillance officers”), who had secretly been keeping the party under\n                    surveillance from the time the two cars entered Singapore on the morning of\n                    28 April 2007. The Appellant and Bala returned to the Yishun car park in\n                    SGT 809 X after Sundrammurthy, Kumaran and Kumar were dropped off at\n                    the nearby main road. Upon their return, both SGT 809 X and\n                    SCQ 143 X were shifted such that they were parked next to each other\n                    at the Yishun car park. The Appellant, Tamil and Bala then remained in close\n                    proximity of the two cars for some time, during which the Appellant was seen\n                    revving up the engine of SCQ 143 X several times. The CNB surveillance\n                    officers testified that smoke appeared to have been emitted from the exhaust\n                    pipe of SCQ 143 X while the Appellant was revving up the engine.\n                    Thereafter, the Appellant joined Tamil and Bala at the rear of\n                    SCQ 143 X. All three persons were seen meddling with the boot and the\n                    rear bumper of SCQ 143 X where the smoke-emitting exhaust pipe was\n                    situated. The Appellant was then observed moving over to SGT 809 X,\n                    opening its boot, taking out a blue paper bag and bringing the paper bag to the\n                    rear of SCQ 143 X. The three men continued meddling with the rear\n                    bumper of SCQ 143 X. A while later, Bala was seen retrieving from the\n                    underside of the rear bumper of SCQ 143 X what appeared to be a\n                    dark-coloured bundle. Shortly thereafter, all three men stood up and the\n                    Appellant was observed carrying a blue paper bag similar to the one he had\n                    earlier taken out from the boot of SGT 809 X. He brought the bag to\n                    SGT 809 X and closed the boots of both cars. The Appellant then hugged\n                    Tamil and Bala in turn before entering SGT 809 X alone. At that point,\n                    the CNB surveillance officers moved in and arrested all three men. 7       After the arrest was made, the boot of\n                    SGT 809 X was opened and a blue paper bag was found lying inside.\n                    Inside the blue paper bag were two bundles – one bigger than the other\n                    – covered in black plastic wrapping. The contents of the two bundles were\n                    sent for analysis at the Health Sciences Authority (“the HSA”),\n                    and the larger bundle was found to contain 1,525.7g of cannabis. The actual\n                    contents of the smaller bundle were immaterial to the charge tried in the court\n                    below and no finding was made in relation to those contents. 8       The Appellant, Tamil and Bala were jointly\n                    charged with as well as jointly tried for the offence of drug trafficking under\n                        s 5(1)(a) read with s 5(2) of the\n                    MDA (2001 Ed). The trial of the three men lasted for a total of 26 days, in\n                    the course of which twovoirdires, each lasting two days, were held. Thevoirdiresconcerned the\n                    admissibility of two self-inculpatory statements given by the Appellant on,\n                    respectively, 20 August 2007 and 16 October 2007 to an investigating\n                    officer, Assistant Superintendent Adam Tan (“the IO”), while being\n                    held in custody at Queenstown Remand Prison. The statement made on\n                    20 August 2007 was marked as “P132”[note: 7]and that made on\n                    16 October 2007 was marked as “P97”[note: 8](it should also be noted\n                    that P97 was the last in a series of statements made by the Appellant between\n                    30 April 2007 and 16 October 2007). The contents of P132 and P97 are\n                    reproduced below at[17]and[18]respectively. 9       In thevoirdires, the Appellant made several\n                    serious allegations against the IO, who was the recorder of both P132 and P97.\n                    The Appellant claimed that the IO had, in an interview at the Alpha Division\n                    lock-up interview room in the Police Cantonment Complex on 9 May 2007,\n                    threatened to implicate the Appellant’s wife if the Appellant refused to\n                    co-operate with the CNB. In particular, the Appellant claimed that the IO had\n                    specifically brought up the subject of an account book seized from the\n                    Appellant’s residence during the CNB’s investigations.[note: 9]The\n                    account book, which bore the handwriting of the Appellant’s wife, was, by\n                    the Appellant’s own admission, used to keep records of a loan shark\n                    business which the Appellant was helping his brother-in-law, one Kannan s/o\n                    Subramaniam, with at the time.[note: 10]The Appellant\n                    claimed that the IO had warned him that with that account book, the IO\n                    “can pull my [ie, the Appellant’s]\n                    wife also”.[note: 11]When asked by his counsel\n                    to explain what he meant by the phrase “pull my wife also”, the\n                    Appellant replied saying, “[the IO] claims that the content [of the\n                    account book] … can prove to the Court that my wife [was] also involved\n                    in the drugs”.[note: 12]This threat was allegedly\n                    made again on 20 August 2007, when the IO, together with an interpreter,\n                    Sofia binte Sufri (“the Interpreter”), visited the Appellant at\n                    Queenstown Remand Prison for the purpose of serving an additional charge of\n                    trafficking in ecstasy (“the ecstasy charge”) on him.[note: 13]The Appellant further\n                    alleged that the IO had also promised him that he would be spared from the death\n                    penalty if he co-operated in the IO’s investigations.[note: 14]That\n                    was when the Appellant started responding to questions relating to his arrest\n                    which were put to him by the IO on 20 August 2007. The brief contents of\n                    the conversation were recorded later on that same day in the IO’s field\n                    book outside Queenstown Remand Prison, and were subsequently sought to be\n                    admitted in court by the Prosecution as P132. The Appellant further claimed that\n                    the IO again mentioned the aforesaid threat and promise on a subsequent visit on\n                    16 October 2007, whereupon the Appellant finally caved in and made the\n                    self-inculpatory statement which was P97.[note: 15] 10     After hearing all the evidence given and the\n                    submissions made by the parties in eachvoir dire,\n                    the Trial Judge ruled that P132 and P97 had not been procured by inducement,\n                    threat or promise and were thus admissible. The Trial Judge’s reasoning in\n                    respect of his decision on the admissibility of P132 is primarily found at\n                    [53]–[56] of the Judgment as follows: 53    When I reviewed the\n                            evidence, it was clear that defence counsel did not elicit any admission\n                            from [the IO] or [the Interpreter] that any inducement, threat or\n                            promise was issued or made which led [the Appellant] to make the\n                            statement which [the IO] recorded in his field book [ie, P132]. 54    [The Appellant’s] evidence … was that [the IO] had warned\n                            him on 9 May 2007 that his wife may be involved with the drugs\n                            because she made entries in the book that was seized, and [the IO]\n                            advised him to think about that. When [the IO] saw him again on\n                            20 August 2007 with [the Interpreter], [the IO] told him that if he\n                            co-operated and gave information against the two co-accused, he may not\n                            have to face the death penalty and his wife will not be charged and he\n                            co-operated with [the IO] by telling him about his involvement and that\n                            of the co-accused and his brother-in-law. He went on to add\n                        that: (i)    [the IO] did not ask him to give a written\n                                statement; (ii)   he did not believe that the accounts book\n                                will link his wife to the drugs and he was not worried over that;\n                                and (iii)   he believed that if he co-operated, he would\n                                not face the death penalty. 55    His evidence that after he co-operated and gave\n                            [the IO] the information, [the IO] did not ask him to give a written\n                            statement challenged belief. If [the IO] wanted his co-operation and he\n                            co-operated, it would be natural and logical for [the IO] to ask him to\n                            make a signed statement. 56I found that there was no\n                                credible evidence that [the Appellant] had made the oral statement\n                                to [the IO] as a result of the alleged threat and\n                                promise.I therefore ruled that the statement was a\n                            voluntary statement and admitted it in evidence. … [emphasis added] As for the Trial Judge’s reasons for ruling that P97 was\n                    admissible, they are contained in [72]–[76] of the Judgment as\n                    follows: 72    The defence did not call [the Appellant’s]\n                            wife or his lawyer as witnesses in the secondvoir\n                                dire. Consequently, the evidence that she had informed\n                            [the IO] that [the Appellant] wanted to see him, and the evidence that\n                            [the Appellant] had told his wife about [the IO’s] promise were\n                            hearsay in the first instance and uncorroborated in the\n                        second. 73    [The Appellant’s] contention that by\n                            16 October 2007, he believed that his wife may be implicated with\n                            the drugs because [the IO] had requested his wife to see him did not\n                            further his claim that [the IO] had threatened to implicate his wife.\n                            All [the Appellant] had said was that his wife told him of that request,\n                            and he feared that [the IO] was going to take action against her. By\n                            [the Appellant’s] own evidence no threat [was] issued by [the IO].\n                            With no fresh threat, we are left with the original threat to implicate\n                            his wife and the promise not to implicate her, and to reduce the charge\n                            against him if he co-operated. 74    There were substantial differences in the\n                            narrations of the events of 16 October 2007. The\n                            prosecution’s case was that [the IO] wanted to inform [the\n                            Appellant] of [certain] DNA findings. While [the IO’s] evidence\n                            was corroborated by [the Interpreter], [the Appellant’s] evidence\n                            was not backed up by his wife or his lawyer. 75    The prosecution’s evidence was that after the\n                            statement [viz, P97] was recorded, it was\n                            read back to [the Appellant] in Malay, and he also read it himself. [The\n                            Appellant’s] evidence was that it was not only not read back to\n                            him, he did not have the opportunity to read it himself, he did not ask\n                            to read it, and he was content to sign it without knowing its contents.\n                            I find this difficult to understand and accept. If he had signed the\n                            statement as his part of the bargain with [the IO], there was no reason\n                            for [the IO] not to have the statement read to him or to allow him to\n                            read it. In each of the five earlier signed statements he made to [the\n                            IO] it was recorded that the statement was read back to him, and [the\n                            Appellant] had not denied that. 76On a review of the evidence, I\n                                found the evidence of [the IO] and [the Interpreter] consistent and\n                                credible, but not the evidence of [the Appellant].Accordingly, I found that the statement [the Appellant] made was\n                            voluntarily [made] without any inducement, threat or promise, and I\n                            admitted it in evidence. [emphasis added] 11     The Trial Judge ultimately found the Appellant\n                    guilty of the offence charged, observinginter\n                        alia(at [126] of the Judgment): In the final analysis, there was an abundance of evidence against [the\n                        Appellant]. They came in the way of direct evidence and [unrebutted]\n                        presumptions [under ss 17, 18(1), 18(2) and 21 of the MDA\n                        (2001 Ed)]. The direct evidence was in the [CNB] surveillance\n                        officers’ evidence that he took the blue paper bag to his car and his\n                        admission [in P97] that his job was to sell the drugs in Singapore. This was\n                        proof of his possession of the cannabis for the purpose of\n                        trafficking. For completeness, we also set out below the Trial Judge’s\n                    reasoning on the statutory presumptions which he applied against the Appellant\n                    (at [121] and [127] of the Judgment): 121    [The\n                            Appellant’s] defence was that he had not brought the blue paper\n                            bag from SGT 809 X to SCQ 143 X, and then from\n                            SCQ 143 X to SGT 809 X after the bundles were\n                            retrieved by Bala, and he denied any knowledge of or dealing with the\n                            bag and its contents. However, given that the cannabis was recovered\n                            from SGT 809 X and that he was in possession and control of\n                            the car, there is a presumption under s 18(1) of the MDA\n                            [(2001 Ed)] that: Any person who is proved to have had in his possession or\n                            custody or under his control — (a)    anything containing a controlled\n                                    drug; (b)    the keys of anything containing a\n                                    controlled drug; (c)    the keys of any place or premises or any\n                                    part thereof in which a controlled drug is found;\n                                or (d)    a document of title relating to a\n                                    controlled drug or any other document intended for the delivery\n                                    of a controlled drug, shall, until the contrary is proved, be presumed to have had that drug\n                            in his possession. and under s 21 where: If any controlled drug is found in any vehicle, it shall be presumed,\n                            until the contrary is proved, to be in the possession of the owner of\n                            the vehicle and of the person in charge of the vehicle for the time\n                            being. There is also a presumption that he knew of the nature of the\n                        drugs as s 18(2) provides that: Any person who is proved or presumed to have had a controlled drug in\n                            his possession shall, until the contrary is proved, be presumed to have\n                            known the nature of that drug. and both presumptions were not rebutted. … 127    In addition to that, there is also a presumption\n                            under s 17 of the MDA [(2001 Ed)] that [the Appellant] had the\n                            cannabis in his possession for the purpose of trafficking, which was not\n                            rebutted. 12     Dissatisfied with the Trial Judge’s\n                    verdict, the Appellant appealed against his conviction and\n                sentence.",
        "The hearing of the appeal": "13     Before us, the Appellant’s counsel,\n                    Mr Amolat Singh, mounted, at the outset, a root-and-branch criticism of the\n                    Trial Judge’s decision below. His contentions included the following:\n                    (a) the Trial Judge erred in accepting entirely the CNB surveillance\n                    officers’ account (as set out at[6]above) of what happened at the Yishun car park at the material time;\n                    (b) the contents of two contemporaneous statements given by the Appellant\n                    very shortly after his arrest (referred to hereafter as\n                        “P86A”[note: 16]and\n                        “P86B”[note: 17]respectively) were\n                    selectively recorded by one Station Inspector Ngo Hing Wong and were therefore\n                    inaccurate; and (c) the Trial Judge erred in concluding, pursuant to the\n                    statutory presumptions in ss 18(1) and 21 of the MDA (2001 Ed), that\n                    as the cannabis was recovered from a motor car rented by the Appellant and\n                    driven by him at the material time (viz,\n                    SGT 809 X), he was presumed to have had that drug in his possession.\n                    However, as the hearing of the appeal progressed in response to our queries, the\n                    following began to emerge as the crucial issue that went to the heart of this\n                    appeal – whether the two self-inculpatory statements given by the\n                    Appellant to the IO while in remand at Queenstown Remand Prison (ie, P97 and P132), for which thevoirdireswere conducted at the trial\n                    below, were made voluntarily without any inducement, threat or promise by the\n                    IO. 14     During the hearing of the appeal, we informed\n                    the Appellant’s counsel and the Prosecution that we considered this to be\n                    the pivotal issue because if the evidence contained in P97 and P132 were\n                    excluded, the Appellant’s conviction would then factually rest on shaky\n                    grounds, given that there was a palpable lack of direct and concrete evidence\n                    against the Appellant apart from P97 and P132. In its response, the Prosecution\n                    argued that the Appellant would still fail to discharge his burden of proof in\n                    rebutting the presumptions of possession and knowledge under the MDA\n                    (2001 Ed) even if P97 and P132 were ultimately ruled to be\n                    inadmissible.",
        "Our analysis and decision": "",
        "The admissibility of P97 and P132": "15     The legislative provision that governs the\n                    admissibility of P97 and P132 (which are not cautioned statements embraced by\n                    s 122 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed)) is\n                    s 24 of the Evidence Act (Cap 97, 1997 Rev Ed), which was\n                    repealed on 2 January 2011 following the enactment of the Criminal\n                    Procedure Code 2010 (Act 15 of 2010). In order to fully appreciate the\n                    context of our decision on the admissibility of P97 and P132 under the relevant\n                    legislative provision, it is necessary for us to first elaborate in greater\n                    detail on the circumstances that gave rise to those statements. 16     As mentioned earlier, the Appellant, Tamil and\n                    Bala were arrested on 28 April 2007. The IO was appointed shortly\n                    thereafter to investigate the matter, and cautioned statements in relation to\n                    the arrest were taken from the Appellant, Tamil and Bala (see the Judgment at\n                    [37]–[38]). Subsequently, after investigations had apparently been\n                    completed, the IO visited the Appellant on 20 August 2007 at Queenstown\n                    Remand Prison purportedly to serve on him the ecstasy charge, which stemmed from\n                    the same events that led to his arrest on 28 April 2007. The ecstasy charge\n                    reads: You Azman Bin Mohamed Sanwan M/35 YEARS DOB: 12/11/1971 NRIC No. S7147760F are charged that you on 28 April 2007 at about 08.20 a.m.,\n                        together with one Balasubramaniam s/o Murugesan [Nric No.] [xxx] and one\n                        Tamil Salvem Nric No. [xxx], at the carpark in front of Blk 108\n                        Yishun Ring Road, in furtherance of [the] common intention of the three of\n                        you, did traffic in a controlled drug specified as a\n                        Class “A” Controlled Drug listed in The First Schedule to\n                        the Misuse of Drugs Act Chapter 185, to wit, by having in your\n                        possession for the purpose of trafficking, 500 light grey tablets believed\n                        to contain N,a-dimethyl-3,4-(methylenedioxy)phenthylamine, in motor vehicle\n                        bearing the vehicle registration number SGT809X, without any authorisation\n                        under the said Act and you have thereby committed an offence under\n                        Section 5(1)(a) read with Section 5(2) of the Misuse of Drugs Act\n                        Chapter 185 read with Section 34 of the Penal Code Cap 224\n                        and punishable under Section 33 of the Misuse of Drugs Act\n                        Chapter 185. [emphasis in bold in original] 17     The IO’s visit on 20 August 2007,\n                    it should be added, took place in the absence of the Appellant’s counsel,\n                    notwithstanding that the Appellant had by then already retained counsel. This\n                    was known to the IO. During the visit, the IO was accompanied by the\n                    Interpreter, who had been tasked to interpret matters arising from the service\n                    of the ecstasy charge. According to the IO, after he served the ecstasy charge\n                    on the Appellant and recorded the Appellant’s cautioned statement, the\n                    Appellant voluntarily offered in the English language to provide him certain\n                    information which, despite the IO’s request, the Appellant steadfastly\n                    refused to be reduced into a signed written statement. All this happened in the\n                    presence of the Interpreter, who gave evidence in court corroborating the\n                    IO’s version of the facts in this particular regard.[note: 18]The IO subsequently\n                    recorded in his field book a summary of the information given by the Appellant\n                    shortly after he (the IO) left the interview room that day. As mentioned at[9]above, the relevant pages of the\n                    IO’s field book were subsequently sought to be admitted by the Prosecution\n                    as P132 at the trial. The material parts of P132 read:[note: 19] … [The Appellant] stated that he has things to say. [The Appellant] was not\n                        willing to commit in a statement. He told me and [the Interpreter] verbally\n                        about his arrest. He said he was willing to plead guilty but he wants lighter sentence. [The\n                        Appellant] also indicated that his Malaysian supplier is one\n                        “Mamin”. [The Appellant] stated that he was doing this to get\n                        his brother-in-law out from prison. His brother-in-law is someone in Johor\n                        Bahru prison currently for drug trafficking. [The Appellant] indicated that\n                        he was the one who coordinated everything. Mamin informed him that the drugs\n                        were in the car while he was driving back. [Bala] then removed the drugs\n                        while [the Appellant] carried the … paper bag to put the drugs.\n                        [Tamil] and [Bala] are involved in smuggling the drugs. [Sundrammurthy],\n                        [Kumar], [Kumaran] are innocent. His [former] car wash helper, Amran is also\n                        involved. 18     Subsequently, on 16 October 2007, the IO\n                    (likewise together with the Interpreter) visited the Appellant again at\n                    Queenstown Remand Prison to, according to the IO, seek clarification on a DNA\n                    analysis report dated 1 October 2007 obtained from the HSA in connection\n                    with the Appellant’s arrest (“the DNA Report”). In the\n                    course of that visit, P97 was recorded by the IO and signed by the Appellant.\n                    Again, inexplicably, the visit was made without notifying the Appellant’s\n                    counsel. We also note that the relevant pages of the IO’s field book\n                    recording this visit were not produced at the trial.[note: 20]P97\n                        reads:[note: 21] 70.    My brother-in-law, Kannan S/o Subramaniam\n                            [(“Kannan”)], was in Sepang Regum Prison for suspected\n                            drugs and guns. His case went to court in Johor. I visit my\n                            brother-in-law quite often about once a week. I sometime go alone or\n                            with my wife. He got out from CPC [ie,\n                            Changi Prison Complex] in 2005. 71.    I knew Rocky [ie,\n                            Tamil] through my brother-in-law and I got to know Bala through\n                            Rocky. 72.    In early this year, January or February, I was at\n                            Kannan’s house in JB celebrating my mother-in-law’s\n                            birthday. We left that night. The next morning or afternoon my\n                            brother-in-law, sister-in-law (Hairun Be) and Khalid Selvam were\n                            arrested. They were arrested for drug and arms offence. 73.    I wanted to get my brother-in-law and\n                            sister-in-law out. I know that it can be done using money to pay the\n                            lawyers and the authorities. Mamin, a Malay Singaporean who is wanted in\n                            Singapore and who is now currently in JB, and Siva, an Indian Malaysian\n                            were the ones who introduced me to drugs. They gave me the connection to\n                            buy the drugs and sell it in Singapore. They also give me the clients in\n                            Singapore. Mamin introduced me to heroin clients. Rocky got me the\n                            cannabis clients. 74.    I got my heroin from Mamin and I got the cannabis\n                            from Siva. I got my Ecstasy tablets from a Chinese man named Richard at\n                            Taman Sentosa. Richard is wanted in Singapore. He is a\n                            Singaporean. 75.    I do not have to pay upfront for the Ecstasy\n                            tablets and heroin. Mamin and Richard gave them to me on credit. I have\n                            to pay Siva the money for the cannabis on delivery. I do not know the\n                            cost of the heroin as I have not paid Mamin yet. The cannabis cost $2500\n                            ringgit for one ‘book’. I was arrested with 2\n                            ‘books’. One ‘book’ is about one kilogram. I\n                            also do not know the cost of the tablets. 76.    For the controlled drugs I was arrested with,\n                            Mamin will plant the drugs. My job is to bring the drugs into Singapore\n                            and sell them in Singapore. Mamin will tell me who to pass and sell the\n                            heroin to in Singapore. 77.    Mamin, upon successfully crossing of the causeway,\n                            will tell me the names of 2 persons I am suppose to deliver the drugs\n                            to. I do not know who these 2 persons are. 78.    I have brought in drugs a few times. The previous\n                            occasions were not big deliveries. After I brought the drugs into\n                            Singapore, Rocky will distribute the cannabis. Amran [an ex-worker of\n                            the Appellant][note: 22]will distribute the heroin for me. 79.    Rocky and Bala assist me to distribute the drugs.\n                            The(y) also help me bring the drugs across. That is all. 19     As mentioned earlier, the Trial Judge was\n                    satisfied, after hearing thevoirdiresconducted in respect of P97 and P132, that there\n                    was no inducement, threat or promise made by the IO when the information\n                    recorded in these two statements was obtained from the Appellant. In our\n                    analysis, however, there are serious doubts about the correctness of the Trial\n                    Judge’s finding for the following reasons. 20     Firstly, P97 and P132 clearly disclose a\n                    confession as defined in s 17(2) of the Evidence Act. These\n                    self-inculpatory statements of the Appellant were obtained by the IO several\n                    months after the Appellant was arrested on 28 April 2007. The timing of\n                    these statements invites keen scrutiny, given that the Appellant had\n                    unequivocally and consistently denied his guilt right from the date of his\n                    arrest. Even more unsettling was the fact that P97 and P132 were obtained at a\n                    time when the CNB’s initial investigations in relation to the\n                    Appellant’s arrest on 28 April 2007 appeared to have been concluded,\n                    as evinced by the fact that the Appellant had already been transferred from the\n                    CNB’s premises to Queenstown Remand Prison for some time by then. In this\n                    regard, the following exchange between this court and the Prosecution in the\n                    course of the hearing of the appeal is highly pertinent:[note: 23] [Court]:… [W]hat is the\n                                            [P]rosecution’s position [in relation to\n                                            interviewing an accused] after the post-counsel\n                                            appointment period.[DPP]:Your Honour, if – if\n                                            the IO had sought the instructions from Chambers\n                                            –[Court]:Yes.[DPP]:– Chambers would\n                                            probably have told him, “Please inform your\n                                            – please inform counsel on record”\n                                            –[Court]:Right. So this was done\n                                            –[DPP]:– “that\n                                            you’ll be seeing the\n                                        client.”[Court]:– without informing\n                                            Chambers?[DPP]:It wasn’t, your\n                                            Honour. This was recorded.The IO\n                                                took it – took it upon – upon\n                                                himself.[Court]:So may I take it that if\n                                            Chambers had been notified, you would have certainly\n                                            advised [the IO] to inform\n                                    counsel?[DPP]:Your Honour, I – I\n                                            would have advised.[emphasis\n                                        added]   21     Secondly, the Prosecution’s explanation\n                    that the IO visited the Appellant on 20 August 2007 with the intention only\n                    of serving the Appellant with the ecstasy charge (which related to the same\n                    incident leading to the Appellant’s arrest on 28 April 2007) is not\n                    entirely satisfactory, given that the Prosecution has accepted that other\n                    non-cannabis charges similarly stemming from the circumstances leading to the\n                    Appellant’s arrest were served on the Appellant prior to his transfer to\n                    Queenstown Remand Prison,ie, while the\n                    CNB’s investigations were still actively ongoing. It is also significant\n                    to note that the particulars of the ecstasy charge were, at the time that charge\n                    was served on the Appellant, still crafted in a fairly tentative and ambulatory\n                    manner, notwithstanding that many months had already elapsed since the\n                    Appellant’s arrest. To recap, the ecstasy charge reads: You Azman Bin Mohamed Sanwan M/35 YEARS DOB: 12/11/1971 NRIC No. S7147760F are charged that you on 28 April 2007 at about 08.20 a.m.,\n                        together with one Balasubramaniam s/o Murugesan [Nric No.] [xxx] and\n                        one Tamil Salvem Nric No. [xxx], at the carpark in front of\n                        Blk 108 Yishun Ring Road, in furtherance of [the] common intention of\n                        the three of you, did traffic in a controlled drug specified as a\n                        Class “A” Controlled Drug listed in The First Schedule to\n                        the Misuse of Drugs Act Chapter 185, to wit, by having in your\n                        possession for the purpose of trafficking, 500 light grey tabletsbelieved to containN,a-dimethyl-3,4-(methylenedioxy)phenthylamine, in motor vehicle bearing the\n                        vehicle registration number SGT809X, without any authorisation under the\n                        said Act and you have thereby committed an offence under\n                        Section 5(1)(a) read with Section 5(2) of the Misuse of Drugs Act\n                        Chapter 185 read with Section 34 of the Penal Code Cap 224\n                        and punishable under Section 33 of the Misuse of Drugs Act\n                        Chapter 185. [emphasis in bold in original; emphasis added in italics] This leaves a real likelihood that the service of the ecstasy charge\n                    so late in time could well have been a pretext by which the IO was trying to\n                    gain access to the Appellant at Queenstown Remand Prison without the knowledge\n                    of the Appellant’s counsel. Why was the IO even attempting to serve a\n                    further non-capital charge on the Appellant at such a late stage? Ordinarily,\n                    when an accused faces a capital charge, the Prosecution will not proceed with\n                    lesser charges at the trial. This is a common-sense practice in view of the\n                    irreversible nature of a conviction on a capital charge. So why did the IO visit\n                    the Appellant at Queenstown Remand Prison on 20 August 2007? No\n                    satisfactory reason was offered by the Prosecution as to why the ecstasy charge\n                    was being preferred so late in the day and why it was necessary to do so. As we\n                    have just mentioned, it appears to us that the service of the ecstasy charge\n                    might not have been the true underlying reason for the IO’s visit to the\n                    Appellant on 20 August 2007. If the IO had indeed not been candid in his\n                    evidence on this issue, there ought to be grave concerns about the credibility\n                    of his (and the Interpreter’s) version of the events which allegedly\n                    transpired during the meeting with the Appellant on 20 August 2007 (and\n                    also during the meeting on 16 October 2007). Unfortunately, the Trial Judge\n                    did not consider this issue at all in coming to his determination that the\n                    contents of P132 and P97 had been voluntarily given by the Appellant (see above\n                    at[10]). 22     Thirdly, the IO’s explanation during the\n                    secondvoir dire[note: 24](which concerned\n                    P97) that he subsequently visited the Appellant again on 16 October 2007\n                    because he needed to clarify certain matters regarding the DNA Report is also\n                    questionable. The Appellant denies that there was any discussion on any DNA\n                    analysis report on 16 October 2007.[note: 25]According to the DNA\n                    Report, traces of the Appellant’s DNA were found on the string of the blue\n                    paper bag containing the two bundles seized by the CNB surveillance officers\n                    after the arrest on 28 April 2007[note: 26](see[7]above). This was the matter which the\n                    IO apparently wanted to ask the Appellant about on 16 October 2007, as can\n                    be seen from the IO’s evidence during the secondvoir\n                        direas follows:[note: 27] … [In] one of the statements that I recorded from [the Appellant]\n                        in the immediate weeks after the arrest[,] … [the Appellant]\n                        indicated that he did not transfer anything between the two vehicles.\n                        … I wanted to know why in the event that if he has not transferred\n                        the drugs, would his DNA be found on the [string of the blue paper\n                        bag]? We are unable to accept the IO’s explanation. As mentioned at[8]above, P97 was the last in a series\n                    of statements made by the Appellant between 30 April 2007 and\n                    16 October 2007. P97 (made on 16 October 2007) consisted of ten\n                    paragraphs numbered as paras 70 to 79, while the preceding paragraphs\n                    (recorded between 30 April 2007 and 8 May 2007) were numbered as\n                    paras 1 to 69 and marked as “P135” to\n                        “P139”[note: 28](these preceding\n                    paragraphs will hereafter be referred to as\n                    “paras 1–69” for short). It can be seen from[18]above that nothing in the ten paragraphs\n                    constituting P97 captured any information from the Appellant relating to the\n                    clarification allegedly sought by the IO. That leaves us with\n                    paras 1–69 to test the veracity of the IO’s explanation above.\n                    From the records we have perused, paras 1–69 were recorded by the IO\n                    on five separate occasions between 30 April 2007 and 8 May 2007\n                    –ie, those paragraphs were recordedbeforethe DNA Report (which was dated 1 October\n                    2007) was available. This meant that the IO could not have posed any questions\n                    to the Appellant on the DNA Report when paras 1–69 were recorded. It\n                    follows that since there was no mention at all of the DNA Report in P97 either,\n                    there is no evidence in writing of the Appellant’s clarification as\n                    regards the IO’s queries on this report, if such queries had indeed been\n                    posed to and answered by the Appellant. If seeking clarification from the\n                    Appellant on the DNA Report was indeed the real reason for the interview on\n                    16 October 2007, it is difficult to understand why the IO did not make any\n                    reference whatsoever to this in writing in P97. This gap in the evidence is\n                    disturbing, to say the least. 23     Fourthly, according to what was recorded in\n                    para 78 of P97 (see[18]above), one\n                    Amran, an ex-worker of the Appellant, was allegedly involved in the drug runs\n                    previously conducted by the Appellant. Paragraph 78 of P97\n                        states:[note: 29] I have brought in drugs a few times. The previous occasions were not big\n                        deliveries. After I brought the drugs into Singapore, Rocky [ie, Tamil] will distribute the cannabis. Amran will\n                        distribute the heroin for me. In P132 too, the IO recorded in his field book that the Appellant said\n                    that Amran was also involved in the circumstances leading to the\n                    Appellant’s arrest on 28 April 2007 (see[17]above). However, despite these references in P97 and P132\n                    implicating Amran, we understand from counsel for the Appellant and the\n                    Prosecution that neither the police nor the CNB has to date taken any legal\n                    action against Amran or summoned him for questioning and/or investigation in\n                    relation to the Appellant’s arrest on 28 April 2007. This, again,\n                    raises other questions. That no steps have been taken to investigate the damning\n                    information against Amran in spite of the glaring references to him in P97 and\n                    P132 defies logic and suggests that the Appellant might not have given these two\n                    statements in the bland manner recounted by the IO and the Interpreter. Why did\n                    the investigators not make further inquiries about Amran (who, according to P97\n                    and P132, was a drug trafficker) if those statements were indeed procured\n                    voluntarily and therefore likely to be credible? 24     Fifthly, the Prosecution’s case has\n                    always been that the contents of P97 and P132 were given by the Appellant\n                    voluntarily in his attempt to persuade the IO to spare him from a capital\n                    charge. That is why – so the Prosecution’s case theory goes –\n                    the Appellant did not accede to the information which he offered during the\n                    IO’s visit on 20 August 2007 being reduced into a signed written\n                    statement despite the IO’s request for that to be done (see[17]above).[note: 30]In\n                    our judgment, if it were indeed true that the Appellant voluntarily offered his\n                    confession (as set out in P132) to the IO on 20 August 2007 in a bid to\n                    bargain for a lighter sentence (to which bargain, the IO responded (so he\n                    testified at the trial), “it’s not within my position to make a\n                    call on this”),[note: 31]there would be no\n                    conceivable reason whatsoever for the Appellant to subsequently have agreed to\n                    the explicit details of his confession being reduced into writing (in the form\n                    of P97) when the IO visited him again on 16 October 2007. From the\n                    Appellant’s perspective, having his confession reduced into writing would\n                    simply have left him without any more bargaining chips if he harboured the hope\n                    of successfully striking a bargain with the authorities on a lighter\n                    sentence. 25     We also note that the Trial Judge found that\n                    “[u]nfortunately [the Interpreter’s] evidence was unclear in parts\n                    as she had not kept notes of the events and was relying on her memory”\n                    (see the Judgment at [46]). We find it highly unsatisfactory that the\n                    Interpreter apparently kept no notes of what transpired on both 20 August\n                    2007 and 16 October 2007 at Queenstown Remand Prison. All interpreters\n                    should independently keep meticulous notes of what transpires in the course of\n                    their duties. This is a common-sense practice that ought to be observed by all\n                    interpreters. In the present case, what can be said is that the\n                    Interpreter’s evidence does not unequivocally support the IO’s\n                    version of events.Finally, we note that in rejecting the\n                        Appellant’s assertions that he had not given P97 and P132 voluntarily,\n                        the Trial Judge did not give any plausible reasons for his\n                        determination. He merely made the following cryptic observations\n                    (which we reproduced earlier at[10]above)\n                    after summarising the evidence: in relation to P132, he found that “there\n                    was no credible evidence that [the Appellant] had made the oral statement to\n                    [the IO] as a result of the alleged threat and promise” (see the Judgment\n                    at [56]), and in relation to P97, he found “the evidence of [the IO] and\n                    [the Interpreter] consistent and credible, but not the evidence of [the\n                    Appellant]” (see the Judgment at [76]). He did not consider the issues\n                    which we analysed above at[20]–[24]. 26     Having regard to the factors set out above, we\n                    are not convinced beyond reasonable doubt that P97 and P132 were obtained\n                    without any inducement, threat or promise from a person in authority. There are\n                    just too many gaps in the Prosecution’s evidence on this aspect of the\n                    case. Accordingly, we rule that P97 and P132 should not have been admitted in\n                    evidence against the Appellant at the trial below. 27     We should also mention, for the sake of\n                    completeness, that it came to our attention from our perusal of the record of\n                    proceedings (in particular, the notes of evidence of thevoir\n                        direconducted in respect of P97) that there was a series of\n                    e-mail communications between the Appellant’s wife and the IO between\n                    October 2007 and April 2008. Among those e-mails, there was one particular\n                    e-mail which the IO acknowledged having sight of,viz, the e-mail in which the Appellant’s wife alleged that\n                    the IO had “made a promise to [the Appellant]”.[note: 32]None of the aforesaid e-mails were\n                    considered by either the Appellant’s counsel or the Trial Judge to be\n                    relevant to the Appellant’s claim of inducement, threat or promise in the\n                    making of P97 and P132. In our view, this is another serious defect in this\n                    case. The aforesaid e-mails could have been helpful in either rebutting or\n                    substantiating the Appellant’s allegations of inducement, threat or\n                    promise in the making of P97 and P132. In view of this serious defect, added to\n                    the troubling concerns that we highlighted at[20]–[25]above, we\n                    find that it would be unsafe to admit in evidence P97 and P132 against the\n                    Appellant.",
        "The evidence without P97 and P132": "28     With P97 and P132 excluded, the question now\n                    turns to whether the Appellant’s conviction can still stand on the basis\n                    of the evidence that remains on record. In this regard, for the reasons stated\n                    at[32]–[35]below, the statutory presumptions of possession and\n                    knowledge under the MDA (2001 Ed) which the Trial Judge applied against the\n                    Appellant (referred to hereafter as “the statutory presumptions of\n                    possession and knowledge” for short) cannot be invoked to fill up the\n                    gaps in the evidence. 29     As mentioned earlier (see[11]above), the Trial Judge was of the view that\n                    there was “an abundance of evidence against [the Appellant] … in\n                    the way of direct evidence and presumptions” (see the Judgment at [126]).\n                    The “direct evidence” was, in the Trial Judge’s view,\n                    “the [CNB] surveillance officers’ evidence that [the Appellant]\n                    took the blue paper bag to his car and his admission [in P97] that his job was\n                    to sell the drugs in Singapore” (see the Judgment at [126]). Putting\n                    aside the statutory presumptions of possession and knowledge for the moment and\n                    having regard to our decision to exclude P97 and P132 from the evidence, we do\n                    not accept that the CNB surveillance officers’ testimonies (as set out at[6]above)alonecould have secured the Appellant’s conviction in the\n                    court below. In our analysis, the CNB surveillance officers’ evidence is\n                    by no means “direct evidence” of such a degree of conclusiveness\n                    as to establish the Appellant’s guilt on the criminal standard of proof,\n                    that is, beyond reasonable doubt. Suffice it for us to state that the CNB\n                    surveillance officers’ evidence only goes so far as to show that the\n                    Appellant, with the help of Tamil and Bala, transferred the bundles containing\n                    the drugs from the rear bumper of SCQ 143 X to the boot of\n                    SGT 809 X; nothing in this evidence goes further to show or indicate\n                    the existence of the requisitemensreaon the Appellant’s part for the alleged crime\n                    of drug trafficking. 30     In our view, the contemporaneous statements\n                    P86A and P86B (see[13]above), which were\n                    considered by the Trial Judge in the Judgment at[29]and[32]respectively,\n                    are not sufficient either to support the Appellant’s conviction. P86A\n                        reads:[note: 33] … Q1:What is inside the blue paper bag\n                            “erke” behind the car boot? A1:I don’t know Q2:Whose does it belong to? A2:It’s not mine. I don’t know belong to\n                            who. Q3:Before you got arrested where did you come\n                            from? A3:I came from JB? Q4:Who were with you? A4:Rocky [ie, Tamil]\n                            and Bala in my blue car SGT 809X and Sunder [ie, Sundrammurthy], Kumar and the other guy I\n                            don’t [know] the name it’s Sunder younger brother inside the\n                            black car SCQ 143X. Q5:Where are Sunder, Kumar and Sunder younger\n                            brother? When you all reach Yishun carpark Blk 108 [ie, the Yishun car park]? A5:When I reach the carpark of Blk 108 Yishun I\n                            waited for them at the carpark and then all of them, Sunder, Kumar and\n                            Sunder younger brother go into my car and I send them to outside the\n                            main road. Q6:After that what you do? A6:After that I go back to the car, Rocky asked me to\n                            reverse the black car SCQ 143X. Q7:Who is the driver of the black car\n                            SCQ 143X? A7:Sunder Q8:Do you have anything to add in the\n                            statement. A8:I suspect that the blue paper bag inside contain 2\n                            packet, one is big and the other is small one came from the black\n                            car. Q9:Why you suspect the black car? A9:Because we go JB together. I suspect my friend in\n                            the black car. … As for P86B, it reads:[note: 34] … Q10:Why did you[r] car and the black car had the same\n                            blue colour paper bag? A10:I can remember that we buy the same shoe that why\n                            we got the same paper bag? Q11:Who is your the other friend who buy the same\n                            shoe with you? A11:Rocky [ie,\n                            Tamil] Q12:Did you go to the black car? A12:Yes Q13:Why did you go to the black car? A13:To put the thing one big one and one small\n                            one Q14:What is inside the one big one\n                                and one small one? A14:I really don’t know. Q15:Did anyone ask you to put the\n                                thing inside your car? A15:Rocky ask me to put the one big one and one small one inside my car\n                                boot. … [emphasis added] 31     We find that the evidence contained in P86A\n                    and P86B, far from being sufficient to support the Appellant’s conviction,\n                    is inconclusive in establishing the ingredients of the\n                    crime allegedly committed by the Appellant. Indeed, as can be seen from the\n                    above extracts from those two statements, the Appellant adamantly maintained\n                    that he did not know that the two bundles recovered from the blue paper bag in\n                    the boot of SGT 809 X contained drugs. We should add that another gap\n                    in the Prosecution’s evidence here is the absence of the relevant\n                    handphone records of the Appellant, Tamil and Bala. These records might have\n                    shed some light on the communications between them prior to their arrest and,\n                    hence, their actual knowledge, if any, of the contents of the aforesaid paper\n                    bag. Unfortunately, these records, although addressed in the submissions made at\n                    the trial, were not produced in evidence.[note: 35]",
        "The statutory presumptions of possession and knowledge": "32     As mentioned at[14]above, the Prosecution raised the alternative argument that\n                    in any event, the Appellant would still fail to discharge his burden of proof in\n                    rebutting the statutory presumptions of possession and knowledge. 33     We do not think that these statutory\n                    presumptions can be applied against the Appellant in view of our ruling that P97\n                    and P132 are inadmissible. The reason is that without the evidence contained in\n                    P97 and P132, the Prosecution’s case against the Appellant is now no\n                    different from that against Tamil and, in particular, Bala, both of whom were\n                    acquitted by the Trial Judge with no appeals by the Prosecution therefrom.\n                    Admittedly, the Appellant was, in the words of s 21 of the MDA\n                    (2001 Ed), “in charge of” SGT 809 X –viz, the vehicle in which the cannabis was found\n                    when the Appellant, Tamil and Bala were arrested – at the material time.\n                    However, this was fortuitous in that the evidence at[6]–[7]above shows\n                    that: (a)     the cannabis was initially in\n                        SCQ 143 X, which wasnotunder the\n                        charge of the Appellant at the material time (as mentioned at[5]above, Tamil borrowed SCQ 143 X\n                        from Sundrammurthy upon reaching the Yishun car park on the morning of\n                        28 April 2007); (b)     the cannabis was then moved to SGT 809 X;\n                    and (c)     shortly\n                        thereafter, the Appellant, Tamil and Bala were arrested by the CNB\n                        surveillance officers. If the three men had been arrestedbeforethe cannabis was moved to\n                    SGT 809 X, the presumption of possession under s 21 of the MDA\n                    (2001 Ed) could have been invoked only against Tamil (as the cannabis would\n                    then have been found in SCQ 143 X, which Tamil had borrowed from\n                    Sundrammurthy), but not against the Appellant. Given these circumstances, we do\n                    not think it justifiable to apply that presumption against the Appellant merely\n                    because it so happened that the CNB surveillance officers arrested him (along\n                    with Tamil and Bala) only after the cannabis had been moved to\n                    SGT 809 X. It follows that since the Appellant has neither been proved\n                    nor presumed to have had the cannabis in his possession at the material time,\n                    the presumption of knowledge under s 18(2) of the MDA (2001 Ed) cannot\n                    be invoked against him. In our view (and with respect), the Trial Judge failed\n                    to adequately consider the above facts in assessing whether, in the first place,\n                    the statutory presumptions of possession and knowledge could be applied in the\n                    present case. He merely proceeded on the basis that these presumptions were\n                    applicable and summarily concluded that they had not been rebutted by the\n                    Appellant (see[11]above). No factual\n                    examination was done (apart from making the bald statement that “the\n                    cannabis was recovered from SGT 809 X and … [the Appellant] was\n                    in possession and control of the car” (see [121] of the Judgment)) and no\n                    reasons were given. In these circumstances, we are unable to endorse the\n                    conviction of the Appellant for the capital offence charged against\n                him. 34     In this regard, we would also draw attention\n                    to the reason given by the Trial Judge for acquitting Bala. At [145]–[148]\n                    of the Judgment, it was stated: 145    … [T]here is evidence which I accept that\n                            Bala had taken the bundles of cannabis from the bumper and placed them\n                            in the blue paper bag … and had possession of them during that\n                            short period of time. This brings on the presumption in s 18(1),\n                            and the question whether the presumption was rebutted. 146    There was no evidence that he had actual knowledge\n                            that the bundles contained drugs, or cannabis in particular. Was there\n                            wilful blindness and equated knowledge? One can say that he should have\n                            suspected that there were illicit contents in the bundles, but can it be\n                            said that he should have suspected that the contents were drugs or\n                            cannabis? Did he have the opportunity to allay his suspicions?The events from the retrieval of the bundles in [the] bag\n                                to the arrest took place too quickly for him to make enquiries or to\n                                examine the bundles. 147A finding of wilful blindness\n                                is portentous in that a person with no actual knowledge is equated\n                                with having knowledge. Such a finding should be made only when it is\n                                clear that the person had intentionally and deliberately maintained\n                                his ignorance, in circumstances when a reasonable person would have\n                                suspicions and would have made enquires or take other steps to allay\n                                his suspicions. There must be suspicion and intention; carelessness\n                                or thoughtlessness will not suffice. Against this backdrop, I do not\n                                find wilful blindness against Bala because it cannot be said that he\n                                had suspected that the bundles contained cannabis and had\n                                deliberately suppressed his suspicions. 148    The prosecution has not shown that Bala had actual\n                            or equated knowledge that there was cannabis in the bundles, or that he\n                            was in possession of the cannabis for the purpose of trafficking, and\n                            therefore he is also not guilty of the offence. [emphasis added] 35     Given that the Trial Judge found that there\n                    was insufficient basis for him to apply the statutory presumptions of possession\n                    and knowledge against Bala, the Appellant should not be in any worse position\n                    than Bala – absent the evidence in P97 and P132 – merely because the\n                    Appellant, Tamil and Bala were arrested only after the cannabis had been moved\n                    from SCQ 143 X to SGT 809 X. Wemighthave been more prepared to apply the relevant statutory\n                    presumptions against the Appellant had the cannabis been placed directly in\n                    SGT 809 X from the outset, but that was not the case here. Further,\n                    just as Bala had possession of the cannabis for only a “short period of\n                    time” (see the Judgment at [145]), the position was the samevis-à-visthe Appellant as he (along with Tamil and\n                    Bala) was arrested shortly after the cannabis was moved to SGT 809 X.\n                    It can thus equally be said of the Appellant that, just as in Bala’s case,\n                    “[t]he events from the retrieval of the bundles in [the] bag [ie, the blue paper bag recovered from the boot of\n                    SGT 809 X (see[7]above)] to the\n                    arrest took place too quickly for him to make enquiries or to examine the\n                    bundles” (see the Judgment at [146]). In the circumstances, we see no\n                    reason why the law should find against the Appellant when Tamil and Bala were\n                    acquitted by the Trial Judge. Whatever its reasons might be, the Prosecution has\n                    not appealed against Tamil’s and Bala’s acquittals. We are thus\n                    placed in the difficult position of having to treat those acquittals as correct\n                    in law, and to assess the Appellant’s culpability on precisely the same\n                    evidential scales as those employed by the Trial Judge to acquit Tamil and Bala.\n                    After careful consideration, we cannot say that the evidence on record reveals\n                    that the Appellant is any more culpable than Tamil and Bala (who were both\n                    acquitted), especially given that traces of cannabis were found in Bala’s\n                    urine whereas no trace was found in the Appellant’s urine. We also note\n                    that unlike the Appellant, Tamil has an antecedent. Having said that, we are, as\n                    just mentioned, constrained by the Prosecution’s stance (in not pursuing\n                    appeals in respect of the Trial Judge’s decision to acquit Tamil and Bala)\n                    to deem Tamil’s and Bala’s acquittals correct in law, and,\n                    accordingly, we shall make no further comment in that regard. We would only\n                    mention that the evidence suggests that as between the Appellant, Tamil and\n                    Bala, one or more (or possibly all) of them knew that the blue paper bag\n                    recovered from the boot of SGT 809 X contained cannabis or, at the\n                    very least, some form of controlled drug. However, the evidence againstthe Appellant specificallyis flawed, and we\n                    find it unsafe, based on such evidence, to convict him of the capital charge\n                    brought against him.",
        "Conclusion": "36     For the above reasons, the Appellant succeeds\n                    in his appeal and we hereby set aside his conviction.  [note: 1]The offence which the Appellant was charged with was\n                                allegedly committed on 28 April 2007, before the current\n                                version of the Misuse of Drugs Act (ie, the Misuse of Drugs Act (Cap 185, 2008 Rev\n                                Ed)) came into force. [note: 2]See Record of Proceedings (“RP”)\n                                vol 9, pp 1–2. [note: 3]See RP\n                                vol 9A, p 424. [note: 4]See RP vol 9A,\n                            p 427. [note: 5]See RP vol 9A,\n                        p 507. [note: 6]See RP\n                                vol 9A, p 427. [note: 7]See RP vol 9A,\n                        pp 383–385. [note: 8]See RP vol 9A,\n                        pp 344–348. [note: 9]See RP vol 4, p 1504. [note: 10]See RP\n                                vol 4, p 1505. [note: 11]Ibid. [note: 12]Ibid. [note: 13]See RP vol 5,\n                        pp 1512–1518. [note: 14]See RP vol 5, p 1520. [note: 15]See RP\n                                vol 5, p 1708. [note: 16]See RP vol 9,\n                                pp 296–299 and RP vol 9A, p 300 and\n                                p 302. [note: 17]See RP vol 9A,\n                                pp 300–303. [note: 18]See RP vol 4,\n                        pp 1486–1487. [note: 19]See RP vol 9A,\n                        pp 383–385. [note: 20]See the certified transcript of the oral submissions made at\n                                the hearing of the appeal on 4 March 2011 (“the CA\n                                Transcript”) at p 79 (lines 4–14) and\n                                p 80 (lines 10–19). [note: 21]See RP vol 9A,\n                                pp 344–348. [note: 22]See RP vol 6, p 2061\n                                        and RP vol 9A, p 416. [note: 23]See the CA Transcript at p 66 (line 24) to\n                                p 67 (line 6). [note: 24]See RP\n                                vol 5, p 1623. [note: 25]See RP\n                                vol 5, p 1708\n                        (lines 10–14). [note: 26]See RP\n                                vol 9A, pp 310–314. [note: 27]See RP\n                                vol 5, p 1624\n                        (lines 22–28). [note: 28]See RP vol 9A,\n                                pp 413–431. [note: 29]See RP vol 9A,\n                                pp 345–347. [note: 30]See RP\n                                vol 4, p 1480 (line 24). [note: 31]See RP vol 4, p 1480\n                                (line 28). [note: 32]See RP vol 5, p 1676\n                        (line 24). [note: 33]See RP vol 9,\n                                pp 296–299 and RP vol 9A, p 300 and\n                                p 302. [note: 34]See RP\n                                vol 9A, pp 300–303. [note: 35]See the CA\n                                Transcript at p 46 (line 19) to p 47 (line 4),\n                                and p 63\n                    (lines 7–20)."
    }
}