{
    "case_title": "Thorben Langvad Linneberg\n      v\n      Leong Mei Kuen",
    "ncitation": "[2012] SGCA 61",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       The Appellant was injured in a road traffic accident on 3 June 2009. He had collided with a minibus driven by the Respondent. The Appellant sued the Respondent, claiming damages. 2       In the court below, the trial judge (“the Judge”) found the Appellant 75% contributorily negligent (seeThorbenLangvadLinneberg v Leong Mei Kuen[2012] SGHC 26 (“the GD”)). Dissatisfied with the decision, the Appellant filed the present appeal, arguing that the Respondent had failed to prove any contributory negligence on his (viz, the Appellant’s) part. 3       After hearing the parties’ arguments, we allowed the appeal, holding that the Respondent was 100% liable for the accident. We now set out the detailed grounds for our decision.",
        "Facts": "",
        "Background to the dispute": "4       In brief, the accident took place on Clemenceau Avenue North in the direction towards Cairnhill Road (“the Road”). Clemenceau Avenue North is a dual carriageway with two lanes on each side, with traffic moving in one direction towards Cairnhill Road and on the other towards Newton Circus. It is divided by a continuous white line. Perpendicular to Clemenceau Avenue North and on the side of traffic heading towards Newton Circus is Peck Hay Road. Clemenceau Avenue North and Peck Hay Road form a T-junction uncontrolled by any traffic light. 5       On 3 June 2009 at 3.45pm, the Appellant was travelling on his motorcycle along the right lane of the Road. The Respondent, a school minibus driver, had stopped her minibus (“the minibus”) in order to allow a student to alight. She had stopped the minibus on the left lane of the Road, alongside Flat No 50 of Monk’s Hill Apartments. After the student had alighted, the Respondent drove the minibus from the stationary position on the left lane to the right lane of the Road. This movement of the minibus caused the Appellant to swerve his motorcycle in an attempt to perform an evasive manoeuvre in order to avoid a collision with the minibus. Despite this manoeuvre, the Appellant’s motorcycle collided with the minibus. The Appellant was thrown off the motorcycle and sustained injuries. Other than the Appellant and the Respondent, there were no other witnesses who took the stand in the one day trial. 6       On 24 November 2011, the Respondent pleaded guilty to the offence of inconsiderate driving under s 65(b) of the Road Traffic Act (Cap 276, 2005 Rev Ed) (“the Act”).",
        "Parties’ cases": "7       The Appellant’s case was that the Respondent had failed to prove that he was contributorily negligent. He contended that the Judge gave undue attention to the issue of credibility, and that the Respondent had failed to prove that he (viz, the Appellant) was travelling at an excessive speed at the material time. He also sought to argue that the Judge misapprehended the legal principles when considering the Appellant’s decision to swerve his motorcycle in a bid to avoid a collision. 8       The Respondent’s case was as follows: (a)     The credibility of the parties was a very relevant consideration in the present case; (b)     The Appellant’s evidence before the Judge was conflicted and unclear; (c)     The Judge had the opportunity to observe the demeanour of the witnesses and assess, first-hand, the veracity and quality of their evidence, and her judgment on the credibility of the Appellant, based on both the spoken evidence recorded in court as well as his behaviour and performance on the stand, should not be varied by this court; (d)     The Appellant’s evidence was contrary to the objective evidence; (e)     The Appellant contributed to the accident; and (f)     The Appellant had failed to demonstrate that the Judge’s decision was in any way contrary to the fabric of the evidence presented before the Judge, or that the Judge had taken extraneous factors into consideration (thus rendering her exercise of discretion erroneous).",
        "Decision below": "9       As stated above, the Judge held that the Appellant was liable for the accident to the extent of 75%, with the Respondent bearing 25% liability (see the GD at [28]). 10     The Judge found that the Appellant’s excessive speed and his decision to execute an evasive manoeuvre by overtaking the minibus on the right side were major contributing factors to the collision. The Judge found that the Appellant was “part author for his own plight”, and that the Appellant’s testimony was far from satisfactory. In contrast, the Judge found the Respondent to be a far more candid witness. 11     We turn now to the issues which arose before this court.",
        "Issues before this court": "12     Three main issues were raised before this court. The first was with regard to the Appellant’s alleged lack of credibility. The second was whether the Appellant was travelling at an excessive speed. The third was whether the Appellant was negligent in taking the evasive manoeuvre that he did.",
        "Issue 1: The Appellant’s alleged lack of credibility": "13     First, we address the nature of appellate intervention in relation to a witness’ credibility. In the Singapore High Court decision ofPublic Prosecutor v Wang Ziyi Able[2008] 2 SLR (R) 61, the court set out the two situations where an appellate court has access to the same material as the trial judge and so is in as good a position as the trial court to assess the veracity of the witness’ evidence. The two situations are where the assessment of the witness’ credibility is based on inferences drawn from theinternal consistencyin the content of the witness’ testimony (“the Category 1 Situation”) or theexternal consistencybetween the content of the witness’ evidence and the extrinsic evidence (“the Category 2 Situation”). 14     Further, in the recent decision ofGoh Sin Huat Electrical Pte Ltd v Ho See Jui (trading as Xuanhua Art Gallery) and another[2012] SGCA 32, this court set out its views as to appellate intervention (at [49], [55], but see generally [48]–[55] for a discussion on appellate review of apportionment of liability): The basis for review of findings of fact in the Singapore context has been restated inTat Seng Machine Movers Pte Ltd v Orix Leasing Singapore Ltd[2009] 4 SLR(R) 1101 (“Tat Seng”) at [41] where this Court stated as follows: Given that this appeal largely involves the evaluation of the Judge’s finding of facts below, it is apposite that we remind ourselves of an appellate court’s role with respect to the finding of facts made in the course of a trial. The appellate court’s power of review with respect to finding of facts is limited because the trial judge is generally better placed to assess the veracity and credibility of witnesses, especially where oral evidence is concerned (Seah Ting Soon v Indonesian Tractors Co Pte Ltd[2001] 1 SLR(R) 53 at [22]).However, this rule is not immutable. Where it can be established that the trial judge’s assessment is plainly wrong or against the weight of the evidence, the appellate court can and should overturn any such finding(seeAlagappa Subramanian v Chidambaram s/o Alagappa[2003] SGCA 20 at [13] andJagatheesan s/o Krishnasamy v PP[2006] 4 SLR(R) 45 at [34]–[36]).Furthermore, where a particular finding of fact is not based on the veracity or credibility of the witness, but instead, is based on an inference drawn from the facts or the evaluation of primary facts, the appellate court is in as good a position as the trial judge to undertake that exercise(Tan Chin Seng v Raffles Town Club Pte Ltd[2003] 3 SLR(R) 307 at [54] andHo Soo Fong v Standard Chartered Bank[2007] 2 SLR(R) 181 at [20]). In so doing, the appellate court will evaluate the cogency of the evidence given by the witnesses by testing it against inherent probabilities or against uncontroverted facts (Peh Eng Leng v Pek Eng Leong[1996] 1 SLR(R) 939 at [22]). Thus, a finding of fact is subject to appellate intervention where it is plainly wrong or unjustified by the totality of the evidence (“findings of fact test”). ... We reiterate that the principal objective of the appellate process must be to do justice by correcting plainly wrong decisions. This function, a constitutional responsibility of this Court, is a necessary pre-requisite to ensuring that public confidence in the administration of justice is maintained. A proper balance has therefore to be struck by appellate courts between due deference and undue deference in relation to findings of fact (and apportionment) by trial courts. Arid historical distinctions between correctable errors of law and irretrievable errors of fact no longer resonate.Improvements to the record, such as verbatim transcripts that are electronically recorded, now permit closer appellate review of findings of fact by trial courts.The trial judge’s notes are no longer the only reliable record of what has transpired below. With this development, some of the previously exclusive advantages of triers of fact have shrunk. [emphasis in original; emphasis added in bold italics] 15     With these legal principles in mind, we now set out why we disagreed with the Judge’s assessment of the Appellant’s credibility.",
        "Was the Appellant’s testimony far from satisfactory?": "16     The Judge decided that much turned on the cogency and credibility of the respective testimonies given by the Appellant and the Respondent, considered in the light of the other evidence presented (see the GD at [12]). The Judge found that the Respondent was a far more forthright and credible witness than the Appellant. The Judge found the Appellant to be an evasive witness who had a tendency to give answers that seemed more like afterthoughts than candid responses. Not surprisingly, the Judge found that his testimony was far from satisfactory. The lack of details in the police report 17     The Judge found, first, that the Appellant had ample opportunity to provide a full account of the accident to the police but failed to do so. The lack of details in the police report was contrasted with the detailed affidavit he had filed. In the Judge’s words (see the GD at [13]–[14]): I found the [Respondent] to be a far more forthright and credible witness than the [Appellant]. The [Appellant] was an evasive witness who had a tendency to give answers that seemed more like afterthoughts than candid responses. For example, when asked by Mr Yeo about the lack of detail of the speed he was travelling at, the distance from which he first saw the [Respondent’s] mini-bus and whether the [Respondent] had signalled etc, in the [Appellant’s] police report filed about one month after the accident,he first claimedthat it was because he was merely responding to questions asked by the police officer interviewing him.However, when further pressedby Mr Yeo, the [Appellant] then claimed that it was also due to his condition at that time.He subsequently addedthat the said details were missing as the police interview took place intermittently over a few weeks and seemed like a non-serious discussion, and that he suddenly remembered that the police officer had told him simply to give rough details for the purposes of lodging an insurance report. Whether as a result of prevarication or poor recollection, I found the plaintiff’s testimony to be far from satisfactory. If, as claimed by the [appellant] during trial, he could recall the details of the accident “as it happened yesterday”, the lack of details in the police report, filed a mere one month after the accident, was glaring. [emphasis added in italics and bold italics] 18     In a similar vein, the Judge had said the following in her oral grounds:[note: 1] You see, your client hadevery opportunity, you know, to correct his police report. But all theimportant omissionsthat Mr Yeo says he has not satisfactorily answered them.If the police keep coming back to me in the hospital and keep asking me, such important things, I would have told him if I were in your client’s position but your client didn’t.So it must beand he could not have been going at 50 kilometres per hour in a high performance motorbike. [emphasis added in italics and bold italics] The Respondent’s testimony 19     The Judge decided, on the other hand, that the Respondent was candid because her testimony in court was consistent with her testimony in her police report. Even though the Respondent also provided details that were not in her police report, the Judge appeared to be more accepting toward her evidence. For example, the Respondent testified in court that she had turned on the hazard lights of the minibus, notwithstanding that she did not state the same in her police report. Similarly, she did not state in her police report that she had checked her blind spot, but testified that she did in her Affidavit of Evidence-in-Chief (“AEIC”)[note: 2]and in court.[note: 3] Our analysis of the Appellant’s evidence 20     As the Judge had compared the Appellant’s evidence in court with thedocumentaryevidence,ie, the police report, this fell within the Category 2 Situation (see above at [13]). In addition, the Judge also appeared to compare the internal consistency of the Appellant’s evidence (from her use of terms such as “he first claimed”, “when further pressed”, and “he subsequently added”). This fell within the Category 1 Situation. 21     With respect, we did not agree that the Appellant’s testimony was far from satisfactory. Having had the benefit of perusing the transcripts of proceedings in the court below, it was evident the Appellant was consistent in both the Category 1 and 2 Situations. He was candid in his evidence. What emerged under cross-examination and re-examination were the following answers, which remained constant throughout the Appellant’s testimony: (a)     The “Report of a Traffic Accident” (“Police Report”) lacked details;[note: 4] (b)     The Police Report was not typed up by the Appellant;[note: 5] (c)     The Appellant was answering questions posed to him;[note: 6] (d)     A young police officer came to the hospital a couple of times.[note: 7]When the doctor was attending to the Appellant the officer stated that he would return in a few days.[note: 8]It took the officer a month to obtain the interview;[note: 9] (e)     The contents of the Police Report were given in one sitting, in about 20 minutes. The actual time taken for the officer to ask for information regarding the accident, leaving aside the questions relating to personal particulars, was between 10 and 15 minutes;[note: 10] (f)     The details such as the speed and the relative distances between the vehicles and the attempts to use the brakes were important details;[note: 11] (g)     These details should have been in the Police Report,[note: 12]but were not reflected therein; because the police officers did not ask the Appellant the relevant questions, and the Appellant, with two broken arms, could not write and he just answered the questions as best he could;[note: 13]and (h)     The Appellant could remember the details as if the accident happened yesterday.[note: 14] 22     It was difficult to see where the Appellant had changed his position. His evidence was consistent in both the Category 1 and Category 2 senses (see above at [13]). He did not prevaricate. There was a consistent explanation as to the lack of details in his police report. He explained the lack of details by stating that he had only responded to questions that were asked. If he was not asked the proper questions he would not have had to exhibit his recollection of the accident. As a result of the accident, he was unable to write and could only answer questions orally. 23     The Judge was also, with respect, incorrect in stating that the Appellant explained that the lack of details was due to him being interviewed intermittently over a few weeks (see the GD at [13]). The Appellant’s evidence was that the policeattemptedto interview him several times, but would adjourn the interview as the Appellant was with his doctor when the police visited. The police finally interviewed him in one sitting. 24     In the circumstances, we respectfully disagreed with the Judge’s finding with regard to the Appellant’s credibility.",
        "Issue 2: Was the Appellant travelling at an excessive speed?": "25     The Judge answered this particular issue in the affirmative, as follows (see the GD at [26]): Applying the above principles [relating to the duty of care owed by motorists and to contributory negligence], while the defendant was partly to blame for making the sharp right turn,the plaintiff’sexcessive speedand his decision to execute an evasive manoeuvre by overtaking the defendant’s mini-bus on the right side were major contributing factors to the collision. There is no doubt that the plaintiff was part author for his own plight, for had he not beenriding athigh speed, he might have been able to brake in time and avert, or at the very least, reduce the severity of the accident. [emphasis added in italics and bold italics] 26     We should add that during oral submissions, the Respondent’s counsel, Mr Patrick Yeo (“Mr Yeo”), couldnotpoint toanyobjective evidence that showed that the Appellant was travelling at an excessive speed. 27     We turn now to analyse the reasons the Judge gave in arriving at her conclusion that the Appellant had in fact been travelling at an excessive speed.",
        "Damage to the motorcycle": "28     The salient part of the GD reads as follows (see the GD at [16]–[18]): The plaintiff’s version of what transpired was also inconsistent with the evidence that was before the court. While he claimed that he was travelling at 50kph, theextent of the damageto his motorcycle, as shown in the photographs tendered, indicated otherwise. Indeed, as Mr Yeo pointed out during his cross-examination of the plaintiff,the police report indicated that the front of the motorcycle was “totally wrecked”. The plaintiff himself also conceded that the photographs showed that the damage to the motorcycle was the result of a severe impact. The plaintiff’s account that he had to brake so hard that the rear tyre of his motorcycle started to “fish-tail” was alsoriddled with inconsistencies. The plaintiff’s motorcycle was a high performance sports machine called Yamaha Fazer, with an engine capacity of 1000cc with anadvanced braking system.Had the plaintiff really been travelling at only 50kph and had braked so hard that his rear tyre “fish-tailed”, it would have been unlikely that he was unable to stop or, at the very least, slowed his motorcycle such that the extent of damage to the bike was less severe than what it was. ... For the above reasons, I found that it was more likely than not on the evidence that the plaintiff was travelling at a greater speed than 50kph on his high performance machine, speeding on the road in the direction of Cairnhill Road. [emphasis added in italics and bold italics] “Totally wrecked” 29     The relevant photographs were referred to us again during oral submissions. We should first state that the photocopies of the photographs in the bundles were not of the quality we expected from counsel. The photographs were grainy and difficult to make out. Moreover, neither counsel had photographs of the damage caused to the minibus. All we were referred to was the Traffic Police’s Vehicle Damage Report. This report indicated that the entire front of the minibus was damaged. This was a curious description, given that (a) the Respondent’s recounting of the accident involved a collision on the right side of the minibus; and (b) the Traffic Police’s Sketch Plan (“Sketch Plan”) of the accident appeared to show that the motorcycle had collided into the right side of the minibus.[note: 15] 30     Despite repeated questioning from the bench, neither side was able to provide a satisfactory answer as to why the minibus was damaged from the front. There was also no photographic evidence of the same. 31     It is a good point of practice to have the originals of crucial photographs available for submission if required. It is also helpful, if at all possible, for parties to spend more effort in producing better reproductions of photographs. After all, these will be the materials which parties would wish the court to consider in assessing their respective cases. 32     Fortunately, during oral submissions, we had the benefit of considering better quality photographs of the damage to the motorcycle. We could not, in this regard, agree with any description of the motorcycle being “totally wrecked”. Did the presence of damage here indicate that the Appellant was travelling at an excessive speed? 33     The Judge was of the view that the damage was indicative of travelling at an excessive speed. In our view, however, the evidence with regard to damage was equivocal. We do not disagree that a motorcycle travelling at an excessive speed, crashing head first into a minibus,couldresult in severe damage to the front of the motorcycle. However, it is also clear that in view of the size and structure of a motorcycle, it is possible that a motorcycle travelling at an acceptable speedmight alsosuffer severe damage if a head on collision occurred,especially if there was insufficient time on the motorcyclist’s part to apply the brakes.Indeed, such a scenario could have arisen in this case if the motorcycle was very close to the minibus when the minibus moved in front of the motorcycle. In such a scenario, the motorcycle would still have crashed into the minibusdespitethe motorcyclist having applied the brakes when he was travelling at a speed which was not excessive. The analogy can be made to the hypothetical situation set out in the Singapore High Court decision ofOng Bee Nah v Won Siew Wan[2005] 2 SLR(R) 455 (“Ong Bee Nah”), where the court was of the view that a driver would not be negligent in the scenario where a child had suddenly run across the road and was hit by the driver’s vehicle, if the child was in fact too close to the vehicle. 34     We would here again point to the dearth of further relevant evidence that would have allowed the court to better assess the present factual matrix. There was no expert evidence led to demonstrate that damage of the sort shown in the photographs couldonlybe caused by a motorcycle travelling above 50kmh. With regard to road traffic accident claims, the need for a practitioner to gather as much factual based evidence as possible in order to reduce the litigation risk to his client was emphasised in a recent article (see Jonathan Aspinall, “Knocked down twice”New Law Journal, 22 June 2012, p 826) (“Aspinall”)). In the article, the learned author states, with reference to the recent English Court of Appeal decision ofRehill v Rider Holdings Limited[2012] EWCA Civ 628, as follows (seeAspinallat p 827): Expert matters We cannot know whether expert evidence would have made any difference inRehill. An RTA reconstruction expert report may have avoided a costly trial and subsequent appeal, but then again it may have thrown up more questions than it answered.Either way the only way a practitioner can reduce the litigation risk to his/ her client is by obtaining evidence which establishes the facts. If expert evidence on the impact damage, road conditions/ vehicle measurements or indeed CCTV evidence helps to narrow the factual issues and avoid a court having to conclude that something “looks right” then it is probably worth getting. [emphasis added in italics and bold italics] 35     We need only add that each case turns on its own facts, and, while we have stated that in this particular case expert evidence would have been helpful, it might not always be the case that expert evidence will assist the court (see, for example, the observations of the Singapore High Court inKhoo Bee Keong v Ang Chun Hong[2005] SGHC 128 at [68]–[87]). The key question is whether the evidence concerned provides more clarity for the court, especially in situations where the evidence of the witnesses are vastly different and where the evidence is based on a litigant’s recollection of what is an extremely traumatic incident. Sufficient time to react 36     Mr Yeo argued that the Appellant’s motorcycle, which possessed such a “high capability braking system”, should have had no difficulty in coming to a safe stop. We deal with the advanced braking system below (at [57]–[65]). We confine our analysis here to the argument that the Appellant had sufficient time to react. Mr Yeo argued that the Appellant, travelling at 50kmh, had sufficient time to react even as he saw the minibus turning from 15 metres away. The Appellant’s counsel, Mr Ramasamy Chettiar (“Mr Chettiar”), referred us to the Speed and Stopping Table in the Highway Code (Cap 276, R 11, 1990 Rev Ed) (“Speed and Stopping Table”). At 50kmh, a vehicle would have travelled an additional 9 metres simply during the time the driver took to react and apply the brakes. The braking distance (including reaction time) for good brakes on a dry surface was 23 metres. In the same table, it stated the following: Research has shown that the average driver needsat leastthree quarters of a second to react to a hazard and get his foot to the brake pedal. If he is not alert, it could take longer. [emphasis added] 37     Mr Yeo argued that this table was produced in 1975 and that it should only be applicable to a vehicle that weighed more than a motorcycle. Again, he did not cite authorities or point to any evidence that was before this court to show that this was the case. He did attempt, at the hearing, to introduce evidence in the form of an Internet article, to provide us with braking distances relating to motorcycles, but we disallowed it. 38     Nevertheless, even assuming,arguendo, that technology has improved brake performance and that motorcycles could come to a stop more quickly than cars, we were still left with the issue of human reaction time. Mr Yeo could not provide us with any evidence that humans react faster today than they did when the Speed and Stopping Table was produced. Did the minibus move off rapidly from its stationary position? 39     What was also lacking was evidence as to the distance between where the minibus had stopped, and the turn into Peck Hay Road. The Sketch Plan did not indicate this. Such evidence would have allowed the court to determine whether the minibus made the turn immediately from its stationary position, or whether the minibus had gradually moved into a position to make the turn, which (in turn) would have allowed the court to assess whether the Appellant had sufficient time to avoid the accident. Mr Yeo argued before us that the Respondent did not move rapidly across the lanes. He offered us photographs of the location of the accident. Mr Yeo attempted to argue that, based on the photographs, it was not rapid movement across the lanes, as the distance between the minibus’s stationary position and the junction was a distance of several car lengths. As we observed at the hearing, Mr Yeo’s explanation was not necessarily correct, based on the photographs, and such evidence should have been led at the trial below. There was no point in this court indulging in a speculative exercise. Our decision on the inevitability of the collision 40     Deficiencies in arguments and evidence aside, the facts demonstrated that the collision was virtually inevitable. Even if the Appellant had spotted the minibus moving off while he was 15 metres away, could he have expected the minibus to have cut across the lane to turn into Peck Hay Road? The Appellant’s testimony revealed, in fact, that he did not expect that the minibus would turn into Peck Hay Road:[note: 16] QAnd that you were how many metres from it? AIt would be 15 metres or something. Well, that---that time, from---from when--- from when the van started to move and until we hit for the---for the--- just for the sake of on the standing [sic] maybe let’s say, it was 2 seconds. I didn’t know if it was but let’s say it was 2 seconds. So for the first half a second, I’m braking, I’m seeing the carcoming into traffic, but I’m not necessarily thinking I’m going to die. I’m thinking it’s in traffic, she didn’t see me and I will--- I will deal with it. I’ll--- I’ll try to stop.Split second later, I realised, no,she’s not going into traffic, she’s crossing traffic.And then--- from then on, there was---the---the next split second, I was hitting the van and at the time, I’m already committed to a right turn and as I explained, I was on the brakes and the--- the bike reacted to--- to the braking. [emphasis added in italics and bold italics] 41     Even though the Appellant had seen the minibus moving off from a distance of 15 metres away, it was only at a closer distance that he had realised that the minibus was turning into Peck Hay Road. This essentially gave himfewerthan 15 metres to react. 42     If the Appellant had been travelling at 50kmh, he would have been travelling at 13.88 metres per second. If reaction time, according to the Speed and Stopping Table, resulted in 9 metres of road being covered before one could even apply the brakes, there was, in effect, no time to avoid the collision. It should also be recalled that the average driver needs at least three quarters of a second to react to a hazard and get his or her foot to the brake pedal. 43     Mr Yeo argued that the Appellant was an experienced motorcyclist but we were not able to see how even an experienced motorcyclist might have avoided the collision. 44     For all the reasons stated above, we were, with respect, unable to agree with the Judge when she considered it unlikely that the Appellant was unable to stop even if he was travelling at 50kmh. In addition, unlike the Judge, we could not see the inconsistencies between the Appellant’s version of what transpired and the evidence that was before the court.",
        "Failure to keep a proper lookout": "45     Mr Yeo argued that (a) the Appellant, having seen the minibus from 50 metres away, should have slowed down; and (b) the Appellant’s failure to keep a proper lookout and failure to slow down constituted negligence on his part. 46     With regard to the latter argument, we note that the Judge did not make any finding as to whether there was a failure on the Appellant’s part to keep a proper lookout, despite this allegation being addressed in the pleadings. Furthermore, there was no appeal specifically on this point. 47     With regard to the former argument, we were of the view that, in the circumstances, there was no need for the Appellant to slow down. This point, however, is directly related to the relevant standard of care of a motorist, an issue to which we now turn.",
        "Standard of care": "48     InCharlesworth & Percy on Negligence(Christopher Walton gen ed) (Sweet & Maxwell, 12th Ed, 2010) (“Charlesworth & Percy”), it was observed as follows (at para 4-54): Motor accidents.It will be understood that any finding of contributory negligence will depend upon the circumstances of each individual case.Whilst there is no general duty to foresee that another will be negligent, instances can and do arise where it will be prudent to anticipate the negligence of others, especially where experience commonly has shown such negligence to be likely or where resulting damage can be minimised.[emphasis added] 49     In the present case, the possibility of the danger emerging was not reasonably apparent. Indeed, to our minds, it was “only a mere possibility which would never occur to the mind of a reasonable man” (see [51] below) that the minibus at the side of the road would attempt to move across two lanes and turn into Peck Hay Road. Such negligence isnotcommon and neither common sense nor experience would have taught the Appellant that the Respondent was likely to act in the way she did (seeLondon Passenger Transport Board v Upson and Another[1949] AC 155,perLord du Parcq). 50     More pertinently, the Singapore courts have also considered the appropriate standard of care in road traffic accidents. For example, in the decision ofSBSTransit Ltd v Stafford Rosemary Anne Jane (administratrix of the estate of Anthony John Stafford, deceased)[2007] 2 SLR(R) 211 (“Stafford”), this court observed as follows (at [32]–[34]): Before considering the evidence as to what those circumstances were, we would like to expand on the following paragraph in the trial judge’s decision: When one travels on the roads, one cannot assume perfect road manners from the other road users. The reasonable road user must act on the basis that there may be negligence and incompetence on the part of others, and he has to make allowance for them.However, this duty cannot be overstated; he is not required to regard other road users as threats to him against whom he must protect himself, and he must be allowed to go about with a degree of calm and confidence necessary for the orderly movement of traffic.With reference to a person in the position of the deceased, I only need to quote and concur with the statement that: [T]here is - in the absence of clear and compelling circumstances to the contrary - no legal duty on a driver to slow down automatically each time he or she approaches a junction if there is no stop sign or (as is the case here) the lights are in his or her favour at a junction where traffic lights are present. [emphasis in original] per Andrew Phang Boon Leong JC (as he then was) inOng Bee Nah v Wong [sic] Siew Wan[2005] 2 SLR(R) 455 at [95]. We fully agree with the learned judge that the law requires the motorist to act on the basis that there may be negligence and incompetence on the part of other road users and to make allowance for them,but without having to contemplate possibilities that are remote.As Lord Macmillan had observed inFardon v Harcourt-Rivington[1932] All ER Rep 81 at 84: [T]he user of the road is not bound to guard against every conceivable eventuality, but only against such eventualities as a reasonable man ought to foresee as being within the ordinary range of human experience. The crux of the issue is what a reasonable person would apprehend in a particular set of circumstances.At one extreme is a driver of a car on an open road in dry weather and perfect visibility. He may drive at whatever speed his car can permit him safely to attain - subject to the legal speed limit - if he does not see any vehicle, person or animal that may obstruct his path.However, once there is other traffic on the road, or there are pedestrians or animals at the roadside, or there are obstructions to his view, he must contemplate the possibility that any of these may impinge upon his path and must adjust his speed accordingly to one at which he can effectively stop or otherwise avoid a collision.If the road is wet, then he must slow down even further because his braking distance is increased. If visibility is low, then he must proceed at a speed at which he can stop the car the moment an obstruction comes into view. If there are children walking alongside the road, he must contemplate the higher possibility of a child suddenly dashing across his path as compared to adult pedestrians. All these are essentially matters of common sense. Further, the driver must be aware at all times that his motor vehicle is, by reason of its mass and speed, a potentially dangerous weapon. The law requires that he handles it with good sense and common decency. [emphasis added in italics and in bold italices] 51     And, in the Singapore High Court decision ofOng Bee Nah, it was observed thus (at [92]–[100], [109]–[110]): Is there a general duty to slow down when approaching a junction? Counsel for the defendant made much of the argument to the effect that the third party had not slowed down as his vehicle approached the junction but, on the contrary, had maintained his then existing speed of 60km/h(in her closing submissions, counsel for the defendant went, in fact, even further and referred to the need on the part of the third party to, inter alia, sound the horn and flash the headlights of his vehicle). The legal issue that arises is whether or not there is indeed a general duty for a driver to slow down (or take some other precautionary measures, such as those just mentioned) when approaching a traffic junction even though the lights are in his or her favour. I could locate no general rule to this effect.This is not surprising since the facts of each case can vary so greatly. I must not, however, be taken as stating that no general principles are in fact possible.It seems to me that there is - in the absence of clear and compelling circumstances to the contrary - no legal duty on a driver to slow down automatically each time he or she approaches a junction if there is no stop sign or (as is the case here) the lights are in his or her favour at a junction where traffic lights are present. Put even more generally, I found the following statement of principle by Lord Dunedin in the House of Lords decision ofFardon v Harcourt-Rivington(1932) 146 LT 391 at 392 to be entirely apposite both as a general guideline as well as a specific pronouncement in so far as the present fact situation was concerned: The root of this liability is negligence, and what is negligence depends on the facts with which you have to deal. If the possibility of the danger emerging is reasonably apparent, then to take no precautions is negligence;but if the possibility of danger emerging is only a mere possibility which would never occur to the mind of a reasonable man, then there is no negligence in not having taken extraordinary precautions. The learned law lord proceeded to add, a little later in his judgment, thus (ibid): [P]eople must guard against reasonable probabilities, butthey are not bound to guard against fantastic possibilities. Lord Macmillan also observed, in a similar vein, thus (ibid): In each case the question is whether there is any evidence of such carelessness in fact as amounts to negligence in law - that is to breach of the duty to take care.To fulfil this duty the user of the road is not bound to guard against every conceivable eventuality, but only against such eventualities as a reasonable man ought to foresee as being within the ordinary range of human experience. The above observations constitute wise counsel indeed, and are sound not only in law but are grounded in moral fairness and practical common sense. Not surprisingly, therefore, they find application in the local context (see, for example, the Singapore High Court decision ofNg Swee Eng v Ang Oh Chuan[2002] 2 SLR(R) 321). What counsel for the defendant was arguing for was, in effect, a blanket rule to the effect that all drivers were under a legal duty to slow down when approaching a traffic junction, regardless of the circumstances concerned and even where the traffic lights were in their favour.This would be most impractical and inefficient where there is otherwise no reasonable apprehension of danger.To reiterate the wise counsel of Lord Dunedin (above at [97]), “people must guard against reasonable probabilities, but they are not bound to guard against fantastic possibilities”.Everything does ultimately, therefore, depend on the specific facts(see also Charlesworth & Percy on Negligence (Sweet & Maxwell, 10th Ed, 2001) at para 9-193); and it is from this interactive relationship between the law and the facts that a fair and just result emerges. ... There can, in my view, be no blanket rule one way or the other.In my view, the only clear guiding principle is the broad one stated earlier to the effect that, in the absence of clear and compelling circumstances to the contrary, there is no legal duty on a driver to slow down automatically each time he or she approaches a traffic junction if there is no stop sign or where the traffic lights are in his or her favour. In a very real sense, each case will have to be decided on its particular factual matrix.In this regard, in addition to the cases already considered, one may contrast, for example,Watkins v Moffatt[1970] RTR 205,Walsh v Redfern[1970] RTR 201, andHopwood Homes Ltd v Kennerdine[1975] RTR 82 (in all of which the court concerned found in favour of a driver travelling along a major road) andTruscott v McLaren[1982] RTR 34 (where the court found that the driver travelling along a major road was liable for contributory negligence). [emphasis added in italics and bold italics] 52StaffordandOng Bee Nahboth make clear that cases are decided based on the particular set of facts and circumstances before the court concerned. In the present case, the road in question was relatively straight. On the day of the accident, the road conditions were good; the flow of traffic on Clemenceau Avenue North was light, the road surface was dry, the weather was fine and visibility was clear.[note: 17]While the road was not an expressway, it was not a road in a busy housing estate. A reasonable motorist under the circumstances was therefore entitled to assume that other motorists would not unexpectedly and blatantly flout traffic rules and seek to traverse two lanes to make a right turn. 53     More specifically, we considered the possible scenarios in the present factual matrix. First, the minibus could have attempted to make a U-turn (“Scenario 1”). Second, the minibus could have attempted to make a right turn (“Scenario 2”). Third, the minibus could have moved off and filtered into the right lane (ie, into the same lane as the motorcycle) (“Scenario 3”). Fourth, the minibus could have moved off and travelled in the left lane (“Scenario 4”). In our view, it was not unreasonable for the Appellant to have expected that Scenario 4 would come to pass. This is especially so, bearing in mind the fact that the Judge never made a finding in the GD as to whether or not the hazard lights of the minibus were in operation while the minibus was stationary. The Appellant testified that he was of the view that the minibus was parked with no one in it.[note: 18]It is, to borrow the words of Lord Dunedin in the House of Lords decision ofFardon v Harcourt-Rivington(1932) 146 LT 391 (at 392), a “fantastic possibility” (see also above at [51]) for a parked vehicle to move, and accordingly the Appellant was not bound to guard against this. 54     There is one remaining issue that might be dealt with briefly: One might wonder if there is a possible contradiction between our observations and those inStafford, where the court held, as follows (at [34]; also quoted above at [50]): ... However, once there is other traffic on the road, or there are pedestrians or animals at the roadside, or there are obstructions to his view, he must contemplate the possibility that any of these may impinge upon his path and must adjust his speed accordingly to one at which he can effectively stop or otherwise avoid a collision. 55     In our view, there is, in fact, no contradiction. In the present case, had the reasonable possibility (“Scenario 4”) occurred, the Appellant would not have had to stop or avoid any collision. It must be noted that the observation quoted in the preceding paragraph is still subject to the threshold of reasonable possibilities, as evidenced by the first sentence in that particular paragraph, which reads as follows: The crux of the issue is what a reasonable person would apprehend in a particular set of circumstances. 56     Accordingly, the Appellant was not, in our view, negligent in not braking immediately after seeing the minibus stationary at the side of the Road. We turn now to address the issue of brake marks.",
        "Lack of skid or brake marks on the road": "57     The Judge had stated, as follows (see the GD at [17]): Even more telling was the absence of any skid or brake marks in the traffic police’s sketch plan.Surelyif the plaintiff had braked so hard that his rear tyre was “fish-tailing”,one would expect for there to be at least some markings on the road. [emphasis added] 58     On this point, we again disagreed with the Judge. The Judge appeared to have found that, if there had been hard braking as claimed by the Appellant, there wouldinvariablyhave been brake marks left on the road. There is, with respect, no support for such a finding. 59     First, no expert evidence was led on this point. Mr Yeo, in oral submissions before this court, stated that hebelievedthat fishtailingshouldhave left indications on the road. Suffice to say, the duty was on him to point us to evidence which supported this assertion and none was forthcoming. 60     Second, the Judge described the Appellant’s motorcycle as a high performance sports machine with an “advanced braking system” (see the GD at [17]). There is, with respect, some level of ambiguity with regard to this finding. It was unclear as to whether such an advanced braking system was taken to include what is popularly known as “Anti-Lock Braking System” (“ABS”). No evidence, expert or otherwise, was led on: (a)     what features a motorcycle with an “advanced braking system” had; (b)     whether the motorcycle was equipped with ABS; (c)     whether the presence of ABS would have played a role in the motorcycle not leaving brake marks along the road despite its brakes being heavily applied. 61     In so far as the last question is concerned, there have been cases that have indicated that the presence of ABS would result in an absence of brake marks. InState v Balliette2011 WI 79 (Wis 2011), for example, the Supreme Court of Wisconsin heard the following argument: Balliette attached to his motion a detailed report by John DeRosia (DeRosia), a professional engineer and accident reconstruction expert. In his report, DeRosia questioned the conclusions of the State’s experts and pointed out that one of the expert’s conclusions was based on an incorrect piece of evidence, namely, that Thein’s Pontiac did not have an anti-lock brake system. DeRosia’s report stated that such a braking system was nearly universal in General Motors vehicles at the time. Furthermore, pictures of the Pontiac showed an “ABS” label—a common abbreviation for anti-lock braking system.This information allegedly rebutted the State’s trial testimony that if Thein had braked suddenly, she would have left skid marks.Based on these facts and other assertions, DeRosia questioned the validity of the conclusions made by the State’s accident reconstruction experts. [emphasis added] 62     InState v Kinney, 1999 Ohio App LEXIS 4154 (Ohio Ct App, Madison County Sept 7, 1999), the evidence before the Court of Appeals of Ohio, Twelfth Appellate District, Madison County, was as follows: State Trooper Jeffrey Moseley, an accident reconstructionist with the Ohio State Highway Patrol, testified that according to his calculations, at impact appellant’s vehicle was traveling between sixty-nine and seventy-one m.p.h., and Iezzi’s vehicle was traveling at thirty-two m.p.h. Moseley testified that Iezzi’s statement he was driving at forty to forty-five m.p.h. before the collision was consistent with Moseley’s calculations. Moseley explained thatIezzi’s act of braking without going to full lock-up (as evidenced by the absence of skid marks from Iezzi’s car) most likely resulted in speed loss. [emphasis added] 63     InSmith v. Myles580 So 2d 1088 (La App 4 Cir 1991), the Court of Appeal of Louisiana, Fourth Circuit, also had evidence before it, as follows: Officer Louis J. Kistner, III, a New Orleans Police Officer assigned to the Fatality Unit, was qualified to testify as an expert in the field of accident reconstruction. He investigated the scene following the collision, and spoke to several witnesses. Based on his investigation, he opined that the decedent had been traveling at 40 m.p.h., that Myles had stopped prior to turning left, and that it took her 4.2 seconds to travel from a stopped position across the westbound lanes of Gentilly Blvd. Kistner testified that he was unable to determine the exact position of the motorcycle at the time the truck began its left turn. However, he made various calculations taking into account braking efficiency, friction and reaction time, in each case assuming a speed of 40 m.p.h. He determined that the decedent could not have been more than 248 feet away as the truck began to turn. Assuming 80% braking efficiency, he estimated that the decedent could have stopped within a range of 93.54 feet to 111.66 feet prior to the collision. Kistner testified that the gouge marks found on the roadway indicated that the decedent had laid down the motorcycle prior to the collision.He stated that the absence of skid marks does not tell conclusively whether or not the braking process had taken place. There can be braking without skid marks -- the absence only indicates that the wheels did not lock.Although he stated that there was no physical evidence to indicate that the decedent slowed down until he was 16 feet away, he testified that it is almost impossible to lay down a motorcycle at 40 m.p.h. In his opinion, the primary cause of the accident was Myles’ left turn into oncoming traffic when she should have yielded. [emphasis added] 64     InR v Cook[2004] EWCA Crim 1177, the English Court of Appeal (Criminal Division) stated, as follows: In interview by the police the appellant accepted full responsibility for the accident and said that he was going too fast at the dip in the road before the bend. The speedometer of the vehicle registered 45mph which, according to the expert, was the speed of the vehicle at or shortly before impact.He also said that the absence of skid marks was due to the vehicle being fitted with an ABS braking system.The officer concluded: “The accident most likely occurred due to the fact that Mr Cook had other things on his mind which caused him to misjudge the vehicle’s position and speed on the road. This, combined with the effects of alcohol, meant that he reacted too late to the approaching bend and failed to negotiation it with the known consequences.” [emphasis added] 65     We cite these casessolelyfor the purpose of highlighting that a more thorough investigation of the facts might have shed more light and allowed this court to obtain a clearer picture of what precisely had happened in this case. No evidence was led as to the type of tyres used on the motorcycle, the amount of wear on the tyres, the weight of the motorcycle, the angle at which the tyres met the road, as well as the correlation (if any) between “fish tailing” and brake marks. Without these significant pieces of information, we were not prepared to indulge in speculation and make findings based on what to us was essentially evidence that was equivocal. In light of our analysis, we did not agree with the Judge’s finding relating to the lack of brake marks.",
        "Blind spot": "66     The Judge had also observed as follows (see the GD at [18]): For the above reasons, I found that it was more likely than not on the evidence that the plaintiff was travelling at a greater speed than 50kph on his high performance machine, speeding on the road in the direction of Cairnhill Road. It was alsopossiblethat the plaintiff was in the defendant’s blind spot. Thattogether, would explain why the defendant did not see the plaintiff until the point of collision, despite doing her checks. [emphasis added] 67     With respect, this paragraph poses a problem for several reasons. First, themere possibilityof the Appellant’s motorcycle being in the Respondent’s blind spot is neither here nor there. The question remains whether the Judge found this as a fact. Second, there is an apparent a contradiction in the Judge’s reasoning. The Judge stated that the Appellant’s motorcycle was in the Respondent’s blind spot, but proceeded to state that the Respondent did her checks. Would the checks not have alerted the Respondent to the fact that the Appellant’s motorcycle was in her blind spot? However, this apparent contradiction might be resolved by interpreting the use of the word “together” by the Judge to mean that, because of the speed the Appellant was travelling at, the Respondent could not have seen him even if she had checked the minibus’ mirrors and her blind spot. In other words, the speed of the Appellant’s motorcycle was such that, at the moment the Respondent performed her checks, the Appellant’s motorcycle was nowhere to be seen, and in the time between the Respondent’s checks and the actual turn, the Appellant’s motorcycle appeared and crashed into the minibus. The problem we had with this analysis was that, based on a map taken from the street directory that was submitted in evidence, Clemenceau Avenue North is a relatively straight road. This would have meant that visibility was increased in terms of distance. For the Appellant’s motorcycle to have appeared between the time the Respondent performed her checks and her moving off, the Appellant would have had to have been travelling at an extremely high speed. Although this wastheoreticallypossible, there was little evidence to support such a claim. Accordingly, we did not, with respect, agree with the Judge’s reasoning (at [18] of the GD).",
        "Issue 3: Was the Appellant negligent in taking the evasive manoeuvre that he did?": "68     The Judge found that the Appellant’s manoeuvre greatly increased the risk of collision. The Judge found that it was “clearly” the more risky manoeuvre. The Judge observed, as follows (see the GD at [27]): In addition, by choosing to execute thehighly dangerous evasive manoeuvreof over-taking the defendant on the right side, against the direction of on-coming traffic, the plaintiffgreatly increasedthe risk of collision, which eventually materialised.While it is true that theplaintiff ought not to be held to the high standard of having to choose the optimum solutionwhen there were a range of options open to him, it wassurely incumbenton the plaintiff to avoid undertaking whatclearlywasthe more risky manoeuvre. By doing so and directly causing the accident, the plaintiff must be held to be more blameworthy. [emphasis added in italics and in bold italics] 69     Before us, Mr Yeo described the action taken by the Appellant to overtake the minibus as “foolhardy”. We did not agree that the Appellant’s actions were foolhardy, and, unlike the Judge, we did not think that they amounted to negligence. Let us elaborate.",
        "“Highly dangerous evasive manoeuvre”": "70     First, it is clear that all three options open to the Appellant (viz, braking hard, swerving to the left, and swerving to the right) could be considered “highly dangerous”. 71     In so far as the first option was concerned, the Appellant explained in re-examination why he did not simply apply the brakes, as follows:[note: 19] QCan you tell the Court why you did not just brake hard and not steer? ABecause I think I would have died if I had---I mean, that’s a daunting proposition at the moment. You are 15 metres away from hitting something front on or colliding with it and then stationed. To me, it’s stationary. It’s not--- even it’s moving--- QWhat--- what is to me it is---what is stationary? AIt means that the---the van was not moving in my direction.It was like riding into a wall at 50 kilometres an hour.So the reason I didn’t just brake was that I’m not sure I would have had time to brake. And when I say the---the van came out 15 metres before me, there’s also maybe, I don’t know, half a second before I push the brakes on. My brain has to register what’s going on. I have to see and then I start braking so there was very little time and just braking was not an option. [emphasis added in bold italics] 72     Each option embodied the potential of collision with the minibus. In fact, it might be argued that the option to turn left was themost dangerousamongst the three. The Appellant’s evidence on this in cross-examination was as follows:[note: 20] QCan I also suggest that you could have moved your motorcycle to the left adjacent lane to avoid to avoid colliding with the defendant’s van--- AEr, I’ve--- Q---at---with hindsight today. AHindsight is always clear... So I thought to myself, maybe if I had turned left instead of turning right to avoid the van, I would have been fine. And the truth is that in this, I didn’t think I reacted. Something came from the left towards the right and I tried to move away from it.In hindsight, I may have been able to avoid the van by swerving to the left but if I---if she would have seen me in that and---and stop the car and instead of continuing, I would have gone straight into the side of the van and I would probably be there.So, yah, I thought about it many hours, believe me, lying in hospital whether or not I could have avoided this accident. And, er, if I had turned left, I would have been the luckiest guy in the world because it would be the un-logical... thing to do in the situation. The logical thing to do is to get away from the car that’s coming right out in front of you and--- and turning into it is not natural response. QSo my question to you is you could have turned left on that day and this accident could have been avoided? AThat is the question? QYes. Do you agree with that statement? AI---I---I can’t agree with it because I don’t know if I would have cleared the car--- QOkay. A---but it’s a---it’s a valid point, it’s possible. [emphasis added] 73     In re-examination, the Appellant’s evidence was as follows:[note: 21] QCan you explain to the Court again whether instinctively, you could have turned left or swerved left? ANot instinctively because that’s against all instincts who turned into a car that’s coming towards you. But as I--- QWhy do you say that it is---that you would be turning into a car? Why do you say that? AWell, I was on the right lane, the car in front of me and it came towards me and turning into it is literally---if---if she would have seen me at that moment, I would have turned left. She would have stopped the car. She wasn’t going fast at all and she would have been stationery and (indistinct) straight into the side of the van. So---so turning left, I don’t think any motorcycle rider with any experience would have chosen that, chosen that direction. 74     We pause here to cite a passage fromCharlesworth & Percy(at para 4-06): Taking a reasonable risk not contributory negligence.The fact that the claimant has taken a risk does not amount to contributory negligence if the need to take the risk was created by the negligence or breach of statutory duty of the defendant and a reasonably prudent man in the claimant’s position would have acted as he did. 75     In the present case, it was abundantly clear that the need to take the risk was caused by the Respondent’s negligence. We do not think that it could be seriously argued that a reasonably prudent person in the Appellant’s position would not have acted as he did in seeking to avoid the collision.",
        "“[P]laintiff ought not to be held to the high standard of having to choose the optimum solution”": "76     Despite the Judge’s express words, it appeared to us that the Appellantwasbeing held to the high standard of having to choose the optimum solution (see the GD at [19]): Given that traffic on the plaintiff’s original side of the road (heading towards Cairnhill Road) was clear,had the plaintiffsimplyapplied his brakes and manoeuvred left instead of overtaking, he would most likely have averted the accident.The plaintiff was, however, committed to swerving right in an attempt to overtake the slow turning mini-bus.In my view, the plaintiff’s failure to execute thesafer evasive manoeuvrecontributed partly to the accident.[emphasis added in italics and in bold italics] Counsel of perfection 77     The Judge’s view on how the Appellant should have dealt with the situation was, in our view, a counsel of perfection. In the English Court of Appeal decision ofWhiteford v Kubas UAB (A Company)[2012] EWCA Civ 1017, Richards LJ (with whom Laws LJ agreed) observed as follows (at [15] and [21]): Mr Watt-Pringle reminds the court that thelorry driver’s duty was to take reasonable careand thatthe court must avoid the danger of evaluating the standard of care “by reference to fine considerations elicited in the leisure of the court room, possibly with the liberal use of hind-sight”(seeAhanonu and South East London and Kent Bus Company Limited[2008] EWCA Civ 274 at paragraph 23 per Laws LJ). ... The point is ultimately a very short one. I have well in mind the cautionary remarks of Laws LJ inAhanonuthatone must avoid a counsel of perfectionand that the focus must be on the standard to be expected of a reasonable and prudent driver in the circumstances that existed at the time. [emphasis added in italics and bold italics] 78     InPublic Prosecutor v Tubbs Julia Elizabeth[2001] 2 SLR(R) 716 (“Tubbs Julia Elizabeth”), Yong Pung How CJ observed (albeit in the context of a charge under s 304A of the Penal Code (Cap 224, 1985 Rev Ed) for causing the death of three persons in a motor accident by doing a negligent act) as follows (at [45]): In coming to my decision, I noted that the question of conviction swung on the events occurring within a four-second window of time.It would have been easy, in the hallowed and esoteric rationality of a courtroom, and with the benefit of hindsight, to dissect the respondent’s reactions ad infinitum and surmise what she could and should have done within those precious four seconds leading to the tragic accident. But in the legal post-mortem that follows the facts, one should not miss the wood for the trees.The respondent had a clear right of way on a major thoroughfare. She was under the speed limit and not acting irresponsibly in any way. Her vision was somewhat affected by shadows and visual clutter on the median strip. No independent witnesses offered further assistance, and once the prosecution experts conceded that a reasonable person would have taken 1.5 to 2 seconds to react, it was clear that under the circumstances a reasonable and prudent driver may not have been able to avoid the fatalities. I therefore found that the appellant had not proven beyond a reasonable doubt that the respondent had negligently caused the death of the pedestrians and accordingly dismissed the appeal. [emphasis added in bold italics] “Agony of the moment” 79     In a related vein, Mr Chettiar contended that the decision his client took was taken in the agony of the moment. The force of this argument becomes clear when one examines the following passage fromClerk & Lindsell on Torts(Sweet & Maxwell, 20th Ed, 2010) (at para 8-144): Acting in an emergency Where the defendant’s conduct has occurred in the course of responding to an emergency this will be regarded as relevant to the objective standard of care required.All that is necessary in such a circumstance is that the conduct should not have been unreasonable, taking the exigencies of the particular situation in account.Thus inNg Chun Pui v Lee Chuen Tatthe Privy Council held that the driver of a coach, who had braked, swerved and skidded when another car had cut in front of him without warning, had acted reasonable in the emergency. ... [emphasis added in bold italics] 80     And, inCharlesworth & Percy, the following observations might be usefully noted (at para 4-08): Dilemma created by another’s negligence.... Where, negligently, one party places another in a situation of danger,it does not amount to contributory negligence if the other, in reacting, does something which with the benefit of hindsight, was a less than optimum solution. As Lord Hailsham put it: “Mere failure to avoid the collision by taking some extraordinary precaution does not in itself constitute negligence:the plaintiff has no right to complain if in the agony of the collision the defendant fails to take some step which might have prevented a collision unless that step is one which a reasonably careful man would fairly be expected to take in the circumstances.” Clearly, the more agonising the dilemma in which a claimant is placed, the less critical anyone should be of the consequent reaction.The court will usually balance the risk taken against the consequences of the breach of duty. This could involve weighing the degree of inconvenience or danger to which a person had been subjected, with the risks incurred in an effort to do something about it. [emphasis added in bold italics] 81     InGreene v Sookdeo[2009] UKPC 31, the Privy Council (on appeal from the Court of Appeal of Trinidad and Tobago) observed as follows (at [17]): The judge was wrong (at para 44) to say that in the agony of the moment the burden lay on the taxi driver “to establish that he had neither the time nor space to avoid the collision or minimise the damage”. Rather, as the Court of Appeal correctly noted by reference to Clerk and Lindsell, “All that is necessary in such a circumstance is that the conduct should not have been unreasonable, taking the exigencies of the particular situation into account.” All that the taxi driver could at that stage do was brake further (as Mr Applewhite confirmed he did) and, as he said, attempt (albeit, alas, with wholly insufficient time) to steer back onto the carriageway in the hope of leaving the truck on his nearside. [emphasis added] 82     This proposition has been referred to, at times, as the rule inThe Bywell Castle(see, for example, the English High Court decision ofMarian Davis (Widow and Administratrix of the Estate of Michael Davis deceased) v Stena Line Limited[2005] EWHC 420 (QB) at [12]). InThe Bywell Castle(1879) 4 PD 219, a collision took place between two ships. At first instance, Sir R Phillimore pronounced both vessels to blame for the collision. The owners of one of the ships appealed, and three Lords Justices enunciated what is likely to have been the origin of the doctrine of the “agony of the moment” (reference may also be made toMarsden on Collisions at Sea(Sweet & Maxwell, 13th Ed, 2003) at paras 4-09–4-11). 83     First, James LJ said (at 222–223): Then there comes the very last thing that occurred on the part of the Bywell Castle, which is that she,in the very agony, just at the time when the two ships were close together, hard a-ported. The judge and both of the Trinity Masters were of opinion that that was a wrong manoeuvre. I understand our assessors to agree in that conclusion, but they advise us that it could not, in their opinion, have had the slightest appreciable effect upon the collision. That view, if adopted by us, and I think that it should be adopted, would be sufficient to dispose of the case upon the question of contributory negligence.But I desire to add my opinion that a ship has no right, by its own misconduct, to put another ship into a situation of extreme peril, and then charge that other ship with misconduct. My opinion is that if, in that moment of extreme peril and difficulty, such other ship happens to do something wrong, so as to be a contributory to the mischief, that would not render her liable for the damage, inasmuch as perfect presence of mind, accurate judgment, and promptitude under all circumstances are not to be expected. You have no right to expect men to be something more than ordinary men.I am therefore of opinion that the finding of the Court below, that the Bywell Castle was, for the purposes of the suit, to be considered to blame, must be overruled, and that the Princess Alice was alone to blame. [emphasis added in italics and in bold italics] 84     Brett LJ added, as follows (at 226–227): I am clearly of opinion that when one ship, by her wrongful act, suddenly puts another ship into a position of difficulty of this kind, we cannot expect the same amount of skill as we should under other circumstances.The captains of ships are bound to shew such skill as persons of their position with ordinary nerve ought to shew under the circumstances. But any Court ought to make the very greatest allowance for a captain or pilot suddenly put into such difficult circumstances; and the Court ought not, in fairness and justice to him, to require perfect nerve and presence of mind, enabling him to do the best thing possible.What the pilot did was to give the orders to stop and to put the helm hard a-port; and the order to stop was carried out. He says that he gave the order not only to stop, but to reverse. I agree that if he had time to do it he ought to have done it. There was some dispute as to who did give the order, and it is said that if he did give the order it was not obeyed. But whichever order was given we must consider the circumstances. ... If the fact of ordering the helm hard a-port had no effect upon the collision, it is immaterial whether it was given or not.Even if it had an effect and was wrong, we have come to the conclusion that the captain of the Bywell Castle was suddenly put into an extremely difficult position, and assuming that a wrong order was given, that it ought not under the circumstances to be attributed to him as a thing done with such want of nerve and skill as entitles us to say that by negligence and want of skill the Bywell Castle contributed to the accident.Therefore, though agreeing with all the other findings as to the Princess Alice, we must come to a different opinion as to the last finding, the result of which is that we must hold the Princess Alice solely to blame. [emphasis added] 85     Cotton LJ also stated, in a similar vein, as follows (at 228–229): On the other point, that the Bywell Castle did not contribute to the accident, by hard a-porting before the collision, I agree with the view expressed by Brett, L.J. Our assessors tell us that it could not in any way have been contributory to the accident, which in their opinion was then inevitable.Even if the collision had not been unavoidable at the time when the helm of the Bywell Castle was put hard a-port, I should not have held that vessel liable. For in my opinion the sound rule is, that a man in charge of a vessel is not to be held guilty of negligence, or as contributing to an accident, if in a sudden emergency caused by the default or negligence of another vessel, he does something which he might under the circumstances as known to him reasonably think proper; although those before whom the case comes for adjudication are, with a knowledge of all the facts, and with time to consider them, able to see that the course which he adopted was not in fact the best. In this case, though to put the helm of the Bywell Castle hard a-port was not in fact the best thing to be done, I cannot hold that to do so was under the circumstances an act of negligence on the part of those who had charge of that vessel.[emphasis added] 86     Indeed, as Hill J aptly observed in the English High Court decision ofThe Crown (“Adolph Woermann”) v “Hessa”(1921) 9 Ll L Rep 271 (at 273) (affirmed on appeal inThe Crown (“Adolph Woermann”) v “Hessa”(1922) 10 Ll L Rep 734): When a man by the fault of another is presented with a choice between two perilous courses, the comparative perils must not be too nicely weighed, nor must the choice be held a wrong one if the course chosen does not attain its object. What is demanded of the man who had to choose is that he should exercise judgment and discretion as becomes a reasonable and prudent seaman. 87     More generally, the following observations by Prof Glanville Williams in his magisterial work,Joint Torts and Contributory Negligence(Steven & Sons Limited, London, 1951), may also be usefully noted (at pp 360–361): ‘Agony of the moment.’ It is well settled thatwhere a sudden emergency arises though the fault of the defendant, the plaintiff whoacts reasonablyin an attempt to extricate himselfisnotguilty of contributory negligence merely because he unintentionally aggravates the situation.Also, where the plaintiff is compelled to make a quick decision in the ‘agony of the moment’ he is not expected to take into account all the considerations that a calmer appraisal of the situation might present to the mind. Perfect foresight and presence of mind are not required.This rule, sometimes called the ‘agony of the moment’ rule, ismerely a particular application of the rule that the standard of care required of both plaintiff and defendant is that of the reasonable man. [emphasis in italics in original; emphasis added in bold italics] 88     InFleming’s The Law of Torts(Carolyn Sappideen & Prue Vines gen eds) (Thomson Reuters, 10th Ed, 2011), it was observed as follows (at para 12.200): The agony of the moment principle Ordinarily, one is entitled to proceed on the assumption that others will act with care and in accordance with accepted canons of propriety, but prudence demands as much from a potential plaintiff as from a defendant that he or she take guard as soon as he or she has reason to suspect that assumption to be ill-founded. Moreover, it is unreasonable – where there is no necessity for it – to cut things so fine as to allow no margin of safety for the mistakes or thoughtlessness of others. This counsel of wisdom is of singular relevance to motorists. On the other hand, a person’s conduct in the face of a sudden emergency cannot be judged from the standpoint of what would have been reasonable in the light of hind-knowledge and in a calmer atmosphere conducive to a nicer evaluation of the alternatives. A certain latitude is allowed when, in the agony of the moment, a person seeks to extricate him or herself from an emergency not created by their own antecedent negligence. The degree of judgment and presence of mind expected of the plaintiff is what would have been reasonable in such a situation, and he or she will not be adjudged guilty of negligence merely because, as it turns out, he or she unwittingly took the wrong course. Thus when a passenger decided to jump from a coach that had run out of control, he recovered though it appeared that, had he stayed on it, he would have escaped all injury. The logic underpinning this rule is that it is unfair to penalise the victim of another’s much more reprehensible conduct on account merely of a momentary lapse in self-protection. 89     The Australian position is set out in Balkin & Davis,Law of Torts(LexisNexis Butterworths, 4th Ed, 2009), where the learned authors state (at para 10.13): Doctrine of alternative danger If the negligence of the defendant puts the plaintiff is a position of imminent personal danger, conduct by the plaintiff which in fact operates to produce harm, but which is nevertheless reasonable in the agony of the moment, is likely not to amount to contributory negligence. This approach, also known as the doctrine of alternative danger, [the footnote here states that “For accidents at sea, it is known as the rule inThe Bywell Castle(1879) 4 PD 219”] applies, in principle, to both defendants and plaintiffs although, in practice, it has found its main application in the negligence of plaintiffs. ... The question is merely whether the plaintiff behaved reasonably in the dilemma in which the defendant had negligently placed him or her, due account being taken of the alarm which such a situation would engender in the reasonable person similarly placed. Nonetheless, as was held inCortis v Baker, the doctrine: ... does not mean that what a party does in an emergency created by another can never amount to negligence. it means to more than this, that he is only required to exercise such care and skill as a person of ordinary prudence, firmness and experience might have exhibited in the circumstances of the emergency. 90     Reference may also be made to the recent case ofStuart v Walsh[2012] NSWCA 186, where Tobias AJA, delivering the judgment of the Court of Appeal of the Supreme Court of New South Wales, discussed the principle of acting in the “agony of the moment” (at [61]–[62]). 91     In Allen M Linden & Bruce Feldthusen,Canadian Tort Law(LexisNexis Canada, 9th Ed, 2011), the learned authors set out the law in the Canadian context as follows (at pp 497–498): Emergencies In emergency situations, people who are injured while taking steps to protect themselves are judged compassionately. Although “reasonable people must be able to handle emergencies reasonable well”, they are not expected to live up to a “standard of perfection”. ... Chief Justice Freedman of Manitoba has best expressed the attitude of the courts in these cases inNeufeld v Landry, as follows: The conduct of the plaintiff driver must be assessed in the light of the crisis that was looming up before her. If in the “agony of the moment” the evasive action she took may not have been as good as some other action she might have taken – a doubtful matter at best – we would not characterize her conduct as amounting to contributory negligence. It was the defendant who created the emergency which led to the accident. It does not lie in his mouth to be minutely critical of the reactive conduct of the plaintiff whose safety he had imperiled ... 92     And, in G H L Fridman,The Law of Torts in Canada(Thomson Reuters, 3rd Ed, 2010), the learned author states, as follows (at p 378): The issue of negligence may also be affected by what has been termed “the agony of the moment” or “the agony of collision.” An act forced on a defendant by the emergence of a situation over which he or she had no control may not amount to a breach of the standard of care. Everything depends on whether the defendant reacted instantaneously to a difficult situation, and did so in a manner that was not inherently unreasonable given the circumstances and the necessity for some immediate action... In a moment of extreme peril and difficulty perfect presence of mind, accurate judgment and promptitude under all circumstances are not to be expected. The danger that produces the reaction must be imminent and unforeseen. When this is the case, conduct that might otherwise be called negligence will not attract liability. 93     Reference may also be made to the recent Canadian decision ofWormell v Hagen[2009] BCJ No 1717, where the British Columbia Supreme Court addressed the concept (at [1]–[2], [34]–[36]). Singapore and Malaysia 94     Perhaps one of the earliest (and possibly most oft-cited) modern statements of the doctrine of the “agony of the moment” in the Malaysian context may be found in the judgment of Raja Azlan Shah J (as he then was) in the Malaysian High Court decision ofGovindaRaju v Laws[1966] MLJ 188 (“GovindaRaju”), as follows (at 190): To my mind,when a plaintiff is perplexed or agitatedwhenexposed to danger by the wrongful act of a defendant,it issufficient if he shows as much judgment and control in attempting to avoid the accident as may reasonably be expected of him in the circumstances. To that extent I am satisfied that the plaintiff had so acted in the circumstances.What is done or omitted to be done inthe agony of the momentcannot fairly be treated as negligence. I therefore hold that there is no contributory negligence on the part of the plaintiffs. [emphasis added in italics and bold italics] 95     In the Malaysian Federal Court decision ofYeoh Cheng Han v Official Administrator, Malaya[1972] 2 MLJ 7, the court had to deal with an appeal relating to a road traffic accident between a motorcycle and a motor scooter. Gill FJ (with whom Suffian and Ali FJJ concurred) observed as follows (at 10): Moreover, the plaintiff testified that the scooter suddenly swerved towards its left.It was only when be was about three feet from the scooter that, in the agony of the moment in an attempt to save himself from the peril in which he was placed by the wrong action of the deceased, he swerved to the right in an endeavour to avoid the scooter, so that he cannot be said to have been guilty even of contributory negligence. For the reasons I have stated there was no inherent improbability in the evidence of the plaintiff, so that he was entitled to succeed, and I would hold accordingly. [emphasis added in bold italics] 96     In the Malaysian Federal Court decision ofLen Omnibus Company Bhd v North South Transport SdnBhd & anor[1978] 2 MLJ 246, the court heard an appeal against the trial judge’s decision apportioning liability between the parties. A tree had fallen and was lying across the lorry’s side of the road. The road on which the bus was travelling was clear. The lorry, in attempting to proceed past the fallen tree, went on to the bus’s side of the road and collided into the bus. The trial judge found that the lorry driver’s negligence was the substantial but not sole cause of the accident, and that the bus driver had also been negligent, and apportioned liability in the proportion 75%-25%. Raja Azlan Shah CJ (with whom Wan Suleiman and Chang Min Tat FJJ concurred) observed, as follows (at 248): In my opinion the submission of counsel for the appellants is correct. There is evidence that the bus driver had reduced speed considerably before the impact. He had seen the fallen tree. But he did not expect the on-coming lorry to encroach into his path in order to pass it. The bus driver driving his vehicle along a straight stretch of road and on his correct side was justified in assuming that the on-coming lorry would keep to its side and would not encroach into the former`s path.By so doing the lorry had put the bus into a situation of extreme peril and it is idle to say that if the bus driver had acted rashly in the agony of the moment he was guilty of contributory negligence. In those circumstances the bus driver was not expected to behave like a superman: (seeKR Taxi Service Ltd v Zaharah[1969] 1 MLJ 49 ). We are only too familiar with cases of collision being brought about by rashness owing to want of due, consideration as to the act to be done: (seeGovindaRaju v Laws[1966] 1 MLJ 188). I would reiterate the remark I made inLim Kor Bee v Abdul Latif bin Ismail[1978] 1 MLJ 109, 119: “The law is content to take the cavalier view that a driver of a motor car travelling along a main highway is under no duty to be on the look-out for anybody suddenly darting out into the road in a negligent and irresponsible manner.” There is no reasonable guarantee that if the bus had stopped a collision would have been avoided. The lorry may still have maintained its course on the incorrect side of the road. There is also doubt as to whether there was sufficient room to negotiate safely on the left grass side table. Some of the photographs and the sketch plan suggest there was but there is evidence that there were tall grass and trees immediately after it.Consequently I am unable to say with any degree of assurance that the appellants were guilty of contributory negligence. To hold, as the learned judge did, that it was negligent of the bus driver not to have stopped his vehicle some distance back when he saw the lorry coming towards him on its incorrect side of the road was not a finding which should have been, made nor should he be regarded as blameworthy in not going to the left grass side table in an endeavour to let the lorry pass. With all respect to the learned judge, I am unable to agree with his conclusion that, in the emergency which faced him, the bus driver acted negligently.Reference might be aptly made to a passage from the speech of Lord Dunedin inUS Shipping Board v Laird Line Ltd[1924] AC 286, 291 that “it is not in the mouth of those who have created the danger of the situation to be minutely critical of what is done by those whom they have by their fault involved in the danger”. I am constrained to say that the learned judge was wrong. [emphasis added in bold italics] 97     There have, in fact, been numerous Malaysian decisions dealing with the principle of the “agony of the moment”, many of which have also citedGovindaRaju. Indeed, in the Malaysian High Court decision ofChu Kim Sing v Abdul Razak bin Amin[1999] 6 MLJ 433, Abdul Malik Ishak J referred (at 456) toGovindaRajuas “the classical case”. 98     Turning to a sampling of Singapore cases, in the Singapore High Court decision ofOng Chan Tow v Regina[1963] MLJ 160, the appellant was convicted on a charge of causing death by negligent driving. In this case, the bus driven by the appellant collided with a car driven by the deceased. The bus had been emerging from a minor road. A V Winslow J, in dismissing the appeal against conviction and substituting the fine with an imprisonment sentence, observed as follows (at 162): If the bus had been turning right and had not quite completed the turn the driver of the oncoming car must, for obvious mathematical and psychological reasons, have been perplexed, if not confounded, by the act of the appellant which compelled him to choose between two alternative evils, not of his own making, to wit, squeezing through the space on the off-side of the bus which must have, at some stage, been almost literally blocking the correct side of the deceased’s road, or squeezing through the space on the near-side of the bus, i.e. between the bus and the grass verge.But this space was being so rapidly narrowed down that, in this dilemma, the deceased ran full tilt into the mid-front and near-side of the bus whilst attracted, in the agony of the moment, to what appeared to be the less destructive of the two alternatives. If this is accepted, as I think it can, the cause of the accident is clear. It was not any intervening negligence on the part of the deceased, as Mr Braga contended, but it was the original negligent act of the appellant in failing to stop at the junction and in taking the turn to his right in such a manner as to give the deceased no possible “escape route” from the dangers with which he suddenly found himself confronted on a major road where he undoubtedly had the right of way without any restriction on speed. [emphasis added in italics and in bold italics] 99     InTay KohYat Bus Co Ltd v Chua Chong Cher and others[1971-1973] SLR(R) 354, the Privy Council considered an appeal from the Federal Court of Malaysia (which had reversed the decision made by the trial judge in the High Court of Singapore). In doing so, Lord Pearson, delivering the judgement of the Board, stated as follows (at [25]–[26]): The reasons of the Federal Court appear to their Lordships to be open to criticism at several points. ... (c)As to the probabilities, their Lordships are of opinion that the probabilities are in favour of the bus-driver’s version. It seems quite clear that the bus-driver was driving on his proper side of the road before he made his abrupt swerve. If the motorcyclist had remained stationary in the middle of the road, all that the bus-driver had to do was to continue on his course and there would have been no collision or emergency or problem.Why did the bus-driver make his abrupt swerve to his offside into the territory of the oncoming traffic? There is no evidence or indication of the bus-driver being inexperienced or incompetent, and one would not expect a person employed to drive a bus to be lacking in experience or competence in driving. The only explanation which the evidence affords for the action of the bus-driver is that the motorcyclist swerved to the left across the path of the bus. If that happened, it does explain the swerve by the bus-driver - he was confronted with a sudden emergency, and in what has sometimes been called “the agony of the moment” he swerved to the offside in order to avoid running down the motorcyclist and probably injuring him fatally or very seriously.The trial judge was not wrong in accepting the evidence which afforded the only reasonable explanation of how the accident happened. ... Their Lordships will accordingly allow the appeals in both actions, set aside the judgments of the Federal Court and restore the judgments of the trial judge. [emphasis added in italics and bold italics] 100    In the Singapore High Court decision ofWee Soon Hian v Lai Ching Mow[1968-1970] SLR(R) 173, the court had to deal with a case where a passenger of a taxi, which had gone off the road onto a grass verge and had landed upside down in a drain, sued the driver in negligence. A V Winslow J, in dismissing the claim, held (at [7]–[9]): I am also satisfied that there was an oncoming car which he suddenly saw approaching him at speed on his own half of the road after he had completed the left-hand bend.This left him with no alternative except to try to minimise the impending disaster as best he could. I do not accept the suggestion that he should have been crawling round the bend as he reached it at a very low speed in order to avoid possible speed maniacs who might have been bent on entering the bend from the opposite direction by slicing it.He had driven on this particular route for a long time without mishap and even the plaintiff stated that on this particular night he had driven quite well from the 13th milestone until the accident. I am satisfied thatthe avoiding action taken by him was one which any reasonable user of the road, like himself, confronted with the same situation, ie a head-on collision through no fault of his own, could well have adopted on emerging out of this particular bend short of having to commit virtual suicide. In other words, I accept his explanation. The plaintiff’s claim cannot succeed from any point of view and is accordingly dismissed with costs. [emphasis added in italics and in bold italics] 101    In the Singapore High Court decision ofFoo Siang Him v Attorney-General[1983-1984] SLR(R) 586, the court had to decide a case relating to a fatal motorcycle accident. Lai Kew Chai J, in allowing the claim and finding the defendants entirely to blame for the accident, said (at [4]): Having regard to the police sketch plan, it is significant to note that the deceased had jammed the brakes of his motorcycle for some 15m and the motorcycle had remained on course. The deceased did not lose control of the motorcycle for some 15m. Having regard to this piece of hard evidence, I am satisfied that the deceased was able to control his motorcycle in a most difficult situation.I appreciate that the distance of 15m was not the entire braking distance, which was broken by the impact with the jeep.I am also not unmindful that this was a straight stretch of road, that visibility was good, but I find that the defendants had created a sudden danger by coming onto the road suddenly and blocking virtually the entire path of the deceased. It was no good to say he should have swerved to his right. His attempt to stop by braking to avoid the collision was an act of evasion that was a decision made in the agony of the moment and was reasonable in all the circumstances. [emphasis added in italics and in bold italics] 102    In the Singapore High Court decision ofSee Soon Soon v Goh Yong Kwang and another[1992] 1 SLR(R) 535, a case where a medical officer was knocked down by a lorry, Chan Sek Keong J (as he was then) discussed the principle of the “agony of the moment”, as follows (at [20]): Counsel also raised the defence of “agony of the moment”. He cited a number of authorities to show that a person who has acted in the agony of the moment should not be wholly blamed for the consequences of his act to save someone else or himself from injury. Here, the first defendant swerved to the left to avoid hitting the bus and injuring or killing the passengers in the bus. In my view, this defence is not relevant here as the evidence shows that it was not the bus driver but the first defendant who was responsible for placing himself in a position where he had to agonise what to do. 103    Turning to the facts of the present case, the Respondent was, in our view, responsible for placing the Appellant in a position in which he had to agonise over what to do in the most fleeting of timeframes. Having been placed in such a position, all that was necessary was that the Appellant’s conduct should not have been unreasonable, taking the exigencies of the particular situation into account. His choice to brake and swerve to the right could not be said to be unreasonable conduct in the light of the surrounding circumstances. In the dangerous circumstances the Appellant found himself in, his actions to attempt to save his own life were actions which a reasonably prudent man in his position would take. In his words:[note: 22] I wasn’t planning to overtake or swerve or do anything except avoid a serious accident... I didn’t really say “Oh, here’s a car, I’m going to go around it, er, and then I’m going to--- I don’t think about that. I was in survival mode and simply---and I was just turning and braking. Erm, at---at one point---point in this one or two second, I realised that I’m going to hit the car, er, and at that point, yah, I mean it was not---I---I---there was no thought of traffic rules or anything at that moment; I was trying to survive really. 104    At the very most, it might be said, with hindsight, that he had made an error of judgment. Indeed, the Appellant was candid enough in cross-examination to discuss his reflections on the decision that he made that fateful day (reproduced above at [72]).[note: 23] 105    However, even if it was an error of judgment, it was not culpable neglect. Indeed, the Judge appeared to have appreciated the difference between the two (see the GD at [24]): The want of care of a plaintiff such that he can be deemed to be part author of his own injury, must be distinguished from situations where in reaction to being placed in a position of danger, the plaintiff does something which with the benefit of hindsight, was less than optimum solution. In such situations, the court will assess the reasonableness of the course of action undertaken in the light of the circumstances, and in cases of motor accidents, a motorist will seldom be held liable for the outcome of a split second decision where a number of courses of action were open to him and each had potential disadvantages. 106    Having realised this, where the Judge was in error, with respect, was in finding that the Appellant was negligent in taking the evasive actions he did. Having examined the authorities and reviewed the facts, we were of the view that the Appellant’s actions were taken in the “agony of the moment”. He had acted reasonably in the circumstances and we find that there had been no negligence on his part in swerving to the right.",
        "“Greatly increased the risk of collision”": "107    With respect, there is little evidence that there was a substantial increase in the risk of collision. There was no evidence, expert or otherwise, which was led to show that, relative to the two other options, the option of swerving to the rightmarkedlyincreased the risk of collision. As the Appellant stated, the possibility of hitting the minibus was present in the two other options as well.",
        "Conclusion": "108    For the reasons set out above, we allowed the appeal, and found the Respondent to be 100% liable for the accident. 109    We awarded costs here and below to the Appellant, with the usual consequential orders.  [note: 1]Appellant’s Record of Appeal, Vol III (“3ARA”), p 136 at lines 10-17. [note: 2]Affidavit of Evidence-in-Chief of Leong Mei Kuen at [4]. [note: 3]3ARA, p 97 at lines 14-29. [note: 4]Ibid, at p 60 at lines 13-23; p 62 at 17-19, 28-30; at p 63 at 8-14, 21-26; p 71 at 27-29, p 72 at 1-2; p 81 at 12; p 82 at 20. [note: 5]Ibid, p 61 at lines 27-28; p 63 at 1. [note: 6]Ibid, p 61 at lines 26-29; p 62 at 31-32; p 81 at 25-28, p 82 at 14-18; p 87 at 29-32; p 88 at 1-2. [note: 7]Ibid, p 81 at line 19. [note: 8]Ibid, p 81 at lines 20-21, p 87at lines 5-9. [note: 9]Ibid, p 81 at lines 17-28, p 199 at 7-9; p 200 at 7-8. [note: 10]Ibid, p 88 at lines 12-15. [note: 11]Ibid, p 63 at lines 3-7, 27-31; p 71 at 11-13; p 83 at 3-7. [note: 12]Ibid, p 64 at line 4; p 72 at 10-11. [note: 13]Ibid, p 64 at lines 4-7, 15-16; p 72 at 8-10. [note: 14]Ibid, p 64 at lines 12-15; p 81 at 17. [note: 15]Appellant’s Core Bundle Vol II (“2ACB’) at p 104. [note: 16]Supran 3, at p 90 at lines 5–15. [note: 17]Ibid, p 17 at [5]. [note: 18]Ibid, p 89 at line 4. [note: 19]Ibid, p 90 at line 32, p 91 at lines 1-12. [note: 20]Ibid, p 75 at lines 5-30. [note: 21]Ibid, p 91 at lines 29-32, p 92 at lines 1-9. [note: 22]Ibid, p 189 at lines 18-25. [note: 23]Ibid, p 75 at lines 5-22."
    }
}