{
    "case_title": "Teleoptik-Ziroskopi and others\n      v\n      Westacre Investments Inc and other appeals",
    "ncitation": "[2012] SGCA 8",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "The background": "2       These appeals were the latest developments in a\n                    set of proceedings with a long and chequered history. These proceedings have, in\n                    one form or another, already appeared before this court twice previously (seeWestacre Investments Inc v The State-Owned Company\n                        Yugoimport SDPR (also known as Jugoimport-SDPR)[2009]\n                    2 SLR(R) 166). 3       It began on 28 February 1994, when Westacre\n                    Investments Inc (“the Judgment Creditor”) obtained an arbitral\n                    award in its favour. The Judgment Creditor subsequently commenced legal\n                    proceedings in England to enforce the award. On 13 March 1998, it obtained\n                    judgment against Yugoimport SPDR (“the Judgment Debtor”) from the\n                    English High Court for slightly more than £41.5 million. 4       The English judgment was registered in Singapore\n                    many years later on 5 October 2004. On 28 October 2004, a Mareva\n                    injunction was granted to freeze Deuteron (Asia) Pte Ltd’s\n                    (“Deuteron”) accounts with DnB Nor Bank ASA Singapore Branch\n                    (“the Bank”). According to Deuteron’s bank statements, the\n                    funds in these accounts (“the Funds”) amounted to more than US$17\n                    million as of March 2009. 5       On 28 April 2005, the Judgment Creditor\n                    took out Summons-in-Chambers No 2151 of 2005 (“SIC\n                    2151/2005”) and Summons-in-Chambers No 2152 of 2005 (“SIC\n                    2152/2005”) for provisional garnishee orders against the Bank and\n                    Deuteron respectively. The court issued garnishee orders to show cause a day\n                    later on 29 April 2005. However, the garnishee proceedings were stayed when\n                    the Judgment Debtor applied on 5 June 2005 to set aside the registration of\n                    the English judgment in Singapore. 6       The Judgment Debtor’s application went up\n                    all the way to this court and on 9 May 2007, it directed the Judgment\n                    Creditor to refer, to the English courts, the question of whether the English\n                    judgment remained enforceable in England. The English High Court subsequently\n                    ruled in the affirmative. On 30 December 2008, this court denied the\n                    Judgment Debtor’s application, and the garnishee proceedings\n                    resumed. 7       Various affidavits were filed on\n                    27 February 2009 and 27 March 2009 by Teleoptik–Ziroskopi,\n                    Zrak–Teslic, and Cajavec (collectively, “the Other\n                    Parties”), the Judgment Debtor and Deuteron. These affidavits stated that\n                    the money in Deuteron’s account with the Bank belonged to the Other\n                    Parties. 8       On 20 August 2009, the Judgment Debtor\n                    filed Summons No 4431 of 2009 (“SUM 4431/2009”) for an order\n                    that the garnishee proceedings be converted to a Writ action and tried. On\n                    11 September 2009, the Other Parties filed Summons No 4846 of 2009\n                    (“SUM 4846/2009”) seeking the same order. In response, the\n                    Judgment Creditor filed Summons No 5282 of 2009 (“SUM\n                    5282/2009”) seeking a summary determination in its favour on the issue of\n                    the Other Parties’ ownership of the Funds. Not to be outdone, the Other\n                    Parties filed Summons No 5377 of 2009 (“SUM 5377/2009”) on\n                    14 October 2009, seeking summary determination of the same issue but in its\n                    favour instead. On 4 November 2009, Deuteron, who had hitherto kept a low\n                    profile in this frenetic exchange, filed Summons No 5736 of 2009\n                    (“SUM 5736/2009”) for the garnishee proceedings to be converted to\n                    a Writ action. 9       All the applications to convert the garnishee\n                    proceedings to a Writ action were dismissed by the Judge on 24 August 2010.\n                    The remaining two applications for summary determination were adjourned for the\n                    filing of additional submissions. On 21 September 2010, the Judge agreed to\n                    give the Judgment Debtor time to procure and file further evidence: the deadline\n                    was set for 22 October 2010. The deadline came and went. On 2 November\n                    2010, the Judgment Debtor requested for an extension of time, which the Judge\n                    refused. 10     On 8 November 2010, the Judge confirmed\n                    his earlier orders made on 24 August 2010 to dismiss the applications to\n                    convert the garnishee proceedings into a Writ action. On 25 November 2010,\n                    the Judgment Debtor filed Summons No 5513 of 2010 (“SUM\n                    5513/2010”) seeking to admit the further evidence that it had originally\n                    failed to obtain by 22 October 2010. The Other Parties filed Summons\n                    No 5763 of 2010 (“SUM 5763/2010”) on 10 December 2010\n                    for the admission of essentially the same further evidence. These applications\n                    were dismissed by the Judge on 17 December 2010. 11     On 19 May 2011, the Judge summarily\n                    determined that the Funds belonged “wholly and exclusively” to the\n                    Judgment Debtor (Judgment at [72]). The interim garnishee orders dated\n                    29 April 2005 were accordingly made final.",
        "The present appeals": "12     As stated above (at[1]), CA 7/2011 and CA 9/2011 related to the\n                    Judge’s decision not to admit the further evidence (under SUM 5513/2010\n                    and SUM 5763/2010). The appellants to CA 7/2011 were the Other Parties. The\n                    appellant to CA 9/2011 was the Judgment Debtor. 13     CA 60/2011 and CA 63/2011 related to the\n                    Judge’s decision in the rest of the applications (under SIC 2151/2005, SIC\n                    2152/2005, SUM 4431/2009, SUM 4846/2009, SUM 5282/2009, SUM 5377/2009 and SUM\n                    5736/2009). The appellants to CA 60/2011 were the Other Parties. The appellants\n                    to CA 63/2011 were the Judgment Debtor and Deuteron.",
        "The Judgment Debtor, Deuteron, and the Other Parties’ version\n                of events": "14     The Judgment Debtor, Deuteron and the Other\n                    Parties submitted that the Other Parties are the beneficial owners of the Funds.\n                    To prove their claim, they relied on four documents (collectively “the\n                    1991 Agreements”): (a)     the Supply Contract: dated\n                        23 July 1991 between the Government Buyer and the Judgment\n                        Debtor; (b)     the\n                        Pre-Protocol: dated 21 October 1991 and concluded in Yugoslavia between\n                        the Judgment Debtor and Deuteron; (c)     the Commission Agreement: dated 12 December 1991 and\n                        concluded in Yugoslavia between the Judgment Debtor and the Other Parties;\n                        and (d)     the\n                        Protocol: dated 28 December 1991 and concluded in Singapore between the\n                        Judgment Debtor, Deuteron and the Other Parties. 15     At the time the Supply Contract was entered\n                    into, the Socialist Federal Republic of Yugoslavia (now no longer in existence,\n                    having fragmented into several independent states) was a socialist country\n                    tentatively embarking on market reforms. However, the Yugoslavian Government\n                    still regulated all military equipment contracts between buyers from foreign\n                    countries and domestic manufacturers. The Judgment Debtor (then known as the\n                    Federal Directorate of Supply and Procurement) had been set up as a government\n                    agency to act as an intermediary between foreign buyers and domestic\n                    manufacturers. The Judgment Debtor was the only agency that could legally enter\n                    into military equipment contracts with foreign buyers, unless a special licence\n                    had been granted by the State. The common arrangement was for the Judgment\n                    Debtor to negotiate, finalise and execute the contract with the foreign buyer,\n                    and to then have a corresponding commission agency agreement with the domestic\n                    manufacturers. The Judgment Debtor would work with the domestic manufacturers to\n                    negotiate with the foreign buyer on terms such as the subject of the contract,\n                    price, warranties and the delivery schedule. The Judgment Debtor could not\n                    conclude such a contract without the consent of the relevant domestic\n                    manufacturers, who were in charge of the technical documentation, prices and the\n                    supply of goods. The Judgment Debtor’s reward was a “commission\n                    fee” of about 2.5% of the contract price. 16     The Other Parties were Yugoslavian\n                    manufacturers of military equipment. They entered into negotiations with the\n                    Government of a foreign country (“the Government Buyer”) for the\n                    supply of military equipment. On 23 July 1991, the Judgment Debtor, in its\n                    role as the Other Parties’ commission agent, concluded the Supply Contract\n                    with the Government Buyer. The Judgment Debtor agreed to supply certain\n                    equipment and to grant the relevant licences. The total value of the contract\n                    amounted to US$54,391,249.06. 17     On 4 October 1991, pursuant to the Supply\n                    Contract, the Government Buyer paid an advance of US$10,631,624.72 to the\n                    Judgment Debtor. The payment was made to the National Bank of Yugoslavia in US\n                    currency, and immediately credited to the Judgment Debtor’s account with\n                    the National Bank of Yugoslavia in dinars. 18     At this point in time, the Other Parties faced\n                    a problem: the dinar was facing strong inflationary pressure. The advance\n                    payment had been made for the purpose of allowing the Other Parties to buy the\n                    necessary raw materials from outside Yugoslavia. Since the prices of the raw\n                    materials were to be paid in foreign currency, the Other Parties had to quickly\n                    convert the advance payment (stored in dinars) back into a safe currency –\n                    US dollars. But owing to the currency restriction controls in place in\n                    Yugoslavia at that time, the Other Parties did not have a foreign currency\n                    account. Neither did they have an approved (under Yugoslavian law) company\n                    abroad to hold foreign currency. 19     The solution hit upon by the Other Parties and\n                    the Judgment Debtor was for the latter to transfer the advance payment to the\n                    approved US dollar bank account of its affiliated company in Singapore –\n                    Deuteron (then known as FDSP (Asia) Pte Ltd) – which had been incorporated\n                    on 18 June 1991. Accordingly, the Pre-Protocol was concluded on\n                    21 October 1991 between the Judgment Debtor and Deuteron. The Supply\n                    Contract was referenced and the Other Parties were listed as “the\n                    subcontractors from [the Supply Contract] with an obligation to manufacture and\n                    deliver the goods”. Clause 4 of the Pre-Protocol also stated: The deposited amount shall be used exclusively for purchasing the raw\n                        materials, parts, assemblies, sub-assemblies and other goods for the needs\n                        of the [Other Parties]. The advance payment was subsequently transferred by the Judgment\n                    Debtor to Deuteron’s account with the Bank, with the latter receiving it\n                    on 18 November 1991. 20     The commission agency relationship between the\n                    Judgment Debtor and the Other Parties was described in the Commission Agreement\n                    dated 12 December 1991. The Commission Agreement merely formalised an oral\n                    or informal agreement made before the parties had entered into the Supply\n                    Contract four months earlier. Article 1 read: On July 23, 1991, [the Judgment Debtor] entered into [the Supply Contract]\n                        with the Ministry of Defence of [the Government Buyer] (herein after\n                        referred to as the: “Buyer”) on its own behalf and for the\n                        account of the Suppliers [iethe Other\n                        Parties]. The Contract between [the Judgment Debtor] and the Buyer is an integral\n                        part of the present contract and the parties hereto undertake to fulfill it\n                        under the terms and in the manner specified in the Contract concluded\n                        between [the Judgment Debtor] and the Buyer and in the present\n                        contract. 21     Article 3 referred to the payment of the\n                    advance payment and imposed accounting obligations on the Judgment Debtor and\n                    the Other Parties. Article 5.1.1 stated: Suppliers [iethe Other Parties] shall\n                        assume full responsibility for the quality of the Goods [to be delivered\n                        under the Supply Contract] and undertake to have their own and their\n                        sub-supplier’s products (and services) manufactured fully in\n                        compliance with the quality requirements specified ... Article 14 provided for a commission fee to be paid to the Judgment\n                    Debtor by the Other Parties. 22     On 28 December 1991, the Other Parties,\n                    the Judgment Debtor and Deuteron concluded the Protocol which detailed the\n                    mechanism by, and the purposes for which the advance payment would be paid out\n                    on the Other Parties’ instructions. Appendix 1 of the Protocol\n                    (“Appendix 1”) detailed each of the Other Parties’ share of\n                    the advance payment, and also stated the commission fees that were payable to\n                    the Judgment Debtor and Deuteron. 23     On 30 May 1992, the United Nations\n                    Security Council passed Resolution 757 of 1992. The Monetary Authority of\n                    Singapore (“MAS”) consequently issued a circular on 10 June\n                    1992 freezing any assets owned by the Federal Republic of Yugoslavia, its\n                    affiliated companies or its nationals. The Other Parties’ assets were\n                    hence frozen until MAS revoked its circular on 20 March 2009. 24     According to the Judgment Debtor, Deuteron and\n                    the Other Parties, the nature of the Commission Agreement was such that although\n                    the Judgment Debtor was the contracting party to the Supply Contract, the Other\n                    Parties (as the principal in the commission agency) had anin\n                        remright to any money that the Judgment Debtor received under\n                    the Supply Contract. Accordingly, since the Funds represented the advance\n                    payment made by the Government Buyer to the Judgment Debtor under the Supply\n                    Contract, the Other Parties should be treated as the beneficial owners of the\n                    Funds. For these reasons, they submitted that the final garnishee orders should\n                    be set aside.",
        "The Judgment Creditor’s response": "25     The substance of the Judgment Creditor’s\n                    position was a challenge of the authenticity of the Pre-Protocol, Commission\n                    Agreement and Protocol. It seemed to accept that a Supply Contract had been made\n                    between the Government Buyer and the Judgment Debtor, but contended that the\n                    Other Parties were at best onlysub-contractors,\n                    and not the principals in a commission agency. 26     The Judgment Creditor made certain\n                    observations to support its contention. It first pointed out that although the\n                    Funds had been subjected to a Mareva injunction since 28 October 2004 and\n                    garnishee proceedings started in April 2005, it was only on 5 December 2005\n                    that the Judgment Debtor asserted the Other Parties’ ownership of the\n                    Funds. In other words, the court was being invited to draw an adverse inference\n                    from the Judgment Debtor’s initial silence. 27     The Judgment Creditor also observed that the\n                    Other Parties had been described by the Judgment Debtor on 5 December 2005\n                    as “sub-suppliers”. There was no mention of a commission agency\n                    relationship at that point in time. The Other Parties had similarly been\n                    described as “sub-contractors” in the Pre-Protocol. It was only in\n                    March 2009 that a commission agency was alleged for the first\n                time. 28     The doubtful state of the Commission\n                    Agreement’s existence was, according to the Judgment Creditor, further\n                    reinforced by the fact that it came into being several months after the Supply\n                    Contract had been entered into and moreover, almost one monthafterthe Judgment Debtor had already transferred the advance\n                    payment into Deuteron’s accounts. It rejected the Judgment Debtor’s\n                    explanation that an oral commission agreement had already been in place before\n                    the Supply Contract was concluded as an uncorroborated\n                afterthought. 29     The Judgment Creditor also submitted that the\n                    Protocol was never accepted, implemented or observed. For example, paragraphs 3\n                    and 4 of the Protocol required the Funds to be earmarked, but the Judgment\n                    Debtor and the Other Parties conceded this was never done. They also accepted\n                    that numerous accounting requirements stipulated by the Protocol were never\n                    complied with. 30     The Judgment Creditor noted the absence of any\n                    documentation before 2009 referring toanyof the\n                    1991 Agreements. It seemed to suggest that the absence of such evidence\n                    indicated that the 1991 Agreements never governed the relationship between the\n                    Judgment Debtor, Deuteron and the Other Parties. 31     The Judgment Creditor also relied onpositiveevidence to prove that the Funds belonged to\n                    the Judgment Debtor and not the Other Parties. It exhibited the following\n                    documents, the existence of which was not contested, which stated that the\n                    garnished Funds “belong wholly and exclusively to [the Judgment\n                    Debtor]”: (a)     a shareholder resolution of Deuteron\n                        dated 8 April 1999; and (b)     Deuteron’s audited Financial Statements from 1998\n                        up to 2008. 32     There was also a letter from Deuteron’s\n                    solicitors dated 3 November 2004 where it was stated that\n                    “[Deuteron] has confirmed that a sum of USD14,925,995.59 or thereabouts\n                    stands to credit of [the Judgment Debtor] in [the Bank]”. Finally, there\n                    was an affidavit filed by Deuteron on 10 November 2004 which stated that\n                    the Funds are “held by Deuteron for and on behalf of [the Judgment\n                    Debtor]”. 33     The Judgment Creditor submitted, on the\n                    strength of these documents, that Deuteron had admitted that the Funds were\n                    owned by the Judgment Debtor. In the alternative, the Judgment Creditor\n                    contended that even if the 1991 Agreements were authentic, two of the Other\n                    Parties had failed to establish that they were the same entities as (or the\n                    legal successor of) the parties mentioned in the 1991 Agreements. Further, and\n                    in any event, there was no evidence to support the contention that the Funds did\n                    in fact represent the advance payment made by the Government Buyer under the\n                    Supply Contract. 34     For these reasons, the Judgment Creditor\n                    submitted that the final garnishee orders should be affirmed.",
        "Why summary determination was not appropriate": "35     It is important to bear in mind that the\n                    present appeals stemmed from a summary determination by the Judge. In the\n                    context of a summary determination, the Judgment Debtor, Deuteron and the Other\n                    Parties only had to put up an arguable defence that ought to be resolved at\n                    trial. The heart of these appeals was simply whether the Other Parties, who said\n                    the Funds belonged to them, should be allowed their day in court to prove that\n                    claim. 36     Generally speaking, there are two ways in\n                    which a defence may be shown to be hopeless. The first is if it is unsustainable\n                    on a cursory examination of the facts. The second is, assuming it is arguable on\n                    the facts, it nonetheless has no basis in law. The Judge appeared to proceed on\n                    the implied assumption (without making a finding of fact) that even if the facts\n                    were as stated by the Judgment Debtor, Deuteron and the Other Parties, their\n                    defence failed as a matter oflaw. In coming to\n                    this result, the Judge’s first step was to decide that Indian law governed\n                    the Supply Contract and Commission Agreement, and that Singapore law governed\n                    the Pre-Protocol and Protocol (Judgment at [32]–[38]). 37     We pause here to observe that we had serious\n                    doubts over the Judge’s approach in finding that the Commission Agreement\n                    was governed by Indian law. According to the Judgment Debtor and the Other\n                    Parties, it was an agreement between Yugoslavian parties, executed in Yugoslavia\n                    and was necessary under Yugoslavian laws or regulations (see[15]above). Given that Article 11.1 of the\n                    Commission Agreement, which stated that any dispute “shallbe resolved by a regular court in Belgrade”\n                    [emphasis added], was in the nature of an exclusive jurisdiction agreement,\n                    these factors cumulatively suggested that the parties’ intention had been\n                    to subject the Commission Agreement to Yugoslavian law: seePacific Recreation Pte Ltd v S Y Technology Inc and another\n                        appeal[2008] 2 SLR(R) 491 at [37]–[40]. 38     But the weight to be placed on these factors\n                    could be determinedonlyifthe Judge decided whose version of events he accepted. If the\n                    Judge accepted the Judgment Creditor’s contentions that the Commission\n                    Agreement was a sham, then clearly these factors would have little, if any\n                    weight. Alternatively, if the Judge accepted that the Commission Agreement had\n                    been legitimately entered into out of necessity under Yugoslavian law, then the\n                    factors described above would more strongly evidence the parties’\n                    intentions that Yugoslav law should apply. The role that the Judgment Debtor\n                    played as commission agent envisaged it acting for domestic manufacturers in\n                    various transactions involvingdifferentforeign\n                    buyers. In such a situation, the one constant was the commission agency\n                    relationship and the rights and obligations it created. It seemed unthinkable\n                    that the parties would intend the legal nature of the commission agency\n                    relationship to fluctuate depending on who the foreignbuyerwas. For example, assume the Judgment Debtor concluded\n                    another military equipment contract with Ruritania on behalf of the Other\n                    Parties. Why would the Other Parties and the Judgment Debtor intendtheirrelationship to be governed by Indian law in one\n                    transaction, and by Ruritanian law in the other? 39     Since the Judge declined to make a finding as\n                    to whose version of events he accepted, it was impossible to decide how much\n                    weight these factors should have in determining the proper law of the Commission\n                    Agreement. For this reason, we were unable to assess the correctness of his\n                    conclusion that Indian law applied to the Commission Agreement. 40     The Judge thereafter held that the Judgment\n                    Debtor was not a trustee of the Funds under Indian law (Judgment\n                        at [39]–[54]) and that\n                    neither had a trust been created over the Funds in favour of the Other Parties\n                    under Singapore law (Judgment at [55]–[64]). For these reasons, he\n                    found that summary determination was appropriate because there was noprima facieevidence of a trust. 41     We were unable to agree with the Judge that\n                    summary determination was appropriate. Our disagreement with the Judge’s\n                    approach to determining the proper law of the Commission Agreement was just one\n                    example of how the present case wasnotone where\n                    the issues of fact and law could be neatly separated. This was essentially\n                    because the legal issues that would arise would largely depend on the\n                    facts. 42     We would also add that the Judge seemed to\n                    have placed undue emphasis on the documents of Deuteron (see[31]above) to find that the Funds belonged to the\n                    Judgment Debtor. This was because the critical document was the Commission\n                    Agreement which described the relationship between the Judgment Debtor and the\n                    Other Parties. Also, contrary to the views of the Judge who thought that the\n                    Funds could not be held by the Judgment Debtor on trust for the Other Parties\n                    because there were no explicit allocations of the Funds among the Other Parties,\n                    Appendix 1 did expressly spell out how much of the Funds belonged to each of the\n                    Other Parties (see above at[22]).\n                    Appendix 1 also spelt out the precise amount of the Funds which were payable to\n                    the Judgment Debtor as its commission. As mentioned above (at[23]), the Funds remained in the account because\n                    they had been frozen by MAS. As a result, everything under the Supply Contract\n                    came to a halt. 43     Finally, there were other queries we had that\n                    could not be resolved in a factual vacuum. Although not raised by the parties,\n                    some of these were whether the Supply Contract had been frustrated under its\n                    proper law; what the effect was of frustration under that proper law; and who\n                    the owner was of the Funds if the Supply Contract had been frustrated. To expand\n                    on the importance of these questions, it seemed arguable to us that if the\n                    Supply Contract had been frustrated and the Judgment Debtor came under an\n                    obligation to return the Funds to the Government Buyer, then there was a risk\n                    that the Judgment Debtor would be made liable twice for the same debt: once to\n                    the Judgment Creditor under the garnishee order, and once to the Government\n                    Buyer under the Supply Contract’s proper law. This would be an oppressive\n                    result and a strong reasonnotto exercise the\n                    court’s discretion to make the garnishee order absolute: see,eg,SociétéEram Shipping Co Ltd v Cie International de Navigation and\n                        others[2004] 1 AC 260 at [26].",
        "Conclusion": "44     Counsel for the Judgment Creditor forcefully\n                    emphasised the cost already incurred and the delay caused in these proceedings\n                    by the procedural steps taken by the Judgment Debtor to resist enforcement. He\n                    submitted that his opponents’ defence was a blatant attempt to grind the\n                    Judgment Creditor down through attrition, achieving victory through delay. What\n                    counsel for the Judgment Creditor and the Judge seemed to have overlooked was\n                    the fact that the Other Parties had no part in the previous procedural wrangles\n                    initiated by the Judgment Debtor. Their interests should not be affected by the\n                    tactics of the Judgment Debtor. It could be the case that the Other Parties were\n                    simply puppets employed by the Judgment Debtor to prolong these proceedings, but\n                    that was not something we could assume without clear evidence. 45     While we understood the concerns raised by the\n                    Judgment Creditor, the fact remained that there were issues of fact which ought\n                    to be established and resolved at a trial. The Judge was certainly not wrong to\n                    say at the start of his judgment that “there is only one core issue to be\n                    answered: who possesses beneficial ownership of [the Funds]” (Judgment\n                        at [1]). But the answer to this\n                    issue would in turn depend on the authenticity of the 1991 Agreements as well as\n                    the construction to be placed on them, in particular the Commission Agreement.\n                    The crux of the matter was that the Other Parties should not be deprived of\n                    their day in court to show that they owned the beneficial interest in the Funds.\n                    Thus, there was the need for a trial. Accordingly, we allowed the appeals in CA\n                    60/2011 and CA 63/2011 and set aside the order making the garnishment\n                    absolute."
    }
}