{
    "case_title": "The Singapore Professional Golfers’ Association \n      v\n      Chen Eng Waye and others",
    "ncitation": "[2013] SGCA 18",
    "coram": "Andrew Phang Boon Leong JA; \n      V K Rajah JA; \n      Sundaresh Menon JA (as he then was)",
    "sections": {
        "Introduction": "1       This is an appeal against the decision of the High Court judge (“the Judge”) in Suit No 290 of 2011 (“Suit 290”) concerning an action in passing off. The appellant, the Singapore Professional Golfers’ Association (“the Appellant”), is a non-profit golfing association that was registered in Singapore under the Societies Act (Cap 262, 1970 Rev Ed) in 1973.[note: 1]Its initials are “SPGA” and its shortened name is “Singapore PGA”. Its objectives include promoting the sport of golf in Singapore and also promoting the interests of its professional golfer members. The Appellant’s constitution provides for four categories of membership: “professionals”, “associate professionals”, “senior professionals” and “teaching professionals”.[note: 2]The Appellant organises activities, including tournaments, seminars, courses and tests[note: 3]for its members. 2       The Appellant brought Suit 290 against three defendants, who are the respondents in this appeal (collectively, “the Respondents”), in respect of their use of an allegedly similar name and set of initials as the Appellant’s. The action was dismissed by the Judge and his judgment is reported asThe Singapore Professional Golfers’ Association v Chen Eng Waye and others[2012] 3 SLR 699 (“the Judgment”). 3       The first respondent, Chen Eng Waye (“the 1stRespondent”), is a professional golfer[note: 4]who had been a member of the Appellant for a period that was a little less than two years when he was suspended from such membership for a year on 12 July 2007.[note: 5]The suspension was imposed as a result of his participation in a golf tournament that was not sanctioned by the Appellant.[note: 6]While he was suspended, the 1stRespondent informed the Appellant in writing on 10 December 2007 that he wished to terminate his membership.[note: 7]The Appellant accepted his resignation on 31 January 2008.[note: 8]The second respondent, Chen Xiangyi Roy (“the 2ndRespondent”), is the son of the 1stRespondent, and they are both partners of the third respondent (“the 3rdRespondent”). 4       The 3rdRespondent is a business entity. The 1stand 2ndRespondents formed and registered the 3rdRespondent as a limited liability partnership on 25 November 2010.[note: 9]The 3rdRespondent is named “Singapore Senior PGA LLP” and its initials are “SSPGA”. The 3rdRespondent’s activities include organising golf tournaments and golf-related activities.[note: 10]",
        "Background": "5       The background to the dispute can be set out quite briefly. 6       In January 2011,[note: 11]shortly after it had been registered, the 3rdRespondent advertised that it would conduct a Senior Professional Qualifying Test on 22 March 2011 and 23 March 2011. The test was to be run exclusively for senior golfers. About nine members of the public registered for this test.[note: 12]Very soon after this, in February 2011, the Appellant also announced that it would conduct a test for golfers aged 50 and above to qualify as senior professional golfers.[note: 13]Its test was scheduled to be held on 9 March 2011 and 10 March 2011.[note: 14] 7       On 1 March 2011,[note: 15]the Appellant’s solicitors issued a cease-and-desist letter to the Respondents. By it, the Respondents were asked, among other things, to stop using the name “Singapore Senior PGA” as well as to publish an apology and agree to pay damages and costs. 8       The Respondents’ then solicitors responded on 21 March 2011[note: 16]stating, amongst other things, that the Appellant had no goodwill in senior professional golfing activities at the material time. The Respondents further stated that the Appellant did not engage in the testing and certification of senior professional golfers and was not set up to promote the interests of senior professional golfers exclusively.[note: 17]They also took the position that the Appellant’s name was not distinctive. Finally, the Respondents contended that in any event, there had been no misrepresentation on their part. Nonetheless, although the Respondents disagreed with the Appellant’s position, the 3rdRespondent did not proceed with the Senior Professional Qualifying Test that it had planned to hold.[note: 18] 9       On 4 April 2011, the 3rdRespondent successfully registered the mark “Singapore Senior PGA” and its logos[note: 19]on the Singapore trade mark register. These trade marks still remain on the register. 10     On 25 April 2011, the Appellant commenced Suit 290 in the High Court, bringing a claim for the tort of passing off against the Respondents. The tort was said to be constituted by the Respondents’ allegedly unauthorised use of a name that was identical with or substantially similar to the Appellant’s name in both its full and shortened forms as well as its initials, giving rise to an actionable misrepresentation.[note: 20]",
        "The decision below": "11     The Judge held that: (a)     The Appellant did have a “measure of goodwill” in relation to professional golfing activities at the relevant date (the Judgment at [22]). This goodwill was not confined to non-senior professional golfers’ activities (the Judgment at [21]). Rather, the Appellant had sufficient goodwill in golfing activities generally so as to be able to maintain the action. (b)     The Appellant’s claim failed because of its inability to establish any misrepresentation by the Respondents. This was so because: (i)       The Appellant’s name in both its full and shortened forms consisted of ordinary words that were descriptive in nature. Its initials were also descriptive (the Judgment at [29] and [35]). (ii)       The Appellant could not show that its name and initials had acquired a secondary meaning such that either had become distinctive (the Judgment at [38]–[39], [42] and [48]). (iii)       There were sufficient minor differences between the Appellant’s name and the 3rdRespondent’s name, specifically, “Senior” and “LLP”, which were not found in the Appellant’s name, and, further, the Respondents had taken additional measures to distinguish the 3rdRespondent’s business from the Appellant’s (the Judgment at [51] and [55]). (iv)       The relevant segment of the public (including professional golfers and amateurs who might want to become senior professional golfers) comprised knowledgeable individuals, and given the high literacy generally in Singapore as well as of such persons in particular, the relevant segment of the public was unlikely to be confused and be led to believe that the 3rdRespondent was connected to the Appellant (the Judgment at [55]). Moreover, the Appellant did not adduce any evidence of actual confusion (the Judgment at [53]). (v)       The Appellant’s allegation of bad faith on the part of the 1stand 2ndRespondents in their choice and the use of the 3rdRespondent’s name and initials failed (the Judgment at [58]). (c)     There was no need to consider whether damage was likely to be suffered by the Appellant, given that no misrepresentation had been established (the Judgment at [60]).",
        "The parties’ cases": "12     As noted above, the Judge found that the Appellant did have goodwill in relation to professional golfing activities in general. But, to succeed in its claim, the Appellant had to prove that there had been an actionable misrepresentation by the Respondents. Specifically, the Appellant had to establish that the Respondents’ allegedly tortious acts were such as to deceive the relevant segment of the public, leading them to think that the Respondents’ activities were either those of the Appellant or were in some way connected with them:Mobil Petroleum Co, Inc v Hyundai Mobis[2010] 1 SLR 512 (“Hyundai Mobis”) at [51]–[52];CDL Hotels International Ltd v Pontiac Marina Pte Ltd[1998] 1 SLR(R) 975 (“CDL Hotels”). In this context, the Appellant contended that its name was distinctive, and that any differences between the Appellant’s and the 3rdRespondent’s respective names and initials did not avert the likelihood that the relevant segment of the public would be deceived.[note: 21]It also submitted that the Respondents had acted in bad faith in choosing a name for the 3rdRespondent that was so similar to that of the Appellant.[note: 22] 13     As such, the Appellant submitted that there was an actionable misrepresentation on the part of the Respondents as the relevant sector of the public would think that the Appellant and the 3rdRespondent were one and the same or were somehow connected,[note: 23]and the Appellant was likely to suffer damage as a result. The Appellant also submitted that the 1stand 2ndRespondents were personally liable because of their involvement in the events leading to the establishment and naming of the 3rdRespondent, and the use of the allegedly offending name and initials in conjunction with the 3rdRespondent’s activities.[note: 24] 14     The Respondents’ case is that there is no confusing misrepresentation on the facts of this case, and that the Judge was right to find as he did. The Respondents argued that the Appellant’s name (in both its full and shortened forms) and initials were merely descriptive in nature, and that when all the relevant factors were given due consideration, there was no real likelihood of confusion or deception, especially having regard to the minor differences that distinguished the 3rdRespondent’s name and initials from the Appellant’s. The 1stand 2ndRespondents also asserted an absence of any bad faith on their part in selecting the 3rdRespondent’s name. 15     Further, the Respondents contended that no damage had been or was likely to be caused to the Appellant’s goodwill on the facts. In any event, they maintained that even if the 1stand 3rdRespondents were to be found liable for passing off, there could be no personal liability on the part of the 2ndRespondent as he had not been involved in the activities of the 3rdRespondent.[note: 25]",
        "The issues before this court": "16     Because the Judge found that the Appellant had goodwill in its name, the key issue before us is whether the choice and the use of the 3rdRespondent’s name,ie, “Singapore Senior PGA LLP”, and its initials, “SSPGA”, constituted a misrepresentation. For this purpose, the effect of the misrepresentation must be to deceive the relevant segment of the public into thinking that the 3rdRespondent’s goods, services or activities are also those of the Appellant, or that there is an economic link or association between them. As will be seen, this is more likely to be found to be the case if the Appellant’s name (and/or its initials) is found to be highly distinctive of the Appellant’s goods and services (Lionel Bently & Brad Sherman,Intellectual Property Law(Oxford University Press, 3rd Ed, 2009) (“Bently & Sherman”) at pp 760–761), or has come to acquire a secondary meaning so that it is clearly identified and sufficiently associated with the Appellant’s goods and services. In this connection, it will also be relevant to consider whether there are sufficient differences between the Appellant’s and the 3rdRespondent’s respective names and initials that would serve to distinguish them and obviate the likelihood of the relevant segment of the public being deceived. Finally, it may also be relevant to consider whether the 1stand 2ndRespondents acted with bad faith in selecting the 3rdRespondent’s name and initials. 17     If the issue of misrepresentation is resolved in favour of the Appellant, it will be necessary to consider whether the Appellant suffered or is likely to suffer damage consequent upon this misrepresentation. This was an issue that the Judge did not reach in view of his finding that the Appellant had failed to establish any misrepresentation by the Respondents. 18     Finally, if this stage is reached, we would also have to determine whether personal liability would lie on the part of each of the 1stand 2ndRespondents in their capacity as partners of the 3rdRespondent.",
        "Our decision": "",
        "Overview": "19     The tort of passing off is concerned with the protection of goodwill. Its three basic elements were spelt out by Lord Oliver of Aylmerton inReckitt & Colman Products Ltd v Borden Inc and Others[1990] WLR 491 (“Borden”) at 499 as follows: ... The law of passing off can be summarised in one short general proposition–no man may pass off his goods as those of another. More specifically, it may be expressed in terms of the elements which the plaintiff in such an action has to prove in order to succeed. These are three in number. First, he must establish a goodwill or reputation attached to the goods or services which he supplies in the mind of the purchasing public by association with the identifying “get-up” (whether it consists simply of a brand name or a trade description, or the individual features of labelling or packaging) under which his particular goods or services are offered to the public, such that the get-up is recognised by the public as distinctive specifically of the plaintiff’s goods or services. Secondly, he must demonstrate a misrepresentation by the defendant to the public (whether or not intentional) leading or likely to lead the public to believe that goods or services offered by [the defendant] are the goods or services of the plaintiff. Whether the public is aware of the plaintiff’s identity as the manufacturer or supplier of the goods or services is immaterial, as long as [these] are identified with a particular source which is in fact the plaintiff. ... Thirdly, he must demonstrate that he suffers or, in a quia timet action, that he is likely to suffer damage by reason of the erroneous belief engendered by the defendant’s misrepresentation that the source of the defendant’s goods or services is the same as the source of those offered by the plaintiff. 20     As a first step, a claimant will therefore have to show that there is goodwill attached to its product or service before a claim in passing off can be mounted. The inquiry at this stage might perhaps best be understood in terms of whether the claimant has established that it does have an interest that the law of passing off will protect. The second inquiry is whether the defendant’s actions amount to a misrepresentation that its goods are the claimant’s goods or emanate from a source that is economically linked to the claimant, or, to put it another way, whether the defendant is “passing off” its goods or services as those of the claimant. This typically begins with a consideration of how the defendant is said to be doing this. In general, it will entail the use of some element that serves as a badge or identifier marking the goods or services in question as emanating from the claimant (see also Christopher Wadlow,The Law of Passing-Off: Unfair Competition by Misrepresentation(Sweet & Maxwell, 4th Ed, 2011) (“The Law of Passing-Off”) at paras 3-005 and 8-001). It will be necessary here to consider whether that element does serve as a badge or identifier, or, in the parlance of the action, whether it is “distinctive” of the claimant’s goods and services, and whether the claimant’s goodwill (established under the first stage of the inquiry) is in fact associated with that element. It will then be necessary to consider, amongst other factors, whether there is such a similarity between the corresponding element that is being used by the defendant on the one hand and by the claimant on the other such that in all the circumstances, it is sufficiently likely to result in the relevant segment of the public being deceived or confused into thinking that the defendant’s goods or services are, or emanate from a source that is linked to, the claimant’s. Finally, because the tort of passing off is concerned with the protection of goodwill, it will be necessary to establish that the defendant’s misrepresentation has damaged or is likely to damage the claimant’s goodwill. We turn to consider each of these inquiries.",
        "Goodwill": "21     Goodwill has been described as “the attractive force which brings in custom”:The Commissioners of Inland Revenue v Muller & Co’s Margarine, Limited[1901] AC 217 at 224. It connotes the magnetic quality of the product and its association with the claimant such that customers return and patronise the same business, or purchase the same product or other products from the same brand:Bently & Shermanat p 729. The goodwill in question is the integral feature of the relationship between a trader and his customers that the tort of passing off seeks to protect. The action for passing off is not directly concerned with the protection of a mark, logo or get-up of a business. That is more the province of the law of trade marks. Rather, passing off is concerned with protecting the goodwill between a trader and his customers:CDL Hotelsat [45]. 22     A trader’s goodwill is also to be distinguished from his reputation. As this court has stated previously inCDL Hotelsat [46], goodwill cannot exist on its own, but instead attaches to a business in the jurisdiction and is manifested in the custom that it in fact enjoys. Reputation, on the other hand, can exist without a supporting business relationship:CDL Hotelsat [46]. Because goodwill is not an abstract concept but, rather, one that describes the state of a trader’s relationship with his customers, it is often proved by evidence, including that of the trader’s sales, or the expenses incurred in promoting his goods and services in association with the mark or brand that they bear. 23     Although the tort of passing off is most often associated with the goodwill of traders, the protection it confers can and does extend to non-commercial organisations. Thus, passing off claims are not unknown where the claimant happens to be an association consisting of members bound by a common interest, even if the interest happens to be predominantly non-commercial in nature (see, for example,The Chinese Calligraphy Society of Singapore v Khoo Seng Kong[2008] SGHC 121). Such associations typically benefit from and indeed depend upon “voluntary membership, subscriptions, donations or support” (The Law of Passing-Offat para 3-022). Such support reflects the magnetic force of the particular association in question, and this constitutes goodwill which can be damaged by a misrepresentation that amounts to passing off:The Law of Passing-Offat para 3-022. As noted inThe Law of Passing-Offat para 3-042: Any voluntary non-charitable association attracts and retains members by offering services to its members which are otherwise unobtainable, or at least are more effectively or economically provided by the association rather than by its members acting individually or collectively through ordinary contractors on a commercial basis. To this extent, at least, theassociation enjoys goodwill with respect to its members, actual and potential, in respect of the services it provides or offers to them, as has implicitly been recognised since as early asSociety of Accountants and Auditors v Goodway. …Associations may, or may not, also provide services to non-members or to the general public and enjoy a wider goodwill from these operations. ... [emphasis added] Therefore, an association of members bound by a common interest (whether of a commercial or non-commercial nature) may undoubtedly bring an action in passing off against another entity which misrepresents itself as the claimant association itself or as being associated with it and so threatens to damage the claimant association’s goodwill. 24     As we have noted above (at [11(a)]), the Judge found (at [22] of the Judgment) that the Appellant did have a measure of goodwill, and that this extended to professional golfers’ activities generally and was not limited to activities that pertained only to senior professional golfers. This was not seriously challenged before us.",
        "Misrepresentation": "25     In that light, we turn to the central question which was in issue between the parties in the appeal, namely, that of misrepresentation. The emphasis on misrepresentation, as explained inBently & Shermanat p 745, arises from the fact that the tort of passing off finds its historical origins in the common law action for deceit. Misrepresentation in the tort of passing off can take many forms, but a common form is where the defendant, by its choice of mark or name, misrepresents to the relevant segment of the public that its goods or services are actually those of, or are related to or associated with the claimant’s. To put it another way, the question may be asked whether the defendant is tapping on the claimant’s established goodwill by using the mark, name or get-up in question.",
        "Is the Appellant’s goodwill associated with its name or initials?": "26     The learned authors ofBently & Shermanexplain the particular connection between the tort of passing off and the goodwill that subsists in the business and is associated with the claimant’s name or logo as follows (at p 729): The law of passing-off is concerned with goodwill when it manifests itself in certain ways. Passing-off is usually concerned with the signs or ‘badges’ that are understood as indicating that a product or service emanates from a particular trade source. These ‘badges’ can take a variety of forms. Typically, passing-off is concerned with the goodwill that arises in relation to the name, symbol, or logo that has been employed by a trader and thus has come to be associated with the business. ... 27     The goodwill that subsists in relation to an organisation’s business is commonly associated with its name, or its sign or other badge of identity because this becomes a proxy for the organisation, and the name or badge in question serves to distinguish the products or services of that organisation from those of another. 28     It is, however, important to emphasise that what the tort of passing off seeks to protect is not the use of a mark or nameper se; rather, it prohibits the tortfeasor from misrepresenting his goods as if they are, or are connected to the claimant’s goods. When he does this by using a name or mark or choice of words that is associated with the claimant, it is the actual or prospective damage to the claimant’s goodwill or business that the tort of passing off seeks to prevent, even though the focus of the inquiry shifts to the tortfeasor’s use of the name or mark in question. A threshold question that arises in such cases is whether the claimant’s goodwill is sufficiently associated with its name or with the logo or mark that it uses, or, to put it another way, whether that logo, mark or name is distinctive of the claimant’s goods and services. 29     The use of a name or a choice of words that is either meaningless or has no discernible correlation to the product or service in question or its key elements – in short, a fancy word – generally serves no purpose other than as a mark or badge of the origin or source of that product or service. The author ofThe Law of Passing-Offat para 8-075 describes a fancy word as “one which has no obvious relevance to the character or quality of the goods or business in relation to which it is used, such as ‘Eureka’ for shirts, ‘June’ for toiletries, and ‘Puffin’ or ‘Penguin’... for chocolate-coated sandwich biscuits” (see alsoOffice Cleaning Services, Ltd v Westminster Office Cleaning Association[1944] 2 All ER 269 at 270). Unsurprisingly, this court inLifestyle 1.99 Pte Ltd v S$1.99 Pte Ltd (trading as ONE.99 SHOP)[2000] 1 SLR(R) 687 (“Lifestyle 1.99”) at [27] accepted the proposition advanced inThe Law of Passing-Offthat “distinctiveness is very much more easily acquired for fancy words”. 30     But, sometimes, a name may be nothing more than a mere description of the activities of an organisation that does little to distinguish its products as those emanating from a particular organisation. This inevitably presents a difficulty because merely descriptive words tend just to describe their subject and may not readily be understood to be distinctive of the claimant or to denote the source of the goods, activities or services in question, and also because the law resists granting a legal monopoly over words of general usage. 31     The learned authors ofBently & Shermanexplain this point thus (at p 730): While it is possible for a descriptive term to become associated with a claimant, the courts are extremely reluctant to allow a person to obtain a monopoly in descriptive words. In part, this is because policy considerations favour allowing other traders to make use of words that are part of the common stock-in-trade. It is also because in relation to descriptive words, it will be more difficult for a trader to show that the words indicate source, rather than what they ordinarily describe. In short, the more descriptive the words are of the goods or services which the trader sells, the more difficult it will be to establish the existence of goodwill attaching to those words. ... For a trader to show that they have goodwill in a descriptive word, the trader needs to demonstrate that the words have acquired a secondary meaning not only of goods or services of that description, but also specifically of the goods or services of which they are the source. It is also necessary to show that descriptive terms are distinctive of one source. Thus, where two publishers are competing to launch magazines with a title such asLeisure News, it is unlikely that either will be able to bring a passing-off action until the magazine has been in the market-place for a sufficient period of time to build up a public association between the name and a particular source. ... 32     Thus, the cases recognise that words that are merely descriptive to begin with can become so associated with a particular claimant’s business as to become distinctive. To put it another way, a name that is no more than a word or a collection of words that describes a product or service in a generic way may yet become distinctive when it acquires a “secondary meaning”,ie, when these words become closely associated with and, thus, distinctive of the claimant’s business:Lifestyle 1.99at [27]. But, the burden of establishing this tends to be a heavy one:Lifestyle 1.99at [37]. 33     InFrank Reddaway and Frank Reddaway & Co, Limited v George Banham and George Banham & Co, Limited[1896] 1 AC 199 (“Reddaway”), the claimant’s product was termed “camel hair belting”. The words “camel hair belting”, though descriptive of the material used for the claimant’s goods, were held to have acquired a secondary meaning, thus distinguishing the product as that of the claimant. The words did not merely convey the idea that the belting was manufactured from camel’s hair, but rather, through use and promotion, the words had come to be understood specifically to mean belting manufactured by the claimant: seeReddawayat 213 and 217. 34     But, as observed by the learned author ofThe Law of Passing-Offat para 8-003, the distinctiveness of a name or mark is just one aspect of the wider question of whether there has been a misrepresentation. He puts it thus at para 8-003: ... [I]t should be borne in mind that the question of whether a particular mark is distinctive of a certain trader is only one aspect of the wider question of whether there has been a misrepresentation. If the claimant in a typical case is successful it may be assumed that the mark relied on was distinctive of him, that the defendant’s corresponding mark was confusingly similar, and that there were no other factors to prevent deception. ... On the other hand, if the claimant fails, then it does not necessarily mean that his mark (as pleaded) was not distinctive at all, still less that it was in law incapable of distinguishing his goods. It may have been that the defendant took adequate steps to differentiate his goods, or simply that his own mark was sufficiently different. Distinctiveness is a matter of degree, and marks of low inherent distinctiveness may be protected against precise copying but not against slight variations. In most cases where the claimant fails it is because of a combination of factors: the points of resemblance between his goods and the defendant’s are so slight that he is driven to assert distinctiveness in the trivial or commonplace, or the points of difference are marked enough to outweigh the effect of any similarities. 35     It is therefore unsurprising that even where a name that is primarily descriptive has come to acquire a secondary meaning and so be associated with the claimant’s business, the degree of protection that is conferred on the claimant may,in general, be less than would be the case with purely fancy names. InThe Law of Passing-Off, the learned author states at para 8-064 that: ... Even if the claimant succeeds in proving that a prima facie descriptive term has acquired some degree of secondary meaning, he will find that the scope of protection for his mark is narrower than for a wholly arbitrary term. There is a rule of law that relatively minor differences will suffice to distinguish the defendant’s goods or business when both use a mark that is descriptive of the goods or services they provide. ... “Office Cleaning Association” was sufficiently different to “Office Cleaning Services” even though it was the trading name of the defendant. The plaintiff was free to choose a name of higher inherent distinctiveness, and the penalty for his failing to do so was thata degree of confusion would be tolerated as the only alternative to giving him an unfair monopoly.[emphasis added] 36     It will be evident from the foregoing that in the tort of passing off concerning names, brands or marks, it will be essential for the claimant to establish that its goodwill is sufficiently associated with its name or brand such that its name or brand is distinctive, in that it denotes the goods and services of the claimant to the exclusion of those of other traders (Lifestyle 1.99at [27]) (either inherently or because the name or brand in question has acquired a secondary meaning). The separate but related question of whether the name or mark is fancy or descriptive will be relevant in assessing both distinctiveness (as to which, see [29] above) as well as the degree of protection the law will afford the claimant. This is reflected in the level of scrutiny that is applied by the court in assessing whether the defendant has misrepresented its goods or services as those of or associated with the claimant (as to which, see [34]–[35] above). 37     In this respect, “[i]t is the significance which the relevant public attaches to the supposed mark which is all-important”:The Law of Passing-Offat para 8-004. Whether a word is fancy or descriptive may, of course, depend on how it is used and, for that matter, in what context it is used (seeLifestyle 1.99at [27]); it is also a “matter of degree” on a “continuous spectrum between the highly fanciful and the obviously descriptive” (The Law of Passing-Offat para 8-075; see alsoLifestyle 1.99at [27]). 38     We turn to consider the facts before us in the light of the foregoing principles. It was not seriously disputed that the name “The Singapore Professional Golfers’ Association” carries a strong association with the Appellant. However, it was argued that the Appellant’s name is a descriptive one in that it essentially describes the nature of the Appellant and, hence, its activities, the Appellant being an association of professional golfers. 39     It is, of course, possible that a collection of generic or descriptive words may yet become distinctive when used in combination with one another. But, in the case that is before us, the Appellant’s full name is in essence a straightforward description of an association for professional golfers. The use of the definite article “The” in conjunction with the word “Singapore” might indicate that the Appellant is the only or the pre-eminent association dedicated to the interests and activities of professional golfers in Singapore, but this cannot be said to be sufficient in and of itself to confer a significant degree of distinctiveness on the Appellant’s name. 40     Be that as it may, through use, it is evident that the name “The Singapore Professional Golfers’ Association” has come to be associated with the Appellant when used in this combination. This is even more so in relation to the Appellant’s shortened name, “Singapore PGA”, and its initials, “SPGA”. The Appellant was established in 1973,[note: 26]almost 40 years ago, and has been using its full name, its shortened name and its initials regularly since then. Various local newspaper articles and publicity materials as well as golf publications[note: 27]which have reported on the Appellant’s activities have continually referred to the Appellant using these same names,ie, the Appellant’s full name, its shortened name and its initials. Moreover, the Appellant’s use of the initials “PGA” in its shortened name and in its initials must also be seen in the light of the fact that these initials are widely used and understood in the sport of golf throughout the world to mean “Professional Golfers’ Association”. Hence, this strengthens the association of the Appellant’s shortened name and initials with the Appellant. In these circumstances, we find that the Appellant’s name (in both its full and shortened forms) and initials have come to be identified with the Appellant such that they are no longer merely descriptive of the Appellant in a generic sense. Simply put, to the extent that the Appellant’s name and initials lack a high degree of distinctiveness in and of themselves, they have nonetheless acquired a secondary meaning by virtue of their clearly being identified with the Appellant and with the activities that it organises and promotes. In this regard, we consider that the Judge erred in holding (at [38]–[39] and [48] of the Judgment) that the Appellant had not shown that its name and initials had acquired a secondary meaning such that they had come to be associated with the Appellant. Likelihood of confusion 41     In ascertaining whether there is an actionable misrepresentation, while the defendant’s intention or motive in choosing a particular mark, name or get-up may be relevant, the focus is, rather, on the actual or anticipatedeffectof the defendant’s actions on the minds of those constituting the relevant segment of the public. However, although it is not essential that fraudulent intent on the defendant’s part be shown before liability for passing off may be imposed, where this is shown to exist, it becomes easier to establish that there is a likelihood of deception on the facts on the simple premise that one will tend to  achieve that which one specifically sets out to do, and the courts are inclined to infer that this is so – see the observations of Aldous LJ inBritish Telecommunications plc and Another v One in a Million Ltd and Others[1999] 1 WLR 903 at 920 that: ... If it be the intention of the defendant to appropriate the goodwill of another or to enable others to do so, I can see no reason why the court should not infer that it will happen, even if there is a possibility that such an appropriation would not take place. ... See also Tan Tee Jim SC,Law of Trade Marks and Passing Off in Singapore(Sweet & Maxwell Asia, 2nd Ed, 2005) at para 17.75; andThe Law of Passing-Offat para 8-003. 42     As to the effect of the misrepresentation, it must give rise to actual confusion or a likelihood of confusion before it would be actionable under the tort of passing off:Novelty Pte Ltd v Amanresorts Ltd and another[2009] 3 SLR(R) 216 (“Amanresorts”) at [77]. InAmanresortsat [77], this court noted that the two elements of misrepresentation and confusion together constituted the “deception” which was at the heart of the tort of passing off and which was referred to by Lord Diplock inErven Warnink Besloten Vennootschap and Another v J Townend & Sons (Hull) Ltd and Another[1979] 1 AC 731 at 740. As such, the key inquiry is to ascertain whether the relevant public would likely be led to believe that the goods, services or activities offered by the defendant are those of the claimant (Bordenat 499), or of an entity connected to or associated with the claimant (Hyundai Mobisat [51]–[52]). There is no requirement for actual confusion to be shown, though evidence of actual confusion may well be helpful (Amanresortsat [80]). 43     Nor is the likelihood of confusion to be considered in the abstract. Rather, it is necessary to assess the effect of the misrepresentation on the relevant segment of the public, which typically is that segment of the public in which the claimant’s goodwill actually or potentially, directly or indirectly subsists. 44     This court inAmanresortshas previously emphasised the importance of identifying the relevant segment of the public that has goodwill in a trader’s get-up as associated with its business. It would be helpful here to examine this issue in the context of associations that further commercial or non-commercial interests. InBritish Medical Association v Marsh(1931) 48 RPC 565 (“British Medical Association”), the claimant association was one that represented the interests of the medical profession as a whole. The defendant set up two shops and made use of the letters “B.M.A.”. At one shop, “B.M.A.” was displayed prominently at the window above the word “Drug Stores”, and in the window display, it was stated “We guarantee”, followed by the words “that all reproductions of patent medicines are prepared strictly to the analyses of”, and below those words, “The British Medical Association”. The court held at 571: ... It is perfectly plain on the evidence that [the defendant and other chemists in the company set up by the defendant] knew, and must have known, that “B.M.A.” meant to a chemist, or to a doctor, or to the public, “British Medical Association.” ... 45     The court inBritish Medical Associationappeared to conclude that the relevant segment of the public consisted of members of the claimant association (ie, medical professionals) as well as the general public to the extent that they would have the occasion to deal with the claimant association or its members. That medical practitioners should constitute a part of the relevant public is uncontroversial as the objective of the claimant association inBritish Medical Associationwas to promote the interests and maintain the honour of those in the medical and allied sciences. But, also uncontroversial is the holding that the wider public (who used or would potentially need to use the services of the claimant association or its members) would also form part of the relevant public. To this extent, this segment of the publicindirectlyconstituted the claimant’s goodwill because the claimant association was said to be recognised by the public and relied on by them as being representative of the views and interests of the medical profession in the British Empire (seeBritish Medical Associationat 567). 46     InBritish Association of Aesthetic Plastic Surgeons v Cambright Ltd and Others[1987] 1 RPC 549 (“Cambright”), the claimant association catered to its members by, among other ways, seeking to promote knowledge relating to the advancement of plastic surgery and encouraging high standards of personal, professional and ethical conduct among its members. Its members included practising as well as retired surgeons with varying years of experience. The claimant also (indirectly) catered to the general public by ensuring that there would be a body of proficient plastic surgeons available to service their needs. The court examined the question of whether there was a misrepresentation from the perspective of professional doctors and consultants concerned with plastic surgery as well as from the perspective of members of the public (Cambrightat 551). This again illustrates the broad view taken of the segment of the public in whom the claimant’s goodwill was thought to subsist. 47     InSociety of Accountants and Auditors v Goodway and London Association of Accountants, Limited[1907] 1 Ch 489, the claimant society was established with, among others, the object of promoting the status and advancing the interests of the profession of accountants. Its members used the designation “incorporated accountant”. In examining the question of confusion, Warrington J noted at 497 that the relevant public comprised persons who had dealings with accountants. The relevant segment of the public was thus not confined to members of the claimant society, nor even to potential members, but extended to those who might have the occasion to deal with members of the claimant society. 48     Similarly, inThe British Diabetic Association v The Diabetic Society and Others[1996] 1 FSR 1 (“The British Diabetic Association”), the claimant was a charity that promoted the interests of those suffering from diabetes (The British Diabetic Associationat 4). It was the largest and possibly the only national charity working permanently in this field at the time, and it sought an injunction to prevent the defendants from using the words “The Diabetic Society” and “The British Diabetic Society”. The claimant obtained the injunction on the basis of the similarity in the derivation and meaning of the words “Society” and “Association”, although the court also observed that the small difference between the two words could be a sufficient differentiation, depending on the factual circumstances of each case (The British Diabetic Associationat 22). Walker J assessed the likelihood of confusion from the perspective of the segment of the public made up of patients, care-givers, medical practitioners and donors as well as persons who might use directories or digests listing such organisations and who might be trying to contact the claimant (The British Diabetic Associationat 11). 49     From the foregoing authorities, it is evident that the relevant segment of the public would consist of all those persons who have an actual or potential interest, whether directly or indirectly, in the claimant’s products, services or activities. These would be persons who are drawn to the claimant, or who seek the claimant when making their decisions on goods or services that are or may reasonably be believed to be of the sort that the claimant is engaged in, or, particularly in the context of non-commercial organisations, when seeking membership or directing donations and sponsorships to support the work of the organisation in question, or when considering or seeking accreditations, references or endorsements. 50     Turning to the case at hand, in our view, the relevant segment of the public could include any person with a commercial interest in golf as well as those who have or intend to have either direct or indirect dealings with the Appellant in relation to its purposes, objects and/or activities.[note: 28]The Appellant’s objectives are the following: the promotion of the sport of golf in Singapore, the protection and advancement of the interests of its members who are professional golfers, the periodic arrangement and holding of meetings and tournaments for its members, the institution and operation of funds for its members’ benefit and caring for its members’ welfare.[note: 29]It is clear that the objectives of the Appellant are wide-ranging in relation to the sport of golf. 51     Ultimately, those with an interest in the Appellant’s work and activities would not be limited only to its members. To illustrate, an aspiring golfer who is interested to learn how to play golf or to improve his standard of play would tend to seek an instructor or a coach. An instructor or a coach who is accredited by the Appellant would likely hold out such accreditation as a point of interest to the aspiring golfer, and it seems just as likely that the latter would rely on and have regard to the Appellant’s trade name as an accreditating entity in helping him to make a choice when selecting a coach or an instructor. Thus, though the aspiring golfer might not immediately deal directly with the Appellant, he would have indirect dealings founded on his reliance upon the Appellant as the representative of the interests of the professional golfing community of players, coaches and instructors in Singapore. 52     As to the characteristics of this segment of the public, given the breadth of the class, the members would have characteristics typical of an ordinary and sensible member of the public. InThe Law of Passing-Offat para 8-050, the author suggests that such persons would be “of average intelligence”. In our view, much turns on the nature of the product in question and the type of customer it tends to attract. If, in a given case, because of the peculiarities of the product or for any other reason, the relevant public were made up of “well-informed”, “particularly attentive” and cautious customers who would likely remember a high level of detail, slight differences between the claimant’s and the defendant’s respective signs may well be sufficient to avoid liability on the part of the defendant (Bently & Shermanat p 763). The characteristics of the relevant public thus also depend on the nature of the claimant’s goods or services and whether these goods or services would call for or provoke particular recollection. 53     In our view, in the context of this case, the members of the relevant segment of the public would be neither unusually discerning nor unusually careless. They would exercise no more than ordinary caution. Regard must also be had to the imperfect recollection of the relevant segment of the public in assessing the likelihood of confusion (Tong Guan Food Products Pte Ltd v Hoe Huat Hng Foodstuff Pte Ltd[1991] 1 SLR(R) 903 at [26]; see alsoSarika Connoisseur Cafe Pte Ltd v Ferrero SpA[2013] 1 SLR 531 (“Sarika”) at [18] in the context of trade mark law). 54     This is the context against which the likelihood of confusion must be assessed. This is ultimately a fact-sensitive analysis. The factors which may be relevant, though not exhaustive, would include: (a) the strength of the public’s association with the claimant’s sign; (b) the similarity of the claimant’s and the defendant’s respective signs; (c) the proximity of the parties’ respective fields of business; (d) the characteristics of the market; and (e) the defendant’s intention:Bently & Shermanat p 760. These are factors that serve to aid the court’s evaluation of whether, in all the circumstances, there is a likelihood that the relevant segment of the public might be left with the mistaken impression that the defendant’s business or organisation is in fact the same as or economically connected with the claimant’s. 55     It is relevant here to return to a point we earlier noted. Where a claimant’s name or sign is fancy and therefore highly distinctive in itself, it will be easier to conclude that a likelihood of confusion exists if the defendant is using a similar sign. This is so because the more distinctive or inventive a sign or name, then the more likely it will be that the relevant segment of the public faced with a similar sign being used to brand goods or services in a similar field of business would either mistake one for the other or assume an economic association between them. Consequently, the stronger the association of the name in question with the claimant, the greater and more readily will protection be conferred. Whereas if purely descriptive words are used and the association is not demonstrably strong, the degree of protection will be less and small differences may then be sufficient to enable a defendant to avoid liability (Bently & Shermanat p 761). However, this is not a fixed rule of principle and the central question in each case is whether, in all the circumstances, there is a sufficient likelihood of confusion.",
        "Misrepresentation on the present facts": "56     In that light, we turn to assess the likelihood of confusion in the case before us. We have already touched on the association of the Appellant’s name with the Appellant (at [38]–[40] above) and on the characteristics of the relevant segment of the public (at [50]–[53] above). The Appellant and the 3rdRespondent both clearly operate in the same field of business. Their activities consist, in the main, of the promotion of golf as a sport in Singapore and the organising of golf tournaments for their members. Further, they cater to the same market of consumers,ie, those who have an actual or potential interest in the sport of golf. Although the Respondents emphasised that the 3rdRespondent was only concerned with the interests of senior golfers and senior professional golfing activities,[note: 30]it should be noted that the Appellant also caters to the interests of senior professional golfers by, for example, organising golf tournaments for such golfers.[note: 31]As to the question of similarity between the Appellant’s and the 3rdRespondent’s respective names and initials, in our view, there is undoubtedly a strong similarity between these names and initials when viewed as a whole, given the order and combination in which the words in the names and the letters in the initials are used. This is all the more so if account is had to the imperfect recollection of the relevant segment of the public. In our view, in all the circumstances, the general idea that the 3rdRespondent’s name and initials would convey to a member of the relevant public is that it is a professional golfing organisation related to the Appellant. 57     What is especially telling in this regard is that the 1stRespondent, in choosing the 3rdRespondent’s name, decided that the letter “A” would be used in the name “Singapore Senior PGA LLP” and in the last letter of the initials “SSPGA”. This was so even though it is abundantly clear that the 3rdRespondent is not a society or an association, but a limited liability partnership (as is evident from the term “LLP” used in its full name). Yet, the 1stRespondent consciously chose to retain the letter “A” in the 3rdRespondent’s name and initials when devising the same. When we questioned the Respondents’ counsel on this point in the course of the oral arguments, counsel indicated that the letter “A” stood for “accreditation”. Indeed, this was the very first inkling that we or anyone else had that this was the ostensible word for which the letter “A” stood. The word “accreditation” had featured nowhere up to this point. 58     Leaving aside the fact that it might not even make grammatical sense for the letter “A” to stand for “accreditation” in the context of the 3rdRespondent’s chosen name, what is significant is that if indeed the Respondents intended this to be the real meaning of the initials used by the 3rdRespondent, then by deliberately choosing to use only the initials and not the full name, they opened themselves to the inference being drawn against them that having regard to all the circumstances, they intended to reap the benefit of the inevitable association which their choice of name would enjoy with the Appellant’s name. To anyone in the relevant segment of the public, the letter “A” in the 3rdRespondent’s name and initials would have been understood to stand for “Association”. This is especially so because, as we have noted above at [40], the “PGA” combination of letters is widely used both here and internationally in the field of golf to mean “Professional Golfers’ Association”. If “accreditation” was in fact the word which the Respondents had in mind, a simple solution would have been to give the 3rdRespondent a name that clearly reflected this. 59     In our view, the scope for confusion here is much greater than was the case inThe British Diabetic Association, which was cited by the Appellant in its supplementary submissions.[note: 32]The court inThe British Diabetic Association, in distinguishing (at 22)Office Cleaning Services, Ld v Westminster Window and General Cleaners, Ld(1946) 63 RPC 39, held that unlike the words “Services” and “Association”, the words “Society” and “Association” were “very similar in derivation and meaning, and not wholly dissimilar in form”. The use of the letter “A” in the 3rdRespondent’s name, which isidenticalto the letter used by the Appellant in its initials over the last four decades, and the particular combination of words and initials in this case gives rise to much greater scope for confusion. 60     On this basis, there are undoubtedly sufficient facts for us to conclude that there is a likelihood of confusion in the minds of members of the relevant segment of the public, such that they would be led to believe that the Appellant and the 3rdRespondent are one and the same or are connected. We also reject the submission made, and in this regard, we respectfully disagree with the Judge, that such minor differences as there are suffice to differentiate the 3rdRespondent’s name and initials from those of the Appellant to such a degree as to avert this likelihood of confusion. We note the unmistakable degree of similarity in relation to the order and combination of the words and/or letters used in the names and initials of both parties. The slight differences here principally consist of the addition of the word “Senior” and the letters “LLP” in the 3rdRespondent’s name. These differences, in our view, far from displacing the likelihood of confusion, in fact serve to aggravate it. The use of the word “Senior” in fact gives the distinct impression that the 3rdRespondent is a branch of the Appellant that is catering exclusively to the “Senior” arm of the golfing community. 61     As to the letters “LLP”, to those who understand this to signify that the 3rdRespondent is a limited liability partnership, the use of these letters in conjunction with the word “Singapore” and the initials “PGA” could just as well underscore the perceived connection with the Appellant, and the conclusion that might well be drawn in the circumstances is that the 3rdRespondent is a related arm of the Appellant, but constituted as a limited liability partnership for commercial reasons. The element of confusing misrepresentation in the tort of passing off is therefore clearly made out in our view. 62     It is not necessary for us, in the circumstances, to make a finding on whether the selection and the use of the 3rdRespondent’s name was actuated by bad faith. However, having regard to the matters stated at [56]–[58] above, we are satisfied that it was so.",
        "Damage": "63     We turn to the final element, namely, the damage to the Appellant’s goodwill. An action in passing off protects a claimant’s goodwill. For this reason, it is essential that the misrepresentation by the defendant must be shown to have damaged or at least be likely to cause damage to the claimant’s goodwill (Amanresortsat [94];The Law of Passing-Offat para 4-001). In the court below, the Appellant argued that it suffered or at least stood to suffer two heads of damage: the first being damage through the potential loss of sponsorships and income, and the second being damage through blurring and tarnishment.[note: 33]The same submissions were made on appeal. These are two distinct ways in which the Appellant contended its goodwill might be damaged. 64     The first way in which damage might be caused is by the diversion of the Appellant’s custom as a result of the relevant segment of the public mistaking the 3rdRespondent to be the Appellant or to be related to it and so deciding to channel their finite available resources towards the 3rdRespondent instead of to the Appellant. The second way in which damage might arise is where the relevant segment of the public disassociate themselves from the Appellant because they perceive that the activities organised by the 3rdRespondent are of a poorer quality and form the impression that the Appellant is linked in some way to the 3rdRespondent (Amanresortsat [98]). The latter is in fact a case of potential damage through tarnishment rather than blurring. Thus, inBritish Legion v British Legion Club (Street) Ld(1931) 48 RPC 555 (“British Legion”), the court noted that if the defendant had been allowed to continue using its name, giving the impression of a connection with the claimant association, and if the defendant fell into some legal or financial difficulties or into discredit, it could affect the repute of the claimant association and might deter persons who would otherwise have supported the claimant association, whether by giving subscriptions or otherwise, from doing so (British Legionat 564). (We note that damage arising from the risk of litigation or financial trouble could be viewed as a separate, though possibly related, head to damage by tarnishment: seeAmanresortsat [102]–[106].) Similarly, inBritish Medical Associationat 576, it was held that the defendant’s acts would “tend to injure” the claimant association’s goodwill because medical practitioners might not join the claimant association as members or existing members might resign from it if the relevant segment of the public formed the impression that the claimant association was associated with a retail chemist such as the defendant (seeThe Law of Passing-Offat para 3-046). The Appellant also referred to damage as a result of its goodwill being “spread out” over activities other than its own.[note: 34] 65     In proving damage, it is sufficient if a claimant can prove a real and tangible risk of substantial damage (Amanresortsat [105]). Proof of actual damage is not necessary in every case (Sarikaat [106] andThe Law of Passing-Offat para 4-011). 66     Loss arising from damage to goodwill in relation to non-commercial associations, such as the Appellant, would include a loss of actual or prospective members and, therefore, a loss of subscriptions or other income derived from membership: seeThe Law of Passing-Offat para 3-046. In the case before us, we are satisfied, given the nature of the activities and the income sources of the Appellant, that there would be a real likelihood of loss of income derived from membership and subscription fees. 67     Further, it is clear that the Appellant relies on sponsorships to run its activities and to keep itself in operation. The 3rdRespondent also intends to rely on sponsorships to fund its activities such as golf tournaments, as attested to by the 1stRespondent in the course of cross-examination in the court below.[note: 35]The amount of sponsorship funding is finite, and were the relevant segment of the public, particularly those interested in sponsoring the activities of the Appellant, to perceive mistakenly that the Appellant and the 3rdRespondent are related or in some way connected, it would be easy to see a real prospect that sponsorship and funding meant for the Appellant might be diverted to support the activities of the 3rdRespondent. 68     The Appellant’s income is also derived from entrance fees, members’ annual subscription fees as well as test administration and certification fees.[note: 36]Given that both the Appellant and the 3rdRespondent operate in very similar fields and cater to very similar markets, there is a real likelihood that senior golfers might obtain their qualification from the 3rdRespondent instead of from the Appellant as long as the golfing public, especially aspiring senior professional golfers, think that accreditation with either body is equivalent for all purposes because of the perceived connection between the Appellant and the 3rdRespondent. This would cause the Appellant to lose income from test administration fees. In our judgment, for all these reasons, were the 3rdRespondent allowed to operate as it intended, there is a real likelihood of damage to the Appellant’s goodwill. 69     It is not necessary for us to make a finding as to whether there is a real likelihood of damage to the Appellant’s goodwill by reason of any danger of its being associated with the 3rdRespondent and any perceived lack of quality therein. There is, in any event, no evidence on this. 70     We are accordingly of the view that the tort of passing off is made out. It remains for us to consider whether the liability this gives rise to extends beyond the 3rdRespondent, which is a limited liability partnership, to the 1stand 2ndRespondents, having regard to the provisions of the Limited Liability Partnerships Act (Cap 163A, 2006 Rev Ed) (“LLPA”).",
        "Liability of the 1stand 2ndRespondents": "71     Under s 4(1) of the LLPA, a limited liability partnership (referred to hereafter as a “LLP” for short) is a body corporate with a separate legal personality from that of its partners. As regards the liability of the individual partners of a LLP, s 8 of the LLPA is directly relevant: Limited liability of partners 8.—(1) An obligation of the limited liability partnership whether arising in contract, tort or otherwise, is solely the obligation of the limited liability partnership. (2)A partner is not personally liable, directly or indirectly, by way of indemnification, contribution, assessment or otherwise, for an obligation referred to in subsection (1) solely by reason of being a partner of the limited liability partnership. (3)Subsections (1) and (2) shall not affect the personal liability of a partner in tort for his own wrongful act or omission, but a partner shall not be personally liable for the wrongful act or omission of any other partner of the limited liability partnership. (4)    Where a partner of a limited liability partnership is liable to any person (other than another partner of the limited liability partnership) as a result of a wrongful act or omission of his in the course of the business of the limited liability partnership or with its authority, the limited liability partnership is liable to the same extent as the partner. (5)    The liabilities of the limited liability partnership shall be met out of the property of the limited liability partnership. [California Corp Code, UPA 1994, s. 16306(e); Delaware RUPA, s. 15-305; Jersey LLP Law 1997, Art. 4(2); UK LLP 2000, s. 6(4)] [emphasis added] 72     It is evident from the plain language of ss 8(2) and 8(3) of the LLPA that the whole essence of the scheme of a LLP is that a partner is not to be held personally liable merely because the LLP has incurred a tortious liability in the course of its business. Neither will that partner be held personally liable, merely by reason of being a partner of the LLP, where another partner commits a wrongful act or omission. 73     This position is reflected in the parliamentary debates. At the second reading of the Limited Liability Partnerships Bill 2004 (Bill 64 of 2004) (“the Bill”), the then Acting Second Minister for Finance, Mr Raymond Lim Siang Keat, stated and clarified the following in relation to the Bill (Singapore Parliamentary Debates, Official Report(25 January 2005) vol 79 at cols 548 and 563–564): … The LLP only protects “innocent” partners from personal liability for the negligence of other partners. … … Dr Ahmad Magad also brought up the point about the liability of partners and asked for clarification. On the liability of partners, when a partner is personally liable for a wrongful omission or act, he is not limited to the capital contribution. This means he is personally liable to the full extent of his net worth. So, if a partner is professionally negligent, he is personally liable. So it is not limited to his contribution. The LLP itself will also be liable for the partner’s act.It is only the innocent partner … who will not be held liable. The fact that a person is a partner in an LLP does not make him personally liable for the actions of the other partner who has committed a wrongful omission or act. [emphasis added] 74     Similarly, it has been observed in Yeo Hwee Ying, “Nature and Liability Shield of Limited Liability Partnerships in Singapore” (2007) 19 SAcLJ 409 (“Nature and Liability Shield of LLPs”) at para 13 that “[i]t is evident from this provision [ie, s 8 of the LLPA] that [the] Singapore legislature has opted for complete shield protection and innocent partners or members of the LLP are accordingly protected for tortious as well as commercial contractual obligations in the course of business”. 75     Section 8(2) of the LLPA is derived from § 15-306(c) of the Delaware Revised Uniform Partnership Act (“RUPA”). Section 15-306(c) of the RUPA provides that: An obligation of a partnership arising out of or related to circumstances or events occurring while the partnership is a limited liability partnership or incurred while the partnership is a limited liability partnership, whether arising in contract, tort or otherwise, is solely the obligation of the partnership. A partner is not personally liable, directly or indirectly, by way of indemnification, contribution, assessment or otherwise, for such an obligation solely by reason of being or so acting as a partner. The effect of § 15-306(c) of the RUPA is that “individual partners in a limited liability partnership are shielded from the traditional vicarious personal liability of partners for partnership obligations but remain liable for their own torts” (Robert W Hillman, Allan W Vestal & Donald J Weidner,The Revised Uniform Partnership Act(West, 2011–2012 Ed)). This is an exception created to a general partner’s liability under Delaware partnership law (Nature and Liability Shield of LLPsat para 14). 76     Connecticut’s General Statutes (“the General Statutes”) also contain wording similar to that of s 8(2) of the LLPA (see § 34-327 under Chapter 614 of the General Statutes). Sections 34-327(c) and 34-327(d) of the General Statutes provide: (c)    Subject to subsection (d) of this section, a partner in a registered limited liability partnership is not liable directly or indirectly, including by way of indemnification, contribution or otherwise, for any debts, obligations and liabilities of or chargeable to the partnership or another partner or partners, whether arising in contract, tort or otherwise, arising in the course of the partnership business while the partnership is a registered limited liability partnership. (d)    The provisions of subsection (c) of this section shall not affect the liability of a partner in a registered limited liability partnership for his own negligence, wrongful acts or misconduct, or that of any person under his direct supervision and control. 77     The Superior Court of Connecticut inHenry Chamberlain et al v Charles Irving(an unreported case of the Judicial District of Tolland, decided on 26 October 2006) (“Chamberlain”), in considering § 34-327 of the General Statutes, noted that it protected partners in a registered LLP from personal liability, including from obligations incurred by other partners arising in the course of the business of the LLP. Similarly, inColliers, Dow and Condon, Inc v Leonard J Schwartz et al88 Conn App 445, 871 A 2d 373 (2005) (“Colliers”), which was cited inChamberlain, it was not disputed that § 34-327(c) protected a partner of a LLP from personal liability for the partnership’s debts (Colliersat 377 and 380). 78     Sections 16306(c) and 16306(e) of the California Corporations Code (“Corporations Code”) also provide that: (c)    Notwithstanding any other section of this chapter, and subject to subdivisions (d), (e), (f), and (h), a partner in a registered limited liability partnership is not liable or accountable, directly or indirectly, including by way of indemnification, contribution, assessment, or otherwise, for debts, obligations, or liabilities of or chargeable to the partnership or another partner in the partnership, whether arising in tort, contract, or otherwise, that are incurred, created, or assumed by the partnership while the partnership is a registered limited liability partnership, by reason of being a partner or acting in the conduct of the business or activities of the partnership. ... (e)    Nothing in subdivision (c) shall be construed to affect the liability of a partner of a registered limited liability partnership to third parties for that partner’s tortious conduct. The Californian Court of Appeal inPCO, Inc, et al v Christensen, Miller, Fink, Jacobs, Glaser, Weil & Shapiro, LLP150 Cal App 4th 384 (2007) at 389 noted that under § 16306(c) of the Corporations Code, partners in a LLP “generally are not vicariously liable for partnership obligations that do not arise from the partner's personal misconduct or guarantees”. 79     In the circumstances before us, it is clear that the 2ndRespondent ought not to be held personally liable for the tort of passing off merely by virtue of being a partner of the 3rdRespondent. This is expressly provided for in ss 8(2) and 8(3) of the LLPA. It was contended by the Respondents[note: 37]that the 2ndRespondent had merely lent his name to the 1stRespondent to assist the latter in setting up the 3rdRespondent so as to comply with the minimum requirement of having two partners for the establishment of a LLP in Singapore (s 22(1) of the LLPA). The 2ndRespondent emphasised that he had not wanted to be involved in the 3rdRespondent’s business. Further, he had not in fact been personally involved in the 3rdRespondent’s registration process nor in the activities of the 3rdRespondent, and had left these matters as well as the management and operation of the 3rdRespondent entirely to the 1stRespondent, his father.[note: 38]This was also the effect of the evidence given by the 2ndRespondent under cross-examination.[note: 39]In effect, the 2ndRespondent had been a partner of the 3rdRespondent only “in name”. In the premises, he cannot be held liable at all in his personal capacity. The appeal is therefore dismissed as far as the 2ndRespondent is concerned. 80     As against this, it is evident that the 1stRespondent was the moving force behind the 3rdRespondent. Section 8(3) of the LLPA provides that a partner of a LLP is to remain personally liable in tort for his own wrongful acts, and this is not displaced by the fact that he may have carried out the acts in question in his capacity as a partner of the LLP (Nature and Liability Shield of LLPsat paras 16–17). On the facts, it was the 1stRespondent who directed the activities of the 3rdRespondent. He conceptualised its activities, chose and registered the name of the 3rdRespondent, and used the offending name and initials in conjunction with the organisation of golfing activities under the 3rdRespondent’s auspices.[note: 40]He also advertised the 3rdRespondent’s activities on its website and placed an advertisement publicising its activities in the February 2011 edition ofGOLF, a golf publication in Singapore.[note: 41]In the circumstances, the 1stRespondent is personally liable for the tort of passing off.",
        "Conclusion": "81     In the result, the appeal is allowed with costs as against the 1stRespondent and 3rdRespondents with the usual consequential orders. The Appellant is also to have its costs below against the 1stand 3rdRespondents. The appeal is dismissed with costs as against the 2ndRespondent. As the Respondents were jointly represented and as the bulk of the work was done on the primary issue of whether the claim in passing off was made out, we order that the 2ndRespondent’s costs shall be assessed at a rate equivalent to one-third of the Appellant’s costs here and below. 82     In the course of oral arguments during the appeal, Mr Tan Tee Jim SC, who appeared for the Appellant before us, conceded that as the Respondents had ceased and desisted from their intended activities upon receipt of his letter of 1 March 2011, the Appellant had in fact suffered minimal damage. In the circumstances, we do not consider it necessary to have any inquiry as to damages. The parties are to endeavour to agree on the terms of the order to be made restraining the use of the 3rdRespondent’s name or impermissible derivatives thereof and to submit this for our approval. Should they be unable to reach agreement on this matter within 14 days of the date of this judgment, either party may seek our further directions.  [note: 1]Record of Appeal (“ROA”), Vol III Part A, p 5 at para 4 [note: 2]Statement of Claim (Amendment No 1) filed on 11/11/11 (“SOC (Amendment No 1)”) in ROA, Vol II, p 14; ROA Vol III Part A, pp 23–24 at para 4 [note: 3]Tan Thiam Hock, Dean’s AEIC, pp 5–11  in ROA, Vol III Part A, pp 8–14 [note: 4]Chen Eng Waye’s AEIC in ROA, Vol III Part B, p 15, para 3 [note: 5]Tan Thiam Hock, Dean’s AEIC in ROA, Vol III Part A, p 14 at para 17 [note: 6]Tan Thiam Hock, Dean’s AEIC  in ROA, Vol III Part A, p 14 at para 17 [note: 7]ROA, Vol III Part A, p 254 [note: 8]ROA, Vol III Part A, p 15 at para 18 [note: 9]The Judgment at [4] in Appellant’s Core Bundle Vol I at p 7; ROA, Vol III Part A, p 15 at para 19 [note: 10]Tan Thiam Hock, Dean’s AEIC  in ROA, Vol III Part A, p 15 at para 19 [note: 11]ROA, Vol III Part B, p 10 at para 16 [note: 12]ROA, Vol III Part B, p 12 at para 22 [note: 13]Chen Eng Waye’s AEIC in ROA, Vol III Part B, p 13 at para 23 [note: 14]The Judgment at [7] in Appellant’s Core Bundle Vol I at p 8; ROA, Vol III Part A, pp 229–230 [note: 15]ROA, Vol III Part B, pp 85–93 [note: 16]ROA, Vol V Part C, pp 295–296 [note: 17]ROA, Vol V Part C, p 295 [note: 18]ROA, Vol III Part B, p 15 at para 28 [note: 19]The Judgment at [11] in in Appellant’s Core Bundle Vol I at p 9; ROA, Vol III Part B, pp 100–109 [note: 20]SOC (Amendment No 1) in ROA, Vol II, p 23 at para 10(a) [note: 21]Appellant’s Case at paras 85–88 [note: 22]Appellant’s Case at paras 114–115 [note: 23]Appellant’s Supplementary Submissions filed on 3/12/12 at para 28 [note: 24]Appellant’s Core Bundle Vol 2, pp 37–42 [note: 25]Respondent’s Case at para 99; Respondent’s Further Submissions filed on 4/12/12 at para 37 [note: 26]Appellant’s Case at para 66 [note: 27]See ROA, Vol V Part B for examples of articles and publicity materials [note: 28]Appellant’s Supplementary Submissions filed on 3/12/12 at para 2 [note: 29]SOC (Amendment No 1) in ROA, Vol II, p 14 at para 3; ROA, Vol III Part A, p 5 at para 5 [note: 30]Respondents’ Further Submissions filed on 4/12/12 at para 7 [note: 31]Tan Thiam Hock, Dean’s AEIC in ROA, Vol III Part A, pp 6–7 at paras 9–10 [note: 32]Appellant’s Supplementary Submissions filed on 3/12/12 at para 4 [note: 33]Appellant’s Core Bundle Vol 2, pp 21–31 [note: 34]Appellant’s Core Bundle Vol 2, p 25 [note: 35]HC Transcript in ROA, Vol III Part C, pp 52–53 [note: 36]Appellant’s Core Bundle Vol 2, p 22 at para 131 [note: 37]Respondents’ Further Submissions filed on 4/12/12 at para 33 [note: 38]Chen Xiangyi Roy’s AEIC in ROA, Vol III Part B at pp 186–187 at paras 3–7 [note: 39]Respondents’ Further Submissions filed on 4/12/12 at para 34; HC Transcript in ROA, Vol III Part C at p 72 lines 16–32 and p 73 lines 1–7 [note: 40]ROA, Vol III Part B, pp 10–13; ROA, Vol III Part A, pp 260–268 [note: 41]Chen Eng Waye’s AEIC in ROA, Vol III Part B, p 11 at para 17"
    }
}