{
    "case_title": "Tee Yok Kiat\n      v\n      Pang Min Seng",
    "ncitation": "[2013] SGCA 9",
    "coram": "Chao Hick Tin JA; \n      V K Rajah JA; \n      Sundaresh Menon JA (as he then was)",
    "sections": {
        "Introduction": "1       This appeal was brought against part of the decision made by the High Court judge (“the Judge”) in Suit No 589 of 2009 (“the Action”). The appellant, who was the first plaintiff in the Action (hereinafter referred to as “Sarah”), pleaded three heads of claim in the Action. The first head of claim was against the respondent (the first defendant in the Action and hereinafter referred to as “Andy”) and the second defendant in the Action (hereinafter referred to as “Tik”) for a sum of $608,700 allegedly given by Sarah to Andy to hold on trust for her for the purposes of investing in land and property in China (“the Trust Claim”). The second head of claim was against Andy in respect of a sum of $50,000 which was allegedly given by Sarah to Andy after being intimidated and/or harassed by the latter (“the Blackmail Claim”). The third head of claim was brought by Sarah and her elder sister, Tee Yok Lee (the second plaintiff in the Action and hereinafter referred to as “Ivy”), against Tik for breach of a distribution contract to sell the “POLICE” brand of apparel (“the POLICE Claim”). The Judge dismissed the Trust Claim and the Blackmail Claim, but allowed the POLICE Claim (seeTee Yok Kiat and another v Pang Min Seng and another[2012] SGHC 85 (“the Judgment”)). It was against the dismissal of the first two claims that the present appeal was brought by Sarah. Although Tik was also a party to the Trust Claim, she was not brought in as a party to the appeal. 2       At this juncture, we would pause to mention that Sarah was only represented on the first day of the trial, although she was represented before the trial commenced, and also in the making of the written closing submissions. Andy was unrepresented throughout the proceedings. So for all intents and purposes, the case was presented by a lay person and the defence was also conducted by a lay person. 3       At the conclusion of the hearing, we allowed Sarah’s appeal and gave judgment in her favour in respect of both the Trust Claim and the Blackmail Claim. We now give our reasons.",
        "The factual background": "",
        "The parties": "4       Sarah graduated from the National University of Singapore with a Bachelor of Science degree and worked as a tutor, financial consultant, and real estate agent at various times in her life. She first met Andy in or around December 2004, when she engaged Andy’s firm to carry out renovation works at her apartment in Balestier Road. She was then 45 years of age and was married to one Chiam Toon Muat (hereinafter referred to as “Toon Muat” where appropriate) and they had a daughter and a son who were then 13 and 9 years old respectively. Andy was then 33 years old, married but with no children. Sometime in January 2005, Andy introduced Sarah to Tik, a fortune-teller, when Sarah confided in him about her uncle’s ill health. Tik was also married at the material time.",
        "The Trust Claim": "",
        "The Blackmail Claim": "",
        "The decision below": "13     In the court below, the Judge dismissed both the Trust Claim and the Blackmail Claim. 14     The Judge noted that there are generally two different kinds of resulting trusts. The first arises when a person voluntarily pays money to or purchases property for another person. The recipient is presumed to hold the money or property on a resulting trust for the payer or purchaser. The second kind of resulting trust arises upon the failure of an express trust to fully exhaust the beneficial interest in the trust property. This second kind of resulting trust is commonly referred to as theQuistcloseresulting trust, after the caseBarclays Bank Ltd v Quistclose Investments Ltd[1970] AC 567. The Judge noted at [28] of the Judgment that Sarah expressly pleaded only theQuistcloseresulting trust and not the first type of resulting trust. He nonetheless accepted that the first type of resulting trust need not be specifically pleaded as long as the underlying circumstances giving rise to the presumption of a resulting trust were pleaded (which they were). The Judge therefore concluded that Sarah was entitled to plead an express trust (and aQuistcloseresulting trust) on one hand, and the presumption of a resulting trust on the other hand as an alternative cause of action, since the factual bases of the two types of trusts were not inconsistent. 15     As regards the Trust Claim proper, the Judge found that there was no evidence to establish the alleged purpose of the payment of the Trust Money, which purpose had to be established in order to prove the existence of an express trust (see [36]–[41] of the Judgment). He also found that Andy and Sarah were in a relationship at the material time, and that the Trust Money was given to Andy as a gift (see [42]–[72] of the Judgment). As such, Sarah’s primary claim based on an express trust and her alternative claim based on the presumption of a resulting trust both failed. The Trust Claim was therefore dismissed. 16     As regards the Blackmail Claim, the Judge found that the torts of intimidation and harassment were not made out, and that the Blackmail Money was also given to Andy as a gift (see [76]–[83] of the Judgment). Sarah’s claim against Andy for the Blackmail Money was therefore also dismissed.",
        "Summons No 4377 of 2012": "17     As a preliminary matter, Andy’s counsel, Mr Uthayasurian Sidambaram (“Mr Uthayasurian”), filed Summons No 4377 of 2012 (“SUM 4377”) for leave to be heard pursuant to O 57 r 9A of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) as the Respondent’s Case was filed out of time. In considering whether to grant such leave, the court will weigh the following factors in the balance: (a) the length of the delay; (b) the reasons for the delay; (c) the chances of success should an extension of time be granted; and (d) the degree of prejudice caused to the appellant if an extension of time is granted (seeLee Hsien Loong v Singapore Democratic Party and others and another suit[2008] 1 SLR(R) 757 (“Lee Hsien Loong v SDP”)). 18     The Appellant’s Case was filed and served on Andy in person on 23 July 2012. The deadline for the filing of the Respondent’s Case was therefore 23 August 2012. The Respondent’s Case was filed five days late on 28 August 2012, and was served on Sarah’s solicitors six days late on 29 August 2012. In our view, the length of the delay, being in total only six days in this case, was really not significant. In Andy’s affidavit filed in support of SUM 4377, he explained that the delay in filing the Respondent’s Case was due to his delay in engaging a solicitor. After being served with the Appellant’s Case on 23 July 2012, Andy initially thought that he could continue to act in person as he had done at the trial below. He subsequently realised that he was unable to understand the appellate proceedings and approached Mr Uthayasurian on 2 August 2012 to act for him. Andy was only able to raise the funds needed to pay his solicitor’s fees for the filing of the Respondent’s Case on 28 August 2012, and the Respondent’s Case was filed that very afternoon when Mr Uthayasurian received the funds. As for the third factor mentioned inLee Hsien Loong v SDP, Andy’s chances of success could not be said to be hopeless since he had actually won the case at the trial below. Lastly, in respect of the fourth factor set out inLee Hsien Loong v SDP, we found that there would be little prejudice to Sarah if SUM 4377 were allowed. In Sarah’s affidavit filed in objection to the summons, she claimed that she was prejudiced by the late filing and service of the Respondent’s Case as her solicitors were effectively compelled to prepare the skeletal submissions and prepare for the appeal hearing in a shorter amount of time since her solicitors had a trial for another matter close to the date of the appeal hearing. As we noted earlier, the delay in this case was a delay of only six days. Sarah could not be serious in her assertion that she was prejudiced. Most, if not all, of the substantive work for the appeal would already have been done during the earlier stage of the preparation of the Appellant’s Case, for which Sarah’s solicitors had ample time. 19     Having considered the relevant facts, we allowed SUM 4377 with costs to Sarah and granted leave for Andy to be heard in the appeal. We now turn to the merits of the appeal.",
        "The burden of proof": "20     At [34] of the Judgment, the Judge explained that the threshold factual issue which would resolveboththe express trust and the resulting trust claims was whether the Trust Money was given by Sarah to Andy as a gift. The Judge held that since there was sufficient evidence for him to make a finding on a balance of probabilities that the Trust Money was given to Andy as a gift, Sarah’s claim based on an express trust failed, and, by the same token, any presumption of a resulting trust was also rebutted. The Judge reasoned that the issue of the burden of proof was not crucial in this case since there was sufficient evidence to make a finding on a balance of probabilities that the Trust Money was given as a gift. 21     Sarah’s counsel, Ms Ong Pei Ching (“Ms Ong”), submitted that the Judge applied the wrong burden of proof in deciding the issues of express trust and resulting trust. Ms Ong argued thatvis-à-visthe presumption of a resulting trust, the burden was on Andy to disprove that presumption by showing that the payments made to him by Sarah were intended to be gifts. Ms Ong further submitted that the Judge erred in effectively placing the burden on Sarah to prove that the Trust Money was not given as a gift. It seemed to us that this outcome was in part brought about by the way Sarah pleaded her case. As alluded to earlier, Sarah’sprimarycause of action was based on an express trust, and heralternativecause of action was based on the presumption of a resulting trust. Since Sarah’s primary case was that the Trust Money was given to Andy for specific purposes, the burden rested on her to prove the alleged express trust. As for her alternative case, the burden was on Andy to disprove the presumption of a resulting trust by showing that the moneys in his hands were intended by Sarah to be a gift to him. The Judge seemed to have taken a practical approach by treating the issue of the alleged gift as a threshold factual issue forboththe claim based on an express trust and the claim based on the presumption of a resulting trust. He did (at [36] of the Judgment) indicate that the burden of proving an express trust rested on Sarah, and proceeded at [37]–[41] of the Judgment to examine the case presented by Sarah before coming to the conclusion that she had failed to prove the alleged express trust. What is a little less clear (see [34] of the Judgment) is upon whom the Judge placed the burden of proof as regards the question of the alleged gift. Be that as it may, it was in relation to his finding on the threshold issue of the alleged gift that we respectfully differed from the Judge.",
        "The express trust claim": "The lack of documentation 22     In coming to his finding that there was no express trust over the Trust Money, the Judge made three related points on the lack of documentation supporting Sarah’s intention to create an express trust. First, at [37] of the Judgment, the Judge noted that Sarah “had no documentary evidence whatsoever” to support her claim that the Trust Money was paid for the purpose of investing in land and property in China. The Judge reasoned that since Sarah had been willing to enter into a written agreement in respect of the “POLICE” brand of apparel for a significantly smaller investment of $80,000 (which was the subject matter of the POLICE Claim), he could not accept Sarah’s explanation,vis-à-visthe Trust Claim, that she wanted to avoid documentation of the alleged express trust so that her husband would not be able to trace the Trust Money in the event of a divorce. We have some difficulties with this reasoning. Although the sum of investment in respect of the “POLICE” brand of apparel was significantly smaller than that in respect of the Trust Claim, there were imperatives for Sarah to enter into a written agreement in respect of the “POLICE” brand of apparel since there were many specific terms and conditions under the agreement (eg, the shareholding arrangement between the three contracting parties, assignment of the franchise agreements,etc). In contrast, in relation to the Trust Money, as Sarah was thesolebeneficiary of the alleged express trust, her absolute beneficial interest in the Trust Money was unquestionable and thus would not really have required any documentation. More importantly, Sarah was then under the impression that her husband was having an affair and she had been advised by Tik not to have her investment of the Trust Money documented lest her husband could trace it to claim a share in the event of a divorce. Moreover, if the Judge was correct in his finding that Sarah and Andy were in a relationship, Sarah’s not having the investment of the Trust Money recorded in writing would be consistent with such a relationship. Furthermore, Sarah had in her affidavit of evidence-in-chief (“AEIC”) explained that sometime in or around September 2005, Andy had told her that he would get his lawyer in China to draft an agreement which he would pass to her personally when he was back in Singapore,[note: 1]but he never did so. 23     Next, at [38] of the Judgment, the Judge seemed to think that there could not be an express trust since Sarah had no particulars of the properties in respect of which the Trust Money was to be used (ie, the China Properties), such as the exact address and the land area. While the Judge was correct to observe that Sarah could have obtained the particulars of the China Properties, the fact that she did not do so did not necessarily mean that she did not have the intention of using the Trust Money to purchase those properties when she handed the money over to Andy, bearing in mind the advice she had received from Tik and the trust she had in Tik (arising from Tik’s accurate foretelling of the death of Sarah’s uncle). We do not see how the fact that Sarah did not pay particular attention to the details of the China Properties would necessarily mean that the Trust Money was not handed over to Andy for the purpose of investing in those properties. Indeed, barring proof that the Trust Money was given to Andy as a gift (an issue which we will come to later at [25]–[32] below), the handing over of this sum of money to Andy would have attracted the presumption of a resulting trust. 24     Thirdly, at [39] of the Judgment, the Judge noted that the “general and somewhatvague” [emphasis in original] descriptions of the China Properties only emerged at a late stage in the proceedings when the Statement of Claim was amended for the second time on 27 September 2010 (ie, more than a year after the original Statement of Claim was filed on 10 July 2009). On this point, the Judge seemed to have overlooked the fact that Sarah had on 9 April 2009 (ie, three monthsbeforethis action was brought) made a police report in which she gave the following statement stating her vague knowledge of what the Trust Money was intended to be used for:[note: 2] On January 22 2009 I received a sms from a contractor namely Pang Min Seng Andy that he needs S$100000/- from me. Andy had done contract jobs at my house in year 2005. During that time he had introduced me to a fortune teller namely Poh Saipin Tik. Poh Saipin then informed me that my husband is having affair. After hearing that I lost trust in my husband. During then I sold one shop belonging to both my husband and me and I gave the amount of $600000 I got from the sale to Andy as I did not want my husband to know where I keep the money.Andy informed me that he will invest the money in China to buy a restaurant and land on behalf of me.However later he informed me that he got cheated of the money and he will try to repay me back. But until now he has not repaid back. ... [emphasis added] It was therefore evident that although the details of the China Properties were admittedly vague, they were not conjured up by Sarah as an afterthought. Understandably, Sarah’s main concern at the material time was to move the Trust Money out of the reach of her husband, whom she thought was having an affair (because of what Tik had told her). Whether the Trust Money was a gift to Andy 25     We now turn to the main decision of the Judge upon which the entire case rests, which is that the Trust Money was given by Sarah to Andy as a gift. This decision was, in turn, premised on the Judge’s finding that at the point in time when the Trust Money was paid over by Sarah to Andy, the two of them were in a relationship. Before us, counsel for Sarah argued that the Judge erred in finding that: (a) Sarah and Andy were in a relationship at the material time; and (b) the Trust Money was therefore given to Andy as a gift. 26     As regards the Judge’s finding that Sarah and Andy were in a relationship when the Trust Money was paid over to Andy, we recognised that the evidence pointed in opposite directions. Evidence such as the short message service (“SMS”) exchanges between Andy and Sarah (reproduced at [35] below) suggested that Andy and Sarah were in some kind of relationship. Nevertheless, there was also evidence pointing to the contrary conclusion. For example, Andy did not contact Sarah when he came back to Singapore for a visit in November 2005; neither did he do so in 2006 and 2007, when he returned to Singapore for periods of between one to three months. That being the position, we did not think that the Judge’s finding that Sarah and Andy were in a relationship could be said to be against the weight of the evidence or plainly wrong. That said, the Judge came to the conclusion that the Trust Money must have been given to Andy as a gift based entirely on the existence of a relationship between Andy and Sarah, and nothing else. While we agreed that the fact that Sarah and Andy were in a relationship would lend greater credence to the notion that the Trust Money was given to Andy as a gift, the two issues should not have been conflated. One does not necessarily lead to the other. Counsel for Sarah submitted that there was clearly a leap in logic, and because of that, the finding of the Judge that there was a gift of the Trust Money to Andy was wrong. 27     We will now turn to consider whether, leaving aside the relationship between Sarah and Andy, there were sufficient bases for the Judge to hold that the Trust Money was given to Andy as a gift. First and foremost, Sarah’s counsel pointed to several important gaps in the evidence surrounding the giving of the Trust Money. These evidential gaps were also raised by Sarah’s counsel in the closing submissions, but were not addressed by the Judge. Why did Sarah give Andy such a big sum of money as a gift when Andy had not asked for money and had no specific plans to use the money? Why did Sarah give the Trust Money to Andy in several tranches and at irregular intervals? Why was the Trust Money given in varying amounts and in odd figures? If the Trust Money was indeed intended as a gift, why did Andy hand Sarah copies of the two remittance advice slips[note: 3]evidencing that the total sum of $230,000 given by Sarah on 2 June 2005 had been remitted to Liaoning? The entire picture surrounding the payment of the Trust Money to Andy was inconsistent with the giving of a gift, and Andy was unable to provide any proper explanation for that. No explanation was given in Andy’s AEIC. When questioned on the stand, all that Andy could say was that “[he] would just take whatever sum that [Sarah] gave [him]”.[note: 4] 28     Next, the Trust Money could not have been a gift to Andy upon a closer examination of the sale of the Desker Road shophouse (see [6] above). The purchase of the Desker Road shophouse by Sarah and her husband, Toon Muat, for $615,000 was financed through: (a) a $350,000 loan from Hong Leong Finance Limited; (b) a $189,000 loan from Standard Chartered Bank (obtained upon refinancing a Lucky Plaza unit which Sarah and Toon Muat owned); and (c) cash payment of the balance of $76,000 by Toon Muat.[note: 5]Clearly, a large portion of the funds used to purchase the Desker Road shophouse came from loans. On or around 15 March 2005, Sarah broached the subject of selling the Desker Road shophouse with Toon Muat after being advised by Tik to liquidate and hide her assets. Toon Muat agreed with Sarah without realising her motive behind the proposed sale. Subsequently, on 22 March 2005, both Sarah and Toon Muat gave an option to sell the Desker Road shophouse upon receiving the first offer of $930,000. After deducting the $180,000 or so spent on renovations, assorted expenses for stamp duty and the loans repayable, the actual profit from the sale was only around $130,000. It would make little sense for Sarah to give the sale proceeds (as part of the Trust Money) to Andy as a gift as that would mean that she would effectively have borrowed money from a bank to make a gift to Andy. It was, instead, more likely that Sarah had intended to re-invest the sale proceeds by giving those proceeds (and the rest of the Trust Money) to Andy to invest in land and property in China on her behalf. In this regard, we found it worthy of note that Sarah had on 15 March 2005 (barely one week before the sale of the Desker Road shophouse) refinanced the shophouse with United Overseas Bank Limited.[note: 6]In selling the Desker Road shophouse so soon thereafter, she would naturally have incurred a financial penalty. We further noted that the option to sell provided that Sarah’s conveyancing solicitors were to release $93,000 (being the 10% deposit) directly to Sarah and/or Toon Muat as vendors upon the purchaser’s exercise of the option on 2 April 2005.[note: 7]The first two tranches of payment made to Andy amounted to $128,700 (see [8] above), being $83,700 plus $45,000. Presumably, the shortfall of $35,700 (being $128,700 less the $93,000 deposit) probably came from Sarah’s own savings. The objective evidence clearly showed that there was urgency on Sarah’s part to transfer the funds to Andy. Such urgency in turn supported Sarah’s evidence that the payments had to be made quickly so as to secure the Shenyang Shop. Conversely, such urgency would not support Andy’s contention that the payments were made to him as a gift. 29     It was also important to note that the amount of the Trust Money was not insignificant and would appear to represent a sizeable portion of Sarah’s assets. According to copies of Sarah’s IRAS Consolidated Statement for the year of assessment 2005 and her Notice of Assessment for the year of assessment 2006, Sarah’s annual income, less expenses, was $102,110.25[note: 8]and $101,825[note: 9]respectively. On the evidence, it was also apparent that Sarah jointly owned other properties with her husband and her siblings. It was not, however, clear how much the properties were worth and what Sarah’s share of the various properties were. Sarah also had moneys in various bank accounts. Since the exact value of Sarah’s total assets was not in evidence, it was not possible to present the Trust Money as an exact proportion of the total value of her assets. It was nonetheless evident from the available evidence that although Sarah was not a woman of little means, the Trust Money represented a not insignificant portion of her total assets. Furthermore, at the material time, Sarah was under the impression that her husband would soon divorce her, and Tik, whom she trusted, had advised her to hide her assets so that she would still be able to provide for her children, who were then aged only 14 and 10 respectively. In the light of these circumstances (including Sarah’s own needs and those of her children), it did not make sense at all for Sarah to give such a large sum to Andy, especially when Andy himself had not even asked for it. 30     We were also of the view that the Judge, with respect, drew the wrong inferences from the only objective piece of evidence which was specifically and directly on point as to whether the Trust Money was given as a gift to Andy. This piece of evidence was a SMS message sent by Sarah to Andy on 14 October 2008 as follows:[note: 10] Pls do not say I love u to me again.Just find any man who will give me 700k w no strings attachn I will say I love u. Do not make me angry.When I asked u to mortgage the property to loan me the $, u refused.So don’t I love u again w me. [emphasis added] The Judge made two points about the above SMS message at [47] of the Judgment. First, he found that Sarah was in effect telling Andy that she had given him the sum of $700,000 with “no strings attached”. We disagreed that this was necessarily the correct interpretation. The fact that Sarah had asked for a man who would give her $700,000 with no strings attached did not necessarily mean that she had herself given Andy the Trust Money with no strings attached (ie, as a gift). Quite the opposite, the SMS message might simply have meant that Sarah wished that someone could reimburse her, with no conditions attached, the $700,000 which had been poured into investments that had not materialised. In this regard, it must also be borne in mind that we did not have in evidence the SMS message from Andy to which Sarah sent the above message in response (see [37] below, where we remark on the selective disclosure of SMS messages by Andy and his wholly improbable claim that he had deleted his SMS messages to Sarah). 31     Second, the Judge noted that there was a dispute as to the identity of the property referred to in the SMS message set out at [30] above. According to Sarah, the property referred to the Shenyang Shop, whereas according to Andy, the property referred to some other property purchased in Russia in early 2006. The Judge did not go on to make a specific factual determination as to which property the SMS message referred to, but found that Sarah’s version was untenable because if the Trust Money had been paid to Andy under an express trust, Sarah would not have asked for the proceeds of the mortgage of the Shenyang Shop to be loaned to her. Instead, Sarah would have been fully entitled to simply demand that Andy pay her the entire mortgage proceeds. 32     It seemed to us that in coming to this view, the Judge did not sufficiently bear in mind the following aspects of Sarah’s evidencevis-à-visthe SMS message at [30] above. According to Sarah, sometime in April 2006, she requested Andy to either mortgage the Shenyang Shop or sell the Airport Land so that she could use the proceeds (from either the mortgage or the sale) to pay for some land in Australia which she had contracted to buy. Andy informed her that he had sold both the China Properties, and that he had invested the proceeds in a Russian timber forest. He claimed that he had been cheated by the timber merchants and had lost all of the Trust Money. He also asked for $100,000 to start all over again. However, Andy’s assertion that he had invested the proceeds of the China Properties in property in Russia could not be true because his passport entries[note: 11]showed that he only went to Russia much later from 21 July 2006 to 3 August 2006. Thus, the property mentioned in the SMS message at [30] above could only have been the Shenyang Shop and not the Russian property. Moreover, Sarah’s specific reference to “the” property instead of “a” property reinforced the point that the Trust Money was intended to be for, and was understood by her to have been applied to, a specific investment. As for the issue of Sarah having asked for a loan instead of for repayment, Sarah was not challenged on this when she was on the stand. She did, however, explain, when conducting her own cross-examination of Andy, that she had asked for a loan instead of for repayment as she was not supposed to obtain the fruits of the investment until three years later. The relevant portion of the transcript is as follows:[note: 12] AInitially, you told me that you wanted money from me and I told you that – and I told you that I have bought the – bought a land using the money. So you asked me whether I can mortgage the property. Just like what I’d said previously, if you did not give me the loan, how would you say “loan me” in this context? QBecause the property was supposed to be – he’s supposed to collected 700,000; 3 years later, return me double. In fact, I told him, I said, “Don’t need double. You give me 1 million. I’m happy.” We would underscore that Sarah’s explanation on this point was not an afterthought as she had in her AEIC already alluded to this three-year arrangement between herself and Andy as follows:[note: 13] 64.    I told Pang that Tik said that he would have good business opportunities. Pang told me that he had a lot of business connections in China. Pang told me that it would be good to invest in property in China and thatthe returns would be good in view of the Olympics, which would be held in Beijing in 2008. … 81.    Tik read from her cards that: (a)    … Pang would be successful in the business in China.Pang would double my money for me in 3 years’ time. … 82.    Based on what Tik said, I decided to proceed with my investments in the Shenyang Shop and the Airport Land. Otherwise, I would lose the sums of $83,700 and $45,000 already given to Pang. I was also unsure whether my husband would change his mind about breaking up with the other woman. If I eventually divorced my husband, I would have more money for my children.In any event, once Pang doubled my money in 3 years’ time, I would be able to pay off my other mortgages. … 102.  … Pang asked me not to worry and to let him concentrate on the business. Pang said there was no need to call him regularly for updates anymore. Pang promised to work hard and told me thathe would double my money in 3 years’ time.… [emphasis added]",
        "Conclusion on the Trust Claim": "33     For the above reasons, we were of the view that it was not likely that Sarah gave the Trust Money to Andy as a gift. Instead, we found that Sarah had established, on a balance of probabilities, that the Trust Money was given to Andy to be held on an express trust to invest in land and property in China. It was not necessary for us to further consider Sarah’s alternative cause of action based on the presumption of a resulting trust since it was undisputed that Andy did not apply the Trust Money in accordance with his equitable duties as a trustee and had therefore clearly breached the express trust. We thus allowed Sarah’s appeal on the Trust Claim. We will now turn to the Blackmail Claim.",
        "The tort of intimidation": "34     To prove the tort of intimidation, Sarah had to prove that: (a) there was a threat by Andy to use unlawful means (such as violence or a tort or a breach of contract) to compel her to obey his wishes; and (b) she was so threatened that she complied with Andy’s demand rather than risk the threat being carried into execution (seeGoh Chok Tong v Chee Soon Juan[2003] 3 SLR(R) 32 at [49]). 35     In the week leading up to the giving of the Blackmail Money on 23 January 2009, Sarah sent Andy the following SMS messages:[note: 14] DateSMS Message17 January 2009Can meet u at orchard road Liat tower burger king at 12 today.19 January 2009Is it only a air ticket. Will check w my friend how much a air ticket cost nwill pay for the air ticket. The rest is up to u.I never said I love n I never love u n don’t need yr love. Pls erase my number n I hv nothing to do w u. U don’t hv to pay me the 700k. Just my bad luck. Good bye forever.Sori. I can only pay for air ticket. M thinking 2 to 3k. since hv to pay 7k mortgage every month. If u can’t accept, do what yr heart wants. God will know the truth I do not hv 100k of my own other than those in CPF. U can hate me. No diff. Love me also harm me. May as well hate me.20 January 2009Will not reply yr sms anymore. I cannot give u something I don’t hv. My CPF has 100K. Penang is right. Cash I can help you 2 to 3k. Sori if I owe in the previous life, will pay in my next life. Will not blame u if u go penang. If he so true he will know we can’t withdraw CPF $.21 January 2009This morning went to waterloo guang yin temple. To[l]d goddess I do not hv $ to give u if god willing, help me strike 4D n will give u all $ I strike. Bought me tel no 0848 $100. I seldom buy 4D. Came out 0448 n 0948. Now u can go ask penang to help u find someone else to help u. I believe in waterloo guan yin. She knows best. Gd bye.22 January 2009U hv reallybecome so low class. What u going to say when they ask u how u going to pay tee yok kiat. U r going to say I owe u in previous life. So this life u don’t work n go around asking n cheating people $. Pls wake up n start working n stop being a useless person.I lost so much $ n each day I work hard. I ask no one to pity me. Not even my family. They wonder why I so rich n yet work so hard. Yet u can belazyfor the last 3 years. Now can come blackmail me. This is blackmail in caseyr English so poor. Pls think thr this whole night n ask yourself whether u doing the right thing. Tomorrow go waterloo quan yin n ask goddess if u doing the right thing.My my. U really worst than aparia dog.23 January 2009Andy. Can we meet at 11.30am today. R u staying at woodland.I meet u at civic plaza. TqOk. We meet at 10.30am?Meet first. Will u b able to be there at 10.30 or you prefer 11am.Will help u. Meet u at 11am?M on the way. 11.10am.Will pass in 50K on 1 condition. U r out of my life completely forever… No sms etc. Unless just to say u hv deposited $ to my ac if u want to.Now will go bank n tell me where u r n will pass u the $.   [emphasis added] 36     The Judge held that the tort of intimidation was not made out as Sarah had, at the material time that the threats were allegedly made, called Andy “lazy”,[note: 15]“a paria dog”,[note: 16]“low class”[note: 17]and criticised his English as “poor”.[note: 18]In the Judge’s view, “[t]his [was] hardly language one would use in response to a ‘blackmailer’” (see [79] of the Judgment). In his view, Sarah made the payment to Andy because of their relationship, which had turned sour by that point in time, and not because she was intimidated by him. 37     We were of the view that the mere fact that Sarah had called Andy “lazy”,[note: 19]“a paria dog”,[note: 20]etc, did not mean that Sarah could not have been threatened by Andy. What was crucial was that Sarah eventually did pay $50,000 to Andy, succumbing to his threat, although not to the full extent of paying the $100,000 which Andy had demanded. Here again, it is critically important to construe each of the above SMS messages in its proper context,ie, each SMS message must be read together with the prior incoming SMS message(s). At this juncture, we would observe that Andy only made selective disclosure of the 16 SMS messages set out at [35] above out of a total of 59 SMS messages which were sent by Sarah to him between October 2008 (when Andy came back from China for good) and January 2009, as evidenced by Sarah’s mobile phone records.[note: 21]Furthermore, Andy, for reasons of his own, chose not to disclose any of the SMS messages that he had sent to Sarah. When cross-examined on this, Andy’s explanation was that he had deleted the SMS messages which he had sent to Sarah because he felt “pain in [his] heart”[note: 22]when he saw those messages. We could not accept this explanation as credible. If that were in fact true, surely, Andy would have deleted both the SMS messages which he had received from Sarah as well as the SMS messages which he had sent her, instead of deleting only the latter category of SMS messages. We could not help but think that disclosure of the SMS messages sent to Sarah would have been damaging to Andy’s defence. In our opinion, an adverse inference should have been drawn by the Judge against Andy on this count. Interestingly, we also noted that Andy claimed that he had lost his mobile phone and the portable flash drive that contained the data of some SMS messages which were retrieved by Sarah’s forensic expert. This was an overly convenient claim on Andy’s part. Nevertheless, the Judge was not prepared to draw any adverse inference against Andy in respect of the alleged loss of his mobile phone and the aforesaid portable flash drive. With respect, we differed. For completeness, we should mention that Sarah was unable to produce the SMS messages which she had received from Andy before March 2009 because she had not kept them and her service provider also did not keep a record of past incoming SMS messages.[note: 23]Sarah was, however, able to produce her call listings[note: 24]from October 2008 to January 2009, which corroborated her account that she had sent a total of 59 SMS messages to Andy during that period. 38     In the light of all these considerations, we felt compelled to find for Sarah on the tort of intimidation. We therefore allowed Sarah’s appeal under the tort of intimidation.",
        "The tort of harassment": "39     Although it was not strictly necessary for us to consider Sarah’s alternative cause of action under the tort of harassment in the light of our finding that her claim based on the tort of intimidation had been made out, we would nonetheless make some brief observations on this point. The existence of the tort of harassment was extensively explored by the High Court inMalcomson Nicholas Hugh Bertram and another v Mehta Naresh Kumar[2001] 3 SLR(R) 379 at [31]–[57]. None of the parties questioned the existence of this tort in our law. For the tort of harassment to be made out, Sarah had to prove that: (a) Andy’s course of conduct, whether by words or action and whether directly or through third parties, was sufficiently repetitive in nature as would cause worry, emotional distress or annoyance to her; and (b) Andy ought reasonably to have known that his conduct would have such an effect on her. 40     At [76]–[83] of the Judgement, the Judge dismissed the Blackmail Claim under both the tort of intimidation and the tort of harassment on the same grounds (ie, Sarah had failed to prove that she was threatened). We entertained some concern over such an approach because the ingredients of the torts of intimidation and harassment are different in two respects. First, the action required on the part of the tortfeasor is different. Under the tort of intimidation, a threat by the tortfeasor is required. In contrast, under the tort of harassment, any course of conduct by the tortfeasor which is sufficiently repetitive in nature as would cause worry, emotional distress or annoyance to the victim will suffice. Second, the response on the part of the victim is also different under the two torts. Under the tort of intimidation, the victim must be so threatened that she complies with the tortfeasor’s demand rather than risk the threat being carried out. In contrast, under the tort of harassment, the victim only needs to prove that the tortfeasor’s conduct causes her worry, emotional distress or annoyance. 41     In the present case, Sarah’s assertion that she was harassed by Andy’s repeated emotional blackmail and that she was worried, emotionally distressed and/or annoyed was clearly borne out by the evidence. First, it could be inferred from the string of SMS messages reproduced above at [35] that Sarah responded repeatedly to Andy’s persistent requests for financial assistance over a period of time. This was consistent with Sarah’s mobile phone records,[note: 25]which showed that she received several calls from Andy in between the SMS messages. In particular, Sarah’s assertion that Andy emotionally blackmailed her was supported by the following SMS message which she sent him on 22 January 2009:[note: 26] I lost so much $ n each day I work hard. I ask no one to pity me. Not even my family. They wonder why I so rich n yet work so hard. Yet u can be lazy for the last 3 years.Now can come blackmail me. This is blackmail in case yr English so poor. Pls think thr this whole night n ask yourself whether u doing the right thing. Tomorrow go waterloo quan yin n ask goddess if u doing the right thing. [emphasis added] Further, Sarah’s annoyance at Andy’s harassment was evidenced in the SMS message which she sent him on 23 January 2009:[note: 27] Will pass in 50K on 1 condition. U r out of my life completely forever… No sms etc. Unless just to say u hv deposited $ to my ac if u want to. [emphasis added] 42     In addition to the SMS messages and mobile phone call records, Tik’s evidence on the stand during cross-examination by Sarah also corroborated Sarah’s evidence that she was harassed by Andy and was in a state of worry, emotional distress or annoyance. The relevant portion of the transcript is as follows:[note: 28] A:You call me – you told me, er, we talking about that is, er, he when – so you say that Mr Pang ask you for money but, er, then I say “How much?” You say – you – you – about 50,000, you say you got no money. I say you got no money, then you don’t give, yah. Then after that, you tell me in everything that is, er, he now owe you until thats – he owe you quite a sum, then I quite shock. Then –Court:Sorry? Can you repeat what you just said?Witness:The – his – she call me at that time, if I’m not wrongly to hear because she think that she talking about Mr Pang thing.Court:Yes?Witness:Yah but this one, I –she told she’s scaredto her husband know but I cannot recall clearly because quite some time back, I don’t know what I’m talking. Just roughly, she say she scared her husband know, what can she do? She got no money. I say no money, don’t give lor.Then she say, “He arrest [sic] me.”“Then you can report to the police”, I tell her that. But after that, I see the polit [sic], I quite shock. It’s also got my name inside that I don’t understand thats, yah.Because you scared–you tell me that you scared your husband to know.Actually, you got no money becauseyou scared your husband to knowthat you got something with him that you tell me that. I knew this one thats you tell me two – you remember two zero – first time you come to me at Katong, you say that you have something with him lah.   [emphasis added in italics and bold underlining] As a point of clarification, the word “arrest” in the phrase “Then she say, ‘He arrest [sic] me’” emphasised in bold underlining above was probably a transcription error. The phrase should be accurately read as “Then she say, ‘He harassed me’”. 43     For the above reasons, we found that the tort of harassment would also have been made out on the evidence.",
        "Conclusion on the Blackmail Claim": "44     As both the torts of intimidation and harassment were made out on the evidence, we allowed the appeal in relation to the Blackmail Claim.",
        "Conclusion": "45     For the above reasons, we allowed Sarah’s appeal in its entirety. Sarah was therefore entitled to judgment for $608,700, being the subject matter of the Trust Claim, and $50,000, being the subject matter of the Blackmail Claim, with interest at the rate of 3% from the date of the filing of the Writ of Summons. Sarah was also entitled to the costs of this appeal, the costs of SUM 4377, as well as the costs of the proceedings below. We also made the usual consequential orders.  [note: 1]Record of Appeal Vol III Part A at p 52, para 102. [note: 2]Appellant’s Core Bundle Vol II at pp 155–156. [note: 3]Appellant’s Core Bundle Vol II at p 157. [note: 4]Record of Appeal Vol III Part F at p 283, line 24. [note: 5]Record of Appeal Vol III Part C at pp 232–249. [note: 6]Appellant’s Core Bundle Vol II at p 96. [note: 7]Record of Appeal Vol III Part A at pp 134–135. [note: 8]Record of Appeal Vol III Part A at pp 231–235. [note: 9]Record of Appeal Vol III Part A at p 236. [note: 10]Appellant’s Core Bundle Vol II at p 87. [note: 11]Appellant’s Core Bundle Vol II at pp 159–162. [note: 12]Record of Appeal Vol III Part F at p 287, line 27 to p 288, line 2. [note: 13]Record of Appeal Vol III Part A at pp 37–52. [note: 14]Appellant’s Core Bundle Vol II at pp 88–91. [note: 15]Appellant’s Core Bundle Vol II at p 90. [note: 16]Ibid. [note: 17]Ibid. [note: 18]Ibid. [note: 19]Ibid. [note: 20]Ibid. [note: 21]Record of Appeal Vol III Part A at p 75, para 174. [note: 22]Record of Appeal Vol III Part F at p 273, line 4. [note: 23]Record of Appeal Vol III Part A at p 75, para 174. [note: 24]Record of Appeal Vol III Part A at pp 76–80, and Record of Appeal Vol III Part B at pp 113–237. [note: 25]Record of Appeal Vol III Part A at p 76, para 179. [note: 26]Appellant’s Core Bundle Vol II at p 90. [note: 27]Appellant’s Core Bundle Vol II at p 91. [note: 28]Record of Appeal Volume III Part G at p 108, lines 3–26."
    }
}