{
    "case_title": "PT Bakrie Investindo\n      v\n      Global Distressed Alpha Fund 1 Ltd Partnership",
    "ncitation": "[2013] SGCA 51",
    "coram": "Sundaresh Menon CJ; \n      Andrew Phang Boon Leong JA; \n      Judith Prakash J",
    "sections": {
        "Introduction": "1       As the late Lord Denning MR aptly put\n                    it, “[w]ords are the lawyer’s tools of trade” (see\n                    Lord Denning,The Discipline of Law(Butterworths, London, 1979) (“The Discipline of\n                        Law”) at p 5). The reason for this is clear; as the\n                    learned Master of the Rolls proceeded to observe (ibid): The reason why words are so important is because words are the vehicle of\n                        thought. When you are working out a problem on your own – at your desk\n                        or walking home – you think in words, not in symbols or numbers. When\n                        you are advising your client – in writing or by word of mouth –\n                        you must use words. There is no other means available. 2       However, words – or in the context of the\n                    present appeal,aword – might not always be\n                    clear. There are various reasons for this. The same word might – without\n                    even beginning to consider the context in which the word itself is used –\n                    have completely different meanings (take, for example, the word\n                    “toast” which may mean “bread in slices browned on both\n                    sides by radiant heat”or“a person … or thing in whose\n                    honour a company is requested to drink”or“a call to drink or an instance of\n                    drinking in this way” (seeThe Concise Oxford\n                        Dictionary of Current English(Clarendon Press, Oxford,\n                    8th Ed, 1990) at p 1281)). In addition, a word with a certain specific\n                    meaning might nevertheless mean different things in different contexts. Again,\n                    Lord Denning put it well when he referred to difficulties stemming from\n                    what he termed “the infirmity of the words themselves” (The Discipline of Lawat p 5). But courts must\n                    nevertheless arrive at considered (and definite as well as clear) decisions in\n                    accordance with logic, principle and context in the case at hand. They must, in\n                    this regard, utilise all relevant legal materials. And they must, of course,\n                    assiduously avoid the approach of Humpty Dumpty in Lewis Carroll’sThrough the Looking-Glass(Macmillan & Co, London, 1871) (a sequel to the same\n                    author’s equally famous book,Alice’s Adventures\n                        in Wonderland(Macmillan & Co, London, 1865)); in\n                    particular, the court cannot make the word mean whatitchooses it to mean. Again, to cite Lord Denning (albeit\n                    from another book,The Closing Chapter(Butterworths, London,1983) at p 58): So in the allegory Humpty Dumpty makes the word mean just whathechooses it to mean. When he does that, he is\n                        riding for a fall. He does fall and is broken in pieces. We all know the\n                        nursery rhyme … [emphasis in original] 3       However, as just mentioned, ascertaining the\n                    meaning of words is not always an easy task in practice. Indeed, the late\n                    Prof Glanville Williams wrote a famous article almost seven decades ago,\n                    which has stood the test of time and whose title is self-explanatory –\n                    “Language and the Law”. It is a veritabletour\n                        de forcefrom both theoretical as well as practical points of\n                    view, exploring virtually every aspect of language and the law (including even\n                    the emotive function of words). However, the quantity as well as quality of the\n                    various difficulties resulted in an unprecedentedfive\n                        partarticle comprising a total of 87 pages and spanning two\n                    volumes ofThe Law Quarterly Review(see (1945)\n                    61 LQR 71, 179, 293 and 384, as well as (1946) 62 LQR 387) –\n                    merely underscoring the immense difficulties concerned. 4       The present appeal was another (albeit more\n                    specific as well as modest) instance of the difficulties encountered with the\n                    meaning of words (or rather, as already mentioned,aword). As we shall see, the sole issue in this appeal against\n                    the decision of the judge (“the Judge”) inGlobal Distressed Alpha Fund I Ltd Partnership v PT Bakrie\n                        Investindo[2013] 2 SLR 429 (“the GD”) centred\n                    on the meaning of the word “execution” in O 67 r 10(2)\n                    of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“the\n                    Rules”). In particular, do examination of judgment debtor proceedings\n                    (“EJD”) come within the meaning of the word\n                    “execution” for the purposes of O 67 r 10(2) of the\n                    Rules (“O 67 r 10(2)”)? Order 67 r 10 itself\n                    reads as follows: (1) Execution shall not issue on a judgment registered under the\n                        [Reciprocal Enforcement of Commonwealth Judgments Act (Cap 264)] or\n                        [Reciprocal Enforcement of Foreign Judgments Act (Cap 265)] until after\n                        the expiration of the period which, in accordance with Rule 5(2), is\n                        specified in the order for registration as the period within which an\n                        application may be made to set aside the registration or, if that period has\n                        been extended by the Court, until after the expiration of that period as so\n                        extended. (2)If an application is\n                            made to set aside the registration of a judgment,executionon the judgment shall\n                            not issue until after such application is finally\n                        determined. (3) Any party wishing to issue execution on a judgment registered under\n                        the [Reciprocal Enforcement of Commonwealth Judgments Act (Cap 264)] or\n                        [Reciprocal Enforcement of Foreign Judgments Act (Cap 265)] must\n                        produce to the Sheriff an affidavit of service of the notice of registration\n                        of the judgment and any order made by the Court in relation to the\n                        judgment. [emphasis added in italics and bold italics] 5       The Judge answered in the negative and an appeal\n                    was brought against this decision. We dismissed the appeal and now give the\n                    detailed grounds for our decision.",
        "The proceedings below": "6       The Appellant is an investment holding company\n                    incorporated in the Republic of Indonesia. In 1996, it underwrote US$50m worth\n                    of guaranteed notes issued by one of its subsidiaries. When the subsidiary was\n                    unable to make good on those notes at maturity, the Appellant entered into a\n                    composition plan with the creditors which was ratified by the courts in Jakarta.\n                    On 16 November 2009, the Respondent purchased US$2m of the distressed notes\n                    from a prior holder and commenced proceedings on the Appellant’s guarantee\n                    on 14 December 2009 in the Commercial Court of England and Wales. Judgment\n                    was entered in the Respondent’s favour on 17 February 2011 for the\n                    sum of US$2m with interest to be assessed. Default costs totalling\n                    £205,327.98 were also awarded on 10 June 2011. These two orders are\n                    collectively referred to herein as “the UK\n                Judgment”. 7       The UK Judgment was registered as a judgment of\n                    the High Court of Singapore pursuant to s 3 of the Reciprocal Enforcement\n                    of Commonwealth Judgments Act (Cap 264, 1985 Rev Ed)\n                    (“RECJA”) on 18 July 2011 (“the Registration\n                    Order”). Following from this, the Respondent obtained an order to examine\n                    one Robertus Bismarka Kurniawan (“Mr Kurniawan”), the former\n                    Chairman of the Appellant’s Supervisory Board, as to the Appellant’s\n                    assets (“the EJD Order”). On 31 August 2012, the Appellant\n                    applied to set aside both the Registration Order and the EJD Order (“the\n                    Setting Aside proceedings”). 8       The present appeal arose from the\n                    Appellant’s request for the examination of Mr Kurniawan to be\n                    adjourned until the Setting Aside proceedings were finally disposed of by the\n                    Court of Appeal. On 21 November 2012, the assistant registrar\n                    (“AR”) dismissed the Appellant’s application for the\n                    examination to be adjourned. On 17 December 2012, the Appellant’s\n                    appeal against the AR’s decision was dismissed by the Judge below. The GD\n                    was issued on 20 January 2013.",
        "The issues": "9       The Appellant appealed against the GD which\n                    dealt with the following issues: (a)     Whether an EJD comes within the\n                        meaning of the word “execution” for the purposes of O 67\n                        r 10(2) (“Issue 1”)? (b)     Whether an application to set aside a\n                        registration of a foreign judgment registered under the RECJA is considered\n                        “finally determined” for the purposes of O 67\n                        r 10(2) if the application is pending hearing before the Court of\n                        Appeal (“Issue 2”). 10     The main issue was Issue 1. Indeed, in\n                    the court below, as the Judge had resolved that particular issue in the\n                    Respondent’s favour, his decision on Issue 2 (as he acknowledged in\n                    the GD at [33]) was, strictly speaking,obiter\n                        dicta. 11     Before proceeding to consider each of the\n                    issuesseriatim, it is important – for\n                    reasons which will become apparent in a moment – to consider a preliminary\n                    procedural point.",
        "A preliminary procedural point": "12     There was a preliminary procedural point\n                    which, as we shall see, was of crucial importance. This arose from the\n                    Respondent’s submission to this court that the Appellant’s appeal in\n                    the present case required leave from the Judge and that, in the circumstances,\n                    as no leave had in fact been obtained, the notice of appeal must be struck out.\n                    Whether the Respondent’s submission succeeded depended on whether the\n                    application to adjourn the EJD was an “interlocutory application”.\n                        Paragraph (e) of the Fifth Schedule to\n                    the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) provides\n                    that: Except with the leave of a Judge, no appeal shall be brought to the Court\n                        of Appeal in any of the following cases: … (e) where a Judge\n                            makes an order at the hearing of anyinterlocutory\n                                applicationother than an application for any of the\n                            following matters: (i) for summary judgment; (ii) to set aside a default judgment; (iii) to strike out an action or a matter commenced by a writ of\n                                summons or by any other originating process, a pleading or a part of\n                                a pleading; (iv) to dismiss an action or a matter commenced by a writ of\n                                summons or by any other originating process; (v) for further and better particulars; (vi) for leave to amend a pleading; (vii) for security for costs; (viii) for discovery or inspection of documents; (ix) for interrogatories to be varied or withdrawn, or for leave\n                                to serve interrogatories; (x) for a stay of proceedings. [emphasis added] 13     The Respondent’s argument in this\n                    particular regard was a straightforward one: the Appellant had applied only for\n                    anadjournmentof the EJD which had been granted\n                    in favour of the Respondent and the Appellant’s substantive argument\n                    against the EJD Order was,inter alia, the subject\n                    of a separate appeal before this court as part of the Setting Aside proceedings\n                    (which appeal was, in fact, also recently dismissed without any written grounds\n                    in Civil Appeal No 145 of 2012). In the circumstances, the Respondent\n                    argued that the dismissal of the application for an adjournment was an order\n                    made at the hearing of an interlocutory application – for which leave to\n                    appeal was required but not obtained. We found much force in this argument,\n                    having regard not only to the Judge’s own view in this case (see the GD at\n                    [1] and [7]) but also to the Setting Aside proceedings just mentioned. Indeed,\n                    it did not make sense that the Appellant would mount a similar (and substantive)\n                    attack on the EJD Order in two simultaneous sets of proceedings. It was then\n                    clear, in our view, that the application before the Judge was an interlocutory\n                    application which did not finally determine (as to which see the decisions of\n                    this court inWellmix Organics (International) Pte Ltd v Lau\n                        Yu Man[2006] 2 SLR(R) 525 at [12]–[15] andDorsey James Michael v World Sport Group Pte Ltd[2013]\n                    3 SLR 354 (“Dorsey James\n                    Michael”) at [90] (the latter commenting on this court’s\n                    decision ofOpenNet Pte Ltd v Info-Communications Development\n                        Authority of Singapore[2013] 2 SLR 880 (“OpenNet Pte Ltd”))) any of the Appellant’s\n                    claims under the Setting Aside proceedings. As such the notice of appeal in the\n                    present case ought to have been struck out and the Appellant’s appeal had\n                    to fail on this ground alone. However, as detailed arguments in both written and\n                    oral forms were presented to us and as the legal issues in question (in\n                    particular Issue 1) were significant ones, we will nevertheless proceed to\n                    address them accordingly.",
        "Our decision": "",
        "Issue 1": "The crux of our decision 14     A point of some importance, in our view, was\n                    in fact referred to briefly by the Judge (see the GD at [31], also quoted below\n                    at [25]): that the application for an EJD order, whilst implemented via\n                    O 48 of the Rules, is not mentioned in O 45 of the Rules which is a\n                    general rule setting out the various modes by which a judgment or order for the\n                    payment of money may beenforced. In so far as a\n                    judgment or order for the payment of money (notbeing a judgment or order for payment of moneyinto\n                        Court) is concerned, O 45 r 1(1) refers to the\n                    following modes of execution: writ of seizure and sale, garnishee proceedings,\n                    the appointment of a receiver as well as (where O 45 r 5 applies) an\n                    order of committal. And, in so far as a judgment or order for the payment of\n                    moneyinto Courtis concerned, O 45\n                    r 1(2) refers to the following modes of execution: the appointment of a\n                    receiver and (where O 45 r 5 applies) an order of committal. Like the\n                    application for an EJD order (which, as mentioned, is implemented via\n                    O 48), all these various modes of execution are also elaborated upon in\n                    separate orders in the Rules themselves.However,\n                    as already mentioned, it is significant, in our view, thatan\n                        EJDorder isnotincluded within\n                    the specific modes of execution mentioned in O 45 r 1(1)–(2).\n                    The reason for this is clear fromthe nature and\n                        functionsof anEJDitself. 15     Indeed, in Form 99 of the Rules (relating\n                    to the affidavit in support of an application for an EJD order), it is stated at\n                    para 3 that the application is “[i]n order to enable the plaintiff\n                    to decide uponthe methods to employ to enforcethe said judgment” [emphasis added]. Indeed, as Prof Jeffrey Pinsler\n                    points out in his leading treatise on civil procedure in Singapore,Singapore Court Practice 2009(LexisNexis, 2009), at\n                    para 48/1/1: The rules provide a process for the examination of the judgment debtor so\n                        that information as to his means may be obtainedfor the\n                            purpose ofdetermining the appropriate\n                            mode of enforcement. (InRe Sassoon\n                            Ezekiel[1933] MLJ 245, at 246, the process was said to be\n                            ‘discovery in aid of\n                        execution’.). … The official process of examination\n                        isuseful because it mayconfirm and supplementany existinginformationwhich the judgment creditor might have by allowing him toobtain additional or new informationwhich may be availablein aid of enforcement.\n                        [emphasis added in italics and bold italics] 16     It is clear, in our view, that an EJD order isnot – in and of itself –amode of executionof a judgment. It is\n                    intended to aid the judgment creditor (here, the Respondent) in garnering\n                    additionalinformationwhich might – or\n                    might not – result in the implementation of actualexecutionof the judgment concerned (see also the decision of\n                    the English Chancery Division reported inRepublic of Costa\n                        Rica v Strousberg(1880) 16 Ch D 8 (“Costa Rica v Strousberg”) at 10,perMalins VC, which was overturned on appeal but\n                    not on this point; the GD at [26]–[30], citing the English Court of Appeal\n                    decision ofFagot v Gaches[1943] 1 KB 10;\n                    the Singapore High Court decision ofUnited Overseas Bank Ltd\n                        v Thye Nam Loong (S) Pte Ltd[1994] SGHC 262; as well as the\n                    Straits Settlements (Singapore) decision ofRe Sassoon\n                        Ezekiel[1933] MLJ 245 (the last-mentioned decision which was in\n                    fact cited by Prof Pinsler (see above at [15]))). In other words, an EJD\n                    order does noteffectthe judgment of the court\n                    but it may render that judgment moreeffective. It\n                    is also worth noting that in the UK, the EJD order is provided for under\n                    Part 71 of the Civil Procedure Rules 1998 (SI 1998 No 3132) (UK),\n                    the preamble to which states that it contains “rules which provide for a\n                    judgment debtor to be required to attend court to provide information,for the purpose ofenablinga judgment creditor to enforce a judgment or\n                        order against him” [emphasis added in italics and bold\n                    italics]. Further, such an order can be obtained even where the enforcement of\n                    the judgment has been stayed (seeCivil Procedurevol 1 (Sweet & Maxwell, 2013) at para 71.2.8 citing the\n                    English High Court decision ofSucden Financial Ltd v\n                        Fluxo-Cane Overseas Ltd[2009] EWHC 3555 (QB), 4 December\n                    2009, unreported). 17     In the circumstances, an EJD isquite different fromthebankruptcy\n                        noticewhich was the focus of the Singapore High Court decision\n                    ofRe Cheah Theam Swee, ex parte Equiticorp Finance Group Ltd\n                        and another[1996] 1 SLR(R) 24 (“Cheah Theam Swee”), wherein it was held that a bankruptcy\n                    notice did fall within the meaning of “execution” under\n                        s 3(3)(b) of the RECJA, which provides\n                    that: (b) the registering court shall have the\n                        same control and jurisdiction over the judgment as it has over similar\n                        judgments given by itself, butin so far only as relates\n                            to execution under this section; [emphasis added] 18     Indeed,unlikean EJD, a bankruptcy notice is the first legal step towards theenforcementof the judgment itself by way of a securing\n                    of the judgment debtor’s assets; viewed in this light, it is not unlike\n                    the modes of enforcement already referred to above at [14] (for example, a writ\n                    of seizure and sale as well as garnishee proceedings). Whilst, however, it is\n                    true that a bankruptcy notice would entail more than what is involved when the\n                    traditional modes of execution are concerned, this does not detract from the\n                    fact that the issuance of a bankruptcy noticeincludesthesamepurpose as the\n                    traditional modes of execution. This is a critical distinction, especially since\n                    the Appellant had relied almost solely onCheah Theam\n                        Sweein attempting to make out its case in the context of the\n                    present appeal. Whilst it could be argued that an EJD might also lead ultimately\n                    to a securing of the judgment debtor’s assets, this isnotitspredominantpurpose which\n                    is (as we have just noted) the garnering of additionalinformationand which is, in our view,one\n                        prior step removedwhen compared to the issuance of a bankruptcy\n                    notice. Looked at in this light, it is our view that there is in fact a real\n                    distinction between an EJD on the one hand and the issuance of a bankruptcy\n                    notice on the other. 19     This is also borne out by the historical\n                    development of the two orders. The direct ancestry of the EJD procedure can be\n                    traced to s 60 of the Common Law Procedure Act 1854 (17 & 18\n                    Vict c 125) (UK), which provided that a judgment creditor could apply to\n                    the court for an order that the judgment debtor be orally examined in relation\n                    to any debts owing. Prior to this, the oral examination of the judgment debtor\n                    did not appear to be part of the procedure of either the common law or chancery\n                    courts (seeCosta Rica v Strousbergat 9,perMalins VC). However, a similar order\n                    was available in the Court of Bankruptcy established by the Bankruptcy Court\n                    (England) Act 1831 (1 & 2 Will IV c 56) (UK). In the\n                    18th century, imprisonment for debt was a common means of enforcement\n                    against judgment debtors (on which see William Cornishet\n                        al,The Oxford History of the Laws of\n                        Englandvol 12 (Oxford University Press, 2010) at\n                    pp 797–803). The hardship of such an enforcement mechanism prompted\n                    numerous reforms, including the passage of the Execution Act 1844\n                    (7 & 8 Vic c 96) (UK) which allowed judgment debtors to file\n                    a Petition for Protection from Process so as to prevent his committal or\n                    continued detention. Section 5 of the Act gave the Commissioner of the\n                    Court of Bankruptcy a broad power to compel the attendance of the petitioner\n                    (and alsointer aliahis wife, creditors, and any\n                    other person in possession of the petitioner’s property) to be examined\n                    regarding his person, trade, business, calling, dealings or property in this\n                    connection. It would therefore appear that a variant of this procedure was\n                    adopted into the wider apparatus of the common law courts in 1854. Subsequently,\n                    in the Debtors Act 1869 (32 & 33 Vic c 62) (UK), it was\n                    provided that imprisonment for debt could only be imposed if it could be shown\n                    that the judgment debtor had the means to pay but refused or neglected to do so.\n                    Section 5(2) of that Act provided for the examination of the judgment\n                    debtor on oath for this purpose. Indeed, our present Bankruptcy Act\n                    (Cap 20, 2009 Rev Ed) also provides for the examination of the\n                    bankrupt under s 83(1), in relation to which the EJD procedure under\n                    O 48 of the Rules can be considered a distant cousin. Thus it can be seen\n                    that the modern day EJD procedure has its origins as anancillaryprocess to bankruptcy proceedings whereby an EJD has\n                    always been both instrumental and anterior to execution. 20     However, in fairness to the Appellant, this is\n                    not the end of the matter in so far as this appeal is concerned because it could\n                    be argued that the analysis just set out is consistent with anarrowreading of the word “execution” in\n                    O 67 r 10(2), whereas the approach\n                    Warren L H Khoo J adopted inCheah Theam\n                        Sweeconstituted abroadreading of\n                    the same word (albeit in the context of s 3(3) of the RECJA). The learned\n                    judge’s reasoning in this regard was as follows (at\n                    [20]–[26]): 20    What then is the effect of [s 3(3)(b) of the RECJA], where it is provided that the\n                            registering court has the same control and jurisdiction over the\n                            registered judgment as it has over its own judgments, “but in so\n                            far only as relates to the execution under this\n                        section”? 21    As pointed out by the learned editors ofHalsbury's Laws of Englandvol 17\n                            (Butterworths, 4th Ed) at para 401, the word\n                            “execution” can mean one of two things. In its wide sense,\n                            it signifies the enforcement of or giving effect to the judgments or\n                            orders of courts of justice. In its narrower sense, it means the\n                            enforcement of those judgments or orders by a public officer under the\n                            various modes of execution provided by rules of court, such as writs offi fa, possession,\n                        delivery. 22    It seems to me that in the context of s 3 of\n                            the Act and the Act as a whole, it is more than likely that the word\n                            “execution” in para (b)\n                            [of s 3(3) of the RECJA] has the wider meaning, rather than the\n                            narrower. Since the Act, or s 3, does not refer to the various\n                            modes of execution of a registered judgment, it is difficult to construe\n                            the words “execution under this section” as meaning\n                            execution in the narrower sense. 23    It appears to me that para (b) [of s 3(3) of the RECJA] can easily be readas merely intending to enact the rule that a\n                                defendant who desires to impeach the original judgment must do so in\n                                the originating court, and not in the registering court.This impression is reinforced by the existence of the provisions in the\n                            previous two subsections of the Act. Firstly, under sub-s (1), the\n                            registering court has to satisfy itself that it is just and convenient\n                            that the judgment should be enforced in Singapore. Secondly, it is\n                            provided that a judgment should not be registered if any of the\n                            circumstances set out in sub-s (2) applies.The\n                                purpose of para (b) of sub-s (3), it seems to me, is that\n                                once a judgment has passed the hurdles set out in sub-ss (1)\n                                and (2), and has been registered, itmust be given effect according to its terms. No proceedings to impeach its validity are to be allowed.\n                                In other words the judgment debtor is not permitted to go behind the\n                                judgment any more. 24    Paragraph (b)\n                            [of s 3(3) of the RECJA]gives the registering\n                                court the same control and jurisdiction over the registered judgment\n                                as if it was a judgment of its own.Without the words “but in so far as relates to the execution\n                                under this section”, it might be open to the judgment debtor\n                                to argue that the registering court has the jurisdiction to\n                                entertain proceedings to impeach the registered judgment, on ground\n                                such as that the original court had made a mistake of fact or of\n                                law. The purpose of adding this qualification in para (b), it\n                                seems to me, is to forestall this possibility, so that once the\n                                judgment has passed the hurdle set out in sub-ss (1) and (2),\n                                it is to be treated as final and conclusive. If the judgment debtor\n                                wishes to challenge it on any ground not set out in those\n                                subsections, he has to go before the originating court, and not the\n                                registering court. In other words, the intention of para (b) of\n                                sub-s (3) is to confer a jurisdiction on the registering court\n                                to carry out the terms of the registered judgment, once it has been\n                                registered, and to entertain all proceedings to that end, but not\n                                proceedings seeking to go back on the\n                        judgment. 25    It follows that when considering the question\n                            whether bankruptcy proceedings may be taken on a registered judgment on\n                            the strength of sub-s (3) [of s 3 of the RECJA], the question to be\n                            asked is not whether such proceedings are a form of\n                            “execution” in the sense, for example, that a writ of\n                            seizure and sale is a form of execution.The relevant\n                                question, rather, is whether they are proceedings properly taken on\n                                the registered judgment as a final and conclusive judgment, as\n                                opposed to proceedings seeking to impeach the existence or validity\n                                of the judgment. 26    For these reasons, I would hold that on a proper\n                            construction of these provisions of the Act a bankruptcy notice can be\n                            founded upon a judgment registered under the Act. [emphasis added in italics, bold italics and underlined bold\n                        italics] 21     With respect, we are of the view that the\n                    judge inCheah Theam Swee, whilst correct in\n                    adopting a broad reading of the word “execution” in\n                        s 3(3)(b) of the RECJA, had stated that\n                    reading rathertoobroadly. Consistent with the\n                    analysis set out above (at [16]–[18]), thepredominant\n                        purposeof the proceedings concerned must be toultimatelyachieve what the more traditional forms of\n                    execution mentioned in O 45 r 1(1)–(2) of the Rules (referred to\n                    above at [14]) would accomplish. This is not, in fact, inconsistent with\n                    Khoo J’s own conclusion (Cheah Theam\n                        Sweeat [24], extracted in the preceding paragraph) to the effect\n                    that s 3(3)(b) of the RECJA was “to\n                    confer a jurisdiction on the registering courtto carry out\n                        the terms of the registered judgment, once it has been\n                    registered,and to entertain all proceedings to that\n                        end, but not proceedings seeking to go back on the\n                    judgment” [emphasis added]. Put simply, the phrase “all\n                    proceedings”must have, as the final objective, the enforcementof the judgment concerned in the so-callednarrowersense. Even allowing for the fact that certain\n                    proceedingsmightinvolveothermatters, it is, in our view, clear that, at the very\n                    least, thepredominant purposeof such proceedings\n                    must be toultimatelygive effect to theenforcementof the judgment in thenarrowersense which is encompassed within the more traditional\n                    modes of execution referred to above. 22     If the less radical approach (from predominant\n                    purpose) set out in the preceding paragraph had been adopted by Khoo J inCheah Theam Swee, thesameresult would have been arrived at by the court, albeit\n                    without the use of the much broader approach which the learned judge utilised in\n                    that case and which stretched unduly (or even, with respect, distorted) the\n                    meaning of “execution”. However, as just alluded to, we agree with\n                    Khoo J to the extent that, given the nature and function of not only the\n                    RECJA but also the Reciprocal Enforcement of Foreign Judgments Act\n                    (Cap 265, 2001 Rev Ed) (“REFJA”) as well as O 67\n                    r 10(2), aslightlybroader reading of\n                    “execution” in the manner just described would be appropriate. The\n                    need for a slightly broader reading is, in fact, buttressed by the reasoning of\n                    Lai Kew Chai J in the Singapore High Court decision ofRe Tan Patrick, ex parte Walter Peak Resorts Ltd (in\n                        receivership)[1994] 2 SLR(R) 379 (“Re Patrick Tan”) where the learned judge had to\n                    consider the same issue (viz, whether a bankruptcy\n                    notice fell within the purview of the word “execution” in\n                    s 3(3) of the RECJA). In this regard, Lai J was of the view that the\n                    use of the more general word “proceedings” in\n                        s 4(2)(b) of the old Reciprocal\n                    Enforcement of Foreign Judgments Act (Cap 265, 1985 Rev Ed) (“the old\n                    REFJA”) (now s 4(4)(b) of the REFJA)\n                    (whichwouldcover a bankruptcy notice) was to be\n                    read with s 4(2)(d) (now s 4(4)(d) of the REFJA) of the same Act, in which the phrase\n                    “so far as only as relates to execution” in s 3(3)(b) ofthe RECJAhad been\n                    omitted. The learned judge arrived, in the circumstances, at the conclusion (at\n                    [14]) that there was nothing in s 4(2) ofthe old\n                        REFJA“which limits the jurisdiction of the courts over\n                    foreign judgments registered under the REFJA to matters relating to\n                    execution”. Lai J then proceeded to observe thus (at [16]): Although structured differently, the relevant provisions of the REFJA and\n                        the RECJA are couched in similar enough terms to make it clear that the two\n                        Actswere meant tocomplementone another.That being so and for the sake of consistency, it is\n                            necessary to bring the two Acts in line with each other. Given that\n                            s 4 of the REFJA cannot be interpreted to exclude the issue of a\n                            notice of bankruptcy from the jurisdiction of the registering court, it\n                            follows that the jurisdiction of the courts under the RECJA ought not to\n                            be restricted to strict matters of execution.For this\n                        reason, I was of the view that we should not follow the cases ofIn re WatsonandIn re A\n                            Bankruptcy Notice... In my view, therefore,\n                            s 3(3)(b) [of the RECJA] ought not to\n                        limit the otherwise general operation of s 3(3)(a) [of the RECJA]. Quite clearly, para (a) contemplates bankruptcy proceedings and if\n                            para (b) is read independently of\n                            para (a), then there is no reason why\n                        it should operate to limit the scope of para (a). [emphasis added in italics and bold italics] Although Lai J utilised the above reasoning in arriving at his\n                    conclusion that a bankruptcy notice fell within the purview of\n                        s 3(3)(b) of the RECJA, we are\n                    respectfully of the view that, whilst such reasoning is helpful in the manner\n                    just outlined, it cannot – in and of itself – constitute the main\n                    (let alone sole) reason for the conclusion just mentioned. 23     Returning to the issue at hand, although aslightly broaderreading of the word\n                    “execution” in s 3(3)(b) of the\n                    RECJA is necessary (albeit not as broad as that suggested by Khoo J inCheah Theam Swee), abalancedapproach is nevertheless imperative and, to this end,\n                    the criterion ought, in our view (and for the reasons set out above), to be that\n                    centring on the predominant purpose of the proceedings concerned. Looked at in\n                    this light, it is clear that an EJD clearly doesnotfall within the ambit of “execution” as thepredominant purposeof such proceedings is the\n                    garnering of additionalinformationwhich might\n                    – or might not – result in the implementation of actualexecutionof the judgment concerned (see also above at\n                    [16]). In the circumstances, therefore, it follows that the word\n                    “execution” doesnotinclude an EJD\n                    for the purposes of O 67 r 10(2). 24     However, in fairness to Khoo J inCheah Theam Swee, to the extent that a\n                    bankruptcy notice doesnotleadimmediatelyto the enforcement of the judgment concerned, it\n                    could be said that regarding a bankruptcy notice as falling within the ambit of\n                    “execution” is a “broader” reading of sorts. That\n                    having been said, as already explained above (at [17]), the situation in which a\n                    bankruptcy notice is issued is stillquite distinct\n                        froman EJD which is(at best) much more\n                        distantly related to “execution” as it is traditionally\n                        conceived. However, this “distant” relationship is\n                    not wholly irrelevant and might yet raise an alternative argument for the actual\n                    approach adopted by Khoo J inCheah Theam\n                        Swee. And it is to a consideration of that possible alternative\n                    argument that our attention must now turn. A more literal interpretation? 25     As alluded to at the outset of these grounds\n                    of decision, there remain (further) problems oflanguagewith regard to the word “execution”.\n                    Notwithstanding the analysis which we have just proffered, we do note that\n                    – from a strict linguistic (or perhaps, more appropriately, literal)\n                    perspective – it might also be (and has been) argued that the word\n                    “execution” might include any step taken pursuant to actual\n                    execution of the judgment concerned. Indeed, the Judge was alive to this\n                    possibility in the court below, but concluded thus (see the GD at\n                    [31]–[32]): 31    It is true that an EJD can only be ordered once\n                            judgment has been obtained by the judgment creditor.In that sense, an EJDis a\n                                steptaken towards the enforcement of a judgment because\n                            it is a post-judgment proceeding that furthers the successful\n                            plaintiff’s interest in obtaining the fruits of his judgment.Yet, the proposition that an EJD is a thing\n                                apart from the typical forms of execution is supported by the\n                                structure of the Rules. Order 45, which deals with the methods\n                                of enforcing judgments, refers to various writs of execution,\n                                garnishee proceedings, the appointment of a receiver and an order of\n                                committal as means by which a judgment can be enforced. In this\n                                regard, the application for an EJD is notably absent from O 45\n                                and is instead found in O 48. 32    On this basis, even if “execution”\n                            should take on the wide meaning, thenunlessit is construed in itsloosestsense to includeany\n                                steptaken towards the enforcement of a judgment, I am of\n                            the view, having regard to the nature of an EJD, that it would still not\n                            fall within “execution” in O 67\n                        r 10(2). [emphasis in italics in original; emphasis added in bold italics and\n                        underlined bold italics] 26     Hence, the Judge arrived at the conclusion\n                    that this (literal) reading ought to be rejected by referring – as has\n                    this court – to the ratherdifferentnature\n                    of an EJD, compared to procedures which, in point of fact, effect actual\n                    execution of the judgment concerned. We would only add that the rejection of\n                    this (literal) reading is buttressed by apurposivereading of O 67 r 10(2) as well. It is, of\n                    course, true that, depending on the precise legislation (or part thereof) in\n                    question, the literal language could wellcoincidewith the purpose of the same.However, where there\n                    is a conflict between the literal language on the one hand and the purpose of\n                    the legislation (or part thereof) on the other, it is clear that the latter must\n                    prevail (and see, for example, s 9A of the Interpretation Act (Cap 1,\n                    2002 Rev Ed); the seminal Singapore High Court decision ofPP\n                        v Low Kok Heng[2007] 4 SLR(R) 183 at [39]–[57]; as\n                    well as the recent decisions of this court inOpenNet Pte\n                        Ltd, especially at [15] andDorsey James\n                        Michaelat [16]–[20]). The purposive interpretation trumps the literal\n                interpretation 27     Turning then to broader considerations which\n                    are consistent with a purposive approach towards O 67 r 10(2), it is\n                    clear, in our view, that the predominant purpose of “execution” in\n                    this rule must (as we have explained above) have, as itsultimateobjective,the execution of the\n                        judgment concerned in its traditional sense. Only then would the purpose of\n                        not only O 67 r 10(2) but also the RECJA and the REFJA be\n                        fulfilled. Any other interpretation would result in a failure of substantive\n                        purpose inasmuch as both the RECJA and the REFJA are intended to give effect\n                        to the foreign judgment concerned and this can only be accomplished by the\n                        Singapore court not (as Khoo J emphasised inCheah Theam\n                        Swee) by re-opening the substantive merits of that\n                        judgment but, rather, by proceedings which will lead to actual execution of\n                        the judgment itself.Indeed, we would add that, even allowing for\n                    the delay incurred by the judgment creditor (the Respondent in the present\n                    appeal) if an EJD is postponed until a setting aside application is finally\n                    determined, there is also the prospect of judicial time and court resources\n                    being wasted if it transpires upon examination that the judgment debtor is a man\n                    of straw. Conversely, if the judgment creditor were permitted to examine the\n                    judgment debtor during the pendency of the setting aside proceedings, it might\n                    elect not to contest those proceedings if it becomes apparent that there are no\n                    worthwhile assets for execution in Singapore. From an institutional perspective,\n                    therefore, it is clear that the early conduct of an EJD would be preferable.\n                    However, it should be noted that there are some loose ends to be tied\n                up. Some loose ends 28     At this juncture, we have some comments on the\n                    Judge’s observation that the Appellant had “used the wrong starting\n                    point” inasmuch as it (the Appellant) ought to have compared O 67\n                    r 10(2) with s 4(5) of the REFJA instead as the former had\n                    “[adopted] the wording” of the latter (see the GD at [21]). The\n                    following (and further) observations by the Judge (at [20]–[22]), which\n                    will figure in the analysis that follows, might also be usefully set out at this\n                    point: 20    [Counsel for the\n                            Appellant] submitted that O 67 must be consistent with and\n                            facilitative of its empowering statute (ie, the RECJA) and therefore the meaning of\n                            “execution” in O 67 r 10(2) must have the same\n                            meaning as “execution” in the RECJA (as interpreted byRe Cheah Theam Swee). For this\n                            submission, he relied on Warren Khoo J’s dicta (at\n                            [22]): Since [RECJA], or s 3 [RECJA], does not refer to the various\n                            modes of execution of a registered judgment, it is difficult to construe\n                            the words ‘execution under this section’ as meaning\n                            execution in the narrower sense. 21    However, [counsel for the Appellant’s]\n                            argument appears to have used the wrong starting point. Even if his\n                            argument is accepted in principle, given that O 67 r 10 adopts\n                            the wording of s 4(5) of the REFJA (see [19] above), the analysis\n                            should perhaps have started with the meaning of\n                            “execution” in the REFJA and not the RECJA. 22    It seems clear fromPatrick\n                                Tanthat s 4(4) of the REFJA, like s 3(3) of\n                            the RECJA, deals with thescopeof the\n                            Singapore court’s jurisdiction over a foreign judgment, as opposed\n                            to purely procedural matters, which is what s 4(5) of the RECJA\n                            (and correspondingly, O 67 r 10) deals with. It is therefore\n                            not necessarily the case that “execution’ should bear the\n                            same meaning in s 4(5) of the REFJA and in O 67\n                            r 10. 29     The Judge was of the view that the meaning of\n                    the word “execution” should have been analysed by reference tothe REFJA instead of the RECJA(see the GD at\n                    [20]). Adopting such an approach, he was of the further view (citingRe Patrick Tan) that s 4(5) of the REFJA (and,\n                    correspondingly, O 67 r 10(2)) dealt with “purely procedural\n                    matters” (see the GD at [22]) – whereas s 3(3) of the RECJA\n                    (which was, it will be recalled, interpreted inCheah Theam\n                        Swee) and s 4(4) of the REFJA dealt with “thescopeof the Singapore court’s\n                    jurisdiction over a foreign judgment” [emphasis in original] (seeibid). The Judge then reasoned that, because\n                    of the distinction just mentioned, the word “execution” in\n                    s 4(5) of the REFJA (and, correspondingly, in O 67 r 10(2)) would\n                    not necessarily bear the same meaning as that in s 3(3) of the RECJA\n                    (which, it will be recalled, was given abroadreading by Khoo J inCheah Theam\n                    Swee). 30     He then proceeded (see the GD at [24]) to\n                    demonstrate that whilst s 4(4)(d) referred to\n                    “execution”, s 4(4)(b) of the\n                    REFJA referred to “proceedings” and that inRe\n                        Patrick Tan, Lai J had (as noted above at [22]) held that\n                    the word “proceedings” in what is now s 4(4)(b) of the REFJA “encompasses bankruptcy\n                    proceedings”. The Judge then proceeded to observe as follows (seeibid): 24    … Clearly, such an interpretation of\n                            “proceedings” is broad enough to cover an EJD as well. The\n                            question then is this: in the light of the broad construction of\n                            “proceedings” in s 4(4) of the REFJA, was it still\n                            necessary to construe the word “execution” in s 4(4)\n                            of the REFJA widely in order to demarcate the boundaries of the court's\n                            jurisdiction in relation to foreign judgments registered under the\n                            REFJA? It would seem, therefore, that unlike the case of\n                                s 3(3)(b) of the RECJA, nothing\n                            in the plain language of s 4(2) of the REFJA requires\n                            “execution” to have a wide meaning in order to give effect\n                            to the legislative intention of the REFJA. 31     We would respectfully note that there is no\n                    reason in principle why, even in s 4(4) of the REFJA, the word\n                    “execution” should not be construed in a somewhat broader sense\n                    (as explained above at [21]–[23]). 32     We also note the following observations by the\n                    Judge in the court below (see the GD at [25]): 25    One must also have sufficient regard for the\n                            context in which “execution” is used in O 67\n                            r 10 (and correspondingly in s 4(4) of the REFJA),ie, the words “execution ... shall not\n                            issue”. On a plain and natural reading of the provision, the word\n                            “issue” in relation to “execution” is likely\n                            to be shorthand for the issuing of a writ of execution or such other\n                            enforcement procedures which have similar consequences for the judgment\n                            debtor as a writ of execution. If so, this lends itself to the narrow\n                            construction of “execution” and an EJD (the nature of\n                            which is discussed below) would not fall within this narrow\n                            meaning. 33     With respect, the observations set out in the\n                    preceding paragraph – to a large extent –assume what precisely needs to be proved. In our\n                    view, that proof finds its source in ascertaining (as we have above at\n                    [21]–[23])the precise nature and function of\n                        “execution” which, as we have sought to demonstrate, admits of\n                        only one clear approach and which therefore excludes an EJD in the context\n                        of, inter alia, O 67 r 10(2). It is also significant that the\n                        Judge, again in the observations set out in the preceding paragraph, refers\n                        (in the final sentence) to the nature of an EJD, which is the central topic\n                        of the next part of his judgment and which centres precisely around the\n                        nature and function of “execution” itself.Put\n                    simply, both sets of observations by the Judge (quoted above at [28] and [32])\n                    are, with great respect, unpersuasive and disregarding them does not detract\n                    – in any way – from the Judge’s own analysis and (more\n                    importantly) conclusion to the effect that the word “execution”\n                    doesnotinclude an EJD for the purposes of\n                    O 67 r 10(2) (see the GD at [26]–[32]). Indeed, we are in total\n                    agreement with the Judge to the extent that he relies, in the main at least, on\n                    the nature and function of “execution” as explored in its\n                    legislative context (seeibid) as it is consistent\n                    with our own analysis above (at [21]–[23]). No prejudice to the judgment debtor 34     The (more general) issue remains as to whether\n                    undue prejudice to the judgment debtor (here, the Appellant) would ensue if the\n                    approach set out above is adopted. This issue is not an unimportant one since it\n                    brings into focus the question offairnessto the\n                    judgment debtor as the Judge’s conclusion on Issue 1 has been\n                    affirmed. In our view, there would be no such prejudice because the judgment\n                    debtor would always be free to apply to the court fora\n                        stayof the EJD. Conclusion 35     It is clear, therefore, that, based on logic\n                    and principle as well as a purposive approach, the word\n                    “execution” (as demonstrated in our analysis of Issue 1) doesnotinclude an EJD for the purposes of\n                    O 67 r 10(2), and we therefore found in favour of the Respondent in so\n                    far as Issue 1 was concerned.",
        "Issue 2": "36     As in the court below, in the light of our\n                    decision on Issue 1 above, it was unnecessary to decide Issue 2. This\n                    was particularly the case because the Appellant had – correctly, in our\n                    view – focused on Issue 1. It also seems to us that a definitive\n                    ruling with regard to this particular issue would be more appropriate in a later\n                    case, although we would observe that the Judge’s reasoning and conclusion\n                    on this issue (see the GD at [33]–[44]) seem to us to be quite\n                    persuasive.",
        "Conclusion": "37     For the reasons set out above, we dismissed\n                    the appeal with costs of $25,000 (including disbursements) to be awarded to the\n                    Respondent, and the usual consequential orders."
    }
}