{
    "case_title": "Liten Logistics Services Pte Ltd\n      v\n      ORG Powell Packaging Pte Ltd and another appeal",
    "ncitation": "[2013] SGCA 42",
    "coram": "Sundaresh Menon CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       This was an unusual appeal (against the decision of the High Court judge (“the Judge”) inORG Powell Packaging Pte Ltd v Liten Logistics Services Pte Ltd[2012] SGHC 219 (“the GD”)). This was not merely a false start but a race that ought not to have taken place to begin with, at least in so far as one of the appeals before this court was concerned. But the parties nevertheless continued to run it with gusto. They continued running right up to the hearing of the present appeal. Eventually, they had to be called back to the start line. 2       The parties had run ahead of themselves because they had joined issue on legal questions that ought not to have been raised until a threshold legal issue had first been resolved. In their enthusiasm to put forward their respective cases, they had missed this threshold issue. The case concerned an attempted sale and purchase of an interest in land but the land was compulsorily acquired by the government before the sale could be completed. Perhaps the parties could not be faulted because, as we shall see, the compulsory acquisition of the land concerned lent itself to the suggestion that the contract that they had entered into might,inter alia, have been frustrated. But this missed the threshold question: had a proprietary interest in the properties concerned changed hands between the parties to begin with? If not, then all the legal issues canvassed by the parties in the court below were ultimately irrelevant. Put simply, if no proprietary interest had changed hands to begin with, that would be the end of the matter. Fortunately, this was a pure question of contractual construction in the context of a tenancy and could be resolved by this court at this hearing by construing the relevant provision in accordance with established legal principles. Indeed, the relevant application was, in any event, by way of an Originating Summons so no evidence was required to be called in the court below. 3       This was, indeed, a simple matter. In the circumstances, the parties needed no extra time and could address us forthwith on this particular threshold issue. After hearing submissions from counsel, it was clear to us that no proprietary interest had changed hands between the parties in the first place. We therefore allowed the appeal of Liten Logistics Pte Ltd (“the Vendor”) in Civil Appeal No 44 of 2012 (“CA 44”). 4       However, there was a remaining issue which constituted the nub of the appeal of ORG Powell Packaging Pte Ltd (“the Purchaser”) in Civil Appeal No 45 of 2012 (“CA 45”) and which (we should add) was (unlike CA 44) correctly canvassed in the court below. The relevant contract comprised the tenancy and purported sale of two of the Vendor’s properties. Only one had been compulsorily acquired. Could the Purchaser nevertheless insist on the sale of the other property if its arguments in respect of the former property failed (as we had, in fact, held)? After hearing submissions from counsel, it was clear to us that the sale was an integrated one for both properties and we therefore dismissed the appeal in CA 45. 5       We now give the detailed grounds for our decision.",
        "The factual background": "6       These appeals concern the ownership of the subleases of two industrial properties,viz, No 36 Tuas West Road, Singapore 638384 (“No 36”) and No 6 Tuas Avenue 20, Singapore 638820 (“No 6”), respectively. These will be collectively referred to as “the Properties”. 7       On 8 August 2008, the Vendor purchased the Properties from a company named Akebono-Okaya (S) Pte Ltd and became the sub-lessee of the JTC Corporation (“JTC”). Under the terms of the sublease agreements with JTC, the Vendor could not deal with its interest in the Properties in any way within three years of the date the agreements were entered into, save that it could sublet the Properties with JTC’s consent. This prohibition was relaxed after that period, with the Vendor being able to dispose of the Properties provided it had JTC’s consent. The agreements provided for the forfeiture of the subleases should the clauses be breached. 8       In May 2010, the Purchaser commenced negotiations with the Vendor for the purchase of the Properties. This led to the execution of an agreement known as the Preliminary Agreement on 12 June 2010. The Preliminary Agreement stated that the Properties were to be sold on 1 August 2011 with sale prices of $6,250,000 and $4,100,000 for No 36 and No 6, respectively. It was entered into in advance of the intended transaction because of the aforementioned prohibition (referred to above at [7]). In the meantime, the Purchaser would lease No 36 at a monthly rent of $65,000 from 1 August 2010 to 31 July 2011, with the sale price of No 36 being reduced by a proportion of the gross monthly rent (referred to as the “net rent”) paid over the year-long lease. The Preliminary Agreement contemplated the subsequent signing of a formal agreement. 9       On 22 September 2010, the parties executed a tenancy agreement in respect of No 36 (“the Tenancy Agreement”) at a monthly rent of $65,000 for a term commencing seven days after JTC’s approval of the lease was obtained and concluding on 31 August 2011. On 28 February 2011, JTC granted retrospective approval for the lease between the parties from 1 August 2010 to 31 August 2011. 10     Clause 2(a) of the Tenancy Agreement provided for a security deposit of $130,000 (“the security deposit”), the equivalent of two months’ rent. Clause 4(l) provided for an option to purchase No 36 together with No 6 (“the Option”) which was annexed to the Tenancy Agreement. The option period was from 15 August 2011 to 29 August 2011 and the security deposit was to be treated as the option money. The Option provided that an agreement for the sale and purchase of the Properties would arise upon its exercise (“the Agreement”). Unlike the Preliminary Agreement, the Option did not specify individual prices for each of the Properties. Instead, clause 2 of the Option stated a global sum of $10,350,000, excluding GST. Like the Preliminary Agreement, clause 3 of the Option provided that the full purchase price would be reduced by the security deposit and the net rent. 11     On 11 January 2011, before the Option became open for exercise, a notice of compulsory acquisition was served for No 36 (“the Acquisition Notice”). Generally, a contract for the sale of land may be discharged due to frustration if the property concerned is subject to compulsory acquisition by the Government (see, for example, the decision of this court inLim Kim Som v Sheriffa Taibah bte Abdul Rahman[1994] 1 SLR(R) 233 (“Lim Kim Som”)). However, clause 22(b) of the Option apparently made provision for such an eventuality in that it gave the Purchaser the right to rescind the Agreement on notice of the Government’s intention to acquire the whole or part of the Properties. As noted at the outset, it was over the question of frustration that the parties joined issue. 12     On 23 February 2011, the Purchaser’s counsel gave notice that the Purchaser would not be exercising its right to rescind and would be exercising the Option. The Vendor’s counsel replied on 1 April 2011 and took the position that, because the Option was only open for acceptance between 15 August 2011 and 29 August 2011, the Acquisition Notice had “frustrated the agreement for an option to purchase under clause 4(l)(i) of the Tenancy Agreement”. The Purchaser’s counsel replied, in turn, and expressed the view that the Acquisition Notice had frustrated neither the Option nor the Tenancy Agreement and, at the same time, reiterated their clients’ intention to proceed with the purchase of the Properties. 13     Correspondence between the parties ceased temporarily after this exchange of letters and they continued to satisfy their respective obligations under the Tenancy Agreement. On 3 August 2011, the Vendor wrote to the Purchaser asking that the necessary steps be taken to vacate No 36. On 15 August 2011, the Purchaser’s counsel purported to exercise the Option. The Vendor’s counsel replied the next day, repeating the position that the Option had been frustrated and rejecting the attempted exercise of the Option. 14     In accordance with its position that the contract had not been frustrated, the Purchaser wrote to the Vendor’s counsel on 19 August 2011 and asked that the Vendor proceed with the application for JTC’s approval of the sale of No 6. However, the Purchaser made no mention of No 36. Clause 10(a)(i) of the Option provided that the sale and purchase of the Properties was subject to the Purchaser obtaining JTC’s approval. Under clause 10(h), either party could rescind the Agreement should such approval not be obtained by 30 November 2011 for reasons beyond the control of the parties. 15     The Vendor (now without counsel as an intermediary) replied on 26 August 2011, enclosing an application form to be completed by the Purchaser and returned to the Vendor for submission to JTC. The Vendor stated that it was forwarding the application form without prejudice to its position regarding frustration. 16     Before the Purchaser returned the completed application form, the Vendor attempted to return the balance of the security deposit to the Purchaser, thereby indicating the end of the Tenancy Agreement. As mentioned above at [10], the security deposit was to serve as the option money and part payment for the Properties. Hence, the Vendor was acting on the basis that the transaction would not be proceeded with. Predictably, this was rejected by the Purchaser. 17     On 21 October 2011, a Collector’s Award of $11,548,950 for the compulsory acquisition of No 36 was announced. This comprised compensation of $1,980,000 to JTC, $9,300,000 to the Vendor, and $268,950 to the Purchaser. The last-mentioned figure corresponds to the amount spent by the Purchaser in renovating No 36 at the commencement of the tenancy. 18     The Purchaser completed and returned the application form for No 6 (but not No 36) to the Vendor on 27 October 2011. The Vendor replied that the application form had been completed incorrectly. Among other things, the Vendor took issue with the Purchaser’s description of the selling price of No 6 as $4,100,000. 19     The Purchaser provided a revised application form to the Vendor on 15 November 2011. It maintained that the purchase price of No 6 was $4,100,000. Once again, no mention was made of No 36. The Vendor did not submit the revised application form to JTC. On 27 January 2012, the Vendor’s newly-appointed counsel purported to rescind the Agreement on the basis of clause 10(h) of the Option. This was without prejudice to the Vendor’s position that there had been no valid acceptance of the Option. 20     It should be noted that the Purchaser had acted on the basis that the sale and purchase of the Properties had not been discharged. It also appeared to have assumed that JTC’s approval was only required for No 6. In an affidavit filed on behalf of the Purchaser, an assertion was made that, with the Acquisition Notice, “JTC no longer has any locus-standi to process and grant such approval”.",
        "The Originating Summons and the decision below": "21     Being unable to resolve the matter, the Purchaser filed Originating Summons No 1032 of 2011 (“OS 1032”) on 30 November 2011 seeking various declarations. 22     Prayer 2 of OS 1032 sought a declaration that the Acquisition Notice did not have the effect of frustrating the Option. Prayer 3 sought a related declaration that the Purchaser’s purported exercise of the Option on 15 August 2011 was valid and binding on the Vendor because the Option had not been discharged. The Judge granted an order in terms of Prayers 2 and 3, distinguishing the case ofLim Kim Somon the basis that the Option had, through clause 22(b) (see above at [11]), made provision for the compulsory acquisition of the Properties. Consequently, the Option could not, in his view, be frustrated by such an event. 23     Prayer 4 of OS 1032 related to No 6, as follows: (a)     Prayer 4(i) sought a declaration that the purchase price of No 6 was $4,100,000. (b)     Prayer 4(ii) sought a declaration that the net rent paid from August 2010 to August 2011 totalling $635,533.47 and the security deposit of $130,000 under the Tenancy Agreement be applied towards the $4,100,000 purchase price of No 6. (c)     Prayer 4(iii) sought a declaration that the balance amount payable upon completion of the purchase of No 6 was $3,334,466.53. (d)     Prayer 4(iv) sought an order that the Vendor submit the application for approval to JTC and execute a proper conveyance of No 6 to the Purchaser. 24     Prayer 5 of OS 1032 concerned No 36, as follows: (a)     Prayer 5(i) sought a declaration that the purchase price of No 36 was $6,250,000. (b)     Prayer 5(ii) sought a declaration that the Purchaser held the beneficial interest in the award of $9,300,000 made to the Vendor by the Collector of Land Revenue. (c)     Prayer 5(iii) sought a declaration that the Plaintiff was entitled to be paid the difference between the Vendor’s award and the purchase price of $6,250,000 (ie, a sum of $3,050,000). (d)     Prayer 5(iv) sought a declaration that the Purchaser was entitled to be paid the sum of $3,050,000 directly out of the Vendor’s award. 25     In substance, Prayers 4 and 5 together embody the assertion that the Option contained two separate agreements, one for the purchase of No 36 at $6,250,000 and another for the purchase of No 6 at $4,100,000. The Judge, however, rejected this assertion and declined to grant these prayers. He noted that, while the Preliminary Agreement did consider the two properties separately, it called for the preparation of a formal agreement following legal advice. The Option that was eventually drawn up only stipulated one purchase price of $10,350,000 without ascribing an individual value to each property, and with nothing in its language to suggest that the purchase of the Properties could be severed. Further, the Option contained an entire agreement clause. 26     In addition, the Judge found that the Vendor’s solicitor’s letter of 27 January 2012 did not rescind the Option as the Vendor had not done all that was within its power to obtain the requisite approvals. The Judge also found that the Purchaser had done all that was within its power to obtain the approvals but made no reference to the Purchaser’s failure to provide the Vendor with the approval forms for No 36. 27     In effect, the Judge prevented the Purchaser’s attempt to short-circuit the conveyancing process but left it open for it to obtain its remedies under the terms of the Option. 28     It is appropriate to note at this juncture that the contract that was in question in so far as the issue of frustration is concerned was not, strictly speaking, the same contract as that which was said to have been rescinded. Prayer 2 of OS 1032 sought a declaration that the Acquisition Notice did not have the effect of frustrating the Option,ie, the contract provided for under clause 4(l)(i) which was annexed to the Tenancy Agreement. In contrast (and as noted at [14] above), clause 10(h) granted the right to rescind with specific reference to the Agreement,ie, the sale and purchase agreement that comes into being once the Option is exercised. Clause 10(h) therefore presupposes that the Option had not been discharged by frustration prior to being exercised. It is noted that the Judge held that the Vendor’s solicitor’s letter of 27 January 2012 did not rescind theOption(see above at [26]). However, in light of the express wording of clause 10(h), it is only theAgreement, and not the Option, that can be said to have been rescinded.",
        "The parties’ cases on appeal": "29     In CA 44, the Vendor appealed against the Judge’s decision to grant an order in terms of Prayers 2 and 3 of OS 1032 as well as the declaration that it had not validly rescinded the Agreement. The Purchaser in turn appealed in CA 45 against the Judge’s decision to make no order in respect of Prayers 4 and 5 of OS 1032 as well as the declaration that the Purchaser was not entitled to sever performance of the sale and purchase of No 36 and No 6. 30     The parties’ cases on appeal proceeded along the same lines as in the court below. Their arguments focused on: (1) whether the Option was frustrated by the Acquisition Notice; (2) whether the Vendor had validly rescinded the Agreement with its letter of 27 January 2012; (3) whether the Properties could only be purchased together or if there were in fact separate contracts for the sale of No 36 and No 6; and (4) whether JTC’s approval was still necessary in light of the Acquisition Notice.",
        "Our decision": "",
        "CA 44": "31     As noted above, the parties’ arguments assumed what was in fact the central and threshold issue in this case,ie, whether the Purchaser had acquired, pursuant to the Preliminary Agreement, any proprietary right to the Properties in the first place. If the answer is in the negative, Prayers 4 and 5 of OS 1032 could not be granted and the issue of frustration would become moot. 32     The present appeal is similar to that inChi Liung Holdings Sdn Bhd v Attorney-General[1994] 2 SLR(R) 314 (“Chi Liung Holdings”). The decision of this court in that case is instructive. InChi Liung Holdings, a foreign company (the appellant in this particular case) had given written undertakings not to sell or dispose of two parcels of land without obtaining the consent of the Controller of Housing (“the Controller”). These undertakings (secured by bank guarantee) were given in order to obtain qualifying certificates pursuant to s 31 of the Residential Property Act (Cap 274, 1985 Rev Ed). Subsequently, the appellant wrote to the Controller to seek his consent to the intended sale of the properties. In the meantime, the appellant granted two options to an intended purchaser for the purchase of the properties. Both options were exercised before the Controller’s consent was obtained and the Controller later found out that the land was sold in breach of the undertakings. The Controller forfeited the appellant’s money which had been secured by the aforementioned bank guarantee. 33     This court held that the Controller was wrong to forfeit the appellant’s money as no sale had taken place at the material time. The intended purchaser was a foreign company and also required qualifying certificates in order to hold the properties. As such, the options expressly provided that the sale and purchase was conditional upon the purchaser obtaining such certificates. This court observed that until this condition was fulfilled, the essential and main obligations of the parties (ie, the obligation of the appellant to sell and the obligation of the purchaser to purchase) remained inchoate and specific performance of the contract was not available to the purchaser (seeChi Liung Holdingsat [30] and [33]). Since beneficial ownership of a property was premised on the availability of specific performance, the purchaser could not be deemed the equitable or beneficial owner of the property as at the date of the contract. 34     Similarly, clause 10(a)(i) of the Option in the present appeal expressly provided that the sale and purchase of the Properties was subject to the Purchaser obtaining JTC’s approval. Applying the reasoning inChi Liung Holdingsto the present appeal, specific performance was not available to the Purchaser and, consequently, the Purchaser had not obtained a proprietary right in the Properties. 35     The Purchaser submitted that clause 10(a)(i), properly construed, did not require JTC’s approval to be obtained in cases such as the present since JTC would no longer have anything at stake in the disposition of the Properties. We were unable to accept this submission. Clause 10(a)(i) is clear and unqualified. Further, when read in light of the constraints placed on the Vendor by its sublease with JTC (see above at [7]), it was clear that the clause was intended to enable the Vendor to comply with its obligations under the subleases. While the argument could be made that, as between the Vendor and JTC, the subleases do not require JTC’s approval to be obtained in the event of a compulsory acquisition, it is by no means certain that such an argument would succeed. If the Purchaser’s proposed interpretation was correct, the Vendor would have to complete a sale even if doing so could potentially place it in breach of the subleases. It could not, in our view, have been the intention of the parties to impose on the Vendor the risk of litigation in the event that JTC did not have the same benign interpretation of the relevant terms of the subleases. Nor could it have been the Purchaser’s intention to risk forfeiture of the Properties. 36     Further, the Purchaser’s submission was factually unsustainable. In a letter dated 9 May 2012, JTC had informed the parties that it would not consider any application for the proposed assignment of No 36 as it had been gazetted for acquisition. It is thus clear that JTC did not take the position that its approval was no longer necessary. On the contrary, it had represented that it wouldnotgive its approval because of the very fact which the Purchaser sought to use (see above at [35]) as a basis to argue that such approval was unnecessary. 37     For completeness, it should be noted that it was irrelevant which party was at fault in failing to obtain JTC’s approval. While the issue of who was at fault did have a bearing on whether a party had the right to rescind the Agreement pursuant to clause 10(h) of the Option, this did not affect the issue as to whether or not clause 10(a)(i) was satisfied. 38     In the circumstances, there was no need for us to consider the issues canvassed by the parties in the court below in relation to the doctrine of frustration. Indeed, the operation of the doctrine in the context of contracts for the sale of land is an interesting one (see, for example, the decision of this court inLim Kim Somas well as the comprehensive article by Michael Hwang, “Does Compulsory Acquisition Frustrate A Contract for the Sale of Immovable Property?Lim Kim SomRevisited” [2000] SJLS 379), as is the need to draft force majeure clauses precisely (see also generally the decisions of this court inRDC Concrete Pte Ltd v Sato Kogyo (S) Pte Ltd and Another Appeal[2007] 4 SLR(R) 413 at [46]–[81] andHolcim (Singapore) Pte Ltd v Precise Development Pte Ltd and another application[2011] 2 SLR 106 as well as the useful (and practical) essay by Prof Michael Furmston, “Drafting of Force Majeure Clauses – Some General Guidelines” in ch 4 of Ewan McKendrick,Force Majeure and Frustration of Contract(Lloyd’s of London Press Ltd, 2nd Ed, 1995)). But all this must necessarily await another suitable occasion when the relevant issues arise directly for decision by the court.",
        "CA 45": "39     It follows from the discussion above that the issue as to whether the sale of No 6 could nevertheless be proceeded with despite the compulsory acquisition of No 36 was rendered moot as the Purchaser did not have a proprietary interest in No 6 as well. However, in deference to counsel’s submissions, we will state briefly our views on this issue. 40     In the GD, the Judge noted (at [19]) that “[n]othing in the language of the Option suggested that the purchase of the Properties could be severed”. Indeed, there is much that suggests theoppositeconclusion. The Option defines No 36 and No 6 together as “the Property”, this singular form indicating that only one transaction was envisaged. That only a single global price of $10,350,000 was stipulated (see above at [10]) buttresses this conclusion. Similarly, the Option fails to apportion the option money between each property, leaving it unclear which part of the option money should be forfeited if only one of the properties were purchased. If there were two options, one would expect that the option money of $130,000 would be divided between each property. 41     Turning to the Tenancy Agreement, clause 4(l)(i) states as follows: (i)    Subject to sub-clause (iii) hereinafter contained, the Landlord shall grant to the Tenant an Option to Purchase the Demised Premisestogether withthe Property at No. 6 Tuas Avenue 20 ... upon the terms and conditions of the Option to Purchase annexed hereto in Schedule 1 ... [emphasis added] 42     The words “together with” do not admit the understanding that the Purchaser could buy one property or the other or both. Rather, these words suggest that the Properties were to be sold as a package. This is supported by clauses 4(l)(ii) and (iii), which state as follows: (ii)  In the event that the Tenantexercises the Option, the Tenant shall pay the Landlord the further sum of [$65,000] to be held as the security deposit ... (iii)  In the event that the Tenantdoes not exercise the Optionwithin the period specified the Landlord shall be entitled to forfeit the Security Deposit ... herein deemed to be the option moneys ... [emphasis added] 43     It appears from these clauses that the choices open to the Purchaser were binary: it could either exercise the option, in which case it must purchase both No 36 and No 6; or it may choose not to, in which case the option money will be forfeited. The terms of the Tenancy Agreement do not provide for the choice to purchase only one of the properties. 44     The Purchaser attempted to rely on the Preliminary Agreement to support its interpretation of the Tenancy Agreement and the Option, observing that it stipulated separate prices of $6,250,000 and $4,100,000, and that the sum of these figures is the same as the global purchase price in the Option. However, it is reasonable for the parties to attempt to value each property individually in order to arrive at the ultimate purchase price. This cannot, without more, indicate that two separate transactions were envisaged. Further, the Preliminary Agreement made repeated mention of the need for a formal agreement. This suggests that a cautious approach should be taken in construing the parties’ intentions with the Preliminary Agreement as the relevant context. Such caution is also indicated by the entire agreement clause in the Option (ie, clause 26).",
        "Conclusion": "45     For the reasons set out above, we were of the view that the declarations sought by the Purchaser could not be granted. Consequently, CA 44 was allowed and CA 45 was dismissed. In the somewhat unusual circumstances of this case as noted at the outset of these grounds of decision, no order was made as to costs both here and below."
    }
}