{
    "case_title": "Public Prosecutor\n      v\n      Goldring Timothy Nicholas and others",
    "ncitation": "[2013] SGCA 59",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      Woo Bih Li J",
    "sections": {
        "Introduction": "1       This is a Criminal Reference by the Public Prosecutor (hereinafter “the Prosecution” when used to identify the applicant in the present proceedings) of six questions of law for determination by this court pursuant to s 397 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (hereinafter referred to as the “CPC” or “CPC 2012” to distinguish from other versions of the same Act). These questions arise from the decision of the judge (“the Judge”) inGoldring Timothy Nicholas and others v Public Prosecutor[2013] 3 SLR 487 (“the GD”).",
        "The background facts": "2       The Respondents were the directors of Profitable Plots Pte Ltd (“the Company”). On 11 August 2010, pursuant to an order under s 58 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“CPC 1985”), officers from the Commercial Affairs Department (“the CAD”) searched the Company’s premises and seized documents, laptops and data storage items belonging to the Company. The Respondents estimate that about 197,240 individual documents were seized (“the Seized Documents”). The CAD concurrently issued receipts containing brief details of the Seized Documents. The Respondents were not given the opportunity to make copies of the Seized Documents before they were seized. 3       On several occasions after the seizure, the Respondents requested for copies of specific documents from the CAD, and the CAD consistently acceded to such requests. The Respondents’ last successful request was made on 21 February 2012. In the midst of this period, the Criminal Procedure Code 2010 (Act 15 of 2010) (“CPC 2010”) was passed on 19 May 2010 and came into force on 2 January 2011. The CPC 2010 was an Act to repeal and re-enact with amendments the CPC 1985. In particular, the CPC 2010 introduced the new statutory criminal case disclosure (“CCD”) regime which is in issue in the present Criminal Reference. 4       On 27 March 2012, the Respondents were charged with 86 counts each of abetment by conspiracy to cheat (“the Charges”). The Charges primarily involved allegations that the Respondents had knowingly made untrue representations that money invested in the Company’s investment scheme would be used exclusively to finance the purchase of certain bonds which had purportedly been “pre-sold” to major corporations. On 13 April 2012, the 1st Respondent wrote to the CAD to request for copies of some of the Seized Documents (“the Schedule A Documents”). This request was rejected on 18 April 2012 on the basis that “the documents will be disclosed in due course as part of the Prosecution’s disclosure obligations under the [CCD] regime”. On 20 April 2012, the first CCD conference was held. On 29 May 2012, the Case for the Prosecution was served on the Respondents. On 1, 15 and 25 June 2012, the Respondents again made requests for copies of the Schedule A Documents. On 26 June 2012, the Prosecution rejected the Respondents’ requests stating that the Respondents had no legal basis to have those documents. 5       On 17 July 2012, at a subsequent CCD conference, the Respondents made an application to the Senior District Judge (“the SDJ”) for an order that the Prosecution provide them with copies of the Schedule A Documents. The SDJ dismissed this application on 6 August 2012. 6       On 13 August 2012, the Respondents filed Criminal Motion No 73 of 2012 (“CM 73”) seeking,inter alia, orders that: (a)     the SDJ’s order be set aside; and (b)     the Prosecution produce copies of documents listed in the enclosed schedules (“the Materials”) prior to the Respondents filing their Case for the Defence. The Materials were estimated to consist of 5,750 individual documents and could be broadly classified into the following categories: (a)     records of the accounts of the Company’s clients; (b)     copies of the Company’s marketing material; and (c)     personnel files relating to the Company’s employees. 7       On 31 August 2012, the CPC 2012, which was a revised edition of the CPC 2010, came into operation. 8       In the course of the hearings before the Judge, the Respondents withdrew CM 73 and filed Criminal Revision No 17 of 2012 (“CR 17”) (which was substantively the same as CM 73) after the Prosecution pointed out and the Respondents accepted that a Criminal Revision was the appropriate procedure.",
        "The decision in the court below": "9       The Judge allowed the Respondents’ application in CR 17 and gave full written grounds in the GD. 10     As a preliminary point, the Judge first drew a distinction between: (a)     Documents over which an accused person had ownership or legal custody or a legal right to control immediately before the lawful seizure (“Category 1 Documents”); (b)     Statements made by an accused person to third parties (“Category 2 Documents”); and (c)     Documents belonging to third parties which do not fall under Category 1 or 2 Documents (“Category 3 Documents”). It was undisputed that the Materials are Category 1 Documents. 11     With these distinctions in mind, the Judge first held that there was a common law right of access to Category 1 Documents, subject only to reasonable concerns that allowing access would or would be likely to prejudice the proper administration of justice. Next, the Judge found that the CCD regime in the CPC did not affect this right. On the facts of this case, the Judge was of the view that there was no cogent evidence that the public interest in the due administration of criminal justice would be harmed if the Respondents were allowed access to the Materials. The Judge further held that even if there was no such right of access vested in the Respondents, the document-intensive nature of the pending criminal proceedings was such that the justice of the case required the Materials to be made available to the Respondents pursuant to s 6 of the CPC.",
        "The questions referred": "12     The Prosecution referred six questions (“the Questions”) for determination by this court pursuant to s 397 of the CPC. They are as follows: Question 1:    Where documents have been seized by the police in the lawful exercise of their investigative powers, whether at common law, a person’s ownership or legal custody of or legal right to control the documents so seized gives that person a right to access (or to make copies of) the documents while they are in the possession of the police and before investigation or prosecution of the criminal matter has been concluded. Question 2:    Whether the answer to Question 1 would be the same if the person making the request for the access (or for copies) has been arrested for a criminal offence, and the documents were seized as part of investigations into the offence. Question 3:    Whether the answer to Question 1 would be the same if the person making the request for access (or for copies) has been charged with a criminal offence and the documents were seized as part of investigations into the offence charged. Question 4:    If the answer to Question 1 is positive, whether a criminal motion is the appropriate procedure to be adopted by a person seeking to enforce his right of access to, or to make copies of, the documents seized, if the police decline to permit such access or copying. Question 5:    If the answer to Question 1 is positive, and if the [CCD] provisions in the [CPC] apply to the person making the request for access to (or for copies of) the documents, then in cases where the documents are listed as exhibits in the Case for the Prosecution, whether the right of access to (or for copies of) the documents is subject to the CCD disclosure provisions. Question 6:    Whether in situations where the CCD regime for criminal cases applies, and where the documents seized from the accused person fall within the purview of the CCD regime, the courts are precluded from invoking s 6 of the CPC to create new procedures to allow accused persons access to, or copies of, the seized documents.",
        "The main issues arising": "13     In our view, in order to answer the Questions, it would be important to first deal with the main issues which arise from the Questions themselves. Indeed, the Prosecution itself adopted a similar approach in its written submissions.[note: 1]We are of the view that the three main issues arising from the Questions are as follows: (a)     whether there is any common law right permitting a person access to Category 1 Documents and to make copies thereof and, if so, whether there are any limits to this (“Issue 1”); (b)     whether, if the common law right referred to in (a) above exists, such a right is compatible with the CPC and, in particular, with the CCD regime set out therein (“Issue 2”); and (c)     whether, if the common law right referred to in (a) above does not in fact exist, a right to access ought nevertheless to be recognised pursuant to s 6 of the CPC (“Issue 3”). 14     We will deal with each of these issuesseriatimbefore proceeding to answer the Questions. However, before doing so, we need to deal with a preliminary objection raised by the Respondents.",
        "A preliminary objection by the Respondents": "15     In the Respondents’ written submissions, they mounted a preliminary procedural challenge to the present Criminal Reference filed by the Prosecution. To provide the context of the Respondents’ arguments, it would be useful to first set out ss 397(1) and (2) of the CPC: Reference to Court of Appeal of criminal matter determined by High Court in exercise of its appellate or revisionary jurisdiction 397.—(1) When a criminal matter has been determined by the High Court in the exercise of its appellate or revisionary jurisdiction, and a party to the proceedings wishes to refer any question of law of public interest which has arisen in the matter and the determination of which by the Judge has affected the case, that party may apply to the Court of Appeal for leave to refer the question to the Court of Appeal. (2) The Public Prosecutor may refer any question of law of public interest without the leave of the Court of Appeal. 16     The first plank of the Respondents’ challenge is that s 397(2) of the CPC does not have the same deeming effect as its precursor provision in s 60(5) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“the SCJA 2007”) (now repealed). The relevant sub-sections of s 60 of the SCJA 2007 are reproduced below: Reference to Court of Appeal of criminal matter determined by High Court in exercise of its appellate or revisionary jurisdiction 60.—(1) When a criminal matter has been determined by the High Court in the exercise of its appellate or revisionary jurisdiction, the Judge may on the application of any party, and shall on the application of the Public Prosecutor,reservefor the decision of the Court of Appeal any question of law of public interest which has arisen in the matter and the determination of which by the Judge has affected the case. ... (5)    For the purposes of this section,any question of law which the Public Prosecutor applies to be reserved or regarding which there is a conflict of judicial authority shall be deemed to be a question of public interest. [emphasis added] The Respondents argued that in the circumstances, the Prosecution still needs to prove all four elements that would ordinarily have to be proved for leave to be granted to refer a question of law of public interest pursuant to s 397(1) of the CPC. These four elements are that: (a) the question is a question of law; (b) the question of law is a question of law of public interest; (c) the question arose from the decision of the High Court in the exercise of its appellate or revisionary jurisdiction; and (d) the determination of the question by the High Court had affected the outcome of the case. The second plank of the Respondents’ challenge is that these elements are not made out in the present case. 17     In our view, the difference in the wording between s 397(2) of the CPC and s 60(5) of the SCJA 2007 doesnotsupport the Respondents’ case. To provide a full explanation it would be necessary to traverse the history of these two provisions. 18     The precursor to s 60 of the SCJA 2007 was s 60 of the Supreme Court of Judicature Act (Cap 322, 1985 Rev Ed) (“the SCJA 1985”). The relevant sub-sections of s 60 of the SCJA 1985 are reproduced below: Reference to the Court of Criminal Appeal on appeal from subordinate court. 60.—(1) When an appeal from a decision of a subordinate court in a criminal matter has been determined by the High Court, the Judge may on the application of any party andshallon the application of the Public Prosecutor reserve for the decision of the Court of Criminal Appeal any question of law of public interest which has arisen in the course of the appeal and the determination of which by the Judge has affected the event of the appeal. … (5)    For the purposes of this section but without prejudice to the generality of its provisions — (a)    any question of law regarding which there is a conflict of judicial authority shall be deemed to be a question of public interest; and (b)    the reservation of a question of law for the consideration of the High Court under the provisions of any written law relating to criminal procedure or the exercise by the High Court of any power of revision under any such written law shall be deemed to be an appeal from a decision of a subordinate court in a criminal matter. [emphasis added in italics and in bold italics] 19     The scope of s 60 of the SCJA 1985 was considered by the Singapore High Court inPublic Prosecutor v Bridges Christopher[1997] 1 SLR(R) 681 (“Bridges (HC)”). The court held that it was only when a question brought by the Public Prosecutor fell within the four corners of s 60 that the High Court was bound to refer the question to the Court of Appeal (seeBridges (HC)at [11]). The word “shall” in s 60(1) of the SCJA 1985 did not remove the court’s duty to determine whether a question of law which was sought to be reserved for the decision of the Court of Appeal was one of public interest (seeBridges (HC)at [15]–[16]). In particular, the court made the following observations (Bridges (HC)at [15]): 15    An application may have been made to state a question of law because it is thought that it is in the public interest that a principle of law arising from the case be correctly and authoritatively decided. On the other hand, an application may have been made because it is thought that it is in the public interest that justice is done in the individual case and that a disguised appeal should be launched.Unless there is an express provision otherwise in s 60 of the SCJA, the court should not abdicate the duty of sieving the former from the latter to the office of the Public Prosecutor. Had it been the Legislature’s intention that any question of law, no matter how trivial or settled, is presumed or deemed to be a question of law of public interest merely because it is stated by the Public Prosecutor, there would be nothing simpler than for it to state this expressly.[emphasis added] The High Court’s determination of this issue inBridges (HC)was in turn approved by the Court of Appeal inPublic Prosecutor v Bridges Christopher[1997] 3 SLR(R) 467 (“Bridges (CA)”) (seeBridges (CA)at [19]–[24]). 20     Subsequently, s 60 of the SCJA 1985 was amended to state that any question of law referred by the Public Prosecutor was deemed to be a question of public interest (“the 1998 amendments”). During the second reading of the Supreme Court of Judicature (Amendment) Bill (No 40/98), the then Minister for Law Prof S Jayakumar (“Prof Jayakumar”) explained as follows (Singapore Parliamentary Debates, Official Report(26 November 1998) vol 69 at col 1630 (“26 November 1998 Parliamentary Debates”)): … Reasons for deeming a question of law referred by Public Prosecutor to Court of Appeal arising from criminal appeal determined by High Court to be a question of public interest. Let me now deal with the second amendment which is to amend section 60 to deem any question of law referred by the Attorney-General to the Court of Appeal (CA) arising from any criminal matter determined by the High Court to be a question of public interest. Presently, under section 60, when an appeal from a decision of a Subordinate Court in a criminal matter has been determined by the High Court, the Judge may, on the application of any party and shall, on the application of the Public Prosecutor, reserve for the question of the Court of Appeal any question of law of public interest which has arisen in the course of the appeal. However, the existing provision in relation to the Public Prosecutor is unsatisfactory because the issue of whether a question of law is one of public interest is determined exclusively by the High Court. The result therefore is that the Public Prosecutor may be prevented from seeking a conclusive ruling from the Court of Appeal on questions which the Public Prosecutor considers to be of public interest. If the Members of the House are aware, under the Constitution, the Attorney-General, who is also the Public Prosecutor, is charged with the responsibility for the conduct of all criminal prosecutions and for advising the Government on legal matters. In order to properly discharge his constitutional duties, the Attorney-General feels, and the Government agrees with him, that he should be given the freedom to pose questions which he considers to be of public interest for a conclusive ruling by the Court of Appeal. [emphasis in original] 21     It is also relevant to note that Parliament clearly intended these amendments to bridge the legislative gap identified inBridges (HC)andBridges (CA)in the Prosecution’s favour. In response to questions from the House, Prof Jayakumar stated as follows (see the26 November 1998 Parliamentary Debatesat cols 1660–1661): … It may be useful for me to explain to this House why is it that the Attorney-General’s conclusion that the question he is posing or is applying to refer a matter of public interest must be taken to be a public interest. And the best I can do is to reproduce part of the judgement of the Court of Appeal in the Public Prosecutor v Bridges Christopher case (1998). In that case, the argument was made by the Attorney-General. But the court found that his submissions were “compelling” but felt that the existing provision was not appropriately worded. This is what the Attorney-General argued, and this is summarised by the Court in its judgement and I think it succinctly puts forward the rationale for this amendment to section 60. I quote: “The Public Prosecutor is responsible for and represents the State in all criminal prosecutions. He is also the Chief Legal Adviser to the Government on what the law is. He has a duty to enforce what he believes to be the right law which no one has. Therefore if he does not agree with the law as pronounced by the High Court, he should be entitled to go to the Court of Appeal for a final ruling. Accordingly, the Public Prosecutor submitted in the case that any Public Prosecutor’s questions which satisfy the three conditions would invariably be one of public interest based on the need to have a final ruling for future cases. He further submitted that a determination by the Court of Appeal advances the public interest in reinforcing the finality principle in the following ways: (a) the Public Prosecutor is thereafter able to decide on prosecutions in accordance with the Court of Appeal's decision; (b) the Public Prosecutor is able to advise the Government on whether or not it is desirable to change the law; and (c) where the Court of Appeal upholds the Public Prosecutor's case, all convictions and acquittals founded on that principle of law are likely to end at the Subordinate Courts.” Sir, since the Court of Appeal’s judgement is that the Attorney-General’s submissions were compelling, the Government has agreed to give effect to it. … 22     In other words, the 1998 amendments were specifically intended to deem that any question of law referred by the Public Prosecutor was a question of law of public interest. The Supreme Court of Judicature (Amendment) Act 1998 (No 43 of 1998) was subsequently passed and came into force, thereby repealing s 60 of the SCJA 1985 and enacting what eventually became s 60 of the SCJA 2007 (reproduced above at [16]). The aforementioned intention of Parliament was also reflected in the express wording of s 60(5) of the SCJA 2007. As the requirement of a question of law of public interest encompassed two of the four criteria for leave to be granted, that meant that the Prosecution still needed to prove the remaining elements in s 60(1) of the SCJA 2007 (ie, that there was a question of law which had arisen from the decision of the High Court in the exercise of its appellate or revisionary jurisdiction and the determination of which by the judge had affected the case). 23     InBachoo Mohan Singh v Public Prosecutor and other applications[2010] 1 SLR 966 (“Bachoo Mohan Singh”) at [50], this court confirmed that, following the 1998 amendments, the Public Prosecutor’s determination that a question of public interest has arisen can no longer be queried by the High Court when deciding whether or not to grant leave for that question to be referred to the Court of Appeal. 24     We now come to the amendment of s 60 of the SCJA 2007 (reproduced above at [16]) to its present form in s 397 of the CPC (reproduced above at [15]). We note that most of the substantive amendments to the law (viz, the CPC) were discussed in Parliament when the Criminal Procedure Code Bill (No 11/2010) was read, but nothing was said about s 397 (seeSingapore Parliamentary Debates, Official Report(18 May 2010) vol 87 (“18 May 2010 Parliamentary Debates”) at cols 407–464 andSingapore Parliamentary Debates, Official Report(19 May 2010) vol 87 at cols 540–576). An argument that could thus be made is that save for the fact that the leave application is now to be determined by the Court of Appeal and not by the High Court (which is not disputed by the parties), Parliament did not have the intention of changing the law as it stood in the SCJA 2007 (see above at [22]). If that is the case, then under the CPC, the Public Prosecutor still needs to satisfy this court that the question of law (which is statutorily deemed to be one of public interest) had also arisen from the decision of the High Court in the exercise of its appellate or revisionary jurisdiction and that its determination by the judge has affected the case, so as to obtain the leave of this court. Alternatively, an even higher argument could also be made that the Public Prosecutor needs to fulfilall four limbsto obtain leave of court under the CPC given: (a) the wording of s 397(1) (reproduced above at [15]), in particular, the reference to “a party to the proceedings” instead of simply “an accused person” or “the Public Prosecutor”; (b) the title of s 397 which states “Reference to Court of Appeal of criminal matterdetermined by the High Court in exercise of its appellate or revisionary jurisdiction” [emphasis added]; and (c) the absence of a deeming provision similar to s 60(5) of the SCJA 2007 (reproduced at [16] above). In fact, this second argument was the position taken by the Respondents, although point (a) mentioned in the preceding sentence was not raised by them. 25     However, in our view, the two possible interpretations in the preceding paragraphcannotbe what Parliament had intended. Theexpresslanguage of s 397(2) of the CPC is crystal clear – “The Public Prosecutor may refer any question of law of public interest without the leave of the Court of Appeal”. To interpret s 397 as being the same as s 60 of the SCJA 2007 and to hold that the Public Prosecutor needs to also satisfy this court that the other (or all) requirements for leave are made out would fly in the very face of theexpresslanguage of s 397(2) and is thus impermissible. Therefore, notwithstanding the factors mentioned in the preceding paragraph, given the clear andexpresslanguage of s 397(2), we find that Parliament had in effect widened the scope of the Public Prosecutor’s ability to refer questions to this court. Put simply, under the CPC, the Public Prosecutor can refer any question that it wishes to refer to the Court of Appeal without having to obtain leave to do so. 26     We hasten to clarify this doesnotmean that the Court of Appeal is invariablyboundto answer all questions referred to it by the Public Prosecutor. In our view s 397(2) of the CPC statutorily permits the Public Prosecutor to leapfrog theleavestage. This, however, does not affect the Court of Appeal’s exercise of its jurisdiction at thesubstantivestage. When exercising itssubstantivejurisdiction under s 397, the Court of Appeal will naturally consider whether the case before it falls truly within the scope of that particular provision. This, in turn, entails considering whether all the requirements in s 397(1) are made out. Thus, for example, inPhang Wah v Public Prosecutor and another matter[2012] SGCA 60, where the application for a criminal reference was brought by the accused person under s 60 of the SCJA 2007, this court decided that no question of law of public interest had in fact arisen in the case although the judge below granted leave to refer the questions concerned to this court. We nevertheless answered the questions put before us, but this was only out of deference to the efforts of counsel. 27     We note, parenthetically, that our comments in the preceding paragraph might, at first blush, appear to render s 397(2) of the CPC somewhat toothless. But this is not in fact the case in the final analysis. Pursuant to s 397(2), the Public Prosecutor is given the procedural advantage of being able to leapfrog the leave stage (presumably for the policy reasons referred to above at [20]–[21]). In this regard, we would emphasise a point already made: that there are, in fact, actually two distinct stages under s 397,viz, the leave stage and the substantive stage, the former being a procedural sieve for the latter. We recognise that some confusion might potentially arise because, under the CPC, the Court of Appeal now presides overboththe leave stage and the substantive stage, resulting in a less distinct line between the two stages compared to when the leave stage was heard by the High Court under the SCJA regime. 28     In short, even though the Public Prosecutor can technically bring a free-standing abstract question of law of public interest to the Court of Appeal by leapfrogging the leave stage, this does not mean that the Court of Appeal is bound to answer it. Unless and until Parliament clearly evinces the intention to change our regime to mirror that in the United Kingdom where the Attorney-General can refer questions of law for determination delinked from the underlying case through the procedure known as the Attorney-General’s Reference (see s 36 of the Criminal Justice Act 2003 (c 71) (UK)), we trust that parties will refrain from bringing such applications before this court. 29     In the present case, we find that the Questions meet the requirements under s 397(1) of the CPC. Whilst Questions 2, 3 and 4 (reproduced above at [12]) did notexplicitlyarise as distinct issues in the proceedings below, they are all inextricably linked to the main issues decided by the Judge. In our view, the Respondents’ objection to the Questions was far too technical. We therefore dismiss the Respondents’ preliminary procedural objection. We now turn to address the first of the three main substantive issues identified in [13] above,viz, whether there is any common law right permitting a person access to Category 1 Documents and to make copies thereof and, if so, whether there are any limits to such a right.",
        "Issue 1": "",
        "Is there a common law right of access?": "30     Put simply, the Prosecution argues that such a common law right never existed in the first place. Not surprisingly, the Respondents adopted a diametrically opposite view. The Judge found in favour of the Respondents, holding that there was such a right. Arguments from precedent and legal principle 31     It would be an understatement to observe that the Prosecution has mounted a root and branch attack against any argument that purports to support a common law right. Indeed, in the present proceedings, the Prosecution argues vigorously that the principal authority relied upon by the Judge in the court below, the English Court of Appeal decision ofArias & Others v Commissioner for the Metropolitan Police & Another(1984) 128 SJ 784,The Times, 1 August 1984 (“Arias”), didnotsupport the existence of a common law right. Although this particular argument was raised by the Prosecution as a second submission in this particular regard, we think it is more appropriate to consider it first. 32     The Prosecution first seeks to distinguishAriasfrom the present situation. In its written submissions, the Prosecution argues that the appellants inAriaswere actually third parties to a criminal proceeding because in its view, it did not appear that the appellants concerned had been charged, and it was not clear whether they (the said appellants) were ever under investigation.[note: 2]It is further argued by the Prosecution that the application inAriaswas not made in the context of a criminal proceeding (since they were not parties to any prosecution) and was not based on any criminal procedural rules.[note: 3] 33     With respect, we do not see the relevance of the arguments proffered by the Prosecution set out in the preceding paragraph. Indeed, it is clear from a close reading of the judgment of May LJ inAriasthat, although the appellants concerned had not been charged, they were clearly under investigation with regard to possiblecriminaloffences. As the learned Lord Justice observed: … What the officer swore in that affidavit was: “I fear that if they” – that is, the documents or copies – “are disclosedat this stage of the investigationthere is a real danger of my investigations being hampered; and such disclosure would afford an opportunityfor any person at present under suspicion, to attempt to fabricate a defence.” That claim was, as I say, further detailed in the second affidavit sworn by the detective constable. The relevant paragraph is paragraph 4, and I think it necessary to read the paragraph in full: “The essential information which is contained in the trading documents” -- that is one category of those (or copies) whose production is required -- “is the date and reference number of the transaction and the price struck.If this information were to be made available to the suspects at this stage of the investigation, it would enable them, if so minded, to attempt to cover their tracks by the production of other documents based on the information contained in the documents which I hold.If charges are preferred the production of such documents, requiring the access to actual or potential witness, would be more difficult to achieve, and easier to detect. The information contained in the correspondence in category (iii)” -- that is the other remaining category of documents in issue … -- “contains detailed information regarding the suspects’ real and purported transactions andif the suspects had access to the information contained in that correspondence at this stage, I again fear that they would then be in a position to attempt to cover their tracks and thus hamper the completion of the investigation. The same considerations apply to the last category of documents as they contain information which is likely to be material evidence if charges are preferred against Mr Collin” … [emphasis added in bold italics] 34     And, lest it be argued by the Prosecution that the police officer inAriaswas referring to a pool of suspects at large (whichexcludedthe appellants in that case), the following observation by Kerr LJ should make it clear that the principles laid down inAriaswere intended to apply to owners of Category 1 Documents who were under suspicion and being investigated by the police: … There may well be cases in which the public interest of investigating crime and bringing criminals to trial and conviction would go so far as tojustify withholding from suspects, who are the owners of documents in the possession of the police, even copies of them until a prosecution is either brought or it is decided not to prosecute them or some other person. Some such instances were canvassed in argument and can be imagined … But the court must be satisfied that in all the circumstances of each case the balance between the public interest and the rights of the plaintiff requires the drastic decision which is sought in the present case, to refuse to the appellant even copies of the documentary evidence in the possession of the police. No case to which we were referred has gone so far, although for my part such cases cannot be ruled out in principle. … [emphasis added in bold italics] 35     Even if we ignore the speculation inherent in the arguments by the Prosecution and assume, for the sake of argument, that the request made by the appellants inAriasfor access to their own documents for the purpose of taking copies of the same at their own expense was made in the context ofcivilproceedings instead, we would have thought that the argument in favour of access will be ana fortiorione in the context ofcriminalproceedings simply because liberty (and possibly even life) is at stake. 36     Next, the Prosecution argues that the relevant observations by the court inAriaswhich appeared to suggest that such a right existed were not central to the actual decision in the case itself because the parties concerned in that case hadnot disputedthe existence of the right (or, put simply, had assumed that it existed in the first place). In this regard, the Prosecution cites the following passage from the judgment of Kerr LJ inArias: In this case both parties are one in saying that the defendants, the police, have all the documents involved in this investigation. They areagreedthat they belong to the appellant –or, at any rate, that he is entitled,subject to the question of public interest, to possession of them. The issue is solely as to the information contained in those documents, since the appellant only seeks access to them for the purpose of taking copies at his own expense. The issue is therefore whether this is to be denied to the appellanton the ground of the public interest. … [emphasis added in italics and bold italics] In the circumstances, the Prosecution submits that the main issue before the court inAriaswas whether or notthe public interest considerationsjustified the non-disclosure of the documents concerned on the part of the police. 37     Even if we were to accept the argument that the existence of the common law right of access was not in issue before the court inArias, this would merely render the views of the judges inArias obiter dicta. However, we do not think that this was the case. The arguments centring on the public interest (and the issue of their viability) are, in our view, fundamentally (and inextricably) connected to their roots,viz, the existence of the common law right. Indeed, it seems to us that the parties inAriasdid not dispute the existence of that right and proceeded straight to the argument as to thescopeof that right because its existence was (as the judges inAriasobserved) so obvious and self-evident to begin with. Indeed, this was precisely Kerr LJ’s view when he observed as follows: … In these circumstances, I agree that there is nothing like enough to tilt the balance against the appellant by a refusal of therelatively self-evident rightwhich he claims, and to accord to the police the unusually draconian power which they seek. … [emphasis added in bold italics] 38     This could also explain the approach adopted by the English High Court in another case which pre-datedArias,viz,Frank Truman Export Ltd and Others v Metropolitan Police Commissioner[1977] 1 QB 952 (“Frank Truman Export”), where Swanwick J made the following observation atthe very end ofhis judgment, as follows (at 966): … In the present case, although I hold that the police are entitled to retain the documents, I think it would beonly fair and rightthat theyshould take immediate steps to supply Mr. Wood with copies, if he desires it, and, if necessary, with photocopies of them, and to allow inspection of those alleged to be forgeries.[emphasis added in italics and bold italics] Although this was stated at the end of his judgment, the learned judge did not, in our view, append this observation as a mere afterthought. It is worded in a clear and unambiguous fashion and (more importantly) conveys the impression of self-evidence which finds its foundation in the very basic ideas of due process and fair play. Hence, the fact that there is no further elaboration by the judge of this view is not in the least surprising. The basic ideas of due process and fair play are, in fact, part of thelarger canvassoflegal principlewhich ought, in the final analysis, to be the litmus test for the existence of a right of access to one’s own documents (as opposed to the more specific and, with respect, technical and legalistic arguments which were canvassed before this court). We hasten to add that this is not to state that specific legal arguments are irrelevant. They are an integral part of the process of common law reasoning. However, they are not ends in themselves but are merely aids to the understanding of the foundational legal principles which have as their ultimate aim the attainment of justice and fairness in the case at hand. 39     In this regard, it is apposite to set out the following observations made in the Singapore High Court decision ofUnited Overseas Bank Ltd v Ng Huat Foundations Pte Ltd[2005] 2 SLR(R) 425 (“Ng Huat Foundations”) (at [4]–[9]): 4    It is axiomatic that every party ought to have its day in court. This is the very embodiment ofproceduraljustice. The appellation “procedural” is important. Procedural justice is just one aspect of the holistic ideal and concept of justice itself. In the final analysis, the achievement of a substantively just result or decision is the desideratum. It is more than that, however. It is not merely an ideal. It must be a practical outcome – at least as far as the court can aid in its attainment. 5    However, the court must be extremely wary of falling into the flawed approach to the effect that “the ends justify the means”. This ought never to be the case. The obsession with achieving a substantively fair and just outcome does not justify the utilisation of any and every means to achieve that objective. There must be fairness in theprocedure or mannerin which the final outcome is achieved. 6    Indeed, if the procedure is unjust, that will itself taint the outcome. 7    On the other hand, a just and fair procedure doesnot, in and of itself, ensure a just outcome. In other words, procedural fairness is a necessary but not sufficient condition for a fair and just result. 8    The quest for justice, therefore, entails a continuous need to balance the procedural with the substantive. More than that, it is a continuous attempt to ensure that both areintegrated, as far as that is humanly possible. Bothinteractwith each other. One cannot survive without the other. There must, therefore, be - as far as is possible - a fair and just procedure that leads to a fair and just result. This is not merely abstract theorising. It is thevery basisof what the courts do - and ought to do. When in doubt, the courts would do well to keep these bedrock principles in mind. This is especially significant because, in many ways, this is how, I believe, laypersons perceive the administration of justice to be. The legitimacy of the law in their eyes must never be compromised. On the contrary, it should, as far as is possible, be enhanced. 9    It is true, however, that in the sphere of practical reality, there is often atensionbetween the need for procedural justice on the one hand and substantive justice on the other. The task of the court is to attempt, as I have pointed out in the preceding paragraph, toresolvethis tension. There is afurthertask: it is to actually attempt, simultaneously, tointegratethese two conceptions of justice in order that justice in its fullest orb may shine forth. [emphasis in original] 40     Although the observations inNg Huat Foundationswere made in the context of civil proceedings, they would, in our view, applyequally, if not more forcefully, tocriminal proceedings. Indeed, to state thatproceduraljustice in the form ofdue processis an essential (even critical) requirement of every set of criminal proceedings is to state the obvious. This does not – as the observations quoted in the preceding paragraph clearly emphasise – necessarily ensure that there will be a just and fairoutcome(which is the tangible hallmark ofsubstantivejustice). However, as those very observations also emphasise,without procedural justice or due process, it will be impossible to achieve any substantively just and fair result at all. To reiterate, “if the procedure is unjust, that will itself taint the outcome” (seeNg Huat Foundationsat [6], quoted above at [39]). 41     With these legal principles in mind, the key question in the present case is this: Would the recognition of the common law right be consistent with – or even buttress – the accused’s right to due process in general and a fair trial in particular? We are of the view that the answer to this question must surely be in the affirmative – provided that certain limits are set to ensure that this right is not abused, lest the trial in fact becomesunfairinasmuch as it affords the accused an illegitimate advantage in the forensic process. We pause to note, at this juncture, that there are indeed limits to the common law right which were also acknowledged by the Judge in the court below and which we will be dealing with in more detail below (at [61]–[71]). Returning to the question posed, we agree entirely with the following observations by the Judge in the court below (see the GD at [74]–[75]) which, whilst made in the context of s 6 of the CPC, areequally(if not more) applicable to the present issue, not least because, in our view, there is a more than substantial overlap (and perhaps even a coincidence) between the common law and s 6 (see the discussion below at [84]–[86]): 74    In my view, allowing access by an accused person to Category 1 Documents isentirely consistent with notions of a fair trial. It would be inimical to one’s sense of justice to prevent any right of access, whether supervised or not, to an accused person of documents he had previouslyownedor to which he had a legal right topossessorcontrolbefore they were seized from him by law enforcement authorities, if there was no reasonable likelihood of a threat to the countervailing public interest of upholding the administration of criminal justice. Giving an accused person access to Category 1 Documents would,inter alia,allow him to better prepare his case, with the benefit of material which he would have had access to but for the seizure and in sufficient time, so that he may better put forward his defence against the charges preferred against him at the trial.Bearing in mind the fundamental point that it was Category 1 Documents (and not Category 2 Documents or Category 3 Documents)which were in issue, it was only by allowing such access thatbasic principles of due process could be adequately observed. 75    The crux of the Application before me was not one of giving an advantage to the Defence to the detriment of the Prosecution but rather one of striking a fair balance between the Defence and the Prosecutionby upholding basic principles of fair playwhile, as I have explained …, remaining within the legitimate margin of appreciation left by Parliament to the courts. If the Prosecution reasonably believes that, on the facts of any given case, the grant of access to Category 1 Documents would be contrary to the public interest, it may always justify its position by reference to cogent evidence ... It would then be for the courts to decide, in disputed cases, whether access should be granted at all or on terms. [emphasis in italics in original; emphasis added in bold italics and bold underlined italics] 42     We should also point out that there are other concerns centring on due process which the Judge also considered in the GD – particularly in the practical sphere. We will return to this point below (at [67]–[69]). 43     In any event (and returning to the more specific arguments), even assuming for the moment that the views inAriaswereobiter dicta(which we think is an incorrect assumption (see also above at [37])), the contents of the observations themselves are clear and unambiguous and we are minded to agree with and, indeed, endorse them. In this regard, it bears setting out,in extenso, the relevant observations by both May and Kerr LJJ inArias, especially since they are not readily available in the more common reports (which observations were also reproduced by the Judge in the court below (see the GD at [22])). 44     Turning, first, to the judgment of May LJ inArias, the learned Lord Justice observed as follows: … [I]n all these cases what the court has to do is to conduct the appropriate balancing exercise. I would not wish it to be thought that in every case something more than the mere statement of belief on reasonable grounds on the part of the relevant police officer … is required. Each of these cases, in which this conflict of public interests arises, has to be decided upon its own facts having regard to all the circumstances of the case as they then appear to the court. Doing thebalancing exercisein the present case …I am driven to the conclusion that the fact thatthese documents are the appellants’ own documents, and that they are only asking for copies of them to enable the trust business to be carried on,even if they may wish to prepare their defence to any criminal prosecution which may hereafter be instituted, leads to the balance coming down clearly in favour of the appellants.It is, I agree, a strong thing to say not merely that these officers are entitled to retain the original documents which are potentially exhibits in subsequent criminal proceedings, but also to contend that, at any rate for a substantial period, the owners of those documents shall not even be entitled to look at them or take copies of them. ... [emphasis added in italics and bold italics] 45     And Kerr LJ observed as follows: In this case both parties are at one in saying that the defendants, the police, have all the documents involved in this investigation. They are agreed that they belong to the appellant -- or, at any rate, that he is entitled, subject to the question of public interest, to possession of them. The issue is solely as to the information contained in those documents, since the appellant only seeks access to them for the purpose of taking copies at his own expense. The issue is therefore whether this is to be denied to the appellant on the ground of the public interest. There may well be cases in which the public interest of investigating crime and bringing criminals to trial and conviction would go so far as to justify withholding from suspects, who are the owners of documents in the possession of the police, even copies of them until a prosecution is either brought or it is decided not to prosecute them or some other person.Some such instances were canvassed in argument and can be imagined. For instance, to give only one obvious kind of illustration, if the documents contain information which would facilitate further crime or alleged crime, or the location, codes or numbers of deposit boxes or other hiding places where incriminating evidence or stolen property might be secreted, it would obviously be against the public interest to make this information available even to the owner of the documents by giving him unrestricted access to them.But the court must be satisfied that in all the circumstances of each case the balance between the public interest and the rights of the plaintiff requires the drastic decision which is sought in the present case, to refuse to the appellant even copies of the documentary evidence in the possession of the police. No case to which we were referred has gone so far, although for my part such cases cannot be ruled out in principle. The question is therefore how this balance stands in the present case. I ask myself: what is to be placed in the scale against the appellant’s right to have the same information as the police; the information contained in his own documents which the police hold? In the ultimate analysis, only one factor is placed on behalf of the police against the appellant’s claim. That is the fear that if the appellant had copies of his own documents ... he might use the information contained in these documents to fabricate other evidence, in association with others, which would or might destroy or neutralise the incriminating nature ... of the evidence which [the police] have. I draw attention to three passages in the affidavit evidence of the defendants. ... First, in paragraph 6 of the affidavit which was before [the first instance judge], it is said: “I fear that if they are disclosed at this stage of the investigation there is a real danger of my investigations being hampered; and such disclosure would afford an opportunity for any person at present under suspicion, to attempt to fabricate a defence.” Then two passages in paragraph 4 of the further affidavit placed before us which Lord Justice May has already read, but which I repeat to emphasise their speculative nature: “If this information were to be made available to the suspects at this stage of the investigation, it would enable them, if so minded, to attempt to cover their tracks by the production of other documents based on the information contained in the documents which I hold.” Finally: “I again fear that they would then be in a position to attempt to cover their tracks and thus hamper the completion of the investigation.” All this is no more than speculation and suspicion, and I think there is force in Mr Purnell’s submission that similar fears could be expressed in almost any case where the police are in sole possession of documents which they regard as incriminating.I appreciate -- and wish to make this clear -- that there may well be extreme cases where the circumstances are such that the police cannot reveal their full reasons for wishing to refuse an owner access to his own documents, because the revelation of their reasons would itself destroy the public interest which they are seeking to uphold or, to use the phrase of Lord Justice May, would in effect “give the game away”.So there may be cases where the reasons themselves cannot be fully revealed. But there is no indication that this is such a case, although we gave Mr Hyam a full opportunity of going further, if he could, than the passages to which I have already referred. It is merely a case of fear based on speculation, that evidence might be fabricated with nothing to support it other than the passages which I have already read, and nothing to support it in the learned judge’s judgment other than the two paragraphs which Lord Justice May has already read. In these circumstances, I agree that there is nothing like enough to tilt the balance against the appellant by a refusal of the relatively self-evident right which he claims, and to accord to the police the unusually draconian power which they seek. … [emphasis added in italics and bold italics] 46     In addition to the common law right of access being self-evident, we would further venture to observe that there is another possible reason why this fundamental right was scarcely articulated in case law. In our view, this could be due to the existence of yetanothercommon law right,viz, the common law right to thereturnof original items lawfully seized if a photograph or copy would suffice. This was laid down by Lord Denning MR in the English Court of Appeal decision ofGhani and others v Jones[1970] 1 QB 693 (at 708–709): … Balancing these interests, I should have thought that, in order to justify the taking of an article, when no man has been arrested or charged, these requisites must be satisfied: … Fourth: The police must not keep the article, nor prevent its removal, for any longer than is reasonably necessary to complete their investigations or preserve it for evidence.If a copy will suffice, it should be made and the original returned.As soon as the case is over, or it is decided not to go on with it, the article should be returned. [emphasis added in bold italics] Put simply, under the common law, if a photograph or a copy of an original item sufficed for the purposes for which it was seized, then the owner was entitled to its return. If, however, a photograph or copy of an original item would not suffice, then the owner could rely on his or her common law right of access to make copies of the original item. Therefore, if the owner of a seized item is able to successfully rely on his common law right to the return of that item, then the question of access would not even arise. We should also mention for completeness that in the UK,afterthe common law right of access was put on a statutory footing in the UK Police and Criminal Evidence Act 1984 (c 60) (“the 1984 UK Act”) (a point which we will address in more detail below at [48]–[59]), there would have been no need (for obvious reasons) for parties to rely on the common law right of access. 47     For these reasons, we are of the view that there ought to be and is a common law right of access and, in the circumstances, the Judge was correct in deciding (in a related vein) that “the lawful seizure and retention of property by law enforcement authorities merely suspends the right to possession or control of the said property during the material period” [original emphasis in italics omitted] (see the GD at [24]). However, this right is not an absolute one and is subject to the balancing process which we will discuss in more detail below (at [61]–[71]). Before proceeding to discuss this process, we must deal with another (related) argument proffered by the Prosecution. Arguments from statute 48     As just noted, the Prosecution has another string to its legal bow in so far as the existence of the common law right of access is concerned. Indeed, it was actually stated as the first point in its written submissions although, as already mentioned above (at [31]), it seems to us more appropriate to discuss the arguments from precedent (in particular, the legal status ofArias) first. 49     The argument by the Prosecution in this particular regard is deceptively simple and rather attractive at first blush. It is that s 21 of the 1984 UK Act was a completely new statutory provision which filled a gap in the legal landscape where there had never been any legal right (here at common law) in the first place. Section 21 of the 1984 UK Act (“s 21”) reads as follows: Access and copying 21.    (1)A constable who seizes anything in the exercise of a power conferred by any enactment, including an enactment contained in an Act passed after this Act, shall, if so requested by a person showing himself— (a)    to be the occupier of premises on which it was seized;or (b)to have had custody or control of it immediately before the seizure, provide that person with a record of what he seized. (2)The officer shall provide the record within a reasonable time from the making of the request for it. (3)Subject to subsection (8) below, if a request for per­mission to be granted access to anything which— (a)    has been seized by a constable; and (b)    is retained by the police for the purpose of investigating an offence, is made to the officer in charge of the investigation by a person who had custody or control of the thing immediately before it was so seized or by someone acting on behalf of such a person, the officershall allow the person who made the request access to it under the supervision of a constable. (4)Subject to subsection (8) below, if a request for a photograph or copy of any such thing is made to the officer in charge of the investigation by a person who had custody or control of the thing immediately before it was so seized, or by someone acting on behalf of such a person, the officer shall— (a)allow the person who made the request access to it under the supervision of a constable for the purpose of photographing or copying it; or (b)photograph or copy it, or cause it to be photographed or copied. (5)    A constable may also photograph or copy, or have photographed or copied, anything which he has power to seized, without a request being made under subsection (4) above. (6)    Where anything is photographed or copied under subsection (4)(b) above, the photograph or copy shall be supplied to the person who made the request. (7)    The photograph or copy shall be so supplied within a reasonable time from the making of the request. (8)There is no duty under this section to grant access to, or to supply a photograph or copy of, anything if the officer in charge of the investigation for the purposes of which it was seized has reasonable grounds for believing that to do so would prejudice— (a)that investigation; (b)the investigation of an offence other than the offence for the purposes of investigating which the thing was seized; or (c)any criminal proceedings which may brought as a result of— (i)the investigation of which he is in charge; or (ii)any such investigation as is mentioned in paragraph (b) above. [emphasis added in bold italics] 50     In order to make good this argument, the Prosecution prays in aid two extracts from the UK Parliamentary Debates in the House of Lords on the Police and Criminal Evidence Bill (“the 1984 UK Bill”) as it passed through the House. The first was from the speech by Lord Anthony Gifford (“Lord Gifford”) delivered on 5 July 1984 (inParliamentary Debates (Hansard) – House of Lords(5 July 1984) vol 454 at cols 435-436); in particular, it was observed as follows (at col 435): I should like to raise a short point on Clause 20 [of the 1984 UK Bill, which eventually became s 21 of the 1984 UK Act (reproduced above at [49])]. It is a valuable clause because it providescertain rightsto those whose documents have been taken,which they did not have previously– that is to say, it provides access to them and enables them to be photo-copied or photographed. However, in sub-section (6) [of Clause 20 of the 1984 UK Bill, which eventually became sub-section (8) of s 21 of the 1984 UK Act (reproduced above at [49])] the rights which have been given, as happens in other parts of the Bill, are in danger of being taken away or rendered virtually useless by a very general provision that there is no duty to grant the rights if there are: “grounds for believing that to do so would prejudice the investigation”. I recognise that in some cases it would not be right to give someone access to a document. The most obvious cases, for example, would be where a document was an official secret or where there were other documents of that kind. [emphasis added in italics and bold italics] 51     We should, first and foremost, sound a word of caution that some care must always be taken when relying on Parliamentary debates (see also the further discussion on the importance of context at [57]–[58] below). In the context of this case, it is firstly unclear whether Lord Gifford was referring tostatutoryrightsorrightsgenerally(which would include common law rights) when he referred to “rights … which [accused persons] did not have previously”. If it was theformer, then Lord Gifford’s comments are not inconsistent with our view on the existence of the common law right, and therefore would not aid the Prosecution’s case. 52     Even in the case of thelatter(ie, that Lord Gifford was referring to rightsgenerally), one must consider the possibility that Lord Gifford might not have been cognisant of the common law recognition of this right. Indeed, as we have seen, the right was so self-evident and obvious that where it appeared inFrank Truman Export, it was mentioned almost in passing. It should also be noted that the decision by the English Court of Appeal inArias(which articulated the right in some detail for the first time) was handed down on26 July 1984(at which time wecouldreasonably assume that Lord Gifford ought to have been cognisant of that right), some21 days afterLord Gifford himself had spoken. It must also be borne in mind thatAriaswas – in so far as thefull textof the decision is concerned – anunreporteddecision inasmuch as it was not reported in any of the law reports commonly referred to, withonly brief summariesappearing in print (inThe Times Law Reports(dated1 August 1984) as well as in vol 128 of theSolicitors’ Journal(dated16 November 1984)). Hence, even in itsabbreviated formats, the decision inAriaswould have come to general public notice only in August 1984 (at the earliest). 53     At this juncture, a short observation might be made about the nature of the common law. Although the so-called declaratory theory of the common law is no longer in vogue (see, for example, Lord Reid, “The Judge As Lawmaker” [1972] JSPTL 22, but see also the defence of the theory in Allan Beever, “The Declaratory Theory of Law” (2013) 33 OJLS 421), it still retains some utility in justifying the objectivity of the common law which is,ex hypothesi, universal in nature and (to that extent) “timeless” (see Andrew Phang Boon Leong,From Foundation to Legacy: The Second Charter of Justice(Academy Publishing, 2006) at pp 21–22). Proceeding on this basis, it is somewhat disingenuous, in our view, to argue that the common law right only crystallised in 1984 when the decision inAriaswas handed down. Indeed, leaving aside the fact that that right could have been embodied in earlier decisions (see, for example,Frank Truman Export), it could be said that the common law right was, in a manner of speaking, always “out there”, although it was clearly articulated in the case law only after the decision inAriaswas handed down. This approach appears, in fact, to be confirmed by s 6 of the CPC (a point which we will elaborate upon below (at [84]–[86])). Looked at in this light, the arguments tendered by the Prosecution in relation to the precise timeframe appear, with respect, to be overly as well as unduly technical. In any event, even if these arguments were considered, they would still fail for the reasons stated in the preceding paragraph. 54     We sum up our views on Lord Gifford’s comments as follows. Firstly, Lord Gifford might have been referring to statutory rights, in which case there would be no inconsistency with our finding that the common law right exists. Secondly, even if Lord Gifford was referring to rights generally this is not, in the final analysis, inconsistent with our view that the common law right exists. This is because, at the time he made his speech, it was likely that Lord Gifford: (a) (in our respectful opinion)did notknow about thecommon law recognitionof this self-evident right inFrank Truman Export; and (b)could nothave known about the decision inArias. In any event, the common lawrecognitionof this self-evident right does not affect itsexistenceas it was always, so to speak, “out there”. In short, therefore, we do not agree with the Prosecution’s reliance on Lord Gifford’s comments. 55     However, there is yet another passage from the UK Parliamentary Debates which is relied upon by the Prosecution. This is found in the speech delivered on 24 July 1984 in the House of Lords by the then Parliamentary Under-Secretary of State for the Home Office, Lord Rodney Elton (“Lord Elton”), who had observed as follows (seeParliamentary Debates (Hansard) – House of Lords(24 July 1984) vol 455 at col 202): Clause 19 was intended to place the existing common law governing the seizure of such articles as set out inGarfinkelv.Metropolitan Police Commissioneron a statutory basis. In other words, it was intended to regulate the seizure of adventitious discoveries. Some of the important provisions in Clause 19, however, are intended to apply to any seizure by the police and not only to adventitious seizure. For example, subsections (2) and (3) prohibit the seizure of items subject to legal privilege. But they were intended to prohibit not just the seizure of such items found in the course of a search for something else; they were intended to ensure that the police could in no circumstances obtain access to such items, whether under the authority of a search warrant or not. Likewisethe provisions of Clauses 20[s 21 of the 1984 UK Act]and 21, which set outnew safeguardsfor those from whom property has been seized, should be available in the case where an article named in a warrant has been seized just as much as in the case where it is found adventitiously. [emphasis added in italics and bold italics] 56     Clause 19 of the 1984 UK Bill, which was referred to by Lord Elton in his speech, referred to the general powers of seizure by the police, whilst clause 20 of the same (which was also referred to by Lord Elton) referred to what was ultimately promulgated as s 21 in the 1984 UK Act. However, the fact that Lord Elton noted that the former clause (clause 19) was based on an existing common law principle whereas the latter clause (clause 20) constituted “a new safeguard” (see above at [55]), is a neutral point, at best. As we pointed out earlier in the context of Lord Gifford’s speech (above at [52]), clause 20 could have been “[a] new [safeguard]” to Lord Elton simply because it wasstill in the process of being crystallised as a common law rightinArias. In this regard, it also bears reiterating that the precise physical point in time that the common law right is declared (whether it be inAriasor even earlier inFrank Truman Export) does not necessarily mean that that right did not already exist as a universal (and, to that extent, timeless) principle which formed part of the much broader canvass of the common law itself (see above at [53]). 57     There is a further point that might be usefully noted. The Prosecution’s case on this issue turns on the phrase “rights … which they did not have previously” (in Lord Gifford’s speech (see above at [50])) as well as the phrase “new safeguards” (in Lord Elton’s speech (see above at [55])). In essence, the substance or focus of the Prosecution’s case may be readily summarised in one word – “new”. However, thecontextin which that word is used is equally – if not more – important. In this regard, the word or concept “new” neednot necessarilyconnoteentirelynew rights under the 1984 UK Act. In particular, both speeches ought to be interpreted in the context of the following observations by the Hon Douglas Hurd when clause 20 of the 1984 UK Bill was introduced as the “new clause 4” in the House of Commons on14 May 1984(seeParliamentary Debates (Hansard) – House of Commons(14 May 1984) vol 60 at col 26): These new clauses [ie, new clause 4 and 5] and amendments are concerned with a number of matters relating to property, both the limits within which the police are able to retain property which they have seized and the facility of access to such property when it has been seized. New clause 4 clarifies and standardises the rights of owners to access to and copies of seized material and responds to an undertaking that I gave in Committee. It largely replaces subsections (3) to (7) of clause 19, the purpose being toprovide a new clause of general application which, although it refers specifically to articles seized under clause 19, will apply also to articles seized under clauses 29, 48 and 49 and schedule 1 as a result of consequential amendments. The main practical point corresponds to one raised in Committee. The main difference is that we shall now, under the new clause, ensure that unless the officer in charge of the investigation has reasonable grounds for believing that it would prejudice the investigation the person who has had custody or control of a seized article must be permitted access to it on request.As at present drafted, access is provided for only if the making of a copy is impracticable. Someone whose business papers have been seized may not want a copy but may simply want to remind himself of them. The new clause introduces that flexibility. [emphasis added in bold italics] 58     Bearing this precise context in mind, the “new” rights alluded to by both Lord Gifford and Lord Elton were – more likely than not – actually references to the fact that cl 20 of the 1984 UK Bill (ie, s 21) now makes it clear that the right of access to Category 1 Documents appliesregardlessof whether the items were seized pursuant to a search warrant (under cll 29, 48 and 49 and Schedule 1 of the 1984 UK Bill) or pursuant to the police’s general powers of seizure (under cl 19 of the 1984 UK Bill). It is also possible that these members of the House of Lords made the reference to “new” rights because the 1984 UK Bill as originally presented effectively provided that the right of access should be granted only when making a copy is impracticable. 59     Finally (and not unimportantly), we note that the content of s 21 isprecisely the same asthe common law right as framed inArias(see above at [49] and at [33] as well as [34], respectively). Given the fact that there was no direct or indirect interaction as such between the UK Parliament on the one hand and the judges inAriason the other, the coincidence in the respective (final) formulations in both instances is remarkable, to say the least. In our view, the only reasonable (indeed, plausible) explanation is that the legal principle (as well as the balancing process it entails) is a self-evident one that not only existed at common law but was also embodied statutorily within s 21 itself. Even if one were to stretch the Prosecution’s argument to its fullest, it seems to us that the best case it can make is that both the statutory form (viz, s 21) and the common law right (embodied inArias) were developedsimultaneously and in parallel (rather than in conjunction) with each other. However, even on this rather strained interpretation, the Prosecution’s case in so far as this particular issue is concerned does not succeed. 60     But this is not the end of the matter. As with all rights, the present right can also be abused. And it is to this particular concern that our attention now turns.",
        "Sub-issue 1(b): A balancing process": "61     It is of foremost importance to emphasise that the common law right is not an absolute and unqualified one. Indeed, the Judge was at pains to emphasise in the GD that this right was subject to an overriding interest in the administration of criminal justice (see, for example, the GD at [24], [33], [42], [75], [79] and [81] as well as the very decision inAriasitself (see above at [44] and [45])). We note that this is also a proposition that the Respondents have accepted unreservedly. 62     Put simply, if the Prosecution can demonstrate to the satisfaction of the court that allowing access to the documents concerned (even though they fall within the rubric of Category 1 documents) will be prejudicial to the administration of criminal justice, the common law right would not be given effect to. This meets what seems, in our view, to be the only substantive argument which the Prosecution has made – that the administration of criminal justice would be compromised (for example, through (as the Prosecution argues) the possible subornation of witnesses). The difficulty we have with this argument is not one of principle but, rather, one ofcharacterisation. To elaborate, the Prosecution was utilising this argument (to the effect that the administration of criminal justicemight becompromised) to persuade this court that itthereforeought toreject the existenceofthe common law right altogether. With respect, this particular argument involved anon sequiturand would, in fact, result in the general rule (viz, the common law right) not only being “swallowed up” by the exception (viz, the danger that the administration of criminal justice might be prejudiced or harmed) but, also, being – literally –obliteratedaltogether. 63     In contrast, the approach adopted by the Judge in the court below wouldnotentail such anextremeresult. Put simply, whilst the common law right would (in the ordinary course of events) be given effect to, it would beoverridden ifto do so would prejudice or harm the administration of criminal justice. Put even more simply, what is involved is – as the Judge constantly emphasised himself (see, for example, the GD at [33], [75] and [81]) – abalancing process. Indeed, the very idea or concept of “balance” is not only intuitively attractive but also (and more importantly) theoretically as well as practically sound in the context of the present case. As we have already seen, the common law right does not exist for its own sake; it is rooted in considerations of logic, commonsense, precedent as well as justice and fairness for the reasons set out in detail above (at [38]–[42]).However, there is always the danger that the common law right (or any right for that matter) might be abused. In our view, abalancing processis therefore the best way forward having regard, again, to the larger canvass of legal principle. 64     We note that the Prosecution agrees that there ought to be a balancing process, although in the Prosecution’s submission this process ought to operate in aquite differentfashion. In particular, the Prosecution argued that, on the premise that the common law right didnotexist, it would still be possible to check anypossible abuseon the part of the Prosecution in refusing the accused access to his own documents. This, the Prosecution submitted, could be done by way of the accused adducing sufficient evidence ofunreasonable conducton the part of the Public Prosecutor in an application forjudicial review. With respect, such an approach seems to us to be inappropriate inasmuch as it places the burden onthe accused(many of whom may even be unrepresented to begin with). What must also be borne in mind is that the burden or onus is placed on the accused not only to filea further legal applicationbut to do so in an attempt to obtain access tohis own documentswhich, prior to their lawful seizure, he had access to in the first place. We see no reason – in principle – why the burden should not be onthe Public Prosecutorinstead to demonstrate (by way ofcogent evidence) why permitting the accused access to his own documents would–on the precise facts and circumstances concerned –be prejudicial or harmful to the administration of criminal justice (bearing in mind that what we are here concerned with arecriminal proceedings). Indeed, the Judge put it well in the court below when he made the following pertinent observations which we fully endorse (see the GD at [81]): The burden lies firmly on the Prosecution to show cogent evidence that there was a reasonable prospect of harm to the public interest in the administration of criminal justice before law enforcement authorities could lawfully deny or restrict access to Category 1 Documents. In cases of doubt, the Prosecution could apply to the Subordinate Courts (or the High Court, depending on where the accused person was charged) for a declaration that the proposed denial or restriction of access was lawful in the circumstances. The person applying for access would naturally have a right to be heard at this hearing. 65     It is not only just and fair but also practically advantageous that the burden lies on the Public Prosecutor in the manner just set out. Put simply, as this court has observed inBachoo Mohan Singh(at [104]), “the [Public Prosecutor] … [is the] guardian of the people’s rights,including those of the accused” [emphasis in original]. Indeed, we would also note the decision (also of this court) inKhor Soon Lee v Public Prosecutor[2011] 3 SLR 201, where (in quoting the observation just set out) the court specially commended (at [30]) the Public Prosecutor for conducting its case in an exemplary fashion which was consistent with the best traditions of the Bar. In the circumstances, we have no doubt that the Public Prosecutor would raise objections to the accused’s invocation of the common law right only in situations where there is reasonable basis to think that the public interest in the administration of criminal justice might be harmed or prejudiced. 66     It is instructive to note, in this regard, that the Judge did in fact address the precise concerns which the Prosecution referred to, in particular the danger of witnesses being suborned (see above at [62]). It is perhaps best to quote the Judgeverbatim, as follows (see the GD at [84]–[85]): 84The Prosecution objected in its written submissions to the Applicants having access to the human resource files of various employees (see Schedule A of the Application, documents (y) to (ss)) (“the HR files”), because it feared that the personal information of the Prosecution’s witnesses contained in the HR files could easily be used for an inappropriate purpose such as interfering with witnesses. The Prosecution argued that, as a matter of principle, the Applicants should not have access to such personal information without showing why the information was relevant, necessary and desirable for the preparation of their Case for the Defence, and that allowing such access would set a “dangerous precedent”. I therefore offered an opportunity to the Prosecution to explain in greater detail the public interest considerations and the factual bases thereof in support of their position that access should not be given to the HR files.At the hearing on 25 October 2012, I accordinglygranted leave to the Prosecution to file an affidavit by 31 October 2012, stating its objections against access to the HR files for purposes of making copies of them, failing which these had to be disclosed to the Applicants. I noted that in a letter dated 31 October 2012, the Prosecution stated that upon a review of the contents of the HR files it did not think that there were any reasons for treating them differently from the rest of the Materials, and that it would therefore not be filing any affidavit to resist access to the HR files. 85    While I noted that the Prosecution expressed doubts as to whether some of the Materials were truly relevant to the Applicants’ preparation of their defence against the Charges, I was of the opinion thatrelevance was not an element of the test to determine whether access to Category 1 Documents should be denied to the Applicants. As emphasised above (at [79]), it is only where there is cogent evidence of prejudice to the effective administration of criminal justice that the Applicants’prima facieright of access to Category 1 Documents could be denied. [emphasis in italics in original; emphasis added in bold italics and underlined bold italics] 67     More importantly, perhaps, on a practical level, acceptance of the Prosecution’s argument that the common law right shouldnotbe recognised lest it prejudice or harm the administration of criminal justice would be to throw the baby out with the bathwater. Indeed, even this description is, in our view, an understatement. Let us elaborate. 68     Assuming (for the sake of argument) that the common law right (as the Prosecution has argued) does not exist, what might be thepractical consequences? The possible consequences were, in fact, analysed in a comprehensive manner by the Judge in the court below. It is important to note that the possible consequences canvassed by the Judge were, as we shall see, not fanciful by any stretch of legal imagination. For example, the Judge observed as follows (see the GD at [58] and [76]): 58    The key distinction between (a) Category 1 Documents, and (b) Category 2 Documents and Category 3 Documents, is that Category 1 Documents comprise documents which wereoriginallyin the rightful possession or control of an accused person prior to the lawful seizure of the said documents by law enforcement authorities. But for the seizure of Category 1 Documents, these documents couldex hypothesihave been accessed whenever the accused person wanted to do so and for whatever purpose he wished, including for example, the preparation of his defence to charges or pending charges. He could use any or all these documents as evidence in his defence.If he suspected that the law enforcement authorities would soon arrive at his doorstep to seize documents, he could, depending on the remaining time available to him, proceed to make copies of any or all of the documents using photocopiers, cameras, scanners or various other devices. If the relevant documents were stored electronically, such copying could even be done with the click of a button, for example, the accused person may send the documents by e-mail to another e-mail account or to another person, or he may upload such documents onto the Internet. Furthermore, given the evidence before the court on the CAD’s practicevis-à-visseized documents …,accused persons could obtain copies of Category 1 Documents as they wished from the CAD which would usually accede to such requests prior to formal charges being preferred. Given the nature of Category 1 Documentsvis-à-visthe accused person, it is not conceptually or practically meaningful for the accused person to be denied access to Category 1 Documents before serving his Case for the Defence on the basis that doing so would allow him to “tailor his evidence”. … 76Given the immense public importance of criminal proceedings and of a correct verdict (be it a conviction or an acquittal), the preparation of the parties’ respective cases ought not to morph into a contest of memories especially where complex and/or document-intensive commercial operations and transactions are or may potentially be in issue.As this case illustrated, with about two years having elapsed since the search by the CAD to date, the voluminous nature of the documents involved (the Seized Documents being estimated to comprise of 197,240 individual documents), as well as the brevity of the Receipts provided by the CAD, the Applicants were only able to makean “educated guess”as to the contents of the documents seized from them and the relevance of these documents to the criminal proceedings.Clearly then, given the immense number of documents that might be potentially relevant in white-collar crime cases, it would not serve the cause of justice for the Applicants to be asked to commit themselves, based on their mere “educated guess” to a particular position without any access to Category 1 Documents, but to rely purely on memory and whatever documents they had managed to gain access to prior to being charged with the Charges to construct a Case for the Defence which they would eventually stand or fall by.While I noted the Prosecution’s submission that the trial court would be unlikely to draw an adverse inference against the Applicants if they put forward a case at trial which “[differed] from or [was] otherwise inconsistent” with the Case for the Defence (see s 169(1)(c) of the CPC 2010) given that they did not have sight of Category 1 Documents (if the request for the Materials was denied), in my view,there was still a possibility of injustice being occasioned to the Applicants, and there was no reason why they should be put at risk of this possibility crystallising. More fundamentally, it was difficult to see why, as suggested by the Prosecution, it would be in the interests of justice for accused persons to put forward an incomplete and/or inaccurate case initially and then subsequently to change that case based on Category 1 Documents disclosed in the supplementary bundle (even if such a shift in position did not lead to substantive consequences). Not only would this lead to a considerable waste of time and effort for defence counsel, the Prosecution and the courts, it would also bring little credit to our criminal justice process. [emphasis in italics in original; emphasis in bold underlined italics were emphasis in italics in original; emphasis added in bold italics] 69     The observations by the Judge quoted in the preceding paragraph are, in our view, compelling. In particular, if (as noted in the GD at [43]) the practice of the CAD is to (at least in the context of the present case) provide the accused access to hisowndocuments after lawful seizure of the said documents butbeforethe accused has in fact been charged, it does not make sense to deny the accused access to these documents after he has been charged because this assumes that the accused would not have begun preparing a defence to a possible charge prior to being actually charged. In fact, if access to the potential accused is warranted at the investigation stage, then the same ground for granting access should apply with even greater force after he is charged, as even more time would have passed by then, thereby naturally affecting that person’s ability to remember everything. In any event, the accused might need access to his own documents in order toprepare responsesto possible (and even actual as well as quite possibly difficult) questions posed in the course of theinvestigationsthemselves. If the response of the Prosecution is that it merely retains thediscretionnot to release the accused’s documents, that brings us back in a full circle to the issue of why the burden should be onthe accusedto demonstrate why he ought to be granted access to his documents (particularly where it would entail the initiation of separate proceedings injudicial review(a point which we have already dealt with above at [64])). In any event, such a response does not deal with the quite separate point made earlier in the present paragraph as to why the accused ought not to be furnished such access if he desires to prepare responses to possible questions in the course of theinvestigationsthemselves. 70     For completeness, we should also mention that, at the hearing before us, another reason cited but (in our view, correctly) not pursued by the Prosecution was the time, cost and other practical considerations that would arise if the common law right were to be recognised. In our view, such concerns are overstated. Where electronic documents are concerned, there would be minimal disruption to the operations of the Prosecution and/or the police as copies of such documents can be made easily with the click of the computer mouse. Where voluminous physical copies are concerned, there might be some time and cost considerations, but in our view these are justified in the interests of justice, bearing in mind that (as pointed out earlier at [65]) the Public Prosecutor is the guardian of the people’s rights, including those of the accused. In addition, any concern that the original documents would be tampered with could be easily dealt with by way of supervision of access and the safe-keeping of the original documents. And in the unlikely but possible event that the accused and/or his lawyer are merely being frivolous or vexatious with his requests for documents, the Prosecution can take up the appropriate application at the appropriate juncture. 71     In summary, we do not see any reason in principle (or, for that matter, even as a matter of practical consideration) why the balancing process which was advocated in the court below should not be adopted – not least because it deals directly with the very misapprehensions which the Prosecution refers to as a result of the endorsement of the common law right. We also note that the common law right is supported by thoroughly cogent reasons rooted in logic, commonsense, precedent as well as justice and fairness. However, this is not the end of the matter as the Prosecution also argues that, even if such a common law right exists, it is nevertheless abrogated by the CCD regime in the CPC (which was introduced by the CPC 2010), and it is to that particular issue that our attention now turns. It will suffice for the moment to state that, in light of our analysis in this part of the judgment,Question 1must be answered inthe affirmative.",
        "Issue 2": "72     To provide the context of the parties’ arguments and our observations, it would be apposite to briefly set out the key points of the CCD regime in the CPC. 73     Where the CCD regime in the CPC applies to a particular case in the Subordinate Courts, the Prosecution is obliged to serve a Case for the Prosecution in accordance with s 162 of the CPC which provides as follows: Contents of Case for the Prosecution 162.    The Case for the Prosecution must contain — (a)    the charge which the prosecution intends to proceed with at the trial; (b)    a summary of the facts in support of the charge; (c)    a list of the names of the witnesses for the prosecution; (d)    a list of the exhibits that are intended by the prosecution to be admitted at the trial; and (e)    any statement made by the accused at any time and recorded by an officer of a law enforcement agency under any law, which the prosecution intends to adduce in evidence as part of the case for the prosecution. 74     Thereafter, the accused will have to file a Case for the Defence in accordance with ss 163 and 165 of the CPC which provide as follows: When Case for the Defence is served 163.—(1)  At the further criminal case disclosure conference held on the date referred to in section 161(4), or such other date to which the further criminal case disclosure conference has been adjourned under section 238, if the accused does not indicate that he wishes to plead guilty, the defence must file in court the Case for the Defence and serve a copy thereof on the prosecution and on every co-accused who is claiming trial with him, if any, not later than 2 weeks from the date of the further criminal case disclosure conference or such date to which the further criminal case disclosure conference is adjourned. … Contents of Case for the Defence 165.—(1)  The Case for the Defence must contain — (a)    a summary of the defence to the charge and the facts in support of the defence; (b)    a list of the names of the witnesses for the defence; (c)    a list of the exhibits that are intended by the defence to be admitted at the trial; and (d)    if objection is made to any issue of fact or law in relation to any matter contained in the Case for the Prosecution — (i)    a statement of the nature of the objection; (ii)   the issue of fact on which evidence will be produced; and (iii)   the points of law in support of such objection. 75     After the two-week time period referred to in s 163 of the CPC has elapsed, s 166 of the CPC comes into play. Section 166 reads as follows: Time for service of other statements and exhibits 166.—(1)  Where the Case for the Defence has been served on the prosecution, the prosecution must, within 2 weeks from the date of service, serve on the accused copies of — (a)    all other statements given by the accused and recorded by an officer of a law enforcement agency under any law in relation to the charge or charges which the prosecution intends to proceed with at the trial; (b)    the documentary exhibits referred to in section 162(d); and (c)    criminal records, if any, of the accused, upon payment of the prescribed fee. (2)    Where the Case for the Defence has not been served on the prosecution, the prosecution — (a)    need not serve on the defence any of the statements, exhibits or records referred to in subsection (1); and (b)    may use any such statements, exhibits or records at the trial. 76     Similar provisions to those set out in [73]–[75] above are made for pre-trial discovery in cases before the High Court in ss 176, 192, 193, 195 and 196 of the CPC. 77     Turning now to the Prosecution’s arguments, the crux of the Prosecution’s case on this issue is to be found in the following paragraph of its written submissions, which reads as follows:[note: 4] When both intentions are read together, it is clear that ss 196(2)(a) and 166(2) of the CPC 2010 must beexclusive, remaining undiluted by non-statutory avenues for disclosure of material in the Cases for the Prosecution and Defence. Thisexclusivityis necessaryto preserve the elements of reciprocity and sequential disclosurewhich Parliament intended to implementto prevent tailoring of evidence. The granting of an additional right of access gives the Defencea non-statutory, non-reciprocal and non-sequentialavenue of disclosure of material in the Prosecution’s case. Thisdilutesthe CCDC regime byneutralisingthe statutory requirements ofreciprocity and sequencing. It is noteworthy that in discussing thesequential natureof the CCDC regime, the second reading speech did not leave any room for common law rules to modify or overturn the principle ofsequential disclosure. This suggests that Parliament, in creating the CCDC regime, did not intend to leave any room for non-statutory interference with the statutory principle ofsequential disclosure.Any judicial undermining of reciprocity and sequential disclosure would therefore defeat the intentions of Parliament. [emphasis added in bold italics] 78     In the course of the oral arguments before us, the Prosecution also argued that given the short two-week timeline for the filing of the Case for the Defence, Parliament could only have intended for the Case for the Defence to be bare-boned. Therefore, an accused person would not need to have access to the documents in the Prosecution’s possession for the preparation of the Case for the Defence. 79     With respect, we do not find the Prosecution’s arguments persuasive. In our view, they rest on a perceived irreconcilable inconsistency between the CCD regime under the CPC on the one hand and the common law right on the other. We also note the emphasis that the Prosecution placed on the elements of reciprocity and sequence embodied within the CCD regime, which elements it has argued would be subject to “neutralisation” as well as “dilution” by the overlay of the common law right. We elaborate more on why we disagree with the Prosecution’s arguments below. 80     Taking the point from reciprocity first, we do not see how the overlay of the common law right would either neutralise or dilute the element of reciprocity between the Prosecution and the Defence. Indeed, there appears to be no element of reciprocity involved to begin with where Category 1 Documents are concerned. It will be recalled that such documents belonged tothe accusedprior to their lawful seizure by the enforcement authorities. If the CCD regime were to completely oust the common law right then, after seizure, there would – on the contrary –beanabsence ofreciprocity (and, indeed, consistency) to the extent that the accused has no access to his own documents which he would like to have access to in order to prepare his Case for the Defence. Looked at in this light, the common law right actuallycomplementsthe CCD regime by ensuring that there is in fact reciprocity between the parties. The only asymmetry which might arise relates to a situation where the common law right is abused. However, such possible abuse is preventedviaabalancing processwhich has been described above (at [61]–[71]). 81     What, then, about the element ofsequence? First, it could not have been Parliament’s intention that the sequence in the CCD regime was to be adhered to mechanistically for its own sake against the spirit and purpose of the CPC (a point which we will discuss in more detail shortly). Secondly, we do not see how according the accused a right to his own documents pursuant to the common law right would result in a disruption of the said sequence. In fact, under s 165(1)(c) of the CPC (reproduced above at [74]), the Case for the Defence should include a list of the exhibits intended by the defence to be admitted at the trial. How can an accused person meaningfully comply with this if he is unable to access his own documents? This brings us back, in point of fact, to the concept ofcomplementarityjust referred to, which conceptipso factodisposes of the Prosecution’s argument frominconsistency. At this juncture, it is clear – as the Judge also held in the court below – that the common law right, far from being inconsistent with the CCD regime, is actually consistent as well as complementary with it. 82     Looking at the relevant Parliamentary debates on the CPC 2010 (see the18 May 2010 Parliamentary Debatesat cols 413-414), it is also clear that there is nothing which evinces an intention on the part of Parliament to exclude the common law right. And, as the Judge in the court below emphasised, neither was this right impliedly repealed (see the GD at [61]–[63]). If at all, theraison d’êtreof the CCD regime is – as the Judge in the court below also emphasised – to ensure transparency as well as a level playing field between the parties. That being the case, we do not see how the exclusion of the common law right would promote these laudable purposes. On the contrary, it seems to us that the exclusion of such a right would have theoppositeresult. 83     For these reasons we find that the common law right of access is compatible with and not ousted by the CCD regime set out in the CPC. Having disposed of this issue, let us turn now to consider briefly s 6 of the CPC in Issue 3.",
        "Issue 3": "84     In view of our analysis as well as conclusions with regard to Issues 1 and 2, it is, strictly speaking, unnecessary for us to express our views in relation to Issue 3. We would only note briefly that, had we found that no common law right existed, we would agree with the Judge that s 6 of the CPC would enable a similar right of access to be created. Section 6 itself reads as follows: Where no procedure is provided 6.    As regards matters of criminal procedure for which no special provision has been made by this Code or by any other law for the time being in force, such procedure as the justice of the case may require, and which is not inconsistent with this Code or such other law, may be adopted. 85     It seems to us that the adoption of a procedure in the context of s 6 amounts (in substance and even form) to the promulgation ofa new common law rule(albeit made in the context of a gap in the criminal procedure laid down in a statute). If so, then the arguments which applied with regard to Issue 1 would apply automatically in the context of the present issue (viz, Issue 3). More importantly, in the context of the present proceedings, this means that the finding of the existence of the common right pursuant to Issue 1 would necessarily entail this court also finding a similar right of access pursuant to s 6. However, this is merely a tentative view as the precise point was not argued in detail before this court. It will suffice for the purposes of the present proceedings to state that we are inclined to agree with both the reasoning as well as conclusion by the Judge in the court below in so far as this particular issue is concerned (see the GD at [69]–[78]). 86     We note that the Prosecution sought to argue that s 6 extends only to materials relevant to the issues in the proceedings as permitting a right of access, regardless of the relevance of the documents concerned, would invite “fishing expeditions”.[note: 5]With respect, however, such an argument misses the point to the effect that it is precisely the provision of such access which would enable the accused to ascertain which documents (if any) wouldbe relevantto his defence to begin with – bearing in mind that these documents belong to the accused and the need to ensure due process and a fair trial.",
        "The answers to the Questions": "87     Given our decisions on the main issues (in particular, Issue 1 and Issue 2), we now turn to answer the Questions.",
        "Question 1": "88     To reiterate, Question 1 is as follows: Where documents have been seized by the police in the lawful exercise of their investigative powers, whether at common law, a person’s ownership or legal custody of or legal right to control the documents so seized gives that person a right to access (or to make copies of) the documents while they are in the possession of the police and before investigation or prosecution of the criminal matter has been concluded. It clearly follows from our decision on Issue 1 (see above at [30]–[71]) that Question 1 should be answered in theaffirmative.",
        "Question 2": "89     To reiterate, Question 2 is as follows: Whether the answer to Question 1 would be the same if the person making the request for the access (or for copies) has been arrested for a criminal offence, and the documents were seized as part of investigations into the offence. It clearly follows from our decision on Issue 1 (see above at [30]–[71]) that Question 2 should be answered in theaffirmative.",
        "Question 3": "90     To reiterate, Question 3 is as follows: Whether the answer to Question 1 would be the same if the person making the request for access (or for copies) has been charged with a criminal offence and the documents were seized as part of investigations into the offence charged. It clearly follows from our decision on Issue 1 (see above at [30]–[71]) that Question 3 should be answered in theaffirmative.",
        "Question 4": "91     To reiterate, Question 4 is as follows: If the answer to Question 1 is positive, whether a criminal motion is the appropriate procedure to be adopted by a person seeking to enforce his right of access to, or to make copies of, the documents seized, if the police decline to permit such access or copying. 92     We would first point out that Question 4 is ambiguous. The reference to the scenario where thepolicedecline to permit access or copying appears to confine the question to the periodbeforethe accused is charged. For completeness, we will set out what in our view would be the appropriate procedural mechanisms for such interlocutory matters both beforeandafter the accused is charged, based on our existing criminal procedure rules. 93     We turn first to the scenario where the accused person is being investigated for an offence and hasnot yetbeen charged. First, the accused person should make his request to the police. If the police: (a) grants this request, or (b) denies the request on the ground that there is cogent evidence of a reasonable prospect of prejudice or harm to the public interest in the administration of criminal justice and the accused person accepts this, then this would obviously be the end of the matter. However, if the accused person wishes to challenge the denial by the police of his request then, procedurally, the only option currently available to the accused appears to be an application for judicial review of the decision by the police. That having been said, it seems to us that given the nature of such an application which, we would point out: (a) is for access to one’sowndocuments, (b) is in effect an interlocutory matter, and (c) puts the legal and practical burden on the accused person to seek the leave of court to bring judicial reviewandprove his substantive case, it seems to us that it would be fair and meaningful for there to be a more straightforward process consistent with applications madeafterbeing charged (see below at [94]–[97]). 94     Next, in the situation where the accused personhasbeen charged with an offence, the first course of action would obviously be to make the request to the Public Prosecutor. Again, if the Public Prosecutor (a) grants the request, or (b) denies the request on the ground that there is cogent evidence of a reasonable prospect of prejudice or harm to the public interest in the administration of criminal justice and if the accused person accepts this, then this would be the end of the matter. 95     Given our decision on Issue 1 (see above at [30]–[71]), it follows that if the Public Prosecutor wishes todenythis request, it should (as the Judge below suggested at [81] of the GD) make an oral application to the Registrar, Magistrate or District Judge of the Subordinate Courts or the Registrar of the Supreme Court (as the case may be) hearing the Pre-Trial Conference (“PTC”) or the CCD Conference (“CCDC”) (again, as the case may be) for a declaration that the proposed denial of access is lawful inasmuch as the public interest in the administration of criminal justice would otherwise be prejudiced or harmed. The presiding judicial officer will then determine the merits of such an application on the basis of the balancing process that we have earlier explained at [61]–[71] above. We note that while the mechanism of a Criminal Motion to the High Court under s 405 of the CPC is technically available, we are of the view that it should not be resorted to in the first instance for what is, essentially, an interlocutory matter. 96     The procedure to set aside the decision made at first instance (in accordance with the procedure set out in the preceding paragraph) will then depend on whether that decision was made in the Subordinate Courts or the High Court under the procedural rules as they currently stand: (a)    If the decision was made by the Registrar, Magistrate or District Judge in the Subordinate Courts, then an application to set aside the decision can be made by way of an application for Criminal Revision under s 400(1) of the CPC if it was made in the course of a PTC, or under s 404(1) of the CPC if it was made in the course of a CCDC (as the case may be). These two provisions are reproduced below: Power to call for records of Subordinate Courts 400.—(1)  Subject to this section and section 401, the High Court may, on its own motion or on the application of a Subordinate Court, the Public Prosecutor or the accused in any proceedings, call for and examine the record of any criminal proceeding before any Subordinate Court to satisfy itself as to the correctness, legality or propriety of any judgment, sentence or order recorded or passed and as to the regularity of those proceedings. … Power to revise orders made at criminal case disclosure conference 404.—(1)  The High Court may, on its own motion or on the application of the Public Prosecutor or the accused in any criminal case disclosure conference, call for and examine the record of any criminal case disclosure conference held under Part IX or X before a Magistrate, a District Judge, the Registrar of the Subordinate Courts or the Registrar of the Supreme Court to satisfy itself as to the correctness, legality or propriety of any order recorded or passed at the criminal case disclosure conference, and as to the regularity of the criminal case disclosure conference. (b)    If, however, the decision was made in the High Court by the Registrar of the Supreme Court, then the appropriate procedure depends (unsatisfactorily perhaps, in our view) on whether the first instance decision was made in a PTC or a CCDC. If the order was made in a CCDC, then the appropriate procedure would be to file for a Criminal Revision under s 404(1) of the CPC (reproduced above). If, however, the order was made in a PTC, then the appropriate procedure is not as straightforward as there appears to be a gap in the rules. Section 404(1) of the CPC cannot be invoked in such a situation because this provision expressly governs only orders made at a CCDC. Neither, it seems, can s 400(1) of the CPC be invoked in such a situation because the order of the Registrar of the Supreme Court in criminal proceedings is not an order of the “Subordinate Court”, which is defined in s 2 of the CPC as “any court constituted under the Subordinate Courts Act (Cap 321) for the administration of criminal justice”. It seems to us that, there being no sound reason to distinguish between an order made at a PTC and an order made at a CCDC, we would rely on s 6 of the CPC (reproduced above at [84]) to state that the appropriate procedure in this scenario would also be to file for a Criminal Revision. 97     If the Public Prosecutor denies the accused person access to the relevant documents but does not take up an application for a declaration that the proposed denial of access is lawful inasmuch as the public interest in the administration of criminal justice would otherwise be prejudiced or harmed, the accused person can make his or her oral application for access to the relevant documents to the Registrar, Magistrate or District Judge of the Subordinate Courts, or the Registrar of the Supreme Court (as the case may be) hearing the PTC or CCDC. Naturally, in such a situation, although the Public Prosecutor is not the applicant, the burden still lies on the Public Prosecutor to prove that there is cogent evidence of a reasonable prospect of prejudice or harm to the public interest in the administration of criminal justice. 98     It is evident from our answer to Question 4 in the preceding paragraphs that the procedural matters are (needlessly) confusing, unclear and (on occasion at least) inconsistent. To some extent, this is to be expected since the discovery regime is an emerging (and, hence, developing) area of law. While we express our views above based on the existing rules, we feel that this is ultimately a broader issue that should be looked at by the appropriate institutions having regard to all the relevant considerations (in particular, the foundational legal principles of justice and fairness), in order to formulate a sound and coherent framework which complements and gives meaningful effect to the developments in the substantive law.",
        "Question 5": "99     To reiterate, Question 5 is as follows: Question 5: If the answer to Question 1 is positive, and if the [CCD] provisions in the [CPC] apply to the person making the request for access to (or for copies of) the documents, then in cases where the documents are listed as exhibits in the Case for the Prosecution, whether the right of access (or for copies of) the documents is subject to the CCD disclosure provisions. It clearly follows from our decision on Issue 2 (see above at [72]–[82]) that Question 5 should be answered in thenegative.",
        "Question 6": "100    To reiterate, Question 6 is as follows: Question 6: Whether in situations where the CCD regime for criminal cases applies, and where the documents seized from the accused person fall within the purview of the CCD regime, the courts are precluded from invoking s 6 of the CPC to create new procedures to allow accused persons access to, or copies of, the seized documents. Question 6 flows from Issue 3 (see above at [84]–[86]) and has therefore been rendered academic in light of our analysis as well as conclusions with regard to Issues 1 and 2.",
        "Conclusion": "101    Finally, we would like to record our appreciation to both counsel for their invaluable assistance as well as research in respect of these proceedings. In particular, the existence (or otherwise) of the common law right (as well as its relationship to the CCD regime in the CPC) constitute issues which are of great theoretical as well as practical importance, and for which the canvassing of all the relevant arguments (by way of both written as well as oral submissions) was imperative.  [note: 1]Applicant’s Written Submissions at para 19. [note: 2]Ibid, at para 32. [note: 3]Ibid, at para 34. [note: 4]Ibid, at para 73. [note: 5]Ibid, at para 97."
    }
}