{
    "case_title": "Media Development Authority of Singapore\n      v\n      Sculptor Finance (MD) Ireland Ltd",
    "ncitation": "[2013] SGCA 58",
    "coram": "Sundaresh Menon CJ; \n      V K Rajah JA; \n      Judith Prakash J",
    "sections": {
        "Introduction": "1       This appeal was brought by Media Development Authority of Singapore (“MDA”) against the decision of the High Court judge (“the Judge”) in Originating Summons No 713 of 2012 (“the Application”) to grant an extension of time to Sculptor Finance (MD) Ireland Ltd (“the Applicant”) to register two charges under the Companies Act (Cap 50, 2006 Rev Ed) (“the Act”). The Judge’s decision is reported asSculptor Finance (MD) Ireland Ltd v Media Development Authority of Singapore[2013] 2 SLR 311 (“the GD”). 2       The said charges (“the Charges”) had been granted to the Applicant by RSM Group Pte Ltd (“RGPL”) and RGM Media Singapore Pte Ltd (“RMSPL”) over their respective assets. 3       On 5 October 2012, the Judge allowed the Application. It is significant that the grant of extension of time was made subject to two provisos: (a)     First, in the event that either RGPL or RMSPL was wound up subsequently, its liquidator would be at liberty to apply to set aside the Judge’s orders within 12 weeks of his appointment or such extended period as the court may order (“Winding Up Proviso”). (b)     Second, that the extension of time would be without prejudice to the rights of any person claiming any interest in the property charged pursuant to any of the Charges if such interest was acquired before the time of registration of the relevant Charge (“Preservation of Rights Proviso”). It should be noted that orders similar to the Preservation of Rights Proviso are commonly made when an application to extend time to register charges is granted. 4       After hearing and considering the submissions of the parties, we dismissed MDA’s appeal. These are our reasons.",
        "Background": "",
        "Parties": "5       Both RMSPL and RGPL are incorporated in Singapore. RMSPL is wholly owned by RGPL. RGPL is in turn wholly owned by One North Entertainment Limited (“ONEL”), a company that used to be listed on the Australian Securities Exchange. RGPL, RMSPL and another company, RGM Entertainment Pte Ltd (“RGME”), are part of the same group of companies. 6       The Applicant is an investment fund incorporated in Ireland. It obtained the Charges under a Deed of Charge dated 3 August 2011 (“the Deed”). There were seven chargors under the Deed. Apart from RGPL and RMSPL, these were RGM Film and Television Services Inc, a company in Delaware, RGM Media Film Television Investments Limited, a company incorporated in the British Virgin Islands, and three Australian companies – RGM Media Limited, RGM Artist Group Pty Limited and Biosignal Australia Pty Limited (“the Australian chargors”). 7       MDA is a body corporate established under the Media Development Authority of Singapore Act (Cap 172, 2003 Rev Ed).",
        "Events leading to the grant of the Charges and the Application": "8       In 2010, MDA agreed to advance money to RGME and RGPL to carry out film production and related work. 9       First, MDA entered into an agreement dated 25 June 2010 (“the Fox Agreement”) with RGME and another entity, Redline Management Pte Ltd (“Redline”). RGPL became a party to the Fox Agreement by way of a novation agreement between RGPL, MDA and Redline dated 16 September 2010. Subsequently, MDA advanced S$10m to RGPL under the Fox Agreement. 10     Second, on 16 September 2010, MDA entered into an agreement (“the Sony Agreement”) with RGME and RGPL. Under the Sony agreement, MDA advanced S$5m to RGME’s bank account for RGPL’s use towards a film production fund and agreed to advance another S$5m once certain conditions specified in the Sony Agreement were satisfied. 11     Both the Sony Agreement and the Fox Agreement contained negative pledge clauses. 12     Between August and December 2011, the Applicant and two other investment funds, Sculptor Finance (AS) Ireland Limited and Sculptor Finance (SI) Limited (collectively, “the Sculptor Entities”), subscribed for A$4m worth of convertible bonds issued by ONEL (“the Bonds”). RGPL and RMSPL granted the Charges to the Applicant to secure all monies owing to the Sculptor Entities under or in relation to the Bonds. The Applicant held the Charges on trust for the other two Sculptor Entities. The Charges were in the nature of fixed and floating charges over the chargors’ assets. 13     Pursuant to s 131(1) of the Act, the Charges had to be registered with the Accounting & Corporate Regulatory Authority of Singapore (“ACRA”) within 30 days of creation. The Charges were created on 3 August 2011 and should have been registered by 2 September 2011. However, they were not registered by that date. The Applicant claimed that it did not register the Charges because it did not have advice on Singapore law when the Charges were created and was not aware of the need for registration. The Applicant appointed solicitors in Singapore in May 2012, and that was when it discovered that the Charges had to be registered and that RGPL and RMSPL had not procured such registration. 14     The Applicant conducted a LawNet search on 31 May 2012 and became aware that MDA had taken proceedings against RGPL and RGME. It also learned that ONEL had filed a judicial management application in respect of RGPL on 4 May 2012 in Originating Summons No 421 of 2012 (“the JM Application”), based on an unsatisfied statutory demand for A$11,310,488.04. The Lawnet searches did not disclose any registered charges over RGPL’s and RMSPL’s assets. 15     On 27 June 2012, ONEL announced that its Board of Directors had approved the disposal of the whole of its interest in RGPL to a company named Special Solutions Pty Ltd (LFF). On 2 July 2012, ONEL announced on the Australian Stock Exchange that it was placed into voluntary administration in Australia. On 26 July 2012, the Applicant filed the Application. 16     The JM Application was first heard on 5 July 2012 but it was adjourned because ONEL’s counsel needed to take instructions on whether to proceed with the JM Application. On 28 September 2012, ONEL sought leave to withdraw the JM Application. The Applicant contested this and asked for the hearing to be adjourned instead. It stated that the outcome of the Application could be prejudiced if the statutory moratorium which was in place pursuant to the JM Application was lifted and an application for winding up was filed against RGPL. The Judge did not accept the Applicant’s arguments and granted ONEL leave to withdraw the JM Application. 17     MDA filed a winding-up application against RGPL on 28 September 2012 in Companies Winding Up No 158 of 2012 (“the CWU”). The Application was granted on 5 October 2012 and the Charges were registered on 16 October 2012.",
        "Events that occurred after the Judge’s decision": "18     On 23 October 2012, Woo Bih Li J ordered that RGPL be placed in liquidation. Sim Guan Seng and Victor Goh (“the Liquidators”) of Baker Tilly TFW LLP were appointed as liquidators. 19     On 8 February 2013, the Liquidators filed Originating Summons No 41 of 2013 to seek,inter alia, a 12-week extension of time to apply to set aside the Judge’s order. The Liquidators explained that thus far they had been unable to obtain sufficient information, including regarding the circumstances and the financial health of RGPL and RMSPL when the Charges were created, due to a lack of co-operation from RGPL’s directors. The Liquidators were granted until 8 May 2013 to apply to set aside the Judge’s order. On 21 May 2013, on the further application of the Liquidators, they were given an extension of time until 14 days after this appeal was disposed of to apply to set aside the Judge’s order.",
        "The decision below": "20     In deciding to grant the Application, the Judge found that the Applicant had shown that its omission to register the Charges was due to inadvertence. MDA had argued that the Applicant failed to particularise its explanation for not registering the Charges in time and that the Applicant’s claim of inadvertence should not be believed given that the Applicant knew that the charges granted by the Australian chargors were registrable and did register those charges. It knew or should have known of the registration requirements in Singapore. The Judge disagreed with MDA, and found that the authorities established that if the Applicant or its employees were not aware of the need for registration, this would be sufficient to show inadvertence for the purposes of s 137 of the Act (the GD at [15]). In the alternative, it would be just and equitable to grant the Applicant relief. RGPL and RMSPL had both statutory and contractual obligations as chargors to register the Charges and it would not be just and equitable for the Applicant to be prejudiced by RGPL’s and RMSPL’s failure to do so (the GD at [19]). 21     Although the Judge found that, at the time of the hearing, there was a real possibility that RGPL would be wound up, winding up was not inevitable or necessarily imminent (the GD at [20]–[21]). In any event, the fact that liquidation was imminent did not preclude the court from granting an extension of time to register the Charges (the GD at [23]). The Judge was also satisfied that the creditors of RGPL would not be prejudiced by the extension of time if it was made subject to the Winding Up Proviso. If RGPL was eventually wound up, the liquidator would be empowered to set aside the registration of the Charges. The Judge considered that if the Application was dismissed, the Applicant would suffer prejudice because it had lent a substantial sum of money on the basis that it had obtained good security in the form of the Charges and would lose its security due to RGPL’s and RMSPL’s failure to comply with their obligations to register the Charges (the GD at [24]). The Winding Up Proviso would preserve the position for the parties (the GD at [25]). The fact that two months had lapsed between the time the Applicant was made aware of the need for registration and the filing of the Application did not militate against the grant of an extension of time (the GD at [25]).",
        "The parties’ cases": "MDA’s case 22     Before us, MDA submitted that the Judge erred in finding that the ground of inadvertence and/or the “just and equitable” ground were satisfied. The Applicant’s claim that it was unaware of the need for registration was a bare assertion, and it did not explain why it took two months to file the Application after becoming aware of the need to register the Charges. 23     MDA also submitted that the Judge had made an inherently unworkable order because, on the presentation of the CWU, the unsecured creditors acquired rights pursuant to the imposition of a statutory trust, and the Charges were thus void against them. The authorities established that once winding up had commenced, applications to extend time for unregistered charges to be registered would invariably be refused as a matter of law, save in exceptional circumstances such as fraud. MDA argued that the Preservation of Rights Proviso made the Judge’s order “useless” to the Applicant, because MDA had acquired an interest in RGPL’s assets on the presentation of the CWU. 24     MDA maintained that it was a creditor of RGPL and emphasised that the Applicant had not challenged its standing to pursue the CWU as a creditor of RGPL. MDA accepted that it was not a creditor of RMSPL. However, as the shares of RMSPL and any dividends or distributions by RMSPL to RGPL would form part of RGPL’s assets, MDA argued that it would suffer prejudice if the Application was allowedvis-à-visthe charge over RMSPL’s assets. The Applicant’s case 25     The Applicant argued that the Judge had properly exercised his discretion in allowing the Application and had taken into account all the relevant circumstances including the possibility that RGPL might be wound up. Both the “inadvertence” and “just and equitable” grounds under s 137 of the Act were satisfied. The court has the discretion to allow an application for an extension of time to register a charge where winding up is a possibility but a winding up order had not been made yet. It is only upon the making of a winding up order that the assets of the chargor become impressed with a statutory trust in favour of unsecured creditors. The Judge took a practical approach and “preserved the position while allowing the liquidator to present further facts to the court subsequently, if necessary”. The Applicant disagreed that the order was futile. It argued that the Preservation of Rights Proviso did not assist MDA because this proviso protected secured and not unsecured creditors. 26     The Applicant argued that it was not clear that MDA was a creditor of RGPL. MDA had yet to obtain any arbitral award requiring RGPL to pay monies to it. Nor did the documentation for the Sony Agreement and the Fox Agreement show that MDA lent money directly to RGPL. In the face of such uncertainty, the Applicant would be prejudiced if the Application was refused and it later turned out that MDA was not a creditor of the Applicant. The Applicant submitted that even if the Judge’s order in relation to RGPL was set aside, the order in relation to RMSPL should be upheld. MDA was not a creditor of RMSPL and had not taken any security over RMSPL’s assets.",
        "Issues before this court": "27     These were the issues that arose for our consideration: (a)     Did MDA havelocus standito oppose the Application on the ground that the Charges were void against it under s 131 of the Act? (b)     Did the Judge err in exercising his discretion to allow the Application despite finding that there was a real possibility that RGPL would be wound up?",
        "Our decision": "",
        "Law on registration of charges under the Act": "28     The statutory requirement for the registration of company charges is set out in s 131(1) of the Act, which provides: Registration of charges 131.—(1)  Subject to this Division, where a charge to which this section applies is created by a company there shall be lodged with the Registrar for registration, within 30 days after the creation of the charge, a statement containing the prescribed particulars of the charge, and if this section is not complied with in relation to the charge the charge shall, so far as any security on the company’s property or undertaking is thereby conferred, be void against the liquidator and any creditor of the company. ... [UK, 1948, s. 95; Aust., 1961, s. 100] Section 131(3) of the Act lists the types of charges which are registrable under the Act. 29     Section 137 governs the court’s discretion to grant an extension of time to register charges that fall under s 131(3) of the Act: Extension of time and rectification of register of charges 137.The Court, on being satisfied that the omission to register a charge (whether under this or any corresponding previous written law) within the time required or that the omission or mis-statement of any particular with respect to any such charge or in a statement of satisfaction wasaccidental or due to inadvertence or to some other sufficient cause or is not of a nature to prejudice the position of creditors or shareholders or that on other grounds it is just and equitable to grant relief, may on the application of the company or any person interested and on such terms and conditions as seem to the Court just and expedient (including a term or condition that the extension or rectification is to be without prejudice to any liability already incurred by the company or any of its officers in respect of the default) order that the time for registration be extended or that the omission or mis-statement be rectified. [UK, 1948, s. 101; Aust., 1961, s. 106] 30     Sections 131 and 137 of the Act were modelled after English and Australian legislation. In the United Kingdom (“the UK”), the public register of charges was introduced in the Companies Act, 1900 (63 & 64 Vict c 48) (UK) (“Companies Act 1900”). Section 14(1) of the Companies Act 1900 provided that the failure to register registrable charges within 21 days after the date the charges were created would render them void against the liquidator and any creditor of the company. The UK Parliament in enacting s 14(1) of the Companies Act 1900 sought to address the problem that “a company [could] obtain credit on the strength of property in its possession and other assets, whether present or future, which prospective creditors might consider to be available to satisfy their debts in the belief that such property or assets were unencumbered”, when the property or assets were in fact subject to a charge (William James Gough,Company Charges(Butterworths, 2nd Ed, 1996) (“Gough”) at p 453). The enactment of a public register of charges was intended to protect unsecured creditors “from losing priority to undisclosed proprietary interests created by way of security” (Gough at p 736). During the second reading debate of the Companies Bill 1900 (United Kingdom, House of Commons,Parliamentary Debates(26 June 1900) vol 84 at col 1143), the President of the Board of Trade stated that: … Another evil which at present exists is that when it comes to the winding up of some companies it is found that the whole of the available assets of the company are mortgaged, and there is nothing at all to divide amongst the unhappy creditors. The only remedy which can be applied to this particular evil is to take care that publicity is given to any mortgages which exist. It is therefore provided that any mortgages shall be registered... and be open to public inspection, and that any mortgages not so registered shall be invalid. … 31     Roy Goode inPrinciples of Corporate Insolvency Law(Sweet & Maxwell, 4th Ed, 2011) (“Goode”) also explained at para 13-124 that: ... In the first place, [this] avoidance rule reflects the law’s dislike of the secret security interest, which leaves the debtor’s property apparently unencumbered... Secondly, the registration provisions help to curb the fabrication or antedating of security agreements on the eve of winding up. Thirdly, although unsecured creditors have no existing interest in the company’s assets outside winding up, and thus no immediatelocus standito complain of want of registration, they have an inchoate interest in that upon winding up the whole of the company’s property, so far as not utilised in discharging the expenses of winding up and the payment of preferential claims, becomes available for the general body of creditors, so that their rights become converted from purely personal rights into rights more closely analogous to that of beneficiaries under an active trust. Fourthly, there may well be unsecured creditors who were misled by want of registration into extending credit which they would not otherwise have granted. But it would be both expensive and impractical to expect the liquidator (or administrator to investigate each unsecured creditor’s claim to see whether he did or did not act on the assumption... So a broad-brush approach which in effect assumes detriment to unsecured creditors at large is justified. Finally, the registration provisions serve a general public notice function as well as being a perfection requirement, and the avoidance provision can be... a powerful inducement, to comply with the law’s requirements ... 32     We also note that s 132 of the Act imposes the statutory duty to register charges on the chargor. 33     The court’s discretionary jurisdiction to extend time for registration of a charge under s 137 of the Act arises only if there is sufficient evidence: (a)     that the omission to register the charge was: (i)       accidental; (ii)       due to inadvertence; (iii)       due to some other sufficient cause; (iv)       not of a nature to prejudice the position of creditors or shareholders; or (b)     that it is just and equitable to grant relief on other grounds. Satisfying one of these limbs is a necessary but insufficient criterion to obtain an extension of time. The applicant must go on to persuade the court to exercise the discretion in its favour (Andrew Keay, “The Power to Extend Time to Lodge Notice of Corporate Charges” (1996) 14 Company and Securities Law Journal 136 at 138). As the power to grant an extension of time for the registration of charges is a discretionary one (In re Kris Cruisers Ltd[1949] Ch 138 (“Kris Cruisers”) at 140), the appellate court will interfere with decision of the lower court only if it is shown that the exercise of discretion was based on a misunderstanding of the law or the evidence or based on a wrong principle.",
        "Did MDA have locus standi to challenge the Application on the ground that the Charges are void against it?": "34     A key issue in this appeal, which was not directly addressed by the Judge, was whether MDA had thelocus standito oppose the Application on the ground that the Charges were void against it. MDA claimed that it qualified as a “creditor” for the purposes of s 131(1) of the Act, because on the presentation of the CWU, a statutory trust came into existence to preserve the assets of the company for distribution among the unsecured creditors and MDA acquired rights to RGPL’s assets. Was MDA a creditor of RGPL and RMSPL? 35     In order to challenge the registration of the Charges, MDA must be a creditor of RGPL and RMSPL (seeStroud Architectural Systems Ltd v John Laing Construction Ltd[1994] BCC 18 at 24). 36     There was a dispute as to whether MDA was a creditor of RGPL. MDA claimed that it was a creditor of RGPL because (1) MDA had brought arbitral proceedings against RGPL for breach of the Fox Agreement and the Sony Agreement, and was thus a potential creditor, and (2) MDA was a contingent or prospective creditor of RGPL as the monies disbursed under the Fox Agreement and the Sony Agreement had to be repaid after a fixed term. MDA claimed that its investment had to be repaid, at the latest, by 25 June 2013 under the Fox Agreement, and by 16 September 2014 under the Sony Agreement. On the other hand, the Applicant pointed out that cl 4.3 of the Fox Agreement and the Sony Agreement stated that the sums advanced by MDA were paid into a bank account held by RGME, and not RGPL. There was also no certainty that the arbitral proceedings would result in an award in favour of MDA. 37     It was not necessary to our decision to decide this point. We proceeded on the basis that MDA was a creditor of RGPL because it appeared to have, at the very least, a claim that could be submitted for proof in RGPL’s liquidation. It would be up to the Liquidators to determine whether such proof should be accepted or rejected. 38     It was undisputed, however, that MDA was not a creditor of RMSPL. We therefore dismissed MDA’s appeal against the Judge’s ordervis-à-visthe charge on RMSPL’s assets on this basis. Was MDA a party against whom the Charges were void for non-registration on the filing of the CWU? 39     A more difficult obstacle that MDA faced was the issue of whether it was a “creditor” for the purposes of s 131(1) of the Act. The Act does not contain a definition of  “creditor”, but “creditor” in s 131(1) has been interpreted to mean a creditor who has acquired a proprietary right to or an interest in the subject matter of the unregistered charge (In re Ashpurton Estates Ltd[1983] 1 Ch 110 (“Ashpurton”) at 119 and 123 affirmingRe Ehrmann Brothers Ltd[1906] 2 Ch 697 (“Ehrmann”) at 704;Re Telomatic Ltd[1994] 1 BCLC 90 (“Telomatic”) at 95;Re City Securities Pte[1990] 1 SLR(R) 413 at [73]). Lord Brightman inAshpurtonnoted at 123: ... so long as the company was a going concern at the date of registration, the [Preservation of Rights Proviso] did not protect, and was not intended to protect, an unsecured creditor who had lent money at a time when the charge should have been but was not registered: seeIn re Ehrmann Brothers Ltd. [1906] 2 Ch. 697 andIn re Cardiff Workmen's Cottage Co. Ltd.[1906] 2 Ch. 627. The reason for this was that such unsecured creditor could not have intervened to prevent payment being made to the lender whose charge was not registered (whom I will call “the unregistered chargee”). Nor could such unsecured creditor have prevented the creation of a new charge, duly registered, to take the place of the unregistered charge. The proviso was intended to protect only rights acquired against, or affecting, the property comprised in the unregistered charge, in the intervening period between the date of the creation of the unregistered charge and the registration of such charge.Such persons would include a subsequent chargee of the relevant property; a creditor who has levied execution against the relevant property; and an unsecured creditor if, but only if, the company has gone into liquidation before registration is effected.Once the company has gone into liquidation, the existing unsecured creditors are interested in all the assets of the company, since the liquidator is bound by statute to distribute the net proceeds pari passu among the unsecured creditors, subject to preferential debts. The assets of the company are at that stage vested in the company for the benefit of its creditors. The unsecured creditors are in the nature of cestuis que trust with beneficial interests extending to all the company's property. [emphasis added in bold italics] 40     Section 131(1) of the Act invalidates an unregistered charge as against the liquidator and any creditor of the company. Prior to the onset of liquidation, a chargor cannot object to the enforcement of an unregistered charge (Gough at p 733; see also John de Lacy in “Company charge avoidance and human rights” (2004) Journal of Business Law 448 (“de Lacy”) at 451). Nor can the unsecured creditors complain because they have no proprietary interest in the company’s assets. If the chargee of a registrable but unregistered charge receives payment in full satisfaction of the debt before liquidation sets in (and barring the operation of any other avoidance provisions), the enforcement is good against the liquidator. Gough notes at p 737 that in this situation, “the security of a charge is spent through enforcement and recovery prior to the liquidation, [and] the invalidation provision cannot apply because it has nothing to bite on”. 41     MDA, however, relied on the decision of this court inNg Wei Teck Michael and others v Overseas-Chinese Banking Corp Ltd[1998] 1 SLR(R) 778 (“Michael Ng (CA)”) to support its argument that the Charges were void against it as of 28 September 2012 when the CWU relied on was filed, by virtue of a statutory trust that arises on the commencement of winding up. InMichael Ng (CA), the respondent bank (“the bank”) had provided the company with overdraft and trust receipt facilities. In consideration of an extension of time to repay the bank, the company deposited the title deeds to its property with the bank, thereby creating a mortgage in favour of the bank. The bank lodged a caveat with the Registry of Titles but did not register the mortgage with the Registry of Companies. Subsequently, on 25 April 1994, the bank obtained an order of court to sell the property with vacant possession. In the meantime, on 12 March 1994, the second appellant (“the creditor”) had obtained judgment against the company. On 6 May 1994 when the judgment debt was not satisfied, the creditor filed a winding up petition against the company. The first appellants were appointed as receivers and managers (“the receivers”) and they discovered that the mortgage had not been registered. Their solicitors wrote to the bank’s solicitors on 1 June 1994, stating that the receivers took the position that the mortgage was void for want of registration. The bank nonetheless sold the property subject to the mortgage on 4 October 1994. For reasons which were not apparent, the winding-up proceedings remained pending for some time and a winding-up order was made against the company only on 5 May 1995. The receivers were appointed the liquidators of the company. The creditor and the receivers applied for a declaration that the charge was void under s 131(1) of the Act and for the bank to pay the receivers the sale proceeds of the property. The High Court judge held that s 131(1) only came into operation on the appointment of the liquidators, and by that time the mortgage had been realised and there was nothing for s 131(1) to bite on (Ng Wei Teck Michael and another v Oversea-Chinese Banking Corp Ltd[1997] 2 SLR(R) 374 (“Michael Ng (HC)”) at [21]). The judge also relied onEhrmannandTelomaticand held that the creditor, being unsecured, was not a “creditor” for the purposes of s 131(1) and had nolocus standito seek the declaration that the charge was void against it (Michael Ng (HC)at [22]). 42     On appeal, the Court of Appeal agreed that as against the liquidator the charge was spent. Section 131(1) of the Act came into operationvis-a-visthe liquidator only upon his appointment. However, the Court of Appeal held that the charge was void against unsecured creditors. It held thaton the presentation of a winding-up petition (or application), a statutory trust in the nature of acestui que trustwith beneficial interests over the company’s assets comes into place to preserve the assets in favour of the unsecured creditors, and an unsecured creditor acquires sufficient interest in the subject matter of the unregistered charge to qualify as “creditor” for the purposes of s 131(1) of the Act. We set out the reasoning inMichael Ng (CA)at [31]: … On the basis of all the authorities which we have discussed, s 131(1) of the Companies Act does not apply in favour of an unsecured creditor and an unregistered charge is not void as against such a creditor, while the company is a going concern. This is because he is not entitled to prevent the company from paying off the debt secured by the unregistered charge or granting a confirmatory charge. An unsecured creditor has no interest in the assets of a company and is powerless to restrain it from dealing with its assets as it wishes.This state of affairs which prevails while the company is a going concern ceases on the presentation of a winding-up petition.As from that date, the company is no longer at liberty to pay off the debt owed or grant a confirmatory charge to the chargee. Under s 259 read together with s 255(2) of the Companies Act, any disposition of the company's property from the presentation of the winding-up petition is void unless it is sanctioned by the court.A statutory scheme comes into place to preserve the assets of the company for pari passu distribution among the unsecured creditors: see, inter alia, ss 258, 259, 260, 334 of the Companies Act; and the unsecured creditors of a company are in the nature of a cestui que trust with beneficial interests extending to all the company's property, including the subject matter of the unregistered charge.The avoidance of the unregistered charge would, after all, free the subject matter of the charge to swell the assets of the company for the benefit of the unsecured creditors.In our judgment, on the presentation of a winding-up petition, an unsecured creditor acquires sufficient interest in the subject matter of the unregistered charge so as to qualify as a “creditor” for the purposes of s 131(1).[emphasis added] 43     The holding inMichael Ng (CA)on the time at which the statutory trust arises is not consistent with the orthodox position that it is onlyupon the making of the winding up order(in a compulsory winding up) that the assets of the company are impressed with a statutory trust for the purpose of discharging the company’s liabilities (seeAyerst v C & K (Construction) Ltd[1976] AC 167 (“Ayerst”) at 179–180;Mitchell v Carter[1997] 1 BCLC 673 at 686;Cambridge Gas Transportation Corpn v Official Committee of Unsecured Creditors of Navigator Holdings plc and others[2007] 1 AC 508 at [14]).Ayerstis the leading modern authority on the statutory trust. There, Lord Diplock held that by virtue of the statutory trust that comes into existence on the making of a winding-up order, a company loses all custody and control of its property, and all powers of dealing with the company’s assets are transferred to the liquidator who is bound to act in accordance with the statutory scheme in the Act. Insofar asMichael Ng (CA)stands for the proposition that a statutory trust is impressed on the assets of the company on the presentation of a winding up application, we are of the view that this is incorrect. 44     The Court of Appeal inMichael Ng (CA)relied on a number of cases in coming to the view that an unsecured creditor qualifies as a “creditor” for the purposes of s 131(1) of the Act on the presentation of a winding-up application. These cases includedIn re Anglo-Oriental Carpet Manufacturing Company[1903] 1 Ch 914 (“Anglo-Oriental”),Ehrmann,In re Resinoid & Mica Products Ltd[1983] 1 Ch 132 (“Resinoid”),Ashpurton, andRegina v Registrar of Companies, ex parte Central Bank of India[1986] 1 QB 1114 (“Central Bank of India”). With respect, we are of the view that none of these cases support the proposition that an unsecured creditor acquires a beneficial interest in the unencumbered assets of the company, and, consequently,locus standito avoid an unregistered charge, on the presentation of a winding up application. These were cases involving voluntary winding up proceedings and the pronouncements therein must be seen in that context. In a voluntary winding up, the company is wound up and a statutory trust is imposed in favour of all creditors over the company’s assetsupon the passing of the winding up resolution. Section 291(6) of the Act states: Commencement of voluntary winding up (6)    A voluntary winding up shall commence — (a)    where a provisional liquidator has been appointed before the resolution for voluntary winding up was passed, at the time when the declaration referred to in subsection (1) was lodged with the Registrar; and (b)    in any other case, at the time of the passing of the resolution for voluntary winding up. 45     In contrast, in a compulsory winding up, the Act provides for two relevant dates: (1) the presentation of the winding up application and (2) the making of the winding up order. The Act states: Commencement of winding up 255.—(1)  Where before the making of a winding up application a resolution has been passed by the company for voluntary winding up, the winding up of the company shall be deemed to have commenced at the time of the passing of the resolution, and, unless the Court on proof of fraud or mistake thinks fit otherwise to direct, all proceedings taken in the voluntary winding up shall be deemed to have been validly taken. (2)    In any other case the winding up shall be deemed to have commenced at the time of the making of the application for the winding up. 46     We agree with the views expressed in “Unsecured Creditor Versus Unregistered Charge” (1998) 10 SAcLJ 241 by Lee Eng Beng (“Lee”) at p 243 where he said that: ... In a voluntary winding up, there is only one critical date: the date of the passing of the winding up resolution... In contrast, the initiation of compulsory winding up proceedings has two important stages: the presentation of the winding up petition and the making of the winding up order. While the former is statutorily deemed the commencement of compulsory winding up, it isthe latterwhich, in this context, bears a closer analogy to the winding up resolution in a voluntary winding up. ... the effect of a resolution for voluntary winding up being passed is, apart from procedural differences, the same as the making of a winding up order; it brings into operation the statutory scheme for dealing with the assets of the company. ... Apart from authority, the presentation of a winding up petition is, in nature, very different from the passing of a winding up resolution. The passing of a winding up resolution is a final act which places the company into voluntary winding up such a resolution cannot be revoked and rendered a nullityab initioand the only way to terminate the winding up proceedings is to apply to the court for a stay. The presentation of a winding up petition, on the other hand, is merely the first step in the invocation of the court’s winding up jurisdiction and does not constitute any adjudication of the petition. ... [emphasis in original] 47     Thus, inAnglo-Oriental, it was too late for a creditor to ask for an extension of time to register charges where resolutions to wind up the company had already been passed (seeAnglo-Orientalat 918).Resinoidwas also a case of voluntary winding up, and in that context, Lord Denning MR (at 133–134) noted that the court would not allow an extension of time to register a charge after the commencement of winding up because that would affect the rights of the parties accrued beforehand. Russell LJ held that “on the commencement of winding up all creditors of the company acquired rights in respect of the company’s property” (at 134), and the fact that a resolution to wind up the company had already been passed by the time the case was heard by the English Court of Appeal was, in Russell LJ’s view, sufficient to deny the creditor an extension of time to register the charge.AshpurtonandEhrmanndo not assist MDA either. Lord Brightman inAshpurton(at 123) said that the Preservation of Rights Proviso protected an unsecured creditor “if, but only if, the company has gone into liquidation before registration is effected” because it is only at that point that “the existing unsecured creditors are interested in all the assets of the company, since the liquidator is bound by statute to distribute the net proceedspari passuamong the unsecured creditors, subject to preferential debts”. 48     The court inEhrmannwas of a similar opinion. The plaintiff there had obtained an extension of time to register charges over the company’s assets subject to a proviso similar to the Preservation of Rights Proviso, and charges were registered before a resolution for voluntary winding up of the company was passed. The English Court of Appeal unanimously rejected Joyce J’s finding that the charges were void for want of registration. Lord Romer, in particular, emphasised that “in the absence of liquidation and the absence of something in the nature of a charge acquired upon the security comprised in the debentures, a creditor could not intervene as against any property of the company or as against the debenture-holders in any way whatever” (Ehrmannat 708). Although the court inAshpurtonand Lord Denning MR and Davies LJ inResinoidwere of the view that an extension of time to register a charge ought to be refused even where liquidation of the chargor was only imminent, it does not appear to us that this was premised on the unsecured creditors acquiring proprietary rights in the company’s assets before the company goes into liquidation. 49     As forCentral Bank of India, this case concerned an application for judicial review of the decision of the Registrar of Companies to accept the late registration of a charge after the presentation of a winding up application. After the charge was registered, the company applied for leave to bring an application for judicial review of the Registrar’s decision. An unsecured creditor also brought proceedings for judicial review after the winding up order was made. The judge at first instance quashed the registration of the charge. On appeal, the chargee argued that, as at the time the charges were registered, the unsecured creditor had nolocus standito apply for judicial review of the Registrar’s decision. Dillon LJ disagreed, and said (at 1161–1162): Whether the Central Bank [the unsecured creditor] had a locus standi to apply for judicial review under R.S.C., Ord. 53 depends, under rule 3(7), on whether it had a “sufficient interest” in the matter to which the application related. ... The reasoning, however, in the line of authorities referred to, which has led the courts to conclude that an unsecured creditor has no interest to object to the late registration of a registrable charge which has not been registered in time, has been that, despite the non-registration of the charge, it was always possible for the company to pay off the amount intended to be secured by the charge, or to grant the holder of the charge a confirmatory charge. That is so while the company is a going concern, but it ceases to be so when a winding up petition is presented. If a winding up order is made, the commencement of the winding up dates back to the presentation of the petition, and any disposition of the company's property made, otherwise than by a liquidator, after the commencement of the winding up, is void unless sanctioned by the court in the winding up proceedings: see section 227 of the Act of 1948. Moreover, on a winding up order being made, the statutory scheme for distribution of a company's assets among its creditors comes into operation. ... Realistically, in view of section 227, the scheme relates back to the commencement of winding up. I have no doubt at all, in the circumstances of the present case, that at all times after the presentation of the winding up petition the Central Bank [ie, the unsecured creditor] had a sufficient interest to give it a locus standi to apply for judicial review of the registrar's determination to register the Arab Bank’s charge and to issue a certificate of registration. The probability was that a winding up order would be made on the petition, with the consequences indicated in the previous paragraph. … [emphasis added] The English Court of Appeal inCentral Bank of Indiawas concerned with the issue of standing to apply for leave to bring judicial review proceedings. The court’s views on the unsecured creditor’s standing to apply for judicial review should not be taken to mean that an unsecured creditor is a “creditor” for the purposes of s 131(1) on the presentation of a winding up application, and insofar as Dillon LJ intended to suggest otherwise, we respectfully disagree with his views. 50     In the context of a compulsory winding up, it is onlyon the making of the winding up orderthat a statutory scheme is imposed to be administered by the liquidator for the benefit of unsecured creditors (see also,Power Knight Pte Ltd v Natural Fuel Pte Ltd (in compulsory liquidation) and others[2010] 3 SLR 82 (“Power Knight”) at [52]). To treat the presentation of a winding up application as having the same effect as the passing of a winding up resolution, with a statutory trust being impressed on the company’s assets as at that date, could give rise to “intolerable uncertainty and arbitrariness” to those who are irreversibly affected by the consequences of a winding up application that is eventually dismissed (Lee at p 244; see also Lee Eng Beng, “Insolvency Law” (2004) 5 SAL Ann Rev 302 at 14.14 and Tan Yock Lin, “Personal Property Security Interests in Singapore” inThe Reform of UK Personal Property Security Law: Comparative Perspectives(John de Lacy, ed) (London: Routledge Cavendish, 2010) pp 427–428). 51     We should add that the statutory trust does not confer beneficial or proprietary interests on the unsecured creditors. In Goode at para 3-010, the learned author stated: Ninth principle: no creditor has any interestin speciein the company’s assets or realisations The statutory trust upon which the company in winding up holds the assets and realisations is not of a kind which confers on the creditors beneficial co-ownership or, indeed, a proprietary interest of any kind in the assets or realisations until completion of the liquidation. Their rights are limited to invoking the protection of the court to ensure that the liquidator fulfils his statutory duties. Their position is analogous to that of residuary legatees in an unadministered estate. They have a right to compel performance of the executor’s duties but no interest in the assets comprising the estate until completion of the administration, pending which beneficial ownership of the assets is in suspense…. The company thus holds the assets for statutory purposes, not for persons. ... 52     Lord Diplock inAyerst(at 180) noted that all that was intended to be conveyed by the use of the expression “trust property” and “trust” in cases such asIn re Oriental Inland Steam Company(1874) 9 Ch App 557 at 560 was that “the effect of the statute was to give to the property of a company in liquidation that essential characteristic which distinguished trust property from other property, viz., that it could not be used or disposed of by the legal owner for his own benefit, but must be used or disposed of for the benefit of other persons”. The company is divested of beneficial interest in its assets (Andrew R Keay,McPherson’s Law of Company Liquidation(Sweet & Maxwell, 2nd Ed, 2009) (“Keay”) at para 7.006). The courts in those cases were not oblivious to the fact that the statutory scheme for dealing with the assets of the company on winding up differed in several aspects from a trust. The High Court inPower Knightdescribed the statutory trust as (at [51]): … a purpose trust, with the beneficial interest \"in suspense\". The company holds the legal title to its property on trust for the purposes of the statutory scheme administered by the liquidator. Since this scheme is intended to be for the benefit of the unsecured creditors, it may loosely be said that the statutory trust is “in favour of” the unsecured creditors. However, this is a misleading use of language, for it then becomes natural to regard the unsecured creditors as ordinary beneficiaries having beneficial interests in the company's assets, when in fact, during the course of the winding up, they have only a hope of obtaining such interests. In principle, therefore, I agree with the view that, notwithstanding that the making of a winding-up order brings into existence a statutory trust, unsecured creditors have no proprietary interests in a company's property:Mitchell v Carter[1997] 1 BCLC 681 (perMillett LJ at 686),Re Calgary and Edmonton Land Co Ltd (in liquidation)[1975] 1 WLR 355 (perMegarry J at 359),Re A Caveat, ex parte The Canowie Pastoral Company Limited[1931] SASR 502 (perAngas Parsons J at 505),Ayerst, Bulcher v Talbot(perLord Hoffmann at [28]), andCommissioner of Stamp Duties v Livingston([47]supra). We note that the High Court of Australia has declined to follow the English approach, and has instead held that the concept of a statutory trust does not exist (Commissioner of Taxation of the Commonwealth of Australia v Linter Textiles Australia Ltd (in liquidation)(2005) 220 CLR 592). The High Court of Australia preferred the view that, upon winding up, a company retains full legal and beneficial owner of its property, but is statutorily disabled from enjoying that ownership. 53     We agree with the description of the nature of the statutory trust inPower Knight(above, at [52]) and are of the view that an unsecured creditor cannot claim the standing to avoid an unregistered charge by virtue of the statutory trust. It is not necessary for us to decide whether the English or Australian approach is to be preferred because neither approach supports the proposition that the unsecured creditors have proprietary interests in the company’s assets on winding up or on presentation of a winding up application. Thus, we rejected MDA’s argument that it acquired an interest in RGPL’s assets which was protected by the Preservation of Rights proviso on the presentation of the CWU, and that the Judge made an inherently unworkable order. The Preservation of Rights Proviso only protects creditors with proprietary interests in the company’s assets (Ehrmannat 707; Gough at pp 771–772; McCormack at pp 225 and 231), and not an unsecured creditor in MDA’s position at the time the CWU was presented. Who would be the proper plaintiff to bring an action for avoidance of a charge for non-registration? 54     The parties did not deal with this point extensively but the treatises indicate that on the liquidation of the chargor, the proper plaintiff to bring proceedings to avoid a charge for non-registration is the liquidator (McCormack at para 6.17 citingRe Ayala Holdings Ltd[1993] BCLC 256 (“Ayala”)). This is consistent with the liquidator’s role as the officer responsible for the ascertainment of liabilities and realisation of assets in the winding up of the company (de Lacy at p 451). The liquidator is vested with wide powers to,inter alia, administer the assets of the company for the collective benefit of the unsecured creditors (see s 272 of the Act). It has been said that s 131(1) of the Act, by providing that registrable but unregistered charges are void against the liquidator on winding up, impliedly recognises the liquidator’s “agency” on behalf of all unsecured creditors “who might have been prejudiced by the undisclosed charge” and places the liquidator in the position to avoid it (de Lacy at p 451). 55     InAyala, an unregistered chargee bank recovered payment of monies due to it in full discharge of the chargor’s debt sometime between 30 September and 31 December 1989. The chargor was wound up in late November 1989. Mr Menzies, an unsecured creditor applied,inter alia, for a declaration that the bank’s failure to register the security made it void against the liquidator. The bank applied to strike out Mr Menzies’ application. Chadwick J agreed, holding that there was no statutory basis for an unsecured creditor to seek a declaration that the bank’s unregistered charge was void against the liquidator under s 395 of the Companies Act 1985 (c 6) (UK) (Ayalaat 261). The Court of Appeal inMichael Ng (CA)(at [33]) distinguishedAyalaon the basis that the case concerned an application for a declaration that a charge was void against the liquidator, rather than a declaration that the unregistered charge was void against the applicant as a creditor. With respect, this distinction may not be defensible in principle. The courts inAyalaandMichael Ng (CA)were both concerned, in essence, with the issue of the standing of an unsecured creditor to avoid an unregistered charge. 56     The lack of standing of an unsecured creditor to avoid a charge for want of registration is reflected, in a sense, in theex partenature of an application for an extension of time to register a charge. The courts may, as a matter of practice, allow unsecured creditors to be heard at a hearing for an application to extend time for the registration of a charge (see for example,Re Flinders Trading Co Pty Ltd(1978) 3 ACLR 218). However, this is pursuant to the court’s powers to have all relevant evidence put before it, arising from its discretion under s 137 of the Act to consider the solvency of the company regardless of whether winding up proceedings have commenced (see Tan Cheng Han in “Unregistered Charges and Unsecured Creditors” (1998) 114 LQR 565 at p 567). This practice does not amount to recognising that the unsecured creditors enjoy proprietary interests in the assets of the company.",
        "Did the Judge err in exercising his discretion to allow the Application despite finding that there was a real possibility that RGPL would be wound up?": "57     We turn now to MDA’s argument that in any event, the “well-established rule” is that the commencement of winding up is a factor militating against the grant of an extension of time to register a charge. 58     There is a division of judicial opinion as to whether the court should allow an application for an extension of time where winding up is imminent (such as where a winding up application has been filed, seeAshpurtonat 127), or even where a winding up order has been made. In earlier cases, the courts have held that if the facts merited a favourable exercise of the court’s discretion, the imminence of liquidation was irrelevant (In re MIG Trust Limited[1933] Ch 542 andKris Cruisers). Another approach taken by the courts was that the imminence of liquidation was a ground on which an application to extend time for registration of a charge ought to be refused (seeResinoidat 133–134). In addition, if the company has gone into liquidation, an order extending time would not ordinarily be made save in exceptional circumstances (seeAshpurtonat p 131). A third approach was to allow an application for an extension of time to register the charge, subject to provisos (such as the Preservations of Rights Proviso and the Winding Up Proviso) if liquidation was sufficiently imminent to protect the interests of both the applicant and the unsecured creditors. This third approach was adopted inIn re L H Charles & Company, Ltd[1935] WN 15 (“re Charles”) and endorsed by Hoffmann J inIn re Braemar Investments Ltd[1989] 1 Ch 54 at 60. 59     Whichever approach is preferred by the court, what is clear is that the court’s decision is a matter of discretion and not of law (Ashpurtonat 124; see alsoHewlett Packard Australia Pty Ltd v GE Capital Finance Pty Ltd[2003] FCAFC 256 at [192]). MDA has not shown that the Judge exercised his discretion wrongly. The Judge, in granting the extension of time to register the charge, subject to the Preservation of Rights of Proviso and the Winding Up Proviso, took an eminently sensible and practical approach. The Judge took into account factors that he ought to take into account and by his order, struck a balance in protecting the interests of the Applicant, as well as the general body of creditors. We did not see any reason to interfere with his decision. As a final observation, we note that the Liquidators were appointed by MDA and there was no indication that the Liquidators would act adversely to the interests of MDA. In the light of this, it was difficult to see how MDA would be prejudiced by the Judge’s order.",
        "Conclusion": "60     For these reasons, we dismissed the appeal with costs."
    }
}