{
    "case_title": "Koh Lau Keow and others\n      v\n      Attorney-General",
    "ncitation": "[2014] SGCA 18",
    "coram": "Sundaresh Menon CJ; \n      Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Introduction": "1       This\nappeal concerns a trust (“the Trust”) declared in a deed on 12 October\n1960 (“the Trust Deed”) by the first appellant, the plaintiff in\nthe action below, over a property at 10 Rangoon Lane (formerly 156E\nRangoon Road) (“the Property”). The action below,ie,\nOriginating Summons No 1021 of 2012 (“OS 1021/2012”), was instituted\nby the appellants for a declaration that the Trust is void and that\nthe first appellant (“Koh”) is the sole beneficial owner of the\nProperty. The application was opposed by the respondent in his capacity\nas the protector of charities, and it was dismissed by the High\nCourt judge (“the Judge”): see the report of the decision inKoh Lau Keow and others v Attorney-General[2013]\n4 SLR 491. The sole issue at the hearing before the High Court and\nin this appeal is whether the Trust created in the Trust Deed is\na valid charitable trust.",
        "Facts": "2       Koh,\npresently aged 96, was born in China and came to Singapore in 1936.\nSometime in 1948, she decided to purchase the Property to serve\nas a home for herself and three other women (whom she refers to\nas her “Aunts” although they were unrelated by blood). She paid\nthe entire purchase price of $3,500. However, in the conveyance\nof the Property to Koh, she added the Aunts, in addition to herself,\nas registered owners of the Property because she did not want them\nto become homeless should she pre-decease them. 3       Initially\nKoh built on the Property a small wooden structure, with a hall\nin the front portion and two rooms in the back portion. The hall\nwas used as a Buddhist temple for religious worship while the two\nrooms were used as living quarters by Koh and her Aunts. Later,\nin 1957, as the wooden structure had become badly in need of repair,\nKoh engaged a contractor to erect a concrete single-storey building\non the Property. In the agreement with the contractor, the building\nto be erected was described as a “Chinese nunnery”.[note: 1]The\nbuilding has since been renovated twice, in 1993 and 2009; the last\nrenovation saw the conversion of part of the kitchen into two additional\nbedrooms. 4       Soon\nafter purchasing the Property, Koh was advised by some devotees\nwho prayed at the Property that she could request for an exemption\nfrom the payment of rates on the basis that the Property was being\nused for religious purposes, that is, as a temple. Accordingly,\nshe engaged lawyers who corresponded on her behalf with the authorities\non the issue. It appears from the correspondence that the first\napplication for exemption was made in April 1948, and in relation\nto which the Municipal Assessor asked the following questions:[note: 2] (a)    Whether\nthe [P]roperty was vested under a Deed of Trust and, if so, the\nnames of the Trustees in whom the management of the building is\nvested? (b)    Particulars as to how funds for the\nupkeep of the Temple are derived? (c)    Whether the whole was used for public\nreligious worship and, if not, the number of persons dwelling therein,\nwith their occupations? (d)    Was any pecuniary profit derived from\nthe occupation of the [P]roperty, such as selling joss-sticks etc.? Koh’s lawyers did not reply to this query from the Municipal\nAssessor. In July 1949, Koh wrote to the Municipal Assessor again\nrequesting for exemption from rates. The Municipal Assessor replied\non 22 July 1949 repeating the questions which he had posed in the\nprevious letter. On 16 August 1949, Lim Boon Hian (one of Koh’s\nAunts) replied as follows (“the 16 August 1949 Letter”):[note: 3] … (a)The [P]roperty was not vested under a Deed of Trust but it\nwas owned by four female vegetarians viz: Koh Low Kiew, Chia Siang\nKim, Low Wee Lan; and Lim Boon Hian as joint tenants. (b)Earnings from needle work and sewing\nand charity from the worshippers, help us to up-keep the temple. (c)The front portion of the premises\nwas used for public religious worship and the back portions utilised\nby us for dwelling purposes. Our occupation is needle work and sewing. (d)No pecuniary gains are derived from\nthe occupation of the Temple. … 5       There\nis a substantial gap in the evidential record as to the further correspondence\nbetween Koh and the authorities on this issue. The next letter on\nrecord is dated 27 September 1960 from one Chan See Kan, Secretary\nof the Assessment Appeals Committee, informing Koh’s lawyers of\nthe following:[note: 4] … With reference to your application for\nexemption from payment of assessment on the above [P]roperty, I\nhave to inform you that the Assessment Appeals Committee, at its\nmeeting held on 17.8.60, agreed that No. 156E, Rangoon Road be exempted\nfrom the payment of rates with effect from 1.1.59 for so long as\nthe premises are used for religious purposes. … 6       Upon\nobtaining exemption from rates in respect of the Property, Koh was\nadvised by her lawyers that, in view of the 27 September 1960 letter,\nit would be helpful for evidential purposes to sign a document declaring\nthat the Property was being and would continue to be used for religious purposes.\nAccordingly, she and her Aunts executed the Trust Deed prepared\nby her lawyers. The relevant portions of the Trust Deed state: … WHEREAS [Koh and the Aunts] are seised\nfor an estate in fee simple as joint tenants in possession free\nfrom incumbrances of the land and premises described in the Schedule\nhereto and have for some time past permitted the said land and premises\nand the buildings erected thereon to be used occupied and enjoyed\nas a temple or place of public worship for persons professing the Buddhist\nfaith and as a home or sanctuary for Chinese women vegetarians of the\nBuddhist faith and as a place for practising promoting teaching\nand studying the doctrines principles and teachings of the Buddhist\nReligion. AND WHEREAS with the object of perpetuating\nsuch use occupation and enjoyment of the said land and premises\nand the buildings now and from time to time erected thereon for\nthe purposes aforesaid, [Koh and the Aunts] aredesirous\nof dedicating the same to charityand of settling the\nsame in manner hereinafter appearing. NOW THIS DEED WITNESS that for effectuating\nthe said desire and in consideration of the premises, [Koh and the\nAunts] … declare that they and the trustees for the time being of\nthis deed (hereinafter called “the trustees”) shall henceforth stand\nseised of ALL the land and premises described in the Schedule hereto\nupon the trusts and with and subject to the powers provisions agreements\nand declarations hereinafter declared and contained concerning the\nsame, that is to say:- (1)    The\ntrustees shall permit the said land and premises and the buildings now\nand from time to time erected thereon to be used in perpetuity under\nthe name of “Chee Teck Kwang Imm Tng” (hereinafter referred to as\n“the said Temple”) as and forall or any of\nthe following purposes, that is to say:- (a)As and for a temple or place of worship for persons of the Chinese\nrace professing the Buddhist faith. [“Purpose A”] (b)As and for a\nhome or sanctuary for such Chinese women vegetarians of the Buddhist\nfaith as may from time to time be chosen by the trustees of this\ndeed.[“Purpose B”] (c)As and for a place for practising\npromoting teaching and studying the doctrines principles and teachings\nof the Buddhist Religion. [“Purpose C”] … (4)The Chinese women vegetarians of the Buddhist faith\nwho may reside in the said Temple shall be such persons as the trustees\nmay from time to time in their absolute and uncontrolled discretion\nchooseand allow with liberty to the trustees from time\nto time and at all times at their absolute and uncontrolled discretion\nto expel without assigning any reason therefor any such person or persons. … [emphasis added] 7       Two\nof the Aunts passed away in April 1970 and April 1975 respectively.\nThe third and remaining Aunt retired as a trustee in June 1976 and\npassed away in April 1990.[note: 5]The\nsecond to sixth appellants were appointed as trustees between 1992\nand 2003 at the behest of Koh. The third and fourth appellants were\nadopted by Koh at birth. The second, fifth and sixth appellants\nwere close to Koh, who treated them as daughters. 8       Since\nits establishment, the following temple activities have been conducted\non the Property: (a)     mass\nworship sessions and celebrations four times a year (on the birthdays\nof the Goddess of Mercy in the second, sixth and ninth lunar month\nand on the Lunar New Year); (b)     daily\nprayer recitals in the morning and evening; (c)     ad\nhoc worship sessions by relatives, close friends and neighbours;\nand (d)     teaching\nof Buddhist doctrines to a few old and uneducated vegetarian women\n(but this was stopped since 1970). According to Koh, the Temple was never open to the public\nfor worship except for the aforementioned four times a year. In\nother words, the public did not have any access to the Property\nfor prayers except on these four occasions in a year. All along,\nshe only allowed a close group of relatives, friends and neighbours\n(initially numbering about 20 but currently numbering about 70 to\n80) to freely visit or use the temple. 9       The\nindividuals who have resided on the Property include Koh, her Aunts,\nher adopted daughters, her granddaughter, and one Ms Koh Chun, the\ndaughter of one of her relatives in China. Koh deposed that no one\nelse has lived on the Property besides these individuals. 10     At\nthis juncture we would pause to explain that with the enactment\nof the Property Tax Ordinance 1960 (No 72 of 1960), “rates” payable\nin respect of property had thereafter become known as “property\ntax”. In 2005, the Inland Revenue Authority of Singapore (“IRAS”)\nreviewed the property tax exemption for the Property and informed\nKoh that property tax on it was payable retrospectively from 1 January\n1999. 11     Due\nto her advanced age and limited physical mobility, Koh has been contemplating\nceasing all temple activities on the Property. Her adopted daughters\nare either unwilling or unable to continue maintaining the temple.\nWishing to terminate the Trust and make provisions for the Property\nin a will, Koh (together with the other trustees) filed OS 1021/2012 and\nthe decision of the Judge on that summons is the subject of the\npresent appeal.",
        "Proceedings below": "12     The\nappellants initially sought to impeach the Trust on two grounds. First,\nKoh claimed that she had no intention to give up beneficial ownership of\nthe Property absolutely when she executed the Trust Deed. Because\nshe and her aunts did not understand English, they did not read\nthe Trust Deed before signing it; neither did her lawyers explain\nto them that this would be the effect of the Trust. But at the hearing\nbefore the Judge, the appellants decided to abandon this ground.\nHence, the second and only ground relied on by the appellants at\nthe hearing below was that the Trust is not a valid charitable trust\nbecause the use of the Property “as and for a home or sanctuary\nfor such Chinese women vegetarians of the Buddhist faith as may from\ntime to time be chosen by the trustees of this deed” (ie, Purpose B) is not a valid charitable\npurpose. Accordingly, the Trust is void for violating the rule against\nperpetuities, and there is a resulting trust of the Property in favour\nof its original owners, of whom Koh is the only survivor. 13     On\nthe other hand, the respondent argued that Purpose B was charitable\nbecause it advanced religion. Significantly, he agreed in the proceedings\nbelow that Purpose B wasnotfor\nthe relief of poverty. 14     The\nJudge held that the Trust was a valid charitable trust and dismissed\nthe application. With respect to Purpose B, he found that the phrase\n“home and sanctuary” connotes “a religious institution where the defined\nclass of persons (of that religion) is looked after and finds refuge\nor sanctuary” (at [31]). In his judgment, the use of the Property\nfor this purpose directly advances religion, as the persons residing\nin the Property would have benefited from “passive advancement and\npersonal spiritual contemplation” (at [36]). Furthermore, despite\nthe respondent’s concession, the Judge found that Purpose B also\nhad the effect of relieving poverty, given that those who choose\nto reside in the Property (with the approval of the trustees) are\nlikely to be compelled by special circumstances such as orphanhood,\npoverty or dysfunctional family situations (at [47]).",
        "The parties’ arguments on appeal": "15     It\nis common ground that Purpose A and Purpose C advances the Buddhist\nreligion and are therefore charitable. But that is not sufficient\nto render the trust as a whole charitable unless Purpose B is also\na charitable purpose. Thus the proper construction of Purpose B\nis the bone of contention. The appellants submit that Purpose B\nis not charitable in nature. They aver that the Judge had erred\nin reading words into Purpose B that were not there – that is, that\nthe Buddhist Chinese female vegetarians who choose to reside in\nthe Property are likely to be compelled by special circumstances\nsuch as orphanhood, poverty or dysfunctional family situations.\nPurpose B, as drafted, is not restricted to such individuals and should\nnot have been found to relieve poverty. Furthermore, even if the Judge’s\ninterpretation of Purpose B were correct, the personal spiritual contemplation\nof the residents of the Property does not and could not advance\nreligion or confer a public benefit. 16     The\nrespondent contends that the Judge was correct in interpreting “home\nor sanctuary” exegetically to mean a place of refuge for persons\nwho need care or have no home of their own. Such a purpose advances\nreligion because activities relating to social welfare undertaken\nby religious bodies have been held to advance religion. The element\nof public benefit is also present because the category of “Chinese\nwomen vegetarians of the Buddhist faith” is capable of capturing\na sufficiently broad segment of the public. 17     As\nfor the relief of poverty, the respondent now adopts the Judge’s view\nthat Purpose B does relieve poverty as well. He contends that the intention\nto relieve poverty may be inferred from the very nature of the gift itself,\nand it is not necessary for Purpose B to expressly stipulate that\nthe Buddhist Chinese female vegetarians who reside in the Property\nmust be poor.",
        "Our decision": "18     The\nfollowing propositions are undisputed by the parties: (a)     The\nTrust must be a charitable trust to be valid. This is because (i)\nthe Trust is stated to be “in perpetuity” and would be void for offending\nthe rule against perpetuities (which does not apply to charitable\ntrusts); and (ii) the Trust is a purpose trust with no definite beneficiaries\nand is void unless charitable. (b)     Under\ncommon law, if the funds of a charitable trust may be used for some\nnon-charitable purpose, it will not be a valid charitable trust:\nsee Hubert Picarda,The Law and Practice Relating\nto Charities(Bloomsbury Professional, 4th Ed, 2010)\n(“Picarda”) at pp 329–330. For it\nto be a charitable trust, its objects must be wholly charitable: Peter\nLuxton,The Law of Charities(Oxford\nUniversity Press, 2001) at paras 6.01–6.03. The common law position\nhas since been modified by s 64(1) of the Trustees Act (Cap 337,\n2005 Rev Ed), which provides that no trust shall be invalidated\nby reason that its purposes include some non-charitable and invalid\npurpose as well as some charitable purpose. However, this provision\nis not relevant here because it does not apply to trusts declared\nbefore 14th July 1967. (c)     For\na purpose to be classified as charitable, it must fall within one\nof the four heads of charity enunciated by Lord Macnaghten inThe Commissioners for Special Purposes of the Income\nTax v John Frederick Pemsel[1891] 1 AC 531 (“Pemsel”) at 583: (i) trusts for the relief\nof poverty; (ii) trusts for the advancement of education; (iii) trusts\nfor the advancement of religion; and (iv) trusts for other purposes\nbeneficial to the community. (d)     Leaving\nPurpose B aside, the other purposes of the Trust (see [6] above)\nare charitable in nature because they advance religion. 19     Thus,\nthe only issue before us is whether Purpose B, on its true construction,\nis charitable because it falls within one of thePemselcategories.\nOnly two of Pemsel’s categories are relevant here: trust for the relief\nof poverty and trust for the advancement of religion.",
        "How should Purpose B be interpreted?": "20     For\nease of reference, we set out again the terms of Purpose B: As and for a home or sanctuary for such\nChinese women vegetarians of the Buddhist faith as may from time\nto time be chosen by the trustees of this deed. 21     It\nis trite that the principle of benignant construction applies to charitable\ngifts – in other words, where a bequest is capable of two constructions,\none of which would make it void, and the other would make it effectual,\nthe latter should be adopted:Tudor on Charities(Sweet\n& Maxwell, 9th Ed, 2003) (“Tudor”)\nat para 4-002. On the other hand, the court must not strain the\nwill to gain money for charity:Picardaat\np 354. 22     As\nmentioned at [14] above, the Judge’s interpretation of Purpose B hinged\non the meaning he ascribed to the phrase “home or sanctuary”. First,\nhe considered the dictionary definitions of “home” and “sanctuary” separately,\nas follows (at [25]–[26]): 25    TheShorter Oxford English Dictionary(Oxford\nUniversity Press, 6th ed, 2007) (Volume 2) has several definitions\nfor “sanctuary” (at p 2661), two of which are relevant to the language\nof Purpose B: 1A building\nor place set apart for the worship of a god or gods; a church; a\ntemple. Also (arch.), a church or\nbody of believers; a priestly office or order. … 5 aOrig.,\na church or order sacred place in which, by the law of the medieval\nchurch, a fugitive or debtor was immune from arrest. Latergen., any place in which a similar immunity\nis granted to a fugitive; a place of refuge and safety.bImmunity from arrest or punishment, secured\nby taking refuge in a sanctuary; the right or privilege of such protection;\nshelter, refuge.  26    TheShorter Oxford English Dictionary(ibid.) (Volume 1) also has several relevant\ndefinitions for “home” (at p 1266): … 2The place\nwhere one lives permanently, esp. as a member of a family or household;\na fixed place of residence. Freq. without article or possessive,\nesp. as representing the centre of family life. [“Definition 2”] … 4A place\nor region to which one naturally belongs or where one feels at ease.\nAlsospiritual home. … 6An institution\nlooking after people etc. who need care or have no home of their\nown. [“Definition 6”] … [emphasis in original] 23     He\nfound that the most apt definition for “home” was Definition 6 (“[a]n\ninstitution looking after peopleetcwho\nneed care or have no home of their own”), and the most apt definition\nfor “sanctuary” was “a place of refuge and safety”. He then held\nat [31] that because there was a sufficient overlap in the meaning\nbetween “home” and sanctuary”, the phrase “home or sanctuary” should\nbe interpreted exegetically and not conjunctively as true alternatives.\nIn other words, instead of applying Definition 2 of “home” as a\nplace of residence and construing it as an alternative use to which\nthe Property might be put (thereby rendering Purpose B not exclusively charitable),\nthe Judge read “home or sanctuary” as a phrase whereby “sanctuary”\nis a synonym thatexplainsthe true\nmeaning of the word “home”, which is not Definition 2 but Definition\n6. Thus, Purpose B does not allow the trustees to use the Property\nas a place of residence foranyBuddhist\nChinese female vegetarian but only those who are homeless or otherwise\nin need of care. 24     With\nrespect, we are unable to agree with the Judge’s interpretation\nof Purpose B as it is inconsistent with the express terms of the\nTrust Deed as well as the circumstances prevailing at the time the\nTrust Deed was executed. First, it is contradicted by cl 4, which\nconfers on the trustees the “absolute and uncontrolled discretion”\nto select the persons who may reside in the Property. Equally significant\nis the fact that the Trust Deed nowhere states that only destitute\nor needy persons would be allowed to reside in the Property. Indeed\nthis omission is completely in line with the intention as expressed\nin cl 4. Second, the Judge’s interpretation is inconsistent with\nthe circumstances surrounding the execution of the Trust Deed. The uncontroverted\nevidence indicates that Koh had never meant to restrict the class\nof persons who could reside on the Property toneedyBuddhist Chinese\nfemale vegetarians. Before the Trust was declared, Koh stayed on the\nProperty together with her Aunts, and this did not change even after\nthe Trust was declared. Beside Koh and her Aunts, the only people\nwho had ever stayed on the Property were her relatives, and there\nis no evidence that these individuals were homeless or in need of\ncare. In short, the Property was at all times used as a private\nresidence rather than as an institution or place of refuge for needy\nindividuals. Given this factual matrix, we do not think it was justified\nfor the Judge to infer and conclude that the Buddhist Chinese female\nvegetarians who choose to reside in the Property (with the approval\nof the trustees) are likely to be compelled by unfortunate circumstances\nsuch as poverty or family dysfunction to live there. 25     We\nnote that the respondent has contended that the intentions of the settlor\nshould be inferred from the Trust Deed as a whole, and that the actual\nuse of the Property as a private residence by Koh and the trustees should\nbe regarded as a breach of trust instead of causing the trust to\nfail.[note: 6]But this is plainly a circular\nargument, as whether or not there has been a breach of trust depends\non how this Court should construe Purpose B. We further reject the\nproposition that extrinsic evidence should be ignored when interpreting\na trust deed. While purely subjective and uncorroborated evidence\nby a settlor as to his intentions at the time the trust deed was drafted\nis inadmissible (Tudorat para 4-004),objectiveevidence of the settlor’s intent\nis highly relevant in construing a trust deed, especially in cases\nwhere its language is ambiguous. As stated inPicarda(at\np 358): Naturally the contemporaneous acts of the\ndonor are of particular importance for the purpose of construing\na deed of gift executed by him. Evidence is also admissible of the\nearly application or distribution of the fund, and of the construction\nplaced on doubtful questions which arose in the early administration\nof the trust. Likewise,Tudorstates (at\npara 4-008): The contemporaneous acts and condition\nof a donor are of the greatest possible importance for the purpose\nof construing a deed of gift executed by him … So also the manner\nin which the donor of the fund, if he was the first trustee, conducted\nhimself in distributing it, the contemporaneous application of the\nfunds, and contemporaneous deeds relating to the same charity, are\nof importance. Given that the word “home” in Purpose B is capable of multiple\nmeanings, including Definition 2 (a fixed place of residence) and\nDefinition 6 (an institution looking after people who need care\nor have no home of their own), it is important to consider the contemporaneous\nevidence to ascertain Koh’s intent when the Trust Deed was drafted. 26     As\nwe have noted, Koh’s use of the Property both before and after the Trust\nwas executed demonstrates that she had intended to use it as a private residence\nand not as a home for the needy. This is corroborated by the 16 August\n1949 Letter, which stated that the back portion of the Property\nwas used for “dwelling purposes” by the owners (see [4] above).\nAs this letter was written in support of a request for property\ntax exemption, one would expect that if Koh and her Aunts had indeed\nmeant to use the Property as a home for the needy, they would have\nput this fact front and centre. Instead, their letter made it clear\nthat half of the Property was being used as a temple and the other\nhalf as a private residence. There is also no evidence that this intention\nhad changed by the time the Trust Deed was executed – on the contrary,\nthis intention persisted as Koh has been living in the Property with\nher relatives from 1960 till today. Thus, if the respondent’s contentions were\naccepted, it would mean that Koh had set up the Trust with the intention\nof breaching it from the very outset – a rather strange proposition or\noutcome indeed. 27     In\nendorsing the Judge’s interpretation of “home”, the respondent also\ncites the case ofIn re Isabel Joanna James[1932]\n2 Ch 25 (“Re James”), in which Farwell\nJ held that a trust to provide a “Home of Rest for the sisters of\nthe Home of the Community of the Epiphany at Truro, the Clergy of\nthe Diocese of Truro, and such persons as the Mother Superior for\nthe time being of the said Home of the Community of the Epiphany\nat Truro shall from time to time nominate and appoint” was charitable.\nHe stated (at 30–33): Prima facie at any rate, I think, a gift\nof a fund or property for the purpose of founding and endowing a\nHome of Rest is a charitable object. … It may be that to provide\na Home of Rest for a particular class of persons, who could not\nbe in any sense described as in need of such a home, would not be charitable;\nbutprima facie in my judgment the words “Home\nof Rest” themselves indicate something in the nature of a hospital,\nalthough not strictly a hospital, that is to say, a home which is\nto provide relief for those who are in need of it, not by means\nof medicine or medical attendance, but by providing them with the\nmeans and possibility of rest, and that is in my view in a true sense\nproviding for the impotent, and accordingly to provide a Home of\nRest is, in my judgment, prima facie a good charitable object.If\nthat be so, if the provision of a Home of Rest is prima facie a\ngood charitable object, then it does not necessarily follow that\nthe gift will fail because some of the uses to which the Home may\nbe put might, upon a right construction of the language of the will,\nbe uses which would not be strictly charitable. … In the present case, looking at the terms\nof this will, the object is to establish a Home of Rest, and the\npersons for whose benefit that Home of Rest is to be provided are,\nfirstly, the Sisters of the Home of the Epiphany at Truro. That\nis an association of ladies for the purpose of doing charitable\nwork. I do not think that it is necessary for me to consider exactly\nwhat is the position of these ladies,except\nto say that from the evidence it appears that under the rulesthe ladies who enter the community give up their\nprivate means, and are themselves, therefore, without means.The lady who desired to found this Home\nof Rest was anxious that among the persons who might benefit from such\na home should be those ladies who carry on what is I think clearly\na charitable work. Then there are the clergy, who are to have the\nadvantage of the Home.The clergy of the diocese\nare clearly persons who are carrying on charitable work. But when one comes to the words “such persons\nas the Mother Superior for the time being of the said Home of the\nCommunity of the Epiphany at Truro shall from time to time nominate\nand appoint,” they would indicate that the Mother Superior, who\nis not a trustee, would have the widest possible discretion to appoint\nanybody she pleased, irrespective of their means or any question\nof that kind. I think that the words bear that meaning, but,in my judgment, when one reads the clause as a whole\nthe duty of the Mother Superior (not because she is the Mother Superior\nof this particular Home, or in any way owing to her position in\nthe Home, but owing to the fact that the object of the trust is\ncharitable) isto nominate only\nsuch persons as are properly suitable to a Home of Rest as a charity, and if she were to nominate persons who were unsuitable\nfor such a purpose, it would, in my judgment, be the duty of the\ntrustees to refuse such nomination. It is for the trustees\nto see that the Home of Rest is used and carried on as a charity,\nand, in my judgment,the power of the Mother\nSuperior to nominate persons must be limited to that overriding\npurpose, and only such persons as are suitable for the Home can\nbe properly nominated and appointed by her. [emphasis added in italics and bold italics] In our view, however,Re Jamesis\ndistinguishable from our case. In the first place, the use of initial\ncapital letters in “Home of Rest” indicates that the phrase was\nmeant as a specialised term and did not simply refer to a private residence.\nSecond, Farwell J was influenced by the fact that the named beneficiaries\nsuch as the Sisters and the clergy were either without means themselves\nor carrying on charitable work, and it would therefore be charitable\nto provide them with a home. No such assumption can be made of “Chinese\nwomen vegetarians of the Buddhist faith” – these women need not\nnecessarily be poor or destitute (see for example the case ofIn re Sanders’ Will Trusts[1954] 1 Ch\n265 where a trust to provide dwellings for the “working classes”\nwas held not to be a trust to relieve poverty since “working classes”\ndid not necessarily mean to relieve the poor). Third, there was\nno evidence of contrary intent on the part of the testator inRe James, whereas in our case there is\nevidence that the donor of the Property – Koh – had regarded the\nProperty as a private residence and had administered the Trust as\nsuch from the very beginning. Fourth, the wording of the clause\ninRe Jamesallowed Farwell J to\nhold that the Mother Superior’s seemingly broad discretion to nominate\npersons to reside in the Home of Rest was in fact restricted; this\nis not possible in our case as cl 4 of the Trust Deed expressly\ngives the trustees the absolute unfettered discretion to decide whom\nthey wish to permit to reside at the Property. 28     What,\nthen, is the effect of the phrase “or sanctuary”? Reading Purpose\nB in context, the word “sanctuary” was probably used for its religious\nconnotations. It is clear from the Trust Deed as a whole and the surrounding\ncircumstances that Koh had meant to use the Property as a place\nto conduct Buddhist worship; indeed, as mentioned at [3] above,\nthe Property was described as a “Chinese nunnery” in Koh’s 1957\nrenovation agreement. Consequently, the phrase “home or sanctuary”\nis more likely to mean a residence for religious individuals who\nwould practise their faith in the course of their stay. 29     We\ntherefore find that Purpose B does not require the trustees to allow\nonly homeless or needy people to stay on the Property, and cannot\nbe said to be charitable on the basis that it relieves poverty.",
        "Does Purpose B advance religion?": "30     The\nnext question is: does Purpose B advance religion because the individuals\nliving on the Property would likely benefit from passive advancement\nand personal spiritual contemplation? 31     In\nholding that it does, the Judge at [33] relied on a report by the Charity\nCommission for England and Wales,The Advancement\nof Religion for the Public Benefit(December 2008, as\namended December 2011) (“English Charity Commission\nReport”), which stated that religion could be advanced\nin two ways: (i) seeking new followers or adherents, and (ii) encouraging\nand facilitating religious practice by existing followers or adherents\n(at p 24). One example of the second way is “‘passive advancement’,\nmeaning leaving religious buildings open for people to enter and\nbenefit from personal spiritual contemplation and the provision\nof property for retreat” (at pp 24–25). 32     But\nit is trite law that for a trust that purports to advance religion\nto be considered charitable, there must be a sufficient element\nof public benefit (Picardaat pp\n111–113). InIn re White[1893]\n2 Ch 41 (“Re White”), Jenkin LJ\nsaid (at 51): “A society for the promotion of private prayer and\ndevotion by its own members, and which has no wider scope, no public\nelement, no purposes of general utility, would be a ‘religious’\nsociety, but not a ‘charitable’ one.” As theEnglish\nCharity Commission Reportitself notes (at p 21): … a fundamental part of the public benefit\nrequirement is that the benefits that are identified must be sufficiently\navailable or accessible to the public.So where\nthe practices of the organisation advancing religion areessentially private or limited to a private group\nof individuals, this requirement\nwould not be met. [emphasis added in italics and bold italics] 33     There\nis a long line of authority stating that gifts in favour of individuals\nconducting private religious worship do not satisfy the public benefit\nrequirement. We have already referred toRe\nWhite. It suffices to cite four more such cases here. 34     InCocks v Manners(1871) LR 12 Eq 574 (“Cocks v Manners”), the testatrix bequeathed\nher property to,inter alia, two\ninstitutions. The first was a Dominican convent consisting of Roman\nCatholic females living together by mutual agreement in a state\nof celibacy, under a common superior, for the purpose of sanctifying\ntheir own souls by prayer and pious contemplation. The second was\nthe Sisters of Charity of St Paul, an institution composed of Roman\nCatholic women living together by mutual consent, whose primary\nobject was personal sanctification, and who, as a means thereto,\nemployed themselves in the exercise of works of piety and charity\nin teaching the poor and nursing the sick. Sir John Vickens VC held that\nthe Sisters of Charity was a charitable institution because of their\nsocial work, but not the Dominican convent (at 584–585): … The community of sisters at Selley Oak\nis, in point of law, a voluntary association for the purposes of\nteaching the ignorant and nursing the sick; and I cannot distinguish\nit in this respect from any of the numerous voluntary associations\nestablished in London, such as the Scripture Readers, Home Missionaries,\nor Anglican Sisters of Mercy, in which zealous persons unite for\nthe purpose of performing charitable functions, taking out of the funds\nof the association so much as is necessary for their own wants,\nand extending their operations as their means permit. … As regards the Dominican convent the case\nis a little different, and more difficult. … A voluntary association\nof women for the purpose of working out their own salvation by religious\nexercises and self-denial seems to me to have none of the requisites\nof a charitable institution, whether the word “charitable” is used\nin its popular sense or in its legal sense.It\nis said, in some of the cases, that religious purposes are charitable,\nbut that can only be true as to religious services tending directly\nor indirectly towards the instruction or the edification of the\npublic;an annuity to an individual, so long as he spent\nhis time in retirement and constant devotion, would not be charitable,\nnor would a gift to ten persons, so long as they lived together\nin retirement and performed acts of devotion, be charitable. Therefore\nthe gift to the Dominican convent is not, in my opinion, a gift\non a charitable trust. [emphasis added] 35Cocks v Mannerswas cited with approval\nby the House of Lords inGilmour v Coats and\nothers[1949] 1 AC 426. The latter case concerned a trust\nin favour of a priory consisting of cloistered nuns who devoted\ntheir lives to prayer, contemplation, penance and self-sanctification\nwithin their convent and engaged in no exterior works. The court\nheld that the purposes of the priory were not charitable because\nthe element of public benefit was absent. In particular, Lord Simonds\nrejected the argument that intercessory prayer by the nuns or edification\nby example could constitute benefit to the public (at 446–447): My Lords, I would speak with all respect\nand reverence of those who spend their lives in cloistered piety,\nand in this House of Lords Spiritual and Temporal, which daily commences\nits proceedings with intercessory prayers, how can I deny that the\nDivine Being may in His wisdom think fit to answer them? But, my\nLords, whether I affirm or deny, whether I believe or disbelieve,\nwhat has that to do with the proof which the court demands that\na particular purpose satisfies the test of benefit to the community?\nHere is something which is manifestly not susceptible of proof.\nBut, then it is said, this is a matter not of proof but of belief:\nfor the value of intercessory prayer is a tenet of the Catholic\nfaith, therefore in such prayer there is benefit to the community.\nBut it is just at this “therefore” that I must pause. It is, no\ndoubt, true that the advancement of religion is, generally speaking,\none of the heads of charity. But it does not follow from this that\nthe court must accept as proved whatever a particular church believes.The faithful must embrace their faith believing where\nthey cannot prove: the court can act only on proof. A gift to two\nor ten or a hundred cloistered nuns in the belief that their prayers\nwill benefit the world at large does not from that belief alone\nderive validity any more than does the belief of any other donor\nfor any other purpose. … I turn to the second of the alleged elements\nof public benefit, edification by example. And I think that this\nargument can be dealt with very shortly.It\nis in my opinion sufficient to say that this is something too vague\nand intangible to satisfy the prescribed test. The test of public\nbenefit has, I think, been developed in the last two centuries.\nTo-day it is beyond doubt that that element must be present. No\ncourt would be rash enough to attempt to define precisely or exhaustively\nwhat its content must be.But it would assume a burden\nwhich it could not discharge if now for the first time it admitted\ninto the category of public benefit something so indirect, remote,\nimponderable and, I would add, controversial as the benefit which\nmay be derived by others from the example of pious lives. [emphasis added] 36     Next\nis the case ofIn re Warre’s Will Trusts[1953]\n1 WLR 725 (“ReWarre’s”),\nwhere the testatrix gave the residue of her estate to be held on trust\nfor,inter alia, the provision and\nupkeep of “a retreat house”. Harman J held that such a purpose was\nnot charitable (at 728–729): The testatrix proposed secondly what she\ncalled a retreat house; this phrase is explained as meaning a house\ndevoted to a form of religious activity or inactivity which is known\nas a “retreat,” and that is a well understood form of religious\nexperience in the Church of England. It is a retirement from the activities\nof the world for a space of time for religious contemplation and\nthe cleansing of the soul. No doubt that it is a highly beneficial\nactivity for the person who undertakes it, but it is not an activity,\nwhich for the reasons so often set out in English law is a charitable\nactivity. … … Activities which do\nnot in any way affect the public or any section of it are not charitable.Pious contemplation and prayer are no doubt good\nfor the soul, and may be of benefit by some intercessory process,\nof which the law takes no notice, but they are not (legally speaking)\ncharitable activities.… [emphasis added] The respondent points out thatRe Warre’shas\nbeen criticised byTudorandPicardaas being wrongly decided.[note: 7]The\nauthors of those textbooks argue that there is public benefit in\na diocesan retreat house because it is open to any member of the\nChurch of England, and individual retreatants return to the outside\nworld after their short stay to mingle with their fellow citizens.[note: 8]As\nargued byPicarda(at p 128): … There is surely a material difference\nbetween a closed religious community consisting of private individuals\nworking out their own salvation in private and a retreat house to\nwhich members of the public resort for only a very limited period\nof time and possibly only once. … But this argument, even if accepted, would not apply to the\npresent case where the clear intent of Purpose B was to create a\nlong term residence for individuals selected by the trustees, and\nnot a temporary religious retreat that any Buddhist Chinese female\nvegetarian can resort to. And while we accept that some mingling\nbetween the residents and the public might occur when the Property\nis open to the public four times a year for the public to participate\nin the religious activities, such sporadic interaction and participation\nis simply insufficient to change the essentially private character\nof Purpose B. In any event, we would underscore the fact that the terms\nof the Trust, in particular Purpose B, do not require the trustees\nto open the Property and allow the public to reside therein temporarily\nfor the purposes of a retreat. It was because of this aspect of\npublic participation in retreats inRe Warre’sthat\nacademic writers viewed that case as being wrongly decided. 37     Last,\nbut not least, there is the local case ofRe\nChionh Ke Hu, Deceased[1964] MLJ 270, where the executors\nof a will were directed to distribute some shares to “such persons\nprofessing or practising the Buddhist religion” as the executors\nin their absolute discretion thought fit. The High Court found that\nthe trust did not advance the Buddhist faith as there was no element\nof public benefit, and held that it was not a charitable trust. 38     Therefore,\neven if Purpose B can be said to advance religion in the sense that\nthe women selected to live on the Property would benefit from “passive\nadvancement”, we find that it does not benefit the public. 39     Before\nleaving this issue, we would also like to address briefly the appellants’\nargument that Purpose B does not satisfy the public benefit requirement\nbecause the category of “Chinese women vegetarians of the Buddhist\nfaith” is too small. In this regard, the appellants rely onInland Revenue Commissioners v Baddeley and others[1955]\n1 AC 572, where Viscount Simonds apparently said inobiterthat\na charitable trust might fail the public benefit test if it restricted\naccess to something of general utility only to a selected body of\npublic. But it is clear on a reading of Viscount Simonds’ remarks\nthat he was referring to thefourthhead\nof charity,viz, other purposes\nbeneficial to the community. This is plain from the following extracts\n(at 590–592): … as I have said elsewhere, it is possible\n…that a different degree of public benefit\nis requisite according to the class in which the charity is said\nto fall.But it is said that if a charity falls within\nthefourth class, it must be for\nthe benefit of the whole community or at least of all the inhabitants\nof a sufficient area. … … It is, however, in my opinion, particularly\nimportantin cases falling within the fourth\ncategoryto keep firmly in mind the necessity of the\nelement of general public utility, and I would not relax this rule.\nFor here is a slippery slope. In the case under appeal the intended\nbeneficiaries are a class within a class; they are those of the\ninhabitants of a particular area who are members of a particular\nchurch: the area is comparatively large and populous and the members\nmay be numerous. But, if this trust is charitable for them, does\nit cease to be charitable as the area narrows down and the numbers\ndiminish? … … … Somewhat different considerations arise\nif the form, which the purporting charity takes, is something of\ngeneral utility which is nevertheless made available not to the\nwhole public but only to a selected body of the public—an important\nclass of the public it may be. For example, a bridge which is available\nfor all the public may undoubtedly be a charity and it is indifferent how\nmany people use it.But confine its use to\na selected number of persons, however numerous and important: it\nis then clearly not a charity. It is not of general public utility:\nfor it does not serve the public purpose which its nature qualifies\nit to serve. Bearing this distinction in mind, though\nI am well aware that in its application it may often be very difficult\nto draw the line between public and private purposes, I should in\nthe present case conclude thata trust cannot qualify\nas a charity within the fourth classin [Pemsel]\nif the beneficiaries are a class of persons not only confined to\na particular area but selected from within it by reference to a\nparticular creed. … [emphasis added] Thus, the fact that Purpose B is restricted to Buddhist Chinese\nfemale vegetarians does notipso factostrip\nit of public benefit. As we have found, the real reason why the\nTrust fails the public benefit requirement is that Purpose B only\nbenefits the handful of Buddhist Chinese vegetarian women, who need\nnot be poor, chosen in the absolute discretion of the trustees to\nlive on the Property. Those women were, in fact, simply Koh’s close\nfriends and relatives.",
        "Is Purpose B merely ancillary\nto the other charitable purposes of the Trust?": "40     The\nJudge held in the alternative that even if Purpose B, read alone, does\nnot strictly constitute the advancement of religion, it is merely ancillary\nto the overriding charitable intention of the Trust to advance religion\nand therefore would not render the Trust non-charitable. In defence\nof the Judge’s holding, the respondent referred us to certain authorities. 41     InPresbyterian Church (New South Wales) Property Trust\nv Ryde Municipal Council[1978] 2 NSWLR 387 (“Presbyterian Church”), the New South Wales\nCourt of Appeal had to consider whether a trust of land in favour\nof the Presbyterian Church of Australia in New South Wales was charitable.\nIt was found that the land had to be used for the purposes of the Presbyterian\nChurch, which was primarily the advancement of religion but also\nincluded other purposes which were non-charitable in nature. The\nland was in fact used to build a home for the aged. Nonetheless,\nthe court held that the trust was charitable because it was for\nthe advancement of religion. Glass JA explained (at 393): … the Presbyterian Church is an organization\nwhose main purpose is the advancement of religion, although it doubtless\nhas incidental and ancillary purposes of a non-charitable kind.\nIf a body holds property on trust for purposes of that kind it is\nproper to describe it as a public charity. What was said by the\nHigh Court inThistlethwayte’scase\n[(1952) 87 CLR 375 at 442] respecting the Congregational Union applies\nwith equal force, in my opinion, to the Trust: “We are concerned\nwith the question whether a particular corporate body is a charitable\ninstitution. Such a body is a charity even if some of its incidental\nand ancillary objects, considered independently, are non-charitable.\nThe main object of the Union is predominantly the advancement of\nreligion …an institution is a charitable institution\nif its main purpose is charitable although it may have other purposes\nwhich are merely concomitant and incidental to that purpose.\nThe fundamental purpose of the Union is the advancement of religion.\nIt can create, maintain and improve educational, religious and philanthropic\nagencies only to the extent to which such agencies are conducive\nto the achievement of this purpose.” [emphasis added] Mahoney JA similarly held as follows (at 408): In my opinion, it is proper to recognize\nthat,where a gift is made to a church or equivalent\nbody as such, the gift may be upheld as for the advancement of religion,\nnotwithstanding that the church has purposes which extend beyond the\npurposes which are, in the conventional formulation as\nset out in such cases as theKeren Kayemethcase\n[[1931] 2 KB 465]. There is, in my opinion, a proper basis for recognizing\nthat, where what is involved is a church, such a body has necessarily\na direct connection with, or influence on, the advancement of religion\nin the relevant sense, so that it should be recognized as charitable,\neven though its property may be applied to some purposes which,\nwere they purposes of bodies of a different kind, would not be seen\nas charitable purposes. [emphasis added] 42     InNeville Estates Ltd v Madden and others[1962]\n1 Ch 832 (“Neville Estates”), the\nissue was whether a trust of land to a synagogue was charitable.\nThe trust deed included a clause authorising the trustees of the synagogue\nto establish,inter alia, halls\nfor religious and social purposes, pursuant to which the synagogue\nhad erected a communal hall near the synagogue building in which\nsocial functions were held. Cross J held that this did not render\nthe trust non-charitable because the social activities were merely\nancillary to the religious activities (at 851–852): The chief purposes which a synagogue exists\nto achieve are the holding of religious services and the giving\nof religious instruction to the younger members of the congregation.\nBut just as today church activity overflows from the church itself\nto the parochial hall, with its whist drives, dances and bazaars,\nso many synagogues today organise social activities among the members.\n… The plaintiffs … argue that the trust in this case is open to\nthe objections which proved fatal to the trust for the foundation\nof a community centre which came before the court inInland Revenue Commissioners v. Baddeley.\nBut in my judgment there is a great difference between that case and\nthis.Here the social activities are merely\nancillary to the strictly religious activities. … [emphasis\nadded] 43     We\nagree that a trust in favour of a religious entity like a church\nor a synagogue would generally be charitable despite the fact that\nthe entity also engages in ancillary activities which are not in\nand of themselves charitable. But we do not think that this principle\napplies here. Unlike the trusts inPresbyterian\nChurchandNeville Estates,\nthe Trust in the present case is not a trust in favour of an established\nreligious entity whose primary purpose was the advancement of religion.\nInstead, it is a trust allowing the trustees to use the Property\nforall or anyof three listed purposes,\nincluding Purpose B. The trustees are hence free to use the Propertyonlyfor Purpose B,viz,\nas a residence for Buddhist Chinese female vegetarians selected\nin their sole discretion. This is the vital aspect of the Trust\nDeed which makes all the difference. 44     The\nJudge was alive to this difficulty. He sought to overcome it at [37]–[38]\nby relying on the preamble to the Trust Deed, which states that the\nsettlors were “desirous of dedicating [the Property] to charity”,\nand cl 1, which states that the Property shall be used for the listed\npurposes under the name “Chee Teck Kwang Imm Tng” (ie,\nChee Teck Guan Yin Temple) (see [6] above). Such language, he held,\nallowed him to construe Purpose B as being ancillary to the “overriding\ncharitable intention” of the Trust to advance religion. But it is\ntrite law that an unequivocal statement of a general charitable\nintention on the part of the settlor is insufficient to render a\ntrust charitable if, on its true construction, its purposes are\nin fact not exclusively charitable:In re Sanders’\nWill Trusts[1954] 1 Ch 265 at 273. And the mere fact\nthat the Property is to be named “Chee Teck Kwang Imm Tng” cannot\noverride the express words of cl 1, which state that the trustees may\nuse the Property for “all or any” of the listed purposes, thereby\ngiving them the discretionnotto\nuse it as a temple at all despite its name. It thus cannot be said\nthat the overriding object of the Trust is to advance religion, with\nPurpose B being merely ancillary to that purpose. 45     Moreover,Picardastates (at 333–334) that if a\nnon-charitable activity or benefit is an independent object of the\ntrust (ie, it is an end in itself\nand not merely the means to or consequence of some other charitable\nend), then the trust is not exclusively charitable. The leading\ncase cited byPicardafor this proposition\nisOxford Group v Inland Revenue Commissioners[1949]\n2 All ER 537 (“Oxford Group”). In\nthat case, the appellant company sought exemption from income tax\non the ground that it was a body of persons established for charitable\npurposes only. The appellant’s memorandum of association set out\nits objects as follows: (3) The objects for which the association\nis established are: (A) The advancement of the Christian religion,\nand, in particular, by the means and in accordance with the principles\nof the Oxford Group Movement, founded in or about the year 1921\nby Frank Nathan Daniel Buchman. (B) The maintenance, support, development\nand assistance of the Oxford Group Movement in every way, and, in\nparticular, (subject to the provisions of s. 14 of the Companies\nAct, 1929), by holding, administering and dealing with property,\nincluding all or any of the property which at the date of the incorporation\nof the association was held by trustees or nominees for the Oxford\nGroup Movement. (C) The exercise of all or any of the following\npowers: … (9). To establish and support or aid in\nthe establishment and support of any charitable or benevolent associations\nor institutions, and to subscribe or guarantee money for charitable or\nbenevolent purposes in any way connected with the purposes of the\nassociation or calculated to further its objects. (10). To do all such other things as are\nincidental, or the association may think conducive, to the attainment\nof the above objects or any of them. Tucker LJ noted that it was common ground between parties\nthat the “main objects” of the appellant were expressed in cll 3(A)\nand 3(B), and held that although cl 3(A) was clearly charitable,\ncl 3(B) was not exclusively so (at 539–540). But more pertinent\nfor present purposes was Cohen LJ’s reasoning. He held that although\ncl 3(C) was not a main object, paras (9) and (10) thereof conferred\nwide powers on the trustees to engage in non-charitable activities,\nand thus could not be construed as being merely ancillary to the\nmain objects expressed in cll 3(A) and (B) (at 544–546): Counsel for the appellants … said that\nwhere, as here, you have got no such provision … making each sub-clause\nof the objects clause a separate and independent main object, you\nmust, when you have found the main object, construe the remainder\nas ancillary thereto. Now, that may be true if you get no guidance\nfrom the various clauses themselves, but I think counsel for the Crown\nwas right when he said that,although sub-cl.\n(C) is expressed to be only a collection of powers, the extent to\nwhich they must be construed as subsidiary to the main objects under\nsub-cll. (A) and (B) is defined in the sub-clauses themselves. When I turn to para. (9) of sub-cl. (C)\nI find, first of all, that this paragraph authorises the establishment\nand support of benevolent associations or institutions and the subscription\nof money for benevolent purposes.Prima faciethis\nis not a charitable object, but it is said that the benevolent purposes must\nbe connected with the purposes of the association and calculated\nto further its objects, and that, therefore, althoughprima facienon-charitable, it is ancillary\nto a charitable object and thus itself charitable. … I feel, however, a\ndifficulty in reaching a similar conclusion here, for the power\ngiven to apply money for benevolent purposes is not confined to\nbenevolent purposes which further the advancement of religion, but\nto benevolent purposes in any way connected with the main object.\nI think an institution could be connected with the advancement of\nreligion without being itself an institution for the advancement\nof religion. Then, again, under para. (10) of sub-cl.\n(C), the association is empowered to do, not merely things which\nare incidental or conducive to the attainment of the main object,\nbut also such things as the association may think conducive to it.\nIn other words, the question which the court would have to decide,\nif any activity of the association was being challenged as beingultra vires, would be not whether, in\nthe opinion of the court, the activity was conducive to the main\nobject, but whether the association, in undertaking it, had thought\nit conducive. … … … I am unable to hold that such wide powers\nas are given in paras. (9) and (10) of sub-cl. (C) are merely ancillary\nto the main objects specified in sub-cll. (A) and (B). For these\nreasons I would dismiss the appeal. [emphasis added in bold italics] 46     In\nour view, Cohen LJ’s reasoning inOxford Groupapplies\nto the present case. Even if it could be said that the main object\nof the Trust is the settlors’ overriding charitable intention to\nadvance religion, the language of Purpose B confers wide powers\non the trustees to decide who could reside on the Property without\nany qualification that the individuals selected must be destitute\nor must contribute in some way to the running of the temple or otherwise\ndo anything to advance religion. Purpose B therefore must be construed\nas an independent object of the Trust, and, because it is not a charitable\npurpose, it renders the Trust void.",
        "The property tax issue": "47     As\nmentioned at [10] above, IRAS had reviewed the property tax exemption\nfor the Property in 2005 and determined that property tax was payable\nretrospectively from 1 January 1999. But under s 6(6)(c) of the Property\nTax Act (Cap 254, 2005 Rev Ed) (“PTA”), a building is entitled to be\nexempted from property tax if it is used exclusively for charitable purposes.\nAs there seemed to be an inconsistency in the position of the State\nin levying tax on the Property on the one hand and maintaining before us\nthat the Trust is entirely charitable on the other, we invited the respondent\nto file further written submissions on this point. 48     Having\nmade inquiries with IRAS, the respondent conveyed the following\ninformation to us: (a)     IRAS\ndid not have the Trust Deed in its file records. It made the decision\nto levy tax on the Property based on (i) a form signed by Koh stating\nthat the Property was only used as a Buddhist temple by friends\nand relatives and was not open to the public, and (ii) a site inspection. (b)     Property\ntax was only payable with effect from 1999 because of s 21(7) of\nthe PTA as at October 2005, which stated that tax shall not be payable\nin respect of a property for more than six years prior to the property’s\ninclusion for the first time in a Valuation List for any year. (c)     If\nit is proved to the satisfaction of the Comptroller that any tax has\nbeen paid in excess of the amount with which any property is properly\nchargeable, the owner of the property shall be entitled to have\nthe amount so paid in excess refunded, provided that the claim for\nrefund is made within five years of such excess payment: ss 6(13) and\n6(14) of the PTA. By way of example, if a valid refund claim is made\nby Koh in January 2014, IRAS may refund property tax from January\n2009 onwards. 49     We\nrecord these facts here purely for the sake of completeness, as\nwe do not think that our decision – which is based on a construction\nof the Trust Deed and the application of trust law – is affected\nin any way by this additional information.",
        "Conclusion": "50     For\nthe foregoing reasons, we hold that the Trust is not a valid charitable\ntrust. We therefore allow the appeal and declare that: (a)     the\nTrust is void; and (b)     Koh\nis the sole beneficial owner of the Property.  [note: 1]2 CB 43 & 54. [note: 2]2 CB 75. [note: 3]2 CB 76. [note: 4]2 CB\n77. [note: 5]Koh’s\nAffidavit dated 19 March 2013 at para 13. [note: 6]RC at\nparas 32–35. [note: 7]RC at para 55. [note: 8]Picardaat\n128;Tudorat para 2-068."
    }
}