{
    "case_title": "Au Wai Pang\n      v\n      Attorney-General and another matter",
    "ncitation": "[2014] SGCA 23",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       Originating Summons No 1175 of 2013\n                    (“OS 1175/2013”) is anex parteapplication by the Attorney-General (“the AGC”) under O 57\n                    r 16(3) of the Rules of Court (Cap 322, R 5, 2006 Rev Ed)\n                    (“ROC”) for leave to apply for an order of committal against Au\n                    Wai Pang (“Alex Au”) for contempt of court in respect of an\n                    article published on his blog. Originating Summons No 59 of 2014\n                    (“OS 59/2014”) is an application by Alex Au to appear in and\n                    contest OS 1175/2013.",
        "Procedural background": "2       In an earlier application to the High Court\n                    (Originating Summons No 1098 of 2013, hereinafter\n                    “OS 1098/2013”), the AGC sought leave to apply for an order\n                    of committal against Alex Au for contempt of court in respect of two articles\n                    published on his blog: (a)     “377 wheels come off Supreme\n                        Court’s best-laid plans”, published on 5 October 2013\n                        (“the first article”); (b)     “Church sacks employee and sues government —\n                        on one ground right, on another wrong”, published on 12 October\n                        2013 (“the second article”). 3       On 25 November 2013 at around 10.30pm, Alex\n                    Au received word through the media that the AGC intended to apply to the High\n                    Court judge (“the Judge”) on the morning of 26 November 2013\n                    for leave to initiate committal proceedings against him. The following morning,\n                    counsel for Alex Au sought leave to convert OS 1098/2013 into aninter parteshearing. OS 1098/2013 was adjourned to\n                    27 November 2013 for further submissions on whether this should be done.\n                    The request to convert OS 1098/2013 into aninter\n                        parteshearing was denied by the Judge during the\n                    27 November hearing. She nevertheless allowed Alex Au’s counsel to\n                    hold a watching brief for him in chambers. The Judge also granted leave to the\n                    AGC to apply for an order of committal against Alex Au in respect of the first\n                    article, but not the second. 4       O 57 r 16(3) of the ROC stipulates\n                    that, in the event of a refusal of anex parteapplication by the High Court, an application for a similar purpose may be made\n                    to the Court of Appeal within seven days after the date of refusal. The AGC\n                    attempted to electronically file the application on 6 December 2013 (the\n                    seventh day after the date of refusal), but this filing was rejected by the\n                    Supreme Court registry on 9 December 2013 because of an error in the title\n                    of a document. 5       After correcting this error, the AGC re-filed\n                    the application on 9 December 2013 under a different case number, namely,\n                    OS 1175/2013. On 12 December 2013, the AGC appeared before the Duty\n                    Registrar to fix two summonses before the Duty Judge. The first summons was for\n                    the hearing of OS 1175/2013 to be expedited; the second summons was for the\n                    AGC to be granted an extension of time until 9 December 2013 to file\n                    OS 1175/2013. We note from the minutes of the proceedings that counsel for\n                    the AGC informed the Duty Registrar that s 36(1) of the Supreme Court of\n                    Judicature Act (Cap 322, 2007 Rev Ed) (“the SCJA”) empowered\n                    a single judge to hear an application for extension of time to file an\n                    originating summons before the Court of Appeal. The AGC also invoked O 57\n                    r 16(3) of the ROC and relied on observations made in the Court of Appeal\n                    decision ofDorsey James Michael v World Sport Group Pte\n                        Ltd[2013] 3 SLR 354 (“Michael\n                        Dorsey”) for the proposition that the application in\n                    OS 1175/2013 was not an appeal, and was in fact a “renewal\n                    application”. The Duty Registrar fixed the two summonses before the Duty\n                    Judge, and in doing so observed that the Duty Judge could decide whether he had\n                    jurisdiction and whether it was proper to hear the application for an extension\n                    of time. 6       Counsel for the AGC appeared before the Duty\n                    Judge on 13 December 2013, whereupon he granted orders in terms for both\n                    the application to expedite and the application for extension of time.\n                    Unfortunately, the available minutes make no reference to the submissions made\n                    to him or his reasons for allowing the applications. 7       OS 59/2014 was filed by Alex Au on\n                    17 January 2014. 8       This court heard OS 1175/2013 and\n                    OS 59/2014 on 28 February 2014. We were however concerned with two\n                    issues, which we drew to counsel’s attention in the course of the\n                    hearing: (a)     whether the Duty Judge had the power\n                        to sit as the Court of Appeal and grant an extension of time;\n                    and (b)     whether the\n                        Court of Appeal has the jurisdiction to grant leave to commence committal\n                        proceedings for contempt of court.",
        "Did the Duty Judge have the power to grant an extension of\n                time?": "9       Section 36(1) of the SCJA\n                    (“s 36(1)”) is the governing provision on this particular\n                    issue. It reads: Inanyproceeding\n                            pendingbefore the Court of Appeal, any direction incidental\n                        thereto not involving the decision of theappeal,any interim order to prevent\n                            prejudice to the claims of parties pending the appeal, and\n                        any order for security for costs and for the dismissalofan appealfor default in\n                        furnishing security so ordered, may at any time be made by a Judge.\n                        [emphasis added in italics and bold italics] 10     The definition of the word\n                    “pending” has been considered by numerous Singaporean and\n                    Malaysian cases, all of which speak with one voice. In the Federation of Malaya\n                    Court of Appeal decision ofK Sockalinga Mudaliar v S\n                        Eliathamby & Anor[1952] MLJ 77, Thomson J\n                    commented (at 78) that “pending” is derived from the Latin wordpendere, which literally translates as\n                    “to hang”, and quotedStroud’s Judicial\n                        Dictionary(2nd ed) at p 1445: A legal proceeding is “pending” as soon\n                            as commenced... and until it is concluded, i.e. so long as\n                        the Court having original cognizance of it can make an order on the matters\n                        in issue, or to be dealt with, therein. [emphasis added] 11     The Singapore High Court decision ofGoh Teng Hoon and others v Choi Hon Ching[1985-1986]\n                    SLR(R) 869 (at [7]) and the Singapore Court of Appeal decision ofBank of India v Rai Bahadur Singh and another[1993]\n                    2 SLR(R) 1 (“Bank of India”)\n                    (at [14]) cited the same passage with approval. The definition inStroud’s Judicial Dictionaryappears to have\n                    stemmed from the seminal English Court of Appeal decision ofIn re Clagett’s Estate; Fordham v Clagett(1882)\n                    20 Ch D 637, where Jessel MR held that a cause is said to be pending\n                    in a court when any proceeding can be taken in it. 12     More specifically, no orders can be made if\n                    proceedings have not been already validly commenced. This proposition emerges\n                    from the English Court of Appeal decision ofSugden and\n                        others v Lord St Leonards and others(1876) 1 PD 154,\n                    wherein Mellish LJ observed, in the course of argument, as follows (at\n                    209): We have held in several cases that, till an appeal is brought, there is\n                        nothing pending in the Court of Appeal. The Annual Practice 1923is also\n                        instructive in this regard (at p 2081): Until an appeal is brought there is nothing\n                            “pending” before the C. A. A single judge has no\n                            jurisdiction hereunder until an appeal has been presented.The proper course seems to be in the first place to serve a notice of\n                        appeal, which will be for a day in vacation, or so soon thereafter, &c.\n                        and then to write to a member of the C. A. asking if and when it will be\n                        convenient to him to hear an application under the section. [case references\n                        omitted and emphasis added] 13     We agree with the settled approach adopted in\n                    the authorities enumerated above. The test for whether proceedings are\n                    “pending” is whether the court concerned has the power to make an\n                    order on the matters in issue therein. An application for an extension of timeto fileOS 1175/2013 must be predicated,\n                    however, on the implicit assumption that the originating summons wasnot filedwithin the stipulated timeline. As\n                    OS 1175/2013 was not validly commenced in the first place, there is nothing\n                    before this court; consequently, this court does not have the power to make an\n                    order on the matters in issue. OS 1175/2013 therefore cannot be said to be\n                    “pending” before this court. 14     Plainly, until and unless proceedings have\n                    been validly commenced, proceedings cannot be said to be “pending”\n                    before this court. An application for an extension of time to file\n                    OS 1175/2013 must be predicated on the admission that OS 1175/2013 hasnotbeenregularly\n                        filedin the first place. It follows that the Duty Judge, as a\n                    single Judge, did not have the same power as the Court of Appeal to grant an\n                    extension of time. 15     Further, the word “proceeding”\n                    in s 36(1) is also qualified by the clauses following it. The word\n                    “appeal” is mentioned another three times in s 36(1) itself;\n                    a single judge has the power to make ordersonlyin the following three types of situations: (a)     an incidental direction not\n                        involving the decision of the appeal; (b)     an interim order to prevent injustice to the claims of\n                        parties pending the appeal; or (c)     an order for security of costs and for the dismissal of\n                        an appeal for default in furnishing security so ordered. It is therefore axiomatic that s 36(1) does not envisage a\n                        single judge having the power to sit as the Court of Appeal if anappealhas not been validly commenced. We shall\n                        elaborate on this point later (at [18]–[25]). 16     In this regard, the instant facts are\n                    eminently distinguishable from those in theBank of\n                        Indiacase, where Judith Prakash JC (as she then was),\n                    sitting as a single judge of the Court of Appeal pursuant to s 36(1),\n                    permitted an application to effect service of the appellant’s record of\n                    appeal out of time. Proceedings in that particular matter had been validly\n                    commenced: the notice of appeal and record of appeal had been regularly filed.\n                    The applicant was merely seeking to regularise theserviceof the record of appeal. This is quite unlike the case\n                    before this court, where OS 1175/2013 had not even gotten off the ground in\n                    the first place. 17     In the course of argument the AGC, without\n                    reference to any authority, urged this court to adopt a purposive approach as\n                    mandated by s 9A of the Interpretation Act (Cap 1, 2002 Rev Ed).\n                    Unfortunately, in our view, this does not assist the AGC. Let us\n                    elaborate. 18     Section 36(1) has a long lineage. Its\n                    oldest predecessor is s 52 of the UK Supreme Court of Judicature Act 1873\n                    (c 66) (UK) (“the 1873 UK Act”), which reads as\n                    follows: In any cause or matter pending before the Court of Appeal, any direction\n                        incidental thereto, not involving the decision of the appeal, may be given\n                        by a single judge of the Court of Appeal; and a single Judge of the Court of\n                        Appealmay at any time during vacationmake\n                        any interim order to prevent prejudice to the claims of any parties pending\n                        an appeal as he may think fit; but every such order made by a single judge\n                        may be discharged or varied by the Court of Appeal or a Divisional Court\n                        thereof. [emphasis added in bold italics] 19     Section 26(1) of the Courts Ordinance\n                    1934 (No 17 of 1934; s 27(1) in Cap 10, Laws of the Straits\n                    Settlements, 1936 Rev Ed (“1936 Rev Ed”))\n                    (“s 26(1)”) was the first piece ofSingaporeanlegislation which allowed a single Judge to sit as\n                    the Court of Appeal. It reads as follows: In any cause or matter pending before the Court of Appeal any direction\n                        incidental thereto, not involving the decision of the appeal, and anyinterimorder to prevent prejudice to the\n                        claims of the parties pending the appeal may,if the\n                            Court of Appeal is not sitting, be made by a single Judge.\n                        [emphasis added in bold italics; emphasis in original in italics] The marginal note to s 26(1) read as\n                    follows: Interimorders may be made by single Judge\n                        when Court of Appeal not sitting. [emphasis in original] It appears that s 26(1) (s 27(1) in the 1936 Rev Ed)\n                        was originally promulgated out of the necessity to enable urgent\n                        applications to be made to a single judge outside of a Court of Appeal\n                        sitting. 20     Section 29(1) of the Courts Ordinance\n                    1955 (No 14 of 1955; Cap 3, Laws of the Colony of Singapore, 1955 Rev\n                    Ed) stated that: In any proceeding pending before the Court of Appeal any direction\n                        incidental thereto not involving the decision of the appeal, any interim\n                        order to prevent prejudice to the claims of parties pending the appeal, and\n                        any order for security for costs, and for dismissal of an appeal for default\n                        in furnishing security so ordered, may be made by a Judge. As can be seen, the prerequisite of the Court of Appeal not\n                        sitting was removed; a single judge could make the mentioned directions\n                        and/or orders at any time. 21     Singapore merged with the states in the\n                    Federation of Malaya, as well as with British North Borneo (now Sabah) and\n                    Sarawak to form Malaysia in 1963. The Federal Court assumed the role of the\n                    former Court of Appeal. Section 44(1) of the (Malaysian) Courts of\n                    Judicature Act 1964 (Act No 7 of 1964) (“the Malaysian Courts of\n                    Judicature Act”) provided as follows: In any proceeding pending before the Federal Court any direction\n                        incidental thereto not involving the decision of the proceeding, any interim\n                        order to prevent prejudice to the claims of parties pending the hearing of\n                        the proceeding, any order for security for costs, and for the dismissal of a\n                        proceeding for default in furnishing security so orderedmay at any timebe made by a Judge of the Federal Court.\n                        [emphasis added in bold italics] 22     The Supreme Court of Judicature Act\n                    (Cap 15, 1970 Rev Ed) was promulgated by Act 24 of 1969 after\n                    Singapore became an independent nation state in 1965, and restored thestatus quo anteby re-establishing the Court of Appeal\n                    and Court of Criminal Appeal. Section 36(1) of the same has remained\n                    unchanged to this day (see above at [9]). Section 36(1) followed the lead\n                    of s 44(1) of the Malaysian Courts of Judicature Act and explicitly added\n                    the phrase “may at any time”. This made it clear beyond any doubt\n                    whatsoever the removal of the prerequisite that the Court of Appeal must not be\n                    sitting for a single judge to make the directions and/or orders listed in\n                    s 36(1). 23     Interestingly, England only removed the\n                    prerequisite of the (English) Court of Appeal not sitting in 1982 with\n                    amendments to the then Rules of the Supreme Court. In the Practice Note\n                    accompanying the amendments (reported at [1982] 1 WLR 1312), Sir John\n                    Donaldson MR had this to say about the move (at 1316B–C): The single judge of the Court of\n                            Appeal In the past a court consisting of at least two judges has had to consider\n                        incidental applications, such as those for leave to appeal, for the\n                        imposition or removal of orders staying execution or for the grant,\n                        variation or discharge of injunctions pending appeal.This represented an extravagant use of judicial timeand\n                        rule 10 (9) will now enable all these matters to be considered and\n                        disposed of by a single judge sitting in chambers. All such applications\n                        will be made by motion: rule 14 (1). [emphasis added in bold italics] Clearly, s 36(1) was intended to avoid burdening a\n                        three-judge court with applications which could be more expeditiously\n                        disposed of by a single judge. 24     The common thread throughout all the statutes\n                    cited above is the fact that a single judge may makeinterimorders aimed at preventing prejudice or preserving thestatus quo. Administrative efficiency is\n                    ultimately justified by the fact that the interim orders made arenot dispositive of the substantive appeal. This is\n                    plainly evident from s 36(3) of the SCJA, which states that “[e]very\n                    order so made may be discharged or varied by the Court of Appeal.” There\n                    is nothing to discharge or vary if the single judge refuses to grant an\n                    extension of time. If an extension of time is not granted, this would be\n                    dispositive of the appeal and conclusively settle the respective legal\n                    entitlements of the parties, who would be bound by the judgment below. An\n                    application for an extension of time to file an originating summons is therefore\n                    manifestly not the type of case which was intended to be heard by a single\n                    judge. 25     The purposive interpretation of s 36(1)\n                    suggested by the AGC (ironically) fortifies our earlier conclusion that the\n                    AGC’s application for an extension of time did not fall within the meaning\n                    of a “proceeding pending”. In any case, this court has severe\n                    doubts over whether a purposive interpretation can be used to construe a statute\n                    in a way that cannot be supported by the language within. 26     In response to our observations on the\n                    historical basis of s 36(1), the AGC made an oral application for an\n                    extension of time to file OS 1175/2013. For reasons that follow, we did not\n                    rule on the oral application because it was moot.",
        "Does the Court of Appeal have the jurisdiction to grant leave to\n                commence committal proceedings for contempt of court?": "27     Before embarking on an analysis of this issue,\n                    it would be helpful to first set out the statutory framework pertaining to the\n                    jurisdiction of the Court of Appeal. InRe Nalpon Zero\n                        Geraldo Mario[2013] 3 SLR 258 (“Zero Nalpon”) at [14], this court emphatically reiterated\n                    that the Court of Appeal, being a creature of statute, can only be seized of\n                    jurisdiction that is conferred by statute. 28     Section 3 of the SCJA reads as\n                    follows: Divisions and jurisdiction of\n                            Supreme Court 3.The Supreme Court shall be a superior court of record and\n                        shall consist of — (a)    the High Court,\n                                which shall exercise original and appellate civil and criminal\n                                jurisdiction; and (b)    the Court of\n                                Appeal, which shall exerciseappellatecivil and criminal jurisdiction. [emphasis added] 29     Section 29A of the SCJA\n                    (“s 29A”) provides as follows: Jurisdiction of Court of\n                            Appeal 29A.—(1) The civil jurisdiction of the\n                        Court of Appealshall consist of appealsfrom\n                        any judgment or order of the High Court in any civil cause or matter whether\n                        made in the exercise of its original or of its appellate jurisdiction,subject nevertheless to the provisions of this Act\n                            or any other written law regulating the terms and conditions upon which\n                            such appeals may be brought. (2)    The criminal\n                            jurisdiction of the Court of Appealshall consist of\n                                appealsagainst any decision made by the High Court in\n                            the exercise of its original criminal jurisdiction,subject nevertheless to the provisions of this Act or any other\n                                written law regulating the terms and conditions upon which such\n                                appeals may be\n                            brought. (3)For the purposes of and incidentalto\n                            — (a)    thehearing and determination of any appealto\n                                the Court of Appeal; and (b)    the amendment,\n                                execution and enforcement of any judgment or ordermade on such an appeal, the Court of Appeal shall have all the authority and jurisdiction of the\n                        court or tribunalfrom which the appealwas\n                        brought. (4)    The Court of Appeal shall, for the purposes of and\n                            subject to the provisions of this Act, have full power to determine any\n                            question necessary to be determined for the purpose of doing justice in\n                            any case before the Court. [emphasis added in bold italics] 30     It is evident thatnoneof the provisions in the SCJA confersoriginaljurisdiction on the Court of Appeal. In this regard,\n                    the omission of “original” in s 3(b) of the SCJA is telling. 31     To recapitulate, the AGC relied on O 57\n                    r 16(3) of the ROC to apply for leave to commence committal proceedings.\n                    O 57 r 16(3) stipulates that: Where an ex parte application has been refused by the Court below, an\n                        application for a similar purpose may be made to the Court of Appeal ex\n                        parte within 7 days after the date of the refusal. 32     When we raised the issue of this court’s\n                    jurisdiction with counsel for the AGC, the AGC responded with two submissions.\n                    First, the plain words of O 57 r 16(3) are wide enough to allow an\n                    application to be made in this manner; and, secondly, an application under\n                    O 57 r 16(3) was in fact an appeal.",
        "The plain reading argument": "33     The first submission is, with respect, plainly\n                    untenable. As a matter of hierarchy, the Rules of Court issubsidiarylegislation that is, by its very nature, subordinate\n                    to its parent act, the SCJA, and must thus be read in harmony with the\n                    same. 34     This is made clear by s 80(1) of the\n                    SCJA, which states that: The Rules Committee constituted under subsection (3) may make Rules\n                        of Courtregulating and prescribing the procedure\n                            (including the method of pleading) and the practiceto be\n                        followed in the High Court and the Court of Appeal respectively in all\n                        causes and matters whatsoeverin or with respect to which\n                            those courts respectivelyhave for the\n                            time being jurisdiction(including the procedure and practice\n                        to be followed in the Registry of the Supreme Court) and any matters\n                        incidental to or relating to any such procedure or practice. [emphasis added\n                        in italics and bold italics] Section 80(1) of the SCJA makes it clear that the Rules\n                        of Court regulate procedure and practice. The Rules of Court do not, and\n                        cannot, confer jurisdiction on the Court of Appeal by a side wind. O 57\n                        r 16(3) presupposes that the court has already been validly seized of\n                        jurisdiction. 35     We would like to add that the proviso to\n                    s 29A(1) of the SCJA (“s 29A(1)”) , which reads\n                    “subject nevertheless to the provisions of this Act or any other written\n                    law regulating the terms and conditions upon which such appeals may be\n                    brought”, does not assist the AGC. “Subject” is an\n                    adjective that expresses the notion that a clause is qualified by the clause\n                    that follows it.The Oxford English Dictionary, Volume\n                        XVII(2nd ed, Clarendon Press, Oxford, 1989) defines\n                    “subject” as (at p 31): Dependent upon a certain correcting or modifying condition; conditional\n                        upon; resting upon the assumption of. Freq.advb., conditionally upon, with the assumption of. A correcting or modifying condition, as a practical linguistic\n                        fact, implies a change that does not completely alter the thing in question.\n                        A simple illustration will suffice. Whilst it is theoretically possible to\n                        utter the statement that “I have an apple, subject to the fact that\n                        it may be an orange”, such a statement would be nonsensical and would\n                        not convey any meaning to the recipient of the statement. Applying the same\n                        reasoning to s 29A(1), the proviso cannot be read as saying that the\n                        other provisions of the SCJA or any other written law may confer\n                        non-appellate jurisdiction on the Court of Appeal. Such a reading would\n                        constitute a contradiction in terms. 36     Section 7(1) of the SCJA also does not\n                    assist the AGC as it is a power-conferring and not a jurisdiction-conferring\n                    provision (for an explanation of the power-jurisdiction dichotomy, seeZero Nalponat [30]–[32]). 37     Pertinently, the Court of Appeal (and its\n                    predecessor courts) wasneverconferred anyoriginaljurisdiction. The predecessors to\n                    s 29A did not confer any original jurisdiction to the earlier incarnations\n                    of the Court of Appeal (including the Court of Criminal Appeal). These\n                    predecessor provisions are listed below: StatuteAppellate Criminal\n                                        JurisdictionAppellate Civil\n                                    JurisdictionCourt’s Ordinance 1873\n                                            (Ordinance No V of 1873)s 83s 83Courts Ordinance 1878\n                                            (Ordinance No III of 1878)s 66s 66Courts Ordinance 1907\n                                            (Ordinance No XXX of 1907)s 13s 11Courts Ordinance 1934\n                                            (No 17 of 1934) (Cap 10, Laws of the Straits\n                                            Settlements, 1936 Rev Ed (“1936 Rev\n                                            Ed’))–s 19 (s 20 in the\n                                            1936 Rev Ed)Court of Criminal Appeal\n                                            Ordinance 1931 (No 5 of 1931) (Cap 11, Laws of\n                                            the Straits Settlements, 1936 Rev\n                                    Ed)s 5–Courts Ordinance 1955\n                                            (No 14 of 1955) (Cap 3, Laws of the Colony of\n                                            Singapore, 1955 Rev Ed)–s 22Courts of Judicature Act 1964\n                                            (No 7 of 1964) (Malaysia)s 50s 67Supreme Court of Judicature\n                                            Act 1969 (No 24 of 1969) (Cap 15, 1970 Rev Ed;\n                                            subsequently Cap 322, 1985 Rev\n                                    Ed)s 44s 29   The only exception was s 45 of the Malaysian\n                        Courts of Judicature Act, which conferred original jurisdiction on the\n                        Federal Court for certain limited purposes (as listed in Art 128 of the\n                        Federal Constitution of Malaysia). This exception pertained to federal\n                        matters and therefore need not detain us here. 38     Further, in the context of contempt\n                    proceedings, O 52 r 2(2) of the ROC explicitly states that an\n                    application for leave to commence committal proceedings is to be made to a\n                    Judge. O 52 r 1(3) provides that where contempt of court is committed\n                    otherwise than in connection with any proceedings, an order of committal may be\n                    madeonlyby the High Court. We would like to\n                    point out that, assumingarguendothat the Court\n                    of Appeal has theoriginaljurisdiction to grant\n                    leave and does grant leave, it would be highly anomalous for the Court of Appeal\n                    to then remit the committal application to the High Court as sought by the AGC\n                    in the subject application. Ordinarily, the court granting leave would proceed\n                    to hear the substantive application. However, our attention was not drawn to any\n                    instance in any common law jurisdiction where an appellant court heard contempt\n                    proceedingsde novo. It would be extremely odd for\n                    an appellate court to hear ade novoapplication,\n                    and in this respect we cite the following comment by Sir John\n                    Donaldson MR with approval (in the English decision ofR\n                        v Bolton Justices, ex parte Graeme(1986) 150 JP 190\n                        (“Ex parte Graeme”)): … it would be very peculiar indeed if this court was to exercise an\n                        original jurisdiction to give leave to proceed by judicial review in\n                        circumstances in which any consequent decision was unappealable to this\n                        court. 39     Drawing the threads together, the inexorable\n                    conclusion is that the Court of Appeal doesnothave the original jurisdiction to grant leave to commence committal\n                    proceedings. 40     We would also like to take this opportunity to\n                    clarify certain remarks made inMichael Dorsey(at\n                    [95] and [96]) which the AGC had referred to when queried by the Duty Registrar\n                    on the jurisdictional basis of the application (see above at [5]): 95    However, there appears to be one apparently\n                            anomalous exception to the propositions we have set out at [93] and [94]\n                            above, namely where anex parteapplication is refused at first instance. In that case, under O 57\n                            r 16(3) of the Rules of Court, the applicant can renew the\n                            application before the Court of Appeal within seven days after the date\n                            of hearing. 96    Strictly speaking, an application to the Court of\n                            Appeal in these circumstances is not an appeal. In substance, however,\n                            it means that a party making anex parteapplication is entitled to two tiers of hearings including one before\n                            the Court of Appeal as of right. If, on the other hand, an interlocutory\n                            order is made on an interlocutory application that is heardinter partes, the default position under the\n                            Fourth and Fifth Schedule to the SCJA is that leave of the High Court\n                            judge is required before an appeal can be brought to the Court of\n                            Appeal. 41     The remarks are of general application and do\n                    not apply to particular situations akin to the present where the very\n                    jurisdiction of the court is in doubt. [95] and [96] ofMichael Dorseymust be read in context. In this regard, [97] ofMichael Dorseystates as follows: Asex parteapplications are virtually\n                        always interlocutory in nature, it is anomalous that a party making an\n                        applicationex parteis able to renew the\n                        application before the Court of Appeal while a party making an applicationinter partesis not. Should leave be\n                        refused by the High Court judge, that would be the end of the matter as the\n                        aggrieved party would then have no avenue to obtain leave from the Court of\n                        Appeal.In our judgment, legislative intervention would\n                            be desirable in this regard. … [emphasis added] The point of referring to O 57 r 16(3) was to call\n                        attention to the potential anomaly betweenex\n                            parteandinter partesapplications, and how applicants inex parteapplications would potentially enjoy an advantage because leave may not be\n                        required for a renewed application before the Court of Appeal. The remarks\n                        did not need to consider, and did not in fact consider, the issue of how\n                        O 57 r 16(3) interfaced with the concept of\n                    jurisdiction.",
        "The appellate jurisdiction argument": "42     The second prong relied upon by the AGC was\n                    the argument that O 57 r 16(3) was an invocation of the Court of\n                    Appeal’s appellate jurisdiction. 43     The AGC relied on two cases in this regard. InKemper Reinsurance Co v Minister of Finance and\n                        others[2000] 1 AC 1 (“Kemper\n                        Reinsurance”), the appellant appealed against a decision\n                    of the Court of Appeal of Bermuda whereupon it held that it did not have the\n                    jurisdiction to hear appeals from the grant or refusal of leave to apply forcertiorari. The Judicial Committee of the\n                    Privy Council allowed the appeal and held that the Court of Appeal of Bermuda\n                    did have the requisite jurisdiction to hear such appeals. Lord Hoffmann\n                    nevertheless went on to observe that (at 18C–D): Their Lordships therefore consider that a renewed application to the Court\n                        of Appeal under R.S.C., Ord. 59, r. 14(3) is a true appeal with a\n                        procedure adapted to its ex parte nature. If the rule had been intended to\n                        create an anomalous exception to the principle inLane v.\n                            Esdaile[1891] A.C. 210, it would hardly have been restricted\n                        to the refusal of applications ex parte. It should logically have been\n                        extended to appeals from the discharge of leave after an inter partes\n                        hearing and from a refusal to discharge such leave. But appeals against all\n                        such orders are regularly entertained and their existence is inconsistent\n                        with the application of the principle inLane v.\n                            Esdaileto appeals from the refusal of leave to apply for\n                        judicial review. This brings their Lordships to the decision of the House of Lords inIn re Poh[1983] 1 W.L.R. 2.\n                        … Ord 59 r 14(3) of the Rules of Supreme Court (UK)\n                        (“RSC”) is identical to O 57 r 16(3) of our Rules of\n                        Court. 44Regina (Burkett) v\n                        Hammersmith and Fulham London Borough Council and another[2002]\n                    1 WLR 1593 (“Hammersmith”)\n                    concerned a late application for judicial review; the preliminary issue before\n                    the House of Lords was whether it had the jurisdiction to hear an appeal from a\n                    decision of the Court of Appeal refusing permission to seek judicial review.\n                    Lord Steyn observed that (at [12]): 12    … InKemper Reinsurance\n                                Co v Minister of Finance[2000] 1 AC 1 the Privy\n                            Council cast doubt on the reasoning inIn re\n                                Poh. Lord Hoffmann observed, at p 18b, that a\n                            renewed application to the Court of Appeal under RSC Ord 59,\n                            r 14(3) is a true appeal with a procedure adapted to its ex parte\n                            nature. … 45     It is evident that the comments about RSC\n                    Ord 59 r 14(3) in bothKemper\n                        ReinsuranceandHammersmithwere\n                    made in the context of exploring the true width of the rule inLane and another v Esdaile and another[1891] AC 210\n                        (“Lane v Esdaile”), and whetherIn re Poh[1983] 1 WLR 2 had validly\n                    extended it. 46Lane v Esdaileconcerned the appellate jurisdiction of the House of Lords. The appellant sought\n                    to appeal against a refusal by the Court of Appeal to grant leave to appeal to\n                    the House of Lords. The House of Lords held that it did not have the\n                    jurisdiction to hear an appeal against a refusal to grant leave to appeal by the\n                    Court of Appeal. Lord Diplock, in the House of Lords decision ofIn Re Poh, extended the rule inLane\n                        v Esdaileto a refusal to grant leave to commence judicial review\n                    proceedings. BothKemper ReinsuranceandHammersmithdisapproved of Lord Diplock’s\n                    extension of theLane v Esdailerule to judicial\n                    review proceedings. 47     Before summarising Lord Hoffmann’s\n                    line of logic inKemper Reinsurance, it is\n                    apposite to point out that Bermuda did not have the equivalent of RSC\n                    Ord 59 r 14(3) in their procedural rules. 48     InKemper\n                        ReinsuranceLord Hoffmann was, in fact, attempting to\n                    disapprove ofIn Re Pohon principled grounds.\n                    First, he observed that, in England, there was a routine practice of allowing\n                    appeals from the discharge of leave after aninter\n                        parteshearing and from a refusal to discharge such leave in\n                    judicial review proceedings (at 18D).Secondly, he\n                        held(at 17D): At any rate, [RSC Ord 59 r 14(3)] appears to their Lordships to\n                        be entirely procedural. He also stated that a renewed application\n                            under RSC Ord 59 r 14(3) was “a true\n                            appeal”(at 18C): Their Lordships therefore consider that a renewed application to the Court\n                        of Appeal under R.S.C. Ord 59 r 14(3) is a true appeal with a\n                        procedure adapted to its ex parte nature. 49     Thirdly, he held that the rule inLane v Esdailewould potentially apply to such appeals\n                    since RSC O 59 r 14(3) is merely procedural in nature. Lastly, he\n                    pointed out that the routine practice of allowing such appeals meant that\n                    judicial review proceedings were in practice not caught by the rule inLane v Esdaile. It was therefore irrelevant that Bermuda\n                    did not have the equivalent of RSC O 59 r 14(3), because English\n                    practice showed that the rule inLane v Esdailedid not extend to judicial review proceedings. Lord Hoffmann, in the\n                    alternative, also justified a restrictive reading of the rule inLane v Esdaileon the basis of the differences between\n                    judicial review and an appeal (see 14H–15C), but this is not relevant for\n                    our purposes. 50     The key step in Lord Hoffmann’s\n                    reasoning – that RSC Ord 59 r 14(3) is merely procedural and a\n                    renewal application under the same is a true appeal – is italicised above.\n                    If this key step were to fail, his conclusion thatLane v\n                        Esdailedid not apply to judicial review would not follow. This\n                    step was problematic on two counts: first, Lord Hoffmann did not consider\n                    the possibility that the Court of Appeal lacked jurisdiction and second, the\n                    characterisation of a RSC O 59 r 14(3) application as an appeal was\n                    unsupported by the weight of authority. 51     Lord Hoffmann opined that RSC O 59\n                    r 14(3) was procedural (in other words, non-jurisdiction conferring) in\n                    nature, and then asserted that an application under the same was a true appeal.\n                    With respect, the latter does not necessarily follow from the former. From a\n                    logical standpoint, it could very well be the case that the Court of Appeal is\n                    exercising an original jurisdiction which may or may not exist, and may or may\n                    not stem from a source outside of the Rules of Court (but see below at [58]). It\n                    seems, with respect, that Lord Hoffmann observed that the Court of Appeal\n                    was exercising an appellate jurisdiction out of expediency in order to justify\n                    previous practice (at 18C): But appeals against all such orders are regularly entertained\n                        … 52     Furthermore, Lord Hoffmann referred to\n                    only two authorities in support of this step:Underhill’s Manual of Procedure of the Chancery Division(1881) andJ O Griffits’s Guide to Crown\n                        Office Practice(1947), respectively, both of which suggested\n                    that Ord LVIII r 10 of the 1883 Rules of the Supreme Court (the\n                    predecessor to Ord 59 r 14(3) of the 1965 Rules of Supreme Court)\n                    entailed an appeal, and not a fresh application, to the Court of\n                Appeal. 53     These two books did not, however, cite any\n                    cases to support the proposition that an application under Ord LVIII\n                    r 10 or Ord 59 r 14(3) was in actuality an appeal. This must be\n                    counterbalanced against the wealth of authority wherein appellate courts have\n                    persistently held that they were exercising an original jurisdiction in RSC\n                    Ord 59 r 14(3) applications (see, for example,Ex\n                        parte Graemeat [38]; and the cases cited below at [54] and\n                    [55]). 54     Sir John Donaldson MR made the same\n                    point in two cases. In the English Court of Criminal Appeal decision ofDhillon v Secretary of State for the Home\n                        Department(1988) 86 CrAppR 14 (at 17) (“Dhillon”), he opined as follows: On the other hand,this Court has a special\n                            jurisdiction in judicial review matters—the origin of which is\n                            lost in the mists of recent antiquityand plainly it is not\n                        open to us to challenge it at this stage—whereby we can consider a\n                        renewed application for leave to grant judicial review. … [emphasis\n                        added] In the English Court of Appeal decision ofReg v Secretary of State for the Home Department, Ex parte\n                            Turkoglu[1988] QB 398 (“Turkoglu”), he said (at 400): … As I pointed out in the judgment, if on the adjourned hearing of\n                        the application for leave to apply before the High Court the judge had\n                        dismissed the application, there could be no appeal to this court.There would be a power to renew that application to this court,\n                            but no appeal:Lane v. Esdaile[1891] A.C. 210. [emphasis added] 55     The English Court of Appeal has even held that\n                    it possessed the original jurisdiction to hear an application for judicial\n                    review after granting leave to an applicant to do so.Reg v\n                        Industrial Injuries Commissioner, ex parte Amalgamated Engineering\n                        Union[1966] 2 QB 21 (“Amalagamated Engineering Union”) concerned a trade union\n                    which appliedex parteto the Queen’s Bench\n                    Division Court for leave to apply for an order of certiorari to quash a decision\n                    of the Industrial Injuries Commissioner. The Divisional Court, without stating\n                    reasons, refused leave. The trade union renewed their application; the Court of\n                    Appeal, consisting of Lord Denning MR, Salmon LJ, and\n                    Davies LJ, granted leave. The Ministry opposing the judicial review\n                    application argued that the actual application should go back to the Divisional\n                    Court, because of RSC Ord 59 r 5, which states: When leave has been granted to apply for an order of mandamus, prohibition\n                        or certiorari, the application shall be made by notice of motion to a\n                        Divisional Court of the Queen's Bench Division... 56     Lord Denning MR held that RSC\n                    Ord 59 r 5 applied only to cases where the Divisional Court itself has\n                    granted leave, and not where the Court of Appeal has granted leave. The weight\n                    of court practice was against the Ministry. After the introduction of the\n                    requirement of leave for judicial review matters (via s 10 of the UK\n                    Administration of Justice (Miscellaneous Provisions) Act 1938 (c 63)), the\n                    practice had always been for the Court of Appeal itself to hear the judicial\n                    review application after the grant of leave. Lord Denning MR further\n                    added (at 28–29): I am greatly influenced by the practice of the courts over the years. In a\n                        matter such as this, the opinion and practice of the profession certainly\n                        makes law. I would add this. If the Divisional Court had gone through the full\n                        procedure of giving leave to apply for an order of certiorari, and then had\n                        heard the other side, and ultimately refused to grant the order, there would\n                        clearly have been an appeal to this court on the whole matter. In the\n                        present instance they have taken a short cut. They thought that there was no\n                        need to hear the other side at all. So they refused leave at once. It would\n                        be absurd for us to send it back to them to hear a case which they thought\n                        so plain. It is much better for us to hear it straight away. I think the\n                        preliminary objection is not well founded, and the court should go on and\n                        hear the application. The position is surelya\n                            fortiorifor an application under RSC Ord 59\n                        r 14(3). 57     With respect,Kemper\n                        ReinsuranceandHammersmithobscure\n                    the settled position. Whilst we agree that the Rules of the Supreme Court are\n                    merely procedural in nature, it seems to us implausible to deem an application\n                    under RSC Ord 59 r 14(3) (and therefore O 57 r 16(3) of the\n                    ROC) to be an invocation of the court’s appellate jurisdiction. To\n                    reiterate, RSC Ord 59 r 14(3) merely states that “an\n                    application for a similar purpose may be made to the Court of\n                    Appeal”. 58     Further, there are also significant\n                    differences between the jurisdictional bases of the English Court of Appeal and\n                    the Singapore Court of Appeal. WhenDhillonandTurkogluwere decided, the relevant\n                    jurisdiction-conferring provision was s 15(2) of the UK Supreme Court Act\n                    1981 (c 54) (“the 1981 UK Act”), which reads as\n                    follows: Subject to the provisions of this Act, there shall be\n                        exercisable by the Court of Appeal — (a)    all such\n                                jurisdiction (whether civil or criminal) as is conferred on it by\n                                this or any other Act; (b)all such other jurisdiction (whether civil or criminal)\n                                    as was exercisable by it immediately before the commencement of\n                                    this Act. [emphasis added] 59     The language of s 15(2)(b) clearly contemplates that the English Court of Appeal\n                    could exercise “all such other” jurisdiction that it used to\n                    historically exercise. This is in sharp contrast to Singapore’s statutory\n                    provisions, which clearly state that the Court of Appeal only exercises an\n                    appellate jurisdiction, with s 3 of the SCJA, in particular, omitting the\n                    word “original” when the Court of Appeal is mentioned in\n                        s 3(b) (as opposed to when the High Court\n                    is mentioned in s 3(a)). 60     In the English Court of Appeal decision ofWEA Records Ltd v Visions Channel 4 Ltd and\n                        others[1983] 1 WLR 721, Sir John Donaldson MR\n                    commented on the jurisdiction of the Court of Appeal as follows (at 727): … The Court of Appeal hears appeals from orders and judgments. It\n                        does not hear original applications save to the extent that these are\n                        ancillary to an appeal, andsave in respect of an\n                            entirely anomalous form of proceeding in relation to the grant of leave\n                            to apply to the Divisional Court for judicial review.[emphasis added] In the (also) English Court of Appeal decision ofOcean Software Ltd v Kay and others[1992] 1 QB\n                        583 (“Ocean Software”),\n                        Scott LJ considered the 1981 UK Act and cited the above passage with\n                        approval (at 589). 61     The same result obtains when one engages in a\n                    semantic enquiry into what constitutes an “appeal”.\n                    “Appeal” is defined byJowitt’s\n                        Dictionary of English Law(D Greenberg, gen ed)\n                    (3rd ed, 2010) at p 137, as follows: The judicial examination by a higher court of the decision of an inferior\n                        court. … 62     In essence, an appeal necessarily entails the\n                    examination of a decision made by an inferior court. There is nothing to examine\n                    if an application under O 57 r 16(3) “for a similar\n                    purpose” is made to the Court of Appeal. In such an application, the\n                    Court of Appeal is looking at the matter completely afresh and without having\n                    the benefit of the reasoned grounds upon which the application has been refused\n                    by the High Court. This is also supported by the English Court of Appeal\n                    decision ofSubesh v Secretary of State for the Home\n                        Department and other appeals[2004] All ER (D) 326 (Mar),\n                    where it was stated that (at [44]): The answer is, we think, ultimately to be found in the reason why (as we\n                        have put it) the appeal process is not merely a re-run second time around of\n                        the first instance trial. It is because of the law's acknowledgement of an\n                        important public interest, namely that of finality in litigation.The would-be appellant does not approach the appeal court as if\n                            there had been no first decision, as if, so to speak, he and his\n                            opponent were to meet on virgin territory. …[emphasis\n                        added] 63     A structural examination of the ROC supports\n                    the semantic proposition that an O 57 r 16(3) application is not an appeal.\n                    O 57 r 3(1) of the ROC reads as follows: An appeal to the Court of Appealshallbe by\n                        way of rehearing andmustbe brought by notice of appeal in Form 112.[emphasis\n                        added in italics and bold italics] The use of “must” means that, under the Rules of\n                        Court, O 57 r 3(1) is theonlymeans\n                        of commencing an appeal. The characterisation of an O 57 r 16(3)\n                        application as an appeal is therefore manifestly repugnant to the clear\n                        words of O 57 r 3(1). 64     O 57 r 5(1) of the ROC also\n                    stipulates that, when a notice of appeal has been filed, the Judge who gave the\n                    judgment or made the order must certify in writing the grounds of the judgment\n                    or order, unless the judgment has already been written. This procedure is\n                    emblematic of an appeal, and ensures that the Court of Appeal is able to examine\n                    the decision of the court below. Other consequences also flow from the filing of\n                    the notice of appeal; for instance, under O 57 r 9, the appellant must\n                    file, amongst other things, the appellant’s case and a core bundle within\n                    two months of the record of proceedings being available. 65     None of the above features is present where an\n                    O 57 r 16(3) application for a similar purpose is made to the Court of\n                    Appeal. The ineluctable conclusion is that such an application isnotan appeal. 66     It is not to the point that O 57\n                    r 16(3) entails a “procedure adapted to itsex\n                        partenature” (asKemper\n                        ReinsuranceandHammersmithhave\n                    asserted (see above at [43] and [44])). The usual provisions in the ROC are more\n                    than capable of handling an appeal from the refusal of anex\n                        parteapplication. For instance, there would be no need to serve\n                    the notice of appeal on the respondent (O 57 r 9(1)) because there is\n                    no respondent. There is also no need for the respondent’s case to be filed\n                    (O 57 r 9A(2)). If the appeal is urgent, an application may be made to\n                    expedite the hearing of the appeal (O 57 r 20). 67     We thus only partially agree with the\n                    following comment made inSingapore Civil Procedure\n                        2013(G P Selvam ed-in-chief)\n                    (Sweet & Maxwell Asia, 2013) (“White\n                        Book”) at para 57/16/3: But if the application to the court below is refused, the application to\n                        the Court of Appeal is not an appeal. The jurisdiction is concurrent\n                            (Cropper v Smith(1883) 24 Ch.D 305;Brown v Brook(1902) 86 L.T. 372,\n                        CA). 68     We agree that an O 57 r 16(3)\n                    application is not an appeal. We do not agree with the blanket statement that\n                    jurisdiction is “concurrent”, as we shall elaborate on in the\n                    section below.",
        "A coda on the incidental appellate jurisdiction of the Court of\n                Appeal": "69     O 57 r 16(3) is nonetheless notultra viresvis-à-vis the SCJA. An application\n                    under O 57 r 16(3) can be made if there are statutory grounds for the\n                    assumption of jurisdiction by the Court of Appeal. For instance, prior to the\n                    enactment of our Supreme Court of Judicature Amendment Act 2010 (No 30 of\n                    2010), s 34(2) of the SCJA expressly provided for the “Court of\n                    Appeal or a Judge” granting leave to appeal in certain enumerated\n                    circumstances. The current s 34(2) however no longer confers jurisdiction\n                    on the Court of Appeal to grant leave to appeal. 70     In the current statutory framework,\n                    s 29A(3) of the SCJA is one such jurisdiction-conferring provision: For the purposes of andincidentalto — (a)the hearing and determination of any appealto the Court of Appeal; and (b)    the amendment,\n                                execution and enforcement of any judgment or order made on such an\n                                appeal, the Court of Appeal shall have all the authority and jurisdiction of the\n                        court or tribunal from which the appeal was brought. [emphasis added in bold italics] Section 29A(3) of the SCJA confers on the Court of Appeal\n                        the jurisdiction and powers of the court below if this isincidentalto the hearing and determination of an appeal.\n                        For ease of reference, this shall be hereinafter referred to as the\n                        incidental appellate jurisdiction of the Court of\n                Appeal. 71     The English Court of Appeal decision ofOcean Softwareis highly relevant in this\n                    regard. It is apposite to first set out s 15(3) of the 1981 UK Act, which\n                    reads as follows: For all purposes of or incidental to — (a)    the hearing and\n                                determination of any appeal to the civil division of the Court of\n                                Appeal; and (b)    the amendment,\n                                execution and enforcement of any judgment or order made on such an\n                                appeal, the Court of Appeal shall have all the authorityand\n                            jurisdictionof the court or tribunal from which the appeal\n                        was brought. [emphasis added] The language utilised in s 15(3) of the 1981 UK Act is\n                        identical to that used in s 29A of our SCJA, save for the phrase\n                        “[f]or all purposes of or incidental to” being used in the\n                        former and “[f]or the purposes of and incidental to” being\n                        used in the latter. This is not, in our view, a material\n                    difference. 72     The facts ofOcean\n                        Softwareare as follows. The English High Court refused to grant\n                    the plaintiff’sex parteapplication for aMarevainjunction. The plaintiff appealed to\n                    the Court of Appeal, which allowed the appeal and granted theMarevainjunction. One of the orders gave either party liberty\n                    to apply to discharge or vary the injunction. The defendant applied to the Court\n                    of Appeal to discharge theex parte Marevainjunction, whereupon the plaintiff applied for additional interlocutory relief\n                    with respect to a prospective income stream. Scott LJ held that the Court\n                    of Appeal did not have the jurisdiction to hear the plaintiff’s\n                    application for additional interlocutory relief because s 15(3) of the 1981\n                    UK Act was inapplicable (at 588C–E): Where the line is to be drawn between applications which are ancillary to\n                        the exercise by the Court of Appeal of its appellate jurisdiction and\n                        applications which are free-standing first instance applications may be\n                        difficult to draw. It may be a matter of degree. In the present case, the\n                        proposed application by the plaintiff to apply for additional relief in\n                        order to protect its share of future payments of royalties that may be\n                        received by the third defendant from Nintendo is clearly, in my opinion, on\n                        the wrong side of the jurisdictional line. It is not ancillary to any\n                        appeal. An application to discharge an ex parte injunction on the ground\n                        that the plaintiff's cause of action is insufficiently substantial to\n                        justify the grant of the injunction also, in my opinion, falls on the wrong\n                        side of the line. It is not ancillary to an order allowing an appeal against\n                        a first instance refusal of the injunction. 73     We agree with Scott LJ’s comments.\n                    If an appeal has been validly commenced in this court, an application may be\n                    made to this court if the application is incidental to the hearing and\n                    determination of the appeal. We accept that the line between a free-standing and\n                    incidental application is potentially difficult to draw. The precise contours of\n                    the line to be drawn can only be determined on a case by case\n                basis. 74     The question of whether the incidental\n                    appellate jurisdiction of this court was invoked did not arise on the facts of\n                    this case. Counsel for the AGC contended that their O 57 r 16(3)\n                    application was in actuality an appeal. As we have already explained, an\n                    O 57 r 16(3) application is not an appeal. There was no appeal before\n                    this court; there cannot therefore be anything incidental to a non-existent\n                    appeal. 75     An O 57 r 16(3) application may be\n                    validly made if and only if the application is pursuant to the incidental\n                    appellate jurisdiction of the court. We turn now to the two cases raised by theWhite Book(see above at [67]). 76     The English Court of Appeal decision ofCropper v Smith(1883) 24 ChD 305\n                    concerned an application to stay an assessment of damages hearing pending an\n                    appeal. The application was initially refused by the court below. The applicant\n                    renewed his application before the Court of Appeal. Brett MR held that (at\n                    308-309): By that rule it is assumed that the Court of Appeal has jurisdiction, and\n                        to my mind, according to the true reading of that rule, not a jurisdiction\n                        by way of appeal merely, but an independent jurisdiction, … Then in order that the Court of Appeal and the Court below may not incur\n                        the risk of deciding in different ways as to staying proceedings without\n                        either of them knowing of the application to the other the rule imposes this\n                        limitation, that although the jurisdiction is co-ordinate, and although it\n                        is alternative, yet the Court of Appeal will not exercise its jurisdiction\n                        until it knows whether the co-ordinate jurisdiction of the Divisional Court\n                        has been exercised and how. … 77     These comments must be read in light of the\n                    statutory provisions then in force. The relevant part of s 19 of the 1873\n                    UK Act reads as follows: … For all the purposes of and incidental to the hearing and determination of\n                        any appeal within its jurisdiction, and the amendment, execution and\n                        enforcement of any judgment or order made on any such appeal, and for the\n                        purpose of every other authority expressly given to the Court of Appeal by\n                        this Act,the Court of Appeal shall have the power,\n                            authority andjurisdictionby this Act vested in the High Court of\n                            Justice. [emphasis added in italics and bold italics] It is clear that Brett MR’s reference to the\n                        “independent jurisdiction” of the English Court of Appeal is a\n                        reference to, in our terminology, theincidentalappellate jurisdiction of the\n                    court. 78     The English Court of Appeal decision ofBrown v Brook(1902) 86 LT 373 is\n                    similar. The plaintiff appealed against a decision by Ridley J, and applied\n                    to the Court of Appeal for a stay of execution. The plaintiff did not first\n                    apply to the court below because Ridley J was “away on\n                    circuit”. The Court of Appeal held that it had the jurisdiction to hear\n                    the plaintiff’s application, but did not indicate the source of the\n                    jurisdiction. In our view the source of the court’s jurisdiction was\n                    s 19 of the 1873 UK Act, and is properly characterised asincidentalappellate jurisdiction.",
        "Conclusion": "79     OS 1175/2013 was therefore dismissed with\n                    no order as to costs. Counsel for Alex Au, Mr Peter Low\n                    (“Mr Low”), asked for costs at the conclusion of proceedings.\n                    We declined to do so because we did not hear OS 59/2014; Mr Low did\n                    not participate in proceedings before us and did not raise any of the legal\n                    issues considered above."
    }
}