{
    "case_title": "Dynasty Line Limited (in liquidation)\n      v\n      Sukamto Sia and another and another appeal",
    "ncitation": "[2014] SGCA 21",
    "coram": "Sundaresh Menon CJ; \n      Chao Hick Tin JA; \n      V K Rajah JA",
    "sections": {
        "Introduction": "1       Dynasty Line Limited (“Dynasty”) was the personal investment vehicle of Sukamto Sia (“Sia”). It purchased a significant quantity of shares in a Hong Kong-listed company from several vendors, including Low Tuck Kwong (“Low”). The shares, which were Dynasty’s only asset, were transferred to Dynasty in full even though there was a substantial sum yet to be paid by Dynasty for the shares. Dynasty then pledged all the shares to various banks as security for loans to Sia and his associates, who subsequently defaulted on the loans. As a result, the shares were sold by the banks to satisfy the debts owed to them. 2       Some years later, Low successfully applied for Dynasty to be wound up in the British Virgin Islands (“BVI”). The liquidators of Dynasty then commenced proceedings against Sia and his co-director, Lee Howe Yong (“Lee”), for breaches of fiduciary duties under BVI law as directors of Dynasty in Suit No 256 of 2010. This claim was dismissed by the High Court judge (“the Judge”) who heard this matter and that is the subject matter of these appeals. 3       The main issue presented in these appeals is whether Sia and Lee had breached their fiduciary duties in causing Dynasty to pledge the shares and had thereby failed to act in the best interests of Dynasty’s creditors at a time when Dynasty’s solvency was or appeared to be in doubt.",
        "Facts": "",
        "Background to the dispute": "4       Dynasty was a company incorporated under the laws of the British Virgin Islands (“BVI”). Sia was its sole shareholder. Although Lee did not hold any shares in Dynasty, Sia had promised him 20% of the profits of Dynasty. 5       Under seven separate sale and purchase agreements dated 5 February 1996, Dynasty acquired 29,537,367 shares (“the Shares”) in China Development Corporation Limited (“CDC”) from Low and the following vendors: (a)     Johnny Tsao Yue Hwa; (b)     Yap Han Hoe; (c)     Swanny Sri Sujanty Setyono; (d)     Lau Kang Thow; (e)     Evelyn Ong Suat Tay; and (f)     Low Cheng Lum (collectively, “the Vendors”). 6       The Vendors transferred their Shares to Dynasty before the intended completion date on 2 May 1996. However, only HK$64,459,317.16 or approximately 28% of the Purchase Price was ultimately paid.",
        "The subsequent pledges": "7       Between April 1996 and November 1997, Dynasty pledged the Shares to various financial institutions as security for loan facilities (“the Security Transactions”) granted to Sia, Sia’s business associate Franklin Syah, and a company owned by Sia and Lee known as Beswil Investment Pte Ltd (“Beswil” and collectively, “the Borrowers”). Details of the Security Transactions are provided in the table below: S/NDateNumber of sharesName of financial institutionRecipient of loan facilities123 April 199612,032,302Commerzbank (South East Asia) Limited (“Commerzbank”)Sia26 November 19965,600,000Société Générale (Labuan branch)Beswil329 August 199748,822,700KG Investments Asia LimitedFranklin Syah43 November 199710,702,625Creditanstalt BankvereinSia   We note in passing that there was a stock split of CDC shares on 15 May 1997 in the ratio of 5:1. This stock split affected the number of shares pledged under the third and fourth transactions in the table above. 8       The Borrowers defaulted on the loans. The financial institutions listed in the table above then sold the Shares and applied the proceeds to satisfy the debts they were owed.",
        "The winding up of Dynasty and other proceedings": "9       On 10 June 1999, the Vendors commenced proceedings in Hong Kong against Dynasty in HCA 9505 of 1999 (“HCA 9505”) for the unpaid balance of the Purchase Price. On 6 April 2001, the Vendors obtained judgment in the sum of HK$166,042,936.79. 10     More than six years passed before Lau Wu Kwai King Lauren (“Lauren”) and Kennic Lai Hang Hui were appointed as joint provisional liquidators of Dynasty (“the Provisional Liquidators”) on 23 August 2007. Soon after, on 27 September 2007, the Provisional Liquidators commenced proceedings in Hong Kong on behalf of Dynasty against Sia and Lee in HCA 2057 of 2007 (“HCA 2057”) for, among other things, breaches of fiduciary duties in relation to their dealing with the Shares. The Hong Kong Court of Appeal allowed Sia’s application to stay Dynasty’s action on the ground that Hong Kong was not the appropriate forum. 11     Low then commenced liquidation proceedings against Dynasty in the BVI and on 22 December 2009, Dynasty was wound up by the BVI High Court. On the same day, William Tacon (“Tacon”) and Lauren were appointed as joint liquidators of Dynasty (“the Liquidators”). The Liquidators then brought the present suit in Suit No 256 of 2010 against Sia and Lee for breaches of fiduciary duties under BVI law as directors of Dynasty (“the Original Claim”) while Sia responded by filing a counterclaim against Low for a breach of a settlement agreement and against Dynasty, Low, Tacon and Lauren for conspiracy to injure him (“the Counterclaim”), also under BVI law.",
        "The decision below": "12     The Judge dismissed the Original Claim and the Counterclaim. She held that: (a)     Dynasty’s claim against Sia and Lee was not time-barred. The exception to the six-year time bar in s 22 of the Limitation Act (Cap 163, 1996 Rev Ed) (“Limitation Act”) applied because Dynasty had alleged a fraudulent breach of trust.[note: 1] (b)     Dynasty’s claim was not barred by laches. Although there was substantial delay on the part of Low, it would not have been practically unjust to have allowed a remedy if Dynasty’s claims had been made out.[note: 2] (c)     The defence of acquiescence did not apply because even if Low knew that Sia would pledge the Shares, there was no evidence to suggest that Low had known that Dynasty was insolvent or on the verge of insolvency at the time he transferred the Shares.[note: 3] (d)     Sia and Lee did not breach their fiduciary duties as directors of Dynasty. (i)       Payment for the Shares did not follow the payment schedule because Low and Sia had entered into a collateral agreement, which afforded flexibility in the payment of the Purchase Price. Accordingly, there was no debt due and payable at the time the Security Transactions were entered into.[note: 4] (ii)       Given that Dynasty was neither insolvent nor on the verge of being insolvent at the time of the Security Transactions, Sia and Lee owed their primary duties to the shareholders and not to the creditors of Dynasty.[note: 5] (iii)       The pledging of the Shares was not improper and was done in the interests of Dynasty.[note: 6] (e)     Low, Lauren and Tacon did not conspire to cause loss and damage to Sia through the pursuit of stale and baseless claims in Singapore. (i)       The Liquidator’s decision to commence the Original Claim was based on independent advice.[note: 7] (ii)       There was insufficient evidence to prove that Low had actually given Lauren or Tacon instructions regarding the commencement and conduct of the Original Claim.[note: 8] 13     Dissatisfied, Sia filed Civil Appeal No 103 of 2013 against the Judge’s dismissal of the Counterclaim while Dynasty brought a cross appeal, namely Civil Appeal No 105 of 2013, against the Judge’s dismissal of the Original Claim.",
        "Issues": "14     From both appeals, three issues arise for our decision: (a)     Did Sia and Lee breach their fiduciary duties as directors of Dynasty? (b)     Are Dynasty’s claims time-barred or defeated by laches or acquiescence? (c)     Did Low, Lauren and Tacon conspire with the predominant purpose of causing injury to Sia through the pursuit of stale and baseless claims?",
        "Did Sia and Lee breach their fiduciary duties as directors of Dynasty?": "",
        "Was there a collateral agreement?": "15     We have noted that the Judge below found that Low and Sia had entered into a collateral agreement for flexibility in the payment of the Purchase Price. Before we analyse the alleged collateral agreement, we observe that much the same allegation had in fact been raised previously in Hong Kong as a defence in HCA 9505. In those proceedings, it had been alleged that there was an oral agreement between Low and Sia that the balance of the purchase price would be paid to Low (instead of the other vendors) and that payment could be made by either Dynasty or Sia.[note: 9]However, this defence was abandoned after Low had given his evidence on the stand[note: 10]and the paragraphs referring to the collateral agreement in the amended defence were then deleted in the re-amended defence.[note: 11]Having abandoned the argument that there had been a collateral agreement in earlier proceedings, we think that Sia’s attempt to re-litigate it in the present proceedings stood to be regarded as an abuse of process. However, this argument was not fully pressed by the respondents and so not fully canvassed in the present appeal. We therefore say no more about it. 16     In the present proceedings, Sia’s pleaded collateral agreement was materially similar to that pleaded in HCA 9505 although it contained an additional term, namely, that part of the purchase price to be received by Low would be applied towards setting off outstanding amounts that Low owed Sia at the time. It was also pleaded in Sia’s defence that “the intention of the collateral contract was to allow some flexibility in the repayment terms”. We note here that the terms of the pleaded collateral agreement were set out in the pleadings and they made no reference to the timing of the payments. 17     Notwithstanding the lack of any reference in the terms of the alleged collateral agreement to the timing of the payments that fell due under the sale and purchase agreements, the Judge found that there was a collateral agreement which “provided for flexibility in the payment of the Purchase Price”[note: 12]. According to the Judge, this allowed Sia to pay Low for the Shares on anad hocbasis. It was not clear to us just what was meant by this and at the hearing before us, we pressed counsel for Sia, Mr Samuel Chacko, to clarify the precise terms of the collateral agreement. He struggled to spell this out with any precision and eventually submitted that the collateral agreement contained a repayment term that allowed Sia a reasonable period of time for payment of the Shares after payment had been demanded by Low. This was not what had been pleaded or found by the Judge. In any case, for the reasons that follow, we do not think that a valid and binding collateral agreement was, or could be, made out on the present facts. 18     A collateral contract must be “based on all the legal ingredients necessary to constitute a valid contract” and cannot “be ‘conjured’ out of ‘thin air’” (Ang Sin Hock v Khoo Eng Lim[2010] 3 SLR 179 (“Ang Sin Hock”) at [80]). The following observations were made inAng Sin Hockat [76]: 76    … Indeed, it may be mentioned that the broader approach is more consistent with the spirit of the collateral contract whose ultimate aim is, as we have seen, to achieve a just and fair result in the case at hand. There is, admittedly, the danger of too much commercial uncertainty being generated.However, this danger can be met by the court requiring clear proof that the legal requirements of a binding contract have, indeed, been satisfied on the facts(see also below at [79]-[80]), as well as (from an attitudinal perspective) beinggenerally reluctant to find a collateral contractwhich ought to remain a finding of last resort. [emphasis in original omitted; emphasis added in italics] 19     One critical requirement in law for the formation of any binding contract is the certainty of its terms. This requirement was discussed inT2 Networks Pte Ltd v Nasioncom Sdn Bhd[2008] 2 SLR(R) 1 (“T2 Networks”) where Judith Prakash J held (at [44]) that a settlement agreement was not legally binding because some of its terms were uncertain. Of particular relevance was cl 2 of the settlement agreement which provided that: NasionCom to settle the outstanding payments to T2 within a stated schedule a.    Action by Kai Shan to instruct MobileOne that settlement will be made directly by NasionCom b.    Action by Damien to update Dato’ on the payments for Dato’ [sic] approval c.    Immediate partial payment and thereafter on a scheduled basis. In arriving at her conclusion that cl 2 was uncertain, Prakash J noted that the clause did not actually provide a schedule for the payments. She also observed that the clause did not specify the quantum of the “immediate partial payment” or the amount and period of the succeeding instalments in cl 2(c). 20     On the facts before us, we think that a term for payment for the Shares to be made on anad hocbasis is simply too uncertain to be enforceable. Even though there had been a basic agreement inT2 Networksfor one party to make immediate partial payment and scheduled payments thereafter, this was held not to be sufficiently certain. The alleged collateral agreement in this case was even more uncertain because there had been no indication or agreement whatsoever as to the timing or the quantum of payments under the alleged collateral agreement. 21     Aside from the problems of certainty mentioned above, there were several further difficulties with the Judge’s finding of a collateral agreement, and indeed with Mr Chacko’s alternative formulation of the terms of any such agreement. 22     First, both versions of the collateral agreement depart from Sia’s own pleadings. There is no reference in the pleadings to the suggested flexibility in thetimingof payments.[note: 13]As mentioned above at [16], the pleaded terms of the collateral agreement only allowed some flexibility with regard to theidentityof the payee and payor of the Purchase Price. Although Sia pleaded that “the intention of the collateral contract was to allow some flexibility in the repayment terms”, this must be understood in the context of the pleaded repayment terms and in that context, there was nothing to suggest that such flexibility referred to the timing of the repayments rather than to the identity of the paying and receiving parties and possibly the matter of Sia being allowed to offset the amounts due under the sale and purchase agreements against sums said to be due from Low to Sia. 23     Second, the collateral agreement would have been inconsistent and indeed incompatible with cl 3.2 of the sale and purchase agreements. Payment on anad hocbasis or after a reasonable period of time directly contradicts the payment schedule in cl 3.2 which specifies three specific dates for the payment of 1%, 4% and the remaining 95% of the Purchase Price. It follows from this inconsistency that evidence of the alleged collateral agreement was, in fact, inadmissible at the trial below (see s 94(b) of the Evidence Act (Cap 97, 1997 Rev Ed);Lemon Grass Pte Ltd v Peranakan Place Complex Pte Ltd[2002] 2 SLR(R) 50 at [126]–[130]; andLatham Scott v Credit Suisse First Boston[2000] 2 SLR(R) 30 at [21]). 24     Third, Sia pleaded that the collateral agreement was entered intobeforethe execution of the sale and purchase agreements. However, any such contract would have been rendered void by cl 7.1 of the sale and purchase agreement which states that: 7.1    This Agreement embodies all the terms and conditions agreed upon between the parties hereto as to the sale and purchase hereunder and supersedes and cancels in all respects all previous representations, warranties, agreements and undertakings between the parties hereto with respect to the sale and purchase hereunder whether such be written or oral. Nor would the position have been different if Sia had contended that the collateral agreement came after the sale and purchase agreements. This is because any subsequent variation of the sale and purchase agreement would have been rendered ineffective by cl 7.2 unless it had been made in writing and signed by the parties. 25     In our judgment, for all these reasons, there was and could have been no collateral agreement allowing for payments on anad hocbasis or on any other basis inconsistent with the payment schedule contained in the principal agreement. Further, as a matter of general principle, we would have been slow to replace the terms of a written contract with the inconsistent and uncertain terms of a collateral agreement. 26     Apart from the alleged existence of the collateral agreement discussed above, Mr Chacko raised two subsidiary arguments at the hearing before us in support of his contention that the monies under the sale and purchase agreements were not due and owing. First, he argued that Low made certain misrepresentations to Dynasty and Sia and that Dynasty had entered into the sale and purchase agreements relying on these misrepresentations. Second, he argued that the Vendors were estopped from enforcing their strict rights to payment under the sale and purchase agreements because there was some evidence of forbearance on their part. 27     These arguments were untenable. As regards the first argument, Sia should have brought a separate claim for misrepresentation in the present proceedings. If Sia had succeeded in such a claim, he might have been entitled to rescission of the sale and purchase agreements had he also been in a position to return the shares and this would have relieved Dynasty of its payment obligations under those agreements. However, Sia did not mount such a claim and the sums owed under the sale and purchase agreements remained due and payable. As for the second argument, there was no serious attempt to establish this claim. Crucially, Mr Chacko failed to explain how the elements of estoppel had been made out on the facts of this case.",
        "Whether Dynasty was insolvent when the Share Pledges were made": "28     Having found that there was a collateral agreement, the Judge went on to conclude that Dynasty was neither on the verge of insolvency nor was its solvency doubtful because there was no date by which the parties had agreed the Purchase Price would be due and payable. 29     Given our conclusion that there was no collateral agreement at all and certainly nothing that varied the payment terms that were contained in the sale and purchase agreements, it must follow that Dynasty owed a continuing obligation to answer for the liabilities under and in accordance with those payment terms. Under cl 3 of the agreements, Dynasty was liable to pay the full amount of HK$230,391,463 stated in the payment schedule by 5 May 1996. In spite of these significant liabilities, Dynasty pledged away its only asset (ie, the Shares) pursuant to four transactions that were entered into between April 1996 and November 1997. 30     The first of these transactions was on 23 April 1996 in which 12,032,302 CDC shares (or 40.7% of the Shares) were pledged to Commerzbank as security for a loan facility to Sia. This was barely a fortnight before the said amount of HK$230,391,463 fell due. It appears that details pertaining to the loan facility, such as the principal, interest and amount drawn down, were not in evidence. Dynasty asserts that the loan facility was for a sum of US$40m but this has been disputed by Sia and Lee. Whatever the figure might have been, Dynasty did not itself stand to receiveanymonies pursuant to the loan facility. There was some debate over the fact that Dynasty had not proved the actual amount of the loans to the third parties. In our judgment this was immaterial. The fact is that Sia, and in relation to the first pledge, Lee, had caused Dynasty to place the shares with the banks to secure loans and advances to Sia and his associates. If Sia and Lee were contending that the amounts of such loans were so small that there was ample residual value in the pledged shares, it was incumbent on them to prove this. This, they did not do. 31     The subsequent pledges followed a similar pattern, resulting in the further deterioration of Dynasty’s financial position due to its diminishing ability to repay its debts owed under the sale and purchase agreements. 32     The circumstances described above form the context in which we assess one of the key issues in the appeal, namely, whether Sia and Lee had breached their fiduciary duties under BVI law in causing Dynasty to enter into the Security Transactions in circumstances when they knew or must have known that Dynasty was insolvent or of doubtful solvency or would become so as a result of entering into these transactions. 33     It is important to approach this inquiry from the perspective that the purpose of determining Dynasty’s solvency at the time of the Security Transactions is to establish whether Sia and Lee had breached their fiduciary duties. We are not concerned here with the question of whether Dynasty was technically insolvent or whether it would have been appropriate to liquidate the company. Therefore, a strict and technical application of the “going concern” test and the “balance sheet” test which are used in the context of a winding up action would be of limited utility in the present circumstances.[note: 14] 34     Rather, the key issue before us calls for a broader assessment of the surrounding circumstances of the case. Under BVI law – and indeed, in Singapore law too – a director of a company is affixed with fiduciary duties. This calls for the consideration of the company’s best interests having regard to the position of its shareholders as well as of its creditors. The weight to be accorded to these interests will vary according to the financial health of the company. Where the company is in robust financial health with little, if any, risk to the interests of its creditors a director would be entitled to pay greater heed to what is best for the shareholders. But where there are mounting concerns over its financial health, the pendulum will swing towards the creditors. As observed by Dynasty’s BVI law expert, Mr Simon Edward Lawrenson (“Mr Lawrenson”), this assessment would include a consideration of all claims, debts, liabilities and obligations of a company.[note: 15]The general financial health and solvency of the company is considered in this context in order to ascertain if there was reason to doubt or to be concerned over the financial viability of the company,[note: 16]especially at the time of the Security Transactions.[note: 17] 35     This broader inquiry reflects the shift in focus that we have alluded to. Both BVI law experts were agreed that the interests of creditors would come to the fore when the company is insolvent or likely to be insolvent.[note: 18]In such circumstances, focussing solely on the interests of shareholders would be incorrect. Moreover, the interests of the creditors are not to be considered in an arid and technical way as if all such considerations are irrelevant or capable of being ignored until and unless the company is found to be technically insolvent. Yet this appeared to be the effect of the analysis undertaken by the Judge and urged upon us by Mr Chacko. On the contrary, as long as there are reasons to be concerned that the creditors’ interests are or will be at risk because of difficult financial circumstances, the directors ignore those interests at their peril. 36     In the circumstances described at [29] above, we think that at the time of the Security Transactions there were ample grounds for the directors of Dynasty to have concerns that Dynasty would be in a position of or approaching insolvency if it went ahead with those transactions. As mentioned, significant liabilities were owed by Dynasty to the Vendors at the time the Security Transactions were entered into. Dynasty had no other means of meeting those liabilities as the Shares were its only asset. Yet, under the Security Transactions, it would dispose of that asset on terms that Dynasty would not receive any monies from the loans obtained under the Security Transactions. In the round, there can be no doubt that the Security Transactions imperilled Dynasty’s ability to satisfy its liabilities and we therefore have no hesitation in concluding that, by entering into the Security Transactions, Dynasty’s ability to meet its obligations under the sale and purchase agreements was severely compromised. Sia did not seriously dispute this other than by citing the alleged collateral agreement which we have already rejected. Sia’s liability for breach of fiduciary duty 37     We come to the question of whether Sia had breached his fiduciary duties as a director of Dynasty. Since Dynasty imperilled its solvency by entering into the Security Transactions, the interests of Dynasty’s creditors had intervened by this stage. 38     Sia was undoubtedly the moving force of Dynasty. He had an intimate knowledge of Dynasty’s commercial affairs and had signed the documents for the Security Transactions. In particular, Sia knew that: (a)     Dynasty had not fully paid for the Shares; (b)     there were significant amounts owing to the Vendors under the sale and purchase agreements; (c)     the Shares were Dynasty’s only asset; and (d)     Dynasty would not receive any part of the loans secured by the Shares. There was no collateral agreement which affected these considerations. 39     Given these circumstances, Sia knew or must have known that by pledging the Shares as collateral for loans to himself and third parties, he had directly jeopardised or prejudiced Dynasty’s ability to repay the liabilities that it owed to its creditors. As it turned out, Dynasty was, in fact, unable to repay its creditors when the Borrowers (including Sia) defaulted on the loans and the Shares were then sold by the various financial institutions to satisfy the debts owed to them. 40     The position might well have been different if Dynasty had pledged the Shares as security for loans toitself. In that situation there would have been a substitution of assets such that even if Dynasty had parted company with the Shares, it would have received the loan proceeds in place of the Shares. In such circumstances, the effect of the Security Transactions might not have been to deplete the capital base of Dynasty. But that was not the case here. The effect of the Security Transactions was that the company put its sole asset at risk for no perceptible benefit to itself. 41     In the circumstances, it is difficult to avoid the conclusion that Sia breached his duty by wholly disregarding interests of Dynasty’s creditors. Much was made of the fact that Dynasty was authorised by its memorandum and articles and BVI law to enter into transactions that did not have a corporate benefit. Section 9 of the BVI International Business Companies Act 1984 (“the BIBCA”) provides that: 9.(1)Subject to any limitations or provisions to the contraryin its memorandum or articles,this Actor any other law for the time being in force in the British Virgin Islands, a company incorporated under this Act has the power, irrespective of corporate benefit, to perform all acts and engage in all activities necessary or conducive to the conduct, promotion or attainment of the objects or purposes of the company, including the power to do the following – … (g)    guarantee a liability or obligation of any person and to secure any of its obligations by mortgage, pledge or other charge, of any of its assets for that purpose; [emphasis added] 42     As Mr Lawrenson testified under cross-examination[note: 19], this created apowerto enter into certain transactions but as is made clear by the opening words of s 9, the exercise of such a power is subject to the overriding duties of a director. This includes the duties stated in s 54 of the BIBCA which provides that: 54.(1)    Every director, officer, agent and liquidator of a company incorporated under this Act, in performing his functions, shall act honestly and in good faith with a view to the best interests of the company and exercise the care, diligence and skill that a reasonably prudent person would exercise in comparable circumstances. (2)    No provision in the memorandum or articles of a company incorporated under this Act or in any agreement entered into by the company relieves a director, officer, agent or liquidator of the company from the duty to act in accordance with the memorandum or articles or from any personal liability arising from his management of the business and affairs of the company. 43     In causing Dynasty to enter into the Security Transactions, Sia placed Dynasty’s sole asset at risk for his own benefit and for the benefit of his business associate (Franklin Syah) and a company which he co-owned with Lee (Beswil). His actions directly resulted in the depletion of Dynasty’s assets to the prejudice and detriment of the Vendors who were still owed substantial amounts under the sale and purchase agreements. In our judgment, in acting in total disregard of the interests of the company’s creditors Sia breached his fiduciary duty as a director of Dynasty. Lee’s liability for breach of fiduciary duty 44     Lee attempted to distance his own position from Sia’s by arguing that: (a)     he did not know that Dynasty had creditors; (b)     he was entitled to assume that the Shares had been fully paid for as they had already been transferred to Dynasty; (c)     he did not know of the Share Pledges; and (d)     although he had signed the first pledge, he had only done so upon Sia’s request. 45     We find it difficult to accept that Lee was completely ignorant of Dynasty’s affairs because he was an experienced businessman and had been involved in the management of publicly listed companies for a number of years.[note: 20]Furthermore, Lee had a 20% share in the profits of Dynasty. 46     It was therefore unlikely that Lee would have refrained from making any enquires whatsoever about the value of the Shares when he had a sizable financial interest in Dynasty. Upon such enquiries, Sia would be expected to have informed Lee of the value of the Shares and the fact that the Shares had not been fully paid for. Further, Mr Lawrenson opined (and we agree) that an absence of knowledge of Dynasty’s insolvency on Lee’s part in these circumstances was not a defence to Lee’s duties to make due inquiry and establish the financial health of Dynasty.[note: 21]Indeed, it was incumbent upon Lee to know what the assets and liabilities of Dynasty were.[note: 22] 47     Crucially, Lee must have been aware of the nature of the first pledge since he had in fact signed the documents relating to the pledge. During cross-examination, Lee testified that he had made no enquiries regarding the documents because he had trusted Sia and had assumed that it was a formality that the bank had imposed.[note: 23] 48     We think that Lee, having signed the documents relating to the first pledge, must at least at that point have made the necessary enquiries as a director of Dynasty. Had he done so, he would have known that Dynasty was pledging a significant portion (namely, 12,032,302 shares or 40.7%) of the Shares as security for a loan facility to Sia. For the same reasons that Sia was liable for a breach of fiduciary duties, we are of the view that Lee too breached his fiduciary duties in signing the first pledge. 49     However, in relation to the subsequent pledges, Lee’s signature was not found on any of them and there was no evidence to suggest that he had any knowledge of them. Although one of the pledges was for loans made to Beswil, there is no evidence to show that Lee knew about the loan as a director of Beswil. Accordingly, we do not think that there is any evidential basis for Lee to be held liable for the subsequent pledges.",
        "Are Dynasty’s claims against Sia and Lee time-barred or defeated by laches or acquiescence?": "Are Dynasty’s claims time-barred? 50     Before we turn to the issue of the time bar, we first consider the preliminary issue of whether it is BVI or Singapore law that applies to the determination of the limitation period in this case given that the claim has been brought by a BVI company under BVI law. 51     The trial had apparently proceeded on the basis that Singapore law on limitations was applicable. Hence, the BVI law experts did not give any evidence as to the applicable limitations period under BVI law. The traditional rule is that the law of the forum governs procedural issues; and more specifically, the barring of a remedy on the expiration of the limitation period is generally considered a procedural issue because it does not extinguish the plaintiff’s rights (see generallyDicey, Morris and Collins on The Conflict of Laws(Lord Lawrence Collins gen ed) (Sweet & Maxwell, 15th Ed, 2012) at vol 1, paras 7R–001;Halsbury’s Laws of Singapore – Conflict of Lawsvol 6(2) (LexisNexis, 2013) at para 75.257; Andrew McGee,Limitation Periods(Sweet & Maxwell, 6th Ed, 2010) at para 2.019). It follows on the basis of these authorities (and leaving aside any question under the recently enacted Foreign Limitation Periods Act (Cap 111A, 2013 Rev Ed), which was not cited by either party and appears in any event to have been inapplicable since this matter commenced prior to the operative date of that statute) that Singapore law, being the law of the forum in the present proceedings, would apply to the issue of whether Dynasty’s claims are time-barred. 52     We therefore turn to consider the applicable provisions of the Limitation Act. Sections 6 and 22 provide as follows: Limitation of actions of contract and tort and certain other actions 6.—(1) Subject to this Act, the following actions shall not be brought after the expiration of 6 years from the date on which the cause of action accrued: (a)    actions founded on a contract or on tort; … (7)    Subject to sections 22 and 32, this section shall apply to all claims for specific performance of a contract or for an injunction or for other equitable relief whether the same be founded upon any contract or tort or upon any trust or other ground in equity. … Limitations of actions in respect of trust property 22.—(1) No period of limitation prescribed by this Act shall apply to an action by a beneficiary under a trust, being an action — (a)    in respect of any fraud or fraudulent breach of trust to which the trustee was a party or privy; or (b)    to recover from the trustee trust property or the proceeds thereof in the possession of the trustee, or previously received by the trustee and converted to his use. (2)    Subject to subsection (1), an action by a beneficiary to recover trust property or in respect of any breach of trust, not being an action for which a period of limitation is prescribed by any other provision of this Act, shall not be brought after the expiration of 6 years from the date on which the right of action accrued. 53     In this case, the six-year time bar in s 6 applies to Dynasty’s equitable claim for breach of fiduciary duties (see s 6(7) above). However, if Dynasty’s claim is for fraud or a fraudulent breach of trust, the six-year time bar is lifted (s 22(1)(a)). 54     The exception that is contained in s 22(1) was discussed at length inYong Kheng Leong and another v Panweld Trading Pte Ltd and another[2013] 1 SLR 173 (“Yong Kheng Leong”). There, a company brought a claim for breach of fiduciary duty against one of its directors who paid his wife a salary when she was not an employee of the company. We observed that the director dealt with the company’s property in breach of the trust and confidence that had been placed in him as a director. In assessing the applicability of the s 22(1)(a) exception, we noted that a breach of trust is fraudulent when it is dishonest (at [52]) and that the exception applied on the facts because the director had acted dishonestly in authorising the wrongful payments to his wife (at [53]). We also held that the payments to the director’s wife would not have been countenanced by the ordinary standards of reasonable and honest people (at [53]). 55     The present facts are similar. Sia and Lee dealt with Dynasty’s property in breach of the trust and confidence that had been placed in them as directors. Sia knew that Dynasty’s only asset (namely, the Shares) had not been fully paid for and indeed, that a substantial amount was still outstanding on the Purchase Price. In spite of this, Sia took loans on the security of the Shares for the benefit of himself and his related entities (including Beswil). As an experienced businessman, Sia must have realised that he was acting in a manner that was contrary to the interests of Dynasty’s creditors. 56     Sia’s defence was premised on the existence of the alleged collateral agreement, on the basis of which he contended that Dynasty was not insolvent or of doubtful solvency when the Security Transactions were entered into. Sia argued that in those circumstances he was entitled to treat Dynasty’s interests as synonymous with his own. As we have concluded above, there was no collateral agreement on the facts. Sia was therefore not entitled to proceed on the basis that there was no obligation falling imminently due to the Vendors for the Shares at the time he caused Dynasty to enter into the Security Transactions. As a result he was not entitled to equate his personal interest with that of Dynasty and to ignore the interests of the creditors. Nor do we think it material that Sia had breached his fiduciary duties to Dynasty under BVI law; we are satisfied that Sia’s actions fall well within the s 22(1)(a) exception and would not have been countenanced by the ordinary standards of reasonable and honest people. 57     Lee’s defence was similarly based on the existence of the collateral agreement. He also advanced the additional argument that he did not know that the Shares had not been fully paid for; nor, whether Dynasty had any creditors in the first place. For the same reason that Sia’s defence fails, so too must Lee’s in relation to the first pledge which he had actually signed. It may be noted that under the first pledge, Dynasty was pledging a significant portion (namely, 12,032,302 shares or 40.7%) of the Shares as security for a loan facility to Sia. Hence, the exception in s 22(1)(a) applies in this case and Dynasty’s claims against Sia are not time-barred. As for Lee, the time bar does not apply to the extent of his breach of fiduciary duty in relation to the first pledge. Are Dynasty’s claims against Sia and Lee defeated by laches or acquiescence? 58     The doctrine of laches has been summarised inCytec Industries Pte Ltd v APP Chemicals International (Mau) Ltd[2009] 4 SLR(R) 769[note: 24]at [46] (and cited with approval by this court ineSys Technologies Pte Ltd v nTan Corporate Advisory Pte Ltd[2013] 2 SLR 1200 at [37]–[38]) in these terms: Laches is a doctrine of equity. It is properly invoked where essentially there has been a substantial lapse of time coupled with circumstances where it would be practically unjust to give a remedy either because the party has by his conduct done that which might fairly be regarded as equivalent to a waiver thereof; or, where by his conduct and neglect he had, though perhaps not waiving that remedy, yet put the other party in a situation in which it would not be reasonable to place him, if the remedy were afterwards to be asserted (Sukhpreet Kaur Bajaj d/o Manjit Singh v Paramjit Singh Bajaj[2008] SGHC 207 at [23];Re Estate of Tan Kow Quee[2007] 2 SLR(R) 417 at [32]). This is a broad-based inquiry and it would be relevant to consider the length of delay before the claim was brought, the nature of the prejudice said to be suffered by the defendant, as well as any element of unconscionability in allowing the claim to be enforced (Re Estate of Tan Kow Queeat [38]). … 59     Lee did not plead in his defence that Dynasty’s claim was barred by either laches or acquiescence.[note: 25]Neither did he file an appeal against the Judge’s decision that Dynasty’s claims were not barred by laches or acquiescence. Therefore, no question arises as to Dynasty’s claim against Lee in this regard. 60     However, Sia pleaded that Dynasty was guilty of inordinate and inexcusable delay in bringing the Original Claim because the alleged facts on which the action was founded happened more than 14 years ago. Sia further pleaded that Low would have been aware of these alleged facts between 1996 and 2001 and would have been in a position to pursue the relevant claims against him at that time but did not. 61     On the present facts, although there was unquestionably some delay on the part of Dynasty in bringing the Original Claim, we do not think that this delay is sufficient in the circumstances to bar Dynasty’s claim. On 10 June 1999, Low and the Vendors commenced HCA 9505 against Dynasty for the unpaid balance of the Purchase Price. In April 2001, Low obtained judgment against Dynasty in HCA 9505 for the unpaid balance of the Purchase Price amounting to HK$113,633,160.51. Shortly after obtaining judgment, Low was informed by his legal advisors that there would be a chance of recovering his money if Dynasty was wound up.[note: 26]Low explained under cross-examination that he did not do anything after obtaining the judgment in HCA 9505 because he was experiencing both health issues and financial difficulties at that time.[note: 27]He also testified that: (a) he was waiting for his financials to pick up before he pursued the matter because he had been told that the judgment would be valid and could be acted upon for a period of 10 years[note: 28]and (b) his financials did eventually pick up in 2006.[note: 29] 62     On 23 August 2007, Lauren and Kennic Lai Hang Hui were appointed as the Provisional Liquidators of Dynasty pursuant to a petition by Low in HCCW 382 of 2007. Shortly after this, on 27 September 2007, the Provisional Liquidators commenced proceedings on behalf of Dynasty against Sia and Lee in HCA 2057 for, among other things, breaches of fiduciary duties in relation to the Shares. Sia applied to stay Dynasty’s action on the ground that Hong Kong was not the appropriate forum. This application was initially dismissed by the Hong Kong Court of First Instance on 13 June 2008. However, on 25 May 2009, this was reversed by the Hong Kong Court of Appeal. Dynasty’s appeal to the Hong Kong Court of Final Appeal in FAMV 39 of 2009 was dismissed on 14 September 2009. On 22 December 2009, Low’s application to wind up Dynasty and appoint the Liquidators was granted by the BVI High Court and on 14 April 2010, the Liquidators commenced the present suit. 63     There was a delay of just over six years between April 2001 (when Low obtained judgment in HCA 9505) and August 2007 (when Low commenced winding up proceedings against Dynasty). We do not think that this was so unreasonable a delay given Low’s explanation that he had some health issues and financial difficulties, as well as the fact that he would have needed time to: (a) take legal advice on the way forward and as to whether he needed also to commence proceedings against Sia and Lee for breach of fiduciary duties; (b) commence winding up proceedings against Dynasty; (c) select liquidators; and (d) settle his personal and financial issues. As for the delay between August 2007 and April 2010 (when the present suit was commenced), this was mainly due to the protracted litigation (including two rounds of appeals) over Sia’s application to stay the proceedings in Hong Kong on the ground offorum non conveniens. 64     In addition, we do not think that there were any circumstances in this case that made it practically unjust to grant a remedy. While Sia has asserted that the lapse of time has severely prejudiced and impaired his ability to deal with the claims made against him[note: 30], he has failed to explain exactly how he has been prejudiced by the delay. 65     As for the defence of acquiescence, there is no evidence to suggest that Dynasty stood by in such a manner as to induce Sia and Lee to believe that it consented to the Security Transactions. 66     Therefore, Dynasty’s claims against Sia and Lee are not defeated by laches or acquiescence.",
        "Did Low, Lauren and Tacon conspire to cause injury to Sia through the pursuit of stale and baseless claims?": "67     Mr Chacko conceded at the hearing before us that his client’s appeal in Civil Appeal No 103 of 2013 would fail if Dynasty’s appeal in Civil Appeal No 105 of 2013 was allowed. Even if Mr Chacko had not made this concession, we do not think that Sia’s appeal against the dismissal of his conspiracy counterclaim would have succeeded in any event. 68     First, there is no evidence of an agreement between Low, Lauren and Tacon to cause injury to Sia through the pursuit of stale and baseless claims. Moreover, there is nothing in the engagement letter dated 7 May 2007 to suggest that the alleged conspirators agreed to cause injury to Sia. The letter merely sets out the proposed terms of engagement and the predicted scope of work for the Provisional Liquidators in relation to the intended winding up of Dynasty. 69     Second, in instituting proceedings against Sia, the alleged conspirators did not have the predominant purpose of causing injury to him. Sia alleges that there could have been no legitimate commercial benefit to Dynasty in pursuing its claims against him for breach of fiduciary duty because they were “obviously time-barred”, “barred by the doctrine of laches and acquiescence” and “wholly devoid of any basis in law or in fact”.[note: 31]However, as we have concluded, there were no merits in any of these defences or assertions. There is also no evidence that Low, Lauren and Tacon knew that their claims were baseless or “wholly devoid of any basis in law or in fact”; indeed, we have found to the contrary. 70     In addition, the predominant purpose of the Provisional Liquidators and the Liquidators in commencing HCA 2057 and the Original Claim respectively was legitimate: they were doing no more than discharging their duties as liquidators by attempting to recover Dynasty’s losses and maximising the assets available for distribution.",
        "Conclusion": "71     For the foregoing reasons, we find that Sia and Lee had breached their fiduciary duties owed as directors of Dynasty. However, Lee’s liability for breach only extends to the first pledge because there was no evidence that he knew of the other pledges. In addition, we are satisfied that Sia’s counterclaim in conspiracy has not been made out on the facts. 72     Accordingly, we dismiss Civil Appeal No 103 of 2013 and allow Civil Appeal No 105 of 2013. The damages available to Dynasty to the extent that we have found these are claimable against Sia and Lee for their breaches of fiduciary duty will be assessed by a High Court judge. 73     The appellants in Civil Appeal 105 of 2013 and the respondents in Civil Appeal 103 of 2013 are to have their costs of the appeals and their costs below. Such costs will be fixed by us if not agreed by the parties. In the event they are unable to come to an agreement, each party is to file and exchange written submissions which should be no more than six pages within 14 days from the date of this judgment. The submissions should set out the amounts proposed or claimed as the case may be and there will be no further submissions without the leave of this court.  [note: 1]Judgment at [28]. [note: 2]Judgment at [34]. [note: 3]Judgment at [38]. [note: 4]Judgment at [68]. [note: 5]Judgment at [78]. [note: 6]Judgment at [84]. [note: 7]Judgment at [151]. [note: 8]Judgment at [151]. [note: 9]Joint Record of Appeal (Vol V Part A) at 243-244. [note: 10]Appellant’s Core Bundle Vol II at 173. [note: 11]Joint Record of Appeal (Vol V Part C) at 39. [note: 12]Judgment at [69]. [note: 13]Appellant’s Core Bundle Vol II at 105-106. [note: 14]Joint Record of Appeal (Vol III Part Y) at 53. [note: 15]Joint Record of Appeal (Vol III Part Y) at 98. [note: 16]Joint Record of Appeal (Vol III Part Y) at 101. [note: 17]Joint Record of Appeal (Vol III Part Y) at 52. [note: 18]Joint Record of Appeal (Vol III Part R) at 244; Joint Record of Appeal (Vol III Part Y) at 52-53. [note: 19]Joint Record of Appeal (Vol III Part Y) at 92. [note: 20]Joint Record of Appeal (Vol III Part X) at 203. [note: 21]Joint Record of Appeal (Vol III Part Y) at 83. [note: 22]Joint Record of Appeal (Vol III Part Z) at 36; Joint Record of Appeal (Vol III Part Z) at 79-80. [note: 23]Joint Record of Appeal (Vol III Part X) at 210. [note: 24]2ndRespondent’s Bundle of Authorities in CA 105/2013, Tab 3. [note: 25]Record of Appeal (Vol II) at 34-38. [note: 26]1stRespondent’s Supplemental Core Bundle in CA 105/2013, p 90, line 15. [note: 27]1stRespondent’s Supplemental Core Bundle in CA 105/2013, p 91, line 21et seq. [note: 28]1stRespondent’s Supplemental Core Bundle in CA 105/2013, p 92, line 1et seq. [note: 29]1stRespondent’s Supplemental Core Bundle in CA 105/2013, p 94, lines 7-8. [note: 30]1stRespondent’s Case in CA 105/2013 at [129]. [note: 31]Appellant’s Case in CA 103/2013 at [106]."
    }
}