{
    "case_title": "Jurong Primewide Pte Ltd\n      v\n      Moh Seng Cranes Pte Ltd and others",
    "ncitation": "[2014] SGCA 6",
    "coram": "Sundaresh Menon CJ; \n      V K Rajah JA; \n      Quentin Loh J",
    "sections": {
        "Facts": "",
        "Parties to the dispute": "2       The appellant, Jurong Primewide Pte Ltd\n                    (“JPW”), was appointed by Crescendas Bionix Pte Ltd\n                    (“Crescendas”) the main management contractor to build a\n                    seven-storey multi-user business park development at a worksite located off\n                    Biopolis Drive/Biopolis Grove (“the worksite”). 3       The first respondent, Moh Seng Cranes Pte. Ltd.\n                    (“Moh Seng”), is in the business of letting out lifting cranes for\n                    hire. It was the owner of the damaged lifting crane WB 2032L\n                    (“crane”) and employer of one Lian Lam Hoe (“Lian”)\n                    who was operating the crane when the accident occurred. 4       The second respondent, Hup Hin Transport Co Pte\n                    Ltd (“Hup Hin”), leases heavy equipment, including lifting cranes.\n                    It had a rental agreement dated 3 March 2010 with JPW for the supply of\n                    cranes to the worksite on a per call basis (“crane supply\n                    contract”) and a hiring contract dated 7 August 2008 with Moh Seng\n                    to hire Moh Seng’s mobile cranes whenever required (“hiring\n                    contract”). 5       The third respondent, MA Builders Pte Ltd\n                    (“MA”), had various subcontracts (viz, the Temporary Works Subcontract dated 13 August 2008,\n                    the RC Subcontract dated 30 June 2009, the External Works Subcontract dated\n                    5 January 2010 and the Wet Trades Subcontract dated 13 January 2010)\n                    (collectively, “subcontracts”) with the Appellant to carry out\n                    structural, architectural and external works on the worksite. The flow chart\n                    below helps to illustrate the various relationships:",
        "Background to the dispute": "6       On 10 June 2010, MA made a request to JPW\n                    for a mobile crane to lift some steel rebars. JPW in turn then requested a\n                    50-tonne mobile crane from Hup Hin to be delivered to the worksite the next day.\n                    MA asserted that they had actually made a request for an 80-tonne mobile crane,\n                    not a 50-tonne mobile crane, and received no satisfactory reason from JPW why a\n                    50-tonne crane was ordered instead. JPW disputed this. Nevertheless, as Hup Hin\n                    did not have any 50-tonne cranes immediately available for hire, Hup Hin hired\n                    one from Moh Seng, on the basis that it would be delivered to the worksite the\n                    next morning. 7       On 11 June 2010, Lian drove the crane to\n                    the worksite. Upon arrival, he was directed by Kolanjiapan Sunder, the lifting\n                    supervisor (“Lifting Supervisor”) employed by MA, to park the\n                    crane at a designated location identified as “CL2” on the sitemap\n                    used in the proceedings below. CL2 was the location where the manhole was at.\n                    Lian raised concerns with the Lifting Supervisor that the designated location\n                    might be unable to take the weight of the crane. The Lifting Supervisor\n                    responded by assuring him that the ground comprised of hard flooring that could\n                    support the crane’s weight. Lian, nevertheless, continued to harbour\n                    concerns about the ground conditions and conveyed this to JPW’s Safety\n                    Officer, Kuah Teck Heng (“JPW’s Safety Officer”).\n                    JPW’s Safety Officer, after conferring with the Lifting Supervisor,\n                    reassured Lian that the ground indeed comprised of hard flooring.[note: 1]Relying on these assurances,\n                    Lian proceeded to deploy the crane in accordance with the instructions given by\n                    the Lifting Supervisor. 8       During the course of lifting at CL2, part of the\n                    crane collapsed into a concealed manhole in the following manner: while the\n                    crane’s left back outrigger was resting near the manhole, the boom of the\n                    crane swung from the left front of the crane towards the left back outrigger.\n                    The left back outrigger broke through the manhole cover and collapsed into the\n                    manhole, causing the crane to topple over. The parties all denied having\n                    knowledge of the manhole’s existence at the material time, and the manhole\n                    itself was not visible as it had been covered up with layers of brown soil when\n                    the accident occurred.",
        "The decision below": "9       The Judge confined his analysis to the following\n                    three issues: (a)     whether Moh Seng had a claim against\n                        Hup Hin in contract/bailment; (b)     whether Moh Seng had a claim against JPW and/or MA for\n                        negligence; and (c)     whether JPW was contractually entitled to be indemnified by Hup Hin and/or\n                        MA under their respective contracts with JPW. 10     On the first issue, the Judge observed inMoh Seng Cranes Pte Ltd v Hup Hin Transport Co Pte Ltd\n                        and others[2013] 2 SLR 1 (“GD”) that there was\n                    nothing in the crane supply contract between JPW and Hup Hin which obliged Hup\n                    Hin to secure cranes for JPW or to provide an unremunerated lifting supervisor\n                    for the worksite. He found that the legal basis of the relationship between JPW,\n                    Hup Hin and Moh Seng was an oral contract between the three parties (“the\n                    oral contract”) for Moh Seng to provide a crane with an operator to JPW\n                    on 11 June 2010, with no further role or involvement of Hup Hin save that\n                    Hup Hin would pay Moh Seng at the rates provided in the hiring contract. Hup Hin\n                    would in turn be paid by JPW at the rates provided in the crane supply contract.\n                    This oral contract was implemented by Moh Seng sending its crane, and JPW\n                    receiving it at the worksite. 11     As JPW was not a party to the hiring contract,\n                    the general “Terms And Conditions”\n                    [emphasis in original] attached to the hiring contract were not incorporated as\n                    terms of the oral contract. The Judge also rejected Moh Seng’s claims that\n                    there was an implied term in the hiring contract that Hup Hin would assume\n                    responsibility for the crane, and that there was a contract of bailment for\n                    valuable consideration. As regards the latter claim, the Judge found that the\n                    facts in the present case did not point towards the existence of a bailor-bailee\n                    relationship. Hup Hin had never received possession of the crane, which was\n                    delivered directly by Moh Seng to JPW at the worksite. Moh Seng’s\n                    contention that Hup Hin had received constructive possession or control of the\n                    crane and then “sub-hired” it to JPW was untenable in light of the\n                    factual matrix. 12     On the second issue, the Judge found that it\n                    was “undisputed that the proximate cause of the damage to the crane was\n                    the manhole which was concealed at the time of the lifting operations on\n                    11 June 2010” (GD at [24]). He then held that the test inSpandeck Engineering (S) Pte Ltd v Defence Science & Technology\n                        Agency[2007] 4 SLR(R) 100 (“Spandeck”) was satisfied in relation to JPW’s\n                    liability. Factual foreseeability was established as it was clearly foreseeable\n                    that JPW’s failure to take precautions with respect to a known unconcealed\n                    manhole could result in damage. Legal proximity was satisfied by the fact that\n                    JPW had ordered the crane for lifting works. There were also no policy reasons\n                    weighing against the imposition of such a duty of care on JPW. In fact, imposing\n                    such a duty would be consistent with the policy reasons underlying the Workplace\n                    Safety and Health Act (Cap 354A, 2009 Rev Ed) (“the\n                    WSHA”). Despite having knowledge about the manhole by 12 August\n                    2008, JPW did nothing about it. MA could not have knowledge about the manhole,\n                    as they would never have constructed a washing bay close to the manhole if it\n                    was aware that the manhole was nearby. The Judge found that JPW did not take\n                    reasonable care to properly mark and cordon off the manhole and direct the\n                    subcontractors to take the appropriate action. 13     The Judge also held that there was no\n                    contributory negligence attributable to Moh Seng and MA. Lian had acted\n                    reasonably and had fully discharged his responsibility as a crane operator. As\n                    to whether MA had contributed to the damage due to its nearby excavation works\n                    as the excavated soil would have run off to cover the manhole, the Judge found\n                    that the manhole remained concealed even before the excavated soil run-off. MA,\n                    therefore, did not contribute to the accident as the excavation work had been\n                    carried out without knowledge of the manhole’s existence. 14     On the third issue, the Judge dismissed\n                    JPW’s contractual claims against both Hup Hin and MA. He found that the\n                    crane supply contract which contained the indemnity clauses was a bilateral\n                    contract between JPW and Hup Hin, and was not incorporated into the oral\n                    contract between the three parties. He also found that JPW’s claim against\n                    MA for breach of the subcontracts in failing to comply with all workplace safety\n                    requirements failed as he had already rejected JPW’s Safety\n                    Officer’s evidence that he had instructed the crane to be removed from the\n                    washing bay area. The Judge construed “wilful default” as used in\n                    the indemnity clause (cl 12.3.4) in the subcontract to refer to JPW’s\n                    failure to take reasonable care in the circumstances, which he had earlier\n                    established. Hence, JPW had no basis to claim an indemnity from\n                MA.",
        "Appellant’s case": "15     JPW’s main focus in this appeal was on\n                    the Judge’s finding that JPW was solely liable to Moh Seng for negligence,\n                    without any contribution from MA and Hup Hin. On this issue, JPW disputed a few\n                    of the Judge’sfactualfindings and asserted\n                    the following: (a) the Lifting Supervisor was not an agent or\n                    representative of JPW, but MA; (b) MA was aware of the existence of the\n                    manhole which had been concealed by the soil excavated by MA; and\n                    (c) JPW’s Safety Officer had asked for the crane to be removed from\n                    the danger area. 16     Legally, JPW asserted that no duty of care\n                    arose as there was no legal proximity: there was no close and direct\n                    relationship between JPW and Moh Seng, and the fact that JPW was the licensed\n                    occupier did not suffice to establish proximity. Further, as a matter of policy,\n                    a duty of care should not be superimposed on a contractual framework, such as\n                    the two written contracts (hiring contract and crane supply contract). As to the\n                    standard of care, JPW emphasised that they were only theoccupiersof the worksite (as holder of the factory license) and\n                    should have their duties limited to appointing a qualified lifting supervisor,\n                    implementing a permit-to-work system and ensuring that MA carried out its work\n                    properly and safely. There was no breach of any duty of care as JPW had already\n                    taken all reasonably practicable safety measures. On the issue of causation, the\n                    Judge also failed to state how JPW’s conduct contributed to the damage as\n                    MA was aware of the manhole too and JPW’s Safety Officer had instructed\n                    the crane to be moved away from the CL2 location. 17     Further, even if JPW were to be found\n                    negligent, the respondents should at least be found to be contributorily\n                    negligent. Moh Seng was negligent as Lian did not follow JPW’s Safety\n                    Officer’s instructions, and Moh Seng had failed to obtain the requisite\n                    permit to work for the lifting operation and to carry out risk assessments. MA\n                    was negligent/contributorily negligent as they had concealed the manhole, knew\n                    about the manhole and was in direct control and possession of the area of the\n                    accident. Hup Hin was negligent in failing to provide a site representative and\n                    not taking any steps to address the risks involved with Lian going to the\n                    worksite for the first time. 18     Contractually, JPW argued that the Judge erred\n                    in finding a tripartite oral contract between the three parties as this was not\n                    even pleaded, and in any event, the parties had clearly arranged their\n                    relationships with two separate written contracts. JPW submitted that the Judge\n                    erred in dismissing its claims against Hup Hin and MA for contractual indemnity\n                    under the crane supply contract and the subcontracts respectively. The Judge\n                    also erred in dismissing JPW’s claim against Hup Hin and MA for the breach\n                    of those two contracts.",
        "Respondents’ case": "",
        "Moh Seng’s arguments": "19     Moh Seng argued that JPW clearly owed a duty\n                    of care as it (a) had overall control and possession of the worksite;\n                    (b) knew about the presence of the manhole; (c) designated the crane\n                    access at the worksite; (d) reviewed MA’s risk assessments; and\n                    (e) had its own Safety Officer who expected to be obeyed by everyone else.\n                    This was further affirmed by the statutory regime put in place by the WSHA.\n                    There was no contributory negligence on Moh Seng’s part due to\n                    Lian’s acts of prudence at the material time. In fact, Lian had gone\n                    beyond his duty by informing the Lifting Supervisor and JPW’s Safety\n                    Officer of his concerns regarding the ground conditions.",
        "Hup Hin’s arguments": "20     Hup Hin argued that it was undisputed industry\n                    practice that (a) the owner of the crane supplied a crane operator;\n                    (b) the hire of a crane did not come with a lifting or site supervisor,\n                    rigger and signalman unless requested for; (c) the crane owner was\n                    responsible for the insurance of the crane; and (d) the crane owner would\n                    be responsible for losses and damages to a crane if an accident was caused by\n                    its own operator. Moreover, on a broader causation issue, it was clear that Hup\n                    Hin was never involved with any of that morning’s events and the evidence\n                    showed that the accident was caused by the systemic failure in JPW’s work\n                    system in failing to detect the presence of a manhole which they should have\n                    been aware of.",
        "MA’s arguments": "21     MA argued that JPW took a serious risk in\n                    failing to cordon off or place warning signs to alert the subcontractors to the\n                    presence of the manhole, despite having effective control of the worksite and\n                    principal responsibility for the worksite under the WSHA. MA, in turn, was not\n                    liable in negligence because the lifting operations in question were not part of\n                    MA’s duties. The Lifting Supervisor was not under MA’s supervision\n                    and direction at that time (as he had been seconded to JPW pursuant to a\n                    secondment agreement, or waspro hac vicethe\n                    servant and/or agent of JPW’s). Moreover, MA had no knowledge and could\n                    not be expected to have any knowledge of the manhole; in fact, MA would not even\n                    be able to meet the threshold factual foreseeability test inSpandeckas they were not even aware of the concealed manhole.\n                    Even if factual foreseeability was made out, there was no proximity between Moh\n                    Seng and MA to support the imposition of a duty of care: there was no\n                    contractual relationship, and neither had Moh Seng relied on MA for the lifting\n                    operation.",
        "Issues before this Court": "22     Three broad issues were put before us: (a)     whether JPW, MA, Hup Hin and/or Moh\n                        Seng were negligent; (b)     whether MA and/or Hup Hin were in breach of their contracts with JPW;\n                        and (c)     whether JPW\n                        should be indemnified by MA and/or Hup Hin.",
        "Common law negligence": "Factual disputes 23     Two factual disputes remained alive, namely,\n                    (a) whether the Lifting Supervisor was representing JPW or MA at the time\n                    of the accident; and (b) whether JPW’s Safety Officer had given\n                    certain instructions to Lian on the morning of the accident. We will address\n                    them both before considering the legal issues. (1)   Lifting Supervisor: JPW or MA? 24     JPW and MA took contrary stances as to who\n                    employed the Lifting Supervisor. The Judge stated that it wasundisputedthat “JPW’s Worksite representatives\n                    included ... Lifting Supervisor Kolanjiapan Sunder (“Lifting\n                    Supervisor”)” (GD at [18]). However, with respect, it was odd that\n                    the Judge should have come to that conclusion given that this issuewasin fact disputed at the trial below and continued to\n                    be so on appeal. In essence, JPW contended that “it is not disputed that\n                    the Lifting Supervisor is [MA’s] employee”[note: 2]while MA\n                    maintained that the Lifting Supervisor was “pro hac\n                        viceof [JPW]” and on\n                        “secondment”[note: 3]to JPW. 25     The confusion may be traced to an interim\n                    agreement made during a project meeting on 27 August 2009, during which\n                    MA’s Project Manager Roger Kung and JPW’s Senior Project Manager Teo\n                    Boon Thong discussed,inter alia, an arrangement\n                    for MA to provide lifting supervisors for some crawler crane lifting operations.\n                    At that point, JPW did not have its own qualified lifting supervisors as the\n                    employees designated by JPW to be lifting supervisors were due to go on course.\n                    On 28 August 2009 at 2.22pm, Roger Kung sent Teo Boon Thong an email\n                    briefly mentioning the salient points of the meeting: Further to yesterday’s meeting at Jurong Summit Office. Please refer\n                        to the below confirmed items by your management: 1)Additional Mobile Crane to cover working areas\n                            where the 2 nos of crawler cranes can’t be reached (By JPW) MA\n                            will give notice to JPW 2 days in advance for crane\n                        booking 2)Provision of Lifting Supervisior\n                                (sic) & Signal men (By JPW). ... [emphasis added] 26     On the same day at 5.11pm, Teo Boon Thong\n                    replied, stating as follows[note: 4]: 2.    As discussed but MA to provide own riggers.In the mean time, we request MA assistance to\n                                provide the lift supervisors while we arrange for JPW’s lift\n                                supervisor. [emphasis added] 27     MA relied on these two emails as evidence of a\n                    purported secondment arrangement between JPW and MA. However, JPW subsequently\n                    appointed its own lifting supervisors Thiein Htut Win and Than Htike Aung who\n                    qualified for their roles on 27 October 2009 and 23 September 2009\n                    respectively, which, according to JPW, signalled the end of the Lifting\n                    Supervisor’s secondment to them. Accordingly, at the time of the accident\n                    the Lifting Supervisor was no longer acting for JPW, but was acting as\n                    MA’s site supervisor in addition to being their lifting\n                supervisor. 28     Several facts persuaded us that JPW’s\n                    version of events was to be preferred,ie, the\n                    Lifting Supervisor was employed by MA at the time of the accident. First, on the\n                    day of the accident he was wearing a white helmet with a\n                    “MA Builders” logo on it, a headgear worn by MA’s site\n                    supervisors, in contrast with the brown helmets worn by lifting supervisors\n                    – a practice confirmed by MA’s Roger Kung[note: 5]. Secondly, the Lifting Supervisor\n                    signed off with “S/S” (representing “site\n                    supervisor”) on the second permit to work, under “Application by Supervisor-in-charge”, indicating\n                    that he was making the application as a site supervisor. This was a position\n                    that he had held under MA. Thirdly, the Lifting Supervisor identified himself as\n                    an employee of MA to the Ministry of Manpower’s Koh Chin Chin, who\n                    interviewed the Lifting Supervisor after the accident[note: 6]: Court:Did you ask him who employed\n                                            him?[Koh Chin Chin]:On his work permit card, it\n                                            says “Aloft\n                                    Builders”.Court:Who---Witness:I was told that Aloft\n                                            Builders is, erm, MA Builders’\n                                        subsidiary...Witness:Yah, when I took the\n                                            statement, I asked, “Hey, your card says\n                                            ‘Aloft Builders’\n                                        like”---Court:“Who are\n                                            they?”Witness:Yes, I\n                                    asked.Court:Then?Witness:And then that’s what\n                                            he told me. I---I’ll ask more to find out whether\n                                            it was a labour supplier or if he’s a direct\n                                            employee. And he said, “This is under MA\n                                            Builders.”   29     Koh Chin Chin also testified that the Lifting\n                    Supervisor had indicated that he took instructions only from MA’s Roger\n                        Kung[note: 7]: Witness:---lifting sup said he got\n                                            his directions from Roger Kung. He didn't get his\n                                            directions from anyone else....Witness:The lifting sup told me he\n                                            got his MA Builders, erm, Roger Kung is his boss. Gave\n                                            him instructions.   30     In contrast, MA’s submission that the\n                    Lifting Supervisor was seconded to JPW for all lifting operations, including the\n                    one during the accident or that he waspro hac\n                        vicethe servant and/or agent of JPW was not borne out by the\n                    evidence. The “LETTER OF APPOINTMENT” that MA pointed to as\n                    evidence of the secondment appeared to be nothing more than a confirmation by\n                    the Lifting Supervisor,as MA’s lifting\n                        supervisor, to abide by statutory safety regulations. As for the\n                    document submitted as MA’s summary of variation for the additional lifting\n                    crew supplied evidencing the alleged secondment, there is an item for\n                    “Additional Lifting Crew (24/12/2009-19/7/2010)”[note: 8]amounting to an addition of $113,628.00. While this was further particularised\n                    as “Lifting Supervisor (1 no)”, “Riggerman (2 nos)”,\n                    and “Signalman (2 nos)”, this did not point towards a secondment\n                    arrangement as this document appeared to be in exactly the same format as the\n                    original tender questionnaires submitted by MA to JPW,ie, it was a document varying the original tender documents to\n                    factor in additional lifting crew which MA had engaged in carrying out works.\n                    Notwithstanding the fact that it was unclear whether “Lifting Supervisor\n                    (1 no)” did actually refer to Kolanjiapan Sunder on 11 July 2010,\n                    the variation document was also silent on whether the additional lifting crew\n                    were for the purposes of carrying out works within MA’s own scope of work\n                    or some other seconded work. 31     We were therefore satisfied that the Lifting\n                    Supervisor was not the representative of JPW at the material time, but rather\n                    MA’s representative. (2)   JPW’s Safety Officer’s alleged\n                instructions 32     JPW and the respondents also disputed whether\n                    JPW’s Safety Officer had given instructions for the crane to be removed\n                    from the danger area. In his decision, the Judge rejected JPW’s Safety\n                    Officer’s evidence that he had done so as “it [was] puzzling that\n                    [JPW’s Safety Officer] would immediately walk away from the scene without\n                    ensuring that his instructions were promptly implemented”, and further,\n                    “[JPW’s] Safety Officer was accompanied by an assistant who\n                    similarly immediately walked away and was not instructed to remain to ensure\n                    removal of the crane” (GD at [32]). 33     We had reservations on the correctness of the\n                    Judge’s inference that JPW’s Safety Officer ought to have stayed\n                    behind to see his instructions carried out if he did indeed give those\n                    instructions (which JPW argued was based on “puzzling”\n                        logic[note: 9]). However, as we were satisfied that\n                    JPW’s Safety Officer did not give those instructions we need say no more\n                    about that particular finding. 34     JPW’s Safety Officer affirmed in his\n                    affidavit that during his discussion with the Lifting Supervisor, the Lifting\n                    Supervisor had told him that the land had already been backfilled. JPW’s\n                    Safety Officer then replied that he did not know about any filling up, and that\n                    to him “it was still a washing bay and that the Crane cannot park\n                        [there]”.[note: 10]Therefore, he “instructed [the\n                    Lifting Supervisor] to shift the Crane and not to park [there] any\n                        further”.[note: 11]Subsequently, when\n                    cross-examined, JPW’s Safety Officer modified his evidence and claimed\n                    that he not only gave the instruction for the crane to be moved away tothe Lifting Supervisor, but also toLianhimself.[note: 12]This point\n                    was not in JPW’s pleaded case and it was the first occasion that\n                    JPW’s Safety Officer had brought this up. Contrary to JPW’s Safety\n                    Officer’s (and JPW’s own Safety Coordinator) evidence, the other two\n                    individuals at the scene, Lian and the Lifting Supervisor, both disagreed that\n                    JPW’s Safety Officer had given the instructions for the crane to be moved.\n                    In fact, it was only JPW’s Safety Officer who asserted that the crane had\n                    previously been parked at a different location, identified as\n                    “CL1” on the sitemap and relatively far away from the manhole,\n                    whereas both Lian and the Lifting Supervisor testified that the crane had only\n                    been parked at CL2, which was where the manhole was located at. In addition,\n                    JPW’s Safety Officer was unable to explain why the permit-to-work for the\n                    lifting operation (which would have authorised CL2 as the place for the crane to\n                        work[note: 13]) was missing. 35     On the whole we found JPW’s Safety\n                    Officer’s evidence on this point to be unsatisfactory and found that he\n                    didnotgive the instructions for the crane to be\n                    moved away. Relevance of the WSHA (1)   Duty of care 36     The parties’ operational activities were\n                    all embraced by the regulatory framework installed by the WSHA and its relevant\n                    regulations (collectively, the “WSH Regime”). This had a\n                    significant bearing on our analysis of the parties’ conduct, their legal\n                    responsibilities and the imputation of negligence. 37     First, it is trite that there is no common law\n                    tort of careless performance of a statutory duty and the mere presence of a\n                    statutory duty does not automatically give rise to a concomitant common law duty\n                    of care (Animal Concerns Research & Education Society v\n                        Tan Boon Kwee[2011] 2 SLR 146 (“Animal Concerns”) at [21]–[23];Tan Juay Pah v Kimly Construction Pte Ltd and others[2012]\n                    2 SLR 549 (“Tan Juay Pah”) at\n                    [53]). Rather, the presence of statutory rules would fall within the rubric of\n                    the existing analysis for negligence. The classic framework for establishing a\n                    duty of care was clearly stated inSpandeck Engineering (S)\n                        Pte Ltd v Defence Science & Technology Agency[2007]\n                    4 SLR(R) 100 (“Spandeck”).\n                    There is first a threshold requirement of factual foreseeability before a\n                    two-stage test is applied (Spandeckat [115]). The\n                    first stage requires sufficient legal proximity, which is determined by the\n                    closeness of the parties’ relationship, supported by the defendant’s\n                    voluntary assumption of responsibility and the claimant’s actual reliance.\n                    It is a multi-faceted concept which is a measure of the parties’\n                    relationship in terms of nearness or closeness, and can also reflect an\n                    assumption of responsibility by one party to another. If established, there\n                    would be aprima facieduty of care. The second\n                    stage involves policy considerations to decide if theprima\n                        facieduty should be negated, such as the presence of a\n                    contractual matrix within which parties have defined their rights and\n                    liabilities, or the relative bargaining positions of the parties (Spandeckat [83]). 38     The effect of the WSH Regime on the issue of\n                    whether there exists a duty of care in negligence was discussed at length inTan Juay Pah, a case which also involved the\n                    collapse of a tower crane which resulted in the deaths of three workers.\n                    However, a significant difference was that the alleged negligence inTan Juay Pahwas that of theauthorised examiner, whose duty was prescribed under the WSH\n                    Regime, and not thecrane operator, contractor, subcontractor\n                        and crane supplier, as was the case here. The main contractor inTan Juay Pahhad sued the subcontractor, which\n                    in turn brought in the authorised examiner as a third party, claiming an\n                    indemnity against the subcontractor in the event that the latter was found\n                    liable to the main contractor. At the trial, the main contractor succeeded in\n                    its claim against the subcontractor, which in turn succeeded in its claim of\n                    indemnity against the authorised examiner. The authorised examiner appealed\n                    against the High Court’s decision. On appeal to this Court, it was\n                    established that the subcontractor needed to show that the authorised examiner\n                    was liable to the main contractor directly for the same damage that the\n                    subcontractor had caused by the crane collapse. Hence, the crucial question was\n                    whether the authorised examiner owed a duty of care at common law to the main\n                    contractor even though the authorised examiner was not engaged by the main\n                    contractor but by the subcontractor renting out the tower crane. 39     InTan Juay Pah,\n                    this Court made general observations about the WSH Regime and the imposition of\n                    a common law duty of care under it. First, a party seeking to establish a\n                    private right of action for a breach of a statutory duty has to show that\n                    Parliament intended for the members protected by that statutory duty to have\n                    such a right of action. Secondly, the mere existence of a statutory remedy or\n                    sanction for a breach of the duty is not decisive on matter of whether there is\n                    a private right of action. Thirdly, each statute has to be considered\n                    contextually; formulas are not helpful. Fourthly, the underlying statutory\n                    scheme and parliamentary intention go to the second limb ofSpandeck, not the first. Crucially, this Court inTan Juay Pahidentified the main underlying objective of\n                    the WSH Regime as follows (at [68], [73] and [89]): 68    …[T]he objective of the WSH Bill (which was later\n                                enacted as the Workplace Safety and Health Act 2006 (Act 7 of 2006))\n                                was to protect workers and members of the public present at a\n                                workplace from injury by deterring risk-taking behaviour (through\n                                the imposition of liability for such behaviour) on the part of\n                                persons who create and have control over safety risks at\n                                workplaces.To achieve this objective, a “more\n                            direct liability regime” (see Singapore Parliamentary Debates\n                            vol 80 at col 2209) was put in place under Pt IV of the\n                            WSH Bill to hold various groups of persons accountable for\n                            workers’ safety and health according to their different\n                            capacities. We observe that while an AE does not fall under any of the\n                            categories of persons enumerated in Pt IV of the WSH Bill,a main contractor and a subcontractor may fall\n                                under one or more of those categories(eg, as an employer under cl 12 of the WSH Bill, or\n                            as a manufacturer and supplier of machinery under cl 16). The\n                            structure of the WSH Bill suggests thatthe liability\n                                of an AE under the WSH Regime issecondaryto that of the persons\n                                specifically mentioned in Pt IV of the WSH Bill\n                                (inter alia, contractors and subcontractors). … 73    … It is clear, in our view, that while the\n                            office of the AE is an integral part of the WSH Regime’s overall\n                            statutory purpose of ensuring workplace safety (see [56]–[61]\n                            above),the statutory objective is not to protect\n                                contractors and/or subcontractors as they have primary\n                                responsibility for all aspects of safety at a workplace.Indeed, Dr Ng’s statements in Parliament during the second\n                            reading of the WSH Bill (see above at [66]) suggest that the objective\n                            of the WSH Regime is to guard against safety lapses at workplaces by\n                            contractors and those to whom they have delegated operational control of\n                            their work. … … 89    … [W]hat we consider to be [the\n                            WSHA’s] primary objective – namely, ensuring the safety of\n                            those present at workplaces (particularly workers), andattributing responsibility for workplace safety to those\n                                having operational control of workplaces.…[T]he WSHA is intended to protect persons present at\n                                workplaces from safety lapses by contractors and their\n                                subcontractors… [original emphasis in italics, emphasis added in bold] 40     Moreover, the prevailing intention behind the\n                    WSHA was precisely to create a system of accountability by defining the\n                    responsibilities of various persons at workplaces, as explained by the then\n                    Minister of Manpower Dr Ng Eng Hen during the second reading of the\n                    Workplace Safety and Health Bill 2005 (Bill 36 of 2005) (Singapore Parliamentary Debates,Official\n                        Report(17 January 2006) vol 80) at cols\n                    2208–2210: Third, this Bill will betterdefine persons who are\n                            accountable, their responsibilities and institute penaltieswhich reflect the true economic and social cost of risks and accidents.\n                        Penalties should be sufficient to deter risk-taking behaviour and ensure\n                        that companies areproactive in preventing\n                            incidents. Appropriately, companies and persons that showpoor safety managementshould be penalised\n                        even if no accident has occurred. This Bill will put into place a new and more effective framework to reduce\n                        accidents at the workplace - to bring about a quantum improvement in OSH\n                        standards and to achieve our intermediate goal of halving the present\n                        occupational fatality rate by 2015. [emphasis added] 41     From the foregoing it is clear that\n                    contractors and subcontractors (as JPW and MA were, respectively) are precisely\n                    the entities which the WSHA seeks to increase direct liability on for workplace\n                    safety. They have “primary responsibility” in all areas of safety,\n                    given their “operational control” of workplaces. In fact, the main\n                    purpose of the WSHA is to strengthen the accountability of and impose\n                    responsibilities on parties such as the main contractor and subcontractors so as\n                    to ensure a safer working environment at construction sites. These statutory\n                    responsibilities also complement the very aims of the common law tort of\n                    negligence, which is concerned with ensuring that negligent conduct, within\n                    legal limits, would attract corresponding liability. The law of tort serves two\n                    functions here: it is an engine of compensation as well as a financial\n                    deterrent. The law governing the establishment of a duty of care in turn helps\n                    to limit claims in negligence to only parties with sufficient proximity and\n                    foreseeability, so that the net of liability is not cast too widely. Plainly,\n                    contractors and subcontractors are parties whose negligence on construction\n                    sites has the most potential to result in fatal, or at least costly,\n                    consequences, given their well-placed abilities to foresee and be aware of the\n                    various possible mishaps that others without operational responsibilities and\n                    control may not be able to identify. In fact, it would be very hard to think of\n                    situations where sufficient proximity to give rise to a common law duty of care\n                    will not be found to exist due to the control contractors and subcontractors\n                    have over the worksite and the on-going activities on it. 42     The WSHA is clearly focussed on strengthening\n                    the safety management of worksites as its primary aim. By placing heavy\n                    responsibilities on contractors and subcontractors, the scheme of the WSHA\n                    intends that the burden of making worksites as free from hazards as possible and\n                    installing necessary systems and safeguards would fall on these\n                parties. (2)   Standard of care 43     The standard of care required in relation to a\n                    duty of care is usually the general objective standard of a reasonable person\n                    using ordinary care and skill (Blyth v The Company of\n                        Proprietors of the Birmingham Waterworks(1856) 11 Exch\n                    781). However, factors such as industry standards and normal practice can be\n                    taken into account at this stage. Cases such asThe\n                        “Emma Maersk”[2006] SGHC 180 (at [51]) andTesa Tape Asia Pacific Pte Ltd v Wing Seng Logistics Pte\n                        Ltd[2006] 3 SLR(R) 116 at ([17]) are instances where the\n                    courts accepted what was shown to be normal practice to be the standard of care.\n                    As such, we affirm the Judge’s observation that the industry standard\n                    guidance provided by the Singapore Standard SS 536 2008 Code of Practice\n                    (“the Code”) for the safe use of mobile cranes would be applicable\n                    here (GD at [26]). We note that the Code was listed as a useful reference under\n                    the Workplace Safety and Health Council’s Technical Advisory for the Safe\n                    Operation of Lifting Equipment. Significantly, the Code was accepted as the\n                    “reasonable standard of care to be observed by crane operators” by\n                    all counsel during the trial.[note: 14]In addition to the\n                    Code, the stipulations under the WSHA would also be relevant in pitching the\n                    standard of care. Whether JPW was negligent 44     On the existence of a duty of care towards Moh\n                    Seng, JPW submitted that the Judge’s summary conclusion that legal\n                    proximity was satisfied simply because JPW had ordered the crane for lifting\n                    works was overly simplistic, and failed to take into account the fact that there\n                    was no direct contractual relationship between JPW and Moh Seng. Rather, JPW\n                    asserted there had been very little communication between JPW and Moh Seng (if\n                    at all). It was the Lifting Supervisor, who was an employee of MA, who had\n                    assumed all responsibility. Moreover, the lifting operations were part of\n                    MA’s scope of work under the subcontracts, and the individuals in charge\n                    of the part of the worksite where the accident took place were MA’s\n                    personnel. 45     We acknowledge that the brevity of the\n                    Judge’s reasoning did not satisfactorily explain the basis of legal\n                    proximity. However, his finding that such proximity did exist between JPW and\n                    Moh Seng was nonetheless correct. As explained above, as main contractor, JPW\n                    would alreadyprima faciehave owed a duty of care\n                    to Moh Seng simply by virtue of being identified heavily as a responsibility\n                    bearer by the WSHA. Moreover, JPW’s narrow and overly-technical\n                    demarcation of its relationships down to formal contractual lines failed to take\n                    into account the reality that it: (a) did exercise effective control and\n                    possession over the worksite as main contractor; and (b) must be taken to\n                    have had knowledge about the location of the manhole. 46     JPW was given effective management and control\n                    of the worksite under its main management contract with Crescendas. This was\n                    common ground. As noted inTan Juay Pahat [53],\n                    “[u]nder the first limb of theSpandecktest, one of the many factors taken into consideration is the existence of a\n                    statutory duty”. It was undisputed that JPW was an\n                    “occupier” as defined under the WSHA (ie, “the person who has charge, management or control of\n                    those premises either on his own account or as an agent of another person,\n                    whether or not he is also the owner of those premises”), and had to\n                    fulfil the relevant duties and responsibilities under it. The Judge found that\n                    (GD at [18]): …[It was] beyond debate and confirmed by the subpoenaed Ministry of\n                        Manpower officer Koh Chin Chin that JPW had principal responsibility for the\n                        Worksite under the Workplace and Safety Health Act (Cap 354A, 2009\n                        Rev Ed), and that JPW had appointed the requisite officers to discharge\n                        such responsibility… This finding was also supported by the evidence given by Koh Chin Chin\n                    at trial.[note: 15]The relevant duties of an occupier under s 11 of the WSHA are as\n                    follows: Duty of occupier of\n                            workplace 11.    It shall be the duty of every occupier\n                            of any workplace to take, so far as is reasonably practicable, such\n                            measures to ensure that — (a)    the workplace; (b)    all means of\n                                access to or egress from the workplace; and (c)    any machinery,\n                                equipment, plant, article or substance kept on the\n                            workplace, aresafe and without risks to healthto\n                        every person within those premises, whether or not the person is at work or\n                        is an employee of the occupier. [emphasis added] 47     As an “occupier” under the WSHA,\n                    JPW could not expect to abrogate from its duty to ensure safety at the worksite\n                    simply by looking at the strict contractual arrangements between the parties.\n                    While acknowledging that it was thelicensed\n                        occupierof the worksite, JPW attempted to draw “a\n                    distinction between a general duty of care owed by an occupiervis-a-visthe land (occupier’s liability) andvis-a-visthe operations being carried out\n                        (negligence)”[note: 16]. Yet, this distinction has already\n                    ceased to exist with this Court’s decision inSee Toh\n                        Siew Kee v Ho Ah Lam Ferrocement (Pte) Ltd and others[2013]\n                    3 SLR 284 (“See Toh Siew Kee”)\n                    where it was emphatically established that the “law in Singapore on\n                    occupiers’ liability can and should be subsumed under the tort of\n                    negligence” (at [76]). InSee Toh Siew Keethis Court held that the first limb ofSpandeckwould be satisfied in the vast majority of occupiers having control of the\n                    property which they occupy and/or the activities carried out there (at [80]).\n                    There was no reason why this should not be the case in JPW’s situation as\n                    the licensed occupier and main contractor of the worksite. Yet, it also bears\n                    noting that this Court’s statement that“the\n                        vast majority of occupiers having control of the property which they occupy\n                        and/or the activities carried out there de jure owe a prima facie duty of\n                        care to lawful entrants” [emphasis in original] (which\n                    there is no doubt Moh Seng was) was qualified by the observation that\n                    “this turns on the degree of control which an occupier has over the\n                    property concerned and/or the activities carried out there” (at [80]). In\n                    this respect, JPW and MA disputed whose scope of work the lifting operation\n                    which resulted in the accident came under (discussed in further detail below at\n                    [55]–[56]). 48     By their own admission, JPW also knew (at\n                    least since 12 August 2008 when photographs of the manhole were taken by\n                    JPW) about the existence of the manhole. In fact, it was JPW’s submission\n                    that the manhole had normally been visible and so “obvious to any person\n                    or passerby” that there would not have been “the need of any\n                    barricade, warning sign or warning”.[note: 17]Hence, according to JPW, if\n                    not for the brown soil that must have been mounted by MA due to their excavation\n                    works nearby, the manhole would have been visible. Yet JPW failed to acknowledge\n                    that the sheerknowledgethat such a manhole\n                    existed, apart from whatever JPW alleged MA to have done to it, gave rise to\n                    sufficient proximity between Moh Seng and itself. The foreseeability of the\n                    damage that may be caused by one’s negligence is essential in establishing\n                    the proximity needed for a duty of care to arise. Therefore, JPW’s\n                    knowledge of the existence of the manhole would certainly have made it\n                    reasonably foreseeable that serious damage could be caused in a busy worksite\n                    with heavy equipment and machinery, making their omission to deal with the\n                    manhole even more inexcusable. 49     On the second limb ofSpandeck, JPW’s argument that a duty of care should not be\n                    superimposed where there had been an established contractual framework\n                    consisting of the hiring contract between Hup Hin and Moh Seng, the subcontracts\n                    between MA and JPW, and the crane supply contract between Hup Hin and JPW simply\n                    could not stand. From a legal policy point of view such an approach is plainly\n                    unpalatable. In the same parliamentary speech quoted above at [40], Dr Ng\n                    Eng Hen critically referred to such situations and explained how the proposed\n                    regime sought to address this through a direct imposition of duties, albeit in\n                    the context of principals engaging contractors for specialised tasks (at\n                    col 2209): Traditionally, a principal who engages a contractor would be engaging the\n                        specialist services of the contractor, and would not be directing the\n                        contractor on how to do the work. However, today the situation is different.\n                        Principals often engage “contractors” and third-party labour\n                        not for their specialist expertise, butprecisely so that\n                            they can avoid entering into a direct employment relationship, for\n                            organisational or other reasons.In such situations, the\n                        principal, in terms of supervision, takes on the role of an employer.The Bill thus places on him responsibility for the\n                            worker’s safety and health as if he were the\n                            employer.If this were not the case, then theduties under the Act could be simply circumvented by a careful\n                            crafting of the legal relationship. [emphasis added in italics and bold italics] 50     The case at hand could also be easily\n                    distinguished fromMan B&W Diesel S E Asia Pte\n                        Ltd and another v PT Bumi International Tankers and another\n                        appeal[2004] 2 SLR(R) 300 (“Man\n                        B&W”), a case which JPW cited as an instance where the\n                    court declined to impose a duty of care against parties’ express\n                    contractual arrangements. InMan B&Wthis\n                    Court observed that a subcontractor which had supplied defective engine parts\n                    did not owe a duty of care to the shipowner for the faulty parts due to the\n                    shipowner’s contract with the main contractor, as the shipowner had chosen\n                    to seek redress from the main contract by directly contracting with the main\n                    contractor. However, in the current case, the presence of the WSH regime alters\n                    the weight that must be put on the parties’ contractual arrangement,\n                    especially with regards to safety measures, which the WSH regime is concerned\n                    with. Moreover, the realities of the situation around the time of the accident\n                    was not one like that inMan B&Wwhere the\n                    shipowner was well aware of the subcontractor’s involvement, but\n                    ultimately made the choice to make the main contractor “solely\n                    responsible for any defect that could arise” (at [36]) in the contract.\n                    Accordingly, the policy argument which rightfully applied in that case could not\n                    be similarly invoked here. 51     Having established that JPW did owe Moh Seng a\n                    duty of care, the standard of care would be that as established in the Code for\n                    the safe use of mobile cranes. Manholes were specifically identified as one of\n                    the possible “underground hazards”, a term frequently referred to\n                    in the Code, as follows: 10.6Underground\n                            hazards Underground hazards that may be encountered on a typical construction site\n                        are: - … e)    Covered shafts andmanholes… [emphasis added] 52     The duties and responsibilities involved in\n                    ensuring the stability of mobile cranes were set out in the rest of section 10,\n                    the relevant provisions of which read as follows: 10.1General In order to ensure that the ground can safely support a mobile crane, it\n                        will be necessary to obtain information about ground conditions on site. The\n                        important items to check are: a)    ground character; b)    water conditions; and, c)    location of anyunderground\n                                hazards. 10.2Ground\n                            classification Ground can be classified into several broad categories for the purpose of\n                        highlighting potential problems for siting mobile cranes. Special attention\n                        is needed for poor ground conditions or where there is lack of data on the\n                        nature of the sub-soil. The broad categories are as follows: … e)    Urban\n                        sites Potential underground hazards e.g. basements, sewers, tunnels, water\n                            pipes, poorly backfilled trenches,manholes, inspection chambers, etc. … 10.4 Ground bearing\n                            capacity … On large construction sites where mobile cranes are expected to be in\n                        common use over long periods,a site survey should be\n                            undertaken to identify soil types and underground hazards.\n                        Further ground improvement may then be required and can take many forms.\n                        When all surveys are completed, any hazards identified and soil improvements\n                        completed,a site layout plan can be produced to show the\n                            location of danger areas, access routes, and safe working\n                        areas for the types of mobile cranes to be used. [emphasis added] 53     As the main contractor, JPW clearly had the\n                    responsibility to ensure that hazards such as manholes were identified properly\n                    through site surveys, and then to undertake ground improvements to ensure that\n                    these underground hazards did not continue to remain hazardous. The sheer\n                    importance of this duty, to ensure that potential dangers were located and dealt\n                    with properly, simply cannot be overstated, especially in work environments such\n                    as construction sites. The mere presence of heavy machinery, dangerous equipment\n                    and high volumes of activity at construction sites would ordinarily already\n                    carry high levels of inherent risks and propensity for accidents. Therefore,\n                    measures to reduce these risks cannot be taken lightly, and the responsibility\n                    to do so cannot be abrogated. Yet, JPW had unjustifiably failed in this duty to\n                    identify and rectify the underground hazard in the form of the manhole in this\n                    case. JPW was therefore liable to Moh Seng for the damage caused to the crane as\n                    a result of its negligence in this aspect. Whether MA was negligent 54     Although the Judge found that MA was not\n                    contributorily negligent in causing some soil run-off to cover the manhole due\n                    to its nearby excavation works, this was but one peripheral issue in relation to\n                    MA’s liability. Given our discussion above on the underlying rationale of\n                    the WSH Regime, plainly there is aprima facieduty of care on contractors and subcontractors at construction sites to parties\n                    who are present at the construction site. Accordingly, MA, as subcontractor,\n                    could not escape this duty in the absence of strong countervailing reasons.\n                    Moreover, in our view there were a few other unaddressed factors which pointed\n                    towards a duty of care owed by MA toward Moh Seng: (a) the lifting\n                    operation that caused the accident was within MA’s scope of work;\n                    (b) MA knew about the manhole as well; and (c) MA was contractually\n                    responsible and deemed fully informed of the conditions at the worksite. In\n                    addition, given our finding above that the Lifting Supervisor had been under the\n                    employ of MA at the material time, his actions also needed to be assessed\n                    against the standards set out in the Code. 55     First, the lifting operation, the cause of the\n                    accident, was part of MA’s scope of work, as the crane had undisputedly\n                    been requested for by Roger Kung, MA’s Project Manager. MA had required\n                    the services of JPW to lift some steel reinforcement bars up to the building\n                    under construction, and the crane had been hired for this very\n                        purpose.[note: 18]Roger Kung further confirmed that the\n                    personnel involved in the lifting operation on the morning of the accident\n                    included the Lifting Supervisor, riggers and signalmen - all of whom were\n                    employees of MA.[note: 19]In addition, this appeared to be\n                    the impression of the persons working at the worksite who were interviewed by\n                    Koh Chin Chin as well:[note: 20] Witness:When I a---spoke to the site\n                                            builders as---sorry, when I spoke to the site people,\n                                            this was what they told me.Court:What did they tell\n                                            you?Witness:That this scope of works is\n                                            under MA Builders who is their---who is [JPW]’s\n                                            subcon and Roger Kung was the person in\n                                        charge.   56     The fact that the crane was deployed for works\n                    under the scope of MA’s oversight was a significant indicator of\n                    MA’s assumption of responsibility, since the overall directive of what had\n                    to be done and how it would be done – quite apart from the overarching\n                    direction of JPW over the entire project – would emanate from\n                MA. 57     Second, apart from the Lifting\n                    Supervisor’s knowledge of the existence of the manhole (see\n                    [64]–[65] below), MA itself also appeared to have known about the\n                    existence of the manhole. The Judge made the following finding (GD at\n                    [28]): It is quite clear the washing bay for laden and unladen lorries would not\n                        have been constructed by MA at this location if it were known to MA that the\n                        manhole was nearby. It was in evidence that MA had previously built and\n                        subsequently removed a guardhouse over the former washing bay, which\n                        confirms that the existence of the manhole was then and subsequently unknown\n                        to MA. However, in our view this finding was, with respect, mistaken. This\n                    was a supposition drawn purely on the Judge’s intuitive sense of what a\n                    contractor’s logic would be, as there was no evidence led on the\n                    non-viability of building washing bays or guardhouses overcoveredmanholes (it was undisputed that the manhole was not\n                    exposed. 58     The evidence of JPW’s Project Manager,\n                    Thomas Teo, was that the manhole was in fact covered with a thick concrete cover\n                    able to withstand the weight of normal traffic,[note: 21]and was readily visible. As\n                    subcontractors who had been working in that region of the worksite for a few\n                    months, it is unlikely that MA’s workers would not have known that there\n                    was a manhole there.[note: 22]Thomas\n                    Teo also testified that MA had even carried out works in the manhole itself for\n                    (a) investigation and (b) sealing the underground discharge opening to\n                    some pipes connecting the manhole to a PUB drain.[note: 23]Further, Koh Chin Chin testified\n                    that the Lifting Supervisor had told her that Roger Kung had specifically warned\n                    him about the manhole, indicating that Roger Kung did know about the\n                        manhole:[note: 24] QNow, can you tell the Court\n                                            what you are--- what---what you have asked Mr Roger\n                                            Kung, as far as the incident on the\n                                                11thof June was\n                                            concerned?AI asked him what happened.\n                                            Sohe said he asked his lifting sup\n                                                to park the crane there and he said he directed away\n                                                from the manhole....Witness:Yah. Sohe told his, er, lifting sup to park it there, said\n                                                away from the manholeand he left and\n                                            then came back to see that the crane had toppled.QWas Mr Roger Kung aware\n                                            of the location of the manhole?AYou have to ask\n                                        him.Court:He … actually told\n                                            you that he instructed the lifting supervisor to park\n                                            there away from the manhole. If he used those\n                                            words...Court:---he must have known that\n                                            there was a manhole.[emphasis added in bold\n                                            italics]   59     Therefore, contrary to the Judge’s\n                    finding, it appeared that MA did have, or at least should have had, knowledge of\n                    the manhole. 60     Third, under the subcontracts, MA also had the\n                    responsibility for and was deemed to be fully informed about the conditions at\n                    the worksite. Under cl 17.0 of the Letter of Award of all three\n                    subcontracts, MA was deemed to be aware of the site conditions: You shall confirm that you arefully aware of the\n                            existing site conditions and constraints. You are to comply\n                        with the working hours and noise control on site in accordance with the\n                        Authorities’ requirements. [emphasis added] 61     Similarly, cl 2.1 of the Standard\n                    Conditions of the RC Subcontract and the Wet Trades Subcontract provide as\n                    follows: 2.1Subcontractor Fully Informed 2.1.1 The Subcontractor is deemed to have allowed in\n                            the Subcontract Sum for all matters concerning the Site\n                            Conditions. 2.1.2 Any geotechnical or other information concerning\n                            the Site or Site Conditions, which may be provided by [JPW] to the\n                            Subcontractor, is strictly for information only.[JPW] and/or the Client accepts no responsibility for the accuracy\n                                and/or the comprehensiveness of any such information\n                                provided.The Subcontractor shall\n                                inspect and examine the Site and its surroundings, and carry out all\n                                independent investigations, satisfying itself as to the nature of\n                                the ground and sub-soil, the form and nature of the Site,\n                            flood and ground water levels and the nature of the Works and obtain all\n                            necessary information that may affect its design. 2.1.3 The Subcontractor may, at its own expense,carry out any of its own investigations\n                                (including soils investigations), subject to\n                            [JPW’s] prior written approval. The Subcontractor shall provide\n                            [JPW] with copies of the results of any such investigation, free of\n                            charge. [emphasis in original in bold, emphasis added in italics and bold\n                        italics] 62     Although these contractual duties were owed\n                    only to JPW under the subcontracts, the very existence of these duties for MA to\n                    undertake its own checks show that MA could not simply abdicate responsibility\n                    for the presence of unsafe features on the worksite. We also observe that this\n                    is unremarkable given the nature of the work that is going to be done on a\n                    construction site by a sub-contractor. Such work is often actually or\n                    potentially dangerous and in the ordinary course, one would expect that those\n                    about to embark on such work make the effort to assess and investigate the site,\n                    the surroundings and any relevant features. It would ill have lain in the mouth\n                    of an entity in the position of MA to then say that it had no responsibility to\n                    anyone else injured by reason of its failure to take such basic steps as it was\n                    only required to do so as a matter of a contractual obligation owed to its main\n                    contractor. In fairness to MA’s counsel it must be said that this was not\n                    a contention it put forward. 63     Fourth, as the key person in the entire\n                    lifting operation, the Lifting Supervisor himself breached the standard of care\n                    set out in the Code. The duties of a lifting supervisor are set out under the\n                    following sections of the Code as follows: 9.3.1.2The person authorised to operate the\n                        crane: … c)shallascertain whether the\n                                ground conditions, in particular the ground surface on which a\n                                mobile crane is to be operated, are safe for travel or any lifting\n                                operation, and if he is of the opinion that it isnot safefor travel or any lifting\n                            operation, he shallreport this to the lifting\n                                supervisor… … 9.3.3Lifting supervisor The appointed lifting supervisor shall be responsible to: a)co-ordinate and be present to\n                                supervise all lifting activities and ensure that the lifting\n                                operation is carried out safely; b)ensure that only registered crane operators,\n                            appointed riggers and appointed signalmen participate in any lifting\n                            operation involving the use of a mobile crane; c)ensure that the ground\n                                conditions are safe for any lifting operation to be performed by any\n                                mobile crane; d)ensure that there is a set of\n                                safe lifting procedures for any lifting operation of a mobile\n                                crane; e)brief all crane operators, riggers and signalmen on\n                            the safe lifting procedures referred to in (d); f)take measures to rectify the\n                                unsatisfactory or unsafe conditions that are reported by any crane\n                                operatoror rigger. [emphasis added in italics and bold italics] 64     The Lifting Supervisor had a non-delegable\n                    responsibility to ensure that the ground conditions were safe and measures would\n                    be taken to address unsatisfactory conditions. On the facts, it was all the more\n                    disturbing that the Lifting Supervisor appeared to beconsciousof the existence of the manhole. The Judge’s\n                    finding that the Lifting Supervisor “proceeded with the lifting operation\n                    which resulted in the damage of the crane as he could not be expected to knowand indeed did not know of the existence of the\n                        manhole” [emphasis added] (GD at [31]) was at odds with\n                    the uncontested evidence of Koh Chin Chin, who testified that the Lifting\n                    Supervisor had told her that hedid knowabout the\n                    existence of the manhole:[note: 25] QMs Koh, did you ask\n                                            [Kolanjiapan Sunder, the Lifting Supervisor] whether or\n                                            not he had checked the ground\n                                    conditions?Court:It’s either\n                                            “yes” or\n                                        “no”.Witness:Okay, I asked if he had\n                                            checked the ground condition and if he knew that there\n                                            was a manhole there.Court:Okay.Witness:And he said,\n                                                “Yes, I knew so I parked\n                                                it away from the\n                                        manhole.”...ABasically, he saidhe parked it away from the\n                                                manholeand I think he was equally\n                                            shocked to see that it was on the\n                                        manhole....QBut just perhaps, just maybe\n                                            confine yourself to what actually you---you had asked\n                                            him and what he actually had\n                                    said?AI said like, “Did you\n                                            check wrong condition and how come it’s parked\n                                            there?” He said,“I---I know\n                                                there was a manhole.I parked it away from the\n                                            manhole.” That’s how he\n                                        replied.[emphasis added in italics\n                                            and bold italics]   65     As the Lifting Supervisor knew that a manhole\n                    was there, it was all the more astounding that he failed to take the necessary\n                    precautions. Notwithstanding his failure to ascertain if the ground was safe for\n                    liftingafterLian voiced out his concerns about\n                    the safety of that spot being “soft”, the Lifting Supervisor\n                    should also have made efforts to ascertainwhere the manhole\n                        wasand ensure that no operations over the manhole took placein the first place. 66     Therefore, in view of the foregoing reasons,\n                    we had no hesitation in finding that MA was liable in negligence for the damage\n                    caused during the accident. The requisite foreseeability of damage was satisfied\n                    in view of MA’s, as well as the Lifting Supervisor’s, knowledge of\n                    the manhole’s existence, giving rise to a clear duty of care owed to Moh\n                    Seng. This duty was then breached by MA’s unjustifiable failure to deal\n                    with the manhole in a way that would enhance and ensure the safety of the\n                    worksite. As subcontractor, it could not expect to abrogate from these duties by\n                    simply pointing to JPW as the main contractor, as the operation in question at\n                    the material time was within MA’s scope of work. Whether Moh Seng was negligent 67     Whether Moh Seng was negligent or not rested\n                    largely on Lian’s conduct and, in particular, whether he wilfully ignored\n                    the alleged instructions of JPW’s Safety Officer to move the crane away.\n                    As explained above (at [32]–[5]), JPW’s Safety Officer’s\n                    evidence that he gave such an instruction was not credible and hence Lian could\n                    not be said to have ignored it. Also, JPW’s arguments about Moh\n                    Seng’s negligence in not providing a site representative and failure to\n                    carry out risk assessments also failed on causation, as it was simply not shown\n                    that but for Hup Hin’s breach, the crane would not have fallen into the\n                    manhole. Accordingly, Moh Seng was not negligent. Whether Hup Hin was negligent 68     JPW acknowledged that “in terms of\n                    negligence”, Hup Hin was, among all the parties, “relatively less\n                        culpable”.[note: 26]However, JPW still maintained that as\n                    JPW’s subcontractor for hire of the crane pursuant to the crane supply\n                    contract, Hup Hin could not absolve itself from all responsibility. By failing\n                    to carry out risk assessments or provide a site representative despite being\n                    more familiar with the worksite than Lian (who was there for the first time),\n                    Hup Hin’s negligence could not be ignored. 69     However, it was clear to us that for the same\n                    reason given above in the allegations of Moh Seng’s negligence, this claim\n                    was misconceived because of the lack of a nexus between Moh Seng’s alleged\n                    failings and the collapse of the crane.",
        "Breach of contract": "Whether there was a tripartite oral contract 70     The tripartite oral contract, the Judge\n                    reasoned, was the most probable legal basis of their relationship based on the\n                    factual and business matrix of the case, and he described it as follows (GD at\n                    [9]): JPW, Hup Hin and [Moh Seng] all agreed that [Moh Seng] would supply the\n                        crane with the crane operator directly to JPW, with no further role or\n                        involvement of Hup Hin save that Hup Hin would pay [Moh Seng] at the rates\n                        provided in the Moh Seng Quotation (the hiring contract) and Hup Hin would\n                        in turn be paid by JPW at the rates provided in the JPW Crane Supply\n                        Contract (the crane supply contract). The Moh Seng Quotation prices to Hup\n                        Hin are lower than Hup Hin’s contract prices to JPW under the JPW\n                        Crane Supply Contract. In such case, Hup Hin would earn a mark-up for this\n                        arrangement, whilst JPW by paying Hup Hin would not be obliged to separately\n                        contract with [Moh Seng] as an approved crane supplier. The Judge observed that the “business and convenience logic of\n                    this arrangement” (GD at [9]) was evident and the “invoicing\n                    arrangements did not change the business substance of the agreement” as\n                    the parties were all “aware that [Moh Seng’s] crane was intended\n                    for use by JPW at JPW’s Worksite and not by Hup Hin” (GD at\n                    [10]). 71     This finding was significant as the Judge\n                    later rejected all of JPW’s contract-related claims in relation to Hup Hin\n                    on the basis that the terms of the written contracts were not incorporated into\n                    the tripartite oral contract. JPW submitted that this was erroneous as the\n                    parties’ pleaded case made it clear that the hiring of the crane was done\n                    pursuant to two separate written contracts: the crane supply contract (JPW and\n                    Hup Hin) and the hiring contract (Hup Hin and Moh Seng). Accordingly, JPW hired\n                    a crane from Hup Hin pursuant to the crane supply contract which in turn hired\n                    the crane from Moh Seng pursuant to the hiring contract. 72     The Judge’s finding of an oral\n                    tripartite contract was indeed problematic. This was not so much due to the\n                    deficiency in pleading such an arrangement, but primarily because such an\n                    interpretation would effectively have gone against the clear intentions of the\n                    parties as expressed in the two written contracts. Fundamentally, the Judge\n                    failed to realise that there was never a meeting of minds by the parties in\n                    reaching what appeared to have been anad hocarrangement made by Hup Hin to overcome its lack of an available crane for use\n                    by JPW. It was improbable that the parties could have actually intended to cease\n                    to give legal effect to their immediate written contracts simply because the\n                    crane was used/supplied by someone else other than Hup Hin. It was unlikely to\n                    have been within the parties’ contemplation that an entirely new\n                    contractual arrangement would have arisen just to accommodate the situation,\n                    thereby cancelling out all the then existing contractual agreements. In fact,\n                    this was not even the first time that Moh Seng had deployed its cranes to\n                    JPW’s worksites at Hup Hin’s request.[note: 27]Hup Hin’s\n                    Managing Director, Woon Wee Peng, testified that crane owners often hired cranes\n                    from each other whenever they were unable to meet a request for a specific\n                    equipment order.[note: 28] 73     The corollary of not being bound by the terms\n                    of the two written contracts would be a resultant vacuum apropos the remedies\n                    available to JPW in the event that something went wrong (as precisely was the\n                    case here) as the oral contract would not have incorporated any of the\n                    provisions addressing situations addressed in the written contracts. Surely such\n                    an arrangement could not have been said to make “business and convenience\n                    logic” (GD at [9]), especially in the construction industry where\n                    risk-allocation provisions and accident-related safeguards are of the utmost\n                    importance. 74     Moreover, there was nothing in either contract\n                    which expressly precluded the arrangement that took place in this case,ie, Hup Hin supplying a crane not owned by\n                    itself to JPW and hiring out a crane supplied by Moh Seng to another party.\n                    Contrary to the Judge’s finding that the “invoicing arrangements\n                    did not change the business substance of the [tripartite oral] agreement”\n                    (GD at [10]), we find that the fact that Hup Hin invoiced JPW, and Moh Seng\n                    invoiced Hup Hin, was telling in explaining how the parties sought to govern\n                    their relationships. The parties had clearly acknowledged that Hup Hin was to be\n                    the intermediary in the arrangement, and that JPW and Moh Seng were not to be in\n                    any direct contractual relationship. In fact, this was not the first time that\n                    the parties had chosen to work in such an arrangement, as seen from invoices\n                    based on thesamearrangement (with the same three\n                    parties) on previous occasions. Therefore, it was clear to us that the parties\n                    did not agree to form a tripartite oral agreement, but instead functioned on the\n                    basis of the two separate written contracts. We accept that in certain\n                    circumstances, a given contractual framework may preclude the imposition of a\n                    duty of care due to the lack of an assumption of responsibility. For instance,\n                    in the English case ofSimaan General Contracting Co v\n                        Pilkington Glass Ltd (No 2)[1988] QB 758, the Court of Appeal\n                    found that no duty of care was owed by the defendant glass supplier (hired by\n                    the subcontractors) to the main contractor claimant (who hired the\n                    subcontractors) as there was no assumption of direct responsibility. However,\n                    Bingham LJ did note that had the loss been damage to property instead of\n                    economic loss alone, a duty of care would have arisen notwithstanding the\n                    contractual matrix (at 781). Hence the contractual arrangement between the\n                    parties did not render the imposition of a duty of care inconsistent in this\n                    case. Whether Hup Hin breached the crane supply contract 75     JPW also argued that Hup Hin breached the\n                    crane supply contract in failing to: (a) take out adequate insurance to\n                    cover its liabilities under the crane supply contract (cl 10 of the\n                    Conditions); (b) provide a site representative responsible for\n                    co-ordination (cl 4.d of the Conditions); (c) take reasonable steps to\n                    observe, comply with and carry out the workplace safety and health requirements\n                    applicable to the use of the crane (cl 12 of the Conditions);\n                    (d) perform risks assessments necessary under the WSHA for the use of the\n                    crane (cl 12 of the Conditions); (e) provide a Trade Safety Supervisor and\n                    Lifting Supervisor (cl 12 of the Conditions); and (f) take reasonable steps\n                    to ensure that the safety regulations prescribed from time to time by the\n                    relevant Government authorities and/or JPW were complied with (cl 14 of the\n                    Supplementary Conditions). 76     While the Judge found that JPW’s claim\n                    against Hup Hin for the breach of the crane supply contract “must\n                    fail” because of his previous finding that the crane supply contract\n                    “was not operative on 11 June 2010, the events of which were instead\n                    governed by an oral agreement between all three parties” (GD at [42]),\n                    given our views that this wasnotthe case (at\n                    [70]–[73] above), this claim for breach of contract must be\n                    re-examined. 77     However, the answer must still be the same in\n                    that JPW could not have been entitled to damages from Hup Hin. As a matter of\n                    principle, damages can only be awarded if a claimant can prove that the\n                    defendant’s breach of the contractcausedthe loss sustained by the claimant. As this Court stated inSalcon Ltd v United Cement Pte Ltd[2004] 4 SLR(R) 353 at\n                    [24], “[t]hat causation must be established before the question of\n                    quantification of damages arises is obvious”. This element of causation,\n                    however, was simply not made out in relation to Hup Hin’s alleged breach\n                    of contract as JPW has not discharged its burden of proving that such a breach\n                    was the “effective cause” (Monarch Steamship\n                        Co., Limited v Karlshamns Oljefabriker (A/B)[1949] AC 196 at\n                    212) of the loss. Here, as Hup Hin rightly submitted, the accident was caused by\n                    the failure in JPW’s work system and would likely have happenedeven if Hup Hin had not committed the alleged breaches.\n                    As such, it was unnecessary to inquire if Hup Hin did breach those Conditions or\n                    not. Whether MA breached the subcontracts 78     JPW argued that MA breached the subcontracts\n                    by failing to observe, comply with and carry out all workplace safety and health\n                    requirements in that: (a) the Lifting Supervisor failed to ensure that the\n                    ground conditions were safe for the lifting operations; (b) the Lifting\n                    Supervisor failed to take measures to rectify Lian’s concerns about the\n                    muddy ground; (c) the Lifting Supervisor commenced lifting operations\n                    without a valid permit-to-work; and (d) the Lifting Supervisor failed to\n                    comply with the Safety Officer’s express instructions to remove the crane\n                    from the washing bay. 79     With regard to point (d), as the Safety\n                    Officer never gave such an instruction (explained above at [32]–[34]), it\n                    can be dismissed. However, with regard to the first three points, given that the\n                    Lifting Supervisor was MA’s representative (and was not seconded to JPW)\n                    when the accident occurred, in our view MA didbreachthose requirements due to the Lifting Supervisor’s\n                    lapses. Clause 7.13.2 of the Conditions in the RC Subcontract reads: Prior to commencing work on Site the Subcontractor shall make itself aware\n                        of all the requirements for the Works and the Site relating to safety,\n                        health and environmental matters includingall relevant\n                            legislation, codes of practice and Schedule I attachedhereto. [emphasis added] 80     Clause 6.0 of the Letter of Award\n                        reads[note: 29]: 6.0WORKPLACE SAFETY\n                            & HEALTH You shall observe, comply and carry out all workplace safety and\n                            health requirements applicable to the Subcontract Works and in\n                            particular, perform risk assessments necessary under the Workplace\n                            Safety and Health Act and also to provide Trade Safety Supervisor and\n                            Lifting Supervisor if required. In the event of any infringement of such\n                            requirements, we shall have the right to impose and/ or to deduct\n                            from you the administration charges and/ or other charges incurred\n                            due to your failure to observeany statutory laws and\n                                regulation. [emphasis added] 81     In relation to point (a) that the Lifting\n                    Supervisor failed to ensure that the ground conditions were safe for the lifting\n                    operations, this was in contravention of reg 20(3)(c) of the Factories (Operations of Cranes) Regulations 1998\n                    (“the Regulations”)[note: 30]which states that a lifting\n                    supervisor has to “ensure that the ground conditions are safe for any\n                    lifting operation to be performed by any mobile crane”. There was no\n                    doubt that the Lifting Supervisor failed in this aspect. 82     In relation to point (b) that the Lifting\n                    Supervisor failed to take measures to rectify Lian’s concerns about the\n                    muddy ground, the Lifting Supervisor was also in breach of\n                        reg 20(3)(f) of the Regulations (though\n                    this provision was not raised by JPW) which states that a lifting supervisor\n                    shall “if any unsatisfactory or unsafe conditions are reported to him byany crane operatoror rigger, take such\n                    measures to rectify the unsatisfactory or unsafe condition or otherwise ensure\n                    that any lifting operation is carried out safely” [emphasis\n                    added]. 83     In relation to point (c) that the Lifting\n                    Supervisor commenced lifting operations without a valid permit-to-work, the\n                    Lifting Supervisor was also in breach of reg 12 of the Workplace Safety and\n                    Health (Construction) Regulations 2007 (No S 663/2007) which\n                    reads: No high-risk construction work\n                            without permit-to-work 12.—(1) Subject to paragraph (2), any\n                        person who carries out any high-risk construction work in a worksite without\n                        a permit-to-work first issued by the project manager of the worksite in\n                        respect of that high-risk construction work shall be guilty of an offence\n                        and shall be liable on conviction to a fine not exceeding $20,000. 84     Hence, MA did breach the\n                subcontracts.",
        "Apportionment of liability": "85     In deciding that both JPW and MA were liable\n                    in negligence to Moh Seng, and that MA did breach the subcontracts that it had\n                    entered into with JPW, we felt that an apportionment of 60% to JPW and 40% to MA\n                    would be just in all the circumstances. As the main contractor, as well as\n                    occupier under the WSHA, JPW had to bear the bulk of the responsibility for\n                    failing to identify an underground hazard like the manhole, and taking measures\n                    to ensure that it ceased to be an unknown danger. However, we were also\n                    cognisant of the fact that MA was largely in charge of the works that were in\n                    the area, and specifically, the operation of lifting steel rebars that\n                    Lian’s crane was engaged in. Also, the Lifting Supervisor was under\n                    MA’s employment and had specific duties under the WSH Regime which he\n                    failed to fulfil.",
        "Conclusion": "86     In view of the foregoing, we made the\n                    following orders on liability: the appeal in relation to Moh Seng and Hup Hin\n                    was dismissed, whilst the appeal in relation to MA was allowed in part such that\n                    liability was apportioned 60% to JPW and 40% to MA. We also made the following\n                    orders in relation to costs: (a)     the costs of Moh Seng for the trial\n                        below were to be borne by JPW and MA in the proportion of 80% and 20%\n                        respectively; (b)     the costs of Moh Seng in this appeal were to be borne wholly by\n                    JPW; (c)     Hup Hin was\n                        entitled to indemnity costs borne by JPW for both the trial below and this\n                        appeal; and (d)     no\n                        orders were made between JPW and MA. 87     Hup Hin was undoubtedly prejudiced by being\n                    made to appear in such a long action and, in our opinion, without good reason.\n                    As such, we ordered indemnity costs to be awarded to them. 88     Subsequent to the hearing, JPW wrote in on\n                    5 August 2013 requesting further arguments on the costs orders, citing an\n                    offer to contribute pursuant to O22A r 11 that was allegedly made by JPW to\n                    MA and Hup Hin well before the trial began. According to the letter, another\n                    offer to contribute was made by MA after the trial commenced, and Moh Seng was\n                    purportedly aware of these offers but did not respond to them. JPW hence\n                    submitted that the Judge’s costs orders in relation to Moh Seng’s\n                    costs should be set aside and reserved to the assessment Registrar; in\n                    particular, MA should be made to bear at least some of Moh Seng’s costs in\n                    that respect. This letter was followed by a flurry of letters from the parties\n                    each taking various positions (Moh Seng on 16 and 23 August 2013, MA on\n                    23 August 2013, and JPW once again on 3 October 2013). 89     However, having considered what was put before\n                    us, we were not willing to entertain any further arguments or change our orders\n                    made during the hearing. Hence our orders on costs made during the hearing still\n                    stand.  [note: 1]Subsequent events after this exchange (but before the\n                                collapse) were disputed by JPW, and are discussed below at\n                                [32]-[34]. [note: 2]JPW’s Case at [126]. [note: 3]MA’s\n                                Case at [21]. [note: 4]Ibid. [note: 5]NE 11 Sep 12 Roger Kung, p\n                        109:14-110:1 [note: 6]NE 22 Nov 11 Koh Chin Chin, p 22: 26-29, p\n                            24:20-27 [note: 7]NE 22 Nov 2011 Koh Chin Chin p 40:6-7, p\n                            60:1-2 [note: 8]MA’s Core Bundle at pp 10-12 [note: 9]JPW’s submissions at\n                        [160(b)] [note: 10]Kuah Teck Heng’s AEIC at\n                                [20]. [note: 11]Ibid. [note: 12]NE 20 July\n                                2012 Kuah Teck Heng p 150:7-14 [note: 13]In fact, Hup Hin submitted that this was torn up by\n                                JPW’s Safety Officer; see Hup Hin’s submissions at\n                                [27]. [note: 14]NE 19 July\n                                2012 p 11:10-12:16. [note: 15]NE 22 Nov 2011 p 18:26-27. [note: 16]JPW’s submissions at\n                                [173]. [note: 17]JPW’s\n                                Case at [54]. [note: 18]Roger Kung’s AEIC at para\n                                [4]. [note: 19]NE 10 Sep 2012 Roger Kung p\n                                136:2-5. [note: 20]NE 22 Nov 2011 Koh Chin Chin p 60:29-\n                                61:2. [note: 21]Thomas\n                                Teo’s 2ndAEIC at\n                            [33]-[34] [note: 22]Works which included constructing the\n                                washing bay and a pavement nearby. [note: 23]Thomas\n                                Teo’s 2ndAEIC at [36], with\n                                pictures. [note: 24]NE 22 Nov 2011 Koh Chin Chin p 41:32-\n                                42:17. [note: 25]NE 22 Nov\n                                2011 Koh Chin Chin p 25:27-26:2, p\n                    26:6-18. [note: 26]JPW’s Case at\n                            [278]. [note: 27]Woon Wee\n                                Peng’s AEIC at [17]. [note: 28]Ibid, at\n                                [8]. [note: 29]JPW’s Core Bundle Vol II Part C p\n                            180 [note: 30]These\n                                regulations have since been repealed, but were in effect at the\n                                material time."
    }
}