{
    "case_title": "Re Beloff Michael Jacob QC",
    "ncitation": "[2014] SGCA 25",
    "coram": "Sundaresh Menon CJ; \n      Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Facts": "",
        "Background: the Scheme and legal proceedings arising from it": "3       The Company was incorporated in Singapore in October 1984 as a private limited company and it was subsequently listed on the Stock Exchange of Singapore in June 2000. It was the main distributor and licensee of the AKIRA brand of electronic products worldwide. The Company encountered financial troubles in 2008, which resulted in its creditors declaring events of default and threatening to commence or actually commencing legal proceedings against it. It was against this backdrop that nTan was appointed as the independent financial advisor to the Company and its subsidiaries by an appointment letter dated 28 October 2008. This letter, read together with another letter from nTan to the Company dated 15 May 2009, stipulated that the fees payable to nTan for its services comprised the time costs of its personnel and that in addition, what was referred to as a value-added fee (“VAF”) would be payable in certain circumstances. 4       The VAF lies at the heart of the CA Judgment which nTan has applied to set aside. It is a success fee payable to nTan in the event that a scheme of arrangement is entered into by the Company’s creditors and approved by the court. In simple terms, the VAF is a percentage of the total value of debt owed by the Company to its creditors, which is “waived, written off, extinguished, forgiven or avoided” or converted into equity in the Company pursuant to a successful scheme of arrangement. It follows that the greater the value of debt waived or otherwise rendered not payable, the greater the amount of VAF that nTan stood to receive. This is why the VAF has been described as a success fee. As at 14 March 2012 the Company estimated that the VAF came up to $15.2 million, whereas nTan put the amount at between $28.4 million and $31.8 million. 5       As events transpired the Scheme was proposed and on 29 January 2009 the High Court granted the Company liberty to call a meeting of those of its creditors to which the Scheme was to apply (“the Scheme Creditors”) in order that they might consider the Scheme and, if they thought fit, approve it. According to the Scheme documents, oversight of the Company’s implementation of the Scheme was to be entrusted to the Scheme Manager, identified in the Scheme documents as “Mr Nicky Tan Ng Kuang, Mr Dan Yock Hian and/or Ms Lim Siew Soo”, all of whom were nTan personnel. Mr Nicky Tan is and was the key figure at nTan; he was described as its owner in the CA Judgment at [2]. 6       The meeting of the Scheme Creditors was held on 16 October 2009. Under s 210(3) of the Companies Act, approval of the Scheme required not only that a majority in number of voting Scheme Creditors give their sanction to it, but also that this numerical majority represent “three-fourths in value” of the Scheme Creditors. This latter requirement meant that the Scheme Creditors voting in favour of the Scheme had to hold at least 75% of the total value of debt owed by the Company to those Scheme Creditors who were voting at the meeting. Shortly after 5.00 pm on the day of the meeting, and after the votes had been cast by the Scheme Creditors, they were informed that the final outcome of the voting would be determined only after the Scheme Manager had completed the adjudication of the proofs of debt in order to ascertain whether the 75% threshold had been crossed. Two months later, on 17 December 2009, the Scheme Manager announced the voting results having completed the adjudication of the proofs of debt in the meantime: the required majority of Scheme Creditors had voted in favour of the Scheme. Of note was the fact that the required “three-fourths in value” had been attained by a razor-thin margin – the Scheme Creditors that had voted in favour were adjudicated to hold 75.06% of the total debt owed to the Scheme Creditors that voted at the meeting. It may be useful at this stage to note the following permutations of the ratio of those voting for and against the Scheme based on what was submitted on 16 October 2009 and based on what was adjudicated on 17 December 2009: Submitted as at 16 October 2009Adjudicated as at 17 December 2009Total value of proofs voting,ie, less abstentions$554.70  million$485.39 millionTotal value of votes in favour of the Scheme$364.98  million$364.34 millionAnd as a percentage of the total value of proofs65.80%75.06%Total value of votes against the Scheme$189.74 million$121.05 millionAnd as a percentage of the total value of proofs34.20%24.94%   7       Based on the outcome of the vote, the Scheme was approved by Judith Prakash J in the High Court on 15 March 2010. However, a number of the Company’s creditors appealed against her decision in Civil Appeals Nos 44 and 47 of 2010 (“the Scheme Appeals”). After hearing arguments on 18 August 2010, the Court of Appeal on 27 August 2010 set aside the approval of the Scheme because certain aspects of the voting procedure and the adjudication of some of the proofs of debt were found to be unsatisfactory. In setting aside the Scheme, the Court of Appeal gave a number of directions, including a direction for a further meeting of the Scheme Creditors to be held within four weeks. That meeting was duly held on 24 September 2010. 8       Further hearings then took place before the Court of Appeal on 5 and 13 October 2010. At the latter hearing, the Court of Appeal issued brief grounds of decision (“the Brief Grounds”) which declared that the requisite majority of Scheme Creditorshadvoted in favour of the Scheme at the meeting of 24 September 2010: see [5] of the Brief Grounds. The Court of Appeal proceeded in the Brief Grounds to approve the Scheme, but subject to alterations (as detailed at [8]) which it considered it was empowered by s 210(4) of the Companies Act to make. One of these alterations was in the composition of the Monitoring Committee overseeing the implementation of the Scheme, so as to include in its membership, the three banks that are the appellants in Civil Appeal No 69 of 2013, namely DBS Bank, Habib Bank and Oversea-Chinese Banking Corporation (“the Banks”).",
        "Dispute as to the VAF": "9       The question of nTan’s entitlement to the VAF was first brought to the Court of Appeal’s attention some years later by a letter dated 27 January 2012 addressed to the Supreme Court Registry (“the Registry”) from Rajah & Tann LLP (“R&T”), which was acting for the Monitoring Committee. The letter was copied to Allen & Gledhill LLP (“A&G”), acting for the Scheme Manager (whom A&G identified as Mr Nicky Tan, the chief executive officer of nTan), and to WongPartnership LLP (“Wong”), acting for the Company. The letter alleged that the Monitoring Committee had only “recently” been apprised of the existence of the VAF, and set out the Monitoring Committee’s concern that a success fee of that sort would give rise to “a possible conflict of interest and duty on the part of nTan, in that it was nTan that adjudicated on the debts that were to be admitted for voting on and participating in the Scheme”. The Monitoring Committee then requested that the Court of Appeal direct that the VAF be subject to taxation in accordance with [8(j)] of the Court of Appeal’s Brief Grounds, which provided as follows: All professional costs (and disbursements) of the Scheme Manager’s and [Company’s] professional advisors incurred after 27 August 2010 shall be taxed by the High Court. 10     There ensued a chain of correspondence between R&T, A&G, Wong and the Court of Appeal, which eventually culminated in the CA Judgment. For purposes of the present appeals it is not necessary to describe every item of correspondence in detail and we confine ourselves to a broad outline. In response to R&T’s letter, A&G wrote to the Registry on 1 February 2012 setting out the Scheme Manager’s proposal that the Monitoring Committee be required to file and serve a summons setting out the specific directions sought by it, supported by an affidavit, with leave to the Scheme Manager thereafter to file an affidavit in reply. This proposal was not taken up. On 7 February 2012, the Registry wrote to R&T, A&G and Wong conveying the Court of Appeal’s directions that, first, the Scheme Manager and the Company clarify a number of matters pertaining to the VAF, including whether the VAF had been disclosed to any of the Company’s creditors prior to the Court of Appeal’s approval of the Scheme on 13 October 2008; and second, that Wong and R&T respond to A&G’s suggestion that the VAF had been disclosed to the Scheme Creditors on 12 August 2011. 11     R&T, A&G and Wong sent their replies to the Registry on 14 February 2012, and on 20 February 2012 the Registry wrote to the parties informing them of the Court of Appeal’s determination that (i) all bills of costs required to be taxed under [8(j)] of the Brief Grounds ought to be served on the Monitoring Committee, (ii) the Monitoring Committee’s solicitors had the right to participate in any taxation proceedings in connection with those bills of costs, and (iii) the agreement of the Monitoring Committee was required for taxation to be waived. The Registry’s letter also conveyed a further direction from the Court of Appeal, namely, that the parties address the court on three issues of fact and four issues of law in order to assist the court in determining the question of whether the VAF was subject to taxation. Among the issues of fact were the questions of what the prevailing practice was for the remuneration of scheme managers in Singapore, and whether other scheme managers in Singapore had adopted similar success-fee arrangements over and above their basic time-based remuneration. The issues of law were: (i) whether the Company and/or Scheme Manager were obliged voluntarily to disclose the VAF to the Scheme Creditors, and/or the court, prior to the meetings of the Scheme Creditors; (ii) if there was such an obligation, what ought to be the consequences of a failure by the Company and Scheme Manager to make such disclosure; (iii) if there was no such obligation, whether there should nonetheless be a legal constraint on the nature and quantum of such success-fee arrangements; and (iv) whether the court has the inherent power to tax the VAF. 12     The parties were given 14 days to respond to the Court of Appeal’s request. An extension of time was sought and granted, and on 14 March 2012, R&T and Wong submitted their responses by way of letter, while A&G filed a set of submissions, the length of which was 109 pages (containing 155 paragraphs and an Annex). Following additional letters written by R&T and A&G the correspondence relating to the VAF rested on 11 April 2012.",
        "The CA Judgment and nTan’s application to set it aside": "13     On 27 September 2012, the Court of Appeal released the CA Judgment. The upshot of it was that the court disallowed nTan’s claim to the full amount of VAF. The court held at [20]–[24] that the Company’s failure to disclose the VAF to the Scheme Creditors constituted a breach of its obligation to disclose all material information. The court then directed its attention to the Scheme Manager. The court (at [25]) affirmed the duties of the Scheme Manager to act in good faith towards the Scheme Creditors and not to mislead them or suppress material information from them or even be a party to any attempt by the Company to do so. Furthermore, given the Scheme Manager’s assumption of the “quasi-judicial” role of adjudicating the proofs of debt, the court considered that he owed duties to be “objective, independent, fair and impartial” and not to place himself in a position of conflict. The court considered (at [26]) that such a conflict had arisen in the present case, in that the quantum of VAF which would accrue to nTan was dependent on the value of the debts adjudicated upon by nTan’s “controlling shareholder”. The court rejected as irrelevant the distinction which the Scheme Manager sought to draw “between the VAF accruing to nTan in its role as a ‘financial advisor’ vis-à-vis that of a ‘scheme manager’”: see [27] of the CA Judgment. 14     Having found that both the Company and the Scheme Manager had breached their legal duties to make disclosure to the Scheme Creditors and the court of “all benefits accruing to the proposed [Scheme Manager] (or his firm)” (at [29]), the court turned to consider what the consequences of those breaches should be. The court concluded that it would not set aside the Scheme even though that would “[o]rdinarily” have been done, the reason being that such a course could cause more harm to the Company and its creditors: at [33]. Instead, the court directed (at [34]) that “the [Scheme Manager]/nTan, the Company and the [Monitoring Committee]” were to endeavour to agree on the amount of professional fees that ought properly to be awarded to nTan for its services. The court further ordered that if the parties were unable to reach such an agreement nTan’s global fees would fall to be assessed by the High Court. That assessment would involve considering, first and foremost, the value contributed by nTan; while other factors to consider would include the nature of nTan’s work, the time spent, the scope of work and the assistance in fact provided by nTan’s employees: at [35]. 15     On 5 November 2012, nTan (represented by A&G) filed Summons No 5682 of 2012 in Civil Appeal No 44 of 2010, and on 19 December 2012 it filed Summons No 6520 of 2012 in Civil Appeal No 47 of 2010. Both these summonses sought identical relief, which was leave to intervene in the Scheme Appeals in order to set aside the CA Judgment on grounds of want of jurisdiction and breach of natural justice (accordingly we refer to these summonses as the “Setting-Aside Summonses”). 16     nTan then applied on 22 November 2012 to have Mr Beloff admitted on anad hocbasis to represent it in the Setting-Aside Summonses and related proceedings. The application to admit Mr Beloff was opposed by the Company, the Attorney-General, the Law Society of Singapore (the “Law Society”) and the Banks, which say that they act on behalf of the Monitoring Committee.",
        "Statutory regime governingad hocadmissions of foreign counsel": "17     Under s 15(1)(c) of the LPA the court “may” admit Queen’s Counsel (“QC”) or foreign counsel of equivalent distinction to practise as an advocate and solicitor in Singapore for the purpose of any one case if the person “has special qualifications or experience for the purpose of the case”. As the use of the word “may” indicates, admission does not follow as a matter of course upon the court being satisfied of the existence of the requisite qualifications and experience. Rather, it remains a matter for the court’s discretion. 18     The exercise of that discretion is guided by para 3 of the Legal Profession (Ad Hoc Admissions) Notification 2012 (S 132/2012) (“the Notification”), which was issued pursuant to s 15(6A) of the LPA. The Notification specifies four matters (“the Notification Matters”) that the court may consider in deciding whether to admit the counsel seeking admission. The four Notification Matters specified therein are: (a) the nature of the factual and legal issues involved in the case; (b) the necessity for the services of a foreign senior counsel; (c) the availability of any Singaporean Senior Counsel (“SC”) or other advocate and solicitor with appropriate experience; and (d) whether, having regard to the circumstances of the case, it is reasonable to admit a foreign senior counsel for the purpose of the case. The Notification expressly states that these matters are in addition to the matters specified in ss 15(1) and (2) of the LPA. Aside from s 15(1)(c) which we have referred to above, ss 15(1)(a) and (b) prescribe certain formal requirements as to the requisite professional standing of the counsel in question and his or her residency status. 19     There is an additional hurdle to admission when it is sought in relation to cases which involve certain specified areas of legal practice. Pursuant to s 15(2) of the LPA read with r 32(1) of the Legal Profession (Admission) Rules 2011 (S 244/2011) (“the Legal Profession (Admission) Rules 2011”), when a case involves (a) constitutional and administrative law, (b) criminal law or (c) family law, the court may not admit foreign senior counsel for the purpose of that case unless it is satisfied that there is a “special reason” to do so. 20     The present statutory regime onad hocadmissions is the outcome of a number of amendments to the original 1962 legislation, the most recent of which was enacted in 2012. A comprehensive history of the relevant statutory provisions is set out in the judgment of V K Rajah JA inRe Andrews Geraldine Mary QC[2013] 1 SLR 872 (“Re Geraldine Andrews”) at [20]–[32]. What is material for the purpose of the present case is that, prior to the 2012 amendments, the court could not admit a QC to appear in a case unless it was satisfied that the case was of “sufficient complexity and difficulty”. It was at this threshold that many an application for admission floundered and accordingly, when Parliament wished, in the words of the Minister for Law Mr K Shanmugam, to make it “slightly easier for foreign expert counsel to appear in our courts”, that condition of complexity and difficulty was removed though as we have observed, under the terms of the Notification, the court remained obliged to have regard to the nature of the legal and factual issues involved in the case as well as the necessity for a foreign counsel. Another feature of the pre-2012 legislative framework was that it had only been in one area of legal practice, namely, criminal law, that the applying QC would be required to demonstrate a “special reason” for admission. This has since been expanded to include constitutional and administrative law and family law.",
        "Approach of the appellate court to an exercise of discretion below": "21     We have noted above that the decision whether to admit a QC for the purpose of a given case is one that calls for the exercise of judicial discretion. This discretion is not unfettered: there are legislative provisions that guide the court. Nonetheless, we are mindful of the rule that an appellate court ought not to interfere with the exercise of a judge’s discretion “simply because its members consider that they would, if themselves sitting at first instance, have reached a different conclusion”: Lord Brandon of Oakbrook inThe “Abidin Daver”[1984] Lloyd’s LR 339 at 349. As the Minister for Law recognised in Parliament, the decision whether to admit foreign counsel in any given case is a “question of judgment”; that judgment requires the judge to identify the relevant factors and weigh them all in the balance. It is a project incapable of mathematical precision and hence there is, in the words of Asquith LJ inBellenden (formerly Satterthwaite) v Satterthwaite[1948] 1 All ER 343 at 345, a “generous ambit within which reasonable disagreement is possible”. It is for this reason that the threshold for appellate intervention is higher than mere disagreement with the outcome of the exercise of discretion by the judge below. 22     As to when the appellate court can legitimately interfere with the exercise of discretion below, the test laid down inThe “Vishva Apurva”[1992] 1 SLR(R) 912 at [16] and applied in the context of an admission application for a QC inGodfrey Gerald QC v UBS AG and others[2003] 2 SLR(R) 306 at [13] is that such interference is warranted on three grounds: (a) where the judge misdirected himself with regard to the principles in accordance with which the decision is to be exercised; (b) where the judge, in exercising his discretion, took into account matters which he ought not to have done or failed to take into account matters which he ought to have done; or (c) where his decision is plainly wrong. 23     Broadly speaking we accept this, albeit with a caution against applying the test in an unduly technical manner. In particular, the notion that intervention may be warranted where the judge either failed to take into account relevant considerations or took into account irrelevant matters might suggest an enterprise of drawing up two lists designed to be exhaustive – one of all the matters which the judge in fact took into account and the other of all the matters which he was entitled or obliged to have taken into account, and comparing the two to see if there is a precise equivalence. But such fine-grained scrutiny would not be correct. Rather, the appellate court should assess the judge’s decision in the round, having regard to the broad principles in accordance with which the discretion is to be exercised.",
        "Decision below": "24     Given the limited scope for appellate intervention, it is important that we attend closely to the reasoning of the Judge at first instance. The Judge’s decision is reported asRe Beloff Michael Jacob QC[2013] 4 SLR 849. As a preliminary matter the Judge held (at [24]–[26]) that the Setting-Aside Summonses did not involve constitutional and administrative law; as such it was not necessary for the court to be satisfied that there was a “special reason” to admit Mr Beloff. The Judge then proceeded to consider the four Notification Matters and exercised her discretion in favour of admitting Mr Beloff. 25     As to the first Notification Matter, the Judge (at [31]) characterised the essential issues in the Setting-Aside Summonses as being, first, the Court of Appeal’s jurisdiction to decide a consequential question after it had completed its primary function of issuing a substantive judgment in an appeal, and where that consequential question involved a party allegedly not a party to the appeal; and second, whether there had been a breach of natural justice in the way that the question had been dealt with. She also identified (at [34]) a factual issue of whether nTan or the Scheme Manager were parties to the Scheme Appeals, as well as an ancillary issue of the extent to which a court can make orders in the absence of a formal application before it. She concluded (at [37]) that the issues of law and procedure thus raised were “fairly complex and required depth of knowledge and subtlety of approach” as well as “sophisticated legal reasoning”, and hence were of such nature that the court “would benefit from expertise of knowledgeable and experienced counsel”. 26     The Judge then considered the second and third Notification Matters together. She opined that where nTan faced the greatest difficulty was in satisfying the court that admitting Mr Beloff was a necessity. This was because nTan was already represented by one of Singapore’s largest law firms, A&G. The Judge had “little doubt” that Mr Ang Cheng Hock SC and Mr Edwin Tong of that firm could have handled the Setting-Aside Summonses – and furthermore, nTan had made no efforts whatsoever to secure the services of any local SC: at [40]–[41]. But against this what stood in favour of admitting Mr Beloff was his “wide ranging experience and expertise” in commercial and public law (as detailed at [42]–[44]), as well as his experience on the bench in various jurisdictions which could “enable him to assist the [Court of Appeal] in relation to an appellate court’s jurisdiction to supplement an earlier decision and to the appropriate procedures to be followed”: at [46]. 27     As to the fourth and final Notification Matter, the Judge considered (at [51]–[52]) that it was reasonable in all the circumstances to admit Mr Beloff because (i) it would fulfill the legislative objective of allowing litigants to engage such counsel as would allow optimum advancement of their case; (ii) there was a “wider public interest” in developing local law on the Court of Appeal’s jurisdiction and powers; (iii) there was potentially great value in the assistance of a QC who has appeared as counsel and sat as a judge in multiple common law jurisdictions; and (iv) it might be better to have non-local counsel handle issues as delicate and sensitive as whether the Court of Appeal had acted improperly. She did not consider that nTan’s omission even to attempt to secure the services of a local SC should weigh heavily against it because many SCs had already been involved in the underlying case, and in any event very few SCs had the breadth of Mr Beloff’s experience.",
        "The appeals against the decision below": "28     All the parties which opposed nTan’s application before the Judge have appealed against her decision. Civil Appeals Nos 68, 69, 70 and 71 of 2013 are, respectively, the Attorney-General’s, the Banks’, the Law Society’s and the Company’s appeals. While there is a considerable degree of overlap in the appellants’ submissions, there are also some arguments that are unique to individual appellants. However, for the purposes of this summary of the appellants’ submissions, we do not think that it is necessary to attribute each argument to the specific appellant(s) that made them. 29     The primary thrust of all the appellants’ submissions is that the Judge erred in the exercise of her discretion in weighing the four Notification Matters. But in addition, there are two other arguments put forward by the appellants. First, it is contended that Mr Beloff did not even meet the “distinct requirement” under s 15(1)(c) of the LPA of possessing “special qualifications or experience” for the purpose of the Setting-Aside Summonses. Second, it is argued that nTan is obliged to show a “special reason” to admit Mr Beloff because the Setting-Aside Summonses involve issues of administrative law. 30     As to the first Notification matter (the nature of the factual and legal issues involved in the Setting-Aside Summonses), the appellants’ central contention is that the issues are neither complex nor difficult, because: (i) the questions of the Court of Appeal’s jurisdiction and powers raised by the Setting-Aside Summonses are not wide-ranging but are narrowly confined to schemes of arrangement; (ii) the substantive merits of the Setting-Aside Summonses are clearly and obviously not in nTan’s favour; (iii) the Setting-Aside Summonses demand no more than that counsel apply statutory provisions and rules and principles of law to a particular factual matrix, which is what any lawyer does in any case; and (iv) there is little if any dispute on what the facts are. It is also argued that the issues are not novel because there is ample judicial and academic writing on the court’s jurisdiction and powers. 31     The Judge had identified the second and third Notification Matters (the necessity for foreign counsel and the availability of local counsel) as the weakest point in Mr Beloff’s application, and it is here that the appellants’ attack is most vigorous. “Necessity”, it is argued, sets a high threshold suggesting that there would be a chance of the issues not being properly ventilated or framed if a QC were not admitted. Once local counsel who is appropriate, available and adequate for the proper conduct of a case is found, it should generally follow that the services of foreign counsel are unnecessary. As the Judge had found that either Mr Edwin Tong or Mr Ang Cheng Hock SC could adequately represent nTan in the Setting-Aside Summonses, this militated against the order being granted. 32     The appellants also argue that a QC should not be admitted on the basis that he is assessed as being more qualified than local counsel. Such a comparison would be inherently inexact and speculative; and in any given case, the sheer statistical probability must be that there existssomeforeign counsel who might appear to be “more appropriate” or more qualified than available local counsel. To permit this would encourage litigants to make foreign counsel their first port of call and this would undermine the policy of nurturing the local Bar. 33     The appellants further contend that, despite the undoubted impressiveness of Mr Beloff’s resume, his capacity to assist the court in the Setting-Aside Summonses had been overstated by the Judge. There was nothing to suggest that he had any particular experience in insolvency or restructuring law; nor in applications to set aside decisions of apex courts, which in any event are somewhat rare anywhere in the world. Further, his expertise in administrative and public law was irrelevant since on nTan’s case, the Setting-Aside Summonses do not involve administrative law; and his experience as a judge could not be regarded as relevant, since the application was to enable Mr Beloff to appear as counsel for nTan and not asamicus curiae, and in any event, there was nothing to suggest Mr Beloff had dealt with the sort of issues presented in this case in the course of his work as a judge elsewhere. 34     Furthermore, given the primacy of written advocacy in the context of appellate practice in Singapore, the necessity for his admission was thought to be questionable. Even if the Setting-Aside Summonses were to be seen as involving some sensitivity due to nTan’s allegations that the Court of Appeal had acted improperly, there was nothing to suggest that local counsel would not be able to make their submissions candidly and forcefully. 35     Finally, on the fourth Notification Matter (the reasonableness of admission) it was pointed out that there is no concern of inequality of arms in the Setting-Aside Summonses since there is local counsel available to represent nTan and none of the parties opposing nTan are represented by foreign counsel. 36     On the other hand, nTan essentially supports the reasoning of the Judge. It argues that the Setting-Aside Summonses do not involve constitutional and administrative law and that Mr Beloff has the requisite “special qualifications or experience” notwithstanding his lack of experience in insolvency and schemes of arrangement. nTan then emphasises, citing no less than nine authorities, that an appellate court should not interfere with a first instance court’s exercise of discretion except in limited circumstances. It argues that none of those limited circumstances apply to the Judge’s exercise of discretion. 37     nTan also contends, in response to some of the appellants’ arguments, that: (i) the issues in the Setting-Aside Summonses are not only complex but also novel and potentially of significant precedential value or public interest; (ii) there is a concern of equality of arms since the Banks at least would have the services of an SC, but on nTan’s side both SCs from A&G, Mr Ang Cheng Hock SC and Dr Stanley Lai SC, would not have the appropriate experience for the case; (iii) there is a distinction between “competent” and “skilled” representation such that, even if local counsel can furnish the former, a QC may yet be necessary to provide the latter; and (iv) the argument as to the primacy of written advocacy at the appellate level cannot be taken too far as it would then be difficult to think of any instance in which a QC might be admitted to argue an appeal.",
        "Analysis": "38     We venture to set out an analytical framework applicable to all cases in whichad hocadmission of foreign senior counsel is sought. In our judgment, this framework arises quite naturally from the structure of the legislative provisions. But before doing so, we first examine the legislative scheme and seek to ascertain the rationale that underlies this.",
        "Rationale of ad hoc admissions scheme": "39     The starting point of the analysis is to identify the overarching rationale behind thead hocadmissions scheme; this will provide the broad principles in accordance with which the judicial discretion is to be exercised. 40     As we have already noted, the relevant provisions of the LPA have undergone a number of changes over the years. It is the latest iteration of those provisions that governs the present case, and their rationale may be gleaned from the Parliamentary debates when the most recent round of legislative amendments were made in 2012. The pertinent portions of those debates were helpfully quoted at length by Rajah JA at [31]–[32] ofRe Andrewsand need not be reproduced here. From those passages it emerges from the repeated mention of this point that the key concern which Parliament intended to address through the amendments was that litigants who were up against a bank or a large corporate institution might find it difficult to secure the services of local SCs. That difficulty arises from the fused structure of our legal profession as a result of which advocates practice in partnership with those who primarily undertake transactional work. The consequence of this is that a firm may be unable as a matter of law owing to a real or potential conflict of interest to act against a particular client, or unwilling as a matter of practice to take positions that may be adverse to the commercial interests of clients for which the firm does a substantial amount of fee-paying work. When this transpires, every advocate in that firm would be ruled out from acting in that matter even if each of them might not have had any involvement in it. 41     This situation is exacerbated by the fact that the majority of our SCs are clustered in a small number of large firms. During the debates on the 2012 amendments, the Minister for Law, Mr K Shanmugam, observed that of the 40 active SCs, 35 come from large- or medium-sized firms. The demographics have not evolved much since then. Of the 40 SCs with practising certificates listed on the Law Society website as at 24 March 2014, 15 hail from just four firms, specifically, five from Drew & Napier, four each from R&T and Wong, and two from A&G. As the Minister for Law K Shanmugam noted, the larger firms have “extensive corporate practices serving a wide range of clients” (Singapore Parliamentary Debates,Official Report(14 February 2012) vol 88) and would likely have some kind of professional relationship with any given bank or large corporate institution. As a consequence, when a litigant’s opponent is such a bank or institution, many SCs may be unable in law or unwilling in fact to act for that litigant because of those professional ties. 42     This phenomenon was the key problem or challenge that Parliament intended to address. However, we agree with Rajah JA’s view at [37] ofRe Andrewsthat this is not exhaustive of the circumstances in whichad hocadmission of foreign senior counsel might be allowed. In our judgment, the rationale that directly underlies the 2012 amendments points to a broader proposition which, in the words of the Minister for Law, is that “ad hoccounsel will only be admitted on the basis of need, and it will not be a free for all”. “Need” connotes a fairly stringent standard which is not satisfied merely by showing that the admission of foreign counsel is desirable or convenient or sought as a matter of choice. It suggests that the litigant seeking admission of foreign counsel would be prejudiced if his application was not allowed, and that this prejudice is of an appropriately significant degree. 43     The paradigm example of “need”, of course, would be the type of situation discussed in Parliament in which a litigant encounters particular difficulties in attempting to secure the services of a suitable local advocate because his opponent is a bank or a major corporation; but obviously, it is not invariably the case that there will always be a “need” for foreign senior counsel in every such situation. For instance, if the case is simple and the bank or institution which is the litigant’s opponent is not itself represented by an SC, it might well not be possible to demonstrate a “need” for foreign counsel. On the other hand, such a “need” may be found even where a litigant remains able to select from a substantial complement of SCs; for example, the case might involve an area of law so esoteric that no local lawyer can claim any expertise in it. We do not think it would be productive for us to suggest further hypothetical scenarios in which there might or might not be a “need” for foreign senior counsel. 44     In the Parliamentary debates as well as inRe Andrews(at [34(b)] and [34(d)]) the presentad hocadmissions regime was described as being “less restrictive” and “more liberal” than that in force just prior to the 2012 legislative amendments. That might be so in the sense that the present regime no longer stipulates the requirement of “sufficient complexity and difficulty” that had stood in the way of QC admission applications brought before the amendments. Such a requirement required the applicant to establish that the issues in the case were so complex that in a sense they were likely to be beyond the ability of the local profession. This just would not be true in the vast majority of cases.  But on the other hand, the fact that we have moved away from this must be tempered against the Parliamentary recognition that the present regime is not intended to be a “free for all”; as well as the fact that the Notification Matters set out a framework of considerations that should guide the court in deciding whether to admit a foreign practitioner on anad hocbasis. This framework includes, among other things, the need to consider the nature of the issues in the case and the availability of local counsel to deal with these. As will be apparent from our further observations below, the focus now is less on the inherent difficulty of the issues presented in a given case and more on whether, having regard to the issues which do arise and all other relevant considerations, there is a need for foreign counsel to be admitted in a given case because of a lack of available and appropriate local counsel. 45     In these circumstances, the use of language such as “less restrictive” and “more liberal” might be unhelpful in as much as it might imply a quantitative aspiration that the percentage and/or number of admission applications that are successful should necessarily be higher under the present regime than under the previous one. The task for the court in each case is to examine the facts and issues presented in the light of the relevant considerations that emerge from the case-law and in accordance with the terms of the Notification and the statutory framework and then to come to a decision whether to admit the counsel or not. We especially eschew attempts to adopt a comparative approach such as to ask whether foreign senior counsel would have been admitted under the previous system and then conclude, if the answer is in the affirmative, that foreign counsel must logically also be admitted under the present regime.",
        "Identification of areas of legal practice that the case involves": "46     In the light of that understanding of the legislative purpose of the 2012 amendments and of the broad philosophy the court should bring to the consideration of these applications, we turn to examine the ambit of the scheme which ring-fences certain areas of legal practice under r 32 of the Legal Profession (Admission) Rules 2011, namely, constitutional and administrative law, criminal law and family law, and requires that these manifest a “special reason” warranting the admission of foreign counsel. 47     Presumably these ring-fenced areas of law were all thought to require a “special reason” because of some common denominator between them; that common denominator, however, is not easy to pin down. Rajah JA inRe Caplan Jonathan Michael QC[2013] 3 SLR 66 (“Re Caplan”) at [26] opined that the ring-fenced areas of law all had “critical domestic content” and “features peculiar to Singapore”. Rajah JA elaborated upon this in his subsequent decision inRe Lord Goldsmith Peter Henry PC QC[2013] 4 SLR 921 (“Re Lord Goldsmith”), when he suggested at [43] and [58] that the ring-fenced areas of law had perhaps been singled out because in those areas, local law has diverged and become distinct from its English roots. But in our judgment, the latter consideration may be doubted. Our law has developed along its own trajectory in a number of areas including even, for instance, in aspects of contract law: see for the purposes of illustration only, the analysis in Sundaresh Menon, “The Somewhat Uncommon Law of Commerce” (2014) 26 SAcLJ 23 at paras 13–41. On the other hand, it is not obvious that our administrative law has diverged greatly from English law. 48     Another possible common denominator might be that unlike the position with proceedings that concern commercial law, there is in the ring-fenced areas of law no real possibility of a significant number of SCs being unable or unwilling to represent a given litigant. The Minister for Law did note in Parliament that there would be “no real issue of conflict” where a case involved the ring-fenced areas of law. On the other hand, this does not seem compelling as an explanation because the question of availability of counsel is addressed directly in the third Notification Matter, which is the “availability of any [SC] or other advocate and solicitor with appropriate experience”. Moreover it is entirely possible, even if not probable, for conflicts to arise in cases involving the ring-fenced areas of law. For instance, one could envisage an administrative law case involving a financial regulatory authority in which multiple banks had an interest, or a white-collar criminal case in which multiple accused persons were charged with perpetrating fraud on a number of institutions. The area of law involved in a case therefore does not necessarily determine whether there would be a concern over availability of local counsel due to potential conflicts of interest. 49     In our judgment, the better explanation for ring-fencing certain areas of law and imposing an even higher threshold in these areas by requiring that special reason be shown, is that which was first alluded to by Rajah JA inRe Caplanwhen he observed that these were all areas with a “critical domestic content”. There are areas of law which must be developed with particular regard to the social, political and economic context of our society. The ring-fenced areas – criminal law, constitutional and administrative law and family law – are all areas where the law is most likely to interface directly with society and embody societal norms, and which by and large are best developed with special regard to the shared values of our people. Now, it may possibly be that this happens not to be true of aparticularcase involving one of these areas of law; butgenerally speakingthese considerations will hold true to a much greater degree in these areas than in areas of private commercial law. Take family law, for the purposes of illustration. It is a body of law that is rooted in a raft of statutory instruments and is in that sense idiosyncratic to our nation and our people and strives to be reflective of our shared values. Because of this, it wouldpresumptivelybe the case that in these areas, the court would be best assisted by local counsel, save where special reasons, over and above those applicable in other cases, are shown to justify the admission of foreign counsel. 50     In our judgment, the appropriate approach is to determine whether the case raises issues that fall within the ambit of the specified areas of legal practice. If it does, then the requirement of a special reason is a threshold one that must be met before turning to the other considerations. In that event, what constitutes a “special reason” will fall to be considered. Rajah JA set out what he thought the phrase meant at [50]–[55] ofRe Caplanand at [46]–[49] ofRe Lord Goldsmith. However, there was little, if any, argument before us on the meaning of “special reason”, and for that reason, we are unwilling to venture into this unless it is necessary for us to do so, and as will become apparent, we do not think it is necessary for us to do so in this case.",
        "The analytical framework": "51     In that light we set out the analytical framework, which in our judgment, calls for the court first to satisfy itself of the formal requirements set out in ss 15(1)(a) and (b), the other mandatory considerations in s 15(1)(c) and s 15(2) and then to apply the framework of considerations set out in the Notification. 52     It would be helpful here once again to list the considerations contained in s 15(1)(c) and in the Notification: (a)     The foreign counselmust havespecial qualifications or experience for the purpose of the case (s 15(1)(c)); (b)     Regard should be had pursuant to the Notification, to: (i)       The  nature of the factual and legal issues in the case; (ii)       The necessity for the services of a foreign senior counsel; (iii)       The availability of Senior Counsel or other advocate and solicitor with the appropriate expertise; and (iv)       Whether, having regard to the circumstances of the case, it is reasonable to admit a foreign senior counsel for the purpose of the case. 53     We observe that there is an important distinction between s 15(1)(c) on the one hand, which imposes a certain mandatory requirement, and the Notification Matters on the other, which are not mandatory requirements but are rather in the nature of signposts that direct the court towards the ultimate question; and, in our judgment, this is set out in the fourth Notification Matter, namely, whether having regard to all the circumstances of the case, it is reasonable to admit the foreign counsel. We return to this shortly. 54     The architecture of the regime may thus be summarised in terms that it requires the court first to apply its mind to certain mandatory requirements. These are: (a)     The formal requirements in ss 15(1)(a) and (b); (b)     The requirement that the foreign counsel has special qualifications and experiencefor the purpose of the case; and (c)     The threshold inquiry of whether a special reason must be shown and if so, whether it has been. We consider these requirements mandatory because if any of these are not met, the application for admissionmustfail and the question of discretion does not arise. It is only if these matters are all met that the court must then consider the further matters specified in the Notification, and then exercise its discretion having regard to all the circumstances. 55     There was a tendency in the course of the arguments before us, as well as in the court below to regard these matters as discrete and unconnected matters to be assessed and evaluated separately. In our judgment, this is wrong in principle. The various considerations are distinct in the sense that they should each be considered by the court; but they are also linked to one another in the sense that the court in applying this framework, must have regard to the individual considerations in the context of how they relate to or affect one another. Qualifications or experience for the purpose of the case 56     We turn to consider the content of the requirement under s 15(1)(c) of the LPA that the foreign senior counsel sought to be admitted must have “special qualifications or experience for the purpose of the case”. It may generally be accepted that a QC or foreign counsel of similar distinction would have demonstrable competence as an advocate. But this is insufficient for the purpose of s 15(1)(c). As Rajah JA explained inRe Andrewsat [39], what this requirement entails is that the foreign senior counsel’s qualifications or experience must be relevant to the issues in the case for which he seeks to be admitted; if, for example, a case involves areas of law that call for specialised learning such as arbitration, insolvency or intellectual property, the foreign counsel must have demonstrable expertise in these areas of law. It follows that when a case involves an area of law in which the jurisprudence is uniquely local, such as where the case turns on the meaning of legislation that has no analogue elsewhere or at least where the counsel concerned has no direct experience with that body of law, it will ordinarily be difficult to satisfy the court that foreign counsel has “special qualifications or experience” for the purpose of that case. 57     This requirement of relevant expertise carries with it no additional demand that the foreign senior counsel sought to be admitted must be among the foremost specialists in those areas of law that the case is concerned with. But he must have a notable and particular expertise that is relevant to the issues that are presented in the case at hand. 58     Before we leave this point we should say something about the interaction between s 15(1)(c) which contemplates that the applicant has special qualifications or experience for the case and the Notification Matters. The Judge dealt with the s 15(1)(c) requirement in the course of discussing the Notification Matters (see her decision at [27]). The Attorney-General contends that this was not correct because s 15(1)(c) lays down a “distinct requirement” that is separate from the Notification Matters. We agree with the Attorney-General and go somewhat further because, as we have noted, this is a mandatory requirement. If it is not fulfilled, then the inquiry ends there as far as the applying foreign counsel in question is concerned. Having said that, as a practical matter, even though s 15(1)(c) is a distinct requirement, the fact is that there is substantial overlap between s 15(1)(c) and the Notification Matters. This brings us back to our earlier observations that these matters are distinct in many respects but also related in other respects. In this particular context, it is necessary, for instance, to consider what the nature is of the legal and factual issues in the case in order to assess whether the foreign counsel in question has the requisite and particular expertise. Nonetheless, for clarity of analysis we think that s 15(1)(c) should be considered as a distinct requirement that must be met before court considers whether the Notification Matters call for admission in the case at hand. The Notification Matters 59     We turn to the content of the four Notification Matters. As Rajah JA has pointed out inRe Andrewsat [45], the consideration of these Notification Matters is a “necessarily fact-dependent” exercise. There is no particular order of precedence among them and the specific circumstances of each case will dictate their relative importance. Nor are they watertight categories. On the contrary it seems to us that there will often be a degree of overlap among them. 60     In essence, the first three Notification Matters direct the court to examine whether the case calls for the engagement of a foreign counsel but from three different vantage points. The first step begins with identifying the nature of the factual and legal issues that are presented in the case. 61     However, the first Notification Matter goes beyond that, not least because by the time the analysis has reached this point, such identification would already have taken place since the issues would have had to be ascertained in order to determine whether the case involves any of the ring-fenced areas of legal practice, and also, whether the expertise of the foreign senior counsel sought to be admitted is sufficiently relevant to the issues to meet the requirement of having “special qualifications or experience” under s 15(1)(c). In our judgment, the first Notification Matter is directed at a qualitative evaluation of the character of the issues in the case for the purpose of determining whether the admission of foreign counsel is called for. As Rajah JA said at [48] ofRe Andrews, this would include asking whether the issues are complex or difficult, or novel, or of significant precedential value. The more this is so, the smaller might be the pool of local advocates able and available to deal with the case at hand and the greater might be the need for the admission of foreign counsel. 62     As to the second Notification Matter, this comes to the question of whether the case calls for the admission of foreign counsel from the vantage point of whether there is a “necessity” for this. InRe Andrewsat [50], Rajah JA observed that the second Notification Matter should be read “broadly and in a common-sense manner” to include those considerations which would “indicate that the services of a foreign senior counsel areneededby the litigant for the proper conduct of the case” (emphasis added). Thus the second Notification Matter is an implementation of the broad proposition articulated by the Minister for Law that admission would be on the basis of “need”. “Necessity”, or “need”, contemplates a somewhat high threshold, higher at any rate than a matter of “desirability” or “preference”. In our judgment, such need might be occasioned by a variety of different factors and considerations, among them the urgency of the case (seeRe Andrewsat [51]), concerns of “equality of arms” (seeRe Andrewsat [52]), considerations of cost, and many others, which it would be vain to attempt to catalogue exhaustively. The second Notification Matter is couched in terms that are somewhat open ended and the court may consider such matters as might go towards demonstrating that a litigant stands to suffersubstantial prejudicein the conduct of his case if the retention of the foreign counsel in question was not permitted. 63     The third Notification Matter comes to the question of whether the admission of foreign counsel is called for from the perspective of whether a litigant has a real difficulty with accessing suitable legal services within Singapore. Where a party already has access to appropriately competent local counsel, this inquiry can end there since there would be nothing to be gained from undertaking a further numerical analysis of how many SCs or advocates and solicitors of appropriate experience are unable or unwilling to act for the litigant in question. The position may be different where the litigant’s position is that he cannot find competent local counsel. In those circumstances, it will be relevant to examine whether efforts have been made to engage local counsel, and it would not be difficult to see that the greater the number of SCs or local counsel who are unavailable, the more it can be said that the services of foreign counsel would tend to be a “necessity”. In such circumstances, as Rajah JA said inRe Andrewsat [55] and [57], the litigant should have taken reasonable steps to ascertain the availability of SCs or local counsel, and should explain why the SCs or local counsel sought were unable or unwilling to act for him. We note that the court is to consider not only the availability of SCs but more generally the availability of local counsel with appropriate experience. Exactly what “appropriate experience” entails will depend on the circumstances of each case, including the complexity of the issues that have been raised. However, it has to be said that while the title of SC is a mark of professional distinction, one does not have to be an SC to be a very able litigator. 64     This brings us to the fourth Notification Matter. It is couched in very general terms leading Rajah JA to observe inRe Andrewsat [58] that it is in the nature of a catch-all provision. However, as we alluded to above, we prefer to see the fourth Notification Matters as laying down the ultimate question for the court, which is, whether in the light of all the circumstances of the case, including the mandatory considerations as well as the three other listed Notification Matters, it is reasonable, in the sense that there is good and sufficient reason, to admit the foreign senior counsel for the purpose of the case in question. In considering this ultimate question the court may also have regard to factors that would make itunreasonableto admit foreign counsel; these factors of a negative nature may not otherwise fall easily within the rubric of the other Notification Matters. 65     It follows from all we have said that although for analytical purposes, each of the Notifications Matters is to be considered individually, yet they are also inevitably bound to impact each other and so to be considered collectively. We reiterate that the weight accorded to the various factors taken into consideration is very much at the court’s discretion, but the broad principle in accordance with which the discretion must be exercised is that foreign senior counsel should only be admitted on the basis of “need”.",
        "Whether Mr Beloff should be admitted in the present case": "66     Having set out the analytical framework generally applicable to applications for admission of foreign senior counsel, we turn now to consider whether Mr Beloff should be admitted in the present case. In doing so we remain entirely cognisant of the limited nature of appellate intervention in a case such as this; we are not at liberty to interfere with the Judge’s exercise of discretion just because our conclusions would have differed from hers had we ourselves sat at first instance.",
        "The mandatory requirements": "67     There was no dispute that Mr Beloff met the formal requirements specified in ss 15(1)(a) and (b) of the LPA. As a matter of convenience, we next turn to consider whether the case concerns any of the ring-fenced areas of law, before turning to the question of Mr Beloff’s particular experience for the purpose of this case.",
        "Whether the present case involves constitutional and administrative law": "68     We begin by identifying the issues that are likely to arise in the Setting-Aside Summonses. The issues in a case may be formulated at different levels of generality, incorporating more or less reference to the specific facts of the case. In general, the issue should be framed at a level where it is sufficiently general so that the formulation remains neutral and does not in and of itself suggest the answer to the ultimate question presented to the court. At the same time, it should be sufficiently particular so that the utility of framing the issues is not lost in vague generalisations. 69     In our view, there arise in the context of the facts of the Setting-Aside Summonses three interweaving issues. First, insolvency, specifically schemes of arrangement, under the Companies Act; second, the court’s jurisdiction under the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed); and third, whether the CA Judgment was made contrary to the rules of natural justice. The second and third of these issues are apparent on the face of the Setting-Aside Summonses because those are the grounds on which nTan seeks to set aside the CA Judgment. As for the first, we think that insolvency is an issue not simply because the Setting-Aside Summonses arise against the background of a scheme of arrangement, but because any analysis of the court’s jurisdiction in the context of a scheme of arrangement must take into account s 210(4) of the Companies Act, which provides that the court “may grant its approval to a compromise or arrangement subject to such alterations or conditions as it thinks just”. 70     With the issues identified we can proceed to determine whether the Setting-Aside Summonses involve the ring-fenced areas of law such as to require a “special reason” for admission of foreign senior counsel. It is clear at once that the issue of insolvency does not touch on any of the ring-fenced areas. More controversial might be the other two issues. The Banks were the only appellants who, before us, took the position that the Setting-Aside Summonses involve administrative law. The banks argued that administrative law encompasses questions of the jurisdiction as well as the natural justice obligations of public bodies and authorities, and that, since the Court of Appeal is a public authority, the issues of its jurisdiction and natural justice obligations are of an administrative law nature. 71     It is true that in administrative law what is often claimed is that some decision-making body has made a decision outside of its jurisdiction or in breach of natural justice. It is also true that those are precisely the types of claims that nTan is making against the Court of Appeal in the Setting-Aside Summonses. But in our view it does not follow that the Setting-Aside Summonses are concerned with administrative law. It should be noted that s 15(2) of the LPA, which introduces the requirement of a special reason for the ring-fenced areas, states that this is so “in any case involving any area of legal practice” prescribed for this purpose. The fact that in order to resolve some of the issues raised in the Setting-Aside Summonses it might be necessary to examine cases or principles from the realm of administrative law does not make this a case involving that area of legal practice. Administrative law does not extend to a body such as the Court of Appeal which has been vested with “judicial power”. 72Halsbury’s Laws of Singaporevol 1 (LexisNexis Singapore, 2012 Reissue) puts forward at para 10.001 a number of definitions of administrative law. One of these is that it is “the body of principles, practices and institutions which provide mechanisms for the supervision, regulation and structuring of the exercise of executive power of government”. We think that this definition is helpful for present purposes because the reference toexecutivepower suggests that the exercise of what is unquestionablyjudicialpower (and that by the highest court in the land) does not fall within the ambit of administrative law. 73     The Banks did not argue that the Setting-Aside Summonses involve constitutional law, and in our opinion they were correct to refrain from advancing such a submission. It does not appear to us that the Setting-Aside Summonses will involve any question of constitutional interpretation, because we do not think that the resolution of the issue of the Court of Appeal’s jurisdiction will call for discussion of the meaning of “judicial power” in Art 93 of the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint) and indeed it was not suggested to the contrary. What is far more likely to be discussed is s 210(4) of the Companies Act. Hence we are satisfied that the Setting-Aside Summonses do not involve the ring-fenced areas of law, and therefore no “special reason” is required for the admission of Mr Beloff.",
        "Whether Mr Beloff has “special qualifications or experience”": "74     We turn to the last of the mandatory requirements. At the outset, it must be noted that Mr Beloff has an impressive range of expertise. But having said this, the question is whether this is such as to meet the requirement in s 15(1)(c) of the Legal Profession Act of having “special qualifications and experience”for the purposes of the Setting-Aside Summonses. We agree with the Attorney-General’s submission that the two interwoven issues of insolvency and the court’s jurisdiction call for expertise in schemes of arrangement, in particular, expertise in Singapore’s regime governing scheme of arrangements, which is unique in that it is a hybrid of the English and Australian provisions (seeThe Oriental Insurance Co Ltd v Reliance National Asia Re Pte Ltd[2008] 3 SLR(R) 121 at [34]). Mr Beloff does not have any notable expertise in insolvency law, let alone with schemes of arrangement in Singapore. Moreover, issues of the court’s jurisdiction may touch on another piece of local legislation, the Supreme Court of Judicature Act, and it does not appear that Mr Beloff has particular expertise on that front either. 75     However, there is a separate issue on the question of natural justice and we accept that Mr Beloff has special qualifications or experience in these matters having regard to his expertise as evidenced in his CV in the area of administrative and public law from which principles may be drawn in the resolution of this question when the Setting-Aside Summonses are determined. While we note that the Setting-Aside Summonses are just as much about insolvency and the court’s jurisdiction as they are about natural justice, on the other hand, it is also true that breach of natural justice formed one of the two principal grounds of nTan’s case in the Setting-Aside Summonses. We are therefore inclined to accept that Mr Beloff does cross the threshold under s 15(1)(c) on this narrow ground. 76     Before leaving this issue, we touch on one point. The Judge considered at [46] of her decision below that Mr Beloff’s experience on the bench in various jurisdictions could enable him to assist “in relation to an appellate court’s jurisdiction to supplement an earlier decision and to the appropriate procedures to be followed so as to ensure that the rules of natural justice are observed”. Although she did not address the s 15(1)(c) requirement explicitly it may be inferred that she thought that Mr Beloff’s experience as a judge would count towards having “special qualifications or experience” to deal with issues of natural justice and the court’s jurisdiction. We do not think this follows. Judges do not generally interrogate their jurisdiction or the propriety of procedure unless it is made a live issue in the case before them. The mere fact that Mr Beloff had been a judge does not seem to us to make him more qualified thereby to address questions of jurisdiction and natural justice. And there was nothing in the evidence to indicate that Mr Beloff had previously had the occasion to consider these matters deeply. 77     The minimum requirement, as embodied in s 15(1)(c) of the Legal Profession Act, is that the particular expertise of the foreign counsel in question must be especially relevant to the issues in the case. Here, Mr Beloff’s expertise is relevant to some but not all of the issues. There is plainly no rule that in every case involving multiple issues the foreign counsel’s expertise must be relevant to every one of those issues. But here, as we have noted, Mr Beloff has special expertise in one of perhaps two or three major issues in the case and we are inclined to conclude that on the facts of this case, he does cross the s 15(1)(c) requirement of having “special qualifications and experience” for the purpose of the Setting-Aside Summonses. 78     We therefore turn to consider the Notification Matters.",
        "The Notification Matters": "Nature of the factual and legal issues 79     In forming an assessment of the complexity of the legal issues in a case the question arises as to the extent to which the court should consider the substantive merits of the case. Certainly not too much, for at the preliminary stage of applying to admit foreign senior counsel the parties’ arguments may not yet be fully formed; yet, not too little, for if the substantive merits are unarguably in one party’s favour then it cannot be said that the issues are complex. Something of that tension between too much and too little is manifest in the present case. The Banks, and to a lesser degree the Company, put forward fairly developed contentions in support of their positions in the Setting-Aside Summonses. The Banks argued, for example, that there was no want of jurisdiction in the CA Judgment because the Court of Appeal in their Brief Grounds had given parties liberty to apply, and the Monitoring Committee’s request for directions as to taxation of VAF fell neatly within that liberty to apply. nTan’s response was simply to say that the Banks had strayed impermissibly into the merits. While the Banks’ arguments might seem persuasive, at this early stage, this might at least in part stem from the absence of any riposte from nTan. 80     In addressing whether special reason had to be shown in this case, we recounted the nature of the issues presented in this case. In so far as the questions of insolvency and the jurisdiction of the court are concerned, these concern matters of Singapore law that are idiosyncratic in some respects. It does not seem to us that these pose particular difficulty or complexity as to be beyond the ability of competent Singapore counsel. On the contrary, it would seem to us that Singapore counsel would ordinarily be best placed to deal with such issues. In so far as the particular question of natural justice that is raised in this case is concerned, although this is a relatively uncommon matter, on the other hand a similar issue was raised and recently settled by the decision of this court inManagement Corporation Strata Title Plan No 301 v Lee Tat Development Pte Ltd[2011] 1 SLR 998 (“Lee Tat”) and so again, this would be well within the range of competent Singapore counsel. It is therefore not obvious to us that any of the three issues would give rise to unusual complexity or difficulty. Availability of local counsel 81     We turn, for convenience, to the third Notification Matter, being the availability of SCs and other local counsel of appropriate experience. It is clear to us that the present case is far from the paradigm example of “need” described earlier. It is not to the point how many SCs or local counsel nTan sought to engage; the fact is that throughout the legal proceedings relating to the Scheme it has been represented by one of Singapore’s largest and most prominent law firms, A&G. It has had the services of lead counsel, Mr Edwin Tong, who, despite not being an SC, is a respected and highly competent advocate and solicitor. This is most definitely not a case likeRe Andrewsin which the litigant found that a significant number of SCs were either unable or unwilling to act for him, and where the QC sought to be admitted had previously assisted him extensively in preparing his case. Necessity and reasonableness 82     In light of the foregoing two considerations, it is difficult to see how nTan could mount the argument in relation to the second Notification Matter, that itneededthe services of foreign counsel to conduct its case properly. The issues, we have found, were not unduly complex and well within the range of competent Singapore counsel, and nTan was and continues to be represented by very able Singapore counsel. In truth, there was no real question of inequality of arms. The Judge had found, as was undoubtedly the case, that either Mr Tong, or his partner, Mr Ang Cheng Hock SC, was well able to represent nTan in this matter. Stripped of all the emotion, this was the simple position. In the absence of any suggestion that nTan would suffer substantial prejudice if Mr Beloff was not admitted, there was no basis at all for concluding that there was any need for a foreign counsel to be admitted. In all the circumstances, it would not have been reasonable or consistent with the framework set out in the Notification to permit the admission of a foreign senior counsel to represent nTan in these matters. 83     But before leaving this, we must touch on one point. The Judge said at [51] of her decision that she was “strongly influenced” by the nature of the case that nTan might wish to make in the Setting-Aside Summonses, this, in essence, being that the Court of Appeal acted improperly. It might be inferred that she thought that there was some necessity for Mr Beloff’s services in such a case because foreign counsel would pull no punches whereas local counsel might be tempted to blunt the sharp edges of nTan’s arguments. We must emphatically disagree with this. Mr Tong himself said that if the appeal was allowed, he would pursue his case with the utmost force and on our part, we expect nothing less. Local counsel inLee Tatadvanced a similar submission that Singapore’s apex court had breached the rules of natural justice with all due vigour both at first instance and before this court; the fact that counsel who argued the case at first instance is now the Chief Justice suggests that those who present difficult arguments to the court with all due vigour but also with all due respect and etiquette that we expect of our officers, have nothing to fear. This indeed is inherent in the oath that is taken by them. In keeping with this, A&G has not shied away from filing the Setting-Aside Summonses on nTan’s behalf. In the circumstances, we consider that this was not a consideration to which the Judge should have given any weight at all. 84     On the other hand, the Judge did not take into account a consideration which she ought to have done. That consideration was articulated by Rajah JA inRe Lord Goldsmithat [25]–[38]; unfortunately, the Judge did not have the benefit of those observations prior to issuing her decision. When admission of foreign senior counsel is sought only for the purpose of an appeal as opposed to a trial, the necessity of admitting foreign senior counsel will “ordinarily be less apparent”. The reason is that non-admission of foreign counsel does not prevent him from contributing to the written submissions, and in appeals in Singapore, written advocacy plays an especially important role in making one’s case before this court. It is the written submissions that convey a litigant’s case in all its detail and nuance, while the oral arguments supplement and clarify what is already in writing. The Setting-Aside Summonses are examples of such proceedings even though they are not strictly speaking appeals. Rajah JA did not suggest, and neither do we, that there is no benefit in excellent oral advocacy. But in the present case the necessity of admitting Mr Beloff is diminished when it is remembered that he or any other suitable counsel engaged by nTan may yet bring all his learning and experience to bear on the preparation of nTan’s case. Whether appellate intervention is warranted 85     From the foregoing analysis it should be evident that we see in the Judge’s exercise of her discretion, four main errors. First, she appears to have overestimated Mr Beloff’s ability to assist in the Setting-Aside Summonses, since as we have noted some of the issues raised were not within his realm of expertise. Second, undue weight was given to an unfounded concern that local counsel would hesitate in making the arguments nTan would wish to have made. Third, no consideration was given to the fact that even if not admitted, nothing precluded Mr Beloff from contributing to nTan’s written submissions. Fourth and finally, while she acknowledged that nTan had all along been represented by one of Singapore’s largest law firms, she took the view that this consideration was outweighed by the factors amassed in favour of Mr Beloff’s admission, when in truth, those factors did not in fact add weight to nTan’s case. 86     For these reasons, we consider that appellate intervention is warranted. Postscript on the appellants’ arguments 87     Before closing we wish to address two contentions that were put forward by some of the appellants. The first was that there should generally not be any comparison of the credentials of the foreign senior counsel sought to be admitted with that of local counsel. The Law Society found support for this inRe Lord Goldsmithat [54], where Rajah JA said that an argument that foreign counsel would do “an even better job” than available local counsel “does not really address the question of necessity”, for necessity “would imply that there was some chance that the issues in a case would not be properly ventilated or framed without the participation of foreign senior counsel”. We agree with these observations of Rajah JA. There will ordinarily be little to be gained by such a comparison. The question is not whether the litigant will find assistance from foreign counsel who might seem in some way more capable than available local counsel. The real question is whether the litigant can find good and adequate assistance here, or from the other viewpoint, whether the litigant would be materially prejudiced if deprived of the services of the foreign counsel. 88     The second contention we wish to address was that, even on the premise that Mr Beloff’s qualifications and experience were relevant to the issues in the Setting-Aside Summonses, he would not be in a position to assist the court because he would, as nTan’s counsel, be adopting a partisan stand and would not be expressing independent and impartial views as anamicuswould. This is misconceived. Those who appear for parties are doubtlessly partisan in the sense that they must act in their clients’ best interests, but equally, they owe duties to the court, and one of those duties is not to distort or misrepresent the facts or the law or anything else in the pursuit of a victorious outcome. They must act honestly and to the best of their knowledge and ability in the discharge of their professional responsibilities. It is therefore misconceived to suggest that partisan counsel cannot assist the court; in fact it is precisely what the court expects of them and it is precisely what happens in our courts every day. Perhaps, the point might have been that to the extent Mr Beloff’s expertise as a judge was being called in aid, he would not be sharing this as a friend of the court but rather as counsel. But this expertise, as we have noted, was simply not relevant in this case.",
        "Conclusion": "89     The conclusion of the matter is that we allow the appeals and set aside the Judge’s decision to admit Mr Beloff on anad hocbasis to represent nTan in the Setting-Aside Summonses. There will be costs to the appellants which are to be taxed if not agreed. We also make the usual consequential orders."
    }
}