{
    "case_title": "Sinwa SS (HK) Co Ltd\n      v\n      Nordic International Ltd and another",
    "ncitation": "[2014] SGCA 63",
    "coram": "Sundaresh Menon CJ; \n      Andrew Phang Boon Leong JA; \n      Steven Chong J",
    "sections": {
        "Introduction": "1       This case concerned an interlocutory appeal\n                    against a decision of the High Court that there be “no order” on a\n                    summary judgment application filed by the appellant, Sinwa SS (HK) Co Ltd\n                    (“the Appellant”). 2       Previously, the statutory scheme under the\n                    Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”)\n                    was such that a party’s right of appeal from the High Court to the Court\n                    of Appeal in respect of interlocutory applications rested on the dichotomy\n                    between interlocutory and final orders. If an order was final, then an appeal\n                    could be brought to the Court of Appeal as of right; if the order was\n                    interlocutory in nature, then a party generally retained a right of appeal to\n                    the Court of Appeal, subject to the requirement that an application be brought\n                    within seven days for leave to present further arguments to the High Court\n                    judge, and except where the old Supreme Court of Judicature Act (Cap 322, 1999\n                    Rev Ed) expressly provided for particular orders to be non-appealable or\n                    appealable only with leave (seeDorsey James Michael v World\n                        Sport Group Pte Ltd[2013] 3 SLR 354 (“Dorsey”) at [26]). InWellmix Organics\n                        (International) Pte Ltd v Lau Yu Man[2006] 2 SLR(R) 525 at [14],\n                    this court held that the test of whether a given order was interlocutory or\n                    final was whether the order finally disposed of the rights of the\n                    parties. 3       The significance of the dichotomy between\n                    interlocutory and final orders diminished somewhat with the introduction of\n                    fixed schedules governing the right of appeal from specific types of orders\n                    pursuant to the Supreme Court of Judicature (Amendment) Act 2010 (Act 30 of\n                    2010) (“the 2010 Amendments”). The 2010 Amendments introduced into\n                    the SCJA the Fourth and Fifth Schedules, which expressly provided for certain\n                    types of orders to be non-appealable or appealable only with leave respectively.\n                    A “calibrated approach” was thereby established to streamline and\n                    restrict appeals to the Court of Appeal, wherein interlocutory applications were\n                    categorised based on their importance to the substantive outcome of the case\n                    (seeSingapore Parliamentary Debates,Official Report(18 October 2010) vol  87\n                        (“Parliamentary Debates”) at\n                    cols 1369–1370). The rationale behind such an approach was to ensure that\n                    in general, a decision of a High Court judge in an interlocutory application is\n                    not unnecessarily taken all the way to the Court of Appeal, leading to a waste\n                    of judicial time (seeOpenNet Pte Ltd v Info-communications\n                        Development Authority of Singapore[2013] 2 SLR 880\n                        (“OpenNet”) at\n                [18]). 4       Despite the 2010 Amendments, issues in relation\n                    to a party’s right of appeal on interlocutory matters have continued to\n                    arise in litigation. Recently, the cases ofNim Minimaart\n                        (suing as a firm) v Management Corporation Strata Title Plan No 1079 and\n                        others[2014] 1 SLR 108 andCitiwall Safety\n                        Glass Pte Ltd v Mansource Interior Pte Ltd[2014] SGCA 61\n                    dealt with the question of whether leave was required to appeal to the Court of\n                    Appeal in different contexts. In the present appeal, a preliminary issue arose\n                    as to whether the Appellant had a right of appeal to this court from the High\n                    Court decision below and, accordingly, whether this court had the jurisdiction\n                    under the SCJA to hear the appeal. 5       At the end of the hearing, we concluded that we\n                    did not have jurisdiction to hear the appeal, as the “no order”\n                    made by the High Court below was, on a purposive interpretation, effectively one\n                    that was caught by the Fourth Schedule of the SCJA. We now give the detailed\n                    grounds for our decision.",
        "Facts": "",
        "Parties to the dispute": "6       The Appellant was a company incorporated in Hong\n                    Kong and was in the business of,inter alia,\n                    marine supply and logistics. The first respondent, Nordic International Limited\n                    (“the 1st Respondent”), was a company incorporated in\n                    the British Virgin Islands and in the business of converting and equipping\n                    ships. The second respondent, Morten Innhaug (“the\n                    2nd Respondent”), was a Norwegian national habitually resident in\n                    Singapore. 7       The Appellant and the 2nd Respondent were\n                    shareholders of the 1st Respondent, each holding 50% of the 1st\n                    Respondent’s shares pursuant to a shareholders’ agreement dated 4\n                    July 2007 (“the Agreement”). The Agreement sets out the terms of\n                    the parties’ joint venture which involved the conversion of a fishing\n                    trawler into a seismic survey vessel (“the Vessel”). The\n                    1st Respondent was the joint venture vehicle and the owner of the Vessel.\n                    The Agreement was initially concluded between the 2nd Respondent and a Singapore\n                    company called Sinwa Limited. On 28 August 2007, Sinwa Limited’s\n                    rights and obligations under the Agreement were novated to the\n                Appellant.",
        "The Time Charter": "8       On 8 June 2007, the 1st Respondent\n                    entered into a time charter (“the Time Charter”) with a Singapore\n                    company known as BGP Geoexplorer Pte Ltd (“BGP”). The Time Charter\n                    was for a three-year period at a daily rate of US$37,000. Earlier in\n                    December 2006, BGP had entered into an agreement with TGS-NOPEC Geophysical\n                    Company SA (“TGS”) for the provision of seismic acquisition\n                    services (“the Seismic Agreement”). 9       According to the Appellant, on 23 August\n                    2008, BGP, TGS, and a company known as Nordic Maritime Pte Ltd\n                    (“NMPL”) entered into a memorandum of agreement (“the\n                    MOA”) wherein it was agreed that BGP would transfer and assign to NMPL\n                    its rights and obligations in the Time Charter as well as in the Seismic\n                    Agreement. On 22 September 2008, a notice of assignment of the Time Charter\n                    was signed between BGP and a company known as Nordic Geo Services Limited\n                    (“NGS”). The Appellant claimed that NGS was a wholly-owned\n                    subsidiary of NMPL, which in turn was owned and/or controlled by the 2nd\n                    Respondent. The Appellant’s position was that the assignment of the Time\n                    Charter was null and void as it had been done without any prior notice or\n                    consent from the directors of the 1st Respondent appointed by the\n                    Appellant. Alternatively, the Appellant maintained that regardless of the\n                    validity of the assignment, BGP remained responsible to the 1st Respondent\n                    for due performance of the Time Charter under its terms. 10     On 7 April 2009, the Appellant, on behalf\n                    of the 1st Respondent, instructed its solicitors to send a letter of demand\n                    to BGP for the outstanding charter hire fees due to the 1st Respondent.\n                    BGP’s solicitors responded on 22 April 2009 maintaining that its\n                    rights and obligations under the Time Charter had already been transferred and\n                    assigned to NMPL and consequently it owed no obligations to the\n                    1st Respondent under the Time Charter.",
        "Arbitration proceedings against BGP and other related\n                proceedings": "11     Subsequently, on 18 November 2009, the\n                    Appellant, on behalf of the 1st Respondent, commenced arbitration\n                    proceedings against BGP for the recovery of the outstanding charter hire fees\n                    due under the Time Charter (“the BGP Arbitration”). The 2nd\n                    Respondent opposed the BGP Arbitration proceedings, and on 7 January 2010,\n                    applied to the High CourtvideOriginating\n                    Summons No 22 of 2010 (“OS 22/2010”) to effectively restrain\n                    the BGP Arbitration. In OS 22/2010, the 2nd Respondent sought a number of\n                    reliefs including a declaration that on a proper interpretation of the\n                    Agreement, the directors of the 1st Respondent appointed by the 2nd\n                    Respondent had the sole discretion to grant consent on behalf of the\n                    1st Respondent to assign the Time Charter from BGP to NGS, as well as to\n                    decide whether or not to commence arbitration against BGP in respect of any\n                    purported breaches of the Time Charter. 12     OS 22/2010 was dismissed by Lai Siu\n                    Chiu J. In her judgment issued on 24 January 2011, Lai J held that\n                    under the Agreement, the parties were obliged to come to a unanimous decision on\n                    the issue of the assignment of the Time Charter as well as the appointment of\n                    lawyers to pursue the 1st Respondent’s claim against BGP (seeMorten Innhaug v Sinwa SS (HK) Co Ltd and\n                        others[2011] SGHC 20 at [44]). If the parties could not agree,\n                    they were obliged to proceed to arbitration as provided for in the\n                    Agreement. 13     On 1 August 2011, BGP applied to the High\n                    CourtvideOriginating Summons No 650 of 2011\n                    (“OS 650/2011”) for an order that the appointed arbitrator in the\n                    BGP Arbitration did not have jurisdiction as the Appellant did not have the\n                    requisite authority to commence the arbitration proceedings on behalf of the\n                    1st Respondent. On 2 August 2012, the High Court decided\n                    OS 650/2011 in favour of BGP, holding that the appointed arbitrator did not\n                    have jurisdiction over the BGP Arbitration. Consequently, the BGP Arbitration\n                    was discontinued. 14     Meanwhile, on 24 October 2011, a board\n                    meeting of the 1st Respondent was convened to discuss possible proceedings\n                    against BGP. No resolutions were passed at the meeting, which ended in a\n                    deadlock. As such, on 9 January 2012, the 2nd Respondent commenced\n                    arbitration proceedings against the Appellant (in accordance with the Singapore\n                    International Arbitration Centre Rules) (“the SIAC Arbitration”),\n                    seeking to resolve this deadlock as provided for under the terms of the\n                    Agreement. Directions were given for the SIAC Arbitration to proceed in two\n                    stages: Stage 1 was to determine whether there was a deadlock within the\n                    meaning of the Agreement, and if so, Stage 2 was to determine the price at which\n                    the 2nd Respondent was to buy out the Appellant’s share in the\n                    1st Respondent. 15     On 1 October 2013, a partial award was\n                    made in the SIAC Arbitration (“the Partial Award”). The arbitrator\n                    found that a deadlock had arisen, and that the Appellant was to sell its shares\n                    to the 2nd Respondent at a price to be assessed (in Stage 2 of the SIAC\n                    Arbitration). We noted that there was no suggestion before us that the Partial\n                    Award was improperly made or that it should be set aside.",
        "OS 960/2009 and Suit 875/2010": "16     Apart from the proceedings concerning BGP, we\n                    noted that there were also ongoing proceedings in the High Court between the\n                    1st Respondent and the 2nd Respondent relating to an alleged breach of\n                    director’s duties. On 25 August 2009, the Appellant applied to the\n                    High CourtvideOriginating Summons No 960 of\n                    2009 (“OS 960/2009”) for leave to bring an action on behalf of the\n                    1st Respondent against the 2nd Respondent for breaches of director’s\n                    duties relating to the assignment of the Time Charter from BGP to NGS. Leave was\n                    initially denied (seeSinwa SS (HK) Co Ltd v Morten\n                        Innhaug[2010] 4 SLR 1) but was granted on appeal. 17     Thereafter, in November 2010, the Appellant\n                    commenced Suit No 875 of 2010 (“Suit 875/2010”) on\n                    behalf of the 1st Respondent against the 2nd Respondent, seekinginter aliaa declaration that the 2nd\n                    Respondent had breached his director’s duties to the 1st Respondent\n                    by procuring the assignment of the Time Charter from BGP to a company owned and\n                    controlled by him (ie, NGS). Suit 875/2010 is\n                    still pending in the High Court.",
        "The lead up to the present appeal": "18     On 21 November 2013, the Appellant through its\n                    solicitors sent the 2nd Respondent a notice of intention to apply for leave of\n                    court to commence arbitration proceedings against BGP. In that notice, the\n                    Appellant requested that the 2nd Respondent consent and/or cause a Board of\n                    Directors’ resolution to be passed for arbitration proceedings to be\n                    commenced by the 1st Respondent against BGP, failing which the Appellant\n                    would seek the court’s leave to commence the arbitration\n                    proceedings. 19     As the Appellant did not receive a favourable\n                    response from the 2nd Respondent, it commenced\n                    Suit No 1166 of 2013 (“Suit 1166/2013”)\n                    against the 1st Respondent, the 2nd Respondent, and BGP on 20 December\n                    2013, seeking,inter alia, an order that the\n                    Appellant be at liberty to commence arbitration proceedings and/or any other\n                    proceedings on behalf of the 1st Respondent against BGP for breaches of the\n                    Time Charter. On 26 March 2014, the Appellant filed Summons No 1544 of 2014\n                    (“SUM 1544/2014”) for summary judgment to be entered in its favour\n                    against the 1st Respondent and the 2nd Respondent. (It should be noted\n                    that on 16 April 2014, BGP ceased to be a party to Suit 1166/2013 upon\n                    its application in Summons No 697 of 2014.) SUM 1544/2014 was the\n                    application from which the present appeal arose.",
        "The decision below": "20     SUM 1544/2014 was heard before a High\n                    Court judge (“the Judge”) on 11 June 2014. Having heard the\n                    parties, the Judge made no order as to SUM 1544/2014, without prejudice to\n                    a fresh application being made by the Appellant. 21     In his grounds of decision issued on\n                    9 July 2014 (seeSinwa SS (HK) Co Ltd v Nordic\n                        International Ltd and others[2014] SGHC 132 (“the\n                    GD”)), the Judge explained that his decision was based on the fact that\n                    the Partial Award had already been made in the SIAC Arbitration and the\n                    Appellant was soon to sell its stake in the 1st Respondent. At [10] of the\n                    GD, the Judge stated that “[b]arring a breakdown in the ongoing\n                    arbitration proceedings between [the Appellant] and [the 2nd Respondent], [the\n                    Appellant] would soon likely have neither any legal interest nor standing to\n                    pursue proceedings against [BGP] on behalf of [the 1st Respondent]”.\n                    The Judge noted that Stage 2 of the SIAC Arbitration was already somewhat\n                    underway, as the valuation process for the Appellant’s share in the\n                    1st Respondent was to be completed by 31 July 2014. Notwithstanding\n                    this, the Judge gave the Appellant liberty to apply should it later have better\n                    evidence and arguments than those it produced before him. 22     Dissatisfied, the Appellant filed an appeal to\n                    this court against the part of the Judge’s decision that there be no order\n                    as to the Appellant’s applicationvideSUM 1544/2014. The Appellant also made an applicationvideSummons No 4987 of 2014\n                    (“SUM 4987/2014”) for leave to adduce further evidence in\n                    this appeal. As the 2nd Respondent had consented to the further evidence being\n                    adduced, we granted an order in terms for SUM 4987/2014.",
        "Issues before this court": "23     This appeal raised two main issues of law,\n                    namely: (a)     Can a court hearing an application\n                        for summary judgment make “no order” on the\n                        application? (b)     If\n                        so, does a party have the right to appeal to the Court of Appeal against\n                        such an order? 24     The first issue arose out of the\n                    Appellant’s submission that under the Rules of Court (Cap 322, R 5, 2014\n                    Rev Ed) (“Rules of Court”), the “no order” made by\n                    the Judge was not an order that could be made at the hearing of a summary\n                    judgment application. The Appellant submitted that pursuant to O 14 r 3 of\n                    the Rules of Court, the court may either grant summary judgment to the\n                    plaintiff, grant the defendant unconditional or conditional leave to defend the\n                    action, or dismiss the application; no other orders could be made by the court\n                    in a summary judgment application. 25     As for the second issue, it was specifically\n                    raised by this court for the parties’ consideration as it concerned the\n                    court’s jurisdiction to entertain such an appeal. The Appellant submitted\n                    that since the Judge’s order of “no order” did not\n                    explicitly fall within the Fourth and Fifth Schedules of the SCJA, it was\n                    therefore appealable as of right pursuant to s 29A(1) of the SCJA. Although\n                    counsel for the 2nd Respondent did not seem to contest this assertion, we had\n                    our doubts as to whether it was correct and therefore invited the parties to\n                    address us during the hearing on whether the Judge’s order of “no\n                    order” should be treated as equivalent to an order giving leave to defend\n                    and therefore falling within the Fourth Schedule of the SCJA.",
        "Our decision": "",
        "Whether a court hearing a summary judgment application can make\n                “no order” on the application": "26     At the outset, it is useful to reiterate that\n                    a purposive approach to statutory interpretation is to be adopted in Singapore.\n                    This is mandated by s 9A(1) of the Interpretation Act (Cap 1, 2002 Rev Ed),\n                    which provides that “an interpretation that would promote the purpose or\n                    object underlying the written law (whether that purpose or object is expressly\n                    stated in the written law or not) shall be preferred to an interpretation that\n                    would not promote that purpose or object”. It is well-established in our\n                    case law that this purposive approach is paramount and must take precedence over\n                    any other common law principles of statutory interpretation (Dorsey(cited at [2] above) at [18]). It is also clear that\n                    under the purposive approach mandated by s 9A(1) of the Interpretation Act,\n                    reference may be made to extrinsic materials such as parliamentary debates even\n                    if the words of the statutory provision are unambiguous or do not produce\n                    unreasonable or absurd results (Dorseyat\n                    [19]). 27     In the present case, we were of the view that,\n                    contrary to the Appellant’s submissions, it was indeed possible for a\n                    court hearing a summary judgment application to make “no order” on\n                    the application. Order 14 r 3 of the Rules of Court, which reads as\n                    follows, does not purport to lay down an exhaustive list of the possible\n                    outcomes of a summary judgment application: Judgment for plaintiff (O. 14,\n                            r. 3) 3.—(1)    Unless on\n                            the hearing of an application under Rule 1 either the Court dismisses\n                            the application or the defendant satisfies the Court with respect to the\n                            claim, or part of a claim, to which the application relates that there\n                            is an issue or question in dispute which ought to be tried or that there\n                            ought for some other reason to be a trial of that claim or part, the\n                            Court may give such judgment for the plaintiff against that defendant on\n                            that claim or part as may be just having regard to the nature of the\n                            remedy or relief claimed. (2)    The Court may by order, and subject to such\n                            conditions, if any, as may be just, stay execution of any judgment given\n                            against a defendant under this Rule until after the trial of any\n                            counterclaim made or raised by the defendant in the\n                        action. 28     In particular, O 14 r 3(1) of the Rules\n                    of Court only stipulates that the court “may” give summary judgment for the plaintiff unless\n                    either the court dismisses the application or the defendant satisfies the court\n                    that there is a triable issue. It does not dictate that the possible outcomes of\n                    a summary judgment application are necessarily ternary in nature (ie, (a) the plaintiff obtains summary judgment; (b) the\n                    defendant obtains unconditional or conditional leave to defend; or (c) the\n                    application is dismissed). Neither does it preclude the court hearing a summary\n                    judgment application from making no order on the application. 29     Indeed, the courts have found it appropriate\n                    to make “no order” pursuant to summary judgment applications on\n                    several occasions, although such occasions are admittedly not common. InWoh Hup (Pte) Ltd and another v Turner (East Asia) Pte\n                        Ltd[1985–1986] SLR(R) 503, the plaintiffs had applied for\n                    summary judgment against the defendant, whereas the defendant opposed the\n                    summary judgment application and sought a stay of proceedings on the ground that\n                    the parties had agreed to refer the dispute to arbitration. The applications\n                    were heard by a Senior Assistant Registrar, who granted a conditional stay of\n                    proceedings and therefore made no order on the summary judgment application. On\n                    appeal to the High Court, the Registrar’s orders were set aside, but not\n                    on the basis that “no order” was not a permissible order to make\n                    in respect of a summary judgment application. A number of other cases have\n                    concerned similar facts where a stay of proceedings pending arbitration was\n                    granted and “no order” was made on a party’s summary\n                    judgment application (seeBrightside Mechanical &\n                        Electrical Services Group Ltd and another v Hyundai Engineering &\n                        Construction Co Ltd[1988] 1 SLR(R) 1,Aurum Building Services (Pte) Ltd v Greatearth Construction Pte\n                        Ltd[1994] 2 SLR(R) 805, andCoop\n                        International Pte Ltd v Ebel SA[1998] 1 SLR(R) 615). Yet\n                    another example would be the decision inShunmugam Jayakumar\n                        and others v Jeyaretnam Joshua Benjamin and others[1996]\n                    2 SLR(R) 658 where the plaintiffs had applied to the court for summary\n                    judgment and alternatively, for judgment on admission of facts under O 27 r\n                    3 of the Rules of the Supreme Court (Cap 322, R 5, 1990 Ed). The Senior\n                    Assistant Registrar who heard the application granted interlocutory judgment\n                    under O 27 r 3 and consequently made no order on the summary judgment\n                    application. 30     In the present case, the Judge was entitled to\n                    make “no order” as regards the Appellant’s summary judgment\n                    application. Without delving into the merits of the appeal, it seemed to us that\n                    the decision by the Judge to make “no order” with liberty to apply\n                    was eminently sensible and fair in the circumstances. Given that the Appellant\n                    was to sell its shares in the 1st Respondent to the 2nd Respondent at a\n                    price to be assessed pursuant to the Partial Award issued in the SIAC\n                    Arbitration, and there was no suggestion that the Partial Award could be\n                    impugned, the Judge’s decision to make “no order” on the\n                    Appellant’s summary judgment application was understandable. “No\n                    order” was made by the Judge not on account of his finding that the\n                    application lacked merits but rather because the Partial Award had a material\n                    bearing on the Appellant’s capacity to commence the arbitration against\n                    BGP on behalf of the 1st Respondent. In fact, by making “no\n                    order” without prejudice to a fresh application and giving the Appellant\n                    liberty to apply, the Judge did not foreclose the Appellant’s rights. The\n                    significance and utility of this liberty granted by the Judge will become\n                    apparent in light of the proposal made by counsel for the 2nd Respondent at the\n                    close of the hearing before us. This is explained in the concluding remarks\n                    below.",
        "Whether a party has the right to appeal to the Court of Appeal\n                against an order of “no order” made in respect of a summary judgment\n                application": "31     Having answered the first question in the\n                    affirmative, we now turn to the second question of whether a party has the right\n                    to appeal to the Court of Appeal against an order of “no order”\n                    made in respect of a summary judgment application. As stated above, this was an\n                    important question as it concerned the jurisdiction of this court to hear the\n                    appeal. 32     In the first place, it is important to have\n                    regard to the provisions of the SCJA. It is an oft-cited principle that as the\n                    Court of Appeal is a creature of statute, it is only seised of the jurisdiction\n                    conferred upon it by the statute which creates it (Blenwel\n                        Agencies Pte Ltd v Tan Lee King[2008] 2 SLR(R) 529 at [23]). The\n                    starting point for the civil jurisdiction of this court is s 29A(1) of the\n                    SCJA, which provides that the Court of Appeal has jurisdiction over\n                    “appeals from any judgment or order of the High Court in any civil cause\n                    or matter”, “subject nevertheless to the provisions of [the SCJA]\n                    or any other written law regulating the terms and conditions upon which such\n                    appeals may be brought”. As was observed inDorseyat [11], the effect of s 29A(1) of the SCJA is that\n                    any judgment or order of the High Court is ordinarily appealable as of right,\n                    subject to any contrary provisions in the SCJA or any other written law. In this\n                    regard, reference may be made to s 34(1) of the SCJA which sets out the\n                    matters that are non-appealable to the Court of Appeal, as well as s 34(2)\n                    of the SCJA which sets out matters which are appealable only with leave. For\n                    present purposes, we need only be concerned with s 34(1)(a) and s 34(2)(d) of the\n                    SCJA, which make reference to the Fourth and Fifth Schedules\n                    respectively. 33     The Fifth Schedule of the SCJA lists the\n                    orders made by a judge that are appealable to the Court of Appeal only with\n                    leave. Paragraph (e)(i) of the Fifth Schedule of\n                    the SCJA excludes orders made at an application for summary judgment and reads\n                    as follows: ORDERS MADE BY JUDGE THAT ARE APPEALABLE ONLY WITH LEAVE Except with leave of a Judge, no appeal shall be brought to the Court of\n                        Appeal in any of the following cases: … (e)where a Judge makes an order at the hearing\n                            of any interlocutory application other than an application for any of\n                            the following matters: (i)    for summary judgment; … 34     As for the Fourth Schedule of the SCJA, paras\n                        (a) and (b)\n                    provide that orders giving unconditional or conditional leave to defend any\n                    proceedings are non-appealable as follows: ORDERS MADE BY JUDGE THAT ARE\n                        NON-APPEALABLE No appeal shall be brought to the Court of Appeal in any of the following\n                        cases: (a)where a Judge makes\n                            an order giving unconditional leave to defend any\n                        proceedings; (b)where a Judge makes\n                            an order giving leave to defend any proceedings on condition that the\n                            party defending those proceedings pays into court or gives security for\n                            the sum claimed, except if the appellant is that party; … 35     The net effect of these provisions as regards\n                    an application for summary judgment was succinctly summarised by this court inOpenNetat [19] as follows: … Paragraph (e) of the Fifth\n                        Schedule of the SCJA is a catch-all provision imposing a blanket\n                        requirement for leave to appeal to the Court of Appeal for any\n                        “interlocutory application”, and para (e)(i) specifically lists an order made at the hearing of an\n                        application for summary judgment to be exempted from this blanket\n                        requirement for leave. Where an application for summary judgment is refused\n                        and leave to defend the proceedings has been given, s 34(1)(a) and paras (a)\n                        and (b) of the Fourth Schedule of\n                        the SCJA provide that no appeal to the Court of Appeal shall be\n                        allowed. The net result of these provisions is that where summary judgment\n                        has been ordered, which has the effect of finally disposing the substantive\n                        rights of the parties, leave to appeal to the Court of Appeal is not\n                        required. On the other hand, where leave to defend is granted in an\n                        application for summary judgment, and as such the order does not finally\n                        dispose of the substantive rights of the parties, no appeal may be made\n                        against that order.The effect of such an order is that\n                            the rights of neither party are affected as the matter will just go for\n                            trial, where both parties will have ample opportunity to canvas their\n                            respective positions. No appeal is allowed because it would serve no\n                            useful purpose in prolonging such interim litigation.[emphasis added] 36     The position as regards a party’s right\n                    of appeal from a “no order” made in respect of a summary judgment\n                    application is one which is not specifically provided for either in the Fourth\n                    Schedule or the Fifth Schedule of the SCJA. Thus, on a plain reading, it may\n                    appear to be arguable, as the Appellant believed, that if the High Court makes\n                    “no order” on a summary judgment application, such an order is\n                    appealable as of right under s 29A(1) of the SCJA. 37     However, having regard to the statutory\n                    context as well as the legislative intent underlying the SCJA, we were of the\n                    view that para (a) of the Fourth Schedule should\n                    be read in a purposive manner so as to encompass an order of “no\n                    order” made in respect of a summary judgment application. The legislative\n                    intention behind the 2010 Amendments and the Fourth and Fifth Schedules of the\n                    SCJA was to streamline and restrict appeals to the Court of Appeal on\n                    interlocutory matters. As the Senior Minister of State for Law, Associate\n                    Professor Ho Peng Kee (“the Minister”) stated at the Second\n                    Reading of the Supreme Court of Judicature (Amendment) Bill 2010 (Bill\n                    No 25/2010) (“SCJA Amendment Bill”) (seeParliamentary Debatesat col 1369): Given that interlocutory applications involve procedural points that\n                        usually do not affect the substantive rights of the parties and are not\n                        likely to involve novel points of law, it is an unproductive use of\n                        resources for all such applications to go up to the Court of Appeal,\n                        especially when the High Court already serves as one level of appeal against\n                        the Registrar who first hears the application. 38     In light of the above policy, it must have\n                    been intended that no appeal should be allowed from an order of “no\n                    order” made in respect of a summary judgment application, which is in\n                    substance similar to an order giving leave to defend. As in the situation where\n                    leave to defend is granted, an order of “no order” means that the\n                    court has declined to grant the application. It therefore does not finally\n                    dispose of or affect the substantive rights of the parties as the matter will\n                    still proceed to trial. InTohru Motobayashi v Official\n                        Receiver and another[2000] 3 SLR(R) 435 (“Tohru Motobayashi”) at [15], this court stated\n                    that the effect of an order of “no order” made by the Judicial\n                    Commissioner below was that he had declined to grant the declaration sought; in\n                    other words, he had essentially disallowed the application. In this vein, we\n                    also note with approval the following passage from the High Court decision ofHo Kian Cheong v Ho Kian Guan and others[2004] SGHC 104 at [7]: As for the second scenario of an order of “no order”, the\n                        applicant has also not succeeded in his application. In such a scenario, the\n                        Court has considered the matter and decided against granting the order. The\n                        difference between this and that of an order to dismiss turns only on the\n                        cost implications. Where an order of “no order” is made, costs\n                        need not normally be ordered against the applicant. The Court can thus use\n                        the order of “no order” to tailor its order to suit the\n                        justice of the case such as where, for whatever reason, the applicant does\n                        not deserve to succeed in his application, but the circumstances do not\n                        justify him being penalised in costs. … 39     It would indeed be incongruous if a party such\n                    as the Appellant was allowed to appeal as of right against an order of\n                    “no order” made in respect of a summary judgment application,\n                    whereas no right of appeal at all would lie from an order giving unconditional\n                    or conditional leave to defend when the effect is essentially the same. Had the\n                    Judge below dismissed the Appellant’s summary judgment application and\n                    granted the 2nd Respondent leave to defend the action, this would have been\n                    non-appealable under the Fourth Schedule of the SCJA. There was no reason why\n                    the Appellant should be in a better position than if its summary judgment\n                    application had been dismissed outright by the Judge, given that it had\n                    similarly failed in its application. 40     At this juncture, we would make two final\n                    observations. First, there was no merit in the Appellant’s argument raised\n                    during the hearing before us that its summary judgment application had not been\n                    heard in the first instance before an Assistant Registrar and it had therefore\n                    lost its right of appeal to the High Court. To understand this objection, it is\n                    useful to refer to the following statement by the Minister at the Second Reading\n                    of the SCJA Amendment Bill (seeParliamentary\n                        Debatesat col 1369): … Between the time when a party files a civil case in court and\n                        when the case is heard, lawyers may file what are known as\n                        “interlocutory applications” in court. These applications deal\n                        with procedural matters that prepare the case for the hearing; for example,\n                        requesting the court to order the other party to furnish information or\n                        documents that are relevant to the hearing. Currently, for a case heard in\n                        the High Court, these interlocutory applications are usually heard by a High\n                        Court Registrar. A party can appeal to the High Court against the\n                        Registrar’s decision. The High Court Judge would then re-hear the\n                        application afresh. Orders made by the High Court, in most instances, can be\n                        further appealed to the Court of Appeal. Hence, interlocutory applications\n                        may go through three tiers of hearing, effectively becoming a two-tier\n                        appeal system. This is more than what the substantive action in the civil\n                        suit will enjoy, that is, only one tier of appeal as of right. The Appellant’s point seemed to be that since a party wasnormallyentitled to one tier of appeal from a\n                    High Court Registrar to a High Court Judge in respect of interlocutory\n                    applications, it should be entitled to appeal to the Court of Appeal in the\n                    present case since its summary judgment application had only been heard once by\n                    the Judge below. However, as we pointed out during the hearing, the suggestion\n                    that the right to appeal to the High Court against a Registrar’s decision\n                    could be exchanged for a right to appeal to the Court of Appeal was without\n                    legal basis. While it is true that a party can appeal to the High Court against\n                    the decision of a Registrar who usually hears the interlocutory application in\n                    the first instance, this is not an immutable rule. There is certainly no rule of\n                    law that a party should always be entitled to one tier of appeal as of right for\n                    interlocutory applications. Moreover, neither the Appellant nor the 2nd\n                    Respondent had recorded any objection to the Appellant’s summary judgment\n                    application being heard at first instance before the Judge in chambers. It\n                    therefore did not lie in the Appellant’s mouth to now protest that it had\n                    lost one tier of appeal as a result. 41     Second, we respectfully disagree with the\n                    Judge’s statement that there was no order from which the Appellant could\n                    appeal (at [10] of the GD). The Judge’s decision to make no order on the\n                    Appellant’s application for summary judgment itself constituted an\n                    “order” from which the Appellant could appeal. In the same way\n                    that an order of “no order” had legal effect from the date it was\n                    made, it must equally be capable of being the subject matter of an appeal\n                    provided that the right of appeal is available. This point was dealt with inTohru Motobayashiat [15] where this court\n                    held that the effect of “no order” made by the Judicial\n                    Commissioner below was that he had disallowed the application and there was no\n                    reason why an appeal did not lie from this part of the order. There is no right\n                    of appeal from the Judge’s decision in making “no order” in\n                    respect of the Appellant’s summary judgment application, not because there\n                    is no order from which to appeal, but because such an order, on a purposive\n                    interpretation, is caught by s 34(1)(a) and\n                    para (a) of the Fourth Schedule to the SCJA, which\n                    provides that certain orders made are non-appealable to the Court of\n                    Appeal.",
        "Conclusion": "42     For the reasons above, we concluded that we\n                    had no jurisdiction to entertain the appeal and accordingly dismissed it.\n                    Nevertheless, we made a note that during the hearing before us, counsel for the\n                    2nd Respondent confirmed that his client, the 2nd Respondent, would be agreeable\n                    to the Appellant pursuing the claim against BGP under the Time Charter in the\n                    name of the 1st Respondent so long as the costs of pursuing that claim were\n                    borne by the Appellant, subject to its right to be indemnified for those costs\n                    out of any sums it successfully recovers for the first respondent from BGP, and\n                    subject further to this agreement not in any way affecting or prejudicing the\n                    deadlock that has already been found to exist by the arbitrator in the SIAC\n                    Arbitration. We noted this so that the Appellant may, if it wishes, go back\n                    before the Judge to get a consent order in those terms. We should add that this\n                    liberty to return to the Judge to obtain such a consent order was precisely the\n                    effect of the Judge’s order below, which was that there would be\n                    “no order” on the Appellant’s summary judgment application\n                    with liberty to apply. 43     As for costs, we fixed the costs at $20,000\n                    inclusive of disbursements to be paid by the Appellant to the 2nd Respondent,\n                    with the usual consequential orders."
    }
}