{
    "case_title": "Citiwall Safety Glass Pte Ltd\n      v\n      Mansource Interior Pte Ltd",
    "ncitation": "[2014] SGCA 61",
    "coram": "Sundaresh Menon CJ; \n      Chao Hick Tin JA; \n      Steven Chong J",
    "sections": {
        "Introduction": "1       This matter arises out of an adjudication determination (“AD”) dated 12 September 2013 that was issued in favour of the appellant, Citiwall Safety Glass Pte Ltd (“the Appellant”). The respondent, Mansource Interior Pte Ltd (“the Respondent”), applied to set aside that AD (“the Disputed AD”). It failed at first instance before an assistant registrar, but was successful on appeal before a judicial commissioner of the Supreme Court (“the Judge”), whose decision is reported inMansource Interior Pte Ltd v Citiwall Safety Glass Pte Ltd[2014] 3 SLR 264. The Appellant filed a notice of appeal against the decision of the Judge. In response, the Respondent filed the present application, Summons No 1563 of 2014 (“the Present Summons”), to strike out the Appellant’s notice of appeal on the following grounds: (a)     The Appellant failed to obtain the requisite leave to appeal to the Court of Appeal as required under s 34(2)(a) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“the SCJA”). (b)     The Appellant failed to provide the mandatory security required under O 57 r 3(3) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“the Rules of Court”) read with para 86 of theSupreme Court Practice Directions(1 January 2013 release) (“the Practice Directions”). 2       When the parties appeared before us to present their oral arguments, we indicated that we were not minded to strike out the Appellant’s notice of appeal based on the second ground. Our reasons for taking this view are set out at [96]–[97] below. In comparison, the first ground gave rise to some interesting and important issues concerning the proper basis of the court’s jurisdiction when considering challenges against an AD and/or a judgment entered in the terms of an AD. We therefore took time to consider these issues carefully.",
        "Background facts": "3       It is helpful to begin with the material background facts. On or about 21 December 2012, the Appellant was awarded a sub-contract by the Respondent to undertake the supply and installation of wall finishes for a building project. The contract sum was approximately $1,252,750. 4       On 5 August 2013, the Appellant submitted its final payment claim for the sum of $322,536.65. 5       On 21 August 2013, the Respondent served a payment response on the Appellant indicating its view that an amount of only $93,732.10 was due to the Appellant. Accordingly, the Appellant submitted a tax invoice for the agreed amount of $93,732.10. 6       On 23 August 2013, the Appellant issued the Respondent a Notice of Intention to Apply for Adjudication as there was a dispute over the payment amount sought by the Appellant. 7       On the same day, the Appellant lodged with the Singapore Mediation Centre (“the SMC”) an Adjudication Application pursuant to the Building and Construction Industry Security of Payment Act (Cap 30B, 2006 Rev Ed) (“the SOPA”). This was served on the Respondent on 29 August 2013. 8       On 5 September 2013, the Respondent lodged its Adjudication Response. 9       On 12 September 2013, the Disputed AD was issued. The adjudicator determined that the Respondent was liable to pay the Appellant the sum of $223,956.50 (this worked out to $239,633.46 after taking into account goods and services tax (“GST”) of 7%). It may be noted that the adjudicator determined that the Respondent’s Adjudication Response had been filed out of time contrary to r 2.2 of the SMC’s Adjudication Procedure Rules (“the SMC Rules”) even though it had been filed within the seven-day period stipulated in s 15(1) of the SOPA. As a result, the Respondent’s Adjudication Response was not considered at all by the adjudicator. 10     The Respondent did not make payment to the Appellant in accordance with the Disputed AD. On 20 September 2013, the Appellant issued Originating Summons No 886 of 2013 (“OS 886/2013”) against the Respondent seeking leave of the court to enforce the Disputed AD as a judgment. The Appellant obtained an order of court dated 24 September 2013 granting it leave (“the Leave Order”), and went on to enter a judgment dated 26 September 2013 requiring the Respondent to make payment pursuant to the Disputed AD (“the Disputed Judgment”). 11     On 18 October 2013, the Respondent applied to the High Court by way of Summons No 5468 of 2013 to set aside the Disputed AD, the Leave Order and the Disputed Judgment. The application (referred to hereafter as “the Respondent’s setting-aside application” where appropriate to the context) was dismissed by an assistant registrar. 12     The Respondent appealed against the assistant registrar’s decision. On 17 February 2014, the Judge allowed the Respondent’s appeal and set aside the Disputed AD, the Leave Order and the Disputed Judgment. For present purposes, it may be noted that the Judge found that r 2.2 of the SMC Rules wasultra viresin that it was contrary to s 15(1) of the SOPA. He held that as the Respondent’s Adjudication Response had not been considered by the adjudicator on the erroneous basis that it had been lodged contrary to the terms of r 2.2 of the SMC Rules, the Disputed AD had been issued in breach of natural justice. 13     On 10 March 2014, the Appellant filed a notice of appeal to the Court of Appeal against the whole of the Judge’s decision. 14     On the same day, the Appellant filed a Certificate for Security for Costs (by way of an undertaking) with its solicitors’ certification that they had furnished an undertaking in accordance with O 57 r 3 of the Rules of Court. The Appellant’s solicitors undertook to hold the sum of $15,000 by way of security for the Respondent’s costs of the appeal. 15     On 24 March 2014, the Respondent filed the Present Summons to strike out the Appellant’s notice of appeal.",
        "The issues before this court": "16     There are two issues before us, namely: (a)     whether the Appellant’s notice of appeal should be struck out because the Appellant did not first obtain leave to appeal (“Issue 1”); and (b)     whether the Appellant’s notice of appeal should be struck out because the Appellant failed to provide $20,000 by way of security for costs (“Issue 2”).",
        "The Respondent’s submissions": "17     The Respondent’s case on Issue 1 is, in essence, that the Appellant is required to obtain leave to appeal to the Court of Appeal by virtue of s 34(2)(a) of the SCJA on the following bases: (a)     The value of the subject matter of the Appellant’s appeal is less than $250,000 and, therefore, s 34(2)(a) of the SCJA is engaged. (b)     The courts have struck out or dismissed appeals similar to the Appellant’s appeal in circumstances where the requisite leave to appeal under s 34(2)(a) was not obtained. (c)     Although s 34(2A) (specifically, s 34(2A)(c) for the purposes of the Present Summons) sets out an exception to s 34(2)(a), this exception does not apply because there is no law requiring the Respondent’s setting-aside application, which concerns (in essence) the setting aside of an AD, to be heard and determined by the High Court in the exercise of its original jurisdiction. According to the Respondent, the High Court’s power to set aside an AD is an aspect of itssupervisoryjurisdiction and not itsoriginaljurisdiction. 18     As to Issue 2, the Respondent submits that the Appellant has not provided sufficient security for its costs of the appeal as mandated under O 57 r 3(3) of the Rules of Court read with para 86(2) of the Practice Directions, in that: (a)     the required amount of security is $20,000 since the Appellant is appealing against a final rather than an interlocutory order; and (b)     the Appellant has refused to comply with the relevant provisions despite having been informed of the shortfall in the amount of security which it provided, and has not offered any explanation for this.",
        "The Appellant’s submissions": "19     As against this, the Appellant contends in relation to Issue 1 that pursuant to s 34(2A)(c) of the SCJA, the requirement to obtain leave to appeal under s 34(2)(a) does not apply because: (a)     The Appellant filed OS 886/2013 in the High Court, and this application was made pursuant to s 27 of the SOPA. (b)     The “court” mentioned in s 27 of the SOPA should be interpreted as referring to the High Court. (c)     The Respondent’s setting-aside application was made in the same proceedings (ie, in OS 886/2013) and the decision of the Judge was therefore given by the High Court in its original jurisdiction. The jurisdiction exercised by the High Court in such a setting-aside application is, the Appellant contends, also supervisory in nature, and so is vested only in the High Court. 20     As to Issue 2, the Appellant submits that it is only required to provide security in the amount of $15,000 because its appeal relates to an interlocutory order. According to the Appellant, s 21(1)(b) of the SOPA shows the interim nature of an AD in that it is liable to be set aside in subsequent proceedings to determine the merits of the dispute between the parties to the adjudication.",
        "Issue 1: Whether the Appellant’s notice of appeal should be struck out because the Appellant failed to obtain leave to appeal": "",
        "The purpose of the requirement to obtain leave to appeal": "21     Pursuant to s 34(2)(a) of the SCJA, an appellant is required to obtain leave from a High Court judge to appeal to the Court of Appeal where the value of the subject matter of the appeal is less than $250,000: (2)    Except with the leave of a Judge, no appeal shall be brought to the Court of Appeal in any of the following cases: (a)    where the amount in dispute, or the value of the subject-matter, at the hearing before the High Court (excluding interest and costs) does not exceed $250,000 or such other amount as may be specified by an order made under subsection (3) … … 22     The purpose of the leave mechanism under s 34(2)(a) of the SCJA is to ensure that non-serious and unmeritorious appeals are sieved out, as stated by the Minister for Law at the second reading of the Supreme Court of Judicature (Amendment) Bill 1998 (Bill 40 of 1998), which (after its enactment as the Supreme Court of Judicature (Amendment) Act 1998 (Act 43 of 1998)) raised the limit under the version of s 34(2)(a) as it then stood from $30,000 to $250,000 (seeSingapore Parliamentary Debates, Official Report(26 November 1998) vol 69 at cols 1629–1630 (Prof S Jayakumar, Minister for Law)): Sir, on 1st August 1997, the District Courts’ jurisdiction in civil matters was raised from $100,000 to $250,000. As a result, more than 1,500 (The exact figure, updated to 19th November 1998, is 1,544 cases.) claims exceeding $100,000 have been filed in the District Courts since August 1997. This has helped to reduce the number of claims filed in the High Court. However, under section 34(2)(a) of the [Supreme Court of Judicature Act (Cap 322, 1985 Rev Ed)], appeals to the Court of Appeal from decisions of the High Court in civil matters can still be made as a matter of right, ie, without first obtaining leave of the Court, if the value of the subject matter exceeds $30,000. In view of the enhanced District Courts’ jurisdiction to $250,000 in civil matters, the Chief Justice has proposed that the existing $30,000 limit in section 34(2)(a) be raised to $250,000. In other words, bring its limit in line with the enhancement. If the limit is not raised to $250,000, District Court cases of less than $250,000 can first go on appeal to the High Court and then [the] Court of Appeal. This would strain the limited resources of the Court of Appeal. ... I should point out that the new limits will not have the effect of preventing meritorious appeals from being heard, even if they concern claims below the new limits.The requirement for leave is essentially a screening mechanism to sieve out non-serious and unmeritorious appeals.Appeals can still be brought with the leave of court in cases falling below the new limits. [emphasis added] 23     In the present case, the amount in dispute is $243,485.46. The components of this amount are as follows:[note: 1] (a)     adjudicated amount: $239,633.46 (including GST); (b)     adjudication application fee: $642.00 (including GST); and (c)     adjudicator’s fee: $3,210.00 (including GST). 24     The Appellant argues that the requirement to obtain leave to appeal under s 34(2)(a) of the SCJA does not apply by reason of s 34(2A)(c), which states: (2A)  Subsection (2)(a) shall not apply to any case heard and determined by the High Court in the exercise of its original jurisdiction under — ... (c)    any written law which requires that case to be heard and determined by the High Court in the exercise of its original jurisdiction. 25     It is therefore necessary for us to consider: (a)     whether the Respondent’s setting-aside application was required by virtue of any written law to be heard and determined by the High Court; and (b)     if so, whether the High Court would be exercising its original jurisdiction in hearing and determining such an application.",
        "The relevant statutory provisions governing the enforcement of and setting aside of an AD": "26     It is apposite first to set out the statutory regime governing the enforcement of and challenges to an AD. Section 27 of the SOPA 27     Section 27 of the SOPA is the provision which allows an AD, if leave of the court is granted, to be enforced in the same manner as a court judgment. It provides as follows: Enforcement of adjudication determination as judgment debt, etc. 27.—(1) An adjudication determination made under this Act may, with leave of the court, be enforced in the same manner as a judgment or an order of the court to the same effect. (2)    Where leave of the court is so granted, judgment may be entered in the terms of the adjudication determination. (3)    An application for leave to enforce an adjudication determination may not be filed in court under this section unless it is accompanied by an affidavit by the applicant stating that the whole or part of the adjudicated amount has not been paid at the time the application is filed. (4)    If the affidavit referred to in subsection (3) indicates that part of the adjudicated amount has been paid, the judgment shall be for the unpaid part of the adjudicated amount. (5)    Where any party to an adjudication commences proceedings to set aside the adjudication determination or the judgment obtained pursuant to this section, he shall pay into the court as security the unpaid portion of the adjudicated amount that he is required to pay, in such manner as the court directs or as provided in the Rules of Court (Cap. 322, R 5), pending the final determination of those proceedings. Order 95 of the Rules of Court 28     Order 95 of the Rules of Court sets out the procedure to be followed in an application for leave to enforce an AD, as well as in an application to set aside an AD and/or a judgment entered in the terms of an AD after leave to enforce it has been granted (a “s 27 judgment”). The relevant parts of O 95 are as follows: ORDER 95 Building and Construction Industry Security of Payment Act Interpretation (O. 95, r. 1) 1.—(1) In this Order, “Act” means the Building and Construction Industry Security of Payment Act (Cap. 30B) and any reference to a section shall be construed as a reference to a section in the Act. ... (3)    An application to which this Order applies must be made — (a)    where an action is pending, by summons in the action; and (b)    in any other case, by originating summons. Application for enforcement of adjudication determination (O. 95, r. 2) 2.—(1) An application for leave to enforce an adjudication determination under section 27 shall be made to the Registrar by ex parte originating summons or summons. (2)    The supporting affidavit for an application referred to in paragraph (1) must — (a)    exhibit the original adjudication determination and the contract to which the adjudication determination relates or, in either case, a copy thereof; (b)    state the name and the usual or last known place of business of the applicant and the person against whom it is sought to enforce the adjudication determination (referred to in this Rule as the debtor), respectively; and (c)    state the unpaid portion of the adjudicated amount. (3)    An order granting leave must be drawn up by or on behalf of the applicant, and must be served on the debtor — (a)    by delivering a copy to him personally; (b)    by sending a copy to him at his usual or last known place of business; or (c)    in such other manner as the Court may direct. (4)    Within 14 days after being served with the order granting leave, the debtor may apply to set aside the adjudication determination and the adjudication determination shall not be enforced until after the expiration of that period or, if the debtor applies within that period to set aside the adjudication determination, until after the application is finally disposed of. ... Application to set aside adjudication determination or judgment (O. 95, r. 3) 3.—(1) An application to set aside an adjudication determination or a judgment must be supported by an affidavit which must — (a)    have exhibited to it a copy of the adjudication determination and the contract to which the adjudication determination relates, and any other document relied on by the applicant; (b)    state the grounds on which it is contended that the adjudication determination or judgment, as the case may be, should be set aside; (c)    set out any evidence relied on by the applicant; and (d)    be served with the application. ... (4)    If the party who is entitled to enforce the adjudication determination or the judgment wishes to oppose the application referred to in paragraph (1), he must file an affidavit stating the grounds on which he opposes the application within 14 days after being served with the application and the supporting affidavit. (5)    In this Rule, “judgment” means a judgment obtained pursuant to section 27. 29     In summary, this is the scheme of the statutory provisions governing the enforcement of an AD: (a)     The application for leave to enforce an AD is to be made to the Registrar byex parteoriginating summons or summons: see O 95 r 2(1). (b)     Where the Registrar makes an order granting leave to enforce an AD (a “s 27 leave order”), that order must be served on the party against whom the AD is to be enforced (the “debtor”): see O 95 r 2(3). (c)     Thereafter, a s 27 judgment may be entered: see s 27(2) of the SOPA. It appears from a literal reading of s 27(2) that this may be done once leave to enforce has been granted, subject to the obligation to serve the s 27 leave order on the debtor: see O 95 r 2(3). (d)     Within 14 days after being served with the s 27 leave order, the debtor may apply to set aside the AD, which shall then not be enforced until the setting-aside application is finally disposed of: see O 95 r 2(4). The reference in O 95 r 2(4) is, specifically, to the setting aside of an AD; but the better view, in our judgment, is that in keeping with the scheme of expeditious resolution under the SOPA, the time limit set out in O 95 r 2(4) applies not only to an application to set aside an AD, but also to an application to set aside a s 27 judgment. (e)     Even after a s 27 judgment has been entered, but no later than 14 days after being served with the s 27 leave order, the debtor may apply to set aside the AD and/or the s 27 judgment: see O 95 r 3(1) read with O 95 r 2(4). 30     Neither s 27 of the SOPA nor O 95 of the Rules of Court expressly stipulates that an application, whether for leave to enforce an AD or for the setting aside of an AD and/or a s 27 judgment, must be brought in the High Court. 31     As can be seen from the reliefs prayed for in the Respondent’s setting-aside application, in the context of an application to set aside an AD, there are three orders or judgments that might potentially be set aside: (a)     the AD itself; (b)     the s 27 leave order; and (c)     the s 27 judgment. 32     Order 95 r 2(4) expressly provides that within 14 days after being served with a s 27 leave order, the debtor may apply to set aside the AD, which shall then not be enforced until the setting-aside application is finally disposed of. However, the statutory regime does not expressly state whether, if an AD is set aside, the s 27 leave order should also be set aside. InJFC Builders Pte Ltd v LionCity Construction Co Ptd Ltd[2013] 1 SLR 1157 (“JFC Builders”), the High Court held that there was no need to apply to set aside a s 27 leave order when the AD was itself set aside because the s 27 leave order would then have ceased to be effective (at [19]). In our judgment, this is correct. 33     The wording of O 95 r 3(1) suggests that even after a s 27 judgment has been entered, the debtor may apply to set aside the AD and/or the s 27 judgment. It may be argued that once a s 27 judgment has been entered, the AD has merged into the s 27 judgment. Nonetheless, in our view, it would be advisable in such circumstances for the debtor to apply to set asideboththe AD and the s 27 judgment in order to extinguish its liability to the party seeking to enforce the AD (the “creditor”). In general, where an AD has been set aside, the s 27 judgment ought in any case to be set aside as well. Conversely, where a s 27 judgment has been set aside, the debtor should apply for the AD to be set aside too. This is because if a s 27 judgment is set aside solely on the basis of any procedural irregularity affecting only the grant of the s 27 leave order, the setting aside of that s 27 judgment will not extinguish the debtor’s liability to the creditor if the AD itself is not set aside. Therefore, it would be prudent for a debtor wishing to extinguish any liability to its creditor under the SOPA adjudication regime to apply to the court to set aside both the AD and any s 27 judgment entered in its terms if grounds exist for this to be done.",
        "Whether there is any written law which requires an application to set aside an AD and/or a s 27 judgment to be heard and determined by the High Court": "Whether the express statutory provisions specify the relevant court 34     We turn now to the substantive issues in this case. As we have noted above at [30], there is no express statutory provision in either the SOPA or the Rules of Court which expressly states that only the High Court can hear and determine an application to set aside an AD and/or a s 27 judgment. Section 27(5) of the SOPA makes a brief reference to the setting aside of an AD and/or a s 27 judgment, but it merely states that where any party to an adjudication commences proceedings to set aside an AD and/or a s 27 judgment, he shall provide security for the unpaid portion of the adjudicated amount. Order 95 r 2(4) of the Rules of Court expressly provides that a debtor may apply to set aside an AD within 14 days after being served with the s 27 leave order, but it does not specify the court which can hear and determine such a setting-aside application. In this regard, O 95 r 3(1), which sets out the procedure for “[a]n application to set aside an adjudication determinationor a judgment” [emphasis added] (cfO 95 r 2(4), which refers only to the setting aside of an AD), likewise does not specify the relevant court. 35     We also note that s 27 of the SOPA does not require an application for leave to enforce an AD to be heard and determined by the High Court. The term “court” as used in s 27 is not defined in the SOPA. Under s 2 of the Interpretation Act (Cap 1, 2002 Rev Ed), “court” means “any court of competent jurisdiction in Singapore”, “unless there is something in the subject or context inconsistent with such construction or unless it is therein otherwise expressly provided”. It follows that, as pointed out in Chow Kok Fong,Security of Payments and Construction Adjudication(LexisNexis, 2nd Ed, 2013) (“Chow Kok Fong”) at para 18.94, the word “court” in s 27 is capable of referring to a Magistrate’s Court, a District Court or the High Court: The term ‘court’ is not defined in the [SOPA]. Section 2 of the Interpretation Act defines the term to mean ‘any court of competent jurisdiction in Singapore’. It is thus capable of referring to the Magistrate’s Court, the District Court or the High Court. It is suggested that in determining the court to which a particular application should be made, the governing consideration is the jurisdictional limits of each of the courts. These are defined in terms of the monetary quantum of the matter concerned. … Thus the quantum of the adjudicated amount determines the particular court to which the application for enforcement should be made. 36     This is also supported by O 95 r 2(1) of the Rules of Court, which states that “[a]n application for leave to enforce an adjudication determination under section 27 shall be made to the Registrar”. “Registrar” is defined in the following terms in O 1 r 4 of the Rules of Court: “Registry” means the Registry of the Supreme Court, the Registry of the Family Justice Courts or the Registry of the State Courts, as the case may be, and references to the Registrar shall be construed accordingly … 37     The ministerial speech at the second reading of the Building and Construction Industry Security of Payment Bill 2004 (Bill 54 of 2004), which was later enacted as the Building and Construction Industry Security of Payment Act 2004 (Act 57 of 2004) (the predecessor of the SOPA), does not shed light on the question of which court may hear and determine an application for leave to enforce an AD, or for the setting aside of an AD and/or a s 27 judgment: seeSingapore Parliamentary Debates, Official Report(16 November 2004) vol 78 at cols 1112–1138 (Mr Cedric Foo Chee Keng, Minister of State for National Development). 38     In the circumstances, one might have thought that if a District Court has granted leave to enforce an AD, then it ought to be possible for the debtor to apply to the same court to set aside that AD and the s 27 judgment. However, for the reasons elaborated on below, we do not consider this to be correct. 39     InJFC Builders, the High Court noted as follows in relation to the prevailing practice of bringing an application to set aside an AD before the High Court: 15    Counsel for the Plaintiff explained that in a previous similar case, a District Judge had decided that the District Court has no jurisdiction to set aside an AD because the review or consideration of such a determination is an exercise of supervisory power which the District Court does not have. After an appeal was filed to the High Court against that decision, the High Court agreed with the decision of the District Judge. Accordingly, in the present case, counsel for the Plaintiff filed its application in the High Court to set aside both the AD and the District Court Order granting leave to enforce the AD. … 20    Nevertheless, it does seem strange that an application for leave to enforce an AD may be made to the District Court but an application to set aside such an AD must be made in the High Court. I am of the view that such a dichotomy will trip many a solicitor as happened in the previous case mentioned by the Plaintiff’s counsel. Indeed, it seemed to me that he was aware of it only because he or his firm acted in the previous case when the client’s application to set aside an AD failed because it was filed in the wrong court. 21    I hope that the process can be streamlined, whether by amendment of the Rules [of Court (Cap 322, R 5, 2006 Rev Ed)] or otherwise, so that in future any application for leave to enforce will be made in the High Court. 40     Arising from this, there are two questions to be asked: (a)     Is the court exercising its supervisory jurisdiction in hearing an application to set aside an AD and/or a s 27 judgment? (b)     If so, is the High Court the only court that has supervisory jurisdiction and, thus, the only court that can hear and determine such a setting-aside application? Whether the court is exercising its supervisory jurisdiction in hearing an application to set aside an AD and/or a s 27 judgment 41     In our judgment, the court is exercising its supervisory jurisdiction in hearing and determining an application to set aside an AD and/or a s 27 judgment. 42     It has been held that the expression “supervisory jurisdiction” refers to “the inherent power of the superior courts to review the proceedings and decisions of inferior courts and tribunals or other public bodies discharging public functions”: seeHaron bin Mundir v Singapore Amateur Athletic Association[1991] 2 SLR(R) 494 at [18]–[19], referred to inNg Chye Huey and another v Public Prosecutor[2007] 2 SLR(R) 106 (“Ng Chye Huey”) at [48]. InNg Chye Huey, the Court of Appeal stated its understanding of “supervisory jurisdiction” as follows: 47    Each of these differences [between the High Court’s supervisory jurisdiction and its revisionary jurisdiction] underscores thebroaderpoint that the revisionary jurisdiction was acreature of statuteformulated to remedy perceived inadequacies in the High Court’s inherent supervisory jurisdiction over inferior courts. This pre-existinginherent supervisory jurisdictionis well recognised in the case law. According to Denning LJ (as he then was) in the English Court of Appeal decision ofR v Northumberland Compensation Appeal Tribunal[1952] 1 KB 338 at 346–347: [T]he Court of King’s Bench has an inherent jurisdiction to control all inferior tribunals, not in an appellate capacity, but in a supervisory capacity. This control extends not only to seeing that the inferior tribunals keep within their jurisdiction, but also to seeking that they observe the law. The control is exercised by means of a power to quash any determination by the tribunal which, on the face of it, offends against the law. ...When the King’s Bench exercises its control over tribunals in this way, it is not usurping a jurisdiction which does not belong to it. It is only exercising a jurisdiction which it has always had. [emphasis added] 48    Similarly, according to G P Selvam JC (as he then was) in the Singapore High Court decision ofHaron bin Mundir v Singapore Amateur Athletic Association[1991] 2 SLR(R) 494 at [18]–[19] (this particular point was not, apparently, controverted on appeal: seeSingapore Amateur Athletic Association v Haron bin Mundir[1993] 3 SLR(R) 407, especially at [57]): The law makes a distinction between private law liability and public law illegality. The following is a lucid statement of the distinction between the two regimes:An Introduction to Administrative Lawby Peter Cane (1985) at p 40: ... The public law activities of public bodies are subject to scrutiny and control by the High Court in the exercise of what is called its ‘supervisory’ jurisdiction. Under this jurisdiction (which is ‘inherent’, that is, the product of common law rather than statute) the High Court has power to ‘review’ the activities of public authorities and, in some cases, of private bodies exercising functions of public importance such as licensing. To be contrasted with the supervisory jurisdiction is the court’s appellate jurisdiction. The common law never developed mechanisms for appeals as we understand them today, and all appellate powers are statutory. The expression ‘supervisory jurisdiction’ is a term of art. It is the inherent power of the superior courts to review the proceedings and decisions of inferior courts and tribunals or other public bodies discharging public functions. [emphasis in original] 43     Reference may also be made toRe Mohamed Saleem Ismail[1987] SLR(R) 380 at [7] (referred to inNg Chye Hueyat [49]): … I must stress the obvious because it bears repetition: in the exercise of the High Court’s supervisory jurisdiction over inferior tribunals including administrative officers exercising judicial or quasi-judicial functions under a statute or subsidiary legislation[,] the High Court is supervising and not reviewing; the High Court in its supervisory capacity cannot substitute its own views for those of the tribunal or officer which or who had been statutorily entrusted to make the decision. 44     Further, the Court of Appeal recognised inNg Chye Huey(at [46]) that the High Court’s supervisory jurisdiction and its revisionary jurisdiction overlapped to a considerable degree, but held that there remained sufficient areas of difference to warrant their treatment as “distinctbases of jurisdiction” [emphasis in original]. In this connection, the court referred (likewise at [46]) to Prof Tan Yock Lin’s analysis of the differences between the High Court’s supervisory jurisdiction and its revisionary jurisdiction, which further sheds light on the meaning of “supervisory jurisdiction”: 46    Viewed against this historical context, the High Court’s revisionary jurisdiction should more properly be regarded as a statutoryhybridof the pre-existing supervisory and appellate jurisdictions. On this approach, whilst the scope and ambit of the High Court’s supervisory and revisionary jurisdictionsoverlapto a considerable degree, there remain sufficient areas of difference to warrant their treatment asdistinctbases of jurisdiction. According to Prof Tan in another of his works (see Tan Yock Lin, “Appellate, Supervisory and Revisionary Jurisdiction” in ch 7 ofThe Singapore Legal System(Walter Woon ed) (Longman, 1989) at pp 233–234), the supervisory and revisionary bases of jurisdiction admit of the following differences: (i)    supervision extends to all administrative tribunals but revision isconfined to subordinate courts; (ii)   supervision depends upon party initiative in seeking relief butrevision may occur on a judge’s initiative; (iii)   supervision generally is confined to questions not touching the merits of the case but revision will lie onerrors of law and fact; (iv)   supervision is effected by way of prerogative writs but revision is marked bycomplete flexibility of remedies. [emphasis added] 45     With the foregoing considerations in mind, we turn to the present context of a court that is hearing and determining an application to set aside an AD and/or a s 27 judgment. We agree with the learned author ofChow Kok Fong, where he observed as follows (at para 19.9): … [U]nlike arbitrators, the courts ultimately exercise asupervisoryfunction over any dispute settlement tribunal and this extends to both arbitration and adjudication proceedings. This function is invoked when an application is made to the court to enforce an arbitral award or an adjudication determination. In this latter role, the primary function of the court is to ensure that the arbitrator or adjudicator acts within his jurisdiction in that he has to conduct himself properly in accordance with the terms as framed by the applicable legislation and with the principles of natural justice. The challenge which is frequently mounted against an adjudication determination is thus an application to the courts to exercise thissupervisoryfunction. [emphasis added] 46     This is consistent with the way the Court of Appeal expressed its understanding of the role of the court in this context inLee Wee Lick Terence (alias Li Weili Terence) v Chua Say Eng (formerly trading as Weng Fatt Construction Engineering) and another appeal[2013] 1 SLR 401: 66    Turning now to the court’s role in a setting-aside action, we agree with the holding inSEF Construction[Pte Ltd v Skoy Connected Pte Ltd[2010] 1 SLR 733] that the court should not review the merits of an adjudicator’s decision. The court does, however, have the power to decide whether the adjudicator was validly appointed. If there is no payment claim or service of a payment claim, the appointment of an adjudicator will be invalid, and the resulting adjudication determination would be null and void. 67    Even if there is a payment claim and service of that payment claim, the court may still set aside the adjudication determination on the ground that the claimant, in the course of making an adjudication application, has not complied with one (or more) of the provisions under the [SOPA] which is so important that it is the legislative purpose that an act done in breach of the provision should be invalid, whether it is labelled as an essential condition or a mandatory condition. A breach of such a provision would result in the adjudication determination being invalid. 47     An AD and/or a s 27 judgment may also be set aside if the adjudicator failed to comply with the rules of natural justice in the course of the adjudication: seeSEF Construction Pte Ltd v Skoy Connected Pte Ltd[2010] 1 SLR 733 at [45] and s 16(3)(c) of the SOPA. 48     Put simply, in hearing an application to set aside an AD and/or a s 27 judgment, the court does not review the merits of the adjudicator’s decision, and any setting aside must be premised on issues relating to the jurisdiction of the adjudicator, a breach of natural justice or non-compliance with the SOPA. Applications to set aside ADs and/or s 27 judgments are thusakinto judicial review proceedings, and are not appeals on the merits of the adjudicator’s decision. In our judgment, it is consistent with the purpose of the SOPA, which is to facilitate cash flow in the building and construction industry, that the court, in hearing such applications, does not review the merits of the AD in question. It may be noted that in keeping with its statutory purpose, the SOPA establishes that parties who have done work or supplied goods are entitled to payment as of right; it also sets out an intervening process of adjudication which, although provisional in nature, is final and binding on the parties to the adjudication until their differences are ultimately and conclusively determined. In other words, the adjudication regime under the SOPA seeks to achieve temporary finality: seeW Y Steel Construction Pte Ltd v Osko Pte Ltd[2013] 3 SLR 380 at [18]. 49     The view that the court is exercising its supervisory jurisdiction when it hears an application to set aside an AD and/or a s 27 judgment is strengthened further when one considers that the court, in hearing such an application, is not solely concerned with the procedural propriety of the process by which the creditor obtained its s 27 leave order, such as whether the creditor made full and frank disclosure in itsex parteapplication for the s 27 leave order. This is because focusing only on the procedural propriety of the process by which the creditor obtained its s 27 leave order would not address the real concern of the debtor, which is to set aside the underlying AD and/or the s 27 judgment entered pursuant to that AD. Instead, the court, in hearing such a setting-aside application, is concerned with the propriety of the AD itself (that is to say, with issues relating to the jurisdiction of the adjudicator, including non-compliance with the SOPA, and procedural propriety in the adjudication, including whether there was a breach of natural justice). These go beyond the usual concerns which the court takes into account in deciding whether an order obtained pursuant to anex parteapplication should be set aside for non-disclosure. 50     It is undoubtedly the case that the court exercises its supervisory jurisdiction primarily through the making of prerogative orders, namely, mandatory orders, prohibiting orders, quashing orders and orders for review of detention. The court’s power to issue such orders is set out in para 1 of the First Schedule of the SCJA, and the procedure for invoking these remedies may be found in O 53 of the Rules of Court. In our judgment, the remedy that is invoked in an application to set aside an AD and/or a s 27 judgment isakinto a quashing order. However, unlike the regime relating to prerogative orders, the regime for setting aside an AD and/or a s 27 judgment is provided for by statute in s 27 of the SOPA, and the procedure for making such a setting-aside application is separately provided for in O 95 of the Rules of Court. Order 53 of the Rules of Court, which (as we have just mentioned) concerns applications for prerogative orders, is thus not applicable to applications for the setting aside of an AD and/or a s 27 judgment. But, this does not entail the conclusion that the court is therefore not exercising its supervisory jurisdiction in hearing such setting-aside applications. That must depend in the final analysis on the basis of the setting-aside application at hand and, consequently, the nature of the judicial function that is being exercised in the case in question. 51     For these reasons, we are satisfied that the court, in hearing an application to set aside an AD and/or a s 27 judgment, is exercising its supervisory jurisdiction. This leads to the next question – which court may exercise such jurisdiction? Whether the High Court is the only court that has supervisory jurisdiction 52     In our judgment, the High Court is the only court that has supervisory jurisdiction and, hence, it is the only court that has jurisdiction to hear and determine an application to set aside an AD and/or a s 27 judgment. 53     Section 27(1) of the SCJA, which sets out the “general supervisory and revisionary jurisdiction” of the High Court, expressly provides that the High Court has “supervisory” jurisdiction over “all subordinate courts”: General supervisory and revisionary jurisdiction of High Court 27.—(1) In addition to the powers conferred on the High Court by this Act or any other written law, the High Court shall have general supervisory and revisionary jurisdiction over all subordinate courts. ... 54     It should be noted that the “supervisory” jurisdiction under s 27(1) of the SCJA is over “all subordinate courts”. A “subordinate court” is defined in s 2 of the SCJA as “a court constituted under the State Courts Act (Cap. 321), a Family Court or Youth Court constituted under the Family Justice Act 2014, and any other court, tribunal or judicial or quasi-judicial body from the decisions of which under any written law there is a right of appeal to the Supreme Court”. Hence, the “supervisory” jurisdiction under s 27(1) of the SCJA does not extend to inferior tribunals from the decisions of which there is no right of appeal to the Supreme Court. Besides the High Court’s supervisory jurisdiction over “all subordinate courts” in s 27(1) of the SCJA, the Court of Appeal noted inNg Chye Hueyat [53] that the High Court has an “inherent” supervisory jurisdiction over “inferior tribunals”. The court arrived at this conclusion on the grounds that: (a) this inherent supervisory jurisdiction is well recognised in case law (seeNg Chye Hueyat [47]); and (b) Parliament never enacted any provision regulating the High Court’s powers of supervision over such tribunals (seeNg Chye Hueyat [49]). 55     In contrast, s 19(3) of the State Courts Act (Cap 321, 2007 Rev Ed) (“the State Courts Act”) expressly states that a District Court’s jurisdiction does not include any supervisory jurisdiction: General civil jurisdiction 19.—(1) A District Court exercising civil jurisdiction shall be a court of record. (2)    Subject to subsections (3) and (4), a District Court shall have all the jurisdiction of the High Court to hear and try any action in personam where — (a)    the defendant is served with a writ of summons or any other originating process — (i)    in Singapore in the manner prescribed by Rules of Court; or (ii)   outside Singapore in the circumstances authorised by and in the manner prescribed by Rules of Court; or (b)    the defendant submits to the jurisdiction of a District Court. (3)    Subject to section 28A of the Supreme Court of Judicature Act (Cap. 322) and any order under subsection (1) thereof, a District Court’s jurisdiction under subsection (2)shall not include— (a)any supervisory jurisdictionor revisionary jurisdiction; (b)    any jurisdiction relating to the judicial review of any act done or decision made by any person or authority, including the issue of any of the following prerogative orders: (i)    a Mandatory Order; (ii)   a Prohibiting Order; (iii)   a Quashing Order; (iv)   an Order for Review of Detention; (c)    any jurisdiction vested exclusively in the High Court, in a Youth Court, in any other State Court, or in any judicial, quasi-judicial or administrative tribunal, by written law; and (d)    any jurisdiction expressly excluded by written law. ... (6)    Without prejudice to the generality of subsection (2), a District Court shall have such jurisdiction as is vested in it by any other written law. [emphasis added] 56     Although s 19(6) provides that a District Court shall have “such jurisdiction as is vested in it by any other written law”, this is subject to the proviso “[w]ithout prejudice to the generality of subsection (2)”. Section 19(2) in turn states that a District Court’s jurisdiction is subject to, among other provisions, s 19(3), which stipulates that a District Court’s jurisdiction shall not include any supervisory jurisdiction. 57     As for the jurisdiction of the Magistrates’ Courts, s 52 of the State Courts Act sets out the civil jurisdiction of these courts as follows: Civil jurisdiction of Magistrates’ Courts 52.—(1) Subject to subsection (1A), a Magistrate’s Court shall have all the jurisdiction of the High Court to hear and try any action in personam where — (a)    the defendant is served with a writ of summons or any other originating process — (i)    in Singapore in the manner prescribed by Rules of Court; or (ii)   outside Singapore in the circumstances authorised by and in the manner prescribed by Rules of Court; or (b)    the defendant submits to the jurisdiction of a Magistrate’s Court. (1A)  The jurisdiction of a Magistrate’s Court under subsection (1) shall not include jurisdiction to hear and try any action where — (a)    there is no claim for any sum of money; (b)    the amount claimed in the action exceeds the Magistrate’s Court limit; or (c)    any remedy or relief sought in the action, in addition or as an alternative to the amount claimed in the action, is in respect of a subject-matter the value of which exceeds the Magistrate’s Court limit. ... (2)    In exercising its jurisdiction under subsection (1) or powers under subsection (1B), a Magistrate’s Court shall be subject to the same limitations and provisions as are applicable to a District Court under this Act. … 58     We note that s 52 of the State Courts Act does not include a direct equivalent of s 19(3), which states that a District Court’s jurisdiction shall not extend to supervisory jurisdiction. However, s 52(2) states that a Magistrate’s Court, in exercising its jurisdiction and powers, “shall be subject to the same limitations and provisions as are applicable to a District Court”. While we recognise that s 52(2) deals with limiting the exercise of a Magistrate Court’s jurisdiction and powers rather than the existence of such jurisdiction and powers, in our judgment, by virtue of s 52(2), a Magistrate’s Court is subject to the same jurisdictional limits as those which apply to a District Court. On this basis, supervisory jurisdiction is excluded from the jurisdiction of a Magistrate’s Court. This must be so because a Magistrate’s Court ranks lower than a District Court in the hierarchy of courts in our legal system. In any case, s 52(1A) provides that a Magistrate’s Court does not have jurisdiction to hear and try, among other actions, any action where there is no claim for any sum of money. An application to set aside an AD and/or a s 27 judgment is not a claim for any sum of money and, hence, would not fall within the jurisdiction of a Magistrate’s Court to begin with. 59     Since ss 19(3) and 52 of the State Courts Act preclude the District Courts and the Magistrates’ Courts from exercising any supervisory jurisdiction, we hold that these sections constitute written laws, the effect of which is to require that an application to set aside an AD and/or a s 27 judgment be heard and determined only by the High Court.",
        "Whether the High Court is exercising its original jurisdiction in hearing and determining an application to set aside an AD and/or a s 27 judgment": "60     The Respondent accepts that the court is exercising its supervisory jurisdiction when it hears an application to set aside an AD and/or a s 27 judgment, but argues that s 34(2A)(c) of the SCJA applies only when the High Court is exercising itsoriginaljurisdiction, and not when it is exercising itssupervisoryjurisdiction. We reject this argument, which posits that the High Court’s original jurisdiction is distinct from and mutually exclusive of its supervisory jurisdiction. The issue is essentially one of construing the relevant statutory provisions – namely, ss 15–28 of the SCJA – in their proper context. In our judgment, it is clear from these provisions that the High Court’s supervisory jurisdiction over inferior tribunals and its original jurisdiction are not mutually exclusive; rather, the former is part of the latter. Factors indicating that the High Court’s supervisory jurisdiction is part of its original jurisdiction (1)   Case law 61     InNg Chye Huey, the Court of Appeal opined, with reference to the Indian Supreme Court’s decision inState of Uttar Pradesh v Dr Vijay Anand Maharaj[1963] 1 SCR 1 (“Dr Vijay”), that the system of revisionary jurisdiction which Singapore inherited from India did not include the power to issue prerogative writs; instead, this power stemmed from the “extraordinary original jurisdiction” of the High Court to “keep the subordinate tribunals within bounds”. The relevant passage fromNg Chye Hueybears quoting at some length: 52    Thedictain [In re Applications of Chong Fye Lee & Toong Hing Loong Tin Mining Co Ltd[1965] 1 MLJ 29] andTan Hock Chuan [v Tan Tiong Hwa [2002] 2 SLR(R) 90], if taken to their logical conclusion, would appear to suggest that the High Court’s statutory revisionary jurisdiction hascompletely supersededthe scope of its erstwhile supervisory jurisdiction. However, with respect, the approaches in these two cases failed to consider the considerable body of Indian jurisprudence which has explained that the Indian High Court’s jurisdiction to issue the prerogative writs is derived from a sourcedistinct from and independent ofits appellate or revisionary jurisdictions. InState of Uttar Pradesh v Dr Vijay Anand Maharaj[1963] 1 SCR 1 (“Dr Vijay”), the Supreme Court of India considered thetypeof jurisdiction that had been conferred upon the Indian High Courts by way of Art 226 of the Indian Constitution, which gave these courts the discretion to issue prerogative writs. This Article is, in all material respects, to the same effect as s 18(2) of our SCJA [ie, the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed)] read with para I of the First Schedule. According to the Supreme Court inDr Viyay(at 14–16): This leads us to the consideration of the question of the scope of the proceedings under Art. 226 of the Constitution. Article 226 confers a power on a High Court to issue the writs, orders, or directions mentioned therein for the enforcement of any of the rights conferred by Part III or for any other purpose.This is neither an appellate nor a revisional jurisdiction of the High Court.Though the power is not confined to the prerogative writs issued by the English Courts, it is modelled on the said writs mainly to enable the High Courts to keep the subordinate tribunals within bounds. Before the Constitution, the chartered High Court, that is, the High Courts at Bombay, Calcutta and Madras, were issuing prerogative writs similar to those issued by the King’s Bench Division, subject to the same limitations imposed on the said writs. InVenkataratnamv.Secretary of State for India, a division Bench of the Madras High Court, consisting of Venkatasubba Rao and Madhavan Nair, JJ., held that the jurisdiction to issue a writ of certiorari was original jurisdiction. ... The Calcutta High Court, inBudge Budge Municipalityv. Mangru,came to the same conclusion, namely, that the jurisdiction exercised under Art. 226 of the Constitution is original as distinguished from appellate or revisional jurisdiction; but the High Court pointed out that the jurisdiction, though original, is a special jurisdiction and should not be confused with ordinary civil jurisdiction under the Letters Patent. The Andhra High Court inSatyanarayanamurthiv.I. T. Appellate Tribunaldescribed it as an extraordinary original jurisdiction. It is, therefore, clear from the nature of the power conferred under Art. 226 of the Constitution and the decisions on the subject that the High Court in exercise of its power under Art. 226 of the Constitution exercises original jurisdiction, though the said jurisdiction shall not be confused with the ordinary civil jurisdiction of the High Court.This jurisdiction, though original in character as contrasted with its appellate and revisional jurisdictions, is exercisable throughout the territories in relation to which it exercises jurisdiction and may, for convenience, be described as extraordinary original jurisdiction. [emphasis added] 53    Thedictumabove makes it clear that the system of revisionary jurisdiction that Singapore inherited from India didnotinclude the power to issue prerogative writs. Instead, to use the language of the court inDr Vijay, this jurisdiction stemmed from the “extraordinary original jurisdiction” of the High Court to “keep the subordinate tribunals within bounds”. In this context, the term “extraordinary original jurisdiction” was clearly just an alternative means of referring to the High Court’s “supervisory” jurisdiction over inferior tribunals. That being the case, we ultimately formed the view that the High Court’s inherentsupervisoryjurisdiction which existed historically at common law isstillvery much a part of our judicial system,andremainsdistinctfrom the statutory revisionary jurisdiction subsequently adopted by way of the 1900 Code [ie, the Criminal Procedure Code 1900 (Ord 21 of 1900) of the Straits Settlements] (although it has been held, in the Singapore High Court decision ofTan Eng Chye v Director of Prisons[2004] 4 SLR(R) 521, that an application for an order of (the prerogative writ) ofcertiorariwould not be granted where theappeal processwas the appropriate mode of redress). It therefore follows that the reference in s 27(1) of the SCJA to the High Court’s “general supervisory and revisionary jurisdiction” should be treated as acompositereference totwo separate and distinct, albeitrelated, bases of jurisdiction (cfalso the Malaysian High Court decision ofPublic Prosecutor v Muhari bin Mohd Jani[[1996] 3 MLJ 116] at 124). Whilst it may be the case that s 27(1) will continue to be relevantprimarilyfor its reference to the High Court’s powers ofrevision, it would nevertheless do well for future courts to approach the language of “supervision” and “revision” in a more cautious mannerto avoid any unnecessary conflation or equationof these two spheres of jurisdiction. Greater clarity in the use of terminology will encourage further consideration and reflection on the degree and areas of interaction between these two areas. [emphasis in original] 62     The following points can be distilled from the extract fromDr Vijayreferred to by the Court of Appeal inNg Chye Huey: (a)     The Indian High Court, in the exercise of its power under Art 226 of the Indian Constitution, which gives the court the discretion to issue prerogative writs, exercises original jurisdiction. (b)     This jurisdiction is original in character, as contrasted with the Indian High Court’s appellate and “revisional” jurisdiction. (c)     This jurisdiction may be described as “extraordinary original jurisdiction” as it is exercisable throughout all the territories of India in respect of which the Indian High Court exercises jurisdiction, and is different from the court’s “ordinary civil jurisdiction”. 63     Therefore, when our High Court exercises its supervisory jurisdiction, it exercises its original jurisdiction as well; these two spheres of jurisdiction are not mutually exclusive. (2)   Academic writings 64     There is also academic support for the position that the High Court’s supervisory jurisdiction is part of its original jurisdiction. In Tan Yock Lin, “Appellate, Supervisory and Revisionary Jurisdiction” inThe Singapore Legal System(Walter Woon ed) (Longman, 1989) ch 7 at p 218, Prof Tan states that the High Court’s supervisory jurisdiction is part of its original jurisdiction: First, it may be observed that there is no independent heading entitled supervisory jurisdiction. [This particular observation should, however, be read subject to our discussion at [75] and [77] below.] Nor is there any section that provides expressly for it although several may have impliedly done so. Thus section 7 of the Supreme Court of Judicature Act [(Cap 322, 1985 Rev Ed)] which says that the High Court shall exercise original civil and criminal jurisdiction may be taken to have impliedly provided for it becausesupervisory jurisdiction is part of the original jurisdiction of the High Court. Section 18(2) makes mention of the prerogative writs which are associated with supervisory jurisdiction. [emphasis added] 65     Similarly, in Yeo Tiong Min, “Jurisdiction of the Singapore Courts” inThe Singapore Legal System(Kevin Y L Tan ed) (Singapore University Press, 2nd Ed, 1999) ch 7 at pp 265–266, Prof Yeo explains that the High Court’s supervisory jurisdiction over (among other bodies) all administrative tribunals is historically part of the original jurisdiction of the High Court: The High Court has a broad supervisory jurisdiction over all administrative tribunals, in addition to its general jurisdiction over all subordinate courts, also associated with the term judicial review. This supervisory jurisdiction has its origins in the ancient jurisdiction in error of the King’s Bench where prerogative writs would be issued to control the exercise of jurisdiction of inferior courts. In the modern administrative state, this jurisdiction had been usefully extended to actions by administrative tribunals and executive bodies acting under statutory powers. Although there is no express mention of this jurisdiction in the [Supreme Court of Judicature Act (Cap 322, 1985 Rev Ed)], it may be implied. This type of supervisory jurisdiction is historically part of the original jurisdiction of the High Court. The High Court is also expressly empowered to grant prerogative writs, which are relevant only to this supervisory jurisdiction. 66     In another part of the same chapter, Prof Yeo seems to draw a distinction between original jurisdiction and supervisory jurisdiction (at p 254): (7)   Jurisdiction to Correct Other Courts or Tribunals … This corrective process may take the form of an appeal, a review, a revision, or supervision. In this context, the distinction is often drawn between the types of jurisdiction mentioned in the previous sentence and original jurisdiction, … which refers to the authority of the court or tribunal to try a cause in the first instance. 67     However, the footnote to the last sentence in the above quotation once again acknowledges that the supervisory jurisdiction of the High Court over (among other bodies) administrative tribunals is historically part of the original jurisdiction of the High Court: … The supervisory jurisdiction of the High Court over administrative tribunals and other administrative bodies is historically part of original jurisdiction of the High Court, since it is looking at the issue for the first time of whether the decision had been correctly arrived. 68     Finally, we note that this view of the High Court’s supervisory jurisdiction is consonant with the plain and ordinary meaning of “original jurisdiction”.Black’s Law Dictionary(Bryan A Garner editor in chief) (West Publishing, 9th Ed, 2009) defines “original jurisdiction” broadly in the following terms (at p 930): A court’s power to hear and decide a matter before any other court can review the matter. Cf. appellate jurisdiction. 69     Under this broad definition, “original jurisdiction” simply means the court’s power to hear a matter at first instance, before any other court can consider it. This is precisely the position when the High Court entertains an application to set aside an AD and/or a s 27 judgment in the exercise of its supervisory jurisdiction. (3)   The meaning of the High Court’s “original jurisdiction” in the civil context as compared to the criminal context 70     For completeness, we note that “original criminal jurisdiction” has been judicially defined. Section 29A(2) of the SCJA sets out the scope of the Court of Appeal’s criminal jurisdiction to hear appeals against decisions made by the High Court in the exercise of its “original criminal jurisdiction”. These words have been interpreted to mean “trial jurisdiction”: see the Court of Appeal decisions ofMicrosoft Corp and others v SM Summit Holdings Ltd and another[2000] 1 SLR(R) 423 at [26]–[27] andAng Cheng Hai and others v Public Prosecutor and another appeal[1995] 3 SLR(R) 151 at [17]–[18]. 71     Section 15 of the SCJA, which is one of the provisions falling under the heading “Original Jurisdiction” in the SCJA, sets out the original criminal jurisdiction of the High Court in the following terms: Criminal jurisdiction 15.—(1) The High Court shall have jurisdiction to try all offences committed — (a)    within Singapore; (b)    on board any ship or aircraft registered in Singapore; (c)    by any person who is a citizen of Singapore on the high seas or on any aircraft; (d)    by any person on the high seas where the offence is piracy by the law of nations; (e)    by any person within or outside Singapore where the offence is punishable under and by virtue of the provisions of the Hijacking of Aircraft and Protection of Aircraft and International Airports Act (Cap. 124) or the Maritime Offences Act (Cap. 170B); and (f)    in any place or by any person if it is provided in any written law that the offence is triable in Singapore. (2)    The High Court may pass any sentence allowed by law. 72     It is significant that s 15(1) explicitly refers to the High Court’s jurisdiction to “tryall offences” [emphasis added], hence indicating a trial as opposed to any other type of hearing. In contrast, s 16 of the SCJA, another provision falling under the heading “Original Jurisdiction” in the SCJA, provides a wider conception of the High Court’s original civil jurisdiction in that it refers to the High Court’s jurisdiction to “hear and tryany action in personam” [emphasis added], rather than to just “try” such an action: Civil jurisdiction — general 16.—(1) The High Court shall have jurisdiction to hear and try any action in personam where — (a)    the defendant is served with a writ of summons or any other originating process — (i)    in Singapore in the manner prescribed by Rules of Court or Family Justice Rules; or (ii)   outside Singapore in the circumstances authorised by and in the manner prescribed by Rules of Court or Family Justice Rules; or (b)    the defendant submits to the jurisdiction of the High Court. (2)    Without prejudice to the generality of subsection (1), the High Court shall have such jurisdiction as is vested in it by any other written law. 73     Hence, the restrictive view set out above of the High Court’s original criminal jurisdiction does not compel this court to reach the conclusion that the High Court’s original civil jurisdiction excludes supervisory jurisdiction. (4)   The scheme of the SCJA 74     As noted above at [17(c)], the Respondent argues that the scheme of the SCJA suggests that the High Court’s original jurisdiction and its supervisory jurisdiction are mutually exclusive; thus, if the High Court is exercising its supervisory jurisdiction in hearing an application to set aside an AD and/or a s 27 judgment, it cannot be said to be exercising its original jurisdiction. 75     The Respondent’s principal argument before us on this point focuses on the layout of ss 15–28 of the SCJA. The headings and groupings of these provisions are as follows: (a)Original Jurisdiction: Sections 15–18 of the SCJA are grouped under the heading “Original Jurisdiction”. These provisions set out the High Court’s: (i) criminal jurisdiction to try criminal offences (s 15); (ii) general civil jurisdiction (s 16); (iii) specific civil jurisdiction (s 17); (iv) concurrent civil jurisdiction with the Syariah Court in certain matters (s 17A); and (v) powers (s 18). (b)Appellate Jurisdiction of the High Court: Sections 19–21 of the SCJA are grouped under the heading “Appellate Jurisdiction of the High Court”. These provisions set out the High Court’s: (i) appellate criminal jurisdiction (s 19); (ii) appellate civil jurisdiction (s 20); (iii) jurisdiction to hear appeals from District Courts and Magistrates’ Courts (s 21); and (iv) powers of rehearing (s 22). (c)Supervisory and Revisionary Jurisdiction: Sections 23–28 of the SCJA are grouped under the heading “Supervisory and Revisionary Jurisdiction”. These provisions set out the High Court’s: (i) power of revision in respect of criminal proceedings in subordinate courts (s 23); (ii) power to call for records of civil proceedings in subordinate courts (s 24); (iii) powers on revision of civil proceedings (s 25), subject to a prohibition of revision in cases where an appeal could have been brought but was not (s 26); (iv) “general supervisory and revisionary jurisdiction over all subordinate courts” (s 27); and (v) discretion as to hearing parties when exercising its powers of supervision and revision (s 28). 76     The Respondent submits on this basis that Parliament in fact intended the High Court to have four different spheres of jurisdiction: original, appellate, supervisory and revisionary. Therefore, the Respondent contends, when the High Court exercises its supervisory jurisdiction, it cannot be exercising its original jurisdiction. 77     In our view, a deeper analysis of the relevant statutory provisions suggests otherwise. The provisions corresponding to the current ss 23–28, which set out the “supervisory and revisionary jurisdiction” of the High Court, were first introduced by the Supreme Court of Judicature Act 1969 (Act 24 of 1969). The brief speech of the Minister for Law and National Development at the second reading of the Bill introducing that Act (viz, the Supreme Court of Judicature Bill 1969 (Bill 6 of 1969)) does not shed light on the nature of this supervisory jurisdiction: seeSingapore Parliamentary Debates, Official Report(12 June 1969) vol 29 at cols 74–76 (Mr E W Barker, Minister for Law and National Development). It should also be noted that the heading “Supervisory and Revisionary Jurisdiction” for ss 23–28 was inserted only in 2010 by the Supreme Court of Judicature (Amendment) Act 2010 (Act 30 of 2010) (“the 2010 SCJA Amendment Act”). Prior to this amendment, the heading was simply “Revision”, as noted by this court inNg Chye Hueyat [42]. The speech of the Senior Minister of State for Law at the second reading of the Bill introducing this amendment (viz, the Supreme Court of Judicature (Amendment) Bill 2010 (Bill 25 of 2010) (“the 2010 SCJA Amendment Bill”)) did not explain the rationale behind this amendment. Nevertheless, it is likely that the amendment was made in response to this court’s observation inNg Chye Hueythat even though the High Court’s revisionary jurisdiction and its supervisory jurisdiction overlapped to a considerable degree, there remained sufficient areas of differences to warrant their treatment as “distinctbases of jurisdiction” [emphasis in original] (at [46]). Hence, the amendment may be seen as legislative recognition of these two spheres of jurisdiction as separate bases of jurisdiction, rather than as any intention to treat the High Court’s supervisory jurisdiction as mutually exclusive of its original jurisdiction. 78     Moreover, it should be noted that s 3 of the SCJA, which sets out the divisions and jurisdiction of the Supreme Court, specifies that the High Court shall exercise “original and appellate civil and criminal jurisdiction”, but does not specify any supervisory jurisdiction of the High Court: Divisions and jurisdiction of Supreme Court 3.    The Supreme Court shall be a superior court of record and shall consist of — (a)    the High Court, which shall exercise original and appellate civil and criminal jurisdiction; and (b)    the Court of Appeal, which shall exercise appellate civil and criminal jurisdiction. 79     This suggests that the High Court’s supervisory jurisdiction over inferior tribunals is subsumed under the High Court’s original civil jurisdiction since it is not part of the High Court’s appellate jurisdiction (see above at [42]–[43]). The same observation was made by Prof Tan (see above at [64]), and we endorse his view.",
        "Our decision on Issue 1": "80     For all these reasons, we hold that: (a) ss 19(3) and 52 of the State Courts Act constitute written laws which require that an application to set aside an AD and/or a s 27 judgment be heard and determined by the High Court; and (b) when the High Court exercises its supervisory jurisdiction in hearing and determining such an application, it exercises such supervisory jurisdiction as part of its original jurisdiction. Therefore, the present case falls under s 34(2A)(c) of the SCJA and the Appellant does not require leave to appeal to the Court of Appeal. 81     The effect of our ruling is that the current practice of applying to the High Court, rather than to the District Courts, to set aside an AD and/or a s 27 judgment, as observed by the High Court inJFC Builders(see above at [39]), is correct in principle, notwithstanding the fact that neither s 27 of the SOPA nor O 95 of the Rules of Court expressly states that an application to set aside an AD and/or a s 27 judgment must be brought in the High Court. 82     This says nothing about whether an application for leave to enforce an AD must similarly be brought in the High Court, or whether that may be brought in any court subject to the jurisdictional limit of that court. Such an application does not on its face entail the exercise of supervisory jurisdiction. But, if that were the case, it would bring about a seemingly strange situation because a creditor (as defined at [33] above) could then go to the State Courts to apply for leave to enforce an AD, but the opposing debtor would only be able to apply to set aside the AD and/or the s 27 judgment in the High Court. As noted by the High Court inJFC Builders, this strange situation might trip many a solicitor, and this seems unsatisfactory. 83     Given that the object of the SOPA is to facilitate cash flow in the building and construction industry and not get the parties involved in a prolonged and expensive litigation process, it may be timely for Parliament to review the SOPA as a whole as well as this matter in particular. However, until such time, in our judgment, the correct position is that an application for leave to enforce an AD may be brought in either the State Courts or the High Court depending on the adjudicated amount involved, but an application to set aside an AD and/or a s 27 judgment must be brought in the High Court, which hears the application in the exercise of its original supervisory jurisdiction. 84     Before leaving this issue, we make a final observation. This relates to a potential point that could have been but was not in fact raised in the Present Summons. InNim Minimaart (suing as a firm) v Management Corporation Strata Title Plan No 1079 and others[2014] 1 SLR 108 (“Nim Minimaart”), we opined in passing that s 34(2)(a) of the SCJA should not be construed literally to capture an appeal froma decision made by the High Court in the exercise of its original jurisdictioneven if the value of the subject matter or the sum in dispute was less than $250,000. This was based on the ministerial speech during the second reading of the 2010 SCJA Amendment Bill. We were of the view that this speech suggested that “the architecture of s 34 in the aftermath of the 2010 amendments was such as to restrict or exclude appeals concerningany matter emanating from the [State] Courtsin the manner prescribed in s 34(2)(a)” [emphasis added] (seeNim Minimaartat [33]); at the same time, “[i]n relation tomatters originating in the High Court, the 2010 amendments sought to regulate the availability of appeals in such matters in ss 34(1)(a), 34(1)(d) and 34(1)(e), ss 34(2)(b), 34(2)(c), 34(2)(d) and 34(2)(e), and s 34(2A) of the SCJA” [emphasis added] (seeNim Minimaartat [34]). 85     Based on this observation inNim Minimaart, an argument could have been made that because the Respondent’s setting-aside application was commenced in the High Court (and not the State Courts), the present case is not even caught by the requirement under s 34(2)(a) of the SCJA of obtaining leave to appeal. This was not an argument made in the Present Summons and, hence, no submissions were made on this point before us. Therefore, the present judgment does not pick up on the aforesaid observation inNim Minimaart. Nevertheless, we recognise that the very existence of s 34(2A)(c), in as much as it excludes the requirement to obtain leave to appeal in cases where a matter isrequiredby any written law to be heard and determined by the High Court in the exercise of its original jurisdiction, may cut against the correctness of the observation inNim Minimaartwhich we have just referred to. It might be argued that s 34(2A)(c) would only be required if Parliament intended s 34(2)(a) to be read literally to include appeals from cases originating in the High Court, and not just appeals from cases emanating from the State Courts. We recognise that there are arguments going both ways; but as no such arguments were made before us, we leave this to be decided on a future occasion when it becomes essential to decide the point and when we would be doing so with the benefit of full arguments.",
        "Issue 2: Whether the Appellant’s notice of appeal should be struck out because the Appellant failed to provide $20,000 as security for costs": "",
        "The relevant provisions": "86     Under O 57 r 3(3) of the Rules of Court, an appellant is required to provide security for the respondent’s costs of the appeal at the time of filing the notice of appeal. 87     Paragraph 86(2) of the Practice Directions specifies that an appellant is required to provide security in the sum of $15,000 for appeals against interlocutory orders and $20,000 for all other appeals. 88     While the practice directions issued by a court do not have the force of law (seeBNP Paribas v Polynesia Timber Services Pte Ltd[2002] 1 SLR(R) 539 at [37];Odex Pte Ltd v Pacific Internet Ltd[2008] 3 SLR(R) 18 at [29] and [30]), they are nonetheless directions from a court, and a court will not normally depart from such directions unless there is good reason for doing so. In this instance, O 57 r 3(3) specifically provides that the sum to be provided as security for the respondent’s costs of the appeal may be fixed from time to time by the Chief Justice, and para 86(2) of the Practice Directions records the determination of the Chief Justice on this issue. 89     The Appellant contends that its appeal is an appeal against an interlocutory order, while the Respondent contends that it is an appeal against a final order.",
        "The meaning of “interlocutory order”": "90     InWellmix Organics (International) Pte Ltd v Lau Yu Man[2006] 2 SLR(R) 525 (“Wellmix Organics”), this court considered the meaning of “interlocutory order” in the context of s 34(1)(c) of the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed) (“the 1999 Revised Edition of the SCJA”), which imposed restrictions on the bringing of an appeal to the Court of Appeal against “an interlocutory order in chambers” made by a High Court judge (it should be noted that this provision was subsequently deleted by the 2010 SCJA Amendment Act). This court affirmed that the test of whether a judgment or order was “interlocutory” or “final” depended on whether it finally disposed of the rights of the parties (seeWellmix Organicsat [10], affirming the English decision ofBozson v Altrincham Urban District Council[1903] 1 KB 547 (“Bozson”)). The test laid down inBozson(“theBozsontest”) was stated by Lord Alverstone CJ as follows in that case (at 548): Does the judgment or order, as made, finally dispose of the rights of the parties? If it does, then ... it ought to be treated as a final order; but if it does not, it is then ... an interlocutory order. 91     TheBozsontest has been applied in many cases in Singapore: seeRank Xerox (Singapore) Pte Ltd v Ultra Marketing Pte Ltd[1991] 2 SLR(R) 912;Ling Kee Ling v Leow Leng Siong[1995] 2 SLR(R) 36;Aberdeen Asset Management Asia Ltd v Fraser & Neave Ltd[2001] 3 SLR(R) 355; andMaldives Airports Co Ltd v GMR Male International Airport Pte Ltd[2013] 2 SLR 449 at [15]–[16]. 92     With regard to the meaning of “finally”, this court inWellmix Organicsexplained at [15]: As regards the word “finally”, its ordinary meaning is clear. It means either “the last” or “completely”. ... There is much force in the argument that a determination as to liability does not finally or fully dispose of the rights of the parties where damages are also claimed in the action. That will only be a partial determination of the rights. The determination of liability is not an end in itself. Such a determination is not the only thing that the plaintiff is asking for. Damages are really what the plaintiff is seeking, and determining liability is a necessary step towards deciding whether damages or compensation are payable, and if so, what is the appropriate amount. On this view, an interlocutory judgment with damages to be assessed will not be an order which finally disposes of the rights of the parties in that action. 93     Referring toBozson, this court inWellmix Organicsfurther clarified its understanding of a “final order” at [20]: The [English] Court of Appeal held that [the trial judge’s order] was a final order. We do not disagree with that. The order inBozsonwas a final order because the action was dismissed. There was nothing more to the action. 94     In discussing the meaning of “interlocutory order” under s 34(1)(c) of the 1999 Revised Edition of the SCJA, this court inWellmix Organicssaid (at [16]): We recognise that on [theBozsontest], it is possible that an order granted in one proceeding may be interlocutory and yet the same nature of order granted in another proceeding may be final. The point may again best be illustrated by an example. Taking the case of an action for breach of contract, where an application is made for discovery of documents, the order for discovery will be an interlocutory order.But it does not follow that every discovery order will necessarily be an interlocutory order. It will depend on the nature of the originating process and the relief(s) prayed for. A proceeding may be instituted purely to obtain pre-action discovery. In that situation, upon the granting of the order prayed for, that order will be a final order because it disposes of everything in the proceeding. [emphasis added] 95     This last quotation fromWellmix Organicswas affirmed by this court recently inDorsey James Michael v World Sport Group Pte Ltd[2013] 3 SLR 354, where we stated at [64]: It is pertinent that an application to administer pre-action interrogatories is made by way of originating summons under O 26A r 1 of the Rules of Court [(Cap 322, R 5, 2006 Rev Ed)]. We reiterate that the sole purpose of the originating summons is to obtain discovery of information through the administration of interrogatories on the defendant to the originating summons. Once the application is determined, the entire subject matter of that originating summons is spent and there is nothing further for the court to deal with.",
        "Our decision on Issue 2": "96     In the present case, the Appellant’s application in OS 886/2013 was for leave to enforce the Disputed AD as a judgment. The sole purpose of that originating summons was to obtain leave to enforce the Disputed AD as a judgment. Once the application was determined, the entire subject matter of that originating summons was spent and there was nothing further for the court to deal with. In particular, when the Judge set aside the Disputed AD, the Leave Order and the Disputed Judgment, his order was a final order because therewasnothing further for the court to deal with. 97     We therefore hold that pursuant to O 57 r 3(3) of the Rules of Court read with para 86(2) of the Practice Directions, the Appellant is required to provide security in the sum of $20,000 for the Respondent’s costs of the appeal. Since the Appellant only provided $15,000 as security for costs, there is a shortfall of $5,000. However, we are satisfied that the Appellant’s failure to comply with O 57 r 3(3) (read with para 86(2)) in these circumstances is an irregularity, and that we can make such order generally as we think fit to address this: see O 2 r 1. We note that the Appellant stated both in its written submissions and at the oral hearing before us that it was prepared to furnish additional security if it turned out to be wrong in the view which it took. Accordingly, we order the Appellant to furnish additional security in the sum of $5,000 within seven days of the date of this judgment.",
        "Conclusion": "98     For all these reasons, we dismiss the Present Summons and order that the Appellant furnish additional security in the sum of $5,000 within seven days of the date of this judgment. We reserve the costs of the Present Summons to the hearing of the substantive appeal.  [note: 1]See the Disputed AD at paras 23 and 29 (found in the Respondent’s affidavit filed on 24 March 2014 at pp 18–19)."
    }
}