{
    "case_title": "Burgundy Global Exploration Corp\n      v\n      Transocean Offshore International Ventures Ltd and another\n            appeal",
    "ncitation": "[2014] SGCA 24",
    "coram": "Sundaresh Menon CJ; \n      V K Rajah JA; \n      Judith Prakash J",
    "sections": {
        "Introduction": "1       These two appeals came before us after a long\n                    and somewhat convoluted procedural course. Unfortunately, some part of the\n                    litigation has been in vain because, in our judgment, the respondent’s\n                    claim for damages was premised on a fundamental conceptual error. 2       Civil Appeal No 48 of 2013 (“CA\n                    48/2013”) concerns two interrelated contracts. The first contract was\n                    governed by an arbitration agreement while the second was governed by a\n                    jurisdiction clause in favour of the Singapore courts. The second contract\n                    provided that a breach of its terms would also give the respondent the right to\n                    terminate the first contract. The respondent purported to exercise this right\n                    when the appellant breached the second contract. The critical issue in this\n                    appeal is whether the respondent can claim, in an action for breach of the\n                    second contract, damages for its loss of profits arising from the termination of\n                    the first contract. 3       In Civil Appeal No 55 of 2013\n                    (“CA 55/2013”), the appellants, who are the directors of the\n                    appellant in CA 48/2013, are appealing against the High Court’s refusal to\n                    set aside an order for substituted service of examination of judgment debtor\n                    (“EJD”) orders that had previously been issued against them. The\n                    appellants are foreign nationals who are ordinarily resident overseas. The issue\n                    raised is whether a Singapore court has the jurisdiction to issue an EJD order\n                    against company officers who are ordinarily resident overseas, and if so,\n                    whether leave is required for service of the EJD orders out of\n                    jurisdiction. 4       We reserved judgment after the hearing of oral\n                    arguments. Having considered the matters, we have decided to allow both appeals\n                    for the reasons that follow.",
        "Facts": "",
        "Parties to the dispute": "5       The appellant in CA 48/2013 is Burgundy Global\n                    Exploration Corporation (“Burgundy”), a Philippines company\n                    engaged in the business of exploring and developing oil and gas resources in the\n                    Philippines. 6       The five appellants in CA 55/2013 are the\n                    directors of Burgundy (the “Directors”), and they are ordinarily\n                    resident in the Philippines. 7       The respondent in both appeals is Transocean\n                    Offshore International Ventures Limited (“Transocean”), a company\n                    listed on the New York Stock Exchange. It supplies mobile offshore drilling\n                    units and provides drilling services for oil and natural gas\n                reserves.",
        "Background to the dispute": "The contractual relationship between Burgundy and\n                Transocean 8       Under an offshore drilling contract dated\n                    29 September 2008 and a novation agreement dated 30 October 2008\n                    (collectively, the “Drilling Contract”), Transocean agreed to\n                    supply a semi-submersible drilling rig (the “Rig”) and provide\n                    offshore drilling services to Burgundy. Article XI of the Drilling Contract\n                    provided as follows: ARTICLE XI – ESCROW AGREEMENT It shall be a condition precedent that prior to Commencement Date under\n                        this Contract, [Burgundy] and [Transocean] shall enter into an Escrow\n                        Agreement in the manner approved by [Transocean]. 9       Pursuant to Article XI, Burgundy and Transocean\n                    entered into an escrow agreement on 31 October 2008 (the “Escrow\n                    Agreement”). The Escrow Agreement required Burgundy to deposit certain\n                    amounts into an escrow account following a specified timeline, failing which\n                    Transocean was entitled, among other things, to terminate the Drilling Contract.\n                    The material clauses were as follows: 2.Acknowledgement Subject to Burgundy depositing the Escrow Amount into the Escrow Account\n                        in accordance with clause 3.2, Transocean acknowledges that the requirements\n                        of Article XI of the Drilling Contract are satisfied by the execution of\n                        this Agreement by Burgundy and Transocean. Notwithstanding any other provision of this Agreement or the Drilling\n                        Contract,in the event that Burgundy fails to deposit the\n                            Escrow Amount into the Escrow Account in accordance with clause 3.2,\n                            Transocean shall have the right to suspend the work while simultaneously\n                            accruing the Standby rate under the Drilling Contract and/or terminate\n                            the Drilling Contract. ... 3.2Escrow\n                            Amount Burgundy will cause to be deposited into the Escrow Account the following\n                        amounts: (a)    30 days prior to\n                            the planned Commencement Date or by December 15, 2008 whichever is\n                            earlier, Burgundy shall deposit the sum of US$16,500,000 (calculated as\n                            the Operating Rate multiplied by thirty (30) days) into the Escrow\n                            Account; and on the Commencement Date, Burgundy shall again deposit the\n                            same amount into the Escrow Account;\n                            and (b)    thereafter, on each day\n                            which is a multiple of thirty (30) days from the date of the second\n                            deposit in accordance with clause 3.2 (a) above or from the Commencement\n                            Date, until the total amount deposited by Burgundy in accordance with\n                            this clause 3.2 is equal to the amount that is the Operating Rate\n                            multiplied by the entire anticipated maximum duration of the relevant\n                            Term, Burgundy shall further deposit into the Escrow Account the amount\n                            that is the Operating Rate multiplied by lesser of: (i)    thirty (30) days (of the Term);\n                            or (ii)   the number of days remaining in the Term if\n                                such number is less than 30 days, (Escrow Amount)and provide documentary\n                        evidence of such deposit to Transocean. [emphasis in original in bold; emphasis added in italics] 10     Burgundy failed to make the initial deposit of\n                    US$16.5m (the “Escrow Amount”) into the escrow account by 15\n                    December 2008. One week later, by a letter dated 22 December 2008, Transocean\n                    informed Burgundy that: (a)     it was exercising its right under cl\n                        2 of the Escrow Agreement to terminate the Drilling Contract with immediate\n                        effect; and (b)     Burgundy’s failure to deposit the Escrow Amount constituted a\n                        repudiatory breach of the Escrow Agreement which Transocean accepted as\n                        terminating the Escrow Agreement with immediate effect. 11     Burgundy replied the next day saying that it\n                    respected Transocean’s decision but that the parties should\n                    “cooperate and find a suitably workable solution”. However,\n                    nothing came out of this. Transocean’s suit against Burgundy 12     On 29 January 2009, Transocean commenced Suit\n                    No 87 of 2009 (“S 87/2009”) against Burgundy for its breach\n                    or repudiation of the Escrow Agreement. In its Statement of Claim (Amendment No\n                    2), Transocean claimed the following relief (amongst others): (a)     a declaration that Burgundy was in\n                        repudiatory breach of the Escrow Agreement; (b)     a declaration that the Drilling Contract had\n                        been validly terminated; (c)     damages in the sum of US$105,937,952, which represented\n                        Transocean’s loss of net profits under the Drilling\n                    Contract; (d)     in the\n                        alternative, damages in the sum of US$55,001.46, which represented\n                        Transocean’s wasted costs and expenses in entering into the Escrow\n                        Agreement; and (e)     further or in the alternative, damages to be assessed. Leave to serve the writ of summons out of jurisdiction on\n                        Burgundy, in the Philippines, was obtained on 15 April\n                2009. 13     On 5 June 2009, Burgundy applied for a stay of\n                    the proceedings in favour of arbitration pursuant to Art 25.1 of the Drilling\n                    Contract, which provided as follows: 25.1Arbitration The following Dispute Resolution provision shall apply to this\n                        Contract. (a)    Any dispute, controversy or claim arising out of\n                            or in relation to or in connection with this Contract, including without\n                            limitation any dispute as to the construction, validity, interpretation,\n                            enforceability, performance, expiry, termination or breach of this\n                            Contract whether based on contract, tort or equity, shall be exclusively\n                            and finally settled by arbitration in accordance with this Article XXV.\n                            Any Party may submit such a dispute, controversy or claim to arbitration\n                            by notice to the other Party. … (c)    Unless otherwise expressly agreed in writing by\n                            the Parties to the arbitration proceedings: … (ix)   Indirect, consequential or exemplary damages\n                                (Including loss of profit, loss of production, etc.) shall not be\n                                allowed except those payable to third parties for which liability is\n                                allocated among the Parties by the arbitration award; … 14     The stay application was granted by an\n                    assistant registrar at first instance but the appeal against the order was\n                    allowed by Andrew Ang J (“Ang J”), whose decision is\n                    reported asTransocean Offshore International Ventures Ltd v\n                        Burgundy Global Exploration Corp[2010] 2 SLR 821\n                        (“Transocean (Jurisdiction)”).\n                    Ang J held that Art 25.1 of the Drilling Contract did not apply to claims\n                    arising from Burgundy’s failure to pay the Escrow Amount into the escrow\n                    account in accordance with the terms of the Escrow Agreement. Instead, the\n                    Escrow Agreement was governed by a separate dispute resolution clause which\n                    subjected any legal action or proceedings relating to the Escrow Agreement to\n                    the “non-exclusive jurisdiction” of the Singapore courts: 6.2Jurisdiction (a)    Each of the Parties irrevocably submits to and\n                            accepts generally and unconditionally the non-exclusive jurisdiction of\n                            the courts and appellate courts of Singapore with respect to any legal\n                            action or proceedings which may be brought at any time relating in any\n                            way to this Agreement. (b)    Each of the Parties irrevocably waives any\n                            objection it may now or in the future have to the venue of any action or\n                            proceedings, and any claim it may now or in the future have that the\n                            action or proceeding has been brought in an inconvenient\n                        forum. The High Court’s decision was affirmed on appeal to this\n                        Court in Civil Appeal No 137 of 2009 (“CA 137/2009”) with no\n                        grounds issued. 15     Burgundy then filed its defence in which it\n                    pleaded that it was not liable because Transocean had breached various implied\n                    terms (which are not germane to this appeal). It further pleaded that even if\n                    Transocean was entitled to any damages under the Escrow Agreement, it was\n                    precluded from making any claim for consequential losses by reason of Art 19.1\n                    of the Drilling Contract, which provides as follows: 19.1Consequential\n                            loss or damage Notwithstanding any provisions to the contrary elsewhere in the Contract,\n                        [Burgundy] shall save, indemnify, release, defend and hold harmless\n                        [Transocean] from [Burgundy’s] own Consequential Loss and [Transocean]\n                        shall save, indemnify, release, defend and hold harmless [Burgundy] from\n                        [Transocean’s] own Consequential Loss. For the purposes of this sub-clause 19.1, the expression\n                        “Consequential Loss” shall mean any indirect or consequential\n                        loss howsoever caused or arising whether under contract, by virtue of any\n                        fiduciary duty, in tort or delict (including negligence), as a consequence\n                        of breach of any duty (statutory or otherwise) or under any other legal\n                        doctrine or principle whatsoever whether or not recoverable at common law or\n                        in equity.Consequential Loss shall be deemed to include,\n                            without prejudice to the foregoing generality, the following to the\n                            extent to which they might not otherwise constitute indirect or\n                            consequential loss: (a)    loss or damage arising out of any delay,\n                            postponement, interruption or loss of production, any inability to\n                            produce, deliver or process petroleum orany loss of\n                                or anticipated loss of use, profit or\n                        revenue; (b)    loss or damage incurred or liquidated or\n                            pre-estimated damages of any kind whatsoever borne or payable, under any\n                            contract for the sale, exchange, transportation, processing, storage or\n                            other disposal of petroleum; (c)    losses associated with business interruption\n                            including the cost of overheads incurred during business\n                            interruption; (d)loss of bargain, contract,\n                                expectation or opportunity; (e)    any other loss or anticipated loss or damage\n                            whatsoever in the nature of or consequential upon the\n                        foregoing. [emphasis added] Burgundy also pleaded that it did not cause the losses claimed\n                        by Transocean and that, further or in the alternative, the damages claimed\n                        were too remote. 16     After Burgundy filed its defence, Transocean\n                    applied for summary judgment against Burgundy. The summary judgment application\n                    was granted by AR Teo Guan Siew (“AR Teo”) on 7 October 2010,\n                    whose decision was upheld on appeal by Quentin Loh J (“Loh\n                    J”). The assessment of damages 17     The assessment of damages commenced on 23\n                    April 2012 before another assistant registrar (“AR Tan”). On the\n                    first day of the hearing, Burgundy was not represented by counsel. Through its\n                    representative, one Mr Richer Andaya (“Mr Andaya”), it\n                    applied to vacate the hearing dates on the ground that it had discharged its\n                    former lawyers and needed more time to engage new counsel. AR Tan adjourned the\n                    hearing for one day to enable Burgundy to engage counsel on an urgent\n                    basis. 18     The next day, Mr Rakesh Vasu (“Mr\n                    Vasu”) and Ms Winnifred Gomez (“Ms Gomez”) – who are\n                    representing Burgundy in this appeal – appeared on behalf of Burgundy\n                    seeking a further adjournment of the hearing. AR Tan eventually dismissed\n                    this application because Burgundy failed to furnish security for costs in the\n                    sum of $324,000 by 3pm on 24 April 2012. Mr Vasu and Ms Gomez then successfully\n                    applied to discharge themselves, and the assessment hearing proceeded with\n                    Burgundy being unrepresented. Mr Andaya was present as an observer but had\n                    no right of audience and gave no evidence. 19     At the conclusion of the hearing, AR Tan\n                    awarded Transocean damages in the sum of US$105,536,922 plus interest, which was\n                    derived from the following computation: (a)     total revenue that Transocean would\n                        have earned under the Drilling Contract (US$126,292,500),minus (b)     total expenses that Transocean would have incurred in performing the\n                        Drilling Contract (US$24,494,185.53),plus (c)     costs of mitigation reasonably incurred by Transocean\n                        (US$3,738,607). Following AR Tan’s\n                        decision, Transocean entered final judgment against Burgundy on 25 April\n                        2012. The EJD applications 20     On 7 June 2012, Transocean applied for and\n                    obtained EJD orders (“the EJD Orders”) against the Directors as\n                    officers of Burgundy pursuant to O 48 r 1 of the Rules of Court (Cap 322, R\n                    5, 2006 Rev Ed) (“ROC”). No leave to serve the EJD Orders out of\n                    jurisdiction was obtained. Between June and November 2012, Transocean made three\n                    unsuccessful attempts to serve the EJD Orders on the Directors in the\n                    Philippines through a law firm there. 21     On 3 October 2012, Transocean filed a summons\n                    seeking liberty to effect substituted service of the EJD Orders. The prayers\n                    sought were as follows: 1.    [Transocean] be at liberty to effect Service of any\n                            Order for Examination of Judgment Debtor in SUM 2826/2012/A (the\n                            ‘EJD Order’) on the directors and/or officers of [Burgundy]\n                            as named herein by way of (i) service on [Burgundy’s] Singapore\n                            lawyers, Gomez & Vasu LLC and/or (ii) advertisement of the aforesaid\n                            the EJD Order ... in an English language newspaper with nation-wide\n                            circulation in the Republic of the Philippines for three consecutive\n                            days. ... 2.    That such service and/or advertisement shall be\n                            deemed good and sufficient service of the said EJD Order on the said\n                            directors and/or officers of [Burgundy]. 3.    Costs of and incidental to this application to\n                            [Transocean]. On 4 January 2013, AR Ruth Yeo (“AR Yeo”)\n                        granted orders in terms of Prayers 1(i), 2 and 3. No order was made on\n                        Prayer 1(ii). Transocean proceeded to serve the EJD Orders on Gomez &\n                        Vasu LLC on 14 January 2013. 22     On 18 February 2013, the Directors applied to\n                    set aside AR Yeo’s order allowing substituted service on the basis that\n                    the EJD Orders were effectively subpoenas and were required to be served\n                    personally. The application was dismissed by an assistant registrar (“AR\n                    Liew”) on 4 March 2013, who held that service of the EJD Orders was\n                    governed by O 11 r 8, O 48 r 1(2) and O 62 r 5 of the ROC (read\n                    together) and that these requirements had been satisfied.",
        "Decision below": "23     Burgundy appealed against AR Tan’s award\n                    of damages while the Directors appealed against AR Liew’s dismissal of the\n                    setting-aside application. Both appeals were dismissed by the High Court judge\n                    (“the Judge”), whose decisions are reported asTransocean Offshore International Ventures Ltd v Burgundy Global\n                        Exploration Corp[2013] 3 SLR 1017 (“Transocean (Damages)”) andSerafica\n                        Rogelio T and others v Transocean Offshore Ventures Ltd[2013] 3\n                    SLR 1040 (“Serafica”)\n                    respectively. 24     With respect to Burgundy’s appeal, the\n                    Judge rejected Burgundy’s argument that Transocean’s claim for\n                    damages fell within the scope of the arbitration agreement in the Drilling\n                    Contract. The Judge did so on the basis that the Drilling Contract was not\n                    itself the source of the parties’ rights and obligations giving rise to\n                    Transocean’s claim; rather, he thought it was only a point of reference\n                    for ascertaining the financial consequences of Burgundy’s breach of the\n                    Escrow Agreement (Transocean (Damages)at [18]).\n                    The Judge further held that properly construed, Art 19.1 did not exclude a claim\n                    by Transocean for loss of the net profits arising from the termination of the\n                    Drilling Contract (Transocean (Damages)at [29]).\n                    Finally, the Judge varied AR Tan’s award of damages with respect to\n                    Transocean’s mitigation expenses. AR Tan had allowed Transocean to recover\n                    the actual expenses it incurred in cold-stacking the Rig (including preparatory\n                    work) from 23 May to 15 November 2009, but the Judge held that Transocean should\n                    only be allowed to recover its expenses until end August 2009, when the minimum\n                    238-day hire period would have expired (Transocean\n                        (Damages)at [59]). 25     As for the Directors’ appeal, the Judge\n                    rejected their attempts to equate an EJD order with an originating process or a\n                    subpoena (Seraficaat [22] and [29]). Instead, he\n                    held that the service of the EJD Orders out of jurisdiction was governed by O 11\n                    r 8(1), which states that leave shall not be required for service out of\n                    Singapore of any summons, notice or order issued in any proceedings in which\n                    leave for service of the originating process has already been granted (Seraficaat [20]). 26     The Directors then appealed to this Court in\n                    CA 55/2013. After filing the appeal, the Directors applied for a stay of\n                    execution of the EJD Orders pending the hearing of the appeal. In their\n                    supporting affidavit, the Directors cited, for the first time, the decision of\n                    the English House of Lords inMasri v Consolidated\n                        Contractors International (UK) Ltd (No 4)[2010] 1 AC 90\n                        (“Masri”), which held that under\n                    the English counterpart of O 48 r 1, a court couldnotmake an EJD order against an officer of a corporate judgment\n                    debtor who was ordinarily resident abroad (“foreign officer”). The\n                    Judge granted the stay on the basis that there was a potentially arguable case\n                    that the EJD Orders should be set aside on this ground.",
        "The parties’ arguments on appeal": "",
        "CA 48/2013": "32     The main issue in CA 48/2013 is whether\n                    Transocean can recover damages for losses due to the termination of the Drilling\n                    Contract under a claim that is based on breach of the Escrow Agreement, or\n                    whether such claims are subject to arbitration under Art 25.1 of the Drilling\n                    Contract (“the Damages Issue”). A threshold question that needs to\n                    be addressed is whether this issue isres judicataas argued by Transocean. 33     As for the second issue regarding the effect\n                    of Art 19.1 of the Drilling Contract, it will become evident that this issue\n                    ought not be decided by us but should be determined in arbitration. We would\n                    further note that, although this was not raised by the parties, there is another\n                    exclusion clause in Art 25.1(c)(ix) of the Drilling Contract (see [13]\n                    above) that might also be relevant to any claim on the Drilling Contract, but\n                    which we are not required to deal with.",
        "CA 55/2013": "34     CA 55/2013 gives rise to the following\n                    issues: (a)     Does a Singapore court have the\n                        jurisdiction under O 48 of the ROC to make an EJD order against a corporate\n                        officer who is based overseas (“the Extraterritorial Jurisdiction\n                        Issue”)? (b)     If the answer to the above issue is in the affirmative, is leave required\n                        to serve an EJD order out of jurisdiction and should it be granted in the\n                        present case (“the Leave Issue”)? 35     There is also the preliminary issue of whether\n                    the Directors require leave to raise these issues on appeal to this Court. In\n                    our view, no leave is required because although the key English cases supporting\n                    Burgundy’s position were not cited below, the underlying issues and\n                    arguments had been ventilated before the Judge. In any event, even if leave were\n                    required, we would have granted it given that these issues are purely legal in\n                    nature and do not require any fresh evidence to be adduced: seePanwah Steel Pte Ltd v Koh Brothers Building & Civil\n                        Engineering Contractor (Pte) Ltd[2006] 4 SLR(R) 571 at\n                    [17].",
        "Issues before this Court": "",
        "Our decision": "",
        "The Damages Issue": "Is this issue res judicata? 36     The umbrella doctrine ofres judicatahas three aspects (Goh Nellie v\n                        Goh Lian Teck and others[2007] 1 SLR(R) 453 at [17]). Cause of\n                    action estoppel prevents a litigant from pursuing a matter that was the subject\n                    of previous proceedings (ibidat [17]). Issue\n                    estoppel prevents a litigant from raising an issue that has already been decided\n                    in previous proceedings (ibidat [18]). There is\n                    also the doctrine of abuse of process, which essentially prevents a litigant\n                    from mounting a collateral attack on a previous decision (ibidat [19], [51]–[52]). Here, Transocean is relying on\n                    the doctrine of issue estoppel. 37     It is well settled that four requirements must\n                    be satisfied for an issue estoppel to arise (Lee Tat\n                        Development Pte Ltd v Management Corporation of Strata Title Plan No\n                        301[2005] 3 SLR(R) 157 at [14]–[15]): (a)     there has been a final and\n                        conclusive judgment on the merits; (b)     that judgment was by a court of competent\n                        jurisdiction; (c)     there is identity between the parties to the two actions that are being\n                        compared; and (d)     there is identity of subject matter in the two\n                    proceedings. In deciding whether the fourth\n                        requirement is satisfied, the correct approach is to ask what had been\n                        litigated and, secondly, what had been decided. The decision on the issue\n                        must have been a “necessary step” to the decision or a\n                        “matter which it was necessary to decide, and which was actually\n                        decided, as the groundwork of the decision” (ibidat [15]). 38     Transocean submits that an issue estoppel\n                    arises in this case because the Damages Issue had already been litigated and\n                    decided during the stay proceedings. In those proceedings, Burgundy had argued\n                    that since Transocean was seeking damages for losses that resulted from the\n                    termination of the Drilling Contract, its claim was essentially a claim for\n                    breach of the Drilling Contract and should be subject to arbitration. However,\n                    this argument was rejected by Ang J inTransocean\n                        (Jurisdiction), whose decision was upheld on appeal to this Court\n                    in CA 137/2009. Therefore, Transocean contends that Burgundy is estopped from\n                    resurrecting the Damages Issue at the assessment of damages stage. 39     We disagree. It is clear to us that the\n                    Damages Issue hadnotbeen decided, nor was it\n                    necessary for it to be decided, inTransocean\n                        (Jurisdiction). In that case, Ang J decided not to grant a stay\n                    in favour of arbitration for four reasons: (a)     Article XI of the Drilling Contract\n                        demonstrated that the parties had agreed to carve out escrow matters from\n                        the Drilling Contract and to deal with these in the separate Escrow\n                        Agreement. That evinced a clear intention by the parties to subject claims\n                        arising from the Escrow Agreement to the dispute resolution clause found\n                        within that agreement: at [21]. (b)     Properly construed, Art 25 of the Drilling Contract was\n                        principally concerned with the resolution of claims and disputes arising out\n                        of or in relation to the Drilling Contract, and did not extend to claims\n                        brought by Transocean under the Escrow Agreement: at\n                    [22]. (c)     It is a trite\n                        canon of construction that the general should give way to the specific.\n                        Given the specificity of cl 6.2 of the Escrow Agreement, it overrode Art 25\n                        of the Drilling Contract with respect to a claim that arose out of the\n                        Escrow Agreement: at [25]. (d)     Section 6(1) of the International Arbitration Act\n                        (Cap 143A, 2002 Rev Ed) did not apply because proceedings instituted\n                        under the Escrow Agreement did not fall within the scope of the arbitration\n                        clause in the Drilling Contract: at [28]. 40     Nowhere in his judgment did Ang J consider the\n                    question of whether the specific losses claimed by Transocean were recoverable\n                    in a claim brought under the Escrow Agreement; indeed, not once did he evenreferto the heads of damages claimed by\n                    Transocean. As the following extract shows, Ang J was concerned solely with\n                    the narrow issue of whether Transocean could proceed in Singapore courts given\n                    the purported basis of its cause of action (at [15]): [Transocean’s] cause of action against [Burgundy]\n                            was a straightforward claim arising from [Burgundy’s] failure to\n                            pay the Escrow Amount into the Escrow Account in accordance with the\n                            terms of the Escrow Agreement. Indeed, [Burgundy] did not\n                        dispute that it failed to deposit the requisite sum pursuant to cl 3.2(a) of\n                        the Escrow Agreement. As such, the claim fell squarely within cl 3.2(a) of\n                        the Escrow Agreement. [Burgundy] argued that the termination of the Drilling\n                        Contract was premised on a breach of the Drilling Contract. Since Art 25.1\n                        of the Drilling Contract provided that any dispute to the termination or\n                        breach would be governed by arbitration, Art 25.1 would also apply to\n                        [Transocean’s] claim in this action.I rejected\n                            this argument as the reason for the termination was [Burgundy’s]\n                            breach of the Escrow Agreement.[emphasis added] 41     Ang J went on to made it clear that his\n                    decision rested on the premise that the dispute related to the Escrow Agreement,\n                    and not the Drilling Contract (at [21]): First, from a reading of the Escrow Agreement and the Drilling Contract, I\n                        was of the view that the parties had intentionally carved the former out\n                        from the latter and expressly subjected the former to a non-exclusive\n                        jurisdiction clause rather than an arbitration clause.Article 11 of the Drilling Contract demonstrated that the parties had\n                            agreed to carve out escrow matters from the Drilling Contract and to put\n                            them in a separate agreement. That evinced a clear intention by the\n                            parties to subject claims arising from the Escrow Agreement to the\n                            dispute resolution clause found within that particular\n                            agreement.Counsel for the plaintiff submitted that the\n                        motivation behind this move was to ensure quicker relief, in the event that\n                        the obligations contained in the Escrow Agreement were breached than if the\n                        matter were arbitrated, as there was no procedure under the London Court of\n                        International Arbitration Rules for a final interim award. I agreed with\n                        that submission as the obligations of the Escrow Agreement were relatively\n                        straightforward and non-technical in nature, as compared with those under\n                        the Drilling Contract. … [emphasis added] 42     Thus, although the Damages Issue might have\n                    beenraisedby Burgundy before Ang J and this\n                    Court during the stay proceedings, it had not beendecidedon the merits. The sole issue in those proceedings was\n                    whether Transocean’s action should be stayed in favour of arbitration when\n                    its cause of action was based on the Escrow Agreement. The court understandably\n                    did not consider the further question of whether Transocean could recover the\n                    specific losses it claimed to have suffered given its pleaded cause of action,\n                    which would have been more relevant at the assessment of damages stage. We\n                    therefore find that the Damages Issue is notres\n                        judicata, and it remains open to Burgundy to raise this and for\n                    us to decide it. Can Transocean recover its loss of profits under the Drilling\n                Contract in a claim for breach of the Escrow Agreement? 43     Before we explain why we have come to a\n                    different view from the Judge on the Damages Issue, we first highlight an\n                    important feature of this case. This is a case where the parties had entered\n                    into two contracts to give effect to a single transaction, which is the\n                    provision of a drilling rig and offshore drilling services by Transocean to\n                    Burgundy in exchange for the payment of money. The Drilling Contract was the\n                    main contract setting out the parties’ obligations, including the services\n                    to be provided by Transocean and the rates to be paid by Burgundy for those\n                    services; while the Escrow Agreement was a separate contract making provision\n                    for the question of how Burgundy should pay for Transocean’s services.\n                    Transocean took pains to point out that there were many cross-references between\n                    the two contracts: for example, cl 3.2 of the Escrow Agreement provided that the\n                    sums to be deposited into the escrow account were to be fixed by reference to\n                    the “Operating Rates” stipulated under the Drilling Contract.\n                    There can be no real doubt that the two contracts are closely\n                linked. 44     But despite this, it must not be overlooked\n                    that the parties had deliberately carved out escrow matters from the transaction\n                    and subjected it to a separate agreement. The purpose of the Escrow Agreement,\n                    as Transocean says, was to provide Transocean with security so that it could\n                    commit to performing the Drilling Contract without having to fear that it might\n                    end up being mired in delays if Burgundy defaulted on payment. In other words,\n                    Transocean’s performance interest under the Escrow Agreement was to obtain\n                    security for Burgundy’s performance of its payment obligations under the\n                    Drilling Contract. This must not be confused with Transocean’s performance\n                    interest under the Drilling Contract, which was to make profits from carrying\n                    out the contracted services. 45     Therefore, the true damage caused by\n                    Burgundy’s breach of the Escrow Agreement was the loss of its security,\n                    andnotthe loss of profits under the Drilling\n                    Contract. The latter loss was in fact the result of Transocean’s decision\n                    not to perform the Drilling Contract without security, and however reasonable a\n                    decision that might appear to be, the proper cause of action for recovering\n                    those losses must be a claim under the Drilling Contract. Having deliberately\n                    chosen to carve out the security aspect of the parties’ business\n                    relationship and deal with it in a separate contract, Transocean cannot now seek\n                    to vindicate its performance interest under the Drilling Contract by bringing a\n                    claim founded on breach of the Escrow Agreement. 46     The fact that cl 3.2 of the Escrow Agreement\n                    entitles Transocean to terminate the Drilling Contract upon a breach of the\n                    Escrow Agreement does not change the preceding analysis. A breach of the Escrow\n                    Agreement is not necessarily a breach of the Drilling Contract, and even if it\n                    were, there is no legal basis for allowing Transocean to recover the losses it\n                    suffered from a breach of theDrilling Contractin\n                    an action for breach of theEscrow Agreement. The\n                    contractual right to terminate the Drilling Contract upon a breach of the Escrow\n                    Agreement is just that – a right to terminate; it does not serve to import\n                    all the obligations under Drilling Contract into the Escrow Agreement and allow\n                    Transocean to treat them as a single composite contract. This is a matter of\n                    some significance where, as here, each contract has unique features including\n                    distinct dispute resolution mechanisms. 47     Thus, to recover its losses flowing from the\n                    termination of the Drilling Contract, the proper course for Transocean to take\n                    would have been to bring a claim in arbitration under the dispute resolution\n                    clause in that agreement and prove that the Drilling Contract had been breached\n                    by Burgundy and that it was entitled to damages for those losses. In our\n                    judgment, this is where the Judge fell into error. In the hearing below,\n                    Transocean argued that because Art 19.1 was located in the Drilling Contract, it\n                    was irrelevant to a claim premised on a breach of the Escrow Agreement. The\n                    Judge rejected this argument and held that Art 19.1 of the Drilling Contract was\n                    material to the dispute, for the following reason (at [24]–[25]): 24    Even if Art 19.1 of the Drilling Contract was not a\n                            valid defence to liability for breach of the Escrow Agreement, it did\n                            not logically follow that Art 19.1 could not affect the exact quantum of\n                            damages at the assessment based on a factual analysis of the specific\n                            pleaded heads of loss. Transocean brought its claim as a straightforward\n                            breach of cl 3.2 of the Escrow Agreement giving rise to a contractual\n                            right to terminate the Drilling Contract, with losses quantified by\n                            reference to the net loss of profits that flowed from the termination of\n                            the Drilling Contract.Assuming for the purposes of\n                                argument that Transocean would not in any event have been entitled\n                                to claim such loss of profits after the termination of the Drilling\n                                Contract due to the exclusion in Art 19.1, Transocean could not then\n                                quantify such loss of profits as damages that were causally related\n                                to the breach of the Escrow Agreement.This, in my view,\n                            is conceptually distinct from the argument - rejected by AR Teo and\n                            implicitly by Loh J - that Art 19.1 of the Drilling Contract excluded\n                            any potential liability that Burgundy may owe under the Escrow\n                            Agreement. 25    I therefore proceeded on the basis that Burgundy\n                            was not precluded from raising arguments on Art 19.1 as part of the\n                            logically prior question of whether the purported net loss of profits\n                            under the Drilling Contract was in fact suffered by Transocean.\n                            … [emphasis added] 48     While the Judge’s reasoning was correct\n                    in principle, he erred in not following it to its logical conclusion. Having\n                    accepted that it was important, for the purposes of establishing causation, to\n                    determine whether Transocean would have been able to recover its loss of profits\n                    under a hypothetical claim based on the Drilling Contract, it should have become\n                    clear that the more important threshold question – before even considering\n                    the effect of Art 19.1 – waswhether there had been a\n                        breach of the Drilling Contract in the first place. And once it\n                    was appreciated that Transocean’s claim for loss of profits in fact\n                    requires it to establish that: (a) there had been a breach of the Drilling\n                    Contract, and (b) liability for loss of profits isnotexcluded under Art 19.1 or possibly Art 25.1(c)(ix) of the\n                    Drilling Contract, it would have become evident that these were plainly matters\n                    that, under Art 25.1(a), were reserved for arbitration. 49     Indeed, Transocean had sought a declaration\n                    that the Drilling Contract had been validly terminated in its Statement of Claim\n                    (see [12(b)] above). It thus seems that Transocean had realised from the outset\n                    that its claim for loss of profits due to the termination of the Drilling\n                    Contract required the anterior determination that the Drilling Contract had been\n                    validly terminated as a result of a breach by Burgundy; it might have been\n                    unnecessary to include this prayer otherwise. Yet this is an issue that falls\n                    within the ambit of Art 25.1(a). It is noteworthy that although AR Teo had given\n                    judgment in favour of Transocean on its application for summary judgment, no\n                    order was in fact extracted. However, it seemed to be accepted by Transocean\n                    that AR Teo had not granted this declaration in giving summary judgment for\n                    Transocea. Indeed, counsel for Transocean (“Mr Toh”) informed us\n                    that no submissions were made on this issue before AR Teo. 50     We turn to Transocean’s argument on\n                    remoteness. Transocean argues that it is entirely conceivable for the losses\n                    flowing from the breach of one contract to be based on another contract, as long\n                    as those losses are not too remote. In support of this proposition, Transocean\n                    cited the case ofSatef-Huttenes Albertus SpA v Paloma\n                        Tercera Shipping Co SA (The Pegase)[1981] 1 Lloyd’s Rep\n                    175 (“The Pegase”). In that case,\n                    the defendant shipowners failed to deliver chrome sand on time to the plaintiff\n                    receivers. As the plaintiff did not have adequate reserves of chrome sand and\n                    there was a lack of alternative supply, it could not fulfil certain resale\n                    contracts during the period of delay. Consequently, the plaintiff commenced\n                    arbitration proceedings against the defendant claiming damages, among other\n                    things, for the loss of profits that it would have made by reselling the sand.\n                    The arbitrator stated his award in the form of a special case seeking the\n                    English High Court’s opinion on a question of law, the question being\n                    whether, on the facts found, the defendant was liable to the plaintiff for\n                    damages for loss of profits other than by way of interest. Goff J held (at 185)\n                    that there was “no rule of policy excluding or restricting recovery of\n                    damages … assessed with reference to a loss of resale profits, if on the\n                    ordinary principles of law such damages should be awarded”. Going on to\n                    consider whether it was sufficiently within the contemplation of the defendant\n                    that the plaintiff would have an immediate need of the chrome sand for resale,\n                    Goff J found that the arbitrator had not made certain crucial factual findings\n                    on this point and remitted the case to the arbitrator. 51     In the present case, Transocean submits that\n                    its losses under the Drilling Contract were not too remote because: (a)     Burgundy knew that Transocean had\n                        the express right to terminate the Drilling Contract should Burgundy breach\n                        the Escrow Agreement; (b)     further, Burgundy would have known that Transocean would most likely\n                        exercise this right in the event that Burgundy failed to pay an Escrow\n                        Amount, as this was the more commercially sensible option for Transocean to\n                        take; (c)     finally,\n                        it was within the parties’ reasonable contemplation that the\n                        termination of the Drilling Contract would result in a loss of profits for\n                        Transocean. 52     Thus, Transocean contends that its losses fell\n                    within the first limb ofHadley v Baxendale(1854)\n                    9 Exch 341 (“Hadley v Baxendale”),\n                    that is, damages arising naturally according to the usual course of things from\n                    the breach of the contract or such as may reasonably be supposed to have been in\n                    the contemplation of both parties at the time they made the contract. We\n                    disagree. Transocean’s argument was founded on an analysis of cases\n                    falling within the conventional setting where a breach of a contract may give\n                    rise to losses that take the form of the loss of profitable opportunities with\n                    other third parties. But the setting in this case was that the same two parties\n                    to a single transaction had entered into two contracts each dealing with\n                    different aspects of that transaction. Each contract had different terms and\n                    different dispute resolution provisions. The fact that there had been a breach\n                    of one contract did not, without more, give rise to the conclusion that that was\n                    also a breach of the other contract. The fact that Transocean was empowered\n                    under the Escrow Agreement to terminate the Drilling Contract if there was a\n                    breach of the former was consistent with the conclusion that Transocean could\n                    not be compelled to proceed with the Drilling Contract without the security\n                    arrangements contemplated under the Escrow Agreement. However, that was a quite\n                    separate matter from whether the breach of the Escrow Agreement by Burgundy in\n                    and of itself constituted a breach of the Drilling Contract. To put it another\n                    way, it would not have been within Burgundy’s reasonable contemplation\n                    that it could be held liable for Transocean’s loss of profits under theDrilling Contractin a claim founded on breach\n                    of theEscrow Agreement. 53     Mr Toh’s reliance onThe Pegasedid not take his case far because there are important\n                    differences between it and the present case: (a)     First, inThe\n                            Pegase, the defendant’s breach of contractdisabledthe plaintiff from fulfilling its resale\n                        contracts. Here, however, Transoceanchoseto\n                        terminate the Drilling Contract. Thus, to be entitled to recover its loss of\n                        profits under the Drilling Contract, as we have already observed, Transocean\n                        had to first establish that Burgundy’s actions under the Escrow\n                        Agreement amounted to a repudiatory breach of the Drilling Contract as\n                        well. (b)     Second,The Pegasedealt with a tripartite\n                        situation where the plaintiff sought to quantify its losses by reference to\n                        its anticipated profits under resale contracts with third parties, there\n                        being no dispute as to the plaintiff’s legal entitlement under those\n                        resale contracts. In contrast, the situation before us is that the plaintiff\n                        is seeking to quantify its losses for the defendant’s breach by\n                        reference to its anticipated profits under another contractbetween itself and the defendant, where thereisa dispute as to its legal entitlement\n                        under that contract, and both parties had agreed that all such disputes\n                        relating to that contract would be settled by arbitration. Transocean cannot\n                        circumvent the parties’ agreement to arbitrate those disputes by\n                        simply packaging its claim for loss of Drilling Contract profits as a claim\n                        for breach of the Escrow Agreement. 54     Transocean has also argued that the reason for\n                    carving out the Escrow Agreement and placing it under a different dispute\n                    resolution regime was to ensure quicker relief for breaches of the Escrow\n                    Agreement. But it seems to us that the type of time-sensitive disputes that\n                    would require special treatment would include disputes such as whether an Escrow\n                    Amount had been furnished or whether the conditions for releasing an Escrow\n                    Amount had been satisfied. It does not seem at all evident to us that a US$106m\n                    claim for lost profits arising from the termination of the Drilling Contract\n                    should be the subject of an expedited dispute resolution regime. On the\n                    contrary, such a claim seems to provide an excellent example of a dispute\n                    revolving around the Drilling Contract and the parties’ interests\n                    thereunder, and is one that a reasonable person in the parties’ shoes\n                    would have fully expected to go to arbitration.",
        "Has Burgundy waived its right to\n                    arbitration?": "55     During the oral arguments, we asked Mr Toh:\n                    given Transocean’s position that it could recover its loss of profits\n                    under the Drilling Contract in a claim brought for breach of the Escrow\n                    Agreement, what would be the position if Burgundy were to commence an\n                    arbitration under the Drilling Contract seeking a declaration that it had not\n                    breached that contract and therefore that the losses claimed by Transocean are\n                    not recoverable under the Drilling Contract? Mr Toh conceded that on the face of\n                    it, if Burgundy were to invoke the arbitration mechanism under the Drilling\n                    Contract, then his position might appear to be “unsustainable”;\n                    but he then argued that by engaging Transocean in the assessment process and\n                    taking out numerous adjournment applications to allow itself to do so, Burgundy\n                    must be taken to have waived its right to arbitration. 56     This did not appear to us to be an argument\n                    that rested on principle. Much as we sympathise with Transocean’s plight\n                    in having to restart proceedings having come this far, the waiver argument in\n                    our judgment has no merit. To establish a waiver by one party of certain\n                    contractual rights, there must be an unequivocal representation from that party,\n                    whether by words or conduct, that it is forgoing those rights: Sean Wilken &\n                    Karim Ghaly,The Law of Waiver, Variation and\n                        Estoppel(Oxford University Press, 3rd Ed, 2012) at para 4.45. No\n                    such representation can be found here: Burgundy had maintained from the very\n                    beginning that the dispute was subject to arbitration, and had promptly applied\n                    for a stay of proceedings. After its application was rejected by Ang J (on the\n                    premise that Transocean was suing for a breach of the Escrow Agreement),\n                    Burgundy had continued to contest Transocean’s damages claim on the basis\n                    that this was a claim relating to the Drilling Contract and must be referred to\n                    arbitration. Therefore, there was not only no waiver on Burgundy’s part\n                    but a consistent insistence on its right to arbitration. 57     Mr Toh pointed out that it had been open to\n                    Burgundy to institute arbitration proceedings at any time to determine the\n                    issues that it said were subject to arbitration. While this may be true, we fail\n                    to see why or how it became incumbent on Burgundy to commence arbitration. As\n                    the party making the claim, it wasTransoceanthat\n                    had the duty of ensuring that it made its claims in the proper forum using the\n                    proper procedure. As the defendant, Burgundy was entitled to argue that certain\n                    heads of damages could only be claimed in arbitration without having to commence\n                    arbitration itself. 58     For these reasons, we hold that in these\n                    proceedings, Transocean cannot claim the losses that it claims to have suffered\n                    from the termination of the Drilling Contract. Transocean’s claim for\n                    damages is therefore limited to its alternative claim for wasted costs and\n                    expenses in the sum of US$55,001.46 (see [12(d)] above), insofar as these were\n                    the costs that were incurred in entering into the Escrow Agreement. As this sum\n                    was not contested by Burgundy during the assessment hearing, we allow\n                    Transocean’s claim for this sum.",
        "The Extraterritorial Jurisdiction Issue": "59     We now turn to the issue of whether the courts\n                    of Singapore have the power to make EJD orders against foreign\n                officers. 60     The court’s power to make EJD orders\n                    against company officers derives from O 48 r 1 of the ROC, which provides as\n                    follows: 1.Order for\n                            examination of judgment debtor (O. 48, r.\n                        1) (1)    Where a person has obtained a judgment or order\n                            for the payment by some other person (referred to in this Order as the\n                            judgment debtor) of money, the Court may, on an application made by ex\n                            parte summons supported by affidavit in Form 99 by the person entitled\n                            to enforce the judgment or order, order the judgment debtor,or, if the judgment debtor is a body corporate, an officer\n                                thereof, to attend before the Registrar, and be orally\n                            examined on whatever property the judgment debtor has and wheresoever\n                            situated, and the Court may also order the judgment debtor or officer to\n                            produce any books or documents in the possession of the judgment debtor\n                            relevant to the questions aforesaid at the time and place appointed for\n                            the examination. (2)    An order under this Rule must be in Form 100 and\n                            must be served personally on the judgment debtor and on any officer of a\n                            body corporate ordered to attend for examination. (3)    Any difficulty arising in the course of an\n                            examination under this Rule before the Registrar, including any dispute\n                            with respect to the obligation of the person being examined to answer\n                            any question put to him, may be referred to the Court and the Court may\n                            determine it or give such directions for determining it as it thinks\n                            fit. [emphasis added] 61     There is nothing in the language of O 48 r 1\n                    that bars the court from issuing EJD orders against company officers who are\n                    ordinarily resident overseas. But the Directors submit that there is a\n                    presumption against extraterritoriality in statutory interpretation:JIO Minerals FZC and others v Mineral Enterprises Ltd[2011] 1 SLR 391 at [102]. Although the phrase “an officer\n                    thereof” in O 48 r 1 is on the face of it wide enough to include a\n                    foreign officer, the Directors say that it should nonetheless be confined to\n                    company officers who are resident in Singapore because of concerns relating to\n                    enforcement and international comity. In this regard, the Directors rely heavily\n                    onMasri, where the House of Lords held that r\n                    71.2 of the CPR – which is the English counterpart to our O 48 r 1 –\n                    does not permit an English court to issue an EJD order against a foreign\n                    officer. 62     We turn to considerMasriand a number of other English authorities that have\n                    grappled with the issue of whether certain procedural rules should be accorded\n                    extraterritorial force. The English authorities (1)Mackinnon 63     InMackinnon v Donaldson,\n                        Lufkin and Jenrette Securities Corporation and others[1986] Ch\n                    482 (“Mackinnon”), the plaintiff\n                    alleged that he had been swindled by two individuals, who had promised to\n                    procure a US$360m property loan for him upon payment of an advance fee of\n                    US$250,000 into the Citibank (New York) account of IAS, a Bahamian company.\n                    Although IAS was named as a defendant, it had ceased to exist by the time of\n                    litigation, rendering it impossible to obtain from it through discovery,\n                    documents relating to its Citibank account. Thus, the plaintiff sought and\n                    obtained an order against Citibank’s London office under s 7 of the\n                    Bankers’ Books Evidence Act 1879 (c 11) (UK), which provided as\n                    follows: On the application of any party to a legal proceeding a court or judge may\n                        order that such party be at liberty to inspect and take copies of any\n                        entries in a banker’s book for any of the purposes of such\n                        proceedings. An order under this section may be made either with or without\n                        summoning the bank or any other party … The order required Citibank to produce documents held at its\n                        head office in New York relating to IAS’s account. The plaintiff also\n                        caused a subpoena to be issued against Citibank for the same\n                    purpose. 64     Hoffmann J granted Citibank’s motion to\n                    discharge the order and the subpoena. He began with the general observation that\n                    a state should refrain from demanding obedience to its sovereign authority by\n                    foreign non-parties in respect of their conduct outside of the jurisdiction save\n                    in exceptional circumstances (at 493G). But he was especially persuaded by\n                    considerations specific tobanks(at\n                    496C–E): International law generally recognises the right of a state to regulate\n                        the conduct of its own nationals even outside its jurisdiction, provided\n                        that this does not involve disobedience to the local law. But banks, as I\n                        have already said, are in a special position.The nature\n                            of banking business is such that if an English court invokes its\n                            jurisdiction even over an English bank in respect of an account at a\n                            branch abroad, there is a strong likelihood of conflict with the\n                            bank’s duties to its customer under the local law. It\n                        is therefore not surprising that any bank, whether English or foreign,\n                        should as a general rule be entitled to the protection of an order of the\n                        foreign court before it is required to disclose documents kept at a branch\n                        or head office abroad. [emphasis added] On the facts, he found that there were no exceptional\n                        circumstances justifying the order against Citibank as the plaintiff could\n                        instead apply to the New York courts for the documents (at\n                        499A–500C). (2)Re Tucker 65     InIn re Tucker (RC) (A\n                        Bankrupt), Ex p Tucker (KR)[1990] Ch 148 (“Re Tucker”), the issue was whether s 25(1) of the\n                    Bankruptcy Act 1914 (c 59) (UK) allowed the bankruptcy court to summon\n                    before it the brother of a bankrupt, who was a British citizen resident in\n                    Belgium, to give information about the bankrupt’s affairs. Section 25(1)\n                    stated as follows (at 152H–153B): The court may, on the application of the official receiver or trustee\n                        … summon … any person known or suspected to have in his\n                        possession any of the estate or effects belonging to the debtor, or supposed\n                        to be indebted to the debtor, or any person whom the court may deem capable\n                        of giving information respecting the debtor, his dealings or property, and\n                        the court may require any such person to produce any documents in his\n                        custody or power relating to the debtor, his dealings or property. The Court of Appeal held that it did not. Dillon LJ, with whom\n                        the other two judges agreed, reasoned that “the general practice in\n                        international law” is that the courts of a country only have power to\n                        summon before them persons who accept service or are present within the\n                        territory of that country when served with the appropriate process (at\n                        158D–E). 66     Dillon LJ found support for his conclusion in\n                    two telling features of the Bankruptcy Act 1914. First, s 122 provided for an\n                    alternative procedure which could be used to secure the examination of persons\n                    resident in Scotland or Ireland before the bankruptcy courts of those countries\n                    or within the jurisdiction of other British courts (at 154A–C): 122. The High Court, the county courts, the courts having jurisdiction in\n                        bankruptcy in Scotland and Ireland, and every British court elsewhere having\n                        jurisdiction in bankruptcy or insolvency, and the officers of those courts\n                        respectively, shall severally act in aid of and be auxiliary to each other\n                        in all matters of bankruptcy, and an order of the court seeking aid, with a\n                        request to another of the said courts, shall be deemed sufficient to enable\n                        the latter court to exercise, in regard to the matters directed by the\n                        order, such jurisdiction as either the court which made the request, or the\n                        court to which the request is made, could exercise in regard to similar\n                        matters within their respective jurisdictions. 67     Second, s 25(6) provided as follows (at\n                    153E): The court may, if it thinks fit, order that any personwho if in England would be liable to be brought before it under this\n                            sectionshall be examined in Scotland or Ireland, or in any\n                        other place out of England. [emphasis added] Dillion LJ considered this wording to be conclusive of his\n                        decision, because it clearly implied that if a person is not in England he\n                        isnotliable to be brought before the English\n                        court under s 25 (at 158H). (3)Re Seagull 68     InIn re Seagull\n                        Manufacturing Co Ltd[1993] Ch 345 (“Re\n                        Seagull”), the Court of Appeal had to consider whether s\n                    133 of the Insolvency Act 1986 (c 45) (UK) had extraterritorial effect. Section\n                    133(1) stated as follows: Public examination of officers. (1) Where a\n                        company is being wound up by the court, the official receiver or, in\n                        Scotland, the liquidator may at any time before the dissolution of the\n                        company apply to the court for the public examination of any person who -\n                        (a) is or has been an officer of the company; or (b) has acted as liquidator\n                        or administrator of the company or as receiver or manager … or (c)\n                        not being a person falling within paragraph (a) or (b), is or has been\n                        concerned, or has taken part, in the promotion, formation or management of\n                        the company. 69     It was held that this section allowed the\n                    court to make an order for public examination against a British director who was\n                    resident abroad. In deciding this issue, the court was persuaded by the fact\n                    that the policy underlying the statute would be frustrated if it did not extend\n                    to directors resident overseas. Peter Gibson J noted (at\n                    354F–355B): Where a company has come to a calamitous end and has been wound up by the\n                        court,the obvious intention of this section was that\n                            those responsible for the company’s state of affairs should be\n                            liable to be subjected to a process of investigation and that\n                            investigation should be in public. Parliament could not have intended\n                            that a person who had that responsibility could escape liability to\n                            investigation simply by not being within the jurisdiction.\n                        Indeed, if the section were to be construed as leaving out of its grasp\n                        anyone not within the jurisdiction, deliberate evasion by removing oneself\n                        out of the jurisdiction would suffice. That seems to me to be a wholly\n                        improbable intention to attribute to Parliament. … There is no\n                        requirement that an officer of an English company must live in England, nor\n                        of course need an officer of an overseas company which may be wound up by\n                        the court. Such a company is very likely to have officers not within the\n                        jurisdiction. [emphasis added] 70     He went on to distinguishRe Tuckeron the following grounds (at 358A–D), among\n                    others: (a)     s 133 of the Insolvency Act 1986 was\n                        much narrower in scope than s 25 of the Bankruptcy Act 1914 – the\n                        former targeted individuals responsible in some way for the management of\n                        insolvent companies, while the latter encompassed anyone whom the court\n                        suspected might have relevant property or information;\n                    and (b)     the Insolvency\n                        Act 1986 did not contain a provision similar to s 25(6) of the Bankruptcy\n                        Act 1914 which the court inRe Tuckerconsidered so conclusive. (4)Masri 71     We turn to the important decision inMasri.There, the judgment creditor was owed a debt of\n                    US$64m by two judgment debtors, both Lebanese companies. The judgment debtors\n                    were found to have “manifested their intention to avoid payment of this\n                    judgment debt at all costs” (at [5]), and the issue arose as to whether r\n                    71.2 CPR allowed the English courts to issue an EJD order against the chairman,\n                    general manager and director of the first judgment debtor, one Mr Khoury, who\n                    was ordinarily resident in Greece. We set out r 71.2 in full below: Order to attend\n                        court 71.2 (1)    A judgment creditor\n                            may apply for an order requiring – (a)    a judgment debtor; or (b)if a judgment debtor is a\n                                    company or other corporation, an officer of that\n                                body, to attend court to provide information about – (i)    the judgment debtor’s means;\n                            or (ii)   any other matter about which information is\n                                needed to enforce a judgment or order. (2)    An application\n                            under paragraph (1) – (a)    may be made\n                                without notice; and (b)    must\n                                be issued in the court which made the judgment or order which it is\n                                sought to enforce, except that – (i)    if the proceedings have since been\n                                    transferred to a different court, it must be issued in that\n                                    court; or (ii)   subject to subparagraph (b)(i), if it is\n                                    to enforce a judgment made in Northampton County Court in\n                                    respect of a designated money claim, it must be issued in\n                                    accordance with section 2 of Practice Direction\n                                70. (3)    The application\n                            notice must – (a)    be in the form; and (b)    contain the information required by Practice Direction 71. (4)    An application\n                            under paragraph (1) may be dealt with by a court officer without a\n                            hearing. (5)    If the application\n                            notice complies with paragraph (3), an order to attend court will be\n                            issued in the terms of paragraph\n                            (6). (6)    A person served with an\n                            order issued under this rule must – (a)    attend court at the time and place specified\n                                in the order; (b)    when he does so, produce at court documents in\n                                his control which are described in the order; and (c)    answer on oath such questions as the court may\n                                require. (7)    An order under this rule will contain a notice in\n                            the following terms, or in terms to substantially the same effect\n                            – “If you the within-named [ ] do not comply with this order you may\n                        be held to be in contempt of court and imprisoned or fined, or your assets\n                        may be seized.” [emphasis added] 72     Reversing the decision of the Court of Appeal,\n                    the House of Lords unanimously held that r 71.2 didnotconfer a power to order examination of a foreign officer.\n                    Lord Mance reasoned that: (a)     there is a presumption against\n                        extraterritoriality which applies to r 71.2 (at [17]); (b)     although a corporate judgment debtor\n                        is already subject to the court’s jurisdiction, a foreign officer of\n                        that company has a separate legal personality from the company (at\n                        [17]); (c)     impracticality of enforcement is a relevant factor in considering whether r\n                        71.2 covers officers who are abroad (at [22]); (d)     the public interest in examining the officers of\n                        a company being wound up, which was cited as a justification for the\n                        decision inRe Seagull, is absent in private\n                        civil litigation (at [23]); (e)     the public interest in obtaining evidence for trial is at\n                        least as important as the public interest in enforcing a judgment, yet\n                        parties have no right to summon witnesses from abroad for that purpose (at\n                        [23]); (f)     the\n                        court’s power to examine company officers under r 71.2 is derived\n                        from an amendment to the English Rules of the Supreme Court in 1883, and the\n                        Rules Committee in 1883 was likely to have been focusing on domestic\n                        judgments and domestically based officers (at [24]); (g)     the extreme informality of the process\n                        prescribed by r 71.2 –under which an application for an EJD order\n                        may be made without notice, dealt with ministerially by a court officer, and\n                        issued automatically – points to a domestic focus (at [24]);\n                        and (h)     relatively\n                        few company officers are likely to flee the country in order to avoid giving\n                        information about their company’s affairs (at\n                [25]). (5)Perry 73     SinceMasri,\n                    there have been other English decisions dealing with the issue of\n                    extraterritorial jurisdiction. InSerious Organised Crime\n                        Agency v Perry and others (Nos 1 and 2)[2013] 1 AC 182\n                        (“Perry”), P was convicted in\n                    Israel of a number of fraud offences. The Serious Organised Crime Agency\n                    obtained a disclosure order under s 357 of the Proceeds of Crime Act 2002 (c 29)\n                    (UK) against P, his wife and his two daughters, none of whom was resident or\n                    domiciled in the jurisdiction. The relevant portions of s 357 provided as\n                    follows: (4)    A disclosure order\n                            is an order authorising an appropriate officer to give toany person the appropriate officer considers has relevant\n                                informationnotice in writing requiring him to do, with\n                            respect to any matter relevant to the investigation for the purposes of\n                            which the order is sought, any or all of the following\n                        — (a)    answer questions, either at a time specified\n                                in the notice or at once, at a place so specified; (b)    provide information specified in the notice,\n                                by a time and in a manner so specified; (c)    produce documents, or documents of a\n                                description, specified in the notice, either at or by a time so\n                                specified or at once, and in a manner so specified. (5)    Relevant information is information (whether or\n                            not contained in a document) which the appropriate officer concerned\n                            considers to be relevant to the investigation. [emphasis added] 74     Section 359(1) further provided that a person\n                    commits an offence if without reasonable excuse he fails to comply with a\n                    requirement imposed on him under a disclosure order. 75     Upon an application to set aside the\n                    information notices, a nine-member panel of the UK Supreme Court unanimously\n                    held that s 357 could not be invoked against persons out of jurisdiction\n                    (although they differed on another issue which is not pertinent here). Lord\n                    Phillips of Worth Matravers PSC explained the court’s decision as follows\n                    (at [94]): The point is a very short one. No authority is required under English law\n                        for a person to request information from another person anywhere in the\n                        world. But section 357 authorises orders for requests for information with\n                        which the recipient is obliged to comply, subject to penal sanction.Subject to limited exceptions, it is contrary to\n                            international law for country A to purport to make criminal conduct in\n                            country B committed by persons who are not citizens of country\n                            A. Section 357, read with section 359, does not simply make\n                        proscribed conduct a criminal offence. It confers on a United Kingdom public\n                        authority the power to impose on persons positive obligations to provide\n                        information subject to criminal sanction in the event of non-compliance.To confer such authority in respect of persons\n                            outside the jurisdiction would be a particularly startling breach of\n                            international law. For this reason alone I consider it\n                        implicit that the authority given under section 357 can only be exercised in\n                        respect of persons who are within the jurisdiction. [emphasis added] (6)Dar Al Arkan 76     InDar Al Arkan Real Estate\n                        Development Co and another v Majid Al-Sayed Bader Hashim Al Refai and\n                        others[2013] EWHC 4112 (QB) (“Dar Al\n                        Arkan”), an issue arose as to whether r 81.4(3) of the CPR\n                    allowed the court to issue committal orders against non-resident directors or\n                    officers of a company in contempt of court. Rule 81.4 (which is the equivalent\n                    of our O 45 r 5) provided that: (1)    If a person\n                            – (a)    required by a judgment or order to do an act\n                                does not do it within the time fixed by the judgment or order;\n                                or (b)    disobeys and judgment or order not to do an\n                                act, then … the judgment or order may be enforced by an order for\n                        committal. … (3)    If the person referred to in paragraph (1) is a\n                            company or other corporation, the committal order may be made against\n                            any director or other officer of that company or corporation\n                        ... 77     Andrew Smith J held that committal orderscouldbe issued against company officers\n                    resident abroad. He reasoned that without such a power, the court’s\n                    ability to deal with contempt of its orders by companies with foreign directors\n                    and officers would be much reduced, and the efficacy of many worldwide freezing\n                    orders and anti-suit injunctions would be compromised (at [24]).Masriwas distinguished on the basis that contempt\n                    proceedings engage a public interest that is more specific and goes beyond the\n                    public interest in enforcing a private civil judgment (at [34]). Analysis 78     It is evident from the foregoing discussion\n                    that the English cases do not appear to speak with one voice. Of the six cases\n                    that we have considered, the English courts had declined to read a provision as\n                    having extraterritorial reach in four of them –Mackinnon,Re\n                    Tucker,MasriandPerry. PuttingMasriaside, one\n                    key characteristic that cuts across the other three decisions is that they all\n                    dealt with provisions that allowed the court to summon individuals unrelated to\n                    the parties to the suit on the sole basis that they possessed relevant\n                    information. It is understandable why the courts applied the presumption against\n                    extraterritoriality strictly in those cases. But it might be useful to delve a\n                    little into the significance of that presumption in the specific context of\n                    jurisdiction. 79     Jurisdiction is not a monolithic concept. InMackinnon, Hoffmann J placed some\n                    reliance on a distinction between personal and subject-matter jurisdiction (at\n                    493C–F), tracing this to F A Mann’s seminal article, “The\n                    Doctrine of Jurisdiction in International Law” inStudies in International Law(Oxford University Press, 1973) ch\n                    1 at pp 128–129, where it was stated as follows: … The mere fact that a State’s judicial or administrative\n                        agencies are internationally entitled to subject a person to their personal\n                        or ‘curial’ jurisdiction, does not by any means permit them to\n                        regulate by their orders such person’s conduct abroad. This they may\n                        do only if the State of the forum also has substantive jurisdiction to\n                        regulate conduct in the manner defined in the order. In other words, for the\n                        purpose of justifying, even in the territory of the forum, the international\n                        validity of an order, not only its making, but also its content must be\n                        authorized by substantive rules of legislative jurisdiction. … 80     Hoffmann J restated the distinction as\n                    follows: personal jurisdiction refers to the question of whether a person is\n                    amenable to the jurisdiction of the court in the sense that he is or can be\n                    brought before it. This would typically be the case where the person is situated\n                    within the forum. Subject-matter jurisdiction (or what Dr Mann referred to as\n                    “substantive jurisdiction”) on the other hand refers to what a\n                    court is permitted to do in terms of regulating the conduct in another country\n                    of someone over whom it has personal jurisdiction. This was how Hoffmann J put\n                    it when rejecting the argument that because the bank targeted by the order\n                    (Citibank in that case) was present within the jurisdiction of the court through\n                    a branch located in England, an order could be made requiring it to produce\n                    documents that were situated in another country (namely, the United States) (at\n                    493C): I think that this argument confuses personal jurisdiction, i.e., who can\n                        be brought before the court, with subject matter jurisdiction, i.e., to what\n                        extent the court can claim to regulate the conduct of those persons. It does\n                        not follow from the fact that a person is within the jurisdiction and liable\n                        to be served with process that there is no territorial limit to the matters\n                        upon which the court may properly apply its own rules or the things which it\n                        can order such a person to do. … 81     Hoffmann J held that he was not entitled on\n                    the facts before him to order Citibank to produce documents which were located\n                    elsewhere and concerned business transacted there. To do otherwise would entail\n                    an English court demanding that a foreign national be subject to its orders in\n                    respect of what it does in another country. Hoffmann J considered the true\n                    principle to be that “a state should refrain from demanding obedience to\n                    its sovereign authority by foreigners in respect of their conduct outside the\n                    jurisdiction” (at 493G–H), though it does not appear from the\n                    judgment that he thought this was an absolute bar; rather he seems to have seen\n                    it as a presumptive restraint that is imposed by a court upon itself which might\n                    be capable of being displaced in the appropriate circumstances. Seen in this\n                    light, the question of subject-matter or substantive jurisdiction is concerned\n                    with giving effect to the presumption against extra-territoriality (we\n                    henceforth use the term “substantive jurisdiction” to refer to\n                    this concept). 82     Where an EJD order is sought against a foreign\n                    officer of a company, whether local or foreign, against whom a judgment has been\n                    issued, the anterior question presents the opposite dilemma – the court\n                    has the power to require the provision of information relating to the judgment\n                    debtor’s property wherever situated, but does not have personal\n                    jurisdiction over the foreign officer in question. Whether the courtshouldexercise personal jurisdiction over the foreign\n                    officer is the issue, but in coming to a decision on this it seems inevitable\n                    that it should also have regard to whether this is merely the prelude to the\n                    impermissible exercise of exorbitant substantive jurisdiction. 83     The dichotomy between personal and substantive\n                    jurisdiction appears to have been alluded to again inMasri, though perhaps in somewhat less explicit terms. We think\n                    that Lord Mance was in fact considering the question of whether, and if so in\n                    what circumstances, the English courts had the substantive jurisdiction to make\n                    EJD orders against corporate officers resident abroad; and if they did have it,\n                    whether they would exercise it. This is suggested by the following remarks at\n                    [18]–[19]: 18    In Mr Rabinowitz’s submission the key to the\n                            scope of CPR Pt 71 lies in a recognition of the English court’sjurisdiction over the subject matter of the\n                                action(including the judgment) against CCIC and the\n                            close connection between that subject matter and Mr Khoury, who was\n                            CCIC’s chairman, general manager and director. InThe Ikarian Reefer (No 2)[2000] 1 WLR\n                            603 it was the existence of substantive proceedings over which the\n                            court had jurisdiction and of “a substantial connection with\n                            those proceedings by a non-party” that Waller LJ stressed in his\n                            judgment as the key to understanding the circumstances in which orders\n                            for costs would be made against such a non-party: pp 611b–612b. Mr Rabinowitz took this as a useful analogy and found\n                            direct support for his submission in Professor Brownlie’s\n                            identification inPrinciples of Public\n                                International Law, 7th ed (2008), p 311 of one criterion\n                            of jurisdiction as “a substantial and bona fide connection\n                            between the subject matter and the source of the jurisdiction”\n                            (to which however Professor Brownlie added, at p 312, that “the\n                            principle of non-intervention in the domestic or territorial\n                            jurisdiction of other states should be observed”). Mr Rabinowitz\n                            also relied on the statement by Sir Robert Jennings and Sir Arthur Watts\n                                inOppenheim’s International\n                                Law, 9th ed (1992) vol 1, pp 457–458 that there\n                            must be “a sufficiently close connection to justify th[e] state\n                            in regulating the matter and perhaps also to override any competing\n                            rights of other states”. 19I accept that the existence of a\n                                close connection between a subject matter over which this country\n                                and its courts have jurisdiction and another person or subject over\n                                which it is suggested that they have taken jurisdiction will be\n                                relevant in determining whether the further jurisdiction has been\n                                taken.It will be a factor in construing, or ascertaining\n                            the grasp and intendment of, the relevant legislation or\n                        rule. [emphasis added] 84     In contrast, in bothRe\n                        SeagullandDar Al Akanthe courts\n                    held that they could make orders affecting parties abroad.Re\n                        Seagullwas decided on the basis that it would frustrate the\n                    policy of the insolvency legislation if those who were running the company at\n                    and perhaps to its “calamitous end” could put themselves beyond\n                    the reach of the courts and of the investigative processes contemplated by the\n                    legislation by leaving the jurisdiction. Peter Gibson J distinguishedRe Tuckeron the basis of differences between the\n                    applicable statutes in the two cases. But a focus on the distinction between\n                    personal and substantive jurisdiction might have presented an alternative\n                    solution. InRe Seagull, the director in question\n                    was a British citizen and it is less obvious that the concern that had been\n                    articulated by Hoffmann J inMackinnonover the\n                    court finding substantive jurisdiction in such a case would have been\n                    implicated, since the interest of a state in regulating the conduct ofits own nationalseven abroad might be more readily\n                    recognised. 85     As forDar Al\n                        Arkan, the litigant there was a foreign company which was\n                    required by the order of the court to do certain things, and the question was\n                    whether this should be extended by permitting a committal order to be made\n                    against the non-resident officers of the company. Having established that the\n                    corporate litigant was properly before the court, there can be no basis for\n                    suggesting thatitwas not then amenable to the\n                    substantive jurisdiction of the court when it came to enforcement of the\n                    court’s order. The court was undoubtedly competent to make the orders for\n                    enforcement – whether these could be carried into effect elsewhere would\n                    depend on the state of the law in that jurisdiction as well as on provisions\n                    that might have been in place for reciprocal enforcement. 86     It is true that the extension to the directors\n                    and officers of the corporate litigant took the matter a step further. But\n                    companies can only act through individuals, and the only way a court can exert\n                    control over companies would be to issue orders – whether directly or\n                    indirectly ­– against those individuals who act on its\n                    behalf and who are able to effect the corporate litigant’s compliance with\n                    the orders of the court. If a court was not able to issue orders against such\n                    foreign officers, then they would not have the means to control foreign\n                    companies which are legitimately within its personal and substantive\n                    jurisdiction. This would be a surprising result and one we are unwilling to\n                    reach. 87     We of course recognise the force of Lord\n                    Mance’s concerns regarding the imposition of extraterritorial jurisdiction\n                    on company officers who are not parties to the proceedings. But his concerns\n                    must be understood in the context of the English equivalents to O 11 (rr 6.30(2)\n                    and 6.20(9) of the CPR), which do not allow EJD orders to beservedout of jurisdiction. This lack of personal jurisdiction\n                    fortified his conclusion that Pt 71 of the CPR did not confer the requisite\n                    substantive jurisdiction on the court to regulate the conduct of foreign\n                    officers (at [37]). The civil procedure rules in Singapore are different, and on\n                    the basis that the power exists to issue an EJD order out of the jurisdiction\n                    against the director or officer of a corporate litigant, Lord Mance’s\n                    concerns can be addressed by the court when it comes to consider whether it willexerciseits power and permit a party to\n                    proceed against the foreign directors or officers of a corporate litigant. This\n                    is a matter that arises at the leave stage (which we address below at\n                    [110]–[115]). 88     Against those observations we return to the\n                    issue of how O 48 r 1 should be interpreted. We first observe that therearekey differences between r 71.2 of the CPR\n                    and O 48 r 1 of the ROC. The “extreme informality” in r 71.2\n                    that troubled Lord Mance is not present in O 48 r 1: (a)     While r 71.2(4) expressly allows an\n                        application for an EJD order to be dealt with without a hearing, an EJD\n                        application under O 48 r 1 requires anex\n                            partehearing. (b)     While r 71.2(5) mandates that an EJD orderwillbe issued if the procedural requirements are\n                        satisfied, O 48 r 1 gives our courts the discretionnotto issue an EJD order. 89     These differences alone would give us reason\n                    to pause before applying the holding inMasrito O\n                    48 r 1. In addition, however, we find ourselves respectfully unable to agree\n                    with some aspects of the decision inMasri. 90     First, the Directors argue that since O 48 r 1\n                    of our ROC and r 71.2 of the English CPR share a common ancestry, Lord\n                    Mance’s observations regarding the likely domestic focus of the Rules\n                    Committee in 1883 (see [72(f)] above) apply with equal force to O 48 r 1. But\n                    the fact that the rule-maker did not consider whether a rule would apply in a\n                    particular situation (even though the language of the rule might be wide enough\n                    to cover that situation) does not, without more, supply a basis for excluding it\n                    from the ambit of the rule. Instead, under s 9A of the Interpretation Act\n                    (Cap 1, 2002 Rev Ed), the proper approach is to consider the object of the\n                    rule and then decide whether its object would be promoted if it were interpreted\n                    to cover the situation at hand. Here, there is no serious doubt that the\n                    underlying purpose of O 48 r 1, which is to enable judgment creditors to obtain\n                    information about a corporate judgment debtor’s finances, would be served\n                    by extending it to foreign officers. The real question is whether we should\n                    nonetheless impose limits on its application and if so, how we should do\n                    that. 91     Second, we do not think that the public\n                    interest analysis used inMasriprovides a\n                    sustainable basis for deciding which laws should be interpreted as having\n                    extraterritorial effect, and which not. To begin with, there is no inherent\n                    reason why extraterritorial jurisdiction would be more readily conferred by a\n                    written law when public interests, as opposed to private interests, are at\n                    stake. After all, virtually all penal statutes may be said to implicate public\n                    interests, yet the presumption against extraterritoriality applies with\n                    particular force to criminal law. Furthermore, no justification was given inMasrias to why the public interest in\n                    ensuring that the court’s judgments do not go unsatisfied is any less\n                    compelling than the public interest in ensuring the orderly winding up of a\n                    company. After all, the main purpose of both winding up proceedings and EJD\n                    proceedings is to benefit the company’s creditors. Hence, the mere fact\n                    that one set of proceedings might be described as “public”, and\n                    the other “private”, does not provide a principled basis for\n                    distinguishing between the two. Lord Mance himself seemed to appreciate the\n                    slippery nature of the public/private distinction when he granted that “a\n                    fair and efficient legal system is of course a cornerstone of the rule of law,\n                    and … there is a public interest in a court getting to the bottom of\n                    litigation and ensuring that parties have the means of obtaining full\n                    information to enable it to do so” (at [23]). 92     Third, as we have noted, the holding inMasrithat r 71.2 did not apply to foreign\n                    officers was fortified by the court’s view that English civil procedure\n                    did not allow an EJD order to be served on a company officer out of\n                    jurisdiction. But as we will explain shortly, this is not the position under\n                    Singapore law – in our judgment, an EJD order may be served out of\n                    jurisdiction on a foreign officer with the leave of the court (see\n                    [95]–[109] below). Thus, any concerns relating to the imposition of\n                    extraterritorial jurisdiction on a foreign officer can be considered and\n                    addressed at the stage where leave is sought to serve an EJD order\n                    abroad. 93     Indeed, in our judgment,serviceis the crucial act that engages the court’s\n                    jurisdiction over a foreign person. As a matter of Singapore law, personal\n                    jurisdiction may be found when the putative defendant is physically within the\n                    jurisdiction at the time the writ is served on him (see s 16(1) of the Supreme\n                    Court of Judicature Act (Cap 322, 2007 Rev Ed)) or when the requirements\n                    stipulated in O 11 of the ROC have been met and leave has been given for a writ\n                    to be served on a defendant not physically within the confines of Singapore.\n                    Further, as Lord Diplock said inAmin Rasheed Corporation v\n                        Kuwait Insurance Co[1984] 1 AC 50 (at 65–66): My Lords,the jurisdiction exercised by an English\n                            court over a foreign corporation which has no place of business in this\n                            country,as a result of granting leave\n                            under R.S.C., Ord. 11, r. 1 (1) (f) for service out of the jurisdictionof a writ on that corporation, is an\n                            exorbitant jurisdiction, i.e., it is one which, under general\n                        English conflict rules, an English court would not recognise as possessed by\n                        any foreign court in the absence of some treaty providing for such\n                        recognition. Comity thus dictates that the judicial discretion to grant\n                        leave under this paragraph of R.S.C., Ord. 11, r. 1 (1) should be exercised\n                        with circumspection in cases where there exists an alternative forum\n                        … [emphasis added in italics and bold italics] 94     To hold that there is an absolute prohibition\n                    on the issuance of EJD orders against foreign officers would go too far because\n                    it is entirely conceivable for such an order to be served within the\n                    jurisdiction when the officer comes to Singapore for a temporary visit. Even an\n                    originating process may be validly served in this manner (HRH\n                        Maharanee Seethaderi Gaekwar of Baroda v Wildenstein[1972] 2 QB\n                    283 at 292). But whether the EJD Order may be servedout of\n                        jurisdictionis an entirely separate matter, and it is at that\n                    stage that the court may weigh the competing considerations. We have also\n                    alluded to our views on the question of leave and to that issue we now\n                    turn.",
        "The Leave Issue": "Is leave required to serve an EJD order out of\n                jurisdiction? 95     The rule governing the service of summons,\n                    notices and orders out of jurisdiction is O 11 r 8(1), which states: Subject to Order 69, Rule 10, service out of Singapore of any summons,\n                        notice or order issued, given or made in any proceedings is permissible only\n                        with the leave of the Courtbut leave shall not be\n                            required in any proceedings in which leave for service of the\n                            originating process has already been granted. [emphasis\n                        added] Invoking this rule, Transocean submits that there is no need\n                        to obtain leave to serve the EJD Orders out of the jurisdiction since leave\n                        to serve the writ of summons out of jurisdiction had already been\n                        granted. 96     The Directors, on the other hand, submit that\n                    O 11 r 8(1) does not apply where an order is sought to be served out of\n                    jurisdiction on a foreign individual who isnota\n                    party to the proceedings. In support of this proposition, they rely on the\n                    decision of the English High Court inVitol, which\n                    dealt with whether leave may be granted to serve an EJD order out of\n                    jurisdiction under r 6.30(2) of the CPR. Rule 6.30(2) (which has since been\n                    amended and is now found in r 6.38(1)) provided as follows: Unless paragraph (3) applies, where the permission of the court is\n                        required for a claim form served out of the jurisdiction the permission of\n                        the court must also be obtained for service out of the jurisdiction of any\n                        other document to be served in the proceedings. 97     We pause to make the observation that unlike\n                    the holding inVitol, which was subsequently\n                    applied inMasri, we have already held that leave\n                    to serve an EJD order out of jurisdiction may be granted under our ROC; but the\n                    discussion is helpful for the focus it brings to the question of whether and in\n                    what circumstances it may be permissible to ignore the distinction in the\n                    personalities of the company and its officers. InVitol, in coming to his conclusion that the court had no\n                    jurisdiction to grant the leave requested, Tomlinson J reasoned as\n                    follows: 9.    … I do not consider that CPR 6.30(2)\n                            provides the court with machinery pursuant to which it may permit\n                            service out of the jurisdiction of an order made under CPR 71.2(1)(b).\n                            …That provision is I think concerned with documents\n                                which require to be served on parties to the proceedings.Furthermore, as Aikens J pointed out inC. Inc. plc\n                                v. L.[2001] 2 All ER (Comm) 446, CPR 6.30(2) itself\n                            requires the identification of a ground within CPR 6.20 which gives the\n                            court power to grant permission to serve out of the jurisdiction the\n                            document service of which is sought to be effected\n                        … 10.    That being so, the question arises on what basis\n                            the court can assume an exorbitant jurisdiction to permit service of\n                            such an order out of the jurisdiction? The closest analogy is a witness\n                            summons issued under CPR 34.2, which, in the language of that rule,\n                            “is a document issued by the court requiring a witness to (a)\n                            attend court to give evidence or (b) produce documents to the\n                            court.” It is axiomatic that a party cannot compel a witness in a\n                            foreign country to attend a trial in England and Wales\n                        … … 17.    Both Hirst LJ and Peter Gibson J in [Re Seagull] emphasised that what the court was\n                            there concerned with was ascertaining who came within the legislative\n                            grasp or intendment of the section. The efficient and thorough conduct\n                            of an investigation into the affairs of a failed company pointed to an\n                            overriding public interest. No such public interest is engaged where\n                            what is under consideration is the enforcement of private law\n                            obligations which may have little or no connection with the English\n                            jurisdiction. I do not consider that the decision of the Court of Appeal\n                            in [Re Seagull] provides any justification\n                            for holding that an order made under CPR 71.2(1)(b) may be served out of\n                            the jurisdiction. [emphasis added in italics] 98     The decision inVitolmay be contrasted with the earlier decision inNational Justice Compania Naviera SA v Prudential Assurance Co Ltd\n                        (No 2)[2000] 1 WLR 603 (“The Ikarian\n                        Reefer”), where costs were ordered against the\n                    unsuccessful plaintiff in favour of the defendant. Seeking to hold the director\n                    of the plaintiff liable for costs, the defendant issued a summons in the action\n                    against him and served it on him out of jurisdiction without prior leave. The\n                    English Court of Appeal held that leave was required to serve the summons out of\n                    jurisdiction, but upheld the retrospective granting of leave by the judge below.\n                    In the process, the court considered the scope of O 11 r 9(4) of the Rules\n                    of the Supreme Court (UK) then in force, which stated: Service out of the jurisdiction of any summons, notice or order issued,\n                        given or made in any proceedings is permissible with the leave of the court\n                        but leave shall not be required for such service in any proceedings in which\n                        the writ, originating summons, motion or petition may by these rules or\n                        under any Act be served out of the jurisdiction without leave. 99     Waller LJ held that this provision allowed\n                    leave to be granted for service of the summons out of jurisdiction, even though\n                    the director was not a party to the proceedings. He reasoned as follows: … where there is an action pending before the English court, then a\n                        summons in that action can be served on a person domiciled and resident\n                        outside the jurisdiction. I appreciate that in [Mansour v\n                            Mansour[1989] 1 FLR 418] the party being served was a party\n                        to the proceedings. But that was not the basis of Sir John Donaldson M.R.'s\n                        reasoning and I venture to think that if a non-party committed a contempt of\n                        the English court the fact that that non-party was outside the jurisdiction\n                        physically would not prevent the English court having jurisdiction to\n                        proceed to commit for contempt. By analogy, as it seems to me, unless by\n                        some Convention the United Kingdom has agreed that its courts would not\n                        exercise a jurisdiction,the English court has\n                            jurisdiction to decide the issue whether a non-party has taken such\n                            steps in relation to an action as should render that person liable to\n                            pay the costs of that action.[emphasis added] 100    InMasri, Lord\n                    Mance agreed with Tomlinson J’s view inVitolthat r 6.30(2) of the CPR did not permit leave to be\n                    granted for service out of jurisdiction on non-parties (at [36]). He\n                    distinguishedThe Ikarian Reeferon the basis that\n                    it was a special case where the director on whom the summons was sought to be\n                    served out of jurisdiction was thealter egoof\n                    the plaintiff company whose proceedings he had instigated, controlled and\n                    financed (at [33]). 101    The decisions inThe\n                        Ikarian ReeferandMasriwere\n                    considered by the Grand Court of the Cayman Islands inCIGNA\n                        Worldwide Insurance Company (by and through its court-appointed receiver,\n                        Josie Senesie, and in respect of the assets undertaking and affairs of its\n                        licensed Liberian branch and business) v ACE Limited(unreported,\n                    13 May 2013). The issue in that case was whether the court had jurisdiction to\n                    grant leave to serve a costs summons on a non-party out of jurisdiction under O\n                    11 r 9(2) of the Grand Court Rules 1995 (Revised Edition) (Cayman Islands),\n                    which states as follows: Service out of the jurisdiction of any summons, notice or order issued,\n                        given or made in any proceedings is permissible with the leave of the Court,\n                        but leave shall not be required for such service in any proceedings in which\n                        the writ, originating summons, motion or petition may by these Rules or\n                        under any Law be served without leave. 102    Considering bothThe\n                        Ikarian ReeferandMasri, Cresswell\n                    J held that the court might have such jurisdiction in a case where the non-party\n                    had instigated, controlled and financed the proceedings brought in the name of\n                    the company: The principle underlying the jurisdiction (so far as relevant) under GCR O\n                        11 r 9(2) to be derived fromMasriis thatwhere a person (B) instigates, controls and finances\n                            proceedings brought in the name of A, there may be circumstances in\n                            which it is legitimate to assimilate the party A and the non-party B,\n                            and to treat any means of service available against A, as available also\n                            against B.This is so where B in reality brought the main\n                        proceedings and there has in effect been a submission to the jurisdiction by\n                        B. I derive this principle from paragraph 33 of Lord Mance’s opinion.\n                        Although the expression alter ego may be used to describe B’s\n                        relationship with A, I do not read Lord Mance inMasrias confining the use of GCR O 11 r 9(2) to the alter\n                        ego of a one ship Panamanian company. Lord Mance plainly regarded the type\n                        of case that would fall within the principle as narrow, but he was not\n                        concerned inMasrito examine the extent of\n                        the circumstances in which it might be legitimate to assimilate the party A\n                        and the non-party B, because an application for an order under CPR r 71.2\n                        plainly did not fall within the principle or CPR r 6.30(2). I do not accept Mr Hubble’s submissions to the extent that he seeks\n                        to narrow the limited jurisdiction further by confining it to the case of an\n                        alter ego or the alter ego of a one ship Panamanian Company [sic]. [emphasis added] 103    Against that background, we turn to the\n                    position in Singapore. O 11 r 8(1) in its current form came into force\n                    on 1 February 1992 (see Rules of the Supreme Court (Amendment No 3) Rules 1991\n                    (S 532/1991)). Before 1992, the equivalent provision was O 11 r 9(4) of the\n                    Rules of the Supreme Court 1970, which stated as follows: Service out of jurisdiction of any summons, notice or order issued, given\n                        or made in any proceedings is permissible with the leave of the\n                        Court. 104    The question is whether the addition of the\n                    clause “but leave shall not be required in any proceedings in which leave\n                    for service of the originating process has already been granted”\n                    (“the 1991 Amendment”) was intended to allow a party to serve\n                    summonses, notices or orders out of jurisdiction without first obtaining leave\n                    specifically to serve process onnon-parties, even\n                    if it related to substantive proceedings for which leave to serve on the parties\n                    had already been obtained. If so, this would have far-reaching effects that\n                    extend beyond the EJD context. For example, O 11 r 8(1) would also allow parties\n                    to serve an order for discovery or interrogatories against non-parties (see\n                    O 24 r 6(2) and O 26A r 1(2) respectively) out of jurisdiction without\n                    leave. 105    We do not think that this could have been\n                    the intention of the Rules Committee. The 1991 Amendment must be understood in\n                    the light of its purpose. Between 1991 and 1993, our civil procedure rules\n                    underwent a raft of reforms aimed at expediting court processes, increasing\n                    efficiency and reducing the backlog of cases that had accumulated in the\n                    preceding years (see Jeffrey Pinsler, “Reforms in Civil Procedure: An\n                    Analysis of the Amendments to the Rules of Court” inReview of Judicial and Legal Reforms in Singapore between 1990 and\n                        1995(Butterworths Asia, 1996) at pp 12 and 79). Given this\n                    backdrop, it seems to us that the rationale underlying the 1991 Amendment was to\n                    eliminate duplicative applications for leave – where leave to serve the\n                    originating process on a defendant abroad had already been granted, the issue of\n                    whether this was an appropriate case to exercise extraterritorial jurisdiction\n                    overthat particular defendantwould have already\n                    been considered, and it would be unnecessary and inefficient to require leave to\n                    be sought repeatedly for overseas service of every subsequent document in the\n                    proceedings. 106    However, this rationale does not apply to anon-partyto the proceedings, in relation to\n                    whom the basis for exercising extraterritorial jurisdiction has yet to be\n                    established. Transocean’s argument – that any concerns about\n                    extraterritoriality would have already been addressed when leave for service\n                    abroad of the originating process had been obtained – is not correct,\n                    because such leave would have been granted by the court on the basis that the\n                    defendant identified in the leave application was a party to a claim that was\n                    sufficiently connected to Singapore. Different considerations would apply in\n                    relation to an individual who is not a party to the claim. 107    Consequently, adopting a purposive\n                    interpretation of O 11 r 8(1), we hold that it doesnotdispense with the need for leave where a summons, notice or\n                    order is sought to be served out of jurisdiction on a non-party. In our\n                    judgment, the phrase “any proceedings in which leave for service of the\n                    originating process has already been granted” requires the court to\n                    consider what leave had already been granted in those proceedings and, in\n                    particular, the persons in respect of whom such leave has been granted. If leave\n                    for overseas service had not previously been granted in respect of an individual\n                    or entity that is not a party to the suit, then leave would need to be sought\n                    afresh under O 11 r 8(1) for service out of the jurisdiction on that\n                    individual. 108    To overcome this distinction between parties\n                    and non-parties, Transocean contends that company officers should not be\n                    considered non-parties for the purposes of EJD orders because such orders are\n                    directed to them in their capacity as officers of the judgment debtor; they are\n                    simply the personification of the judgment debtor for the purposes of EJD\n                    proceedings. But we are unable to see how we can ignore the separate legal\n                    personality of company officers when the EJD orders are addressed to thempersonally, with penal consequences for thempersonallyif they do not comply. Unless there\n                    is evidence that the officer in question is in fact thealter\n                        egoof the company (as was the case inThe\n                        Ikarian Reefer) or possibly where there is clear evidence that\n                    the officer in question “instigates, controls and finances” the\n                    litigation brought in the name of the corporate party to such a degree that it\n                    would be unjust to allow him to rely upon the separate corporate personality,\n                    any attempt to characterise company officers as parties to the proceedings would\n                    be untenable. There was no question of any such exception availing in this\n                    matter. 109    Thus, we hold that Transocean must apply for\n                    leave in order to serve the EJD Orders out of jurisdiction on the Directors, and\n                    this requirement cannot be circumvented by applying for leave to effect\n                    substituted service of the EJD Orders on Burgundy’s lawyers in Singapore\n                    as was done in this instance. The question then is whether leave should\n                    retrospectively be granted to Transocean. Should leave be granted to Transocean to serve the EJD Orders out of\n                jurisdiction? 110    We accept that in principle, leave to serve\n                    a summons, order or notice out of jurisdiction can be granted retrospectively\n                    (as was done inThe Ikarian Reefer). This stems\n                    from the court’s power under O 2 r 1(2) to “make such order\n                    … dealing with the proceedings generally as it thinks fit” where\n                    there has been a failure to comply with the ROC. 111    In our judgment, however, the discretion to\n                    grant leave to serve an EJD order out of jurisdiction is one that must be\n                    exercised sparingly. As we noted inPT Bakrie Investindo v\n                        Global Distressed Alpha Fund 1 Ltd Partnership[2013] 4 SLR 1116\n                    at [16], the predominant purpose of an EJD order is to obtain information to\n                    assist the judgment creditor in executing his judgment. In this respect it is\n                    very similar to a subpoena – both are orders directed at persons who might\n                    not necessarily be parties to the suit requiring them to provide relevant\n                    information to the court. Both are equally intrusive in that they generally\n                    require the person against whom the order is made to attend court personally. We\n                    note that under O 38 r 16(2), a person served with a subpoena to produce\n                    documents could sufficiently comply by causing the documents to be produced\n                    without attending personally; no such option exists in the ROC for a person\n                    served with an EJD order. We also return here to the observation we have made at\n                    [82] above, which is that even though the application for leave might appear to\n                    be one that is directed at invoking the court’s personal jurisdiction over\n                    the non-party in question, that is only anterior to the further question of\n                    whether this will ultimately entail the exercise of exorbitant substantive\n                    jurisdiction to an impermissible degree. 112    Having said that, we do not think it would\n                    be appropriate to lay down strict or exhaustive rules as to when a court may\n                    exercise its discretion to allow service abroad of an EJD order. The fundamental\n                    question is whether the foreign officer is so closely connected to the\n                    substantive claim that the Singapore court is justified in taking jurisdiction\n                    over him. We nevertheless make two tentative points. First, as the whole point\n                    of an EJD order is to obtain information about the judgment debtor’s\n                    finances, the extent of the foreign officer’s knowledge of his\n                    company’s financial affairs will be an important threshold consideration.\n                    Parties should not be allowed to haul before the court a foreign officer who is\n                    unlikely to possess any relevant information. But even if a foreign officer has\n                    relevant information, that fact alone would generally be insufficient; after\n                    all, the same could be said about any individual sought to be subpoenaed to give\n                    evidence. Something more would be required. For example, the court might wish to\n                    consider the extent of the foreign officer’s involvement in the matters\n                    relating to the claim. It might be easier to justify invoking the court’s\n                    jurisdiction over a foreign officer who has played a key role in the events\n                    giving rise to the judgment creditor’s successful claim. Ultimately, the\n                    duty is on the judgment creditor to persuade the court that this is a proper\n                    case to grant leave to serve out of the jurisdiction. 113    In the present case, there was simply not\n                    enough material before us to justify the exercise of our discretion. The only\n                    evidence that Transocean referred us to was an affidavit sworn by Mr Rogelio\n                    T Serafica (“Mr Serafica”) in support of the\n                    Directors’ application to stay the execution of the EJD Orders. The\n                    relevant paragraphs state: 17.    I also wish to inform the Honourable Court thatapart from myself, none of the other Applicants\n                                have any knowledge of the activities and assets of the\n                                Company.In addition, the Plaintiff had prior knowledge\n                            of the other officers whom they had transacted with our company\n                                [sic] during and after the\n                            negotiations …. Some names of all of our former officers were\n                            clearly mentioned by the Plaintiff’s personnel in their\n                            Affidavits. 18.    I thus have reason to believe that the Plaintiff\n                            are including the members of my family in the EJD Order knowing fully\n                            well that they are not officers who are knowledgable [sic] on the case and transactions. If the Plaintiffs\n                            would wish to know the detailed financial position and condition of the\n                            company, the correct person to call would be our official external\n                            Auditor Mr. Diosdado M. Perez and the current finance officer Ms. Rowena\n                            C. Borja. [emphasis added] Relying on Mr Serafica’s statement that “apart\n                        from himself”, none of the Directors have any knowledge of the\n                        company’s activities and assets, Transocean argued that leave should\n                        be granted at least with respect to Mr Serafica. 114    In the first place, we do not consider it\n                    legitimate for Transocean to rely on this affidavit of Mr Serafica, which was\n                    filedafterTransocean was (wrongly) granted leave\n                    to effect substituted service of the EJD Orders. This affidavit would not have\n                    been available at the stage where Transocean would have been required to apply\n                    for leave to serve the EJD Orders abroad, and Transocean ought not now to be in\n                    a position to rely on it in its application for leave to be granted\n                    retrospectively. But even if the contents of Mr Serafica’s affidavit\n                    were taken into account, we have already noted that the mere fact that an\n                    officer has some information about the company’s finances would normally\n                    not be sufficient to justify the court’s exercise of its jurisdiction\n                    extraterritorially over that officer. No other evidence was provided by\n                    Transocean as to why we should exercise our discretion in this case, aside from\n                    some assertions by counsel that Mr Serafica had been intimately involved in the\n                    initial stages of the proceedings. For these reasons, we do not think that this\n                    is a proper case for granting leave. 115    Aside from this, we also voice our\n                    reservations about allowing Transocean to effect substituted service of the EJD\n                    Orders by serving them onBurgundy’slawyers\n                    in Singapore. It seems to us that upholding this novel mode of substituted\n                    service could pave the way for parties to use this as a shortcut to serve\n                    documents on foreign persons who hold senior positions in a company by serving\n                    the documents on the company’s lawyers instead. But we need not decide\n                    this point as we set aside the order for substituted service of the EJD Orders\n                    on the ground that leave for service out of jurisdiction had not been\n                    obtained.",
        "Conclusion": "116    For the foregoing reasons, CA 48/2013 and CA\n                    55/2013 are both allowed. We reduce Transocean’s award of damages to the\n                    sum of US$55,001.46 and set aside AR Yeo’s order allowing substituted\n                    service of the EJD Orders. 117    Burgundy and the Directors shall have their\n                    costs here and below and these are to be taxed if not agreed. There will also be\n                    the usual consequential orders."
    }
}