{
    "case_title": "The One Suites Pte Ltd\n      v\n      Pacific Motor Credit (Pte) Ltd",
    "ncitation": "[2015] SGCA 21",
    "coram": "Sundaresh Menon CJ; \n      Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Introduction": "1       This is an appeal against the decision of the High Court Judge\n                    (“the Judge”) inThe One Suites Pte Ltd\n                        v Pacific Motor Credit (Pte) Ltd[2014] 4 SLR 806\n                    (“the GD”). We allowed the appeal and now give the\n                    detailed grounds for our decision.",
        "The facts": "2       The dispute arose out of a contract for the sale and purchase of the remainder\n                    of the lease over a property at 11 Leng Kee Road (“the\n                    Property”). The Property was leased from the Housing and Development\n                    Board (“the HDB”). The purchaser is The One Suites Pte Ltd\n                    (“the Appellant”), a retailer of motor vehicles (except\n                    motorcycles and scooters). Cheong Sim Lam (“Cheong”) is\n                    the sole director and shareholder of the Appellant. The vendor (and lessee of\n                    the Property) is Pacific Motor Credit (Pte) Ltd (“the\n                    Respondent”). 3       On 27 July 2012, the Appellant exercised the option to purchase\n                    (“OTP”). At that point in time, the Appellant had paid a\n                    total sum of $1.68m (being 10% of the purchase price of the Property) to the\n                    Respondent as deposit under cl 3(a) of the OTP. 4       Clause 10 of the OTP provided that the Property was sold subject to\n                    the “existing approved use” (also referred to as\n                    “the Seven Uses” (see the GD at [65])). Further,\n                    cl 12 of the OTP stated that: (a)    The sale and purchase herein is subject to the written approval from\n                            the Housing and Development Board (“HDB”) or such\n                            other competent authority to the sale of the Property by the Vendor\n                            being obtained and the parties hereto hereby covenant with the other of\n                            them to comply with such relevant terms and conditions that may be laid\n                            down or imposed by the HDB on them respectively. a.    In the event, the HDB refuses to approve the sale and purchase herein\n                            the sale herein shall be rescinded and all moneys paid to account of the\n                            purchase price herein shall be refunded free of interest compensation or\n                            otherwise, ... b.    The Purchaser shall within two (2) weeks from the date of the exercise\n                            of Option, apply or submit the relevant application to the HDB and all\n                            other competent authorities (if applicable) for the necessary\n                            approval(s). ... c.    For the avoidance of doubt, if the approval letter by the HDB is\n                            subject to rectification of any unauthorised additions or alterations in\n                            the Property, for the purposes of enabling completion, the Vendor shall\n                            give the necessary undertaking to the HDB to attend to the rectification\n                            within the deadline given by the HDB. 5       After the OTP was exercised, KhattarWong LLP\n                    (“KW”), the solicitors acting for the Appellant, wrote to\n                    the HDB, the Urban Redevelopment Authority (“the URA”) and\n                    the National Environment Agency (“the NEA”) for their\n                    respective approvals for the sale and purchase of the Property. 6       The HDB and the NEA replied and sought clarifications from the Appellant. On\n                    16 August 2012, Gary Tak Seng Leong (“Leong”)\n                    from the HDB sent an email to inquire as to,inter\n                        alia, the proposed use of the Property and specifically asked for\n                    a “business plan”. KW replied the following day stating\n                    that the Appellant would be using the Property for the Seven Uses; but no\n                    business plan was provided. On 21 August 2012, the NEA also sent a\n                    letter to seek clarifications on a number of matters. At Cheong’s\n                    request, his brother-in-law, Jason Tan, attended to all of the NEA’s\n                    clarifications. 7       On 27 August 2012, the URA replied to Cheong’s application\n                    and stated that the Property was “approved for workshop, office and\n                    showroom use”. 8       In response to KW’s reply on 17 August 2012 (see above at\n                    [6]), Leong from the HDB called for a meeting with the Appellant to enable him\n                    to understand the Appellant’s business plan. KW then arranged for a\n                    meeting between the Appellant and the HDB on 12 September 2012. 9       On 3 September 2012, KW responded to the NEA’s letter of\n                    21 August 2012. KW informed the NEA that the Property would be used for\n                    the Seven Uses and that it would furnish details of the business once they were\n                    available. As KW’s response did not address the queries set out in the\n                    NEA’s letter of 21 August 2012, Chen Fu Yi of the NEA sent an\n                    email on 4 September 2012, requesting KW to “furnish [him]\n                    with the necessary information required in the letter” so that he\n                    could process the application. On 11 September 2012, KW supplied the\n                    NEA with the Appellant’s responses to the queries raised in the\n                    NEA’s email of 21 August 2012. On the same day, the NEA\n                    notified the Appellant of the outcome of its application. The letter stated as\n                    follows: 2    We wish to inform you that under the URA Master Plan 2008, the long\n                            term land use plan for the subject site at 11 Leng Kee Road is\n                            for residential use, notwithstanding that it is currently being used by\n                            industry at this juncture. 3    As your proposed uses (i.e. general motor workshop, store, showroom,\n                            staff canteen, office and auxiliary purpose) do not conform to the long\n                            term land use plan for the subject site,we regret\n                                that we are unable to support your application. 4    Please source for alternative industrial premises, which is zoned for\n                            B2 industrial use (ie. general/special) in the URA Master Plan. The\n                            proposed industrial premises shall also be located at least 100m away\n                            from residential premises and food industry. ... [emphasis added] 10     On 12 September 2012, the Appellant met with representatives from the\n                    HDB. Leong, who represented the HDB at the meeting, testified that the\n                    NEA’s non-approval of the Appellant’s application was never\n                    brought up during the entire course of the discussion. 11     On 21 September 2012, KW wrote to inform Leong that the\n                    “NEA’s consent has not been obtained” and sought\n                    his confirmation on the status of the application for the HDB’s\n                    approval. Three days later, on 24 September 2012, Leong wrote to inform\n                    KW that that the HDB was “unable to grant in-principle\n                    approval” because the “NEA’s consent has not\n                    been obtained”. 12     In light of the HDB’s response, KW wrote to Ching Ching, Pek\n                    Gan & Partners (“CCPG”), the\n                    solicitors acting for the Respondent, on 25 September 2012 stating that\n                    the transaction had been “rescinded” pursuant to\n                    cl 12a of the OTP and that the sum of $1.68m should be refunded. CCPG\n                    responded on 1 October 2012, rejecting the purported notice of\n                    rescission and suggesting that the Appellant should: (a) revise its\n                    proposed use to conform to the NEA’s requirement; and\n                    (b) appeal on the basis that all the properties in the same stretch are\n                    used for motor car related industry purposes and that it would be inequitable\n                    for the NEA to refuse to grant its approval “especially when [the\n                    Property] is to be used as a clean industry basis”. KW disagreed with\n                    CCPG. In its letter of 5 October 2012, KW stated that the Property was\n                    sold “subject to existing approved use”,ie, the Seven Uses, and not sold subject to only the\n                    then existing use. KW also pointed out that the NEA had stated that the area was\n                    zoned for residential use and that it therefore saw no errors in the\n                    NEA’s decision which it could premise an appeal upon. KW concluded\n                    that there was therefore no reason for the Appellant to either revise its\n                    application or appeal against the NEA’s decision. CCPG replied on\n                    8 October 2012 to say that the Respondent was “checking on\n                    the matter with [the] NEA”. 13     The Respondent’s director, Tan Kah Tong\n                    (“Tan”), met with two representatives from the NEA on\n                    15 October 2012. On 19 October 2012, CCPG wrote to KW to\n                    inform the Appellant that the NEA’s concern was with the fact that the\n                    Property was zoned for residential use. CCPG also stated that the chances of\n                    obtaining the NEA’s approval was “very high” if\n                    the Appellant assured the NEA that there would be no change to the\n                    Property’s existing use. 14     KW responded to CCPG’s letter on 22 October 2012 and\n                    reiterated its view that there were no reasonable grounds for the Appellant to\n                    appeal against the NEA’s non-approval of its application. In its\n                    letter, KW asked for the Respondent to repay the $1.68m deposit paid by the\n                    Appellant pursuant to cl 12a of the OTP. On 1 November 2012,\n                    KW issued a formal notice and demanded the return of the $1.68m deposit. KW\n                    repeated its demand on 6 November 2012. CCPG responded on the same day\n                    stating that it would take instructions from the Respondent and that it would\n                    respond to the demand within the next seven days or so. 15     Tan then wrote to the NEA on 8 November 2012, urging it to review the\n                    matter and to reconsider its refusal to approve the Appellant’s\n                    application. He asked the NEA to grant its approval with the express\n                    qualifications that the Property was to remain zoned for residential use and\n                    that there was to be no change to the “existing use” of\n                    the Property. On 23 November 2012, the NEA sent an email to inform\n                    Cheong that the NEA (together with the HDB and the URA) had jointly assessed his\n                    appeal and had decided to accede to it by approving the sale and purchase of the\n                    Property. The letter, which was attached to the email, stated that the NEA\n                    (together with the HDB and the URA) had noted the Appellant’s\n                    “declaration and confirmation” that it was taking over the\n                    Property “without any change of use” and that it had\n                    “in-principle no objection” to this. KW wrote to the NEA\n                    on 28 November 2012 to inform it that neither the Appellant nor KW had\n                    lodged any appeal with the NEA and to “reject the representations,\n                    unauthorized appeal and [the] NEA’s purported decision”. On\n                    29 November 2012, Tan sent a letter to the Appellant requesting the\n                    Appellant to, in light of the NEA’s approval, apply to the HDB for its\n                    approval of the sale and purchase of the Property. CCPG sent a similar letter to\n                    KW the next day. KW replied on 11 December 2012 and stated that the OTP\n                    had been terminated and could not be retrospectively revived by the\n                    NEA’s letter on 23 December 2012.",
        "The decision below": "16     The Judge took the view that the dispute revolved around cll 4 and 12\n                    of the OTP (see the GD at [45]). He found that a problem arose from the clauses,\n                    namely that the OTP could remain in force indefinitely if the relevant\n                    authorities “remained silent” after applications for the\n                    approval of the sale and purchase of the Property were made to them (see the GD\n                    at [49]). This was because the OTP only stipulated that the completion was\n                    contingent on the grant of the HDB’s approval (see Cl 12(a),\n                    reproduced above at [4]) without fixing any cut-off date for the granting of\n                    that approval (see the GD at [49]). To resolve the problem, the Judge applied\n                    the three-step test for the implication of terms laid down inSembcorp Marine Ltd v PPL Holdings Pte Ltd and another and another\n                        appeal[2013] 4 SLR 193 (“Sembcorp Marine”). He refused to imply a cut-off date\n                    as it was impossible to identify any particular date as the cut-off date; there\n                    was no basis to prefer one date over another (see the GD at [62]). Instead, he\n                    found (at [63]) that: ... there was an implied term that the Purchaser had to use all reasonable\n                        endeavours to obtain the written approval of HDB and such other competent\n                        authority to the sale of the Property within a reasonable time. If no such\n                        approval was forthcoming within a reasonable time after the exercise of all\n                        reasonable endeavours, either party may give notice to rescind. 17     The Judge found that the HDB’s email of 24 September 2012\n                    was “not a clear and unequivocal rejection” of the\n                    Appellant’s application which would trigger cl 12a of the\n                    OTP. He found that it was merely a statement by the HDB that it could only\n                    process the Appellant’s application after the NEA’s approval\n                    was obtained (see the GD at [70]). In his view, the key question was whether all\n                    reasonable steps had been taken to obtain the NEA’s approval (see the\n                    GD at [71]). He accepted that the NEA’s letter on\n                    11 September 2012 “looked like a clear and unequivocal\n                    rejection” of the Appellant’s application (see the GD at\n                    [76]). He also found that the Appellant did not take any steps to try to change\n                    the NEA’s mind or to clarify the NEA’s decision; this was in\n                    spite of the fact that the rejection appeared to be inconsistent or unreasonable\n                    (see the GD at [79]). 18     On the facts, the Judge found that the Appellant knew that there were\n                    realistic prospects of success if it had appealed against the NEA’s\n                    decision and that the Appellant ought to have done so (see the GD at [91]). But\n                    the Appellant refused to do so because it had lost interest in the transaction\n                    and was looking for an opportunity to rescind the OTP (see the GD at [92]).\n                    Accordingly, he held that the purported rescission of the OTP by the Appellant\n                    on 25 September 2012 was premature, and therefore invalid. 19     Even though the Judge found that the OTP had not been rescinded, he refused to\n                    make the declarations sought by the Respondent (which were essentially\n                    declarations to compel the Appellant to proceed with the sale and purchase of\n                    the Property). He also refused to award damages because the Respondent had not\n                    adducedanyevidence of its losses (see the GD at\n                    [109]). He nevertheless allowed the forfeiture of the sum of $1.68m on the basis\n                    that it was not an advance payment but, instead, was paid as security for the\n                    Appellant’s performance of its obligations under the OTP (see the GD\n                    at [117]).",
        "The issue": "20     The issue before us was whether the OTP was rescinded by virtue of the\n                    HDB’s email on 24 September 2012 pursuant to cl 12a\n                    such that the Appellant was entitled to recover the sum of $1.68m paid to the\n                    Respondent under the OTP. This, in turn, depended on: (a)     whether the HDB had refused to approve the sale and purchase of the\n                        Property; and (b)     if so, whether the Appellant was obliged to use reasonable endeavours to\n                        persuade the HDB to change its mind after it had refused to approve the sale\n                        and purchase of the Property.",
        "Our decision": "",
        "Whether the HDB had refused to approve the sale and purchase of the\n                Property": "21     We start with the characterisation of the HDB’s email on\n                    24 September 2012. As mentioned earlier, the Judge found that the HDB\n                    had not refused to approve the sale and purchase of the Property. We\n                    respectfully disagree. In our view, the email dated 24 September 2012\n                    indicated that the HDB was unable to grant the in-principle approval because one\n                    of the prerequisites for granting the in-principle approval (ie, the NEA’s approval) could not be satisfied. It is\n                    pertinent to note that, at that point in time, the NEA had unequivocallyrefusedto grant its approval (see above at\n                    [9]). The fact that the NEA had subsequently decided to reverse its decision by\n                    granting its approval after Tan had made certain concessions on behalf of the\n                    Appellant (see above at [15]) demonstrated that the NEA did not approve in the\n                    first place. We also noted that the concessions made by Tan on behalf of the\n                    Appellant, which led to the subsequent approval, required the Appellant to take\n                    over the Property subject to the then “existing use”. In\n                    doing so, Tan had undercut the contractually agreed Seven Uses (see above at\n                    [4]) which entitled the Appellant to utilise the Property beyond the scope of\n                    its then “existing use” and which appeared to be crucial\n                    to the Appellant since it affected how the Appellant could have used the\n                    Property in the future (see above at [6] and [9]). The subsequent approval was\n                    therefore wholly irrelevant, and with respect, the Judge seemed to have been\n                    unduly influenced by it (as well as by the Appellant’s inaction\n                    thereafter). More importantly, the fact that the HDB might have been willing to\n                    reconsider the Appellant’s application if the Appellant had\n                    subsequently obtained the NEA’s approval did not mean that the HDB had\n                    not refused to give its approval. The Appellant had written to the HDB on the\n                    status of its application, and the HDB had refused to approve it. A look at the\n                    HDB’s email to the Appellant on 24 September 2012 from an\n                    objective perspective would reveal that the refusal was clear and unequivocal.\n                    Our finding in this regard led us to the next question,ie, whether the Appellant was obliged to use reasonable\n                    endeavours to persuade the HDB to change its mind after it had refused to grant\n                    its approval.",
        "Whether the Appellant was obliged to use reasonable endeavours to\n                persuade the HDB to change its mind after it had refused the Appellant’s\n                application": "22     It is not controversial that, in a case where the sale of land is\n                    “subject to the approval” of the authorities (as in this\n                    case), there is usually an implied obligation to use reasonable endeavours to\n                    obtain the requisite approvals of the relevant authorities. There appears,\n                    however, to be some uncertainty as to whether the obligation shouldinvariablyextend to taking further steps after any\n                    particular requisite approval has been refused. We did not think so. 23     The issue before this court was a straightforward one. It was primarily one\n                    concerning theapplicationof the relevant\n                    principles on “endeavours” clauses laid down by this court\n                    inKS Energy Services Ltd v BR Energy (M) Sdn Bhd[2014] 2 SLR 905 (principles which concernexpress“endeavours” clauses but which are\n                    equally applicable to animplied“endeavours” term) to the facts at hand. To this end, it\n                    bears reiterating that one of the important principles mentioned in that\n                    decision that whether or not an obligation to use reasonable endeavours is\n                    satisfied is, at bottom, afact-centricexercise.\n                    The present case is no exception. However, this case did raise a closely related\n                    (and no less important) point: the contours as well as content of the obligation\n                    to use reasonable endeavours are also determined, where relevant, with regard to\n                    theexpressterms of the contract itself. This\n                    must surely be the case because it is axiomatic that an implied termis subject to and cannot contradictan express term of\n                    the contract. 24     In light of the above, it is clear that one would have to have regard not only\n                    to the actual actions taken (andnottaken) by the\n                    Appellant pursuant to its attempt to discharge its obligation to use reasonable\n                    endeavours to secure the HDB’s (or any other relevant\n                    authority’s) approval, but also to the precise facts which tell us\n                    what the precise point in time is when that particular obligation is in factdischarged. 25     Turning first to what the Appellant had done, we noted that it was clear that\n                    the Appellant had addressed all the clarifications sought by the NEA (see above\n                    at [6]). This culminated in the rejection of the Appellant’s\n                    application by the NEAviathe\n                    11 September 2012 letter (set out above at [9]). This last-mentioned\n                    rejection by the NEA in turn resulted in therefusalof the Appellant’s application by the HDBviaits 24 September 2012 email (a\n                    decision that was clearly premised upon the NEA’s decision). Up tothatparticular point in time, it couldnot, in our view, be said that the Appellant\n                    hadnotused reasonable endeavours. The question,\n                    therefore, was whether or not the Appellant was under any obligation tocontinueto use reasonable endeavoursthereafter. In this regard,the refusalby both the NEAandthe HDB are of the first importance, having regard tothe\n                        express termsof the contract itself – in particular,\n                    cll 12(a) and 12a thereof, which are set out above (at [4]) and which\n                    we reproduce again as follows: (a) The sale and purchase herein issubject to the\n                            written approval from the Housing and Development Board\n                            (‘HDB’) or such other competent authorityto the sale of the Property by the Vendor being obtained and the parties\n                        hereto hereby covenant with the other of them to comply with such relevant\n                        terms and conditions that may be laid down or imposed by the HDB on them\n                        respectively. a. In the event,the HDB refuses to approvethe sale and purchase hereinthe sale herein shall be\n                            rescindedand all moneys paid to account of the purchase\n                        price herein shall be refunded free of interest compensation or otherwise,\n                        within seven (7) days from the date of the Vendor’s\n                        receipt of the refusal to the sale and purchase herein to the Purchaser in\n                        exchange for the Purchaser’s return to the Vendor’s\n                        Solicitors of all documents of title and the withdrawal by the Purchaser at\n                        the Purchaser's cost of all caveats and cancellation of all entries relating\n                        to the Property at the Singapore Land Authority as may relate to the sale\n                        and purchase herein, neither party to have any claim or lien against the\n                        other whatsoever thereafter. [emphasis added in italics and bold italics] 26     In our view, cll 12(a) and 12a are clear and unambiguous. The\n                    combined effect of both these sub-clauses is that once the HDBrefuses to approvethe sale and purchase, that refusal\n                    brings the OTP to an end; the refusal of the HDB simultaneously constitutes the\n                    cut-off point beyond which no further efforts are required to be undertaken by\n                    the Appellant pursuant to its duty to use reasonable endeavours. As already\n                    mentioned (see above at [23]), theseexpressterms\n                    must prevail. Put simply, they determine thecontentas well as themetes and\n                        boundsof the implied term on the part of the Appellant in the\n                    present case to use reasonable endeavours to secure the approval for the sale\n                    and purchase of the Property from the NEA as well as the HDB. To insist, as the\n                    Respondent had, that the Appellant must – pursuant to the implied term\n                    just referred to – engage in actions thatcontradicttheexpress termsof\n                    the contract itself is simply wrong as a matter of legal principle. It would\n                    also undermine the purpose behind cl 12a which, in our view, must have\n                    been to eliminate the possibility of a dispute when the requisite approval has\n                    been refused, and to allow parties to have a clean break (see also the English\n                    High Court decisions ofLipmans Wallpaper Ltd v\n                        Mason & Hodghton Ltd and another[1969]\n                    1 Ch 20 (“Lipmans Wallpaper\n                        Ltd”)andBickel and others v Courtenay Investments (Nominees) Ltd[1984] 1 All ER 657 (“Bickel”)). 27     However, the Judge held that the HDB hadnotrefused to approve the sale and purchase of the Property, and as a result, the\n                    contract hadnotbeen rescinded pursuant to\n                    cl 12a. He observed thus with regard to cll 12(a) and 12a (see\n                    the GD at [49]) that: There was, however, a problem in these clauses. Under the express\n                        contractual framework, the time for completion was contingent on the grant\n                        of HDB’s approval but the OTP did not specify any time limit for\n                        such approval to be obtained, or a long stop date for the determination of\n                        the contract. It put no obligation on the Purchaser to pursue the relevant\n                        approvals beyond the submission of the applications. The end result was that\n                        if the Purchaser had simply sat on his hands after making the applications,\n                        and the relevant authorities remained silent, the OTP could continue\n                        indefinitely. I note that cl 15 of the Conditions of Sale allowed\n                        for the parties to issue a notice to complete but that, again, may only be\n                        given after the completion date. The parties would find themselves in\n                        limbo. 28     In the circumstances, the Judge was of the view that it was necessary toimplya term in order to give the OTP\n                    efficacy. He then proceeded to observe (and conclude) as follows (see the GD at\n                    [50]–[64]): 50    The question then is whether the court should intervene, and if so,\n                            how. I am guided by the Court of Appeal inSembcorp\n                                Marine Ltd v PPL Holdings Pte Ltd [2013] 4 SLR\n                                193(“Sembcorp\n                                Marine”), which laid down a three-step test\n                            for implication of terms in fact (at [101]): (a) The first step is to ascertain how the gap in the\n                                contract arises. Implication will be considered only if the court\n                                discerns that the gap arose because the parties did not contemplate\n                                the gap. (b) At the second step, the court considers whether it is\n                                necessary in the business or commercial sense to imply a term in\n                                order to give the contract efficacy. (c) Finally, the court considers the specific term to be\n                                implied. This must be one which the parties, having regard to the\n                                need for business efficacy, would have responded ‘Oh, of\n                                course!’ had the proposed term been put to them at time of\n                                the contract. If it is not possible to find such a clear response,\n                                then, the gap persists and the consequences of that gap\n                                ensue. 51    As for the first step, the Purchaser argued that there was no gap in\n                            the OTP requiring the implication of any terms by this court on the\n                            basis that both parties were represented by solicitors during the\n                            drafting and signing of the OTP. I disagreed. I was disappointed that a\n                            contract drafted and negotiated by solicitors for such a large\n                            transaction contained such a glaring gap. In any event, even the most\n                            well-meaning drafter of contracts cannot anticipate every eventuality.\n                            Similarly, the existence of negotiations does notipso factomean the parties contemplated the gap and\n                            chose to leave it as it is. 52    As for the second step, it is clear for the reasons I have stated that\n                            it was necessary in the business or commercial sense to imply a term in\n                            order to give the OTP efficacy. 53    This brings me to the third step. It seemed to me the real issue was\n                            how the gap should be filled. 54    The Defendant submitted that the OTP contained two implied\n                            terms: (a) that it was incumbent upon the Purchaser to act with\n                                due diligence and despatch and take all reasonable and necessary\n                                steps that were and/or are necessary to facilitate and expedite the\n                                procurement of the written approval of HDB or such other competent\n                                authority for the sale of the Property by the Vendor under and in\n                                accordance with cl 12(a) of the OTP; and (b) that the Purchaser and Vendor would co-operate with\n                                each other and do all reasonable and necessary things to effect the\n                                consummation and completion of the sale and purchase of the\n                                Property. 55    The Purchaser disputed this. However, it accepted that, in order for\n                            the Purchaser to have the benefit of cl 12a and rescind the\n                            OTP, it had to show that it had exercised all reasonable endeavours to\n                            secure written approval from HDB. It had formulated this on the basis\n                            that this was the “plain and ordinary meaning of the language\n                            of cl 12a”. It did not seem to me that this was a\n                            plain reading of the clause at all. 56    Nevertheless, the Purchaser could hardly have disputed that it did\n                            have this obligation, based on the authority ofTan\n                                Soo Leng David v Wee, Satku & Kumar Pte\n                                Ltd [1997] 3 SLR(R) 257(“Tan Soo Leng David (HC)”). It was\n                            stated by Judith Prakash J at [61]: 61    It is established law that where a contractual provision provides\n                                that performance by one party is subject to the consent of a third\n                                party, the first party cannot say that having asked for such consent\n                                thereafter the matter is completely out of his hands so that if the\n                                consent is not forthcoming he is released from further performance.\n                                Rather, as the Court of Appeal put it in this case,to avail himself of the right to rescind, such party\n                                    has a duty to show that he has taken all reasonable steps to\n                                    obtain the consent of the third party or that it was useless for\n                                    him to pursue the matter with the third party after the initial\n                                    withholding of consent because it would have been quite\n                                    impossible for him to obtain the consent of the third\n                                    party. ... [emphasis added in bold italics] 57    Having set out the foregoing, the difference between the\n                            parties’ positions was not obvious at first glance. It\n                            appeared to me that, based on the Purchaser’s interpretation\n                            of cl 12a, any failure to take all reasonable steps would only\n                            operate todisentitlehis right to\n                            rescission, while the Vendor’s implied terms would createpositiveobligations on the Purchaser\n                            such that it would be in breach of contract if it failed to do so.\n                            Assuming this was the Purchaser’s position, this would not\n                            cure the gap that I have identified. If the Purchaser failed to take all\n                            reasonable steps, it cannot rescind, but there would still be no way\n                            forward. We return to the problem of when completion should take\n                            place. 58    The Purchaser also submitted that “on the plain\n                            wording” of cl 4(a), the OTP provided that the\n                            completion date ought to have been 19 October 2012at the very latest. Therefore, if the Purchaser\n                            failed to obtain approval from HDB by the Alleged Completion Date, even\n                            if there was no express refusal, it would be entitled to rescind if it\n                            had exercised all reasonable endeavours by then. Once HDB refused to\n                            grant its approval, cl 4 of the OTP ceased to operate, with the\n                            result that cl 12a of the OTP operated to entitle the Purchaser\n                            to rescind the sale and purchase of the Property. 59    I disagreed. The plain wording of cl 4 indicated that the\n                            Alleged Completion Date was theearliestpossible completion date rather than thelatest. Clearly, it must be possible for the relevant\n                            approval by HDB to occur after the date of approval. 60    In this respect, the Purchaser submitted that this court should also\n                            draw guidance fromTan Soo Leng David (HC)at [62] where, after analysing the relevant clause in that case, the\n                            learned judge found that the natural and ordinary meaning of that clause\n                            was that the sale and purchase would beimmediatelyrescinded in two instances. First, if the\n                            third party refused to give its consent, and secondly, if the third\n                            party did not respond to the request for consent for such a long period\n                            that its consent had not been received by the completion date. 61    However, the clause in question inTan Soo Leng\n                                David (HC)expressly stated that where such consent was\n                            not forthcoming by the completion date, the sale and purchase of that\n                            property shall be deemed to be rescinded (see [12]). That clause\n                            stated: The sale shall also be subject to the consent of the Developers,\n                                which said consent to the sale is required under the terms of the\n                                principal agreement.In the event such consent is\n                                    refused or not received by the Completion Date (as defined in\n                                    Clause 7 below), the sale and purchase herein shall be deemed\n                                    rescindedforthwith whereupon all moneys paid\n                                hereunder shall be refunded to you free of interest and subject\n                                thereto the sale and purchase herein shall be cancelled and of no\n                                effect and neither party shall have any claim or demand against the\n                                other for damages, costs, compensation or otherwise. [emphasis\n                                added] 62    Clause 12a of the OTP did not contain such a stipulation. In\n                            effect, the Purchaser was asking the court toimplya cut-off date for pursuing all reasonable\n                            endeavours. In my view, had the need for a cut-off date been brought to\n                            the parties’ attention at the time of contract, they would\n                            have said “Oh, of course!” (as specified in the\n                            third step of theSembcorp Marinetest\n                            (see [50] above)). But it was impossible for a court to specify an exact\n                            date as it would have no basis to prefer one date over another. 63    Having regard to the foregoing, I found that there was an implied term\n                            that the Purchaser had to use all reasonable endeavours to obtain the\n                            written approval of HDB and such other competent authority to the sale\n                            of the Property within a reasonable time. If no such approval was\n                            forthcoming within a reasonable time after the exercise of all\n                            reasonable endeavours, either party may give notice to rescind. 64    In any event, based on the Purchaser’s own argument, the\n                            implication of the Alleged Completion Date as the cut-off date for the\n                            exercise of all reasonable endeavours would not assist the Purchaser.\n                            They had not taken any further steps in pursuance of the relevant\n                            approvals after KW’s e-mail to HDB on 21 September\n                            2012. Indeed, that is generous, since an e-mail which merely informed\n                            HDB that NEA had refused to give its approval could more reasonably be\n                            construed as an invitation for HDB to follow suit than an attempt to\n                            convince HDB to give its consent. Accordingly, if it was not entitled to\n                            rescind when it purported to do so on 25 September 2012, the existence\n                            of a long stop date made no difference. [emphasis in original] 29     With respect, there were a number of problems with the Judge’s\n                    analysis set out in the preceding two paragraphs. For a start, we respectfully\n                    differed from the Judge’s view (see the GD at [49], and reproduced\n                    above at [27]) that the express terms of the contract “put no\n                    obligation on the Purchaser [the Appellant] to pursue the relevant approvals\n                    beyond the submission of the applications”. This view completely\n                    ignored cl 12(a) which states that the parties must comply with the\n                    terms and conditions that may be laid down or imposed by the HDB –\n                    this would cover situations where the HDB grants aconditionalapproval. Apart from that, it was clear that there\n                    is an implied term that the Appellant would use reasonable endeavours to obtain\n                    the requisite approvals. The steps that must reasonably be taken to satisfy this\n                    obligation would depend onall the facts and circumstances of\n                        the case itself.In these circumstances, we did not see how the\n                    OTP could “continue indefinitely”. We noted that the\n                    Appellant was obliged to make the requisite applications withintwo weeksfrom the exercise of the OTP (see\n                    cl 12b reproduced above at [4]) and this meant that the circumstances\n                    would not likely have changed dramatically such that the Appellant would have,\n                    at the time of the applications, lost interest in the transaction. It is also\n                    pertinent to note that the Appellant had, at that particular point in time, paid\n                    a total of $1.68m as deposit, and the only way for the Appellant to recover that\n                    sum under the OTP was for the HDB to refuse to approve the transaction. The\n                    point is that once the HDB responds with an approval, a conditional approvalora refusal (or, for that matter, any sort of\n                    clarification), that would have resolved the matter. It appeared to us that the\n                    Judge had arrived at the view that he did only because he failed to acknowledge\n                    that the HDB had refused to approve the Appellant’s application. In\n                    light of the refusal by the HDB, it was not difficult to see why the Appellant\n                    did not think that it had to take any further steps (and hence, it appeared to\n                    the Judge as though the Appellant had “sat on his hands”\n                    (see the GD at [49])). 30     The Judge was clearly concerned – and rightly in our view\n                    – with establishing atemporal cut-off\n                        pointin order to ascertain whether or not the duty to use\n                    reasonable endeavours had been fulfilled. We were of the view that there were\n                    two ways of ascertaining such a cut-off point. If there wasan express termstipulating when that cut-off time would be (for\n                    example, upon the refusal by the authorities and/or the lapse of a certain\n                    period of time), that would resolve the issue. If there was no such express\n                    term, then a term might beimpliedto the effect\n                    that the requisite approval would need to be obtained (here, by the Appellant)\n                    withina reasonable time(andcfthe Judge’s own view in the GD at [63]). What would\n                    constitute a reasonable passage of time in this last-mentioned regard would\n                    depend on all the facts and circumstances of the case. Indeed, it would appeardifficultto determine this particular issueapart fromthe more general (and central)\n                    issue of whether or not the relevant party (here, the Appellant) had indeed used\n                    reasonable endeavours to obtain the approval in the first place. 31     Returning to the facts of the present case, it was clear – as has,\n                    in fact, already been pointed out above – that therewas an express termstipulating what the relevant\n                    cut-off point is. That cut-off point would be arrived atwhen\n                        the HDB refused to give its approval– at which point\n                    the contract would be rescinded and the Appellant would be entitled to recover\n                    all moneys paid to the Respondent. That would be the end of the matter. There\n                    was no need – as the Judge thought – to imply a term in the\n                    present case. Indeed, as we have also pointed out above, it would be wholly\n                    inappropriate to imply such a term in any event as it would beinconsistent withtheexpress\n                        termsof the contract itself. Put another way, there was\n                    (contrary to what the Judge held (see the GD at [51], reproduced above at [28]))no gapwithin the meaning ofthe first stepas set out by this court inSembcorp Marineat [101] – and which was in\n                    fact also cited and applied by the Judge (see the GD at [50], reproduced above\n                    at [28]). As this first step (which is athresholdone) had not been fulfilled, that was, once again, an end to the matter and no\n                    further consideration of any implication of a term could arise (pursuant to the\n                    next two steps ofSembcorp Marine(and see, once\n                    again, the GD at [50], reproduced above at [28])). Indeed, thesecond stepinSembcorp Marine could\n                        not(again, contrary to what the Judge held (see the GD at [52],\n                    reproduced above at [28])),ex hypothesi, be\n                    satisfied as it was clearlyunnecessary in the\n                    business or commercial sense to imply a termas the parties\n                        had already provided for the situation concerned by way of an express\n                        term.As a result, there was no need to proceed to the third\n                    – and final step – set out inSembcorp\n                        Marine. 32     In the circumstances, it is not necessary to go on to address the remaining\n                    analysis of the Judge, except in so far as he had relied on the observations of\n                    the High Court inTan Soo Leng David v Wee,\n                        Satku & Kumar Pte Ltd and another[1997] 3 SLR(R) 257 (“Tan Soo Leng David\n                        (HC)”) at [61]. Indeed, this would, in our view, be an\n                    appropriate juncture to consider these observations as the Judge had (as we\n                    shall see) utilised them in a somewhat different fashion. Although they have\n                    already been set out in the GD, it bears setting these observations inTan Soo Leng David (HC)(at [61]) out in full again\n                        (together withthe next paragraph ([62])), as\n                    follows: 61    It is established law that where a contractual provision provides that\n                            performance by one party is subject to the consent of a third party, the\n                            first party cannot say that having asked for such consent thereafter the\n                            matter is completely out of his hands so that if the consent is not\n                            forthcoming he is released from further performance. Rather, as the\n                            Court of Appeal put it in this case,to avail himself\n                                of the right to rescind, such party has a duty to show that he has\n                                taken all reasonable steps to obtain the consent of the third party\n                                or that it was useless for him to pursue the matter with the third\n                                party after the initial withholding of consent because it would have\n                                been quite impossible for him to obtain the consent of the third\n                                party. See [23]-[24] of the Court of Appeal’s\n                                [Tan Soo Leng David v Wee\n                                Satku & Kuamr Pte Ltd and\n                                another[1994] 1 SLR(R) 426] judgment ([46]supra). 62    ... the first defendant cannot contend that the sale was rescinded on\n                            14 July 1992,iethe date of\n                            MEH’s refusal to give consentunless it can\n                                show that as of such date, it had used all reasonable efforts to get\n                                the consent or that it was useless to make such efforts.\n                            ... [emphasis added in italics and bold italics] 33     The court inTan Soo Leng David (HC)did refer\n                    to this court’s decision in the earlier proceedings (inTan Soo Leng David v Wee, Satku & Kumar\n                        Pte Ltd and another[1994] 1 SLR(R) 426\n                        (“Tan Soo Leng David\n                    (CA)”)). That was an appeal against the decision to strike\n                    out the statement of claim – the appeal was allowed, and the matter\n                    went for trial and that gave rise to the decision inTan Soo\n                        Leng David (HC). This court inTan Soo Leng\n                        David (CA)agreed with the reasoning of Denning LJ (as\n                    he then was) in the English Court of Appeal decision ofBrauer & Co (Great Britain), Ltd v James Clark\n                        (Brush Materials), Ltd[1952] 2 All ER 497\n                        (“Brauer”), who had\n                    opined (at 501) that: ... in order to enable them [the sellers] to take advantage of it they\n                        must show that, notwithstanding that all reasonable steps were taken by\n                        them, they could not obtain a licence to export during any part of the\n                        shipment period, or, alternatively, that it was useless for them to take any\n                        such steps, or any further steps, because it was quite impossible for them\n                        to obtain a licence. 34Brauerwas, in fact, a case which concerned a\n                    shipping contract which included a clause that the “contract is\n                    subject to any Brazilian export licence”. The sellers were obliged to\n                    secure the export licence. However, it turned out that the export licence would\n                    only be issued if the goods were shipped at a minimum price. The sellers did not\n                    meet that requirement, and failed to perform the contract. It was not a case\n                    where an application was made but consent was withheld. It follows that\n                    Denning LJ couldnothave been\n                    contemplating a situation where a party had to use reasonable endeavours evenafterconsent had been refused and, hence,\n                    couldnothave been laying down anynormative rule or principle to that effect. Indeed, it\n                    would have been contrary to the position in England that, in the context of an\n                    assignment of a lease subject to the consent of the landlord, the lessee (who\n                    was obliged to use reasonable endeavours to obtain the landlord’s\n                    consent) may rescind the contract once consent has been refused, regardless of\n                    whether such refusal was reasonable or otherwise: see, for example, the English\n                    Court of Appeal in Chancery decision ofLehmann v\n                        McArthur(1868) LR 3 Ch App 496; as well as the English\n                    High Court decisions ofLipmans Wallpaper LtdandBickel. More importantly,\n                    Lord Denning MR had, in the subsequent English Court of Appeal\n                    decision ofHargreaves Transport Ltd v Lynch[1969] 1 WLR 215, held that, on the facts ofthatcase, it was not reasonable to expect the party to appeal\n                    against the refusal of a planning permission even though there was a formal\n                    appeal procedure available. It is also noteworthy that other cases have found,\n                    on their facts, that the obligation to use reasonable endeavours would extend to\n                    an appeal against the refusal to grant a planning permission (see, for example,\n                    the English Court of Appeal decision ofIBM United Kingdom\n                        Ltd v Rockware Glass Ltd[1980] FSR 335 and the English High\n                    Court decision ofJolley v Carmel Ltd[2000]\n                    2 EGLR 154 (affirmed inJolley v Carmel\n                        Ltd[2000] 3 EGLR 68)). This further illustrates our\n                    point that there couldnotbe a rule or\n                    proposition that a party mustinvariablyuse\n                    reasonable endeavours even after consent had been refused. 35     Indeed, we do not think that this court inTan Soo Leng\n                        David (CA)could have understoodBrauerdifferently. After citingBrauer, this court inTan Soo Leng David\n                        (CA)then proceeded to observe as follows (at [24]): … Soalso, in our view, there was\n                        a duty on the first respondents to show that they had taken all reasonable\n                        steps to obtain the second respondents’ consent orthat it was useless for them to pursue the matter with the\n                            second respondents after the initial withholding of consent because it\n                            would have been quite impossible for them to obtain the second\n                            respondents’ consent. This is a question of fact\n                        which could not be decided on the affidavit evidence, such as it was, and\n                        the matter has to go to a full trial for this question to be decided ...\n                        [emphasis added] 36     It is clear that this court inTan Soo Leng David\n                        (CA)was merely reiterating the statement made by\n                    Denning LJ inBrauer(reproduced above at\n                    [33]) which, as we understand it, means that there is no need to show that\n                    reasonable steps had been takenpriorto the\n                    refusal if it can be shown that it would have been useless to do so. It could\n                    not have meant otherwise as the contract in that case expressly stipulated that\n                    the contract is “deemed rescinded” if the requisite\n                    consent was refused (seeTan Soo Leng David (HC)at [12]). It might not have been wrong to consider the steps taken after the\n                    refusal on the particular facts ofTan Soo Leng David\n                        (HC)given that very little was done before the refusal to obtain\n                    the requisite consent. It wasnota case where\n                    there was an application followed by a clarification (like in the present case),\n                    but was a case where the consent was sought merely by way of a simple letter\n                    stating that the proposed sale was to the plaintiff who was “an eye\n                    specialist” (seeTan Soo Leng David\n                        (HC)at [63] and [65]). However, the events that transpiredafterthe refusal revealed that it was quite\n                    impossible to obtain the consentin the first\n                        placeeven if reasonable steps were taken. 37     In our view, therefore, neither this court inTan Soo Leng\n                        David (CA)nor the court inTan Soo Leng David\n                        (HC)was laying down a normative rule or proposition which ought\n                    to be applied universally in other cases in the future. In particular, as we\n                    have already emphasised, the duty to use all reasonable endeavours is afact-centricone and the observations just\n                    referred to were made inTan Soo Leng David (HC) in the\n                        context of the particular facts of that case.As already alluded\n                    to above, it appeared, however, that the Judge thought that such a normative\n                    legal rule or proposition was indeed being laid down in that case. This probably\n                    prompted him to apply what was stated inTan Soon Leng David\n                        (HC)to the facts of the present appeal as a legal rule or\n                    principle. In our view,the factual observation in Tan Soo\n                        Leng David (HC) cannot be transformed into a wholly different kind (ie,\n                        normative) of proposition which would then apply to all other cases (such as\n                        the present).The court inTan Soo Leng David\n                        (HC)made the observations (at [61]) it did and therefore held as\n                    it did by reference to (only)the particular facts before it. The observations and decision\n                    therefore didnotapply to other cases such as the\n                    present – with each case having to be examined by reference to their\n                    specific contractual terms as well as facts. In the context of the present\n                    appeal, however, theexpress termsare clear and\n                    (as already explained above), based on the relevant facts read in connection\n                    with the relevant express terms of the contract, the Appellant had (for the\n                    reasons set out above) clearly discharged its duty to use reasonable endeavours\n                    and was entitled to regard the contract as rescinded once the HDB had refused to\n                    approve the application on 24 September 2012. 38     For completeness, we should also briefly discuss two other Singapore High\n                    Court decisions which have dealt with an issue that is similar to the one before\n                    us. We begin with the Singapore High Court decision ofGroup\n                        Exklusiv Pte Ltd v Diethelm Singapore Pte Ltd[2003]\n                    4 SLR(R) 582 (“Group\n                    Exklusiv”). Like the present case,Group Exklusivinvolved the sale and purchase of a property\n                    which was leased from the HDB. The plaintiff was obliged under the contract to\n                    apply for the approval from the NEA for the change of use of the property.\n                    Clause 15(e) of the contract provided that: If the consent of HDB, LTA and other relevant authorities in respect of\n                        the sale and purchase and the change of use and the erection of the private\n                        access road isnot obtained or refused by the date\n                            falling one (1) month before the date fixed for completion,\n                        the sale and purchase may, at either party’s option, be rescinded,\n                        whereupon all monies (including but not limited to the deposit and goods and\n                        services tax, if any) paid by the Purchaser herein shall be refunded to the\n                        Purchaser without any interest or compensation. [emphasis added] 39     The NEA had informed the plaintiff in that case that the property could be\n                    used as a vehicle showroom, but could not be used for spray painting and vehicle\n                    repair. Consequently, the plaintiff gave notice of rescission, but the defendant\n                    did not accept it and refused to refund the deposit. The court held (at [9])\n                    that the letter from the NEA constituted a “clear and unequivocal\n                    rejection” of the plaintiff’s application for change of\n                    use. Having done so, he went on to consider whether the plaintiff was obliged to\n                    appeal or to take further steps to persuade the NEA to change its mind, and\n                    found that the plaintiff had expended reasonable efforts. 40     We appreciate that, as a matter of prudence (and perhaps strategy), counsel\n                    would almost always feel obliged to adduce evidence and make submissions on the\n                    point that there should or should not have been further endeavours after the\n                    refusal. Indeed, the evidence on the futility of further endeavours after the\n                    refusalmaybe relevant in certain cases, for\n                    example, where the refusal was not as clear or unequivocal or where there is an\n                    appeal procedure available. However, as we have mentioned earlier, in a case\n                    where the parties haveexpresslyprovided for\n                    rescission upon the refusal of the requisite consent (as in the present case),\n                    theimpliedobligation to use reasonable\n                    endeavours could not extend beyond the point of refusal. 41     We proceed to consider the second case, the Singapore High Court decision ofOng Khim Heng Daniel v Leonie Court Pte Ltd[2000] 3 SLR(R) 670 (“Leonie\n                        Court”). The plaintiffs, who were the majority owners\n                    of Grenville Condominium, agreed to sell the propertyen\n                        blocto the defendant. The sale was subject to the approval of\n                    the Strata Titles Board (“the STB”). The contract provided\n                    that the plaintiffs would use their “best endeavours” to\n                    apply and obtain the requisite approval (cl 7A), and if the STB did not\n                    approve the sale, the monies paid should be refunded to the defendant\n                    (cl 8(c)). The plaintiffs made their first application to the STB and\n                    approval was not granted as certain procedural requirements were not met. The\n                    STB didnotdecide on the merits of the\n                    application. The defendant gave notice to rescind the contract and asked for the\n                    refund of the deposit. One of the issues was whether the agreement allowed for\n                    only one application to be made. The court considered (at [18]) that there was\n                    nothing in cll 7A and 8(c) which stipulated or implied that the\n                    plaintiffs must obtain the STB’s approval on the first application. At\n                    first blush, this case appears to suggest that further steps must be taken even\n                    after the STB had refused (notwithstanding cl 8(c) which states that\n                    the monies paid shall be refunded if the STB does not approve of the sale).\n                    However, the better view is that no application was properly made due to the\n                    procedural irregularities and it follows that there could not have been a\n                    refusal by the STB which would suffice for the purpose of cl 8(c).\n                    Indeed, this coheres with the court’s view expressed (at\n                    [22]–[23]), as follows: 22    The plaintiffs submitted that when cl 8(c) refers to the\n                            Board not approving a sale, it contemplates a decision made taking into\n                            account the matters listed in ss 84A(7) and 84A(9) that the\n                            Board is obliged to consider. It argued that the Board's decision of\n                            2 June was not such a decision as it did not consider the\n                            substantive aspects of the proposed sale. 23    That is a valid point. The Board had not ruled definitively on the\n                            application. The Board had not considered the merits of the matter. The\n                            plaintiffs had attempted to get the Board to consider their application,\n                            but the Board had not really considered the application yet and had not\n                            decided whether the sale should be approved or not. 42     In light of the above analysis, it is clear that neitherGroup ExklusivnorLeonie Courtstands for the proposition that the obligation to use reasonable endeavours to\n                    obtain the consent of a third party wouldinvariablyextend to taking further steps after consent had been\n                    refused. 43     To summarise, the courts will usually imply an obligation to use reasonable\n                    endeavours to obtain the consent of the third party in a case where the contract\n                    is a subject to the consent of a third party. However, the question of whetherthatobligation had been satisfied will\n                    ultimately depend on the precise facts and circumstances of each case. In that\n                    regard, it is important to bear in mind that the scope of the obligation to use\n                    reasonable endeavours is to be determined, where relevant, with regard to theexpressterms of the contract itself. If the\n                    contract provides for rescission upon the refusal by the third party, then there\n                    can be no implied obligation to use reasonable endeavours after there has been\n                    such a refusal. 44     Given our analysis and decision, there is no need to consider the further\n                    question as to whether or not there is a duty on the part of the parties to\n                    cooperate (which the Respondent contends should be implied into the contract).\n                    Indeed, although most courts are in agreement that the seminal decision with\n                    regard to this particular duty is that of the House of Lords inMcKay v Dick and another(1881) 6 App Cas 251,\n                    the precise legalbasismight be debatable (given\n                    the different views expressed in the case itself). The precise content and scope\n                    of that duty have also not been considered by this court, although it has been\n                    considered in the Singapore High Court in a few cases (most notably and\n                    (relatively) recently by V K Rajah J (as he then was)\n                    inEvergreat Construction Co Pte Ltd v Presscrete Engineering\n                        Pte Ltd[2006] 1 SLR(R) 634 (“Evergreat”)). SinceEvergreat, there have also been developments across the\n                    Commonwealth (including Singapore) with regard to the doctrine ofgood faith. Indeed, one key issue is what therelationshipis (if any) between the duty on the part of\n                    contracting parties to cooperate on the one hand and the doctrine of good faith\n                    on the other. In this regard, though, we note that the present position in\n                    Singapore as set out in the decision of this court inNg Giap\n                        Hon v Westcomb Securities Pte Ltd and others[2009]\n                    3 SLR(R) 518 (“Ng Giap\n                    Hon”) is that there isnoimplied duty of good faith based on a “term implied inlaw”. However, this court inNg Giap Honwas prepared to leave open the possibility\n                    that such a duty could be implied by way of thenarrowercategory of “terms implied infact”. Whilst it is thought in some quarters\n                    that the English High Court decision inYam Seng Pte Ltd v\n                        International Trade Corporation Ltd[2013]\n                    1 Lloyd’s Rep 526 heralded a more expansive approach towards\n                    the doctrine of good faith, a close analysis of the judgment itself (especially\n                    at [131]) suggests that the English position is not that much different from the\n                    existing Singapore position inNg Giap Hon(reference may also be made to the English Court of Appeal decision ofMid Essex Hospital Services NHS Trust v Compass Group UK and\n                        Ireland Ltd (trading as Medirest)[2013] EWCA Civ 200, especially\n                    at [105]). It might also be usefully noted that this court inHSBC Institutional Trust Services (Singapore) Ltd (trustee of Starhill\n                        Global Real Estate Investment Trust) v Toshin Development Singapore Pte\n                        Ltd[2012] 4 SLR 738 held that where there is anexpressterm in the contract that the parties\n                    wouldnegotiate in good faith, this would be given\n                    effect to. However, the law in this particular sphere (viz, good faith) continues to be in a state of flux. For\n                    example, the Supreme Court of Canada inHarish Bhasin v Larry\n                        Hrynew and Heritage Education Funds Inc[2014] SCC 71 recently\n                    held that there is a duty ofhonest performancewhich is, in turn, a manifestation of the general organising principle of good\n                    faith. Whether or not the formulation in this last-mentioned decision is too\n                    vague and general is a question which is (fortunately) outside the purview of\n                    the present appeal – as is the (more specific) issue as to whether or\n                    not the implied term of mutual trust and confidence ought to apply in theemploymentcontext such that a term ought to\n                    be implied inlawthat neither party will, without\n                    reasonable cause, conduct itself in a manner that is likely to destroy or\n                    seriously damage or undermine the relationship of trust and confidence between\n                    employer and employee (this principle being first established in the leading\n                    House of Lords decision ofMalik v Bank of\n                        Credit & Commerce International SA (in compulsory\n                        liquidation)[1998] AC 20, which was, however,notfollowed in the recent High Court of Australia decision inCommonwealth Bank of Australia v Barker(2014)\n                    88 ALJR 814 (with the position in Singapore still left open for\n                    decision in a future case (see the decision of this court inWee Kim San Lawrence Bernard v Robinson & Co\n                        (Singapore) Pte Ltd[2014] 4 SLR 357))). It will be\n                    immediately seen from this very short synopsis of the various issues why the\n                    question as to whether or not there is a duty on the part of the parties to\n                    cooperate and, if so, what its scope is and what its relationship is to\n                    doctrines such as good faith, are all matters that ought best to be decided in a\n                    definitive fashion only when they next come directly for decision before the\n                    courts.",
        "Conclusion": "45     For the reasons set out above, we allowed the appeal with costs and with the\n                    usual consequential orders."
    }
}