{
    "case_title": "Schonk Antonius Martinus Mattheus and another v Enholco Pte Ltd and another appeal",
    "ncitation": "[2015] SGCA 65",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the courtex tempore):",
    "sections": {
        "Introduction": "1 The two appeals that are before us concern claims arising from the breaches of duties owed to the plaintiff, Enholco Pte Ltd (“EPL”), by the first defendant, Mr Schonk Antonius Martinus Mattheus (“Mr Mattheus”). EPL claimed, among other things, that Mr Mattheus had diverted business opportunities away from EPL to his own company, the second defendant, International Oil and Gas Consultants Pte Ltd (“IOGC”). The matter was decided by a High Court judge (“the Judge”) whose decisions on liability and on quantum, respectively, are reported asEnholcoPte Ltd v Schonk Antonius Martinus Mattheus and another[2015] SGHC 20 andEnholcoPte Ltd v",
        "Summary of facts": "4 EPL was incorporated in 1988 by Mr Haank Jan Gerhard (“Mr Gerhard”), EPL’s managing director and the beneficial owner of all of its shares. Mr Mattheus, who was a friend of Mr Gerhard, was employed by EPL sometime in 1989 as a sales manager pursuant to an oral agreement that was entered into between him and Mr Gerhard. 5 In 2001, Mr Mattheus became operationally responsible for a part of EPL’s business referred to by the parties as “Unit 2”. From 2009 onwards, he entered into discussions with Mr Gerhard concerning the potential sale of Mr Gerhard’s shares in EPL to Mr Mattheus. Negotiations and relations between the two men subsequently broke down in March 2012 and Mr Gerhard revoked Mr Mattheus’ authorised signatory status with respect to Unit 2’s bank accounts on 30 March 2012. 6 Shortly after this, Mr Mattheus incorporated IOGC on 5 April 2012 and diverted, among other things, Unit 2’s customer accounts with Atlas Copco Mafi-Trench (“Atlas”) as well as Stal-und Apparatebau Hans Leffer GmbH & Co KG (“Hans Leffer”) to IOGC. Mr Gerhard subsequently discovered the existence of IOGC and terminated Mr Mattheus’ employment on 24 August 2012. EPL then commenced proceedings on 16 March 2013 and these were later heard by the Judge.",
        "Our decision in CA 47": "7 Two issues arise in CA 47. The first is the defendants’ submission that the Judge erred in finding that Mr Mattheus was an employee of EPL from 1989 until 24 August 2012. According to the defendants, Mr Mattheus had in fact taken over ownership of Unit 2 in 2001 pursuant to an oral agreement he reached with Mr Gerhard (“the Unit 2 Agreement”) and thereafter ceased to be an employee of EPL. The second issue arises out of the defendants’ alternative argument. Simply put, if contrary to his primary case, Mr Mattheus was EPL’s employee until 24 August 2012, then EPL should pay Mr Mattheus the salary that was owed for the five-month period from April 2012 until August 2012. This amounted to $150,000. 8 As to the first issue, we are amply satisfied that the Judge did not err in finding that Mr Mattheus remained an employee of EPL until his termination on 24 August 2012. This was premised on his finding that there was no Unit 2 Agreement. It may be noted that the case mounted by the defendants was fundamentally opposed to that brought by EPL. Where EPL’s claim rested on Mr Mattheus’ status as anemployee, the latter’s position was that he had ceased to be such twelve years before the proceedings were commenced and that during that time, he actuallyowneda part of EPL’s business. There are many difficulties with such a notion but perhaps the one that is most immediately striking is that this was not initially mentioned at all in the defendant’s Defence and Counterclaim dated 12 July 2013. In fact, the existence of the Unit 2 Agreement was only mentioned for the first time in the defendants’ second amended Defence and Counterclaim dated 27 June 2014 and this was filed almost a year after the proceedings had commenced. This seems to us to present an insurmountable difficulty for Mr Mattheus and no plausible explanation been put forward for this. 9 Aside from this, we are satisfied from the documentary evidence that was adduced that the Judge was correct to have regarded Mr Mattheus’ conduct while managing Unit 2 between 2001 and the time of his eventual termination in 2012 to be consistent with that of an employee. It is not necessary for us to retrace that now. For these reasons, we dismiss the defendants’ appeal on the Judge’s finding of liability. 10 As to the second issue relating to the Salary Counterclaim, the defendants say that if Mr Mattheus remained EPL’s employee then he should have been paid his salary until his termination. This had been counterclaimed by the defendants but the Judge had dismissed this without elaboration. As against this, EPL takes the position that Mr Mattheus’ breaches of his duties owed to EPL during the months of April 2012 to August 2012 were such as to preclude him from claiming his salary for those months. 11 This was dealt with in the further submissions filed by the parties at our request. In our judgment, Mr Mattheus is entitled as a matter of law to his salary for so long as he was working, and regarded himself, as an employee of EPL and we therefore allow in part the appeal so far as it relates to Salary Counterclaim. The amount in question is to be set off against the damages awarded to EPL. We briefly elaborate on the amount that Mr Mattheus is entitled to claim as well as our reasons for reaching this decision. 12 The authorities reveal that an employer is generally not entitled to withhold payment of salary unless permitted by statute or by the employment contract itself. Exceptionally, the employer may also withhold payment of salary where there is a total failure of consideration (per Scott J (as he then was) inSimv Rotherham Metropolitan Borough Council[1987] 1 Ch 216 at 222). EPL has neither pleaded nor proved a total failure of consideration and in any event, from the evidence, subject to one notable exception which we treat at [16] below, it does not appear to be the case that Mr Mattheus did nothing during at least a part of this period of his employment. EPL contends that because Mr Mattheus breached his fiduciary duties and his duty of loyalty, he should forfeit any entitlement to his salary. In our judgment, this is not correct as a matter of law. 13 EPL cited some authorities in support of their contention but these concern principal and agent relationships rather than employment relationships. Thus inImageviewManagement Limited v Jack[2009] EWCA Civ 63 (“Imageview”), a football agent’s commission was forfeited; and inAvrahamiand others v Biran and others[2013] EWHC 1776, management fees which were paid to a building development project manager were forfeited. These must be differentiated from employment relationships, as was the case inBank of Ireland vJaffery and another[2012] EWHC 1377 (Ch) (“Jaffery”) where it was held at [371] and [373]. 371 This is not a case such asImageview, where an agent has betrayed the trust of his principal in relation to the sole subject matter of the agency. As I have already said, Mr Jaffery was employed by the Bank in a senior position and betrayed the Bank’s trust in respect only of the transactions involving the RGC Customers. In other respects, he seems to have been a valuable and diligent employee promoting the Bank’s interests successfully. Of course, the Bank must be compensated on normal principles for the breaches of duty that I have found. … … 373 It would be unfair in my judgment, even taking into account the nature of Mr Jaffery’s breaches, to require him to pay his salary and bonuses, or indeed any part of them. The breaches must, as I have already said, be looked at in the context of his employment as a whole. Mr Jaffery worked long hours over several years for the Bank. It would be both disproportionate and inequitable in the circumstances of this case to require Mr Jaffery to repay some 5 years of salaries and bonuses in addition to disgorging his profits or paying equitable compensation. 14 EPL suggested thatJafferyshould be understood as entitling a defaulting employee to his salary only in circumstances where it would be disproportionate to disentitle him from claiming his salary. But we are unable to see why this should be the case. As a matter of general principle, if the complaint is that the employee has breached his duty then recourse is available either by permitting damages to be claimed or exceptionally, where the facts warrant this, by establishing that there was a total failure of consideration. The importance of distinguishing between a relationship of agent and principal and an employment relationship is also emphasised in the decision of the Ontario Court of Appeal inMadyDevelopment Corp and others v Rossetto and others(2012) ONCA 31 where the court said as follows at ([30]–[31]): The fact that the relationship at issue in the present case is one of employer and employee also distinguishes it fromMcBride, where Abella J.A. expressly recognized that the relationship at issue was one of principal and agent: at para. 26. Citing this court’s decision inWilliam R. Barnes Co. v. Mackenzie(1974), 1974 CanLII 465 (ON CA), 2 O.R. (2d) 659, Mark Ellis inFiduciary Duties in Canada,loose-leaf (consulted on December 16, 2011) (Toronto: Carswell, 1993), ch. 16 at 16.15 recognizes the distinction between principal-agent and employer-employee relationships and describes the entitlement to compensation in the employment context. He writes: It is well accepted that a principal will not be required to pay his agent a commission for transactions that are in breach of fiduciary duty. However, an employer is not free to withhold payment of wages due for past performance, even where the past performance may have involved a time when the employee was acting in breach of his fiduciary duty. InBarnes, Evans J.A. adopted the same approach to a fiduciary employee as the arbitrator in this case. He wrote: In the instant case the relationship is basically that of master and servant rather than principal and agent and the remedy of a master against his defaulting servant is restricted to a right of instant dismissal and to damages which flow from the default. I do not consider wages paid to be such an item of damages. … The employer has already received the fruit of the employee’s efforts, honest or otherwise, and cannot repudiate his obligation to pay.  I recognize that in an agency situation the principal may take the benefit and refuse to pay the commission but I am not aware of any binding authority which requires me to extend that principle to a master and servant situation. 15 In our judgment, an employer may claim damages for any breach of duty by its employee but such a breach will not by itself disentitle the employee to his or her salary. Rather, the employer may make a deduction from the salary in respect of such loss as it proves it has suffered by reason of the employee’s breach (Sagarv H Ridehalgh and Son, Limited[1931] 1 Ch 310 at 325). 16 But we also note that in their submissions, the defendants contend that following EPL’s withholding of his salary for the months of April 2012 and May 2012 Mr Mattheus considered that he was entitled to regard this as a repudiatory breach of the employment contract. The defendants contend that it was on this basis that Mr Mattheus no longer considered himself bound by the contract from June 2012 and proceeded to divert Unit 2’s business to IOGC. For completeness, we note that the documentary evidence shows that the diversion had actually begun prior to June 2012. But it is evident from this that in the defendants’ own view, Mr Mattheus did not regard himself to be EPL’s employee from June 2012 onwards. This seems to us to be acceptance by the defendants of the fact that Mr Mattheus ceased to provide any service for EPL after May 2012. We emphasise that we rely on this as an evidentiary point to establish that Mr Mattheus can have no entitlement to any salary after he, by his own admission, states that he ceased to regard himself as an employee. The fact that his actions were a purported acceptance of EPL’s repudiation, which in any event, was wrong in our view as a matter of fact and law, is immaterial. The simple point is that he cannot consistently with this, claim that he has any basis for asserting any entitlement to his salary after this.  While, as a matter of strict analysis, as we have noted at [12] above, this has not been pleaded by EPL as a ground to justify not making payment of salary to Mr Mattheus, we see no prejudice in proceeding on this basis since this is based entirely on Mr Mattheus’ own case, In the circumstances, we find that he should be entitled to his salary for April 2012 and May 2012 only and not until 24 August 2012 when the official termination of his employment took place. 17 Therefore, we allow this part of the defendants’ appeal in CA 47 to the extent that the defendants are entitled to set-off the amount of $60,000 (being unpaid salary for the months of April 2012 and May 2012) against any damages awarded to EPL on account of Mr Mattheus’ breaches of fiduciary duties. 18 We now turn to our decision in CA 106.",
        "Our decision in CA 106": "19 As clarified by counsel for the defendants at the hearing, the defendants are not challenging the damages awarded to EPL by the Judge below in relation to the loss of the company car, the diversion of consultancy fees and commissions from Hans Leffer valued at $118,560 as well as the diversion of business in relation to thepurchase orders made for Weir Gabionetta SRL and Weir Minerals Netherlands BV (collectively referred to as “the Weir Group”) valued at $44,894.92. 20 The only points of contention in CA 106 relate to the following heads of loss: (a) EPL’s loss of future profits arising from the loss of the customer accounts of Atlas and Hans Leffer following the termination of Mr Mattheus’ employment; (b) unauthorised expenses incurred by Mr Mattheus during his employment with EPL; and (c) advances and personal loans taken out from EPL by Mr Mattheus and not yet returned. We will deal with each of these heads of loss in turn.",
        "Loss of future profits": "21 EPL takes the position that the Judge was wrong in dismissing its claim for loss of future profits, particularised as the loss of the Atlas and Hans Leffer customer accounts, on the basis of a failure to establish causation. In his grounds, the Judge explained that both companies appeared to be only willing to contract with Mr Mattheus and not with EPL, and that EPL failed to prove that it would have retained those contracts after the termination of Mr Mattheus’ employment. Thus, in the Judge’s view, EPL had failed to show that it was entitled to claim the loss of future profits. 22 In our judgment, factual causation established by the application of the “but for” test is clearly made out. When faced with such a question, the court must ask what would have happened if the duties hadnotbeen breached. Were it otherwise, it would reward the defaulting employee since the consequences of his breach would be assessed on the footing that the breach would take place in any event and this plainly cannot be correct. In the present case, had Mr Mattheus not breached his duties, he would have remained in EPL’s employ and the Atlas and Hans Leffer contracts would have remained with EPL. There was nothing to suggest this would not be the case. We thus disagree with the Judge, and find instead that factual causation is established between Mr Mattheus’ diversion of the Atlas and Hans Leffer customer accounts to IOGC and EPL’s loss of future profits. 23 But the Judge also found that EPL failed to adduce sufficient proof on the quantum of loss of profits claimed, that being a figure between $2.8m and $4.2m. EPL’s only basis for such a figure is an expert report valuing EPL’s loss of future profits at $3.25m. That report, however, is entirely unsatisfactory. The expert had arrived at this figure by applying a four year multiplier to EPL’s net profits for the financial year ending 2011. The only reason given for his use of the four year multiplier was that he had been instructed that this would be appropriate by Mr Gerhard. This plainly does not constitute admissible evidence as to why such a multiplier is appropriate; and in the final analysis, no explanation was proffered for why this was an appropriate basis for computing the loss. Moreover, EPL’s counsel, Mr N Sreenivasan SC also could not explain why EPL’s net profits for 2011 as a whole had been used in deriving a multiplicand when the loss of profits claim was only made in relation to the loss of certain specific customer accounts of Unit 2 and not the entirety of EPL’s business. 24 In the light of these difficulties, the Judge fixed a conventional award at $50,000. Save for the quantum, we agree with the Judge’s approach in all the circumstances. The present case involved serious and deliberate breaches of duties, including the duty of loyalty, on the part of Mr Mattheus which have caused a definite loss of future profits to EPL. These breaches entitled EPL to equitable compensation. In our judgment,despite EPL’s failure to prove the quantum it has sought, this court may nonetheless consider whether theavailableevidence allows it to arrive at a figure that is proportionate and equitable in the circumstances of the case. A dishonest fiduciary should not be entitled to rely on technical evidential difficulties (which may or may not be a result of his own breaches of duties owed) to completely evade liability for a loss he has undoubtedly caused to his principal. In this regard we note, as the Judge did, that Mr Mattheus had gone to extraordinary lengths to destroy evidence that was contained in his computer. In our judgment, this was the exceptional basis on which the Judge chose to award a conventional sum in the particular circumstances of this case. 25 However, we consider that the quantum of $50,000 awarded by the Judge below was grossly inadequate for the purposes of equitably compensating EPL for its loss of future profits, which it clearly would suffer. As pointed out by EPL, the Judge had assessed the sums of $118,560 and $44,894.92 as reflecting the lossesactuallyincurred already by reason of Mr Mattheus’ diversion of the Hans Leffer and Weir Group businesses during his employment with EPL, and these figures reflected losses incurred over a span of just four months (May 2012 to August 2012). 26 In our judgment, it would be reasonable to award EPL damages for the loss of profits calculated over a period of one year. Such a period reflects the minimum period for which it may reasonably be expected the accounts would have continued. As for the multiplicand, in our judgment, such damages can best be assessed with reference to the actual loss suffered by EPL by reason of the diversion. As mentioned above, the Judge awarded $118,560 for diversion of business from Hans Leffer and a further $44,894.92 for diversion of business from the Weir Group. In determining the quantum of damages to be awarded to EPL, we do not include the diversion from the Weir Group because EPL has not particularised the business from the Weir Group as part of its claim for loss of future profits. Further, we observe that a representative from the Weir Group had informed EPL that it never contracted with IOGC or Mr Mattheus after the termination of Mr Mattheus’ employment with EPL. We thus award EPL the sum of $355,680 for its claim for loss of future profits. We derive this by extrapolating the profit actually diverted over a four-month period from Hans Leffer into a one-year period by multiplying it by three.",
        "Unauthorised expenses": "27 EPL submits that the Judge erred in dismissing EPL’s claims against Mr Mattheus for the unauthorised expenses he incurred which were reimbursed by EPL. The Judge held that EPL had either waived its right to claim against Mr Mattheus in this regard or impliedly authorised such expenses. We disagree. Given that Mr Mattheus was authorising his own expenses using funds from the Unit 2 accounts (of which he was an authorised signatory), and given that there was nothing to show that Mr Gerhard was aware of how those expenses had been incurred so as to establish waiver or implied authorisation, we do not think it can fairly be said that either of these defences have been established in the present circumstances. Moreover, it is inconceivable that some of these expenses which represented personal shopping expenses could possibly have been treated as legitimate employment claims. 28 By way of illustration, among the unauthorised expenses claimed, some related to expenses incurred by Mr Mattheus’ wife for shopping and holiday purposes and by his children for duty free shopping. Such expenses clearly do not fall within the scope of authorised expenditures and we would thus allow EPL’s claim for unauthorised expenses save for two limitations: (a) First, the expenses incurred for Mr Mattheus’ children’s university fees are to be excluded from the quantum. This is because there is some uncertainty as to whether the oral employment agreement reached between Mr Gerhard and Mr Mattheus provided that EPL would cover Mr Mattheus’ children’s tertiary education fees and this uncertainty cannot be resolved in favour of EPL given the state of the evidence. (b) Second, the defendants have also submitted that the claims for unauthorised expenses incurred prior to 16 March 2007 (six years before the date of the writ 16 March 2013) are time-barred. Given that EPL’s claim for unauthorised expenses is not premised upon a misuse of trust property, we accept the defendants’ submission. 29 We thus find that Mr Mattheus is to pay EPL damages for unauthorised expenses incurred from 16 March 2007 onwards, save that all direct expenses incurred for Mr Mattheus’ children’s university fees are to be excluded. These expenses would include the actual fees as well as reasonable accommodation fees only.",
        "Advances and loans": "30 Finally, we turn to the claim for the advances and personal loans taken out from EPL by Mr Mattheus and not yet returned. We state at the outset that there is insufficient evidence, in our judgment, to make an affirmative finding that the Judge erred in dismissing this head of claim. While we note that there is some evidence to suggest that monies were advanced to Mr Mattheus, the evidence as to the exact quantum owed varied. For example, Mr Mattheus signed the AUDIT CONFIRMATION in 2002, confirming a debt of $157,500 owed to EPL as at 31 December 2001 but the amount now claimed as at 31 December 2001 is $282,500. During the arguments, counsel for the defendants, Mr See Chern Yang, did accept that the quantum had been agreed at $575,000. But there remains a difficulty. We note the existence of a letter signed by Mr Gerhard on 3 June 2002 stating that the amount of $157,500, which was included in the computation of the sum of $575,000, had been paid on account of the “offshore part” of Mr Mattheus’ salary. As this was not resolved in the evidence, we are unable to find that the Judge erred in dismissing EPL’s claim for this head of loss.",
        "Conclusion": "31 In the circumstances, we allow the defendants’ appeal in CA 47 in part. We also allow EPL’s appeal in CA 106 in part. We order that: (a) The decision of the Judge below with respect to the damages payable for the company car, the diversion of business from Hans Leffer and the diversion of business from the Weir Group is to stand. The total amount payable in this regard is $263,454.92. (b) In addition, the defendants shall pay EPL $355,680, instead of the $50,000 awarded by the Judge below, for EPL’s loss of future profits. (c) The defendants shall pay EPL damages for unauthorised expenses incurred by Mr Mattheus from 16 March 2007 onwards, less expenses incurred for his children’s tertiary education. This sum is to be agreed between the parties, and if no agreement is reached, the parties are to write in to make further submissions as to the appropriate quantum. Alternatively, they may consider the assistance of a mediator for this purpose. (d) The sum of $60,000, being the salary owed by EPL to Mr Mattheus, shall be set-off against the damages payable to EPL.  32 We make no order as to the costs of either appeal. Each party shall bear its own costs. We also order that the security for the costs be paid out. Sundaresh Menon   Chao Hick Tin    Judith Prakash  Chief Justice    Judge of Appeal   Judge See Chern Yang and Premalatha Silwaraju (Premier Law LLC) for the appellants in Civil Appeal No 47 of 2015 and the respondents in Civil Appeal No 106 of 2015;N Sreenivasan, SC, Vithyashree and Timothy Soo (Straits Law Practice LLC) instructed by K Chandra Sekaran (Lau & Chandra LLP) for the respondent in Civil Appeal No 47 of 2015 and the appellant in Civil Appeal No 106 of 2015."
    }
}