{
    "case_title": "APE\n      v\n      APF",
    "ncitation": "[2015] SGCA 47",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      Judith Prakash J",
    "sections": {
        "Introduction": "1       This was an appeal against the decision of the High Court judge (“the Judge”) inAPE v APF[2015] SGHC 17 (“the GD”) dealing with all the ancillary matters which arose pursuant to the divorce of the appellant Wife and the respondent Husband. We dismissed the Wife’s appeal. As we stated after hearing the oral submissions from the respective parties, we found no reason to interfere with the decision of the Judge on all the issues. We therefore upheld his decision to: (a) grant joint custody of the only child of the marriage to both parents; (b) divide the matrimonial home in the ratio of 70:30 in favour of the Wife; (c) award a monthly sum of $1,500 in respect of maintenance to the child to be borne equally by both parents; and (d) preserve the Wife’s legal right to future maintenance. 2       However, we found it necessary to make one clarification pertaining to the last-mentioned issue of maintenance to the Wife. Specifically, our concern centred on the Judge’s decision to make “no order” on her application for maintenance instead of an order for nominal maintenance. In doing so, he was of the view that such an order wouldnot precludethe Wife from applying for maintenance in the future should there be a need to do so. As we shall elaborate upon below, an order to the effect that there was “no order” didnot, with respect, have the legal effect which the Judge thought it did. Indeed, such an order would have theoppositelegal effect which the Judge intended it to have. Put simply an order to the effect that there was “no order” would, as we explain below, have resulted in arejectionof the Wife’s application for maintenance and would have thereforeprecludedher from applying for maintenance should such a need to do so arise in the future. As we were of the view (like the Judge) that the Wife should be afforded the opportunity to apply for maintenance in the future should there be a need to do so, we ordered, instead, that there would be nominal maintenance of $1 per year for the Wife. In summary, we did not differ – insubstantive result– from the order the Judge had made in this particular regard. However, we differed from him inasmuch as thelegal mechanismwhich he adopted was, with respect, the incorrect one. In so holding, we reaffirm the decision of this court inTan Bee Giok v Loh Kum Yong[1996] 3 SLR(R) 605 (“Tan Bee Giok (CA)”). 3       What follows is a brief elaboration of the legal proposition made above,viz, that the correct order to be made if a wife’s legal right to maintenance is sought to be preserved is not an order of “no order” but, instead, one for nominal maintenance.",
        "The correct order to be made in a situation where a wife’s legal right to maintenance is sought to be preserved": "4       It might be apposite to begin with the Judge’s own observations as well as approach in the present case, which are encapsulated within the following paragraphs of the GD (at [39]–[41]): 39    On the issue of maintenance of the wife, the wife submitted that all she wanted was a nominal sum of $1 in order to preserve her rights in the event anything untoward happens to her in the future. The wife referred toTan Bee Giok v Loh Kum Yong[1996] 3 SLR(R) 605 (“Tan Bee Giok”) in which the Court of Appeal held that the court could not vary the maintenance order under s 112 of the Women’s Charter (Cap 353, 1985 Rev Ed) (now s 118 of the present WC) if there was no subsisting order for maintenance. The husband submitted that she should get no maintenance. 40    Given that the wife was earning a good salary and she only wanted nominal maintenance to preserve her right for maintenance in the future should the need arise, I decided for pragmatic reasons that it was not necessary to order nominal maintenance merely to preserve her rights to maintenance in future. To achieve this end, I indicated that this would not preclude her from applying for maintenance in the future should there be a need for her to do so. Thus I made no order as regards her maintenance. I am aware that the Court of Appeal inTan Bee Giokmade the following observations (at [15]): If an application for maintenance is dismissed as in this case, there is nosubsistingorder for maintenance for the court to vary and s 112 has no application. A pre-condition to the operation of s 112 is the existence of a maintenance order: seeMills v Mills[1940] P 124 andStephen v Stephen[1931] P 197. Consequently, if the order below stands the wife will be precluded forever from applying to court for maintenance. Thus, to retain the wife’s right to maintenance in the future, a nominal order should have been made so that an application may be made subsequently to invoke the jurisdiction of the court to vary the maintenance order. 41    In that case, the court below dismissed the wife’s application for maintenance as she had the financial resources. This caused the Court of Appeal to hold that in the future the court could not vary the maintenance order under s 112 of the Women’s Charter (Cap 353, 1985 Rev Ed) as there was no subsisting order for maintenance to vary. In the instant case, should the wife require maintenance in the future, she can apply for a fresh maintenance order under s 113 of the present WC and not a variation of a maintenance order. Hence her right to maintenance had been preserved andTan Bee Giokwas not applicable as I did not dismiss her application for maintenance and merely made no order for maintenance. 5       It will be seen from the observations quoted in the preceding paragraph that the Judge had, with respect, missed a crucial point inTan Bee Giok (CA). Whilst he correctly pointed out that, on thefactsof that case, the court could not vary the maintenance order in favour of the wife simply because there was no subsisting order for maintenance to vary, he had, with respect, missed the further observation by this court inTan Bee Giok (CA)to the effect that if a court wished to preserve the wife’s legal right to maintenance for the future, then the correct order to make would be one fornominal maintenance. This was the (normative) proposition which would apply infuturecases where the court is of the view that a wife’s legal right to maintenance ought to be preserved.Correlatively, an orderrejectingthe wife’s application for maintenance would, as this court also pointed out inTan Bee Giok (CA), entail the wife being “precluded foreverfrom applying to court for maintenance” (at [15]) [emphasis added]. At this particular juncture, it would, in our view, be apposite to set out the relevant observations by this court inTan Bee Giok (CA)in full as follows (at [13]–[15]): 13The learned judgerefusedto awardto the wife any maintenance and his main reason was that there was evidence showing that the wife has financial resources. He said ([11]supraat [27]): There was evidence to show that after leaving the marriage she lived in a rented flat and owned a luxury car. There were entries in her bank statements showing that she received a total amount of some $500,000 during the last four years. She did not voluntarily reveal the receipt of the funds. After she was compelled to reveal them she gave no satisfactory explanation of the source of the moneys. She said she had borrowed moneys but offered no proof that they were loans. It appeared to be an effort to deliberately conceal her resources. I therefore hold that she failed to make out her case for maintenance by her former husband. She, of course, is not precluded from making a fresh application should there be radical change in the circumstances in the future. 14It was pointed out by counsel for the wifethat the learned judgewas wrongin saying that the wifecould subsequently make an application for maintenance should there be a material change in the circumstances.We agree with counsel entirely.Section 107 of the Women’s Charter provides that the court “may order a man to pay maintenance to his wife or former wife … when granting or subsequent to the grant of a decree of divorce, judicial separation or nullity of marriage.” In this case, the wife’s application for maintenance was heard and an order was maderefusingher any maintenance, and that order disposed of her application entirely.She is not entitled thereafter to make a fresh application.The provision that enables a husband or a wife to come to court again on the issue of maintenance is s 112 of the Women’s Charter which provides: The court may at any time vary or rescind any subsisting order for maintenance, whether secured or unsecured, on the application of the person in whose favour or of the person against whom the order was made, or, in respect of secured maintenance, of the legal personal representatives of the latter, where it is satisfied that the order was based on any misrepresentation or mistake of fact or where there has been any material change in the circumstances. 15Ifan application for maintenance isdismissedas in this case, there isnosubsistingorder for maintenance for the court to vary and s 112 has no application. A pre-condition to the operation of s 112 is the existence of a maintenance order: seeMills v Mills[1940] P 124 andStephen v Stephen[1931] P 197.Consequently, if the order below stands the wife will be precluded forever from applying to court for maintenance.Thus,to retainthe wife’s right to maintenance in the future,a nominal ordershould have been made so that an application may be made subsequently to invoke the jurisdiction of the court to vary the maintenance order. [emphasis in italics in original; emphasis added in bold italics and underlined bold italics] 6       We have set out the relevant observations inTan Bee Giok (CA)in full because it is important, in our view, to note thecontextin which they were made. In particular, these observations were made in relation to therefusalby the trial judge to grant the wife’s application for maintenance (seeTan Bee Giok v Loh Kum Yong[1996] 1 SLR(R) 130). Put simply, he hadrejectedthe wife’s application and,more importantly, thelegal effect or resultof that rejection (inthis court’sview on appeal) was that the wife concerned was “precluded forever” from applying to court for maintenance (seeTan Bee Giok (CA)at [15]; see also at [14]).This was precisely why this court inTan Bee Giok (CA)was at pains to emphasise that, if the court concerned was minded topreservea wife’s right to maintenance in the future, it should makean order for nominal maintenanceinstead.However, the Judge in the present case decidednotto make an order for nominal maintenance but madeno orderon the Wife’s application for maintenanceinstead. He was of the view that such an order did not preclude the Wife from making an application to the court for maintenance in the future should the need arise.Put simply, what the Judge was doing, insubstance, was toequatethelegal effect or resultof an order for nominal maintenance with that for an order that there be no order on an application for maintenance. With respect, wedisagree.Let us elaborate. 7       An order fornominalmaintenance,by its very terms,clearly preservesa wife’s right to apply for a variation of that maintenance order in thefutureshould the need arise because there has been a material change in the circumstances. 8       Incontrast, an order that there beno orderon a wife’s application for maintenance is, insubstance, arejectionof that application itself. Put simply, an order that there be no order on an application for maintenance must necessarily constitutea decisionon that application and cannot, instead, be an order that puts everything in limbo or which “suspends” final judgment on the application, so to speak. That this is indeed the case was recently laid down by this court inSinwa SS (HK) Co Ltd v Nordic International Ltd and another[2015] 2 SLR 54 (“Sinwa (CA)”). Although the context was slightly different, the point ofgeneral principleisequally applicableto the present case. In that case, the trial judge had decided that there be “no order” on a summary judgment application filed by the appellant (seeSinwa SS (HK) Co Ltd v Nordic International Ltd and others[2014] SGHC 132). In summary, this court held, on appeal, inSinwa (CA), first, that it was possible for a court hearing a summary judgment application to make “no order” on the application under the Rules of Court (Cap 322, R 5, 2014 Rev Ed) and, secondly, that there was no right of appeal to the Court of Appeal against such an order under the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed).However(and in relation to the second point just mentioned), this court was clear that, but for the fact that there was no right of appeal to the Court of Appeal under the relevant legislation, an order to the effect that there was to be “no order” could itself have constituted an “order” from which an appeal was possible because such an order was adisallowance or rejectionof the application concerned. Steven Chong J, who delivered the grounds of decision of the court, observed thus (at [41]): Second, we respectfully disagree with the Judge’s statement that there was no order from which the Appellant could appeal (at [10] of the GD ([21]supra)). The Judge’s decision to make no order on the Appellant’s application for summary judgment itself constituted an “order” from which the Appellant could appeal. In the same way that an order of “no order” had legal effect from the date it was made, it must equally be capable of being the subject matter of an appeal provided that the right of appeal is available. This point was dealt with inTohru Motobayashiat [15] where this court held that the effect of “no order” made by the Judicial Commissioner below was that he had disallowed the application and there was no reason why an appeal did not lie from this part of the order. There is no right of appeal from the Judge’s decision in making “no order” in respect of the Appellant’s summary judgment application, not because there is no order from which to appeal, but because such an order, on a purposive interpretation, is caught by s 34(1)(a) and para (a) of the Fourth Schedule to the SCJA, which provides that certain orders made are non-appealable to the Court of Appeal. 9       For the avoidance of doubt, we would like to consider briefly two recent local High Court cases where certain views were expressed (albeit inobiter dicta) which do not, in our respectful view, represent the correct legal position in so far as this particular issue is concerned. 10     The first is the decision ofANJ v ANK[2014] SGHC 189 (“ANJ (HC)”). Although this decision in fact appliedTan Bee Giok (CA)in granting nominal maintenance, the judge did nevertheless proceed to observe (at [30]) that “[w]hile I accept that it is not logical to maintain a distinction between nil maintenance and $1 maintenance a month, the said Court of Appeal decision [inTan Bee Giok (CA)] appears to be good law still”. As we have already noted above,Tan Bee Giok (CA)is indeed good law. We also explained that it is undergirded bya substantive conceptual and principled basiswhich goes beyond the mere (and literal) figures. In this regard, we would observe for completeness that, on appeal ofANJ (HC)to this court, the judge’s order granting nominal maintenance to the wife was also not interfered with (seeANJ v ANK[2015] SGCA 34 (“ANJ (CA)”) at [44]). Implicit in that decision, therefore, was that the court inANJ (CA)continued (as we do) to regardTan Bee Giok (CA)as still being good law. 11     The second decision isADB v ADC[2014] SGHC 76 (“ADB”). The judge there dismissed the wife’s claim for maintenance for herself by making “no order for maintenance” which, he explained, had the effect of disallowing her from ever seeking maintenance from the husband (at [9]). However, it is important for present purposes to note that the judge also observed inobiter dictathat if, instead, it was thought necessary to preserve a wife’s right to maintenance in the future, then the appropriate order to make was an order that there be “no maintenance for the time being with liberty to apply”(at [8]): In some cases, courts have awarded a token $1 monthly maintenance, presumably with a view to “preserve” the wife’s right to maintenance. In my view, this token gesture is unnecessary because s 118 of the Women’s Charter (Cap 353, 2009 Rev Ed) permits the wife (and husband) to apply for a variation or rescission of the maintenance order at any time.Thus, an order that there beno maintenance for the time being with liberty to applywould have sufficed to preserve the parties’ rights.In any event, should it be thought that technically a token sum should be awarded (in case a husband should subsequently argue that the court cannot vary a “0” sum), then it becomes important to appreciate the distinction between an order for no maintenance and one for no maintenance but with liberty to apply. Not only does s 118 refer to a variation of the maintenance order and not the maintenance sum, but even in terms of mathematics, a “0” is also a number. [emphasis added in bold italics and underlined bold italics] 12     With respect, the observations quoted in the preceding paragraph centre, once again, upon the mere (and literal) figures. The formula suggested (that there be an order for no maintenance but with liberty to apply) is also somewhat cumbersome. More importantly, however, and in avoiding the danger of the literalness just referred to, this particular formula appears to comprise two limbs. The first is, in substance, an order that there be “no order” with regard to a wife’s application for maintenance. As we have already elaborated upon above, such an order is, in substance as well as effect, arejection or disallowanceof the wife’s application, thusprecluding her from ever claiming maintenance again. Inthosecircumstances, the second limb (which is a liberty to apply) wouldhave nothing to apply to. This is because it is settled law that the “liberty to apply” order is only intended tosupplementthe main orders of the court in form and convenience so that the main orders may be carried out and may not be used tovarythe order of the court (see the local High Court decision ofAnwar Siraj and another v Teo Hee Lai Building Construction Pte Ltd[2014] 1 SLR 52 at [47] and the cases cited therein). In other words, because the “liberty to apply” proviso seeks only to enable the working out of the main orders of the court, it is necessarily devoid of any meaning and effect when there is, in substance, no main order from which reference can be taken in the first place. However, that, as we have explained, is precisely the effect of the first limb in the formula proposed inADB.",
        "Conclusion": "13     For the reasons set out above (and, in particular, having regard to the recent decision of this court inSinwa (CA)), it is clear that, in order to preserve a wife’s right to apply for maintenance to the court in the future, an order ofnominal maintenanceis required. In this regard, an order that there be “no order” will not suffice as it is, in substance, a rejection or disallowance of the Wife’s application for maintenance which would – as stated by this court inTan Bee Giok (CA) –prevent the Wife from ever applying for maintenance thereafter."
    }
}