{
    "case_title": "Chua Boon Chye\n      v\n      Public Prosecutor",
    "ncitation": "[2015] SGCA 31",
    "coram": "Chao Hick Tin JA; \n      Andrew Phang Boon Leong JA; \n      Tay Yong Kwang J",
    "sections": {
        "Introduction": "19     It would be apposite, at this juncture, to set out the Question once again, as follows: Whether the previous conviction of a third party is admissible as evidence against the accused in criminal proceedings. 20     The Question is simple only in its form and belies a number of difficult issues to which our attention now turns. The crux of the answer to the Question lies in the purpose as well as meaning of s 45A (which has been reproduced above at [16]).",
        "Background facts": "3       The background facts relating to the Applicant’s charge have been set out in the decisions of the District Court and the High Court (seePublic Prosecutor v Chua Boon Chye[2013] SGDC 441 (“Chua Boon Chye (DC)”) andChua Boon Chye v Public Prosecutor[2014] SGHC 135 (“Chua Boon Chye (HC)”), respectively). We do not propose to repeat them in their entirety, save to highlight the facts that are germane to this criminal reference. 4       Shankar s/o Balasubramaniam (“Shankar”) (the Prosecution’s first witness) was the operations executive of an MFO terminal operated by Chevron Singapore Pte Ltd (“Chevron”) located at No 210 Jalan Buroh (“the Terminal”). As part of his role, which included taking on the duty of shift superintendent, Shankar would track the movement of MFO at the Terminal. There were shore tanks in the Terminal. In the course of operations, minor discrepancies in shore tank readings would arise, which led to “gains” and “losses” in MFO. When MFO was pumped into vessels, for instance, there may be a variance between the reading on the shore tank and that on the vessel. The tolerance level for this variance was 0.5%. Any amount constituting gains (within this 0.5%) was retained at the Terminal. Shankar, as shift superintendent, was the custodian of these discrepancies. At the end of each shift, he had to record them in a log book and report to his superior, Tan Poo Lee. 5       Shankar conspired with two petroleum surveyors, Remy bin Khaizan (“Remy”) (the Prosecution’s second witness) and Viknasvaran s/o Kumarasamy (“Viknasvaran”) (the Prosecution’s third witness), to siphon off and sell the gains of the MFO at the Terminal. As petroleum surveyors, Remy and Viknasvaran had to take measurements of the fuel in a barge before and after loading. In siphoning off MFO, their roles were as follows: (a)     Shankar identified the gains of MFO which had not been reported to Chevron. (b)     Shankar then informed Remy both of the quantity of the gains available, and of the vessels that were arriving at the terminal for loading. (c)     Remy then negotiated with the vessel’s owner or representative (such as the Applicant) for the sale of the illicit fuel. (d)     To conceal their wrongful acts, either Remy or Viknasvaran boarded the vessels and took measurements of the MFO before and after loading. The figures were adjusted such that the loading of the excess MFO would not be detected (for instance, by inflating the pre-loading figure). (e)     When the loading was completed, Shankar prepared the Certificate of Quantity – which also excluded the quantity of the excess fuel. (f)     The payments for the excess MFO were then made in Singapore dollars, in cash, and without any receipt. 6       Shankar, Remy and Viknasvaran carried out their plan on 29 October 2009. Shankar was on duty as shift superintendent on that day. He identified 105 metric tonnes of MFO (gains) to sell and informed Remy accordingly. He also informed Remy that the MV Milos, a barge operated by Aegean Breeze Shipping Pte Ltd (“ABS”), was due at the Terminal to load 2,500 metric tonnes of MFO. Remy approached a broker, Hussein Ahmad bin Abdul Satar (“Hussein”) (the Prosecution’s fifth witness), to sell this excess MFO. The Applicant understood that the MFO came from the “black market” (according to his statement given to the Corrupt Practices Investigation Bureau dated 15 May 2008). They agreed on a price of $180 per metric tonne for the 105 metric tonnes (totalling $18,900). The Applicant then contacted a bunker clerk on board the MV Milos to expect an additional 105 metric tonnes of MFO. 7       When the MV Milos berthed at the Terminal on 29 October 2007, the 105 metric tonnes of MFO were loaded onto the barge. Subsequently, the Applicant met Hussein at a hawker centre to make a cash payment of $18,900 from his company’s (Aegean Bunkering (Singapore) Pte Ltd (“AB”)) petty cash account. 8       The Applicant was the general manager and director of AB. AB and ABS were related companies. AB was a wholly owned subsidiary of Aegean Marine Petroleum SA (“AM”), incorporated in Liberia. AM was in turn wholly owned by Aegean Marine Petroleum Network Inc (“AMPN”) which was incorporated in New York. AB was in the business of purchasing MFO. Once AB made the purchase, it would refer the operational aspects of delivery to ABS. ABS was wholly owned by Aegean Shipholdings Inc, a company registered in the Marshall Islands, which was in turn wholly owned by AMPN. ABS and Aegan Shipping Inc were part of the “operational arm” of AMPN, whereas AB and AM were part of the “trading arm”. For ease of reference, we illustrate this with the following diagram:  9       The Applicant was arrested later and claimed trial in the District Court to the following charge (“the Charge”): You are charged that you, on or about 29 October 2007, in Singapore, did dishonestly receive stolen property, namely, approximately 105 metric tonnes of fuel oil, valued at approximately S$69,106.70 (Sixty Nine Thousand One Hundred and Six Dollars and Seventy Cents), belonging to Chevron Singapore Pte Ltd, whilst having reason to believe the same to be stolen property, and you have thereby committed an offence punishable under section 411 of the Penal Code, Chapter 224 (1985 Rev Ed). 10     For ease of reference, we set out the relevant portion of s 411 of the PC, which reads as follows: Dishonestly receiving stolen property 411.—(1) Whoever dishonestly receives or retains any stolen property, knowing or having reason to believe the property to be stolen property, shall be punished with imprisonment for a term which may extend to 5 years, or with fine, or with both. … 11     The phrase “stolen property” in s 411 of the PC is in turn defined in s 410 of the PC, which reads as follows: Stolen property 410.—(1) Property the possession whereof has been transferred by theft, or by extortion, or by robbery, and property which has been criminally misappropriated, or in respect of which criminal breach of trust or cheating has been committed, is designated as “stolen property”, whether the transfer has been made or the misappropriation or breach of trust or cheating has been committed within or without Singapore. But if such property subsequently comes into the possession of a person legally entitled to the possession thereof, it then ceases to be stolen property. (2) The expression “stolen property” includes any property into or for which stolen property has been converted or exchanged and anything acquired by such conversion or exchange, whether immediately or otherwise. 12     After a 29 day trial, the DJ convicted the Applicant of the charge on 13 November 2013. The DJ accepted the Prosecution’s case, namely, that the MFO stated in the Charge was in fact stolen property, the Applicant had reason to believe it was stolen, and that he had indeed received it. The DJ, in finding that the MFO stated in the Charge was stolen, relied on two grounds. First, Shankar’s oral testimony to the effect that he conspired with Remy and Viknasvaran to siphon off the MFO stated in the Charge. Secondly, Shankar’s earlier charges for CBT for siphoning oil to various barges (including the MV Milos). Shankar pleaded guilty, but the charge involving MV Milos was in fact one that was taken into consideration for the purpose of sentencing (seeChua Boon Chye (DC)at [21]). 13     The Applicant then appealed against both the conviction and sentence imposed by the DJvideMagistrate’s Appeal No 294 of 2013 in the High Court. In the Magistrate’s Appeal, the Applicant argued that the DJ had erred in finding that the MFO in the Charge was “stolen property”. The Prosecution contended that the MFO in the Charge was “stolen property”, and reiterated the same two reasons given by the DJ in making this finding as outlined in the preceding paragraph. 14     The Judge held,inter alia, that the DJ was right in admitting that evidence and agreed that the MFO in the Charge was “stolen property” (seeChua Boon Chye (HC)at [22]). Accordingly, the Judge rejected the Applicant’s arguments and dismissed the Applicant’s appeal on 15 July 2014. 15     The Applicant then filed Criminal Motion No 59 of 2014 for leave to refer three questions of law of public interest purportedly arising from the High Court decision to this court. On 3 October 2014, this court granted leave to refer the Question as stated at [1] of this judgment.",
        "Arguments raised in the present criminal reference": "16     The parties have cited s 45A of the Evidence Act (Cap 97, 1997 Rev Ed) (“the EA”) as the relevant statutory provision governing the admissibility of prior conviction(s) in later proceedings. This provision (which we shall refer to simply as “s 45A”) reads as follows: Relevance of convictions and acquittals 45A.—(1) Without prejudice to sections 42, 43, 44 and 45, the fact that a person has been convicted or acquitted of an offence by or before any court in Singapore shall be admissible in evidence for the purpose of proving, where relevant to any issue in the proceedings, that he committed (or, as the case may be, did not commit) that offence, whether or not he is a party to the proceedings; and where he was convicted, whether he was so convicted upon a plea of guilty or otherwise. (2) A conviction referred to in subsection (1) is relevant and admissible unless — (a) it is subject to review or appeal that has not yet been determined; (b) it has been quashed or set aside; or (c) a pardon has been given in respect of it. (3) A person proved to have been convicted of an offence under this section shall, unless the contrary is proved, be taken to have committed the acts and to have possessed the state of mind (if any) which at law constitute that offence. (4) Any conviction or acquittal admissible under this section may be proved by a certificate of conviction or acquittal, signed by the Registrar of the Supreme Court, the registrar of the State Courts or the registrar of the Family Justice Courts, as the case may be, giving the substance and effect of the charge and of the conviction or acquittal. (5) Where relevant, any document containing details of the information, complaint, charge, agreed statement of facts or record of proceedings on which the person in question is convicted shall be admissible in evidence. (6) The method of proving a conviction or acquittal under this section shall be in addition to any other authorised manner of proving a conviction or acquittal. (7) In any criminal proceedings, this section shall be subject to any written law or any other rule of law to the effect that a conviction shall not be admissible to prove a tendency or disposition on the part of the accused to commit the kind of offence with which he has been charged. (8) In this section — “registrar of the Family Justice Courts” includes the deputy registrar or an assistant registrar of the Family Justice Courts; “registrar of the State Courts” includes a deputy registrar of the State Courts; “Registrar of the Supreme Court” includes the Deputy Registrar or an Assistant Registrar of the Supreme Court. 17     Mr Sant Singh SC (“Mr Singh”), counsel for the Applicant, argued that the Question should be answered in the negative – s 45A does not permit evidence of a third party’s prior conviction to be adduced in subsequent criminal proceedings. This is because: (a)     Section 45A has to be read together with s 45 of the EA (“s 45”), the latter of which (in particular, Illustration (b) to s 45) forbids the admission of a third party’s prior conviction in subsequent criminal proceedings to prove a fact in issue; (b)     The Singapore Parliament expressly confined s 45A’s application to subsequent civil (and not criminal) proceedings only; (c)     The local cases provide that s 45A applies only in subsequent civil proceedings; and (d)     Permitting third party convictions to be adduced as evidence in subsequent criminal proceedings poses risks to a fair trial. 18     Mr Andre Jumabhoy (“Mr Jumabhoy”) appeared for the Public Prosecutor (“the Respondent”) and argued that the Question should be answered in the affirmative because s 45A permits evidence of a third party’s prior conviction to be adduced in subsequent criminal (and not just civil) proceedings. Mr Jumabhoy submitted that his position was supported not only by the plain language of s 45A but also by the relevant legislative material, which we deal with in detail below.",
        "The Question considered and answered": "",
        "Two conflicting High Court decisions": "21     It is clear that, under Singapore law, evidence of a prior conviction is admissible as evidence in subsequentcivilproceedings pursuant to s 45A (see for example,Boldward Enterprises Pte Ltd v Hitachi Zosen Singapore Limited[1997] SGHC 186 (“Boldward”);Ong Bee Nah v Won Siew Wan (Yong Tian Choy, third party)[2005] 2 SLR(R) 455 (“Ong Bee Nah”);Ari bin Abdullah v Ong Chwee Siew[2007] SGHC 15 (“Ari bin Abdullah”);DBS Bank Ltd v Yamazaki Mazak Singapore Pte Ltd and Another[2008] SGHC 181 (“Yamazaki”); andKim Anseok and another (personal representatives of the estate of Kim Miseon, deceased) v Shi Sool Hee[2010] SGHC 124 (“Kim Anseok”)). But there is uncertainty as to whether prior convictions of third parties are admissible in latercriminalproceedings pursuant to that same provision. In particular, there are two conflicting decisions of the Singapore High Court in which, ironically perhaps, the observations expressed in each wereobiter dicta. These are the decisions inPublic Prosecutor v Heah Lian Khin[2000] 2 SLR(R) 745 (“Heah Lian Khin”) andOng Bee Nah. 22Heah Lian Khinwas a case primarily concerned with the use of previous inconsistent or contradictory statements at trial pursuant to s 147 of the EA. But the court in that case relied on the speech made by the then Minister for Law, Prof S Jayakumar, during the second reading of the Evidence (Amendment) Bill (Bill No 45 of 1995) (“the Bill”), which introduced s 45A, in holding that s 45A only permits a previous conviction of a third party to be admitted as evidence in later civil but not criminal proceedings. More will be said of the speech made by the Minister later in the judgment (see below at [51]). After quoting the Minister’s speech, the court held as follows (at [89]): Plainly, s 45 of the EA was limited to proving the fact that a particular individual had been convicted or acquitted of an offence, where relevant to an issue in the proceedings, and was really intended to save judicial time and costs in subsequent civil proceedings.It did not create an avenue for the admission of a previous conviction of a person as substantive evidence against an accomplice in subsequent criminal proceedings. Furthermore, charges which have been taken into consideration are neither convictions nor acquittals. It therefore follows that the district judge had erred in admitting the charges and the statement of facts pursuant to s 45A of the EA and, without more, relying on them as substantive evidence against the respondent. [emphasis added in italics] 23     The court inOng Bee Nahappeared to doubt the position taken inHeah Lian Khinin relation to s 45A, and sought to restrict it. The court observed that the sentence “[i]t did not create an avenue for the admission of a previous conviction of a person as substantive evidence against an accomplice in subsequent criminal proceedings” in [89] ofHeah Lian Khinshould be read in the context of the specific facts of that case. After setting out [89] ofHeah Lian Khin, the court observed as follows (seeOng Bee Nahat [61]): It can be seen that [Heah Lian Khin] does not really resolve the issue inasmuch as the holding, in so far as s 45A of the Evidence Act is concerned, was probably confined to the much narrower and more specific issue that was before the court in that particular case. 24     Even though the above observations by the court inOng Bee Nah(as quoted in the preceding paragraph) are, strictly speaking,obiter dictaas that case concerned an issue of admitting a defendant’s earlier conviction as evidence against her incivilproceedings, they are nonetheless significant as there is now uncertainty about the scope of s 45A, and whether that provision permits the admission of a third party conviction against an accused. Indeed, Prof Jeffrey Pinsler SC inEvidence and the Litigation Process(LexisNexis, 4th Ed, 2013) (“Evidence and the Litigation Process”) at para 7.029 had this to say: [The] observation [inOng Bee Nah] is significant, for by limiting the High Court’s view inHeah Lian Khinto the specific facts of that case, it leaves open the possibility,inter alia, for a party in a criminal case to rely on the conviction of a non-party. InHeah Lian Khin, the witness’s conviction was arguably admissible on a literal application of s 45A, even though the High Court did not think that the section could be engaged this way. The scope of s 45A requires judicial clarification to avoid potential injustice which could ensue from an unguarded approach to the provision. … 25     However, as bothHeah Lian KhinandOng Bee Nahdo not analyse in any detail the specific issues which arise from an interpretation of s 45A both in itself as well as in relation to other relevant provisions of the EA (in particular, s 45 thereof), it might be apposite to commence our analysis with the analysis of s 45A itself – bearing in mind both parties’ submissions which have been set out briefly above (at [17] and [18] of this judgment).",
        "The actual language of s 45A": "26     In our view, the first port of call must be the actual language of the relevant provision itself – in this case, s 45A. The language of s 45A (in particular, s 45A(1)) isgeneralinasmuch as it drawsno distinctionbetween civil proceedings on the one hand and criminal proceedings on the other. Indeed, if s 45A had been intended by the Singapore Parliament to applyonlytocivilproceedings, one would have expected the provision itself to have stated as much. It should also be borne in mind that – unless expressly stated otherwise (such as is the case in s 23(1) of the EA, as Mr Jumabhoy pointed out) – the EA applies tobothcivilas well ascriminal proceedings. That this is the case is in fact made clear in s 2(1) of the EA itself, which reads as follows: Application of Parts I, II and III 2.—(1) Parts I, II and III shall apply toall judicial proceedingsin or before any court, but not to affidavits presented to any court or officer nor to proceedings before an arbitrator. [emphasis added in italics] Parts I, II and III form the main bulk of the provisions in the EA. Part IV, the only remaining part in the EA with just seven sections (ss 170 to 176), deals with the law relating to banker’s books, and is not relevant for the purposes of this criminal reference. 27     Section 23(1) is one example of a provision in the EA that expressly makes clear that it only applies to civil (and not criminal proceedings), and states as follows: Admissions in civil cases when relevant 23.—(1) In civil cases, no admission is relevant if it is made — (a) upon an express condition that evidence of it is not to be given; or (b) upon circumstances from which the court can infer that the parties agreed together that evidence of it should not be given. … 28     However, in addition to the plain language as well as context of s 45A, it should be borne in mind that this particular provision had its source in,inter alia, the relevantUnited Kingdom(“UK”) legislation (see also below at [34]). Indeed, the root cause of the relevant UK legislation lay in the problematic rule laid down at common law in the English decision ofHollington v F Hewthorn and Company, Limited, and another[1943] 1 KB 587 (“Hollington”) which had held that a conviction for a criminal offence is inadmissible in subsequentcivilproceedings as evidence of the fact that the person convicted committed the offence in question. 29     InHollington, the defendant was the driver of a vehicle which was involved in a collision with the plaintiff’s car, and which was being driven by the plaintiff’s son at the time. The only witnesses were the two drivers. The defendant was convicted of careless driving in a magistrate’s court and the plaintiff then commenced a civil action in respect of the damage to his vehicle. The plaintiff’s son died before the hearing and, being unable to produce direct evidence of the defendant’s negligence, the plaintiff sought to establish this by proof by the defendant’s conviction. Both the trial judge (Hilbery J) and the Court of Appeal rejected this evidence as inadmissible for this purpose because the evidence was seen as offending both the rules excluding hearsay and opinion evidence. 30     The decision inHollingtonhas received trenchant criticism (see, for example, the Law Reform Committee,Fifteenth Report (The Rule in Hollington v Hewthorn)(Cmnd 3391, 1967) (“UK LRC 15th Report”); Michael Dean, “Law Reform Committee: Fifteenth Report on the Rule inHollington v Hewthorn” (1968) 31 MLR 58; the note by A L Goodhart in (1943) 59 LQR 299; J A Coutts, “The Effect of A Criminal Judgment on a Civil Action” (1955) 18 MLR 231; and Cecil Wright, “Evidence – Admissibility of Criminal Convictions in Civil Actions – Hearsay” (1943) 21 Canadian Bar Rev 653;cfE W Hinton, “Judgment of Conviction, Effect in a Civil Case as Res Judicata or as Evidence” (1932) 27 Illinois L Rev 195). The UK LRC 15th Report at paras 3 and 4 sums up the criticism succinctly as follows: 3.    Rationalise it how one will, the decision in [Hollington] offends one’s sense of justice. The defendant driver had been found guilty of careless driving by a court of competent jurisdiction. The onus of proof of culpability in criminal cases is higher than in civil; the degree of carelessness required to sustain a conviction for careless driving is, if anything, greater than that required to sustain a civil cause of action in negligence. Yet the fact that the defendant driver had been convicted of careless driving at the time and place of the accident was held not to amount even to prima facie evidence of his negligent driving at that time and place. It is not easy to escape the implication in the rule inHollingtonv.Hewthornthat, in the estimation of lawyers, a conviction by a criminal court is as likely to be wrong as right. It is not, of course, spelt out in those terms in the judgment of the [English] Court of Appeal, although, insofar as their decision was based mainly upon the ground that the opinion of the criminal court as to the defendant driver’s guilt was as irrelevant as that of a bystander who witnessed the accident, the gap between the implicit and the explicit was a narrow one. 4.    It is in a sense true that a finding by any court that a person was culpable or not culpable of a particular criminal offence or civil wrong is an expression of opinion of the court. But it is of a different character from an expression of opinion of a private individual. In the first place, it is made by persons, whether judges, magistrates or juries, acting under a legal duty to form and express an opinion on that issue. In the second place, in forming their opinion they are aided by procedure, of which the law of evidence forms part, which has been evolved with a view to ensuring that the material needed to enable them to form a correct opinion is available to them. In the third place, their opinion, expressed in the form of a finding or verdict of guilty or not guilty in criminal proceedings or judgment in civil proceedings, has consequences which are enforced by the executive power of the state. 31     Indeed, the decision inHollingtonhas proven to be so unpopular that it has not been followed by the courts in Singapore (seeChoo Michael v Loh Shak Mow[1993] 3 SLR(R) 834 andOng Bee Nah) as well as those in other Commonwealth jurisdictions, such as New Zealand (Jorgensen v News Media (Auckland) Limited[1969] NZLR 961 (Court of Appeal)), Western Australia (see, for example,Mickelberg v The Director of the Perth Mint[1986] WAR 365 (Full Court of the Supreme Court)), Ontario (see, for example,Demeter v British Pacific Life Insurance Co(1983) 150 DLR (3d) 249 (Ontario High Court), affirmed by the Ontario Court of Appeal in (1984) 13 DLR (4th) 318) and Malaysia (see, for example,Ramanathan Chelliah v Penyunting, the Malay Mail and another[1998] 2 CLJ 691 (High Court, Kuala Lumpur);Anwar bin Ibrahim v Abdul Khalid[2001] 5 MLJ 48 (High Court, Kuala Lumpur) as well as the earlier decisions ofChock Kek Ling v Patt Hup Transport Co Ltd & ors[1966] 1 MLJ 120 ,Lim Ah Toh v Ang Yau Chee & anor[1969] 2 MLJ 194 andChang Chong Foo & anor v Shivanathan[1992] 2 MLJ 473 (Supreme Court, Kuala Lumpur)). 32Hollingtonhas had a rather mixed reception in England itself. Lord Diplock in the House of Lords decision ofHunter v Chief Constable of the West Midlands Police and others[1982] AC 529 at 543 said that the decision inHollingtonwas “generally considered to have been wrongly decided”. He did not elaborate on this remark, which in any case was not necessary for that particular decision. Similarly, Lord Denning MR (who was coincidentally the plaintiff’s counsel inHollington) noted in the English Court of Appeal decision ofGoody v Odhams Press Ltd[1967] 1 QB 333 at 339 that he “thought that [Hollington] was wrong at the time” and that he “still [thought] it was wrong” (see also the learned Master of the Rolls’ comments inBarclays Bank Ltd v Cole[1967] 2 QB 738 at 743 and inMcIlkenny v Chief Constable of the West Midlands[1980] 1 QB 283 at 319). On the other hand, Peter Gibson J in the English High Court decision ofSavings & Investment Bank Ltd v Gasco Investments (Netherlands) BV and others[1984] 1 WLR 271 at 280 said thatHollingtonstill represented the common law. 33     At this juncture, we should note that the rule inHollingtonas stated above in [28] was,literally, theactual fact situationinHollingtonitself. This is an important point because there are thefurtherissues (canvassed by the Respondent in the present proceedings) as to whether or not the rule inHollington alsoapplied to the inadmissibility of a conviction for a criminal offence in subsequentcriminalproceedings – a point to which we shall return in a moment.",
        "The prior foreign legislation from the UK and Australia": "34     We note, first, that the UK Parliamentabolishedthe application of the rule inHollingtonin so far as subsequentcivilproceedings were concernedviass 11–13 of the Civil Evidence Act 1968 (c 64) (“the 1968 UK Act”). Approximately a decade and a half later, the UK Parliamentabolishedthe application of the same rule tocriminalproceedings as wellviass 73 and 74 of the Police and Criminal Evidence Act 1984 (c 60) (“the 1984 UK Act”). Australia has enacted legislation to abolish the rule inHollingtonbut only in relation to subsequent civil proceedings (see, for example, ss 91 and 92 of the Evidence Act 1995 (Cth); ss 78–82 of the Evidence Act 1977 (Queensland); s 34A of the Evidence Act 1929 (South Australia); and s 90(1) of the Evidence Act 1958 (Victoria)). 35     For the present purposes, it suffices to note the version of ss 73 and 74 of the 1984 UK Act which existed at the time s 45A was enacted, and which we set out in full for ease of reference: 73Convictions and acquittals. (1)    Where in any proceedings the fact that a person has in the United Kingdom been convicted or acquitted of an offence otherwise than by a Service court is admissible in evidence, it may be proved by producing a certificate of conviction or, as the case may be, of acquittal relating to that offence, and proving that the person named in the certificate as having been convicted or acquitted of the offence is the person whose conviction or acquittal of the offence is to be proved. (2)    For the purposes of this section a certificate of conviction or of acquittal— (a)    shall, as regards a conviction or acquittal on indictment, consist of a certificate, signed by the clerk of the court where the conviction or acquittal took place, giving the substance and effect (omitting the formal parts) of the indictment and of the conviction or acquittal; and (b)    shall, as regards a conviction or acquittal on a summary trial, consist of a copy of the conviction or of the dismissal of the information, signed by the clerk of the court where the conviction or acquittal took place or by the clerk of the court, if any, to which a memorandum of the conviction or acquittal was sent; and a document purporting to be a duly signed certificate of conviction or acquittal under this section shall be taken to be such a certificate unless the contrary is proved. (3)    References in this section to the clerk of a court include references to his deputy and to any other person having the custody of the court record. (4)    The method of proving a conviction or acquittal authorised by this section shall be in addition to and not to the exclusion of any other authorised manner of proving a conviction or acquittal. 74Conviction as evidence of commission of offence. (1)    In any proceedings the fact that a person other than the accused has been convicted of an offence by or before any court in the United Kingdom or by a Service court outside the United Kingdom shall be admissible in evidence for the purpose of proving, where to do so is relevant to any issue in those proceedings, whether or not any other evidence of his having committed that offence is given. (2)    In any proceedings in which by virtue of this section a person other than the accused is proved to have been convicted of an offence by or before any court in the United Kingdom or by a Service court outside the United Kingdom, he shall be taken to have committed that offence unless the contrary is proved. (3)    In any proceedings where evidence is admissible of the fact that the accused has committed an offence, in so far as that evidence is relevant to any matter in issue in the proceedings for a reason other than a tendency to show in the accused a disposition to commit the kind of offence with which he is charged, if the accused is proved to have been convicted of the offence— (a)    by or before any court in the United Kingdom; or (b)    by a Service court outside the United Kingdom, he shall be taken to have committed that offence unless the contrary is proved. (4)    Nothing in this section shall prejudice— (a)    the admissibility in evidence of any conviction which would be admissible apart from this section; or (b)    the operation of any enactment whereby a conviction or a finding of fact in any proceedings is for the purposes of any other proceedings made conclusive evidence of any fact. 36     This particular legislative background is, in our view, of significance because, when theSingaporeParliament introduced s 45A in 1996 (viathe Evidence (Amendment) Act 1996 (No 8 of 1996)), we must assume that it wasawareof the fact thatthe UK Parliamenthadabolishedthe rule inHollingtonwith regard tobothcivilandcriminal proceedings. Indeed, the relevantlegislative materials confirm that this is so – a point which we deal with in more detail below(at [56]–[61]). In our view, it is therefore not surprising that s 45A(1) is, as we have already noted, set out ingeneralterms (ie, as applying tobothcivilandcriminal proceedings). And, as also been noted above, if the Singapore Parliament had intended that s 45A abolish the rule inHollingtonwith regardonlytocivilproceedings, it would have made this clear in s 45A(1) itself. However, in fairness to the Applicant, a number of arguments were made tothe contrary, and it is to those arguments that our attention now turns.",
        "Section 45 and Illustration (b) thereof": "37     Mr Singh argued that there is a distinction between the use of a judgment as evidence of its existence, or as evidence of the facts in it. He argued further that s 45A(1), whilst ostensibly applying to both civil as well as criminal proceedings, must nevertheless be read consistently with s 45, which reads as follows: Judgments, etc., other than those mentioned in sections 42 to 44 when relevant 45.Judgments, orders or decrees other than those mentioned in sections 42, 43 and 44 are irrelevant unless the existence of such judgment, order or decree is a fact in issue or is relevant under some other provision of this Act. Illustrations(a)AandBseparately sueCfor a libel which reflects upon each of them.Cin each case says that the matter alleged to be libellous is true, and the circumstances are such that it is probably true in each case or in neither.Aobtains a decree againstCfor damages on the ground thatCfailed to make out his justification. The fact is irrelevant as betweenBandC.(b)AprosecutesBunder section 498 of the Penal Code for enticing awayC,A’swife.Bdenies thatCisA’swife, but the court convictsB.AfterwardsCis prosecuted for bigamy in marryingBduringA’slifetime.Csays that she never wasA’swife.The judgment againstBis irrelevant as againstC.(c)Ahas obtained a decree for the possession of land againstB.C,B’sson, murdersAin consequence.The existence of the judgment is relevant as showing motive for a crime.(d)Ais charged with theft and with having been previously convicted of theft.The previous conviction is relevant as a fact in issue.(e)Ais tried for the murder ofB. The fact thatBprosecutedAfor libel and thatAwas convicted and sentenced is relevant under section 8 as showing the motive for the fact in issue.38     In particular, Mr Singh submitted that s 45 was the governing provision and, in that regard, it was clear that a conviction wasinadmissible in subsequent criminal proceedings except to the extent that it was adduced as proof of theexistenceof the conviction. He buttressed this argument by referring toIllustration (b)to s 45, which appeared to cover the fact situation in the present proceedings. Indeed, this particular illustration did appear to constitute powerful support for the Applicant’s argument. However, we are not, in the final analysis, persuaded by this particular argument. Let us elaborate.39     It is true that a distinction can be drawn between the use of a judgment as evidence of its existence and as evidence of the facts contained in it (see, for example,Khoo Boo Hooi v Robert Cecil Russell[1938] MLJ 51 at 56–57). It is also true that the effect of s 45 (which has its roots in s 43 of the Indian Evidence Act (Act No 1 of 1872)) is similar to the common law rule rejecting a criminal conviction as evidence of the facts on which it was based for both later civil and criminal proceedings (seeHalsbury’s Laws of Singaporevol 10 (LexisNexis, 2013 Reissue) (“Halsbury’s Singapore vol 10”) at para 120.177).R v John Turner(1832) 1 Mood 347 (“Turner”) represented the common law position at the time s 43 of the Indian Evidence Act was enacted, which barred the use of third party convictions for later criminal proceedings. InTurner, the previous conviction of the thief was inadmissible as evidence that goods allegedly received were stolen. As a result, the accused was acquitted.40     The position as stated in the preceding paragraph is also supported by the relevant Indian cases (as discussed in commentaries such as Ratanlal Ranchhoddas and Dhirajlal Keshavlal Thakore,Ratanlal & Dhirajlal’s The Law of Evidence(LexisNexis, 22nd Ed, 2006) at pp 667–669; M C Sarkar et al,Sarkar’s Law of Evidencevol I (LexisNexis, 17th Ed Reprint, 2011) at pp 1129–1139; and Dr V Kesava Rao,Sir John Woodroffe & Syed Amir Ali’s Law of Evidencevol II (LexisNexis, 18th Ed, 2009)). For example, the Privy Council (on appeal from Calcutta, Bombay) inKumar Gopika Raman v Atal Singh(1929) 31 Bom L R 734 at [23] observed as follows:The Indian Evidence Act does not make finding of fact arrived at on the evidence before the Court in one case evidence of that fact in another case.41     Similarly, Sir George Rankin in the Indian Privy Council decision ofMaharaja Sir Kesho Prasad Singh Bahadur v Bahuria Mt Bhagjogna Kuer(1937) AWR (PC) 459 at [15] observed:Whether based upon sound principle or merely supported by reasons of convenience, the rule that so far as regards the truth of the matter decided a judgment is not admissible evidence against one who is a stranger to the suit, has long been accepted as a general rule in English law. Exceptions there are, but the general rule is not in doubt. … That the same rule applies to India, though it is not expressly formulated in these terms, and may be seen from a reference to Section 43, Evidence Act, 1872, and the illustrations given thereunder.42Zainal bin Kuning and others v Chan Sin Mian and another[1996] 2 SLR(R) 858, a decision of this court, is instructive for it applied s 45 (and Illustration (b) thereof), albeit by way ofobiter dicta. The appellants sued the respondents in the High Court for false arrest and malicious prosecution. The first respondent was the police officer in charge of investigations against the accused while the second respondent (the Attorney-General) was joined as representing the government. The appellants had been arrested and charged with the murder of one Ang. Subsequently, one Sulaiman was charged and convicted of the murder instead. The appellants thus brought claims for: (a) false arrest; and (b) malicious prosecution. The appellants were not successful at trial and on appeal. In dismissing the appeal, this court held,inter alia, that the police acted in good faith in prosecuting the appellants as they had a reasonable case against them. Sulaiman was only arrested much later, and by then, the police had dropped charges against the appellants when it became clear that Sulaiman was the perpetrator. In any event, this court then observed that Sulaiman’s conviction for murder was not admissible as evidence that the appellants were not responsible for Ang’s murder pursuant to s 45 (and Illustration (b) thereof).43     However, a close reading of s 45 will reveal that that provision in fact providesexpresslyfor possibleexceptionswhich must, however, be provided for underthe EAitself. This is to be located in s 45, in particular in the following words:…unlessthe existence of such a judgment, order or decree … is relevant undersome other provision of this Act.[emphasis added in italics]44     Simply put,s 45A is precisely “some other provision of this Act”. Indeed, it was precisely because s 45 rejects a criminal conviction as evidence of the facts on which it was based for both later civil and criminal proceedings that it was necessary – slightly overone hundred years later –tointroduce s 45Ain order toabolishthat rule. If so, thenIllustration(b)to s 45 (which appears to embody the rule inHollington, albeit as applied to subsequentcriminalproceedings)ought to be read bearing this in mind (ie, that s 45A was introduced toabolishthe rule inHollington).Indeed, if there is an inconsistency between an illustration on the one hand and the provision of the main statute on the other (in this case, s 45A), thenthe latter must prevail.Put simply, s 45A was enacted much later and (more importantly) for a specific purpose thatoverrides or overturnsthe verypremise upon which Illustration (b) to s 45 was originally based. In this regard, it is apposite to note the following comment inHalsbury’s Singapore vol 10at para 120.177 which reads as follows:To remove any doubts as to whether the common law rule was still applicable, section 45A was introduced so as to provide that the fact that a person has been convicted or acquitted of an offence by or before any court in Singapore is admissible in evidence for the purpose of proving, where relevant to any issue in the proceedings [[t]here is no distinction between civil and criminal proceedings], that he committed or did not commit that offence, whether or not he is a party to the proceedings; and where he was convicted, whether he was convicted upon a plea of guilty or otherwise. [footnote added in square brackets]45     We are aware that the phrase “Without prejudice to [section 45]” at the beginning of s 45A(1) may give the impression that s 45 is in fact the governing provision, and that it takes precedence over s 45A. We do not think so. The Singapore Parliament could not have taken the trouble to enact s 45A only for it to be rendered superfluous.46     In passing, we have noted the following comment made inHalsbury’s Singapore vol 10at para 120.177:… It should be noted that section 45A only abrogates the common law rule as it applies to criminal convictions or acquittals of the courts in Singapore. A criminal conviction or acquittal of a foreign court … continue to be inadmissible in later proceedings between different parties as proof of the facts found in the earlier proceedings.47     The above passage above may give the impression that foreign convictions or acquittals are inadmissible in latercriminalproceedings. This is not the case because s 290 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”) (see also its predecessor in s 372 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed)) provides that they are admissible. We note also that besides permitting the admission of foreign convictions in later criminal proceedings, s 290 of the CPC (like s 45A) provides thatlocalconvictions are admissible in later criminal proceedings as well.48     For ease of reference, s 290 of the CPC is reproduced as follows:How previous conviction or acquittal may be proved290.—(1) In any inquiry, trial or other proceeding under this Code, a previous conviction or acquittal or any order of court relevant to the case may be proved, in addition to any other way provided by law —(a) by an extract certified to be a copy of the sentence or order by the officer who has custody of the records of the court in which that conviction, acquittal or order was carried out, whether in Singapore or elsewhere; or(b) alternatively —(i) in the case of a previous conviction in Singapore, either by a certificate signed by the officer who has custody of the records of the prison in Singapore in which the punishment or any part of it was inflicted, or by production of the warrant of commitment under which the punishment was suffered; or(ii) in the case of a previous conviction elsewhere, either by a certificate signed by the officer in charge of the prisons in that place in which the punishment or any part of it was inflicted, or by production of the warrant of commitment under which the punishment was suffered,together with evidence as to the identity of the accused and the person so convicted or acquitted or against whom the order was made.(2) The certificate referred to in subsection (1)(b) purporting to be signed by the officer who has custody of the records of the prison in Singapore or elsewhere shall be admitted in evidence on its production by the prosecution without proof of signature and, until the contrary is proved, shall be proof of all matters contained therein.49     In this regard, it is apposite to note the decision of the Singapore High Court inFricker Oliver v Public Prosecutor and another appeal and another matter[2011] 1 SLR 84, which dealt with an issue on the admission of a prior foreign conviction, even though the court did not cite s 290 of the CPC. In that case, the accused, a Swiss national, and his accomplice broke into the premises of SMRT Ltd’s Changi Depot (“the depot”) by cutting a hole in the fence surrounding the depot with a wire-cutter and spray-painted words on the sides of two train carriages. For their actions, the accused was charged with committing the offences of vandalism under the Vandalism Act (Cap 341, 1985 Rev Ed) and entering a protected place under the Protected Areas and Protected Places Act (Cap 256, 1985 Rev Ed) in furtherance of a common intention. The accused pleaded guilty to those charges before the district judge and agreed to have a second charge of vandalism in respect of the cutting of the fence taken into account for the purposes of sentencing. The district judge convicted and sentenced the accused to three months’ imprisonment and three strokes of the cane for the vandalism charge and two months’ imprisonment for the trespass charge, which sentences were to run consecutively. The prosecution and defence appealed against sentence, and the prosecution also filed a criminal motion to admit additional evidence of a previous conviction of the accused in Switzerland by way of an “Extract from the Swiss Criminal Records Registry” (“the Swiss Extract”) to prove recidivism on the accused’s part. V K Rajah JA admitted the Swiss Extract, though he eventually held that he was not persuaded that the Swiss Extract, being devoid of information, constituted a reasonable basis for an inference of recidivism on the accused’s part.50     To conclude this section, we were wholly unconvinced that s 45 (and Illustration (b) thereof) takes precedence over s 45A for the reasons given above.However, our analysis on the relationship between s 45 (and Illustration (b) thereof) and s 45A is not necessarily an end to the matter for, again in fairness to the Applicant, there is another (closely related) string to his legal bow – could it be argued that s 45A had abolished the rule inHollingtononly with regard tosubsequentcivil (and not criminal)proceedings? Indeed, this brings us to the veryparliamentary debatesthat preceded the enactment of s 45A itself.The parliamentary debates in relation to s 45A51     The actual parliamentary debates preceding the enactment of s 45A are to be found in the following statement by Prof Jayakumar during the second reading of the Bill (seeSingapore Parliamentary Debates,Official Report(18 January 1996) vol 65 at col 455):Let me move to new section 45A concerning the rule inHollington v Hewthorn. Section 45A is to reverse a common law rule (known among lawyers as the rule inHollington v Hewthorn, an English case) that operated to exclude evidence of judicial findings of convictions or acquittals from admissibility in subsequent cases. This common law rule states that the evidence in an earlier criminal case cannot be admitted against the defendant in a later civil trial, although, as is known, the standard of proof is higher in a criminal case. For example, a criminal conviction for dangerous driving is inadmissible as evidence of negligence in a civil action for causing personal injuries to the other driver. Reversing this rule means that judicial time and legal costs will be saved by not having to litigate all over again issues which have been decided by another court in previous proceedings. The amendments, Sir, on this matter are similar to provisions in the English and Australian legislation.52     It is true that, if the passage just quoted is looked at literally, there is no mention of the abolition of the rule inHollingtonin so far as subsequentcriminalproceedings are concerned (although as Mr Jumabhoy correctly pointed out during oral submissions, the reference to the saving of judicial time and legal costs would nevertheless applyequallytocriminalproceedings as well). However, as we have already noted, the (descriptive) fact situation inHollingtonitself related to the admissibility of a conviction in subsequentcivilproceedings. The important question of (normative) principle that then arises is whether or not the rule inHollingtonapplies to subsequentcriminalproceedings. In this particular regard, it is clear that that ruledidin fact apply to preclude the admission of a conviction in subsequentcriminalproceedings as well (see, for example, Adrian Keane and Paul McKeown,The Modern Law of Evidence(Oxford University Press, 9th Ed, 2012) at p 637; Roderick Munday, “Proof of Guilt by Association under Section 74 of the Police and Criminal Evidence Act 1984” [1990] Crim L R 236 (“Proof of Guilt by Association”) at 236; and Roderick Munday, “Fairness and Section 74 of PACE” [1990] CLJ 228 (“Fairness and Section 74 of PACE”) at 228). Indeed, the English Criminal Law Revision Committee (“CLRC”) noted as follows in its 11th Report on Evidence (General) (Cmnd 4991, 1972) (“the CLRC 11th Report”) at para 218:There is no doubt that the principle ofHollington v Hewthornapplies to criminal cases, although there is very little authority.53     LikeHalsbury’s Singapore vol 10, the CLRC notedTurneras one case that demonstrates that the principle inHollingtonapplies tocriminal proceedingsas well. SinceTurner, and after the CLRC 11th Report was published, there have been at least two cases (both from the English Court of Appeal) that show that the principle inHollingtonalso applies equally to criminal proceedings, even though these same cases do not citeHollingtonexpressly. One such case isR v Mark Lee Spinks[1982] 1 All ER 587. In that case, the accused stood trial for assisting a third party conceal a knife used in a stabbing with the intent to impede the apprehension or prosecution of “a person who had committed an arrestable offence”, namely, the third party. The third party was convicted in separate proceedings for wounding with intent to do grievous bodily harm, which was an arrestable offence. The court held that the prosecution could not rely on the third party’s earlier conviction as evidence that he had committed the arrestable offence of wounding. Since there was no other admissible evidence that the third party had committed such an offence, the accused’s conviction was quashed. Similarly, inR v Hassan[1970] 1 QB 423, a woman’s conviction for prostitution was inadmissible as evidence of her prostitution at the trial of a man charged with living off her earnings. As a result, that man was acquitted.54     We are of the view that it is reasonable to assume that the draftsperson as well as the Singapore Parliament wasawareof the legal position (including the relevant case law) in relation to the rule inHollington– in particular, that that rule also applied to subsequentcriminalproceedings as well. Indeed,Turner,SpinksandHassan(which we have referred to in the preceding paragraph) were handed downwell befores 45A was introduced by the Singapore Parliament. We have also noted above (at [36]) that we can assume that the Singapore Parliament wasalsoaware thatthe UK Parliamenthadalready abolishedthe rule inHollingtonwith respect tobothcivilas well ascriminal proceedings in 1968 and 1984, respectively – a point which is, in fact,confirmedbythe relevant legislative materials(see below at [56]–[ 62]). All this points, in our view, towards the conclusion that the Singapore Parliament hadintendeds 45A toabolishthe rule inHollingtonwith regard tobothcivilas well ascriminal proceedings.55     But what, then, of Prof Jayakumar’s reference (above at [51]) toHollingtonin the context of (ostensibly only)civilproceedings? As already explained above (at [52]), it is entirely possible that this was a reference to thespecificfacts as well as holding inHollingtonitself.In any event, what was stated in the relevant parliamentary debates isnot inconsistent withan interpretation which holds that s 45A applies tobothcivilas well ascriminal proceedings.Most importantly, however, there areother related materialswhichhelp to resolve the matter in a definitive manner– to which we now turn.Other important legislative materials56     The first is, as the Respondent has submitted, to be found inthe Explanatory Statement to the Bill. The material part reads as follows:Clause 4 inserts a new section 45A to the Act to make it clear that the common law rule inHollington v Hewthorn[1943] 2 All ER 65 does not apply in the circumstances specified in that section. The rule of common law inHollington v Hewthornoperates to exclude evidence of judicial findings of convictions or acquittals from admissibility in subsequent cases.57     The reference in the extract just quoted in the preceding paragraph is ageneralone, suggesting that s 45A applies toall typesof proceedings, whether civil or criminal in nature. This is also consistent with the possible explanation canvassed above to the effect that Prof Jayakumar was referring more specifically to the actual fact situation inHollingtonitself during the second reading stage in the Singapore Parliament.58     Secondly (and perhaps even more significantly), the“Table of Derivations”found at the end ofthe Billstates that cl 4 of the Bill (which introduced s 45A) wasderived from ss 73 and 74 of the 1984 UK Act(which, of course, was concerned with the abolition of the rule inHollingtonin relation to subsequentcriminalproceedings).Put simply, if there was any doubt as to whether or not s 45A was intended to apply to criminal proceedings, this lays all doubts to rest.59     At this juncture, we would also like to refer (in a related as well asconfirmatoryvein) to s 45A(7), which reads as follows:In anycriminalproceedings, this section shall be subject to any written law or any other rule of law to the effect that a conviction shall not be admissible to prove a tendency or disposition on the part of the accused to commit the kind of offence with which he has been charged. [emphasis added in bold italics]60     It is clear that s 45A(7) has been included only because s 45A itselfcould apply tocriminal proceedings as well. Indeed, as already noted above (at [58]), s 45A wasbased on the 1984 UK Actand, in a related (and more specific) vein,s 45A(7) was (in turn) based on s 74(3) of the 1984 UK Act.The word “criminal” (as highlighted in bold italics in the quotation in the preceding paragraph) in s 45A(7) is not found in s 74(3) of the 1984 UK Act (see above at [35]), and it must have been specifically added in s 45A(7) to reinforce the point that s 45A applies to subsequent criminal proceedings as well.61     It is now appropriate (and, indeed, important) todraw the relevant threads together. It will be recalled that we mentioned that the first port of call ought to bethe actual languageof s 45A itself(see above at [26]). In this regard, we note (as Mr Jumabhoy also pointed out) that s 45A(1) tracks closely the language of s 11(1) of the 1968 UK Act, which reads (as it stood before s 45A was introduced):11Convictions as evidence in civil proceedings.(1)    In any civil proceedings the fact that a person has been convicted of an offence by or before any court in the United Kingdom shall … be admissible in evidence for the purpose of proving, where to do so is relevant to any issue in those proceedings, that he committed that offence, whether he was so convicted upon a plea of guilty or otherwise and whether or not he is a party to the civil proceedings; but no conviction other than a subsisting one shall be admissible in evidence by virtue of this section.…62     More significantly, Mr Jumabhoy also pointed out that,unlikes 11(1) of the 1968 UK Act, s 45Adoes not contain the phrase “any civil proceedings”.In our view, this is significant and is consistent with the point noted above (at [58]) to the effect that s 45A was derived from the relevant provisions of the 1984 UK Act(which applies tocriminalproceedings).Put simply, s 45A was intended to coverbothcivilas well ascriminal proceedings and, as the Singapore Parliament chose to draw from the relevant language of the 1968 UK Act instead of the 1984 UK Act, it had (necessarily) to delete the reference to the phrase “any civil proceedings” in s 11(1) of the 1968 UK Act.Local decisions63     Before we proceed to answer the Question, we note that Mr Singh relied on several local decisions besidesHeah Lian Khin(for example,Boldward,Ari bin AbdullahandKim Anseok), and in particular, [21]–[22] ofYamazakito argue that the rule inHollingtonapplies only to civil proceedings, which read as follows:21 It would be of some interest to note that s 45A was, in fact, introduced via the Evidence (Amendment) Act 1995 (No 8 of 1996) to abolish the old common law rule embodied in the English Court of Appeal decision ofHollington v F Hewthorn and Company Limited[1943] 1 KB 587 (“Hollington”)that a prior conviction could not be adduced for the purpose of proving the guilt of the defendant in subsequent civil proceedings relating to the same matter(see Jeffrey Pinsler, Evidence, Advocacy and the Litigation Process (LexisNexis, 2nd Ed, 2003) at pp 172-174; see alsoOng Bee Nah v Won Siew Wan (Yong Tian Choy, third party)[2005] 2 SLR 455 (“Ong Bee Nah”) at [51]). Two years before its enactment, the Singapore High Court had actually departed from this common law rule inChoo Michael v Loh Shak Mow[1994] 1 SLR 584 (“Choo Michael”). The criticisms of the rule inHollington, the subsequent decline and fall of the rule in the common law jurisdictions and the legislative intent and rationale behind the enactment of s 45A in Singapore are set out very ably by Andrew Phang Boon Leong JC (as he then was) inOng Bee Nah.22The purpose behind s 45A is to save judicial time and legal costs by not having to re-litigate issues in civil proceedings where the same issues have been previously decided by a court in criminal proceedings(seeOng Bee Nahat [51] where the relevant parliamentary debate is set out; see alsoPP v Heah Lian Khin[2000] 3 SLR 609 at [89]).It also prevents, in the words of Goh Joon Seng J (“Goh J”), “a collateral attack by means of a civil action against a final decision of a court of competent criminal jurisdiction”(Choo Michaelat 600).Bearing in mind that the standard of proof of beyond reasonable doubt in criminal proceedings is much higher than that of a balance of probabilities in civil proceedings, it only makes eminent sense to allow evidence of conviction to be admissible in subsequent civil proceedings, founded upon the same conduct of the convicted person.The difference in the standard of proof as well as the difference in the procedure in regard to the adducing of evidence in criminal and civil proceedings would mean that a finding of culpability against a person upon a contested criminal trial is of higher probative value than that in civil proceedings.…[emphasis added]64     Whilst it is true thatYamazaki,Boldward,Ari bin AbdullahandKim Anseokdid refer to the rule inHollingtonin the context of subsequent civil proceedings, that was because those cases dealt with issues involving the use of s 45A in subsequent civil proceedings. It is therefore not surprising that those cases made no reference to the rule inHollingtonas applied in later criminal proceedings.Risks to a fair trial65     Mr Singh argued that third party convictions should not be admitted as evidence in subsequent criminal proceedings because:(a)     First, to do so poses risks to a fair trial. In particular, allowing third party convictions as evidence in later criminal proceedings would drive a significant inroad into the presumption of innocence. Indeed, Mr Singh had this to say in his written submissions:… [I]t is well-established that the presumption of innocence applies in criminal trials.To the extent that a previous conviction (in particular, that of a third party) would require the accused person to disprove certain elements of the offence, that would amount to a significant inroad into the presumption of innocence.If Parliament had intended such an inroad, one would have expected Minister Jayakumar to at least mention it.[emphasis added in italics](b)     Secondly, the courts in the UK have struggled in applying s 74 of the 1984 UK Act.66     We do not agree with Mr Singh’s arguments for these reasons:(a)     First, while we recognise that there are potential risks to a fair trial, safeguards, which we will turn to (see below at [72]), can be put in place to ensure that the accused would not be unduly prejudiced.(b)     Secondly, we are of the view that Mr Singh’s argument that a “significant inroad” would be driven into the presumption of innocence to be exaggerated. The mere fact that a third party’s conviction is adduced as evidence does not detract from the fact that the prosecution still bears the burden of proof. It is also open to an accused to call on that third party for cross-examination if necessary.(c)     Thirdly, the mere fact that the UK courts have struggled in applying s 74 of the 1984 UK Act does not mean that third party convictions should becategoricallyexcluded from admission in subsequent criminal proceedings. Indeed, the UK courts have not done so. In this regard, it may be useful to have regard to English cases on s 74, which we will turn to later in this judgment.67     As a preliminary matter, we first consider the phrase “relevant toanyissue in the proceedings” [emphasis added] in s 45A(1) (and s 74(1) of the 1984 UK Act). We recognise that there have been calls for that phrase not to be read literally, such that the provision only permits third party convictions to be adduced as evidence in proving predicate offences. Predicate offences are those which are, in turn, elements of offences. A classic example of this is receipt of stolen property (such as the present case), where the predicate offence is that the property involved was stolen (see, for example, the English Court of Appeal decision ofR v Pigram[1995] Crim L R 808). Indeed, this approach (in not reading the quoted phrase literally) finds some support in the following authorities:(a)     First, the decision of the English Court of Appeal inR v Peter Stephen O’Connor(1987) 85 Cr App Rep 298 (“O’Connor”). In that case, the accused was charged with conspiring with a man named Beck to obtain property by deception. The accused pleaded not guilty and claimed trial. Beck, on the other hand, pleaded guilty and evidence of that plea was admitted at the accused’s trial. On appeal it was submitted: (1) that s 74 of the 1984 UK Act did not permit evidence of Beck’s plea to be put before the jury; and (2) alternatively that even if the strict wording of s 74 did render the evidence admissible, then the judge ought to have excluded it on the ground that it would have an adverse effect on the fairness of the proceedings pursuant to s 78 of the 1984 UK Act. Taylor J held as follows (at 302):The terms of section 74 clearly were designed, in the judgment of this Court, to deal with the situation where it was necessary as a preliminary matter for it to be proved that a person other than the accused had been convicted of an offence. The object, it would seem, of the section is to avoid the matter having to be proved twice where the other person had already pleaded guilty to the offence it was necessary to prove. In effect therefore the object of the section, in our view, was to deal with cases where it was necessary to prove the conviction of another as a condition precedent to the conviction of the defendant of the charge laid against him. The most obvious example would be a case where it is necessary to prove against another that he was guilty of theft before the person before the court could be convicted or handling or harbouring.The court inO’Connorultimately left the question of the scope of s 74 open, and did not decide if Beck’s plea of guilt was admissible pursuant to s 74. Instead, the court exercised its discretion to have Beck’s plea excluded on the ground that it would be unfair to have it admitted pursuant to s 78 (at pp 302–303):We find this a difficult point, and,without deciding the full scope of section 74, for the purposes of this case, it is sufficient to say that if it was appropriate within the section to admit the conviction of Beck in the proceedings, we take the view that it would have result in a very unfair state of affairs. [emphasis added](b)     Secondly, the CLRC 11th Report, which suggests (at para 218) that s 74 was enacted for thespecificpurpose of allowing the prosecution prove that a predicate offence occurred, lest it be put through the inconvenience of having to prove the guilt of a person committing that predicate offence yet again. Para 218 of the CLRC 11th Report reads as follows:… In our opinion it is clearly right that convictions of persons other than the accused should be made admissible in criminal proceedings as evidence of the fact that the person convicted was guilty of the offence charged and that on proof of the conviction that person should be taken to have committed the offence charged unless the contrary is proved. Clause 24 provides accordingly.It seems quite wrong, as well as being inconvenient, that the prosecution should be required to prove again the guilt of the person concerned. The clause will be helpful to the prosecution in various cases where the guilt of the accused depends on another person’s having committed an offence.Examples are handling stolen goods, harbouring offenders and the offences under ss.4 and 5 of the Criminal Law Act 1967 (c. 58) of assisting and concealing offences. [emphasis added]The terms of clause 24 of the CLRC’s draft bill are in all material respects identical to those of s 74.(c)     Thirdly, the academic writings of Prof Roderick Munday (Proof of Guilt by AssociationandFairness and Section 74 of PACE) (see above at [52]). The following passage at pp 242–243 ofProof of Guilt by Associationsums up Prof Munday’s views best, and reads as follows:It seems clear that the [CLRC] did not foresee that its provision might come to be applied in [other instances]. The report refers only to such examples as handling stolen goods, harbouring or assisting offenders, and concealing offences – all of them cases where proof of another party’s conviction is a condition precedent to proof of the offence charged. The [CLRC], therefore, was anxious to end the “inconvenience” of the prosecution being required to prove afresh and independently of the conviction another party’s guilt in cases where such proof was a necessity; it was not troubled by cases, like those under discussion, where proof of a third party’s guilt was simply beneficial to the Crown’s case. It is true that, like section 74, clause 24(1) of the [CLRC’s] proposed Bill refers to “any issue in those proceedings.” However, one suspects that this reflects an oversight in drafting, as the Notes dealing with the relevant clause refer exclusively to the time-honoured example of handling stolen goods. Examination ofHansardbears out such a view. When the Police and Criminal Evidence Bill was referred to Standing Committee E, David Mellor’s presentation of the provision comprised little more than declamation of the relevant passages from the [CLRC’s]11th Reportwhich, he said, applied to “parasitic offences”, that is “offences parasitic on greater (sic) offences carried out by somebody else … a dilemma which will most familiarly arise in a handling case.” To this extent, although now an abandoned doctrine, the restrictive construction originally put upon the provision, by Taylor J inO’Connorhas the ring of authenticity.(d)     Fourthly, the following remark made by Watkins LJ in the English Court of Appeal decision ofR v Hillier and Farrar(1993) 97 Cr App Rep 349 (at 355) bears noting:[The UK] Parliament cannot have appreciated how wild an animal it was prepared to let loose upon the field of evidence when it enacted section 74.Watkins LJ did not, however, elaborate on why he thought that this might be the case.68     With respect, we are unable to agree with the approach set out in the preceding paragraph. Not only is the holding inO’Connoras stated aboveobiter dicta, the English Court of Appeal inR v Robertson[1987] 1 QB 920 later made it clear that s 74 is not restricted to proving a predicate offence, and can be put to more extensive use. Lord Lane CJ held the following at 927:… The word “issue” in relation to a trial is apt to cover not only an issue which is an essential ingredient in the offence charged, for instance in handling a case the fact that the goods were stolen (that is the restricted meaning), but also less fundamental issues, for instance evidential issues arising during the course of the proceedings (that is the extended meaning). Section 74 by using the words ‘any issue in those proceedings’ does not seek to limit the word ‘issue’ to the restricted meaning indicated above. Although [the CLRC 11th Report] is an indication that the committee may have been regarding the matter at least primarily in the restricted sense, it seems to us that we are not entitled to use that possibility as showing that the words of the section mean other than what they plainly state.69     Furthermore, in our view, the CLRC 11th Report (and therefore Prof Munday’s arguments, which are anchored primarily on that report) are equivocal in that the CLRC did not categorically rule out the application of s 74 in other instances besides proving predicate offences.70     Having said that, we do recognise that the broad wording of s 45A might potentially pose significant risks to a fair trial. Examples of such risks include the following:(a)     First, in cases involving conspiracy where a third party’s conviction (or statements made by the third party) relates to theverycharge also levelled against an accused. The accused is prejudiced because he is unable to cross-examine the third party (see, for example, I H Dennis,The Law of Evidence(Sweet & Maxwell, 4th Ed, 2010) at para 20-31).O’Connoris one such example, the facts of which have already been provided above (at [67(a)]). As mentioned, the court in that case exercised its discretion to exclude the evidence on the ground that it was deeply prejudicial to the accused.(b)     Secondly, the finder of fact may overlook the precise issue that the convictions were introduced to prove and convict the accused using some notion of “guilt by association” (see, for example,Phipson on Evidence(Hodge M Malek gen ed) (Sweet & Maxwell, 18th Ed, 2013) at para 43–93). This risk was present inR v Gary David Warner(1993) 96 Cr App Rep 324. The accused in that case was charged for supplying heroin and claimed trial. Police officers testified that they had observed up to 40 people per day visiting the accused’s house, and s 74(1) of the 1984 UK Act was relied on to establish that eight of the visitors had convictions for possession or supply of heroin. The English Court of Appeal rightly approved the admission of this evidence, but only to ground an inference as to the type of business which was going on at the house.71     Even though there are potential dangers, there is no need tocategoricallyrule out the admission of third party convictions in subsequent criminal proceedings. Whether that evidence should be excluded depends on the particular circumstances of the case. It is clear at least, and as can be seen from the CLRC 11th Report, that third party convictions are admissible for proving predicate offences (such as the present case). Indeed, that is an express purpose for which s 74 of the 1984 UK Act (and s 45A) were enacted.72     For other cases where s 45A is used (other than for proving predicate offences), it may be useful to have regard to English cases on s 74 of the 1984 UK Act, and in this regard, we find the following propositions laid out by the English Court of Appeal inR v Boyson[1991] Crim L R 274 (“Boyson”) to be instructive:(a)     First, the conviction must beclearlyrelevant to an issue in the case. The court inBoysondisapproved of what it saw as a growing practice of allowing irrelevant, inadmissible, prejudicial or unfair evidence to be admitted simply on the grounds that it was convenient for the jury to have “the whole picture”.(b)     Secondly, the judge concerned should consider s 78 of the 1984 UK Act and direct his or her mind as to whether the probative value of the conviction outweighs the prejudicial value. Singapore has no statutory equivalent of s 78, but this court, inMuhammad bin Kadar and another v Public Prosecutor[2011] 3 SLR 1205, has made it clear that the Singapore courts have asimilardiscretion under common law.Conclusion and application of answer to the facts73     It follows from the above analysis that s 45A was intended to apply tobothcivilas well ascriminal proceedings and we therefore answer the Question posed by the Applicant inthe affirmative.Other arguments made by the Applicant74     For completeness, we mention the various other arguments made by Mr Singh on the Applicant’s behalf before arriving at our decision with regard to the disposal of the present case:(a)     First, the prosecution did not make a formal application to adduce Shankar’s earlier charge into evidence in the District Court;(b)     Secondly, the DJ did not apply his mind to the weight to be attached to Shankar’s charge for CBT;(c)     Thirdly, the DJ was not permitted to rely on s 45A to admit Shankar’s oral testimony; and(d)     Fourthly, while Shankar was successfully prosecuted for CBT in siphoning oil to various barges (including the MV Milos), the charge involving the MV Milos was strictly speaking not a conviction, but was in fact a charge that was taken into consideration for the purpose of sentencing.75     Mr Singh also submitted a memorandum dated 20 April 2015 (“the memorandum”) containing a long list of references to the evidence as adduced in the District Court for the purpose of proving that there was a miscarriage of justice.76     We deal with the first to third arguments, as well as the memorandum, first. It is trite that criminal references should not be veiled appeals nor backdoor appeals (see for example, the decision of this court inPublic Prosecutor v Lim Yong Soon Bernard[2015] SGCA 19 at [23] and [32]; and the decision of the Singapore High Court inM V Bakakrishnan v Public Prosecutor[1998] 2 SLR(R) 846 at [11]). Indeed, a criminal reference is only concerned with questions of law and not questions of fact. Regrettably, Mr Singh’s first to third arguments, and the memorandum, appear, with respect, to constitute (albeit in an unintended fashion) no more than a backdoor appeal on behalf of the Applicant. These arguments (and the references in the memorandum) were made directly in relation to the decision of the DJ and not that of the Judge’s, and indeed werenotaddressed in answering the Question at all. We are of the view, for reasons that follow, that there was, in any event, sufficient evidence to prove that the MFO in the Charge was stolen (see below at [78]).77     In so far as the fourth argument is concerned, we do recognise that the charge involving the MV Milos was strictly speaking not a conviction, but was in fact a charge that was taken into consideration for the purpose of sentencing (“TIC charge”). Be that as it may, it is clear that both the Judge and the DJ were cognisant of this. Indeed, the DJ noted in his written decision that the charge involving the MV Milos was in fact a TIC charge (seeChua Boon Chye (DC)at [21]). The Judge was also aware this (seeChua Boon Chye (HC)at [16]), although the following statement made by the Judge might have given the impression that he was not (seeChua Boon Chye (HC)at [18]):The prosecution’s position was that it was under no obligation to prove the ownership of the fuel in position. It argued that, in the case, the fuel was stolen property as it had been transferred to the appellant by Shankar’s act of criminal breach of trust, which Shankar hadpleaded guilty to. As proof of ownership of the property was not an element of the offence of criminal breach of trust, it was immaterial in this case as well. The applicant faulted the prosecution’s (and the District Judge’s) reliance on Shankar’sconviction, as theconvictiondid not prove that the fuel belonged to (presumably in the sense of being owned by) Chevron. In my view, the District Judge correctly applied the law. [emphasis added in italics]78     We note that, in any event, there is more than sufficient evidence to prove that the MFO in the charge was stolen. As mentioned earlier in [12] of this judgment, the DJ relied not only on Shankar’s charge in respect of the MV Milos, but also his oral testimony to the effect that he conspired with Remy and Viknasvaran to siphon off the MFO stated in the Charge.79     In the final analysis, it appears that this criminal reference (and the arguments not made directly in relation to the Question posed) merely constituted an attempt on the part of the Applicant to absolve himself of criminal liability arising from the Charge which, in our view, he was rightly convicted of.Conclusion80     For the reasons given above, we answer the Question in the affirmative. The Applicant’s conviction and sentence imposed by the District Court, and as affirmed by the High Court, stands.",
        "The parliamentary debates in relation to s 45A": "51     The actual parliamentary debates preceding the enactment of s 45A are to be found in the following statement by Prof Jayakumar during the second reading of the Bill (seeSingapore Parliamentary Debates,Official Report(18 January 1996) vol 65 at col 455): Let me move to new section 45A concerning the rule inHollington v Hewthorn. Section 45A is to reverse a common law rule (known among lawyers as the rule inHollington v Hewthorn, an English case) that operated to exclude evidence of judicial findings of convictions or acquittals from admissibility in subsequent cases. This common law rule states that the evidence in an earlier criminal case cannot be admitted against the defendant in a later civil trial, although, as is known, the standard of proof is higher in a criminal case. For example, a criminal conviction for dangerous driving is inadmissible as evidence of negligence in a civil action for causing personal injuries to the other driver. Reversing this rule means that judicial time and legal costs will be saved by not having to litigate all over again issues which have been decided by another court in previous proceedings. The amendments, Sir, on this matter are similar to provisions in the English and Australian legislation. 52     It is true that, if the passage just quoted is looked at literally, there is no mention of the abolition of the rule inHollingtonin so far as subsequentcriminalproceedings are concerned (although as Mr Jumabhoy correctly pointed out during oral submissions, the reference to the saving of judicial time and legal costs would nevertheless applyequallytocriminalproceedings as well). However, as we have already noted, the (descriptive) fact situation inHollingtonitself related to the admissibility of a conviction in subsequentcivilproceedings. The important question of (normative) principle that then arises is whether or not the rule inHollingtonapplies to subsequentcriminalproceedings. In this particular regard, it is clear that that ruledidin fact apply to preclude the admission of a conviction in subsequentcriminalproceedings as well (see, for example, Adrian Keane and Paul McKeown,The Modern Law of Evidence(Oxford University Press, 9th Ed, 2012) at p 637; Roderick Munday, “Proof of Guilt by Association under Section 74 of the Police and Criminal Evidence Act 1984” [1990] Crim L R 236 (“Proof of Guilt by Association”) at 236; and Roderick Munday, “Fairness and Section 74 of PACE” [1990] CLJ 228 (“Fairness and Section 74 of PACE”) at 228). Indeed, the English Criminal Law Revision Committee (“CLRC”) noted as follows in its 11th Report on Evidence (General) (Cmnd 4991, 1972) (“the CLRC 11th Report”) at para 218: There is no doubt that the principle ofHollington v Hewthornapplies to criminal cases, although there is very little authority. 53     LikeHalsbury’s Singapore vol 10, the CLRC notedTurneras one case that demonstrates that the principle inHollingtonapplies tocriminal proceedingsas well. SinceTurner, and after the CLRC 11th Report was published, there have been at least two cases (both from the English Court of Appeal) that show that the principle inHollingtonalso applies equally to criminal proceedings, even though these same cases do not citeHollingtonexpressly. One such case isR v Mark Lee Spinks[1982] 1 All ER 587. In that case, the accused stood trial for assisting a third party conceal a knife used in a stabbing with the intent to impede the apprehension or prosecution of “a person who had committed an arrestable offence”, namely, the third party. The third party was convicted in separate proceedings for wounding with intent to do grievous bodily harm, which was an arrestable offence. The court held that the prosecution could not rely on the third party’s earlier conviction as evidence that he had committed the arrestable offence of wounding. Since there was no other admissible evidence that the third party had committed such an offence, the accused’s conviction was quashed. Similarly, inR v Hassan[1970] 1 QB 423, a woman’s conviction for prostitution was inadmissible as evidence of her prostitution at the trial of a man charged with living off her earnings. As a result, that man was acquitted. 54     We are of the view that it is reasonable to assume that the draftsperson as well as the Singapore Parliament wasawareof the legal position (including the relevant case law) in relation to the rule inHollington– in particular, that that rule also applied to subsequentcriminalproceedings as well. Indeed,Turner,SpinksandHassan(which we have referred to in the preceding paragraph) were handed downwell befores 45A was introduced by the Singapore Parliament. We have also noted above (at [36]) that we can assume that the Singapore Parliament wasalsoaware thatthe UK Parliamenthadalready abolishedthe rule inHollingtonwith respect tobothcivilas well ascriminal proceedings in 1968 and 1984, respectively – a point which is, in fact,confirmedbythe relevant legislative materials(see below at [56]–[ 62]). All this points, in our view, towards the conclusion that the Singapore Parliament hadintendeds 45A toabolishthe rule inHollingtonwith regard tobothcivilas well ascriminal proceedings. 55     But what, then, of Prof Jayakumar’s reference (above at [51]) toHollingtonin the context of (ostensibly only)civilproceedings? As already explained above (at [52]), it is entirely possible that this was a reference to thespecificfacts as well as holding inHollingtonitself.In any event, what was stated in the relevant parliamentary debates isnot inconsistent withan interpretation which holds that s 45A applies tobothcivilas well ascriminal proceedings.Most importantly, however, there areother related materialswhichhelp to resolve the matter in a definitive manner– to which we now turn.",
        "Other important legislative materials": "56     The first is, as the Respondent has submitted, to be found inthe Explanatory Statement to the Bill. The material part reads as follows: Clause 4 inserts a new section 45A to the Act to make it clear that the common law rule inHollington v Hewthorn[1943] 2 All ER 65 does not apply in the circumstances specified in that section. The rule of common law inHollington v Hewthornoperates to exclude evidence of judicial findings of convictions or acquittals from admissibility in subsequent cases. 57     The reference in the extract just quoted in the preceding paragraph is ageneralone, suggesting that s 45A applies toall typesof proceedings, whether civil or criminal in nature. This is also consistent with the possible explanation canvassed above to the effect that Prof Jayakumar was referring more specifically to the actual fact situation inHollingtonitself during the second reading stage in the Singapore Parliament. 58     Secondly (and perhaps even more significantly), the“Table of Derivations”found at the end ofthe Billstates that cl 4 of the Bill (which introduced s 45A) wasderived from ss 73 and 74 of the 1984 UK Act(which, of course, was concerned with the abolition of the rule inHollingtonin relation to subsequentcriminalproceedings).Put simply, if there was any doubt as to whether or not s 45A was intended to apply to criminal proceedings, this lays all doubts to rest. 59     At this juncture, we would also like to refer (in a related as well asconfirmatoryvein) to s 45A(7), which reads as follows: In anycriminalproceedings, this section shall be subject to any written law or any other rule of law to the effect that a conviction shall not be admissible to prove a tendency or disposition on the part of the accused to commit the kind of offence with which he has been charged. [emphasis added in bold italics] 60     It is clear that s 45A(7) has been included only because s 45A itselfcould apply tocriminal proceedings as well. Indeed, as already noted above (at [58]), s 45A wasbased on the 1984 UK Actand, in a related (and more specific) vein,s 45A(7) was (in turn) based on s 74(3) of the 1984 UK Act.The word “criminal” (as highlighted in bold italics in the quotation in the preceding paragraph) in s 45A(7) is not found in s 74(3) of the 1984 UK Act (see above at [35]), and it must have been specifically added in s 45A(7) to reinforce the point that s 45A applies to subsequent criminal proceedings as well. 61     It is now appropriate (and, indeed, important) todraw the relevant threads together. It will be recalled that we mentioned that the first port of call ought to bethe actual languageof s 45A itself(see above at [26]). In this regard, we note (as Mr Jumabhoy also pointed out) that s 45A(1) tracks closely the language of s 11(1) of the 1968 UK Act, which reads (as it stood before s 45A was introduced): 11Convictions as evidence in civil proceedings. (1)    In any civil proceedings the fact that a person has been convicted of an offence by or before any court in the United Kingdom shall … be admissible in evidence for the purpose of proving, where to do so is relevant to any issue in those proceedings, that he committed that offence, whether he was so convicted upon a plea of guilty or otherwise and whether or not he is a party to the civil proceedings; but no conviction other than a subsisting one shall be admissible in evidence by virtue of this section. … 62     More significantly, Mr Jumabhoy also pointed out that,unlikes 11(1) of the 1968 UK Act, s 45Adoes not contain the phrase “any civil proceedings”.In our view, this is significant and is consistent with the point noted above (at [58]) to the effect that s 45A was derived from the relevant provisions of the 1984 UK Act(which applies tocriminalproceedings).Put simply, s 45A was intended to coverbothcivilas well ascriminal proceedings and, as the Singapore Parliament chose to draw from the relevant language of the 1968 UK Act instead of the 1984 UK Act, it had (necessarily) to delete the reference to the phrase “any civil proceedings” in s 11(1) of the 1968 UK Act.",
        "Local decisions": "63     Before we proceed to answer the Question, we note that Mr Singh relied on several local decisions besidesHeah Lian Khin(for example,Boldward,Ari bin AbdullahandKim Anseok), and in particular, [21]–[22] ofYamazakito argue that the rule inHollingtonapplies only to civil proceedings, which read as follows: 21 It would be of some interest to note that s 45A was, in fact, introduced via the Evidence (Amendment) Act 1995 (No 8 of 1996) to abolish the old common law rule embodied in the English Court of Appeal decision ofHollington v F Hewthorn and Company Limited[1943] 1 KB 587 (“Hollington”)that a prior conviction could not be adduced for the purpose of proving the guilt of the defendant in subsequent civil proceedings relating to the same matter(see Jeffrey Pinsler, Evidence, Advocacy and the Litigation Process (LexisNexis, 2nd Ed, 2003) at pp 172-174; see alsoOng Bee Nah v Won Siew Wan (Yong Tian Choy, third party)[2005] 2 SLR 455 (“Ong Bee Nah”) at [51]). Two years before its enactment, the Singapore High Court had actually departed from this common law rule inChoo Michael v Loh Shak Mow[1994] 1 SLR 584 (“Choo Michael”). The criticisms of the rule inHollington, the subsequent decline and fall of the rule in the common law jurisdictions and the legislative intent and rationale behind the enactment of s 45A in Singapore are set out very ably by Andrew Phang Boon Leong JC (as he then was) inOng Bee Nah. 22The purpose behind s 45A is to save judicial time and legal costs by not having to re-litigate issues in civil proceedings where the same issues have been previously decided by a court in criminal proceedings(seeOng Bee Nahat [51] where the relevant parliamentary debate is set out; see alsoPP v Heah Lian Khin[2000] 3 SLR 609 at [89]).It also prevents, in the words of Goh Joon Seng J (“Goh J”), “a collateral attack by means of a civil action against a final decision of a court of competent criminal jurisdiction”(Choo Michaelat 600).Bearing in mind that the standard of proof of beyond reasonable doubt in criminal proceedings is much higher than that of a balance of probabilities in civil proceedings, it only makes eminent sense to allow evidence of conviction to be admissible in subsequent civil proceedings, founded upon the same conduct of the convicted person.The difference in the standard of proof as well as the difference in the procedure in regard to the adducing of evidence in criminal and civil proceedings would mean that a finding of culpability against a person upon a contested criminal trial is of higher probative value than that in civil proceedings. … [emphasis added] 64     Whilst it is true thatYamazaki,Boldward,Ari bin AbdullahandKim Anseokdid refer to the rule inHollingtonin the context of subsequent civil proceedings, that was because those cases dealt with issues involving the use of s 45A in subsequent civil proceedings. It is therefore not surprising that those cases made no reference to the rule inHollingtonas applied in later criminal proceedings.",
        "Risks to a fair trial": "65     Mr Singh argued that third party convictions should not be admitted as evidence in subsequent criminal proceedings because: (a)     First, to do so poses risks to a fair trial. In particular, allowing third party convictions as evidence in later criminal proceedings would drive a significant inroad into the presumption of innocence. Indeed, Mr Singh had this to say in his written submissions: … [I]t is well-established that the presumption of innocence applies in criminal trials.To the extent that a previous conviction (in particular, that of a third party) would require the accused person to disprove certain elements of the offence, that would amount to a significant inroad into the presumption of innocence.If Parliament had intended such an inroad, one would have expected Minister Jayakumar to at least mention it. [emphasis added in italics] (b)     Secondly, the courts in the UK have struggled in applying s 74 of the 1984 UK Act. 66     We do not agree with Mr Singh’s arguments for these reasons: (a)     First, while we recognise that there are potential risks to a fair trial, safeguards, which we will turn to (see below at [72]), can be put in place to ensure that the accused would not be unduly prejudiced. (b)     Secondly, we are of the view that Mr Singh’s argument that a “significant inroad” would be driven into the presumption of innocence to be exaggerated. The mere fact that a third party’s conviction is adduced as evidence does not detract from the fact that the prosecution still bears the burden of proof. It is also open to an accused to call on that third party for cross-examination if necessary. (c)     Thirdly, the mere fact that the UK courts have struggled in applying s 74 of the 1984 UK Act does not mean that third party convictions should becategoricallyexcluded from admission in subsequent criminal proceedings. Indeed, the UK courts have not done so. In this regard, it may be useful to have regard to English cases on s 74, which we will turn to later in this judgment. 67     As a preliminary matter, we first consider the phrase “relevant toanyissue in the proceedings” [emphasis added] in s 45A(1) (and s 74(1) of the 1984 UK Act). We recognise that there have been calls for that phrase not to be read literally, such that the provision only permits third party convictions to be adduced as evidence in proving predicate offences. Predicate offences are those which are, in turn, elements of offences. A classic example of this is receipt of stolen property (such as the present case), where the predicate offence is that the property involved was stolen (see, for example, the English Court of Appeal decision ofR v Pigram[1995] Crim L R 808). Indeed, this approach (in not reading the quoted phrase literally) finds some support in the following authorities: (a)     First, the decision of the English Court of Appeal inR v Peter Stephen O’Connor(1987) 85 Cr App Rep 298 (“O’Connor”). In that case, the accused was charged with conspiring with a man named Beck to obtain property by deception. The accused pleaded not guilty and claimed trial. Beck, on the other hand, pleaded guilty and evidence of that plea was admitted at the accused’s trial. On appeal it was submitted: (1) that s 74 of the 1984 UK Act did not permit evidence of Beck’s plea to be put before the jury; and (2) alternatively that even if the strict wording of s 74 did render the evidence admissible, then the judge ought to have excluded it on the ground that it would have an adverse effect on the fairness of the proceedings pursuant to s 78 of the 1984 UK Act. Taylor J held as follows (at 302): The terms of section 74 clearly were designed, in the judgment of this Court, to deal with the situation where it was necessary as a preliminary matter for it to be proved that a person other than the accused had been convicted of an offence. The object, it would seem, of the section is to avoid the matter having to be proved twice where the other person had already pleaded guilty to the offence it was necessary to prove. In effect therefore the object of the section, in our view, was to deal with cases where it was necessary to prove the conviction of another as a condition precedent to the conviction of the defendant of the charge laid against him. The most obvious example would be a case where it is necessary to prove against another that he was guilty of theft before the person before the court could be convicted or handling or harbouring. The court inO’Connorultimately left the question of the scope of s 74 open, and did not decide if Beck’s plea of guilt was admissible pursuant to s 74. Instead, the court exercised its discretion to have Beck’s plea excluded on the ground that it would be unfair to have it admitted pursuant to s 78 (at pp 302–303): We find this a difficult point, and,without deciding the full scope of section 74, for the purposes of this case, it is sufficient to say that if it was appropriate within the section to admit the conviction of Beck in the proceedings, we take the view that it would have result in a very unfair state of affairs. [emphasis added] (b)     Secondly, the CLRC 11th Report, which suggests (at para 218) that s 74 was enacted for thespecificpurpose of allowing the prosecution prove that a predicate offence occurred, lest it be put through the inconvenience of having to prove the guilt of a person committing that predicate offence yet again. Para 218 of the CLRC 11th Report reads as follows: … In our opinion it is clearly right that convictions of persons other than the accused should be made admissible in criminal proceedings as evidence of the fact that the person convicted was guilty of the offence charged and that on proof of the conviction that person should be taken to have committed the offence charged unless the contrary is proved. Clause 24 provides accordingly.It seems quite wrong, as well as being inconvenient, that the prosecution should be required to prove again the guilt of the person concerned. The clause will be helpful to the prosecution in various cases where the guilt of the accused depends on another person’s having committed an offence.Examples are handling stolen goods, harbouring offenders and the offences under ss.4 and 5 of the Criminal Law Act 1967 (c. 58) of assisting and concealing offences. [emphasis added] The terms of clause 24 of the CLRC’s draft bill are in all material respects identical to those of s 74. (c)     Thirdly, the academic writings of Prof Roderick Munday (Proof of Guilt by AssociationandFairness and Section 74 of PACE) (see above at [52]). The following passage at pp 242–243 ofProof of Guilt by Associationsums up Prof Munday’s views best, and reads as follows: It seems clear that the [CLRC] did not foresee that its provision might come to be applied in [other instances]. The report refers only to such examples as handling stolen goods, harbouring or assisting offenders, and concealing offences – all of them cases where proof of another party’s conviction is a condition precedent to proof of the offence charged. The [CLRC], therefore, was anxious to end the “inconvenience” of the prosecution being required to prove afresh and independently of the conviction another party’s guilt in cases where such proof was a necessity; it was not troubled by cases, like those under discussion, where proof of a third party’s guilt was simply beneficial to the Crown’s case. It is true that, like section 74, clause 24(1) of the [CLRC’s] proposed Bill refers to “any issue in those proceedings.” However, one suspects that this reflects an oversight in drafting, as the Notes dealing with the relevant clause refer exclusively to the time-honoured example of handling stolen goods. Examination ofHansardbears out such a view. When the Police and Criminal Evidence Bill was referred to Standing Committee E, David Mellor’s presentation of the provision comprised little more than declamation of the relevant passages from the [CLRC’s]11th Reportwhich, he said, applied to “parasitic offences”, that is “offences parasitic on greater (sic) offences carried out by somebody else … a dilemma which will most familiarly arise in a handling case.” To this extent, although now an abandoned doctrine, the restrictive construction originally put upon the provision, by Taylor J inO’Connorhas the ring of authenticity. (d)     Fourthly, the following remark made by Watkins LJ in the English Court of Appeal decision ofR v Hillier and Farrar(1993) 97 Cr App Rep 349 (at 355) bears noting: [The UK] Parliament cannot have appreciated how wild an animal it was prepared to let loose upon the field of evidence when it enacted section 74. Watkins LJ did not, however, elaborate on why he thought that this might be the case. 68     With respect, we are unable to agree with the approach set out in the preceding paragraph. Not only is the holding inO’Connoras stated aboveobiter dicta, the English Court of Appeal inR v Robertson[1987] 1 QB 920 later made it clear that s 74 is not restricted to proving a predicate offence, and can be put to more extensive use. Lord Lane CJ held the following at 927: … The word “issue” in relation to a trial is apt to cover not only an issue which is an essential ingredient in the offence charged, for instance in handling a case the fact that the goods were stolen (that is the restricted meaning), but also less fundamental issues, for instance evidential issues arising during the course of the proceedings (that is the extended meaning). Section 74 by using the words ‘any issue in those proceedings’ does not seek to limit the word ‘issue’ to the restricted meaning indicated above. Although [the CLRC 11th Report] is an indication that the committee may have been regarding the matter at least primarily in the restricted sense, it seems to us that we are not entitled to use that possibility as showing that the words of the section mean other than what they plainly state. 69     Furthermore, in our view, the CLRC 11th Report (and therefore Prof Munday’s arguments, which are anchored primarily on that report) are equivocal in that the CLRC did not categorically rule out the application of s 74 in other instances besides proving predicate offences. 70     Having said that, we do recognise that the broad wording of s 45A might potentially pose significant risks to a fair trial. Examples of such risks include the following: (a)     First, in cases involving conspiracy where a third party’s conviction (or statements made by the third party) relates to theverycharge also levelled against an accused. The accused is prejudiced because he is unable to cross-examine the third party (see, for example, I H Dennis,The Law of Evidence(Sweet & Maxwell, 4th Ed, 2010) at para 20-31).O’Connoris one such example, the facts of which have already been provided above (at [67(a)]). As mentioned, the court in that case exercised its discretion to exclude the evidence on the ground that it was deeply prejudicial to the accused. (b)     Secondly, the finder of fact may overlook the precise issue that the convictions were introduced to prove and convict the accused using some notion of “guilt by association” (see, for example,Phipson on Evidence(Hodge M Malek gen ed) (Sweet & Maxwell, 18th Ed, 2013) at para 43–93). This risk was present inR v Gary David Warner(1993) 96 Cr App Rep 324. The accused in that case was charged for supplying heroin and claimed trial. Police officers testified that they had observed up to 40 people per day visiting the accused’s house, and s 74(1) of the 1984 UK Act was relied on to establish that eight of the visitors had convictions for possession or supply of heroin. The English Court of Appeal rightly approved the admission of this evidence, but only to ground an inference as to the type of business which was going on at the house. 71     Even though there are potential dangers, there is no need tocategoricallyrule out the admission of third party convictions in subsequent criminal proceedings. Whether that evidence should be excluded depends on the particular circumstances of the case. It is clear at least, and as can be seen from the CLRC 11th Report, that third party convictions are admissible for proving predicate offences (such as the present case). Indeed, that is an express purpose for which s 74 of the 1984 UK Act (and s 45A) were enacted. 72     For other cases where s 45A is used (other than for proving predicate offences), it may be useful to have regard to English cases on s 74 of the 1984 UK Act, and in this regard, we find the following propositions laid out by the English Court of Appeal inR v Boyson[1991] Crim L R 274 (“Boyson”) to be instructive: (a)     First, the conviction must beclearlyrelevant to an issue in the case. The court inBoysondisapproved of what it saw as a growing practice of allowing irrelevant, inadmissible, prejudicial or unfair evidence to be admitted simply on the grounds that it was convenient for the jury to have “the whole picture”. (b)     Secondly, the judge concerned should consider s 78 of the 1984 UK Act and direct his or her mind as to whether the probative value of the conviction outweighs the prejudicial value. Singapore has no statutory equivalent of s 78, but this court, inMuhammad bin Kadar and another v Public Prosecutor[2011] 3 SLR 1205, has made it clear that the Singapore courts have asimilardiscretion under common law.",
        "Conclusion and application of answer to the facts": "73     It follows from the above analysis that s 45A was intended to apply tobothcivilas well ascriminal proceedings and we therefore answer the Question posed by the Applicant inthe affirmative.",
        "Other arguments made by the Applicant": "74     For completeness, we mention the various other arguments made by Mr Singh on the Applicant’s behalf before arriving at our decision with regard to the disposal of the present case: (a)     First, the prosecution did not make a formal application to adduce Shankar’s earlier charge into evidence in the District Court; (b)     Secondly, the DJ did not apply his mind to the weight to be attached to Shankar’s charge for CBT; (c)     Thirdly, the DJ was not permitted to rely on s 45A to admit Shankar’s oral testimony; and (d)     Fourthly, while Shankar was successfully prosecuted for CBT in siphoning oil to various barges (including the MV Milos), the charge involving the MV Milos was strictly speaking not a conviction, but was in fact a charge that was taken into consideration for the purpose of sentencing. 75     Mr Singh also submitted a memorandum dated 20 April 2015 (“the memorandum”) containing a long list of references to the evidence as adduced in the District Court for the purpose of proving that there was a miscarriage of justice. 76     We deal with the first to third arguments, as well as the memorandum, first. It is trite that criminal references should not be veiled appeals nor backdoor appeals (see for example, the decision of this court inPublic Prosecutor v Lim Yong Soon Bernard[2015] SGCA 19 at [23] and [32]; and the decision of the Singapore High Court inM V Bakakrishnan v Public Prosecutor[1998] 2 SLR(R) 846 at [11]). Indeed, a criminal reference is only concerned with questions of law and not questions of fact. Regrettably, Mr Singh’s first to third arguments, and the memorandum, appear, with respect, to constitute (albeit in an unintended fashion) no more than a backdoor appeal on behalf of the Applicant. These arguments (and the references in the memorandum) were made directly in relation to the decision of the DJ and not that of the Judge’s, and indeed werenotaddressed in answering the Question at all. We are of the view, for reasons that follow, that there was, in any event, sufficient evidence to prove that the MFO in the Charge was stolen (see below at [78]). 77     In so far as the fourth argument is concerned, we do recognise that the charge involving the MV Milos was strictly speaking not a conviction, but was in fact a charge that was taken into consideration for the purpose of sentencing (“TIC charge”). Be that as it may, it is clear that both the Judge and the DJ were cognisant of this. Indeed, the DJ noted in his written decision that the charge involving the MV Milos was in fact a TIC charge (seeChua Boon Chye (DC)at [21]). The Judge was also aware this (seeChua Boon Chye (HC)at [16]), although the following statement made by the Judge might have given the impression that he was not (seeChua Boon Chye (HC)at [18]): The prosecution’s position was that it was under no obligation to prove the ownership of the fuel in position. It argued that, in the case, the fuel was stolen property as it had been transferred to the appellant by Shankar’s act of criminal breach of trust, which Shankar hadpleaded guilty to. As proof of ownership of the property was not an element of the offence of criminal breach of trust, it was immaterial in this case as well. The applicant faulted the prosecution’s (and the District Judge’s) reliance on Shankar’sconviction, as theconvictiondid not prove that the fuel belonged to (presumably in the sense of being owned by) Chevron. In my view, the District Judge correctly applied the law. [emphasis added in italics] 78     We note that, in any event, there is more than sufficient evidence to prove that the MFO in the charge was stolen. As mentioned earlier in [12] of this judgment, the DJ relied not only on Shankar’s charge in respect of the MV Milos, but also his oral testimony to the effect that he conspired with Remy and Viknasvaran to siphon off the MFO stated in the Charge. 79     In the final analysis, it appears that this criminal reference (and the arguments not made directly in relation to the Question posed) merely constituted an attempt on the part of the Applicant to absolve himself of criminal liability arising from the Charge which, in our view, he was rightly convicted of.",
        "Conclusion": "80     For the reasons given above, we answer the Question in the affirmative. The Applicant’s conviction and sentence imposed by the District Court, and as affirmed by the High Court, stands."
    }
}