{
    "case_title": "Freight Connect (S) Pte Ltd\n      v\n      Paragon Shipping Pte Ltd",
    "ncitation": "[2015] SGCA 37",
    "coram": "Sundaresh Menon CJ; \n      Chao Hick Tin JA; \n      Chan Sek Keong SJ",
    "sections": {
        "Introduction": "1       This is an appeal from the decision of the High\n                    Court judge (“the Judge”) inParagon Shipping\n                        Pte Ltd v Freight Connect (S) Pte Ltd[2014] 4 SLR 574\n                    (“the Judgment”), where the respondent, Paragon Shipping Pte Ltd\n                    (“the Respondent”), was awarded the total sum of US$81,000,\n                    interest and costs. The appellant, Freight Connect (S) Pte Ltd (“the\n                    Appellant”), was also ordered to indemnify the Respondent against any sum\n                    that the Respondent might be found liable to pay to FLS (Thailand) Co, Ltd\n                    (“FLS”), the party it had entered into a charterparty with in\n                    order to fulfil its contractual obligations to the Appellant. At the trial\n                    below, the Appellant also brought a counterclaim for damages for breach of\n                    contract and the tort of wrongful interference with trade. Both counterclaims\n                    were dismissed by the Judge. The Appellant has not appealed against the\n                    dismissal of its counterclaims. The appeal before us is confined to the\n                    Judge’s decision to allow the Respondent’s claims in\n                part.",
        "The facts": "",
        "The parties": "2       The Appellant and the Respondent are Singapore\n                    companies in the business of providing transport services for the shipping of\n                    cargo by sea. The Appellant had entered into a contract with Herrenknecht Asia\n                    Headquarters Pte Ltd to transport machinery (“the Cargo”) from\n                    Nanwei, Nansha, China to Singapore. The Cargo was to be used for various\n                    tunnelling projects in Singapore.",
        "The first fixture": "3       In or around July 2012, the Appellant’s\n                    general manager and director, Marcus Stephen Tan (“Mr Tan”), and\n                    the operations manager, Yesica Winata (“Ms Winata”), entered into\n                    negotiations with the Respondent’s director, Madeline Ong (“Ms\n                    Ong”), for the provision of a vessel to transport the Cargo from Nanwei\n                    to Singapore. On 26 July 2012, the parties entered into an agreement\n                    (“the first fixture”), pursuant to which the Respondent agreed to\n                    provide the “MV Dahua” (“theDahua”) for the purpose of shipping the Cargo to\n                    Singapore. The lump sum freight was US$161,000, and the material terms of the\n                    first fixture are reproduced as follows: 02) LOADING PORT: 1SBP OWNERS BERTH NANWEI PORT, GUANGDONG, PR\n                        CHINA. ... 04) LAYCAN: 10TH-\n                            20TH, AUG, 2012 Clause 19 of the first fixture incorporated the terms of a\n                    standard form contract codenamed “Gencon”. 4       The Respondent in turn entered into an agreement\n                    with FLS for the charter of theDahuato fulfil\n                    its contractual obligations under the first fixture with the Appellant.\n                    Subsequently, Mr Tan and Ms Ong exchanged emails in August 2012 regarding\n                    the status of theDahuaand whether it would be\n                    able to arrive at Nanwei within the laycan of the first fixture (ie, between 10 August and 20 August 2012). It soon\n                    transpired that theDahuawould be delayed and\n                    would not be able to do so. Thereupon the Appellant took the view that the\n                    Respondent was already in default of the first fixture. In an email sent to\n                    Ms Ong on 13 August 2012, Ms Winata wrote: Looking at the situation, its already default the contract of the Fixture\n                        Note. Vessel sailing need 15-18 days to reach Guangzhou [ie, from the vicinity of North Korea where the vessel\n                        allegedly was, but which was denied by the Respondent] and even this vessel\n                        is not even hit at the Typhoon territory. Kindly get the replacement vessel asap by today before noon hrs. 5       This was followed by a further exchange of\n                    emails between the parties. The Respondent sought an extension of the laycan in\n                    the first fixture to 30 August 2012 but this was rejected by the Appellant.\n                    Multiple options were also mooted by the Respondent, such as the provision of\n                    other vessels to carry the Cargo, but nothing came out of these discussions\n                    until 17 August 2012, when the “MV AAL Dampier” (“theAAL Dampier”) was first brought up by\n                    the Respondent as an alternative vessel.",
        "The second fixture": "6       On 17 August 2012 at 1.12pm, Ms Ong sent an\n                    email to Mr Tan and Ms Winata informing them that the Respondent had found a\n                    “passing by vessel”, theAAL\n                    Dampier, to load the Cargo on the morning of 20 August 2012. Ms Ong\n                    also informed them that theAAL Dampier’s\n                    detention charge was US$25,000 per day and that an urgent response (within 15\n                    minutes) was required or “the vessel [ie,\n                    theAAL Dampier] will diversify [sic] elsewhere”. Ms Winata replied at 1.51pm,\n                    seeking further clarification on theAAL\n                    Dampier’s specifications. She also emphasised that the Cargo\n                    had to be loaded no later than 20 August and that it had to arrive in Singapore\n                    no later than 25 August due to “LC requirement”. 7       At the trial, Mr Tan testified that sometime at\n                    this juncture, he had a telephone conversation with Ms Ong during which he\n                    agreed to the Respondent’s proposal of shipping the Cargo on board theAAL Dampier, subject to the following\n                    conditions: (a)     that the Cargo was able to load;\n                        and (b)     that there\n                        was no issue with the documentation. This was followed by an email sent by Ms Ong to Ms Winata at\n                    2.06pm on the same day, the material parts of this email are as follows: Thank you for your confirmation. As discussed we have confirmed fixing the\n                        shipment on: VESSEL: - AAL tonnage or sub ( intention AAL DAMPIER) ... PORTS OF LOADING & DISCHARGE: - POL: Nanwei Port - POD: Singapore TIME OF SHIPMENT: - 19 - 20.08.2012 FREIGHT & TERMS: - USD 161,000.00 Lumpsum - Freight based on Hook / Hook - Detention USD 25,000.00 per day pro rata GENERAL CONDITIONS: - Carrier’s Berth and Agents at all ends ... - Freight to be fully prepaid on completion of loading - Freight is deemed earned as cargo is being loaded discountless non\n                        returnable vessel and/or cargo is lost or not lost ... - Cargo to be delivered/received as fast as vessel can load/discharge\n                        otherwise detention to apply. Time lost due to swell and/or weather and/or waiting for loading and/or\n                        discharging berth on ships arrival at or off port or so near thereto vessel\n                        may be permitted to approach, will be charged as time for which detention is\n                        due 8       There was a further exchange of emails between\n                    Ms Winata and Ms Ong regarding the stowage plan and the port berthing\n                    details. At 6.07pm on the same day, Ms Ong sent an email to Ms Winata, seeking\n                    confirmation on three matters. Ms Winata replied at 6.19pm to the three matters\n                    with her answers in capital letters next to the questions. Ms Ong’s\n                    original email, together with Ms Winata’s responses read as\n                    follows: (AA) Please confirm that the shipper has no problem with the customs\n                        clearance at port of Loading to have the cargoes load on board MV “\n                        AAL Dampier”. If so, we will proceed to bring the vessel to Nanwei\n                        Port as per schedule. Kindly advise urgently. – SHIPPER CONFIRM ON\n                        THIS ISSUE. (BB) Please inform that shipper only contact our new agent, AAL, for the\n                        loading the cargoes onboard Mv “AAL Dampier” . Please inform\n                        them that Bruce is no longer involve with the shipment. – ALREADY\n                        INFORMED. (CC) Please ensure that the shipper will only be loading the cargoes\n                        onboard MV “AAL Dampier” instead any other vessel. –\n                        NOTED, ALREADY INFORMED 9       There is no dispute between the parties that the\n                    Respondent had entered into a separate agreement with FLS for the charter of theAAL Dampieron terms which were similar to\n                    those agreed between the Appellant and the Respondent for the second fixture,\n                    except that the freight was US$155,000 and the detention charge was US$20,000\n                    per day pro rata. The Respondent’s margin of profit on these two\n                    back-to-back charters was US$6,000 on the freight and US$5,000 per day pro rata\n                    for detention.",
        "The arrival of the AAL Dampier at Nanwei on 20 August 2012": "10     It is common ground that theAAL Dampierarrived at Nanwei on 20 August 2012 and\n                    tendered its notice of readiness (“NOR”) at 7.15pm on the day of\n                    its arrival. FLS informed the Appellant on 22 August 2012 that a berth had been\n                    booked for theAAL Dampier, but there was a delay\n                    due to congestion at Nanwei Port. Nevertheless, at that point in time, theAAL Dampierwas still scheduled to berth on 23\n                    August 2012. 11     Unfortunately, theAAL\n                        Dampierlost its berth booking for 23 August 2012 due to the\n                    Appellant’s failure to provide certain shipping and customs documents to\n                    the Nanwei Port authorities. The Chinese shipper had handed over these documents\n                    to one Mr Gong of ASB Group Co, Ltd (“ASB”), who was the\n                    ship’s agent for the first fixture. It appears that sometime after the\n                    termination of the first fixture on 16 August 2012, the Appellant had approached\n                    Mr Gong for assistance in arranging for an alternative vessel to ship the Cargo\n                    to Singapore. Mr Gong then approached one Mr Louis of Uptrans/Jade Shipping\n                    (“Jade Shipping”), who eventually secured another vessel known as\n                    the “MV Sea Castle” (“theSea\n                        Castle”). It would seem that Mr Gong had passed on the\n                    shipping and customs documents to Mr Louis pursuant to the arrangement for the\n                    Cargo to be loaded on board theSea Castle. The\n                    Appellant subsequently tried to obtain these documents from ASB or Jade Shipping\n                    for the purpose of enabling theAAL Dampierto\n                    apply for a berth, but was denied the documents. As a result, theAAL Dampierlost its berth application for\n                    23 August 2012. The vessel was then scheduled to berth on 27 or 28 August\n                    2012 instead, subject to the relevant documents being made available to the port\n                    authorities.",
        "The shipping of the Cargo on the Sea Castle": "12     On 23 August 2012, the Appellant informed the\n                    Respondent that it would be loading the Cargo on board theSea Castle. The Appellant stated that it was unable to load the\n                    Cargo on board theAAL Dampieras the previous\n                    agent, ASB, had retained the documents that were required by the port\n                    authorities for theAAL Dampier’s berth\n                    application. The Cargo was loaded on board theSea\n                        Castleand shipped to Singapore. 13     Subsequently, the Respondent informed the\n                    Appellant that FLS had demanded for dead freight and detention charges for the\n                    waiting time incurred by theAAL Dampier. The\n                    Respondent forwarded FLS’s emails to the Appellant.",
        "The commencement of legal proceedings": "14     The Respondent then commenced legal\n                    proceedings against the Appellant for damages for breach of contract in failing\n                    to load the Cargo on board theAAL Dampierto\n                    claim the following reliefs: (a)     damages in the sum of US$236,000\n                        (comprising US$161,000 for freight and US$75,000 for detention charges for\n                        three days at US$25,000 per day pro rata); (b)     further, or in the alternative, an order that\n                        the Appellant indemnify and pay the Respondent any sum, including costs and\n                        interests the Respondent might be liable to pay the head charterer and/or\n                        owner of theAAL Dampierarising out of the\n                        Appellant’s failure to perform the second\n                fixture. 15     The Appellant filed a defence and counterclaim\n                    and denied the Respondent’s claim on the ground that the Respondent had\n                    breached the first fixture in respect of theDahuaand that there had never been a confirmed fixture for theAAL\n                        Dampier, and accordingly the Appellant was therefore entitled to\n                    ship the Cargo on board theSea Castle. The\n                    Appellant counterclaimed for damages for breach of contract amounting to\n                    US$9,208.67 (when the correct amount was US$15,208.67 as observed by the Judge)\n                    and US$3,009.51 which it had incurred from having to ship the Cargo on board theSea Castle. The Appellant also counterclaimed\n                    against the Respondent for damages for wrongful interference with trade arising\n                    from a letter written by the Respondent to the Appellant’s\n                    customers.",
        "The issues before the Judge": "16     The Judge considered the following as the main\n                    issues for the court’s determination: (a)     What happened to the first fixture:\n                        was the Respondent in breach? (b)     Was the second fixture concluded between the Appellant\n                        and the Respondent? (c)     Was the NOR tendered by theAAL Dampierunder the second fixture valid? (d)     What remedies are recoverable by either party in relation\n                        to the first or second fixtures? (e)     Was the Respondent liable to the Appellant for the tort\n                        of wrongful interference with trade? 17     With respect to these issues, the Judge found\n                    as follows on the evidence and construction of the terms of the second\n                    fixture: (a)     The Respondent was in breach of the\n                        first fixture. (b)     The second fixture was concluded between the parties. (c)     The NOR tendered by theAAL Dampierunder the second fixture was\n                        valid. (d)     The\n                        Appellant was not entitled to recover any loss under the first fixture as it\n                        was in breach of the second fixture. The Respondent was entitled to recover\n                        damages of US$81,000 and interest thereon, and an indemnity from the\n                        Appellant for any sum it might be found liable to FLS arising out of or in\n                        connection with the Respondent’s charter of theAAL\n                            Dampierfrom FLS for the purpose of carrying the Cargo from\n                        Nanwei to Singapore in August 2012. (e)     The Respondent was not liable to the Appellant for the\n                        alleged unlawful interference of trade. 18     The present appeal only concerns the issues\n                    arising out of thesecondfixture. In this regard,\n                    the Judge made the following findings: (a)     The second fixture was concluded\n                        latest by 6.19pm on 17 August 2012 when the Appellant confirmed that\n                        the shipper would load the cargo on board theAAL\n                            Dampier. (b)     The second fixture was a port charter and theAAL Dampierhad tendered a valid NOR on 20 August\n                        2012 when it arrived at Nanwei Port. The time spent waiting for the berth,\n                        up to the time when the Appellant repudiated the second fixture on 23 August\n                        2012, was to be charged as time for which detention was due. The Appellant\n                        was therefore liable for detention charges amounting to\n                    US$75,000. (c)     The\n                        Appellant was liable for detention charges even if the second fixture had\n                        been a berth charter. It was an implied term of charterparties that a\n                        charterer would act with reasonable despatch and in accordance with the\n                        ordinary practice of the port of loading in carrying out acts which had to\n                        be done by them to enable the vessel to become an “arrived\n                        vessel”. In the event of breach of this implied term, the\n                        commencement of laytime could be antedated to the date it would have begun\n                        but for the breach. The Appellant had breached this obligation when it\n                        failed to secure the shipping and customs documents that were necessary to\n                        enable theAAL Dampierto obtain a\n                        berth. (d)     The\n                        Respondent was not entitled to full freight as the second fixture clearly\n                        stated that full freight would only be earned upon the loading of the cargo.\n                        The Cargo was never loaded on board theAAL\n                            Dampier. (e)     The Respondent was entitled to claim damages amounting to\n                        US$6,000, being the difference between what the Respondent would have\n                        received from the Appellant pursuant to the second fixture (ie, US$161,000) and what the Respondent would have\n                        had to pay FLS (ie,\n                    US$155,000). (f)     The\n                        Respondent was also entitled to be indemnified by the Respondent against any\n                        sum that it might be found liable to pay FLS arising out of the\n                        Appellant’s failure to ship the Cargo on theAAL\n                            Dampier.",
        "The issues": "19     The issues framed by the Appellant and the\n                    Respondent in this appeal differ in certain respects. However, for the purposes\n                    of the appeal, we shall consider the issues framed by the Appellant for the\n                    reason that the Appellant is appealing against the Judge’s decision. The\n                    main issues framed by the Appellant are as follows: (a)     whether there was a concluded second\n                        fixture between the parties; (b)     whether the second fixture was aportorberthcharterparty;\n                        and (c)     what the\n                        appropriate remedies are in relation to the claims of the\n                    Respondent.",
        "Our decision": "",
        "Issue (a): Whether there was a concluded second fixture between the\n                parties": "20     Before us, the Appellant contended that the\n                    Judge was wrong to have found that the parties had concluded the second fixture\n                    relating to theAAL Dampier. The Appellant\n                    advanced a number of arguments in this regard. We do not propose to deal with\n                    these arguments in any detailed fashion as they seek to impugn the Judge’s\n                    findings of fact. We see no reason to disturb the Judge’s finding that on\n                    the evidence before the court, the parties had agreed on the second fixture in\n                    relation to theAAL Dampieron 17 August 2012 on\n                    the terms as set out in the various emails exchanged between the parties. We\n                    only need to mention the following arguments. 21     The Appellant argued that the arrangement for\n                    theAAL Dampierto transport the Cargo was made in\n                    response to the breach of the first fixture. Essentially, the argument is that\n                    theAAL Dampierwas merely a substitute vessel for\n                    theDahua, and therefore there was no separate\n                    agreement between the parties in relation to theAAL\n                        Dampier. In our view, the documentary evidence in the form of the\n                    emails exchanged between the parties on 17 August 2012 does not support the\n                    Appellant’s contention that the agreement regarding theAAL Dampierwas merely an extension of the first fixture, as\n                    opposed to a separate agreement. If theAAL\n                        Dampierhad been intended as a substitute vessel under the first\n                    fixture, it would have been easier and simpler for the Appellant to have stated\n                    its offer to the Respondent on that basis, without having to revise the terms of\n                    the first fixture. 22     The Appellant also argued that, unlike the\n                    first fixture which documented all the terms of the charterparty and was signed\n                    by the parties, the alleged second fixture was not signed, and that the Judge\n                    was wrong to have relied on the oral and written communications between the\n                    parties in establishing that there had been a concluded second fixture. We are\n                    unable to accept the Appellant’s argument on this issue. The law does not\n                    require a charterparty to be reduced into a single written document that is\n                    signed by both parties in order for it to be upheld as a valid agreement: see\n                    Julian Cookeet al,Voyage\n                        Charters(Informa, 3rd Ed, 2007) which states at\n                    para 1.3: A contract for the chartering of a ship isnormallyembodied in a printed form of charterparty, agreed\n                        by the parties or their agents. Under English law, however, there isno requirement that a contract for the services of a\n                            ship on a voyage should be made or recorded in any particular\n                            manner. So long as the parties have reached complete\n                        agreement,a charterparty signed by or on behalf of the\n                            parties is unnecessary. The parties’ agreement may be\n                        madein the course of written exchanges, or during\n                            conversations or meetings, and may even be inferred from conduct, so\n                            long as the inference to be drawn is clear. All that is\n                        required is that the parties should have reached a firm agreement upon all\n                        essential terms. ... [emphasis added] 23     The Appellant also argued that the second\n                    fixture was void for uncertainty in so far as it did not contain the essential\n                    terms of a charterparty. In support of this argument, the Appellant referred to\n                    the following extract from Stewart C Boydet al,Scrutton on Charterparties and Bills of Lading(Sweet & Maxwell, 21st Ed, 2008) at p 280: Charterparties, in regard to the time for loading or discharge, fall into\n                        two classes, (1) for discharge in a fixed time, (2) for discharge in a time\n                        not definitely fixed.If a charterparty is to fall within\n                            the first classthe provision for a fixed time must be in\n                        plain and unambiguous terms. [emphasis added] The Appellant’s argument is that the second fixture did not\n                    fulfil the requirement for the fixed time period to be very clear and\n                    unambiguous. In our view, the second fixture is not a fixed time charterparty\n                    (as described in the extract above) as the email sent by the Respondent to the\n                    Appellant on 17 August 2012 at 2.06pm stated unequivocally as\n                    follows: Cargo to be delivered/received as fast as vessel can load/discharge\n                        otherwise detention to apply. 24     The Appellant also argued that there was no\n                    express laycan term in the second fixture, and its absence meant that the\n                    uncertainty “goes to the root of a shipping and forwarding\n                    contract”. It was submitted that the Judge had erred in finding that the\n                    parties had intended the phrase “time of shipment” to refer to the\n                    laycan under the second fixture. In our view, the Judge’s finding in this\n                    regard was adequately supported by the evidence. The reasons given by the Judge\n                    are set out at [58]–[60] of the Judgment. We agree with the reasons and\n                    findings made by the Judge therein and we do not propose to repeat them\n                    here. 25     In summary, we see no reason to disturb the\n                    Judge’s finding that the second fixture had been validly entered into by\n                    the parties.",
        "Issue (b): Whether the second fixture was a port or berth\n                charterparty": "26     The issue as to whether the second fixture was\n                    a port or berth charterparty impacts on this appeal in two respects. First, if\n                    the second fixture is a port charterparty, then the arrival of theAAL Dampierat Nanwei on 20 August 2012 and the\n                    tendering of the NOR on the same day at 7.15pm would mean that theAAL Dampierwas an “arrived ship”, and the\n                    time spent waiting for a loading berth would be charged as time for which\n                    detention was due at US$25,000 per day pro-rated. However, in this respect, the\n                    Respondent has argued that this is not a material factor as its claim for\n                    detention charges was based on an express term of the second fixture and thus\n                    independent of whether theAAL Dampierwas an\n                    arrived ship at the time it tendered its NOR. We will deal with that argument\n                    later. 27     Secondly, the issue is material to the\n                    question as to whether the Respondent was in breach of the second fixture. It\n                    may be recalled that the Judge had found that the phrase “time of\n                    shipment” between 19 and 20 August 2012 referred to the laycan for the\n                    second fixture. On this basis, if the second fixture were a berth charterparty,\n                    theAAL Dampier’s arrival at Nanwei Port on\n                    20 August 2012 would have resulted in the Respondent being inbreachof the second fixture in so far as theAAL Dampiercould not be regarded as having arrived within the\n                    laycan period. On the other hand, if the second fixture is, in fact, aportcharterparty, theAAL\n                        Dampierwould be an arrived ship and would therefore be regarded\n                    as having validly tendered its NOR on 20 August 2012. If that were the case, the\n                    Respondent wouldnotbe in breach of the second\n                    fixture. 28     Was the second fixture a port or berth\n                    charterparty? InBulk Transport Group Shipping Co Ltd v\n                        Seacrystal Shipping Ltd[1989] 1 AC 1264 (“The Kyzikos”), Lord Brandon of Oakbrook, in\n                    delivering the leading judgment of the House of Lords, made the following\n                    observations (at 1273) on the differences between a port charterparty and berth\n                    charterparty: ... The characteristics of a port charterparty are these.First, the contractual destination of the chartered ship is a\n                            named port.Secondly, the ship, in order to qualify as having\n                        arrived at the port, and therefore entitled to give notice of readiness to\n                        discharge, must satisfy two conditions. The first condition is that, if she\n                        cannot immediately proceed to a berth, she has reached a position within the\n                        port where waiting ships usually lie. The second condition is that she is at\n                        the immediate and effective disposition of the charterers.By contrast, the characteristics of a berth charterparty are\n                            these. First, the contractual destination of the chartered ship is a\n                            berth designated by the charterers within a named port.Secondly, the ship, in order to qualify as an arrived ship, and therefore\n                        entitled to give notice of readiness to discharge, must (unless the\n                        charterparty otherwise provides) have reached the berth and be ready to\n                        begin discharging. In this regard, the Judge, in arriving at the finding that the\n                    second fixture was a port charterparty, had referred to the email which\n                    “lists theportsof loading and discharge\n                    as Nanwei and Singapore respectively” [emphasis in original]. In our\n                    view, the Judge had applied the correct legal principles as enunciated by Lord\n                    Brandon of Oakbrook inThe Kyzikosto hold that\n                    the second fixture was a port charterparty. 29     Before us, the Appellant also submitted that\n                    the first fixture was a berth charterparty and that it would not make sense for\n                    the second fixture to be a port charterparty, given that the second fixture was\n                    meant to replace the first fixture. For ease of comparison, we will set out the\n                    relevant terms in both fixtures. In the first fixture, the loading port was\n                    stated as follows: 02) LOADING PORT: 1SBP OWNERS BERTH NANWEI PORT, GUANGDONG, PR\n                        CHINA The phrase “1SBP” is shorthand for “one safe\n                    berth or port”. The loading port was stated as follows in the second\n                    fixture: PORTS OF LOADING & DISCHARGE: - POL [ie, PORT OF LOADING]: Nanwei\n                        Port The Appellant also referred to a term found in the “general\n                    conditions” section of the second fixture, reproduced as follows: Carrier’s Berth and Agents at all ends In this respect, the Appellant argued that the reference to\n                    “Carrier’s Berth” effectively meant that the second fixture\n                    was aberthcharterparty. 30     The Respondent accepts that the first fixture\n                    was a berth charterparty. However, in response to the Appellant’s\n                    arguments on the second fixture, the Respondent makes two main submissions.\n                    First, it is argued that the omission of the word “berth” from the\n                    destination in the second fixture was determinative of the fact that the second\n                    fixture was aportcharterparty. Second, the\n                    Respondent contends that the circumstances in which the second fixture was\n                    concluded are clearly different from those applicable to the first fixture,\n                    given that the latter was concluded with the benefit of time, negotiation and\n                    planning, while the former was concluded in an extremely short time\n                    frame. 31     We agree with the Judge that the second\n                    fixture was aportcharterparty, as opposed to aberthcharterparty. At the outset, we observe\n                    that the dispute turns on the construction of the second fixture. The test is\n                    whether, on the true construction of the second fixture, the destination is\n                    Nanwei Port, or a berth in Nanwei Port: see Donaldson J inNea Thyi Maritime Co Ltd of Piraeus v Compagnie Grainiere SA of\n                        Zurich[1975] 2 Lloyd’s LR 415 at 422. Having regard to the\n                    way in which the destination was defined in the second fixture, we are of the\n                    view that the destination was Nanwei Port thus making the second fixture a port\n                    charterparty. We agree with the Respondent that the omission of any reference to\n                    a “berth” in the port of loading for the second fixture,\n                    especially when viewed in the context of the express reference to “OWNERS\n                    BERTH” in the first fixture, was, at the very least, indicative of\n                    parties’ intention for the second fixture to bedifferentfrom the first fixture. 32     From a commercial perspective, we are not\n                    surprised by the difference in the terms of the two charterparties, given the\n                    different circumstances in which they were entered into. The parties had entered\n                    into the first fixture on 26 July 2012, about two weeks prior to the\n                    expected date of arrival of theDahuaat Nanwei\n                    Port. Further, taking into account the extended laycan period of 10 August to 20\n                    August 2012, it was explicable that the berthing responsibility was on the\n                    owner, as opposed to the charterer. This can be contrasted to the second\n                    fixture, which was concluded with relatively tight deadlines and on short\n                    notice. As at 17 August 2012, when both parties were still in the process of\n                    negotiating and concluding the second fixture, theAAL\n                        Dampierwas scheduled to call at Nanwei Portonly two days lateron 19 August 2012. In these\n                    circumstances, as compared to the first fixture, it was less likely for the\n                    owner to have agreed to assume the responsibility for the berthing of the\n                    vessel. 33     For the reasons set out above, we are of the\n                    view that the second fixture was a port charterparty. Accordingly, given that it\n                    is not disputed that theAAL Dampierhad arrived\n                    at Nanwei Port on 20 August 2012, the NOR had been validly tendered and the\n                    Respondent was not in breach of the second fixture. On the contrary, the\n                    Appellant was the party in breach of the second fixture when it shipped the\n                    Cargo on board theSea Castle, as opposed to theAAL Dampier. 34     The only remaining question would be the\n                    appropriate remedies to be granted in favour of the Respondent, an issue which\n                    we shall now turn to.",
        "Issue (c): The appropriate remedies": "35     We will now consider the remedies granted by\n                    the Judge (see [18] above). The sum of US$81,000 is made up as follows: (a)     US$6,000, being the loss of profit\n                        that the Respondent would have made on the overall transaction;\n                    and (b)     US$75,000,\n                        being the detention charges for the period of three days from the service of\n                        the NOR on 20 August 2012 to the Appellant’s repudiation of the second\n                        fixture on 23 August 2012. Additionally, the Judge also ordered the Appellant to indemnify\n                    the Respondent against any sum, including interest and costs that the Respondent\n                    might be found liable to pay FLS arising out of or in connection with the\n                    charter of theAAL Dampierfor the purpose of\n                    carrying the Cargo from Nanwei to Singapore in August 2012. The loss of profit 36     We affirm the Judge’s order that the\n                    Appellant is liable to pay the Respondent the sum of US$6,000, being the\n                    difference between the lump sum freight of US$155,000 for the first fixture and\n                    the lump sum freight of US$161,000 for the second fixture. This was the loss of\n                    profit the Respondent had suffered as a result of the Appellant’s breach.\n                    We would simply add that this was an undeserved profit because the Respondent\n                    was in breach of the first fixture and was liable for any loss suffered by the\n                    Appellant. However, the Appellant has not maintained on appeal its claim under\n                    the first fixture as advanced before the Judge. The detention charges 37     The claim for detention charges is premised on\n                    a term in the second fixture which we shall refer to as the “time lost\n                    clause” and which we set out here for convenience: Time lost due to swell and/or weather and/or waiting for loading and/or\n                        discharging berth on ships arrival at or off port or so near thereto vessel\n                        may be permitted to approach, will be charged as time for which detention is\n                        due[.] The Appellant contends that the time lost clause cannot be\n                    regarded as a standalone provision and that a NOR had to be validly tendered\n                    before the clause could be triggered. In other words, the Appellant takes the\n                    position that liability for detention charges (under the time lost clause)\n                    cannot arise in the event that a NOR has not been validly\n                tendered. 38     This issue is mainly academic in so far as we\n                    agree with the Judge’s finding that the second fixture was a port\n                    charterparty and that the NOR had been validly tendered (see [33] above).\n                    Nevertheless, given that both parties have made extensive written submissions on\n                    this issue, we will express our views briefly. 39     In this regard, we agree with the\n                    Respondent’s argument that its claim for detention charges can exist\n                    regardless of whether a valid NOR had been tendered or whether laytime under the\n                    charterparty had commenced. A distinction has to be drawn between a claim for\n                    demurrage (or detention charges)afterthe\n                    expiration of laytime and a claim for an agreed sum which is payable upon the\n                    occurrence of a specified event. In the present case, it is the latter: the\n                    relevant clause clearly states that detention charges are payable for any time\n                    lost due to the waiting for a loading berth. The issue of whether the second\n                    fixture was a port or berth charterparty does not arise in so far as it is not\n                    disputed that time was, in fact, lost while waiting for a loading berth. It does\n                    not matter whether theAAL Dampierwas an arrived\n                    ship given that the time lost clause clearly states that time would start\n                    running upon the vessel’s “arrival at or off port or so near\n                    thereto [the] vessel may be permitted to approach”. To this end, the\n                    requirement set out in the time lost clause is independent of the questions\n                    concerning the commencement of laytime and the tendering of a valid NOR. The\n                    detention charges are payable in so far as it is not disputed that the express\n                    requirements in the time lost clause have been satisfied as follows: (a)     time was lost; (b)     this was due to theAAL Dampierhaving to wait for a loading berth;\n                    and (c)     theAAL Dampierhad arrived at or off port or so near\n                        thereto as it may be permitted to approach. 40     The issue of whether a time lost clause could\n                    apply independent of whether a valid NOR had been tendered was considered by the\n                    English Court of Appeal inNorth River Freighters Ltd v H.E.\n                        President of India[1956] 1 QB 333 (“North River”). In that case, the charterparty specified\n                    that laytime was to commence 24 hours after the NOR had been given. The\n                    following provision was also found in the charterparty: “Time lost in\n                    waiting for berth to count as loading time.” In the course of the\n                    proceedings, the charterer made exactly the same argument that was put forth by\n                    the Appellant in the present case,ie, that time\n                    could not be lost in waiting for a berth until time has begun to run (ie, the commencement of laytime). This was soundly\n                    rejected by the court. In arriving at the conclusion that the words in the time\n                    lost clause were wholly independent of the commencement of loading time,\n                    Singleton LJ made the following observations (at 340): ... The clause as to time wasted isindependentof clause 17 [ie,\n                        the clause stipulating the commencement of loading time]. It is inserted to\n                        avoid questions which have arisen in many cases which have been before the\n                        courts. The risk of time wasted in waiting for a berth is put upon the\n                        charterers whose agents are, or ought to be, familiar with local conditions.The clause might have provided simply that time lost\n                            in waiting for a berth should be paid for at the rate of £600 a\n                            day.As drawn, it gives the charterers an advantage, for they\n                        may save on loading time some, or all, of the time lost in waiting for a\n                        berth. The time lost is to count as, or to be added to, loading time in\n                        order to ascertain the position between the parties. I am unable to accept\n                        the view that under the words in clause 5 [ie,\n                        the time lost clause] time is not lost until notice has been given under\n                        clause 17. [emphasis added] Jenkins LJ further acknowledged (at 347) that from a practical\n                    point of view: ... the fact that notice of readiness to load was not given until the\n                        period of waiting for berth was over could not affect the loss of time\n                        brought about by such period of waiting, for loading could not in any case\n                        begin until the vessel was berthed. Meanwhile, Parker LJ took an interpretative approach towards\n                    resolving the issue and made the following observations (at 349): ... No doubt “time” cannot be said to be\n                        “lost” until it has begun to run, but it surely begins to run\n                        when the vessel has reached the point where she has to stop until a berth is\n                        available. It seems to me that that is the natural meaning of the words, and\n                        that the expression is wholly independent of the time when loading time\n                        commences. In this respect, although the reasoning adopted by each judge was\n                    slightly different, they concurred that the application of the time lost clause\n                    in question did not depend on the issuance of a NOR (or the commencement of\n                    laytime). 41     In the later English Court of Appeal decision\n                    ofIonian Navigation Company Inc v Atlantic Shipping Company\n                        SA[1971] 1 Lloyd’s Rep 215 (“The\n                        Loucas N”), the issue of whether the time lost clause was\n                    independent of the laytime provisions in the charterparty arose once again. The\n                    Court of Appeal, in following its earlier decision ofNorth\n                        River, similarly arrived at the conclusion that the time lost\n                    clause was independent of the requirement for a NOR to be tendered before time\n                    could count. 42     For completeness, it is noted thatThe Loucas Nwas subsequently overruled by the House of\n                    Lords inAldebaran Compania Maritima SA Panama v Aussenhandel\n                        AG Zurich[1977] AC 157 (“The\n                        Darrah”). However, the overruling was only in relation to\n                    the Court of Appeal’s computation of laytime. In short, the House of Lords\n                    was of the view that in calculating the time lost in waiting for a berth, the\n                    vessel must be treated as if it were, in fact, in berth. In this regard, the\n                    computation of the time lost would have to exclude all periods which would have\n                    been left out in the computation of laytime used if the vessel had actually been\n                    in berth,eg, Sundays and public holidays. This\n                    issue does not arise in the present case in so far as the waiting time for theAAL Dampierwas between Monday and Wednesday\n                    of the week. For present purposes, it is noted that the House of Lords inThe DarrahdidnotoverruleThe Loucas Nin\n                    respect of the other issue of whether the time lost clause could come into\n                    effect without the tendering of a NOR. In fact, the House of Lords affirmed the\n                    earlier decision ofNorth River, which we have\n                    already discussed above. Lord Diplock stated the law as follows (at 166): ... The correctness of the actual decision in [North\n                            River] is not in doubt.It cannot have\n                            been intended that notice of readiness is required to start time running\n                            under the “time lost” clause, for if it were the clause\n                            could have no application in a berth charter, for which it is primarily\n                            designed, since notice of readiness under such a charter could never be\n                            given until the period of waiting was over and the vessel was already in\n                            berth. ... [emphasis added] Lord Diplock also clarified that the reference to the word\n                    “independent” inNorth Riverwas\n                    only with respect to the issue of whether the time lost clause was subject to\n                    the requirement for the commencement of laytime, and he cautioned against\n                    reading too much into that word (at 168): So, as Roskill LJ has pointed out in a percipient introductory passage in\n                        his judgment in the instant case, one starts with an unconsidered reference\n                        by Singleton LJ in [North River] to the\n                        “time lost” clause as being “independent” of a\n                        clause in the charterparty which, while it did contain the only stipulation\n                        as to laytime that was relevant to the question for decision in the case,\n                        viz. when laytime commenced, also contained other stipulations as to what\n                        was to be reckoned as included in permitted laytime, with which the Lord\n                        Justice was not concerned.What was intended as no more\n                            than a convenient way of stating that a provision which made notice of\n                            readiness a condition precedent to the commencement of laytime in a\n                            berth charter could have no application to the time lost\n                            clause, becomes elevated by the time [The\n                            Loucas N] reached the Court of Appeal into a rule of law that\n                        “time lost” clauses and “laytime” clauses in a\n                        berth charter constitute two independent and unrelated codes for computing\n                        the amount of permitted laytime that has been used up. [emphasis\n                        added] Before leaving the decision ofThe\n                        Darrah, we found it useful to also refer to the judgment of Lord\n                    Russell of Killowen, where it was observed as follows (at 175): ... it means that it may be, and would in this case be, more rewarding for\n                        the ship to be kept waiting for a berth than not to be kept waiting.I do not say that a charterparty cannot provide in\n                            clear terms for all waiting time to be paid for at (for example) the\n                            demurrage rate: indeed it can and sometimes does....\n                        [emphasis added in bold italics] The time lost clause in the second fixture was, in fact, such a\n                    clause in so far as it provided that detention charges were to be paid in\n                    respect of any time lost due to waiting for a berth. 43     More importantly, it must be recognised that\n                    the case authorities discussed above dealt with clauses which stipulate that any\n                    waiting time is to count as loading time. This is not quite the situation in the\n                    present case, given that the time lost clause unequivocally states that\n                    detention charges will be paid for any time lost waiting for a loading berth. In\n                    other words, issues concerning laytime and the tendering of an NOR do not arise\n                    in the present case: see Sir Bernard Ederet al,Scrutton on Charterparties and Bills of Lading(Sweet & Maxwell, 22nd Ed, 2011) at para 9–075, set out as\n                    follows: Charterparties sometimes provide that once a particular point has been\n                        reached, all time waiting thereafter will be “paid” for. Thus,\n                        in the “Austral” form the discharging clause stipulates that\n                        “if such discharging place is not immediately available, demurrage in\n                        respect of all time waiting thereafter shall be paid” at the\n                        demurrage rate. Clauses of this type aredifferentfrom\n                        those discussed in the preceding Articles [eg,\n                        clauses which stipulate that any waiting time is to count as laytime], since\n                        the waiting time neither ranks as lay-time nor is brought into the lay-time\n                        calculation.It follows that waiting time can run against\n                            the shipowner notwithstanding that the ship is not within the\n                            geographical limits of the port and no notice has been given.Similarly, waiting time can start even though the vessel is not, at the\n                        moment when she begins to wait, physically ready to load. Since the clause\n                        does not purport to make the waiting time a part of lay-time, it should\n                        logically continue to run even on days—e.g. Sundays and\n                        holidays—when the running of lay-time is suspended. Whether the\n                        running of waiting time is prevented or interrupted by excepted perils\n                        depends on the wording of the exception. [emphasis added] 44     For the reasons set out above, we are of the\n                    view that the Appellant’s contention that the time lost clause cannot give\n                    rise to liability for detention charges if a NOR had not been validly tendered\n                    has no merit. Such time lost clauses, as found in the present case, are\n                    independent of the requirement for laytime to have commenced or a valid NOR to\n                    have been tendered. In any event, we emphasise once again that our\n                    aforementioned views are mainly academic in so far as we have already upheld the\n                    Judge’s finding that the second fixture was a port charterparty and that\n                    the NOR had been validly tendered. Therefore, the Respondent is entitled to\n                    claim detention charges at the agreed rate of US$25,000 per day\n                    pro-rated. The indemnity 45     With regard to the order of indemnity granted\n                    against the Appellant, the Judge’s reasoning is set out at [81] of the\n                    Judgment as follows: Apart from damages, the plaintiff has prayed for an order that the\n                        defendant indemnify it against any sum that it may be liable to pay the head\n                        charterer (ie, FLS) arising out of the\n                        defendant’s failure to ship the cargo on theAAL\n                            Dampier. The plaintiff contends that it had specifically\n                        chartered the vessel from FLS to perform the second fixture and that it now\n                        faces a claim from FLS as a result of the defendant’s breach of the\n                        same. I accept this argument. The plaintiff’s failure to meet its\n                        contractual obligation to FLS in respect of theAAL\n                            Dampierwas due entirely to the defendant’s breach\n                        of the second fixture. If the plaintiff’s liability to FLS had already\n                        been ascertained, the plaintiff could recover the same from the defendant as\n                        part of the compensatory principle. Since such liability has not yet been\n                        determined, the plaintiff is entitled to a declaration that the defendant\n                        must indemnify it when liability is ascertained. 46     The Appellant has contended that the Judge was\n                    wrong to have granted the indemnity as the Respondent’s claim for an\n                    indemnity was flawed for the following reasons: (a)     the Respondent was not able to\n                        “point to any contract between them and any other party for [the]AAL Dampierto understand whether they\n                        possessed any liability to such party to begin\n                    with”; (b)     there\n                        was “not even a single indication of a claim or potential claim by\n                        [the] Owners”; and (c)     the decision was inconsistent with the decision of the\n                        High Court inRe Sanpete Builders (S) Pte Ltd[1989] 1 SLR(R) 5 (“Re Sanpete\n                        Builders”). 47     All three grounds can be considered together.\n                    Dealing first with ground (c), we are of the view that the High Court decision\n                    ofRe Sanpete Buildersdoes not assist the\n                    Appellant. That was a decision in winding up proceedings, and the issue before\n                    the court was whether the petitioner had a valid claim for a debt (ie, as a creditor) to support its application. One of\n                    the bases on which the defendant company resisted the application was that it\n                    had a claim for general unliquidated damages against the petitioner for breach\n                    of contract. This was the context in which the defendant company relied on the\n                    alternative argument that it was entitled to an indemnity from the petitioner in\n                    respect of any liability it may incur to the main contractor, which was already\n                    in liquidation at that point in time. This alternative argument was rejected by\n                    the court (at [35]) as no evidence had been tendered by the defendant company to\n                    show that the liquidator of the main contractor was claiming anyunliquidateddamages against it on the account of delay\n                    in the works. The court also observed that the main contractor could not claimliquidateddamages against the defendant\n                    company as a matter of law. The question inRe Sanpete\n                        Builderswas thus whether an assertion by a company against which\n                    a winding-up petition had been made that it was entitled to an indemnity from\n                    the petitioning creditor was sufficient reason not to wind up the company. It is\n                    quite different from the question of whether an indemnity should be granted,\n                    which is the question in the present case. 48     With respect to grounds (b) and (c), the\n                    Respondent has adduced no reliable evidence that FLS has in fact made any claim\n                    in writing against the Respondent with respect to the charter of theAAL Dampier. What they have produced is an email from Ms\n                    Ong dated 23 August 2012 at 12.33pm to Mr Tanquotingan email from the “owner” to Ms Ong\n                    stating as follows: We have a booking in place confirmed to you in writing. Cost for\n                        cancelling AAL Dampier will be USD 160,000 + any waiting time incurred.Payment will be due immediately As mentioned owners AAL are Singapore based and will take all necessary\n                        actions to secure payment such as but not limited to arresting any other\n                        vessel carrying the said cargo in order to secure payment. [emphasis added] 49     The Respondent has not produced an\n                    authenticated copy of the email or a copy of an invoice for payment from the\n                    “owner”. At the hearing of the appeal, counsel for the Respondent,\n                    Mr K Muralitherapany was asked to clarify this point, and he accepted that FLS\n                    had yet to make a claim against the Respondent. 50     It was on this evidence that the Respondents\n                    claimed an indemnity and the Judge granted the order of indemnity. The Judge\n                    cited no authority in support of her decision to order the indemnity, and no\n                    authority was cited to her on whether or when a declaration or an order for an\n                    indemnity in the terms of the order actually given ought to have been given in\n                    present circumstances. 51     In a similar situation inHousehold Machines Limited v Cosmos Exporters Limited[1947] 1\n                    KB 217 (“Household Machines”), Lewis\n                    J granted a declaration of indemnity in favour of the defendant. InHousehold Machines, the plaintiff had entered into a\n                    series of contracts to supply the defendant with goods which were, to the\n                    plaintiff’s knowledge, intended for resale by the defendant to third party\n                    exporters. The plaintiff failed to deliver some of the goods and the defendant\n                    withheld payment until the issue concerning the undelivered items was resolved.\n                    The plaintiff sued for the price of the unpaid goods and the defendant\n                    counterclaimed for damages for non-delivery and a declaration of indemnity in\n                    respect of any damages it might be found liable to pay third parties whom they\n                    had contracted to resell the goods to. Lewis J held that the defendant was\n                    entitled to damages for breach of contract based on its loss of profit and to a\n                    declaration of indemnity limited to such damages as might be found to be legally\n                    due from the defendant to a subsequent purchaser as a result of the non-delivery\n                    by the plaintiff. 52     Lewis J’s decision in granting the\n                    indemnity declaration was disapproved by the English Court of Appeal inTrans Trust SPRL v Danubian Trading Co Ltd[1952] 2 QB 297 (“Trans Trust”). In\n                    that case, the plaintiff seller had sought to be indemnified by the defendant\n                    buyer against any liability that the plaintiff might have hadvis-à-visits own seller as a result of the defendant’s\n                    failure to procure the opening of credit. At first instance, the trial judge\n                    granted the declaration claimed by the plaintiff. This was, however, reversed by\n                    the English Court of Appeal on the basis that the damage was too remote. The\n                    Court of Appeal further observed that even if that head of damage was\n                    recoverable (ie, in the event that it was not too\n                    remote), it wouldnotbe correct to make a\n                    declaration of indemnity. Somervell LJ stated the law as follows at 303: ... The problem can be shortly stated. B sues C for breach of contract.\n                        The court holds that B is entitled as against C to recover damages in\n                        respect of B's liability to A arising out of C's breach of contract. At the\n                        time of the hearing B is not in a position to call evidence to quantify this\n                        damage. There may be some cases in which the court can state a principle\n                        which makes the subsequent quantification of this damage simple. On the\n                        other hand, difficult questions may arise, depending, for example,(1) on any variation of the terms of the contract between B\n                            and C as between B and A, (2) on the question whether A took the steps\n                            which should have been taken to mitigate damage.No\n                        declarations ought to prejudice or preclude a proper determination of these\n                        issues, on which the defendants should be entitled to be heard. It might, as\n                        it seems to me, be more satisfactory if there wereliberty to apply for directions as to the determination of these\n                            issues, if any, and quantification of damages under this head as between\n                            plaintiffs and defendants, should disputes arise. Some order\n                        in this form, at any rate, in some cases, might bemore\n                            satisfactory than a declaration in the form ordered. [emphasis added in bold italics] Denning LJ also held that in the event where the liability of the\n                    seller to a third party was within the contemplation of the parties, but had not\n                    yet been assessed, the proper order was to reserve that head of damages. It was\n                    further observed that judgment could be entered for the damages already\n                    ascertained, leaving the rest to be ascertained later by the same or another\n                    judge (at 307). On this basis, Denning LJ arrived at the conclusion that\n                    “it would not be correct to make a declaration of indemnity”. In\n                    the subsequent English decision ofDeeny and others v Gooda\n                        Walker Ltd (in liquidation) and others[1995] 1 WLR 1206, Philips\n                    J followedTrans Trustand deferred dealing with\n                    the claimants’ future losses until it had been determined (at\n                    1214). 53     More relevant to our jurisprudence, this issue\n                    also arose in Singapore in the Federal Court decision ofEastern Oceanic Corp Ltd v Orchard Furnishing House Building Co[1965–1967] SLR(R) 25 (“Eastern\n                        Oceanic”). In that case, the appellant had undertaken the\n                    development of a large housing estate, including the construction of roads, a\n                    septic tank and the requisite sewerage mains. The respondent had agreed to buy\n                    33 lots in the estate. At first instance, the High Court reserved certain heads\n                    of damages with respect to the appellant’s failure to construct the roads\n                    to the necessary standard and to provide sewerage mains to serve eight houses.\n                    On appeal, one of the issues was whether it would be more appropriate to order\n                    the appellant to indemnify the respondent in respect of any loss it may suffer,\n                    such as any potential claim for damages by the purchasers of the houses against\n                    the respondent as a result of the appellant’s failure to construct the\n                    roads or provide the sewerage mains. The Federal Court agreed with the High\n                    Court’s decision to reserve those heads of damages with liberty to apply\n                    for directions when the real issues can be determined and damages quantified.\n                    The Federal Court examined the English cases ofHousehold\n                        MachinesandTrans Trust, before\n                    expressing its agreement with the approach undertaken in the latter decision (at\n                    [18]): ... In that case [ie,Trans Trust], Somervell LJ and Denning LJ disapproved a\n                        declaration of indemnity in respect of a possible claim by a third party who\n                        had not at that juncture made a claim. Somervell LJ pointed out that, when\n                        the stage was reached when a precise claim could be made by the plaintiff\n                        against the defendant,difficult questions might arise\n                            depending on differences in the contracts between plaintiff and\n                            defendant as compared with those made between the plaintiff and the\n                            third party (a relevant consideration in the present case) and on such\n                            questions as the obligation of the third party to mitigate\n                            damages. Logic is on the side of the views expressed by\n                        Somervell LJ and Denning LJ thatthe issue should be\n                            reserved with liberty to apply for directions when the real issues can\n                            be determined and damages quantified. The order of the High\n                        Court should therefore stand. Presumably, the situation in regard to claims\n                        by third parties should soon be clarified once the work to be completed by\n                        the appellant has been done. [emphasis added] 54     In any event, the Federal Court also explained\n                    the outcome inHousehold Machineson the basis\n                    that “the third party had alreadymade a\n                        claim, but the amount was liable to be increased because of\n                    possible claims on the third party by subpurchasers” [emphasis added] (at\n                    [17]). The Judge was bound by the decision inEastern\n                        Oceanic, and if it had been cited to her, she would no doubt have\n                    followed it. This court is in a position not to followEastern Oceanicif we are of the view that in principle the\n                    decision is wrong, even though it has stood for 50 years.Trans Trusthas stood even longer, and is still good law in\n                    England. Accordingly, we are of the view that in principle and/or good practice,\n                    the Judge erred in granting the order of indemnity on the facts of this case.\n                    Furthermore, the form of the indemnity order appears open-ended as it does not\n                    expressly provide for the Appellant to be joined as a third party in the event\n                    that FLS commences proceedings against the Respondent for payment of freight\n                    and/or detention charges. 55     InEastern\n                        Oceanic, the Federal Court affirmed the decision of the High\n                    Court to reserve the damages the plaintiff might have to pay third parties, with\n                    liberty to apply for directions when the real issues can be determined and\n                    damages quantified. In the present case, we do not think that a reservation is\n                    necessary. It is not necessary for any action by FLS to be heard before the\n                    Judge. No claim has been made. If and when FLS brings an action against the\n                    Respondent, it will no doubt join the Appellant as a third party to the\n                    proceedings.",
        "Conclusion": "56     For the reasons set out above, the appeal is\n                    allowed in part in relation to the order of indemnity. Otherwise, the appeal is\n                    dismissed. 57     The Appellant is to pay 80% of the costs of\n                    the Respondent in this appeal. We remit the issue of costs in the proceedings\n                    below to the Judge to dispose of."
    }
}