{
    "case_title": "Societe Des Produits Nestlé SA and anothervPetra Foods Limited and another",
    "ncitation": "[2016] SGCA 64",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 The law has tended to view attempts to obtain protection over three-dimensional marks (also referred to as “shape marks” in this judgment) with some suspicion. It was once observed that a trade mark must be distinct from the product to which it is applied; or, to put it another way, a product cannot be a mark of itself:perLindley LJ inRe James Trade Mark, James v Soulby(1886) 33 Ch D 392 at 395. And inRe Coca-Cola Co’s Application[1986] 2 All ER 274 (“Coca-Cola”), the House of Lords described an attempt to register the shape of the Coca-Cola bottle as “another attempt to expand on the boundaries of intellectual property and to convert a protective law into a source of monopoly” (at 275). This restrained attitude to the protection of shape marks is perhaps not unjustified, given “the spectre of a total and perpetual monopoly in containers and articles” (at 276). In more recent times, the law has become somewhat friendlier towards the registration of unconventional marks such as shape marks. Courts, however, still find themselves grappling with the single recurring theme in the present appeal: when is a trader entitled to a perpetual monopoly of a shape that has been used in connection with his trade? 2 InSociete Des Produits Nestlé SA and another v Petra FoodsLtd and another[2014] SGHC 252 (“the Judgment”), the High Court judge (“the Judge”) dismissed, among other things, the appellants’ claims for trade mark infringement, and allowed the respondents’ counterclaims for the invalidation and/or revocation of the registration of the appellants’ trade marks as well as for groundless threats of trade mark infringement. The appellants seek to reverse those rulings, and their appeal raises significant questions of law and policy peculiar to the protection of shape marks. The shapes in issue in the present case are the two-finger shape (“the Two-Finger Shape”) and the four-finger shape (“the Four-Finger Shape”) in which chocolate bars bearing the KIT KAT trade mark, with which members of the public are well-acquainted, are sold.",
        "Background": "3 The material facts are set out in detail in the Judgment and it is not necessary for us to repeat them in their entirety. We confine ourselves instead to the more important facts that are pertinent to the issues raised in this appeal.",
        "The parties": "4 The appellants belong to the Nestlé group of companies and their chocolate-covered wafer products are distributed under the KIT KAT trade mark. The first appellant, Societe des Produits Nestlé SA, is a public company incorporated in Switzerland and the second appellant, Nestlé Singapore (Pte) Ltd, is a company incorporated in Singapore. 5 The respondents belong to the Petra Foods group of companies and are both incorporated in Singapore. The first respondent, Petra Foods Limited, is the parent company of the second respondent, Delfi Singapore Pte Ltd, which is the importer and distributor of a chocolate product distributed under theTake-ItandDelfi Take-Ittrade marks.",
        "The trade marks in issue": "6 The first appellant is the registered owner of trade marks of the Two-Finger Shape and the Four-Finger Shape in Singapore. We will hereafter refer to the trade marks of these two shapes as, respectively, “the Two-Finger Mark” and “the Four-Finger Mark”. These two shape marks (collectively, “the Registered Shapes”) are as follows: The Two-Finger MarkThe Four-Finger Mark  The registration for both trade marks was specified to be for goods falling within Class 30 of the Nice Classification of Goods and Services for the Purposes of the Registration of Marks (“the Nice Classification”), namely, “[c]hocolate confectionery being chocolate coated confectionery blocks or bars and chocolate wafer biscuits” [emphasis added]. The particular features of the Registered Shapes were described as follows in their registration certificates: “[t]he trade mark consists of thethree-dimensional shapeof the goods, being [two or four] bars attached to one another by a thin base as shown in the representation on the [application form]” [emphasis added]. 7For completeness, the first appellant also claims to own the following unregistered trade mark, although it does not feature in this appeal:",
        "The parties’ products": "8 The appellants’ products are essentially moulded chocolate wafer confectioneries. Products bearing the Registered Shapes have been sold in Singapore since the 1950s. The four-finger Kit Kat product was launched as Rowntrees Chocolate Crisp in 1935, and was subsequently rebranded as Kit Kat in 1937. The two-finger Kit Kat product was launched in 1963. The popularity of these products is clear from the quantity sold in Singapore between 2003 and 2010, which is estimated to be more than 2.4m kg. 9 The respondents appear to likewise have a long history of selling moulded chocolate wafers and biscuits. According to the respondents, one of the first respondent’s subsidiaries, PT Ceres, first manufactured a moulded chocolate wafer comprising a single chocolate-coated wafer under the trade mark PATSY in Indonesia in 1951. Sometime around 1986 to 1987, PT Ceres manufactured and sold moulded chocolate wafers comprising two or three sticks of wafer joined at the base by chocolate. These were sold in Indonesia, Singapore and Dubai under the WINDMOLEN mark. Subsequently, the respondents developed a new product line consisting of two-finger and four-finger Take-It products. Like Kit Kat products, these are also moulded chocolate wafer products. 10 The resemblance between the Take-It and Kit Kat products is evident. The Take-It products, when unwrapped, take the following forms:  It is the appellants’ case that the Take-It products infringe their intellectual property rights.",
        "Summary of the parties’ pleadings": "11 In the proceedings below, the appellants pursued the following claims against the respondents: (a) trade mark infringement (product and packaging) in respect of both well-known and registered trade marks; and (b) copyright infringement (packaging). 12 In response to the appellants’ trade mark infringement claims, the respondents counterclaimed under s 35(2) of the Trade Marks Act (Cap 332, 2005 Rev Ed) (“the TMA”) for groundless threats of infringement proceedings. They also sought the invalidation and/or revocation of the registration of the Registered Shapes on the grounds that: (a) the Registered Shapes had been registered in breach of s 7(1)(a) of the TMA in that they were not trade marks within the meaning of s 2(1) of the TMA, being incapable of distinguishing the goods for which they had been registered; (b) the Registered Shapes had been registered in breach of s 7(1)(b) of the TMA in that they were devoid of any distinctive character; (c) the registration of the Registered Shapes should be revoked pursuant to s 22(1)(a) of the TMA as the Registered Shapes had not been put to genuine use in the course of trade in Singapore within five years following the date of completion of the registration procedure, and there had been no proper reasons for non-use; (d) the registration of the Registered Shapes should be revoked pursuant to s 22(1)(b) of the TMA as use of the Registered Shapes had been suspended for an uninterrupted period of five years, and there had been no proper reasons for non-use; (e) the Registered Shapes had been registered in breach of s 7(3)(a) of the TMA in that each of them consisted exclusively of “[a] shape which results from the nature of the goods themselves”; (f) the Registered Shapes had been registered in breach of s 7(3)(b) of the TMA (also referred to hereafter as “the ‘technical result’ prohibition” where appropriate to the context) in that each of them consisted exclusively of “[a] shape … which is necessary to obtain a technical result”; and (g) the Registered Shapes had been registered in breach of s 7(3)(c) of the TMA in that each of them consisted exclusively of “[a] shape which gives substantial value to the goods”. Many of the pleaded issues have not been pursued in this appeal, the scope of which is limited to the issues of trade mark infringement, invalidation and/or revocation of the Registered Shapes’ registration and, arguably, groundless threats of trade mark infringement.",
        "The decision below": "13 In the court below, the Judge dealt first with the respondents’ counterclaim for the invalidation of the Registered Shapes’ registration since the appellants’ claims for trade mark infringement would necessarily fail if the appellants had no valid legal rights to begin with. The Judge allowed this counterclaim on the basis that the Registered Shapes had been registered in breach of ss 7(1)(b) and 7(3)(b) of the TMA. 14 In respect of s 7(1)(b) of the TMA, the Judge found that the Registered Shapes were not inherently distinctive because the average consumer of chocolate products would not pay particular attention to the Registered Shapes as indicators of origin since they did not depart significantly from the norms and customs of the chocolate confectionery sector (see the Judgment at [160]). The Judge was of the view that even if the Registered Shapes did depart significantly from those norms and customs, it was insufficient to establish inherent distinctiveness since neither of these shapes amounted to “a fancy shape which truly in itself will denote trade origin” (see the Judgment at [162], citing the English Court of Appeal’s decision inBongrain SA’s Trade Mark Application[2005] RPC 14 (“Bongrain”)). Further, the Judge found that the evidence did not show that the Registered Shapes had “acquired a distinctive character as a result of the use made of [them]” for the purposes of s 7(2) of the TMA. In arriving at this conclusion, the Judge accepted that the correct test for acquired distinctiveness was that set out by Arnold J inSociété des Produits Nestlé SAv Cadbury UK Ltd[2014] ETMR 17 (“Nestlé (EWHC)”), namely, the trade mark proprietor must have “used the sign in such a way that consumers have in fact come torelyon it as indicating theoriginof the goods” [emphasis added] (see the Judgment at [170]). On this basis, the Judge found that while the results of the market surveys carried out by the appellants showed “a high degree of recognition” of the appellants’ products (see the Judgment at [211]), such recognition or association was not by itself enough to establish acquired distinctiveness (see the Judgment at [214]). Accordingly, given that the Registered Shapes lacked inherent distinctiveness and had not been proved to have acquired distinctiveness, the Judge invalidated their registration. 15 In respect of s 7(3)(b) of the TMA, the Judge found that the Registered Shapes fell afoul of the “technical result” prohibition therein in that “each and every one of the essential features of the Registered Shapes [was] necessary for a specific though different technical result” (see the Judgment at [111]). This assessment was based on the essential features of the Registered Shapes, which the Judge accepted were the essential features identified by the respondents, namely: (a) the rectangular “slab” shape of the Registered Shapes, including the relative proportions of width, length and depth; (b) the presence, position and depth of the breaking grooves arranged along the length of each bar, which effectively divided the bar into detachable fingers; and (c) the number of breaking grooves in each bar, which, together with the width of the bar, determined the number of fingers in that bar (see the Judgment at [52] and [58]). 16 Having decided that the Registered Shapes’ registration was to be invalidated as the shapes had been registered in breach of ss 7(1)(b) and 7(3)(b) of the TMA, it was unnecessary for the Judge to decide the issue of revocation. Nonetheless, the Judge briefly addressed this issue and held that the Registered Shapes’ registration could be revoked for non-use under s 22(1)(a) and/or s 22(1)(b). The Judge took the view that the mere selling of Kit Kat products without more could not be considered “trade mark use” and found that the Registered Shapes had been put only to “descriptiveuse” [emphasis added] (see the Judgment at [222]). 17 The Judge also dismissed the appellants’ attempt to seek well-known trade mark protection for the Registered Shapes, holding that marks that were unregistrable under s 7 of the TMA (which provides for absolute grounds for refusal of registration) could not fall within the definition of “well known trade mark[s]” in s 2(1) of the TMA. In his view, a shape which, under s 7(3), “shall not be registered as a trade mark” could not enjoy the special protection conferred on well-known trade marks by s 55 of the TMA. This was because Parliament had enacted s 7(3) to ensure that certain shapes could not be monopolised by any party seeking to get those shapes registered as trade marks, and the fact that those shapes might be well known should make no difference (see the Judgment at [232]). 18 For these reasons, the Judge allowed the respondents’ counterclaims for the invalidation of the registration of the Registered Shapes and for groundless threats of trade mark infringement.",
        "The issues arising in this appeal": "19 The issues arising in this appeal may be broadly stated as follows: (a) whether the Registered Shapes lack distinctiveness, either inherent or acquired (“Issue One”); (b) whether the Registered Shapes consist exclusively of the shape of goods necessary to obtain a technical result (“Issue Two”); (c) whether the registration of the Registered Shapes should be revoked for non-use (“Issue Three”); and (d) whether the Registered Shapes should be protected as well-known trade marks (“Issue Four”). 20 Given the significance of the issues that we were faced with, we appointed Prof Ng-Loy Wee Loon SC (Hon Caus) asamica curiaeto assist us. Prof Ng-Loy submitted written as well as oral submissions which we found to be of great assistance.",
        "Issue One: Whether the Registered Shapes lack distinctiveness": "",
        "Overview": "21 A trade mark gives the consumer or final user aguaranteeof the origin of the marked product by enabling him todistinguish, without any possibility of confusion, that product from others of a different provenance: seeCnl-Sucal NV SA v Hag GF AG[1990] 3 CMLR 571 at [14]. Therefore, the necessary ingredient of a protectable trade mark is distinctiveness – if the mark in question is not distinctive in the sense of indicating the origin of goods bearing the mark, the trader using it has no grounds for complaining about its use by other traders for such use would neither harm him in his trade nor confuse the public. Under the TMA, a trade mark which is not inherently distinctive cannot be registered unless it hasacquireda distinctive character as a result of the use made of it before the date of the application for registration (see s 7(2) of the TMA). 22 Whether a mark, which may consist of “any sign capable of being represented graphically” (see s 2(1) of the TMA), possesses a distinctive character, be it inherent or acquired, is a question of fact. As a broad starting point, we find useful the following summary of the principles governing distinctiveness set out in James Mellor QCet al,Kerly’s Law of Trade Marks and Trade Names(Sweet & Maxwell, 15th Ed, 2011)(“Kerly’s”)at para 8-016: (a) First, for a mark to possess a distinctive character, it must serve to identify the goods or services in respect of which registration is applied for as originating from a particular undertaking, and thus distinguish those goods or services from goods or services of other undertakings. (b) Secondly, the distinctive character of a mark must be assessed by reference to: (i) the goods or services in respect of which registration is applied for; and (ii) the perception of the average consumer of those goods or services, who is deemed to be reasonably well-informed, observant and circumspect. (c) Thirdly, the criteria for assessing distinctive character are thesamefor all categories of marks. Nevertheless, the perception of the relevant public may not always be the same for all categories of marks, and it may therefore be more difficult to establish distinctive character in relation to some categories (such as shapes, colours, personal names, advertising slogans and surface treatments) than others. 23 Some of these principles merit elaboration and will be revisited a little later in our discussion. What may be noted here is that these principles should be applied having regard to the policy rationale underlying the requirement of distinctiveness. This may be summarised in two basic ideas. First, a mark that merely describes either the product or the trader will not generally be regarded as distinctive because, if it were otherwise, the monopoly associated with the recognition of a trade mark would effectively extend over words or other “sign[s]” (as defined in s 2(1) of the TMA) which are merely descriptive and, to that extent, would unfairly and undesirably exclude other traders in the market from using them. Second, if a mark is indeed merely descriptive, then the trader has no valid basis to say that it operates as a warranty of origin. 24 The requirement of distinctive character has proved to be challenging in the context of shape marks, especially where the shape in question is the shape of the product itself. This is because the average consumer is not in the habit of making assumptions about the origin of products on the basis of their shape in the absence of any graphic or word element: seeHenkelKGaA v Office for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM)[2005] ETMR 44(“Henkel”) at [38]. The same view was expressed inWal-Mart Stores Inc v Samara Bros Inc(2000) 529 US 205, where Scalia J, writing for the United States Supreme Court, stated (at 213): In the case of product design, as in the case of colour, we think consumer predisposition to equate the feature with the source does not exist. Consumers are aware of the reality that, almost invariably, even the most unusual of product designs – such as a cocktail shaker shaped like a penguin – is intended not to identify the source, but to render the product itself more useful or more appealing. It is for this reason that we say that while the same test for distinctive character applies across all categories of marks (see above at [22(c)]), it may, in practice, be more difficult to establish the distinctive character of shape marks, especially when they take the shape of the product itself.",
        "Whether the Registered Shapes lack inherent distinctiveness": "25 The principles governing inherent distinctiveness were comprehensively stated by the English Court of Appeal inBongrain. There, trade mark protection was sought for the following shape of a cheese:  Protection was sought regardless of “the colour of the cheese or its rind or wrapping (if it [had] wrapping) and irrespective of any label which in real life would almost certainly be attached to the cheese at least at the point of sale” (at [4]). The specification of the goods for which registration was sought was stated as “Cheese; dairy products; all included in Class 29”, although the applicants offered to limit it to “cheese” (at [2]). The applicants submitted that a fancy shape, especially if confined to cheese, was strikingly unusual, and that was enough to give the shape in question a “distinctive” character, entitling it to registration without more. This was flatly rejected by the English Court of Appeal. 26 In his judgment, Jacob LJ noted that the kinds of signs which might be registered fell into a spectrum in terms of how the public perceived them. At the beginning of the spectrum were invented words and fancy devices. In the middle were semi-descriptive words and devices. Towards the end of that spectrum were shapes of containers, and at the far end would be the very shape of the goods marketed by the trader. Signs at the beginning of the spectrum were distinctive because by their very nature, they were likely to be put on goods purely to tell consumers who made them. In contrast, at the very end of the spectrum, the shape of the goods themselves was unlikely to convey such a message and the public was consequently unlikely to perceive the shape as having trade mark significance. Jacob LJ said as follows at [28]: A consumer may indeed, when looking for a cheese he has had before, recognise the shape. He might even say: “this looks like the one I had before. I suppose it could be what I want.” But, without established use and recognition it cannot be said that he would, without more, regard shape alone as giving him a guarantee of origin – the essence of what a trade mark is. 27 Reference was made inBongrain(at [8]) toHenkel,which appeared to suggest (at [39]) that the critical question in the inquiry into the distinctiveness of a shape mark was whether the shape in question departed significantly from the norms and customs of the sector. Jacob LJ considered that inHenkel, the European Court of Justice (“the ECJ”) was saying no more than that fancy shapes –ie, those which departed significantly from the norms and customs of the sector –mightmeet the requirement of distinctiveness, and not that theywould. Thus, for a sign to be distinctive, it was not sufficient for the sign to consist of a fancy shape. Instead, the appearance of the shape must by itselfconvey trade mark significanceto the relevant consumers; what mattered were the presumed expectations and understanding of the average consumer (seeBongrainat [26]). 28 The appellants do not contend thatBongrainwas wrongly decided. Instead, they attempt to confineBongrainto its facts by saying that it dealt with “quite a specific sort of case – cheese products where the shape of goods do not ordinarily communicate trade origin”. With respect, this is unhelpful in that the shape of chocolate bars or wafers also do not ordinarily communicate trade origin. The appellants must engage with the principles articulated inBongrainif they are to distinguish it, but they have not done so. Instead, they have drawn our attention to some European cases – primarily,Henkel,Bang & Olufsen A/S v Office for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM)Case No T-460/05 (10 October 2007) (“Bang & Olufsen”),DaimlerChrysler Corporation v Office for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM)Case No T-128/01 (6 March 2003) (“DaimlerChrysler”) andNestlé Waters France v Office for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM)Case No T-305/02 (3 December 2003) (“Nestlé Waters”) – which, they suggest, are better analogues for the present case. Their argument is that these cases establish the general proposition that a shape which departs significantly from the norms and customs of the sector wouldnecessarilyfulfil the function of indicating trade origin. 29 InBang & Olufsen, the Court of First Instance of the European Union (“the CFI”) held that the shape of the applicant’s hi-fi speaker was not devoid of distinctive character. In arriving at this conclusion, the court considered that in light of the nature of the goods concerned (namely, goods in Class 9 and Class 20 of the Nice Classification), in particular, their durable and technological nature, the average consumer would only purchase those goods after a particularly careful examination. The distinctive character of the shape of the applicant’s speaker must therefore be assessed in relation to the perception of the average consumer, who would exhibit “a particularly high level of attention” at the time he made his choice between different goods in the sector (at [34]–[35]). Further, the shape of the applicant’s speaker departed from the norms and customs of the sector, and was able to retain the attention of the relevant public. For these reasons, the court found as a fact that the relevant public perceived the shape of the applicant’s speaker as an indication of its commercial origin. Contrary to the appellants’ submissions, the court did not say that a mark would possess a distinctive character as long as it departed significantly from the norms and customs of the sector; it only went so far as to say that the presence of “specific or original characteristics” in a markmightconfer on it the requisite degree of distinctiveness which it would not otherwise have (at [43]). 30 InDaimlerChrysler, also a decision of the CFI, the sign in question was a depiction of the front grille of a vehicle. The court found that the sign was not devoid of distinctive character. While the court considered the shape of the grille to be unusual, a large part of its decision was influenced by the behaviour of the stakeholders in the car industry. Among other things, the court took into account the fact that in the car industry, it was common to distinguish goods not only by word marks, but also by other means to enable the public to identify the goods visually. The court further noted that vehicles and other apparatuses for locomotion by land were large goods for which it might be appropriate to use not only word marks, but also figurative or three-dimensional marks so as to enable consumers to identify the goods visually (at [40]). In addition, there was expert evidence which showed that it had already been the case for some considerable time that grilles no longer served a purely technical function (at [41]). For these reasons, the court held (at [42]): Grilles have become an essential part of the look of vehicles anda means of differentiating between existing models on the market made by the various manufacturers. They are therefore one of the features that are inherently helpful in visually identifying a model or range, or even all vehicles made by the same vehicle manufacturer, as compared to other models. [emphasis added] 31 InNestlé Waters, the sign in question was the shape of a three-dimensional transparent bottle which resembled the upper part of a woman’s body draped in a light veil. The sign was sought to be registered for “mineral and aerated waters, spring waters, flavoured waters and more particularly flavoured drinks with a mineral water and fruit or fruit extract base, fruit drinks, fruit juices, nectars, lemonades, sodas and, more generally, all non-alcoholic beverages”. The CFI found that in the market concerned, operators had for several years sought to differentiate their goods from those of their competitors through the shape of the packaging that they used. Thus, the average consumer in that market would bequite capable of perceiving the shape of the packaging of the goods concerned as an indication of their commercial originin so far as that shape presented characteristics which were sufficient to hold his attention (at [34]). It bears noting thatNestlé Waterswas concerned with a shape mark in the form of the shape of a container (as opposed to the shape of the product itself). A shape mark in the form of the shape of a container, whilst lying towards the descriptive end of the spectrum outlined by Jacob LJ inBongrain(see above at [26]), tends nonetheless to be generally less descriptive than a shape mark in the form of the shape of the product itself. The weight of the decision inNestlé Watersis thus, in our judgment, somewhat reduced when one is confronted with a shape mark in the form of the shape of the product itself. 32 In our judgment, the cases discussed at [29]–[31] above do not detract from the view expressed inBongrainthat a departure from the norms and customs of the sector, without more, would not be sufficient to impart trade mark significance to a shape. In the final analysis, whether a shape possesses a distinctive character is a question offact, and every case will turn essentially on its facts and the evidence that has been placed before the court. In the European cases cited by the appellants, the court found specific characteristics of the sector which could influence the notional expectations of the average consumer, such that he would have a heightened awareness of the trade mark significance of the shapes in question and would recognise them as indicators of origin. These are factual findings which should not be construed as standing for a broad legal proposition that the average consumer would be taken to be capable of appreciating the trade mark significance of a shape as long as it departs from the norms and customs of the sector. Indeed, as was said inUnilever Plc’s Trade Mark Applications[2003] RPC 35 (“Unilever”), “[t]rade mark registries would in effect be acting as design registries if they accept novel or attractive shapes merely on the grounds of novelty or attractiveness” (at [18]). In our context, theBongrainapproach is also consistent with the decision of our High Court inNation Fittings (M) Sdn Bhd v Oystertec plc and another suit[2006] 1 SLR(R) 712, where Andrew Phang Boon Leong J (as he then was) expressed the view that the unusual shape of a mark would not afford a sufficient basis for finding that that mark could be considered a trade mark; instead, what must be shown was that that mark was in fact perceived by the average consumer as a badge of trade origin (at [30]). 33 Several propositions may be distilled from the foregoing discussion.First, a mark’s inherent distinctiveness must be assessed by reference to the goods or services in respect of which registration is sought as well as the perception of the relevant persons, namely, the consumers of those goods or services. The critical question to ask is whether the average consumer would appreciate the trade mark significance of the mark in question without being educated that it is used for that purpose. This can be factually challenging in relation to shape marks, which are not usually perceived as conveying messages about trade origin.Second, for a mark to be registrable as a trade mark, it is insufficient for the mark to consist of a shape which is unusual, new or visually distinctive. Rather, the appearance of the mark mustin itselfconvey trade mark significance. 34 Applying these principles to the case at hand, we are satisfied that the Registered Shapes lack inherent distinctiveness.First, like the Judge, we are satisfied that the Registered Shapes do not represent a significant departure from the norms and customs of the chocolate confectionery sector.Second, and in any event, there is no evidence that the average consumer appreciates that the Registered Shapes conveytrade marksignificance. The appellants have couched their arguments in the language used by the court in the cases discussed above at [29]–[31] and have suggested that the average Singapore consumer is likely to regard the shapes of chocolate bars as trade marks as a consequence of the competitive pressure amongst traders to stand out from the crowd. This is but a bare assertion. The appellants have not pointed to any evidence which suggests in any way that traders in the chocolate confectionery sector differentiate their products by varying the shapes of their products. The situation before us is unlike that inDaimlerChryslerandNestlé Waters,in each of which the court was prepared to and did in fact make factual findings on the prevailing competitive behaviour in the relevant sectors which had an impact on the presumed expectations of the average consumer. For these reasons, we are not persuaded that the Registered Shapes are inherently distinctive. It is perhaps not surprising in the circumstances that the mark clauses in the registration certifications of the Two-Finger Mark and the Four-Finger Mark both state: “[p]roceeding because ofacquireddistinctiveness through use since 1970s” [emphasis added].",
        "Whether the Registered Shapes have acquired distinctiveness through use": "35 As a fallback position, the appellants argue that the Registered Shapes haveacquireddistinctiveness through use. There are a few related issues that arise out of the parties’ submissions in this regard, and we will deal with them in the following order: (a) the applicable test for acquired distinctiveness; (b) the visibility of the Registered Shapes at the point of sale; (c) the “limping” nature of the Registered Shapes (in so far as they have always been used alongside other trade marks); and (d) the appellants’ evidence of acquired distinctiveness. The applicable test for acquired distinctiveness 36 The notion of acquired distinctiveness embodied in s 7(2) of the TMA operates as an exception to allow the registration of signs which lack inherent distinctiveness. At what point can a sign be said to haveacquireddistinctiveness such that it does function as a trade mark? The Judge held that it was insufficient for the applicant to prove that the average consumerassociatedthe sign (in this case, a shape) with a particular manufacturer. Instead, the applicant must show that a significant proportion of the relevant class of personsreliedupon the sign on its own as indicating that the goods or services in question “originate[d] from a particular trader and from no other” (see the Judgment at [169]). We will hereafter refer to this test as “the Reliance Test”. This issue comes to the fore in the context of acquired distinctiveness because when a particular shape has been used by a trader for his products for a prolonged period, consumers may recognise it and may even associate it with that particular trader. But, does this equate with or amount to trade mark use? The appellants argue that it does, and that the Judge was wrong to apply the Reliance Test. According to the appellants, there is no need to establish reliance; it would suffice to prove that the average consumeridentifiesgoods bearing the shape in question as originating from a particular undertaking (“the Identification Test”). On this basis, the appellants submit that the test for acquired distinctiveness has been satisfied where the Registered Shapes are concerned since the Judge accepted that these shapes “enjoy a high degree of recognition” (see the Judgment at [211]). We note that unlike the appellants, Prof Ng-Loy supports the adoption of the Reliance Test. (1) “Mere association” versus reliance 37 The controversy over whether “mere association” suffices to establish acquired distinctiveness is a continuing one. Recently, inSociété des Produits Nestlé SA v Cadbury UK Ltd (No2)[2016] EWHC 50 (Ch) (“Nestlé (EWHC) No 2”) at [9], Arnold J observed that not only was the distinction between “mere association” and “reliance” prone to appear rather elusive to those who were unfamiliar with trade mark law, it had also exercised the English courts for well over a decade. This comment was made in the context of his referral of the following question to the ECJ (seeNestlé (EWHC)at [54]): In order to establish that a trade mark has acquired distinctive character following the use that had been made of it within the meaning of Article 3(3) of [the European Parliament and Council Directive 2008/95/EC of 22 October 2008], is it sufficient for the applicant for registration to prove that at the relevant date a significant proportion of the relevant class of personsrecognise the mark and associate it with the applicant’s goodsin the sense that, if they were to consider who marketed goods bearing that mark, they would identify the applicant; or must the applicant prove that a significant proportion of the relevant class of personsrely upon the mark(as opposed to any other trade marks which may also be present)as indicating the origin of the goods? [emphasis added] 38 Advocate-General Wathelet, in an Opinion dated 11 June 2015 (“Nestlé (Opinion)”), unequivocally rejected the “mere association” test (at [42]). Although the same point was not made express in the judgment of the ECJ that was rendered on 16 September 2015 (seeSociété des Produits Nestlé SA v Cadbury UK Ltd[2015] Bus LR 1034 (“Nestlé (ECJ)”)), it is nonetheless clear from that judgment that establishing “mere association” would not in itself suffice to prove acquired distinctiveness. We too agree with that position. Accepting evidence of “mere association” as sufficient would, in our judgment, detract from and undermine the essential function of trade marks, which is toguaranteethe origin of goods and services. Further, bearing in mind that trade mark law (as with most intellectual property regimes) is ultimately about negotiating a fair balance among the various stakeholders in the market concerned, we consider that adopting the “mere association” test would strike the balance too far in favour of would-be trade mark proprietors. The danger of accepting evidence of “mere association” as sufficient is succinctly captured in the following remarks of the English High Court inUnileverat [32]: There is a bit of sleight of hand going on here and in other cases of this sort. The trick works like this. The manufacturer sells and advertises his product widely and under a well-known trade mark. After some while the product appearance becomes well-known. He then says the appearance alone will serve as a trade mark, even though he himself never relied on the appearance alone to designate origin and would not dare to do so. He then gets registration of the shape alone. Now he is in a position to stop other parties, using their own word trade marks, from selling the product, even though no-one is deceived or misled. 39 InUnilever, the applicant (“Unilever”) sought to register two three-dimensional shapes as trade marks for “ice cream dessert products”. Both shapes consisted of a number of horizontal layers. One had a white “wavy” structure on top with a “Franz Hals” frill running along the side, and the other was the same but with dark chocolate on top and with layers that were different in number and arrangement. We set out the shapes below for convenient reference:  40 These two shapes were used for ice-cream products that had been sold under the trade markViennettasince 1982. By the date of the trade mark application, Unilever had sold nearly 170m packs of Viennetta products with a value of nearly £250m. To establish acquired distinctiveness through use, Unilever conducted a survey involving the following questions (at [24]): 1.  “Do you eat ice cream?” If the answer was no, the interview was terminated. Next the interviewer asked: “Here you have a selection of ice cream products”. The interviewee was shown a board with 4 products on it. No. 3 was “Viennetta”; the other three were other ice-cream dessert products on the market. All of them [had] a generally “gateau” type appearance, though they [were] clearly different when compared side by side. They were said to be the products on the market most similar to “Viennetta”. 2.  “Do you recognise any, if so can you identify them?” The interviewer then had to fill in a box giving the names of products one to four as given by the interviewee. 3.  “You have correctly identified 3 as ‘Viennetta’. Why did you say that? ” 4.  “How would you describe the appearance of ‘Viennetta’ (perhaps to a blind person)?” 41 In respect of the second question, 55 out of 82 survey respondents (approximately 67%) correctly said that the third of the four products shown to them (“No 3”) was Viennetta. At least 12 out of the 82 survey respondents said that one or more of the other products was Viennetta. Of these 12 survey respondents, eight said in addition that No 3 was also Viennetta (ie, these eight individuals identified No 3 and one or more of the other products shown to them as Viennetta). Notwithstanding this high degree of recognition of the product appearance as denoting Viennetta, it was held that the survey showed only that consumersrecognisedViennetta products by their appearance, but not that consumers treated the shape and appearance of these products as having trade mark significance (at [31]). 42 Evidence of “mere association” has similarly been rejected by other courts. InPhilips Electronics NV v Remington Consumer Products Ltd(No 1)[1999] RPC 809, the plaintiff, Philips Electronics NV (“Philips”), registered the three-dimensional shape of its three-headed rotary electric shaver as a trade mark. The English Court of Appeal observed that the shape was primarily descriptive in nature, in that it portrayed “a three headed rotary shaver of the design shown” (at 819). It went on to hold that the shape was devoid of distinctive character since there was no evidence to show that it had acquired any other meaning that denoted the origin of the goods (at 819). Significantly, the English Court of Appeal did not think it was sufficient to adduce evidence that the shape, and perhaps other designs of rotary shaver heads, had come to beexclusivelyassociated with Philips, especially since Philips was the sole supplier of rotary shavers in the United Kingdom (at 819). The critical point that emerges from this decision is that even though a trader has monopolised the use of a shape for many years and is able to establish that consumers associate that shape with his goods exclusively, this does not mean that the shape has acquired significance as an indicator of the origin of the goods. 43 InBeecham Group plc and another v Triomed (Pty) Limited[2002] 4 All SA 193 (“Beecham (CA)”), the dispute concerned a trade mark in the form of the shape of tablets specifically marketed as Augmentin tablets. The South African Supreme Court of Appeal held that the fact that “millions of these tablets are dispensed annually” and that “the average pharmacist would probablyrecognisean Augmentin tablet as such” was not sufficient as “no pharmacist will regard the shape aloneas aguaranteethat the tablet comes from Beecham” [emphasis added in italics and bold italics] (at [24]). 44 In our judgment, these authorities all go towards demonstrating the considerable difficulty that a trader will face if he contends that the shape of his product itself has trade mark significance. In essence, this is because traders seldom, if ever, themselves rely on shapes to signify trade origin; and for largely the same reason, consumers will seldom, if ever, rely on the shape of a product as having trade mark significance. We accept that long usage of a particular shape might result in a substantial degree of market recognition, such that there might be a tendency for consumers to associate that shape with a particular trader because they have become familiar with that shape and recognise it. However, such recognition or association is quite different from and does not equate with reliance upon that shape as a badge of origin. The latter occurs in the quite distinct situation where the trader and consumers of his product regard the shape in question as a badge of origin. This might happen from time to time, but it will not be found to have happened merely because the shape is associated with a product that the trader has put on the market. (2) Identification versus reliance 45 We therefore reject the “mere association” test. But the question that then naturally arises is: what should the correct test be? As mentioned earlier (see [36] above), the appellants seek to persuade us that there is no requirement of reliance (which was the test adopted by the Judge) and that the correct test should be the Identification Test. In this regard, the appellants rely primarily on the test enunciated inOberbank AG v Deutscher Sparkassen-und Giroverband eV[2014] Bus LR 786 (“Oberbank”), which we will come to shortly. We begin with the observation that the distinction which the appellants seek to draw between “identification” and “reliance” is essentially a matter of semantics. But, even assuming that there truly is a distinction to be drawn and that the Identification Test is correctly to be understood as an intermediate threshold between the “mere association” test and the Reliance Test, it would not advance the appellants’ case because the evidence that is before us does not go beyond establishing anything more than “mere association” between the Registered Shapes and the appellants and/or Kit Kat. We set out below the substantive considerations which underlie our decision on this point. 46 We begin by outlining the various formulations of the test for acquired distinctiveness cited in the parties’ submissions as well as in Prof Ng-Loy’s opinion before determining whether there is a substantive difference between them. These formulations, which were extracted from the precedents cited to us, are as follows: (a)Nestlé (Opinion): “[The applicant] must prove that only the trade mark in respect of which registration is sought, as opposed to any other trade marks which may also be present,indicates, without any possibility of confusion, the exclusive origin of the goods or services concerned” [emphasis added] (at [55]). (b)Nestlé (ECJ): “[T]he trade mark applicant must prove that the relevant class of personsperceivethe goods or services designated exclusively by the mark applied for, as opposed to any other mark which might also be present,as originating from a particular company” [emphasis added] (at [67]). (c)Oberbank, applyingWindsurfing Chiemsee Produktions-und Vertriebs GmbH v Boots-und Segelzubehor Walter Huber and Franz Attenberger[1999] ETMR 585: “[T]he relevant class of persons, or at least a significant proportion thereof,identifiesgoods or servicesas originating from a particular undertakingbecause of the trade mark in question” [emphasis added] (at [42]). (d)Nestlé (EWHC): “[A] significant proportion of the relevant class of personsrelyupon the trade mark (as opposed to any other trade marks which may also be present) asindicating the originof the goods” [emphasis added] (at [55]). 47 The above formulations of the test for acquired distinctiveness seem to us, in different ways, to address the same essential idea. The question which they are all directed at is whether,by reason alone of the mark(in this context, a shape), consumers perceive the goods in question as emanating from a particular trader. The word “rely” in this context, as used by Arnold J inNestlé (EWHC), is not “reliance in the sense that [consumers] had in the past gone out and made purchasing decisions on that basis”, but reliance in the specific sense that “they perceive [the mark in question] as a trade mark” (seeNestlé (EWHC) No 2at [59]). In our judgment, the application of the Identification Test would yield precisely the same outcome. If the average consumer “identifies goods or services as originating from a particular undertakingbecause of the trade mark in question” [emphasis added] (as required by the test set out inOberbank), it must necessarily follow that he isrelyingon that mark as a badge of origin. 48 In short, the various formulations of the applicable test for acquired distinctiveness have a common core: does the average consumer treat the sign in issue as a trade mark, that is, as a guarantee of origin? 49 The Reliance Test as formulated by Arnold J is also consistent with the jurisprudence concerning the tort of passing off. InReckitt Coleman Products v Borden Inc[1990] 1 WLR 491 (commonly known as “theJif Lemoncase”), the plaintiff sold lemon juice in a bottle shaped like a lemon, on which was embossed the brand JIF. There was also a paper label with the word “Jif” attached to the bottle. The House of Lords affirmed (at 500–501) Walton J’s finding that: …[T]he crucial point of referencefor a shopper who wishes to purchase a Jif squeezy lemon is the lemon shape itself. Virtually no, if any, attention is paid to the label which that lemon bears. [emphasis added in bold italics] 50 As Prof Ng-Loy submitted, the phrase “crucial point of reference” in the above passage is simply another way of saying that the shopperreliedon the lemon shape of the bottle as a badge of origin to inform him that the product came from a particular source. A similar approach was taken in the subsequent case ofHodgkinson Corby Ltd v Wards Mobility Services Ltd[1995] FSR 169. There, the plaintiff’s product was a cushion used on wheelchairs by the permanently immobile to prevent the onset of pressure sores. The cushion had the appearance or shape of a “black egg box” and was sold under the brand name ROHO. The defendant produced a near copy of the Roho cushion and announced that it would launch its cushion under the brand name FLO’TAIR. The plaintiff commenced aquia timetaction for passing off, but lost the suit because it could not prove that the shape of its cushion was the “crucial point of reference” for the consumer who wanted, specifically, a Roho cushion. Jacob J’s observations (at 179), which differentiate between recognition on the one hand and use as a badge of origin on the other, bear noting: It was the Rev. Wm. Paley who said: “The watch must have had a maker.” In that sense every manufactured article conveys a representation – that it had a maker. Now where an article has a readily distinguishable appearance and there has only been one maker, once the article becomes well-known in the market, consumers when they see an article like that mayassumethat it is made by the same maker as he who made the articles of that individual appearance which they have seen before. So, in the instant case, almost all those who casually saw the FLO’TAIR Cushion (or just a picture of it) reacted by saying “that is a ROHO”. One more precisely said “that is a ROHO or a convincing copy”. This sort of evidence alone can seldom, if ever, satisfy the legal test for passing off.It does not prove that anyonerelies uponthe appearance to get the product of the maker they want. … [emphasis added in italics and bold italics] 51 We are satisfied, contrary to the submissions of the appellants, that the concept of reliance as we have explained it above has always been part of the analytical framework governing acquired distinctiveness. Therefore, we do not think the Judge erred in adopting (at [170] of the Judgment) the Reliance Test enunciated by Arnold J inNestlé (EWHC)(see [14] above). For clarity, we reiterate that the question of reliance is directed at whether consumers perceive the sign in question as an indicator of the origin of the goods or services to which the sign is applied. The key question, in broad terms, is whether consumers treat that sign as a trade mark, that is to say, as a guarantee of origin. This inquiry will entail anoverall assessmentof the evidence. 52 The appellants contend that this test would be unduly onerous on would-be trade mark proprietors and would effectively sound the death knell for unconventional marks such as shape marks. Prof Ng-Loy, however, drew our attention to two cases in which the Reliance Test was satisfied in respect of such marks. The first is theJif Lemoncase, a decision on the common law tort of passing off, where it was proved to the satisfaction of the court that consumers used the plaintiff’s lemon-shaped bottle as the crucial point of reference. On appeal to the House of Lords, Lord Oliver noted that at the trial, Walton J had found as a fact that the plaintiff’s lemon-shaped bottle had become so distinctive of Jif lemon juice that the introduction of the defendant’s juice in a similar get-up would result in many consumers purchasing it in the mistaken belief that they were actually obtaining Jif lemon juice. On this basis, the House of Lords accepted that the plaintiff’s lemon-shaped bottle had acquired a secondary significance in that it indicated not only that it contained lemon juice, but, specifically, that it containedJiflemon juice (at [508]). 53 The second case isFredco Trading Ltd v Miller(2006) 8 NZBLC 101 (“FredCo”). Unlike theJif Lemoncase, which concerned the unusual shape of a container,FredCoconcerned the trade mark significance of the shape of the product itself.There, the respondent began selling the Klipon vine tie, a plastic tie used for tying kiwifruit vines to support wires, in early 1980. Over a billion units had been sold by the time of the hearing. Until the appellant’s vine tie came on the market, the only other product on the New Zealand market performing a similar function was a vine tie manufactured by ITW. The ITW vine tie looked different from the Klipon vine tie, whereas the appellant’s vine tie was virtually identical in shape and configuration to the Klipon vine tie. When the appellant started selling its vine ties, the respondent successfully filed an application to register the three-dimensional shape of the Klipon vine tie as a trade mark. The appellant challenged the validity of the registration on, among other grounds, the basis that the shape of the Klipon vine tie lacked distinctive character. 54 In the New Zealand High Court, Venning J held that the shape of the Klipon vine tie had acquired sufficient distinctiveness to be registered as a trade mark under the New Zealand equivalent of s 7(2) of the TMA. Critical to his holding was the finding on the evidence that the average consumer used the shape of the Klipon vine tie to relate the vine tie back to the respondent’s brand rather than the reverse. Significantly, the evidence showed that at the time of purchase, Klipon vine ties were visible through the product packaging (at [16]). In short, Venning J was satisfied that the average consumer identified the origin of the respondent’s productfirstby its shape, and only then related it back to the known attributes of the Klipon vine tie(at [55]). Venning J’s decision was upheld by the New Zealand Court of Appeal, which referred specifically to Venning J’s finding that the average consumer identified the respondent’s product “first by its shape” (at [31] and [80]). In so holding, the New Zealand Court of Appeal effectively applied the Reliance Test; the court was in substance saying that the average consumer relied on (or perceived) the shape of the Klipon vine tie as a badge of origin. 55 In our judgment, theJif Lemoncase andFredcoare good examples which show that the Reliance Test is not impossible to satisfy where shape marks are concerned. Further, we do not think the Reliance Test unfairly discriminates against would-be proprietors of shape marks because traders and consumers simply tend on the whole not to use the shapes of products for trade mark purposes. The visibility of the Registered Shapes at the point of sale 56 We have thus far made reference to two cases where shape marks were found to have acquired distinctiveness. In one, the shape in question was the shape of a container, while in the other, it was the shape of the product itself. What bears highlighting is that in both cases, the shape concerned was capable of being immediately perceived by the consumer at the point of sale and in that sense,couldfunction, at least notionally, as a badge of origin. The point might be made that a consumer cannot meaningfully be said to rely on the shape of a product as a badge of origin if he cannot see or perceive the shape at the point of sale. As against this, the appellants say that past experience will suffice to “teach a consumer to expect what shape he or she will find when the product is unwrapped”. It may first be noted that the appellants’ submission is the very opposite of the approach taken inFredCo,where Venning J found it significant that the average consumer identified the origin of the respondent’s productfirstby its shape and onlythenrelated it back to the known attributes of the Klipon vine tie. The respondents, on the other hand, accept that a sign can in some circumstances acquire distinctiveness even if it is not visible at the time of purchase, but argue that the correct approach is as the Judge held at [174] of the Judgment. There, the Judge considered the visibility of the sign at the time of purchase to be “especially important” in determining whether it had acquired distinctiveness since the highest level of attention would be paid by the consumer at that point in time. 57 It is not necessary for us to reach a conclusive view on this. However, we make some provisional observations. First, it does not seem to us that trade mark law shuts out completely signs which are not visible at the point of sale. For example, in Germany, inROCHER-Kugel Mark No397 35 468Case No I ZB 88/07 (9 July 2009), the shape of Rocher chocolates was found to have acquired trade mark significance; and in Belgium¸ the Brussels Court of Appeal held inNV Peeters Karel v Kraft Foods SchweizHolding AGCase No 2001/AR/2990 (2 June 2004) that the shape of the Toblerone chocolate bar enjoyed exceptionally high distinctive character even though the shape was not depicted on the product packaging. That said, the inquiry into acquired distinctiveness is inevitably an intensely factual exercise. Hence, case precedents are largely unhelpful save to the extent that they might show that the lack of visibility of a shape at the point of sale does notnecessarilypreclude it from acquiring distinctiveness so as to be registrable as a trade mark. Secondly, we accept that the two-dimensional representation of a three-dimensional shape mark on product packaging as well as other on relevant marketing materials may in certain circumstances facilitate awareness of the shape mark in its three-dimensional form by the relevant public where such representation enables the essential elements of the three-dimensional form of the shape mark to be perceived: see, for example,August Storck KG v Office for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM)[2006] ECR I-5677 at [60]. However, the effect of such two-dimensional representation must ultimately turn on how exactly the shape mark is represented in its two-dimensional form and how consumers perceive that two-dimensional representation in relation to the shape mark in its three-dimensional form. 58 Before leaving the issue of the visibility of a three-dimensional shape mark at the time of purchase, it may be relevant to note the New Zealand Trade Mark Registry’s recent decision inJ HWhittaker & Sons Limited v Empire Confectionery Limited[2015] NZIPOTM 4 to allow an application to register a trade mark in the shape of a chocolate bar. The chocolate bar in that case was known as the Sante Bar, and took the form of a simple three-dimensional shape consisting of a rectangular finger with two tapered ends. The rounded-off ends of the bar were found to be decorative, and not functional. The Sante Bar was launched in New Zealand in the early 1950s, and initially, it was sold unwrapped as individual bars. In 2001, the applicant launched a wrapped version of the Sante Bar, again sold as individual bars. The wrapping of the new version of the bar was designed to “hug” the shape of the bar so as to ensure that consumers would recognise it as the same bar that had previously been sold unwrapped. The evidence showed that both the wrapped and unwrapped versions of the Sante Bar had been sold throughout New Zealand since 2001. The New Zealand Trade Mark Registry ruled that the shape of the Sante Bar lacked inherent distinctiveness (at [54]), but had acquired distinctiveness through use. It was found in particular thatconsumers had been educated about the shape’s trade mark significancefor some 55 years by the time the trade mark application was filed (at [79]) – the shape of the Sante Bar had long been emphasised in the packaging and store display of the products, and although a version of the bar was sold wrapped, the wrapper “hugged” the bar such that the shape of the bar was still clearly visible to consumers. In light of the New Zealand Trade Mark Registry’s decision, it stands to reason that the visibility of a shape at the point of purchase is an important (albeit not determinative) factor in determining whether it has acquired distinctiveness so as to be registrable as a trade mark. The “limping” nature of the Registered Shapes 59 We turn now to consider the significance of marks that have never been used as the sole means of identifying trade origin, but have instead always been used alongside other trade marks. These are referred to as “limping” marks because they are used with other trade marks that serve as “crutches”; they may also be loosely termed “secondary” marks. There appears to be no dispute between the parties over the law in this regard since the respondents accept that it is possible (albeit difficult in practice) to prove that a mark has acquired distinctiveness even though it has always been used in conjunction with other trade marks. In our judgment, there is no absolute rule that a mark that has only been used with other trade marks cannot also on its own distinguish the relevant goods or services. Ultimately, the question is whether the mark can stand up on its ownas an indicator of trade origin, and in each case, this will depend on the evidence. Nonetheless, where a mark has never been used as a sole badge of origin, we agree with the observations of the Judge (at [173] of the Judgment), that this might lend weight to the inference that the trader does not depend on the mark standing alone to serve as a trade mark. This is a factor that the trader would have to overcome in proving that the mark has indeed acquired distinctiveness. 60 An illustration of a “limping” trade mark may be found inChocolaterie Guylian NV v Registrar of Trade Marks[2009] FCA 891. There, the trade mark was a three-dimensional shape of a seahorse, and it was always used in conjunction with the word mark GUYLIAN and a stylised letter “G”. The applicant (“Guylian”) was particularly well known for its seashell range of chocolates comprising marine life shapes (including the seahorse shape), each filled with a hazelnut praline centre and created by a blend of white, milk and dark Belgian chocolate which gave the chocolate a marbled appearance. On all of Guylian’s boxes, theGuylianword mark was prominently displayed. In addition, the stylised letter “G” was engraved on each piece of chocolate. This stylised letter itself appeared to be a registered trade mark, as recorded on the back of Guylian’s boxes, and its function was there described as follows: “[e]very Guylian chocolate creation bears the letter ‘G’, indicating the outstanding quality and consumer assurance that it is a genuine Guylian praline”. The images of the various shapes pictured on Guylian’s boxes, including the seahorse shape, clearly revealed the “G” logo, and the shapes appeared to be orientated in almost all cases such that the “G” logo was upright and readable. The court accepted in principle that a sign might be registrable as a trade mark even though it had always been used together with other trade marks, but it was not convinced on the evidence that the seahorse shape performed the function of distinguishing Guylian’s chocolates (at [97]). Although consumers who were shown the seahorse shape were able to relate it to Guylian, the association on the whole was thought to be likely to be referable to Guylian’s sale of its seashell range of chocolates (including seahorse-shaped chocolates) over a long period of time under the banner of the distinctiveGuylianand G trade marks (at [100]). Evaluation of the appellants’ evidence of acquired distinctiveness 61 Against the backdrop of the foregoing analysis of the applicable principles, we turn to consider the evidence that was led by the appellants, who conducted two sets of market surveys, one on the Two-Finger Shape and one on the Four-Finger Shape. We will refer to these surveys as, respectively, “the Two-Finger Shape Survey” and “the Four-Finger Shape Survey”. It will be useful to begin with the methodology by which the survey results were obtained, and in this regard, we refer to the description of the surveys found at [194]–[195] of the Judgment. Both surveys were conducted on 300 Singaporeans who: (a) were residents of Singapore; (b) were aged between 15 to 64; and (c) had eaten chocolate-covered wafers “in the past week and also at least on a weekly basis” [emphasis in original omitted] (at [194(c)] of the Judgment). Each survey had two parts. 62 The first part was supposed to test for confusion. First, the survey respondents were shown the Take-It product (ie, the actual chocolate bar without any wrapping) and were asked four questions in the following order (see the Judgment at [195]): (i) Q1: “I would like to show you a product. Could you please tell me what this product makes you think of?” (ii) Q2: “And, still looking at this product, apart from [mention answer to Q1], is there anything else that comes to mind?” (iii) Q3: The respondents who said KIT KAT or Nestle were then asked: “You said that when you saw this product, you thought of KIT KAT/Nestle. Can you tell me why?” (iv) Q4: “What brand or company comes to mind when you see this product?” 63 The second part of each survey was supposed to establish distinctiveness. The survey respondents were shown a mock-up of the Two-Finger Shape/the Four-Finger Shape without the words “Kit Kat” on it. The following questions were asked (see likewise [195] of the Judgment): (i) Q5: “I would like to show you another product. Could you please tell me what this product makes you think of?” (ii) Q6: “And, still looking at this product, apart from (mention answer to Q5), is there anything else that comes to mind?” (iii) Q7: The respondents who mentioned KIT KAT/Nestle were asked: “You said that when you saw this product, you thought of KIT KAT/Nestle. Can you tell me why?” (iv) Q8: “What brand or company comes to mind when you see this product?” A number of other questions followed, but they are irrelevant for present purposes. 64 Before the Judge, the appellants claimed that the survey results indicated the following: (a) The Two-Finger Shape Survey showed that 76% of the survey respondents identified the Two-Finger Shape with the appellants and/or Kit Kat. (b) The Four-Finger Shape Survey showed that 87% of the survey respondents identified the Four-Finger Shape with the appellants and/or Kit Kat. 65 The following shortcomings in the survey evidence were identified by the Judge.First, the category of survey respondents was not properly defined. Both surveys were confined to those who (among other things) “ate chocolate covered wafer in the past week and also at least on a weekly basis” [emphasis in original omitted] (see the Judgment at [194(c)]), but the Judge considered the relevant consumers of the goods to be “the general public” [emphasis in original] instead (see the Judgment at [198]).Second, leading questions were asked. The survey respondents were shown the unwrapped Take-It product and were asked twice what they thought upon seeing it. Further, Q4 asked what “brand or company” came to mind, and those who had mentioned the appellants and/or Kit Kat in response to the earlier questions in the survey would already have those names in mind. By the time Q5 was posed, the survey respondent would already be thinking of the names of chocolate-covered wafer brands as well as the names of manufacturers of such chocolate products, and perhaps even of the appellants and/or Kit Kat in particular. The Judge also thought that the problem was compounded by Q6. For survey respondents who had answered “don’t know” in response to Q5 and mentioned Kit Kat and/or the appellants in answer to Q6, this must mean that those individuals did not rely on the Registered Shapes as indicators of origin as these shapes “did not evoke anything meaningful in their minds” and they “only talk[ed] about KIT KAT/Nestle on the second try” (see the Judgment at [201]).Third, the appellants used a brown wax model of the Registered Shapes in the surveys, even though the Registered Shapes were not restricted by colour. The Judge thought that this too affected the answers (see the Judgment at [206]).Fourth, the appellants’ failure to disclose “the underlying documents and responses of the survey respondents” was, in the Judge’s view, a critical defect since it created “serious difficulties” [emphasis in original] in determining the veracity and usefulness of the survey results (see the Judgment at [207]). 66 The appellants have not furnished compelling reasons to justify our disturbing the Judge’s evaluation of the survey results. In any case, even if the shortcomings in the survey results were to be disregarded, in our judgment, these results fall well short of establishing that consumersrelyupon the Registered Shapes or even a picture of them as indicators of origin. First, the responses to the key survey questions (namely, Q5 and Q6) do not go towards establishing that the average consumer treats or perceives the Registered Shapes as trade marks in terms of the Reliance Test. At best, the survey results show that the average consumerassociatesthe Registered Shapes with Kit Kat and/or the appellants, or recognises these shapes as being similar to the shape of the Kit Kat bar. This is evident from the way in which the answers to Q5 and Q6 are framed, in that the answers amount to a statement that the survey respondent, upon seeing a mock-up of the Registered Shapes, “[thought] of” Kit Kat and/or the appellants (in respect of Q5), or found that Kit Kat and/or the appellants “[came] to mind” (in respect of Q6). Critically, the survey results do not go towards showing that the average consumer regarded the Registered Shapes (in the absence of other marks) as aguaranteethat chocolate bars bearing these shapes came from the appellants, or at least from the same source as that which produced Kit Kat products. 67 The evidence furnished by the appellants may be contrasted with that which was adduced inUnilever. As mentioned earlier, the survey respondents inUnileverwere shown a board with four products on it, with No 3 being Viennetta. Approximately 67% of the survey respondents identified No 3 as Viennetta (see [41] above) and their response amounted to a statement that No 3wasViennetta. This is quite different from a statement that Viennettacameto mindwhen No 3 was seen. Despite what appears to be a stronger degree of association inUnilever, the English High Court did not think even then that the evidence was sufficient to establish acquired distinctiveness. Similarly, as we noted earlier (at [43] above), inBeecham(CA), the South African Supreme Court of Appeal held that the fact that “the average pharmacist would probably recognise an Augmentin tablet as such” did not suffice to establish that the shape of that tablet had acquired distinctiveness. 68 Second, such association as has been shown between the Registered Shapes and the appellants and/or Kit Kat is unlikely to be referable to the use of the Registered Shapes as trade marks. The appellants have always sold the Kit Kat chocolate bar in a wrapper affixed with the Kit Kat logo, with the logo embossed on the chocolate bar itself. Most of the marketing materials depict the bar with the Kit Kat logo prominently embossed on it, together with other brand identifiers such as the slogan “Have a break, have aKit Kat” [emphasis added in bold italics]. Further, most of the marketing materials (including the product wrappers) do not depict the Two-Finger Mark and the Four-Finger Mark in the form in which they were registered. Some advertisements show the Kit Kat bar angled differently; some depict single chocolate fingers; and others depict the bar broken up. 69 In the circumstances, we do not find the evidence adduced by the appellants sufficient to show any acquired distinctiveness in the Registered Shapes. We therefore affirm the Judge’s decision to invalidate the registration of these shapes on the basis that they were registered in breach of s 7(1)(b) of the TMA as they are “devoid of any distinctive character” and have not acquired distinctiveness through use for the purposes of s 7(2) of the TMA. This is sufficient to dispose of the appeal. However, for completeness, we will nevertheless go on to set out our observations on the remaining issues which were canvassed at length by the parties.",
        "Issue Two: Whether the Registered Shapes are caught by the “technical result” prohibition": "70 The appellants’ second ground of challenge relates to the Judge’s findings in respect of s 7(3) of the TMA, which sets out absolute grounds for refusal of registration pertaining to shape marks. Section 7(3) reads: (3)  A sign shall not be registered as a trade mark if it consists exclusively of — (a) the shape which results from the nature of the goods themselves; (b) the shape of goods which is necessary to obtain a technical result; or (c) the shape which gives substantial value to the goods. 71 The Judge held in favour of the appellants in respect of s 7(3)(a) and s 7(3)(c) (see the Judgment at, respectively, [132] and [146]), and there is no cross-appeal against these findings. Therefore, the only aspect of the Judge’s decision on s 7(3) which concerns us in this appeal is his finding that the Registered Shapes could not validly be registered by reason of the “technical result” prohibition in s 7(3)(b).",
        "The policy underpinning s 7(3) of the TMA": "72 While s 7(3) has been part of the TMA since its inception in the form of the Trade Marks Act 1998 (Act 46 of 1998), it can be said to be of fairly recent vintage in the context of the law pertaining to the registration of shape marks. Prior to the enactment of the latter Act, our trade mark legislation mirrored the Trade Marks Act 1938 (c 22) (UK) (“the 1938 TMA (UK)”). The 1938 TMA (UK) did not expressly provide for the registration of shape marks and, as we have observed in the introduction to this judgment, the English courts were slow to uphold the registration of such marks. 73 Of course, the position is now no longer the same under the TMA – the definition of a “sign” in s 2(1) of the TMA now expressly includes shapes. But, as observed at para 21.2.6 of Ng-Loy Wee Loon,Law of Intellectual Property in Singapore(Sweet & Maxwell, 2nd Ed, 2014), the concerns raised in the earlier cases (see, for instance, the observations of Lord Templeman inCoca-Colaat 276) relating to the conferment of indefinite protection on matters which are more appropriately protected under other facets of the intellectual property regime remain alive under the TMA. Indeed, these concerns are likely to form the rationale underlying Art 3(1)(e) of the European Parliament and Council Directive 2008/95/EC of 22 October 2008 (“the Directive”), which is in similar terms to s 7(3) of the TMA. InPhilips Electronics NV v Remington Consumer Products Ltd[2003] RPC 2 (“Philips (ECJ)”) at [78], the ECJ noted: The rationale of the grounds for refusal of registration laid down in Article 3(1)(e) of the Directive is to prevent trade mark protection from granting its proprietor a monopoly on technical solutions or functional characteristics of a product which a user is likely to seek in the products of competitors. Article 3(1)(e) is thus intended to prevent the protection conferred by the trade mark right from being extended, beyond signs which serve to distinguish a product or service from those offered by competitors, so as to form an obstacle preventing competitors from freely offering for sale products incorporating such technical solutions or functional characteristics in competition with the proprietor of the trade mark. 74 What this means, as Prof Ng-Loy has submitted, is that there are two bars to the registration of shape marks under the TMA – one factual and one legal. The factual bar, which centres on distinctiveness, is contained in s 7(1) of the TMA. As we have noted above at [24], while shape marks are assessed no differently from other categories of marks in so far as the test of distinctiveness (whether inherent or acquired) is concerned, such marks are intrinsically less distinctive, and in practice, those seeking trade mark protection for such marks may find it more challenging to show acquired distinctiveness. The legal bar is set out in s 7(3) of the TMA, which lays down absolute grounds for refusal of registration that apply regardless of the distinctive character of the shape mark in question: see the Judgment at [28(b)], citingLego Juris A/S v Office for Harmonisation in the Internal Market[2010] ETMR 63 (“Lego Juris”) at [47]. These separate and distinct barriers to registration form an important safeguard against the undesirable perpetual monopolies which Lord Templeman warned of inCoca-Cola. 75 Other Commonwealth jurisdictions have chosen not to address these concerns by way of the statutory mechanism reflected in s 7(3) of the TMA. In Australia, the barriers to registration set out in ss 7(3)(a) and 7(3)(b) of the TMA were contained in s 39 of the Trade Marks Act 1994 (Cth) (“s 39”), but that Act was repealed before s 39 could take effect. The Trade Marks Act 1995 (Cth) which was enacted in its place contained no such provision. InKoninklijke Philips Electronics NV and another v Remington Products Australia Pty Ltd(2000) 177 ALR 167 at [15], the Federal Court of Australia held that s 39 had been omitted as it was unnecessary; the categories of shapes identified in s 39 were in any case thought to be incapable of distinguishing goods on the basis of their trade origin, and were therefore incapable of functioning as trade marks. In short, what we have referred to as the legal bar to the registration of shape marks is subsumed within the definition of a “trade mark” under Australian trade mark legislation. Similarly, the New Zealand Trade Marks Bill 2001 originally contained a clause modelled on s 7(3)(b) of the TMA, but that clause was omitted from the Trade Marks Act 2002 (NZ) due to concerns that it was difficult to interpret and would “unduly restrict and prevent registration of shapes that are distinctive”: see Rob Batty, “Is New Zealand’s Trade Marks Law Out of Shape?” (2011) EIPR 33(5) 281 at p 282. In fact, the New Zealand courts have not taken the same approach as their Australian counterparts, and unlike the position in Singapore and the United Kingdom (and, for that matter, Australia), there is nolegalbar to the registration of shape marks in New Zealand apart from the standard registrability criteria. 76 The underlying policy considerations are thrown into sharp relief in a case such as the present where the mark sought to be registered is the shapeof the product itself. Where a technical solution is embodied in the shape of a product, conferral of a monopoly over that shape in effect gives the grantee a monopoly over that technical solution. Such protection, in our judgment, should rightly fall within the ambit of some other area of intellectual property law, such as, perhaps, the law of patents, which is a regime that is governed by its own policy considerations. 77 A patent can be conceived of as a bargain where the inventor discloses his invention to the world in a manner which allows the invention to be worked, and in exchange, the inventor is granted an exclusive right to the commercial exploitation of the patent: see Lionel Bently & Brad Sherman,Intellectual Property Law(Oxford University Press, 3rd Ed, 2009) (“Bently and Sherman”) at p 335. However, because the public interest, which is served by access to valuable scientific and technical information that may otherwise have been kept secret, is also compromised by the conferment of a monopoly, patent protection is only granted for a limited term of 20 years. This reflects “the balance which is struck between the public interest in protecting innovation … and the economic interest based on the possibility of exploiting the intellectual achievements of other persons to promote future socio-economic development”: see the Opinion of Advocate-General Szpunar dated 14 May 2014 inHauck GmbH & Co KG v Stokke A/S, Stokke Nederland BV, Peter Opsvik and Peter Opsvik A/SCase No C-205/13 at [36]. This balance is also reflected in the stringent requirements that must be met before an invention is held to be patentable – namely, those of novelty, inventiveness and industrial applicability. 78 Trade marks, on the other hand, engage policy considerations that are very different from those that undergird the grant and protection of patents.Bently and Sherman(at p 718) views the public interest in ensuring market efficiency as the most compelling justification for the protection of trade marks. In a similar vein, Breyer J explained inQualitex Co v Jacobson Products Co, Inc514 US 159 (1995) at [2]: … In principle, trademark law, by preventing others from copying a source-identifying mark, “reduce[s] the customer’s costs of shopping and making purchasing decisions,” … for it quickly and easily assures a potential customer that this item – the item with this mark – is made by the same producer as other similarly marked items that he or she liked (or disliked) in the past. At the same time, the law helps assure a producer that it (and not an imitating competitor) will reap the financial, reputation-related rewards associated with a desirable product. The law thereby “encourage[s] the production of quality products,” … and simultaneously discourages those who hope to sell inferior products by capitalizing on a consumer’s inability quickly to evaluate the quality of an item offered for sale. It is the source-distinguishing ability of a mark – not its ontological status [such] as color, shape, fragrance, word, or sign – that permits it to serve these basic purposes. … 79 The distinct public interest that trade marks serve therefore warrants a different form of protection. Trade marks ensure that consumers are able to make an informed choice and to continue to do so throughout the term of their protection. As there is no advancement of the protected matter under trade mark law and no body of knowledge which can be built on in making a trade mark available for use by the general public, there is little imperative in temporally curtailing the monopoly granted to a trade mark proprietor, save to make available trade marks which other traders in the market would like to and should have a right to use (see [23] above). For these reasons, where a particular technical solution may attract the sort of protection that would ordinarily be accorded to a patent, it is appropriate that any protection to be accorded to that technical solution remains outside the domain of trade mark law. InPhilips (ECJ)at [79], the rationale underlying Art 3(1)(e)(ii) of the Directive, which is in similar terms to, specifically, s 7(3)(b) of the TMA, was said to be as follows: [Art 3(1)(e)(ii) of the Directive] is intended to preclude the registration of shapes whose essential characteristics perform a technical function, with the result that the exclusivity inherent in the trade mark right would limit the possibility of competitors supplying a product incorporating such a function or at least limit their freedom of choice in regard to the technical solution they wish to adopt in order to incorporate such a function in their product. 80 Section 7(3)(b) of the TMA therefore “reflect[s] the balancing of two considerations, both of which are likely to help establish a healthy and fair system of competition”: seeLego Jurisat [44]. The first is to ensure that undertakings do not use trade mark law to indefinitely perpetuate exclusive rights which in fact relate to technical solutions because other traders in the market should not be unnecessarily excluded from adopting these solutions. The second is the recognition that the shapes of all goods are likely, to some extent, to be functional, and it would be inappropriate to refuse to register such shapes as trade marks solely on the basis that they have functional characteristics. This latter consideration is given effect by the inclusion of the words “exclusively” in s 7(3) and “necessary” in s 7(3)(b) so as to ensure that only shape marks which “actually impede the use of [a] technical solution by other undertakings … are not to be registered” (seeLego Jurisat [48]).",
        "The test for ascertaining whether a shape mark is caught by s 7(3)(b)": "81 The test for ascertaining whether a shape mark is caught by the “technical result” prohibition in s 7(3)(b) of the TMA (“the s 7(3)(b) test”) comprises two stages: the first stage (“Stage One”) involves identifying the essential characteristics of the shape mark in question, while the second stage (“Stage Two”) entails determining whether each and every one of the essential characteristics performs a technical function: seeLego Jurisat [71]–[72];Koninklijke Philips Electronics NV v Remington Consumer Products Limited[2006] FSR 30 (“Philips (CA)”) at [38]. Neither party disputes the broad legal principles applicable to the identification of the essential features of a shape mark for the purposes of s 7(3)(b). The appellants’ contentions appear to be confined to theapplicationof those legal principles to the facts of the present case. We will nevertheless make brief observations on the general principles that apply before addressing the appellants’ specific arguments.",
        "Stage One: Identifying the essential characteristics": "Matters relevant to the assessment 82 Where Stage One of the s 7(3)(b) test is concerned,Lego Juriscan be said to depart from the English position laid down inPhilips (CA). 83Philips (CA)arose from the English High Court’s decision inKoninklijke Philips NV v Remington Consumer Products Ltd[2005] FSR 17 (“Philips (HC)”). There, Rimer J held that the clover leaf design of the shape mark in issue (see [96]–[97] below) wasnotan essential feature of that mark. In that context, he made a number of observations.First, he emphasised that the question of whether a particular element was an essential characteristic of a shape mark was one that must be answered objectively.Second, he considered that the answer “turns on whether [the design in question] is a feature of the overall shape which hasdistinctive eye impact” [emphasis added] (at [135]). Rimer J regarded the “evidence of the public as of primary relevance on this issue” (at [137]). Applying the aforementioned principles, he found that the weight of the evidence did not convince him that the clover leaf design in question had “any particular eye impact onpotential purchasers and users” [emphasis added] (at [138]). This approach was endorsed by the English Court of Appeal inPhilips (CA). Mummery LJ, in delivering the judgment of the court, observed at [52]: As in other areas of trade mark lawthe important factor is the impact of the mark on the eye of the average customer. The perception of the average customer for the goods in question does not depend on the dissection of the mark and on an examination of each feature of the mark.It turns on the feature which contributes most to the overall impression created by the whole mark.We do not accept [counsel’s] contention thatanyfeature which contributes to the overall impression is an essential feature of the mark.Not every feature of the mark has the same visual impact. The question of essential feature[is] one of fact and degree for the judge.... [emphasis added] 84 This analysis appears to deduce the essential elements of a shape mark by reference to which of its elements have the most visual impact on the average consumer. As against this, the ECJ inLego Jurisrejected the argument that the identification of the essential characteristics of a shape mark must be carried out from the perspective of “the average customer for the goods in question” (perMummery LJ inPhilips (CA)at [52]), observing instead that the assessment must be made on a “case-by-case basis” (seeLego Jurisat [70]). It took the view that in determining the essential characteristics of a shape mark, the court could either base its assessment directly on the overall impression produced by that mark, or first examine in turn each of its components. The ECJ went on to make the following observations (at [71]): [T]he identification of the essential characteristics of a three-dimensional sign with a view to a possible application of the ground for refusal under Article 7(1)(e)(ii) of Regulation No 40/94 [which is in substance similar to Art 3(1)(e)(ii) of the Directive] may, depending on the case, and in particular in view of itsdegree of difficulty, be carried out by means of asimple visual analysisof the sign or, on the other hand, be based on adetailed examination in which relevant criteria of assessment aretaken into account, such assurveys or expert opinions, or data relating to intellectual property rights conferred previouslyin respect of the goods concerned. [emphasis added in italics and bold italics] 85 On that basis, the ECJ held that the presumed perception of the shape mark in question by the average customer wasnota decisive element when applying the “technical result” prohibition, but, at most, might be a relevant criterion of assessment. In the present case, the Judge took the view that the English position was not inconsistent with the ECJ’s decision inLego Jurisin so far as the latter did not deny that there might be situations where the presumed perception of the average customer would be important. The Judge considered that the weight that ought to be given to this factor would depend on the facts. On that basis, he held that the position set out inPhilips (CA), which places an emphasis on the perspective of the average consumer, was applicable to the facts before him given that the goods in question (namely, chocolate-coated bars and wafers) were mass-manufactured snacks meant for everyday consumption which were targeted at the general public (see the Judgment at [51]). 86 Neither party disputes this aspect of the Judge’s approach. What is in dispute, however, is the relevance of the evidence of the respondents’ expert, Professor Peter Jonathan Fryer (“Prof Fryer”). The appellants, who contend that one of the essential features of the Registered Shapes is the “plinth” (ie, the base) on which the fingers in these shapes rest, submit that the Judge erred in disregarding Prof Fryer’s concession during cross-examination that a product lacking a plinth looked different from a product which had one. The Judge held that while expert opinion was not conclusive as to whether the plinth was an essential feature of the Registered Shapes, it could be taken into account (see the Judgment at [68]). This raises the issue of the extent to which “surveys or expert opinions, or data relating to intellectual property rights conferred previously” (seeLego Jurisat [71]) are relevant at Stage One of the s 7(3)(b) test. 87 The ECJ inLego Jurisdid not draw a distinction between Stage One and Stage Two of the s 7(3)(b) test in relation to the matters which the court could take into consideration. The extract which we set out at [84] above suggests that the ECJ considered that evidence of the kind which it outlined inLego Jurisat [71] could be relevant at both stages, a view shared by the Judge. That is, consistent with what the appellants submit, expert evidence can be considered in the identification of the essential features of a shape mark. We, however, find ourselves inclined instead towards the view of Prof Ng-Loy that “expert opinions” and “data relating to intellectual property rights conferred previously” (collectively, “technical evidence”) are relevant only at Stage Two of the s 7(3)(b) test and not Stage One. In the context of s 7(3)(b) of the TMA, technical evidence on the shape mark in question will be relevant only when it comes to ascertaining the technical aspects of that mark. We find it difficult to see how experts would be better placed than the courts to undertake what, essentially, is avisualassessment of the shape mark at Stage One. In contrast, technical evidence would be highly useful at Stage Two, given thetechnicalnature of this stage of the inquiry. In our judgment, the following approach should be adopted: (a) Stage One, which relates to the identification of the essential characteristics of the shape mark concerned, should be undertaken from the perspective of the average consumer. In this regard, consumer surveys might be considered relevant even if they might not be necessary. Technical evidence, however, should not be admitted at this stage. (b) In contrast, Stage Two, which involves examining the essential characteristics identified at Stage One so as to determine whether they are “necessary to obtain a technical result”, may be undertaken with the assistance of technical evidence. 88 In the circumstances, it is not necessary for us to say anything more about Prof Fryer’s purported concession. Whether the Judge erred in his identification of the essential features 89 We turn to address the appellants’ argument that the Judge erred in identifying the essential features of the Registered Shapes. To recapitulate, the Judge agreed with the respondents that the essential features of the Registered Shapes were as follows (see also [15] above), namely: (a) the rectangular “slab” shape of the Registered Shapes as depicted in the application for registration, including the relative proportions of length, width and depth; (b) the presence, position and depth of the breaking grooves arranged along the length of each bar, effectively dividing each bar into detachable fingers; and (c) the number of breaking grooves in each bar, which, together with the width of the bar, determined the number of fingers in that bar. 90 The main gist of the appellants’ case appears to revolve around the Judge’s failure to consider two other features of the Registered Shapes to be essential, namely, the trapezoidal shape of each finger and the plinth mentioned at [86] above. They argue, citing the Opinion of Advocate-General Mengozzi dated 26 January 2010 inLego Jurisat [64], that “all of the [Registered Shapes’]visually significantfeatures” [underlining in original omitted; emphasis added in italics] should be regarded as essential, given the Judge’s finding (at [131] of the Judgment) that these shapes are “relatively basic and simple”. They then appear to extend that argument beyond only “visually significant” features by going on to submit that “the simpler the form, the more significantallfeatures [are] likely to be” [emphasis added in bold italics]. Further, they say that based on “the overall impression” created by the Registered Shapes, the average consumer would notice that these shapes comprise individual fingers, and would in turn “realise that each finger … is in fact of a trapezoidal shape”. 91 We do not find either of the appellants’ arguments at [90] above persuasive. With regard to the first argument, we do not think it is supported by the Opinion of Advocate-General Mengozzi inLego Juris. There, he said (at [64]): Since it is not yet a question of determining whether the sign has distinctive character, but merely of identifying its principal characteristics, each of the individual features of the get-up of the mark concerned must be analysed in turn. In contrast to the assessment of distinctive character, it is not necessary to take into account the overall impression,unless, for example, in the case of a simple object all the characteristics comprising its shape are regarded as essential. [emphasis added] As we understand it, what Advocate-General Mengozzi meant is simply that it is necessary to take into account “the overall impression” of a shape mark where: (a) the shape in question is relatively simple;and(b) all its characteristicsarein fact essential. It does not appear to us that he intended to lay down the proposition that all the characteristics of a shape mark are to be regarded as essential merelybecausethe shape in question is relatively simple. 92 With regard to the appellants’ second argument at [90] above (ie, that the average consumer would notice the trapezoidal shape of the individual fingers comprising the Registered Shapes), the appellants refer to the following cross-sectional profile, in which the solid lines represent the cross-section of the Two-Finger Shape and the dashed lines are what the appellants have added to illustrate their point:  93 The appellants argue that from the figure above, it is “immediately obvious” that each finger (with the dashed lines taken into account) is triangular in shape, and “[i]f the triangular shape is a striking feature, and thus essential, surely the same must be said of the shape mark which is distinctly trapezoidal”. With respect, the appellants do not explain why the triangular shape is a “striking” feature of the Registered Shapes and, more importantly, why that has any bearing on whether the trapezoidal shape is an essential feature. We further observe that the appellants themselves did not consider the trapezoidal shape and the plinth to be sufficiently significant to be included in the description of the Registered Shapes at the time of the application for registration. Ultimately, we see no error in the comprehensive analysis undertaken by the Judge as regards the features of the Registered Shapes, and for the reasons set out at [60]–[63] and [72]–[73] of the Judgment, we agree with his identification of these shapes’ essential features.",
        "Stage Two: Determining whether the essential features are “necessary to obtain a technical result”": "94 Turning now to Stage Two of the s 7(3)(b) test, it is common ground, as the Judge held at [28(c)] of the Judgment (citingLego Jurisat [52]), that the “technical result” prohibition in s 7(3)(b) of the TMA will apply where “all the essential characteristics of a three-dimensional sign are dictated by the technical solution to which that sign gives effect”. There nevertheless remain two points of dispute between the parties. The first, as we understand it, relates to the argument that the essential features of a shape must serveonlya technical function and no other function (such as enhancing the aesthetic appeal of the product in question) in order for the “technical result” prohibition to apply (“the Aesthetic Appeal Argument”). The second concerns the argument that in determining whether this prohibition applies, technical results obtained in themanufacture, as opposed to thefunction, of the product in question are irrelevant (“the Manufacturing Process Argument”). The Aesthetic Appeal Argument 95 The appellants submit that the “technical result” prohibition in s 7(3)(b) of the TMA is confined to shapes whose essential features performonlya technical function; where a shape’s essential features perform some other functions (such as aesthetic functions), the essential features cannot be said to be “necessary to obtain a technical result”, and therefore, the shape would not be caught by the “technical result” prohibition. This, they say, is supported by decisions of the ECJ, includingPhilips (ECJ), where it was held (at [83]–[84]): 83 Where the essential functional characteristics of the shape of a product areattributablesolelyto the technical result, Article 3(1)(e), second indent, [of the Directive] precludes registration of a sign consisting of that shape, even if that technical result can be achieved by other shapes. 84 In the light of those considerations ... Article 3(1)(e), second indent, of the Directive must be interpreted to mean that a sign consisting exclusively of the shape of a product is unregistrable by virtue thereof if it is established that the essential functional features of that shape areattributableonlyto the technical result… [emphasis added in italics and bold italics] 96 The appellants point to the Judge’s finding at [48] of the Judgment that “the Registered Shapes were motivated at least in part by the need for the Kit Kat product to look and taste desirable to the consumer”, and submit that the essential features of these shapes serve an aesthetic as well as a technical function. As the respondents point out, a similar contention was advanced before the English courts, but without success. InPhilips (HC), it was argued that the following shape mark in the form of the shape of the faceplate of a three-headed electric rotary shaver had been registered in breach of the English equivalent of s 7(3)(b) of the TMA:  97 The plaintiff trade mark owner submitted otherwise, contending that the clover leaf design of the faceplate (enclosing the three rotary blades) was an essential feature which was not functional; and that even if it were functional, the words “solely” and “only” at, respectively, [83] and [84] ofPhilips (ECJ)(reproduced above at [95]) meant that the “technical result” prohibition would not apply where any of the essential features also performed an aesthetic role. This argument, which was in essence the Aesthetic Appeal Argument, was rejected by Rimer J, who viewed the entire faceplate, of which the clover leaf design was only a part, as the essential characteristic of the shape mark. He held that it would be incorrect to require that every single part of every single essential feature of a shape mark must be shown to perform a function attributable to a technical result in order for the shape mark to fall within the “technical result” prohibition, and that the faceplate as a whole did contribute to the technical result (seePhilips (HC)at [35]). In any case, he dismissed the plaintiff’s argument on the following grounds (seePhilips (HC)at [34]): (a) The words “solely” and “only” at, respectively, [83] and [84] ofPhilips (ECJ) had been introduced without justification or explanation, and were likely to have been used because the ECJ simply adopted the wording of the questions that were referred to it. (b) It was unlikely that the ECJ had the Aesthetic Appeal Argument in mind inPhilips (ECJ)as that argument did not form part of the case argued before it. (c) To require, as the Aesthetic Appeal Argument did, that the essential features of a shape mark must have no aesthetic appeal – an inherently subjective assessment – even where those features were attributable to a technical result would introduce uncertainty to a vital area of commerce. (d) There was nothing in the language of Art 3(1)(e)(ii) of the Directive orPhilips (ECJ)that justified the inclusion of a qualifier to the “technical result” prohibition. 98 We substantially agree with the holding of Rimer J and also with his reasoning. In our judgment, the appellants’ construction of s 7(3)(b) of the TMA runs contrary to the express wording of the provision as well as the policy considerations that underlie it. As noted inPhilips (CA)at [62], there is nothing in the terms ofPhilips (ECJ)or the policy underlying Art 3(1)(e)(ii) of the Directive that requires a court to dissect a shape mark and analyse the extent to which the role played by each of its essential features serves a technical function. Where every essential feature of a shape is attributable to a technical result, allowing trade mark protection for that shape would in effect grant the would-be trade mark owner a potentially perpetual monopoly over a technical solution. We see no reason why the fact that an essential feature also serves an aesthetic (or other non-technical) function should override the strong public interest in allowing public access to the technical solution. There are, of course, limits to the weight to be accorded to this public interest in the construction of s 7(3)(b) of the TMA, and in this regard, we endorse the balance struck by the ECJ inLego Jurisat [52]: namely, that while “minor arbitrary elements” in the shape of a product would not suffice to take the shape outside the ambit of the “technical result” prohibition, this prohibition would not apply if the shape “incorporates amajor non-functional element, such as a decorative or imaginative element which plays an important role in the shape” [emphasis added]. The Manufacturing Process Argument 99 The appellants’ second argument in respect of Stage Two of the s 7(3)(b) test relates to the scope of s 7(3)(b) – namely, whether the term “technical result” in this provision encompasses technical solutions embodied in the process ofmanufacturingthe product to which the shape mark is applied (referred to as “the final product” in this context for ease of discussion), as opposed to in the manner in which that productfunctions. The Judge held that it did and, further, that each of the three essential features of the Registered Shapes was necessary to attain a distinct technical result (see the Judgment at [92] and [111]). Crucially, the first of these essential features, being the rectangular “slab” shape of the Registered Shapes, was found to be necessary to obtain a technical result only by virtue of the advantages gained in the course of the manufacturing process. 100 To counter this finding, the appellants submit that at Stage Two of the s 7(3)(b) test, “it is not appropriate to take account of manufacturing considerations”; in other words, shapes whose essential features are “necessary to obtain a technical result” only in respect of the process of manufacturing the final product do not fall within s 7(3)(b). They point to the wording of the provision, highlighting that s 7(3) as a whole generally adopts the consumer’s rather than the manufacturer’s perspective. For instance, s 7(3)(a) prohibits the registration of shapes which “[result] from the nature ofthe goodsthemselves” [emphasis added], while s 7(3)(c) prohibits the registration of shapes which “[give] substantial value tothe goods” [emphasis added]. Even s 7(3)(b) itself, the appellants contend, suggests that it is concerned with the final product rather than the manufacturing process – according to the appellants, the phrase “necessary to obtain a technical result” logically implies that the technical result is one that arises out of the shape ofthefinal product. 101 The respondents, on the other hand, argue largely from policy. Prof Ng-Loy’s position on this issue is broadly aligned with the respondents’. In particular, she submits that s 7(3)(b) should be interpreted broadly in view of the policy considerations that we have already alluded to, in particular, the importance of ensuring that technical solutions remain in the public domain for use by all economic operators in the market. On this basis, she submits that where the essential features of a shape are necessary to produce a technical result inherent in the process of manufacturing the final product in question, that shape is not the proper subject matter for protection under the trade marks regime and should be prohibited from registration by s 7(3)(b). 102 The respondents’ (and Prof Ng-Loy’s) proposition is supported by Arnold J’s decision inNestlé (EWHC)and Advocate-General Wathelet’s Opinion inNestlé(Opinion). InNestlé (EWHC), the first appellant sought to register the Four-Finger Shape as a trade mark in the United Kingdom. The application for registration was opposed on grounds largely similar to those in the appeal before us. In particular, reliance was placed on s 3(2)(b) of the Trade Marks Act 1994 (c 26) (UK), which is in similar terms to s 7(3)(b) of the TMA as well as Art 3(1)(e)(ii) of the Directive. Arnold J was inclined to the view that Art 3(1)(e)(ii) of the Directive embraced technical results in respect of both the function and the manufacture of the final product concerned as there was nothing in the wording of the provision which limited it to the former, and further, to limit it in that way would be inconsistent with the policy underlying the provision (seeNestlé (EWHC)at [74]). He nevertheless referred the following question to the ECJ (seeNestlé (EWHC)at [75]): Should Article 3(1)(e)(ii) of [the Directive] be interpreted as precluding registration of shapes which are necessary to obtain a technical result with regard to the manner in which the goods aremanufacturedas opposed to the manner in which the goodsfunction? [emphasis added] 103 Advocate-General Wathelet answered the question in the affirmative inNestlé (Opinion). He acknowledged that a literal interpretation of Art 3(1)(e)(ii) of the Directive would exclude technical considerations relating to the manufacture of the final product. However, he interpreted the use of the phrase “or at least” by the ECJ inPhilips (ECJ)at [79] (set out at [79] above) as entailing that Art 3(1)(e)(ii) of the Directive extended beyond technical results relating to the function of the final product. 104 The ECJ, however, took a contrary position inNestlé (ECJ). There, the ECJ adopted a literal interpretation of Art 3(1)(e)(ii) of the Directive, restricting the ambit of the provision to technical results relating to the manner in which the final product functioned and excluding technical results relating to the manner in which it was manufactured. The ECJ also held at [55]–[56] ofNestlé (ECJ)that such an interpretation of Art 3(1)(e)(ii) was consistent with its purpose and the case law as it stood: 55 That interpretation is confirmed by the objective of Article 3(1)(e)(ii) of [the Directive], which consists, as is apparent from the case-law cited in paragraph 44 above, in preventing a monopoly from being granted on technical solutions which auseris likely to seek in the goods of competitors. From theconsumer’sperspective, the manner in which the goods function is decisive and their method of manufacture is not important. 56 Moreover, it follows from the case-law that the manufacturing method is not decisive in the context of the assessment of the essential functional characteristics of the shape of goods either. The registration of a sign consisting of a shape attributable solely to the technical result must be refused even if that technical result can be achieved by other shapes, and consequently by other manufacturing methods (see, to that effect, [Philips (ECJ)at [83]]). [emphasis added] 105 We, however, prefer the view that shapes whose essential features are necessary to obtain technical results relating to the manufacture of a final product should fall within the ambit of s 7(3)(b) of the TMA as well. It seems to us that the consumer-driven perspective adopted by the ECJ inNestlé (ECJ)at [55] may be traced to the court’s interpretation of the objective of Art 3(1)(e)(ii) of the Directive, which appears to be influenced by general considerations of unfair competition rather than the facilitation of technological advancement. The focus of the court in that case appeared to be on the fact that by allowing a shape whose essential features are necessary to obtain technical results in thefunctionof a final product to be monopolised indefinitely, a trade mark owner might acquire a permanent edge over his competitors. But, even from this perspective of unfair competition, it seems to us no less anti-competitive to allow the registration of a shape whose essential features are necessary to obtain technical results in themanufacture(as opposed to the function) of a final product, given that any advantage that the trade mark owner might obtain in the manufacturing process would likely translate to greater efficiency and cost savings for him and likewise give him an unfair edge over his competitors. Further, if, indeed, the policy of the law is to ensure that valuable scientific and technical knowledge is made available to the general public, we see no reason why the public interest is any less served by making available scientific and technical knowledge relating to manufacturing processes. Indeed, patent law affords protection to both final products and manufacturing processes, and the policy reasons which favour protecting the latter under the patents regime weigh equally against their protection under the trade marks regime. 106 The appellants refer to the decision inSimba Toys GmbH & Co KG v Office for Harmonisation in the Internal Market (OHIM)[2015] ETMR 15 (“Simba”) in support of their proposition that “the analysis of the technical [result] exclusion is confined to an examination of thegraphical representationof the mark as registered or sought to be registered and … it isnotpermissible to consider ‘invisible elements’ not perceptible from the mark in question because such ‘invisible elements’ are not protected by the mark” [emphasis in original omitted; emphasis added in italics]. As we understand it, the appellants seek to rely onSimbafor the proposition that if a technical function is performed by some element of a shape mark that cannot be discerned from the graphical representation of that mark, the mark will not be caught by the “technical result” prohibition in s 7(3)(b) of the TMA. 107Simbaconcerned an application to invalidate the registration of the shape of the Rubik’s Cube as a shape mark. That mark had been registered in the graphical form shown below:  The General Court of the European Union (“the General Court”), as the CFI was termed from 1 December 2009 onwards, held that the registration was valid and dismissed the application. In particular, while it identified the grid structure on each surface of the Rubik’s Cube as an essential characteristic of the shape mark, it rejected the applicant’s argument that the black lines forming the grid structure performed the technical function of separating the individual elements of the cube such that they were individually movable. It held at [58]–[59]: 58. … [T]he applicant’s line of argument, as is apparent from its pleadings, is essentially based on knowledge of the rotating capability of the vertical and horizontal lattices of the Rubik’s Cube. However, it is clear that that capability cannot result from the black lines in themselves or, more generally, from the grid structure which appears on each surface of the cube in question, but at most from a mechanism internal to that cube, which is invisible on the graphic representations of the contested mark and which, as is not indeed disputed by the parties, cannot constitute an essential characteristic of that mark. 59. In that context, the Board of Appeal cannot be criticised for not having included that invisible element in its analysis of the functionality of the essential characteristics of the contested mark. … 108 The decision of the General Court was reversed by the ECJ inSimba Toys GmbH & Co KG v European Union Intellectual Property OfficeCase No C-30/15P (10 November 2016) (“Simba(ECJ)”), which was rendered shortly before the release of the present judgment. The ECJ in essence held (at [47]–[48]) that the General Court erred in not taking into consideration the internal rotating mechanism of the Rubik’s Cube in assessing “the functionality of the essential characteristics of the [shape mark]” (at [51]). 109 We see no controversy in so far as the scope of protection afforded to a shape mark should be determined by its graphical representation as registered, given that a “trade mark” is defined in s 2(1) of the TMA as “any sign capable of being representedgraphically…” [emphasis added]. However, that does not inevitably lead to the conclusion that thetechnical effectof the essential features of a shape mark must be visible in the graphical representation of that mark in order for the “technical result” prohibition in s 7(3)(b) to apply. In our view, where a technical result attributable to the essential features of a shape mark is obtained in the manufacture of the final product, s 7(3)(b) will apply if the essential features in question are: (a) necessary to obtain the technical result; and (b) visible in the graphical representation of the shape mark. Our ruling on this point is consistent withSimba(ECJ), which acknowledges that a shape mark can fall within the European Union equivalent of our s 7(3)(b) even where thetechnical functionperformed by the essential features of that shape mark cannot be discerned from the graphical representation of the mark. Our analysis 110 In light of the foregoing discussion, we turn to the appellants’ contention that the Registered Shapes are not caught by the “technical result” prohibition in s 7(3)(b) of the TMA. 111 The appellants submit as follows: (a) Even if technical results relating to manufacturing processes may be considered at Stage Two of the s 7(3)(b) test, the manufacturing “constraints” which the first and third essential features of the Registered Shapes are said to overcome are so broad that they “cannot meaningfully be said to influence the shape of the [appellants’ products] at all”. (b) As for the second essential feature of the Registered Shapes, it adds to the aesthetic appeal of their products and is therefore “not solely functional”. 112 The argument made in respect of the second essential feature of the Registered Shapes is the Aesthetic Appeal Argument, which we have already rejected at [98] above. All the appellants argue is that the second essential feature is “not solely functional”; they do not suggest, rightfully in our judgment, that it is “a major non-functional element” (seeLego Jurisat [52]). That leaves us to address the arguments made at [111(a)] above in respect of the first and third essential features. 113 Like the respondents, we have difficulty ascertaining the precise nature of the appellants’ submissions in this regard. As we understand it, the appellants do not contend that the first and third essential features perform no technical function whatsoever. Instead, they argue that “the parameters of a moulded [chocolate wafer] product” as outlined by the Judge at [98] of the Judgment – namely, the need to create a “bite-sized” product that is attractive to the consumer, and the need to ensure “efficient operation” by using a mould that is sufficiently deep and wide, of a simple enough shape and of a design that allows the product to be readily broken by the consumer – are so broad that they can be achieved by virtually any shape. They are therefore “not really constraints at all and certainly do not result in solely manufacture-driven shapes”. 114 The appellants’ argument that the aforesaid technical “parameters” can be accommodated byvirtuallyany shape appears to us, on one interpretation, to be a variation of the argument that a shape cannot be considered to be “necessary to obtain a technical result” where that technical result could have been obtained by other shapes. On this point, we agree with the Judge that that in itself does not bring a shape outside s 7(3)(b) of the TMA (see the Judgment at [28(d)], citingLego Jurisat [83]). This is because granting trade mark protection over a purely functional shape would prevent competitors from using not just that shape, but similar shapes as well. This could severely curtail the number of shapes available to competitors for their use, and even more so where various purely functional shapes are registered at the same time (seeLego Jurisat [56]–[57]). 115 The appellants’ argument, taken at its highest, appears to be that a technical function which can be served byanyshape cannot be a technical function that is attributable to the essential features of a shape. We agree. For instance, the technical function of a chocolate product being “bite-sized” can be achieved by any shape and, accordingly, cannot be said to be a “technical result” of the shape of the product. But, that is not the nature of the essential features identified in the present case. With regard to the first essential feature of the Registered Shapes, the Judge accepted Prof Fryer’s evidence that the wafer fingers making up Kit Kat chocolate bars are cut from a larger shape, and that the most effective way is to “use parallel cuts and create arectangularbox shape, [so as] to prevent wastage” [emphasis added] (see the Judgment at [99]). As for the third essential feature, it cannot be said that the technical function of being breakable into suitably-sized portions can be performed byanynumber of breaking grooves in a bar regardless of its width. If there are too many breaking grooves and, thus, too many fingers in a bar, it might make each broken-off portion too small for satisfactory consumption and might also make it difficult for each portion to be broken off cleanly. Conversely, if there are two few breaking grooves and, thus, too few fingers in a bar, that might make each broken-off portion too large for convenient consumption. Ultimately, all that is required for a shape to fall within the “technical result” prohibition in s 7(3)(b) of the TMA is that each of its essential features is “necessary to obtain a technical result”, and that is clearly made out on the evidence before us. That being the case, we find that the Registered Shapes are caught by s 7(3)(b).",
        "Issue Three – Whether the registration of the Registered Shapes should be revoked for non-use": "116 The appellants’ third ground of challenge concerns the Judge’s finding that even if the Registered Shapes were not caught by the absolute grounds for refusal of registration in s 7 of the TMA, their registration ought to be revoked on the grounds of non-use under s 22(1)(a) and/or s 22(1)(b) of the TMA. The relevant portions of s 22 read: 22.—(1)  The registration of a trade mark may be revoked on any of the following grounds: (a) that, within the period of 5 years following the date of completion of the registration procedure, it has not been put to genuine use in the course of trade in Singapore, by the proprietor or with his consent, in relation to the goods or services for which it is registered, and there are no proper reasons for non-use; (b)  that such use has been suspended for an uninterrupted period of 5 years, and there are no proper reasons for non-use; … (2)  For the purposes of subsection (1), use of a trade mark includes use in a form differing in elements which do not alter the distinctive character of the mark in the form in which it was registered, and use in Singapore includes applying the trade mark to goods or to materials for the labelling or packaging of goods in Singapore solely for export purposes. … [emphasis added] 117 The Judge held at [221]–[222] of the Judgment that whether a trade mark had been used in a trade mark sense (that is, as an indicator of origin) was a question of fact, and that on the evidence before him, there had been no genuine use of the Registered Shapes in the course of trade for the purposes of s 22(1)(a) and/or s 22(1)(b) of the TMA. Specifically, he held that the mere commercial exploitation of the appellants’ products could not constitute trade mark use, and noted that the Registered Shapes were never used on their own. It is these two aspects of his decision which the appellants are challenging on appeal. First, they contend that given that a sign would have to be distinctive in the first place in order to constitute a registered trade mark for the purposes of s 22, use of a sign in the “ordinary sense”, such as by selling products bearing the sign, would constitute trade mark use. They point to the fact that s 22(2) expressly allows for different forms of use, presumably in support of a broader construction of the word “use” in s 22(1)(a) and s 22(1)(b). Second, they say that the Judge erred in law in considering it relevant that the Registered Shapes were never used on their own.",
        "What constitutes “genuine use in the course of trade”": "118 The issue of what constitutes “genuine use in the course of trade” (hereafter referred to as “genuine use” for short) for the purposes of s 22(1)(a) and s 22(1)(b) of the TMA has been considered in at least two decisions of our High Court. InLove & Co Pte Ltd v The Carat Club Pte Ltd[2009] 1 SLR(R) 561 (“Love & Co”), the trade mark owner was unable to show evidence of genuine use of the registered LOVE trade mark. That trade mark had been registered in the form of a simple word mark (“the simple LOVE mark”) comprising four capital letters without any motifs, intricate designs or modifications to any of the constituent letters. The High Court judge found that the use of the word “LOVE” in decorative form (“the decorative LOVE mark”) on jewellery sold by the trade mark owner was insufficient to constitute genuine use of the simple LOVE mark because customers were unlikely to perceive the decorative LOVE mark as a trade mark or as a representation of the simple LOVE mark. It was specifically noted inLove & Coat [122] that the trade mark owner “[had] not made clear that the simple ‘LOVE’ mark [was]meant to be its trade mark” [emphasis added]. A similar approach, albeit with a different outcome, was taken inWeir Warman Ltd v Research & Development Pty Ltd[2007] 2 SLR(R) 1073 (“Weir Warman”), in which V K Rajah JA held that there had been genuine use of the defendant’s registered WARMAN trade mark in relation to pumps because (at [109]): … Hytrade would be relying upon the “Warman” mark as a badge of origin when entering into the discussions [with the defendant] to purchase the “Warman” pumps and to promote “Warman” pumps to various mining houses and consultants in Singapore. The communication relating to the “Warman” mark on pumps during the Hytrade meeting is thereforeconsistent with the essential function of a trade markand can constitute genuine use for the purposes of s 22(1) of the TMA. [emphasis added] 119 It is clear from this extract that inWeir Warman,Rajah JA equated “genuine use for the purposes of s 22(1) of the TMA” with useas a trade mark. As the Judge observed at [220]–[221] of the Judgment, this is an interpretation that comports with the law as it stands in the European Union (seeStichting BDO v BDO Unibank Inc[2013] FSR 35 at [51]), Australia (seeE& J Gallo Winery v Lion Nathan Australia Pty Limited(2010) 241 CLR 144) and New Zealand (seeTasman Insulation New Zealand Limited v Knauf Insulation Limited(2014) 108 IPR 162), as well as with academic opinion (see Susanna H S Leong,Intellectual Property Law of Singapore(Academy Publishing, 2013) at para 31.013(B)(c);Kerly’sat para 10-068; Tan Tee Jim SC,Law of Trade Marks and Passing Off in Singapore(Sweet & Maxwell, 3rd Ed, 2014) (“Tan Tee Jim”) at vol 1, paras 9.017–9.022). There are compelling reasons why “genuine use” in the context of s 22 of the TMA should be construed as trade mark use. As Rajah JA explained inWeir Warmanat [99]: … It must be noted at the outset that this requirement of “genuine use” is closely intertwined with the function of a trade mark and the purpose of registration … A trade mark serves to indicate the source of the goods to which it is affixed and registration facilitates and protects this function of the trade mark. There must be genuine use of the trade mark before its function is served and protection by registration is justified. Further, as the register also serves as a notice to rival traders of trade marks that [are] already in use, to allow a mark that is notbona fidein use to remain on the register would be deceptive and could permit the registered proprietor to unfairly hijack or usurp a mark and/or monopolise it to the exclusion of other legitimate users. These considerations underpinning the need for “genuine use” of a registered trade mark must be borne in mind when assessing an application for revocation. 120 It has been suggested that the decision of this court inWing Joo Loong Ginseng Hong (Singapore) Co Pte Ltd v Qinghai Xinyuan Foreign Trade Co Ltd and another and another appeal[2009] 2 SLR(R) 814 (“Wing Joo Loong”) runs to the contrary: seeTan Tee Jimat vol 1, para 9.022.Wing Joo Loonginvolved an application for, among other things, the registration of the defendant’s trade mark to be revoked under s 22(1)(a) and s 22(1)(b) of the TMA for non-use, as well as under s 22(1)(c) on the grounds that the trade mark had become the common name in the trade for cordyceps, the product in respect of which it had been registered. In dismissing the application for revocation for non-use, we held (at [36]): … [W]e agree with the Judge that the Plaintiff’s contention that the Opposed Mark did not actuallyfunctionas a trade mark after being registered should not be considered under these two grounds for revocation as this contention does not relate to the use or non-use of the Opposed Mark, but pertains instead to theeffectof the use of that mark … In our view, the key question in relation to ss 22(1)(a) and 22(1)(b) would be whether there has been use of the Opposed Mark as a trade mark which can be considered to be genuine. … [emphasis in original] 121 While this extract could be taken to suggest that “use … as a trade mark” is distinct from “genuine use” for the purposes of s 22(1)(a) and s 22(1)(b) of the TMA, this should be read in the context of the specific nature of non-use that was alleged against the registered trade mark inWing Joo Loong. The plaintiff’s case there was that there had been no genuine use of the defendant’s trade mark because it had been used in Singapore for decades in relation to cordyceps to denote cordyceps imported from China, rather than as a badge of commercial origin. In our judgment, it is clear fromWing Joo Loongread as a whole (including [37], where reference was made toWeirWarman), as well as from the extract from [36] reproduced at [120] above, that we contemplated “genuine use” to meanbona fideuseas a trademark.",
        "Our analysis": "122 The question of whether there has been genuine use of a registered trade mark entails a factual inquiry. InLa Mer Technology Inc v Office for Harmonisation in the Internal Market[2008] ETMR 9 at [57], which was cited inWing Joo Loongat [41], the CFI elaborated on how an examination of whether a trade mark had been put to genuine use should be carried out: To examine whether … [a] trade mark has been put to genuine use, an overall assessment must be carried out, which takes into account all the relevant factors of the particular case. That assessment entails a degree of interdependence between the factors taken into account. Thus, the fact that [the] commercial volume achieved under the mark was not high may be offset by the fact that use of the mark was extensive or very regular, and vice versa. In addition, the turnover and the volume of sales of the product under the … trade mark cannot be assessed in absolute terms but must be looked at in relation to other relevant factors, such as the volume of business, [the] production or marketing capacity or the degree of diversification of the undertaking using the trade mark and the characteristics of the products or services on the relevant market. 123 To these factors, we would add thenature ofthe use of the trade mark. In this regard, the Judge observed at [222] of the Judgment that at the point of sale of Kit Kat chocolate bars, the Registered Shapes were concealed in opaque packaging, and even when the bars were unwrapped for consumption, the word “Kit Kat” featured prominently. On this basis, the Registered Shapes were never used on their own even in advertising and promotional materials. In addition, the Registered Shapes were portrayed on the product packaging in highly modified form (see [68] above), and such portrayal served merely to illustrate the products that were merchandised and to attract customers. In the circumstances, we see no reason to disturb the Judge’s finding that the Registered Shapes had not been put to genuine use. It is evident that the appellants’ submission that the mere commercial exploitation of a registered trade mark constitutes genuine use not only pays insufficient heed to whether there has been use of that trade markas a badge of origin, but is also at odds with the decision inLove & Co. 124 As to the significance of the Registered Shapes always being used in conjunction with other trade marks, we consider that the Judge was entirely correct to have considered this relevant to, but not determinative of, his assessment. We refer again to the facts inLove & Coat [122], which we find illustrative. There, the court held that customers would likely be led to believe that the decorative LOVE mark engraved on jewellery sold by the trade mark owner was merely a promotional effort to indicate that the jewellery formed part of a collection, given that the trade mark owner’s other trade marks “appear[ed] far more dominant in most, if not all, of the advertisements and promotional materials”. In a similar vein, we find that the manner in which the Registered Shapes were used would have led consumers to believe that these shapes were mere manifestations of Kit Kat chocolate bars rather than indicators of origin. 125 We are therefore satisfied that even if the Registered Shapes could have been validly registered as trade marks, they have not been put to genuine use for the purposes of s 22(1)(a) and s 22(1)(b) of the TMA, and their registration should thus be revoked.",
        "Issue Four: Whether the Registered Shapes should be protected as well-known trade marks": "126 This leaves us with the final issue, Issue Four: whether the absolute grounds for refusal of registration set out in s 7 of the TMA would bar a claim for well-known trade mark protection under s 55 of the TMA, with the result that the Registered Shapes cannot be protected under the well-known trade marks regime. The term “well known trade mark” is defined in s 2(1) of the TMA as follows: 2.—(1)  In this Act, unless the context otherwise requires — … “well known trade mark” means — (a) any registered trade mark that is well known in Singapore; or (b)any unregistered trade markthat is well known in Singapore and that belongs to a person who — (i) is a national of a Convention country; or (ii) is domiciled in, or has a real and effective industrial or commercial establishment in, a Convention country, whether or not that person carries on business, or has any goodwill, in Singapore … … [emphasis added in bold italics] 127 The nub of Issue Four lies in whether an “unregistered trade mark” (as set out in the s 2(1) definition of a “well known trade mark”) includes a mark that is deemedunregistrableunder s 7 of the TMA. If this question is answered in the affirmative, a mark could possibly be protected as a well-known trade mark notwithstanding its unregistrability under s 7. Like the Judge, we do not think this outcome could have been intended by Parliament, and we also consider that this view is consistent with the policy objective underlying the protection of well-known trade marks. 128 Much of the legal landscape on well-known trade marks in Singapore has been fashioned by Singapore’s obligations under various international instruments. We note in particular that the definition of “well known trade mark” was adopted in the TMA for Singapore to comply with its obligations under the Paris Convention for the Protection of Industrial Property of 20 March 1883 (“the Paris Convention”) and the Agreement on Trade-Related Aspects of Intellectual Property Rights (“the TRIPS Agreement”): seeNovelty Pte Ltd v Amanresorts Ltd[2009] 3 SLR(R) 216 at [135]. In the circumstances, a closer examination of the origins of well-known trade mark protection would be relevant to cast light on Issue Four. 129 The idea of protecting well-known trade marks appears to have been first mooted during the Diplomatic Conference on the Revision of the Paris Convention held in The Hague in 1925: seeTan Tee Jimatvol 1,para 2.005. The concern raised then was the possible “abuse” (in the sense of unfair competition) of well-known trade marks belonging to nationals of other countries. The nature of this “abuse” was explained as follows: … [I]t is not rare … to see traders or even other persons register foreign well-known marks in order to secure proprietary rights and prevent the real proprietor of the mark from using it in the country or to make it expensive for him to get the right to use the mark. … The real proprietors bitterly complain about this usurpation of their well-known marks which causes great prejudice to them, in particular if the usurper registers the mark and uses it in a country where registration has a character of conferring proprietary rights. 130 The discussions eventually culminated in Art 6bisof the Paris Convention, which obliges member countries to give greater protection to trade marks that have become well known in their countries by requiring them to refuse or cancel the registration, and to prohibit the use, of a trade mark which constitutes a reproduction, an imitation or a translation, liable to create confusion, of a trade mark that is considered by the competent authority of the country of registration or use to be well known in that country as being: (a) already the mark of a person entitled to the benefits of the Paris Convention; and (b) already used foridentical or similar goods. The scope of protection under Art 6biswas subsequently extended by Art 16(3) of the TRIPS Agreement to include goods and services that are not similar to those in respect of which the well-known trade mark is used. However, the mischief sought to be prevented remains the same. 131 Where a foreign well-known trade mark is deemed unregistrable under s 7 of the TMA, there would clearly be no need for the proprietor of that mark to prevent the registration of the mark in Singapore by an unauthorised third party. It logically follows that there would be no justification for invoking the special protective scheme for well-known trade marks. Our conclusion is fortified by the following passage from Nuno Pires de Carvalho,The TRIPS Regime of Trademarks and Designs(Kluwer Law International, 3rd Ed, 2014) at para 16.42 (which was cited, but not reproduced, in the Judgment at [230]): 16.42. This point is linked to another issue of extreme relevance. WTO Members are required to protect well-known trademarks against confusion, under Article 6bis, even when they are not registered in the country where protection is sought. But does this mean that protection is to be granted even when the trademark is not registrable? In other words, may WTO Members make protection of well-known marks dependent on registrability as defined in Article 15 [of the TRIPS Agreement]? Is a country that does not recognize single colors as marks obliged to protect, as a well-known mark, for example, the orange color for telecommunication services or the purple color for chocolate? It is not questioned whether the trademark is not well known in the country where protection is invoked – this is an objective concept, based on a quantitative criterion. What is questioned is whether it can be protected in that country as a well known trademark. The importance of this question is in the possibility of obtaining protection regardless of evidence of fraud – as is the case under unfair competition law – as well as benefiting from the extended statute of limitation against use in bad faith, under Article 6bisof the Paris Convention. The answer seems to be no, in accordance with the language of Article 16.1 [of the TRIPS Agreement].Minimum protection of trademarks under TRIPS is linked to the existence of a trademark and its registrability. If the sign in question does not constitute a trademark under national law, it does not matter[that] it is well-known – it will not be protected as such.It is true that well-known trademarks must be protected even without registration, but the effect of their protection is not only against use, but also against registration. If they cannot be registered in the first place, because they consist of signs that are not deemed trademarks (hence they are not protectable and registrable as such) how could they be opposed against [the] registration of (likewise non-registrable) signs for identical or similar goods or services? Of course, this is not to say that non-registrable foreign well-known marks are completely divested from legal protection – they can be protected under Article 10bisof the Paris Convention, as a measure of repression of unfair competition. This is, however, a secondary and less effective mechanism of protection of trademarks, as explained above. [emphasis added in bold italics] 132 Prof Ng-Loy has proffered an alternative approach which will lead to the same outcome by a different route. Unlike the Judge’s approach, which centres on the distinction between “unregistered” and “unregistrable” marks, the focal point of her approach is the definition of a “trade mark” in s 2(1) of the TMA. In respect of s 7(3) of the TMA, her view is that marks that are unregistrable by reason of s 7(3) do not fall within the definition of “trade mark[s]” in s 2(1). In respect of s 7(1)(b) of the TMA, Prof Ng-Loy says that a “well known trade mark” must operate as a badge of origin in the jurisdiction where protection is sought. Therefore, the fact that a mark is not sufficiently distinctive for registration purposes would necessarily mean that it would not cross the higher threshold required for it to constitute a “well known trade mark” in that jurisdiction. 133 While it is not necessary for us to arrive at a definite view, we observe provisionally that Prof Ng-Loy’s approach is not free from problems. For one, it would require reading additional qualifications into the definition of a “trade mark” in s 2(1) of the TMA, which defines a “trade mark” as “any sign capable of being represented graphically and which is capable of distinguishing goods or services dealt with or provided in the course of trade by a person from goods or services so dealt with or provided by any other person”. The failure to satisfy this definition of a trade mark is an independent ground of unregistrability under s 7(1)(a) of the TMA, which states: 7.—(1)  The following shall not be registered: (a) signs which do not satisfy the definition of a trade mark in section 2(1); … 134 The phraseology of s 7(3) of the TMA stands in contrast to that of s 7(1)(a). Section 7(3) states that “[a] signshall not be registered as a trade markif it consists exclusively of …” [emphasis added in bold italics]. It does not say that signs which fall within the ambit of any of its sub-limbs “do not satisfy the definition of a trade mark”, but simply that such signs “shall not be registered as a trade mark”. It is at least arguable that s 7(3) is predicated on an implicit recognition that the sign in question may well fulfil the definition and function of a trade mark (and thus constitute a “trade mark” within the meaning of s 2(1)), but nonetheless should not be registered on public policy grounds. If this is indeed the position, s 7(3) cannot and should not be read to mean that signs which fall within ss 7(3)(a)–7(3)(c) do not constitute “trade mark[s]”. 135 Secondly, Prof Ng-Loy accepts that her approach would not accommodate s 7(4) of the TMA, which provides as follows: A trade mark shall not be registered if it is — (a) contrary to public policy or to morality; or (b) of such a nature as to deceive the public (for instance as to the nature, quality or geographical origin of the goods or service). 136 Prof Ng-Loy approaches the issue from the standpoint that a sign which does not constitute a “trade mark” cannot be an “unregisteredtrade mark” [emphasis added] for the purposes of the s 2(1) definition of a “well known trade mark”. Since s 7(4) of the TMA recognises that an immoral or deceptive sign could constitute a “trade mark”, Prof Ng-Loy’s approach could potentially create the implausible (albeit seemingly theoretical) situation in which trade marks that are unregistrable under s 7(4) of the TMA (for being against public policy, immoral or deceptive) may nonetheless be entitled to well-known trade mark protection. 137 In light of the possible difficulties with the alternative approach proffered by Prof Ng-Loy, we prefer to decide Issue Four on the basis that it could not have been Parliament’s intention to confer well-known trade mark protection on signs that are barred from registration by dint of the absolute grounds for refusal of registration set out in s 7 of the TMA. Allowing the protection of such unregistrable marks in no way advances the purpose of the well-known trade marks regime. 138 Therefore, the appellants’ claim for well-known trade mark protection fails since, by virtue of the unregistrability of the Registered Shapes under s 7(1)(b) and s 7(3)(b) of the TMA, these shapes do not constitute “unregistered trade mark[s]” for the purposes of the s 2(1) definition of a “well known trade mark”.",
        "The respondents’ counterclaim for groundless threats of trade mark infringement": "139 The Judge allowed the respondents’ counterclaim for groundless threats of trade mark infringement and granted the following orders: (a) a declaration that the threats made in the letters of 3 November 2010 and 2 December 2011 from the first appellant’s solicitors were unjustifiable; (b) an injunction to restrain the first appellant from making or continuing to make any threat in the same or similar terms as the threats made in those letters; and (c) damages for the respondents, to be assessed by the Registrar. The Judge appeared to treat the respondents’ counterclaim for groundless threats of trade mark infringement as a form of natural consequential relief. Although the appellants indicated their intention to appeal against this part of the Judge’s order, we note that their written case and skeletal submissions are silent on this aspect of their appeal. Therefore, it appears that the appellants (like the Judge) have proceeded on the basis that their appeal against the Judge’s decision on groundless threats of trade mark infringement stands or falls on the merits of the substantive aspects of their appeal. 140 This may not, however, necessarily be the case. The scope of the groundless threats provision, at least in the context of s 200 of the Copyright Act (Cap 63, 2006 Rev Ed) (“the Copyright Act”), was explored by us inSingsung Pte Ltd v LG26 Electronics Pte Ltd (trading as L S Electrical Trading)[2016] 4 SLR 86, a decision which was released after this appeal was last heard. There, we held that the court had the discretion to refuse an inquiry into damages if the damage suffered was likely to be trivial or negligible, or if there was no evidence of loss (at [148]). While it seems to us that the policy imperatives behind that interpretation of s 200 of the Copyright Act may transcend all forms of intellectual property rights, we did not have the opportunity to hear the parties to this appeal on this issue since, as we have noted, no substantive arguments on the respondents’ counterclaim for groundless threats of trade mark infringement were advanced to us. 141 There is also a further point which neither party addressed us on. The relevant provisions on groundless threats of trade mark infringement are set out in s 35 of the TMA as follows: Remedy for groundless threats of infringement proceedings 35.—(1)  Where a person threatens another with proceedings for infringement of a registered trade markother than— (a) the application of the mark to goods or to material used or intended to be used for labelling or packaging goods; (b) the importation of goods to which, or to the packaging of which, the mark has been applied; or (c) the supply of services under the mark, any aggrieved person may bring proceedings for relief under this section. … [emphasis added in bold italics] 142 Without the benefit of full written submissions on this point, it appears to us that no action for groundless threats of trade mark infringement may be brought in respect of threats concerningprimaryinfringement,ie, infringement in the manner set out in ss 35(1)(a)–35(1)(c) of the TMA. The rationale for excluding primary infringers such as manufacturers and importers from seeking relief under s 35 of the TMA is rooted in policy. While there is a need to protect the legitimate interests of a trade mark owner by permitting him, within legal limits, to warn off infringers, this must be balanced against the right of other stakeholders in the market to conduct their commercial activities free from the spectre of litigation: seeKerly’sat para 19-108. It is for this reason that the law frowns on groundless threats of trade mark infringement being made against secondary infringers. While a company that is alleged to have manufactured or imported infringing goods has an interest in defending itself, customers who deal in those goods, such as wholesalers and retailers, may simply decide to stop buying those goods from the alleged primary infringer rather than risk being embroiled in litigation: see Christopher Morcom, Ashley Roughton & Thomas St Quintin,The Modern Law of Trade Marks(LexisNexis, 4th Ed, 2012) at para 13.2. Further, it is the alleged primary infringers who are best-placed to know if infringement has indeed taken place. As noted inTan Tee Jimat vol 1, para 15.021: … This distinction may seem arbitrary, but there is a rationale for it. The primary infringers such as manufacturers and importers are the trade source of the infringement and their actions can do the most harm. They are likely to know whether the goods or services concerned infringe a trade mark, and that is the reason why the section allows the trade mark proprietor to warn them off without incurring liability for making threats. In contrast, secondary infringers such as wholesalers and retailers may be unaware that they are in fact infringing and they may not even be able to find out if the goods or services concerned infringe a proprietor’s trade mark. Since they have little or no investment in the goods concerned, they are vulnerable to the threats, however groundless. 143 In the present case, the letters which form the bases of the respondents’ counterclaim for groundless threats of trade mark infringement appear to have been directed at the second respondent’s purported acts of infringement rather than the first respondent’s. The letter of 3 November 2010 was not addressed to the first respondent; and while the letter of 2 December 2011 was addressed to both respondents, the subject heading reads “TRADE MARK INFRINGEMENT BYDELFI SINGAPORE PTE. LTD.(“DELFI”) TAKE-IT” [emphasis added]. More importantly, the acts of infringement complained of in this letter seem to be of aprimaryrather than a secondary nature, as can be seen from the extract below: 2. … We note that despite written notice from Our Client, you persist in knowingly infringing Our Client’s rights, including its registered trade mark, by the continued sale of the Infringing Product. 3. In view of your deliberate actions to continue this infringement, we have instructions to commence legal proceedings against Delfi [ie, the second respondent] unless: (a) Delfi agrees and undertakes to forthwith cease and desist from importing, selling, distributing or otherwise disposing of the Infringing Product in Singapore; (b) Delfi agrees and undertakes to forthwith withdraw and cause to be withdrawn the Infringing Product in Singapore; and (c) Delfi agrees to compensate [the first appellant] for all loss and damage suffered as well. 144 We note the following. First, no express mention was made of the first respondent at all in the above letter, let alone that it had committed secondary infringement. Second, some ambiguity arises as to whether the acts complained of, which include theimportationandsaleof the purportedly infringing goods, fall within the acts set out in ss 35(1)(a)–35(1)(c) of the TMA, such that they cannot form the basis of a claim for groundless threats of trade mark infringement. In the circumstances, it might be arguable that no liability for groundless threats of trade mark infringement would accrue under s 35(1) of the TMA. 145 Having made these observations, we give the parties leave to furnish written arguments on the points which we have raised at [140]–[144] above, limited to ten pages in length, within two weeks of the date of this judgment should they consider it permissible for us to go into these matters even though they were not raised either in the parties’ written cases and written submissions or at the hearing before us.",
        "Conclusion": "146 To recapitulate, we are of the view that the Judge correctly ordered the invalidation of the registration of the Registered Shapes on the basis that these shapes are devoid of distinctiveness and have not acquired distinctiveness through use. They were thus registered in breach of s 7(1)(b) of the TMA. We also find that the Registered Shapes were registered in breach of the “technical result” prohibition in s 7(3)(b) of the TMA. In any case, we are satisfied that the registration of the Registered Shapes would have been liable to be revoked for non-use as there has been no genuine use of the Registered Shapes as trade marks. Finally, the appellants’ claim for well-known trade mark protection fails at the threshold given our view that marks which are unregistrable under s 7 of the TMA must necessarily be excluded from the special protective regime for well-known trade marks. In the circumstances, save for hearing the parties on the respondents’ counterclaim for groundless threats of trade mark infringement, we dismiss this appeal with costs to the respondents, which are to be taxed, if not agreed. The usual consequential orders are to apply.  147 In closing, we wish to express our deep gratitude to Prof Ng-Loy for her extremely valuable contributions and for having given us the benefit of her insights so generously. Sundaresh Menon         Chao Hick Tin           Andrew Phang Boon LeongChief Justice          Judge of Appeal        Judge of Appeal George WeiJudge of Appeal        Judge Alvin Yeo SC and Chen Xinping (instructed), Sheena Jacob and Wang Zheng Just (Bird & Bird ATMD LLP) for the appellants;Davinder Singh SC, Gill Dedar Singh and Gabriel Ong (Drew & Napier LLC) for the respondents; Prof Ng-Loy Wee Loon SC (Hon Caus) asamica curiae."
    }
}