{
    "case_title": "Grouteam Pte LtdvUES Holdings Pte Ltd",
    "ncitation": "[2016] SGCA 59",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 This is an appeal against the decision of the High Court judge (“the Judge”) in Originating Summons No 649 of 2015 (“OS 649/2015”). The Judge allowed the respondent’s application to set aside an adjudication determination dated 19 June 2015 (“the AD”) made pursuant to the Building and Construction Industry Security of Payment Act (Cap 30B, 2006 Rev Ed) (“the Act”). The Judge’s decision is reported asUES Holdings Pte Ltd vGrouteam Pte Ltd[2016] 1 SLR 312 (“the Judgment”). Before the Judge, the respondent successfully contended that the documents on which the AD was based – namely, the payment claim, the adjudication application and the notice of intention to apply for adjudication – were not served in good time, thus rendering the AD invalid. 2 The present appeal raises some significant questions, including whether service of a payment claim outside the stipulated time for service is a ground on which an adjudication determination is liable to be set aside, and at what stage a party who receives a payment claim which it believes to be out of time should make its objection. We begin with a brief outline of the material facts.",
        "The material facts": "",
        "Background": "3 By a contract dated 12 July 2013 (“the Main Contract”), the respondent was engaged as the main contractor by Changi Airport Group (Singapore) Pte Ltd (“CAG”) for a project titled “Relocation of Pumphouse and Substation at Singapore Changi Airport”. The respondent, in turn, entered into a domestic sub-contract dated 30 August 2013 (“the Sub-Contract”) with the appellant for the latter to carry out certain works, including the civil, structural and architectural works for the new pumphouse and substation. 4 On 20 April 2015, the appellant served Payment Claim No 18 (“the Payment Claim”) on the respondent. Not having received a payment response from the respondent, on 20 May 2015, the appellant proceeded to serve a notice of intention to apply for adjudication (“the Notice of Intention”). In addition, the appellant lodged an adjudication application (“the Adjudication Application”) with the Singapore Mediation Centre (“the SMC”). 5 On the same day that it was served with the Notice of Intention, the respondent issued Payment Response No 18 (“the Payment Response”). On 21 May 2015, the SMC served the Adjudication Application on the respondent. An adjudicator (“the Adjudicator”) was duly appointed, and on 19 June 2015, he issued the AD ordering the respondent to pay $2,905,683.89 to the appellant. Shortly after, the respondent applied to the High Court by way of OS 649/2015 to set aside the AD.",
        "The Sub-Contract": "6 The construction of the Sub-Contract is central to the dispute between the parties. Unfortunately, this contract is a 507-page long document which the Judge described as “cobbled together”, “enigmatic” and “confusing” (at [5] of the Judgment). It is not difficult to see why. The Sub-Contract is a collection of different documents bundled together without much structure, and it seems to us to have been somewhat haphazardly assembled. To make matters worse, there is very little, if any, information in the affidavits filed by the parties as to the negotiations leading to the execution of the Sub-Contract and how the documents came to be assembled as they were. Hence, the court has little, if anything, by way of context to aid in the construction of the Sub-Contract. 7 The Sub-Contract is defined in clause 1.1 of the main body of the agreement (“the Sub-Contract Agreement”) as “this agreement together with such other documents as are specified inSection 6 of the First Schedulehereto” [underlining and emphasis in bold in original]. Turning to the documents that comprise the Sub-Contract, there are four key parts which are relevant for our purposes: (a) The Sub-Contract Agreement: This is the first document in the bundle of contract documents. It is dated 30 August 2013 and spans 31 pages, with 28 clauses and four Schedules. (b) Annex 1, titled “Summary of Contract Negotiations” (“SOCN”): This is the document that immediately follows the Sub-Contract Agreement in the bundle of contract documents. It is not disputed that the parties entered into the SOCN on 28 August 2013, just two daysbeforethe Sub-Contract was executed. (c) General Conditions and Preliminaries (“Preliminaries”): It is not disputed that the 50-odd pages which comprise this part of the Sub-Contract are the same as the Preliminaries (General Conditions and Preliminaries) found in the respondent’s tender documents for the Main Contract. Two slightly different versions of the Preliminaries appear in the bundle of contract documents. In the first version, which is included as part of Annex 1 of the Sub-Contract, each item of the Preliminaries (at times, even parts of an item) is specifically bracketed and annotated with certain handwritten expressions next to it (namely, “Included”, “Not Included”, “NA”, “Noted” or “Under Main Contract”). It is also not disputed that the appellant went through this document and made these handwritten annotations on the right-hand side against each item. In the second version of the Preliminaries, which is included as part of Annex 4 (titled “Price Schedule & Rate Schedule”), the aforesaid handwritten annotations are typed out, with certain words such as “Noted” amended to read “Included”. The appellant’s stamp, along with the initials of its representative, appears at the bottom of each page of both versions of the Preliminaries. (d) A purchase order (“the Purchase Order”): This is a one-page document dated 30 August 2013, the very day on which the Sub-Contract was entered into. The Purchase Order was for work described as the “Relocation of Pumphouse and Substation at Singapore Changi Airport”. 8 Given the voluminous nature of the Sub-Contract documents, the parties presumably envisaged the possibility of a conflict between some of the provisions. Section 6 of the First Schedule to the Sub-Contract (“Section 6”) purports to provide the means of resolving any such conflict. Section 6 starts by listing the various annexes to the Sub-Contract. The only two annexes that are relevant to the present appeal are Annex 1 and Annex 4, which, as mentioned earlier, are titled “Summary of Contract Negotiations” and “Price Schedule & Rate Schedule” respectively. Annex 1 contains both the SOCN and the version of the Preliminaries with the handwritten annotations, while Annex 4 contains the version of the Preliminaries with the typed annotations. After listing the various annexes to the Sub-Contract, Section 6 reads: Notwithstanding anything stated in this Sub-Contract, in the event and to the extent of any inconsistency between two or more attachments which form part of this Sub-Contract, those attachments will be interpreted in the following order of priority: (a) clauses 1 to 28 of this Sub-Contract; (b) the Schedules (c) the documents set out in [this section] (of which references to the Main Contract shall prevail in the event of inconsistency between the said documents[)] [underlining and emphasis in original omitted] 9 With this background in mind, we briefly discuss the relevant grounds on which the respondent challenged the validity of the AD before the Judge.",
        "The respondent’s grounds for challenging the validity of the AD": "",
        "The Payment Claim was not served in good time": "10 The respondent’s first ground for seeking to set aside the AD was that the Payment Claim was not served in good time. It argued that Item E of the page numbered “Sect 1.1/16” in the Preliminaries (“Preliminaries E”) was the applicable provision governing the service of payment claims, and in accordance with that provision, the appellant had to serve its payment claims within seven days from the end of each calendar month. As the Payment Claim was served on 20 April 2015, it was out of time. 11 The appellant, on the other hand, took the position that clause E of the SOCN (“SOCN-E”) was the applicable provision governing the service of payment claims. That was also the position taken by the Adjudicator in making the AD. SOCN-E provides that payment claims are to be served no later than the 20th day of each month. The text of these two provisions, Preliminaries E and SOCN-E, is reproduced at [29] below. 12 Various reasons were advanced by the parties in support of their respective cases. Notably, the respondent argued that SOCN-E was completely inapplicable as it was meant to be transitory in nature. It also said that SOCN-E dealt only with the submission of “invoices” and was not concerned at all with payment claims. 13 The appellant, on the other hand, contended that Preliminaries E was inapplicable on the basis that it could not be taken to govern the service of payment claims since it made reference to “the Contractor” and “the Superintending Officer”, both of which were undefined in the Sub-Contract. Further, it made reference to “the Employer”, which was defined in the First Schedule of the Sub-Contract as CAG (and not the respondent). 14 The appellant also argued that the respondent was estopped from challenging the timeline for submitting payment claims because the respondent had itself previously regarded SOCN-E as the applicable clause. In this regard, the appellant pointed to a previous occasion when it had served a payment claim on the respondent and the latter had replied by way of an email on 29 December 2014 (“the 29 December Email”) stating that “as per contract”, it had 21 days to issue its payment response. Such a position, the appellant argued, was only explicable on the basis that SOCN-E, which set out a 21-day period for the respondent to submit its payment response, was the applicable provision.",
        "The Notice of Intention and the Adjudication Application were served out of time": "15 The respondent’s second ground for seeking to set aside the AD was that the Notice of Intention and the Adjudication Application were served out of time. The respondent submitted that Item A of the page numbered “Sect 1.1/10” in the Preliminaries (“Preliminaries A”) incorporated the Public Sector Standard Conditions of Contract for Construction Works 2008 (6th Ed, December 2008) (“the PSSCOC”). Preliminaries A reads: The Conditions of Contract comprise: (1) The [PSSCOC] and any subsequent amendments thereto published by the Building and Construction Authority at the time of tender submission … … 16 Pursuant to clause 32 of the PSSCOC, the respondent had 14 days from its receipt of a payment claim to issue its payment response, following which, in the event that the appellant disputed the respondent’s payment response or (as was the position in this case) the respondent failed to provide its payment response within the stipulated timeframe, there was a further 7-day dispute settlement period (see s 12(5) of the Act). It was only after the expiry of this 7-day dispute settlement period without any resolution of the payment dispute or (as the case might be) without any payment response from the respondent that the appellant would be entitled to lodge an adjudication application, and such application had to be made “within 7 days after the entitlement of the claimant to make an adjudication application first arises under section 12” (see s 13(3)(a) of the Act). Therefore, on the assumption that the Payment Claim was validly served on 20 April 2015, the time period for lodging an adjudication application, if governed by the Preliminaries, would have run from 12 to 18 May 2015. The respondent contended, on this basis, that the Adjudication Application and the Notice of Intention, both of which were served on 20 May 2015, were thus served out of time. 17 The appellant, on the other hand, argued, for the same reasons that it advanced in relation to the respondent’s first ground for challenging the validity of the AD, that SOCN-E was applicable to the service of payment responses as well. Under SOCN-E, the respondent had 21 days upon its receipt of a payment claim to submit a payment response. Taking into account the 7-day dispute settlement period provided for in s 12(5) of the Act, the period for lodging an adjudication application, based on the appellant’s reckoning, ran from 19 to 25 May 2015. The appellant therefore contended that the Notice of Intention and the Adjudication Application were both lodged in good time.",
        "The Judge’s decision": "18 With regard to the respondent’s first ground for challenging the validity of the AD, the Judge disagreed with the appellant that Preliminaries E should be disregarded simply because the term “Employer” was defined in the First Schedule of the Sub-Contract as CAG and not the respondent (see [19] of the Judgment). In his view, the Preliminaries had clearly been incorporated into the Sub-Contract and should therefore apply between the parties, albeit readmutatis mutandiswhere references were made to entities who were not parties to the Sub-Contract, such as “the Contractor” and “the Employer”. The Judge was satisfied that both the respondent and the appellant clearly intended Preliminaries E to be included as part of the Sub-Contract, given that at the time the appellant prepared its tender for the Sub-Contract, its representative had specifically annotated against each item (or part thereof) of the Preliminaries to indicate whether that item was to be included or noted in the Sub-Contract, and given that the marked-up document had then been included as part of the Sub-Contract. 19 As to whether SOCN-E or Preliminaries E applied to govern the service of payment claims, the Judge referred to clause K of the SOCN (“SOCN-K”), which provided that “[a]ll stipulations agreed upon in this Summary of Contract Negotiations shall remain valid until the actual placement of a Purchase Order”, and concluded (at [21] of the Judgment) that the SOCN was in essence an attempt to tie down the appellant’s quote and its terms were to remain firm, but they would be valid only until the actual placement of a purchase order. Noting that the Purchase Order expressly referred only to select clauses of the SOCN, the Judge held, on this basis, that only those provisions of the SOCN which were expressly referred to in the Purchase Order survived after the Purchase Order was placed. Accordingly, while the Judge rejected the respondent’s submission that theentireSOCN was inapplicable, he accepted that SOCN-E had been superseded and replaced by Preliminaries E. The Judge disagreed with the respondent’s alternative submission that SOCN-E could not be the applicable provision as it governed the service of invoices only and not payment claims. The Judge held that SOCN-E did indeed deal with payment claims, and that the reference therein to “invoices” was a separate administrative matter concerned with the payment and recovery or off-setting of Goods and Services Tax (at [26] of the Judgment). 20 In the alternative, the Judge held that Preliminaries E prevailed and took precedence over SOCN-E by virtue of Section 6, which we set out earlier at [8] above. The Judge noted that Preliminaries E was “not only a ‘reference’ to the Main Contract”, but also “came from and [was] part of the Main Contract” (at [31] of the Judgment). For these reasons, the Judge held that the Payment Claim was not served in good time. 21 As to the 29 December Email, the Judge held that no estoppel arose from that email because nothing in it amounted to an unequivocal representation by the respondent that it would not rely on its legal rights against the appellant (at [37] of the Judgment). 22 The Judge then considered whether service of the Payment Claim out of time, in breach of s 10(2)(a) of the Act, was a ground on which the AD was liable to be set aside. The Judge held that it was because s 10(2)(a) was a mandatory condition and the timelines in the Act were to be strictly complied with (at [47] of the Judgment). 23 In relation to the respondent’s second ground for challenging the validity of the AD, given the Judge’s finding that SOCN-E had been superseded, it followed that clause 32 of the PSSCOC applied to govern the timeline for issuing payment responses. This in turn meant that, assuming the Payment Claim had been validly served on 20 April 2015, the appellant should have lodged the Adjudication Application between 12 and 18 May 2015. Accordingly, the Notice of Intention and the Adjudication Application were also served out of time. The AD was therefore also liable to be set aside on this alternative ground (at [50]–[51] of the Judgment).",
        "Our decision": "24 As many of the parties’ arguments on appeal mirror those which they canvassed before the Judge, we shall not repeat these arguments in full in this judgment. Instead, we shall refer to them only where necessary in the course of explaining our decision.",
        "Whether Preliminaries E or SOCN-E governs the service of payment claims": "25 We begin by considering whether it is Preliminaries E or SOCN-E that applies to govern the service of payment claims. This issue is pivotal to the present appeal because the respondent’s setting-aside application in OS 649/2015 is predicated on its contention that the Payment Claim, the Notice of Intention and the Adjudication Application were not served in good time by reason of the timelines stipulated in Preliminaries E and clause 32 of the PSSCOC read with Preliminaries A. A finding that it is SOCN-E, rather than Preliminaries E, that governs this question would be fatal to the respondent’s case. 26 The appellant’s position, as argued by its counsel, Ms Radika Mariapan (“Ms Mariapan”), is that the Preliminaries were not incorporated into the Sub-Contract because although they were physically annexed or attached to the Sub-Contract as part of Annex 1 and Annex 4, they were not expressly referred to in Section 6, which lists the various annexes to the Sub-Contract. Ms Mariapan further submits that because there is no incorporation clause in the Sub-Contract, the Judge had no basis to hold that the Preliminaries formed part of the agreement and would applymutatis mutandis. She argues that the Judge was wrong to rely on our decision inJurongEngineering Ltd v Paccan Building Technology Pte Ltd[1999] 2 SLR(R) 918 (“JurongEngineering”) in this regard because there was an incorporation clause in the contract concerned in that case. 27 We reject Ms Mariapan’s submissions and agree with the Judge that it is significant that the parties, at some point before executing the Sub-Contract, reviewed the Preliminaries and applied their mind to whether each provision (or sub-provision) thereof would be included as part of the Sub-Contract. Taken together with the fact that the Preliminaries were physically annexed to the Sub-Contract, this is sufficient, in our judgment, to evince an intention for the Preliminaries to be incorporated as part of the Sub-Contract. This is not dependent on whether there is an incorporation clause in the Sub-Contract, but follows from our view as to the objective intention of the parties. Furthermore, contrary to Ms Mariapan’s submissions, the Preliminaries are relevant to Annex 4. The first page of Annex 4 provides that the Sub-Contract price is a lump sum price of $8.3m and that the breakdown for the price is to be found in the “attached Bill of Quantities”. A detailed breakdown of the lump sum contract price is set out on the very next page, and as part of that breakdown, a sum of $830,000 is provided for “General Conditions and Preliminaries”. This explains the inclusion of the Preliminaries in Annex 4. 28 For the same reason, Ms Mariapan’s submission that the Judge wrongly appliedJurongEngineeringis mistaken. As we have explained, the Preliminaries were incorporated into the Sub-Contract as a matter of the objective intention of the parties, and not on the basis of an incorporation clause. The Judge referred toJurongEngineering(at [36]–[37]) only for the proposition that a clause may be readmutatis mutandisto apply to the parties to a contract, and we see nothing objectionable in this. 29 There are thus two possible clauses in the Sub-Contract – Preliminaries E and SOCN-E – that are applicable to govern the service of payment claims. For ease of reference, we set out both provisions below. Preliminaries E reads: Within 7 days from the end of each calendar month (hereinafter “the reference month”), the Contractor shall deliver to the Employer (with copies to the Superintending Officer) a payment claim in a form which shows a breakdown of the amount claimed … SOCN-E, which is preceded by the clause in the SOCN that sets out the schedule of payments to be made under the Sub-Contract (namely, clause D (“SOCN-D”)), provides as follows: E.TERMS OF PAYMENT: All above payments shall be effected within30daysafter receipt of required progress claim documentation for [the respondent’s] approval and issuance of payment certificate. The method of payment is by monthly application and submission of invoices reflecting the value of the work carried out or of the goods/works provided, submitted not later than the 20th of each month to a program agreed with [the respondent]. Any discrepancies noted in the Sub Contractor’s application may be adjusted by [the respondent] to agree to the value of the work carried out or goods delivered and a certificate shall be issued accordingly. Withinseven (7) daysafter receipt of the interim payment claim, [the respondent’s] Project Manager shall issue an interim certificate to the Sub Contractor. Within a furtherseven (7) daysfrom the issue of the invoice from the [Sub Contractor] but subject to a maximum oftwenty-one (21) daysfrom the receipt of the invoice, [the respondent] shall be entitled to issue a payment response. [emphasis in bold in original] 30 The Judge held that Preliminaries E prevailed over SOCN-E for two principal reasons. First, he found that SOCN-E was superseded once the Purchase Order was issued. Secondly, he held that Preliminaries E was “a ‘reference’ to the Main Contract” and was therefore accorded priority pursuant to Section 6. We consider each of these reasons in turn. 31 The Judge was of the view that SOCN-K indicated that the SOCN was only to have contractual force until the Purchase Order was placed (see [19] above). However, he disagreed with the respondent that theentireSOCN would thereafter be superseded. The Purchase Order made express references to certain clauses of the SOCN, and the Judge held that those clauses which had been expressly referred to remained valid even after the Purchase Order was placed. 32 We accept, in principle, that SOCN-K suggests that the SOCN would remain valid at least until the Purchase Order was placed. But, this does not determine whether the SOCN would cease to have any effect thereafter. It is significant in this regard to examine what the Purchase Order itself indicates as to whether the SOCN should retain contractual force after the placement of the Purchase Order. It is here that we depart from the Judge because, in our judgment, the Purchase Order points to the conclusion that theentireSOCN would continue to have contractual force and effect, and not just some specific clauses, as the Judge found. We reproduce the salient part of the Purchase Order below: … Detailed Scope of Supply/Work and Other Terms & Conditions refer to the following documents: [The respondent’s] Summary of Contract Negotiations, Sub-Contract Agreement, All documents and drawings as mentioned in Clause A – “Scope of Technical Documentation”, [The appellant’s] quotation ref: GTPL/UESH/Q348C/13 dated 28/08/2013. … 33 It is evident that the Purchase Order described the detailed scope of the work to be done/the goods to be supplied by reference to: (a) the SOCN; (b) the Sub-Contract Agreement; (c) the documents and drawings mentioned in “Clause A”; and (d) the appellant’s quotation. The Judge appeared to regard this part of the Purchase Order as referring only to clause A of the SOCN (“SOCN-A”). Counsel for the respondent, Mr Ian de Vaz (“Mr de Vaz”), similarly took this position. We disagree. The heading in the above extract from the Purchase Order reveals that the documents set out thereunder would specify the detailed scope of the work to be done and the goods to be supplied, as well as the terms and conditions on which that was to be effected. Significantly, the above extract from the Purchase Order referred to particulardocuments, and not to particular clauses. In our judgment, the Purchase Orderfirstrefers to the entire SOCN, as can be seen from the explicit mention of the “Summary of Contract Negotiations”. It is true that SOCN-A is then separately referred to, but, in our judgment, that is because it lists 20 other documents which are also to form part of the Sub-Contract documents. For this reason, we differ from the Judge’s view that the SOCN was effectively superseded once the Purchase Order was placed. 34 We are strengthened in our conclusion by the fact that the Purchase Order was placed just two days after the parties entered into the SOCN. It seems implausible to us that the parties would conclude the SOCN, which, as stated in SOCN-K, encapsulated the principal binding terms that they had specifically agreed on in the course of their negotiations, only to supersede and denude most of it of any contractual force barely two days later. In the absence of any other evidence, we find it hard to accept that this was indeed the case. 35 We turn to the second reason underlying the Judge’s conclusion for finding that Preliminaries E prevailed over SOCN-E, namely, that Preliminaries E was “a ‘reference’ to the Main Contract” and therefore had priority pursuant to Section 6 (see [30] above). We again respectfully disagree. As observed by the Judge and accepted by the parties, the Preliminaries were taken directly from the respondent’s tender documents for the Main Contract. However, it does not necessarily follow from this that all the clauses of the Preliminaries were therefore “references to the Main Contract” for the purposes of Section 6. If that were indeed the case, then the entire Preliminaries would be accorded priority pursuant to Section 6. In our judgment, the phrase “references to the Main Contract” in Section 6 is limited toexpressreferences to the Main Contract. In other words, only clauses which makeexpressreference to the Main Contract would be accorded priority. Purely by way of example, clause 13.1 of Annex 2 to the Sub-Contract provides: The Sub-Contractor shall be responsible for the provision of all insurance cover on construction plant, equipment and vehicles owned by or on hire to him.Such cover shall be in accordance with the requirements of the Main Contractand shall be in the joint names of the Employer; Main Contractor and Sub-Contractor. [emphasis added] Clause 13.1 is an example of a clause that would be accorded priority pursuant to Section 6 because it makes express reference to the Main Contract. As Preliminaries E is not such a clause, we find that it does not have priority over SOCN-E by virtue of Section 6. 36 We turn to Mr de Vaz’s additional arguments in support of the Judge’s finding that Preliminaries E is the applicable provision governing the service of payment claims. First, he says that SOCN-E is concerned with invoices only and not payment claims. The Judge considered this submission and rejected it (see [26] of the Judgment, as well as [19] above). We agree that this submission has no merit because, in our judgment, the phrase “[t]he method of payment is bymonthly applicationand submission of invoices” [emphasis added] in SOCN-E covers both payment claims and invoices. 37 Mr de Vaz seeks to overcome this by arguing that SOCN-E is relevant only to thecontractualpayment mechanism, while Preliminaries E concerns thestatutorypayment mechanism. He contends that there is in the Sub-Contract separate frameworks that stipulate, respectively, a statutory payment mechanism as well as a contractual payment mechanism. According to Mr de Vaz, SOCN-E is only concerned with the contractual mechanism for progress payments and not the statutory mechanism, and is therefore irrelevant when computing timelines for the submission of payment claims under the Act. We reject this argument because it seems implausible to us that the parties would have contemplated having two separate payment frameworks operating in tandem under the Sub-Contract. There is nothing in the affidavits to suggest that they envisaged this, or to even suggest that they contemplated having separate payment frameworks to govern the finely-distinguished issues of progress payments under the Sub-Contract and payment claims under the Act. The parties also did not appear to have had the benefit of legal advice when they drafted the Sub-Contract, as is evident from the manner in which they assembled the documents constituting the agreement, and it is simply improbable that they would have intentionally devised such nuanced distinctions. In these circumstances, we do not accept Mr de Vaz’s submission. 38 Mr de Vaz’s last additional argument in support of the Judge’s finding that Preliminaries E is the applicable provision is that SOCN-E cannot possibly have contractual force in relation to payment matters because it would be unworkable in this regard. He points to the fact that under the third paragraph of SOCN-E, the respondent has seven days from the receipt of a payment claim to issue an interim certificate. Under the fourth paragraph, the respondent has afurther21 days to submit its payment response. Mr de Vaz argues on this basis that the time period for submitting a payment claim is not fixed and may extend beyond the statutorily-prescribed maximum period of “21 days after the payment claim is served under section 10” (see s 11(1)(a) of the Act). By way of illustration, Mr de Vaz submits that if, pursuant to the third paragraph of SOCN-E, the respondent issues an interim certificate six days after receiving an interim payment claim, it would then have 27 days in total to issue a payment response. 39 We do not agree. Mr de Vaz’s submission proceeds erroneously on the premise that the third and fourth paragraphs of SOCN-E should be read conjunctively. He submits that this is the natural reading given the word “further” in the fourth paragraph. In our judgment, the third paragraph of SOCN-E should be read independently and disjunctively from the fourth paragraph. The third paragraph provides the timeline for issuing an “interim certificate” [emphasis added]. The fourth paragraph governs the separate matter of the timeline for issuing a “payment response” [emphasis added], and provides that the respondent has 21 days from the receipt of “the invoice” submitted by the appellant (under the first paragraph of SOCN-E) to do so. The fourth paragraph of SOCN-E is thus independent of the third paragraph. We recognise that the word “further” in the fourth paragraph appears to be superfluous, but we cannot see how its inclusion makes SOCN-E unworkable. As mentioned earlier, the parties did not appear to have had the benefit of legal advice when drafting the SOCN or any other part of the Sub-Contract, and this must be borne in mind as part of the relevant background when interpreting the Sub-Contract. 40 None of the foregoing in fact brings us any closer to determining whether Preliminaries E or SOCN-E is the governing clause where service of payment claims is concerned. The difficulty in construction is compounded by the lack of any evidence as to the context surrounding the preparation and execution of the Preliminaries, the SOCN and the Sub-Contract as a whole, to which we have already alluded. Further, the Sub-Contract itself is voluminous and certain parts are inconsistent with others. Unfortunately, such contracts are not uncommon in the building and construction industry. Nonetheless, it remains our task to divine the objective intention of the parties based on the material that is before us. Before we proceed, we should make it clear that our findings in this regard are made in the context of an adjudication determination under the Act. Such a determination is accorded temporary finality until and unless it is set aside. In considering whether the AD in this case should be set aside for non-compliance with the applicable contractual provisions, we must take a view on what those provisions are on the basis of the material that is available to us. However, we do not think this would necessarily bind the arbitral tribunal or court which ultimately determines the dispute between the parties with the benefit of a fuller picture. 41 With that, we turn to the substantive issue. In our judgment, it is SOCN-E, and not Preliminaries E, which governs the submission of payment claims (as well as payment responses). As stated in SOCN-K, the SOCN “sets out the principal terms with respect to a proposed Sub-Contract between the parties”. As we indicated earlier (at [34] above), it seems to us implausible, in the absence of any other evidence, that the parties would have intended to supersede the SOCN, which was signed barely two days before the Sub-Contract was executed. Further, it is significant that SOCN-E made express reference to the payment schedule set out in SOCN-D, the clause immediately preceding it in the SOCN (see [29] above). This payment schedule was then specifically reproduced in the Purchase Order. It would be incongruous for the parties to intend the payment schedule in SOCN-D to apply without also intending that SOCN-E, which deals with the process for claiming such payments, should similarly apply. Moreover, the SOCN was drafted specifically to govern the relationship between the appellant and the respondent. This is to be contrasted with the Preliminaries, which were taken from the respondent’s tender documents for the Main Contract, to which the appellant was not a party. In the light of all this, including the fact that theentireSOCN continued to have contractual force through the Purchase Order, we find that the parties could not have intended Preliminaries E to take precedence over SOCN-E. 42 The Judge placed emphasis on the fact that the parties had gone through each item of the Preliminaries and made annotations next to each provision (or part thereof) to indicate whether that provision would be included in the Sub-Contract (see [18] above). In our judgment, this overlooks an important fact, which is that the marking of the Preliminaries took place in the course of the appellant’s tender for the Sub-Contractbeforethe signing of the SOCN. Mr de Vaz submits that there is no evidence in the parties’ affidavits for such a conclusion to be drawn, but, in our judgment, this can be discerned from the terms of the SOCN itself. Clause B of the SOCN, which is titled “Integral Parts of Contract Precedence”, lists certain documents, including all the documents and drawings referred to in SOCN-A. SOCN-A lists the “Tender Documentation”, which includes “General Conditions and Preliminaries” (which include the Preliminaries). We therefore consider that there is sufficient basis to conclude that the Preliminaries were part of the tender documents and were, in all likelihood, marked up before the signing of the SOCN. In any case, this would not be inconsistent with the practice in the building and construction industry. 43 Mr de Vaz also placed emphasis on the appellant having typed out the handwritten annotations in the version of the Preliminaries in Annex 1 of the Sub-Contract and having included the typed-out version of those annotations as part of the Sub-Contract in Annex 4. He submits, on this basis, that the parties must have intended the Preliminaries to supersede the SOCN when they executed the Sub-Contract on 30 August 2013. In our judgment, this argument goes too far because there is nothing to suggest that the typing out of the aforesaid handwritten annotations was anything more than a clerical act, and this alone cannot go towards showing that the parties intended that Preliminaries E would override SOCN-E, which, as we have already noted, had been entered into (along with the rest of the SOCN) just two days before the execution of the Sub-Contract. 44 Our finding that SOCN-E governs the service of payment claims (as well as payment responses) is sufficient reason, in itself, for the present appeal to be allowed. The respondent’s case turns on whether the Payment Claim, the Notice of Intention and the Adjudication Application were served out of time. Our finding that SOCN-E is the applicable provision in this regard leads to a finding that these three documents were all served in good time. There is thus no possible ground on which the AD is liable to be set aside. 45 Notwithstanding this, we turn to consider the other arguments raised by the parties as detailed submissions were canvassed before us and important points were raised concerning setting-aside applications under the Act. We begin with the appellant’s argument that the Judge erred in reviewing the determination of the Adjudicator on whether SOCN-E or Preliminaries E was the applicable provision in the present case.",
        "Whether the Judge erred in reviewing the Adjudicator’s determination on the applicable provision": "46 The appellant argues that the Judge should not have substituted his own view for that of the Adjudicator as to which provision governed the timeline for submitting payment claims as this would amount to an impermissible review of the Adjudicator’s determination on the merits. Ms Mariapan submits that the appointment of an adjudicator by the SMC is valid where a documentpurportingto be a payment claim has been served on the respondent. The fact that the payment claim might turn out to be defective by reason of non-compliance with the statutory requirements will not impair the jurisdiction of the adjudicator. Relying onChipHup Hup Kee Construction Pte Ltd v Ssangyong Engineering & Construction Co Ltd[2010] 1 SLR 658 (“ChipHup Hup Kee”) andAMAssociates (Singapore) Pte Ltd v Laguna National Golf and Country Club Ltd[2009] SGHC 260 (“AMAssociates”) at [20], Ms Mariapan submits, on this basis, that since the Adjudicator in the present case, who was validly appointed, had directed his mind to the question of which was the applicable provision and had found that it was SOCN-E, the Judge ought not to have interfered with his decision. 47Chip Hup Hup Kee,AMAssociatesandSEFConstruction Pte Ltd v Skoy Connected Pte Ltd[2010] 1 SLR 733 (“SEFConstruction”) are a line of cases in which Judith Prakash J (as she then was) was faced with the question of whether a document thatpurportedto be payment claim was in fact such and, if so, whether it was valid. An anterior question was whether this was an issue that an adjudicator could even deal with, or whether the existence of a dispute over the validity and/or service of the payment claim concerned deprived the adjudicator of jurisdiction altogether. Prakash J reasoned that the jurisdiction of an adjudicator stemmed from his appointment by an “authorised nominating body” under the Act (namely, the SMC), and that the substantive validity and service of a payment claim did not affect that issue (seeChipHup Hup Keeat [54]). A seemingly different approach, however, was taken by Lee Seiu Kin J inSungdoEngineering & Construction (S) Pte Ltd v Italcor Pte Ltd[2010] 3 SLR 459 (“Sungdo”), where he held that if the payment claim in question was found to be invalid and this went to jurisdiction, the court would be in a position to review the validity of the adjudicator’s appointment (at [34]) and, on this basis, set aside his adjudication determination. 48 InLee Wee Lick Terence (alias LiWeili Terence) v Chua Say Eng (formerly trading as Weng Fatt Construction Engineering) and another appeal[2013] 1 SLR 401 (“Chua SayEng”), we reviewed the above decisions and held that the SMC had no power to nominate an adjudicator where there was no payment claim or where no payment claim had been served on the respondent (at [30]). We agreed with Lee J’s observations inSungdothat the power of the SMC to appoint an adjudicator arose from the receipt of an adjudication application, which was itself predicated on a chain of events initiated by the service of a payment claim pursuant to s 10 of the Act (at [29]). Nonetheless, we said that the two judicial approaches were not inconsistent, and explained the seeming inconsistency as follows: 30 … The power of nomination under s 14(1) of the Act is predicated on the existence of a payment claim and the service thereof on the respondent. An acceptance of an invalid nomination would not clothe the acceptor with the office of adjudicator. It is in this sense that an adjudicator appointed in such circumstances is said to have no jurisdiction in the matter because he has not been validly appointed under the Act. Any issue arising in relation to the validity of the appointment of the adjudicator is a jurisdictional issue which must be reviewable by the court. This was the kind of issue that Lee J was concerned with inSungdo. 31 However, we do not think that this was the same kind of jurisdictional issue that Prakash J had in mind when she held inChipHup Hup Kee… that whether the payment claim was in proper order or not would not have an impact on the adjudicator’s jurisdiction, as she also held that the court’s power of review should be restricted to supervising the appointment of adjudicators,ie, the validity or otherwise of an appointment was subject to review by the court. What she had in mind was the case of a payment claim that was intended as a payment claim but which did not comply with all the requirements of the Act: it would still be a payment claim, but the adjudicator could “throw [it] out” for non-compliance (see [20] above). The distinction between Lee J’s proposition inSungdoand that of Prakash J inChipHup Hup Keeis that the former proposition was made in relation to a payment claim which was in form a payment claim but not intended to be such, and therefore did not have the effect of a payment claim, and the latter proposition was made in relation to a payment claim which was in form a payment claim and was intended to be such, but which did not satisfy all the requirements of the Act. In the first situation, a payment claim has not come into operation as a payment claim. In the second situation, a payment claim operates as a payment claim but it is defective for non-compliance with the requirements of the Act. The first situation goes to the validity of the appointment of the adjudicator. The second situation goes to the validity of the adjudication determination. 49 Mr de Vaz submits that considerable confusion has arisen from the foregoing passage, in particular, from the final two sentences. In our judgment, the position is clear because we are concerned with two slightly different situations. InSungdo, Lee J held that an adjudicator would not have been validly appointed if there was in fact no payment claim or no service of a payment claim. In such a case, there would be no basis at all to appoint an adjudicator, and any such appointment would be void and without effect in law. This is a consideration of the adjudicator’s jurisdiction at thethresholdbecause without a payment claim or service of such a claim, there is no basis at all for an adjudicator to be appointed in the first place. InChipHup Hup Kee,AMAssociatesandSEFConstruction, Prakash J was faced with a situation where there was what appeared on its face to be a payment claim, but that payment claim was said to be defective by reason of some non-compliance with the Act. In such a case, the appointment of the adjudicator would nonetheless be valid because the SMC plays only an administrative role in appointing an adjudicator once it receives what appears to be and is intended to be a payment claim. It isnotfor the SMC to assess or adjudicate on the validity of a payment claim, nor whether it has been properly served on the respondent (seeChua SayEngat [35]). Having said that, the fact that an adjudicator is validly appointed does not foreclose the possibility that his adjudication determination may subsequently be set aside by reason of the payment claim being found to be defective for non-compliance with the requirements of the Act. If that were indeed the case, it would go to the adjudicator’ssubstantivejurisdiction, in the sense that even though his appointment by the SMC was valid, there was in fact no basis for him to act once the payment claim was found to be invalid as a substantive matter, and he could not then come to any determination binding on the parties concerned. Although these two situations are different, as we made clear inChua SayEng(at [37]), both may lead to the setting aside of an adjudication determination, albeit for different reasons. 50 To summarise, where there is no purported payment claim or no service of a purported payment claim, any appointment of an adjudicator by the SMC would be invalid, and any adjudication determination made pursuant to such an appointment would be null and void. If, however, a purportedpayment claim has been served (regardless of whether or not that payment claim complies with the provisions of the Act), then the appointment of an adjudicator would be valid. However, the adjudicator’s determination may nonetheless be liable to be set aside if, in the process of making the payment claim or at any stage of the adjudication proceedings, there has been such a breach of a provision of the Act as would warrant the invalidation of the entire proceedings. 51 Applying this to the facts of the present case, the appellant correctly submits that the Adjudicator was validly appointed since there is no dispute that a purported payment claim (viz, the Payment Claim) was served. However, this misses the thrust of the respondent’s case. The respondent contends that the appellant’s failure to serve the Payment Claim in good time was a breach of s 10(2) of the Act, and that such a breach rendered the AD invalid because s 10(2) is so important that it is in keeping with the legislative purpose of the Act to hold that anything done in breach of that provision should be invalid. Thus, the critical question is whether s 10(2) is indeed such a provision. The appellant is mistaken in its primary contention that it was not open to the Judge to even look into this. This is because if non-compliance with s 10(2) is of such a character that it would invalidate an adjudication, then it goes to what we have described at [49] above as the adjudicator’s substantive jurisdiction to make a determination which is binding on the parties concerned. Against that backdrop, we turn to consider the parties’ submissions on whether breach of s 10(2) would render an adjudication determination invalid.",
        "Whether breach of s 10(2) of the Act renders an adjudication determination invalid": "52 Section 10 of the Act provides as follows: Payment claims 10.—(1)  A claimant may serve one payment claim in respect of a progress payment on — (a) one or more other persons who, under the contract concerned, is or may be liable to make the payment; or (b) such other person as specified in or identified in accordance with the terms of the contract for this purpose. (2)  A payment claim shall be served — (a) at such time as specified in or determined in accordance with the terms of the contract; or (b) where the contract does not contain such provision, at such time as may be prescribed. (3)  A payment claim — (a) shall state the claimed amount, calculated by reference to the period to which the payment claim relates; and (b) shall be made in such form and manner, and contain such other information or be accompanied by such documents, as may be prescribed. (4)  Nothing in subsection (1) shall prevent the claimant from including, in a payment claim in which a respondent is named, an amount that was the subject of a previous payment claim served in relation to the same contract which has not been paid by the respondent if, and only if, the first-mentioned payment claim is served within 6 years after the construction work to which the amount in the second-mentioned payment claim relates was last carried out, or the goods or services to which the amount in the second-mentioned payment claim relates were last supplied, as the case may be. 53 In our judgment, s 10(2) of the Actisa mandatory provision, breach of which would render an adjudication determination invalid. We reach this conclusion in the light of the importance of the payment claim in the adjudication process and the need for certainty in the dispute resolution framework set out under the Act. InSungdo(at [32]), Lee J explained that an adjudication application was “predicated by a whole chain of eventsinitiatedby the service of a [p]ayment [c]laim by the claimant on the respondent under s 10 of the Act” [emphasis added] (see alsoChua SayEngat [29], as well as [48] above). That the payment claim is the bedrock of the adjudication process is evident from s 13(1) of the Act, which speaks of a claimant applying for “the adjudication of apayment claimdispute” [emphasis added] (see alsoLibra Building Construction Pte Ltd v Emergent Engineering Pte Ltd[2016] 1 SLR 481 at [32]). 54 Apart from the importance of the payment claim to the adjudication process, certainty is vital in the context of an abbreviated process of dispute resolution such as that set out in the Act. InChase Oyster Bar vHamo Industries[2010] NSWCA 190 at [47], the New South Wales Court of Appeal explained with reference to the New South Wales equivalent of the Act (viz, the Building and Construction Industry Security of Payment Act 1999 (Act 46 of 1999) (NSW)): This detailed series of time provisions is carefully calibrated to ensure expeditious resolution of any dispute with respect to payments in the building industry. The time limits are a critical aspect of the scheme’s purpose to ensure prompt resolution of disputes about payment.It is commercially important that each party knows precisely where they stand at any point of time. Such certainty is of considerable commercial value.[emphasis added] In our judgment, these observations apply to the Act with equal force, and this would be achieved by treating s 10(2) as a mandatory provision. 55 We note that the Judge relied on our decision inWY Steel Construction Pte Ltd v Osko Pte Ltd[2013] 3 SLR 380 (“WY Steel”) as support for the position that s 10(2) was a mandatory provision. InW Y Steel, we observed (at [22]) that under the Act, “the parties enter into an expedited and, indeed, an abbreviated process of dispute resolution in which payment claims and payment responses must be made within the stipulated deadlines to an adjudicator”. Those observations were directed at documents that had to be submitted to an adjudicatorafterthe commencement of an adjudication, and not at documents that had to be servedbeforesuch commencement. Nonetheless, for the reasons we have given, we consider that it is of paramount importance that parties comply with the timelines set out in s 10(2), and we accordingly agree with the conclusion that the Judge reached on the question of whether s 10(2) is a mandatory provision. However, this does not affect our decision on the appeal because, unlike the Judge, we have taken the view that SOCN-E, rather than Preliminaries E, is the applicable clause governing the service of payment claims. 56 At first blush, it may seem draconian to hold that a payment claim would be invalidated solely on the basis that it was served out of time. But, any concerns in this respect are met by s 10(4) of the Act. InChua SayEng, we held that pursuant to s 10(4), a claimant would be able to submit afreshpayment claim for a previous sum that had previously been included in a payment claim which had not been adjudicated upon on the merits: 59 By way of rebuttal, it may be argued that even if the mandatory force of the words “shall be made within 7 days” prevents an application from being made outside the prescribed period, no harm will be caused to the claimant because the claimant can still include the undetermined payment claim in a fresh payment claim where the application for the appointment of an adjudicator complies with s 13(2) of the Act. The same reasoning would also apply to an invalid adjudication determination that has been set aside by the court as such payment claims would not have been rejected by the adjudicator on the merits. In other words, a breach of a mandatory provision of the Act will not bar the claimant from serving fresh payment claims, but only delay their adjudication in accordance with the provisions of the Act. 57 Shortly after our decision inChua SayEng, the High Court inJFC Builders Pte Ltd vLionCity Construction Co Pte Ltd[2013] 1 SLR 1157 (at [68]) held that a payment claim which merely repeated an earlier claim (also referred to hereafter as a “repeat claim” where appropriate to the context) would be prohibited under the Act. This was premised on the view that it would be an abuse of process to allow repeat claims and, further, that the stipulated timelines for submitting payment claims would be rendered largely nugatory if a claimant could revive a claim subject to a new timeline for submission merely by issuing and serving a repeat claim. We consider this to be incorrect. For one thing, it is contrary to our decision inChua SayEng(see also Chow Kok Fong,Security of Payments and Construction Adjudication(LexisNexis, 2nd Ed, 2013) (“Chow Kok Fong”) at pp vii–ix). Further, we do not think the concerns expressed are valid. First, we cannot see why it would be an abuse of process to allow a repeat claim for work done or goods supplied where a previous payment claim for the same work or goods was not in fact adjudicated on the merits. The fact of the matter is that in such a case, work has been done or goods supplied for which payment has yet to be made and in respect of which no adjudication on the merits has taken place. Secondly, the recipient of a payment claim served out of time only has a legitimate complaint in so far as the payment claim was served at a time when he was not obliged to accept it. But, where a fresh payment claim for the same scope of work or goods is subsequently served in good time, we cannot see any legitimate ground for objecting. 58 Indeed, we consider that in many cases, a repeat claim may well prove to be the prudent, expedient and cost-effective solution where the parties dispute whether an earlier payment claim was served within the applicable timeframe. Before we elaborate on this point, however, we deal with the appellant’s argument on estoppel, which we mentioned earlier at [14] above.",
        "Whether the respondent is estopped by the 29 December Email from contending that Preliminaries E applies": "59 In respect of estoppel, the appellant contends that the respondent is estopped by the 29 December Email from arguing that Preliminaries E, rather than SOCN-E, governs the service of payment claims. Apart from this, to bolster her case on estoppel, Ms Mariapan also points to the fact that the respondent did not object upon receiving the Payment Claim and even went on to issue the Payment Response. 60 In our judgment, the Judge was entirely correct to hold that the 29 December Email was not, for the purposes of estoppel, an unequivocal representation that the respondent would not rely on its legal rights against the appellant (see [37] of the Judgment, as well as [21] above). The 29 December Email, at its highest, only demonstrated that the respondent, at the time of sending that email, itself regarded SOCN-E as the applicable clause. The respondent did not go any further than that, and that email could not, in the circumstances, amount to an unequivocal representation which would estop the respondent. 61 There is more to be said, however, about the respondent’s failure to object upon receiving the Payment Claim. As we have already mentioned, the respondent even proceeded to issue the Payment Response. Even at that juncture, the respondent did not take any objection to the time of service of the Payment Claim. When we questioned Mr de Vaz on this, he accepted, rightly in our view, that it waspossiblethat the respondent might be said to have waived a breach of s 10(2) of the Act, although he was also quick to point out that the appellant never mounted a case based on waiver. Had we not decided that SOCN-E was the applicable clause governing the service of payment claims, we would have been minded to call for further submissions on waiver as it would then have been a live issue. As it transpired, it was not necessary for us to do so, but we nonetheless set out our preliminary views on waiver, which we may revisit on a further occasion should the issue be directly engaged. 62 We first consider whether a party may waive an available objection based on an adjudicator’s lack of jurisdiction or the other party’s breach of a mandatory provision of the Act. The legislative purpose of the Act seems to us to be important in this context. InWY Steel, we considered this as follows: 18 … The Act achieves its stated purpose of facilitating cash flow in the building and construction industry in two principal ways. First, it establishes that parties who have done work or supplied goods are entitled to payment as of right: see s 5 of the Act. Second, it creates an intervening, provisional process of adjudication which, although provisional in nature, is final and binding on the parties to the adjudication until their differences are ultimately and conclusively determined or resolved: see s 21 of the Act. This is what is referred to as temporary finality. … 20 … In essence, [temporary finality] entails the idea that the parties to a construction contract should “pay now, argue later”:perWard LJ inRJT Consulting Engineers Ltd v DM Engineering (Northern Ireland) Ltd[2002] 1 WLR 2344 at [1].The appeal of this philosophy is apparent: payments, and therefore cash flow, should not be held up by counterclaims and claims for set-offs that may prove to be specious at the end of lengthy and expensive proceedings that have to be undertaken in order to disentangle the knot of disputed claims and cross-claims. … [emphasis added] 63 In addition, we recognised inW Y Steelthat the abbreviated process of dispute resolution set out in the Act was, “[a]s a species of justice, … admittedly somewhat roughshod, but it is fast; and any shortcomings in the process are offset by the fact that the resultant decision only has temporary finality” (at [22]). In our judgment, it is in line with the legislative purpose of the Act that a party who is not in breach may waive the other party’s breach of a mandatory provision of the Act, and that parties may also waive the right to object to an adjudicator’s lack of jurisdiction. Allowing parties to waive the right to make such objections only serves to facilitate the speedy and efficient resolution of disputes in the building and construction industry so as to allow progress payments to be made promptly. Furthermore, all this may be countenanced because of the underlying principle oftemporaryfinality. 64 We next considerwhenparties may be taken to have waived an available objection. In our judgment, it flows from the same legislative purpose of the Act that parties should not be permitted to argue that an adjudicator lacks jurisdiction or that a breach of a mandatory provision of the Act has occurred if such objections are not raised at the earliest possible opportunity. This would be wholly in line with the goal of establishing a speedy and abbreviated process of dispute resolution. Parties should not be allowed to keep silent at the time a mandatory provision is breached, only to throw up all forms of technical objections at the adjudication. To hold otherwise would, in our judgment, offend the salutary purposes of the Act. 65 It seems to us, therefore, that any objection of the type mentioned above should be made before the party who is entitled to raise the objection takes any further step which would be inconsistent with the objection being maintained, and that party is or ought reasonably to be taken to be aware of the grounds for objecting. In this regard, we think it ought not to be an answer that that party did not have legal advice at the relevant time. That is a matter of a party’s choice as to how it wishes to approach an imminent adjudication. 66 To this, we think there is at least one exception. It seems to us that it may not be feasible to apply the same analysis to breaches of provisions which occurduring the adjudicationand which are not predicated purely on the acts of the parties (for instance, breach of s 16(3)(c) of the Act, which provides that an adjudicator shall comply with the rules of natural justice). Where the potential objections are premised not on the acts or omissions of either party, but rather, on the acts or omissions of the adjudicator, it seems to us that there may be practical difficulties with applying the same principle. 67 Finally, we note that inChua SayEng, it was said,obiter, that an adjudicator should not rule on challenges to his jurisdiction or power to determine the dispute, and should simply proceed with the adjudication. The reason for this is that an adjudicator has no power to decide whether or not he has the requisite jurisdiction (at [36] and [64]). Mr de Vaz informed us that despite this, adjudicators do routinely rule on the validity of their appointment, as well as on arguments that mandatory provisions of the Act have been breached. In our judgment, and in the light of our observation that objections to jurisdiction and claims that a mandatory provision of the Act has been breached in the run-up to the adjudication should be raised expeditiously, even before the adjudicator, there is no objection as a matter of principle to adjudicators considering and then ruling on whether they have jurisdiction and/or whether breaches of mandatory provisions have occurred. However, their determination of such issues will not be final and conclusive because adjudicators do not have the power tofinally and conclusivelydecide these matters. Any decision that they make in this regard will remain open to review by the court, which alone has the power to decide these matters in a final and conclusive manner. Thus, time spent and costs incurred in focusing on such issues in the course of an adjudication might well be wasted. As a practical matter, it may therefore speed up the adjudication process and reduce costs if adjudicators confine themselves to the issues which they are required to deal with, namely, whether payment is due and if so, how much. Challenges to jurisdiction and objections to breaches of mandatory provisions of the Act which have been timeously raised can then be pursued in court.",
        "Closing remarks": "68 We conclude our judgment with three brief observations. First, we return to a point alluded to earlier in relation to repeat claims (see [58] above). In many cases where a dispute arises regarding a breach of a mandatory provision under the Act, it may well save time and costs for the claimant to submit a fresh payment claim in the form of a repeat claim so as to avoid having to contest the matter in an adjudication and (possibly) subsequently, in court. To take the present case as an example, the AD was rendered on 19 June 2015. More than a year later, the appellant has still not been paid for the work done and claimed for in the Payment Claim. Matters may well have taken a different course had the appellant submitted a fresh payment claim in order to avert challenges in court. In our judgment, this will especially be the case where an objection can be raised to the time of service of a payment claim. Having regard to what we have said above at [65], the appropriate time for the respondent to raise such an objection would generally be the time at which it receives that payment claim or, at the latest, by the deadline for it to submit its payment response. At that stage, faced with the objection that its payment claim has not been made timeously, the claimant can opt to file a fresh claim without contesting the point, and this is likely to save time and costs compared to a lengthy dispute in court. The claimant can also submit a fresh payment claim after the court has set aside the disputed adjudication determination since there would have been no decision on the merits of the earlier payment claim upon which that adjudication determination is based, although by then, the parties will often already have invested too much into the dispute, and there may also be issues of costs and other considerations. We appreciate too that in the present case, the respondent may be faulted for not having raised its objections at the earliest possible opportunity. In this regard, we note that O 59 r 5(b) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) provides that the court, in exercising its discretion as to costs, “shall, to such extent, if any, as may be appropriate in the circumstances,take into account…the conduct of all the parties, including conduct before and during the proceedings” [emphasis added]. In our judgment, the conduct of the parties prior to the adjudication proceedings will often be relevant in the context of setting-aside applications under the Act. 69 Second, parties should try as far as possible to give effect to the speedy and efficient system of dispute resolution established by the Act. Where challenges to an adjudication determination are made in court, parties should endeavour to take all necessary steps to ensure that the setting-aside applications are heard and disposed of as soon as possible. They should work with the Registry to ensure that such applications, which often involve narrow points of interpretation and very few (if any) disputes of fact, such that oral evidence is almost never required, are fixed before a judge on an expedited basis. For appeals to the Court of Appeal, parties may consider utilising the procedure for expedited appeals in O 57 r 20 of the Rules of Court. This should ensure that challenges to an adjudication determination are resolved in a prompt and efficient manner. All too often, an inordinate delay is caused which may prove fatal to businesses that are already cash-strapped. 70 Our third and final observation pertains to the need for law reform in this area. Parliament passed the Act (in the form of its predecessor, the Building and Construction Industry Security of Payment Act 2004 (Act 57 of 2004)) almost 12 years ago on 16 November 2004, and the bulk of its provisions came into force on 1 April 2005. By and large, the Act has been positively received by the building and construction industry (seeChow Kok Fongat pp 22–23). However, there is still room to refine the intricacies of the operation of the Act. Recently, the Law Reform Committee of the Singapore Academy of Law proposed amendments to the Act directed mainly at improving a number of important provisions in the Act while retaining its essential features (seeProposals for Amending the Building and Construction Industry Security of Payment Act(September 2015)). In this regard, the Committee stated: 19 Crucially, we should review those provisions which do not serve the purpose of any party and those which inject a dose of uncertainty in the operation of the regime. Since the regime affords only a temporary resolution of the dispute until arbitration or trial, amendments should be directed towards simplification and clarification of its basic processes with the objective of reducing the cost and time associated with these processes. The cost of the tribunal is low relative to arbitration and other dispute resolution routes. However, costs may be incurred by the parties themselves in preparing their cases for adjudication. These relate to the cost of documenting and filing the payment claim, payment response and the adjudication documents, as well as the cost of employing technical experts and legal advisers. With a number of relatively straightforward amendments, these costs could be reduced significantly. To the extent that improvements are being considered to clarify the operation of the Act, in particular, with a view to reducing the costs incurred in the dispute resolution process set out therein, we welcome this. Legislators may also consider introducing, as part of the measures to facilitate the speedy resolution of disputes under the Act and to reduce the costs associated with the system, a fast-track process where challenges to an adjudication determination, which only has temporary finality (see s 21 of the Act), may be speedily brought to court, and where the decision of the judge is non-appealable except with leave from either the High Court or the Court of Appeal.",
        "Conclusion": "71 In conclusion, for the reasons we have given at [25]–[44] above, we allow this appeal with costs here and below to the appellant. As we are minded to fix these costs, the parties are to submit written submissions, limited to eight pages each, within two weeks of the date of this judgment setting out their arguments as to the appropriate quantum of these costs.   Sundaresh Menon  Chao Hick Tin   Tay Yong KwangChief Justice   Judge of Appeal  Judge of Appeal Radika Mariapan (IRB Law LLP) for the appellant;Ian de Vaz, Tay Bing Wei and Chua MingHao (WongPartnership LLP) for the respondent."
    }
}