{
    "case_title": "The “Bunga Melati 5”",
    "ncitation": "[2016] SGCA 20",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1This appeal arises out of a claim in the sum of US$21,703,059.39 together with contractual interest. The claim was brought by the appellant, Equatorial Marine Fuel Management Services Pte Ltd (“EMF”), for non-payment of bunker fuel that had been delivered to vessels owned or operated by the respondent, MISC Berhad (“MISC”), under three bunker contracts (“the Disputed Contracts”). EMF had concluded the Disputed Contracts with Market Asia Link Sdn Bhd (“MAL”). 2EMF’s case is that MISC is in fact the counterparty to the Disputed Contracts and that MAL at all times was acting as MISC’s agent. On the other hand, MISC’s case is that it was never party to the Disputed Contracts and that EMF must look to MAL for payment. MISC contends that it purchased the bunkers from MAL and paid MAL in full. At the trial, EMF argued that MAL had actual and/or apparent authority from MISC to act as its agent. It also argued that MISC was estopped from denying MAL’s authority to transact on its behalf as its agent. The High Court judge (“the Judge”) rejected all of EMF’s arguments and consequently dismissed EMF’s claim. The Judge’s decision may be found atThe “Bunga Melati 5”[2015] SGHC 190 (“the Judgment”). 3EMF has appealed against the Judgment but only pursues a single point, which is the Judge’s finding that MISC is not estopped from denying that MAL was its agent. This raises questions of both law and fact. Specifically, we must consider the circumstances under which a party will be estopped from denying that another was its agent; and whether those circumstances are made out in the present case. We heard the parties on 9 March 2016 and reserved judgment for a short time to review some of the materials. Having considered the matter, we now give our decision in respect of the appeal. In short, we dismiss EMF’s appeal. We preface the reasons for our decision with a brief summary of the facts relevant to the appeal.",
        "The facts": "4EMF is a Singapore incorporated company whose business is to sell and supply bunkers to ocean-going vessels. MISC is a publicly listed company incorporated in Malaysia which owns and operates commercial vessels. It is known to be one of the largest shipowners in the world. The putative agent, MAL, is a company incorporated in Malaysia. Initially, its business was to sell spare parts for ships, including those of MISC. In March 2005, MAL was approved by MISC as a registered bunker vendor. Thereafter, until the end of 2008, MISC purchased significant amounts of bunker fuel from MAL pursuant to fixed price contracts as well as spot contracts. 5To satisfy the bunker demands of MISC, MAL would approach bunker brokers to source for bunker suppliers. EMF was one such bunker supplier. Bunker brokers essentially connect buyers and sellers of bunkers without taking on the credit or supply risk of either. The bunker brokers MAL dealt with who are material to this appeal are Compass Marine Fuel Ltd (“Compass”) and OceanConnect UK Ltd (“Ocean”), both of which are companies based in London. 6Between June 2006 and September 2008, EMF delivered approximately 198,000mt of bunkers to MISC’s vessels pursuant to bunker supply contracts brokered through Compass and Ocean. This included the Disputed Contracts which involved a total quantity of approximately 71,100mt of bunkers. Unbeknown to EMF, the party that Compass and Ocean were dealing with in relation to these bunker supply contracts was MAL rather than MISC directly. 7The present appeal concerns two fixed price contracts and a spot contract (ie, the Disputed Contracts) that were entered into by EMF with MAL through EMF’s brokers, Compass and Ocean, to deliver bunkers to MISC’s vessels. EMF contends that MISC is estopped from denying that MAL was acting as its agent with respect to the Disputed Contracts. It contends that this is so because MISC knew that MAL was conductingallits transactions withallits bunker suppliers on the basis that it was MISC’s agent, yet it stood idly by and did not correct EMF’s mistaken belief that MISC was the true contracting party to the Disputed Contracts. In fact, EMF suggests that MISC went further than that – EMF contends that MISC encouraged and assisted MAL in its misrepresentations to its bunker suppliers that it was MISC’s agent. In these circumstances, EMF contends that equity will intervene to prevent MISC from denying that MAL was its agent.",
        "Our decision": "8We begin with the applicable principles of law. At the outset, we note that the difference between agency by estoppel and apparent authority is not, as it were, that apparent. The distinction appears to have been recognised by the learned authors of Peter Watts & F M B Reynolds,Bowstead and Reynolds on Agency(Sweet & Maxwell, 20th Ed, 2014) (“Bowstead”), where they express the view that in certain circumstances, a person may be held liable as principal in respect of a transaction entered into by some other party even where it cannot be said that the putative principal has made a representation as to, or in some other way manifested, the authority of that other party to act on its behalf to the third party. Such a representation would be required in order to establish liability on the basis of apparent authority. Despite the absence of any such representation, it is said that the principal may nonetheless be affected in an agency context by the operation of the doctrine of agency by estoppel provided the relevant circumstances are shown to exist (see para 2-099 ofBowstead). However, what constitutes such circumstances remains uncertain. Two decisions are cited inBowsteadas illustrations of the principle of agency by estoppel:PacificCarriers Ltd v BNP Paribas(2004) 218 CLR 251 (“Pacific Carriers”) andSpiro v Lintern[1973] 1 WLR 1002 (“Spiro”). However, in our judgment, these do not go very far in shedding light on the difference between the two doctrines and whether indeed the doctrine of agency by estoppel stands as an altogether separate basis for holding the principal liable. 9A careful reading ofPacific Carrierssuggests that that decision of the High Court of Australia can equally be explained on the basis of the doctrine of apparent authority. InPacific Carriers, the Documentary Credit manager of the defendant-bank had actual authority to sign letters of credit but not letters of indemnity against delivery of goods without a bill of lading. The manager nonetheless signed such letters of indemnity which were subsequently relied on by the plaintiff-charterer to its detriment. The High Court of Australia, applying the general principles concerning the apparent authority of an officer of a company dealing with a third party as enunciated inFreeman & Lockyer v Buckhurst Park Properties (Mangal) Ltd[1964] 2 QB 480) (“Freeman & Lockyer”), held that a representation may be found to have been  made where the putative principal, in this context a company, equips one of its officers with a certain title, status and facilities (at [36]–[38]). The court found, among other things, that the manager had been provided with a bank stamp and copies of the letters of indemnity and was thus placed “in a position which equipped her to deal with the letters of indemnity as requested by the [plaintiff-charterer]” (at [44]). The court held that this induced the assumption made by the plaintiff-charterer that the letters of indemnity were authentic and it would be unjust in the circumstances to permit the defendant-bank to act contrary to this (at [44]). In our judgment, the case may be understood as having been decided on the basis that the conduct of the defendant-bank, in placing the manager in the position that she was in, amounted to a representation by the defendant-bank that the manager had the authority to sign letters of indemnity. It is not controversial that a representation may be inferred from conduct and this would have sufficed to afford a basis for finding that the manager was thereby cloaked with apparent authority. 10As forSpiro, that involved a very unusual situation. InSpiro, the owner of a house, Mr Lintern, had asked his wife, Mrs Lintern, to put the house in the hands of estate agents, which she did. However, he gave her no authority to sell the house. The estate agents received an offer from one Mr Spiro and informed Mrs Lintern of the same. She instructed the agents to accept the offer. Thereafter, in the interactions between the Linterns and Mr Spiro, Mr Lintern conducted himself as if he had authorised the transaction. What was of particular significance is that all the parties, namely Mr and Mrs Lintern and Mr Spiro, were privy to the following facts: (a) that the property in question belonged to Mr Lintern; (b) that Mrs Lintern was dealing with Mr Spiro on the terms of the intended sale; and (c) that each of the parties knew that the other parties were aware of the foregoing two facts. 11In those circumstances, there was no difficulty in finding that Mr Lintern had a duty to correct Mr Spiro’s mistaken belief that Mrs Lintern had authority to negotiate the sale of the property on Mr Lintern’s behalf and his failure to do so amounted to a representation that Mrs Lintern did have such authority (at 1011A–D). Viewed in this way, in our judgment,Spirocould very well have been analysed under the traditional doctrine of apparent authority. 12This having been said, we do not think it is in factnecessaryfor us to decide in the present case whether there is a real difference between the two doctrines. In our judgment, it is uncontroversial that unconscionability underlies equity’s intervention to make a putative principal liable even in the absence of actual authority. The doctrine of apparent authority has itself been analysed as an instance of estoppel: seeFreeman & Lockyerat 503; and see alsoGuy Nealeand others v Ku De Ta SG Pte Ltd[2015] 4 SLR 283 at [95]-[97]. At the broadest level, equity intervenes to estop the putative principal from denying as against a third party that another was its agent if in the circumstances, it would be unconscionable for the putative principal to do so. But such a broad articulation is analytically unhelpful because it fails to draw out the essential requirement that unconscionability must comprehend not only the element ofhardshipon the part of the third party but alsoresponsibilityon the part of the putative principal. In other words, there must be some act or omission on the part of the principal that leads to the third party acting or continuing to act in a particular way to his detriment or suffering hardship and it is this which gives rise to the requisite finding of unconscionability. This is why the inquiry is correctly to be undertaken within the traditional framework of estoppel that examines three elements which must be found to be satisfied, namely, (i) a representation by the person against whom the estoppel is sought to be raised; (ii) reliance on such representation by the person seeking to raise the estoppel; and (iii) detriment: seeHong Leong Singapore Finance Ltd v United Overseas Bank Ltd[2007] 1 SLR(R) 292 (“HongLeong”) at [192]; and see alsoUnited Overseas Bank Ltd v Bank of China[2006] 1 SLR(R) 57 at [18]. 13Counsel for EMF, Mr Lee Eng Beng SC (“Mr Lee”), does not seek to dismantle this framework. His main contention is that the absence of a positive representation need not be decisive where the doctrine of agency by estoppel is involved. When pressed, he said that the conduct of the putative principal taken as a whole may be sufficient to found the estoppel. In our judgment, this again has the disadvantage of being too general to be useful. One can look at this from the point of view either of an affirmative representation or more generally, a holding-out of the agent as authorised; or from the point of view of a principal, who with the knowledge that the third party is operating on a certain misapprehension of the factual position does nothing to correct that misapprehension in circumstances where one would reasonably regard him as bound to correct it. In the latter case, though he has made no affirmative representation, by his omission or failure to correct the misapprehension when the law regards him as being bound to do so, he is taken to have represented that the misapprehended state of affairs is in fact true. 14This is consistent with the well-established rule that silence or inaction will count as a representation where there is alegal(and not merely moral) duty owed by the silent party to the party seeking to raise the estoppel to make a disclosure: seeHong Leongat [194]; and see Wilken & Ghaly,The Law of Waiver, Variation, and Estoppel(Oxford, 3rd Ed, 2012) at para 9.55. For our part, we would be content to state that the rule would apply where in all the circumstances, there was a legal or equitable duty to make the disclosure, communication or correction, as the case may be. 15The question of when such a duty arises does not lend itself to easy answers. Bingham J inTradax Export SA v Dorada Compania Naviera SA (The “Lutetian”)[1982] 2 Lloyd’s Rep 140 (at 157) regarded Lord Wilberforce’s decision inMoorgate Mercantile Co Ltd v Twitchings[1977] AC 980 as persuasive authority for the proposition that: … the duty necessary to found an estoppel by silence or acquiescence arises where a reasonable man would expect the person against whom the estoppel is raised, acting honestly and responsibly, to bring the true facts to the attention of the other party known by him to be under a mistake as to their respective rights and obligations. … 16The court thus has to decide the onus and ambit of responsibility of the silent party, by reference to whether a mistaken party couldreasonablyhave expected to be corrected. This will inevitably depend on theprecisecircumstancesof the case and whether they were of such a nature that it became incumbent upon the silent party, who is taken to be acting honestly and reasonably, to correct the mistaken party’s belief. Given the myriad of circumstances that may arise in commerce and the desirability of maintaining flexibility in the doctrine of estoppel, it would neither be appropriate, nor ultimately helpful, for us to attempt to draw neat circles delineating precisely when a duty to speak may arise. 17However, having articulated the principle on which liability may be founded in these situations, it is appropriate for us to emphasise one important predicate that is especially relevant to the disposal of this matter. For such a duty to arise at all, it must be shown, at least, that the silent partyknewthat the party seeking to raise the estoppel was in fact acting or proceeding with its course of conduct on the basis of the mistaken belief which the former is said to have acquiesced in (seeHong Leongat [197]). We leave to one side the fact that this falls short of the situation inSpiro, where not only did Mr Lintern know that Mrs Lintern was conducting the negotiations with Mr Spiro, but further, Mr Spiro knew that Mr Lintern knew this and further that Mr Lintern was evidently content for it to be so. 18In the case before us, EMF’s case is that MISC knew that MAL had entered into the Disputed Contractsrepresenting itselfas MISC’s agentand failed to correct EMF’s mistaken belief that MAL was entering into the Disputed Contracts on this basis and not in its own right. Mr Lee accepted that EMF was in no position to prove directly that MISC knew any of these specific things. Instead, he sought to base his claim on the wider proposition that MISC knew that MAL was conductingallits transactions withallits bunker suppliers on the basis that it was MISC’s agent. 19But even as to this, Mr Lee accepted that EMF had no direct evidence to prove such knowledge. Instead, he submitted that we shouldinferthat MISC possessed such knowledge arising from the following facts: (a) The suspicious circumstances surrounding MAL’s appointment as MISC’s registered vendor of bunkers; (b) The early bunker confirmations sent by MAL to MISC which had described MAL as a “broker” and five occasions when bunker suppliers sent invoices directly to MISC; and (c) MISC’s response (or lack of response) when MAL was unable to service the payments to its suppliers and it became evident that large sums of money were being claimed by bunker suppliers directly against MISC. 20We consider each of these sets of facts in turn. Before doing so, we note Mr Lee’s acceptance, as was undoubtedly correct, that if he could not even prove this on a balance of probabilities, then EMF’s further arguments that MISC allegedly encouraged or assisted MAL in its misrepresentations would be irrelevant. Moreover, if he were unable to make out such knowledge, there would be no occasion for us to consider whether in all the circumstances, MISC had a duty to correct EMF’s misperception.",
        "MAL’s appointment as MISC’s registered bunker vendor": "21EMF argues that MAL did not have the financial resources, credit standing or expertise to engage in bunker trading services. This allegedly brought into question thebona fidesof MAL’s appointment as MISC’s registered bunker vendor. Mr Lee submits on this basis that MISC should have known that no bunker supplier would have supplied bunkers on credit to MAL as principal and would only have supplied bunkers to MISC’s vessels if they believed that MAL was contracting on MISC’s behalf. 22We pause to make a preliminary observation. Insofar as Mr Lee sought to rely on “suspicious” circumstances, it seemed to us he had to tread a fine line. Mr Lee seemed at times to be alluding to the possibility of some sort of conspiracy or intentional device under which MISC wanted to structure its dealings with its suppliers through MAL in order to shield itself against direct claims. This has to be parsed further. If the allegation is that MISC intended to incur liability only to MAL, it does not advance EMF’s case. If on the other hand, the argument is that there was a conspiracy between MISC and MAL to lead suppliers to think that they were dealing with MISC, not only was this not made out on the evidence, but it also seemed to us that this would have amounted to a case ofactual authorityin the sense that on this theory, MISCwashaving MAL enter into these transactions on its behalf even if it was in some way trying to conceal this. EMF has not appealed the Judge’s finding that there was no actual authority. Having chosen this course of action, EMF is bound by the findings of the Judge. Hence at the outset, it seems to us that EMF’s argument that there was something improper about the way MAL was appointed as MISC’s registered bunker vendor does not advance its case. 23In any event, we also note that the Judge considered this and found that there was nothing sinister in MAL’s appointment, at least in the sense that there was no conspiracy or fraud between the two parties. At [76] of the Judgment, the Judge held as follows: … At the risk of repetition, the evidence adduced by EMF merely shows that MAL and MISC had a relationship that went beyond purely commercial interests, even to the extent that MAL may have been unduly preferred over MISC’s other vendors and that MAL may have had other motives for entering into the bunker supply contracts.However, any inference that can be drawn is likely to relate to lack of good corporate governance in MISC or to behaviour aimed at financial gain. No inference that the intention was to confer authority on MAL to act as an agent can stand. [emphasis added] 24We also consider that knowledge of MAL’s lack of capital and financial resources cannot in itself amount to knowledge that bunker suppliers would only be willing to deal with MAL if they believed that MAL was contracting on MISC’s behalf. First, MAL had represented to MISC that it was entering into the bunker supply business together with its partner, Total, in association with two other companies, Hin Leong (Pte) Ltd and Tramp Oil & Marine (Far East) Pte Ltd, all of which were bunker suppliers. Second, as counsel for MISC, Mr Ang Cheng Hock SC (“Mr Ang”) pointed out, it is completely speculative how bunker suppliers in general dealt with or viewed MAL. EMF was the only bunker supplier that gave evidence, and although it contended that it would not have contracted with MAL had it known MAL was operating as a bunker trader, this was a position it took with the clarity of hindsight. It could equally well have been the case that bunker suppliers were prepared to deal with MAL as a trader because they knew that MAL was a registered vendor of MISC, and that MISC, being a well-known ship owner, would reliably pay MAL who therefore would then be able to pay the bunker suppliers. Third, and most importantly, it was not within MISC’s realm of knowledge how MAL dealt with its bunker suppliers; nor was it incumbent on MISC to find out. In fact, from MISC’s perspective, the fact that MAL had a credit facility with Affin Bank in connection with which MISC gave an undertaking to make payments into a specific bank account, suggests that MAL was negotiating bunker supplies on the basis of its own credit lines.",
        "MAL’s bunker confirmations and invoices sent directly to MISC": "25The next set of facts that EMF relies on are certain bunker confirmations sent by MAL to MISC in 2005 and early 2006 which described MAL as a broker and five occasions on which invoices were sent directly from bunker suppliers to MISC. 26We deal first with the bunker confirmations. The Judge considered this at [57]–[61] of the Judgment, albeit in the context of actual authority. She accepted the evidence of Ms Intan Fariza binti A Rahim and Mr Mohammad Khairul bin Anwa, two of MISC’s employees who had been copied on these bunker confirmations. Their evidence was that they were unaware of the nuances and failed to appreciate the legal difference between referring to a party as a broker and as a trader. Moreover, these terms could have been used in error. This is not as unbelievable as EMF makes it out to be, not only for the reasons given by the Judge at [58] of the Judgment, but also because there were other errors found in the bunker confirmations. For example, one of the bunker confirmations described Ocean as the “Seller” when Ocean was actually the broker for the bunker supplier. More importantly, the Judge also found that subsequent bunker confirmations were corrected to describe MAL as a “Trader”. On the evidence, the last of the bunker confirmations that described MAL as a “Broker” was dated 23 January 2006, and this was well before EMF had even started supplying bunkers to MISC’s vessels in June 2006 pursuant to bunker supply contracts brokered through Compass and Ocean. In the light of the Judge’s findings, which we see no reason to disturb, we consider that it cannot be inferred from the bunker confirmations that MISC knew MAL was misrepresenting toallits bunker suppliers atalltimes that it was MISC’s agent. 27We turn to those five occasions when invoices were sent by the bunker suppliers directly to MISC. EMF argues that this should have made MISC aware that the bunker suppliers believed they had contracted with MISC through MAL. In our judgment, this evidence at best is neutral. First, none of these invoices came directly from EMF. Second, it is important to see these incidents in their broader context. These were five discrete instances that took place over a period of 24 months, during which significant amounts of bunker fuel were supplied by various bunker suppliers to MISC’s vessels. This would suggest that the vast majority of the invoicesnevercame directly to MISC, which as it happens was the effect of MISC’s evidence. The fact that a mere handful did come to it can easily be explained as errors. Mr Lee submitted that it was inexplicably odd that the bunker suppliers even thought to address these to MISC. But we do not see why this should be so given that the bunkers had been supplied directly to vessels belonging to MISC. 28It is also instructive to have regard to the actions that were subsequently taken in relation to the invoices. In so far as the invoices from Bakri International Energy Co Ltd, O.W. Bunker & Trading Co Ltd and Aegean Marine Petroleum S.A. (“Aegean”) were concerned, MAL, either on its own accord or pursuant to MISC’s directions, sought to and apparently did resolve the matter with the bunker suppliers directly. With respect to the Aegean invoice, MAL also sent an email to Ocean requesting Ocean to remind Aegean not to send invoices directly to MISC. In so far as the remaining two invoices are concerned (from Shell Marine Products Limited and CEPSA Marine Fuels, S.A.), we note that there were no further instances of invoices being sent from these bunker suppliers directly to MISC. Presumably, these suppliers had been informed by MAL not to do so. Taken in the round, there was therefore nothing that could be said to have put MISC on inquiry as to whether MAL had been conductingallits transactions withallits bunker suppliers on the basis that it was MISC’s agent.",
        "MISC’s response to payment demands from bunker suppliers": "29The last set of facts that EMF relies on is MISC’s response, or lack thereof, to the various payment demands that were directed to MISC by bunker suppliers in November and December 2008. In this regard, EMF made much of the Judge’s observation at [102] of the Judgment that MISC’s reaction to the receipt of notices from the suppliers seeking payment “suggest that the allegations of agency did not come as a complete surprise to them”. 30Some clarification of the Judge’s observation would be in order. In our judgment, the Judge was not making any finding that MISC was aware that MAL was representing itself as MISC’s agent toallits bunker suppliers foralltransactions. First, at [105] of the Judgment, the Judge had prefaced this part of the discussion with these words: “Even if MISC had known that MAL had represented itself as MISC’s agent …”. Hence, the Judge was considering this scenario as a hypothesis only. Second, the Judge found at [67] of the Judgment, albeit in the context of actual authority, that she was satisfied that “there was nothing truly improper about MISC’s conduct between November and December 2008”. The Judge further found at [68] that MISC’s responses to the bunker suppliers do not “lead to an ‘irresistible inference’ that MISC had known that MAL had acted as its broker and that it was liable to the suppliers”. 31We find ourselves in agreement with the Judge on this. Indeed, the evidence that EMF relies on is at best equivocal and bears examining in some detail. It is true that upon receiving the payment demand from EMF on 5 November 2008, MISC did not question EMF as to why it was seeking payment from MISC. However, MISC sent an email to MAL asking MAL to check if EMF was a supplier of MAL. MAL replied that it would check immediately. MISC then followed up with a second email to MAL which stated: We appreciate [your] side to [advise EMF] accordingly since we already made payment for all invoices. As per their email, they want to detained [sic] our [vessel] if not [received] payment by 07/11/08. 32MAL responded as follows: We apologized [sic] for the notice from [EMF] to MISC. We shall take immediate action on this matter. We will be closely contacting with [EMF]. 33These emails were all exchanged on the same day within hours of MISC receiving EMF’s payment demand. On the following day, MAL sent an email to EMF apologising for the delay in the payment and requesting EMF not to arrest MISC’s vessels. It also stated: … We do not wish to leave any unsatisfactorily [sic] records in your account and will strictly ensure that there will be no further cause for disappointment on our part. You have been most considerate in your dealings with MAL and hope that we can rely on your invaluable support for our company in this crucial situation. 34In our judgment, the above exchanges do not lead to thesoleinference that, prior to receiving EMF’s demands for payment, MISCalreadyknew that MAL had consistently been contracting withallits bunker suppliers as MISC’s agent. MISC’s response is at leastequallyexplicableon the basis that MISC needed to investigate the matter further before coming to any conclusion. During the hearing, Mr Lee confirmed that he was not suggesting that these email exchanges between MAL and MISC were contrived. If these emails are to be taken at face value, it seems impossible to dispute that MISC in factgenuinelybelieved that MAL was solely responsible for these invoices and demanded on this basis that MAL immediately resolve the position with the suppliers. This runs flatly in the face of the inference that we were being asked to draw. Furthermore, when considered against the background of the relatively stable and incident-free dealings between the parties over the course of the preceding three years, it does not seem to us to be at all unusual that MISC’s first response would be to attempt to clarify matters rather than to assume that MAL had been acting improperly. 35MISC’s standard replies to payment demands from other bunker suppliers over the course of the following week also do not support the inference that EMF urges us to draw. An example of one such reply is as follows: For your kind consideration, MISC’s understanding all this while was as per below flow: MISC –> MAL –> (OceanConnect) –> AVIN So far MISC issued orders to MAL … & they’ll arrange with Physical i.e. AVIN to bunker to our vessels. All payment invoices we received on MAL’s letter head [which] we paid in full amount rightfully. In fact, we have settle/remitted all the payments into MAL’s account. Further MAL shall remit payments to the Physicals whom they’re dealing with i.e. AVIN. However, receiving your statement claiming the [outstanding] payments really surprised us. 36While it is true that MISC did not expressly ask the question why payment was being sought from it, its reply made it plain that MISC was drawing a line between itself and MAL and that as far as it was concerned, having itself paid MAL, it was under no liability to the bunker suppliers. It is also significant that on 17 November 2008, MISC proceeded to suspend MAL for all its spot purchases. It also issued a letter to MAL on the same day expressing its disappointment and stating that it would hold MAL “totally liable” for all consequential losses and that it “may not consider MAL in any future businesses.” In the letter, MISC also described MAL as its “vendor”. 37Lastly, reference was made to some corporate guarantees given and payments made by MISC to some bunker suppliers and also to a letter sent by MISC to Affin Bank attesting to MAL’s “excellent performance records”. In our judgment, these are equivocal as well. With respect to the corporate guarantees, the Judge was satisfied with MISC’s explanation, which was that these had been furnished in order to forestall the arrests of its vessels and to avoid the risk of damage to its reputation (see the Judgment at [67]). We see no reason to disagree with this. With respect to the letter to Affin Bank, this is equally explicable on the basis that MISC in fact would have wanted MAL to continue to have its credit line with Affin Bank so that MAL could pay the suppliers, thereby resolving the entire matter. As Mr Ang pointed out, MAL had found itself in this disastrous situation seemingly because of adverse market conditions between the time it undertook supply obligations to MISC and the time it managed to cover those obligations by entering into purchase contracts with its suppliers. 38As we have noted above, the predicate to Mr Lee’s case is the inference of knowledge being drawn in the terms set out at [18] above; but it is well established that an inference may only be drawn if it is thesoleinferencethat flows from the facts proved. The more serious the nature of the inference, the more careful the court must be to ensure that this is so. In our judgment, the various sets of facts that were advanced, whether taken individually or collectively, do not provide a sufficient basis to draw the inference that was urged upon us. It was simply not possible to conclude that MISC knew that MAL was conductingallits transactions withallits bunker suppliers on the basis that it was MISC’s agent. Having failed to prove this, there was neither the need nor the basis for us to consider whether MISC had a duty to communicate to EMF that MAL was not its agent and EMF’s argument on agency by estoppel, even assuming this affords a separate basis of liability, fails. 39We add that even if a representation could be said to have been made, we do not think it would have advanced EMF’s position. Mr Lee accepted that the knowledge of EMF’s agents, namely Compass and Ocean, would have affected EMF and there was evidence which suggested that both Compass and Ocean knew that MAL was operating as a bunker trader. Compass knew that throughout the course of dealings, all of EMF’s invoices were paid by MAL and not MISC. According to Mr Darren Middleton, who was the principal of Compass and gave evidence on behalf of EMF, this was something that a bunker broker wouldneverhave done. With respect to Ocean, there was an email from MAL dated 2 May 2006 where MAL clearly described itself as “the top bunker trader currently in MISC”. In our judgment, these facts would at the very least have placed them on inquiry as to MAL’s trading status so as to preclude reliance on any representation.",
        "Conclusion": "40In the circumstances, we dismiss the appeal with costs to be taxed. We also make the usual consequential orders.  Sundaresh Menon        Chao Hick Tin          Andrew Phang Boon LeongChief Justice         Judge of Appeal          Judge of Appeal Lee Eng Beng SC, Koh See Bin and Seow Wai Peng Amy (Rajah & Tann Singapore LLP) for the appellant;Ang Cheng Hock SC, Tan Xeauwei, Ramesh Kumar and Edmund Tham (Allen & Gledhill LLP) for the respondent."
    }
}