{
    "case_title": "Kho JabingvPublic Prosecutor",
    "ncitation": "[2016] SGCA 21",
    "coram": "Chao Hick Tin JA (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 In our recent decision inThe Royal Bank of Scotland NV (formerly known as ABNAmro Bank NV) and others v TT International Ltd (nTan Corporate Advisory Pte Ltd and others, other parties) and another appeal[2015] 5 SLR 1104 (“TT International”)at [185] and [215], we explained that the principle of finality is an integral part of justice. Judicial decisions, if they are to mean anything at all, must confer certainty and stability. People must be able to order their affairs according to the settled conviction that the last word of the courtisthe last word, and that the last full stop in a written judgment is not liable to be turned into an open-ended and uncertain ellipsis. As Harlan J said inMackey v United States401 US 667 (1971) at 690–691: … It is, I believe, a matter of fundamental import that there be a visible end to the litigable aspect of the criminal process. Finality in the criminal law is an end which must always be kept in plain view. … If law, criminal or otherwise, is worth having and enforcing, it must at some time provide a definitive answer to the questions litigants present or else it never provides an answer at all. Surely it is an unpleasant task to strip a man of his freedom and subject him to institutional restraints. But this does not mean that in so doing, we should always be halting or tentative. No one, not criminal defendants, not the judicial system, not society as a whole is benefited by a judgment providing [that] a man shall tentatively go to jail today, but tomorrow and every day thereafter his continued incarceration shall be subject to fresh litigation on issues already resolved. 2 However, the cost of error in the criminal process is measured not in monetary terms, but in terms of the liberty and, sometimes, even the life of an individual. For this reason, where criminal cases are concerned, the principle of finality cannot be applied in as unyielding a manner as in the civil context, and it seems that the court should, inexceptionalcases, be able to review its previous decisions where it isnecessaryto correct a miscarriage of injustice. The question would then be this: when do these conditions obtain? In the present criminal motion (“the Present Application”), we confront this very issue.",
        "The facts": "3 In 2010, the applicant in the Present Application, Jabing Kho (“the Applicant”), was tried and convicted of the offence of murder, and was sentenced to suffer the then mandatory punishment of death: seePublic Prosecutor vGaling Anak Kujat and another[2010] SGHC 212 (“HC (Conviction)”) (the said Galing Anak Kujat in this case report was the Applicant’s co-accused at the trial). The Applicant’s appeal against his conviction was dismissed in 2011 (seeKhoJabing and another v Public Prosecutor[2011] 3 SLR 634 (“CA (Conviction)”)). Following the enactment of the Penal Code (Amendment) Act 2012 (Act 32 of 2012) (“the 2012 Amendment Act”), all persons who commit the offence of murder, save for those who commit murder within the meaning of s 300(a) of the Penal Code (Cap 224, 2008 Rev Ed) (“the PC”), may be sentenced to a term of life imprisonment and caning instead of being sentenced to death. Crucially, the 2012 Amendment Act also provided that all persons who were convicted of murder before the entry into force of the Act could apply to be re-sentenced under the new sentencing framework. 4 The Applicant duly applied to be re-sentenced. On 30 April 2013, the Court of Appeal clarified that he was guilty of murder within the meaning of s 300(c) of the PC and remitted the matter to the High Court for a fresh sentence to be passed. On 14 August 2013, a High Court judge (“the Re-sentencing Judge”) re-sentenced the Applicant to a term of life imprisonment and 24 strokes of the cane (seePublic Prosecutor vKho Jabing[2014] 1 SLR 973 (“HC (Re-sentencing)”)). The Prosecution appealed and the matter came before us. On 14 January 2015, we allowed the Prosecution’s appeal by a majority of 3:2, and substituted the sentence of life imprisonment and caning with a sentence of death (seePublic Prosecutor v Kho Jabing[2015] 2 SLR 112) (“CA (Re-sentencing)”)). The Applicant then petitioned the President of the Republic of Singapore for clemency, but his application was rejected, and on 19 October 2015, the President ordered that the sentence of death be carried into effect on 6 November 2015.1Foot Note 1×Applicant’s submissions at para 9; Order by the President under s 313(f) of the CPC. 5 On 3 November 2015, Mr Ravi s/o Madasamy filed Criminal Motion No 23 of 2015 (“CM 23/2015”) seeking to have the Applicant’s conviction set aside on the ground that it was unconstitutional. On 4 November 2015, the Applicant applied by way of the Present Application to set aside thesentence of deathimposed on him. The Attorney-General was named as the respondent in CM 23/2015, while the Public Prosecutor was named as the respondent in the Present Application. Both applications were scheduled for hearing before us on an urgent basis, and we heard them on the morning of 5 November 2015. At the start of the hearing, counsel for the Applicant, Mr Chandra Mohan K Nair, informed us that he had only been instructed the day before and therefore had not had sufficient time to prepare his client’s case. In the circumstances, we thought it fair and prudent to adjourn both applications, and ordered that the sentence of death imposed on the Applicant be stayed pending their determination. 6 At the resumed hearing of the applications on 23 November 2015, Mr Ravi applied to withdraw CM 23/2015. We granted that request, but clarified that as a result of the withdrawal, the issue of whether Mr Ravi had thelocusstandito bring the application (the Public Prosecutor contended that he did not) did not arise for decision, and further, that we expressed no views on that issue. We then heard Mr Mohan on the merits of the Present Application and reserved judgment.",
        "The issues": "7 In broad terms, the Present Application raises two issues. The first is whether, and in what circumstances, the Court of Appeal may reopen its previous decision in a concluded criminal appeal, which was to have been final. The second is whether it should do so in the present case. We will discuss each issue in turn.",
        "When should the Court of Appeal reopen its decision in a concluded criminal appeal?": "8 Applications to reopen concluded criminal appeals have burgeoned. In 2015, 11 criminal motions of this nature were filed by accused persons in the Court of Appeal alone: six seeking leave to appeal against the outcome of Magistrate’s Appeals2Foot Note 2×Court of Appeal Criminal Motions Nos 2, 4, 9, 11, 14 and 20 of 2015.and five seeking to move this court to re-examine its own decisions in concluded criminal appeals arising from decisions made by the High Court at first instance.3Foot Note 3×Court of Appeal Criminal Motions Nos 1, 6, 12, 23 and 24 of 2015.Of these 11 criminal motions, eight were dismissed summarily for being wholly without merit (oftentimes without the respondent in the application concerned being called on to respond);4Foot Note 4×Court of Appeal Criminal Motions Nos 1, 2, 4, 6, 9, 11, 12 and 14 of 2015.one was withdrawn;5Foot Note 5×CM 23/2015.one has yet to be heard;6Foot Note 6×Court of Appeal Criminal Motion No 20 of 2015.while the last (the Present Application, which was also the last criminal motion of this nature filed in this court in 2015), we reserved to consider more carefully. This figure does not include the innumerable criminal motions filed in the High Court, some of which, we have no doubt, also sought to have the High Court reopen its previous decisions in concluded Magistrate’s Appeals, there being no avenue for a further appeal against a decision made by the High Court in the exercise of its appellate criminal jurisdiction. 9 We do not think the present state of affairs conduces to justice. As Jackson J candidly remarked inBrown v Allen344 US 443 (1953) at 537, “[i]t must prejudice the occasional meritorious application to be buried in a flood of worthless ones”. We are still paradigmatically a one-appeal jurisdiction. The filing of unmeritorious applications to reopen concluded criminal appeals takes up valuable resources whichcan and shouldgo towards the disposal of cases which are coming up on appeal for the first time. For this reason, we propose to lay down some guidelines to explain when, and in what circumstances, this court should reopen a concluded criminal appeal. First, we will examine the way in which this issue has developed in our jurisprudence. Second, we will consider the position in other jurisdictions in search of guiding principles which may be used to develop a coherent system in Singapore. Finally, we will gather up the threads of our analysis and distil certain guidelines for application in future cases.",
        "The development of the Court of Appeal’s power of review": "10 Prior to 2010, this court held, in a quartet of decisions, that once it had delivered its judgment in a criminal appeal, it wasfunctusofficioand had no jurisdiction to reopen the matter and reconsider its substantive merits: seeAbdullah bin ARahman v Public Prosecutor[1994] 2 SLR(R) 1017 (“Abdullah”),LimChoon Chye v Public Prosecutor[1994] 2 SLR(R) 1024,Jabarbin Kadermastan v Public Prosecutor[1995] 1 SLR(R) 326 andVigness/o Mourthi v Public Prosecutor[2003] 4 SLR(R) 518 (“Vignes”). These cases will be collectively referred to hereafter as “theVignesline of decisions”. The reason given was that once this court had heard and disposed of an appeal, its statutorily-conferred appellate jurisdiction ceased; and as a creature of statute, it did not, in the absence of specific statutory authorisation, have anyjurisdictionto reopen the case to entertain further arguments on the merits of the matter (seeVignesat [4]). We will refer to this line of argument as “thefunctusofficioargument”. The exception laid down inKoh Tony 11 InKohZhan Quan Tony v Public Prosecutor and another motion[2006] 2 SLR(R) 830 (“KohTony”), an important gloss was added to the above position. The applicants inKohTonywere charged with murder, but were convicted by the High Court of the lesser offence of robbery with hurt. Upon appeal by the Prosecution in Criminal Appeal No 2 of 2005 (“CCA 2/2005”), the Court of Appeal reversed the High Court’s decision, substituting the convictions for robbery with hurt with convictions for murder. The applicants then filed criminal motions arguing that the Court of Appeal did not have the jurisdiction to hear CCA 2/2005 because the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed) (we will hereafter refer to this Act and its legislative successors generically as “the SCJA”) only permitted the Prosecution to appeal against theacquittalof an accused, which, the applicants argued, was not the position in their case because they had in fact beenconvicted, albeit of a lesser offence. The Prosecution argued that the criminal motions should be dismissedinlimineon the basis that the Court of Appeal, having already disposed of the substantive merits of CCA 2/2005, wasfunctusofficioand therefore had no jurisdiction to consider the motions. 12 The Court of Appeal took the objection in two parts. First, it considered whether it had thejurisdiction– in the sense of “authority … to hear and determine a dispute that is brought before it” (seeMuhdMunir v Noor Hidah and other applications[1990] 2 SLR(R) 348 (“MuhdMunir”) at [19]) – to hear the criminal motions. The court held that it did. The gist of the criminal motions was whether the court had the jurisdiction to hear CCA 2/2005 in the first place. The court held that this was a matter which ought to have formed part of CCA 2/2005, and thus, “[the] court remains properly seised of the present case in so far as the question ofjurisdictionis concerned” [emphasis in original] (seeKohTonyat [23]). Second, the court considered whether it had thepower– in the sense of the “capacity to give effect to its determination by making or granting the orders or reliefs sought by the successful party” (seeMuhdMunirat [19]) – to determine the issue raised in the criminal motions. The court likewise held that it did because s 29A(4) of the SCJA gave it “full power to determine any question necessary to be determined for the purpose of doing justice in any case before the Court”, and there was no doubt that the question of whether the court even had the jurisdiction to hear CCA 2/2005 to begin with satisfied this criterion. 13 Having concluded that it had both the jurisdiction and the power to hear the criminal motions, the court then went on to say that even though the matters presented in the criminal motions “ought, ideally, to have been raised and considered during the hearing of [CCA 2/2005]” [emphasis in original omitted] (seeKohTonyat [19]), two factors weighed in favour of hearing the criminal motions. The first was the importance of the legal issue raised, which, the court observed, was one that “would have a potentially significant impact on future cases” [emphasis in original] (see likewiseKohTonyat [19]); the second was the gravity of the matter,viz, “[it was] acriminalappeal involving a final appellate court where life and liberty are at stake” [emphasis in original] (at [24]). However, the court clarified that its decision was “confined to theprecise questionof whether the court has the jurisdiction and power to consider if the earlier court had thejurisdictionto entertain [CCA 2/2005]” [emphasis in original] (at [29]). The court also clarified that it remainedfunctusofficioas far as the substantive merits of CCA 2/2005 were concerned as it had “already heard and ruled on the issues associated therewith” (at [22]). 14 Even though the Court of Appeal inKohTonytook pains to maintain fidelity with theVignesline of decisions, it also ameliorated the strictness of that line of authorities. The position afterKohTonywas that if an application to reopen a concluded criminal appeal was premised on a challenge to the Court of Appeal’s jurisdiction to hear the appeal in the first place, the courtwouldstill be seised of jurisdiction to hear the matter even though it had already ruled on the merits of the appeal. Although the position taken by this court inKohTonywas framed as a narrow exception to theVignesline of decisions, it was in effect a significant departure. Prior toKohTony, the position had been that the Court of Appeal’s jurisdiction wascompletelyexhausted by the disposal of the criminal appeal before it, and thus, the court did not haveanyresidual jurisdiction to entertainanyfurther applications in relation to the matter, be it a further appeal, an application to adduce further evidence, an application for a review or otherwise. That was no longer the case afterKohTony. The decision inYong Vui Kong (Jurisdiction) 15 It did not take long for the inroads made byKohTonyto flower. InYongVui Kong v Public Prosecutor[2010] 2 SLR 192 (“YongVui Kong (Jurisdiction)”), the applicant had earlier been convicted of trafficking in a quantity of drugs that attracted the death penalty. He had filed a notice of appeal, but had subsequently elected to withdraw his appeal. Sometime later, he filed a criminal motion petitioning the Court of Appeal to treat his previous withdrawal of his appeal as a nullity and to restore his appeal for hearing. The Prosecution argued that the Court of Appeal had no jurisdiction to hear the criminal motion because the applicant’s appeal, once withdrawn, was deemed to have been dismissed on its merits, and thus, the court wasfunctusofficioand could not hear any further appeal against the applicant’s conviction. 16 On the facts, the Court of Appeal held that the applicant had been labouring under a fundamental mistake when he withdrew his appeal. He had been under the impression then that he would have to lie to the court in order to pursue his appeal (which would have run counter to his settled religious convictions), but this was incorrect because it was open to him to challenge his conviction and sentence solely on legal grounds. Thus, the court held that the applicant’s withdrawal of his appeal was a nullity and allowed him to proceed with his appeal (at [28]). For present purposes, what is more important is that the court went on, in a lengthyobiter dictum, to express its view thateven ifthe substantive merits of the appeal had already been heard and decided, it might still have the jurisdiction to hear further arguments on those substantive merits. At [16], Chan Sek Keong CJ, who delivered the grounds of decision of the court, said: Another argument which this court should take into account (but which has never been addressed to the court), is that Art 93 of the Constitution [of the Republic of Singapore (1985 Rev Ed, 1999 Reprint)] vests the judicial power of Singapore in the Supreme Court.The judicial power is exercisable only where the court has jurisdiction, but where the SCJA does not expressly state when its jurisdiction in a criminal appeal ends, there is no reason for this court to circumscribe its own jurisdiction to render itself incapable of correcting a miscarriage of justice at any time.… [emphasis added] 17 The passage just quoted represented thequietusof thefunctusofficioargument. There is no question that jurisdiction (in the sense of authority) can only be conferred by statute (seeReNalpon Zero Geraldo Mario[2013] 3 SLR 258 at [14]–[20]). However, whenever a matter before the Court of Appeal concerns an appeal against a decision made by the High Court in the exercise of its original criminal jurisdiction, this court is already properly seised of jurisdiction pursuant to s 29A(2) of the SCJA. The only issue is whether this statutorily-conferred jurisdiction comes to an end once a decision is made on the substantive merits of the appeal. On this, the SCJA is silent. However, if one accepts the central premise inKohTony–viz,that the Court of Appeal’s jurisdiction in respect of a criminal appeal isnotexhausted by the rendering of a decision on the substantive merits (which is theantithesisof thefunctusofficioargument) – then the demise of thefunctusofficioargument is inevitable. 18 Even though it did not say so explicitly, the Court of Appeal inYongVui Kong (Jurisdiction)appeared to accept the premise ofKohTony. It was on this basis that the court held that the operative question was not whether itcouldreconsider its previous decision in a concluded criminal appeal (in the sense of whether it had thejurisdictionto do so), but whether itshould(in the sense of whether it should exercise itspowerto do so). At [14]–[15] ofYongVui Kong (Jurisdiction), the court said: 14 It is not uncommon in other jurisdictions, such as the United States, for new exculpatory evidence to be discovered,eg, DNA evidence which can show almost conclusively that the blood found at the scene of the crime or on the body of the deceased (in murder cases) was not that of the accused. There may be other types of evidence which could have the same effect,eg, new documentary evidence which was not discovered during the trial or the appeal. In such cases,it would be in the interest of justice that the court should have thepower to correct the mistake, rather than rely on the Executive to correct what is essentially an error in the judicial process. In our context,this court should consider or reconsider whether it has the power to review its own decisions which aredemonstrably found to be wrong.… 15… Suppose, in a case where the appellate court dismisses an appeal against conviction and the next day the appellant manages to discover some evidence or a line of authorities that show that he has been wrongly convicted, is the court to say that it isfunctusand, therefore, the appellant should look to the Executive for a pardon or a clemency?In circumstances where there issufficient material on which the court can say that there has been a miscarriage of justice, this court should be able to correct such mistakes. [emphasis added in italics and bold italics] 19 We thus see a gradual shift in the attitude of the Court of Appeal where reviews of its previous decisions in concluded criminal appeals are concerned. Whereas it once confined reviews to the specific question of whether it even had the requisite jurisdiction to hear the appeal to begin with, it now indicated (albeitobiter) that it was prepared to review themeritsof its earlier decision if it would be in the interests of justice to do so. The principle stated by Chan CJ inYongVui Kong (Jurisdiction)was that the Court of Appeal should engage in a review of the merits “where there is sufficient material on which the court can say that there has been a miscarriage of justice” (at [15]). Post-Yong Vui Kong (Jurisdiction)cases 20 After the decision inYongVui Kong (Jurisdiction), there were three instances where this court reconsidered the substantive merits of a concluded criminal appeal:RamalingamRavinthran v Attorney-General[2012] 2 SLR 49 (“Ramalingam”),YongVui Kong v Public Prosecutor[2012] 2 SLR 872 (“Yong Vui Kong (Prosecutorial Discretion)”) andQuekHock Lye v Public Prosecutor[2015] 2 SLR 563 (“QuekHock Lye”). These cases share three common features: (a) first, all these cases involved attempts by an accused person to reopen a criminal appeal which had been decided against him (seeRamalingamat [16],Yong Vui Kong (Prosecutorial Discretion) at [1(a)] andQuekHock Lyeat [22]); (b) second, allthree cases involved constitutional issues which had not been considered at the hearing of the appeal and which, depending on how they were resolved, could have an impact on the outcome of the appeal; and (c) third, all of them involved the imposition of a capital sentence. 21 InRamalingam, the applicant was convicted and sentenced in 2009 for trafficking in a quantity of drugs which attracted capital punishment, and his appeal was dismissed by the Court of Appeal in 2011. Thereafter, he filed a criminal motion in the Court of Appeal arguing that his right to equal treatment under Art 12(1) of the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint) (“the Constitution”) had been violated by the Attorney-General’s decision to prosecute a co-offender involved in the same criminal enterprise on a non-capital charge. On that basis, the applicant sought to set aside the sentence of death imposed on him and have it replaced with a non-capital sentence. The Prosecution argued that the Court of Appeal, having already delivered its judgment on the applicant’s appeal, wasfunctusofficioand no longer had the jurisdiction to hear his criminal motion. 22 The court disagreed, and in the process, made a number of observations about the juridical basis of its authority and power to reopen concluded criminal appeals. The court began by distinguishing between two distinct but related concepts. The first was the principle offunctusofficio, which, it stated, applied to thecourtand related to the exhaustion of the court’sjurisdiction(at [10]); the second was the principle of finality, which was a broader concept that applied to preventpartiesfrom re-litigating issuesthat had already been decided by the court (at [11]). The court went on to explain that in the criminal context, the line between the two was blurred. At [12]–[13], the court stated (perChan CJ): 12 InYongVui Kong (Jurisdiction), this court recognised that the principle offunctusofficio, as laid down in theVignesline of decisions, was based onthe policy considerations underlying the principle of finality.In the criminal context, thefunctusofficioprinciple is a self-limiting principleapplied by this court so as not to open the floodgates to frivolous and unmeritorious applications for previous criminal judgments to be reviewed.However, the relevant statutory provisions governing criminal appeals (previously Pt V of the [SCJA] and now Div 1 of Pt XX of the Criminal Procedure Code 2010 (Act 15 of 2010)) do not expressly state when the court isfunctusofficio. 13 In this light, it was observed inYongVui Kong (Jurisdiction)thatwherethis court,being the final appellate court in this jurisdiction, had made a mistake of fact or law which had caused a person to be convicted and punished,itmust have thepowerto correct its own mistakeso as to avoid a miscarriage of justice. … [emphasis added in italics, bold italics and underlining] 23 In the criminal context, the bar to reopening a concluded appeal is premised more on policy concerns over finality rather than on the ground of the Court of Appeal’s lack of jurisdiction. Thus, followingKohTonyandYongVui Kong (Jurisdiction), the question is one of whether the court’spowerto review a concluded criminal appeal should be exercised. On the facts ofRamalingam, the court decided to hear the applicant’s criminal motion because the substantive issue in contention –viz, the relationship between the prosecutorial discretion conferred on the Attorney-General under Art 35(8) of the Constitution and the right to equality before the law under Art 12(1) of the same – was one which “need[ed] to be examined in greater detail and clarified in the public interest” (at [17]). 24 In summary, the approach taken in Singapore thus far has been one of incremental development. At present, the position seems to be that this court has the inherent power to reopen a concluded criminal appeal to correct mistakes “in circumstances where there is sufficient material on which the court can say that there has been a miscarriage of justice” (seeYongVui Kong (Jurisdiction)at [15]). This power, which we will refer to as the power of “review” to distinguish it from both the usual appellate function of this court and the quite different revisionary jurisdiction which the High Court exercises over inferior tribunals, is one whose ambit has yet to be fully explored.",
        "The position in other jurisdictions": "25 We now turn to consider the position in some other jurisdictions. Before we proceed, we ought to point out that many jurisdictions have pursued a solution through legislation. For obvious reasons, some of the solutions which they have fashioned through legislative intervention are not available to this court. However, the principles which undergird their operation are. And it is to these principles that we turn in order to derive some guidance. England and Wales 26 Until recently, the position in England and Wales was that no appeal could be reopened once it had been decided on the merits, save for a limited exception which applied only to decisions of the House of Lords (see K R Handley,Spencer Bower and Handley: Res Judicata(LexisNexis, 4th Ed, 2009) at para 5.06). This rule also applied to criminal appeals, even where there was fresh evidence (seeRegina v Pinfold[1988] QB 462). In the criminal context, this absolute bar admitted of only two exceptions. The first was where the decision of the court was a nullity; the second was where there had been a defect in procedure which had occasioned injustice (seeRegina v Daniel[1977] 2 WLR 394 (“R v Daniel”)). 27 The law in England and Wales underwent a sea change with the decision of the English Court of Appeal inTaylor and another v Lawrence and another[2002] 3 WLR 640 (“Taylor”). The issue inTaylorwas whether an appeal should be reopened on the ground that there was new evidence which disclosed that the appellate court’s decision might have been tainted by apparent bias. Although the application to reopen the appeal in question was dismissed on its merits, the English Court of Appeal held, as a matter of law, that it had the power to reopen a concluded appeal “to avoid real injustice in exceptional circumstances” (at [54]). This power, the court explained, arose out of its character as a court of justice and was “necessary to achieve the dual objectives of an appellate court” (at [50]), which were, first, to ensure justice between the litigants and, second, to ensure public confidence in the administration of justice by remedying wrong decisions as well as by clarifying and developing the law and setting precedents (at [26]). 28 The ruling inTaylorwas soon codified by the introduction of r 52.17 of the Civil Procedure Rules 1998 (SI 1998 No 3132) (UK) (“the English CPR”), which provided that the English Court of Appeal and the English High Court had the power to reopen a final determination of an appeal where the following threecumulativeconditions were met (see r 52.17(1)): (a) it was necessary to do so in order to avoid real injustice; (b) the circumstances were exceptional and made it appropriate to reopen the appeal; and (c) there was no alternative effective remedy. 29 In the later case ofIn reUddin (A Child)[2005] 1 WLR 2398 (“Uddin”), the central question related to the circumstances in which it could be said that the facts were so “exceptional” that recourse to r 52.17 of the English CPR was appropriate. InUddin, the English High Court had earlier held that a mother had attempted to cause serious injury to her child. The mother applied to the English Court of Appeal for leave to appeal against the English High Court’s decision, but was unsuccessful. A few months later, the mother applied to the English Court of Appeal to reopen her application for leave to appeal on the ground that there was new evidence that cast doubt on the expert evidence upon which the English High Court’s decision had been based. 30 The English Court of Appeal dismissed the mother’s application to reopen her earlier leave application. Dame Elizabeth Butler-Sloss P, delivering the judgment of the court, started by considering the threshold that had to be met before a concluded “appeal” (which is defined in r 52.17(2) of the English CPR as including an application for leave to appeal) would be reopened –ie, “how exceptional is exceptional?” (seeUddinat [16]). In her view, the case had to be one “where it is demonstrated that the integrity of the earlier litigation process, whether at trial or at the first appeal, has been critically undermined” (at [18]). The reason for this, she explained, was that a court exercising its jurisdiction under r 52.17 was not “solely concerned with the case where the earlier process has or may have produced a wrong result [that being the domain of an appeal] … but rather, at least primarily, with special circumstances where the process itself has been corrupted” (at [18]). According to Dame Elizabeth, it was this “corruptionof justice” [emphasis in original] (at [18]) that, as a matter of policy, was “most likely to validate an exceptional recourse; a recourse that relegates the high importance of finality in litigation to second place” and justified the reopening of a concluded appeal (at [18]). 31 It is important to note that Dame Elizabeth did not go so far as to say that the introduction of fresh evidence could in no circumstances justify the reopening of a concluded appeal in the absence of some other factor which had corrupted the litigation process. She held that while a case where the litigation process had been corrupted was “the paradigm case”, it was not necessarily theonlycase (at [20]). She explained that it might be possible for the discovery of fresh evidence to justify reopening a concluded appealif“the injustice that would be perpetrated if the appeal is not reopened [is] …so grave as to overbear the pressing claims of finality in litigation” [emphasis added] (at [21]). In this regard, it was not sufficient to show a “real possibility” that the previous decision was wrong; instead, the party seeking to reopen the appeal had to go further to show that there was a “powerful probability” that an erroneous resulthadin factbeen arrived at (at [22]). In closing, Dame Elizabeth succinctly summarised the position in the following manner (at [22]): … That test [of whether the earlier litigation process has been critically undermined] will generally be met where the process has been corrupted. Itmay be metwhere it is shown that a wrong resultwasearlier arrived at. Itwill not be metwhere it is shownonlythat a wrong resultmayhave been arrived at. [emphasis added in italics and bold italics] 32 In the recent case ofRegina vYasain[2015] 3 WLR 1571 (“Yasain”), the Criminal Division of the English Court of Appeal had occasion to consider whether it likewise had the power to reopen a concluded criminal appeal. We will return to the facts of the case at a later stage (see [72] below), but the point to be made for now is that the court held (at [38] ofYasain) that althoughTaylorwas a civil case, the principles articulated therein were also relevant in the criminal context, and the Criminal Division of the English Court of Appeal likewise had the power to reopen a concluded criminal appeal. However, the court observed that this power would not be exercised in the same way in the criminal context because of the differences between civil and criminal cases, and opined that it would be best if a separate set of rules similar to those in r 52.17 of the English CPR could be formulated for criminal cases (at [40]). On the facts, the court held, applyingTaylor, that the case before it was one where the appeal in question ought to be reopened. 33 Before we leave the English position, we should say a few words about the Criminal Cases Review Commission (“the CCRC”). The CCRC was set up in the wake of the public outcry over the conviction (and later exoneration) of the so-called “Birmingham Six” (see David Kyle, “Correcting Miscarriages of Justice: The Role of the Criminal Cases Review Commission” (2004) 52 Drake L Rev 657 at pp 660–662). It is an independent body which, although not itself able to quash convictions or reduce sentences (that remains the exclusive preserve of the courts), is nevertheless able to refer cases to the English Court of Appeal to be reheard in appropriate cases. Section 13(1) of the Criminal Appeal Act 1995 (c 35) (UK) provides that a reference is not to be made unless: (a) the CCRC considers that “there is a real possibility that the [decision in question] would not be upheld were the reference to be made” (see s 13(1)(a));and (b) the CCRC takes this view because of,inter alia, “an argument, or evidence, not raised in the proceedings which led to [the decision] or on any appeal or application for leave to appeal against it” (see s 13(1)(b)(i));and (c) all avenues of appeal have already been exhausted, be it by the determination of an appeal or by the refusal of leave to appeal (see s 13(1)(c)). In our view, this is very much in keeping with theraison d’êtreof the CCRC – it is intended only as a line of last defence to detect cases which would otherwise slip through the cracks. Hong Kong 34 Until recently, the position in Hong Kong mirrored that which existed in England and Wales beforeTaylor. After the order of an appellate court in a criminal appeal (be it an order allowing the appeal or one dismissing it) had been perfected, the court could only reopen its decision and recall or vary its order if the order was a nullity or if there was a procedural error which had occasioned an injustice (seeSecretary for Justice vMak Wai Hon[2000] 1 HKC 498). However, inHKSAR v Tin’s Label Factory Ltd[2008] HKCU 1899, the Hong Kong Court of Final Appeal reviewed the developments that had taken place in England post-Taylorand remarked,obiter, that the approach adopted there “merits serious adoption in Hong Kong”, although it also cautioned that “the residual discretion is a wholly exceptional jurisdiction and the occasions when it may properly be invoked would be extremely rare” (at [56]). 35 InBrian AlfredHall v HKSAR[2014] 4 HKC 500 (“Hall”), the Hong Kong Court of Final Appeal had to consider whether it had the power to reopen an appeal that had been allowed due to fraud on the part of the accused. The accused had earlier been convicted of common assault of prison officers after a trial in the Magistrates’ Court, and had been sentenced to six months’ imprisonment. On appeal, he adduced statements of certain prison officers which differed materially from the prosecution witnesses’ statements and their testimony at the trial. Upon production of those statements, the Prosecution conceded the appeal and the accused’s common assault conviction was quashed. Subsequently, it turned out that those statements had been forged on the accused’s instructions. The accused was then separately charged with four counts of perverting the course of justice, and sentenced to a total of six years and nine months’ imprisonment. Thereafter, the Prosecution applied to the Hong Kong Court of Final Appeal to reopen the appeal in respect of the accused’s common assault conviction with a view towards reinstating his conviction and sentence. 36 The Hong Kong Court of Final Appeal said at [11]: … [I]t is clear that the court has an implied power exceptionally to order an appeal to be re-opened where justice so demands, such power being reasonably required for the effective exercise of the judicial power granted by the Basic Law. The court emphasised that in deciding whether to exercise its power to reopen an appeal, it had to “take all relevant considerations into account” (at [12]). In particular, it was “necessary first to considerwhat purpose would be served by reopening the appeal” [emphasis added] (likewise at [12]). Given the already substantial sentence imposed on the accused for perverting the course of justice, the Hong Kong Court of Final Appeal held that reopening the appeal in respect of his common assault conviction would only have symbolic value, and that the judicial and public resources which would have to be spent were the appeal to be reopened would be wholly disproportionate to the object to be achieved. In the circumstances, the court declined to exercise its power to reopen the appeal. Australia 37 In Australia, the approach is bifurcated. It has long been held that intermediate appellate courts (pertinently, for present purposes, the Courts of Criminal Appeal of the various Australian States) are unable to reopen a concluded appeal (seeBurrell vR(2008) 248 ALR 428 (“Burrell”) at [22]). By contrast, where the High Court of Australia is concerned, it is now well established that it has the power “as the final national court of appeal, in exceptional circumstances, to repair its own mistakes and oversights that would otherwise occasion a serious and irremediable injustice, despite the fact that its orders have been formalised” (seeBurrellat [105]). Given that only one tier of appeal is available in respect of criminal cases in Singapore, the distinction between intermediate and final appellate courts is not relevant, and we do not propose to dwell on it. 38 Although, as we have just mentioned, an intermediate appellate court in Australia has no power to reopen a concluded appeal, a further appeal against the court’s decision may lie if the High Court of Australia grants special leave for an appeal to be brought. That said, the High Court of Australia rarely grants such leave, and thus, the final avenue for review in a criminal matter usually lies in a petition for mercy (seeR v GAM (No2)[2004] VSCA 117 at [11]). Legislative developments in some Australian States have, however, introduced a new dimension to the legal landscape. In 2013, the State of South Australia passed the Statutes Amendment (Appeals) Act 2013 (No 9 of 2013) (SA) to insert a new s 353A into its Criminal Law Consolidation Act 1935 (SA) so as to provide accused persons with an opportunity for a “second or subsequent appeal” in limited circumstances. The relevant provisions of the new s 353A read: (1) The Full Court [of the Supreme Court of South Australia] may hear a second or subsequent appeal against conviction by a person convicted on information if the Court is satisfied that there isfresh and compelling evidencethat should, in the interests of justice, be considered on an appeal. (2) A convicted person may only appeal under this section with the permission of the Full Court. (3) The Full Courtmay allow an appeal under this section if it thinks that there was a substantial miscarriage of justice. … [emphasis added] 39 Of particular interest are the definitions of “fresh” and “compelling” evidence in s 353A(6). In order to be “fresh”, the evidence in question must not have been adduced at the trial, and must be something which “could not, even with the exercise of reasonable diligence, have been adduced at the trial” (see s 353A(6)(a)). And in order to be “compelling”, the evidence concerned has to be “reliable”, “substantial” and “highly probative in the context of the issues in dispute at the trial of the offence” (see s 353A(6)(b)). In 2015, Tasmania passed the Criminal Code Amendment (Second or Subsequent Appeal for Fresh and Compelling Evidence) Act 2015 (No 41 of 2015) (Tas). Section 9 of that Act, which is modelled after the South Australian statute, likewise permits a second appeal to be brought (with leave) only if there is “fresh and compelling” evidence. Malaysia 40 In Malaysia, inDato’ See Teow Chuan & Ors and others v Ooi Woon Chee and others and other applications[2013] 4 MLJ 351, Arifin Zakaria CJ, delivering the unanimous judgment of the Federal Court of Malaysia, stated definitively that the Federal Court had the inherent power to review any matter already decided by the court where it was necessary “to do justice and to prevent an abuse of process” (at [10]). The court clarified that “[t]his power springs not from legislation but from the nature and constitution of the court as a dispenser of justice … [and] can only be taken away by express provision in any written law” (likewise at [10]). The court cautioned, however, that this power was to be exercised only in “special and exceptional” circumstances and could not be used as an avenue for a further appeal (at [15]). 41 Earlier, inAseanSecurityPaper MillsSdn Bhd v Mitsui Sumitomo Insurance (Malaysia) Bhd[2008] 6 CLJ 1 (“AseanSecurity Paper Mills”), Abdul Hamid Mohamad CJ explained the difference between an application for a review and an appeal in the following way (at [4]): In an application for a review by this court of its own decision, the court must be satisfied that it is a case that falls within the limited grounds and very exceptional circumstance in which a review may be made. Only if it does, that the court reviews its own earlier judgment.Under no circumstances should the court position itself as if it were hearing an appeal and decide the case as such. In other words, it is not for the court to consider whether this court had or had not made a correct decision on the facts.That is a matter of opinion. Even on the issue of law, it is not for this court to determine whether this court had earlier, in the same case, interpreted or applied the law correctly or not. That too is a matter of opinion. An occasion that I can think of where this court may review its own judgment in the same case on [a] question of law is where the court had applied a statutory provision that has been repealed.I do not think that review power should be exercised even where the earlier panel had followed certain judgments and not the others or had overlooked the others.Not even where the earlier panel had disagreed with the court’s earlier judgments.If a party is dissatisfied with a judgment of this courtthat does not follow the court’s own earlier judgments, the matter may be taken up in another appeal in a similar case. That is what is usually called “revisiting”. Certainly, it should not be taken up in the same case by way of a review.That had been the practice of this court all these years and it should remain so. Otherwise, there will be no end to litigation. A review may lead to another review and a further review. … [emphasis added] 42 Abdul Hamid Mohamad CJ then went on to give five non-exhaustive instances in which the Malaysian Federal Court’s power of review might be exercised. These included circumstances where the court was inquorate, where the applicant had been denied the right to be heard, where the decision had been procured by fraud, where the court had applied a law which had since been repealed, or where bias had been established (seeAseanSecurity Paper Millsat [7]–[11]). These examples were endorsed by Zaki Tun Azmi PCA, who delivered the other reasoned judgment in that case. On the facts, the Malaysian Federal Court dismissed the application for review because it fell outside the limited scope of the court’s review jurisdiction. Summary of the position in other jurisdictions 43 Gathering up the threads of the foregoing analysis, several propositions can be distilled: (a) First, a final appellate court has the inherent power, by virtue of its character as a court of justice, to correct its own mistakes in order to prevent miscarriages of justice or, to use a cognate expression favoured in England, “real injustice”. (b) Second, this power of review is to be exercised sparingly, and only in circumstances which can be described as “exceptional” and which therefore override the imperative of finality. (c) Third, a review by a final appellate court is distinct from and should not be confused with an appeal. In conducting a review, the court is primarily concerned not with the correctness of the decision under review, but with whether there has been a miscarriage of justice. These concepts are not the same. The paradigm case of a miscarriage of justice is where there has been a breach of natural justice. (d) Fourth, the substratum of an application for review should be new material that was not previously canvassed in the proceedings leading to the decision under challenge. The material in question must demonstrate a “powerful probability” that there has been a miscarriage of justice which warrants invoking the court’s review jurisdiction. (e) Finally, this power of review is available in both civil and criminal cases, although the rules governing its exercise might differ depending on the context.",
        "A restatement of the Court of Appeal’s inherent power of review": "44 Having reflected on the various tests which a final appellate court may adopt to decide whether it should review a case which has already exhausted the appeal process, we are satisfied that for a criminal matter, the general test enunciated by this court inYongVui Kong (Jurisdiction)at [15] –viz, that there must be “sufficient material on which the court can say that there has been a miscarriage of justice” – should be the touchstone where this court is concerned. In our view, this test captures pithily the essence of the five principles which we have distilled from the foreign cases and set out in the preceding paragraph. Analytically, we see this test as comprising two essential components: (a) The first is the evidential requirement of “sufficient material”. The court must be satisfied that the material adduced in support of the application for review is both “new” and “compelling” before it will consider the application. If the material presented does not satisfy these two indicia, then the application failsinlimineand the inquiry stops there. The burden of production rests on the applicant. (b) The second is the substantive requirement that a “miscarriage of justice” must have been occasioned. This is the threshold which must be crossed before the court will consider that a concluded criminal appeal ought to be reopened. The burden of proving this likewise rests on the applicant. 45 We will examine each of these two components in detail below. But, before we do that, we think it important to identify and understand the policy tensions which operate in this area of the law. Truth, finality and justice 46 The importance of truth in the criminal process is so axiomatic that it almost does not need to be stated. There is “searing injustice and consequential social injury … when the law turns upon itself and convicts an innocent person” (seeVan Der Meerand Others v R(1998) 82 ALR 10 at 31perDeane J). For this reason, criminal law accords primacy to the determination of the truth. But, the reality, and we do not shy away from admitting this, is that all human institutions are fallible, and any finding made by any court on a contested fact may be imperfect and may not necessarily arrive at the truth (seeLee Chez Kee v Public Prosecutor[2008] 3 SLR(R) 447 at [124]). 47 That said, this does not mean that society should stand paralysed with indecision, or that every legal finding must be open to continual challenge because of perpetual anxiety over the possibility of an error. The perfect, as they say, cannot be allowed to be the enemy of the good. Finality is also a function of justice. It would be impossible to have a functioning legal system if all legal decisions were open to constant and unceasing challenge, like so many tentative commas appended to the end of an unending sentence. Indeed, in the criminal context, challenges to legal decisions are very likely (and are also likely to be continuous and even interminable), given the inherently severe nature of criminal sanctions and the concomitant desire on the part of accused persons to avoid them as far as they can. The concern here is not just with the saving of valuable judicial resources (vital though that is), but also with the integrity of the judicial process itself. Nothing can be as corrosive of general confidence in the criminal process as an entrenched culture of self-doubt engendered by abusive and repetitive attempts to re-litigate matters which have already been decided. 48 The tension between truth and finality is a perennial one, and the key, as in so many other things, is balance. We cannot incline so much in favour of one that we neglect the other. As Kirby J observed inBurrellat [72], “we can love truth, like all other good things, unwisely; pursue it too keenly; and be willing to pay for it too high a price, so we can also love finality too much”. Truth and finality are both vital, and their competing demands must be held in balance. InTheAmpthill Peerage[1976] 2 WLR 777, Lord Wilberforce put it in these terms (at 786H–787B): … Any determination of disputable fact may, the law recognises, be imperfect: the law aims at providing the best and safest solution compatible with human fallibility and having reached that solution it closes the book. The law knows, and we all know, that sometimes fresh material may be found, which perhaps might lead to a different result, but, in the interest of peace, certainty and security it prevents further enquiry. It is said that in doing this, the law is preferring justice to truth. That may be so: these values cannot always coincide. The law does its best to reduce the gap. But there are cases where the certainty of justice prevails over the possibility of truth … and these are cases where the law insists on finality. For a policy of closure to be compatible with justice, it must be attended with safeguards … 49 The question for us in the present context is whether we have struck the right balance between the prevention of error (which demands some degree of corrigibility) and the according of proper respect to the principle of finality (which necessitates a policy of closure). It is axiomatic that this balance will have to be struck differently at different stages of the criminal process. As we venture further along the criminal process, we must give greater presumptive weight to the veracity of the findings already made and accord greater prominence to the principle of finality. An appeal is an avenue for error correction. For this reason, in an appeal, the decision of the trial court must be examined for error, but due deference must be accorded to that court’s findings, and new evidence cannot be admitted, save in limited circumstances. A review is an avenue for the correction of miscarriages of justice. Thus, it is only in exceptional cases that a matter will be reopened on its merits, and the instances in which the Court of Appeal’s inherent power of review will be exercised must be few and far between. 50 In our judgment, the principle of finality is no less important in cases involving the death penalty. There is no question that as a modality of punishment, capital punishment is different because of its irreversibility. For this reason, capital cases deserve the most anxious and searching scrutiny. This is also reflected in our laws. Division 1A of Part XX of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”) provides that a sentence of death imposed by the High Court has to be reviewed by the Court of Appeal even where no formal appeal has been filed, and the court must be satisfied of the correctness, legality and propriety of both the accused person’s conviction and his sentence before the sentence is carried into effect. But, once the processes of appeal and/or review have run their course, the legal process must recede into the background, and attention must then shift from the legal contest to the search for repose. We do not think it benefits anyone – not accused persons, not their families nor society at large – for there to be an endless inquiry into the same facts and the same law with the same raised hopes and dashed expectations that accompany each such fruitless endeavour. 51 Against this background of competing considerations, we now turn to the first component of the test set out at [44] above for determining when it is appropriate for this court to exercise its inherent power of review –viz, the evidential requirement of “sufficient material”. The evidential requirement of “sufficient material” 52 When may it be said that there is “sufficient material” (which, in this context, encompassesbothnew factual evidence as well as new legal arguments) to warrant the Court of Appeal exercising its inherent power of review? In our judgment, for the material tendered in support of an application for review to be “sufficient”, it must satisfy two cumulative conditions: (a) it must be “new”; and (b) it must be “compelling”. Collectively, these conditions form a fine mesh filter that sieves out unmeritorious applications for review while allowing justice to be done in deserving cases. We will examine each condition in turn below. (1) The material must be “new” 53 “New” material is that which: (a) has hitherto not been considered at any stage of the proceedings leading to the decision under challenge; and (b) could not, even with reasonable diligence, have been adduced in court prior to the filing of the application for review. In adopting this position, we align ourselves with the approach taken in South Australia, where the presence of “fresh” evidence is a jurisdictional precondition that must be satisfied before “a second or subsequent appeal” may be brought (see [39] above and alsoR v Keogh (No2)[2014] SASCFC 136 at [98]). The difference is that in our context, we accept that newlegal argumentscan – if they satisfy the twofold criteria stated at the outset of this paragraph (viz, of not having been considered at an earlier stage of the proceedingsandof being material which could not, even with reasonable diligence, have been presented to the court before the filing of the application for review) – form the basis for an application for review. 54 The first limb of the requirement of “new” material –viz, that the material must be something which has previously not been considered – is a corollary of the fact that a review is neither an appeal nor a rehearing. As has been emphasised in many of the cases cited above, the purpose of a review is to correct a miscarriage of justice, and not to allow the applicant a second chance to rehash the same issues in the hope of achieving a different outcome. If the applicant is relying solely on evidence and/or legal arguments that have already been put forward (in the hope that the court will change its mind at the second time of asking), then the application for review, without more, cannot succeed. In order to justify this court’s exercise of its inherent power of review, the material tendered in support of the application must be genuinely novel – it will not suffice if that material is merely old wine in new wineskins. The applicant cannot merely seek to put a new spin on old evidence which has already been considered by the court or take a new position on material which has already been analysed by the court. 55 The second limb of the requirement of “new” material –viz, that the material must be something which could not, even with reasonable diligence, have been obtained for use prior to the filing of the application for review – is familiar to us as theLadd v Marshall[1954] 1 WLR 1489 requirement of “non-availability”. There are two reasons for this. First, it seems to us that if an accused has of his own volition not called evidence which was available to him and which, bearing in mind his circumstances as an accused (including the fact that he might have been in remand), he could reasonably have been expected to obtain and adduce in court, then there cannot be any basis for saying that there has been a miscarriage of justice. The accused must accept the consequences of his decision as to the calling and treatment of evidence (seeRattenv The Queen(1974) 131 CLR 510 at 517–518perBarwick CJ). Second, it is in the wider public interest that there be an efficient and economical allocation of court resources. Parties who come before the court (and this includes accused persons) must present all their evidence at the time of the hearing in order that it may be properly weighed and evaluated, instead of introducing their evidence in a piecemeal and haphazard fashion. 56 At this point, a comparison with applications to admit additional evidence in criminalappealsis instructive. InSohMeiyun v Public Prosecutor[2014] 3 SLR 299 (“SohMeiyun”), the High Court favoured a less restrictive approach towards the admission of further evidence in criminal appeals. It stated that an appellate court exercising criminal jurisdiction “should generally hold that additional evidence which is favourable to the accused person and which fulfils theLadd v Marshallconditions of relevant and reliability is ‘necessary’ and admit such evidence on appeal” (at [16]). 57 There is, however, a crucial difference between the scenario inSohMeiyunand that in the Present Application – namely, the former concerned anappealagainst afirst-instancedecision, whereas the Present Application (and other similar applications for review) is apost-appealapplication. The wastage of judicial resources that would accompany the reopening of a case which has already been decided on its merits (which the requirement of non-availability is designed to prevent) is therefore concomitantly greater. For this reason, we are of the view that greater stringency is warranted in an application for a review of a concluded criminal appeal, and the requirement of non-availability must be strictly adhered to in respect of such an application. 58 We appreciate that this means that it will be rare for this court to entertain an application for review which is premised on new legal arguments alone because it will normally be difficult for the applicant in such a case to show that the legal arguments in question could not, even with reasonable diligence, have been raised prior to the filing of the application for a review. It seems to us that in respect of new legal arguments, the criterion of “non-availability” will ordinarily be satisfied only if the legal arguments concerned are made following a change in the law (for examples of “change in the law” cases, seeRegina v Cottrell and another appeal[2007] 1 WLR 3262 at [42]–[46] andRegina vJogee and another appeal[2016] 2 WLR 681). We also observe that this is the position taken in civil proceedings in relation to the so-called “Arnoldexception” to issue estoppel (seeArnold v National Westminster Bankplc[1991] 2 AC 93 (“Arnold”)). InArnold, Lord Keith of Kinkel held that there should be an exception to issue estoppel “in the special circumstance that there has become available to a party further material relevant to the correct determination of a point involved in the earlier proceedings”, provided that the further material in question “could not by reasonable diligence have been adduced in those [earlier] proceedings” (at 109B). As we emphasised inTT Internationalat [189] and [190(c)], the “further material” in question must be material which shows that “the error in the court’s decision stemmed from some point of fact or law relevant to the decision [which] was not taken or argued before the court which made that decisionandcould not reasonably have been taken or argued on that occasion” [emphasis in original]. InArnold, the “further material” consisted of subsequent judicial decisions which, Lord Keith held, could “not inappositely be described as a change in the law” (seeArnoldat 109C). (2) The material must be “compelling” 59 “Compelling” material is that which is reliable, substantial and powerfully probative; it must be capable of showing almost conclusively that there has been a miscarriage of justice (see [31] and [39] above). The threshold is a high one. InYongVui Kong (Jurisdiction), Chan CJ gave the following examples of the kind of material which he considered might justify the exceptional recourse of a review (at [14]): It is not uncommon in other jurisdictions, such as the United States, fornew exculpatory evidenceto be discovered,eg,DNA evidencewhich can show almost conclusivelythat the blood found at the scene of the crime or on the body of the deceased (in murder cases) was not that of the accused.Theremay be other types of evidence which could have the sameeffect,eg,new documentary evidencewhich was not discovered during the trial or the appeal.… [emphasis added in italics and bold italics] 60 There are two dimensions to the requirement that the material in question must be “compelling”. First, the material must be “reliable” in the sense that it possesses a high degree of cogency, and is credible and trustworthy in respect of the matters to which it pertains. It is notable that all the examples given by Chan CJ inYongVui Kong (Jurisdiction)at [14]–[15] related to material of anobjectivecharacter:eg, DNA evidence, documentary evidence or a new line of authorities. The reason for this is that objective evidence is quintessentially reliable since, in general, it may be independently verified and is based on facts which may be apprehended by analysis, measurement and observation. While we would not go so far as to dogmatically exclude all subjective evidence, we would imagine that such evidence would not ordinarily suffice to show “almost conclusively” that a miscarriage of justice has been occasioned. Thus, evidence from witnesses who have taken the stand, particularly that of co-accused persons who now seek to resile from their earlier testimony (see,eg,Abdullah),cannot in itself be considered “reliable” evidence unless it is substantiated by other objective evidence. 61 The second dimension of the requirement of “compelling” material is that the material in question must be “substantial” and “powerfully probative” in the sense that it is logically relevant to the precise issues which are in dispute. The mere fact that material is reliable does not necessarily mean that it is relevant. For example, the presence of a person’s DNA on an object is almost conclusive evidence of the fact that that person touched the object. However, that piece of information might be of little or no utility in determining whether that person committed the crime in question. This applies with even greater force to new lines of legal argument. The imposition of criminal punishment almost invariably involves the deprivation of life and liberty, and therefore, by definition, Art 9(1) of the Constitution, which provides that “[n]o person shall be deprived of his life or personal liberty save in accordance with law”, is tangentially involved in all criminal cases. But, it does not follow that Art 9(1) will be relevant in every criminal case. Much will depend on the precise issues which fall to be decided on the facts of the case. 62 At the end of the day, the inquiry into whether the material tendered in support of an application for review is “compelling” is directed towards the quality of the material presented as assessed against the precise issues in dispute. A useful summative question is whether, taken as a whole, the material is capable of showing “almost conclusively” that there has been a miscarriage of justice, and is therefore “compelling” enough to warrant the exercise of the Court of Appeal’s inherent power of review. This is a question of fact which calls for an exercise of judgment of the kind that judges are called on to perform on an almost daily basis. The substantive requirement of a “miscarriage of justice” 63 We turn now to the substantive requirement that a “miscarriage of justice” must have been occasioned (see [44(b)] above). The expression “miscarriage of justice” is one of those protean expressions that is incapable of an exhaustive and stipulative definition. At its core, it connotes that there must be a manifest error and/or an egregious violation of a principle of law or procedure which strikes at the very heart of the decision under challenge and robs it of its character as a reasoned judicial decision. Based on our survey of the cases, a miscarriage of justice is chiefly (but not exclusively) to be found in one of the following two situations: (a) The first is where a decision on conviction or sentence is “demonstrably wrong”. In this regard, it is not sufficient to show that there is a real possibility that the decision is wrong; instead, it must be shown that there is a powerful probability that it is wrong. Generally, this plea may be raised only by theaccusedand not by the Prosecution, save in an exceptional case where the Prosecution has uncovered material new evidence which it seeks to rely on to set aside an unsafe conviction or an excessive sentence premised on a fundamental misapprehension of the applicable law or facts. (b) The second situation is where there has been fraud or a breach of natural justice. This arises where, in the words of Dame Elizabeth inUddinat [18], there has been a “corruptionof justice” [emphasis in original], such that the integrity of the judicial proceedings itself has been impugned. An application for a review on this ground is available to both the Prosecution and the accused. We will discuss each of these situations in turn below. (1) Where the decision on conviction or sentence is “demonstrably wrong” 64 There is no doubt that the conviction of an innocent person is an injustice – perhapstheultimate substantive injustice, proof of which would justify reopening a concluded criminal appeal. However, as we have discussed at [46]–[48] above, absolute certitude is never available. This is so even in the case of DNA evidence, the utility of which is highly context-specific. The question, therefore, is: how certain does the court have to be that its previous decision (be it on conviction or sentence) is wrong before it decides to reopen a matter? InYongVui Kong (Jurisdiction)at [14], Chan CJ opined that an appropriate test was whether the decision in question was “demonstrably found to be wrong” [emphasis added]. 65 In our judgment, where the decision under challenge is a decision on conviction, it is not sufficient to show that there is a real possibility that the decision is wrong. Instead, it must be shown, based on the material tendered in support of the application for review alone and without the need for further inquiry, that there is a powerful probability that the decision concerned is wrong. There are two reasons for this rigorous standard. First, the higher standard properly distinguishes the function of an appeal, which is a means for the correction of error, from that of a review, which is about the protection of the integrity of the judicial process. This point was amply made inUddinandAseanSecurity Paper Mills. Second, it would better vindicate the importance of the principle of finality by allowing intervention only in truly exceptional cases. This approach accords due recognition to the fact that the decision under challenge has already undergone at least two rounds of separate and independent scrutiny – once by the court exercising original criminal jurisdiction and another by the Court of Appeal in its appellate capacity – and these courts’ findings must be given great presumptive weight. Such findings should only be displaced where they can be proved to be “demonstrably wrong”. 66 Where the decision under challenge is a decision on sentence, given that sentencing involves an exercise of discretion, it will be even more difficult for the applicant to demonstrate that the decision concerned is “demonstrably wrong”. It would not be sufficient for the applicant merely to allege that the sentence imposed is manifestly excessive, or that the court failed to appreciate the material before it, or even that the court relied on the wrong test or the wrong precedent. These are the standards for intervention applicable to an appeal (seePublic Prosecutor v MohammedLiton Mohammed Syeed Mallik[2008] 1 SLR(R) 601 (“MohammedLiton”) at [82]). In our judgment, in order for a decision on sentence to be considered “demonstrably wrong”, the applicant would have to show that: (a) the decision was based on somefundamental misapprehensionof the law or the facts, thereby resulting in a decision that can, without exaggeration, be described as blatantly wrong; and (b) the error must be plain on the face of the record. We venture to think that instances of this nature will be exceedingly rare. It may occur, for example, where the court imposed a sentence in excess of its sentencing jurisdiction (see,eg,Public Prosecutor v Louis Pius Gilbert[2003] 3 SLR(R) 418), where it failed to impose the statutorily-prescribed punishment (see,eg,Public Prosecutor v Loo Kun Long[2003] 1 SLR(R) 28) or, conversely, where it imposed a sentence above the statutorily-prescribed maximum (see,eg,ChiawWai Onn v Public Prosecutor[1997] 2 SLR(R) 233). 67 An application for a review on the ground that a decision, whether on conviction or sentence, is “demonstrably wrong” is usually available only to the accused and not to the Prosecution (see [63(a)] above). This is because when the State prosecutes a criminal matter, it wields an awesome power. Therefore, it has concomitant interests and duties which are not simply those borne by an ordinary litigant (seeTT Internationalat [128]). One corollary of this is that once a person has been acquitted of an offence, the doctrine ofautrefois acquitprevents him from being tried again for the same offence (see Art 11(2) of the Constitution). The purpose of this doctrine is to protect individuals from oppression, and to allow accused persons who have had their cases disposed of to move on with their lives without fear that they will once again be subject to the machinery of criminal justice in respect of the same offence (seeRegina vHumphrys[1976] 2 WLR 857 at 877BperLord Hailsham of St Marylebone). In our judgment, this principle is equally applicable to an application for a review even though, strictly speaking, no “retrial” might be involved. Thus, even if the Prosecution is of the view that an acquittal is unjustified or that a sentence, being based on a fundamental misapprehension of the law or the facts, is unjustifiably lenient, it would still be absolutely precluded from applying for a review of the decision. 68 Conversely, however, if the Prosecution elects to bring an application for a review in theaccused’s favour(eg, to set aside an unsafe conviction or an excessive sentence premised on a fundamental misapprehension of the applicable law or facts), then it would not be precluded from doing so. As the High Court observed (albeit in a slightly different context) inPublic Prosecutor v LimChoon Teck[2015] 5 SLR 1395, the Public Prosecutor has a crucial role to play in the fair and impartial administration of criminal justice. To this end, it should be able to correct egregious errors in the judicial process by bringing the appropriate applications for review where necessary. (2) Where there has been fraud or a breach of natural justice 69 Where the decision under challenge has been tainted by fraud or a breach of natural justice which has an adverse effect on the accused, that alone – even in the absence of proof that the decision is “demonstrably wrong” – would usually suffice to establish that a miscarriage of justice has been occasioned. This was the position in England even pre-Taylor(see [26] above), and it is also the position taken in all the jurisdictions which we surveyed. We give three illustrative examples below: (a) InR v Daniel, the applicant pleaded guilty to burglary and was sentenced to 18 months’ imprisonment. Before a sole judge, he sought leave to appeal against his sentence out of time, but was unsuccessful. He then renewed his application for leave to appeal, this time before the Full Court, and engaged counsel for this purpose. However, due to an administrative oversight, his counsel were not informed of the hearing, and the English Court of Appeal heard and dismissed his leave application in the absence of counsel. When this oversight was discovered, counsel sought to have the application re-listed for hearing. However, the English Court of Appeal, holding itself to befunctusofficio, dismissed the application. The Secretary of State then intervened and referred the matter back to the English Court of Appeal for a rehearing pursuant to the powers given to him under s 17 of the Criminal Appeal Act 1968 (c 19) (UK). At the restored hearing of the application for leave to appeal, the court acknowledged that it had initially actedperincuriamin holding that it had no jurisdiction to rehear the matter, but stressed that even in such a case, a matter would be re-listed for hearing only if it could be shown that there was a likelihood of injustice. (b) InRamanathana/l Chelliah v Public Prosecutor[2009] 6 MLJ 215, the applicant was convicted by the trial court of two counts of outraging the modesty of the victim. His conviction was later quashed by the Malaysian High Court on two grounds: excessive delay on the part of the trial court in rendering written reasons, and an error of law on the applicable standard of proof. The Prosecution appealed to the Malaysian Court of Appeal and only those two points were argued. The court agreed with the Prosecution and, without first giving the applicant an opportunity to resist the appeal, reinstated the conviction. On an application for a review, a differently-constituted Malaysian Court of Appeal held that the applicant’s right to a fair hearing had been violated and ordered that the appeal be reheard. (c) InRegina v Bow Street Metropolitan Stipendiary Magistrate and Others, ex parte PinochetUgarte (No 2)[1999] 2 WLR 272, the House of Lords set aside one of its own decisions on the ground of apparent bias. The applicant, a former head of state, had been arrested pursuant to international warrants which alleged the commission of various crimes against humanity. When the matter came before the House of Lords for the first time, the validity of the international arrest warrants was upheld despite the argument that the applicant enjoyed sovereign immunity. Subsequently, it transpired that one of the law lords in the panel had links with a party involved in the proceedings. That factor alone – even in the absence of anyindication of actual bias – was held to be a sufficient basis for a rehearing to be ordered. 70 An application for a review on the ground of fraud or breach of natural justice is available toboththe Prosecution and the accused (see [63(b)] above) because of the wider public interest considerations involved. Where a decision in an individual criminal case is wrong, the impact on the public interest is comparatively limited. Consequently, the public interest in the reopening of the case (even where the decision might arguably be “demonstrably wrong”) is outweighed by the policy considerations in favour of finality in litigation, as well as the compelling interest in protecting an accused person from double-prosecution. However, where considerations of fraud or natural justice are involved, public confidence in the integrity of the very criminal justice process itself is at stake, and this suffices to outweigh the considerations of finality and the protection of an accused from double prosecution. 71 This does not necessarily mean, however, that the court will treat an application for a review from the Prosecution in the same manner as it does an application from an accused person:ie, that the application will be granted almost as a matter of course. On this point, a comparison betweenYasainandHallis instructive. 72 InYasain, the accused had earlier been convicted of a number of offences including rape and kidnapping. The sentences imposed for the rape charge (six years) and the kidnapping charge (one and a half years) had been ordered to run consecutively, making a cumulative sentence of seven and a half years’ imprisonment. When the accused appealed, it was noticed that no verdict had been recorded in respect of the kidnapping charge even though the accused had been sentenced on it. The English Court of Appeal therefore ordered that the conviction in respect of the kidnapping charge be expunged. Subsequently, it was discovered that a verdict on the kidnapping charge had in fact been returned by the jury, but had not been recorded because of an error. The Prosecution then applied for the court to reopen the appeal and reinstate the accused’s conviction and sentence in respect of the kidnapping charge. The application was allowed because the error had resulted in an unwarranted 18-month reduction in the accused’s sentence. The court observed that what had taken place was the product of “a rare coincidence of circumstances”, and that the “very substantial public interest in those properly convicted serving the sentence imposed” justified the extraordinary recourse of reopening the appeal (at [49]). 73 By contrast, inHall, it will be recalled that the accused had already been sentenced to nearly seven years’ imprisonment for perverting the course of justice, whereas the sentence which he had received for assaulting prison officers, which had been set aside because of the fraud that he perpetrated, was only six months’ imprisonment (see [35]–[36] above). The Hong Kong Court of Final Appeal noted that should the appeal pertaining to the accused’s common assault conviction be reopened, much time and resources would have to be devoted to its disposal. The court concluded that such an expenditure of resources would not be justified, given that the interests of justice had already been served by the imposition of a separate and lengthy custodial sentence on the accused for perverting the course of justice, and thus, there was no need to reopen the appeal. It seems to us that the reason given by the Hong Kong Court of Final Appeal for not reopening the appeal makes good practical sense. That said, we have not heard the Public Prosecutor on this question as the issue did not arise in the present case, and we therefore express no concluded view on it. A clarification: new legal arguments involving constitutional points 74 As a final point before we conclude our discussion of when it is appropriate for the Court of Appeal to reopen its decision in a concluded criminal appeal, we think it is important to clarify this court’s earlier comments inRamalingam(at [17]) andQuekHock Lye(at [23]–[24]) that the criminal motions in those cases were heard because they concerned new legal arguments involving constitutional points in relation to capital offences. In our judgment,RamalingamandQuekHock Lyeshould be confined to their facts. Both were cases in which this court saw the need to clarify important legal points in the public interest. These two cases should not be interpreted to mean that there is an automatic right of review whenever new legal arguments involving constitutional points are raised in a capital case. Indeed, it is evident that inRamalingam, this court did not think that the raising of new legal arguments involving constitutional points was in itself a sufficient ground for a review. At [16], it noted that the applicant had had ample opportunity to raise, at an earlier stage, the constitutional points which he now sought to advance in his application for review, and therefore “could have had no cause to complain if we had declined to hear this Motionon the basis that he had exhausted all his rights to due process …” [emphasis added]. We would clarify that the touchstone, at the end of the day, is still whether the applicant has produced sufficient material upon which the court may conclude that there has been a miscarriage of justice. For the purposes of determining if this test has been satisfied, it does not matter, where the material relied on consists of new legal arguments, whether or not those legal arguments involve constitutional points – the same criteria still apply. 75 This can be seen most clearly inYongVui Kong (Prosecutorial Discretion).The issue in that case was whether the applicant’s constitutional right to equal treatment had been violated by the Public Prosecutor’s decision to charge him but not one “Chia”, who was alleged to be the kingpin of the drug syndicate for which the applicant worked. (Chia was detained under the provisions of the Criminal Law (Temporary Provisions) Act (Cap 67, 2000 Rev Ed) instead.) The applicant argued, on the basis of the principles articulated inRamalingam(which was decided just two weeks prior to the filing of his application for review), that the Court of Appeal should reopen its decision on his conviction and sentence (inYongVui Kong v Public Prosecutor[2010] 3 SLR 489).In explaining why it decided to reconsider the matter even though no novel constitutional points were involved, the court said that the case presented itself as a more compelling instance in which there might have been unequal treatment since Chia “appear[ed] to be a more culpable offender than [the applicant]” (seeYongVui Kong (Prosecutorial Discretion)at [19]). Further, the court noted that the issue of possible unequal treatment was one which had arisen solely as a result of its decision inRamalingam,and therefore, the argument was “new” both in the sense that it had hitherto never been considered before the filing of the application for review and could not, even with reasonable diligence, have been raised in court prior to that (see likewiseYongVui Kong (Prosecutorial Discretion)at [19]). Thus presented, it can be seen that the court applied the usual criteria (viz, the production of sufficient material to establish that there has been a miscarriage of justice) in deciding whether to entertain the application, even though the material relied on by the applicant consisted of new legal arguments involving constitutional points. 76 To reiterate, the raising of hitherto unconsidered points of constitutional law is not in itself sufficient to show that the Court of Appeal ought to review a concluded criminal appeal. Much would depend on the merits of the constitutional points concerned and whether they would, having regard to the factual context of the case in question, affect the outcome of the case and thus show that a miscarriage of justice has been occasioned. We would reiterate that litigants who pray in aid of the Court of Appeal’s inherent power to reopen a concluded criminal appealmustshow that there is sufficient material upon which it may be concluded that there has been a miscarriage of justice.",
        "Summary of the applicable legal principles": "77 This concludes our discussion on the law relating to the Court of Appeal’s inherent power of review. From this, the following key propositions can be distilled: (a) The Court of Appeal, as the final appellate court in Singapore, has the inherent power to reopen a concluded criminal appeal in order to prevent a miscarriage of justice. This power is a facet of the judicial power which is vested in the Court of Appeal by virtue of Art 93 of the Constitution. When the court exercises this power of review, it is acting within the scope of its statutorily-conferred appellate jurisdiction, which is not completely exhausted merely by the rendering of a decision on the merits of the appeal. (b) A review of a concluded criminal appeal is not to be confused with an appeal. In reviewing a case, the Court of Appeal is primarily concerned not with the correctness of the decision under review, but with the question of whether there has been a miscarriage of justice. To justify the exercise of the court’s inherent power of review, the applicant must satisfy the court that there is sufficient material on which it may conclude that there has been a miscarriage of justice. In this regard, the mere fact that the material relied on by the applicant consists of new legal arguments involving constitutional points doesnot, without more, suffice. (c) In deciding whether to exercise its inherent power of review, the Court of Appeal will consider the following two matters (as set out at sub-paras (d) and (e) below). (d) The first is whether the applicant has discharged his burden of producing “sufficient material” to warrant the court exercising its inherent power of review. The material put forward must possess two signal features in order to be considered “sufficient”: (i) it must be “new” –ie,it must not previously have been canvassed at any stage of the proceedings prior to the filing of the application for review, and it must be something which could not, even with reasonable diligence, have been adduced in court earlier; and (ii) it must be “compelling” –ie,it must be reliable, substantial, powerfully probative, and therefore, capable of showing almost conclusively that there has been a miscarriage of justice. (e) The second condition is whether the applicant has discharged his burden of proving that there has been a “miscarriage of justice”. Generally, the court will only find that there has been a “miscarriage of justice” in one of the following two situations: (i) The first is where a decision of the court on conviction or sentence is shown to be “demonstrably wrong”. In relation to a decision on conviction, it is not sufficient for the applicant to show that there is a real possibility that the decision concerned is wrong; instead, it must be apparent, based on the evidence tendered in support of the application alone and without the need for further inquiry, that there is a powerful probability that the decision is wrong. In relation to a decision on sentence, it must be shown that the decision under challenge was based on some fundamental misapprehension of the law or the facts, thereby resulting in a decision that is blatantly wrong on the face of the record. An application for a review on the ground that a decision (whether on conviction or sentence) is “demonstrably wrong” is usually available only to the accused. (ii) The second scenario is where the decision under challenge is tainted by fraud or a breach of natural justice, such that the integrity of the judicial process is compromised. An application for a review on the ground of fraud or breach of natural justice is available to both the accused and the Prosecution.",
        "Should this court’s decision inCA (Re-sentencing)be reopened?": "78 In our judgment, applying the legal principles which we have just outlined to the Present Application, this application is misconceived in principle and must fail. For the most part, the Applicant merely traverses the same grounds as those which he covered in his submissions before this court at the hearing ofCA (Re-sentencing). There is very little in the way of “new” material, let alone material which is “compelling” and which justifies the exceptional recourse of a review. The Applicant has never suggested that there was any fraud, and in his amended notice of motion, the allegation that there was a breach of natural justice has been dropped. It has always been his core case in the Present Application that this court’s decision inCA (Re-sentencing)was wrong; but, as will be plain from our analysis of the evidence, he fell short of showing that the sentence which this court imposed was “wrong”, let alone “demonstrably wrong”. In truth, the Present Application is not a genuine application for a review, but an attempt to re-litigate a matter which had already been fully argued and thoroughly considered. 79 Given the acute importance of this case to the Applicant and his family, and because this is the first time we have articulated the principles governing the exercise of the Court of Appeal’s inherent power of review, we propose to examine the material which the Applicant has put forward in some detail. However, we must clarify that, moving forward, such a detailed analysis will not be appropriate in every application for review, particularly where it is clear that the application is plainly without merit. We are doing so in this case only for illustrative purposes.",
        "The grounds relied on by the Applicant": "80 In his submissions, counsel for the Applicant, Mr Mohan, has laid out a number of “grounds” in support of his argument that there is a need for this court to exercise its inherent power to reopen its decision inCA (Re-sentencing). For ease of exposition, we will refer to each of these “grounds” as “Ground 1”, “Ground 2”, and so on.7Foot Note 7×Applicant’s submissions at para 14.1.As there is some degree of overlap in the various “grounds”, we have merged and reorganised them into four principal contentions. Broadly summarised, Mr Mohan argues that this court’s decision inCA (Re-sentencing): (a) was premised on an error of law; (b) was based on the wrong factual premise; (c) breached the requirement of unanimity; and (d) breached the Applicant’s right to a fair trial. We will deal with each of these principal contentions in turn below.",
        "Was the decision inCA (Re-sentencing)premised onan error of law?": "81 Mr Mohan’s first principal contention, which embraces Grounds 1, 2, 6 and 7 of his submissions, is that this court erred in law in sentencing the Applicant to death. As a preliminary point, Mr Mohan first argues that the Prosecution has no right of appeal against a sentence of life imprisonment and caning imposed by the High Court (in lieu of a sentence of death) pursuant to an application for re-sentencing under the 2012 Amendment Act, and for that reason, this court acted without jurisdiction inCA (Re-sentencing)when we substituted the death sentence in place of the sentence of life imprisonment and 24 strokes of the cane imposed by the Re-sentencing Judge.8Foot Note 8×Applicant’s post-hearing submissions at paras 4.7–4.14.Apart from this jurisdictional argument, Mr Mohan also submits that this court’s decision was wrong in law for the following reasons: (a) There was no basis for appellate intervention inCA (Re-sentencing)because the sentence imposed by the Re-sentencing Judge was not manifestly inadequate.9Foot Note 9×Applicant’s submissions at paras 20.1, 20.3 and 20.5–20.7. (b) The test applied by this court to decide whether a sentence of death should be imposed –viz, whether the actions of the offender would “outrage the feelings of the community” (also referred to hereafter as “theCA (Re-sentencing)test” where the context so warrants) – is not appropriate for the offence of murder. In relation to this offence, Parliament’s intention is that a wide ambit of considerations, and not only those relating to the circumstances of the offence, should be taken into account to determine the appropriate sentence.10Foot Note 10×Applicant’s submissions at para 15.2; Applicant’s post-hearing submissions at paras 9.1–9.5. (c) The imposition of a sentence of death offends the principle of consistency since there are cases, both decided before and afterCA (Re-sentencing), which are more serious than the Applicant’s case, but which did not attract the death penalty.11Foot Note 11×Applicant’s submissions at paras 15.3–15.6. No right of appeal 82 It is important to remember thatCA (Re-sentencing)was the Prosecution’s appeal against sentence. Therefore, based on the principles we have articulated above, in order for a review to lie, the Applicant needs to show that this court’s decision in that appeal was based on a “fundamental misapprehension” of the applicable law or facts and was therefore “blatantly wrong”. Of all the arguments raised by Mr Mohan in support of his first principal contention, the only one that could conceivably satisfy this standard is the argument that this court acted without jurisdiction inCA (Re-sentencing)because the Prosecution had no right of appeal against the decision inHC (Re-sentencing). In our judgment, however, this argument is plainly without merit. The relevant provisions of s 4(5) of the 2012 Amendment Act in this regard read as follows: Where on the appointed day, the Court of Appeal has dismissed an appeal brought by a person for an offence of murder under section 302 of the Penal Code, the following provisions shall apply: … (h)the provisions of Division 1 of Part XX of the Criminal Procedure Code relating to appeals shall apply to any appeal against the [re-sentencing] decision of the High Court under paragraph (g) with the modification that any appeal must be lodged by the appellant with the Registrar of the Supreme Court within 14 days after the date of the re-sentencing by the High Court … … 83 Division 1 of Part XX of the CPC relates to appeals, and s 374(3), which falls within it, states that the Public Prosecutor may appeal against “the acquittal of an accused orthesentence imposed on an accusedor an order of the trial court” [emphasis added]. The purport of s 4(5)(h) of the 2012 Amendment Act (read with Division 1 of Part XX of the CPC) is that the sentence passed by the High Court upon an application for re-sentencing is to be treated as if it were the sentence originally passed by the High Court following the accused person’s trial. Such a decision is undoubtedly appealable, and there is nothing in either the 2012 Amendment Act or the CPC which indicates that the decision is final and non-appealable. The Public Prosecutor submitted – and we agree – that it is plain and obvious that the High Court’s decision in a re-sentencing application is to be treated like any other sentencing decision made by the High Court in the exercise of its original criminal jurisdiction, and is therefore appealable to this court.12Foot Note 12×Respondent’s reply submissions at paras 5–9.In light of the foregoing, we hold that this court did have the jurisdiction to hearCA (Re-sentencing). 84 The remaining errors of law which the Applicant alleged had occurred do not really warrant any serious consideration and do not even come close to establishing that this court committed a blatant error inCA (Re-sentencing). This alone is sufficient to dispose of Mr Mohan’s first principal contention; but, for completeness, we will go on to discuss briefly below each of the “grounds” which Mr Mohan has advanced under this particular contention. No basis for appellate intervention 85 InMohammedLitonat [81]–[82], we explained that appellate courts would intervene to correct sentences in one of the following four situations: (a) where the sentencing judge erred in respect of the proper factual basis for the sentence; (b) where the sentencing judge failed to appreciate the material before him; (c) where the sentence was wrong in principle; or (d) where the sentence was, in all the circumstances, manifestly excessive or manifestly inadequate. Mr Mohan’s submission that “the Court of Appeal canonlyincrease the sentence where the original penalty imposed was manifestly inadequate”13Foot Note 13×Applicant’s submissions at para 20.7.[emphasis in original omitted; emphasis added in italics] is therefore clearly incorrect. 86 This court’s decision inCA (Re-sentencing)is justifiable on at least two of the four aforementioned bases for appellate intervention. First, it may be said that the Re-sentencing Judge erred in respect of the proper factual basis for the sentence. At [58]–[59] ofCA (Re-sentencing), the majority of this court noted that the Re-sentencing Judge erred in holding that there was insufficient evidence to conclude that the Applicant had approached the deceased from behind. That the Applicant had indeed done so was a finding which the minority accepted as well (seeCA (Re-sentencing) at [91]–[103]). Second, it may be said that the Re-sentencing Judge erred on a matter of principle. The cases ofSiaAh Kew v Public Prosecutor[1974–1976] SLR(R) 54 andPanyaMartmontree v Public Prosecutor[1995] 2 SLR(R) 806 were both cited to him (seeHC (Re-sentencing)at [13]–[14]), but he did not adopt the test articulated therein:viz, that a sentence of death would be appropriate where the offence outraged the feelings of the community. InCA (Re-sentencing), this court unanimously adopted that test as the correct legal test for determining whether it would be appropriate to impose the death sentence for the offence of murder. Accordingly, the Re-sentencing Judge’s decision was erroneous as a matter of principle. Wrong test applied 87 Before us, Mr Mohan argued impassionedly that the test which this court unanimously endorsed and applied inCA (Re-sentencing)in determining whether the Applicant ought to be sentenced to death –viz, whether his actions “outrage the feelings of the community” (at [44], [86] and [203]) – was wrong. According to Mr Mohan, this test should be confined in its application to only the offence of kidnapping, in respect of which it was originally promulgated. He submits that it is too blunt a test in the context of the offence of murder because all instances of murder, by definition, involve violence and result in death, and are bound to outrage the feelings of the community. Thus, to apply this test to the offence of murder would be to consign all persons convicted of murder to death. Mr Mohan also criticises this test for its inflexibility, arguing that it permits the sentencing court to consider only the manner in which the offence was committed, but not the accused’s motives or concerns of general deterrence.14Foot Note 14×Applicant’s response and further submissions at paras 2.10 and 2.11.In lieu of this test, Mr Mohan suggests, we should adopt the position taken by the Indian Supreme Court and the courts of some of the Caribbean States:viz, that the death penalty should be reserved for cases which are the “rarest of the rare”.15Foot Note 15×Applicant’s post-hearing submissions at para 9.1. 88 In our view, this argument does not even begin to get off the ground. The points made by Mr Mohan, including the Indian and the Caribbean authorities to which he referred, had been considered extensively by this court inCA (Re-sentencing)(at [38]–[43]) and are clearly not “new”. This court had carefully reviewed those points and those authorities, and had given reasons for rejecting the Indian and the Caribbean approach. We do not propose to reprise the analysis here. 89 More troubling, however, is the fact that Mr Mohan appears to have completely misunderstood what the test of whether the offender’s actions “outrage the feelings of the community” involves. This test does not entail that the court is to sentence by public opinion, with the sentence of death being imposed for the offence of murder whenever a preponderance of the members of the public express sufficient distaste for the accused’s actions. Wecompletelyabjure such a suggestion. That is not the way this court or, for that matter, any court elsewhere would administer justice. The test that this court adopted inCA (Re-sentencing)sets out, instead, areasonednormative standardwhich future courts are to apply when deciding whether to impose the death penalty for the offence of murder. At [44], this court said: In our judgment, a more appropriate principle to follow would be that laid down by the Court of Appeal inSiaAh Kew[v Public Prosecutor[1974–1976] SLR(R) 54], which is, whether the actions of the offender wouldoutrage the feelings of the community.Undoubtedly, capital punishment is an expression of society’s indignation towards particularly offensive conduct, and the fact that the death penalty continues to be part of our sentencing regime is an expression of society’s belief that certain actions are so grievous an affront to humanity and so abhorrent that the death penalty may, in the face of such circumstances, be the appropriate, if not the only, adequate sentence.It would therefore, in our judgment, be correct to consider the strong feelings of the community in deciding whether or not to impose the death penalty. [emphasis in original in italics; emphasis added in bold italics] 90 Determining whether an offender’s actions so “outrage the feelings of the community” and are “so grievous an affront to humanity and so abhorrent” that the death penalty is justified is an exercise in ethical judgment in which the sentencing court expresses the collective conscience of the community through the selection of a condign punishment. In performing this exercise, contrary to what Mr Mohan submitted, the remit of the sentencing court’s inquiry isnotcircumscribed. This court specifically stated inCA (Re-sentencing)that the sentencing court was to look widely, and that “allthe circumstances and factors of the case must be taken into consideration in meting out an appropriate sentence” [emphasis added] (at [37]), thus also ensuring that the inquiry would be anobjectiveone. Furthermore, at [51(d)], this court expressly highlighted that “the motive and intention of the offender at the time he committed the offence” was an important sentencing factor which must form part of the sentencing matrix. In the circumstances, we see no warrantable basis for concluding that this court applied the wrong test inCA (Re-sentencing). Inconsistency in sentencing 91 In support of his argument based on inconsistency in sentencing (see [81(c)] above), Mr Mohan tendered a diagram in which he arranged five cases in ascending orders of severity.16Foot Note 16×Applicant’s response and further submissions at p 8.These cases are:Public Prosecutor vKamrul Hasan Abdul Quddus[2014] SGHC 4,Public Prosecutor vGopinathan Nair Remadevi Bijukumar(Criminal Case No 40 of 2011),17Foot Note 17×See the minute sheet of Choo Han Teck J in Criminal Case No 40 of 2011 dated 28 August 2013.Public Prosecutor vEllary bin Puling and another(Criminal Case No 40 of 2009),18Foot Note 18×See the minute sheet of Chan Seng Onn J in Criminal Case No 40 of 2009 dated 16 July 2013.Public Prosecutor v WangWenfeng[2014] SGHC 23 andPublic Prosecutor vMicheal Anak Garing and another[2015] SGHC 107 (“MichealGaring”)(a case involving two offenders). Of the six offenders sentenced in these five cases, only one received the death penalty; the rest received terms of life imprisonment and between ten and 24 strokes of the cane. Mr Mohan argued that the Applicant’s case was less serious than two others in which the death penalty was not imposed, and was therefore not one which should attract the death penalty. 92 The material which Mr Mohan relied on is not new. Allthe cases mentioned in the preceding paragraph, save forMichealGaring, which was decided only afterCA (Re-sentencing),had already been cited to this court in argument at the hearing ofCA (Re-sentencing)and were fully considered.19Foot Note 19×Respondent’s submissions in Criminal Appeal No 6 of 2013 (CA (Re-sentencing)) at paras 49–54.We will not delve into the details of these cases, save to say that they do not give us any further reasons to conclude that this court’s decision to impose the sentence of death inCA (Re-sentencing)was, on the basis of the principle of consistency in sentencing, “blatantly wrong”. By its very nature, sentencing is a fact-sensitive exercise in judicial discretion which involves balancing a myriad of considerations (seeMohammedLitonat [81]). To arrange cases along a “spectrum” necessarily involves making a value judgment on the importance of some factorsvis-à-visothers. This is an exercise in respect of which even reasonable persons may differ. For this reason, it would ordinarily be very difficult to demonstrate that a sentencing decision is “blatantly wrong” on the basis of inconsistency alone, and we certainly do not think that such an argument can sensibly be maintained in the present case, given that this court had already considered the aforesaid precedent cases (except forMichealGaring).",
        "Was the decisioninCA (Re-sentencing)based on the wrong factual premise?": "93 Mr Mohan’s second principal contention, which comprises Grounds 3, 4 and 5 of his submissions, is that this court erred in imposing the sentence of death inCA (Re-sentencing)as it based its decision on incorrect findings of fact. The thrust of Mr Mohan’s argument in this regard is that the majority erred in relying on the findings made inCA (Conviction)– which, he submits, are open to serious question – to hold that the Applicant assaulted the deceased multiple times from the back.20Foot Note 20×Applicant’s submissions at paras 17.5, 17.12 and 17.15, as well as 19.4, 19.8 and 19.10–19.12.Mr Mohan argues that the question of whether the Applicant struck the deceased at least three times from the back is critical because the sentence of death wouldnotbe justified if it cannot be proved that the Applicant was the one who caused the majority of the deceased’s skull fractures. He contends that the proper interpretation of the evidence is that “there were at least2 blowscaused by the Applicant (one sufficient to fracture the skull), however, therecouldhave been more” [emphasis in original].21Foot Note 21×Applicant’s submissions at para 17.9. 94 In our judgment, this argument is a non-starter because the point is not new, and had already been thoroughly considered and analysed inCA (Re-sentencing). But, before we explain our reasons for rejecting this argument, we think it is necessary to address an important preliminary point. This concerns Mr Mohan’s contention that at the hearing ofCA (Re-sentencing), this court ought, of its own motion, to have remitted the matter to the High Court for further evidence to be taken at aNewtonhearing (seeR v Robert John Newton(1982) 4 Cr App R (S) 388) in order to clarify the alleged “ambiguities” relating to the manner in which the Applicant attacked the deceased. Mr Mohan argues that aNewtonhearing was necessary because the sentence of death which this court imposed inCA (Re-sentencing)was premised on an assessment of the Applicant’s culpability made on the basis of facts which the Applicant did not have an adequate opportunity to challenge either at first instance (inHC (Conviction)) or on appeal (inCA (Conviction)) as those facts were not relevant then since the death penalty was mandatory for the offence of murder at the time.22Foot Note 22×Applicant’s submissions at paras 16.4, 16.7, 16.8 and 21.1. Should this court have remitted the matter for aNewtonhearing? 95 We think it is important to set the record straight.The short answer to the question as to why this court did not, inCA (Re-sentencing), order aNewtonhearing to be convened is simply this: the Applicant elected not to lead further evidence. Before the Re-sentencing Judge, the Applicant (through his then counsel, Mr Anand Nalachandran and Mr Josephus Tan) consistently maintained that he did not think further evidence needed to be led, nor did he wish to make the requisite application to do so. The following two exchanges took place during the hearing of the Applicant’s re-sentencing application.The first exchange was between Mr Nalachandran and the Re-sentencing Judge:23Foot Note 23×Notes of Evidence, 14 August 2013, pp 6 (lines 4–7) and 7 (lines 2–13) (ROP 16). Court: … [I]f you look at [CA (Conviction)] …, they seem to set out various versions butI don’t see any exact finding as to what was the exact sequence of events. … Court: … [N]one of you were involved in the defence – at the trial, right? Nalachandran: No, Sir. None of us was in the trial for the [Applicant]. Tan:   No. Court: Okay. So I don’t suppose I can derive much help from you insofar as what were the exact findings of [the trial judge] or the Court of Appeal, other than what appears on record. Nalachandran: Sir, I think for the purposes of this [re]- sentencing, we are – Court: Sorry. Could you just turn the mic to your side? Nalachandran: Sorry, Sir.Perhaps for the purposes of this[re]-sentencing hearing, I think we are limited by the findings in the judgments of the High Court and the Court of Appeals[sic]. [emphasis added] The second exchange was between Mr Tan and the Re-sentencing Judge:24Foot Note 24×NE 14 August 2013, pp 17 (lines 26–31) and 18 (lines 1 – 4) (ROP 26 and 27). Tan: Your Honour, if I may move on to the point of intoxication. … I found this information on the internet. This is a island-wide recall notice by the AVA dated 26th of August 2009. And Your Honour, if we look at the dates, that were –actually means that prior to this recall, that alcohol – that particular brand of alcohol consumed by the five accused person[s] contained excessive methanol which will cause alcohol poisoning, and of course, the effects of alcohol poisoning, we have already put it in our written submissions, dizziness, blurr[ing] of the vision – Court: But that would contradict the findings of the trial [j]udge as well as the affirmation by the Court of Appeal, right? Tan: Yes, Your Honour. All this information [was] not available then at both instances. Court:But you are not suggesting further evidence now, are you? Or you are just saying? Tan:No,Your Honour, we are not. We are – we are not disturbing – Court:You are just asking me to extrapolate, right? Tan:Yes,Your Honour.We are just saying that – [emphasis added] 96 Mr Mohan’s submission that the two exchanges quoted above on the leading of further evidence concernedonlythe question of whether the Applicant was intoxicated at the time he attacked the deceased is incorrect.25Foot Note 25×Applicant’s letter to the Registry dated 1 December 2015 at para 4.As is clear from the first extract, the fact in issue during the first exchange wastheexact sequence of events relating to the assault, and it was in relation to that precise question that the Applicant’s then counsel accepted that he was limited by the findings which had already been made by the High Court inHC (Conviction)and by the Court of Appeal inCA (Conviction). While it is true that the second exchange took place in relation to the defence of intoxication, read in context, it is clear that the Applicant’s then counsel accepted that he was bound by the findings made inCA (Conviction), and therefore, as a general point, did not seek to introduce further evidence. Of course, it was always open to the Applicant to change his mind when the Prosecution appealed against the Re-sentencing Judge’s decision, and he could have made the requisite application at the hearing ofCA (Re-sentencing)to adduce further evidence, but he did not do so.Given the way that events have developed, it does not, in our judgment, lie in the Applicant’s mouth to now say that this court ought to have intervened and ordered aNewtonhearing to be held. 97 As a matter of principle, the court should not descend into the arena and instruct parties on the proper way to conduct their case. That is not the way our adversarial system works. In all cases, and crucially in criminal cases, the role of the court is to maintain a posture of impartiality and approach the matter disinterestedly. There are times when the court must step in to ensure that justice is done, particularly where an accused person is conducting his defence without the aid of counsel. But, where an accused person is represented, it is not for the court to question or second-guess the decisions which he makes upon the advice of his counsel. The court would also not know what further evidence an accused person might adduce. Had this court directed, inCA (Re-sentencing), that aNewtonhearing be carried out, and had the result of the inquiry been unfavourable to the Applicant, we can well imagine that this court would now be faulted for having intervened instead of not having intervened. The number of blows inflicted by the Applicant 98 As we said at [94] above, none of the material cited by Mr Mohan in support of his argument that the Applicant inflicted only two blows on the deceased is “new”. The material presented – chiefly, the allegedly inconclusive nature of the medical evidence relating to the number of blows inflicted on the deceased’s head – was before this court at the hearing ofCA (Re-sentencing), and was carefully considered by both the majority (at [63]–[68]) and the minority (at [124]–[126]perLee Seiu Kin J; and at [151]–[152]perWoo Bih Li J). While the majority and the minority may have reached divergent conclusions, there is no basis for suggesting that the material in question was not adequately argued by counsel and examined by this court. 99 A further problem with this argument is that it rests on the incorrect premise that the majority inCA (Re-sentencing)had concluded that the sentence of death was warrantedonlybecause the Applicant had inflicted at least three blows on the deceased’s head. That wasnotin fact the position. The majority never thought that the number of blows – while certainly relevant – was decisive. InCA (Re-sentencing), those in the majority said: 63 In our opinion,theexact number of blows that the [Applicant] inflicted on the deceased and the manner in which they were carried out while certainly relevant to our inquiry are not necessarily decisive. … … 71 We have focused thus far on the exact number of blows the [Applicant] had inflicted on the head of the deceased, although that is not the defining question that needs to be answered.The key question which we must answer is – did the[Applicant] act in a manner which showed a blatant disregard for human life? While, as we have stated above, … the question as to the number of blows which the [Applicant] had landed on the head of the deceased is not decisive, it remains very relevant to the key question.The following considerations are critical to our decision: (a) First, we find that the [Applicant] had approached the deceased from behind, and struck him without any warning. Whether or not this was prefaced with a struggle, between Galing [the Applicant’s co-accused] and the deceased, is of little significance to the [Applicant]’s culpability. After the first blow was inflicted which caused the[deceased] to fall to the ground, there was effectively no more struggle. (b) Second,after the deceased fell to the ground after the first blow and then turned around to face upwards, the[Applicant] struck him once more. It is not disputed that the [deceased] was not retaliating.… (c) In any case,even if the[Applicant]’s assertion that he had only struck the deceased twice is to be believed and accepted, … the force he exerted in the two blows must have been so great as to cause fracturing of such severity and magnitude, so much so that a fall, or a strike with Galing’s belt buckle, could have caused further fracturing. … 78 …Even if we were to accept the position that it was unclear as to how many times the[Applicant] had struck the head of the deceased, what is vitally important to bear in mind is that what we have here was acompletely shattered skull. Bearing in mind the fact that the alleged intention of the [Applicant] and Galing was merely to rob the deceased,what the[Applicant] did underscores thesavageryof the attack which was characterised byneedless violencethat went well beyond the pale. [emphasis in original omitted; emphasis added in italics and bold italics] 100 Read fairly and in its proper context, it is clear from the above extract that even if the Applicant’s account had been accepted, and even if the majority had proceeded on the basis that the Applicant had struck the deceased only twice on the head (seeCA (Re-sentencing)at [60]), the majoritywould still have concluded thatthe sentence of death was warranted. The three critical factors which the majority relied on in deciding to impose the death penalty were the following: (a) the Applicant first struck the deceased from behind on the head without warning, causing the latter to fall to the ground (at [71(a)]); (b) the Applicant inflicted at least one more blow on the deceased while the latter was laying on the ground defenceless (at [71(b)]); and (c) even if only two blows had been inflicted on the deceased by the Applicant, it would be fair to infer that the two blows must have been of such force that they caused extensive fractures to the deceased’s skull and weakened it to the extent that the strike with the belt buckle by the Applicant’s co-accused, Galing, and/or the deceased’s fall onto the ground caused further fractures when, ordinarily, they would not have done so (at [67]–[68], [71(c)] and [78]). To the majority, these factorsalonewere cumulatively sufficient to justify the conclusion that the Applicant had evinced “a blatant disregard for human life” and therefore ought to be sentenced to death (at [77]–[79]). Thus, even if the majority had been wrong to conclude that the Applicant had inflicted at least three blows on the deceased’s head, there is no basis for saying that the sentence of death which this court imposed inCA (Re-sentencing)constituted a miscarriage of justice because it was premised on an incorrect finding of fact. 101 We acknowledge that those in the minority inCA (Re-sentencing)disagreed. While the minority agreed that the Applicant had struck the deceased from behind (see [86] above) and had inflicted at least two blows on the deceased, which caused the latter’s skull to fracture (at [199]perLee J; and at [215]perWoo J), unlike the majority, they did not think that these factors were sufficient to warrant the imposition of the death penalty. In the minority’s opinion, the threshold would only have been crossed if it could be concluded that the Applicant had inflicted three or more blows on the deceased which, alone, were responsible for the multiple fractures of the latter’s skull (at [200]–[201]perLee J; and at [217]perWoo J). In a similar vein, Mr Mohan argued that the death penalty would only be justified if the multiple fractures found on the deceased’s head “were caused by multiple blows and … it was the Applicant who caused the majority of the fractures by those multiple blows”.26Foot Note 26×Applicant’s submissions at para 17.15. 102 What this shows is that sentencing is an intensely difficult exercise, and that reasonable persons can, and often do, disagree as to what the appropriate sentence ought to be. That is why a wide margin of appreciation is given to sentencing judges called on to exercise their discretion. In our judgment, the mere fact of disagreement among the members of the coram is not sufficient to justify this court exercising its inherent power of review. The test for the purposes of the Present Application is whether the decision inCA (Re-sentencing)was “blatantly wrong”. Neither those in the majority nor those in the minority even came close to suggesting that the other side’s decision was “blatantly wrong”, and Mr Mohan has not presented us with any “new” evidence, let alone that which is “compelling”, which justifies our arriving at a contrary conclusion today. In the final analysis, there is no basis for us to exercise our inherent power of review on the ground that this court’s decision inCA (Re-sentencing)was based on an incorrect factual premise.",
        "Did the decision inCA (Re-sentencing)breach the requirement of unanimity?": "103 The third principal contention raised by Mr Mohan, which corresponds to Grounds 8 and 10 of his submissions, is that the imposition of the death penalty on the Applicant inCA (Re-sentencing)was unconstitutional because the decision to impose that penalty was not unanimous.27Foot Note 27×Applicant’s submissions at paras 22.1, 22.10 and 22.15–22.23; Applicant’s post-hearing submissions at paras 7.1–7.5.In this regard, Mr Mohan first points to Art 9(1) of the Constitution, which provides that “[n]o person shall be deprived of his life or personal liberty save in accordance with law”. In its seminal decision inOng Ah Chuan and another v Public Prosecutor[1979–1980] SLR(R) 710 (“Ong Ah Chuan”), the Privy Council held that the word “law” in Art 9(1) referred to a system of law incorporating those “fundamental rules of natural justice” that had formed part of the common law of Englandbeforethe commencement of the Constitution (at [26]perLord Diplock). For this reason, the Board stated, the effect of Art 9(1) was that there could be no deprivation of life or personal liberty – even if sanctioned by written law – if such deprivation were to offend a fundamental rule of natural justice. 104 Mr Mohan submits that one fundamental rule of natural justice is that a sentence of death may not be imposed except by a unanimous verdict. This, he contends, is a common law rule of ancient vintage commented on by (inter alia) Sir William Blackstone (seeCommentaries on the Laws ofEngland: Book the Fourth(A Strahan, 16th Ed, 1825) at p 349), Sir James Fitzjames Stephen (seeA History of the Criminal Law of England(MacMillan and Co, 1883) vol 1 at pp 304–305) and Lord Devlin (writing extra-judicially inTrial by Jury(Steven & Sons Ltd, 1956) ch 3 at p 56). When our laws still provided for criminal trials by jury, this rule was embodied in s 211 of the Criminal Procedure Code (Cap 132, 1955 Rev Ed), which stipulated that a verdict of guilty (in all cases, and not just capital cases) could only be returned by the jury either: (a) unanimously; or (b) by a majority of 5:2, with the concurrence of the presiding judge. After criminal trials by jury were abolished in 1971, the requirement of unanimity still applied in capital cases in that offenders facing capital charges were tried by two judges, both of whom had to agree on the offender’s guilt in order for there to be a conviction (see s 185(2) of the Criminal Procedure Code (Cap 113, 1970 Rev Ed)).28Foot Note 28×Applicant’s submissions at paras 22.6–22.19, particularly paras 22.10, 22.14 and 22.17.This requirement was abolished only when the Criminal Procedure Code (Amendment) Act 1992 (Act 13 of 1992) came into effect on 18 April 1992. 105 The modern manifestation of this rule, Mr Mohan argues, is that if the High Court elects not to impose a sentence of death, this court can reverse the High Court’s decision and substitute a sentence of deathif and only ifit acts unanimously.29Foot Note 29×Applicant’s response and further submissions at para 7.5.To the extent that s 31(1) of the SCJA (and to this, we may add s 386(3) of the CPC) states that an appeal is to be decided in accordance with the opinion of the majority of the judges on the coram, Mr Mohan submits that this should not apply to an appeal against the imposition of a capital sentence.30Foot Note 30×Applicant’s submissions at paras 22.20–22.22. Analysis of the Applicant’s arguments 106 The alleged rule of natural justice which Mr Mohan has raised (viz, that a decision to impose the death penalty in a capital case must be unanimous) is a point which arose only as a result of this court’s decision inCA (Re-sentencing). For that reason, the arguments and authorities which Mr Mohan has raised in this regard are new in the sense that they had previously not been considered and could not, even with the exercise of reasonable diligence, have been considered prior to the filing of the Present Application. However, the critical question is whether, together, these arguments and authorities establish a “compelling” case that a miscarriage of justice has been occasioned. In our judgment, they do not. We give two reasons for this conclusion. 107 First, the authorities cited by Mr Mohan, even taken at their highest, do not stand for the proposition that the decision of anappellate judicial bodymust likewise be rendered unanimously in order for a sentence of death to be imposed. At best, they stand for the proposition that a decision onconvictionrendered by a body oflay jurorsconsidering a capital chargeat first instancemust be unanimous. The fact that there was, historically, a requirement for unanimity in capital trials conducted by lay jurors does not in any way suggest that it should likewise be an essential requirement forappealsheard by professional judges. In fact, Mr Mohan accepts that this is as far as the authorities go. However, he also submits that the broader point is that, as a matter of principle, the imposition of capital punishment must always be attended by procedural safeguards, one of which is that the trial must be conducted by jury and that the jury must decide the matter unanimously.31Foot Note 31×Applicant’s response and further submissions at para 7.12. 108 Putting aside for the moment Mr Mohan’s argument that a trial by jury is an essential safeguard for capital cases (with which we do not agree), it still does not provide any reason why unanimity is required inappellatehearings presided over by professional judges. Mr Mohan was unable to point us to any single jurisdiction which requires its appellate courts to decide criminal cases by unanimous decision. Even during the period when criminal trials were conducted by jury in Singapore, anappealfrom the decision of the jury, which was heard by the then Court of Criminal Appeal, was decided in accordance with the opinion of themajorityand did not have to be unanimous (see s 3(5) of the Court of Criminal Appeal Ordinance (Cap 129, 1955 Rev Ed)). Since the abolition of criminal trials by jury, this court has affirmed convictions in capital cases by a majority (see,eg,Took Leng How v Public Prosecutor[2006] 2 SLR(R) 70). In our judgment, therefore, the so-called common law rule of unanimity in capital cases, to the extent that it continues to exist, is confined in its operationonlytotrialsconducted byjuriesconsisting of laypersons, and does not extend to criminalappealsheard by anappellate court made up of professional judges. 109 Our second reason for rejecting Mr Mohan’s submissions on the aforesaid rule of unanimity is that we are not persuaded that this rule, to the extent that it even exists, can be considered a fundamental rule of natural justice. InYongVui Kong v Public Prosecutor[2015] 2 SLR 1129 (a case concerning the constitutionality of the sentence of caning), we explained that the fundamental rules of natural justice referred to by the Privy Council inOng Ah Chuanwere “proceduralrights aimed at securing a fair trial” [emphasis in original] (at [64]). In other words, they areuniversalrules which apply at all times and cannot be abrogated, even by Parliament. The Applicant has not shown why the requirement of unanimity in capital cases is such a rule. 110 InRobertApodaca et al v Oregon406 US 404 (1972) at 409, Powell J noted that there were four main explanations for the historical requirement of unanimity in criminal cases. These explanations are summarised in Raoul G Cantero and Robert M Kline, “Death is Different: The Need for Jury Unanimity in Death Penalty Cases” (2009–2010) 22 St Thomas L Rev 4 (“Canteroand Kline”) at p 29 as follows: First, hundreds of years ago, the criminal justice system lacked many of the procedural safeguards afforded today. Second, courts performed trials by compurgation [with matters being decided based on whether a party could assemble the requisite number of sworn witnesses testifying to his good character], in which the court added to the original number of 12 compurgators until one party had 12 compurgators on its side. Supposedly, when the courts abandoned this approach, the requirement remained that one side had to obtain the votes of all twelve jurors. Third, unlike modem juries, those in medieval times consisted of jurors who had personal knowledge of the facts. The medieval mind believed there could be only one correct answer to a conflict, which meant there was no place for reasonable jurors to disagree. If reasonable jurors cannot disagree, the only correct verdict must, necessarily, be a unanimous one. Fourth, the medieval concepts of consent required juries to render unanimous verdicts. The very word “consent” connoted unanimity. Evidence exists that in the 14th century, Parliament could not bind the community or individual members to a legal decision unless the members of Parliament unanimously rendered the decision. Only in the 15th century, when unanimity became increasingly harder to obtain, did Parliament begin to allow majority decisions. 111 From this brief summary, it may be concluded that the so-called rule of unanimity is too particular and too idiosyncratic to the jury system as it originated in medieval England to be considered a universal rule of criminal law for all capital offences, wherever and howsoever prosecuted. As Lord Diplock clarified at [27] ofOng Ah Chuan, observance of the fundamental rules of natural justice “does not call for the perpetuation in Singapore of technical rules … [which] are largely a legacy of the role played by juries in the administration of criminal justice in England as it developed over the centuries”. In fact, we would go further to say that we do not think the rule of unanimity should even apply to modern criminal jury trials, let alone criminal trials presided over by professional judges. We note that since the passage of the Criminal Justice Act 1967 (c 80) (UK), English juries have been permitted to return verdicts by majority decision (including, prior to the abolition of capital punishment in the United Kingdom in 1988, in capital cases involving offences such as espionage and treason). 112 In the final analysis, even if the so-called rule of unanimity exists, it would not, in our judgment, come within the ambit of the fundamental rules of natural justice. Therefore, Parliament is free to derogate from this, as it did when it allowed majority verdicts to be returned in capital cases (see [104] above). We therefore hold that the Applicant’s contention on this ground affords no compelling basis for us to exercise this court’s inherent power of review.",
        "Did the decision in CA (Re-sentencing) breach the Applicant’s right to a fair trial?": "113 The fourth and final principal contention raised by Mr Mohan, which may be found in his post-hearing written submissions, is that the Applicant’s right to a fair trial was infringed inCA (Re-sentencing)when this court substituted the sentence of life imprisonment and caning imposed by the Re-sentencing Judge with one of death. This argument is framed in two ways: (a) First, the Applicant was disadvantaged because he did not have the benefit of conducting his defence at the trial in light of the considerations articulated in the test which this court adopted inCA (Re-sentencing)in deciding whether to impose the death sentence on him. If the Applicant had known of this test at the time of his trial, he might have presented his evidence differently, and might consequently have escaped the death penalty. The situation is doubly unfair in the Applicant’s case because future offenders who are charged with murder would have a better chance of escaping the death penalty than the Applicant in that they would now know the test which the court would apply at the sentencing stage to determine whether the death penalty ought to be imposed, whereas the Applicant did not.32Foot Note 32×Applicant’s post-hearing submissions at paras 5.2–5.4. (b) Second, the Re-sentencing Judge’s decision inHC (Re-sentencing)to sentence the Applicant to life imprisonment and 24 strokes of the cane (in lieu of the death sentence originally imposed by the trial judge) amounted to an “acquittal” of the Applicant from the death penalty. Thus, this court breached the rule against double jeopardy when it allowed the Prosecution’s appeal against the sentence imposed by the Re-sentencing Judge and substituted the death penalty in its stead.33Foot Note 33×Applicant’s post-hearing submissions at paras 6.1–6.10.Furthermore, it was argued that following the decision of the Re-sentencing Judge, the Applicant had a “legitimate expectation” that he would not be sentenced to death.34Foot Note 34×Applicant’s post-hearing submissions at para 6.8. 114 Like the third principal contention advanced by Mr Mohan, the issue which Mr Mohan has raised here is one which arose only as a result of this court’s decision inCA (Re-sentencing).While the Applicant’s arguments on this fourth principal contention are new, we do not think they provide a compelling basis for concluding that there has been a miscarriage of justice as far as the Applicant is concerned. We now turn to examine each of these arguments in turn. The Applicant did not know the test which would be applied 115 Addressing, first, the argument that the Applicant was disadvantaged because he did not have the benefit of conducting his defence at the trial with knowledge of the contours of the test which this court applied inCA (Re-sentencing)to determine whether the death penalty ought to be imposed, we understand Mr Mohan’s argument to proceed in the following way. At the time the Applicant was tried, the number of blows which he had inflicted on the deceased, the force with which he had delivered those blows and the cause of the multiple fractures of the deceased’s skull were not relevant. Since the death penalty was mandatory for the offence of murder at that time, liability for murder and, as a corollary, the death sentence would have been attracted so long as it could be established that the Applicant had intended to inflict the injuries which led to the deceased’s death. That the Applicant had intended to inflict those injuries was not in doubt as he had admitted to striking the deceased twice. Thus, the Applicant did not have any impetus to adduce evidence of his own (whether by way of expert testimony or otherwise) at his trial to challenge the Prosecution’s account of how the attack on the deceased had taken place. However, following the passage of the 2012 Amendment Act and our subsequent decision inCA (Re-sentencing), where this court set out the applicable test for determining whether it would be appropriate to impose the death penalty for the offence of murder, the details of the attack on the deceased became critical.35Foot Note 35×Applicant’s response and further submissions at paras 3.1–3.5.In the circumstances, it was inherently unfair for this court to impose the death penalty on the Applicant inCA (Re-sentencing)because, as Mr Mohan put it:36Foot Note 36×Applicant’s post-hearing submissions at para 5.3. … [T]here remains the real possibility that, had the nuances of the test been known [at the time the Applicant was tried], the evidence would have come out differently. So long as that possibility exists, the Applicant has been denied a fair hearing. … 116 We accept that at the time the Applicant was tried, the precise details of the attack on the deceased were not relevant, and, for that reason, no findings on this issue were made in eitherHC (Conviction)orCA (Conviction)(seeCA (Re-sentencing)at [54] and [63]). We also accept that whenever an accused is charged with having committed murder within the meaning of ss 300(b)–300(d) of the PC (for which the death penalty is now discretionary, rather than mandatory), themannerof the attack on the victim is now a matter of first importance as it would have a crucial impact on whether the accused is sentenced to life imprisonment and caning or to death. Further, we are willing to assume that accused persons who are charged with murder within the meaning of ss 300(b)–300(d) would now be mindful of the need to lead evidence relating to the precise manner in which the attack in question took place, for it would have a vital bearing on the eventual sentence that is imposed. 117 However, we do not think it follows from this that there has therefore been a miscarriage of justice in the present case. If the Applicant’s argument were accepted, it would mean thatallaccused persons who were re-sentenced pursuant to the 2012 Amendment Act after the conclusion of their trial for murder could likewise argue that they suffered a disadvantage at the re-sentencing stage because there was a “possibility” that they might have presented their evidence differently at the trial. In our judgment, this submission is untenable. It cannot reasonably be argued that a miscarriage of justice has been occasioned simply because the evidence might have emerged differently at the trial. In this regard, one should also bear in mind that at the re-sentencing hearing (whether before the High Court or, on appeal, before the Court of Appeal), the accused could have applied to the court for leave to adduce additional evidence which might have reduced his culpability for his offence. As we stated earlier, the burden of producing “sufficient material” and persuading the court, based on such material, that there has been a miscarriage of justice rests on the applicant who seeks a review of a concluded criminal appeal. The applicant cannot simply premise his application on the mere possibility that the outcome in his casecouldhave been different. 118 In the context of the Present Application, what the Applicant has to show is that there is in fact apowerful probabilitythat the outcomewouldhave been different if he had known of theCA (Re-sentencing)test at the time of his trial. The Applicant, however, has only alluded to themere possibilitythat the result in his casecouldhave been different. As we have just emphasised, that in itself is not enough. The Applicant has not furnished details of what other evidence he would have led at his trial (or, for that matter, at the re-sentencing hearing if he had decided then to seek leave to adduce further evidence) had he known of theCA (Re-sentencing)test at the time, how else he would have conducted his defence or, most pertinently, how this would have affected this court’s decision inCA (Re-sentencing). An applicant who seeks to have a concluded criminal appeal reopened cannot approach the court with the expectation that the court will proceed on mere speculation and supposition, or that it will fill in gaps in his case. On that basis alone, we would reject the argument set out at [113(a)] above. 119 As far as we can see, the only basis the Applicant could have for saying that the outcome inCA (Re-sentencing)might have been different had he known, at the time of his trial, of theCA (Re-sentencing)test is that he might have led more evidence to persuade the trial judge that he had not struck the deceased three or more times. However, as we explained at [99]–[100] above, the opinion of the majority inCA (Re-sentencing)was that the number of blows inflicted on the deceased, although relevant, wasnotdeterminative as to whether a sentence of death should be imposed on the Applicant. Even if the majority had accepted the Applicant’s evidence that he had struck the deceased only twice, they would still have been satisfied that the death penalty was warranted because the blows which the Applicant inflicted on the deceased were: (a) directed towards a defenceless victim; (b) inflicted on a vulnerable region of the body; and (c) delivered with such force that it was clear that the Applicant displayed “a blatant disregard for human life” at the time of the attack. In our judgment, therefore, it cannot reasonably be argued that the Applicant has suffered a miscarriage of justice due to his lack of knowledge of theCA (Re-sentencing)test at the time of his trial. In any event, as we pointed out earlier, the Applicant had the opportunity to apply, both at the re-sentencing hearing and at the hearing ofCA (Re-sentencing), for leave to adduce further evidence, but he did not avail himself of the opportunity at either hearing. 120 Mr Mohan has also argued that it follows from the above that the Applicant was treated unequally because future offenders who are charged with murder would have a better chance of escaping the death penalty than the Applicant (see [113(a)] above). Not only would such an offender be able to lead evidence at his trial which might put him in a better position to be considered for the alternative sentence of life imprisonment and caning, he might also “enter a plea of [guilty] on the basis that the [P]rosecution does not seek the death penalty”.37Foot Note 37×Applicant’s post-hearing submissions at para 5.4.This, Mr Mohan contends, is a violation of the Applicant’s right under Art 12 of the Constitution to the equal protection of the law. 121 In our judgment, this argument is untenable. At the time the Applicant committed the offence of murder, the death penalty was mandatory. That was the sentence whicheveryoffender (including the Applicant) could expect to receive for the offence. When Parliament passed the 2012 Amendment Act, it took the exceptional step of affording persons who had been convicted of murder before the commencement date of that Act an opportunity to be re-sentenced. This is a departure from the usual rule that statutes apply with prospective effect. If Parliament had electednotto extend the opportunity of re-sentencing to offenders such as the Applicant, neither the Applicant nor any other similarly-situated offender could have had any constitutional basis for complaint as they would have been correctly sentenced according to the law as it stood at the time they committed their offences. Their only recourse, in the event of an unsuccessful appeal against their conviction for murder, would have been to petition the President for clemency. 122 Following the change in the law, the Applicant and other offenders in the same class –ie, persons who had been convicted of murder and sentenced to deathwhile the death penalty was mandatoryfor that offence – had the same right to expect that they would be fairly and equally considered for the alternative sentence of life imprisonment and caning according to the procedure set out in the 2012 Amendment Act. The Applicant has not asserted that he was given any less of a chance than other offenders in a similar position to argue for that alternative sentence in lieu of the sentence of death originally imposed by the trial judge. It is wrong for the Applicant to compare himself with future offenders who are charged with murder because the latter belong to an entirely different class of offenders. The fact that such future offenders might, as Mr Mohan has suggested, enter a guilty plea on the condition that the Prosecution does not seek the death penalty is not evidence of unequal treatment which violates the right of equal protection under Art 12(1) of the Constitution. The decision inCA (Re-sentencing)breached therule against double jeopardy 123 We turn now to Mr Mohan’s submission at [113(b)] above that the decision inCA (Re-sentencing)breached the rule against double jeopardy. This rule, which protects a person from the perils of facing multiple trials for the same offence, is embodied in s 244 of the CPC and Art 11(2) of the Constitution. The latter provides: A person who has been convicted or acquitted of an offence shall not betriedagain for the same offenceexcept where the conviction or acquittal has been quashedand a retrial ordered by a court superior to that by which he was convicted or acquitted. [emphasis added] 124 Mr Mohan submits that the rule against double jeopardy is engaged in the instant case for the following reasons:38Foot Note 38×Applicant’s post-hearing submissions at para 6.7. (a) The re-sentencing hearing before the Re-sentencing Judge was comparable to a trial. (b) In re-sentencing the Applicant to life imprisonment, the Re-sentencing Judge could be said to have “acquitted” the Applicant of the death penalty. (c) Therefore, to allow the Prosecution to appeal against the Re-sentencing Judge’s decision and seek to re-impose the death penalty “would be to overturn the effective acquittal of the Applicant … in breach of the principle of double jeopardy”.39Foot Note 39×Applicant’s post-hearing submissions at para 6.7. 125 With respect, we find this argument untenable. When the Prosecution lodged its appeal against the sentence imposed by the Re-sentencing Judge, it was exercising its undoubted right of appeal. An appeal is not a second trial. The rule against double jeopardy is that a person cannot be made to face more than onetrialfor the same offence. It certainly does not bar anappealfrom being brought against a first-instance decision made at the end of a trial. Moreover, the Prosecution’s appeal was only against sentence. In the circumstances, we do not see how the rule against double jeopardy could possibly have been engaged, let alone breached, here. 126 In this regard, the Applicant’s reliance on the decision of the Supreme Court of the United States inArizona vDennis Wayne Rumsey467 US 203 (1984) (“Arizona”) is misplaced. American jurisprudence on the death penalty is complex, but a briefpréciswill suffice. InFurman v Georgia408 US 238 (1972), it was held that the imposition of the death penalty without adequate procedural safeguards to ensure consistency in application was unconstitutional. Since then, all death penalty jurisdictions in the United States have introduced a two-phase system. During the first phase (viz, the “trial” phase), the jury determines whether the accused is guilty of a capital offence; and during the second phase (viz, the “penalty” phase), the same jury (or, in some States, the trial judge) ascertains whether any statutory aggravating factors regulating the imposition of the death penalty exist (see, generally,Canteroand Klineat pp 5–6 and 12–17). 127 InArizona, the appellant was convicted of first-degree murder at the “trial” phase, and the question during the “penalty” phase was whether he had killed “as consideration for the receipt, or in expectation of the receipt, of anything of pecuniary value” (at 205), that being an aggravating factor which would have warranted sentencing him to death. The trial court answered this question in the negative on the basis that the statutory provision concerned applied only to contract killings. Its interpretation was overturned on appeal by the Supreme Court of Arizona, which held that the provision could also encompass situations where theft was committed in the course of a murder, and remitted the matter for the appellant to be re-sentenced. The trial court then found that the requisite statutory aggravating factor was present and sentenced the appellant to death. On appeal to the Supreme Court of Arizona, the appellant argued that a retrial of the “penalty” phase of the proceedings violated the rule against double jeopardy because that phase formally resembled a trial, in that the Prosecution was required to prove certain statutorily-defined facts beyond a reasonable doubt in order to support a sentence of death. This argument was accepted and the appellant’s sentence of death was replaced with a sentence of life imprisonment by the Arizona Supreme Court, whose decision was later affirmed by the Supreme Court of the United States. 128 Thus presented, it can be seen that the position in the United States is very different from our own. First, in Singapore, no single fact is a condition precedent to the imposition of the death penalty (see [90] above). Second, it is incorrect to compare the re-sentencing process under the 2012 Amendment Act to a trial, or to say that the decision in a re-sentencing application to impose a sentence of life imprisonment and caning instead of a sentence of death constitutes an “acquittal” in relation to the latter sentence. As this court explained inPublic Prosecutor vAniza bte Essa[2009] 3 SLR(R) 327 at [60]–[62], the sentencing process isnota “second trial”. In the premises, we see no basis for Mr Mohan’s argument that the rule against double jeopardy was violatedvis-à-visthe Applicant inCA (Re-sentencing). 129 We also reject the notion that the Applicant had any “legitimate expectation” that he would not be sentenced to death after the Re-sentencing Judge’s decision inHC (Re-sentencing). As the Public Prosecutor rightly pointed out, the Applicant failed to point to any representation made by the Prosecution that it would not appeal against a sentence of life imprisonment and caning imposed by the re-sentencing court.40Foot Note 40×Respondent’s reply submissions at para 37.The Applicant had a right to a re-sentencing decision at first instance, subject to an appeal to this court. That right was accorded to him. Until the legal process had drawn to a close, there could not have been any basis for the Applicant to assert any “expectation”, let alone a “legitimate” one, that he would only face a sentence of life imprisonment and caning instead of a sentence of death. For these reasons, the Applicant’s argument as set out at [113(b)] above is utterly without foundation.",
        "Conclusion": "130 For the foregoing reasons, we dismiss the Present Application and hold that the sentence of death imposed on the Applicant on 14 January 2015 shall stand. We direct that the stay of execution of the sentence which we granted on 5 November 2015 be lifted. The sentence will be carried into effect on such date as the President, acting in accordance with the Constitution, shall direct.",
        "Coda: some observations on procedure and practice in applications for review": "131 We would like to conclude this judgment with some remarks on procedure and practice in relation to applications to reopen concluded criminal appeals. In Hong Kong (seeHabibAhmed v Hong Kong Special Administrative Region[2010] HKCU 1761) as well as the United Kingdom, applications to reopen a final appellate court’s decision cannot be brought without leave. Applications for leave are first heard on paper and disposed of without the other party necessarily being called on to respond. 132 In this regard, where the United Kingdom is concerned, r 52.17 of the English CPR (which, as mentioned at [28] above, was introduced post-Taylor) sets out the procedure which must be adhered to when an application to review a concludedcivilappeal is brought. The relevant rules (see rr 52.17(4)–52.17(7)) provide as follows: (4) Permission is needed to make an application under this rule to reopen a final determination of an appeal even in cases where under rule 52.3(1) permission was not needed for the original appeal. (5) There is no right to an oral hearing of an application for permission unless, exceptionally, the judge so directs. (6) The judge will not grant permission without directing the application to be served on the other party to the original appeal and giving him an opportunity to make representations. (7) There is no right of appeal or review from the decision of the judge on the application for permission, which is final. Section VII of Practice Direction 52A of the English CPR lays down more detailed guidance on the form to be used and the time frame for making such applications: 7.1 A party applying for permission to reopen an appeal or an application for permission to appeal must apply for such permission from the court whose decision the party wishes to reopen. 7.2 The application for permission must be made by application notice and be supported by written evidence, verified by a statement of truth. A copy of the application for permission must not be served on any other party to the original appeal unless the court so directs. 7.3 Where the court directs that the application for permission is to be served on another party, that party may, within 14 days of the service on him of the copy of the application, file and serve a written statement either supporting or opposing the application. 7.4 The application for permission will be considered on paper by a single judge. 133 In our view, the introduction of a leave stage for applications to reopen concluded criminal appeals would better balance the rights and interests of all persons who make use of scarce judicial resources. Unmeritorious applications for review could be weeded out at an early stage, with only those which disclose a legitimate basis for the exercise of this court’s power of review being allowed to proceed. In this connection, we note that s 384 of the CPC already permits the summary rejection of appeals without the matter being set down for oral hearing provided the court is unanimously satisfied that the grounds of appeal do not disclose any sufficient ground of complaint (seeMohdFauzi bin Mohamed Mydin v Public Prosecutor[2015] SGHC 313 at [22]–[31]). There is, however, currently no equivalent provision in the CPC for post-appeal applications to reopen concluded criminal cases. 134 We think there is merit in the enactment of statutory provisions to govern post-appeal applications for review to introduce, among other things, the requirement that the leave of this court must be obtained before bringing applications of this nature. Should a leave stage be introduced, provision could also be made for the rejection of such applications without the necessity of an oral hearing or without the need for the named respondent being called on to respond. We commend these suggestions for Parliament’s consideration. Chao Hick Tin  Andrew Phang  Boon Leong  Woo Bih LiJudge of Appeal Judge of Appeal   Judge Lee Seiu Kin   Chan Seng OnnJudge   Judge Chandra Mohan K Nair (Tan Rajah & Cheah) for the applicant;Francis Ng, Zhuo Wenzhao and Marshall Lim(Attorney-General’s Chambers) for the respondent."
    }
}