{
    "case_title": "Arab Banking Corp (B.S.C.) vBoustead Singapore Ltd",
    "ncitation": "[2016] SGCA 26",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the court):",
    "sections": {
        "Background": "4 The complexity in this matter stems from the involvement of multiple entities operating in different jurisdictions on the basis of multiple agreements variously expressed to be governed by different national laws. It is therefore helpful to begin by setting out the parties and the various agreements that bound them before turning to the sequence of events that have led to the present appeal.",
        "The parties and the agreements": "5 Boustead is a public-listed infrastructure company incorporated in Singapore and involved in construction developments internationally. In 2007, Boustead, acting through a joint venture (“the JV”) with General Buildings and Constructions Co, a Libyan company, was employed by a Libyan entity, the Organisation for Development of Administrative Centres (“ODAC”), to construct a housing development in Al-Marj, Libya. Under cll 6 and 10 of the contract between the JV and ODAC (“the Public Works Contract”), the JV was obliged to procure the issuance of a Performance Bond (“the PB”) and an Advanced Payment Guarantee (“the APG”) in ODAC’s favour. The PB was intended to “guarantee [the JV’s]  proper execution” of the Public Works Contract while the APG was intended to guarantee the JV’s repayment of an advanced payment that ODAC had made to the JV upon the latter taking possession of the work site. 6 At Boustead’s request, the Bank of Commerce and Development (“C&D Bank”), a Libyan Bank, issued the PB and the APG in ODAC’s favour. The PB was issued on 28 August 2007 in the sum of US$3,760,387.95 and was due to expire on 28 July 2009. Its validity period was extended on 18 August 2009 and then again on 22 July 2010. Following the last of those extensions, the PB was valid until 28 July 2011. The APG was issued on 10 September 2007. It was initially for a sum of US$18,331,891.37 and was due to expire on 28 July 2009. Its validity period was extended on 9 September 2009, 22 July 2010 and then again on 5 January 2011 after which it was valid till 30 June 2011. The secured sum was eventually reduced to US$15,021,093.25. The PB and the APG are governed by Libyan law and subject to the non-exclusive jurisdiction of the Libyan courts. 7 Boustead also entered into a facilities agreement (“the FA”) with Arab Bank, a Bahraini bank, pursuant to which the latter agreed, among other things, to issue bank guarantees for sums specified by Boustead in favour of those Boustead nominated. The FA is governed by Singapore law and subject to the non-exclusive jurisdiction of the Singapore courts. 8 Pursuant to the FA, Boustead requested Arab Bank to issue C&D Bank two counter-guarantees (“CG38” and “CG39”; collectively “the CGs”). CG38 was issued on 17 August 2009 and was for the same sum as that secured by the PB. CG38 was due to expire on 28 July 2010 but it was extended on 19 July 2010 whereupon it was valid till 28 July 2011 (ie, the date the PB was due to expire).  CG39 was issued on 8 September 2009 and was due to expire on 28 July 2010. Its validity period was extended on 19 July 2010 and then again on 29 December 2010 to 30 June 2011 (ie, the date the APG was due to expire). CG39 initially secured a sum of US$18,331,891.37, but this was reduced to the same sum as that under the APG (ie, US$15,021,093.25). In short, the sums guaranteed under the two CGs and their respective validity periods corresponded with the sums guaranteed under the PB and APG and their respective validity periods. The CGs are governed by English law and subject to the non-exclusive jurisdiction of the English courts. 9 It is common ground that the PB, the APG and the CGs are all demand guarantees. In other words, C&D Bank was obliged to make payment to ODAC upon receipt of conforming demands under the PB or the APG. Similarly, Arab Bank was obliged to make payment to C&D Bank upon receipt of conforming demands under the CGs.",
        "Obligations under the demand guarantees and the credit facility": "10 C&D Banks’s obligation to pay ODAC under the PB is stated in the following terms: We [ie, C&D Bank] agrees (sic) to make immediate payment to [ODAC] of [any sum not exceeding US$3,760,387.95]…upon receipt of [ODAC’s] first written demand that this amount is due to [ODAC] stating that [Boustead] is in breach of [its] obligations stipulated in the [Public Works Contract] and the respect in which [Boustead] is in breach. 11 To put it plainly, C&D Bank’s obligation to make payment to ODAC under the PB would be triggered upon its receipt from ODAC of a written demand which stated: (a) that the demanded sum is due to it (such sum not exceeding the amount guaranteed under the PB); (b) that Boustead was in breach of its obligations under the Public Works Contract; and (c) the respect in which Boustead was in breach of the said obligations. 12 C&D Bank’s obligation to pay ODAC under the APG is expressed in similar terms as follows: We [ie, C&D Bank] agrees (sic) to make immediate payment to [ODAC] of [any sum not exceeding US$18,331,891.37] on receipt of [ODAC’s] first written demand stating that [Boustead] has failed to repay the advance payment in accordance [with] the conditions of the [Public Works Contract], and the amount which [Boustead] has failed to repay. 13 Thus, C&D Bank’s obligation to make payment to ODAC under the APG would be triggered upon its receipt from ODAC of a written demand which stated: (a) that Boustead had failed to repay the advance payment in accordance with the conditions of the Public Works Contract; and (b) the amount which Boustead had failed to repay. 14 Arab Bank’s obligation to pay C&D Bank under CG38 is stated in the following terms: In consideration of your issuing [the PB], we hereby unconditionally and irrevocably undertake to reimburse you on your first written demand communicated through authenticated SWIFT message or registered mail, despite any contestation on the part of [Boustead]…provided you confirm that you have received claim from [ODAC] in accordance with the terms of [the PB]… Such demand shall be supported by a written statement specifying that you have received a demand for payment under [the PB] in accordance with its terms. 15 Arab Bank’s obligation to C&D Bank under CG39 is expressed in terms which are identical to those found in CG38 except that it contains references to the APG rather than to the PB and the sum secured is also different. At this stage, we only note that a necessary condition to trigger Arab Bank’s liability under the CGs was a written statement by C&D Bank that it had received a demand for payment from ODAC under and in accordance with the terms of either the PB or the APG as the case might be. 16 Insofar as the FA is concerned, we need only be concerned with the parties’ obligations under cll 6.8 and 6.9. Clause 6.8 provides that Arab Bank shall not have any obligation to make factual determinations as to the validity or genuineness of any document delivered to it with respect to any bank guarantee it shall issue before making payment under it. It provides as follows: 6.8No Liability: [Arab Bank] shall have no obligation whatsoever to make any factual determinations as to the validity or genuineness or notice or accuracy or correctness of any certificate or statement or notice or other document delivered with respect to or under any [bank guarantee Arab Bank shall issue pursuant to Boustead’s request] (whether by the beneficiaries of the [bank guarantee] thereof or otherwise) or as to any other matters before making payment under any [bank guarantee]. 17 Clause 6.9 requires Boustead to put Arab Bank in funds immediately upon demand. It states: … [Boustead] hereby undertakes and agrees with [Arab Bank] that it shall immediately and upon demand from [Arab Bank] (which demand shall, in the absence of manifest error, be conclusive evidence of the amount owing), reimburse and/or indemnify [Arab Bank] for any amounts demanded or paid under any [bank guarantee Arab Bank shall issue pursuant to Boustead’s request]… [Boustead’s] obligations to pay such amount demanded by [Arab Bank] shall be absolute and unconditional irrespective of any…disputes of [Boustead] concerning the merits or validity or propriety of any such demands or claims or any payment made … 18 Taken together, the effect of these clauses is that Arab Bank may demand payment from Boustead upon it receiving a demand for payment from a beneficiary to which it had issued a bank guarantee at Boustead’s request. Arab Bank is not contractually required to ascertain the truth or falsity of the facts which are represented in the demand that it receives from a beneficiary. On its part, Boustead has an unconditional obligation to make immediate payment to Arab Bank upon receipt of such a demand irrespective of any disputes it may have concerning the merits, validity, or propriety of the demand. However, these clauses say nothing about the availability or otherwise of any other defences that might avail.",
        "Sequence of events leading to the present appeal": "19 Against that background as to the parties, the various agreements and their respective contractual obligations we turn to the sequence of events that led to the present appeal. 20 Unrest broke out in Libya in February 2011 while construction of the housing development was still underway. The situation escalated into a full-scale civil war. The site of Boustead’s housing development project in Libya was looted and pillaged and its plant and equipment were destroyed. As a result, its staff were evacuated from Libya on 23 February 2011 and Boustead was compelled to abandon the construction project. 21 Boustead wrote to ODAC on 13 June 2011 stating that aforce majeureevent had occurred. It asserted that the Public Works Contract was deemed terminated and that the JV was no longer required to perform its obligations under that contract. 22 As noted above, the PB and APG were due to expire on 28 July 2011 and 30 June 2011 respectively. A month or so before the PB and the APG expired, ODAC requested C&D Bank to extend the validity periods of the two instruments to 31 December 2012 or pay the full sums secured thereunder (“the ODAC Notices”). The extend-or-liquidate demand in respect of the APG was sent on 16 May 2011. The relevant part of it reads: We, hereby, request to extent (sic) the validity of [the APG] until 31/12/2012. Kindly confirm the same in writing within a week from the date of this letter, or liquidate the amount and credit it to our account … in Jumhuriya Bank. ODAC sent a similarly worded demand in respect of the PB on 19 June 2011. 23 It will be evident that C&D Bank could not, by any measure, have thought that the ODAC Notices constituted valid demands for payment under the PB and the APG. Materially, as far as the PB is concerned, the notice did not state that Boustead was in breach of its obligations under the Public Works Contract let alone particularise the respect in which Boustead was said to be in breach of the said obligations. And as far as the APG is concerned, the notice did not state that Boustead had failed to make a repayment in accordance with the conditions of the Public Works Contract; nor the amount it had failed to repay. Unsurprisingly, Boustead’s Libyan law expert at the trial, Dr Mohamed Abdulkader Tumi, whose evidence on Libyan law was not challenged by Arab Bank, testified that the ODAC Notices did not constitute valid demands in accordance with the terms of the PB and APG under Libyan law. Notwithstanding this, C&D Bank for its part made corresponding requests to Arab Bank to extend the validity periods of the CGs or pay over the amounts secured. 24 C&D Bank sent two such extend-or-liquidate requests to Arab Bank in respect of CG39. The first was sent on 25 May 2011 and the second on 20 June 2011. On 16 June 2011, Arab Bank requested C&D Bank to provide it with a copy of the PB it issued ODAC. Thereafter, on 21 June 2011, one day after receiving C&D Bank’s second extend-or-liquidate request in respect of CG39, Arab Bank requested C&D Bank to provide it with a copy of the APG it issued ODAC. At the hearing, counsel for Arab Bank, Mr Muralidharan K Pillai emphasised that it had been established in the course of cross-examination at the trial below that C&D Bank never responded to those requests. 25 Arab Bank responded to C&D Bank’s second extend-or-liquidate request in respect of CG39 on 22 June 2011 in the following terms: Kindly note, your request does not constitute a complying demand as per the terms of [CG39]. For a demand to be complying under [CG39], you have to confirm that you have received claim from [ODAC] in accordance with the terms of the [APG]… Such demand should be supported by a written statement specifying that you have received a demand for payment under the above [APG] in accordance with its terms. 26 On 22 June 2011, Boustead commenced action, by way of Originating Summons No 503 of 2011 (“OS 503”), against Arab Bank in Singapore. Among other things, Boustead sought to restrain Arab Bank from paying C&D Bank the sums secured by the CGs and from extending the validity periods of the CGs. It also sought a declaration that it was discharged from all liability to Arab Bank under CGs. Boustead argued that it was entitled to the injunction it sought because: (a) it would be in breach of United Nations Security Council Resolution 1973 (2011) for Arab Bank to make payment to C&D Bank under the CGs; (b) the Public Works Contract had been terminated by aforcemajeureevent; (c) C&D Bank’s demands against Arab Bank on the CGs were “abusive” because they were made for the collateral purpose of forcing Boustead to “give in to an indefinite extension” of the CGs to enable C&D Bank or ODAC “ride out” the political turmoil in Libya; and (d) there were “monies owing by ODAC to [Boustead] even after credit is given to ODAC for the advance payment it [had] made”. There were two affidavits that were filed in support of OS 503. One was by Mr Koh Nghee Kwang, a project director of Boustead, (“Mr Koh’s first OS 503 affidavit”) and the other was by Mr Loh Kai Keong, an executive director of Boustead. It should be noted that copies of the PB and APG which Arab Bank had earlier attempted (evidently without success) to obtain from C&D Bank were exhibited in Mr Koh’s first OS 503 affidavit. Additionally, Mr Loh stated in his affidavit that Boustead was of the view that there had been no valid demand made by C&D Bank on Arab Bank and that Arab Bank itself had confirmed this to be so. 27 OS 503 was heard on anex partebasis on 23 June 2011 and Boustead obtained the injunction it sought on a temporary basis. It informed Arab Bank of the injunction on the same day. 28 As it transpired, C&D Bank made an outright demand for payment on the same day, 23 June 2011, against Arab Bank for payment under CG39 (“the CG39 Demand”). This demand stated: … … We hereby demand [US$15,021,093.25], under [CG39] which please credit our US Dollars account with your goodselves. We confirm that we have received the a [sic] claim for [US$15,021,093.25] from [ODAC] in accordance with the terms of the above advance payment guarantee. We hereby support our demand by our written statement specifying that we have received a demand for payment under the above advance payment guarantee in accordance with its terms. … Thus C&D Bank represented to Arab Bank that it had received a valid demand from ODAC under and in accordance with the terms of the APG. 29 On 28 June 2011, Arab Bank informed C&D Bank of the court order in OS 503 and said that it was restrained from making payment under both CGs and from extending their validity periods. This did not stop C&D Bank from subsequently making two extend-or-liquidate requests in respect of CG38. The first was made on 30 June 2011 and the second shortly thereafter on 3 July 2011. These requests were followed by an outright demand for payment under CG38 (“the CG38 Demand”) made on 11 July 2011. This was made in terms similar to those found in the CG39 Demand except that it contained a reference to the sum of money secured under the PB rather than to that secured by APG. However it also contained incorrect references to “advance payment guarantee” and “advance guarantee”. The Judge considered that this did not invalidate the CG38 Demand (at [130] of the judgment which is published asBoustead Singapore Ltd v Arab Banking Corp (B.S.C.)[2015] 3 SLR 38). The parties do not take issue with this holding on appeal and we say no more about it. We refer to the CG38 Demand and the CG39 Demand collectively as the “CG Demands”. 30 On 29 June 2011, a few days after Boustead informed Arab Bank of theex parteinjunction it had obtained in OS 503, it asked Arab Bank to provide it with a copies of the ODAC demands on the basis of which the CG Demands were based. Arab Bank forwarded this request to C&D Bank on 30 June 2011. Arab Bank received the ODAC Notices from C&D Bank on 14 July 2011 and duly forwarded them to Boustead a few days later on 18 July 2011. At no stage was it ever suggested that any other notices were subsequently issued by ODAC demanding payment under the either the PB or the APG. The ODAC Notices were manifestly inconsistent with the terms of the two CG Demands which represented that C&D Bank had received demands from ODAC that were in accordance with the requirements of the PB and the APG respectively. 31 On 14 July 2011, shortly after Arab Bank received the CG38 Demand from C&D Bank, it took out an application (Summons No 3102 of 2011 (“SUM 3102”)) by which it sought, among other things, to have the service of OS 503 set aside; challenge the jurisdiction of the Singapore court to hear OS 503; and in the alternative to its jurisdictional challenge, to have the proceedings stayed on the ground that Singapore was not the proper forum to try the dispute. Ms Nehad Alkazmawi, who was employed as Arab Bank’s First Vice President of the Global Trade Finance & Forfaiting Department at the material time, filed an affidavit in support of this application on 21 July 2011 in which she expressly referred to Mr Koh’s first OS 503 affidavit and addressed various points raised there. At the hearing, Arab Bank chose to pursue only its prayer to have the service of the originating summons set aside and it succeeded, but the injunction that had been granted on 23 June 2011 was not discharged. Boustead then applied to have the deficiency in service cured and it obtained leave to serve the originating summons out of jurisdiction which it proceeded once more to effect. 32 On 17 January 2012 Arab Bank wrote to C&D Bank furnishing details of the proceedings in OS 503. It may be noted that service of the originating summons having been set aside, Boustead was at this time in the process of attempting to re-effect service on Arab Bank in Bahrain. It may also be noted that the injunction that had been granted on 23 June 2011 was still in place. Arab Bank summarised Boustead’s position in OS 503 and suggested that OS 503 was “in substance between Boustead on the one hand, and [C&D Bank] and/or ODAC on the other”. In effect, Arab Bank positioned itself as a neutral party caught between the real disputants and disadvantaged because it would “[not be] in a position to lead evidence on the substantive issues”. Arab Bank concluded by “strongly [urging C&D Bank] to engage lawyers in Singapore to make the necessary court application to be added as a defendant”. 33 C&D Bank responded on 19 January 2012. It addressed some of the allegations that Boustead had raised in OS 503 (see [26] above). It contended that C&D Bank was not covered by the sanctions contained in the relevant UNSC resolutions. It also said that Libya was the proper forum for determining whether aforce majeureevent had occurred such as to terminate the Public Works Contract. It took the view that the Public Works Contract was still subsisting. It also pointed out that Boustead’s claim that there was a net sum due from ODAC to Boustead was not substantiated. Lastly, it considered that it had “no right to be involved in any litigation” between Boustead and Arab Bank. It may be noted that while C&D Bank took pains to respond to three of the four substantive allegations that Boustead had levelled against it, it conspicuously did not address Boustead’s allegation that its demands against Arab Bank for payment under the CGs were “abusive” (see at [26] above).  We accept that Arab Bank had not notified C&D Bank of the specific basis relied on by Boustead for its contention that the demands were “abusive”. However, Boustead’s claim that the CG Demands were “abusive” was inconsistent with C&D Bank’s position that it was entitled to be paid under the CGs. Despite this, C&D Bank neither sought any details of Boustead’s contentions in this regard nor responded to it. 34 Arab Bank then brought a fresh application on 21 February 2012 to have the order granting leave to serve the originating summons out of jurisdiction set aside. On 24 April 2012, an assistant registrar set aside the order granting leave for service of OS 503 out of the jurisdiction, but did not discharge the injunction that had been granted on 23 June 2011. Boustead appealed against the assistant registrar’s decision. On 29 August 2012, the appeal was dismissed on the ground that Boustead had commenced the action with an incorrect originating process. At the same time the injunction granted on 23 June 2011 was discharged. 35 Boustead filed Suit No 730 of 2012 (“Suit 730”) against Arab Bank on the very next day. In Suit 730, Boustead sought, among other reliefs, a declaration that it was discharged from all liabilities and obligations to Arab Bank under the FA insofar as they relate to the CGs. Boustead also sought an injunction restraining Arab Bank from making payment to C&D Bank under the CGs or extending the validity periods of the CGs pending the determination of the respective liabilities of Boustead and Arab Bank towards each other under the FA. Boustead made anex parteapplication for a second interim injunction to the same effect as the first (ie, that Arab Bank be restrained from paying C&D Bank the sums secured by CGs and from extending the validity periods of those two counter-guarantees) on the same day it filed Suit 730. It was granted the second interim injunction and Boustead duly informed Arab Bank of this fact. 36 Arab Bank then made a consolidated demand under cl 6.9 of the FA for payment of US$18,781,481.20 (being the aggregate of the sums demanded by C&D Bank under the CGs) on 3 September 2012 (“the FA Demand”). It will be evident that this demand was made more than a year after Arab Bank had received the CG Demands from C&D Bank. Boustead responded by reminding Arab Bank that it was restrained from making payment. Boustead also set out its position that it disputed the validity of the CG Demands and the ODAC Notices, and that Boustead would not be making any payment to Arab Bank. Arab Bank served an event-of-default notice on Boustead under the FA on 10 September 2012 (“the EOD Notice”) and stated that the FA was “cancelled with immediate effect”. Thereafter, it commenced a counter-suit against Boustead (Suit No 784 of 2012 (“Suit 784”) on 19 September 2012 claiming the sum sought under the FA Demand, or alternatively, seeking a declaration that Boustead was liable to pay Arab Bank the sums demanded in the FA Demand. Arab Bank also sought the discharge of the second injunction restraining payment to C&D Bank. 37 C&D Bank approached Arab Bank for an update on the Singapore proceedings on 22 November 2012. Arab Bank provided a detailed response on 28 November 2012 summarising Boustead’s statement of claim in Suit 730 which was filed on 24 September 2012 and which clearly stated that Boustead took the position that (a) there were “manifest errors” in C&D Bank’s CG Demands; and (b) C&D Bank was involved in perpetrating “a fraud against Boustead”. Arab Bank again reiterated that the dispute was in substance between Boustead and C&D Bank and/or ODAC and urged C&D Bank to engage Singapore counsel and apply to be added as a defendant in the Singapore proceedings. C&D Bank responded that it did not consider itself as having a right to be involved in the proceedings between Boustead and Arab Bank. C&D Bank also asserted that Arab Bank was “fully responsible” to C&D Bank under the CGs, and that C&D Bank would help Arab Bank in the Singapore litigation by “providing any necessary documentation or information” regarding the CGs. 38 The Judge heard both suits together. Boustead contendedthat the FA Demand was made fraudulently because Arab Bank knew when it was issued that it did not in fact have any liability to C&D Bank under the CGs. It also contended that it would be unconscionable for Arab Bank to receive payment from Boustead in the circumstances at hand. The Judge found in favour of Boustead on both counts. He granted a permanent injunction restraining Arab Bank from receiving payment from Boustead under the FA Demand and from making payment to C&D Bank under the CG Demands. Consequently, he rejected Arab Bank’s claim in its counter-suit. The Judge’s decision is summarised in greater detail below. 39 This is Arab Bank’s appeal against the Judge’s decision.",
        "The Judge’s decision": "40 For present purposes, it is enough for us to set out the Judge’s decision on the following three issues: (a) Whether the FA Demand was made fraudulently. (b) Whether it would be unconscionable for Arab Bank to obtain payment from Boustead under the FA. (c) What the appropriate remedy would be in this case.",
        "The fraud issue": "59 We first consider the scope of the fraud exception under Singapore law. Thereafter, we explain why we consider that Arab Bank acted fraudulently, in the reckless sense, in making the FA Demand. Scope of the fraud exception under Singapore law 60 Where demand guarantees are concerned, it is well-established that a guarantor bank is obliged to pay promptly upon a demand being made by the beneficiary, so long as the demand falls within the terms of the guarantee. This is so irrespective of any dispute between the account party and the beneficiary, except where there is fraud.Generally, the fraud exception is meant to safeguard the account party from a dishonest call being made upon the guarantee by the beneficiary (see for exampleBrightside Mechanical and Electrical Services Group Ltd and another v Standard Chartered Bank and another[1989] 1 SLR(R) 484,Chartered Electronics Industries Pte Ltd v Development Bank of Singapore[1992] 2 SLR(R) 20 (“Chartered Electronics Industries”) andShanghai Electric Group Co Ltd v PTMerak Energi Indonesia and another[2010] 2 SLR 329 (“Shanghai Electric Group”)). These were cases where injunctions had been sought against the guarantor bank and/or the beneficiary on the ground that the beneficiary had acted fraudulently in calling on the guarantee. In such circumstances, the account party may obtain an injunction to restrain payment by the guarantor bank if it can show what may be called “common law fraud” on the part of the beneficiary which the guarantor bank has notice of (seeGKN Contractors v Lloyds BankPlc(1985)30 BLR 48 (perParker LJ) at 63 (“GKN Contractors”);Chartered Electronics Industriesat [28]). 61 Parker LJ inGKN Contractorsconsidered that a beneficiary would be acting fraudulently if it “presents a claim which [it] knows at the time to be an invalid claim, representing to the bank that [it] believes it to be a valid claim” (at 63). It will be apparent that this covers the first of the three limbs of the classic statement of fraud found inDerry v Peek(1889) 14 App Cas 337 (“Derry v Peek”), which was approved by this court inPanatronPte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 at [13]. InDerry v Peek, Lord Herschell said at 374 that to prove fraud, a false representation must be shown. This falseness is the foundation of the fraud but it is not sufficient. It must be shown to have been made eitherknowingly; or without belief in its truth; orrecklessly, indifferent as to whether it is true or false. The third limb is perhaps an instance of the second. 62 The English Court of Appeal explained the concept of recklessness as follows inAngus v Clifford[1891] 2 Ch 449 at 471 (per Bowen LJ): It seems to me that a second cause from which a fallacious view arises is from the use of the word “reckless”. Now, what is the old common law direction to juries? … [T]he old direction, time out of mind, was this, did he know that the statement was false, was he conscious when he made it that it was false, or if not, did he make it without knowing whether it was false, and without caring?Not caring, in that context, did not mean not taking care, it meant indifference to the truth, the moral obliquity which consists in a wilful disregard of the importance of truth, and unless you keep it clear that is the true meaning of the term, you are constantly in danger of confusing the evidence from which the inference of dishonesty in the mind may be drawn – evidence which consists in a great many cases of gross want of caution – with the inference of fraud, or of dishonesty itself, which has to be drawn after you have weighed all the evidence. [emphasis added] 63 Hence it would be fraudulent for a person to make a false representation, if he was recklessly indifferent to the truth or falsity of that which he was asserting at the time he made the statement. In our judgment, in a similar vein, a beneficiary that presents aninvaliddemand under a demand guarantee recklessly, that is to say indifferent to whether it is or is not a valid demand, would also be acting fraudulently. 64 We said at [60] above that the fraud exception isgenerallymeant to protect the account party from demands being made dishonestly by the beneficiary. We consider that the fraud exception has a broader scope of application which becomes apparent upon considering the rationale for the exception in the first place. The fraud exception is an application of the maxim “fraud unravels all”. The courts will not allow their process to be used by a dishonest person to carry out a fraud. Lord Diplock explained the point in the following manner inUnited City Merchants (Investments) Ltd v Royal Bank of Canada[1983] 1 AC 168 (“United City Merchants”) at 183–184: To this general statement of principle as to the contractual obligations of the confirming bank to the seller, there is one established exception: that is, where the seller, for the purpose of drawing on the credit, fraudulently presents to the confirming bank documents that contain, expressly or by implication, material representations of fact that to his knowledge are untrue. ... The exception for fraud on the part of the beneficiary seeking to avail himself of the credit is a clear application of the maximexturpi causa non oritur actioor, if plain English is to be preferred, \"fraud unravels all.\" The courts will not allow their process to be used by a dishonest person to carry out a fraud.” The principle that “fraud unravels all” was also considered as the doctrine “underlying” the fraud exception inSolo Industries UK Ltd vCanara Bank[2001] 1 WLR 1800 at [21]. 65 This is also the view of Kevin McGuinness in theTheLaw of Guarantee(LexisNexis, 3rd ed, 2013) (albeit in the context of letters of credit). The learned author writes at §§ 17.346 and 17.348: § 17.346 … The fraud exception grows not out of the nature or terms of a letter of credit itself, but rather out of the nature of the courts of common law. … few if any common law judges have ever been inclined conspicuously to further apparent injustice, or to allow the judicial system to be employed towards attaining an unjust end. … § 17.348 … A fraudulent result is self-evidently unjust. For a court to allow a fraud to be perpetrated in the face of clear evidence that a fraud is being committed would be for the court to allow its own process to be abused. No true court of common law will ever willingly do. In our judgment, there should be no distinction in the operation of the fraud exception in the context either of letters of credit or of demand guarantees. This is because the obligation that a bank assumes to a beneficiary under a performance bond is analogous to those assumed by an issuing or confirming bank to a seller under a documentary credit (seeUnited City Merchantsat 183–184). 66 We note that Rix J (as he then was) put forward a contractual basis for the fraud exception inCzarnikow-RiondaSugar Trading Inc v Standard Bank of London Ltd[1999] 2 Lloyd’s Rep 187 at 203. He took the view that a bank which had issued a letter of credit should not pay the beneficiary when there was fraud in the required sense on the basis of an implied term of the contract between the applicant for the injunction and the issuing bank that it should not do so where it knows of the beneficiary’s fraud (seeLaw of Bank Payments(Michael Brindle & Raymond Cox gen eds) (Sweet & Maxwell, 4th ed, 2010) at para 8-100). Rix J stated at 203: The fact that the rationale of the fraud exception is the law’s prohibition on the use of its process to carry out fraud…may appropriately be viewed as an authoritative expression of the source in law of the implied limitation on a bank’s mandate. It is evident he was not disputing the underlying rationale for the fraud exception. Rather, he was suggesting that that the principle that “fraud unravels all” also gives rise to an implied term in law. 67 In our judgment, given that this is what undergirds the exception, it should not matter whether the operative fraud in question is perpetrated by the guarantor bank alone or in concert with the beneficiary. In our judgment, the fraud exception should apply where, (1) the beneficiary’s demand is in fact shown to be invalid; and (2) regardless of any fraud on the part of the beneficiary, it can be shown that the guarantor bank is itself acting fraudulently in either paying the beneficiary and/or in asking to be indemnified by the account party because it either knows or has no honest belief that it is obliged to pay the beneficiary under the demand made by the beneficiary or is recklessly indifferent to that question. It should be emphasised that this does not create a wide ambit of risk or liability for guarantor banks. Fraud on the part of the beneficiary alone, without the bank being aware of it, will not suffice because the bank has undertaken a separate liability under the guarantee. But as long as the bank can be shown to have been acting fraudulently in paying under the guarantee and/or seeking to be indemnified for doing so, we are unable to see why this should not be sufficient. 68 A similar point was made by Parker LJ inGKN Contractorsin the following terms (at 63): In those cases the fraud considered was a fraud on the part of the beneficiary, and in my view plainly refers to what may be called common law fraud, that is to say, a case where the named beneficiary presents a claim which he knows at the time to be an invalid claim, representing to the bank that he believes it to be a valid claim. That, however, does not appear to me to be enough, and on the cases is not enough. It must be shown, before the principal who gave the original instructions can rely on it, that the bank was clearly aware of the fraud at the time that it paid and passed on the demand, or that the circumstances were such that the only reasonable inference was that the original demand was fraudulent.There can, however, clearly be cases where, albeit the ultimate beneficiary was not fraudulent, the bank itself may have been fraudulent. The claim presented by the ultimate beneficiary may have been presented in good faith and honesty albeit owing to some mistake was an invalid claim. In such a case, if the invalidity of the claim was known to the bank which received it, it appears to me that, if that bank were to pass on the claim as a valid claim and demand payment, it would be guilty offraud which would justify non-payment of the demand, notwithstanding that the demand on its face appeared to be valid.[emphasis added] 69 Parker LJ in this extract recognises two types of situations: (a) The first is where the beneficiary or party claiming payment under the guarantee does so in circumstances where it knows the claim is invalid. In such a case, the beneficiary has no entitlement to be paid and knows this. The beneficiary is thus acting fraudulently. But as Parker LJ notes, this is insufficient to warrant interference with the autonomous obligation under the guarantee unless it can be shown that the guarantor bank either knew that the beneficiary’s demand was fraudulent at the time the guarantor bank pays on the guarantee or that this was the only reasonable inference in the circumstances. This is the typical case where an injunction is sought to interfere with payment under a guarantee, examples of which include the cases mentioned at [60] above. In such a case, the issue is whether the court should interfere with the guarantor bank’sprima facieobligation to honour the demand that has been made pursuant to an autonomous instrument. As we have observed, the court will do so if it is satisfied that the beneficiary was acting fraudulently and the bank is aware of this before the demand has been met. (b) The second, perhaps atypical case, is where even though the beneficiary is not fraudulent, and may even have presented the demand honestly and in good faith, the demand was in fact invalid for some reason and the guarantor bank, being aware of the invalidity nonetheless chooses to honour the demand and seeks reimbursement from the account party. In such a case too, by reason of the guarantor bank’s own fraud it would not be entitled to be indemnified even though there may have been no fraud on the part of the beneficiary. The first category is distinguished from the second by the fact that in situations falling within the first there is no need for the court to make a finding that the guarantor bank was fraudulent to grant the relief sought by the account party though it must be satisfied that the fraud of the beneficiary was sufficiently brought home to it; whereas such a finding is necessary in the second. 70 We note that in the second category, Parker LJ was contemplating a situation where the beneficiary’s demand is invalid for some reason other than fraud on its part. However, the original demand may be invalid due to the beneficiary’s fraud as well, and in those circumstances, it would be possible to analyse the case as falling into either category. But if the account party attempts, as Boustead does here, to defeat the guarantor bank’s claim to be indemnified under the agreement between the guarantor bank and the account party, then the account party would have to show that the guarantor bank was acting fraudulently in asserting its contractual rights. It is also helpful to note that in such cases, it is notessentialfor the account party to establish fraud on the part of the beneficiary to succeed in preventing the guarantor bank from asserting its contractual rights against the account party though it must establish that the beneficiary was not in fact entitled to make the demand. 71 The learned authors ofLaw ofGuarantees(Sweet & Maxwell, 7th ed, 2015) (“Law of Guarantees”), Geraldine Mary Andrews QC and Richard Millet QC refer to this excerpt fromGKN Contractorsand express doubts as to whether courts would move to recognise that the fraud exception is applicable in the second category of cases identified at [69(b)] above. The authors write (at para 16-029): In theGKN Contractorscase, Parker LJ suggested that the scope of the fraud exception might embrace a different situation, namely that in which the beneficiary genuinely believed that there was a breach of contract, and made a demand, but the bank knew that there was not, and that the demand was therefore unjustified. …Although it would seemthat such a case might be a justified extension to the fraud exception, the courts are likely to be very reluctant to move towards a position in which it may be suggested that the bank should have investigated the underlying facts or the documents presented to it.…[emphasis added] 72 The authors ofLaw of Guaranteesalso suggest that a Singapore case,Rajaramv Ganesh (trading as Golden Harvest Trading Corp) and others[1994] 3 SLR(R) 79 (“Rajaramv Ganesh”), points to the conclusion that the fraud exception does not avail in the situation envisaged by Parker LJ. InRajaramv Ganesh, the account party, Mr Rajaram, requested Indian Bank to issue a bank guarantee to another bank, Oriental Bank of Commerce (“OBC”), for Mr Ganesh’s benefit. Indian Bank was obliged to pay the guaranteed amount on a particular date. Mr Rajaram alleged that there was an agreement between Mr Ganesh and him under which Mr Ganesh had agreed not to avail himself of the bank guarantee until Mr Ganesh had arranged for a sum of money to be paid to Mr Rajaram. Under the parties’ agreement, Mr Ganesh had to transfer the money by a particular date. 73 Mr Ganesh breached this agreement by failing to pay the agreed sum of money by the agreed date. Mr Rajam also alleged that OBC knew of this agreement. He obtainedex parteinterim injunctions against Mr Ganesh, Indian Bank and OBC from dealing with the bank guarantee. He also obtained summary judgment against Mr Ganesh, among other things, for an order restraining Mr Ganesh from invoking, encashing or calling on the bank guarantee. OBC applied to discharge the interim injunction. In the course of considering whether OBC should continue to be restrained, the court said at [20]: [Mr Rajaram’s] claim has an unusual aspect to it in that he accused OBC as well as [Mr Ganesh] of fraud. He alleged that OBC made fraudulent misrepresentations… It is doubtful that fraud on the part of a receiving bank can vitiate a bank guarantee if the beneficiary is innocent of it. There is no basis for denying payment to that beneficiary because of the fraud of the bank. The position is different if the beneficiary is guilty of the same fraud, in which case payment would be denied even without the bank’s complicity, so long as the bank knows of the beneficiary’s fraud. 74 The authors ofLaw of Guaranteesaccept thatRajaramv Ganeshconcerned a situation where the beneficiary’s own bank had allegedly fraudulently represented to the guarantor bank that the beneficiary was entitled to payment when it knew that he was not. In other words, this was a situation where OBC was acting as a receiving bank and not as a guarantor bank and thus the alleged fraud was in effect only on the part of the receiving parties and not on the part of a guarantor bank. However they suggest that the court’s observation that we have quoted above could “equally apply to a situation in which the paying bank [ie, guarantor bank] knows that the beneficiary is not entitled to receive payment” and yet proceeds to pay the beneficiary (at para 16-029). 75 To begin with, we do not think thatRajaramv Ganeshstands for the proposition that the fraud exception would not be made out if the fraud is only established on the part of the guarantor bank. As we stated in the preceding paragraph, in that case, fraud was never alleged as against the guarantor bank (ie, Indian Bank). However, we disagree with that case insofar as it has the effect contended for by the authors ofLaw of Guarantees. Given our explanation of the underlying rationale for the fraud exception (at [64] above), we see no reason to draw a distinction in this regard between (a) the situation where the beneficiary has made a fraudulent demand to the guarantor bank’s knowledge; and (b) one where the beneficiary’s demand is invalid and the guarantor bank in demanding to be indemnified by the account party is itself acting fraudulently. In our judgment, the true rationale that justifies an injunction to restrain a party from asserting its contractual rights in both these cases is the principle that fraud unravels all; and because the principle is, in the final analysis, being invoked to justify an injunction to restrain a party from asserting its contractual rights under anautonomous instrument, namely, the guarantee, that fraud must be brought home to the party with the liability under that instrument, namely, the guarantor bank. The fraud can be the fraud of the beneficiary in seeking payment in circumstances where it knows it is not entitled to seek such payment; or it can be the fraud of the guarantor bank in making a payment in circumstances where it knows the demand is invalid and it ought not to make the payment, or in demanding to be indemnified by the account party in the same circumstances. What is critical and what seems to us to explain both these situations is that the guarantor bank has, and knows it has, no justification for paying on a demand either because it knows it is invalid or because this is the only reasonable inference to be drawn from the circumstances. Where this is shown, the guarantor bank ought not to make the payment and if it seeks to be indemnified by the account party, this should be denied. 76 In short, both these situations are predicated on two facts: (a) That the beneficiary’s demand is in fact invalid; and (b) That the guarantor bank either knows the beneficiary’s demand is invalid, has no honest belief that the beneficiary’s demand is valid or is reckless to this fact. 77 In such circumstances, it is difficult to see on what basis the guarantor bank could be entitled to be indemnified by the account party in the latter of the two situations that we have described at [75] above. 78 We also note that the point made by Parker LJ inGKN Contractorswhich we have set out at [68] above appears to have been at least impliedly accepted by a subsequent and differently constituted English Court of Appeal inMontrodLtd v Grunkötter Fleischvertriebs GmbH[2002] 1 WLR 1975. In that case Montrod Ltd (“Montrod”) procured a letter of credit to be opened in favour of Grunkötter Fleishvertriebs GmbH (“GK”). The documentary credit was issued by Standard Chartered Bank (“SCB”), at the request of Fibi Bank (UK) plc (“Fibi”), on Montrod’s application. The credit was payable by SCB on presentation by GK of various specified documents including certificates of inspection to be issued and signed by Montrod at its discretion. GK presented the required documents to SCB, including inspection certificates apparently signed by Montrod, which on their face complied with the terms of the credit. GK had in fact signed the inspection certificates without Montrod’s authority although GK had not acted fraudulently in doing so. This is because GK had been led to believe that one of its (ie, GK’s) employees could sign the inspection certificates on behalf of Montrod. SCB informed Fibi that it had received conforming documents and relayed the documents to Fibi. Montrod subsequently informed Fibi that it had not signed the inspection certificates and Fibi conveyed this to SCB. 79 Montrod commenced action seeking a declaration that it had not issued any valid inspection certificate capable of satisfying the requirements of the credit and sought an interim injunction against GK, Fibi and SCB to prevent them from claiming or paying under the letter of credit. The application was denied on the basis that Montrod fell “miserably short” of establishing fraud on the part of the GK, or notice of such fraud on the part of SCB, but the court acknowledged Montrod’s right to renew the application if and when such evidence became available. Montrod put in a further witness statement shortly thereafter. SCB reconsidered its position in the light of the evidence that been adduced, but decided to pay GK. SCB then sought reimbursement from Fibi, but this was declined pending the court’s determination of Montrod’s claim for the abovementioned declaration. SCB sought summary judgment against Fibi in respect of its claim for reimbursement of monies paid to GK pursuant to the letter of credit and Fibi similarly applied for summary judgment against Montrod in the event of it being found liable to SCB. 80 Montrod argued that although GK was not fraudulent it was nonetheless not entitled to payment because it had presented a document which it knew was a nullity, prior to it having received payment from SCB. Montrod relied on the excerpt fromGKN Contractorscited at [68] to support its case for what was termed a separate “nullity exception” to the contractual obligation to make payment on receipt of conforming documents. Potter LJ, delivering the English Court of Appeal’s judgment, rejected the nullity exception and held thatGKNContractorslent no assistance to Montrod. He said as follows at 1987–1991: 43 … If the basis of a fraud exception is that the court will only intervene in breach of the autonomy principle for the purpose of preventing or discouraging the perpetration of fraud on the part of the beneficiary or other presenting party,it is a clear extension to hold that presentation of a document which is itself a nullity for reasons which arenotknown to the beneficiary or issuing bank at the time of presentation, are nonethe less to be similarly treated. … 55 … In [GKN Contractors], Parker LJ was considering fraud by a bank rather than by a beneficiary and was envisaging the case of a demand made under a performance guarantee by a party whom the bank knew not to be the party named as the beneficiary entitled to make the demand.He was thus not considering the case of a document which, at the time it was tendered and accepted was,unknownto the bank, false or made without authority, but a case involving fraudulent conduct by the bank itself inaccepting a claim known to be made by a person not entitled to make it and passing it on as a valid claimwithout disclosing the position to the bank's principal. … 56 … The fraud exception to the autonomy principle recognised in English law has hitherto been restricted to, and it is in my view desirable that it should remain based upon, the fraud or knowledge of fraud on the part of the beneficiary or other party seeking payment under and in accordance with the terms of the letter of credit. It should not be avoided or extended by the argument that a document presented, which conforms on its face with the terms of the letter of the credit, is nonetheless of a character which disentitles the person making the demand to payment because it is fraudulentin itself, independently of the knowledge and bona fides of the demanding party. [emphasis in bold italics in original; emphasis added in italics] It seems to us that Potter LJ did not doubt the correctness of the proposition inGKN Contractorsthat we have been considering thus far. Rather, the import of his judgment is that the presenting party will be prevented from making the claim only if the claim is in fact invalidandit can further be shown that thepresenting partyacted fraudulentlyin making the claim for payment because it knows that it is invalid. It would not suffice to demonstrate that the claim was invalid without going on to show that it was being made fraudulently. The question of whether pressing an invalid claim amounts to fraud may depend significantly on the time by reference to which the assessment is made. InMontrod, at the time the documents were first presented to SCB, they were presented innocently and with the honest belief to this effect. By the time SCB made payment to GK and demanded to be reimbursed by Fibi, several facts were known including that Montrod had not in fact issued the certificates. However, it appears that it was not clear to SCB at that point that GK was not entitled to have its employee sign the certificates on Montrod’s behalf. IfSCBwas aware by the time it made payment ofboththese facts – namely that Montrod had not in fact signed the certificates and also that GK was not entitled to sign the certificates on Montrod’s behalf – then it might well be that a different conclusion would have been reached, because it seems to us in such circumstances it could be said that SCB would have been acting fraudulently in making the payment and in demanding reimbursement from Fibi despite being aware of those facts. However the focus of the arguments was on contending that the mere fact of invalidity of the demand for payment would suffice as an independent ground, extending the fraud exception, for holding that SCB should not be entitled to be indemnified and this was rejected by the court. 81 The main concern expressed in theLaw of Guaranteesis that banks should not be required to investigate the underlying facts or be precluded from taking the documents presented to them at face value. We agree; but we do not think that our holding moves us in this direction. In general, where the instrument in question contains a clause such as cl 6.8 of the FA, which provides that the guarantor bank does not have any obligation to undertake investigations or make factual determinations as to the validity or genuineness of any documents presented to it, the guarantor bank would be perfectly entitled to act on the apparent conformity of the demand with the terms of the instrument without going further. In such circumstances, it can pay on demand and ask to be indemnified by the account party on the basis that the demand was apparently valid. However, the guarantor bank will be restrained from so acting if it is shown that (1) the beneficiary’s demand is in fact invalid; and (2) the guarantor bank has no honest belief that it is obliged to pay the beneficiary under the demand or the circumstances are such as to suggest that it was recklessly indifferent as to whether it was obliged to pay the beneficiary (that is, if the guarantor bank is itself fraudulent in honouring the demand and then claiming to be indemnified). 82 The standard of proof that the account party must meet to prove fraud on the part of the guarantor bank is no different than when fraud is alleged on the part of the beneficiary. He would have to show that the only realistic inference to be drawn on the available evidence is that the guarantor bank had no honest belief that it was obliged to pay the beneficiary or was recklessly indifferent as to whether it had to pay (Shanghai Electric Groupat [36]–[37]). We expect that it would only be in truly exceptional circumstances that the account party would be able to discharge this high standard of proof. 83 It is apposite to emphasise again one final point before we turn to the facts. Boustead in this case is seeking a declaration that it is discharged of all liabilities and obligations to indemnify Arab Bank under the FA insofar as they relate to the CGs because Arab Bank was fraudulent in making the FA Demand. The issue before us is one that concerns the relationship between the guarantor bank and its own customer and in particular whether the latter has a liability to indemnify the former in respect of a liability incurred by it pursuant to the contract between them. This makes the present case unlike the typical cases mentioned at [69(a)] above, where the account party seeks an injunction to prevent (1) the guarantor bank from paying the beneficiary and debiting its account; and/or (2) the beneficiary from receiving payment under the guarantee by alleging fraud against the beneficiary. Indeed, the learned authors ofLaw of Guaranteesstate that the “majority of cases in which an injunction has been sought to restrain payment by a bank under a performance bond or letter of credit because of fraud” have involved allegations of fraud against thebeneficiary(at para 16-028). The present case is set apart from those by the fact that Boustead is principally seeking a declaration that Arab Bank (ie, the guarantor bank) acted fraudulently in seeking to be indemnified by Boustead (ie, the account party) in the circumstances of the present case. 84 Establishing that C&D Bank was acting fraudulently would not suffice for Boustead’s purposes because if Arab Bank was innocent of that fraud, then C&D Bank’s fraud would not disentitle Arab Bank from getting an indemnity against a liability it has innocently incurred. Hence, in order to successfully avoid liability to Arab Bank, Boustead must show as between it and Arab Bank, that C&D Bank’s demand was invalid, whether because C&D Bank was itself fraudulent or otherwise; and that in seeking to honour that invalid demand, Arab Bank was acting fraudulently (in any relevant sense of that term). It seems to us that this is the classic case for holding that fraud on the part of the guarantor bank in acting to honour an invalid demandwouldsuffice to disentitle it from seeking to be indemnified by its customer. It is true that Boustead’s case here proceeds on the basis of asserting fraud on the part of C&D Bank as well; but this is done in order to demonstrate that for that reason, C&D Bank’s demand was invalid. This, as we have said, was a necessary but not a sufficient step for Boustead to establish that it was not liable to indemnify Arab Bank. 85 We now turn to explain why Arab Bank’s conduct in making the FA Demand brings it squarely (and exceptionally) within the second of the two situations of fraud that we have mentioned at [75] above. Arab Bank acted fraudulently in the reckless sense (1) The CG Demands are invalid because C&D Bank made the CG Demands fraudulently in the reckless sense 86 We agree with the Judge that C&D Bank was fraudulent, at least in the sense of having been reckless, in making the CG Demands. We come to this conclusion largely for the same reasons as the Judge. The reasons we set out below should be considered cumulatively. 87 First, the ODAC Notices were obviously non-compliant. They did not satisfy all the conditions that had to be met for a demand made under the PB or the APG to be valid (see [23] above). We consider that the fact that C&D Bank made the CG Demands notwithstanding the obvious non-conformity of the ODAC Notices is a consideration of critical importance in ascertaining C&D Bank’s state of mind at the time it made the CG Demands. This leads to the second point. 88 C&D Bank had initially made extend-or-liquidate demands that tracked the ODAC Notices (see [24] above). It made the CG Demands only after it had been told by Arab Bank on 22 June 2011 that the extend-or-liquidate demands were not compliant and that it had to state that it had received a claim from ODAC which conformed with the terms of the APG in order for its demand under CG39 to be valid (see [25] above). C&D Bank then made the CG Demands reciting the required formulae but as we have noted at [30] above, ODAC never issued compliant demands under the PB and the APG contrary to the representation made by C&D Bank in the CG Demands. 89 Arab Bank contends that C&D Bank might simply have been negligent in making those demands. The clerk at C&D Bank who prepared the demands might not have known that the ODAC Notices were deficient. Alternatively, he might have referred to other documents that C&D Bank and ODAC entered into to extend the validity periods of the PB and the APG when he was assessing whether the ODAC Notices constituted valid demands. C&D Bank’s obligation was expressed in the following terms in those other documents: We agree to pay you [the respective amounts under the PB and APG] on your first demand notwithstanding any contestation from [Boustead]. The ODAC Notices would be regarded as valid demands under this formulation of BCD’s obligation to ODAC. 90 It might theoretically be possible that the CG Demands were made as a result of the negligence of a clerk at C&D Bank. However, as Boustead points out,United Trading Corporation SA and Murray Clayton Ltd v Allied Arab Bank Ltd and others[1985] 2 Lloyd’s Rep 554 at 561 (“United Trading”) establishes that it is not necessary for “every possibility of an innocent explanation [to be] excluded” before the fraud exception is made out. That would pitch the standard of proof too high and so render the principle that “fraud unravels all” meaningless. In our judgment, given that C&D Bank had been put on notice about the importance of complying demands, it simply cannot be said that the CG Demands just happened to contain patently false statements. 91 Third, as the Judge put it, C&D Bank’s “core duty was to examine the documents presented to it”. C&D Bank would have been fraudulent in the sense of being recklessly indifferent to the truth or falsity of its assertions contained in the CG Demands if it had mechanically made those demands, simply following the requirements set out in Arab Bank’s message to C&D Bank on 22 June 2011 notifying it that it had to state that it had received a complying demand from ODAC in order for its demand to be valid. 92 Fourth, we consider that we are entitled to rely on C&D Bank’s failure to answer the allegations of abusive conduct and fraud that were made against it to draw the inference that it acted fraudulently in making the CG Demands. InUnited Trading, the English Court of Appeal noted at 561 and 564 that if a beneficiary is charged with making fraudulent claims on a demand guarantee, and that beneficiary fails to explain its conduct notwithstanding the fact that it had been given opportunities to do so, then the courtmayrely upon the beneficiary’s silence for the purpose of finding that that party had been fraudulent in making its claim against the guarantor bank. Here, C&D Bank chose not to answer the allegations of abusive conduct and fraud made against it by Boustead which were conveyed to C&D Bank through Arab Bank on two occasions – first on 17 January 2012 (see [32] above) and then again on 28 November 2012 (see [37] above). 93 Arab Bank contends that no adverse inference ought to be drawn against C&D Bank from its failure to provide satisfactory responses to these allegations because C&D Bank had a legitimate reason to not respond to Boustead’s allegations: it had all along taken the position that the underlying dispute between Boustead and ODAC should be resolved in Libya. Arab Bank argues that the present case is on all fours withUnited Tradingwhere, although the court held that adverse inferences can be drawn from a beneficiary’s silence to charges that it was making fraudulent claims on demand guarantees, the court in fact declined to do so because it considered that it was legitimate for the beneficiary in that case to not respond to allegations of fraud. This argument has to be tested by carefully considering the facts inUnited Trading. 94 The underlying contracts inUnited Trading(ie, the equivalent of the Public Works Contract here) were between the plaintiffs and an Iraqi entity called “Agromark” and contained clauses vesting exclusive jurisdiction in Iraq. The contracts were for the supply of goods from the plaintiffs to Agromark. The plaintiffs were required to secure performance of their obligations under the contracts by procuring performance bonds in favour of Agromark from Rafidain, an Iraqi state bank. The plaintiffs did not directly instruct Rafidain to issue Agromark the performance bonds. Rather, they did so through a chain of banks, much like the arrangement in the present case. War broke out between Iran and Iraq, giving rise to considerable disruption in the performance of the plaintiffs’ contracts with Agromark. Agromark subsequently called on the performance bonds. The plaintiffs took the view that the calls were “manifestly fraudulent” because they had performed all the contracts which were related to the performance bonds and no disputes had arisen under those contracts. The calls were intended to bring pressure to bear on the plaintiffs for the resolution of a dispute which had arisen in respect of an entirely separate transaction. The plaintiffs commenced two actions. One was against a number of banks in the chain, and the other was against Rafidain and Agromark. In those actions, the plaintiffs sought and obtainedex parteinjunctions against the banks, including Rafidain, restraining payment to the plaintiffs. The injunctions were, however, discharged atinterparteshearings. The plaintiffs appealed to the English Court of Appeal. 95 At the hearing of the appeal, the plaintiffs placed “considerable reliance on Agromark’s failure to disclose its defence to the charge of fraud” (at 564). The court noted that Agromark initially chose to make no reply at all to any of the plaintiffs’ charges against it and even when it did eventually provide a response, it was careful to not go into the merits of the dispute between the plaintiffs and Agromark. The court opined that Agromark chose this course of action so as not to do anything that would result in it submitting to the jurisdiction of the English Courts or “being indirectly drawn into litigation in [England]”. It was legitimate for it to do so. Therefore the court declined to draw any inference of fraud from Agromark’s fraud. The following excerpt from the court’s decision is instructive (at 564–565): … [I]n this case it must be borne in mind that Agromark is not a defendant to the main action. Nevertheless, Agromark was given an opportunity when B.B.I. telexed on June 5, 1984 (D54), putting on record in regard to the chicken contract that the plaintiffs alleged that the contract had been fully performed and invited comments from Rafidain, Agromark's bankers. On June 4 and June 8, 1984, in regard to the 1984 contract, the plaintiffs asserted direct to Agromark that they were guilty of wrongful repudiation of the contract and that their claim under the performance bond was manifestly fraudulent.Agromarkmade no reply.On June 12, 1984, on the requirement of Mr. Justice Neill, the plaintiffs telexed to Agromark the whole of the first affidavit of Mr. Samrai.Again there was total silence.… On June 27, 1984, the manager of the London branch of Rafidain spoke with the president of the bank who had made contract with Agromark and who had responded as follows. They insisted that they had called the bonds because the plaintiffs were in breach of contract. They disputed that the plaintiffs had any right to apply to the English Courts, since the contracts with the plaintiffs were subject to Iraqi law and the plaintiffs had agreed to the exclusive jurisdiction of the Iraqi Courts. Accordingly, Agromark would insist upon its rights and would not be prepared to litigate the plaintiffs' claims in a forum which was different from the one agreed between the parties.In a subsequent conversation on the same day, the president said that the general manager of Agromark, Mr. N. A. Mehdi, maintained that Agromark was entitled to call each of the performance bonds because the plaintiffs were in breach of contract. During the following morning there was a further conversation with the president, from whichit wasapparent thatAgromark had not disclosed details of its allegations.Despite a further telex sent on July 2, 1984, to the president asking him to continue in his efforts to obtain information from Agromark and emphasizing the importance of this information, nothing further had been provided. Very shortly before we concluded the hearing of the appeal we were provided by Rafidain with a draft of an affidavit to be sworn by Mr. Rands, a solicitors in the firm of Memery Crystal & Co., Agromark's solicitors. The affidavit was to be sworn in support of their application that the order giving leave to serve the writ in the second action out of the jurisdiction be set aside.The affidavit does not go into the merits of the dispute between the plaintiffs andAgromark.The point is again made that each contract between the plaintiffs andAgromark was made and was to be performed in Iraq, is subject to Iraqi law and contains an Iraqi jurisdiction clause.… In the light of this material, there is a wholly understandable reason for Agromark not being prepared to answer in any detail the claim made against them by the plaintiffs. Quite clearly Agromark do not wish to submit to the jurisdiction of the English Courts and quite understandably take the view that it is Iraqi law that has to be applied to the resolution of the disputes and, pursuant to the exclusive jurisdiction clause, that litigation should take place in Iraq. It seems to us that those advising Agromark are justified in being wary of taking any steps that might be said to result in Agromark submitting to the jurisdiction of the English Courts or, even without submitting to the jurisdiction, being indirectly drawn into litigation in this country concerning a dispute which they understandably consider has no place here. In these circumstances we do not consider that we are entitled to draw any strong inference of guilt from Agromark's silence. [emphasis added in italics and bold italics] 96 In our judgment, there are material differences between the position taken by Agromark and that taken by C&D Bank in present case. Unlike Agromark which maintained complete silence or gave cautious responses which indicated its desire not to be drawn into the litigation in England, C&D Bank did not show any hesitation in putting down on record its responses to all of Boustead’s assertions, other than the allegation that the CG Demands were “abusive” (see [33] above). C&D Bank also sought an update on the Singapore proceedings from Arab Bank in response to which it was informed that Boustead was taking the position that C&D Bank was involved in perpetrating “a fraud against Boustead”. C&D Bank replied saying that it did not consider itself as having a right to be involved in the proceedings between Boustead and Arab Bankbutoffered to help Arab Bank in the Singapore proceedings by suggesting that it could provide documents and/or information concerning the CGs (see [37] above). C&D Bank’s failure to make enquiries about the specifics of Boustead’s fraud and abuse allegations and its failure to satisfactorily respond to those allegations are suspicious given its readiness to indirectly participate in the Singapore proceedings in other respects. In the circumstances, we are satisfied that C&D Bank’s failure to provide satisfactory, or for that matter, any responses to the allegations of fraud and abuse support the finding that it had been fraudulent in making the CG Demands. 97 We emphasise that we have considered these factors cumulatively rather than individually and we have no difficulty, on this basis, in concluding that C&D Bank was acting fraudulently in making the CG Demands. The CG Demands are hence not valid demands. (2)Arab Bank was recklessly indifferent as to whether it had an obligation to pay C&D Bank under the CGs when it made the FA Demand 98 We consider that the following, when taken cumulatively, demonstrate that Arab Bank was recklessly indifferent as to the patent invalidity of the CG Demands and hence as to question of whether it had an obligation to pay C&D Bank under the CGs when it made the FA Demand: (a) Arab Bank is a financial institution that appears to deal regularly with instruments such as demand guarantees. Ms Nehad, one of Arab Bank’s principal witnesses at the trial, occupied a senior position in a dedicated department in the bank which dealt with global trade-related transactions involving such instruments. (b) Arab Bank was clearly aware that its obligations under the CGs would only be triggered if C&D Bank had received conforming demands from ODAC. This is because, having received two non-compliant demands from C&D Bank in respect of CG39, Arab Bank notified C&D Bank that that it had to state that it had received a claim from ODAC which conformed with the terms of the APG in order for its demand under CG39 to be valid (see [25] above). (c) On Ms Nehad’s instructions, Arab Bank requested C&D Bank to provide it with copies of the PB and the APG in June 2011 (see [24] above). Ms Nehad said in the course of cross-examination that she had instructed that the requests be made because Boustead had asked for copies of the PB and the APG. Indeed, there are letters from Boustead to Arab Bank where the former had asked the latter to ascertain the basis for C&D Bank’s extend-or-liquidate requests. But it is also important to note that Arab Bank’s request to C&D Bank in respect of the PB states that it wanted a copy of the same for the purposes of “[its] records”. As we noted, C&D Bank did not respond to these requests. However, Arab Bank was eventually given these documents because they were exhibited in Mr Koh’s first OS 503 affidavit (see [26] above) which was filed on 22 June 2011 and served on Arab Bank shortly thereafter. Arab Bank responded to the points contained in Mr Koh’s first OS 503 affidavit by way of an affidavit filed in SUM 3102 on 21 July 2011. (d) Upon receipt of the papers in OS 503 affidavit, Arab Bank would have been put on notice that Boustead was taking the position that C&D Bank had not made any valid claims against Arab Bank on the CGs and that C&D Bank’s demands against Arab Bank on the CGs were “abusive” (see [26] above). Arab Bank conveyed a summary of Boustead’s arguments in OS 503 to C&D Bank in January 2012. As stated at [33] above, while C&D Bank took pains to respond to three of the four allegations Boustead had levelled against it, it conspicuously did not address Boustead’s allegation that its demands against Arab Bank for payment under the CGs were “abusive”. (e) By 14 July 2011, Arab Bank had also acquired copies of the ODAC Notices (see [30] above). We do not see how it is material that Arab Bank had only asked for and acquired the ODAC Notices from C&D Bank on Boustead’s request. (f) The ODAC Notices were manifestly non-compliant with the PB and APG. In our judgment any banker who compared those notices against the requirements for a valid demand stipulated in the PB and the APG could not reasonably have concluded that they constituted conforming demands. This was also the effect of the unchallenged expert evidence at trial.  We are concerned here with Arab Bank’s state of mind when it made the FA Demand on 3 September 2012. In our judgment, on the facts that are before us, if before making the FA Demand, Arab Bank had directed its mind to the PB, the APG and the ODAC Notices, as, in these particular circumstances, we are satisfied it either did or ought to have done, it could not have honestly believed that it was obliged to honour any demand from C&D Bank that was predicated upon the ODAC Notices. (g) The “particular circumstances” we have just referred to are these. Arab Bank had clearly demonstrated that it was aware that the obligations of the various parties along the banking chain would only be triggered upon the receipt of conforming demands at every stage. It did so by way of its advice to C&D Bank set out at (b) above. In addition as we note at (d) above, it knew that Boustead was taking the view that C&D Bank had not made any valid demands against Arab Bank on the CGs and that C&D Bank’s demands against Arab Bank on the CGs were “abusive”. It also relayed Boustead’s position in OS 503 to C&D Bank. C&D Bank responded to all of Boustead’s allegations apart from that related to the question of whether its demands on Arab Bank were “abusive”. C&D Bank did nothing to convince Arab Bank of the propriety of its CG Demands. It also ought to be recalled that C&D Bank made the CG Demands in June and July 2011. There are no suggestions whatsoever that C&D Bank had taken any steps to satisfy Arab Bank of the propriety of the CG Demands between then and September 2012, when Arab Bank made the FA Demand on Boustead. There are also no suggestions that it got ODAC to issue new, complying demands under the PB and the APG. In other words, nothing had changed in the 15 or so months that elapsed between C&D Bank’s CG Demands and Arab Bank’s FA Demand to dispel the concerns that Boustead had raised as to the propriety of the CG Demands. The upshot is that at the time Arab Bank made the FA Demand, there was a longstanding allegation that C&D Bank was acting abusively, and that this disentitled C&D Bank to the sums it was demanding. There was no satisfactory explanation from C&D Bank in the intervening period of more than a year which could have assuaged the concern that its demands were “abusive”. In the circumstances, we consider that it would have been indefensible for Arab Bank to turn a blind eye to the documents in its possession. Indeed, this would be a pointed example of reckless indifference on the part of a guarantor bank as to whether it in fact had an obligation to pay the beneficiary under the demand guarantee. The “moral obliquity” of such conduct that warrants the label of fraud and the consequences that flow therefrom lies in the guarantor bank’s wilful disregard of the question of whether it was obliged to pay the beneficiary under the demand. 99 The purport of our holding in this case should not be mistaken. We reiterate that, in general, assuming that the relevant contract between the parties allows the guarantor bank to act on apparently conforming documents without having to concern itself with the validity or genuineness of any documents presented to it, it will be under no obligation to ask for all the documents that have been presented along the banking chain to satisfy itself that the demand it receives is in fact a valid one. This truly is an exceptional case where the guarantor bank came into possession of such documents in circumstances where it would have been reckless for it not to have directed its mind to those documents. Had it given those documents due consideration, it would have been impossible for it continue to hold any honest belief that the beneficiary was entitled to payment. It would be fraudulent for the guarantor bank in such circumstances to then demand to be indemnified by the account party.",
        "Unconscionability issue": "100 On the view we have reached on the fraud issue, there is no need for us to express concluded views on the merits of Boustead’s argument that it would also have been unconscionable for Arab Bank to receive payment from Boustead. However, at the hearing we ventured the possibility that there might be a preliminary hurdle that forecloses Boustead’s argument based on unconscionability. This concerns the question of whether the unconscionability exception can form the basis for an order restraining Arab Bank from receiving payment from Boustead on facts such as the present where there has been a full trial and determination of Boustead’s liability to Arab Bank under the FA Demand. We make a number of observations on this issue purely as matters that should be considered on a future occasion if and when the need should arise. 101 A performance bond is essentially a guarantee provided by the guarantor bank to the beneficiary on behalf of the account party that the account party will duly perform his obligations under the underlying contract with the beneficiary (seePoh Chu Chai, Guarantees and Performance Bonds (LexisNexis, 2nd ed, 2012) at pp 549–550).Performance bonds are meant to secure the account party’s secondary obligation to pay the beneficiary damages if it breaches its primary contractual obligations (JBE Propertiesat [10]). In general, the beneficiary requests a performance bond to be opened in its favour so that any payment it claims is due is paid initially to it, despite the existence of any dispute over its actual entitlement and over any alleged contractual breaches on the account party’s part. The financial position of the parties is left to be resolved subsequently either by agreement or upon the conclusion of proceedings to resolve the underlying disputes (see Peter Ellinger & Dora Neo,The Law and Practice of Documentary Letters of Credit(Hart Publishing, 2010) at pp 325–326). 102 While the performance bond serves a valuable commercial function, there is a potential for it to be used as an “instrument of oppression” (BS Mount Sophia Pte Ltd v Join-Aim Pte Ltd[2012] 3 SLR 352 at [27] (“Mount Sophia”)). This point was put across in the following manner inJBE Properties(with a particular focus on the impact of such abusive calls on applicants who are participants in the construction industry)(at [11]): [W]here a call is made in bad faith, especially a call for payment of a sum well in excess of the quantum of the beneficiary’s actual or potential loss, the beneficiary will gain more than what it has bargained for. Furthermore, if the amount paid to the beneficiary pursuant to a call is subsequently proved to be in excess of the quantum of its actual loss, the obligor runs the risk of being unable to recover any part of the excess amount should the beneficiary become insolvent. Yet another relevant consideration is that an excessive or abusive call can cause unwarranted economic harm to the obligor. This is particularly relevant in the context of the construction industry, where liquidity is frequently of the essence to contractors. In this regard, while the sum stipulated to be paid under a performance bond is usually pegged at only 5% to 10% of the contract price, this typically amounts to one or more progress payments under a building contract. In very large building contracts, the deprivation of a whole progress payment might well be fatal to the contractor-obligor’s liquidity. These concerns are by no means fanciful, as evidenced by the mechanisms evolved by the construction industry to ensure the quick settlement of disputes relating to progress payments. 103 The court inMount Sophiaalso recognised that the beneficiary might well have an equally compelling interest in receiving immediate payment pending resolution of the substantive dispute (at [29]): Looking at theother side of the coin, so to speak, whilst we noted in [JBE Properties] that considerations of liquidity were often of crucial significance tothe obligor; the deprivation ofthe beneficiary’sright to call on the performance bond couldequally wellbe very detrimental to its liquidity as well as detrimental to its prospects pending the resolution of the substantive dispute. [emphasis in original] 104 It is evident that the Singapore courts have developed unconscionability as a distinct ground for the grant of injunctions to restrain payment on a demand made under a performance bond in an attempt to strike the appropriate balance between the competing interests that are at stake in these situations. Essentially, it seems to us that the unconscionability exception exists because we recognise that in certain circumstances, even where the account party cannot show that the beneficiary had been fraudulent in calling on the bond, it would nevertheless be unfair for the beneficiary to realise his securitypending resolution of the substantive dispute. In other words, on one view, the unconscionability exception serves to protect the account party from unfair demands by the beneficiary to have the secured sum in hand in circumstances where there has not yet been a final determination as to whether he is actually entitled to that sum. On this view, it would be doubtful whether the unconscionability exception has any relevance where the substantive dispute under the primary contract has been finally resolved. In that situation, the account party’s liability (or lack thereof) to the beneficiary would already have been assessed. Therefore there would no longer be any question of whether it would be fair to allow the beneficiary to receive payment under the performance bond. The only question remaining is whether there is an entitlement to such payment. 105 We note that the present case does not fall squarely within the type of situation envisaged in the preceding paragraph. For one, the FA Demand was made pursuant to a credit facility and not a performance bond. This might not be a material distinction (see the Judge’s reasons for extending the scope of applicability of the unconscionability exception to cover a situation involving a demand made under a credit facility set out at [52] above). But even then, there might be a further point of distinction. It could be argued that while Boustead’s liability to Arab Bank under the FA Demand has been considered and finally determined, there has not been a final determination of the substantive dispute as between Boustead and ODAC under the Public Works Contract, which, it might be said, is the true underlying contract for present purposes. In the circumstances, the unconscionability exception might conceivably still have been relevant. However, as we have noted there is no need for us to determine this issue in the present case and it would not be appropriate for us to do so here since we did not have the benefit of full arguments on this point.",
        "Appropriate remedy": "106 Arab Bank contends that the permanent injunction the Judge granted has the potential of causing it undue hardship. It would not be able to claim payment from Boustead even if it were found liable to C&D Bank for the sums demanded under the CGs in the appropriate forum (presumably referring to the English courts). It submits it would be more appropriate to grant a conditional injunction restraining it from receiving payment from Boustead under the FA Demand pending the determination of its liability to make payment to C&D Bank under the CGs by an English court. Alternatively it seeks a declaration which would have the same effect. 107 We reject Arab Bank’s argument on this issue. There is no basis to grant a conditional injunction once the issue of fraud has been finally resolved by a Singapore court after a full trial of the matter in Boustead’s favour. Additionally, Arab Bank did not challenge the jurisdiction of the Singapore court to hear Suit 730. It should have done so if it thought the suit raised issues which were more appropriately dealt with elsewhere. Instead, it contested Boustead’s claims on the merits and also commenced a suit against Boustead in which it sought substantive reliefs in its favour. Having failed on the merits, Arab Bank cannot rely on the possibility of hardship arising from a foreign court reaching a different conclusion on some of the issues when the relevant issues as between it and Boustead have been conclusively determined by a Singapore court. Finally, we also note Arab Bank could have chosen to apply to join C&D Bank to the present proceedings to ensure that C&D Bank would be bound by the court’s determinations. If it had successfully done so, C&D Bank would likely be estopped from raising the issue of Arab Bank’s liability to pay on the CG Demands in a different forum. In those circumstances, Arab Bank would have avoided the hardship that it now says could eventuate from a permanent injunction but it chose not to avail itself of this. Instead, it limited itself to politely asking C&D Bank to intervene in the proceedings. Arab Bank must now live with the consequences of its choice. Having said this, Arab Bank, can if it wishes, apply to be discharged of the injunction that restrains it from paying C&D Bank since Boustead’s only interest is in the discharge of its obligation to pay Arab Bank.",
        "Issues that arise in this appeal": "56 We consider that the following issues arise in this appeal: (a) Whether, as a matter of Singapore law, it can be said that Arab Bank made the FA Demand against Boustead fraudulently; (b) Whether the unconscionability exception under Singapore law can form the basis for an order restraining Arab Bank from receiving payment from Boustead, even in circumstances where there has been a full trial and determination of Boustead’s liability to Arab Bank under the FA Demand; (c) If the answer to (b) is affirmative, whether it would be unconscionable for Arab Bank to receive payment from Boustead under the FA Demand in the circumstances of this case; and (d) What the appropriate remedy should be in this case.",
        "Our decision": "57 Although we have listed four distinct issues, it is not the case that all of them will necessarily fall to be decided. For instance, the question of remedies will only arise if Boustead establishes that it has a substantive right to relief; and on the other hand, it may not be necessary to reach the issues on unconscionability if we find for Boustead on the question of fraud. 58 In gist, we consider that Arab Bank acted fraudulently, in the reckless sense, in making the FA Demand. Given our decision on the fraud issue, we consider that there is no need for us to express concluded views on the issues set out in [56(b)] and [56(c)] above. Lastly, we agree with the Judge that a permanent injunction is warranted in this case. We now set out our reasons.",
        "Conclusion": "108 In the premises we dismiss the appeal with costs to be taxed if not agreed. Sundaresh Menon        Andrew Phang Boon Leong          Quentin LohChief Justice         Judge of Appeal                     Judge Pillai K Muralidharan, Sim Wei Na, Foo Ming-En Mark and Tan Yehna, Andrea (Rajah & Tann Singapore LLP) for the appellant;Tan Chee Meng SC, Josephine Choo and Charmaine Neo and Ng Shu Ping (WongPartnership LLP) for the respondent."
    }
}