{
    "case_title": "Huang LipingvPublic Prosecutor",
    "ncitation": "[2016] SGCA 43",
    "coram": "Andrew Phang Boon Leong JA (delivering the grounds of decision of the court):",
    "sections": {
        "Introduction": "1 Criminal Motion No 25 of 2015 (“CM 25/2015”) concerned an application for leave, pursuant to s 397(1) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”), for the Court of Appeal to answer certain questions of law relating to s 57C(2) of the Immigration Act (Cap 133, 2008 Rev Ed) (“the Questions”). The application was wholly unmeritorious and turned out to be nothing more than an attempt to challenge the findings of fact made by the courts below under the guise of referring “question[s] of law of public interest” to the Court of Appeal. 2 The present grounds of decision are not focused on the merits of the application, which are patently lacking (as will be detailed below), but on the Prosecution’s request that costs be imposed against the Applicant. After considering all the circumstances, it was with some reluctance that we eventually decidednotto impose costs against the Applicant. However, in the light of an increasing number of such unmeritorious applications that are coming before this court, we find it appropriate to set out our views regarding the imposition of costs for such applications. 3 Before doing so, we briefly state the facts surrounding the application in CM 25/2015 and our reasons for declining leave to refer the Questions to the Court of Appeal.",
        "Facts": "4 The Applicant had been convicted in the District Court for a charge under s 57C(2) of the Immigration Act (“the Act”) for arranging a marriage of convenience between two individuals known as “Tay” and “Bai” so that Bai, a Chinese national, could extend her stay in Singapore through a long term pass. Both Bai and Tay pleaded guilty to, and were convicted of, an offence under s 57C(1) of the Act for entering into a marriage of convenience. The District Judge found that the Applicant had suggested the marriage, provided money to Tay to enter into the marriage, and had secured the venue, wedding rings and witnesses for the solemnisation ceremony. In the premises, the District Judge sentenced the Applicant to eight months’ imprisonment. The Applicant brought an appeal against her conviction and sentence to the High Court. The High Court Judge accepted the findings made by the District Judge and dismissed the Applicant’s appeal.",
        "The application": "5 The above events led the Applicant to file the CM 25/2015 wherein she sought leave for the following questions to be answered by the Court of Appeal (ie, the Questions): 1. Section 57C(2) of the Immigration Act (Cap 133) (IA) makes it an offence when any person :- (a) arranges (b) intentionally (c) in assisting a marriage (d) to obtain animmigration advantage. The meaning of each of this [sic] words, especially “arrange” or “arranges” is a question of law of public interest as it will determine the scope or ambit of the section. 2. In what circumstances or when is an offence under section 57C(2) IA committed, is it in procuring or suggesting or requesting a party to contract a marriage or is it made out when all that the Applicant does is in making available the venue for marriage, getting the rings and securing a witness or does it involve the Applicant doing both procuring a party to the marriage and doing such acts facilitating the marriage such that “and” be read conjunctively or disjunctively. 3. Alternatively, what is the meaning of the word “arrange” or “arranges” in the context of s 57C(2) IA, does it constitute the procurement, suggestion or hints to a party to contract a marriage such that if at the altar one of the parties to the marriage refuses to be betrothed the offence is completed or otherwise. [emphasis in original] 6 In support of her application, the Applicant argued that she “had never accosted, induced or even requested Tay to marry Bai” and “had not suggested or pleaded with Tay to extend Bai’s stay in Singapore”. She further submitted that, at its highest, the evidence of Tay revealed that Tay had made the independent decision to marry Bai. The Applicant’s involvement was allegedly restricted only to securing the venue, rings and witnesses for the marriage.",
        "Our decision": "7 As noted above, we denied leave for the Applicant to refer the Questions to the Court of Appeal. 8 The law with respect to when leave should be granted under s 397(1) of the CPC is clear and was recently affirmed by this court inLee Siew Boon Winston v Public Prosecutor[2015] SGCA 67 (“Winston Lee”) at [6]. Four conditions must be satisfied before leave can be granted: (a) First, the reference to the Court of Appeal can only be made in relation to a criminal matter decided by the High Court in exercise of its appellate or revisionary jurisdiction. (b) Secondly, the reference must relate to a question of law and that question of law must be a question of law of public interest. (c) Thirdly, the question of law must have arisen from the case which was before the High Court. (d) Fourthly, the determination of that question of law by the High Court must have affected the outcome of the case. 9 In our judgment, each of the Questions failed to satisfy at least one of the four conditions. From both the written and oral submissions canvassed before us by the Applicant’s counsel, it was evident that the dissatisfaction which the Applicant had against the lower courts’ decisions had nothing to do with the answers to any purportedquestions of law. Rather, her dissatisfaction was with the District Judge’s and High Court Judge’s refusal to find,as a matter of fact, that Tay had made the independent decision to marry Bai and that the Applicant’s involvement was limited only to securing the venue, rings and witnesses for the marriage. Essentially, through this criminal reference, the Applicant was attempting to reargue her position that her limited role in the entire sequence of events (an account of events which was rejected by the lower courts) could not amount to her having “arranged” the marriage of convenience. 10 This was clearly a case in which there werenoquestions of law – let alone questions of law of public interest – that arose for consideration by this court. On the contrary, all the arguments proffered by counsel for the Applicant were mere reprises of arguments that had already been tendered in the courts below and which related (only) to issues offact. More precisely, all these issues related to theapplicationof the relevant law to thefactsof the case (in this case, whether the relevant facts demonstrated that an “arrangement” had been entered into within the meaning of s 57C(2) of the Act). 11 Counsel for the Applicant, Mr S K Kumar (“Mr Kumar”), attempted, instead, to turn the logic of the matter on its head by arguing that a question of law arose as to the meaning of the word “arrangement”. However, whether or not there is an “arrangement” within the meaning of the provision just mentioned depends on thefactsand the argument by Mr Kumar is, with respect, not only misconceived but also irretrievably circular in nature. Indeed, as this court observed inPublic Prosecutor vTeo Chu Ha[2014] 4 SLR 600 at [31]: … As a matter of principle, the courts must determine whether there is sufficientgeneralityembedded within a proposition posed by the question which is more than just descriptive but alsocontainsnormativeforce for it to qualify as a question oflaw; a question which has, at its heart, a proposition which isdescriptiveandspecificto the case at hand is merely a question offact. … [emphasis added in italics, bold italics and underlined bold italics] 12 We would add that it was precisely this misguided attempt to recast the Applicant’s grievances as “questions of law” that one of the Questions posed was in facta hypotheticalscenariowhich had no bearing on the case whatsoever– whether an offence of “arranging” a marriage of convenience would be made out if the marriage is never entered into. On the present facts, it was undisputed that Tay and Bai did enter into the marriage. 13 Put simply, what the Applicant was attempting to do in the present application wasto re-litigate her case in the form of yet another appeal – a course of action which was clearly prohibited by law. Given the very nature of what she was seeking to do and the arguments that she was constrained to proffer to this court, any attempt to “dress up” her application in the form of a question of law of public interest was ultimately an exercise in futility. We state all this, in the main, because the Prosecution raised a further issue before us – whether the Applicant ought to be made to pay costs pursuant to s 356 of the CPC. It is to this which we now turn our attention.",
        "Imposition of costs against the Applicant": "14 Section 356 of the CPC provides as follows: Costs ordered by Court of Appeal or High Court 356.—(1) The Court of Appeal or the High Court in the exercise of its powers under Part XX may award costs to be paid by or to the parties as it thinks fit. (2)  Where the Court of Appeal or the High Court makes any order for costs to be paid by the prosecution to an accused, the Court must be satisfied that the conduct of the matter under Part XX by the prosecution was frivolous or vexatious. (3)  Where the Court of Appeal or the High Court makes any order for costs to be paid by an accused to the prosecution, the Court must be satisfied that the conduct of the matter under Part XX by the accused was done in an extravagant and unnecessary manner. 15 Section 356 of the CPC was adapted from s 262 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (ie, the old CPC) under which the High Court had the full power in all proceedings concerning “Appeals, Points Reserved and Revision” to award “such costs to be paid by or to the parties thereto as the Court thinks fit”. Section 356(1) of the CPC now establishes clearly that this is a power which also extends to the Court of Appeal and ss 356(2) and (3) go on to specify the circumstances in which the courts may order such costs against the Prosecution or an accused respectively. 16 The key provision we consider in the present case is that of s 356(3) of the CPC, which applies to an accused and in which the court “must be satisfied that the conduct of the matter … by the accused was done inan extravagant and unnecessary manner” [emphasis added]. Whether or not an accused has, in fact, acted in such a manner obviously depends uponthe precise facts and circumstances of the each case(see alsoperTan Siong Thye JC (as he then was) in the Singapore High Court decision ofArunKaliamurthy and others v Public Prosecutor and another matter[2014] 3 SLR 1023 (“ArunKaliamurthy”) at [35]). 17 InArunKaliamurthy, Tan JC considered the interpretation of not only s 356, but also s 409 of the CPC, both of which differ slightly in wording. Section 356 relates to the High Courtandthe Court of Appeal’s power to award costs with respect to Part XX of the CPC (ie, appeals, points reserved, revisions and criminal motions). In so far as the latter provision is concerned, it provides, more specifically, for the High Court’s power to award costs if it dismisses a criminal motion. Section 409 of the CPC reads as follows: Costs 409.  If the High Court dismisses a criminal motion and is of the opinion that the motion was frivolous or vexatious or otherwise an abuse of the process of the Court, it may, either on the application of the respondent or on its own motion, order the applicant of the criminal motion to pay to the respondent costs on an indemnity basis or otherwise fixed by the Court. 18 From the above provisions, the following principles may be distilled: (a)TheProsecutioncould be made to pay costs to an accused person by the High Court or the Court of Appeal if the conduct of the matter by the Prosecution is “frivolous or vexatious” (see s 356(2) of the CPC). (b)An accusedcould be made to pay costs to the Prosecution by the High Court or the Court of Appeal if he conducts the matter in a manner that is “extravagant and unnecessary” (see s 356(3) of the CPC). (c)An applicantcould be made to pay costs to the respondent by the High Court if the criminal motion is deemed to be “frivolous or vexatious or otherwise an abuse of process of the Court” (see s 409 of the CPC). 19 Notwithstanding that different terms are used to describe the circumstances in which costs may be awarded pursuant to either s 356 or 409 of the CPC, Tan JC noted inArunKaliamurthy(at [35]) that “the matters to be assessed in determining whether [a criminal motion] is frivolous or vexatious, or an abuse of process of the court, are similar to thosevis-à-visdetermining whether the accused persons had conducted the matter in an extravagant and unnecessary manner”.We agree with the observations made by Tan JC. Whether one uses the words “frivolous or vexatious” or “extravagant and unnecessary”, when deciding whether costs should be awarded in a criminal proceeding, the court should ultimately look at the circumstances as a whole and scrutinise,inter alia, the facts of the case, the strength of the Defence (or Prosecution) and the course of conduct of the Defence (or Prosecution) (seeArunKaliamurthyat [35], citing the observations of Yong Pung How CJ in the Singapore High Court decision ofAbexCentre Pte Ltd v Public Prosecutor[2000] 1 SLR(R) 598 at [15]). 20 When viewed in the context of the filing of a criminal reference, an applicationwhichin substance is manifestly a “back-door” appeal that merely seeks to re-litigate issues of fact that have already been decided in the courts below would, in our view (and absent additional as well as exceptional circumstances), constitute the conduct of the matter by the accused being “done in an extravagant and unnecessary manner”. This must surely be the case because to begin with, the framework of permissible appeals in this context is a straightforward aspect of our law and the central feature of which is that there is no right to bring a further appeal in such matters to the Court of Appeal. So too is the rationale underlying the possibility of bringing a reference on a question of law of public interest. So too is the distinction between the two. These are not points of notable or unusual difficulty. And where it is evident that an applicant is in fact seeking to disguise an impermissible appeal as a reference on a question of law of public interest, this would seem to us to border on an abuse of the process of the court and such applications – each involving, as they necessarily must, valuable time on the part of counsel for the respective respondents as well as the courts concerned –not only waste valuable time but also undermine (in the starkest manner possible) the veryraison d’êtreof s397 of the CPC itself. In so far as the latter point is concerned, such applications constitutethe very antithesisof what s 397 of the CPC (“s 397”) is intended to accomplish. This particular provision is not intended to furnish ayet further right ofappealto either party. However, in thepublic interest, s 397 furnishes anexceptionallegal mechanism in situations where a point of law of public interest needs to be clarified by the Court of Appeal in order to furnish the requisite legal guidance for the sake of the legal system generally.Even then, s 397cannotbe utilised in order to enable the Court of Appeal to clarify the law in apurely hypothetical or academic manneror, worse, to try to eke out an extra appeal when this is expressly not permitted. 21 That s 397cannotbe utilised as a covert or “back-door” appeal is clear from the following observations (also cited by the Prosecution in their written submissions to this court) by the then Minister for Law, Prof S Jayakumar, with regard to the legislative predecessor of s 397, when he observed that the discretion given to the High Court to refuse leave to refer questions to the Court of Appeal was intended to “sieve out questions which are not genuine points of law and are not of public interest and which areadvanced merely as aguise for what is in fact an appeal” [emphasis added] (seeSingaporeParliamentary Debates, Official Report(12 April 1993) vol 61 at col 116). In the Singapore High Court decision ofNg AiTiong v Public Prosecutor[2000] 1 SLR(R) 490, Yong Pung How CJ affirmed Parliament’s intention in this regard and noted as follows (at [10]): … In all these cases, it has been the common emphasis that the discretion under s 60, SCJA [ie, the legislative predecessor of s 397 of the CPC], must be exercised sparingly by the High Court. This is to give recognition and effect to Parliament’s intention for the High Court to be the final appellate court for criminal cases commenced in the Subordinate Courts.Theimportance of maintaining finalityin such proceedings must not be seen to be easily compromised through the use of such a statutory device. InAbdul Salam bin MohamedSalleh v PP[1990] 1 SLR(R) 198 at [30], Chan Sek Keong J [as he then was] had cautioned aptly that: [Section 60, SCJA] is not an ordinary appeal provision to argue points of law which are settled or novel points which can be decided by the application or extension of established principles of law or the application of statutory provisions which have been authoritatively construed by higher courts. … Hence, it isimperativethat s 60 of the SCJA is utilised onlyin exceptional cases so as to ensure that the proper purpose of the section is not abused to serve as a form of “backdoor appeal”. [emphasis added in italics and bold italics] More recently, this court, inMohammadFaizal bin Sabtu and another v Public Prosecutor and another matter[2013] 2 SLR 141, observed (in a similar vein) thus (at [21]): To liberally construe s 397 so as to more freely allow a reference to the Court of Appeal wouldseriously undermine the system of one-tier appeal. The interests of finality would strongly militate against the grant of such a reference save in very limited circumstances. [emphasis added] 22 Returning to the present case, it is clear – as has already been emphasised above – that the Applicant hadalreadyexercised her right of appeal to the High Court and was essentially utilising s 397 as a “back-door” appeal. The present case therefore indeed represented an attempt by the Applicant to conduct her case in the context of an application for a criminal reference “in an extravagant and unnecessary manner” andprima faciemerited an award of costs against her. However, we eventually decided against doing so for one specific reason – this was the first time that the issue as to whether or not an application for a criminal reference which was a thinly veiled disguise for a “back-door” appeal on the facts ought to result in an award of costs came squarely before this court, or at least was an issue that this court thought might merit a decision. InPhangWah v Public Prosecutor and another matter[2012] SGCA 60, this court had previously cautioned that “potential applicants would … do well to avoid attempting such “back door” appeals by recourse to s 397 CPC” (at [37]) and that such applications do not “permit a dissatisfied accused a third bite at the cherry” [at [38]). However, we note that the issue of costs was not raised or discussed in that particular decision. Be that as it may, it is deeply unfortunate that applicants have not heeded this caution and that we still see an influx of such unmeritorious applications before this court. 23 We therefore find it appropriate to state unequivocally that the bringing of such unmeritorious applications will not be countenanced and that this court will, henceforth, not hesitate to award costs against applicants who attempt “back-door” appeals by recourse to s 397. There will beno excusefor applicants who choose to waste valuable court time as well as the time of lawyers for the other party and (more importantly) make light of a statutory provision that is intended to be invokedin only exceptional circumstances inthepublic interest. 24 We would also add that, pursuant to s 356(2) of the CPC,theProsecutioncould also be made to pay the accused costs. Although that particular subsection is worded differently (in that the Prosecution’s conduct of the matter must be “frivolous or vexatious”), as noted above, similar considerationsvis-à-visdetermining whether the conduct of the matter is “extravagant and unnecessary” would apply. This isnotto say, however, that the considerations when deciding whether to award costs against the Prosecution as compared to an accused areone and the same. In this regard, inThe Criminal Procedure Code of Singapore: Annotations and Commentary(Jennifer Marie and Mohamed Faizal Mohamed Abdul Kadir gen ed) (Academy Publishing, 2012), the learned authors opined as follows (at para 18.015): It would be interesting to assess the jurisprudential developmentsvis-à-visthe matter as to when, and to what extent, the Prosecution would be liable for costs. Suffice it to say that in light of the fact that the exercise of prosecutorial discretion cannot, generally speaking, be reviewed save in very circumscribed situations (seeLaw Society of Singapore v TanGuat Neo Phyllis[2008] 2 SLR(R) 239), and the fact that the decision to prosecute may, at times be dependent on considerations that may be wholly legitimate but that may not be admissible in a court of law (or is otherwise not a factor that a court can take cognizance of in the determination of guilt), the awarding of such costs against the Prosecution, where it was the Public Prosecutor who arrived at the decision to prosecute would belimited to the most exceptional of circumstances. [emphasis added] We note, however, that the above observations were made in the context of the bringing of frivolous or vexatiousprosecutions(as compared to a criminal reference). Since this was not an issue that arose before us, we decline to render any conclusion on this point save to say, without the benefit of full arguments, that the above observations appear to be of weight. 25 Having said that, it seems to us that it would indeed be “frivolous or vexatious” for the Prosecution to filea criminal referencewhich did not raise a question of law of public interest andwhich was, instead, a“back-door” appeal. Indeed, we should hope that such a situation would never arise before us as the Prosecution has a higher duty as a representative of the State. If, however, such a situation should arise, it would clearly be “frivolous or vexatious” for the precise reason we have just stated. 26 Finally, we would observe that, in certain exceptional circumstances (which are, by their very nature, fact and context sensitive), thedefence counselconcerned might be made to bear costs payable under s 356(3) of the CPCpersonally. Indeed, such an order was made by Tan JC inArunKaliamurthywhere he noted that pursuant to s 357(1) of the CPC, the court has the power to either (i) direct defence counsel to repay any costs which his client has been ordered to pay to any person; or (ii) disallow costs as between defence counsel and his client.",
        "Conclusion": "27 We hope that this decision serves as a timely reminder to applicants and their counsel that criminal references should not be resorted to lightly and that judgment should be exercised prudently before one chooses to embark on such a course of action. We recognise that there is ultimately a public interest element in criminal litigation and this decision should not act as a deterrent to meritorious criminal references being brought before this court. To be sure there will be cases which admit of a genuine difference of view; but in our experience, those are far and few between. The majority, like the present, tend to be straightforward and misguided attempts to prolong the process by trying to smuggle an appeal under the umbrella of s 397. In this regard, we must bear in mind the caution rendered by Tay Yong Kwang J in the Singapore High Court decision ofOngBoon Kheng v Public Prosecutor[2008] SGHC 199 (at [14]) that “[i]t only takes a little ingenuity to re-cast what is a straightforward, commonsensical application of principles of law to the relevant facts into an apparent legal conundrum which seemingly calls for determination by the highest court of the land”. Accordingly, henceforth, one can expect the abuse resulting from such “ingenuity” to be met with costs implications. Chao Hick Tin       Andrew Phang Boon Leong        Quentin LohJudge of Appeal      Judge of Appeal          Judge S K Kumar (S K Kumar Law Practice LLP) and Sng S H (Sng & Co) for the applicant;Mohamed Faizal, Yvonne Poon and Sarah Siaw (Attorney-General’s Chambers) for the respondent."
    }
}