{
    "case_title": "TDTvTDS and another appealand another matter",
    "ncitation": "[2016] SGCA 35",
    "coram": "Andrew Phang Boon Leong JA (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1There are two appeals and one application before this court arising out of ancillary matters concerning the division of matrimonial assets and maintenance in a divorce proceeding. The ancillary matters were heard before the High Court judge (“the Judge”) and her decision is reported atTDS v TDT[2015] SGHCF 7 (“the GD”). 2Civil Appeal No 119 of 2015 (“CA 119/2015”) is the Husband’s appeal against the Judge’s decision. In the main, he appeals against how the Judge valued the shares of a particular company which was found liable to be divided as a matrimonial asset. The Husband also seeks a refund of the interim maintenance paid to Q, the Wife’s daughter who was born out of wedlock from a previous relationship (see also below at [5]). The latter point raises interesting questions pertaining to the scope and operation of s 70 of the Women’s Charter (Cap 353, 2009 Rev Ed) (“the Act”) which have hitherto not been considered by this court. 3Civil Appeal No 120 of 2015 (“CA 120/2015”) is the Wife’s cross-appeal against the Judge’s decision. She seeks an upward revision of the proportion of the matrimonial assets which she was awarded. She also seeks an award of nominal maintenance, which gives us an opportunity to elaborate on the principles of nominal maintenance recently laid down by this court inATE v ATD and another appeal[2016] SGCA 2 (“ATEv ATD”). The Wife also applies in Summons No 15 of 2016 (“SUM 15/2016”) to adduce fresh evidence on appeal. The evidence sought to be adduced came into existence only after the Judge had handed down her decision. 4For ease of reference, the nomenclature used in the GD shall be adopted in this judgment.",
        "The background facts": "5The parties began a relationship in about 2003. At the time, the Husband was in the process of divorcing his wife from his first marriage. On 17 October 2006, the parties married. The marriage lasted for 4.5 years. There are no children to the marriage between the parties, though the Wife has a daughter, Q, who was born out of wedlock from a previous relationship. 6After the parties were married, the couple, Q, and the Wife’s mother stayed together in an apartment unit at the Park Green condominium development (“the Park Green apartment”), which was owned by the Wife and her sister. They stayed there from October 2006 until sometime in 2009. In late 2009, the couple moved to a house located at Lentor Vale. Q did not move to Lentor Vale with the couple and continued to live in the Park Green apartment with the Wife’s mother and sister. 7On 4 April 2011, an incident occurred between the couple. This resulted in the Wife leaving the Lentor Vale property permanently. She also applied for, and obtained, an expedited personal protection order against the Husband. This marked a significant point in the breakdown of the marriage. Divorce proceedings commenced on 27 September 2011 and interim judgment for divorce was granted on 18 December 2013. 8The Wife also applied for and obtained an order that the Husband was to pay interim maintenance of $12,500 per month ($10,000 for the Wife and $2,500 for Q) from 1 May 2011. Upon the Husband’s application for a downward variation of interim maintenance in December 2013, the District Judge reduced the interim maintenance for the Wife and Q to $10,500 a month ($8,000 for the Wife and $2,500 for Q) with effect from November 2012 (see the decision of District Judge Wong Keen Onn (“DJ Wong”) in Summons No [A] of 2012 (“SUM [A]”)). The parties’ cross-appeals against DJ Wong’s decision were dismissed by Tay Yong Kwang J on 23 April 2014. At the time of the hearing before the Judge in March 2015, the Husband had paid a total of $533,500 in interim maintenance for the Wife and Q. The Husband, Wife and Q were at the time of the hearing of the ancillary matters before the Judge, 53, 51 and 19 years old, respectively.",
        "The matrimonial assets relevant to the present appeal": "9There are five companies which were incorporated by the Husband that are relevant to the present appeals. We set out a brief overview of each company here, as follows: (a) BPL: BPL was incorporated in June 2000. The primary business of the company was originally to market and sell the “Singapore Sling premix” as well as service and maintain beer dispensers and cooling units. Its business was re-organised in 2004. Presently, the Husband owns 100% of the shares in BPL. (b) APL: APL was incorporated in December 2004 to take over the business of marketing and selling the “Singapore Sling premix” from BPL. The Husband owns 83.5% of the shares of APL, and the remaining 16.5% of the shares are owned by two of the Wife’s friends. (c) BSPL: BSPL was incorporated in December 2004 to take over the business of servicing and maintaining beer dispensers and cooling units from BPL. The Husband owns 90% of the shares of BSPL with the remaining 10% owned by one of BSPL’s employees. The parties agree that at the time of the ancillary matters hearing, BSPL was no longer operating as a going concern although they differ as to why this was the case. The Husband alleges that the Wife diverted BSPL’s business to companies that she has an interest in, whereas the Wife states that BSPL lost its business because of the lackadaisical manner in which the Husband ran the company after the marriage had broken down. (d) CPL: CPL was incorporated in April 2005 to sell “Singapore Tourist Passes”. The business did not take off and CPL has been dormant since 2012. The Husband and Wife own 95% and 5% of the shares of CPL, respectively. (e) DPL: DPL was incorporated in August 2000 and the Husband owns 100% of the shares in the company. It is undisputed that during the course of the marriage, the Wife was involved in running both APL and BSPL. Also, the parties not infrequently charged their personal expenses to these companies’ accounts (especially to BSPL’s account). 10Besides these five companies, there are also three immovable properties relevant to the present appeals: (a) A warehouse located at Admiralty Street (“the Admiralty Street property”). It appears to have been purchased in June 2010 by BSPL for $700,000. After being purchased by BSPL, it appears thatAPL(andnotBSPL) had mortgaged the property to United Overseas Bank Ltd for a loan facility of $500,000. The Husband suggests that the Admiralty Street property was purchased in August 2010, but in support of his suggestion he relies on a document that in fact deals withanotherunit located at Admiralty Street. The Admiralty Street property was transferred to DPL for a consideration of $800,000 sometime in April 2012 (ie, after the commencement of divorce proceedings). However, no sale and purchase agreement between BSPL and DPL was exhibited. (b) A landed property located at Andrews Terrace (“the Andrews Terrace property”). The Andrews Terrace property was purchased on 13 November 2010 for $1.85m and was financed by the Husband and the Husband’s father. The renovation work on the property amounted to $400,000. The Wife states that this was paid with funds that came from APL and BSPL, whereas the Husband’s position is that the renovation was funded by money from a bank account that was originally a joint account held by the Husband and his father. (c) An apartment located at a condominium development at Hougang Street known as the Minton (“the Minton property”). This was purchased by the Wife and her sister as joint owners in September 2010 from the proceeds of sale of the Park Green apartment. 11Further facts relating to the acquisition and valuation of these assets will be dealt with below where they are relevant to the analysis of the various issues raised in these appeals.",
        "The various court proceedings": "12Besides this divorce proceeding, the parties are, or have been, entangled in a number ofothercourt proceedings. The main dispute that remains on-going between the parties is Suit No [B] of 2011 (“Suit [B]”). Suit [B] was commenced by BSPL on 20 July 2011 against the Wife and four other defendants. The causes of action are,inter alia, breaches of fiduciary duty, conspiracy to defraud and misuse of confidential information. On 24 February 2012, Suit [B] was consolidated with Suit No [C] of 2011 (“Suit [C]”), which was an action commenced by BSPL against the Wife and five other defendants. The causes of action in Suit [C] were,inter alia, breach of copyright, breach of confidentiality obligations and breach of non-competition obligations. Subsequently, in April 2013, BSPL discontinued Suit [B] as against the other defendants and currently only the claims against the Wife remains. On 20 January 2014, Suit [B] was stayed by Lee Seiu Kin J pending the resolution of these appeals. 13The gist of BSPL’s action against the Wife in Suit [B] is for the alleged diversion of a specific business opportunity,viz, the opportunity for BSPL to supply mashed potato machines to 7-Eleven, to another company known as [X] Pte Ltd (“XPL”) in July 2010. The Wife’s pleaded defence is that XPL took up the opportunity with the knowledge and consent of both the Husband and BSPL, and that XPL had agreed to pay BSPL a fee for doing so. The Wife pleaded that she had earned an arrangement fee (termed as “mashed potato commissions”), but that this was also with the consent of BSPL and the Husband. In the alternative, the Wife stated that there was an agreement between her, BSPL and the Husband that she could retain all fees from this arrangement “as part of her matrimonial maintenance and expenses”. Additionally, she counterclaimed against BSPL for damages arising from the wrongful termination of her employment and commenced a third party action against the Husband seeking an indemnity for any sums she might be found to be liable to pay BSPL on the basis that: By an agreement, understanding and/or arrangement for matrimonial maintenance and expenses reached between the [Husband] and the [Wife], in consideration of the [Wife] agreeing to marry [the Husband] and the [Wife] marrying the [Husband], further or in the alternative, in consideration of the [Husband’s] obligations to the [Wife] under section 69(1) of the Women’s Charter, the [Husband] covenanted with the [Wife] that her matrimonial maintenance and expenses would be provided/supplemented through payments, salaries and fees the [Wife] receives in connection with the business of the companies which is controlled by the [Husband], which includes [BSPL]. 14As an aside, and by purely way of observation, the state of affairs between the parties in relation to Suit [B] is a strange one. It appears that even after these ancillary matters are dealt with, the issue of maintenance will still be revisited in Suit [B] as part of the Wife’s defence against BSPL’s claim and her claim against the Husband (ie, the Wife’s third party proceedings for an indemnity in Suit [B]). 15The Wife had also commenced actions against the Husband and his companies. District Court Suit No [D] of 2011 was an action by the Wife against APL for unpaid salary amounting to $161,000. She was awarded the sum of $151,400 on her appeal to Lee Kim Shin JC in District Court Appeal No [E] of 2013. Separately, the Wife commenced Suit No [F] of 2012 against the Husband, claiming for damages for pain and suffering relating to the alleged scuffle that occurred on 4 April 2011. This action was settled with the Husband paying the Wife $26,341. 16After the Judge’s decision was handed down, it appears that the Husband and BSPL commenced District Court Suit No [G] of 2015 (“DC [G]”) on 3 September 2015, claiming for the return of a sum of $157,202.57 under an alleged loan agreement. By SUM 15/2016, the Wife seeks to admit correspondence and cause papers relating to DC [G] as fresh evidence in these appeals.",
        "The decision below": "17The Judge began by identifying the assets which fell within the pool of matrimonial assets liable to division under s 112 of the Act. She found that the Wife was intimately involved in the running of APL and BSPL and that BPL and CPL appeared to be part of the group of companies that the parties managed during the marriage. In the Judge’s view, it was appropriate to treat the Husband’s shares in APL, BPL, BSPL and CPL as matrimonial assets liable for division (“the Major Assets”). The Judge also included the value of the Admiralty Street property (fixed at $1.54m) in the valuation of BSPL, even though the Admiralty Street property, at the time of the hearing, was registered in the name of DPL, a company solely owned by the Husband. The Judge found that the Admiralty Street property had been transferred from BSPL to DPL after the divorce proceedings commenced ostensibly for the purpose of reducing the value of the pool of matrimonial assets liable for division. She therefore valued the shares of APL, BPL, BSPL and CPL at a total of $5,033,183, computed as follows: APL$2,139,853BSPL$1,158,329 $1,540,000$2,698,329BPL$152,928CPL$42,073Total$5,033,183 18While it is not entirely clear whether the Judge found that the Andrews Terrace property and the Minton property were matrimonial assets to be included in the division exercise, it appears that the Judge had regard to these assets and the contributions made by the parties in coming to her decision on the just and equitable division of the Major Assets. She also took into account the short and childless nature of the marriage, the Wife’s contributions in increasing the value of APL and BSPL, the various non-disclosures by both parties and the Wife’s diversion of some of BSPL’s business to herself (which the Judge was satisfied had happened) in arriving at her decision that the just and equitable division would be to award the Wife 30% of the value of the Husband’s shares in APL, BPL, BSPL and CPL (with the value of BSPL increased to include the value of the Admiralty Street property). The effective outcome was that the Husband was to pay the Wife a sum of $1,322,451.22. 19On the issue of maintenance, the Judge held that there would be no further maintenance for the Wife and Q from the date of her order. Q was no longer accepted by the Husband as a member of his family and the Wife had sufficient earning capacity and financial resources. Therefore, no further maintenance ought to be awarded for both the Wife and Q. In arriving at her decision, the Judge took into account the fact that the Wife had substantial financial needs given the number of legal suits she was involved in post-marriage.",
        "Summary of the arguments on appeal": "20In order to frame the issues that arise in the present appeals, we briefly set out the arguments that the Husband and the Wife make in CA 119/2015 and CA 120/2015, respectively. 21In CA 119/2015, the Husband appeals against the Judge’s decision with respect to the division of matrimonial assets in two respects. First, he argues that the Admiralty Street property ought not to have been included as part of the value of BSPL. Second, he submits that the Judge had erred in computing the value of BSPL as $1,158,329. The Husband also appeals against the Judge’s decision not to award him a refund of the interim maintenance paid to Q. In this regard, he seeks a full refund of the interim maintenance paid, primarily on the basis that the objective evidence showed that he had not accepted Q as a member of his family. The interim maintenance paid by the Husband to Q amounted to a total of $117,500 as at March 2015. 22In CA 120/2015, the Wife raises three areas of contention. First, she seeks an upward revision of her proportion of the division of the Major Assets from 30% to 60%. She contends that while the Judge was cognisant of her substantial contributions to the companies, the Judge had failed to translate that recognition to an appropriate award in so far as the division of those assets was concerned. Second, the Wife submits that the Judge had erred in valuing BPL at $152,928. Instead, the appropriate value to be adopted is $1,622,603. Finally, the Wife seeks an award of maintenance that is dependent upon the outcome of Suit [B] (ie, if she is not entitled to keep the mashed potato commissions, an order should be made for the Husband to pay the Wife maintenance of $4,500 for eight years) or for an award of nominal maintenance of $1. In so far as the argument that she should be awarded nominal maintenance is concerned, the Wife applies in SUM 15/2016 for leave to adduce fresh evidence on appeal which, in the main, consists of correspondence and cause papers pertaining to DC [G]. She argues that as these materials came into existence after the Judge’s decision, the requirements set out in the leading English Court of Appeal decision ofLadd v Marshall[1954] 1 WLR 1489 (“Ladd v Marshall”) do not apply. Through the fresh evidence, the Wife seeks to bolster her argument that she should be awarded nominal maintenance in order to hedge against the risk that her financial resources will be depleted by the Husband’s alleged legal tirade against her.",
        "The issues before this court": "23The following issues arise for our determination in CA 119/2015 and CA 120/2015: (a) whether the valuation of the shares of BSPL should include the Admiralty Street property, and if so, the appropriate value to be ascribed to BSPL’s shares (“Issue 1”); (b) the value to be ascribed to BPL’s shares (“Issue 2”); (c) the just and equitable division of the Major Assets (“Issue 3”); (d) whether the Wife should be awarded maintenance (“Issue 4”); and (e) whether the Husband’s claim for a refund of interim maintenance paid to Q should be allowed (“Issue 5”). 24Before dealing with the substantive issues in this appeal, we address SUM 15/2016.",
        "SUM 15/2016: The Wife’s application to admit fresh evidence": "25The power of the Court of Appeal to admit fresh evidence is found in s 37(2) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“the SCJA”). Under s 37 of the SCJA, a distinction is made between further evidence that relates to matters that occurred after the date of the decision from which the appeal is brought, and matters which occurred before the date of the decision. In the case of the latter, the applicant needs to satisfy the requirements of “special grounds” under s 37(4) of the SCJA. In the case of the former, theLadd v Marshallprinciples are inapplicable. Instead, the test, as stated by this court inYeo Chong Linv Tay Ang Choo Nancy and another appeal[2011] 2 SLR 1157 (“Yeo Chong Lin”), is whether the further evidence would have a “perceptible impact on the decision such that it is in the interest of justice that it should be admitted” (at [13]). 26The Wife seeks to introduce two categories of fresh evidence through SUM 15/2016. The first category of fresh evidence concerns correspondence between the parties’ solicitors after the Judge came to her decision on 7 May 2015. The second category encompasses correspondence and cause papers relating to DC [G] which, as stated above (at [16]), is a claim filed by the Husband and BSPL against the Wife on 3 September 2015, after the Judge had delivered her judgment on the ancillary matters. 27Counsel for the Husband stated during oral submissions before us that he was not objecting to the Wife’s application in SUM 15/2016, except to point out that the documents which the Wife was seeking to adduce were, in his view, not relevant to the disposal of the appeals. 28Having perused the documents, we agree that the further evidence which formed the subject of the first category was not relevant to the issues in these appeals. More to the point, the fresh evidence sought to be admitted would not have had a perceptible impact on our decision. The first category of documents pertains to correspondence between the parties’ solicitors, and the gist of the correspondence relates to the payment of the sums due from the Husband to the Wife pursuant to the Judge’s decision. The Wife submits that these documents demonstrate both the Husband’s intention to financially starve the Wife as well as his propensity for non-disclosure. We do not consider information concerning the execution of the Judge’s decision material that would have a perceptible impact on the outcome of the Judge’s decision or the appeal therefrom. To the extent that the gravamen of the Wife’s complaints consists in her inability to enforce the Judge’s decision against the Husband, her remedies lie in taking out the appropriate applications, and not in an appeal to this court. Consequently, we dismiss the Wife’s application in SUM 15/2016 in respect of the first category of documents. 29Turning to the second category of documents which consists of correspondence and cause papers relating to the Husband and BSPL’s claim against the Wife in DC [G], these documents appear on aprima faciereview to be relevant to the present appeals. Had the Husband and BSPL filed DC [G] (which they were able to do)beforethe Judge arrived at her decision, these would have been materials that the Judge could properly have had regard to when arriving at her decision. Further, in deciding on an award of maintenance, the court is directed by s 114 of the Act to have regard to the financial resources of both parties and each party’s earning capacity. The fact that the Husband had instituted new proceedings against the Wifemightbe a fact that could have an impact on the basis of the court’s decision as to whether maintenance ought to be awarded, and if so, the appropriate quantum for such maintenance. Accordingly, we allow the Wife’s application to admit the fresh evidence in respect of the documents comprised in the second category. 30We now turn to consider the substantive issues arising in the present appeals.",
        "Issue 1: The valuation of the shares of BSPL": "31As mentioned above, the Husband raises two issues arising from the Judge’s valuation of BSPL’s shares. He submits, first, that the Judge was wrong to have included the value of the Admiralty Street property in the value of BSPL’s shares. Secondly, he argues that the Judge adopted the wrong expert report for the valuation of BSPL. We consider each contention in turn.",
        "Whether the Admiralty Street property should be included in the valuation": "32It will be recalled that the Admiralty Street property was purchased by BSPL sometime in 2010 and that it had been transferred from BSPL to DPL in April 2012,afterthe commencement of divorce proceedings. At the hearing below, the parties’ arguments focussed on whether the Admiralty Street property should be included as a standalone asset in the pool of matrimonial assets liable for division, since it had been transferred out of BSPL’s ownership. The Judge did not adopt the approach canvassed by the parties. In her view, the transfer of the Admiralty Street property from BSPL to DPL after the commencement of divorce proceedings was done “seemingly for the [Husband’s] benefit after the filing of the writ of divorce” (see the GD at [32]). As BSPL had owned the Admiralty Street property and the Husband had not accounted for the transfer of the property to DPL, the Judge considered that the Admiralty Street property ought to fall within the pool of matrimonial assets, albeit not as an asset in its own right, but rather as an asset owned by BSPL (see the GD at [22]). 33Before us, the Husband argues that the Admiralty Street property should not fall within the pool of matrimonial assets, whether as a standalone asset or as an asset owned by BSPL, as it was acquired by way of gift or inheritance from his father. Hence, the Admiralty Street property, although acquired during the course of the marriage and in the name of BSPL, falls within the exception under s 112(10) of the Act, which provides that an asset acquired by one party at any time by gift or inheritance and which had not been substantially improved during the marriage by the other party or both parties to the marriage would not fall within the pool of matrimonial assets. The Husband relies on evidence which he says demonstrates that the funds for the purchase of the Admiralty Street property effectively came, not from BSPL in whose name the property was registered, but from the Husband’s father. His father had lent him the funds for the purchase of the Admiralty Street property, which he then inherited when his father passed away. In addition to the issue concerning the source of funds for the purchase of the Admiralty Street property, the Husband also submits that the Wife should not be awarded a share of the Admiralty Street property which was purchased for BSPL’s business, when she had diverted this very business away from BSPL. Finally, the Husband also submits that excluding the Admiralty Street property from the pool of matrimonial assets would ensure a measure of parity with the way the Judge treated the Andrews Terrace property and the Minton property. 34We disagree with the Husband’s characterisation of the Admiralty Street property as a “gift or inheritance” from his father to him. It is not disputed that the funds for BSPL’s purchase of the Admiralty Street property came from the Husband’s father. However, what is more important, in our view, is how the parties have recorded the use of the funds in the purchase. In this regard, the evidence demonstrates that the Husband’s father didnotintend his financial contribution to the purchase of the Admiralty Street property to be agiftof monies to the Husband. Rather, it is clear that the Husband’s father’s financial contributions to the purchase of the Admiralty Street property were treated and accounted for as aloanto the Husband which had therefore to be repaid to him (the Husband’s father). This is clear from the Husband’s own evidence in his affidavit of asset and means (“AOM”) dated 21 February 2013 in which he states (at para 21.19): The purchase of [the Admiralty Street property] was carried out as follows: (a) [BSPL] will purchase the [Admiralty Street property] from Ascendas (Admiralty) Pte Ltd at the effective price of S$615,900; (b) [BSPL] also paid for the stamp duty on the option to purchase, which was S$15,600; (c) my fatherloaned meS$600,800 for the purchase price and I in turn paid the purchase price to Ascendas; (d) the monies were recorded asa loanto the company by me as a director of the company. The purchase of the unit was completed in June 2010. I inheritedthe loan amountfrom my father when he passed away in November 2010. [emphasis added] 35As is clear from the passage just quoted, the parties had effectively entered into two loans. First, the Husband’s father had given the Husband a loan of $600,800, which the Husband then lent to BSPL for the purchase of the Admiralty Street property in its name.Prima facie, this demonstrates that the Admiralty Street property wasnot, as the Husband seeks to characterise, “injected” into BSPL as an asset in its name without BSPL being required to finance the purchase. Rather, to the extent that BSPL is required to repay the loan which is recorded in its books as being owed to the Husband, the Admiralty Street property is recognised at law to form part of the fixed assets owned by BSPL. 36BSPL’s books are also consistent with the position that a loan had in fact been granted by the Husband to BSPL. In BSPL’s statement of financial position as at 31 December 2011, the amount due to a director was $475,604 in 2010 and $383,048 in 2011. In the absence of other evidence to the contrary, this demonstrates that the loan from the Husband to BSPL for the purchase of the Admiralty Street property was being progressively repaid by BSPL. 37We note that the Husband claims to have inherited the loan from his father after his father’s death in November 2010. Even assuming the veracity of these claims, we do not think that it makes any difference to our analysis. Whatever the status of the loan arrangements between the Husband and his late father’s estate, BSPL remains liable for the outstanding sum owed tothe Husband. In other words, the status of the Husband’s inheritance isirrelevantto the legal relationshipbetween BSPL and the Husband. The fact remains that the Admiralty Street property was registered in BSPL’s name, and BSPL financed the purchase of that property through moniesborrowedfrom the Husband. 38In our view, the Husband has not provided any compelling reason to depart from the conclusion that the Admiralty Property forms part of the assets of BPSL. It is pertinent to note the undisputed fact that the Wife had contributed to the business of BSPL during the marriage, and that the parties had accepted that the shares of BSPL properly form part of the pool of matrimonial assets liable for division. Given these facts, there is no reason to exclude from division any asset registered in the name of BSPL and beneficially owned by BSPL. Moreover, we are not impressed by the orchestration of the transfer of the Admiralty Street property from BSPL to DPL by the Husbandafterthe marriage had broken down and divorce proceedings had been commenced. We agree with the Judge’s observations that this transfer appears to have taken place for the purpose of reducing the Husband’s share of the assets liable for division. We therefore reject the Husband’s backdoor attempt to remove the Admiralty Street property from the valuation of BSPL’s shares. In the circumstances, the transfer should be disregarded, and the Admiralty Street property accounted for in the process of determining the value of the shares of BSPL. 39For completeness, we deal with the two further points raised by the Husband as stated above (at [33]). In so far as the issue of the Wife’s alleged diversion of business is concerned, we consider that this is not a factor that ought to be taken to account in determining whether an asset is liable for division, at least on the facts of the present case. We also consider that the Judge ought not to have made a finding that the Wife haddivertedBSPL’s business. This will be discussed below at [66]–[67]. 40The Husband’s further argument is that the exclusion of the Admiralty Street property from the pool of matrimonial assets would ensure some measure of parity with the Judge’s treatment of the Andrews Terrace property and the Minton property. It is difficult to see how any parallel could be drawn between the Admiralty Street property on the one hand and the Andrews Terrace property and Minton property on the other since neither the Andrews Terrace property nor the Minton property was property that was owned by the Husband’s companies. Therefore, we do not, with respect, consider this to be a relevant submission. 41We now proceed to determine the appropriate value to ascribe to BSPL’s shares.",
        "The appropriate value to ascribe to BSPL’s shares": "42It is useful to commence the analysis by setting out the various valuations that have been made of BSPL by the Husband, the Husband’s expert, Roc Partners Pte Ltd (“ROC”), and the Wife’s expert, Strix Strategies Pte Ltd (“Strix”). 43In the Husband’s AOM dated 21 February 2013, he stated that the estimated value of all the shares in BSPL was $240,755 as at 31 December 2010. The net tangible asset method, which involves a subtraction of the liabilities of the company from its assets, was used to arrive at this value. The Admiralty Street property was accounted for in this valuation based on the price of acquisition, and not its market value. 44In a further AOM filed on 10 September 2014, the Husband exhibited a report from ROC which valued the total equity of BSPL as being negative $196,105 as at 18 December 2012. In preparing this report, ROC made the assumption that the Admiralty Street property was never purchased in BSPL’s name. The Husband also exhibited a separate report from ROC dated 6 August 2014 which sought to value the shares of BSPL as at 31 December 2010 by employing a discounted free cash flow and market comparables methodology. The valuation in this latter report was prepared on the assumption that BSPL would continue to operate as a going concern without any diversion of its existing business. On this basis, ROC valued the total equity in BSPL as at 31 December 2010 at a sum of $1,158,329. The purpose of this report, which the Husband had commissioned, was to demonstrate that the Wife’s act of diverting BSPL’s business had caused a significant decrease in the value of BSPL’s shares. 45The Wife engaged her own expert, Strix, to value BSPL’s shares. In her AOM dated 10 September 2014, the Wife exhibited a report prepared by Strix dated 28 October 2013. In this report, Strix noted that the net asset value of BSPL was $240,755 as at 31 December 2010, which is consistent with the Husband’s valuation (see above at [43]). Strix opined that the estimate of BSPL’s net asset value should be increased to $830,849 in order to account for the increase in market value of the Admiralty Street property. 46Strix prepared a subsequent report dated 28 August 2014 which valued BSPL’s shares at $825,692. This sum was derived by adding the net asset value of BSPL as at 31 December 2010 (ie, $240,755) with the gain made by BSPL from the sale of the Admiralty Street property to DPL (ie, $109,333) and sums due from BSPL to the Husband (ie, $475,604). 47Further reports were prepared by the respective parties’ experts after the Judge indicated during a hearing that she was inclined to proceed on valuations of the companies as close to the hearing date as possible. In a report dated 21 April 2015, ROC valued the net asset value of BSPL as at 31 December 2014 as being negative $482,887. Strix, too, furnished a report dated 29 April 2015. While no valuation of the shares of BSPL was provided in this report, Strix queried whether BSPL’s losses (as referred to in ROC’s report dated 21 April 2015) were genuine or were, instead, “random charges to the accounts for expenses”. 48To reiterate, the Judge valued the shares of BSPL at $1,158,329, adding a sum of $1,540,000 to that value in order to account for the Admiralty Street property. It is clear, in our view, that the Judge valued the shares of BSPL based on the ROC report dated 6 August 2014 which adopted a methodology that assumed that BSPL would continue operating as a going concern (see above at [44]). 49The Husband points out that the Judge’s decision to determine the value of BSPL on the basis of the ROC report dated 6 August 2014 appears to be out of sync with the Judge’s stated preference to proceed on valuations of the Major Assets that were as close to the hearing date as possible (see the GD at [30]). As stated in the ROC report, the value of $1,158,329 was ROC’s estimate of the fair value of BSPL’s equityas at 31December 2010. Thus, the Husband argues that the Judge should have adopted a more updated valuation of BSPL based on the ROC report dated 21 April 2015, which valued BSPL’s shares at a negative value as at 31 December 2014 (see above at [47]). 50The general position is that the date of the hearing is the date that should be adopted for the purposes of valuing the matrimonial assets: seeYeo Chong Linat [39]. Although framed as an imperative inYeo Chong Lin, we do not think that the position that the value of a matrimonial asset “must be assessed at the date of the hearing” is a hard and fast rule. InWan Lai Cheng v Quek Seow Kee and another appeal and another matter[2012] 4 SLR 405 (“Wan Lai Cheng”), this court valued matrimonial properties on a date prior to the hearing of the ancillary matters. This was because the court found (at [71]) that before the hearing of the ancillary matters, the husband had increased the liabilities of the matrimonial assets, and that the increased liabilities were not incurred for the family’s benefit. The court in that case also stated (at [67]) that in general, the starting point for determining the liabilities charged against properties (for the purposes of calculating the net asset value) would be as at the date of commencement of the divorce proceedings because once divorce proceedings are commenced, neither spouse should be allowed to dispose of or incur any liability on assets to the detriment of the other spouse. In our view, the court retains the discretion to depart from the date of the ancillary matters hearing in determining the value of properties subject to division where this is warranted by the facts. Indeed, this very point was reiterated in our recent decision inARXv ARY and another appeal[2016] 2 SLR 686 (“ARXv ARY”) (at [36]). 51In the present case, there are ample reasonsnotto adopt the date of the hearing of the ancillary matters for the purpose of valuing BSPL’s shares. It may be recalled that BSPL had, on 20 July 2011, commenced Suit [B] against the Wife and other related defendants. Suit [C] was commenced a few months later on 16 September 2011. In the Husband’s AOM filed on 10 September 2014, he disclosed that BSPL had incurred $572,653.37 in legal fees. Clearly, these liabilities would have been incurred to the Wife’s detriment. Also, as we had noted above (at [38]), the Admiralty Street property had been sold to DPL seemingly as part of the Husband’s attempt to diminish his share of the matrimonial assets liable for division. Furthermore, the Wife had been removed as a director of BSPL on 9 May 2011. The Husband thus had free rein in respect of BSPL’s finances. There is a not negligible possibility that the Husband might have managed BSPL’s finances to the Wife’s detriment. Indeed, as pointed out by Strix in their report dated 29 April 2015, there is a lack of clarity as to why the finances of BSPL deteriorated so substantially between 2010 and 2013. On the other hand, the Husband has also alleged that the Wife diverted the business of BSPL post-2010. In all the circumstances, and in line with the principle espoused inWan Lai Cheng, we find it fair and appropriate to value BSPL’s shares on a datepriorto the breakdown of the marriage in April 2011 and the commencement of divorce proceedings in September 2011 so as to arrive at a value of BSPLbeforethe alleged dissipation of BSPL’s assets by the Husband and the alleged diversion of BSPL’s business by the Wife. 52We therefore refer to the expert reports that value BSPL’s shares as at 31 December 2010. Two valuation methods have been employed to value the shares of BSPL at this date,viz, the net asset method (adopted by the Husband and Strix) and the discounted free cash flow and market comparables method (adopted by ROC in its report dated 6 August 2014). The Judge adopted the valuation derived through the latter approach. 53Between the two approaches to valuation set out in the preceding paragraph, we would prefer to utilise the net asset valuation method. We find it significant thateven the Wife’s expertshad suggested that the net asset valuation method was the appropriate method of valuing BSPL’s shares. It is relevant, in determining the value of BSPL as at 31 December 2010, to have regard to the undisputed fact that BSPL no longer had any business as at the date of the ancillary matters hearing. Utilising the going concern valuation methodology may result in the Wife being overcompensated inasmuch as she would obtain a share of BSPL based on an assumption that it would continue to have business,even thoughthe parties accept that BSPL is no longer operating as a going concern. Hence, we find the net asset valuation method the more appropriate methodology that should be employed in determining the value of BSPL’s sharein the context of this case. Such an approach would also eliminate the uncertainties in the valuation resulting from the assumptions made by ROC in its report dated 6 August 2014. 54In all the circumstances, we find that it would be appropriate to value BSPL based on its net asset value as at 31 December 2010 with adjustments made to account for the market value of the Admiralty Street property. In this connection, we find that the appropriate valuation report that ought to be referred to is the Strix report which valued BSPL at $830,849 (see above at [45]). We note that this is also the amount which counsel for the Husband had stated during the oral hearing before us that the Husband was prepared to accept as the value of BSPL’s shares.",
        "Issue 2: The valuation of the shares of BPL": "55The next issue concerns the Wife’s appeal against the Judge’s valuation of BPL’s shares. Again, various valuation reports were prepared in this regard by the parties’ respective experts. There are two reports which are relevant to the present appeal. The first is a report on BPL dated 21 April 2015 prepared by ROC, the Husband’s expert. In this report, ROC opined that the fair value of BPL’s shares was $152,928. The second is a report prepared by Strix dated 29 April 2015. In this report, Strix pointed out certain questionable transactions in BPL’s financial statements, for which neither ROC nor the Husband had provided suitable explanations. In these circumstances, Strix valued the shares of BPL between $152,928 (adopting the value put forth by the ROC report) and $1,622,603, taking into account the amounts involved in the questionable transactions. In valuing BPL, the Judge adopted the lowest common denominator between the two reports,viz, $152,928, while also treating the matter “as one where there was some lack of full and frank disclosure” which she held would be relevant in her decision on the just and equitable division to award each party (see the GD at [32]). 56The Wife submits that the Judge had erred on two counts. First, despite indicating the need to take the Husband’s lack of full and frank disclosure concerning the accounts of BPL into account, the Judge had failed to do so. Second, the Judge ought not to have adopted ROC’s valuation of BPL at $152,928 in circumstances where she had indicated that ROC’s report was not as accurate as that of Strix. 57In our view, the Wife’s submissions are not sustainable once the full context of the Judge’s decision is examined. It is clear that the Judgedidtake into account the Husband’s lack of full and frank disclosure in arriving at the just and equitable division of the matrimonial assets: see the GD at [50]. The fact also remains that the valuation of $152,928 was a sum that was advanced bybothROCandStrix. It was eminently open to Strix, in the circumstances, to reject ROC’s valuation of BPL’s shares at $152,928. However, not only did Strix not do so, Strix in fact advanced the same sum as a possible value of BPL’s shares. In these circumstances, we are of the view that the Judge was fully justified in arriving at her decision to value the shares of BPL at $152,928, a value suggested by both parties’ experts, and in taking into account any lack of full and frank disclosure in determining the just and equitable division of the matrimonial assets, which she in fact did. We therefore reject the Wife’s submissions and affirm the Judge’s decision to value BPL’s shares at $152,928.",
        "Issue 3: The just and equitable division of the Major Assets": "58Based on our findings above in connection with BSPL and BPL, the values of the Major Assets which are liable for division are as follows: No.AssetPercentage of Husband’s shares in the company (%)Value of Husband’s shares ($)1APL83.51,786,777.302BPL100152,9283BSPL (inclusive of the Admiralty Street property)90747,764.104CPL9539,969.35Total2,727,438.75 59In her appeal against the Judge’s decision, the Wife argues that she should have been awarded 60% of the Major Assets (as opposed to the 30% awarded by the Judge). In this regard, the Wife raises the following points on appeal: (a) The Judge had erred in failing to translate her finding that the Wife had made “substantial” contributions to the companies to her final award of division. (b) The Judge was overly and unduly influenced by the Wife’s lack of direct financial contribution to the companies. On the contrary, the Wife states that the evidence demonstrates that the Husband did not make any real direct financial contribution to the companies. (c) The Judge had erred when she gave weight to the Wife’s alleged diversion of business from BSPL to her companies, especially since that specific issue forms the “pith and marrow” of Suit [B]. 60At the outset of our analysis on this particular issue, we emphasise that it would not be sufficient for the Wife to merely repeat her assertion made in the court below that she is entitled to a larger share of the matrimonial assets (see the decision of this court inKoh Bee Choo v Choo Chai Huah[2007] SGCA 21 (“Koh Bee Choo”) at [47]). The Wife must demonstrate that the Judge had erred in law, had clearly exercised her discretion wrongly, had taken into account irrelevant considerations, or had failed to take into account relevant considerations: seeKoh Bee Chooat [46] andYeo Chong Linat [80]. 61In our view, the first two grounds raised by the Wife at [59] above are not sufficient to warrant appellate intervention in the decision on division. It is clear from the GD that the Judge was cognisant of the Wife’s contributions to the business of the relevant companies. In this regard, we agree with the Judge that a spouse’s contributions in work and effort towards increasing the value of a matrimonial asset (such as the value of shares in the company) may properly be regarded as direct contributions under s 112(2)(a) of the Act, which states that the court may have regard to “the extent of the contributions made by each party in money, property orworktowards acquiring, improving or maintaining the matrimonial assets” [emphasis added]. In fact, the Judge considered the Wife’s direct contributions to increasing the value of the companies significant; she highlighted this point no fewer than four times in the GD (at [40]–[41], [43] and [50]), as follows: 40 … The Wife’s contributions were in the form ofher substantial efforts in improving the businesses and hence the value of the assets.… 41 … [O]n the evidence available before me, I accepted that the Wife hadcontributed substantively towards the remarkable growth of the companies. … 43 … On the whole, I found that the Wife hadclearly contributed by her efforts tothe substantial improvementof APL. … The parties treated the companies as a group such that the Wife’s efforts in improving APL also had an impact on the other companies. … 50 I noted that the Wife put inrather substantial effortstowards improving in particular APL and BSPL and that the parties treated the companies as a group, moving finances between companies to fund the necessary. Her efforts weremost substantialin the two businesses which made up 96 percent of the total value of the business to be divided … [emphasis added in italics and bold italics] 62In the light of the above passages, the Wife’s argument that the Judge failed to properly consider the extent of the Wife’s contributions to the business success of the companies is unpersuasive. In fact, the following paragraph extracted from the Wife’s written submissions is telling: In fairness to the [Judge], she was fully cognizant of [the Wife’s] “substantial” contributions to the companies as she referred to them more than once in the GD. The criticism (respectfully) we make is that the [Judge] somehow failed totranslatethis recognition of [the Wife’s] “substantial” efforts in her final award. When one reads the GD, the overall tenor is that [the Judge] was clearly impressed with [the Wife’s] efforts. Yet, when it came to the award, the proportion awarded to [the Wife] somehow did not appear to gel with her finding of [the Wife’s] substantial contributions in the earlier parts of the GD. Put simply, there (respectfully) appears to be a disconnect between the 2 and one is left wondering how the 30% was arrived at. [emphasis in original] 63Evidently, the Wife admits that the Judge had properly considered the Wife’s contributions to the companies. The essence of her submission is acomplaintthat,in her personal opinion, the division that the Judge arrived at was “disconnected” from the Judge’s finding of the Wife’s substantial contributions to the companies. However, the Wife’spersonal(and subjective) discontentwith the percentage eventually awarded isnot a ground for appellate intervention. Instead, an appellate court is concerned to ensure that a judge has exercised his or her discretion objectively and within proper legal boundaries. 64The Wife also argues that the Judge was unduly influenced by the fact that the Wife had made no directfinancialcontributions to the companies. She highlights that the Husband himself had made no direct financial contributions to the companies, at least in their initial stages. However, the evidence that the Wife relied on in her submissions related only toonecompany,viz, APL. We are therefore unable to accept the Wife’s assertions that the Husband did not contribute financially to the rest of the companies as there was no objective basis to do so. We note that the relevant companies,viz, APL, BPL, BSPL and CPL, were all incorporatedpriorto the parties’ marriage. Significantly, BPL was incorporated in 2000, six years before the parties’ marriage. In such circumstances, it is difficult, in the absence of objective evidence, to accept the Wife’s bare assertions that the Husband had not contributed to the various companies financially. In any event, we disagree with the Wife’s submission that the Judge wasundulyinfluenced by the lack of any direct financial contributions on the Wife’s part to the companies. Again, this was but one consideration, out of an entire matrix of factors, that the Judge had regard to in arriving at her decision. 65In assessing the appropriate division, the Judge found that the Wife haddivertedsome of BSPL’s businesses to other companies. It would seem that the Judge weighed this finding against the Wife and awarded her a lower percentage of the matrimonial assets in the light of that finding. 66With great respect, we find that the Judge had erred in doing so. We do not think that the Judge had sufficient material before her upon which she could arrive at a finding that the Wife haddivertedBSPL’s businesses to companies owned or controlled by her. It must be borne in mind that a finding that business has beendivertedfrom BSPL involves the necessary premise that such business originally belonged to BSPL. The Judge stated at [49] of the GD that she drew support for her conclusion from the decision of DJ Wong in SUM [A]. However, DJ Wong didnotmake an express finding that the Wife haddivertedBSPL’s business. Instead, DJ Wong’s finding was confined to whether the Wife had misrepresented the state of her financial resources. DJ Wong held that the Wife had concealed her business ventures and gave the impression that she could not earn an income. However, he stopped short of making an express finding that the business ventures which the Wife was involved in had, in fact, beendivertedfrom BSPL to companies which she had an interest in. Even accepting, for the moment, that some diversion of BSPL’s business had occurred, it is difficult to ascertain from the evidence theextentof such diversion. With respect, absent clear evidence to this effect, the court ought not to engage in an exercise of speculation. 67Furthermore, the court dealing with the issue of ancillary matters is not the appropriate forum, generally speaking, to adjudicate on the issue as to whether the Wife had wrongfully diverted BSPL’s business. If BSPL indeed believes that the Wife had committed a legal wrong against it, it is open to BSPL to commence an action against the Wife. The court would then be in an appropriate position to pronounce on the respective rights and obligations of either party after hearing the relevant evidence and submissions pertinent to the specific issue in dispute. In this connection, we note that this was in fact a course of action adopted by BSPL in Suit [B], at least in relation to one specific corporate opportunity,viz, the loss of BSPL’s opportunity to supply mashed potato machines to 7-Eleven. In our view, it would not be appropriate for the court dealing with ancillary matters to make a finding concerning the issue of diversion, which finding may, in fact, prejudiceon-goingorpotentialproceedings between BSPL and the Wife or her related companies. Indeed, this was also the position taken by the Husband in the proceedings below with respect to Suit [B]. 68In the premises, we vary the Judge’s order and award a division of 65:35 of the Major Assets, in favour of the Husband. We are satisfied that this is a just and equitable division of the matrimonial assets in the circumstances of the present case. We take into account the Wife’s substantial contributions to the business of the Major Assets and the Husband’s lack of full and frank disclosure of BPL’s accounts. We also note that the exercise in relation to the division of matrimonial assets is performed only in relation to the Major Assets, and that the parties were allowed to keep the rest of their assets in their own name. In effect, this exercise seeks to apportion the value of the Major Assets (which are all in theHusband’sname). In other words, the Wife standsonly to gainfrom the division exercise as the assets in her name are shielded from division. Furthermore, although we have refrained from making a finding that the Wife had diverted business from BSPL, it appears clear from the evidence and the findings of DJ Wong that the Wife has various business interests which she has failed to disclose. We therefore draw an adverse inference against the Wife for her failure to disclose these assets, which, as the Husband argued,prima faciefall within the pool of matrimonial assets. The effect of such an adverse inference, in the context of the present case, is that a lower percentage of the Major Assets is awarded to the Wife compared to that which we would otherwise have awarded to her (though in the light of the Husband’s non-disclosures, only a small adjustment is made). Finally, it must be borne in mind that the parties were in amarriage, and not merely acommercialorbusinessrelationship. Whilst the short and childless nature of the marriage meant that greater weight would be placed on the direct contributions of the parties to the matrimonial assets, this is not to state that the parties’ indirect contributions to the welfare of the family would be entirely disregarded in the assessment of division. It would be inappropriate to slice and dice the weight and appropriate ratio thateach and everyfactor ought to be given in the exercise of division, as the Wife seeks to do. As this court stated inNKv NL[2007] 3 SLR(R) 743 (“NKv NL”) at [36], the division of matrimonial assets is “not a mechanistic accounting procedure reflected in the form of an arid and bloodless balance sheet”. Indeed, the division of matrimonial property is not – and cannot be – a precise mathematical exercise. The focus is on achieving ajust and equitabledivision. In this connection, we are satisfied that both the Husband and the Wife have made substantial contributions to the welfare of the family. In particular, we are satisfied that the Husband has made not insubstantial contributions to the welfare of Q. 69We conclude the analysis by observing that although the structured approach set out inANJv ANK[2015] 4 SLR 1043 has not been applied by the Judge or the parties in the present case, we are satisfied that the division which we have arrived at gives due regard to the parties’ respective direct and indirect contributions, and that neither party has been over-compensated or under-compensated as a result. We vary the Judge’s orders in relation to the division of the Major Assets and hold that the Wife is entitled a sum of $954,603.56, which we round up to $955,000.",
        "Issue 4: Maintenance of the Wife": "70The Wife invites this court to grant her an award of maintenance that is contingent on the outcome of Suit [B]. She submits that if the court finds that she is not entitled to keep her mashed potato commissions in Suit [B], then the Husband should be ordered to pay her maintenance of $4,500 per month for eight years. In the alternative, the Wife seeks an award of nominal maintenance so as to preserve her right to apply for maintenance in the future. 71This court has inATEv ATDrecently laid down three broad guiding principles as to when nominal maintenance may or may not be awarded. First, nominal maintenance is not awardedautomaticallyoras a matter of course. Second, the court will not award nominal maintenance merely based on a wife’s assertion, without more, that her situation will change in the future. Third, the court in deciding whether to award nominal maintenance must always bear in mind the underlying rationale and purpose of an award of maintenance to former wives. In relation to the final principle, we made the following observations (at [31]): 31 … As this court stated inFoo Ah Yan v Chiam Heng Chow[2012] 2 SLR 506 (“Foo Ah Yan”), the overarching principle embodied in s 114(2) is that of financial preservation, which requires the wife to be maintained at a standard that is, to a reasonable extent, commensurate with the standard of living she had enjoyed during the marriage – but we also cautioned that s 114(2) had to be applied in a “commonsense holistic mannerthat takes into account the new realities that flow from the breakdown of marriage” (at [13] and [16]; emphasis in original). In this regard, some elaboration may be apposite. As this court (adopting the views of Prof Leong) has emphasised inFoo Ah Yanat [22] and [26]: 22    Furthermore, the duty of a husband to maintain his wife during the marriage, as provided by s 69(1) of the Act, and the obligation to provide maintenance to a former wife under s 113 of the Act aredriven by separate forces. As Prof Leong Wai Kum pointed out inElements of Family Law in Singapore[(LexisNexis, 2007)] at p 476: In the former situation, the objective is to provide modest maintenance, namely, to help her overcome her immediate financial need which may well be the same objective when ordering maintenance for a dependent child. In the latter situation, maintenance ordered for a former wife, however, serves the far more ambitious objective of giving her a fair share of the surplus wealth that had been acquired by the spouses during the subsistence of the marriage. Indeed, while the court must have regard to all circumstances of the case when ordering maintenance in both contexts, the matters that the Act specifically directs the court to consider under ss 69(4) and 114 of the Act are not identical. It is thus conceivable that one who justifiably fails to maintain his wife during the course of their marriage may nevertheless be obliged to do so after the marriage has ended. … 26    As the power to order maintenance issupplementary tothe power to order division of matrimonial assets,courts regularly take intoaccount each party’s share of the matrimonial assets when assessing the appropriate quantum of maintenance to be ordered: see, for example,BG v BF[[2007] 3 SLR(R) 233] at [75]−[76],Rosaline Singh[[2004] 1 SLR(R) 457] at [13];Tan Bee Giokat [27] andAQS[[2012] SGCA 3] at [51]. Indeed, this inquiry falls within the matters to be considered under s 114(1)(a) of the Act … … In a similar vein, Prof Leong has observed that the award of maintenance for aformerwife takes into account the fact that the former wife ought to try to regain self-sufficiency and that an order of maintenance isnotintended to create life-long dependency by the former wife on the former husband (seeLeongat pp 693−694 as well as the Singapore High Court decision ofQuek Lee Tiam v Ho Kim Swee (alias Ho Kian Guan)[1995] SGHC 23 at [13], [21] and [22], respectively (which paragraphs of this last-mentioned judgment are in fact cited by Prof Leong in her treatise)). [emphasis in original] 72We reject the Wife’s appeal concerning her maintenance, and affirm the Judge’s order that there should be no further maintenance for the Wife. It seems to us that what the Wife is seeking in the present case is for the Husband to be ageneral insurerof her legal costs and/or her damages in the proceedings which the Husband and BSPL have commenced against her. This is, as we observed in a different context inATEv ATD, wholly contrary to the very purpose of awarding maintenance to a former wife in the first place. 73In fact, the Wife’s stated reasons in her submissions for seeking an order of interim maintenance is to serve as “a useful Sword of Damocles to keep [the Husband] in check against filing frivolous actions against [the Wife]”. It is wholly unmeritorious for the Wife to seek an order of nominal maintenance on this basis. Inasmuch as the Wife’s complaint is that the Husband has commenced legal actions against her which are without merit, frivolous and vexatious, the appropriate way for such issues to be addressed is by applying to strike out the Husband’s claims or by seeking an order of indemnity costs against the Husband. The purpose of an order of maintenance isnotto place a sword of Damocles over the Husband’s head, but to ensure that the Wife achieves financial preservation. 74In this connection, we are satisfied that the amount awarded as interim maintenance, amounting to $416,000, is more than a fair and reasonable amount to be awarded to the Wife as maintenance. The marriage between the parties was a short and childless marriage of less than five years. The Wife worked during the course of the marriage, and is, by all accounts, a determined and capable businesswoman. Prior to her marriage to the Husband, she operated five hair and beauty centres and three foot reflexology businesses. The revenue of these businesses was $719,436 in 2003. She appears to be actively continuing her business endeavours. In the circumstances, we affirm the Judge’s order that there be no further maintenance for the Wife. 75For completeness, we also point out that having rejected the basis upon which the Wife seeks an order of contingent or nominal maintenance, we therefore also conclude that the documents which the Wife seeks to adduce in SUM 15/2016 are ultimately irrelevant to the issues of maintenance.",
        "Issue 5: Maintenance of Q": "76The final issue before us concerns the maintenance of Q. To summarise, the Husband seeks a refund of the whole, or a part of, the interim maintenance paid to Q. In order to place this issue in its proper context, we begin by setting out the history of the interim maintenance orders. 77The first order for interim maintenance for the Wife and Q was granted by the District Court on 17 April 2012. Both the Husband and Wife appealed against the order. The appeals came before Woo Bih Li J who dismissed the Husband’s appeal but allowed the Wife’s appeal, bringing forward the starting time when the Husband became liable for interim maintenance from 1 December 2011 to 1 May 2011. Woo J expressly stated in his order that: For the avoidance of doubt, the finding of fact as to whether the child is a child of the family is set aside as an issue to be decided on the hearing of the ancillary matters subject to any further or other order that the Court may make subsequently[.] 78The subsequent application to vary the amount of interim maintenance does not appear to have had a bearing on this issue. Hence, the factual issue of whether the Husband had accepted Q as a child of the family is a factual finding that the Judge was required to make. However, it appears that the Judge did not in fact do so. 79The determination of this issue involves the interpretation of s 70 of the Act (“s 70”). For ease of reference, we reproduce s 70(1)–(3) of the Act below: Duty to maintain child accepted as member of family 70.—(1) Where a person has accepted a child who is not his child as a member of his family, it shall be his duty to maintain that child while he remains a child, so far as the father and the mother of the child fails to do so, and the court may make such orders as may be necessary to ensure the welfare of the child. (2)  The duty imposed by subsection (1) shall cease if the child is taken away by his father or mother. (3)  Any sums expended by a person maintaining that child shall be recoverable as a debt from the father or mother of the child. 80A brief history of the provision is apposite. Section 70 was first introducedviathe Women’s Charter (Amendment) Act (No 26 of 1980). It was based upon s 99 of the Malaysian Law Reform (Marriages and Divorce) Act 1976 (“the Malaysian Act”) (see theComparative Tableto the Women’s Charter (Amendment) Bill (Bill No 23/79) (“the Bill”) (and, in so far as the general background to the Malaysian Act is concerned, seeReport of the Royal Commission on Non-Muslim Marriage and Divorce Laws(Kuala Lumpur, 1971) (“Report on the Malaysian Act”))). Section 99 of the Malaysian Act isalmostidentical to s 70 withone crucial differencein that s 99 of the Malaysian Act applies only to a situation wherea manhas accepted a child who is not his child as a member of his family. Originally, the proposed section, like s 99 of the Malaysian Act, applied only to “a man” (see s 127 introducedviacl 17 of the Bill). The provision was however later amended to substitute “man” with “person” after the Select Committee on the Bill accepted Prof Leong Wai Kum’s recommendation that if the policy behind the section was that a person who had accepted a child to be a member of his or her family should help in maintaining the child, there was then “no basis for distinguishing between a man and a woman who is capable of bearing the financial responsibility” (seeReport of the Select Committee on the Women’s Charter (Amendment) Bill (Bill No 23/79)(Parl 1 of 1980, 25 June 1980) at pp 7, A 14 and C 20). Sections 70(4) and 70(5) were enacted in 1996videWomen’s Charter (Amendment) Act 1996 (No 30 of 1996) to make the provisions in s 70 consistent with those that deal with the maintenance of wife and children in s 69 (seeReport of the Select Committee on the Women’s Charter (Amendment) Bill (Bill No 5/96)(Parl 3 of 1996, 15 August 1996) at p E-15). 81This court has not yet had the opportunity to examine or apply this provision. We are also cognisant of the fact that there is apparently conflicting High Court authority concerning the interpretation of this provision and the interrelations between the sub-provisions. We therefore take this opportunity to analyse the scope and applicability of s 70. In particular, we will examine the following main issues: (a) when a non-parent’s duty under s 70 is triggered; and (b) the circumstances in which the non-parent’s duty to maintain the child ceases. In this connection, our reference to a “non-parent” in the following analysis should be read as a reference to an adult who is neither the biological nor the adoptive parent of the relevant child. 82Before dealing with these two broad issues, we set out some preliminary observations on the power of the court to order maintenance for children in matrimonial proceedings.",
        "The power of the court to order maintenance for children in matrimonial proceedings": "83The power of the court to order maintenance for children during the pendency of matrimonial proceedings and at any time subsequent to the grant of a judgment of divorce may be found at s 127 of the Act, which states as follows: Power of court to order maintenance for children 127.—(1)  During the pendency of any matrimonial proceedings or when granting or at any time subsequent to the grant of a judgment of divorce, judicial separation or nullity of marriage, the court may order a parent to pay maintenance for the benefit of his child in such manner as the court thinks fit. (2)  The provisions of Parts VIII and IX shall apply, with the necessary modifications, to an application for maintenance and a maintenance order made under subsection (1). 84For the purposes of s 127, “child” is defined as “a child of the marriage as defined in section 92 but who is below the age of 21 years” (see s 122 of the Act). In turn, s 92 of the Act defines a “child of the marriage” as follows: “child of the marriage” means any child of the husband and wife, and includes any adopted child and any other child (whether or not a child of the husband or of the wife) whowas a member of the family of the husband and wife at the time when they ceased to live together or at the time immediately preceding the institution of the proceedings, whichever first occurred; and for the purposes of this definition, the parties to a purported marriage that is void shall be deemed to be husband and wife … [emphasis added] 85The relationship between s 70 and s 127 of the Act was a point which was explored by Woo J in the Singapore High Court decision ofEBv EC (divorce: maintenance of stepchildren)[2006] 2 SLR(R) 475 (“EBv EC”). Essentially, Woo J held that s 127 stipulates the power of the court, but the exercise of the power in s 127 had to be premised on a duty to maintain (at [15]). A biological parent’s duty to maintain a child is provided for under s 68 of the Act, while anon-biological parent’s duty to maintain a child is provided for under s 70. 86This is an approach that we agree with. As this court recently observed inAXMv AXO[2014] 2 SLR 705 at [33], s 127 is “essentially a procedural provision which brings into operation the provisions of Pts VIII and IX of the Act”. This includes the substantive obligation of non-parents to maintain children accepted as a member of the family set out under s 70. We also accept, in this regard, the views of Prof Leong expressed inElements of Family Law(LexisNexis, 2nd Ed, 2013) (“Family Law”) at p 410, that the duty of a step-parent to maintain a child is found in s 70, and not ss 68 or 69, of the Act. In this regard, we endorse the following views of Prof Leong inFamily Law(at p 410): … ‘[P]arent’ in the Women’s Charter sections 68 and 69(2) should not include a step-parent. The step-parent has only married a biological or adoptive parent of the child. She has not taken any step towards creating a formal legal relationship with the child. In the context of child maintenance where there exists two legal bases to hold a person liable to provide maintenance to the child, it makes for more rational understanding of these bases if a step-parent were equated with a non-parent rather than with the biological or adoptive parent. 87Having established the basis of the court’s power to order a step-parent to pay maintenance for a child, we now turn to the scope of the non-parent’s duty under s 70. It is only where the step-parent’s duty to maintain the child arises under s 70 that the court is able to order maintenance during the pendency of divorce proceedings under s 127 of the Act.",
        "When does a non-parent’s duty to maintain a child arise under s 70?": "88A literal reading of s 70(1) of the Act (“s 70(1)”) indicates that there are two conditions to be satisfied before a non-parent’s duty to maintain a child arises. First, the child must be “accepted … as a member of his family”. Second, the non-parent’s duty is to maintain the child “so far as the father or mother of the child fails to do so”. Both the Husband and Wife referred to English decisions and statutes in their submissions concerning the interpretation of s 70 of the Act. In the premises, we begin by considering the position of a non-parent’s duty to maintain a child under English law before turning to the interpretation of s 70. Indeed, a consideration of the English position is also apposite as s 99 of the Malaysian Act (upon which s 70 was based (see above at [80])) appears to find its source (in turn) inEnglishroots (cfalso Ahmad Ibrahim, “The Law Reform (Marriage and Divorce) Bill, 1975” [1975] JMCL 354 at 360). The position under English law 89Prior to 1958, the court’s jurisdiction to order maintenance for children extended only to legitimate and legitimated children of the two spouses and children adopted by the two spouses (seeRoyal Commission on Marriageand Divorce, Report 1951–1955(Cmd 9678, 1956) (“the 1951–1955 Report”) at para 572). The United Kingdom (“UK”) Royal Commission, which was tasked to review the law of England and Scotland concerning marriage and divorce, recommended that the courts in England and Scotland should have the power to order one or the other spouse to make provision foradditionalclasses of children, being the following: (a) illegitimate children of the two spouses; (b) children of either spouse (including a child adopted by either spouse), if living in family at the time when the home broke up; (c) illegitimate children of either spouse, if living in family at the time when the home broke up; and (d) other children (excluding boarded-out children) who were living in family with the spouses and maintained by one or both of them at the time when the home broke up. 90The Royal Commission stated (at para 576 of the 1951–1955 Report): … We think … that where a spouse has accepted children into the family and has contributed to their support the court should have a discretion to make such order as it considers appropriate. We were in some doubt whether we should include in our recommendation [the children referred to above at [89(d)]] but, on balance, we think that this would be desirable. We contemplate that in such cases the court would ascertain whether there was a natural parent living who could support the child and that the court would also take into consideration how long the child had been part of the family. 91This led to the enactment of the Matrimonial Proceedings (Children) Act 1958 (6 & 7 Eliz 2) (c 40) (UK) (“the 1958 UK Act”). Section 1(1) of the 1958 UK Act furnished the English High Court the power to make provision for the custody or maintenance in matrimonial proceedings for in relation to “a child of one party to the marriage (including an illegitimate or adopted child) who has beenacceptedas one of the family by the other party” [emphasis added]. The Matrimonial Proceedings (Magistrates’ Courts) Act 1960 (c 48) (UK) (“the 1960 UK Act”) was also enacted to extend similar powers to the English Magistrates’ Courts. Subsequently, the 1958 UK Act was repealed and the Matrimonial Causes Act 1965 (c 72) (UK) (“the 1965 UK Act”) was enacted. Section 34(1) of the 1965 UK Act permitted the court to make such order as it thought fit in matrimonial proceedings for thecustody, maintenance and educationof any “relevant child”. “Relevant child” was defined under s 46(2) as: … a child who is— (a) a child of both parties to the marriage in question; or (b)a child of one party to the marriage who has been accepted as one of the family by the other party, and in paragraphs (a) and (b) of this definition “child” includes illegitimate child and adopted child … [emphasis added] 92In relation to orders ofmaintenance, s 34(4) of the 1965 UK Act provided that in considering whether any and what order should be made requiring a party to maintain a child of one party to the marriage who had been accepted as one of the family by the other party, the court was to have regard to (a) the extent to which that party had, on or after the acceptance of the child as one of the family,assumed responsibilityfor the child’s maintenance; and (b) the liability of any person other than a party to the marriage to maintain the child. 93The English courts adopted what was later viewed as a narrow interpretation of the meaning of “accepted”. We refer to two cases to illustrate this point. In the English High Court decision ofB vB and F[1968] 3 WLR 1217 (“Bv B”), a wife left her husband, taking all six children with her. The husband believed all six children to be his. However, it was later discovered that he was not the father of the two youngest children. Subsequently, the husband applied for an order that he should have access to the two youngest children, arguing that he had accepted them as children of the family. Stirling J held that this required the non-parent to show,inter alia, that (a) he had full knowledge of the material facts (viz, acceptance of anon-biologicalchild), and (b) an unequivocal mutual agreement between the spouses of the family, whether by conduct or otherwise, that the child should be accepted into the family. The court held that the non-parent had failed to satisfy these requirements, and accordingly, the court was unable to grant the non-parent access to the children under the 1965 UK Act. In another English High Court decision ofPv P[1969] 1 WLR 898 (“Pv P”), the wife had three children from previous relationships when she married the husband. She, however, misrepresented to the husband that the three children were of her partner from a prior marriage, and that her previous partner had been killed in an accident. After the parties’ marriage, the husband sought to accept the children into the family, meeting resistance from the wife, who did not intend the husband to have control over her children. Later, the parties separated, and the children sought maintenance from the husband. As the wife had never agreed to the children being accepted as children of the family, the husband could not be held responsible for their maintenance (at 902–903). 94InFamily Law: Report on Financial Provisions in Matrimonial Proceedings(Law Com No 25) (24 July 1969), the Law Commission of England and Wales (“the Law Commission”) expressed its dissatisfaction with the above position in the following terms (at p 13, para 28): One of the things that we find disturbing about some of these decisions is thatthey look at the question solely from the point of view of the spouse and not at all from that of the child whose interests are equally important and, perhaps, paramount. It may be hard for a cuckolded husband to have to continue to bear a responsibility which he has assumed in ignorance of some of the relevant facts. But his ignorance is not the fault of the child but of the wife whom he took on for better or worse, and the hardship to the child of being deprived of support is even greater. Moreover, how far will the courts be prepared to go in saying that acceptance involves knowledge of material facts? A mistaken belief that one is the parent is clearly highly material, but is it the only material factor? Suppose the husband accepts the child in the belief that it is the child of his brother, whereas in fact it is the child of a stranger of a different race, religion and colour? Many people would regard this as an equally fundamental mistake. Yet surely the mistaken beliefs of the husband, though they may be relevant in determining his position vis-à-vis the wife, should not determine his position vis-à-vis the child, or, more especially, operate to exclude for all purposes the child from being a child of the family. [emphasis added] 95The Law Commission proposed that, instead of the phrase “accepted as one of the family”, the phrase “treated by both spouses as a child of their family” should be used. In its view, an advantage of using the word “treat” is that it retains the essential criteria of acceptance, while doing away with the criterion of full appreciation of the facts (at p 14, para 30, note 61), and the need to establish an unequivocal mutual acceptance (at p 15, para 31, note 66). 96The Matrimonial Causes Act 1973 (c 18) (UK) (“the 1973 UK Act”) which was later enacted incorporated the Law Commission’s recommendation. The 1960 UK Act was also repealed with the enactment of the Domestic Proceedings and Magistrates’ Court Act 1978 (c 22) (UK) which also refers to the concept of “treatment” as opposed to “acceptance”. Thus, the concept of “treatment” represents the current position under English law. Under the 1973 UK Act, a non-parent may be required to maintain a “child of the family”, which is defined under s 52(1) of the 1973 UK Act as such: “child of the family”, in relation to the parties to a marriage, means— (a) a child of both of those parties; and (b) any other child, not being a child who is placed with those parties as foster parents by a local authority or voluntary organisation,who has been treated by both of those parties as a child of their family… [emphasis added] 97In deciding whether a party ought to maintain a child of the family who is not a child of that party, s 25(4) of the 1973 UK Act provides that the court shall also have regard to: (a) whether that party hadassumed any responsibilityfor the child’s maintenance, and if so, the extent to which and the basis upon which that party assumed such responsibility, and to the length of time for which that party discharged such responsibility; (b) whether, in assuming and discharging such responsibility, that party did so knowing the child was not his or her own; and (c) the liability of any other person to maintain the child. 98We refer to two decisions decided under the 1973 UK Act. The first is the English Court of Appeal decision ofMv M (child of the family)[1980] 2 FLR 39 (“Mv M”). In this case, shortly after the parties had gotten married, they separated and the husband and wife lived completely separate lives. The wife became pregnant by another man. She visited the husband with the baby after she had given birth, and the husband’s mother assumed that the husband was the father of the child. The husband did not repudiate this and also allowed the wife’s family to think that it was his child. Thereafter, the parties continued their separate lives, although the husband would occasionally visit the mother and child and buy gifts, signing off as “Dad”. On these facts, the judge held that the husband had treated the child as a member of the family. This was reversed on appeal. The English Court of Appeal held that, firstly, the parties only constituted a family during the short time before they had separated. It was thus not possible for the child to be treated as a member of thefamilyas there was no relevant family to speak of. Secondly, it was held that the evidence only went far enough to demonstrate that the husband took part in the pretence without protest, but that this did not amount to treating the child as a child of the family. In particular, Ormord LJ stated that the test was to be applied broadly (at 45): … People try to preserve reasonably good human relationships with one another without guarding their legal position with meticulous care. It would be very unfortunate, I think, if any decision of this court were made which in any way embarrassed people in such situations from behaving, or prevented them from behaving, sensibly to one another. It is really a great mistake and clearly contrary to the whole meaning of the legislation to create such an artificial and legalistic situation in such a sensitive area of family life. I think the court should look at this question of “treating a child as a child of the family” broadly and answer it broadly as far as possible, trying to reach the sort of conclusion that any ordinary sensible citizen would reach when asked the question. … 99In the English Court of Appeal decision ofDv D (child of the family)[1981] 2 FLR 93 (“Dv D”), the mother of a child re-married. She sought maintenance of the child from her husband, the child’s step-father. It was found that the child generally lived in her grandparents’ house, though she would occasionally stay with her mother and step-father when she felt like it. A room was kept for her at her mother’s home where her belongings were kept. The step-father bought a pony for the child and expected her to groom and clean it. He would also reprove her if she failed to keep her room tidy. During certain years, the step-father had also claimed child relief as an allowance in his taxable income. On these facts, the judge found that the child had been treated as a child of the family. The step-father appealed, and the appeal was unanimously allowed by the court. In the main, the court considered that the facts did not show that the step-father had treated the child anything more thanhis wife’schild. 100The comments made by the court inDv Dare significant. Ormord LJ held that the test to be applied was an objective one (at 96). Templeman LJ set out a non-exhaustive list of the factors a court would bear in mind in deciding if a child had been treated by a step-father as a child of his family. This included factors such as where the child lives, who pays for the child, who exercises discipline over the child, and whether the step-father had in fact exercised, or claimed any responsibilities of a parent. He held that he was unable, on the facts, to “draw the inference that [the step-father] accepted the responsibility of a parent”, and held that there was “nothing to show that [the step-father and wife]jointly…assumedthe responsibility andexercisedthe responsibility of parents of the child” [emphasis added] (at 98). 101Given the differences in the legislative structure and language, the English position is not fully applicable in the Singapore context. That being said, there are nevertheless useful lessons that may be gleaned from the English position (particularly with regard to English case law dealing with the prior legal position which (like s 70) centred (only) on the concept of “acceptance”), which we elaborate on in the following sections. Whether a child has been accepted as a member of the non-parent’s family 102Prof Leong opines inFamily Lawthat the basis of a non-parent’s duty to maintain a child rests in the non-parent’svoluntary assumption of responsibilityfor the child’s maintenance (at p 417). Indeed, the same concept of assumption of responsibility finds legislative expression in both the 1965 UK Act and the 1973 UK Act as a factor which the court is tasked to take into account when ordering maintenance against a non-parent (see above at [92] and [97]). 103In our view, the concept of “acceptance” as part of one’s family embodies, butalsoentailsmorethan, the voluntary assumption of responsibility for the child’s maintenance; it is the voluntary assumption ofparentalresponsibility that is crucial. In this regard, we agree with Templeman LJ’s salutary observations inDv Dthat the question is whether the non-parent had acceptedparental responsibilities. This is ultimately a question offact, taking into account all the relevant circumstances and context before the court itself (see, for example, the English Court of Appeal decision ofBowlas v Bowlas[1965] 3 WLR 593 at 597 and 601 and the English High Court decision ofRv R[1968] P 414 (“Rv R”) at 417). The inquiry ought also, in our view, to be anobjectiveone inasmuch as it is premised on a consideration of all the objective evidence before the court (see also the English Court of Appeal decision ofSnow v Snow[1971] 3 WLR 230 at 245,perBagnall J). Thus, the court’s task is to identify indicia which demonstrate, on the objective facts, that the non-parent had voluntarily taken onparentalresponsibility for the child’s welfare. Statements by a non-parent during proceedings that he or she did not accept the child as a member of his or her family would be tested against the objective evidence. Strong indicators of acceptance into the family would include the changing of the child’s surname to that of the non-parent, or whether the child has been encouraged to address the non-parent in parental terms, such as “father” and “mother” or “dad” and “mum”. It bears emphasising that the court ought not to, in assessing the facts, engage in too technical or legalistic an approach that might in fact undermine the veryraisiond’êtreof the statutory provision itself. In an area as sensitive as determining the relationship between a non-parent and a child, the question must at all times be decided with reference to the conclusion an “ordinary sensible citizen” (borrowing the words of Ormord LJ inMv M) would reach when asked the question. 104Whether or not a person can be held to have accepted a child within the meaning of s 70(1) can be derived either from an express declaration or arrangement on the one hand, or by an inference from that person’s conductvis-à-visthe child concerned on the other. The former is, of course, a form of the latter, albeit, in the nature of things, constituting the clearest form of conduct possible. In so far, however, as the latter is concerned, whether such conduct demonstrates that a person has accepted a child as a member of his or her family would depend on the precise facts and circumstances concerned. 105Prof Leong states inFamily Law(at p 417) that “[s]omeone who marries a parent will readily be found to have voluntarily assumed responsibility to provide reasonable maintenance to her spouse’s child”. This was also the position taken by Ormrod J (as he then was) in the English High Court decision ofKirkwood v Kirkwood[1970] 1 WLR 1042 (“Kirkwood vKirkwood”) at 1046 (see the quotation set out below at [107]). We see the force in such an approach. Indeed, it has been recognised both statutorily and in case law that “marriage [is] an equal co-operative partnership of efforts” (see the decision of this court inNK v NLat [20] as well as s 46(1) of the Act). Such effort would, in the absence of evidence to the contrary, include efforts byboth partiesto bring up the children of one party to the marriage. However, this is not to say that inallcases, a step-parent will be found to have accepted a step-child as a member of his or her family. Everything will depend on the facts and circumstances of each case, although in such cases, acceptance would be more easily established. 106There are also important lessons to be gleaned from the English experience in the interpretation of the concept of “acceptance”. In particular, the question arises, as a matter of Singapore law, the extent to which the two factors of (a) knowledge of the full facts and (b) an unequivocal agreement between both spouses to accept the child, apply as factors in the inquiry as to acceptance. As these two factors are not relevant to the present appeals, we express, only briefly, ourprovisionalviews on these two matters. Whilst we think that these two factors may berelevantto the inquiry as to acceptance, they ought not to benecessary conditionsto be satisfied before it may be held that the non-parent has “accepted” the child as a part of his or her family. 107We donotthink that a non-parent mayonlybe found to accept a child as a member of his or her family on the basis of a full understanding of the facts (thoughcfR v R, especially at 417 as well asperLord Denning MR in the English Court of Appeal decision ofIn reL (an infant)[1967] 3 WLR 1645 at 1652−1653). In our view, under s 70, theparamountconsideration centres on theinterests of the child. There is force in the Law Commission’s views (above at [94]) that the extent of any non-disclosure ought not to affect the court’s view of the relationship between the non-parent and the child. Provisionally, we think that the appropriate focus under s 70 isthe quality of the relationshipbetween the non-parent and the child. Hence, if the non-parent had assumed parental responsibility on the basis of facts which later turned out to be false, this should not be a bar to a court finding that the non-parent had accepted the child as a member of his or her family. An illustration in this regard may be found in the case ofKirkwood v Kirkwoodwhere the husband concerned claimed that he had not “accepted” the two children of the wife by her previous marriage. In particular, he claimed that he had not been aware that the children were illegitimate (and were not the children of the wife’s first husband, as she had claimed). Ormrod J rejected the husband’s argument and observed as follows (at 1045−1046): The provisions in the Matrimonial Proceedings (Magistrates’ Courts) Act, 1960, and the Matrimonial Causes Act, 1965, of a corresponding nature [both of which originated in s 1 of the 1958 UK Act], are clearly designed primarily for the protection of children who are in this position of being children of one spouse and not of the other; and if this court were to lay down that acceptance involves something approaching a contractual arrangement so that it would be vitiated by non-disclosure or something of that kind, we might be driving a very large wedge into this statutory provision, because the facts here are that the husband accepted two children of his future wife, and in that respect it differs, I think, from cases likeR.v.R.[1968] P. 414, in which the basis of the case had been that the husband did not know at the time that the child or children were not his, and therefore he accepted the children believing them to be his, and not questioning the matter, when in fact it turned out afterwards that they were not his at all—so that his mind had never been directed to the question whether or not he was prepared to accept another man’s child or children into the family. This is not the situation in this case at all. The husband was perfectly prepared to accept these two children, the only question being whether the non-disclosure of the illegitimacy can affect their acceptance. In my judgment it cannot. Even if this disclosure might have seriously affected his mind in deciding to marry or not, the non-disclosure should not affect the question whether he had accepted the children in law. It would obviously be an inadequate ground to justify a court in interfering with the validity of the marriage. The courts in this country have always rigorously set their face against avoiding marriage on the ground of non-disclosure, except in the most extreme circumstances and with the most extremely thorough safeguards. This is to open a door which is an extremely dangerous one, and my own view is that it would be quite wrong to introduce this sort of concept into the question of acceptance of children as part of the family. It is necessary, of course, that the husband should know that they are not his children if he is to bring his mind to bear on this question at all; but where, as here, we have a marriage to a woman with two children, in my judgment, that is enough, prima facie, to establish acceptance by him. 108The observations made by Ormrod J in the preceding paragraph are, in our view, equally applicable with the position under s 70(1). This is also consistent with the need for the law to provide – as far as it is both possible as well as reasonable – for the welfare of children generally. What s 70 attempts to do, in our view, is tostrike a balancebetween achieving justice and fairness for the child on the one hand and for the non-parent on the other. We are also of the view that such an approach does not do violence to the concept of “acceptance” that represents the current legal position under Singapore law. Indeed, as already emphasised above (at [104] and [105]), everything depends on the precise facts and circumstances of the case. It is entirely conceivable that, in anegregioussituation involving fraudulent conduct that impacts the knowledge of the non-parent concerned as well as the quality of the relationship between the non-parent and the child, the court may well find that there had been no acceptance by the non-parent of the child. It should be noted that the current position under Singapore law remains that of “acceptance” (rather than that of “treatment”) which envisages that the acceptor’s state of mind is a relevant factor in the inquiry. In this regard, we note too that it has been observed that the concept of “treatment” posits amore objective testthan the concept of “acceptance”: see the comments of Ormord LJ inDv Dat 96. 109In the context of s 70(1), which fixes the duty of maintenance generally on non-parents (and not divorcingspousesper se), we do not think it necessary to find an agreement or a mutuality of intention between bothspousesbefore acceptance into the non-parent’s family may be found on the facts. The crucial question to be answered is whether the non-parent in question (whether a step-parent, grandparent, relative or even stranger) interacted with the child as if he or she was the child’sparent. However, if the natural parent of the child had evinced an intention that the child ought not to be accepted as a member of the non-parent’s family, as was the case inP v P, this, in our view, would be a relevant matter in the inquiry as to whether or not there had been acceptance by the non-parent of the child concerned. 110Finally (and for the sake of completeness), there must – perhaps both logically as well as commonsensically – also be a family into which the child concerned can in fact be accepted (see, for example,Bv Bat 1221). However, the question, which we leave open to be considered in the appropriate case, is whether a “family”, for the purposes of s 70(1), must be that of a two-parent family, or whether a “family” may comprise a unit consisting ofanon-parent and a child alone. Failure of parents to maintain the child 111The second factor under s 70(1) of the Act which must subsist before a non-parent’s duty to maintain a child arises is the failure of the child’s parents (whether biological or adoptive) to maintain the child. The presence of this condition is a recognition of the primacy of parental liability to a child. Evidently, the relationship between a biological parent and a child is special, in that it is a relationship created naturally without legal process. The relationship between adoptive parents and children also deserves a higher status as the process of adoption “irrevocably severs the relationship between the biological parents and their child”, replacing it simultaneously with a relationship between a new set of parents and a child (seeFamily Lawat p 379 and s 7 of the Adoption of Children Act (Cap 4, 2012 Rev Ed)). Parents are therefore in unique positionsvis-à-visa child. In this regard, we endorse the views of Assoc Prof Debbie Ong (as she then was) in “Family Law” (2011) 12 SAL Ann Rev 298 (“2011Family Law Review”) where she stated (at para 15.6): … Parents stand in an exalted position with respect to having authority over the upbringing of their children. They are also expected to bear the greatest responsibility for the protection, nurture and maintenance of the children. … 112To what extent must the failure of the parents to maintain the child be proved before a court may hold that the non-parent’s duty to maintain the child arises? In particular, the question arises as to whether it must be demonstrated that the child’s biological parents lack thefinancial meansto provide adequately for the child,orwhether it is sufficient to show that they, irrespective of their means, havenotprovided for the child. In the Singapore High Court decision ofAAEv AAF[2009] 3 SLR(R) 827 (“AAEv AAF”), Belinda Ang Saw Ean J adopted the former approach. She declined to require the non-parent to pay maintenance for the child where there was no evidence that the wife (the child’s mother) would not be able to financially maintain the child. It is also pertinent to note that, in that case, the biological father of the child was still in a relationship with the wife. Ang J was of the view that maintenance should first be sought from the biological parents. It thus appears that Ang J’s approach requires it to be demonstrated, presumably on a balance of probabilities, that the biological parents did not have the financial capability to maintain the child before an order against a non-parent would be made. 113The latter approach was adopted inEBv EC. In that case, it was accepted that the mother could not maintain the children, but the submission was made that maintenance should first have been sought from the children’s biological father before an order was made against the non-parent. At the material time, the biological father was paying nominal maintenance for the children at $2 per month. Woo J held that in such circumstances it could be said that the biological father had failed to maintain the children. Failure to maintain did not require a total failure, but a failure toadequatelymaintain the children (see also the Singapore High Court decision ofAJEv AJF[2011] 3 SLR 1177 (“AJEv AJF”) at [11]–[12]). Although the biological mother of the children had failed to obtain an order for substantive maintenance, Woo J stated that this “[did] not change the fact that [the children’s biological father] too is not fully maintaining them” (at [25]). Hence, it appeared that in Woo J’s view, there was no need to prove an inability to maintain ifin factthere wasinadequatemaintenance. However, Woo J was also of the view (at [28]) that the burden of maintenance ought not to be permanently imposed on the non-parent. 114Bearing in mind that one of the purposes of s 70 is to safeguard the interests of the child, we find the approach taken inEBv ECmore appropriate. Section 70 is in place as a “stop-gap measure to provide for a child with immediate needs” (see 2011Family Law Reviewat para 15.6). It would be too onerous a burden if the applicant for maintenance is required to demonstrate that the child’s parents, who may, in some cases, be missing or un-contactable, do not have the resources to provide for the child. A non-parent who has accepted the child as a member of his or her family will therefore have a duty to provide for the child’s maintenance under s 70(1) as long as it appears thatin factthe child has not been adequately maintained by his or her parents, thereby safeguarding the child’s welfare in ensuring that the child is at all times adequately provided for. This is not to say, however, that a non-parent would be unfairly fixed with liability for maintenance of a child if a child’s parents are in fact fully capable of doing so, but wilfully refuse to maintain the child. This is because s 70(3) of the Act (“s 70(3)”) furnishes the non-parent an avenue to recover the sums expanded on the child from the biological parents. 115InAJEv AJF, Kan Ting Chiu J identified difficult questions arising from the application of s 70(3). He observed thus (at [16]–[17]): 16  On the husband’s third point that any maintenance he pays to [the Child] would be recoverable from the wife as a debt under s 70(3), the provision raises difficult questions: (a)  As the maintenance is paid in the discharge of duty imposed by law on the non-parent, why is it recoverable as a debt from the father or mother of the child? (b)  Why should the person who had voluntarily accepted the child as a member of his family have recourse against the child’s parents for expenditure he incurs on the child? (c)  As the amount of maintenance to be paid is dependent on the means of the non-parent, why should the father and mother repay the non-parent the amount he paid based on his means and without regard to their means? (d)  Is the liability of the father or mother to repay a joint or several liability? 17  The husband is relying on s 70(3) because it is there, and he may not be able to, and in any event, he is not the best party to answer the questions. It suffices, however, to note that on any reading of s 70 as a whole, s 70(3) cannot cancel s 70(1). 116In our assessment, s 70(3) must be applied sensibly on the facts. We agree with Kan J’s observation that s 70(3) ought not to cancel out or render nugatory s 70(1). Thus, in the context of an order made against a non-parent who is in a relationship with one of the child’s parents, he or she would not be allowed to reclaim the expenditure from that parent. However, it would be open to the non-parent to reclaim the sums from the child’sotherbiological parent. 117We have also addressed points (b) and (c) raised by Kan J above. In the interest of clarity, we restate our conclusions. In so far as point (b) is concerned, we have observed that the reason a non-parent may have recourse to a parent for the expenditure is because of the law’s recognition that theprimaryliability for a child’s maintenance lies on the child’s parents. In so far as point (c) is concerned, given our interpretation that a non-parent’s duty may arise even in circumstances where the child’s parents have the means to maintain the child as long as the child’s parents have failed in fact to maintain him or her, this concern may be, to an extent, alleviated.",
        "Circumstances in which a non-parent’s duty to maintain ceases": "118In general, the various authorities are agreed that a non-parent’s duty to maintain a child may cease. However, what remains unsettled are the circumstances and manner in which cessation of the duty may take place. 119InAJEv AJF, Kan J held (at [15]) that: Section 70(1) states that when a person “has accepteda child … as a member of his family, it shall be his duty to maintain” … the child. It also states that the person shall have a duty to continue to maintain the child “while he remains a child” andnot while the child continues to be accepted as a member of the family. Following from that, once the personhas accepted the childas a member of his family, the duty arises, andonly ceases when the child ceases to be a child. There is one express limitation to the scope of the duty. Section 70(2) provides that the duty shall cease if the child is taken away by his father or mother.The person has no rightto opt out of the duty– s 70 does not state that after a person has accepted the child as a member of his family, he can change his mind and stop maintaining the child. Since family acceptance is the basis for the duty, it can be argued that the duty ends only when, by circumstances not of the person’s making, the quasi-familial relationship between the person and the child ends,eg, when the child renounces the relationship, or he is taken away by his parent. [emphasis in italics in original; emphasis in added in bold] 120The above may be contrasted with the position taken by Woo J inEB vEC, Ang J inAAEv AAFand the Judge in the court below. These cases appear to support the proposition that a non-parent’s duty to maintain a child may cease upon the elapsing of a reasonable time after the non-parent has indicated, by way of divorcing (or being divorced by) the biological parent, that he or she no longer wishes to maintain the child. InEBv EC(at [20]), Woo J quoted from Leong Wai Kum,Principles of Family Law in Singapore(Butterworths Asia, 1997) at p 861: The underlying basis of this duty differs from that of a parent. A parent is, naturally, liable for his or her child’s maintenance. The basis of a parent’s duty lies, if one likes, in the decision to be a parent in the first place. The basis under section 70(1), though, is the person voluntarily assuming this responsibility when he or she had a real choice whether to do so. By accepting the child as a member of his or her family, he or she has represented to the child that he or she accepts the duty of maintenance of the child. If the child’s parents fail in it, the courts may enforce the responsibility which the adult had assumed. If the basis of the liability is a voluntary assumption of responsibility, it would appear that this responsibility cannot be enforced as resolutely as the duty of a parent. The duty is … subordinated to a parent’s duty but, even without those express limits, it seems right in principle that the person cannot be forced to discharge this responsibility for a long time after he or she has clearly indicated that he or she no longer accepts it. 121Woo J then noted (at [21]) that the above passage didnotsuggest animmediatecessation of responsibility as the phrase “for a long time” was used. He opined that once a person had accepted a child as a member of the family, the person could not “abandon the responsibility simply by changing his mind”. Woo J distinguished between the duty to maintain and the power to order maintenance (at [26]). On the facts, it was held that it would not be appropriate to impose the duty on the non-parent permanently by making an order of maintenance against him until the children were 21 years old. Instead, maintenance ought to be sought from the biological father. Notably, Woo J also held that s 70(2) of the Act was meant to cover the situation where the parent (who is not part of the family of the person who has accepted the child) takes the child away from the custody of the person who had accepted the child as a member of his family (at [19]). According to Woo J, s 70(2) of the Act would not apply to a situation where the biological parent takes the child away from the non-parent as a result of the breakdown of the marriage between the parent and the non-parent. 122We agree with the opinions of Woo J and Kan J in so far as they hold that where a non-parent has accepted a child as a member of his or her family, he or she may not thereafter renege on that acceptance by simply changing his or her mind. This is also supported by the Explanatory Statement to the Draft Bill of the Malaysian Act (seeReport on the Malaysian Actat p 58), which states that s 99 of that Act was intended to provide “for the maintenance of a child accepted by any person as a member of his family,unless and untilsuch child is taken away by its natural parent” [emphasis added]. What this suggests is that s 99 (and s 70, which isin pari materiato s 99 of the Malaysian Act) was intended to impose maintenance obligations on a non-parent who had “accepted” the childunless and untilthe natural parent takes the child out of the non-parent’s custody. 123Thus, where a child is taken away from the non-parent in the context of the breakdown of a marriage between the non-parent and the child’s parent, this would, in our view, cause the non-parent’s duty imposed by s 70(1) to cease. In our view, the duty imposed by s 70(1) on a non-parent would thus ordinarily cease when the interim judgment for divorce is granted. In the context of the division of matrimonial assets, we held in the case ofARXv ARYthat the starting point or default position to determine the pool of matrimonial assets should be the date that the interim judgment is granted (at [31]). In this context, we observed (at [32]): 32     There is a strong justification for this position as a matter of principle. The interim judgment “puts an end to the marriage contract and indicates that the parties no longer intend to participate in the joint accumulation of matrimonial assets …” (AJR v AJS[2010] 4 SLR 617 (“AJR”) at [4]). The grant of interim judgment is a recognition by the court that there is “no longer any matrimonial home, noconsortium vitaeand no right on either side to conjugal rights” (Sivakolunthu Kumarasamy vShanmugam Nagaiah[1987] SLR(R) 702 at [25]). The interim judgment “put[s] an end to the whole content of the marriage contract, leaving only the shell, that is, the technical bond” (Fender v St John-Mildmay[1936] 1 KB 111 at 115–117). In a general sense, it would be artificial to speak of any asset acquiredafterthe interim judgment has been granted as being a matrimonial asset. 124In the same way as an interim judgment for divorce puts the acquisition of matrimonial assets at an end, the interim judgment for divorce also puts an end to the parties’ union and their shared interest in co-operating for the well-being of the family. Whilst a parent continues to have a duty to maintain his or her biological children under s 68 of the Act whether or not such children are in the custody of that parent, a non-parent does not stand in the same position. In the usual case, the breakdown of a marriage would result in the non-parent losing custody of, and perhaps even access to, the child. It would not be fair to the non-parent to require him or her, in such circumstances, to continue maintaining the child. 125Having set out at some length the general principles, we now apply them to the facts of the present case.",
        "Application of the law to the facts": "126We apply the law to the facts in two stages. First, we examine whether the Husband’s duty to maintain Q under s 70(1) has been triggered. Second, we consider whether, in the light of the divorce proceedings, the Husband’s duty to maintain Q has ceased, and if so, whether the Husband ought to be awarded a refund of the interim maintenance paid to Q. Whether the Husband’s duty to maintain Q has been triggered 127It appears that the only question reserved for the ancillary matters court is whether the Husband accepted Q as a member of his family (see above at [77]). This is also the issue around which the arguments have been centred. It thus appears to be accepted, at least during the period when the Husband was required to pay interim maintenance to Q, that Q’s parents had failed to maintain her. In the premises, we only consider whether the Husband had accepted Q as a member of his family. 128As a preliminary point, we note that the Husband accepts that he was responsible for Q’s maintenance during the course of the marriage. His main argument is that he should not be liable to payinterim maintenanceto Qat all, or, alternatively, that he should be refunded a portion of the interim maintenance paid to Q. 129The primary basis for the Husband’s argument is that he had not, at any point during the marriage, accepted Q as a member of his family. His evidence is that Q has never acknowledged him as her father and that they had a distant relationship. Although he had given gifts to Q, these were, he argues, given out of generosity. He also deposes that he has never taken part in disciplining Q. Additionally, while he lived with Q during the first three years of his marriage, Q did not come along to live with them at Lentor Vale and instead continued to live with her grandmother and aunt at the Park Green apartment, although Lentor Vale had the space to accommodate her. 130Against this, the Wife argues that the Husband had in fact accepted Q as a member of his family for the following reasons: (a) It was under the mutual understanding that the Husband agreed to accept Q as his child that the Wife agreed to marry him in the first place. (b)  The Husband declared that Q was his child in order to obtain a junior membership to the American Club for Q. (c) Q’s name was included under the list of granddaughters in the Husband’s father’s obituary in the Chinese newspaper. 131The Husband also explained that Q’s American Club junior membership had only lasted for three months, from February to April 2011. The purpose of obtaining American Club membership for Q was so that she could study for her GCE “O” Level examinations there, as she liked the club. In so far as the Husband’s father’s obituary was concerned, his evidence is that Q’s name was “surreptitiously ‘planted’” there. Furthermore, he states that Q’s name was in Chinese characters in the obituary, and that no one knew Q’s Chinese name at that time. 132As we have explained above, the fact that the Husband married the Wife knowing that she had a child from a prior relationship isprima facieevidence of his acceptance of Q as a member of his family. At the time of the marriage, Q was only about ten years old. The evidence which the Husband points to does not contradict theprimafacieposition, and self-serving statements made on his part are to be accorded little weight. It is not disputed that he had had lived with Q in the Park Green apartment for about three years, and had provided for Q by buying her gifts and even procured a junior membership at the American Club for Q. In our judgment, this is sufficient to demonstrate that the Husband accepted Q as a member of his family. There was therefore a basis upon which the court could order the Husband to pay interim maintenance to Q under s 127(1) of the Act. Whether the Husband’s duty to maintain Q has ceased 133Having found that the Husband owed a duty to maintain Q under s 70(1), the issue before us is whether or not he was bound to continue maintaining her or whether he could discontinue such maintenance given that the marriage had broken down. To the extent that the Husband’s duty under s 70(1) ceased, a refund of the maintenance paid after that date would be ordered, as there would be no basis for the ordering of interim maintenance under s 127(1) of the Act. 134In the present case, since the marriage between the Husband and Wife has broken down, and the Wife has taken Q away from the Husband, it was not appropriate for the Husband to have had to pay maintenance for Q over the period which he did (3 years and 11 months), especially since the marriage effectively lasted only for 4.5 years. We have explained above that in the usual case, a step-parent’s duty to maintain a child would cease once the interim judgment for divorce is granted. We see no reason to depart from this general position in the present case. We therefore order a refund of $40,000 to the Husband, which was the maintenance paid by the Husband to Q after the month in which the interim judgment for divorce was granted (viz, December 2013).",
        "Conclusion": "135In summary, CA 119/2015, CA 120/2015 and SUM 15/2016 are allowed in part. Having regard to all the circumstances of the case and in the interests of facilitating a clean break between the parties, we make no order as to costs. The usual consequential orders are to apply. Andrew Phang Boon Leong  Judith Prakash          Quentin LohJudge of Appeal   Judge           Judge Eugene Thuraisingam and Mervyn Cheong (Eugene Thuraisingam LLP) for the appellant in Civil Appeal No 119 of 2015 and the respondent in Civil Appeal No 120 of 2015;Josephine Chong Siew Nyuk (Josephine Chong LLC) for the respondent in Civil Appeal No 119 of 2015 and the appellant in Civil Appeal No 120 of 2015."
    }
}