{
    "case_title": "Lian Kok HongvLian Bee Leng and another",
    "ncitation": "[2016] SGCA 24",
    "coram": "Chan Sek Keong SJ (delivering the grounds of decision of the court):",
    "sections": {
        "Introduction": "1 This was an appeal against part of the decision of the High Court judge (“the Judge”) inLian Kok Hong v Lian Bee Leng and another[2015] SGHC 205 which found that the late Lian Seng Peng (“the Testator”) did not know and approve of the contents of his last Will and Testament dated 10 August 2012 (“the August 2012 Will”) when he signed it in the presence of two witnesses. 2 The dispute between Lian Kok Hong (“the appellant”), who was the plaintiff before the Judge, and Lian Bee Leng and Wee Hui Ying (“the respondents”), who were the defendants, was which of the many wills executed by the Testator during the last few years of his life was his last will. The respondents had initially applied for probate in respect of an earlier will of the Testator dated 18 December 2010 (“the 18 December 2010 Will”). In their counterclaim, the respondents sought a declaration that the 18 December 2010 Will was the Testator’s true last will. The Judge held that the August 2012 Will was invalid and accordingly allowed the respondents’ counterclaim. 3 At the conclusion of the hearing, we allowed the appeal and gave brief grounds as follows: (1) The Judge made a number of findings. These include findings as to the testator’s testamentary capacity and the fact that the August Will was a testamentary instrument. These findings were not appealed and they form the background against which the Judge’s finding on the testator’s knowledge is to be assessed. (2) On this, the Judge invoked the doctrine of suspicious circumstances and listed several such circumstances. We will say more on this momentarily, but in our judgment nothing in the previous decisions of this court including our judgment inMuriel Cheeallows the court to have regard to suspicious circumstances that go beyond the preparation and execution of the Will. To the extent the Judge looked at such other circumstances, we consider that she erred. (3) The Judge found that the appellant had not proved that the testator knew the contents of the Will. We reverse the Judge on this narrow ground because (a) the August Will was based on a draft that had been written earlier by the testator in his own hand; and (b) the Judge found that the amendments to that draft had been explained to the testator. Given these two facts and the Judge’s finding that the testator had testamentary capacity, we consider the Judge’s finding on knowledge cannot stand. We return to the other suspicious circumstances identified by the Judge and in particular those that relate to the appellant’s conduct. In our judgment, these may go to the appellant’s suitability to be appointed as the executor and at the time the Will comes to be propounded, it is a matter for the respondents to decide whether they wish to raise this issue for the consideration and determination by the court. 4 We now give our detailed reasons for allowing the appeal.",
        "Background": "",
        "The Testator, his family and the Estate": "5 The Testator passed away at the age of 93 on 10 December 2012. Born in Longyan, China, he moved to Singapore at a young age. Nevertheless, he continued to maintain contact with his ancestral home, regularly making visits. Over the years, he also made charitable donations to his hometown, his relatives and friends. Mdm Soh Seat Hwa (“Mdm Soh”) is the widow of the Testator. They were married for 70 years. The Testator and Mdm Soh lived at 30 Jedburgh Gardens (“30 Jedburgh Gardens”) for many decades up till the time of his death. 6 The appellant is the only son of the Testator and Mdm Soh and the youngest of three siblings. He is married with two sons. His relationship with his mother and sisters towards the later years was less than cordial. 7 The first respondent is the second of the Testator’s children with Mdm Soh. She lives near 30 Jedburgh Gardens and was close to both parents. The second respondent is the Testator’s granddaughter by his first child, Mdm Lian Bee Tin (“Mdm Lian”). The Testator had six grandchildren, including the second respondent. The second respondent has three children, who are the only great-grandchildren of the Testator. 8 The bulk of the value of the Testator’s estate (“the Estate”) was in 30 Jedburgh Gardens. The Testator also held shares in Lian Seng Peng & Sons Pte Ltd (“LSPS”). The Testator, Mdm Soh, Mdm Lian, the first respondent and the appellant were equal shareholders, each with 20%, of LSPS.",
        "Background to the dispute": "Documents prior to 2012 9 At around the age of 85 years, the Testator executed a will in 2004 (“the 2004 Will”), prepared by his solicitor, Mr Warren Tan, in which he bequeathed all his assets to his grandchildren. The reason why he chose to bequeath everything to the 6 grandchildren instead of the three children was because the appellant had mentioned that he might be facing a bankruptcy charge and his two sons would be facing financial difficulties. 10 In or around 2008, the Testator decided to amend his last will. In that year, he prepared and executed two typewritten documents in Chinese setting out his last wishes as to the disposition of his assets. It appeared that in his mind these were testamentary dispositions. 11 The first of these was a document with the heading “Will” in Chinese, signed by the Testator and dated 19 November 2008 (“the 19 November 2008 Will”). The execution of that will was only witnessed by one Mr Goh Tay Sin (“Mr Goh”), an employee of the appellant’s company Prime Products Pte Ltd (“Prime”), and therefore failed to fulfil the formal requirements for a will. The appellant said the Testator wrote out the 19 November 2008 Will and asked him to get one Mr Zhu Jintian (“Mr Zhu”), also an employee of Prime,1Foot Note 1×ROA Vol 3 part 1 at page 107.to type it out in Chinese. The 19 November 2008 Will was a typewritten form in Chinese of the handwritten document drawn up by the Testator. 12 According to the appellant, he subsequently learnt that for a will to be valid, it had to be witnessed by two people and that for that reason the 19 November 2008 Will was not valid in the eyes of the law. He then got Mr Zhu to type out in Chinese another will which had again been written by hand by the Testator. When it was ready, the will which was dated 24 November 2008 and again simply entitled “Will” in Chinese (“the 24 November 2008 Will”), was brought to the Testator who executed it. The 24 November 2008 Will appeared to be a modification of the 19 November 2008 Will, retaining many of the same terms with amendments made to the figures. After the Testator executed the will, the appellant took the will to his office and procured the signatures of Mr Goh and another employee as witnesses. He subsequently learnt from one of his lawyers, Mr Nair, that this was again ineffective to confer upon the document the status accorded to wills by law. 13 Under the terms of both 2008 wills, a significant amount of the Testator’s assets would be donated to “No 4 Middle School”, a school in the Testator’s hometown, as well as to various other charitable institutions in that town. Charitable dispositions were also made to this school in the August 2012 Will. Further, 30 Jedburgh Gardens would be bequeathed to the appellant’s sons upon the Testator’s and Mdm Soh’s passing. The 24 November 2008 Will also purported to revoke the 2004 Will. 14 In 2010, the Testator continued to draw up more wills, this time with the aid of solicitors. On 30 July 2010, the appellant brought the Testator to Mr Nair’s office where another will was executed in the presence of two witnesses (“the July 2010 Will”). Prior to this, the Testator had not spoken to Mr Nair. It was the appellant who was giving instructions to Mr Nair for the will. The July 2010 Will appointed the appellant as the sole executor of the Estate. Under the terms, 30 Jedburgh Gardens would be bequeathed to the appellant’s sons on condition that Mdm Soh was allowed to live in the property rent-free until her death. Monies liquidated from shares in listed companies and bank accounts would be distributed to the Testator’s grandchildren. The second respondent and her children would get a total of $16,000 while the other grandchildren would receive $10,000 each. The remainder of these monies would then be held on trust for the appellant’s sons. The Testator’s shares in LSPS, which was 20% of the share capital, would be given to the appellant with the remainder of his estate going to Mdm Soh. No provisions were made under that will for the first respondent and Mdm Lian nor were any provisions made for charitable donations. All former wills and testamentary dispositions were revoked by this will. It is obvious from these terms that the July 2010 Will wasexceedinglyfavourable to the appellant and his family. 15 The first respondent says that in about September 2010, the Testator complained to her that the appellant had taken him to a law firm to make a fresh will and that he was not provided with a copy of the will. On 1 December 2010, the Testator signed a declaration purporting to revoke all prior wills he had made including the July 2010 Will. Mdm Soh was the sole witness to this declaration. 16 Two days later, on 3 December 2010, the Testator executed another will (“the 3 December 2010 Will”). This will was prepared by Mr Warren Tan who was one of the witnesses alongside Dr Liew Bee Leng (“Dr Liew”), the Testator’s family’s physician. Under the terms of this will, the respondents were to be the executrices of the Estate. 30 Jedburgh Gardens would be given absolutely to Mdm Soh and the remainder of the Estate would be held on trust for all six grandchildren in equal shares. 17 According to the first respondent, the day after the 3 December 2004 Will was executed, the Testator told her that the particular will was not clear since it did not specify who would inherit 30 Jedburgh Gardens if Mdm Soh predeceased him. At the same time, the Testator also instructed the first respondent to arrange for Mdm Soh’s will to be re-done so that they could sign their wills at the same time.2Foot Note 2×Affidavit of Evidence in Chief of Lian Bee Leng at para 29. ROA Vol 3 Part 1 page 147. 18 On 18 December 2010, the Testator and Mdm Soh both executed wills prepared again by Mr Warren Tan. The execution of these wills was witnessed by Mr Warren Tan and Dr Liew in the office of Dr Liew and in the presence of the first respondent. Mr Warren Tan took the precaution of having Dr Liew present at the signing in case a doctor had to testify on the medical condition of the Testator due to his old age. 19 This was the 18 December 2010 Will in relation to which the respondents applied for grant of probate. The terms under this will mirrored the terms in the 3 December 2010 Will. Under the 18 December 2010 Will, the respondents were to be the executrices of the Estate. 30 Jedburgh Gardens would be given absolutely to Mdm Soh in the event she survived him for 30 days. The remainder of the Estate was to be held on trust for the benefit of the Testator’s grandchildren in equal shares. His children would not receive anything from his Estate and all prior wills and testamentary dispositions were revoked. 20 About five months later, the Testator signed a declaration of trust giving full power to the appellant to distribute in his sole discretion the proceeds of sale of the Testator’s shares in listed companies to the appellant’s children upon the Testator’s demise. This document did not purport to be a will but was a declaration of trust and was signed by the Testator in Mr Nair’s office, having been taken there by the appellant. Shortly after, a note was written by the Testator revoking the declaration. 2012 Wills 21 In 2012, the Testator prepared many documents by which he purported to dispose of his assets upon his death as if they were testamentary dispositions. Some of them were not dated. Curiously, the Testator signed a will which was dated two days after his death. All of these documents, however, shared one thing in common – they were handwritten in the Chinese script by the Testator himself. 22 The appellant testified that at the beginning of 2012, he wrote out two draft wills for his father. They were not to the liking of his father, who wanted to make changes to them. The copies of these two draft wills tendered in evidence showed that amendments had been made to them. In one of them, the appellant was named as the sole executor, before amendments were made to that draft. The other draft did not provide for an executor.3Foot Note 3×RCB pages 38 – 45.Both drafts were undated. 23 Soon after, the Testator started to write his own wills and dispositions, and as mentioned some of these were dated and some were not. As to the former, there was a handwritten will dated 23 February 2012 which was not signed and some of the terms were not fully legible. Another will dated 20 May 2012 was also not signed. The next dated document was a will dated 10 June 2012 (“the 10 June 2012 Will”). This will subsequently became the August 2012 Will and will be described in greater detail below. The material consideration was that after the Testator had written and signed it in the absence of any witnesses, he handed it to the appellant and told him to arrange for a proper execution of the will. The appellant took custody of the 10 June 2012 Will. 24 On 30 June 2012, the Testator wrote and signed another will (“the 30 June 2012 Will”). This will began by stating, “[t]he will[s] made by my lawyer[s] and handed over to [the appellant] shall be revoked”.4Foot Note 4×ACB Vol 2 page 46.No provision was made for who was to be the executor of the Estate under this draft will. 25 The last of the series of dated wills drawn up in 2012 was a will dated 12 December 2012. There was no indication as to when this will was actually drawn up but the Judge observed that it was likely that the Testator was in a weakened state when he actually wrote it placing the time as sometime after August 2012. No allegation of forgery has been raised with respect to this document as the writing was accepted to be the Testator’s. The will was most likely post-dated. 26 The rest of the documents purporting to have testamentary effect were undated and, as the Judge observed, of limited use to the issues before the court. Their terms are not material to the issues in this appeal. 27 A further document that warrants mention is a document dated 14 August 2012. It is a short note that purported to treat the loan owed by the appellant to the Testator as a loan owed by the appellant to LSPS. The background to this was that the appellant had previously taken loans from the Testator for his business amounting to some $1.5m. From this note, it was stated that a sum of $780,000 was now owed by the appellant to LSPS. This explains the figure of $780,000 which appears in the some of the Testator’s testamentary documents, in which he made provisions for the $780,000 the appellant owed him. It should also be noted that this was not the only loan taken by the appellant. At some point, the appellant got the Testator to mortgage 30 Jedburgh Gardens to secure a bank loan of about $1.5m. This mortgage remained registered against the house until 2014 when the appellant redeemed it. The signing of the August 2012 Will 28 The appellant testified that he took some time to arrange for the execution of the 10 June 2012 Will because he was travelling extensively. The Testator was also hospitalised for three days in late July. On the morning of 10 August 2012, between 10am and 11am, the appellant arranged with Mr Goh, Mr Zhu and three other senior members of Prime to visit the Testator at 30 Jedburgh Gardens. The appellant brought along with him a camera and the 10 June 2012 Will inside a yellow envelope within which was a white envelope with the word “will” written on it. The yellow envelope was carried by Mr Zhu so that Mdm Soh would not suspect anything. At their earlier meeting, the Testator had told the appellant that he did not want Mdm Soh to know about the said will as she might object to it. 29 The party went into the Testator’s bedroom to spend some time with him. Later, the others left, and Mr Goh, Mr Zhu, the appellant and the Testator remained in the room. The appellant then explained to the Testator that two witnesses were required for the proper execution of the will. The appellant went on to explain two amendments which he had made to the 10 June Will. Thereafter, the appellant left the room. Mr Zhu then took some time to explain the contents of the will to Mr Goh in Mandarin because Mr Goh could not read Chinese but could understand Mandarin. After that, Mr Zhu placed the will in front of the Testator who signed it. Photographs of the signing were then taken by Mr Zhu. After the signing, the other visitors entered the room and after taking more photographs left the house for lunch. 30 As the August 2012 Will was central to the issues in the suit, it is reproduced below (together with the cancellations as shown): Former will[s] made by the lawyer[s] and so on are revoked. According to the new will, [the proceeds] from the sale of stocks and so on (after the winding up of the company) and the $780,000 owed by Kok Hong shall be distributed to the paternal and maternal grandsons and granddaughters who shall each get $100,000; total $600,000. After our death as husband and wife, the proceeds from the sale of the house at No. 30 and all the cash shall constitute the Lian Seng Peng & Soh Seat Hwa Charity Fund from which $1 million shall be donated to Tong Chai Medical Institution. RMB 5 million shall be remitted to my hometown and donated to No. 4 Middle School of Xinluo District for extension of the school and to provide financial assistance. 200,000 ([unintelligible]) shall be donated to poor overseas Chinese returnees in Xinluo District. A large television set and a CD player shall be donated. RMB 200,000 shall be donated to the Shexing Village Activity Centre for the Elderly. RMB 200,000 shall be donated to the welfare house for disabled children. Do not hold religious rituals after my death. The cremated remains are to be scattered into the ocean. The aforesaid matters and matters not set out above shall all be handled by Kok Hong. Made by Lian Seng Peng 10.68.2012 31 As can be seen from its terms, two amendments had been made to the August 2012 Will. The first deleted the specific bequests to the great grandchildren and reduced the total amount from $750,000 to $600,000. There was also an insertion of the phrase “after the winding up of the company” to clarify when the proceeds from stocks would be distributed. The second amendment was to the date of signing of the will. The original date of signing,ie, “10.6.2012”, was amended by writing over the figure “6” with the figure “8”.  The day and year were not changed as it was the 10th day of the month of August 2012. Both amendments were initialled by the Testator. The parties accepted at the trial that the effect of the last sentence in the will was that appellant was intended to be appointed the sole executor of the Estate under the will. Health of the testator 32 During the period he was making his wills and vacillating as to how his assets should be distributed upon his death, the Testator was plagued with ailments. In June 2011, he was hospitalised for a week due to serious breathing difficulties. He had only one functioning lung and was also on medication for a heart condition. 33 In March 2012, the Testator collapsed in the kitchen after a giddy spell. In April 2012, he was again hospitalised for six days due to breathing difficulties. In addition to his chronic lung problem and weak heart, he was discovered to be suffering from severe hypothyroidism. 34 In July 2012, the Testator was started on home oxygen therapy. For four days in late July and early September, the Testator was again hospitalised. He grew increasingly weak over the course of the year. The 27 March 2013 meeting 35 After the Testator’s death, a meeting was arranged on 27 March 2013 between the appellant and the first defendant at the office of Mr Warren Tan to determine who held the Testator’s true and valid will. At that meeting, the appellant produced the July 2010 Will and not the August 2012 Will. When he was shown the 18 December 2010 Will, the appellant did not dispute the will but questioned whether it was Mr Warren Tan’s suggestion that the signing of the 18 December 2010 Will be witnessed by a doctor.5Foot Note 5×ROA Vol 3 Part 1 page 157.The appellant did not produce the August 2012 Will which was then not known to the first respondent.",
        "Commencement of the suit": "36 On 21 May 2013, the respondents applied to court for probate of the 18 December 2010 Will. On 2 August 2013, the appellant filed a caveat against the respondents’ application for the grant of probate, and on 16 December 2013, he filed a Citation against the respondents which stated that he held the last Will and Testament of the Testator,ie, the August 2012 Will and that the 18 December 2010 Will had been revoked by this later will. On 17 March 2014, the appellant commenced the present action to propound the August 2012 Will. The respondents counterclaimed seeking a declaration that the 18 December 2010 Will was the last will of the Testator.",
        "Summary of Pleadings and issues before the Judge": "37 The Judge succinctly summarised the pleaded cases of the parties at ([36]–[38]) as follows: 36 The plaintiff’s claim is straightforward – that Grant of Probate of the August 2012 Will be decreed in his favour. 37 The defendants aver that the 18 December 2010 Will represents the “true and valid will” of the Testator, and that: (a) the Testator was not of sound mind when he executed the August 2012 Will; (b) the plaintiff had put great pressure and exerted undue influence on the Testator, forcing the Testator to write the August 2012 Will; and (c) the formalities of the August 2012 Will are not met and the will is thus null and void or invalid. 38 The issues to be resolved therefore are: [1] whether the formalities of the August 2012 Will were complied with; [2] whether the Testator had testamentary capacity when he executed the August 2012 Will; [3] whether the Testator knew and approved of the contents of the August 2012 Will when he executed it; and [4] whether the plaintiff had exercised undue influence on the Testator in respect of the August 2012 Will.",
        "The Judge’s Decision": "38 Referring toGeorge AbrahamVadakathu v Jacob George[2009] 3 SLR(R) 631 andChee Mu Lin Muriel vChee Ka Lin Caroline (Chee Ping Chian Alexander and another, interveners)[2010] 4 SLR 373 (“MurielChee”),Banks vGoodfellow(1870) LR 5 QB 549 andBiggins v Biggins[2000] All ER(D) 92, the Judge summarised the legal principles applicable to the issues as follows: (a) The propounder of a will bears the legal burden of proving testamentary capacity but testamentary capacity will generally be presumed when the testator was not suffering from any kind of mental disability and the will was duly executed in ordinary circumstances. (b) Even if the Testator’s mental disability is established, a finding still has to be made as to whether the testator lacked testamentary capacity as a result of the disability or whether he was lucid when he made the will despite the existence of a mental illness. (c) Rationality of the will is evidence of testamentary capacity and the evidential burden shifts when the will is rational and duly executed. (d) Once testamentary capacity is established, a rebuttable presumption arises that the testator knew and approved the contents of the will and the evidential burden shifts to the opponent of the will to rebut this presumption. (e) This presumption however, will not operate where there were circumstances surrounding the execution of the will which would raise a well-grounded suspicion that the will did not express the mind of the testator. (f) Where undue influence is alleged, it cannot be presumed and must be proved. 39 After hearing the evidence, the Judge made the following findings: (a) On issue (1), the necessary formalities under s 6(2) of the Wills Act (Cap 352, 1996 Rev Ed) had been  complied with in respect of the August 2012 Will (see [46]–[52] of the Judgment). (b) On issue (2), the Testator had testamentary capacity when he signed August 2012 Will (see [53]–[85] of the Judgment). (c) On issue (3), the appellant failed to prove that the Testator knew or approved the contents of the August 2012 Will when he executed it (see [86]–[112] of the Judgment). (d) On issue (4), there was insufficient evidence that the Testator had executed the Augusts 2012 Will due to undue influence (see [113]–[121] of the Judgment). 40 On the basis of the finding in issue (3), the Judge dismissed the appellant’s claim and declared in favour of the respondents that the last valid will of the Testator was the 18 December 2010 Will. 41 The appellant appealed against the Judge’s decision that the August 2012 Will was invalid on the stated grounds. 42 The respondents did not file an appeal against any of the findings of the Judge.",
        "The Judge’s decision on issue (3)": "43 The Judge found that the August 2012 Will was rational on the face of it, and that the Testator was not suffering from any mental impairment when he executed it. This would give rise to a rebuttable presumption that the testator knew and approved of the contents of the will at the time of its execution. However, the presumption would not arise where the circumstances surrounding the execution of the will gave rise to well-grounded suspicion that it did not express the mind of the testator. 44 The respondents argued that circumstances surrounding the execution of the August 2012 Will gave rise to a suspicion that the Testator did not know or approve the contents of the will. The suspicious circumstances raised by the respondents were as follows: (a) the appellant had frequently pestered the Testator about making a will even when the Testator was in poor physical condition; (b) the appellant had drafted precedent wills for the Testator; (c) the appellant had suggested amendments to, or had actually amended, the August 2012 Will; (d) the appellant took pains to conceal the signing of the August 2012 Will from his family members; (e) the appellant did not want the August 2012 Will to be drafted by a lawyer; (f) the appellant took photographs of the Testator signing the August 2012 Will before Mr Goh and Mr Zhu; (g) the appellant kept the August 2012 Will with him; and (h) more than half of the Estate had not been accounted for in the August 2012 Will. 45 While the Judge was of the view that not all the circumstances surrounding the execution of the August 2012 Will put forth by the respondents were necessarily suspicious, she considered that the events considered as a whole were not ordinary circumstances in which the presumption of knowledge and consent of the Testator would arise. The burden of proof therefore remained with the appellant to prove the Testator’s knowledge and approval of the contents of the August 2012 Will at the time of its execution. 46 The Judge accepted the respondents’ submission that even though there was no evidence (except for the amendments made) that the terms of the will were suggested to the Testator, the appellant had provided two draft wills to the Testator which appeared to have been the working templates for the August 2012 Will, at least in a structural sense (see [91] of the Judgment). In doing so, the appellant had played at least an ancillary role in its creation by way of the drafts. One of these drafts provided that he would be responsible for the administration of the Estate, as was also provided under August 2012 Will. 47 The Judge also held that this Court’s decision inMuriel Chee, established that “suspicious circumstances” need not be restricted to those relating to the preparation and execution of the contended will. Proceeding thus, the Judge focused on the following circumstances” (at [96]–[122] of the Judgment). In summary, they are: (a) The appellant’s keen interest since 2008 in how the Testator’s would dispose of his assets upon death. He told his father that 30 Jedburgh Gardens should be kept in the “Lian family”. He assisted in the preparation and execution of the November 2008 wills and gave instructions to Mr Nair to prepare the July 2010 Will which kept 30 Jedburgh Gardens within the “Lian family (see [96]–[98] of the Judgment). (b) The appellant’s account of the events on 10 August 2012 had all the hallmarks of a deliberate attempt to set up the execution of the August 2012 Will in a way that its validity could not be called into question later. He had planned the visit, brought along a camera, took photos and left the room while Mr Zhu and Mr Goh witnessed and photographed the execution. He testified that the Testator amended the will. It was a long journey for the visitors from Prime for what was a very short visit (see [99]–[100] of the Judgment). (c) The appellant’s testimony that the Testator amended the June 2012 Will was contradicted by Mr Goh, whose testimony was that the amendments had already been made before the will was placed before the Testator. Also, the fact that the Testator worked off a draft will prepared by the appellant suggested that the August 2012 Will might be a product of their discussion (see [101] of the Judgment). (d) The Testator was off his oxygen concentrator. This circumstance contributed to the suspicion that the August 2012 Will did not express his mind (see [102] of the Judgment). (e) There were elements of the plaintiff’s account that were either contradictory or hard to believe, such as (i) when he looked at the June 2012 Will after it had been handed to him, (ii) what clarifications he made with the Testator, if any, and (iii) his suggestion that lawyers not be involved as it would delay the process, but then nevertheless took two months to prepare for the execution of the will after taking it away, probably to prevent the Testator from making further changes to the June 2012 Will (see [103]–[104] of the Judgment). (f) Concealing the June 2012 Will from Mdm Soh when the Testator had previously confided in Mdm Soh instead of hiding his actions from her. Two months before handing the June 2012 Will to the appellant, the Testator had declared (as shown in a video) that if he had written a will he would not have shown it to the appellant since it was meant to “be secret” but yet had handed the 10 June 2012 Will to the appellant. The appellant also failed to satisfactorily explain his failure to produce the August 2012 Will at the meeting on 27 March 2013 at Mr Warren Tan’s office (see [105]–[109] of the Judgment). 48 Having found suspicious circumstances to exist, the Judge concluded as follows: (a) The mere fact that the Testator executed the will did not add much to the appellant’s discharge of the evidential burden of proving that the Testator knew and approved the contents of the August 2012 Will. (b) The Testator’s physical condition also did not constitute affirmative evidence as to his knowledge and consent. (c) The mere fact that the Testator was scrutinising the will intensely said nothing about his mental state and it could not be seen from the photographs if the Testator was actually reading the terms of the will let alone if he understood it. (d) The suggestion that the Testator overheard the conversation between Mr Zhu and Mr Goh was also mere conjecture. 49 At [112] and [122] of the Judgment, the Judge concluded: 112 In my opinion, it is critical that neither the plaintiff nor the witnesses to the August 2012 Will read, let alone explained, its terms to the Testator on that day, save for the plaintiff explaining theamendmentsmade. Around two months had elapsed since the Testator had last seen the August 2012 Will and he had been in hospital during that period. Even putting aside the possible effects of the Testator not being on the oxygen concentrator at the time he executed the August 2012 Will, there is simply insufficient evidence to conclude that the Testator knew and understood its terms, much less how it varied from the terms of the June 2012 Will which in time of drafting was the most recent of the Testator’s expressions of his testamentary intent. What would be more persuasive but was not put forward by the plaintiff is the argument that the Testator must have had the necessary knowledge and approved of the August 2012 Will simply on the basis that he was the one who had drafted it, assuming that testamentary capacity has been established. The leading textbooks do not deal directly with this point. Regardless, I am of the view that the strength of such an argument would have to be predicated on the fact that a testator drafted a will independently. Even if thedraftAugust 2012 Will satisfied this requirement, the fact that there were amendments which were explained to the Testator by the plaintiff would negate the probative value of the August 2012 Will being drafted by the Testator. Further, the existence of the June 2012 Will is an indication that after drafting the August 2012 Will, the Testator had second thoughts and wanted to modify his bequests. … 122 In the result, I am satisfied that because the Testator did not know of or approve the contents of the August 2012 Will when he signed it, it must be held invalid. The plaintiff’s claim is dismissed with costs and there will be a declaration that the 18 December 2010 Will is the Testator’s last true will and testament.",
        "Issues and arguments on appeal": "50 As stated earlier, the appellant appealed against the Judge’s finding on issue (3) – that he had failed to prove that that the Testator knew and approved of the contents of the August 2012 Will. The respondents on the other hand did not appeal against the Judge’s findings on issue (1) – that the August 2012 Will was intended to have testamentary effect, issue (2) – that the Testator had testamentary capacity, and issue (4) – that there was no undue influence. It was against this background that the parties presented their cases before us.",
        "The appellant’s case": "51 The appellant’s case was that the Judge erred in holding that the appellant had failed to prove that that the Testator knew and approved of the contents of the August 2012 Will for the following reasons: (a) there were no relevant suspicious circumstances which made inapplicable the rebuttable presumption that the Testator knew and approved of the contents of the August 2012 Will when he signed it. (b) the Judge erred in taking into account as relevant  circumstances those circumstances which did not specifically relate to the execution and preparation of the will; and (c) in any event, even if the burden of proving knowledge and approval was on him, there was positive evidence that the Testator knew and approved the contents of the will because he had drafted it himself and had read it over before he signed it.",
        "The respondents’ case": "52 The respondents’ case was as follows: (a) the Judge had erred in her findings in respect of issues (1), (2) and (4) because (i) the Testator did not have testamentary capacity as he was suffering from a mental impairment, (ii) the terms of the will were irrational, (iii) the appellant procured signing of the August 2012 Will by harassing the Testator, and (iv) the document relied on by the appellant was not meant to be a testamentary disposition; (b) the Judge did not err in finding that there were suspicious circumstances, that the appellant failed to prove that the Testator knew and approved the contents of the will, and that since the Testator had written many drafts in 2012, it could not be said for certain that it was clear in his mind that he was signing the August 2012 Will.6Foot Note 6×See para 82 of the respondents’ case. 53 In relation to the submission at [52(b)], the respondents argued that notwithstanding that they had not filed a cross-appeal against the Judge’s findings on these three issues, they were entitled raise them under O 57 r 9A(5) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed). 54 In response to this argument, the appellant submitted that the respondents were barred from raising issues on which they had not filed cross-appeals, citing the decisions of this Court inLimEng Hock Peter v Lin Jian Wei and another and another appeal[2010] 4 SLR 331 (“Peter Lim”) which has since been followed by this Court inChiamHeng Hsien (on his own behalf and as partner of Mitre Hotel Proprietors) v Chiam Heng Chow (executor of the estate of Chiam Toh Say, deceased) and others[2015] 4 SLR 180 (“Mitre Hotel”). 55 The two issues which this Court had to determine were : (a) Whether the respondents could challenge the other findings of the Judge which were not the subject of the appeal or subject to any cross-appeal (“Issue (a)”). (b) Whether the Testator knew and approved of the contents of the August 2012 Will (“Issue (b)”).",
        "Our Decision": "",
        "Issue (a)": "56 With respect to Issue (a), we held that, in the light of our decisions inPeter LimandMitre Hotel, the respondents could not rely on O 57 r 9A(5) of the Rules of Court to argue before us that the findings of the Judge in respect of issue (1), (2) and (4) should be overturned in order to uphold her eventual decision which based on issue (3) because they had not filed a cross-appeal against those findings.",
        "Issue (b)": "57 With respect to Issue (b), the appellant’s case was that the Judge’s decision on Issue (3) was wrong in so far as it was based on suspicious circumstances that were not related to the preparation and/or execution of a will (“non-related circumstances”). It was argued that the established law in Singapore was that laid down by this Court inR Mahendran and another v RArumuganathan[1999] 2 SLR(R) 166 (“Mahendran”) which held that only related circumstances could be taken into account in determining whether a testator knows and approves the contents of a will he or she has signed. 58 The appellant citedW Scott Fulton, Isabella D Fulton and Margaret Fulton v Charles Batty Andrew and Thomas Wilson(1874–1875) LR 7 HL 448 at 471 where the House of Lords held that the circumstances to be considered included only those “attending, or are at least relevant to, the preparation and execution of the will itself”. Similarly, inMahendran, this court at [15] approved a statement in Clark & Martyn,Theobald on Wills(Sweet & Maxwell, 15th Ed, 2001).that circumstances could only raise a suspicion of want of knowledge and approval if they were “circumstances attending, or at least relevant to, the preparation and execution of the will itself.” , that is to say, that any circumstance which had nothing to do with the preparation and execution of the will were to be disregarded. The appellant argued that in so far as this Court stated inMuriel Cheethat non-related suspicious circumstances were relevant, the statement was obiter and should be overruled. 59 We agreed with the appellant’s submission on the law: see also Martynet al,Theobald on Wills(Sweet & Maxwell, 17th Ed, 2010) (“Theobald on Wills”) at paras 3-018–3-022. However, as stated in our oral grounds (see [3] above), we did not consider thatMuriel Cheesupported the proposition that non-related suspicious circumstances were relevant. InMuriel Chee, this court said: 46 ... The circumstances to be considered include only those “attending, or are at least relevant to, the preparation and execution of the will itself” (seeW Scott Fulton, Isabella D Fulton and Margaret Fulton v Charles Batty Andrew and Thomas Wilson(1874–1875) LR 7 HL 448 (“Fulton”) at 471). InMahendran, this court stated at [129] [sic] that any circumstance which had nothing to do with the preparation and execution of the will were to be disregarded. However, it may be noted that in the case ofIn the Estate of Musgrove[1927] P 264, Lawrence LJ said at 286 that although the circumstances to be considered would generally comprise contemporaneous events, they might also include events subsequent to the execution of the will. In the present case, the Judge was of the view that all forms of suspicious circumstances ought to be considered. We agreed with the Judge. In the present case the conduct of Muriel in connection with the respective readings of the 1989 Will and the 1996 Will gave the impression, which the Judge took into account, that she herself did not believe that the 1996 Will represented the actual state of mind of [the Testatrix] in relation to the disposition of her properties, especially her half-share in the Holland Road House. 60 This passage shows that this Court agreed with the High Court that the subsequent conduct could be taken into account, after citing Lawrence LJ inInthe Estate of Musgrove[1927] P 264 (“Musgrove”). The Judge relied on this passage for the proposition that circumstances not related to the execution and preparation of the will might be taken into account. 61 InMusgrove,a testatrix appointed her cousin as an executrix and bequeathed the whole of her estate to the executrix’s daughter by a document dated 9 September 1890. The testatrix died in 1905 and nothing happened. The purported executrix died in 1924 and the contested document surfaced in 1925. The plaintiff (the son-in-law of the executrix) attempted to propound the will. In the court below, Hill J found that there were suspicious circumstances which were aroused in his mind as to whether the document was the will of the testatrix and the onus was on the plaintiff to remove that suspicion. As Lord Hanworth MR described it, “[t]he learned judge finds that suspicion was excited in his mind that there was something about the document which prevented [the executrix] from putting the will forward as the genuine will of [the testatrix]” (at 275). The executrix at the latest found out about the testatrix’s death in 1908 and for the 16 remaining years of her life did nothing when there were strong reasons for prompt action by the executrix in her lifetime since there was evidence that the executrix was in need of monetary help. There was evidence that the testatrix had forgotten the will and Lord Hanworth postulated that forgetfulness may have explained the inaction of the executrix. Lord Hanworth then reviewed the authorities and said the usual presumption should be applied, contrary to the holding of Hill J. His Lordship specifically highlighted that no suspicion attached to the will or testatrix but that it only attached to the executrix. Sargant LJ said the sole ground relied on the Hill J was the inaction of the executrix. He highlighted that in the case there was nothing in the preparation and contents of the will to raise a suspicion that it did not express the mind of the testatrix. Many good reasons, he said, could have explained the inaction. 62 Lawrence LJ’s statement inMusgroveis part of a longer statement at pp 286–287 as follows: On the other hand, in every case in which the Court has had to consider whether, apart from the evidence as to the formal execution of the will, the circumstances were of such a nature as to arouse a well grounded suspicion that the alleged will did not in fact represent the testamentary wishes of the testator at the time when the document was signed, the suspicious circumstances have been circumstances existing at the time of and surrounding the preparation and execution of the will… Although Lindley LJ inTyrrellv Paintonpoints out that the rule that the onus of proving that the testator knew and approved of the contents of the will lies upon the party propounding the will is not confined to such a case as I have last mentioned, but extends to all cases in which circumstances exist which excite the suspicion of the Court, yet, in my opinion, the circumstances which the learned Lord Justice had in mind were primarily circumstances existing at the time when the alleged will was executed and having a direct bearing on whether the testator knew and approved of its contents. In the present case the matters which have excited the suspicion of the learned judge are matters which occurred only after the execution of the will.Subsequent events may in some cases no doubt give rise to a suspicion that the will was not properly executed or that the testator did not know or approve of its contents, but in the present case the facts relied upon by the learned judge are not, in my opinion, of such a nature as to form a good ground for any such suspicion. [emphasis added in bold] 63 Therefore, while Lawrence LJ opined that subsequent events might be taken into account, they must have a direct bearing on whether the testator knew and approved of the contents of the will. InMusgrove,the inaction for 16 years had no direct bearing on whether the testator knew and approved of the contents. As Lord Hanworth said, forgetfulness could have explained it – a point even Lawrence LJ made (at 287). In these circumstances, mere inaction from the executrix was not a suspicious circumstance relating to the preparation and execution of the will. 64 The position inMuriel Cheewas vastly different. Two wills were involved—one made in 1989 (“the 1989 Will”) and another in 1996 (“the 1996 Will”); the latter will was the contested will. Muriel was heavily involved in the preparation and execution of the contested will, unlike the executrix inMusgrove. The subsequent conduct of Muriel, which included not attending the reading of the 1989 Will and the statements she made to the effect that she would withdraw the 1996 Will at the reading of that will, when considered with all the discrepancies of the various witnesses who gave evidence on the preparation and execution of the will, casted further doubt that Muriel believed that the 1996 Will represented that actual state of mind of the testatrix (seeMuriel Cheeat [46]). Viewed in this light, the subsequent conduct of Muriel was relevant because it shed light (or raised serious suspicions) on whether the testator knew and approved the contents of the 1996 Will. Muriel was the one who gave instructions for the preparation of the will and was present at the signing by the testatrix. Hence, her belief whether the will represented the actual state of mind of the testatrix was material. 65Muriel Cheeshould thus be understood in the light of its facts. It should not be read as authority that all suspicious circumstances, whether or not they relate to the execution and preparation of the will, may be taken into account in determining if the usual presumption that a testator who has testamentary capacity knew and approved the contents of the will operates. Circumstances are relevant only if they attend or relate to the preparation and execution of the will. Otherwise, all kinds of non-related circumstances may be used to rebut the presumption. We therefore held that the Judge erred in stating that suspicious circumstances no longer needed to relate to the preparation and execution of the contested will. What were the relevant suspicious circumstances in this case? 66 Putting aside the non-related circumstances, the Judge found the circumstances set out at [96]–[109] of the Judgment (see [47] above) to be suspicious. On the basis of these findings, the Judge held at [110]–[111] of the Judgment (see [46] above) that the appellant failed to prove affirmatively that the Testator knew and approved the contents of the August 2012 Will. At [112] the Judgment (see [49] above), the Judge distilled her conclusions as follows: (a) It was critical that neither the appellant nor the witnesses to the August 2012 Will read, let alone explained, its terms to the Testator on that day, save for the appellant explaining theamendmentsmade. (b) The Testator had not seen the 10 June 2012 Will for two months during which he was hospitalised. Even putting aside the possible effects of the Testator not being on the oxygen concentrator at the time he executed the August 2012 Will, there was “simply insufficient evidence to conclude that the Testator knew and understood its terms, much less how it varied from the terms of the June 2012 Will which in time of drafting was the most recent of the Testator’s expressions of his testamentary intent.” 67 The Judge then said that what would have been more persuasive but was not put forward by the appellant was “the argument that the Testator must have had the necessary knowledge and approved of the August 2012 Will simply on the basis that he was the one who had drafted it, assuming that testamentary capacity has been established”. However, she then discounted the strength of such an argument as it was premised on the assumption that the Testator had drafted the will independently. The Judge went on to hold that,even if thedraftAugust 2012 Will satisfied this requirement, “the fact that there were amendments which were explained to the Testator by the [appellant] would negate the probative value of the August 2012 Will being drafted by the Testator”. 68 With respect to these findings and conclusions, we set down below our views: (a) There was insufficient evidence that Testator was influenced by the templates in drafting the 10 June 2012 Will. He was frequently writing out dispositions and wishes which did not follow the templates. (b) We agreed with the finding that the conduct of the appellant in orchestrating the signing of the August 2012 Will was a related suspicious circumstance. While taking steps to ensure that a will is executed properly, and what better evidence is there that it was executed properly than photographing or videoing the process, it was themannerin which the whole process was orchestrated that aroused suspicion. The photographs taken of the execution of the will by the Testator showed a contrived effort to make it difficult for anyone to question its validity. (c) We agreed that the appellant’s claim that the Testator made the amendments when actually it had been made before the will was given to the Testator to sign was a relevant suspicious circumstance. The appellant’s testimony was difficult to believe because there was no necessity for the amendment to be explained to the Testator if he had in fact made them himself. We agreed with the Judge that Mr Goh’s testimony was more believable. This was a discrepancy in relation to the preparation and execution of the will and therefore was rightly taken into account. (d) The fact that the Testator was off his oxygen concentrator could not be regarded as a suspicious circumstance since it was caused by his own action. In any case, Mr Goh and Mr Zhu testified that the Testator spoke rationally during the visit even though he was not using his oxygen concentrator. (e) We agreed that the Testator’s handing over of the 10 June 2012 Will to the appellant for him to arrange for its proper execution could be regarded as a suspicious circumstance because he had said two months earlier that he would not show his will to any one as it was meant to “be secret” (see [47(f)] above). But as against this, we also took cognisance of the fact that the Testator was frequently changing his mind about how to dispose of his assets and that he might well have changed his mind about showing his draft will to the appellant. (f) We agreed that the appellant’s failure to produce the August 2012 Will at the meeting on  27 March 2013 coupled with his unsatisfactory explanation gave rise to a legitimate suspicion, but it was not related to the preparation and execution of the August 2012 Will. Unlike inMurielChee, the appellant did not acknowledge, impliedly or otherwise, that there was something wrong in the way that the August 2012 Will was prepared or executed by the Testator. 69 We accordingly agreed with the Judge that there were suspicious circumstances which were sufficient to prevent the operation of the presumption reversing the evidential burden of showing the Testator knew and approved of the contents of the August 2012 Will. However, we did not agree with the Judge’s conclusion that the appellant had failed to discharge his burden of proving affirmatively that the Testator knew and approved of the August 2012 Will. In this case, we found (see [70]–[79] below) that the suspicion raised fell on the slight side of the line and was dispelled by the evidence. Has the appellant proved that the Testator knew and/or approved of the contents of the August 2012 Will 70 The standard of proof required to show that the testator knew and/or approved of the contents of a will is that of a balance of probabilities (seeTheobald on Willsat para 3-019 above andFuller v Strum[2002] 1 WLR 1097). The lightness or gravity of the suspicions aroused by the circumstances determines the amount of evidence required to dispel the suspicions. As stated inTheobald on Willsat para 3-022 “the suspicion may be slight and easily dispelled [or] [i]t may… be so grave that it can hardly be removed”. 71 Having regard to the evidence in the case, and contrary to the Judge’s decision, we were satisfied on the balance of probabilities that the Testator knew and approved of the contents of the August 2012 Will. We reached our conclusion on the evidence, and in the light of the Judge’s un-appealed findings (a) that the Testator had testamentary capacity, (b) that he was not in any way unduly influenced by the appellant, and (c) that he intended the will as a testamentary disposition. 72 We deal first with the Judge’s holding that it was “critical that neither the [appellant] nor the witnesses to the August 2012 Will read, let alone explained its terms to the Testator on that day, save for the plaintiff explaining the amendments made” (see [112] of the Judgment at [49] above). It is not the law that reading or even explaining the terms of a will to a testator is a mandatory requirement. It is no doubt the best way to show that the testator understood the terms of the will (assuming he had testamentary capacity and his mind was not unduly influenced by some party or event). InBarry v Butlin[1838] 2 Moo PCC 480, Parke B said at 485: Nor can it be necessary, thatin all such cases, even if the Testator’s capacity is doubtful, the precise species of evidence of the deceased’s knowledge of the Will is to be in the shape of instructions for, or reading over the instrument. They form, no doubt, themostsatisfactory, but they are not theonlysatisfactory description of proof, by which the cognizance of the contents of the Will, may be brought home to the deceased. The Court would naturally look for such evidence; in some cases it might be impossible to establish a Will without it, but it has no right in every case to require it. 73 In the present case, the respondents did not dispute that the 10 June 2012 Will signed by the Testator and handed to the appellant to arrange for its proper execution was written by the Testator himself. Therefore, an inference that the Testator understood what he was writing would be eminently reasonable (assuming he had testamentary capacity). The Judge herself accepted this proposition. She held that it was not applicable to the Testator because she was of the view that the proposition was valid only if the Testator had drafted his will independently,ie, free of any influence or persuasion of any kind (see [112] of the Judgment; [49] above). 74 In her judgment, the Judge did not explain why she assumed or implied that the 10 June Will 2012 had not been drafted independently. If her reasoning were based on the appellant having provided two templates of wills to the Testator, we have already found that they did not influence the Testator in subsequently writing a large number of testamentary dispositions, all by himself. In our view, the provision of the templates had no bearing on how or why the Testator wrote the 10 June 2012 Will on his own,ie, independent of any instructions, suggestions or influence by another person. 75 The Judge also found, in the same passage, that the fact that the appellant had explained the amendments to the Testator negated the probative value of the will in relation to whether he knew and approved the contents of the will reinforced her finding at [101] of the Judgment that: … the fact that the plaintiff had found it necessary to explain to the Testator the only substantive amendment made to the August 2012 Will, in my opinion, casts serious doubt on the Testator’s knowledge of and consent to the August 2012 Will when he executed it. … In our judgment, the Judge’s reasoning is problematic for the reason that the amendments were simple and straightforward. The Judge found that there was “effectively only one cancellation and one addition to the August 2012 Will, which otherwise appears to be written in a neat and orderly fashion (at [70] of the Judgment).” The one cancellation was to remove the clause giving “$50,000 to each of the grandsons and great granddaughters” with the consequential amendment that the total distribution was reduced from “75”to “60”. The one addition was the insertion of the words “after the winding up of the company” to clarify when the distribution would take place (see [31] above). The Testator signed against these amendments, which suggested that he must have read or understood the amendments (since he had testamentary capacity). Accordingly, we were unable to agree with the Judge’s statement that the explanation of the amendments negated the probative value of the August 2012 Will. 76 No doubt the fact that the Testator wrote another will,ie, the 30 June 2012 Will, to revoke the 10 June 2012 Will was an indication that he did not want to sign the August 2012 Will (which was the amended 10 June 2012 Will). In our view, this was the troublesome aspect of this case as the execution of the August 2012 Will took place in somewhat suspicious circumstances two months later. The Judge should have made a finding as to whether in the circumstances the Testator knew whether the will he was signing was actually the 10 June 2012 Will which he had already signed once two months earlier and which he had already purported to revoke shorter after handing it to the appellant. The Testator had made so many wills, dispositions in the nature of wishes as regards his assets that he might have forgotten that he had revoked or changed his mind about the 10 June 2012 Will. The Judge did not make a finding on this point. Her finding was that the appellant had failed to prove that the Testator knew or approved the 10 August 2012 Will because neither the appellant nor the witnesses had read or explained it to him. For lack of such reading and explanation, the Judge was not satisfied that the appellant had discharged the burden of proving that the Testator knew or approved its contents. 77 We disagreed with the Judge’s holding. The undisputed facts were that the Testator signed the 2012 August Will in the presence of two witnesses, one of whom (Mr Zhu) had read the will to the other (Mr Goh) within hearing distance as the room they were in was a small room. If Mr Goh could hear what was read to him, it would be reasonable to infer that the Testator would also have heard what was being read to Mr Goh. 78 Even more significant than the preceding point was the fact that the Testator had scrutinised the August 2012 Will intensely (as shown in a photograph taken at the material time), which the Judge accepted. The Judge, however, rejected the fact on the ground that such scrutiny said nothing about his mental state (see [110]–[111] of the Judgment). However, we were unable to agree with the Judge’s reasoning (not in logic) but on the facts. The Judge had already found that the Testator had testamentary capacity. It would therefore follow that if the Testator had scrutinised the August 2012 Will (as amended) or the June 2012 Will (as un-amended), he would be presumed to have understood its contents since it was drafted him and written out in his own handwriting. Therefore, even if the Judge had made a finding on the evidence that the Testator had forgotten that he purported to revoke the 10 June 2012 Will, the fact that the Testator read and signed it, after signing against the amendments, was sufficient on a balance of probabilities, to give rise to an inference that the Testator knew and approved what he was signing. It seemed to us that on these facts, the Judge’s finding was against the weight of the evidence. 79 We accordingly found that the Judge erred in holding that the appellant had failed to prove that the Testator knew and approved the terms of the August 2012 Will.",
        "Conclusion": "80 We allowed the appeal, and ordered (with the consent of the parties) that the costs of the parties in the proceedings here and below be taxed and paid out of the Estate. Sundaresh Menon  Chao Hick Tin   Chan Sek KeongChief Justice   Judge of Appeal  Senior Judge Gopalan Raman and Ng Junyi (KhattarWong LLP) for the appellant;Leo Cheng Suan and Teh Ee-Von (Infinitus Law Corporation) for the respondents."
    }
}