{
    "case_title": "Mykytowych, Pamela Jane vV I P Hotel",
    "ncitation": "[2016] SGCA 44",
    "coram": "Chao Hick Tin JA (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 The present appeal is brought by the appellant, Ms Pamela Jane Mykytowych (“the Appellant”), against the assessment of damages made by the High Court judge (“the Judge”) inMykytowych, Pamela Jane v V I P Hotel[2015] SGHC 113 (“the Judgment”). The respondent, V I P Hotel (“the Respondent”), is a hotel located at 5 Balmoral Crescent, Singapore. On 7 May 2011, while staying at the Respondent as a hotel guest, the Appellant slipped on a puddle of water at the Respondent’s reception area and fell (“the Accident”). She suffered a non-displaced fracture to her left kneecap and a strained ankle as a result. Liability is not an issue as the parties have, by consent, entered into an interlocutory judgment for each party to bear 50% of the liability. The only issue before the Judge and likewise before us pertains to the amount of damages that should be awarded to the Appellant. 2 While the Appellant has fully recovered from the physical injuries that she sustained as a result of the Accident, she asserts that she has developed two chronic medical conditions known as Complex Regional Pain Syndrome (“CRPS”) and fibromyalgia respectively. The Appellant says that these medical conditions have caused her great pain and suffering, such that (among other things) she can no longer continue to work in the company that she owns, Care and Performance Limited (“CPL”), resulting in significant financial losses. These financial losses form the bulk of her claim against the Respondent. 3 Apart from the appeal, there is also a summons before us, Summons No 279 of 2015 (“SUM 279/2015”), in which the Appellant seeks leave to adduce further evidence for the purposes of this appeal.",
        "The material facts": "",
        "The Appellant’s background": "4 The Appellant is a 52-year-old British citizen1Foot Note 1×Record of Appeal (“ROA”) vol 3 part 1 at p 245 (D.O.B.).who lived in the United Kingdom (“the UK”) prior to coming to Singapore. She was 47 years old at the time of the Accident. She graduated from the University of Birmingham with a Bachelor’s degree in Social Administration and Social Work (with honours). Thereafter, she obtained a postgraduate Certificate of Qualification in Social Work in 1985, and further completed a Master of Business Administration course at the University of Brighton in 2006. 5 Prior to the Accident, the Appellant was an active participant in motorsports activities and took part in long-distance endurance car races. She was the only woman who had driven competitively in the 15,000km Peking to Paris car rallies held in 2007 and 2010, and was even featured in several motorsports magazines as well as on television. She was also a member of a number of motor car racing clubs, including the Motorsports Association of the UK, the British Women Racing Drivers Club and the Jim Russell Racing Drivers Club. 6 The Appellant started CPL in the UK in 2004. CPL provides consultancy services across the health and social sectors. It deals with,inter alia, operational and strategic management for healthcare and social care services, assignments involving budgetary pressures, capacity issues and trade union issues, as well as the facilitation of organisational and operational changes in institutions such as the Staffordshire County Council.2Foot Note 2×Appellant’s closing submissions for the assessment of damages hearing (“Appellant’s closing submissions”) at para 73.",
        "The circumstances surrounding the Accident": "7 In April 2011, the Appellant came to Singapore with her husband, Mr Andrew Mykytowych (also referred to hereafter as “Mr Mykytowych”), who was posted here by his employer, Balanced Engineering & Construction Pte Ltd (“Balanced Engineering”). It appears from the evidence that Mr Mykytowych was first posted to India and came to Singapore shortly after. 8 When the couple arrived in Singapore on 6 April 2011, they stayed at the Respondent as hotel guests. The Accident took place a month later on 7 May 2011 in the morning, sometime between 9.00am and 9.30am. The Appellant, in her affidavit dated 5 April 2012, averred that she was walking at a “sedate” pace in “flat rubber sole sandals” when she slipped on a puddle of water on the marble floor at the Respondent’s reception area and fell. She further averred that there was a significant amount of water on the floor which had not been cleaned up, and that this was brought about by the Respondent’s failure to provide mats for hotel guests to wipe their feet dry before moving from the swimming pool area to the reception area. The Appellant was conveyed to the Accident and Emergency Department (“A&E Department”) of Tan Tock Seng Hospital (“TTSH”) for treatment after the Accident.",
        "The Appellant’s medical condition after the Accident": "Treatment immediately after the Accident 9 At TTSH’s A&E Department, the Appellant was diagnosed to be suffering from a non-displaced fracture of her left patella.3Foot Note 3×ROA vol 4 at p 10.Her left knee, on which she had landed when she fell, was observed to be swollen and tender. 10 Later on the same day (ie, 7 May 2011), the Appellant was referred to TTSH’s Orthopaedics Specialist Outpatient Clinic, where she was seen by the Head of the Department of Orthopaedic Surgery, Dr Ganesan Naidu (“Dr Ganesan”).4Foot Note 4×ROA vol 3 Part 1 at p 253.Dr Ganesan was the Appellant’s main physician for the next two-odd years until she left Singapore for Taiwan in September 2013. Dr Ganesan observed that the fracture of the Appellant’s left patella was minimally displaced, and decided that it would be best to treat her conservatively with intravenous analgesia and to immobilise her left leg with a plaster cast. 11 The Appellant was thereafter discharged from TTSH on 7 May 2011 itself, and was given medication for pain relief as well as a set of crutches. She continued to stay at the Respondent as a hotel guest until 24 May 2011, when she moved to an apartment rented by Balanced Engineering for her husband and her to live in.5Foot Note 5×ROA vol 3 Part 1 at p 8, para 21. Follow-up treatments, appointments and diagnoses 12 After her discharge from TTSH, the Appellant returned for a number of follow-up appointments and physiotherapy sessions. 13 The Appellant saw Dr Ganesan on 12 May 2011,6Foot Note 6×ROA vol 3 Part 1 at p 195 at para 58.and again on 14 June 2011.7Foot Note 7×ROA vol 3 Part 1 at p 249.At the appointment on 14 June 2011, the Appellant reported that she continued to experience pain in her left knee and had difficulty flexing it; she also complained of swelling and pain in her left calf.8Foot Note 8×ROA vol 4 at p 20.Dr Ganesan suspected that the Appellant might have deep-vein thrombosis (“DVT”).9Foot Note 9×ROA vol 4 at p 20.As a precautionary measure, Dr Ganesan prescribed anti-thrombotics for the Appellant to take for her business trip to the UK.10Foot Note 10×ROA vol 4 at p 23.The Appellant and her husband flew business class for this trip.11Foot Note 11×ROA vol 3 Part 1 at p 196, para 63,She asserts that this was necessary as she needed to have more leg room to prevent an aggravation of her DVT. On 19 July 2011, when the Appellant next saw Dr Ganesan, he ruled out the possibility that she had DVT because the symptoms of the condition had abated by then.12Foot Note 12×ROA vol 4 at p 20. 14 In the meantime, on 24 June 2011, the Appellant attended her first physiotherapy session.13Foot Note 13×ROA vol 4 at p 57.She was attended to by Mr Zaki Hairodin (“Mr Hairodin”), a physiotherapist. Mr Hairodin stated in his report dated 1 October 2011 that the Appellant told him at their first session that: (a) she felt a constant dull pain in her left knee and her left Achilles tendon; and (b) she had difficulty bending her left knee and putting weight on her left leg. Mr Hairodin also reported that the Appellant was able to walk for short distances (20m) using a pair of crutches, but largely required a wheelchair for mobility, and that the Appellant had an “active range of movement of 40 degrees in her left knee”.14Foot Note 14×ROA vol 4 at p 57.He also observed “significant muscle wasting and weakness of her quadriceps muscles”. 15 On 19 July 2011, the Appellant had another follow-up appointment with Dr Ganesan. For this visit, apart from the issue relating to DVT (see [13] above), Dr Ganesan made the following key points in his specialist medical report dated 27 July 2011:15Foot Note 15×ROA vol 4 at p 20.(a) the Appellant’s pain in her left knee had abated significantly; (b) the X-rays revealed good callus formation and healing of the fracture; (c) the Appellant was able to ambulate with a knee brace and could flex her knee to a greater degree; (d) the Appellant reported having difficulty moving around and required a wheelchair to ambulate long distances; (e) there was significant wastage of the Appellant’s left quadriceps and gastrocnemius muscles; (f) the Appellant’s left knee had an active range of motion limited to five to 70 degrees; and (g) there was minimal effusion in the Appellant’s left knee joint. Dr Ganesan concluded that the Appellant did not need surgical intervention, but was “functionally disabled” at that point in time and needed a further review in six months’ time. 16 Thereafter, the Appellant continued to attend physiotherapy sessions. During a physiotherapy session on 28 September 2011, the Appellant told Mr Hairodin that she had “[no] significant improvement in her left knee pain but [was] able to cope better”.16Foot Note 16×ROA vol 4 at p 58.Mr Hairodin noted, however, that the pain in the Appellant’s left Achilles tendon had resolved, and that her left leg’s muscular strength had improved. He also noted that the Appellant was able to walk independently with a walking stick and no longer needed a knee brace. 17 Although the physical injuries that the Appellant sustained in the Accident were healing by October 2011 (nearly five months after the Accident), the Appellant complained that she continued to experience significant pain in her left knee and other parts of her body. With the aim of diagnosing the reason for the pain, Dr Ganesan arranged for the Appellant to undergo nerve conduction tests on 13 October 2011.17Foot Note 17×ROA vol 4 at p 27.The test results showed that the nerves tested were normal. 18 Following that, Dr Ganesan referred the Appellant to pain specialists at TTSH’s Department of Anaesthesia and Pain Management. Dr Nicholas Chua (“Dr Chua”), the Head of the Acute Pain Service in that department, saw the Appellant on 16 November 2011, and observed that her symptoms and signs appeared to be consistent with a diagnosis of Type I CRPS (formerly known as Reflex Sympathetic Dystrophy), a form of sympathetic nerve disorder that gives rise to long-term pain.18Foot Note 18×ROA vol 4 at p 33.Dr Chua noted in his report dated 15 February 2012 that the Appellant’s condition had improved when she saw him three months later, but she still required further follow-up assessment.19Foot Note 19×ROA vol 4 at p 33. 19 On 24 February 2012, Dr Ganesan ordered two magnetic resonance imaging (MRI) scans to be done on, respectively, the Appellant’s left knee and spine. The results indicated that the Appellant had a “posterior cruciate ligament strain and patella tendinopathy” and a “degenerative disc disease with no nerve compressions”. 20 In order to assist the Appellant to cope better with the pain that she complained of, Dr Ganesan referred her to another pain specialist from TTSH’s Pain Management Clinic, Dr Vincent Yeo (“Dr Yeo”), in April 2012.20Foot Note 20×ROA vol 4 at p 37.On Dr Yeo’s recommendation, the Appellant started seeing a Senior Psychologist from the same clinic, Ms Su Yin Yang (“Ms Su”), to get help in coping with the anxiety and sleeping difficulties that she reported experiencing.21Foot Note 21×ROA vol 4 at p 39.In her report dated 1 November 2013, Ms Su wrote that she saw the Appellant for eight sessions from May 2012 to May 2013, and that the Appellant was not suffering from Post-Traumatic Stress Disorder or clinical depression.22Foot Note 22×ROA vol 4 at p 50.However, she observed that the Appellant was “hypervigilant and fear avoidant [sic] of situations that she perceive[d] [would] likely result in re-injury or [would] likely aggravate her pain condition”, and had “symptoms of anxiety with catastrophic thinking about her injury and pain condition”. 21 The Appellant saw Dr Ganesan again on 15 May 2012.23Foot Note 23×ROA vol 4 at p 27.By then, more than a year had passed since the Accident. Dr Ganesan’s opinion of the Appellant’s condition, as recorded in his medical report dated 4 June 2012, was as follows:24Foot Note 24×ROA vol 4 at p 27. Opinion [The Appellant] is recovering slowly but surely from the injuries sustained on 7 May 2011. The recovery has been complicated by CRPS. She is functionally disabled and cannot perform some activities of daily living independently, such as bathing, walking distances (requires the use of a stick and tires easily) and wearing clothes. She is unable to participate in her previous sporting activities such as motor racing, skiing, badminton, horse riding, polo and aerobics. She is also anxious when walking on wet floors and taking escalators. Her condition will make it difficult for her to return to work as the Managing Director of her company as she is required to stand and walk long distances. She is also unable to concentrate as Pregabalin [a pain relief medication which the Appellant was taking] causes her drowsiness. 22 On 23 July 2013 (more than two years after the Accident), the Appellant saw Dr Bernard Lee (“Dr Lee”), a consultant pain specialist at a private clinic known as the Singapore Pain Care Centre, in order to get a medical evaluation for the purposes of her action against the Respondent, which she had commenced on 10 October 2011 (see [28] below). Like Dr Chua and Dr Yeo, Dr Lee diagnosed the Appellant as suffering from CRPS. He noted that the Appellant had all the signs and symptoms of sympathetic mediated pain, and fulfilled the diagnostic criteria for CRPS.25Foot Note 25×ROA vol 4 at p 41.Apart from CRPS, Dr Lee also diagnosed the Appellant as suffering from another chronic medical condition, namely, fibromyalgia. He described this as “a syndrome [separate from CRPS] that causes chronic, sometimes debilitating muscle pain and fatigue”, where pain would typically originate in one area (usually the neck, shoulders and upper left limbs) and radiate out.26Foot Note 26×ROA vol 4 at p 44.Dr Lee is the only doctor who has diagnosed the Appellant as having fibromyalgia. 23 On 24 September 2013, the Appellant saw Dr Ganesan for a final time before moving to Taiwan with her husband, who had been posted there for work.27Foot Note 27×ROA vol 4 at p 30.The observations made by Dr Ganesan at this visit were largely similar to those which he had previously made. He noted that the Appellant continued to experience pain, especially in the area near her left knee, and that she was able to walk for 30m with the aid of a walking stick, but required a wheelchair for longer distances. He was of the opinion that the Appellant’s condition, complicated by CRPS, was “permanent and functionally disabling”, and that she would not be able to engage in her previous employment.28Foot Note 28×ROA vol 4 at p 31.We should add that this opinion of Dr Ganesan should now be viewed in the light of his oral testimony in court following what was disclosed in the surveillance footage recorded by the private investigator engaged by the Respondent as well as in the Appellant’s Twitter posts (the surveillance footage and Twitter posts are dealt with later in this judgment at [84]–[98] below). This applies equally to the opinions of many of the other doctors who examined the Appellant. 24 On 30 September 2013, the Appellant left Singapore for Taiwan. She later returned to Singapore in February 2014 to be examined by two doctors engaged by the Respondent, Dr Tay Kwang Hui (“Dr Tay”) and Dr Sarbjit Singh (“Dr Singh”). Dr Tay is a pain specialist and senior consultant at the Department of Anaesthesia at National University Hospital (“NUH”), while Dr Singh is an orthopaedic surgeon and senior consultant at a private clinic known as the Centre for Advanced Orthopaedics. 25 Dr Tay examined the Appellant on 11 February 2014 and prepared a medical report dated 5 August 2014 setting out his opinion on the Appellant’s condition. Although Dr Tay was originally listed as an expert witness for the Respondent for the assessment of damages hearing below, he was not eventually called upon by the Respondent to testify. The medical report which he prepared was also never admitted into evidence, and it is one of the pieces of further evidence that the Appellant is seeking leave to adduce in SUM 279/2015. 26 The Appellant was examined by Dr Singh on 12 February 2014, approximately two years and nine months after the Accident. His opinion was as follows:29Foot Note 29×ROA vol 4 at p 69. … [The Appellant] has multiple complaints over left ankle, left knee, lower back and left shoulder. Her mobility is affected and she uses a wheelchair for walking. Clinical examination of left knee and ankle showed good return of motion. Motor power was 5/5. She appears apprehensive when attempting to touch the left knee. There was mild tenderness over left tendoachilles region. Patient was not keen on repeat X-rays [of] left knee. In general, an undisplaced fracture patella takes 3–4 months for recovery. The left tendoachilles strain is expected to recover well.Her condition appears to be complicated by[CRPS] which is best addressed by a pain specialist. Her ability to return to work should be assessed by a pain specialist.An average patient should be able to return to work for her orthopaedic conditions and travel by car 3-4 months following the injury. [emphasis added] Dr Singh’s report is the most updated medical report that is in evidence. Notably, he appears to be of the view that a pain specialist, rather than an orthopaedic surgeon like himself, would be better equipped to assess the Appellant’s overall condition in the light of her CRPS. 27 The Appellant returned to Taiwan with her husband after these medical examinations. Sometime in September 2014, the couple returned to the UK from Taiwan.",
        "The proceedings below": "28 The Appellant commenced proceedings against the Respondent in the State Courts (then known as the Subordinate Courts) on 10 October 2011, some five months after the Accident. In her statement of claim, the Appellant particularised her heads of claim as follows: NoHead of claimAmount1Medical and related expenses:(a) As at 28 September 2011 (and continuing)(b) Future$2,608.85To be assessed2Transportation and related expenses(a) As at 28 September 2011 (and continuing)(i) Taxi fares(ii) Parking charges(b) Future$65.80$88.20To be assessed3Difference between business class and economy class air tickets for trip to and from the UK£2,0004Loss of income whilst on medical leave (and continuing)To be assessedTotal$2,762.85 and £2,000, and further amounts to be assessed 29 The suit in the State Courts was later transferred to the High Court on 23 August 2012. Approximately one year later, on 2 August 2013, the parties entered into an interlocutory judgment by consent, with each party to bear 50% of the liability and with damages to be assessed. 30 At the assessment of damages hearing before the Judge from 11 to 13 February 2015, the Appellant claimed many more heads of claim and a greater quantum of damages than what she had initially pleaded. Through her counsel, Mr Salem Ibrahim (“Mr Ibrahim”), she argued, in the main, that she suffered from CRPS and fibromyalgia, which had impacted her significantly such that she was no longer able to walk properly, let alone take part in motor car races, take care of herself and attend to her company, CPL. She thus claimed,inter alia, damages for pain and suffering caused by CRPS and fibromyalgia, for past and future medical expenses and for loss of earnings. Notably, the Appellant also claimed a sum of £312,305 for her alleged loss of a chance to profit from the sale of CPL upon reaching the age of 70. The quantum of damages claimed by the Appellant in her closing submissions was again different from that reflected in Mr Ibrahim’s opening statement (see the table at [32] below). Additionally, Mr Ibrahim urged the Judge to draw an adverse inference against the Respondent pursuant to s 116 read with Illustration (g) of the Evidence Act (Cap 97, 1997 Rev Ed) (“the Evidence Act”) for not calling Dr Tay as a witness and for failing to disclose his medical report (see [25] above). 31 The Respondent, through its counsel, Mr Ramesh Appoo (“Mr Appoo”), submitted that the Appellant had exaggerated her injuries, and that at worst, she had only suffered injuries to her left patella, which had since fully recovered. In particular, Mr Appoo contended that the Appellant had failed to prove that she suffered from CRPS and fibromyalgia, and that even if she had indeed suffered from these conditions, she had likewise recovered from them. Crucially, Mr Appoo relied on various pieces of evidence, all of which he said showed that the Appellant was able to continue living her life normally. These included: (a) various timetables and course schedules from the Management Development Institute of Singapore (“MDIS”), which showed that the Appellant taught there on a part-time basis in 2012 and 2013; (b) the video surveillance footage recorded by the private investigator hired by the Respondent, which showed excerpts of the Appellant shopping and even taking long walks at Pasir Ris Park; and (c) posts from the Appellant’s Twitter account, which recorded her “tweets” on outings, plays and overseas trips. In addition, in his written closing submissions, Mr Appoo argued that several of the Appellant’s heads of claim had not been mentioned in her pleadings (more specifically, her statement of claim) and should thus be disregarded. 32 We set out the amounts claimed by the Appellant, as well as the Respondent’s position on the various heads of claim, in the table below. The italicised items are those in respect of which the quantum claimed by the Appellant changed in the course of the assessment of damages hearing: NoHead of claimAppellant’s position in opening statement30Foot Note 30×ROA vol 3 Part 6 at p 7.Appellant’s position in closing submissions31Foot Note 31×Appellant’s closing submissions at para 207.Respondent’s position1Pain and suffering arising from CRPS with fibromyalgia$65,000$65,0002Loss of amenities$125,000$150,00003Pain and suffering for fracture of knee (left patella), abrasions to left knee and strained left ankle$20,500$55,500$9,5004Pain and suffering for back injury$50,000$50,000$2,0005Pre-trial medical expenses$16,024.73$15,629.35$7,6776Pre-trial costs of medical equipment$2,607.59$1,360.4307Pre-trial transportation costs$5,628.86$5,628.86$8008Difference between business  class and economy class air tickets$8,945.60$8,945.6009Costs of home renovations$359.20$359.20010Pre-trial loss of earnings£316,375.65£323,406.22011Loss of future earnings£1,265,502.60£1,438,315.12012Loss in respect of the inability to profit from the sale of CPL upon turning 70£312,305£312,305013Future costs of engaging a domestic helper£360,000£622,080014Husband’s loss of income$21,600£21,600015Future medical expenses$90,000$746,6220Total$405,665.98 and £2,254,183.25$1,099,045.44 and £2,717,706.34$19,977",
        "The Judge’s decision": "33 The Judge eventually assessed the Appellant’s damages at only $18,010.23, an amount drastically lower than the $1,099,045.44 and £2,717,706.34 that she claimed in her closing submissions. The award was made up of the following (see the Judgment at [27]): (a) $12,000 for pain and suffering in respect of the injuries to the Appellant’s fractured patella and her strained ankle; (b) $4,374.55 for pre-trial medical expenses; and (c) $1,635.68 for pre-trial transportation costs. In the light of the agreed apportionment of liability (see [29] above), the final sum due to the Appellant was $9,005.12. 34 The remaining claims by the Appellant were wholly rejected by the Judge. Even though he reluctantly accepted that the Appellant suffered from CRPS because the Respondent did not adduce any medical evidence to the contrary, he found that the Appellant had grossly exaggerated her condition (see the Judgment at [17]–[18] and [25]). He held that there was objective evidence which showed that the Appellant had the ability to work and was able to continue leading a relatively normal life. In making this finding, the Judge relied on the following pieces of evidence: (a) the surveillance evidence tendered by the Respondent, consisting of photographic and video evidence which showed that the Appellant was ambulant with a cane and could take long walks; (b) Dr Ganesan’s evidence that the Appellant told him at a follow-up appointment on 31 July 2012 that she was pleased that she could drive a manual car and use the clutch of a car during a trip to the UK; (c) the fact that the Appellant travelled overseas frequently for holidays and in connection with her husband’s work; and (d) the fact that the Appellant was able to conduct courses at MDIS (see the Judgment at [20]–[25]). 35 The Judge also rejected the Appellant’s claim that she suffered from fibromyalgia. In this regard, he rejected the evidence of Dr Lee, who was the only doctor on record to have made that diagnosis (see [22] above), because Dr Lee saw the Appellant only once before making the diagnosis even though a three-month period of clinical observation was usually needed before such a diagnosis could be made (see the Judgment at [27]). 36 Similarly, the Appellant’s claim for the loss of a chance to profit from the sale of CPL upon reaching the age of 70 was rejected by the Judge. He found that the Appellant had been prepared to give up her work in CPL when she left the UK in early 2011 to accompany her husband to Asia, as evidenced by her lack of attempt to continue her work in CPL thereafter (see the Judgment at [26]).",
        "The present appeal": "37 Dissatisfied with the Judge’s decision, the Appellant filed the present appeal on 16 June 2015. Her arguments on appeal closely mirror those made in the court below. The heads of claim remain the same as those set out in the parties’ joint opening statement and the Appellant’s written closing submissions for the assessment of damages hearing, but the Appellant has again revised the quantum of some of the heads of claim. In the table below, we summarise her position on appeal in comparison with her position at the close of the hearing in the court below, the italicised items being those in respect of which the quantum claimed has changed on appeal: NoHead of claimAppellant’s position in closing submissions at the assessment of damages hearingAmount claimed on appeal1Pain and suffering arising from CRPS with fibromyalgia$65,000$65,0002Loss of amenities$150,000$150,0003Pain and suffering for fracture of knee (left patella), abrasions to left knee and strained left ankle$55,500$50,0004Pain and suffering for back injury$50,000$50,0005Pre-trial medical expenses$15,629.35$15,629.356Pre-trial costs of medical equipment$1,360.43$1,360.437Pre-trial transportation costs$5,628.86$5,628.868Difference between business class and economy class air tickets$8,945.60$8,945.609Costs of home renovations$359.20$359.2010Pre-trial loss of earnings£323,406.22£323,406.2211Loss of future earnings£1,438,315.12£1,533,193.5212Loss in respect of the inability to profit from the sale of CPL upon turning 70£312,305£312,30513Future costs of engaging a domestic helper£622,080£622,08014Husband’s loss of income£21,600£21,60015Future medical expenses$746,622$746,622Total$1,099,045.44 and £2,717,706.34$1,093,545.44 and £2,812,258.74 38 On 11 August 2015, the Appellant filed SUM 279/2015 for leave to admit further evidence for the purposes of this appeal.",
        "SUM 279/2015: Summons for leave to adduce further evidence on appeal": "39 We will first address SUM 279/2015 before giving our decision in respect of the appeal. By this summons, the Appellant seeks leave to adduce the following additional evidence, which she says will show that she has CRPS and is no longer able to work: (a) Dr Tay’s medical report (see [25] above), in which he agreed that the Appellant suffered from CRPS; (b) a document known as “Statement of Fitness for Work for Social Security or Statutory Sick Pay” dated 13 April 2015 from the Old School Surgery, a clinic based in the UK, stating that the Appellant was not fit for work from 23 February to 30 June 2015 because she was suffering from CPRS and fibromyalgia (“the Old School Surgery Statement”); and (c) two letters dated 5 June 2015 from a UK government agency known as “Jobcentreplus” addressed to the Appellant and to the Old School Surgery respectively (“the Jobcentreplus Letters”) stating that the Appellant “[met] the eligibility criteria for Employment and Support Allowance” and was eligible for such allowance with effect from 1 June 2015.",
        "Whether Dr Tay’s medical report should be admitted": "Overview 40 The medical report by Dr Tay dated 5 August 2014 details his observations and opinion on the Appellant’s condition after he examined her on 11 February 2014.32Foot Note 32×Appellant’s affidavit dated 11 August 2015 at p 15.As stated at [24] above, Dr Tay is a pain specialist and senior consultant at NUH’s Department of Anaesthesia who was engaged by the Respondent to examine the Appellant for the purposes of the assessment of damages hearing. 41 According to the Appellant, the Respondent had represented that it would disclose Dr Tay’s medical report as it would be calling him as a witness. However, on 28 August 2014, the Respondent informed the Appellant and the court that it was not going to rely on Dr Tay’s evidence after all and refused to disclose his report. On 13 November 2014, Mr Ibrahim wrote to Mr Appoo seeking discovery of Dr Tay’s report. Mr Appoo replied on 19 November 2014 stating that the Respondent was not obliged to disclose the report. No further application was made by the Appellant in respect of the report thereafter. The report was thus never admitted as evidence. In his closing submissions, Mr Ibrahim invited the Judge to draw an adverse inference against the Respondent for refusing to call Dr Tay as a witness and disclose his report (see [30] above). It does not appear from the Judgment that the Judge drew any such inference. 42 It should be noted that in SUM 279/2015, the Appellant is not seeking an order for Dr Tay’s medical report to be disclosed. She is already in possession of this report as she obtained it directly from Dr Tay after the assessment of damages hearing without the Respondent’s knowledge. What happened was that after the Judge handed down his decision, the Appellant started corresponding with Dr Tay to request a copy of his medical report. In her first email to Dr Tay, which was sent on 20 May 2015, a day after the Judgment was delivered, the Appellant wrote as follows:33Foot Note 33×Appellant’s affidavit in relation to SUM 279/2015 at p 42. … The [Judgment] has now been delivered so I was wondering if you could kindly email me your medical report as a patient you have seen in a doctor / patient context please? … 43 When Dr Tay did not reply to this email, the Appellant sent another email on 11 June 2015 to again request a copy of his medical report in her capacity as his patient. On 15 June 2015, Dr Tay forwarded a copy of his report to the Appellant. Dr Tay explained in his affidavit dated 12 October 2015 that he did so as he was under the impression that the case had already concluded. He stated that he would not have sent his report to the Appellant without first consulting the Respondent’s solicitors if he had known that she intended to use the report in support of her appeal. The parties’ arguments before us 44 Mr Ibrahim submits that Dr Tay’s medical report ought to be admitted as further evidence as the three-stage test set out inLadd v Marshall[1954] 1 WLR 1489 (“Ladd vMarshall”) has been satisfied and the contents of the report would put it beyond doubt that the Appellant has CRPS. He further submits that even if theLadd v Marshalltest has not been satisfied, there are special grounds in this case to admit Dr Tay’s report because the Respondent acted unfairly in the conduct of its case by running its case wholly contrary to Dr Tay’s medical opinion despite knowing the contents of his report.34Foot Note 34×Appellant’s skeletal submissions for SUM 279/2015 at para 31.To disallow the admission of Dr Tay’s report, Mr Ibrahim argues, would be a “grave injustice” to the Appellant. Mr Ibrahim further submits that a medical report by a doctor in a public institution who has declared that he owes a duty to the court and not to those who instructed or paid him cannot be protected by litigation privilege.35Foot Note 35×Appellant’s skeletal submissions for SUM 279/2015 at para 38. 45 The Respondent objects to the production of Dr Tay’s medical report on the grounds that it is covered by litigation privilege and is therefore inadmissible as evidence.36Foot Note 36×Respondent’s skeletal submissions for SUM 279/2015 at para 7.In this regard, the Respondent relies on the English Court of Appeal’s decision inWorrall v Reich[1955] 2 WLR 338 (“Worrall”) to submit that medical reports made on behalf of parties on the advice of their solicitors and for the purpose of preparing their case for trial are protected by litigation privilege.37Foot Note 37×Respondent’s skeletal submissions for SUM 279/2015 at para 20.It also argues that the manner in which the Appellant obtained a copy of Dr Tay’s report was improper as she did not divulge to Dr Tay the true purpose of her request for the report.38Foot Note 38×Respondent’s skeletal submissions for SUM 279/2015 at para 21.In the alternative, Mr Appoo argues that even if Dr Tay’s report is not covered by litigation privilege, theLadd v Marshalltest has not been satisfied as the report could have been obtained with reasonable diligence for use at the assessment of damages hearing, and was also not one that had a credible and important influence on the outcome of the hearing.39Foot Note 39×Respondent’s skeletal submissions for SUM 279/2015 at para 22. 46 Two questions fall to be determined in respect of the Appellant’s application for leave to admit Dr Tay’s medical report as further evidence on appeal: (a) whether theLadd v Marshalltest has been satisfied; and (b) whether the Respondent’s submission that Dr Tay’s report is inadmissible on the grounds that it is protected by litigation privilege has any merit. We will address each of these questions in turn. Whether theLadd v Marshalltesthas been satisfied 47 It is well-established that no further evidence may be adduced at the appellate stage unless the following three cumulative conditions set out inLadd v Marshall(at 1491) are met (see also s 37(4) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) and O 57 r 13(2) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed), which require proof of special grounds before such evidence can be admitted): (a) First, it must be shown that the evidence in question could not have been obtained with reasonable diligence for use at the trial. (b) Second, the evidence must be such that if it had been adduced at the trial, it would probably have had an important influence on the result of the case, although it need not be decisive. (c) Third, the evidence must be such as is presumably to be believed; in other words, it must be apparently credible, although it need not be incontrovertible. 48 In our view, theLadd v Marshalltest has been satisfied in respect of Dr Tay’s medical report. The Respondent makes the argument – in a somewhat ironic manner, given that Dr Tay was, or was supposed to be, itswitness – that the report is not credible and did not have an important influence on the outcome of the assessment of damages because it was premised on information that had been provided by the Appellant, and because Dr Tay was unaware, at the time he wrote the report, of certain important pieces of information such as the surveillance footage on the Appellant and the entries in her Twitter account. With respect, we are unable to accept this submission. Dr Tay’s report is, in our view, a significant and credible piece of evidence – all the more so because it originated from a doctor whose services were engaged not by the Appellant but by the Respondent – which would have supported and greatly strengthened the Appellant’s case that she suffers from CRPS and that the condition has a long-term impact on her. If the Respondent were of the view that it was important for Dr Tay to take into consideration the surveillance footage and the Appellant’s Twitter account entries, it should have placed those materials before Dr Tay and asked for a supplementary report. 49 The first condition of theLadd v Marshalltest has also, in our view, been satisfied. As we will discuss at [51]–[54] below, Dr Tay’s medical report was protected by litigation privilege before and at the time of the assessment of damages hearing. It was thus a piece of evidence that the Appellant could not have obtained for use in the proceedings below even if she had exercised reasonable diligence. 50 In the context of the present case, the fulfilment of theLadd v Marshalltest does not, however, automatically mean that Dr Tay’s medical report can be admitted as further evidence in the light of the fact that the report is protected by litigation privilege. We turn to this issue next. Litigation privilege 51 Litigation privilege is one of two types of legal professional privilege which exist at common law and under the Evidence Act (seeSkandinaviskaEnskilda Banken AB (Publ), Singapore Branch v Asia Pacific Breweries (Singapore) Pte Ltd and other appeals[2007] 2 SLR(R) 367 (“Skandinaviska”)), the other being legal advice privilege. Where a document is protected by either litigation privilege or legal advice privilege, it is exempted from disclosure in litigation. As summarised by Professor Jeffrey Pinsler SC (“Prof Pinsler”) inEvidence and the Litigation Process(LexisNexis, 5th Ed, 2015) (“Evidence and the Litigation Process”)at para 14.108, the rationale of litigation privilege is to allow a party to maintain the confidentiality of his strategy in litigation and the preparation of his case, and is linked to the nature of the adversarial process and the autonomy of a party to prepare and draw up strategies for his case as he sees fit, free from prying eyes. In this way, a party and/or his lawyer will be able to seek information from third parties without fear that they may have to disclose communications which are adverse to the party’s case, assuming that the privilege can be invoked. 52 For litigation privilege to apply, two conditions must be satisfied: (a) First, as a threshold matter, the party claiming such privilege must show that there is a reasonable prospect of litigation (seeThreeRivers District Council v Bank of England (No 6)[2005] 1 AC 610 andHellenic Mutual War Risks Association (Bermuda) Ltd and General Contractors Importing and Services Enterprises v Harrison[1997] 1 Lloyd’s Rep 160 at 166, both of which were cited with approval inSkandinaviskaat [71]). In this regard, there is no requirement that the chances of litigation must be higher than 50%, nor that there must be a virtual certainty of litigation (seeSkandinaviskaat [71] and [73], disapproving ofCollins v London General Omnibus Company(1893) 68 LT 831). (b) Second, the dominant purpose for which the advice was sought or obtained must have been for litigation (seeWaugh v British Railways Board[1980] AC 521, which was similarly cited with approval inSkandinaviskaat [75]). 53 Both of the above conditions have clearly been met in the present case. When Dr Tay saw the Appellant on 11 February 2014 and later prepared his medical report dated 5 August 2014, litigation between the parties had already gone on for more than two years. Litigation was also clearly the dominant – in fact, the sole – purpose for which the Appellant was examined by Dr Tay and the report prepared. 54 We do not accept the Appellant’s submission (as summarised at [44] above) that medical reports cannot be subject to litigation privilege. This goes against the weight of the authorities (seeWorrall,Caustonv Mann Egerton (Johnsons) Ltd[1974] 1 WLR 162 (“Causton”),DrPritam Singh v Yap Hong Choon[2007] 1 MLJ 31 as well asBBN (her next friendB) v Low Eu Hong (trading as EH Low Baby N’ Child Clinic)[2012] SGHCR 7). In this regard, the observations of Roskill LJ inCauston(at 170) are pertinent: … I am clearly of the view that this court has no power to order production of privileged documents.Medical reports are in no different category from other experts’ reports and it would be quite wrong to engraft a qualification upon the doctrine of privilege according to the nature of the report or the class of professional qualification attaching to its maker.… [S]o long as we have an adversary system, a party is entitled not to produce documents which are properly protected by privilege if it is not to his advantage to produce them, and even though their production might assist his adversary if his adversary or his solicitor were aware of their contents or might lead the court to a different conclusion from that to which the court would come in ignorance of their existence. Some may regret this; but the law has allowed it and it is not for us to change the law in this respect. [emphasis added] 55 The Respondent was thus entitled not to disclose Dr Tay’s medical report at the time of the assessment of damages hearing as the report was covered by litigation privilege. On this note, we digress to address a related issue which is not directly relevant to this summons. This concerns Mr Ibrahim’s submission (at [30] above) that the Judge should have drawn an adverse inference against the Respondent for not having disclosed Dr Tay’s report and not having called Dr Tay as a witness for the proceedings below. We cannot accept Mr Ibrahim’s argument, for to draw an adverse inference against the Respondent in such a situation would be to render litigation privilege otiose (seeWentworth v JC Lloyd and others(1864) 10 HLC 589 (“Wentworth”) andMichael Patrick Sayers v Clarke Walker (A Firm)[2002] EWCA Civ 910, as well asPhipsonon Evidence(Hodge M Malek gen ed) (Sweet & Maxwell, 18th Ed, 2013) (“Phipsonon Evidence”) at para 23-22 andThe Law of Privilege(Bankim Thanki QC ed) (Oxford University Press, 2nd Ed, 2011) at para 1.39). The reason for this is clear, and is succinctly explained by the House of Lords inWentworthas follows: … [T]o say that when a party refuses to permit professional confidence to be broken, everything must be taken strongly against him … is but to deny him the protection which, for public purposes, the law affords him, and utterly to take away a privilege which can thus only be asserted to his prejudice. … 56 With that, we return to the Respondent’s submission that Dr Tay’s medical report is inadmissible because it is covered by litigation privilege. To succeed on this point, it does not suffice for the Respondent to prove that the report is covered by litigation privilege. The critical question is whether the report is consequently inadmissible. 57 In our view, the Respondent’s submission that Dr Tay’s medical report is inadmissiblebecauseit is covered by litigation privilege is not legally correct as it conflates the distinct concepts of admissibility, privilege and confidentiality. As emphasised by Hoo Sheau Peng JC in her recent decision inHTSRL v Wee Shuo Woon[2016] 2 SLR 442 (“WeeShuo Woon”), which was released after we reserved our judgment in the present appeal, the concepts of admissibility, privilege and confidentiality should not be confused. As the case ofWeeShuo Woonis pending appeal, we should add the caveat that our observations in the analysis at [58]–[67] below are not, and should not be taken to be, an endorsement (or otherwise) of the result that was reached in that case. 58Privilegeallows a party to withhold the disclosure of information which would otherwise be compulsory to disclose.Admissibility, on the other hand, relates to the question of whether a particular piece of evidence may be received by the court, and is governed by whether that piece of evidence is relevant to the matters in issue (seeKuruma, Son of Kaniu v The Queen[1955] 2 WLR 223 at 226–227 as cited inWeeShuo Woonat [19]). Where the document in respect of which privilege is being asserted – such as Dr Tay’s medical report in the present case – is already in the possession of the other party, the issue is no longer one of withholding disclosure, and the question becomes one of admissibility rather than privilege. 59 The question of whether Dr Tay’s medical report is protected by litigation privilege is, strictly speaking, irrelevant to the issue of whether it isadmissibleas evidence. It may, however, have a bearing on whether the reportshould be admitted. This arises from the fact that equity may, through the grant of injunctions, intervene to prevent the unauthorised use in court proceedings of information contained in privileged material, which would, in most instances, be of a confidential nature (seeLordAshburton v Pape[1913] 2 Ch 469 (“LordAshburton”),Goddard v Nationwide Building Society[1986] 3 WLR 734 (“Goddard”),TentatSingapore Pte Ltd v Multiple Granite Pte Ltd and others[2009] 1 SLR(R) 42 (“Tentat”) andWeeShuo Woonat [22]). The court’s equitable jurisdiction to restrain breaches of confidence is invoked in these instances. 60 We note that this is an area of law that has attracted much controversy (as succinctly summarised by Hoo JC inWeeShuo Woonat [23]–[49]). The controversy stems from two apparently conflicting authorities on whether evidence that is protected by privilege but that has come into the possession of the other party should be admitted: seeCalcraftv Guest[1898] 1 QB 759 (“Calcraft”) andLordAshburton. It was held inCalcraftthat secondary evidence (in the form of copies) of the contents of documents protected by privilege was admissible even though the originals were privileged as they related to an earlier litigation involving the plaintiff’s predecessor-in-title. In contrast, the court inLordAshburtoncame to a decision that appeared to conflict withCalcraft. It held that the fact that documents might be admissible (which, in its view, was the effect of the decision inCalcraft) did not affect the court’s equitable jurisdiction to grant an injunction to order the delivery up of the documents or to restrain the publication or copying of the documents on the basis that they contained confidential information which had been improperly obtained. 61 Subsequent cases such asWebster v James Chapman& Co[1989] 3 All ER 939 (“Webster”) and the oft-cited case ofGoddardsought to reconcileCalcraftandLordAshburton. InWebster, Scott J (as he then was) explained that the two cases involved “two independent and free-standing principles of jurisprudence” (at 943j), withCalcraftdealing with privileged documents and the scope of the protection provided by legal professional privilege, andLordAshburtondealing with confidential documents and the protection that equity will provide to such documents. Scott J reconciled the application of the principles in the two cases in the following manner (at 943j): Once a privileged document or a copy of a privileged document passes into the hands of some other party to the action, prima facie the benefit of the privilege is lost: the party who has obtained the document has in his hands evidence which, pursuant to the principle in [Calcraft], can be used at the trial. But it will almost invariably be the case that the privileged document will also be a confidential information and, as such, eligible for protection against unauthorised disclosure or use. 62 May LJ made similar observations inGoddard(at 743F–743G): … [LordAshburton] and [Calcraft] are good authority for the following proposition. If a litigant has in his possession copies of documents to which legal professional privilege attaches he may nevertheless use such copies as secondary evidence in his litigation: however, if he has not yet used the documents in that way, the mere fact that he intends to do so is no answer to a claim against him by the person in whom the privilege is vested for delivery up of the copies or to restrain him from disclosing or making any use of any information contained in them. … May LJ expressed the view, however, that it was not entirely satisfactory that the question of whether privileged information should be admitted in evidence had to depend on “the order in which applications are made in litigation” (at 743F), in that, as Nourse LJ put it inGoddard(at 744F–745A), “the party who desires the protection must seek itbeforethe other party has adduced the confidential communication in evidence or otherwise relied on it at trial” [emphasis added]. 63 The relationship betweenCalcraftandLordAshburtonhas also been discussed in three Singapore High Court cases: (a)Tentat; (b)Gelatissimo Venture (S) Pte Ltd and others v Singapore Flyer Pte Ltd[2010] 1 SLR 833 (“Gelatissimo”); and (c) most recently,WeeShuo Woon. 64 InTentat, Kan Ting Chiu J adopted May LJ’s pronouncement inGoddard(see [62] above) that a party in possession of a privileged document was entitled to adduce copies of that document as secondary evidence, subject to the right of the person claiming privilege to apply to restrain the use of the documentpriorto its presentation in court as evidence and its introduction into the public domain (seeTentatat [34] and [39]). 65Gelatissimois a more controversial decision (see Prof Pinsler’s comments inEvidence and the Litigation Processat para 14.100 and the observations made by Hoo JC inWeeShuo Woonat [39]). There, the court held that Kan J inTentathad “rejected the principles stated inCalcraftin favour of a protective attitude towards privileged documents” (at [23]), and went so far as to state that the position inCalcraftno longer represented the status of the law of privilege in Singapore (at [21]). With respect, we do not think this was the position taken inTentatand are unable to agree with that observation. 66 InWeeShuo Woon, Hoo JC reviewed the line of cases set out above and held thatCalcraftandLordAshburtonwere reconcilable, at least on a technical level, as the principle inCalcraftwas part of the law of evidence and related to the scope of the protection afforded by legal professional privilege, while the principle inLordAshburtonfell within the scope of the law of confidentiality and related to the scope of the protection afforded by equity to confidential information. This was consistent with the approach taken in cases likeWebsterandGoddardas well as inTentat(where Kan J had, at [34], endorsedGoddard). 67 It is clear from the amount of ink that has been spilt on this issue thatCalcraftandLordAshburtonare not easy to reconcile. But, this does not mean that theycannotbe reconciled. We agree with the English and local cases cited above (save forGelatissimo) that the two cases involve different principles and do not contradict each other, although we equally agree that it is not entirely satisfactory that the question of whether privileged documents will be admitted as evidence should depend on when, in the course of litigation, applications are brought and steps are taken to restrain their use (seeGoddardat 743F andWeeShuo Woonat [31]). Our decision on the admission of Dr Tay’s medical report 68 Returning to the facts of the present case, it still lies within the realm of equity to make an order restraining the use of Dr Tay’s medical report as it has yet to be admitted as evidence. We are satisfied that there are sufficient grounds for us to exercise our equitable jurisdiction to restrain the use of this report, which is of a confidential nature, in order to prevent a breach of confidence. On this basis, we decline to grant the Appellant leave to admit Dr Tay’s report as further evidence for the purposes of this appeal. 69 In this regard, we should highlight that the deceptive manner in which the Appellant obtained Dr Tay’s medical report is unsatisfactory. She deliberately represented to Dr Tay in her emails (see [42]–[43] above) that the case was over as judgment had been delivered, and that she was asking for the report in her personal capacity as his patient. The Appellant did not make known to Dr Tay her true purpose – to use his report against the Respondent on appeal. The improper manner in which the Appellant obtained Dr Tay’s report could possibly be another basis for us to refuse to admit it as evidence (seeITC Film Distributors v Video Exchange Ltd and others[1982] Ch 431 andPhipsonon Evidenceat para 26-42). Equity will not permit parties to resort to trickery or deception to circumvent legal rules and safeguards.",
        "Whether the other pieces of further evidence should be admitted": "70 We move on to the other two pieces of evidence that the Appellant seeks leave to adduce as further evidence, namely, the Old School Surgery Statement and the Jobcentreplus Letters. 71 We are of the view that these documents should likewise not be admitted into evidence. The Appellant relies on the fact that these documents were obtained only after the assessment of damages hearing before the Judge, and argues that there was no way in which she could, with reasonable diligence, have obtained them for use at the hearing as she applied for Employment Support Allowance, which gave rise to these documents, only after returning to the UK on 15 February 2015, two days after the end of the assessment of damages hearing in Singapore. 72The Appellant has not provided any explanation as to why she could not have applied for Employment Support Allowance and, consequently, obtained the aforesaid documents earlier, given that she had moved back to the UK much earlier in September 2014, and had returned to Singapore in February 2015 merely for the purposes of the assessment of damages hearing. She failed to give any good reason as to why these documents were obtained onlyafterthe hearing.In our view,theOld School Surgery Statement and the Jobcentreplus Letters are evidence that could have been obtained by the Appellant for use in the proceedings below if she had exercised reasonable diligence.We thus decline to allow the Appellant’s application for leave to admit these documents in evidence for the purposes of this appeal.",
        "Our decision in respect of the appeal": "73 We now turn to the substantive merits of the Appellant’s appeal.",
        "The Appellant’s pleadings": "74 As a preliminary matter, we note that Mr Appoo argues that a number of the Appellant’s heads of claim should be disregarded as they have not been pleaded. These heads of claim include: (a) the Appellant’s loss of future earnings; (b) her future medical expenses; (c) the pre-trial costs of medical equipment; (d) the costs of renovating the apartment provided by Balanced Engineering for her husband and her to live in; (e) her husband’s loss of earnings; (f) her loss of an opportunity to profit from the sale of CPL upon reaching the age of 70; and (g) the future costs of engaging a domestic helper. 75 Having considered the Appellant’s statement of claim, we do not think it is accurate to say that all the above items have not been pleaded. However, we accept that items (d) to (g) in the above list have indeed not been pleaded. 76 The Appellant’s statement of claim was filed on 10 October 2011 and has not been amended since. This is despite the fact that the Appellant was diagnosed with CRPS onlyafterher statement of claim was filed, and the fact that her various heads of claim are predominantly premised on her having CRPS. In this regard, we note that the Appellant was asked at the pre-trial stage whether she wished to amend her pleadings, but she declined to do so. We find this unsatisfactory. The Appellant should have amended her statement of claim long before the assessment of damages hearing to reflect her position that she suffers from CRPS. The importance of pleadings have been repeatedly emphasised by our courts. Proper pleadings are essential to demarcate the parameters of an action and to ensure that the parties are not caught by surprise (see,eg, this court’s decision inVNithia (co-administratrix of the estate of Ponnusamy Sivapakiam, deceased) v Buthmanaban s/o Vaithilingam and another[2015] 5 SLR 1422 at [34]–[41] for a summary of some of the general principles on pleadings). 77 Having said that, we are satisfied that the Respondent has not been prejudiced in its presentation and preparation of its defence as it was clear from the outset that the Appellant’s claim is heavily premised on her having CRPS. The fact that the Respondent hired a private investigator to monitor the Appellant from May 2012 to February 2014 as well as engaged Dr Tay and Dr Singh to examine the Appellant in February 2014 demonstrates that it was aware that the focus of her claim was on the severity of her CRPS and its attendant consequences. It is also significant that the Appellant and the Respondent submitted to the Judge ajointopening statement containing the Appellant’s revised heads of claim well before the commencement of the assessment of damages hearing. We will thus proceed to consider the four heads of claim listed at [74(d)]–[74(g)] above, which are closely associated with the Appellant’s CRPS and which were fully ventilated at the hearing below. 78 In the analysis that follows, we will first deal with the issues of whether the Appellant does indeed suffer from CRPS and fibromyalgia, and if she does, the extent to which these conditions have affected and currently affect her. After discussing these two conditions, we will move on to deal with the amounts awarded by the Judge for the various heads of claim.",
        "The two medical conditions: CRPS and fibromyalgia": "79 The issues of whether the Appellant suffers from CRPS and fibromyalgia and, if she does, the extent to which these conditions affect her lie at the heart of this appeal. The Judge, as we have noted, accepted (albeit reluctantly) that the Appellant had CRPS, but rejected her claim that she had fibromyalgia (see [34] above and the Judgment at [17]–[18]). Whether the Appellant suffers from fibromyalgia 80 Like the Judge, we are of the view that the Appellant does not suffer from fibromyalgia. As the Judge pointed out, Dr Lee was the only doctor who diagnosed the Appellant as having this condition. The other doctors who examined her (eg, Dr Chua and Dr Ganesan) made no such diagnosis. Another reason for our reluctance to accept Dr Lee’s diagnosis is that it was made after he monitored the Appellant on only one single occasion despite the requirement that a three-month period of clinical observation is usually needed (see [35] above and the Judgment at [27]). Given these circumstances, we are not satisfied that the Appellant has proved that she is suffering from fibromyalgia, and uphold the Judge’s decision to dismiss her claim in this regard. Whether the Appellant suffers from CRPS 81 As for CRPS, we understand from the evidence that it is a chronic pain condition that most often affects a person’s limbs, usually after some kind of injury or trauma to the limbs. The condition is thought to be the result of damage to, or malfunction of, the central or peripheral nervous system. It is characterised by excessive or prolonged pain, often out of proportion to the initial injury, as well as by changes (which may range from mild to drastic) in skin tone and/or skin temperature and/or swelling in the affected limbs. Patients are diagnosed as suffering from either Type I or Type II CRPS depending on whether there is a defined nerve injury. In Type I, there is no defined nerve injury, whereas in Type II, the doctors are able to pinpoint the precise nerve(s) injured. In the present case, the Appellant was diagnosed with Type I CRPS. 82 There is an objective yardstick known in medical parlance as the Budapest Criteria that is used by doctors to determine whether a patient is suffering from CRPS.40Foot Note 40×Appellant’s Case at para 27 (p 15).Under the Budapest Criteria, for a diagnosis of CRPS to be made, the following requirements must be met:41Foot Note 41×Appellant’s Bundle of Authorities Vol 2 at p 139. (a) The patient experiences continuing pain that is disproportionate to any inciting event. (b) The patient reports having at least one symptom in any three of the four categories below: (i) sensory – evidence of hyperesthesia to pinpricks, or allodynia to light touch, temperature sensation, deep somatic pressure or joint movement; (ii) vasomotor – evidence of temperature asymmetry (>1°C), skin colour changes or skin colour asymmetry; (iii) sudomotor or oedema – evidence of oedema, sweating changes or sweating asymmetry; and (iv) motor or trophic – evidence of decreased range of motion, motor dysfunction (eg, weakness, tremor, dystonia) or trophic changes (eg, in the hair, nails, skin). (c) The patient is observed by the doctor to have, at the time of the medical examination, at least one symptom in any two of the categories mentioned in sub-para (b) above. (d) The patient’s continuing pain and symptoms cannot be better explained by any other diagnosis. 83 In the light of the above prerequisites (in particular, the requirement for certain physical symptoms to be present), we do not think it is open to a plaintiff to freely assert that he has CRPS by simply telling his doctor that he suffers from continuing pain. This should help to allay fears that CRPS claims may be brought by plaintiffs who are not genuinely suffering from this condition. From the evidence before us, it is clear that all the doctors who testified on the Appellant’s behalf stated that they were of the view that the Appellant suffered from CRPS (see [18], [21], [22] and [26] above). In contrast, the Respondent has not produced any medical evidence to the contrary. In the light of the evidence, we accept that the Appellant has proved that she does indeed suffer from CRPS.",
        "The extent to which the Appellant is affected by CRPS": "84 Although it may not be easy to feign the existence of CRPS given that the diagnostic tests require certain physical symptoms to be present, the court must guard against the possibility that theextentof the disabilitybrought about by this condition may be exaggerated. This does not, however, mean that the court should indiscriminately doubt every assertion made by a plaintiff. Instead, what the court should do when assessing a CRPS claim is to carefully consider and weigh the evidence, including the medical opinions of doctors and other objective evidence that may shed light on the plaintiff’s lifestyle and his ability to function and work after the accident (eg, surveillance footage), before coming to a view on the severity and the extent of the disability brought about by CRPS. 85 Having examined the evidence in the present case, we agree with the Judge that the Appellant has exaggerated the extent to which she is affected by CRPS. The evidence suggests that contrary to what she has asserted, the condition has not affected her to such a great extent that she cannot even work or take care of herself. Having said that, we are also of the view that the Judge was overly critical in his assessment of the extent of the Appellant’s exaggeration. We find that the Appellant’s disability as a result of CRPS is neither as serious and debilitating as she makes it out to be, nor as trivial and insignificant as the Judge found. 86 In this regard, we find the surveillance footage tendered by the Respondent helpful in our determination of the severity of the Appellant’s CRPS. The private investigator hired by the Respondent conducted surveillance on the Appellant on four days in mid-2012, well after a year of the Accident (specifically, on 18 May, 14 June, and 22 and 29 July 2012), two days in 2013 (ie, 18 June and 16 September 2013) and two days in 2014 (ie, 11 and 12 February 2014).42Foot Note 42×ROA Vol 3 Part 3 at p 271,As the Appellant was not spotted on 14 June 2012 and 16 September 2013, there was no surveillance footage for those two days.43Foot Note 43×ROA Vol 3 Part 3 at p 285 and p 294.It can be gathered from the surveillance evidence that as at July 2012, the Appellant was ambulant with the use of a walking stick. On both 22 and 29 July 2012, the Appellant was seen taking walks at Pasir Ris Park, where she was able to walk on grassy areas and uneven surfaces as well as along the beach. We do, however, note that this was not without some difficulty, and that the Appellant needed help from her husband and her walking stick from time to time; she also had to take breaks every now and then. From the video footage, it is clear that her mobility was, to some extent, limited. 87 That said, the fact that the Appellant was able to take such walks and traverse such surfaces – even without the aid of her walking stick in some instances – is contrary to her assertion in her affidavit of 30 March 2012 that her condition at that time was so severe and debilitating that she could not walk for more than 100m without the assistance of a wheelchair.44Foot Note 44×ROA Vol 3 Part 3 at p 200, para 90.This is so even if we take into account the fact that the walks at Pasir Ris Park were done with some difficulty, and that the Appellant also intermittently needed the help of a walking stick and some assistance from her husband. We find it particularly significant that Dr Ganesan, who was the Appellant’s principal doctor, was surprised that she was able to take the walks captured in the surveillance footage recorded on 22 and 29 July 2012. This can be seen from the following exchange between Dr Ganesan and Mr Appoo in cross-examination after Dr Ganesan was shown still footages (as opposed to the video footage) of the surveillance evidence:45Foot Note 45×ROA Vol 3 Part 5 at pp 1248–1249. Q: … Now, this is what the surveillance shows. You saw her over this period of time in July of 2011. Was this the impression you had of her ability to ambulate? A: No. I wouldn’t have expected her to walk in this way. Q: And why so? A: (indistinct) [N]ot sure are the same – requires walking stick – sorry, erm, I’m --- I was referring to my previous -- ah, the consultation [in] 2011. I’m going back to the consultation in 2012. Okay, so, I do have an entry in my notes on the 31st of July 2012. It states that she went back to the UK and she was able to drive up to Scotland. She had problems --- she was able to press the clutch and, er, did not have physiotherapy. So, she regress 4 months. So, that was an entry I made on the 31st of July 2012. So, I think if she can do this, she --- there could be some --- I’m just reading from my notes, ah, what my entry was.So, it doesn’t really sound,erm, consistent. Q: Okay. Because this is prior to her --- Court: Just a minute. Did not sound consistent with what? Witness:Erm, with what I see here on the observation, it, er, could not sound so consistent with my examination. I put here her hip flexors were weak at 4-plus over 5, which associate mild weakness of her quadriceps. She gives way occasionally. She has unsteady gait and requires a walking stick. That was my entry for 2012 May, actually. And in July, as I had mentioned, she was able to drive to Scotland, press the clutch. Erm, so this is a vast improvement from what she was before. And I look at this, erm, these pictures and this walking 7.3 kilometres, erm, she has made a vast improvement, I think, from the last time. Q: And so the impression --- somehow that her condition had deteriorated as a result of CRPS. Because CRPS was diagnosed 16th of November 2011. This is surveillance which is being done in July of 2012. So, the impression that as a result of CRPS, her condition was just sliding downwards does not sync or is not consistent with what is shown on the surveillance. Is that correct? A:Yes. I mean, from the November of 2011 to May and June and July of 2012, there seems to be a vast improvement of her abilities or her physical abilities. Q:So, in other words, what she is saying about her deterioration from November of 2011 isinconsistentwith the surveillance footage--- A:Yes, yes. [emphasis added in italics and bold italics] 88 Although Mr Ibrahim tried to ameliorate the impact of Dr Ganesan’s evidence on the Appellant’s case by pointing out, during re-examination, that the Appellant had in fact walked a shorter distance and had taken many breaks in between, it did not, in our view, change the position greatly. The relevant exchange between Mr Ibrahim and Dr Ganesan was as follows:46Foot Note 46×ROA Vol 3 Part 5 at pp 1260–1262. Q: Apparently, it is contended that she walked 7.2 kilometres. Do you recall that? A: Yes. Q: What if it was only 3.5 kilometres, interspersed by a break of 1½ hours --- A: Mm-hm. Q: --- with three stops on the first leg and 15 stops on the second leg, using a walking stick. Would that be consistent with someone who is suffering the aftereffects of the recovery from the knee injury? … Q: --- [W]ould you say it’s fair for someone like [the Appellant] who had recovered from patella injury, as well as someone who’s suffering from CRPS? … A: Erm, that’s about more than a year after the fracture. Q: Yes. A: Erm, I would assume the patient could walk as she had walked because the patella fracture had healed. Q: Yes. A: But if the patient has over – overlying [sic] CRPS --- Q: Mm-hmm. A: --- erm, it depends on the degree of the CRPS. Erm, but it’s --- as strictly, if it’s only the patella fracture, which has healed --- Q: Yes. A: --- patients can walk that distance. Q: Yes. [The Appellant] had wasted quadriceps. Correct? A: Yes. … Q:  Does that contribute to knee instability? A: Yes, it will. Q: Thank you. … [Re-examination ended] 89 Nothing that Dr Ganesan said in re-examination contradicts or detracts from the evidence which he gave earlier in cross-examination that he was surprised to see from the still footages that the Appellant was able to manage the walks which she took at Pasir Ris Park on 22 and 29 July 2012 as this was inconsistent with what she had told him when he examined her. Even though the distance which the Appellant walked matters to some extent (ie, whether it was 3.5km or more than twice that distance, 7.2km), this does not – and there is nothing in Dr Ganesan’s evidence during re-examination to suggest that it does – change the fact that Dr Ganesan agreed with Mr Appoo that the Appellant’s mobility as captured in the surveillance footage wasinconsistentwith his impression and medical diagnosis of her condition. 90 The surveillance evidence from 2013 onwards (ie, for 18 June 2013, 11 and 12 February 2014) shows the Appellant using a wheelchair instead of a walking stick.Prima facie, this supports the Appellant’s assertion that from 2013 onwards, her condition substantially deteriorated and she became “almost fully reliant on [a] wheelchair”. This is also in line with the evidence of some of the doctors such as Dr Ganesan and Dr Singh that she attended at their clinics in a wheelchair in the period after 2013. 91 But, this does not seem to present the full picture. As pointed out by Mr Appoo, the surveillance evidence from 2013 onwards goes on to show the Appellant “paddling” herself with her feet while sitting on a wheelchair and using her left hand or walking stick to manoeuvre the direction of the wheelchair. Further, there were also times when the Appellant got up from her wheelchair to walk, albeit for short distances and at a slow speed, when it was inconvenient to manoeuvre the wheelchair (eg, when descending from steps). Even though we accept that the Appellant had some difficulty walking as a result of CRPS, the evidence shows that her mobility was not as severely affected as she claims. 92 The Appellant’s claim in respect of the extent of her disability on account of CRPS is also contradicted by another piece of evidence that arose in the course of Dr Ganesan’s cross-examination (see [87] above). Dr Ganesan testified that the Appellant had told him that during her trip to the UK in mid-2011, she was able to use the clutch of a manual car and had driven up to Scotland from London. This contradicts the Appellant’s claim that her CRPS condition is so debilitating that she cannot drive. In response, Mr Ibrahim submits that Dr Ganesan’s account ought not to carry any weight as it is another “memory lapse” on the part of Dr Ganesan, who had wrongly recalled the Appellant’s company, CPL, as being “in the car rally business”.47Foot Note 47×Appellant’s skeletal arguments at p 13, para 27.With respect, this submission is hardly convincing. Dr Ganesan may have been mistaken about the nature of CPL’s business because of a “memory lapse” or for some other reason, but this does not mean that all the evidence which he gave is thus thrown into doubt. Indeed, this is not what the Appellant is arguing either, not least because that would be to her disadvantage as Dr Ganesan is an important witness of hers. We find no reason to doubt Dr Ganesan’s evidence as set out at [87] above, especially given that he had so testified after referring to his contemporaneous medical notes. 93 To be clear, the fact that the Appellant could operate the clutch of a manual car and drive and the fact that she could go for walks do not, by themselves, demonstrate or prove that the Appellant does not have CRPS. What they do show, however, is that the Appellant has exaggerated the severity of the disability caused by her CRPS. This in turn casts her claim in respect of the severity of her CRPS-related disability in a negative light. As we have stated at [84] above, the court must be mindful of the possibility that a CRPS-related disability may be exaggerated. This is because a doctor’s medical evaluation of the extent and severity of a patient’s CRPS appears to be at least partially, if not substantially, dependent on what he is told by the patient (eg, whether the latter reports being unable to walk or work because of pain). What the patient tells the doctor may not, in turn, entirely be the truth. This is well reflected by Dr Ganesan’s surprise when he learnt that the Appellant was able to walk for a substantial distance at Pasir Ris Park as at July 2012. 94 It is conceivable that the Appellant may argue that Dr Ganesan’s evidence ought to be discounted because he does not have the requisite expertise as he is an orthopaedic surgeon and not a pain specialist. However, we do not think that this argument would assist her case. Dr Ganesan was the main doctor who treated the Appellant, and he was privy to the medical diagnoses of the other doctors who examined her. We thus find it appropriate to accord significant weight to his evidence and opinion on the Appellant’s condition. 95 Additionally, we note that during the material period, the Appellant accompanied her husband on several trips abroad, both for work and leisure, and her Twitter posts largely painted a picture of an upbeat person who was living a relatively normal life. In those Twitter posts, the Appellant mentioned going for plays, overseas trips and outings. Moreover, the Appellant also taught courses at MDIS for a period of time in 2012 and 2013 on a part-time basis, although we note that she eventually stopped. She asserts that she had to stop working because of her CRPS. 96 In this regard, we agree with Mr Ibrahim that the Appellant cannot be faulted for trying to continue with life as per normal.48Foot Note 48×Appellant’s Case at para 97.We are also mindful that the above evidence (eg, the Appellant’s posts on social media) may only reflect a part of the Appellant’s life and emotions. As a key plank of his submission in this regard, Mr Ibrahim relies on the following evidence given by Dr Chua when he was cross-examined by Mr Appoo:49Foot Note 49×Appellant’s Case at para 79; ROA Vol 3 Part 5 at pp 1294–1295. [Mr Appoo]: I’m asking whether if --- whether what she did in her own life – what she did with her free time, where she went … the activities she was engaged in –-- whether that would give you some insight into whether or not her complaints were to be taken at face value. In other words, whether that would shed some light as to whether her complaints of constant pain which were severe enough to be sensitive to touch; whether those sort of complaints were consistent with what was happening --- or in her life. A: No. Erm, in my ---in my years of training as a doctor, I don’t use what the patient does socially to make--- to help make a diagnosis of how severe or how bad her condition is. I know what you’re getting at but I don’t use that. So, even if I --- even if I see [the Appellant] on the street today, erm,unless I see her dancing on the street with her--- with her left leg[ie, the leg which was injured in the Accident]---balancing only on her left leg, I … would otherwise be very hesitant to even use that to determine whether her --- her symptoms were genuine or not. [emphasis added] 97 We are of the view, however, that Dr Chua’s evidence as set out above is not of much assistance to the Appellant’s case. A few lines down from the exchange set out above, Dr Chua conceded that in seeking to understand the extent to which the Appellant’s CRPS affected her, he had taken into account her assertions that she was unable to go for car rallies and work as well as before.50Foot Note 50×ROA Vol 3 Part 5 at p 107.He even went on to state that if his attention had been drawn to the fact that the Appellant was “attending plays, concerts, going out for walks [etc]” during the period when she attended at his clinic, he “would have put her in a category … that would prognosticate … a good recovery because [she was] coping well”.51Foot Note 51×ROA Vol 3 Part 5 at p 108.He later explained in re-examination that “prognosticate” meant “how well the outcome for the patient would be”.52Foot Note 52×ROA Vol 3 Part 5 at p 110.In its entirety, Dr Chua’s evidence does not deviate from our conclusion that the medical opinion on the Appellant’s CRPS would likely have been different and been less pessimistic if the doctors who examined the Appellant had been made aware of the activities that she was in fact capable of carrying out. 98 In summary, we do not doubt that the Appellant has CRPS, or that she is at least suffering some pain which has affected her quality of life. However, the collective evidence in this case shows that the Appellant has exaggerated her condition, and that it does not have such a serious debilitating effect on her life as she claims.",
        "The Appellant’s heads of claim": "99 With the above in mind, we move on to discuss the respective heads of claim set out in the table at [37] above. Pain and suffering and loss of amenities arising from CRPS 100 We will deal with the claims for pain and suffering and loss of amenities arising from CRPS together as they are inextricably linked. The Appellant claims a total of $215,000 for these two items, specifically, a sum of $65,000 for pain and suffering for CRPS and fibromyalgia and a sum of $150,000 for loss of amenities. The Appellant’s claim in this regard must be assessed in the light of our finding at [80] above that she does not in fact suffer from fibromyalgia. 101 In our view, the Judge should have made an award for these two heads of claim. As we have noted above, we accept the Appellant’s assertion that her quality of life has been and continues to be affected to some extent by CRPS. Moreover, there is, in our view, a case for awarding the Appellant damages for loss of amenities because she was an avid motor car racer prior to the Accident. As mentioned earlier, the Appellant is the only woman to have completed the 15,000km car rally from Peking to Paris (see [5] above). The evidence also shows that right up to the point of the Accident, the Appellant had consistently renewed her membership of various motor car racing clubs, and she was, at the time of the Accident, inquiring about an upcoming motorsports competition. It does not appear that the Appellant has participated in any motorsports competitions or renewed her membership of motor car racing clubs since the Accident. It is probably the case that she can no longer participate in such competitions as she might not pass the requisite medical tests and assessments in the light of her CRPS. 102 There are not many local precedents where our courts have dealt with the issue of awarding damages in respect of CRPS, but there are at least two such cases: (a)Mei YueLan Margaret v Raffles City (Pte) Ltd[2005] 4 SLR(R) 740 (“Margaret Mei”), a decision of the High Court; and (b)KhekChing Ching v SBS Transit Ltd[2010] SGDC 220 (“KhekChing Ching”), a decision of the District Court. 103 InMargaret Mei, the plaintiff was injured when a metal sheet attached to the bottom of a toilet door in the defendant’s building fell onto and cut her left leg. She suffered Reflex Sympathetic Dystrophy (the term used at that time for Type I CRPS) and Post-Traumatic Stress Disorder. We note that at least in terms of the physical injuries suffered,Margaret Meiis a more serious case than the present. Woo Bih Li J upheld the assistant registrar’s award of an aggregate sum of $100,000 for pain and suffering, both physical and mental, as well as for loss of amenities (seeMargaret Meiat [60]). It is not clear how much the judge awarded for the plaintiff’s Reflex Sympathetic Dystrophy specifically as the global sum of damages also included compensation for scarring, osteoporosis and other conditions. 104 InKhekChing Ching, Leslie Chew DJ awarded the plaintiff $30,000 for CRPS. The plaintiff inKhekChing Chingwas on board a bus when the driver jammed hard on the brakes, causing her to be thrown forward and off her seat. As a result, she sustained injuries to her wrists and legs. Although these were minor injuries, the plaintiff was subsequently found to suffer from CRPS. 105 TheGuidelines for the Assessment of General Damages in Personal Injury Cases(Academy Publishing, 2010) (“Guidelinesfor the Assessment of General Damages”) co-published by the then Subordinate Courts sets out the range of damages that may be awarded for pain and suffering in respect of CRPS as follows (at pp 29–30): (a) damages of between $25,000 and $50,000 if the condition is severe; (b) damages of between $12,000 and $25,000 if the condition is moderate; and (c) damages of between $5,000 and $12,000 if the condition is mild. 106 We now turn to look at the awards given for CRPS in the foreign cases cited by the Appellant.53Foot Note 53×Appellant’s Case at p 29, para 69.The amounts awarded in these cases ranged from $30,000 to $40,000. 107 In the District Court of Western Australia’s decision inBlight vWagin(Civ 7714 of 1993) (“Blight”), the court awarded the plaintiff A$35,000 for pain and suffering and loss of amenities in relation to her CRPS. The plaintiff inBlighthad been bitten on the leg by the defendant’s dog. As a result of the bite, the wound on her leg became infected and healed only after seven weeks. Her condition was, however, complicated by mild to moderate CRPS, which the court found to be permanent even though there was a possibility that her condition would improve.54Foot Note 54×Appellant’s Bundle of Authorities vol 1 at pp 58-59.Although the court accepted that the plaintiff had CRPS, it held that she had significantly exaggerated the extent of her symptoms. The court considered an award of A$35,000 to be appropriate in respect of the plaintiff’s CRPS.55Foot Note 55×Appellant’s Bundle of Authorities vol 1 at p 62. 108 The second case cited by the Appellant isAlexander StewartDarg v Commssioner for Police for the Metropolis and Venson Public Sector Ltd[2009] EWHC 684, in which the English High Court awarded the plaintiff £32,500 for pain and suffering and loss of amenities arising from CRPS (at [136]). The plaintiff in that case sustained lacerations to his fingers while working as a mobile vehicle technician. He thereafter developed CRPS, which he alleged prevented him from working and leading a normal life, and he consequently required the assistance of his wife in many ordinary daily activities. The court found that the plaintiff had exaggerated the extent of his disability “by putting forward [the] worst moments [of the condition] as its norm” (at [112]), and held that his CRPS was not as debilitating as he claimed even though it did cause him “not inconsiderable discomfort”. 109 Lastly, we turn to the Scottish Court of Session case ofDavid Kerr vStiell Facilities Ltd[2009] CSOH 67. The plaintiff in that case, an electrician, suffered a minor accident, which eventually led to his developing CRPS. The court found that the plaintiff suffered from a “very significant pain disorder” (at [96]), and held that an award of £40,000 was appropriate as solatium for his CRPS. 110 Having considered the above authorities and the Appellant’s CRPS, which we consider to be of a moderate level, we are of the view that an award of $30,000 should be granted to the Appellant for the pain and suffering and loss of amenities which she has suffered as a result of her CRPS. Pain and suffering for physical injuries 111 We move on to the damages that should be awarded to the Appellant for pain and suffering in relation to the physical injuries that she sustained as a result of the Accident. 112 Before the Judge, the Appellant claimed $55,500 for pain and suffering in respect of the fracture of her left patella, the abrasions to her left knee and her strained left ankle, as well as a further $50,000 for her back injury, which she asserts was caused by the Accident (see the Judgment at [4]). The Judge awarded her $12,000 for the injuries to her left knee and left ankle, but dismissed her claim relating to pain and suffering for her back injury as he found no evidence that the Accident had caused her that injury (at [27] of the Judgment). 113 On appeal, the Appellant continues to claim damages for pain and suffering in respect of the injuries to her left knee, her left ankle and her back, although it appears that her claim for her knee and ankle injuries is now for a slightly lower sum of $50,000 (as opposed to $55,500 in the court below).56Foot Note 56×Appellant’s Case at para 62.The Respondent argues that the Judge was correct in dismissing the Appellant’s claim in respect of her back injury, and that his award of $12,000 for the remaining physical injuries, which overlapped, is consistent with the authorities.57Foot Note 57×Respondent’s Case at para 47. (1) The back injury 114 The Appellant argues that the Judge misapprehended the evidence in finding that her back injury was not caused by the Accident. According to the Appellant, the following pieces of evidence are proof of the causal link between the two: (a) the fact that she felt pain in her back onlyafterthe Accident; and (b) Dr Ganesan’s “agreement” in his medical report dated 27 September 2011 that the back injury was caused by the Accident. 115 We do not agree with the Appellant’s contention. First, it does not necessarily follow from the fact that the Appellant felt pain in her back only after the Accident that her back pain or back injury wascausedby the Accident. As pointed out by the Respondent, the Appellant’s back injury could, for instance, have been the result of a degenerative disease that pre-existed the Accident.58Foot Note 58×Respondent’s Case at para 56. 116 Second, contrary to the Appellant’s submission, Dr Ganesan did not state or “agree” in his medical report dated 27 September 2011 that the Appellant’s back injury was caused by the Accident. All that Dr Ganesan did was to reiterate a physiotherapist’s opinion on the issue without expressing any views or making any diagnosis. The exact words which he used were as follows: “[t]he physiotherapist noted that she had injured her back during the initial injury and proceeded to treat her accordingly with some improvement of pain”.59Foot Note 59×Appellant’s Core Bundle (Vol 2) at p 129.In cross-examination, Dr Ganesan was unable to identify the physiotherapist who had noted the alleged injury to the Appellant’s back, but told the court that a physiotherapist was not qualified or permitted to diagnose such an injury unless he had witnessed the Accident.60Foot Note 60×Respondent’s Supplementary Core Bundle at p 37.Further, in the other medical reports which he prepared, Dr Ganesan did not mention that the Appellant suffered a back injury as a result of the Accident. Instead, he testified in court that his examination of the Appellant on the day of the Accident did not show any sign of trauma or injury to her lumbar.61Foot Note 61×Respondent’s Case at para 58. 117 Looking at the evidence in its totality, we agree with the Judge that the Appellant has not sufficiently proved that her back injury was caused by the Accident. We thus uphold the Judge’s decision to dismiss her claim in respect of this injury. (2) The fractured left patella, the abrasions to the left knee and the strained left ankle 118 The fractured left patella suffered by the Appellant is the most serious out of the remaining physical injuries, which have all healed. The abrasions to the Appellant’s left knee and her strained left ankle are, in contrast, relatively minor injuries. 119 The following table sets out cases where the court awarded damages in relation to injuries sustained to the patella (seePersonal Injury: Quantum, Cases and Materials (Singapore Edition)(Roshini Wijaya & Sivaguru Paramasivam legal eds) (Lexis Nexis, 2014)):62Foot Note 62×Pages 5, 33 and 268 ofPersonal Injury. S/NCaseDescription of the injury to the patellaQuantum awarded for pain and suffering1Leo Cheng Kwang v Shaw Lucy Shandha (administratrix of the estate of Shaw Graeme John, deceased) & anor(Suit No 91 of 1991, High Court)Fracture of left patella, with osteoarthritis and scars$12,0002Jamal Abdul Nasir bin Mohamed Kasbi v Lim Siew Huay(DC Suit No 5550 of 1999, District Court)Fractured patella with posterior cruciate ligament laxity$12,0003Hasan bin Ismail v Singapore Bus Service (1978) Ltd(DC Suit No 4926 of 1997, District Court)Fracture to the patella of both left and right knees$24,000 120 The range of damages set out inGuidelines for the Assessment of General Damagesfor knee injuries is as follows (at p 50): (a) damages of between $25,000 and $63,000 for severe knee fracture combined with joint disruption and ligamentous damage where there is significant loss of the knee function, resulting in an inability to work normally without feeling considerable pain, and where there is a risk of osteoarthritis; (b) damages of between $15,000 and $25,000 for a leg fracture extending to the knee joint which results in a significant restriction of movement and considerable pain even after recovery, and where the condition is unlikely to improve further; (c) damages of between $10,000 and $15,000 where the injury sustained is less severe but there are still significant disabilities that affect the person’s chances of employment, and where there is a risk that degenerative changes may occur in the long run; (d) damages in the region of $10,000 for moderate knee injuries, such as dislocation, a torn cartilage or meniscus or partial tears of ligaments; and (e) damages of between $1,500 and $5,000 for minor knee injuries, which include lacerations of the knee as well as twisting and straining of knee ligaments. In our view, the primary injury to the Appellant’s left knee (ie, a fractured patella, which has since healed) would fall somewhere between the categories in sub-paras (b) and (c) above. 121 After considering the precedents cited at [119] above and the suggested range of damages set out inGuidelines for the Assessment of General Damagesfor knee injuries, we are of the view that $15,000 is an appropriate award for the fracture of the Appellant’s left patella. In coming to this decision, we have taken into account inflation as the precedents cited at [119] above, which were decided more than 17 years ago, are dated. We would additionally award the Appellant a further sum of $1,000 for her strained left ankle and the abrasions to her left knee. 122 We will thus vary the Judge’s award in this regard and award a total of $16,000 for pain and suffering in relation to the knee and ankle injuries that the Appellant sustained. Pre-trial medical expenses, pre-trial costs of medical equipment and pre-trial transportation costs 123 We turn next to the Appellant’s claim for: (a) pre-trial medical expenses; (b) pre-trial costs of medical equipment; and (c) pre-trial transportation costs. The Judge awarded the Appellant $4,374.55 for pre-trial medical expenses and $1,635.68 for pre-trial transportation costs. He did not make any award for the pre-trial costs that the Appellant incurred in purchasing medical equipment. 124 The Respondent does not deny that the Appellant incurred expenses on medical equipment, but takes issue with the relatively minor fact that she purchased multiple walking sticks. Although we are aware that the Appellant purchased more than one walking stick, we are of the view that the overall figure of $1,360.43 which she claims for the purchase of medical equipment (such as a wheelchair, walking sticks and a TENS machine) is reasonable. These purchases are also evidenced by the relevant receipts. We thus reverse the Judge’s decision in this regard and award the Appellant the sum of $1,360.43 which she seeks for the pre-trial costs of medical equipment. 125 As for the Appellant’s claim for the pre-trial medical expenses which she incurred in Singapore, Mr Appoo submits that no award should be made because the expenses were borne by Balanced Engineering, her husband’s employer. We are unable to accept this submission. Clause 16 of Mr Mykytowych’s employment contract at the relevant time merely stated that Balanced Engineering “shall provide hospitalisation and surgical insurance only” for Mr Mykytowych himself and his wife. This, by itself, does not prove or show that the company would or did indeed bear all the pre-trial medical expenses incurred by the Appellant in Singapore as a result of the Accident. We will thus award the Appellant a sum of $14,430.67 for pre-trial medical expenses, this being the amount that has been accounted for by the receipts which she has produced (as opposed to the sum which she claims,ie, $15,629.35). 126 The Appellant claims a total of $5,628.86 for pre-trial transport expenses. We agree with the Judge that some of these expenses (eg, parking and petrol costs) should not be awarded because Mr Mykytowych could have claimed them from his company as he was driving a car which it provided. However, we are of the view that a sum should be allowed for taxi expenses in respect of which the Appellant has produced supporting receipts. This amounts to a slightly higher figure than that awarded by the Judge – $1,947.16, instead of the $1,635.68 that was awarded in the court below. We will thus increase the award to $1,947.16 for this head of claim. Difference in costs of air tickets 127  The Appellant further claims the difference in the costs of flying business class as opposed to economy class for both herself and her husband, which amounts to a total of $8,945.60. She asserts that she had to fly business class for her trip from Singapore to the UK in July 2011 because she was suffering from DVT (see [13] above). It would appear that her concern then was that sitting motionless for an extended period of time on the flight to the UK might worsen her condition or increase her risk of DVT. The Judge declined to award the Appellant any sum for this item on the basis that she had not been clinically diagnosed with DVT (see [27] of the Judgment). 128 In our view, the Judge was correct in finding that there was no proper medical evidence to prove that the Appellant suffered from DVT and thus needed to take a business class flight. But, we note that Dr Ganesan did have some suspicion that the Appellant might have DVT when she reported that she had swelling and pain in her left calf, and he even prescribed anti-thrombotics for her to take for her trip to the UK. Although Dr Ganesan subsequently recorded that the Appellant was not suffering from DVT when the symptoms subsided, this wasafterher trip to the UK. We thus accept that there was reason for the Appellant to have thought that she was suffering from DVT when she was planning her trip to the UK in mid-2011. 129 The next question that arises is whether it was necessary or reasonable for the Appellant to have booked business class air tickets as opposed to economy class air tickets for that trip because she thought she had DVT. In this regard, we accept the Respondent’s submission that the only medical staff who advised the Appellant to fly business class was Mr Hairodin, a physiotherapist from TTSH, who did not have the authority or competence to make a diagnosis of DVT. Notwithstanding this, we do not think it was unreasonable for the Appellant to have heeded Mr Hairodin’s advice as there was nothing to indicate that she knew that he was speaking without authority, and especially given that Dr Ganesan, who was the doctor looking after her at that time, had (as noted in the previous paragraph) prescribed anti-thrombotics for her to take for her trip to the UK. We are thus inclined to award the Appellant the difference in the costs of flying business class as opposed to economy class for that trip. There is, however, no compelling reason why the Respondent must bear the price difference forher husband’sair tickets as well. Accordingly, we will award the Appellant only $4,472.80 (ie, half of the amount that she claims) for this head of claim. Costs of home renovations 130 The Appellant claims a sum of $359.20 as the costs of renovating the apartment which was rented by Balanced Engineering for her husband and her to live in after they stopped staying at the Respondent on 24 May 2011 (see [11] above). These renovations were allegedly carried out in order to make the apartment more accessible to the Appellant in view of her medical condition. 131 Although it is conceivable that the Appellant might have had to make some renovations to the apartment, there are no receipts or documents to show that the apartment was in fact renovated. We thus uphold the Judge’s decision not to make any award for this item as the claim has not been proved. Pre-trial loss of earnings 132 We move on to the Appellant’s claim for pre-trial loss of earnings. 133 The Appellant asserts that she suffered pre-trial loss of earnings amounting to £323,406.22 because: (a) she could not return to the UK to work for CPL and had to remain in Singapore for medical treatment due to her CRPS (and, according to her, fibromyalgia); and (b) she had difficulty finding gainful employment in Singapore. The Appellant says that she tried to mitigate her loss by applying for a part-time job as a social worker, but did not receive any reply to her application; and when she subsequently applied to IKEA to work as a cashier, the human resource manager declined to even interview her upon noting that she had a disability. She found this “an extremely upsetting and humiliating experience”, and thus decided thereafter not to look for further jobs to avoid subjecting herself to future similar experiences. She further asserts that although she taught at MDIS on a part-time basis in 2012 and 2013, she was unable to continue because of her medical condition. 134 We are not persuaded by the Appellant’s arguments in relation to her claim for pre-trial loss of earnings. In particular, we find her assertion that she could not return to the UK because she had to stay in Singapore for medical treatment to be untenable. We are unable to see why the Appellant could not have returned to the UK to seek treatment if she and her husband had wished or intended to do so. There is no reason to doubt that the UK’s National Health Service would be well-equipped to deal with CRPS. As we see it, her medical condition probably had nothing to do with her continued stay in Singapore. Instead, her continued stay had all to do with her husband’s work commitments in Singapore – not forgetting that this was the reason why the couple had moved to Singapore in the first place. Their move to Singapore was not a short-term one. This is evident from the fact that they did not obtain return air tickets before leaving London for Asia in 2011. The fact that the Appellant and her husband were able to return to the UK in September 2014 (and move to Taiwan in September 2013) when they chose to do so militates against her claim that she had to stay in Singapore because of medical treatment. 135 Further, as we have found at [84]–[98] above, the Appellant’s CRPS is not so debilitating as to render her completely unable to undertake any form of work. The jobs that the Appellant has undertaken have all been sedentary in nature (eg, as the managing director of CPL and as a lecturer at MDIS), as opposed to blue-collar jobs that require physical labour. In our view, the Appellant is still able to perform the former type of jobs. The Appellant’s assertion that she was unable to find even a part-time job as a cashier at IKEA is not supported by any documentary evidence (eg, job application forms or letters) and thus cannot be given much weight. This assertion is also contradicted by the fact that she managed to secure a job as a lecturer at MDIS in mid-2012, which would probably have involved her standing to teach, and was paid a total of $5,130 for teaching three part-time courses a month. The Appellant explained that she was unable to continue working as a lecturer at MDIS in early 2013 because she found it difficult to balance work and her physiotherapy sessions, and could not concentrate at work due to the pain that she experienced from time to time. But, this does not seem to be consistent with the evidence, which, as we have found, shows that the Appellant’s CRPS was not (and currently is not) so severe that she was unable to undertake any form of work. 136 The Appellant has also not sufficiently proved that she had the intention to work in Singapore (or, for that matter, in India or Taiwan) when she decided to move to Asia with her husband. It is equally possible (although we are not making such a finding) that she never intended to work full-time (or even part-time on a regular basis) whilst accompanying her husband in Singapore (and other parts of Asia). On a related note, we also accept the Judge’s finding that the Appellant had decided to leave CPL’s business aside for at least a period of time when she opted to accompany her husband to Asia in April 2011. In the result, we are unable to award the Appellant any damages for pre-trial loss of earnings as she has not proved this head of claim. Loss of future earnings 137 Our observations above apply with equal force to the Appellant’s claim for loss of future earnings, which is premised on her submission that she will not be able to work in future because of her CRPS. It follows that her claim for loss of future earnings, like her claim for pre-trial loss of earnings, should be rejected. 138 We should also point out that while we have held that the Old School Surgery Statement and the Jobcentreplus Letters should not be admitted as further evidence for the purposes of this appeal as the conditions inLadd v Marshallhave not been satisfied (see [72] above), these documents would not, in any event, have taken the Appellant’s case on her inability to work much further. The finding that we are asked to make from these documents –ie, that the Appellant cannot work because of CRPS – does not square with the evidence. Moreover, we are not privy to the manner in which the Old School Surgery and Jobcentreplus reached their respective decisions as to the Appellant’s inability to work because this point was neither addressed in the Appellant’s supporting affidavit for SUM 279/2015 nor in the written and oral submissions made on her behalf. Loss of future earning capacity 139 We are of the view, however, that it is appropriate to award the Appellant a sum for loss of future earning capacity as we accept that even though she has the ability to work, she would face some difficulties if she chooses to return to work in future as her CRPS has resulted in some permanent disabilities, albeit not to such a serious extent as she claims. Although the Appellant was unemployed at the time of the assessment of damages hearing and likewise at the time this appeal was heard, this does not bar us from granting an award for loss of future earning capacity (see Williams Norris QCet al,Kemp & Kemp: The Quantum of Damages (Volume1)(Sweet & Maxwell, 2016) at para 10.026.1,Ng Chee Wee v Tan Ching Seng[2013] SGHC 54 at [68], citingA and others v The National Blood Authority and others[2001] 3 All ER 289 (“The National Blood Authority”), andCook v Consolidated Fisheries Ltd[1977] ICR 635). Where the plaintiff is unemployed at the time of the assessment of damages hearing, the test to be applied in determining whether to make any award for loss of future earning capacity is whether there is a real risk that the plaintiff will be at a disadvantage in the open employment market because of the injury sustained in the accident. This stands in contrast to the two-stage approach adopted in cases involving a plaintiff who is employed at the time damages are assessed, where the court would first ascertain the likelihood of the plaintiff losing his current employment before considering the extent of his economic handicap in the open employment market. 140 As emphasised by this court inTeo Sing Keng vSim Ban Kiat[1994] 1 SLR(R) 340 and, more recently,Chai Kang Wei Samuel v Shaw LindaGillian[2010] 3 SLR 587 (“Chai KangWei”) andLee Wei Kong (by his litigation representative Lee Swee Chit) v Ng Siok Tong[2012] 2 SLR 85, awards for loss of future earnings and awards for loss of future earning capacity are distinct types of awards. An award for loss of future earning capacity is not an alternative award that is made when a plaintiff lacks sufficient evidence to prove his loss of future earnings (seeChai Kang Weiat [17]–[22]). Instead, these two types of awards are meant to compensate for different kinds of loss. An award for loss of future earning capacity is given as part ofgeneraldamages in order to compensate a plaintiff for the weakening of his competitive position in the open labour market (seeSmith v Manchester Corporation[1974] 17 KIR 1 (“Smith”) at 8), whereas an award for loss of future earnings is a form ofspecialdamages awarded for real assessable loss proved by evidence (seeFairley v John Thompson (Design & Contracting Division) Ltd[1973] 2 Lloyd’s Rep 40 at 42). Whether the court will: (a) grant both types of awards; (b) grant an award for loss of future earning capacity while refusing to grant an award for loss of future earnings; or (c)vice versais dependent on and determined by the evidence before the court (seeChai Kang Weiat [21]). 141 In making awards for loss of future earning capacity, it is not appropriate to use any of the formulas commonly employed to calculate awards for loss of future earnings, such as the multiplicand and multiplier method (seeChai Kang Weiat [15], citingMoelikerv A Reyrolle and Co Ltd[1977] 1 All ER 9 (“Moeliker”)). Instead, the court should award a global sum after taking into account all the factors which are relevant to the particular case at hand,eg, the plaintiff’s age, his skills, the nature of his disability, whether he is capable of undertaking only one type of work or whether he is capable of undertaking other types of work as well (seeMoelikerat 141–142). As Judith Prakash J observed inClark Jonathan Michael v LeeKhee Chung[2010] 1 SLR 209 (“Clark Jonathan Michael”) at [91], an assessment of damages for loss of future earning capacity can be an exercise in speculation as the court often does not know the extent to which a plaintiff will be disadvantaged in the open employment market by his disabilities if he has to seek a new position. The court must take a “rough and ready” approach (seeClark Jonathan Michaelat [91]) and calculate the loss of earning capacity “in the round” (seeSmithat 8), ultimately arriving at a figure that it considers reasonable in the particular circumstances to compensate the particular plaintiff for the disadvantage which he faces in the open employment market due to his disabilities (see alsoThe National BloodAuthorityat [58]). 142 In the present case, the evidence shows that the Appellant, despite her CRPS, still has the ability to work; she also has the requisite qualifications and skills to gain employment in other fields comparable to her pre-existing job in CPL, where she provided consultancy services to the healthcare and social services sectors (eg, as a MDIS lecturer). Having said that, we accept that the Appellant may not be able to work at the same intensity or level as before due to the bouts of pain and discomfort that she may suffer as a result of her CRPS. This, in our view, would have the effect of disadvantaging her and weakening her competitive position in the open employment market, although not to the exaggerated extent submitted by her counsel. Considering the evidence, including the Appellant’s age, in totality, we consider it appropriate to award the Appellant a conservative sum of $25,000 for loss of future earning capacity. Loss of a chance to sell CPL at a greater value 143 We turn next to the Appellant’s claim for a sum of £312,305 for the loss of a chance to profit from the sale of CPL when she reaches the age of 70. This claim is, in our view, highly speculative. For this claim to be made out, the Appellant must prove that if not for the Accident, she would have continued working in CPL for the next two-odd decades, and would have succeeded in bringing CPL to greater heights such that it would be worth a lot more by the time she is 70 years old. From the evidence before us, there is hardly any real basis to make such a finding. 144 It also follows from our finding that the Appellant’s CRPS is not as severe as she claims it to be that she should be able to continue managing CPL if she wants to, especially given that she is now back in the UK. The Appellant’s claim for the loss of a chance to sell CPL for profit is also weakened by the evidence which suggests that, more likely than not, she had decided to cease working in CPL or, at the very least, take a hiatus (for an uncertain period of time) from her work in CPL when she moved to Asia with her husband in early 2011. 145 As a whole, we find the Appellant’s claim that she has lost the opportunity to sell CPL at a greater value when she turns 70 years old to be extremely speculative, and we accordingly refuse to make any award for this head of claim. Loss of earnings of the Appellant’s husband 146 The Appellant further claims a sum of £21,600 for her husband’s loss of earnings as she asserts that her husband had to stop work to take care of her because of her CRPS. 147 We find the Appellant’s assertion in this regard to be wholly unsupported by the evidence and inherently suspect. This is because the Appellant’s husband stopped work only in September 2014, several years after the Accident and after the Appellant was diagnosed with CRPS. Moreover, the point in time when the Appellant’s husband stopped work coincided with the point in time when he and the Appellant returned to the UK, and this coheres more with the Respondent’s account of the true motivation of the Appellant’s husband in stopping work. As such, we hold that the Appellant cannot claim for her husband’s loss of earnings – there is a clear lack of evidence showing a nexus between his stopping work and the need to care for the Appellant because of her CRPS. Future costs of employing a domestic helper 148 We move on to the Appellant’s claim for the future costs of employing a domestic helper to assist her with her daily activities in the UK. 149 The Appellant claims that she needs a domestic helper because she requires constant help and needs assistance even with simple tasks in her daily life (eg, bathing and wearing her clothes). She estimates that the costs of hiring a domestic helper for the next 18 years would be about £622,080 (12 hours a day at an hourly rate of £10 for 24 days a month). 150 As we have found above, the Appellant’s condition is not as debilitating as she makes it out to be. The objective evidence and the medical reports do not square with her assertion that she cannot take care of herself and needs to rely on the assistance of another person. There is thus no basis for us to award the Appellant the £622,080 that she claims for employing afull-timedomestic helper. We do, however, accept that the Appellant may requireoccasionalhelp with household chores as her mobility is limited to some extent. As a rough estimate, we consider that the assistance of a domestic helper for about eight hours per month to help her with the basic household chores for the next ten years should suffice. Using the hourly rate of £10 submitted by the Appellant, this would work out to around £960 or S$1,920 (using an exchange rate of S$2 to £1) per year. In the circumstances, we consider it appropriate to award the Appellant a sum of $20,000 to meet the costs that she would have to incur in employing a domestic helper for at least the next ten years. Future medical expenses 151 We turn to the final head of claim pursued by the Appellant, namely, future medical expenses. The Appellant claims a total of $746,622 for this item. Relying solely on Dr Lee’s opinion, she claims that she will incur the following amounts in medical expenses in future (using 18 years as the multiplier):63Foot Note 63×ROA vol 4 p 47; Appellant’s closing submissions at p 82, para 154. (a) $72,000 for radiofrequency ablation lumbar sympathectomy (once every two years for the next 18 years, with each session estimated to cost $8,000), which would help to treat the automatic dysfunction resulting from CRPS; (b) $45,000 for spinal cord stimulation surgery, which may be needed “[i]n selected refractory cases” with “increasing disability and unresolved chronic CRPS”; (c) $331,380 for medication such as anti-convulsants, anti-depressants and strong analgesics, which may aid in muscle relaxation and reduce muscle spasms (estimated at $1,500 every month for the next 18 years); (d) $187,782 for regular reviews sessions, twice a month for the next 18 years, with a multi-disciplinary team comprising an orthopaedic, a pain specialist and a rehabilitative physician (estimated to cost $425 per session); and (e) $110,460 for rehabilitative programmes which would help to improve “neck muscle tone and strength” (on the basis that the Appellant will sign up for five sessions every year, each costing $1,200, for the next 18 years). 152 Although we recognise that the Appellant may need some basic medical treatment and/or medication for her CRPS in future, we are not satisfied that the Appellant has proved her claim for future medical expenses. Apart from Dr Lee’s evidence, the Appellant has not provided any other evidence that would assist us in deciding the appropriate quantum to award for this head of claim. We decline to place much weight on Dr Lee’s evidence on this issue for a number of reasons. First, his recommendations are not corroborated or supported by the other doctors who examined the Appellant (including the doctors who treated her). Second, Dr Lee came to the conclusion that the treatments and medications listed at [151] above would be needed after examining the Appellant on onlyoneoccasion for the purpose of this litigation (see [22] above). Third, even Dr Lee does not go so far as to state that the Appellant would require all the treatments and medications that he has recommended. On the contrary, his views appear to be tentative and generic in nature. For instance, he merely stated that spinal cord stimulation surgery might be necessary “[i]nselectedrefractory cases” [emphasis added], but did not go on to state the chances of the Appellant requiring this form of surgery or any of the other recommended treatments. 153 The almost complete lack of evidence on the medical treatments that the Appellant has received and/or the medications that she has taken since leaving Singapore for Taiwan in September 2013 is also unsatisfactory and detrimental to her claim for future medical expenses. All that is in evidence is seven receipts for her consultation sessions in Taiwan from October 2013 to February 2014, with barely any details. In particular, the Appellant has not provided any evidence that would allow us to assess the medical fees that she would have to pay in the UK, which is where the future medical expenses would be incurred. The Appellant returned to the UK in September 2014, which was at least four full months before the assessment of damages hearing and more than a year before the appeal hearing before us. The Appellant has had more than sufficient time to collect and tender evidence on the medical treatments that she has had to undergo in the UK and the medications that she has had to purchase for her CRPS. But, she has not tendered even a shred of evidence in this regard, and merely continues to rely on the tentative evidence of Dr Lee to claim a large sum of $746,622 for future medical expenses. 154 Further, it is not clear whether the Appellant is entitled to subsidised or even free medical treatment under the UK’s National Health Service. The letter from the Department for Work and Pensions dated 11 November 2014 which the Appellant is relying on as proof that she does not receive any medical subsidy in the UK merely states that she does not qualify for the “Personal Independence Payment”, which we understand to be payouts that may be given to applicants aged between 16 to 64 who have long-term ill-health or disability so as to assist them with theextramedical costs that may consequently be incurred.64Foot Note 64×Appellant’s closing submissions at para 152.The letter does not tell us whether the National Health Service would bear or subsidise the Appellant’s medical costs. 155 Given the evidence (or rather, the lack of it) before us and the manner in which the Appellant has argued her claim for future medical expenses, we are unable to award her any sum for this item as she has failed to discharge the burden that she bears as the plaintiff to prove this head of claim.",
        "Conclusion": "156 In conclusion, we allow the Appellant’s appeal in part as we have adjusted the quantum of the awards given by the Judge as well as made awards for certain heads of claim which he rejected. We set out in the table below the differences between the awards made by this court and those made by the Judge: NoHead of claimAmount awarded by the JudgeAmount awarded on appeal1Pain and suffering arising from CRPS0$30,0002Loss of amenities03Pain and suffering for fracture of knee (left patella), abrasions to left knee and strained left ankle$12,000$16,0004Pain and suffering for back injury005Pre-trial medical expenses$4,374.55$14,430.676Pre-trial costs of medical equipment0$1,360.437Pre-trial transportation costs$1,635.68$1,947.168Difference between business class and economy class air tickets0$4,472.809Costs of home renovations0010Pre-trial loss of earnings0011Loss of future earnings0012Loss of future earning capacity0$25,00013Loss in respect of the inability to profit from the sale of CPL upon turning 700014Future costs of engaging a domestic helper0$20,00015Husband’s loss of income0016Future medical expenses00Total$18,010.23$113,211.06 157 In the light of the agreed apportionment of liability (see [1] and [29] above), the final sum due to the Appellant is $56,605.53 (50% of $113,211.06). 158 The parties are to tender written submissions on the appropriate order on the costs of this appeal within two weeks from the date of release of this judgment. Sundaresh Menon                       Chao Hick TinChief Justice                        Judge of Appeal Salem bin Mohamed Ibrahim, Ismail bin Atan and Lam Zhenjie Jeriel (Salem Ibrahim LLC) for the appellant;Ramesh Appoo and Rajashree Rajan (Just Law LLC) forthe respondent."
    }
}