{
    "case_title": "TNL vTNK and another appeal and another matter",
    "ncitation": "[2017] SGCA 15",
    "coram": "Judith Prakash JA (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 The two appeals before us arise out of the breakdown of a 35-year long marriage in which the parties played traditional roles, the husband being the breadwinner and the wife being the keeper of the hearth and main child-carer. These fundamental facts underlie the main legal question that faces us which is whether, and if so, how, our recent decision inANJ v ANK[2015] 4 SLR 1043 (“ANJ”) should be applied to a marriage such as this.",
        "Background": "2 The husband, TNL (“the Husband”), and the wife, TNK (“the Wife”), were married in November 1978. They are now aged 61 and 57 respectively. Their three children, two sons and a daughter, are all adults. There is some dispute over whether the Wife was employed in the early years of the marriage. However, for all intents and purposes, the Husband supported the family economically and the Wife looked after the household. The Husband used to be an executive director in a company he had helped start (“the Company”), but he had left this position by the time of the hearing of the ancillaries. 3 The Wife commenced divorce proceedings against the Husband in March 2013. The divorce was uncontested and interim judgment was granted on 7 May 2013.  The issues raised at the hearing of the ancillaries before the judicial commissioner (“the Judge”) concerned the division of matrimonial assets, maintenance for the Wife, and costs. 4 The Judge ordered an equal division of the matrimonial assets and that a lump sum maintenance of $171,517 be paid to the Wife by the Husband. The Judge made no order on the costs of the ancillaries but ordered costs of $2,000 for the divorce in favour of the Wife. The Judge’s written grounds of decision are set out inTNK v TNL[2016] SGHCF 7 (“GD”). 5 Both parties have appealed against the Judge’s decision. Civil Appeal No 43 of 2016 (“CA 43”) is the Husband’s appeal while Civil Appeal No 53 of 2016 (“CA 53”) is the Wife’s appeal. The issues in the appeals overlap and basically are the same as those argued before the Judge. The Wife has also taken out Summons No 82 of 2016 (“SUM 82”) to adduce further evidence on appeal.",
        "SUM 82": "6 We deal first with SUM 82. 7 It appeared from the fact that three sets of “new” documents were annexed to her affidavits filed in support of this application that the Wife was seeking the admission of all of them. However, by the time she filed her written submissions, the Wife had decided to seek to adduce only one set of “new” documents,viz, bank statements in respect of the parties’ joint account with OCBC Bank (“the OCBC Joint Account”) for the months of April to June 2013 (“the New Bank Statements”). 8 It is well established that in order to be granted leave to adduce the New Bank Statements, the Wife must satisfy what are commonly known as theLaddv Marshallconditions (seeLadd v Marshall[1954] 1 WLR 1489 (at 1491)): (a) the evidence could not have been obtained with reasonable diligence for use at the trial (“the First Condition”); (b) the evidence must be such that, if given, it would probably have an important influence on the result of the case, though it need not be decisive (“the Second Condition”); and (c) the evidence must be such as is presumably to be believed, or in other words, it must be apparently credible, though it need not be incontrovertible (“the Third Condition”). 9 The Wife contends that the New Bank Statements buttress her position on what happened to the proceeds from the sale of a jointly-owned apartment at a development known as the Interlace (“the Interlace Sale Proceeds”), and that the Husband had failed to account sufficiently for the same. She highlights, in particular, an outgoing transfer of $300,000 reflected in the statement for the month of April 2013 (“the $300,000 Transfer”). There is no doubt that the New Bank Statements satisfy the Third Condition. However, we are of the view that the New Bank Statements do not satisfy the First and Second Conditions. 10 With respect to the First Condition, it is not disputed that the Wife could have obtained the New Bank Statements at any time during the proceedings before the Judge. The Wife submits, however, that the Husband bore the responsibility of adducing the New Bank Statements but chose not to do so. Specifically, the Wife points to an order of court dated 5 August 2014 which required the Husband to provide quarterlystatements in respect of the OCBC Joint Account for the period from July 2011 to July 2014. The Wife also contends that a “large impetus” for her having obtained the New Bank Statements was the Husband’s allegation to the effect that she was the one who had taken the Interlace Sale Proceeds. We find the Wife’s submissions to be quite beside the point. The fact remains that, with reasonable diligence, the Wife could have obtained the New Bank Statements for use below. We would have been prepared to dismiss SUM 82 on this basis alone. 11 There is also the matter of the non-satisfaction of the Second Condition. We consider it significant that the statements in respect of the OCBC Joint Account for the months of March and July 2013 were in evidence before the Judge and are now before us. These show a credit balance of $340,482.37 at the end of March 2013 and one of only $1,675.88 at the start of July 2013. Thus, it was already plain at the hearing below that amounts totaling more than the Interlace Sale Proceeds (which amounted to $331,057.77) had been transferred out of the OCBC Joint Account during the intervening period. The question iswherethese moneys were transferred to. In this regard, the $300,000 Transfer is unhelpfully described as “TRANSFER SA” in the statement for the month of April 2013. In addition to the $300,000 Transfer, the statements for April and June 2013 simply show one large withdrawal made by cash cheque in each of those months. No information regarding the purpose of those two withdrawals can be gained from these entries either. Consequently, the New Bank Statements do not shed any further light on what is already disclosed by the evidence.Afortiori, we do not think that they would have an important influence on the result of the case. 12 In the premises, we dismiss SUM 82 and order that the Wife bear the costs of the application. Given what we have said at [10]–[11] above, it is evident that SUM 82 should never have been brought. We take this opportunity to remind appellants that there will be costs consequences when unmeritorious applications to adduce further evidence on appeal are made. We are mindful that because this is a matrimonial matter, prior to these appeals, the Wife and her legal advisors may have assumed that a more lenient approach would be taken with respect to costs. Therefore we fix the costs at $2,000. However, we emphasise that costs are likely to be fixed at higher levels in future cases.",
        "The appeals proper": "13 We now turn to consider the issues that arise in CA 43 and CA 53. These relate to: (a) division of the matrimonial assets; (b) maintenance for the Wife; and (c) costs of the ancillaries.",
        "Division of the matrimonial assets": "The pool of matrimonial assets 14 We start by looking at the pool of matrimonial assets. In this regard, the asset pool used by the Judge is as follows: Table 1: Asset Pool used by the JudgeS/NoAsset/OwnershipJoint namesHusband’sWife’s1Matrimonial home$2,900,000-2The OCBC Joint Account$11,908-3Two cars-$224,814-4Husband’s insurance policies-$55,522-5Husband’s shares in the Company-$914,894-6Husband’s bank accounts-$98,247-7Husband’s CPF-$221,833-8Wife’s insurance policies--$100,8119Wife’s shares in the Company--$481,60810Wife’s shares--$62211Wife’s bank account (with the daughter)--$1,27612Wife’s CPF--$189,135Total$2,911,908$1,515,310$773,452$5,200,670 15 Most of the items in Table 1 were not disputed before the Judge. Thus, the Judge focused her attention on the following disputed assets: (a) proceeds from the surrender of two of the Wife’s insurance policies (“the Insurance Proceeds”); (b) the Interlace Sale Proceeds; and (c) sums withdrawn from the POSB Bank joint account in the names of the Wife and the couple’s daughter (“the Wife-Daughter Account”) which were used to pay for the daughter’s flat (“the Withdrawn Sums”). While accepting that there was merit in both parties’ contentions about sums the other had taken, the Judge declined to return any of these sums to the asset pool. (1) The Insurance Proceeds 16 The Insurance Proceeds comprise proceeds from the surrender of: (a) an AIA policy on 20 June 2007 for the sum of $43,848.20 (“the AIA Policy”); and (b) a Great Eastern policy on 19 July 2010 for the sum of $34,404.50 (“the GE Policy”). The Judge found that the Wife had retained the Insurance Proceeds without satisfactory explanation. 17 On appeal, the Husband does not appear to be asking for the Insurance Proceeds to be returned to the asset pool. The Wife, on the other hand, highlights that the AIA Policy and the GE Policy were, respectively, surrendered about six and three years before the commencement of divorce proceedings. She points to the Judge’s observation at [34] of the GD that during the course of the marriage, “there seemed little expectation that [the parties] would each hold the other to precise line items and balance sheets” and submits that this applies to the Insurance Proceeds. As opposed to the Interlace Sale Proceeds, the “divisive and definitive factor” according to the Wife is that, in 2007 and 2010, it was “arguably inconceivable that the [moneys] were dissipated in contemplation of divorce proceedings”. 18 In our view, the pertinent question to be answered is: what happened to the Insurance Proceeds? The Judge found the Wife’s explanations on this point unconvincing. Unfortunately, the position is no clearer on appeal as the Wife has not even attempted similar explanations. We note, however, that the Insurance Proceeds are more likely to have been spent than saved. The Wife disclosed the Wife-Daughter Account as the only bank account she had in Singapore. There is no reason to doubt that. It is therefore significant that the passbook records of this account do not show the sums of $43,848.20 or $34,404.50 as having been deposited into the account during the relevant periods. Perhaps the cheques were put into one of the parties’ joint accounts (in particular, the OCBC Joint Account) but, while this is a logical inference since the cheques representing the Insurance Proceeds would have to have been banked into an account bearing the Wife’s name, there is no documentary evidence to support it as no bank statements of the joint accounts for the relevant periods were adduced. 19 Notwithstanding the unsatisfactory state of the evidence, we are of the view that the Insurance Proceeds should not be returned to the asset pool. First, we find merit in the Wife’s submission that the AIA Policy and the GE Policy were surrendered years prior to the commencement of divorce proceedings. Consequently, they are likely to have been amalgamated with other funds and dealt with accordingly in the ordinary course of the family’s life. There is also no evidence that divorce proceedings were even contemplated at those dates and therefore there would have been no reason to dissipate the funds to avoid sharing them on divorce. Second, and as we have already alluded to, it does not appear that the Husband is asking for the Insurance Proceeds to be returned to the asset pool. (2) The Interlace Sale Proceeds 20 The parties’ apartment at the Interlace was sold in January 2013. The Interlace Sale Proceeds amounted to $331,057.77 and were deposited into the OCBC Joint Account on 5 March 2013 by way of two cheques. However, by July 2013, the balance in this account was only $1,675.88. Before the Judge, the Husband contended that the Interlace Sale Proceeds were used for the following expenses: (a) agent’s commission, legal fees and miscellaneous charges; (b) maintenance and expenses of the family and household; (c) $43,000 to buy a car for the younger son; (d) $18,000 to partially repay a car loan; (e) $20,257 to help the younger son purchase a HDB flat; (f) $63,000 as a loan to a friend (who has not repaid the loan); and (g) $60,000 to buy shares in a friend’s name. We note that the Judge also made reference to a sum of $20,000 spent on the older son’s renovation loan and a sum of $200,000 spent on a failed business venture with the younger son. However, it does not appear from the Husband’s affidavit that he was saying that these sums were paid out of the Interlace Sale Proceeds. Indeed, adding these sums to the list of expenses set out above would yield a total figure in excess of the Interlace Sale Proceeds. 21 The Judge noted that, based on the Husband’s records, only item (d) was disbursed in 2013. Items (c) and (e) were disbursed in 2014 which would have been long after the moneys in the OCBC Joint Account had been taken out. As for items (f) and (g), the Husband did not adduce evidence to support those assertions. Overall, the Judge noted that the OCBC Joint Account was a joint account to which both parties had access and that the Interlace Sale Proceeds were not strictly accounted for. 22 On appeal, the Husband submits that the Interlace Sale Proceeds were transferred into bank accounts in his sole name and then used to pay the expenses listed at [20] above. Thus, as a matter of logic, it cannot be the husband’s case that any part of these proceeds were withdrawn by the Wife. The Wife, on the other hand, argues that the onus rests upon the Husband to provide an account of the whereabouts of the Interlace Sale Proceeds. She submits that the account balances of the Husband’s bank accounts do not reflect the Interlace Sale Proceeds. Aside from item (d), there is no evidence corroborating the Husband’s assertions regarding how the Interlace Sale Proceeds were utilised. Moreover, the Husband had failed to fully comply with the court order requiring him to produce quarterly bank statements in respect of the OCBC Joint Account and his own bank accounts. 23 In our judgment, the Interlace Sale Proceeds should be returned to the asset pool. First, apart from items (a) and (d), none of the items have been sufficiently proved by the Husband. The expenditure on items (c) and (e), according to the Husband’s own cheque records, took place after the relevant period. Further, in respect of all the items, there is no evidence to support the Husband’s submission that the Interlace Sale Proceeds were transferred into bank accounts in his sole name first before being used to pay them. As these transfers were to and from him, he must have had the evidence of the same and of the subsequent payments. But he failed to produce it. Indeed, the legal correspondence shows that as far as item (a) was concerned, the agent’s commission and the legal fees were deducted from the proceeds of sale of the Interlace apartment before the net balance was paid to the parties as the Interlace Sale Proceeds and credited to the OCBC Joint Account. There was no reason for the Husband to pay item (a) a second time although, in fairness to him, the Judge may have misinterpreted this aspect of his evidence. Moreover, it is not lost on us that the Husband was working and earning a salary during the time these expenses were paid. As such, it is unlikely that the expenses covered by item (b) would have had to come from the Interlace Sale Proceeds in the first place. 24 Second, and with respect to items (c) to (g), the issue is how the court should deal with substantial sums expended by one spouse during the period: (a) in which divorce proceedings are imminent; or (b) after interim judgment but before the ancillaries are concluded. We are of the view that if, during these periods, and whether by way of gift or otherwise, one spouse expends a substantial sum, this sum must be returned to the asset pool if the other spouse is considered to have at least a putative interest in it and has not agreed, either expressly or impliedly, to the expenditure either before it was incurred or at any subsequent time. Furthermore, this remains the case regardless of whether: (a) the expenditure was a deliberate attempt to dissipate matrimonial assets; or (b) the expenditure was for the benefit of the children or other relatives. The spouse who makes such a payment must be prepared to bear it personally and in full. In the absence of consent, he or she cannot expect the other spouse to share in it. What constitutes a substantial sum is, of course, a question of fact and we do not propose to lay down a hard and fast rule in this regard, except to emphasise that it is not intended to include daily, run-of-the-mill expenses. 25 In the present case, it is clear that the Wife had an actual (and not just putative) interest in the sums expendedvis-à-visitems (c) to (g) if the expenditure came from the Interlace Sale Proceeds since she was a joint owner of the apartment. There is no indication that the Wife had agreed to these payments. Indeed, counsel for the Husband accepted at the hearing before us that it is not disclosed whether the Husband had consulted the Wife before making large payments (which would presumably include items (c) to (g)). 26 Therefore, the Interlace Sale Proceeds should be returned to the asset pool. At this juncture, we deal briefly with two related issues which arise from the parties’ submissions. The first is the Wife’s submission that there had been “some dissipation of assets” in respect of the bank accounts in the Husband’s sole name. The Husband’s response is that he had fallen on hard times. The Wife, however, does not actually propose an alternative figure for the Husband’s bank accounts as reflected in Table 1. The second issue relates to the Husband’s contentions that: (a) the parties’ apartment at the Interlace was purchased with his savings; and (b) the “real profits” from the Interlace Sale Proceeds, after taking account the money he had expended for the purchase, was only $111,149.77. It is not clear what these contentions are intended to go towards. Even if only the Husband’s savings were used to purchase the Interlace apartment, there is no evidence that these savings themselves were not a matrimonial asset. What was recovered from the sale comprised savings accumulated during the marriage plus “profit” and both were equally the subject matter of division. (3) The Withdrawn Sums 27 The Withdrawn Sums involve a total amount of $139,028 withdrawn in two tranches ($32,028 + $107,000) on 5 March 2013 from the Wife-Daughter Account. The Withdrawn Sums were eventually used to pay for the daughter’s flat, where the Wife now resides with the daughter and her family. 28 Before the Judge, the Wife contended that the moneys in the Wife-Daughter Account (and, by implication, the Withdrawn Sums) belonged to herself and the daughter. Her contribution was derived from allowances given to her by her children, which varied between $300 and $500 per month. The Husband contended that the moneys in the Wife-Daughter Account (including the Withdrawn Sums) were accumulated either from his moneys or from the parties’ joint account. According to the daughter, the Withdrawn Sums were herownsavings, and the bulk of the moneys in the Wife-Daughter Account belonged to her. However, the Husband contended that the daughter’s income was insufficient to enable her to save that much money. 29 The Judge accepted this last contention of the Husband and concluded that some proportion of the Withdrawn Sums must have come from money within the matrimonial pool. She also found that, as the Husband was unaware of the Wife-Daughter Account, the Wife had no authority to withdraw the Withdrawn Sums for the purpose of putting them into the Wife-Daughter Account. Therefore, the presumption of advancement did not apply and the court could put the Withdrawn Sums back into the matrimonial pool for division. 30 On appeal, the Husband points to various deposits into the Wife-Daughter Account totaling $202,050 and says that he was the source of these deposits. He also suggests that he had given money in cash to the Wife and that the Wife had helped herself to the funds in their joint accounts. He further argues that the question of authority is to be analysed at the point of withdrawal from the Wife-Daughter Account, and that the “vast majority, if not all”, of the Withdrawn Sums came from the Wife (as opposed to the daughter) and would have formed part of the asset pool. His case is that the Withdrawn Sums were withdrawn “without authority so close in time to the divorce proceedings, with the purpose of dissipating it from the pool of assets at least forming part of the reason”. On the other hand, the Wife reiterates that the Withdrawn Sums were obtained from both herself and the daughter. She accepts that some share of her deposits came from the Husband, but submits that the nature of their relationship prior to the divorce was such that she had the authority to withdraw the funds from their joint accounts or any liquid matrimonial asset. Any termination of authority could only have occurred at the end of 2012 when the Husband cancelled the Wife’s supplementary credit card and ATM card, but by that time the “moneys” had already existed in the Wife-Daughter Account. There was also no intention on the part of the Wife to dissipate matrimonial assets as the Withdrawn Sums were taken simply to aid the daughter in purchasing her flat. 31 Given what we have said at [24] above, the Withdrawn Sums must be returned to the asset pool unless it can be shown that the Husband did not have at least a putative interest in them. In this respect, we do not think that the Wife has sufficiently demonstrated that the Withdrawn Sums were not matrimonial assets in that they constituted only the daughter’s own deposits added to amounts that she herself had saved from gifts (ie, the allowances) given to her by her children. On the Wife’s part, her receipt of between $300 and $500 per month from her children would have resulted in her getting a total of between $3,600 and $6,000 a year. This would have added up to only between $36,000 and $60,000 over ten years, assuming that everything was saved, which is unlikely. As for the daughter, we agree with the Judge’s observations that she was not a high earner and could not have made a substantial contribution to the funds in the Wife-Daughter Account. Any money that the Wife withdrew from the parties’ joint accounts and put into a separate account in her name, or a joint account with some other person, would remain a matrimonial asset. The Wife, thus, has not been able to prove that any specific amount within the Withdrawn Sums was not a matrimonial asset.Afortiori, she has not proven that the whole of the same did not have this character. (4) Other issues relating to the asset pool 32 Apart from the disputed assets, some other issues on the components of the asset pool arise from the parties’ submissions. We address these briefly. 33  First, the Husband submits that the OCBC Joint Account component of the asset pool should be $1,676.00 (more precisely, $1,675.88; the balance at the start of July 2013) rather than $11,907.67 (the balance at the end of November 2012). We note that although the Judge stated that the parties had mutually agreed on the date the assets should be valued for the purposes of the ancillaries, it is not clear what this date is. In any event, this appears to be a clerical error as there is no reason why the November 2012 balance should be taken especially since this was before the Interlace Sale Proceeds were even deposited into the OCBC Joint Account. We therefore agree that the figure for the OCBC Joint Account component should be adjusted to $1,675.88. 34 Second, the Wife submits that the Husband’s CPF savings were under-declared as a sum of $136,052.04 from his Retirement Account was not included. The Husband does not dispute this and we note that it is also borne out by an online printout reflecting the Husband’s CPF account balance. We further note that the amounts in this printout give a total that is slightly higher than the Husband’s CPF component in Table 1 (even without adding in the Retirement Account). Accordingly, we adjust the Husband’s CPF component to $359,059.98. 35 Somewhat opportunistically, the Husband, in his skeletal arguments, responds by submitting that the Wife had likewise omitted the amount in her CPF “investment account”. It suffices to state that this “investment account” does not appear to be aseparateaccount; rather, it seems to show the moneys in the CPF Ordinary and Special Accounts that may be used for investment purposes. As such, we see no merit in this submission. 36 Finally, the Husband also raises various other issues in his submissions onmaintenancewhich may be related to the asset pool. For example, he suggests that the Wife should have received about $69,775.46 as dividends. He also contends that the balance in one of his bank accounts has fallen because he has been using the funds in the account for the maintenance of the household and the family, including the Wife. However, these issues are raised in the context of maintenance and it does not seem that the Husband is asking for the asset pool to be adjusted to take these into account. (5) Summary of our decision on the asset pool 37 In light of the above, the final asset pool is as follows, with our adjustments reflected in bold and underlined (all figures rounded to the nearest dollar): Table 2: Final asset poolS/NoAsset/OwnershipJoint namesHusband’sWife’s1Matrimonial home$2,900,000-2The OCBC Joint Account$1,676-3Two cars-$224,814-4Husband’s insurance policies-$55,522-5Husband’s shares in the Company-$914,894-6Husband’s bank accounts-$98,247-7Husband’s CPF-$359,060-8The Interlace Sale Proceeds-$331,058-9Wife’s insurance policies--$100,81110Wife’s shares in the Company--$481,60811Wife’s shares--$62212Wife’s bank account (with the daughter)--$1,27613Wife’s CPF--$189,13514The Withdrawn Sums--$139,028Total$2,901,676$1,983,595$912,480$5,797,751 Dividing the pool of matrimonial assets 38 InANJthis court set out a structured approach towards the division of matrimonial assets (“theANJapproach”). As we observed inTwiss, Christopher James Hans v Twiss, Yvonne Prendergast[2015] SGCA 52 (at [17]), theANJapproach involves three broad steps by which the court should: (a) express as a ratio the parties’direct contributionsrelative to each other, having regard to the amount offinancialcontribution each party made towards the acquisition or improvement of the matrimonial assets (“Step 1”); (b) express as a second ratio the parties’indirect contributionsrelative to each other, having regard to bothindirect financialandnon-financialcontributions (“Step 2”); and (c) derive the parties’ overall contributions relative to each other by taking an average of the two ratios above, keeping in mind that, depending on the circumstances of each case, the direct and indirect contributions may not be accorded equal weight and one of the two ratios may be accorded more significance than the other (“Step 3”). (1) The Judge’s decision and the parties’ submissions 39 The Judge set the direct contribution ratio at Step 1 at 86:14 in favour of the Husband. At Step 2, the Judge set the ratio at 25:75 in favour of the Wife. At Step 3, the Judge took the view that, in light of the length of the marriage, some 35 years, the Step 2 ratio ought to be weighted 60%. This resulted in a final ratio of 49.4:50.6 in favour of the Wife, although the Judge eventually decided on an equal division. 40 On appeal, the Husband submits that the Step 1 ratio should be 95.6:4.4 in favour of the Husband. Interestingly, the Husband submits that under Step 2,separateratios should be assigned to indirect financial contributions, on the one hand, and non-financial contributions, on the other, before obtaining an average ratio. In effect, this involves breaking Step 2 down into twosub-steps. In line with this submission, the Husband submits that parties’ indirect contributions should be apportioned as follows: Table 3: Husband’s submission on Step 2HusbandWifeIndirect financial contributions100%0%Non-financial contributions30%70%Average65%35% With respect to Step 3, the Husband originally submitted that the Step 1 ratio should be weighted at 70%, giving a final ratio of 75.92:24.08 in favour of the Husband. At the hearing before us, however, counsel for the Husband accepted that the Wife should get 35% to 40% of the asset pool. 41 On the other hand, the Wife agrees with the Judge’s ratios in Steps 1 and 2. She simply submits that, at Step 3, the Step 2 ratio should be weighted at 65% instead, giving a final ratio of 46.35:53.65 in her favour. (2) The limits of theANJapproach 42 We have no doubt that theANJapproach works well in what, for the sake of convenience, we shall refer to as “Dual-Income Marriages”,ie, marriages where both spouses are working and are therefore able to make both direct and indirect financial contributions to the household. This was in fact the type of marriage before this court inANJitself.In this regard, we affirm the continued applicability of theANJapproach to Dual-Income Marriages. 43 The question that these appeals raise is whether theANJapproach should apply to marriages such as the present where roles are divided along more traditional lines,ie, where one spouse is the sole income earner and the other plays the role of homemaker. We shall refer to these marriages as “Single-Income Marriages”. 44 Our reconsideration of theANJapproach in the context of Single-Income Marriages stems from the fact thatANJapproach tends to unduly favour the working spouse over the non-working spouse. This is because financial contributions are given recognition underbothSteps 1 and 2 of theANJapproach. Under Step 1, the working spouse in a Single-Income Marriage would be accorded 100% (or close to 100%) of direct contributions. He or she would also be accorded a substantial percentage under Step 2 solely on the basis of his or her indirect financial contributions, and this could well be the case even if he or she made little or no non-financial contributions. On the other side of the equation, this means that the non-working spouse is, in this sense, doubly (and severely) disadvantaged. 45 We do not think that such an outcome is at all consistent with the courts’ philosophy of marriage being an equal partnership. Nor do we think that this was this court’s intention inANJ. Quite the contrary, we reaffirmed the rationale behind the broad-brush approach inANJ(at [17]) by highlighting that “mutual respect must be accorded for spousal contributions,whether in the economic or homemaking spheres, as both roles areequally fundamentalto the well-being of a marital partnership” [original emphasis omitted; emphasis added in italics]. However, giving effect to this principle in the context of a Single-Income Marriage and within the framework of theANJapproach would almost inevitably result in some degree of artificiality: the court would either have to award the non-working spouse a very high percentage in Step 2 (which may appear to disregard the working spouse’s indirect financial contributions), or accord a very high weightage to Step 2 at Step 3. In some, if not most, cases, the court would have to do both. 46 InANJ, we held (at [30]) that the principles enunciated in that case are not necessarily exhaustive and that we did not expect them to be hard and fast rules that must immutably be applied even to cases of exceptional facts. In this regard, we are of the view that theANJapproach shouldnotbe applied to Single-Income Marriages. 47 Additionally, we take this opportunity to clarify that even when theANJapproachdoesapply (ie, in Dual-Income Marriage cases), Step 2 shouldnotbe further broken down into two sub-steps such that separate ratios are assigned to indirect financial contributions, on the one hand, and non-financial contributions, on the other. Such an approach has no legal basis and is, furthermore, inconsistent with our observation inANJ(at [24]) that: In relation to indirect contributions, the problem with ascertaining the extent of the parties’ contributions with precision is further compounded.In the nature of things, for the court to ascribe a ratio in respect of the non-financial or indirect financial contributions of the parties, the court is clearly not indulging in any mathematical calculation because often there is very little concrete evidence to be relied upon. Contributions in the form of parenting, homemaking and husbandry, by their very nature, are incapable of being reduced into monetary terms. No mathematical formula or analytical tool is capable of capturing or accommodating the diverse and myriad set of factual scenarios that may present themselves to court as to how the parties may have chosen to divide among themselves duties and responsibilities in the domestic sphere. It is in making this determination that what is known as the broad brush approach would have to come into play.What values to give to the indirect contributions of the parties is necessarily a matter of impression and judgment of the court.In most homes, even in a home where both the spouses are working full time, in the absence of concrete evidence it is more likely than not that ordinarily the wife will be the party who renders greater indirect contributions. That said, even in a home where the wife is a full-time homemaker, it would be an exceptional home where the husband renders no indirect contribution at all.What values to attribute to each spouse in relation to indirect contributions would be a matter of assessment for the court and in that regard broad strokes would have to be the order of theday.In seeking to arrive at a ratio that represents both parties’ comparative indirect contribution towards the family, the court must, in the final analysis, exercise sound discretion along with a keen emphasis on all the relevant facts of each case. [emphasis added] (3) Division in long Single-Income Marriages 48 InlongSingle-Income Marriages, the precedent cases show that our courts tend towards an equal division of the matrimonial assets. We are in general agreement with this approach. We pause to highlight that different considerations may attach inshortSingle-Income Marriages, although we propose to leave that issue to be dealt with in an appropriate case in the future. 49 InTan Hwee Lee v Tan Cheng Guan and another appealand another matter[2012] 4 SLR 785 (“Tan Hwee Lee”), the husband was the sole breadwinner while the wife looked after the household and the children during the parties’ 28-year marriage. This court upheld (at [81] and [102]) the High Court’s 50:50 division of the matrimonial assets. We observed (at [85]) that: Although it has been stated by this court that equality in division is not the starting point or the norm in the division of matrimonial assets between spouses … it also remains true that the “courts would nevertheless not hesitate to award half (or even more than half) of the matrimonial assets if such a decision is justified on the facts” ...This is especiallyso in long marriageswhere “the law acknowledges the equally importantcontributions of the homemaker to the partnership of marriage”… [original emphasis omitted; emphasis added in italics] 50 InLockYeng Fun v Chua Hock Chye[2007] 3 SLR(R) 520 (“LockYeng Fun”), the parties were married for almost 30 years. The wife was a homemaker throughout the marriage (save for a short period) and did not contribute financially (in any significant respect) to the acquisition of the matrimonial home, while the husband was the sole breadwinner throughout the marriage and supported the wife and their children financially. This court ordered (at [3] and [41]) an equal distribution of the matrimonial assets, although we note that credit was given to the wife’s role in increasing the value of the family assets by her own efforts and investment skills. 51 InYowMee Lan v Chan Kai Buan[2000] 2 SLR(R) 659, the marriage was one which stretched over a period of 26 years. The husband was the main income earner while the wife looked after the home and children. Although the wife did work continuously during the marriage, first for third parties and subsequently for the husband himself, the High Court observed (at [42]) that she had “played a supporting role in the family business owned by the husband” and that it appeared that she “did not have either the knowledge or the talent which the husband did and could not herself have produced the substantial income he was able to generate”. The High Court ordered (at [46]) an equal division of the assets which the parties had asked to share in (the wife did not make claims to certain assets). Commenting on the district judge’s emphasis on the husband’s role as the income generator and decision that he should therefore have a major share of the assets, the High Court stated (at [43]) that: With due respect, that approach no longer accords with the legislation which takes a wider view. It recognises that a marriage is not a business where, generally, parties receive an economic reward commensurate with their economic input. It is a union in which the husband and wife work together for their common good and the good of their children. Each of them uses (or should use) his or her abilities and efforts for the welfare of the family and contributes whatever he or she is able to.The partners often have unequal abilities whether as parents or as income earners but, as between them, this disparity of roles and talent should not result in unequal rewards where the contributions are made consistently and over a long period of time.[emphasis added] 52 One seeming outlier to these cases would be this court’s decision inYeo Chong Lin v Tay Ang Choo Nancy and another appeal[2011] 2 SLR 1157 (“YeoChong Lin”), which involved a 49-year marriage. The husband was the breadwinner and the wife was a full-time homemaker throughout the entire marriage. This court upheld (at [82]) the High Court’s 65:35 distribution in favour of the husband. However, that was a unique case and it is clear that a major factor that featured in the analysis was the exceptionally large size of the asset pool, which amounted to around $69m. In our view, this factor distinguishesYeo Chong Linfrom the present appeals. (4) Our decision 53 This court has repeatedly affirmed the principle that “an appellate court will seldom interfere in the orders made by the court below unless it can be demonstrated that it has committed an error of law or principle, or has failed to appreciate certain crucial facts” (Koh Bee Choo v Choo ChaiHuah[2007] SGCA 21 at [46]; see alsoANJat [42] andTan Hwee Leeat [80]). InLockYeng Fun, we held (at [36]) that an appellate court should not interfere with a trial judge’s exercise of discretion except in exceptional circumstances. We reaffirm these principles and emphasise that this court will not readily interfere with the trial judge’s decision as to what percentage of the matrimonial assets is to be given to each party. This is a matter that is squarely within the trial judge’s discretion. Moreover, a broad-brush approach means that there will be a range within which we must accept the trial judge’s determination to be defensible. In order to warrant appellate intervention, the trial judge’s decision must be shown to be clearly inequitable or wrong in principle. 54 In this case, we see absolutely no reason to disturb the Judge’s decision that a 50:50 division of the matrimonial assets was the equitable division. We consider her decision to be perfectly consistent with the precedent cases involving long Single-Income Marriages (see [48]–[52] above) and we do not see anything on the facts that warrants our intervention. We will, however, say a few words on certain related issues that arise out of these appeals. 55 The first relates to moneys given to the Wife by the Husband which she subsequently channelled into the parties’ matrimonial home. The Judge noted that these moneys had been at the Wife’s disposal when they were given to her by the Husband absolutely for her use. The Wife could have spent them on the household or herself, but chose instead to save them in order to alleviate the Husband’s financial burden in the purchase of the matrimonial home. The Judge thought that, by doing so, the Wife converted the gift into a direct financial contribution to the matrimonial home. We agree with this approach. Like the Judge, we find it to be consistent with the approach taken by this court inLockYeng Fun.In that case, the wife had managed to amass a sizable sum of close to $500,000 from her investments (albeit from the moneysgiven to her by the husbandfor household and miscellaneous expenses). In increasing her share of the matrimonial assets from 40% to 50%, this court held (at [41]): Furthermore, in addition to the non-financial contributions of a spouse (more often than not, the wife), attention must be given to his or her direct financial contributions through his or her efforts in increasing the total value of the matrimonial assets. This contribution must be taken into account for the purpose of increasing the proportion of matrimonial assets to be awarded to that spouse. This is not only logical but is also eminently fair. This is, in fact, the situation in the present case where the wife not only looked after the home and the children for 30 years, but also, by her own efforts and investment skills, increased the value of the family assets considerably to an amount much larger than that brought in by the husband.In the circumstances, she must be given due credit for this direct financial contribution in the division of matrimonial assets.It is principally for this reason that we decided that a fair and equitable distribution of the matrimonial assets would be on the basis of an equal distribution. [emphasis added] 56 Second, we note that the Judge, in arriving at the Step 1 ratio of 86:14 in favour of the Husband, had used the mid-mark between the figures submitted by the parties in relation to the Wife’s direct contributions: 8.8% suggested by the Husband and 19.6% suggested by the Wife. However, it appears that these figures pertain only to the Wife’s direct contributions to thematrimonial home, as opposed to the entire asset pool. The Judge seems to have acknowledged as much when she subsequently embarked on her “contingent analysis” (GD at [56]–[58]). For the avoidance of doubt, we reiterate that under Step 1 of theANJapproach, the ratio to be ascribed to the parties’ direct contributions should relate to such contributions made tothe entire asset pool. 57 Third, counsel for the Husband argued at the hearing before us that the Wife could have made even more financial contributions even though she was not working. She submitted that the Wife had received moneys from the Husband but had kept and spent these on herself instead of contributing financially to the household. We find this submission to be without merit as the Husband had given these moneys to the Wife without conditions. Having been generous during the marriage, the Husband (perhaps understandably) might now feel upset, but we do not think that he can be allowed to go back on his generosityviasuch a submission. On a related note, the Husband also submits, in the context of the Wife’s indirect contributions, that the Wife did not give him any support when he was not doing well: she did not help him when he found it difficult to pay for the instalments of the parties’ apartment at the Interlace and showed a “care-less” attitude when he requested that she tighten her belt as times were bad with his business. We do not see how this submission, even if true, could be relevant. If the Husband were truly so concerned about these matters, he could have cancelled the Wife’s cards (which he eventually did) or simply stop putting money into the OCBC Joint Account (or any other joint account which the parties may have had at the time). Allocation of the matrimonial assets 58 To give effect to our holdings above, we make the following orders. With respect to the matrimonial home, we appreciate that, currently, property prices are falling. In light of this, we give the Husband six months to sell the matrimonial home. The sale proceeds (less related expenses) are to be divided equally between the parties and each party is to make the refund due to their respective CPF accounts, if any, from their own share of the sale proceeds. If the Husband does not sell the matrimonial home within six months, the Wife can proceed to do so. 59 The remaining assets have a total value of $2,897,751. Each party is therefore entitled to $1,448,875.50. To achieve this: (a) each party is to retain the assets held in their sole names; (b) the Wife shall be entitled to the moneys in the OCBC Joint Account, which amount to $1,676; and (c) the Husband shall pay the Wife the sum of $534,719.50. With respect to (c), the Husband shall pay this sum upon completion of the sale of the matrimonial home or within nine months, whichever is earlier.",
        "Maintenance for the Wife": "60 With respect to maintenance, the Judge awarded the Wife a lump sum maintenance of $171,517, assessed at $3,000 per month with a multiplier of five years and an annual effective interest rate of two percent. 61 The Husband’s position on appeal is that no maintenance should be awarded to the Wife. On the other hand, the Wife, while accepting the monthly sum of $3,000 as “reasonable”, contends that the multiplier should be 19 years instead, giving a total sum of $684,000. The Wife’s basis for a 19-year multiplier is this court’s decision inWan Lai Cheng vQuek Seow Kee and another appeal and another matter[2012] 4 SLR 405, where we followed (at [89]) the method of quantifying an appropriate multiplier for a lump sum maintenance award set out in our earlier decision inOng Chen Leng v TanSau Poo[1993] 2 SLR(R) 545 (at [35]). This method involves taking a compromise between the average life expectancy of a woman and the usual retirement age of a Singapore male worker less the wife’s present age,ie, [(average life expectancy of a woman + usual retirement age of a Singapore male worker) ÷ 2] – the wife’s present age (“theOng Chen Lengmethod”). 62 Whilst not proposing to discard theOng Chen Lengmethod altogether, we do not think that theOng Chen Lengmethod was intended by this court to be theonlymethod of quantifying the appropriate multiplier for a lump sum maintenance award. In this regard, we agree with the Husband’s submission that theOng Chen Lengmethod is simply a guide rather than a rule of law. Ultimately, the award of maintenance is a multi-factorial inquiry which, pursuant to s 114(1) of the Women’s Charter (Cap 353, 2009 Rev Ed) (“WC”), requires the court to have regard to all the circumstances of the case including the following matters listed in s 114(1)(a) to (g) of the WC: (a) the income, earning capacity, property and other financial resources which each of the parties to the marriage has or is likely to have in the foreseeable future; (b) the financial needs, obligations and responsibilities which each of the parties to the marriage has or is likely to have in the foreseeable future; (c) the standard of living enjoyed by the family before the breakdown of the marriage; (d) the age of each party to the marriage and the duration of the marriage; (e) any physical or mental disability of either of the parties to the marriage; (f) the contributions made by each of the parties to the marriage to the welfare of the family, including any contribution made by looking after the home or caring for the family; and (g) in the case of proceedings for divorce or nullity of marriage, the value to either of the parties to the marriage of any benefit (for example, a pension) which, by reason of the dissolution or annulment of the marriage that party will lose the chance of acquiring. 63 Additionally, as noted by the Judge, the court’s power to order maintenance issupplementaryto its power to order a division of matrimonial assets (ATE v ATDand another appeal[2016] SGCA 2 at [33]). Consequently, if, from the division of matrimonial assets, there is a sum which, if invested properly, would be sufficient to maintain the wife, the award of maintenance should be no more than what is necessary to allow the wife to, in the words of the Judge, “weather the transition of the divorce” (GD at [77]). 64 In the present case, we have held that the Wife is entitled to an equal share of the substantial pool of matrimonial assets. We note, too, that the Husband supported the Wife up till mid-2015. Although the Judge was alive to both these factors, we find her multiplier of five years to be on the generous side. Accordingly, we order that the Husband pay the Wife a lump sum maintenance of $100,000, which is approximately the sum obtained using a multiplier of three years, which we consider to be more appropriate. The Husband shall pay this sum on completion of the sale of the matrimonial home or within nine months, whichever is earlier.",
        "Costs of the ancillaries": "65 The Judge made no order on the costs of the ancillaries. The Wife submits on appeal that the Husband ought to bear the costs of the ancillaries in light of his conduct during the proceedings, which has been “less than favourable”. In particular, the Wife highlights that the Husband has caused considerable delay in the proceedings. She says that this has prejudiced her as the Husband had reduced financial support for her after the commencement of divorce proceedings and had completely stopped providing maintenance in June 2015. The Wife also points to how the Husband had attempted to stay the execution of the judgment debt, including in respect of maintenance moneys. 66 In our judgment, the costs of the ancillaries was something that was well within the discretion of the Judge and we decline to interfere with the Judge’s decision in this regard. That said, we note that, with respect to the Wife’s submission on delay, the Husband points out that costs orders have already been made against him at various stages when the court thought fit, and the Wife has herself highlighted that cost orders have been made against the Husband at various case conferences. It therefore seems that the Husband has already been penalised for at least some part of his alleged conduct. As for the Wife’s submission that the Husband had attempted to stay the execution of the judgment debt, we note that this appears to relate to events occurringafterthe ancillaries and is therefore irrelevant.",
        "Conclusion": "67 In light of the above, CA 43 and CA 53 are both allowed in part. We make no order as to costs as this is a cross-appeal situation in which both parties have been partially successful. 68 Further, in the context of matrimonial appeals, there is a clear interest in encouraging the parties to move on to face the future instead of re-fighting old battles. Therefore, generally, appeals will not be sympathetically received where the result is a potential adjustment of the sums awarded below that works out to less than ten percent thereof. Even where such appeals are allowed because the court has established that there was an error of principle, costs may be awarded against the successful party if the court is satisfied that the appeal was a disproportionate imposition on the unsuccessful party. In the present case, when all the calculations are made (and disregarding the matrimonial home since its present value is not known and in any case the parties will share the proceeds equally), the bottom line is that the net amounts gained by the Wife and lost by the Husband as a result of both appeals (after factoring in the additional moneys each party has to put into the asset pool and our variation of the Wife’s maintenance) are both less than $100,000. This is less than two percent of the original asset pool as calculated by the Judge and hardly justifies the amount of time, effort and anxiety that went into the mounting and hearing of these appeals. 69 In closing, we caution that regardless of the approach our courts have taken in the past, unsuccessful appellants in matrimonial appeals in the future should expect to have costs awarded against them. This remains subject, of course, to the overall justice of the case. Additionally, costs may also be awarded on an issues basis against a nit-picking appellant who raises unmeritorious issues on appeal. Sundaresh Menon                      Judith Prakash                       Tay Yong KwangChief Justice                              Judge of Appeal                     Judge of Appeal Lim Poh Choo (Alan Shankar & Lim LLC) for the appellant inCivil Appeal No 43 of 2016 and the respondent inCivil Appeal No 53 of 2016;Choh Thian Chee Irving, Looi Min Yi Stephanie and Chuah Hui Fen, Christine (Optimus Chambers LLC) for the respondent inCivil Appeal No 43 of 2016 and the appellant inCivil Appeal No 53 of 2016."
    }
}