{
    "case_title": "Hishamrudin bin Mohd vPublic Prosecutor",
    "ncitation": "[2017] SGCA 41",
    "coram": "Chao Hick Tin JA (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 This is an appeal by an offender (“the Appellant”) against his conviction and sentence on two charges of trafficking in diamorphine under s 5(1)(a), read with s 5(2), of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the MDA”). The first was for trafficking in not less than 3.56 grams of diamorphine (“the non-capital charge”), and the second was for trafficking in not less than 34.94 grams of diamorphine (“the capital charge”). At the conclusion of the trial the Appellant was convicted on both the charges and the court was informed that the Public Prosecutor had decided not to issue the Appellant with a certificate under s 33B(2)(b) of the MDA. Accordingly, he was sentenced to suffer the mandatory death penalty for the capital charge. He was also sentenced to six years’ imprisonment for the non-capital charge. 2 We pause to note that the Appellant had chosen to act in person for the appeal, and had discharged the two free legal counsel assigned to him under the Legal Assistance Scheme for Capital Offences. At trial, the Appellant had already been assigned, and then discharged, a total of four other free legal counsel. At the hearing before us, the Appellant applied for the same two counsel, who were in attendance, to assist him as McKenzie friends (ie, persons present in court to advise and explain things to the Appellant, but not to represent him). We allowed the application. 3 After hearing oral arguments from the Appellant and the Prosecution, we reserved judgment. Subsequently, of his own accord, the Appellant submitted three sets of further written submissions dated 3, 23 and 29 May 2017. It is highly unusual for parties to submit unsolicited further submissions after the oral hearing has concluded, and such submissions would generally not be entertained if they were submitted without the court’s leave. Out of an abundance of caution, and being mindful that this was a capital case and the Appellant was acting in person, we exercised our discretion to consider the Appellant’s unsolicited further submissions in arriving at our decision. This should not be taken as a precedent by future appellants acting in person to conduct themselves in a similar fashion as the Appellant has. We emphasise that even in the present circumstances, the Appellantshouldhave sought leave, and this court would have been entitled to wholly disregard the unsolicited further submissions. 4 Having considered the matter, we have decided to dismiss the appeal for the reasons that follow.",
        "The facts": "",
        "The arrest of the Appellant with drugs in his car": "5 In the morning of 7 October 2010 at about 8.45am, the Appellant left his flat at Block 83 Commonwealth Close #12-167 (“the Flat”) and drove his car (“the Car”), bearing licence plate number SJV 4311S, to City Square Mall along Kitchener Road. He parked the Car at City Square Mall’s car park and walked to a coffeeshop at Shing Hotel also along Kitchener Road, where he met one Ahad Bin Salleh (“Ahad”). The Appellant passed Ahad a white envelope containing $3,000 in $10 denominations.1Foot Note 1×Prosecution’s Closing Submissions (“PCS”) at para 18 and the footnotes therein (ROP vol 2A at p 629–630). 6 CNB officers arrested the Appellant at the said coffeeshop. Another team of CNB officers arrested Ahad that same day. A car key was recovered from a search of the shorts he was wearing. The Appellant was then brought back to the Car. The Car was unlocked using the car key recovered earlier from the Appellant, and a search of the Car was carried out in his presence.2Foot Note 2×PCS paras 26–27 and the footnotes therein (ROP vol 2A at p 638–6390).A white plastic bag bearing the word “Choices” (“the Choices Bag”) was found on the floor mat of the front passenger seat of the car. The Choices Bag contained two newspaper-wrapped bundles and each bundle contained six envelopes. The envelopes in turn contained packets of a granular substance. In total, 59 packets of the granular substance were found in the Choices Bag, which, on analysis, was ascertained to contain in total not less than 3.56 grams of diamorphine.3Foot Note 3×PCS at paras 18–19 (ROP at p 631–632).These drugs formed the subject of the non-capital charge. 7 Diamorphine was also found in Ahad’s car.4Foot Note 4×ROP vol 1G, Day 40 p 104 at line 9–17.Ahad was similarly convicted for drug offences in a separate trial.5Foot Note 5×ROP vol 1G, Day 39 p 10 at line 5–11.Ahad was not called as a witness in the trial below.",
        "The Appellant’s flat is searched and drugs are found in his bedroom": "8 Later that day, at about 1.30pm, CNB officers brought the Appellant back to the Flat, of which he was the sole lessee.6Foot Note 6×ROP vol 2B p 1347.The CNB officers unlocked the Flat using keys found in the Appellant’s possession. Upon entry, the CNB officers found one Rosli Bin Sukaimi (“Rosli”) inside the bathroom of the Flat, and arrested him. CNB officers searched the Flat. A digital weighing scale belonging to the Appellant was found in the kitchen. A luggage bag was also found in the Appellant’s bedroom, of which he was the sole occupant. The main compartment of the luggage bag was locked by a padlock, which was cut open by CNB officers. (It was later discovered that the padlock matched two keys which were found in the wardrobe drawer of the Appellant’s bedroom, and were capable of unlocking the padlock.) The luggage bag was found to contain three plastic bags, which in turn contained a total of 193 packets of granular substance and which granular substance was, upon subsequent analysis, established to contain not less than 34.94g of diamorphine.7Foot Note 7×PCS at paras 20–21 (ROP at p 633–636).Drug paraphernalia, including two weighing scales, empty plastic sachets, one electronic heat sealer and disposable gloves, were also found in the luggage bag.8Foot Note 8×PCS at paras 50, 53 (ROP at p 646–647). 9 Rosli was later convicted of drug-related offences in a separate trial.9Foot Note 9×ROP Vol 2C at p 1753 (Rosli’s statement); ROP Vol 1C, Day 17 p 31-32.He testified in the trial of the Appellant as the Prosecution’s witness.",
        "The decision below": "10 After a trial that lasted 45 days and spanned five tranches, the trial judge (“the Judge”) found that the “weight of the evidence led by the Prosecution was overwhelmingly against the [Appellant]” and convicted the Appellant on both the charges of drug trafficking (Public Prosecutor v Hishamrudin Bin Mohd[2016] SGHC 56 (“the GD”) at [46]). 11 The Judge referred, in particular, to the DNA evidence found on various items that pointed to the Appellant’s guilt. This included the presence of the Appellant’s DNA on the interior and exterior of the plastic bags found in the Car and in the Flat and which contained the drugs, as well as the several drug paraphernalia found in the Flat. The Appellant’s DNA was also found on the heat sealer which had been used to heat-seal the plastic packets containing the drugs found in both the Flat and the Car. The Judge also rejected the Appellant’s allegations that he was framed by officers from the Central Narcotics Bureau (“CNB”), or that the drugs were planted in the Car and in the Flat by various different people whom he had accused, at different points during the trial, of having done that. The Judge viewed these allegations as “a desperate attempt” by the Appellant to distance himself from the drugs found in the Car and in the Flat (the GD at [43] and [47]–[48]). 12 As the Judge found that the Appellant possessed the drugs in the Car and in the Flat, and having regard to the quantity of the drugs, the Appellant was presumed to have possession of the drugs for the purposes of trafficking: s 17(c) of the MDA. The Judge found that the Appellant had failed to rebut the presumption under s 17(c) and that, in any event, given the drug paraphernalia found in the Flat, the Judge was satisfied that the Appellant possessed the drugs for the purposes of trafficking even without resorting to the presumption (at [49]). 13 The Appellant was also found by the Judge to be “severely lacking in credibility” in light of the Appellant’s “widespread pattern of extensive internal and external inconsistencies” (the GDat [43]). Four statements made by the Appellant were held by the Judge to beLucaslies (named after the case ofRegina v Lucas (Ruth)[1981] QB 720),ie, lies that were deliberately-made, related to material issues, were motivated by the Appellant’s realisation of guilt and fear of the truth and were clearly shown by independent evidence to be lies (the GD at [45]; see also the GD [38]–[40] for a more detailed explanation of the concept ofLucaslies in English and Singapore law). The Judge held that these fourLucaslies corroborated the “already-strong evidence” against the Appellant, and that he did not require to rely on the lies in the four statements to reach his decision to convict the Appellant on the charges (the GD at [50]).",
        "The arguments on appeal": "",
        "The Appellant’s arguments": "14 The Appellant’s main contentions on appeal were that the drugs were planted by or belonged to others, and that the CNB officers (in particular, the Investigating Officer, Deputy Superintendent Tan Seow Keong (“DSP Tan”)) had framed him by tampering with the evidence (ie, planting the Appellant’s DNA on the relevant exhibits) in order to cover up two alleged assaults committed against him by the CNB officers.",
        "The Prosecution’s arguments": "15 The Prosecution, on the other hand, argued that the Judge was correct to have convicted the Appellant on both the charges in light of the “significant objective scientific evidence.”10Foot Note 10×Respondent’s submissions (“RS”) at para 5.This evidence was supplemented by the oral testimony of the CNB officers and two other witnesses who had access to the Flat, namely, Rosli and the Appellant’s family’s domestic worker, Meisaroh. In response to the Appellant’s claim of being framed, the Prosecution submitted that the accusation was false, and had been concocted by the Appellant to explain away the DNA evidence against him.11Foot Note 11×Record of oral hearing at 10:11:25–11:11:55.",
        "The issues before this court": "16 The main issue before this court was whether the Judge was correct to have found that the Appellant had possession of the drugs which were the subject of the two charges.12Foot Note 12×RS at para 45(a); Petition of Appeal (“POA”) at paras 5–6.Further, this issue has to be examined from the following two different angles: (a) Whether the Prosecution had proven beyond a reasonable doubt that the Appellant had possession of the drugs, apart from the Appellant’s allegation that he had been framed. (b) Whether the Appellant’s allegation that he had been framed, through the planting of the drugs and tampering of the evidence, raised any reasonable doubt about his convictions. 17 As regards the remaining element of the trafficking charges,viz, that the Appellant had possession of the drugsfor the purposes of trafficking, we note that the Appellant has not attempted to rebut this presumption. He appeared content to rest his case on his claims that the drugs were planted by others and that he was framed,ie, allegations that negated the element of possession rather than the element of possession for the purposes of trafficking. In any event, there was no indication, nor any assertion, that he possessed, or could have possessed, the drugs for other purposes, such as consumption. Indeed, there was evidence to suggest that the drugs were not for his own consumption: we note that he tested negative for diamorphine use, and that the quantity of drugs found in his possession appeared far greater than the quantity which an individual drug user could have needed for his own consumption.13Foot Note 13×RS at paras 88-90; POA at para 15(b).We therefore do not need to discuss this element any further, but shall focus only on the main issue of whether the Appellant had possession of the drugs.",
        "Whether the Prosecution had proven beyond a reasonable doubt that Appellant had possession of the drugs, apart from the Appellant’s allegation that he had been framed": "",
        "The law on possession of a controlled drug": "18 It is established law that to prove that an accused person had actual possession of controlled drugs, two elements must be satisfied:(1) that the accused person had physical control over the controlled drugs; and (2) that the accused person knew of the nature of the controlled drugs. The knowledge as to “nature of the controlled drugs” touches on the person’s knowledge that the items were controlled drugs, not his or her knowledge of thespecificnature of the drug (seeFun Seong Cheng v Public Prosecutor[1997] 2 SLR 796 at [53]–[56];Tan Kiam Peng v Public Prosecutor[2008] 1 SLR (R) 1 at [87]). 19 We note that the presumption of possession under s 21 of the MDA was also invoked in respect of the drugs found in the Appellant’s car as he was the owner of the car. Section 21 of the MDA provides: Presumption relating to vehicle 21.  If any controlled drug is found in any vehicle, it shall be presumed, until the contrary is proved, to be in the possession of the owner of the vehicle and of the person in charge of the vehicle for the time being. 20 This presumption would apply to the Appellant in respect of the drugs found in the Car as it was undisputed that he was the owner of the Car.14Foot Note 14×ROP Vol2B p 1345–1346. 21 Nevertheless, for completeness, we will also consider whether the Appellant hadactualpossession of the drugs found in both the Car and the Flat. 22 We note that the Prosecution did not rely on a possible presumption of possession under s 18(1)(c) of the MDA with regards to the drugs found in the Flat. Presumably, this was because the Prosecution wished to rely on the presumption concerning trafficking under s 17(c) of the MDA, and this could only be done if actual possession was proved:Tang Hai Liang v Public Prosecutor[2011] SGCA 38 (“Tang”) at [18]–[19], citing this court’s earlier decision inMohd Halmi bin Hamid and another v Public Prosecutor[2006] 1 SLR(R) 548 at [8] and [10]. We will thus begin by examining whether the Appellant had actual possession of the drugs found in the Flat.",
        "Possession of drugs in the Appellant’s Flat": "Physical control of drugs in the Appellant’s Flat 23 In our view, the evidence adduced by the Prosecution established beyond a reasonable doubt that the Appellant had physical control of the drugs. He was the sole lessee of the Flat15Foot Note 15×ROP Vol 2B at p 137 (Letter from HDB).and held the keys to the Flat. Rosli, who lived in the Flat from end-July 2010 to the date of arrest, also testified that the Appellant resided in the bedroom of the flat where the luggage bag containing the drugs were found.16Foot Note 16×ROP Vol 1C, NE 7 Aug 2014 p 6 ln 10–12 and p 10 ln 11–p 11 ln 12; ROP Vol 2c at pp 1753–1754 (Rosli’s statement).The following DNA evidence further established that the Appellant had physical contact with the drugs in the Flat, and was involved in heat-sealing them: (a) The Appellant’s DNA was found on the interior and exterior of two of the three plastic bags found in the luggage bag that contained the plastic packets of diamorphine. As for the remaining plastic bag, the Appellant’s DNA was found on its interior, though not on its exterior.17Foot Note 17×ROP Vol 2 at pp 324–325; ROP Vol 2A at p 988, 991, 1003–1004, 1014–1015 and 1019. (b) The Appellant’s DNA was found on one of the plastic packets containing the diamorphine.18Foot Note 18×ROP Vol 2A at p 993. (c) The Appellant’s hair was found heat-sealed onto one of the plastic packets containing the diamorphine.19Foot Note 19×ROP Vol 2A at pp 983 and 993. (d) The Appellant’s DNA was found on various drug paraphernalia, such as the heat sealer,20Foot Note 20×ROP Vol 2A at pp 977 and 990.the paper box containing disposable gloves21Foot Note 21×ROP Vol 2A at pp 977 and 991.and various instruments such as the brush handle, knife and knife sheath.22Foot Note 22×ROP Vol 2A at pp 977 and 992. 24 Accordingly, the judge’s finding that the Appellant had physical control of the drugs found in his flat was completely supported by the evidence and cannot be disturbed. Knowledge of the nature of the drugs in the Appellant’s flat 25 We turn now to the question of whether the Appellant had knowledge of the drugs in the Flat. In this regard, the Prosecution has invited this court to uphold the Judge’s inference that the Appellant had such knowledge, on the basis of his physical possession of the drugs and his failure to provide a reasonable explanation in the light of the DNA evidence found against him. The Prosecution relied on the following statement of law by this court inTan Ah Tee and another v Public Prosecutor[1979–1980] SLR(R) 311 at [19]: Indeed, even if there were no statutory presumptions available to the Prosecution, once the Prosecution had proved the fact of physical control or possession of the plastic bag and the circumstances in which this was acquired by and remained with the second appellant, the trial judges would be justified in finding that she had possession of the contents of the plastic bag within the meaning of the [MDA]unless she gave an explanation of the physical fact which the trial judges accepted or which raised a doubt in their minds that she had possession of the contentswithin the meaning of the [MDA]. [emphasis added] 26 It is plain that this statement of principle is in line with good sense and logic. Once the fact of physical possession is established, then the individual concerned must explain why the ordinary consequences should not follow. We shall now examine the circumstances put forth by the Appellant to explain the presence of the drugs in the Flat. 27 The Appellant’s primary position on appeal appears to be that Rosli and his drug contacts were responsible for the drugs found in the Flat.23Foot Note 23×Appellant’s handwritten submissions (“AHS”) at p 3; POA at para 7.He emphasises in particular that Rosli also had the keys to the Flat, and the Flat is an open plan apartment, with no doors to secure his bedroom.24Foot Note 24×POA at para 5.Thus his point is that once a person obtained access to the Flat through the main door, that person would have access to the entire Flat. 28 While we appreciate the basic logic of this defence, it fails to address the specific objective evidence which the Prosecution adduced before the court below. First, it does not explain why the Appellant’s DNA was found on the exhibits mentioned above at [23]. This DNA evidence indicated that the Appellant had physical contact with those exhibits. Second, the explanation that Rosli was responsible for the drugs was not borne out by the evidence: Rosli’s DNA was found only on an improvised smoking apparatus contained inside a box in the luggage bag,25Foot Note 25×ROP vol 2 at p 320; ROP Vol 2A at 1022.but not on the drug exhibits or the drug trafficking paraphernalias found in the Flat.26Foot Note 26×RS at para 71.In the circumstances, the court below was fully entitled to infer that the Appellant had contact with the drugs in the luggage bag and knew of their nature. 29 In this regard, we would observe that at an early stage of the trial, before the Appellant accused Rosli and his contacts of planting the drugs, the Appellant had also claimed that CNB officers had planted the luggage bag containing the drugs in his Flat. As described by the Judge in the GD at [29]: This was allegedly done by sending a team of CNB officers to his Flat in Commonwealth while they had his keys on 7 October 2010, while another team of CNB officers escorted him to another flat in Eunos Crescent to “buy time” to plant the luggage bag. 30 We note that the Appellant’s version of events (being taken from the City Square Mall car park to Eunos Crescent so that CNB officers could plant the luggage bag in the Flat) was not accepted by the Judge. Instead, the Judge found that the Appellant was taken straight from City Square Mall to the Flat (see GD at [41(c)], [42(b)] and [45]). On the hearing of this appeal before us, it was not entirely clear to us whether the Appellant maintained, on appeal, the position that the CNB officers had planted the drugs in the Flat as his submissions focused on Rosli’s responsibility for the drugs. He also maintained that he was first taken to Eunos Crescent after his arrest at City Square Mall.27Foot Note 27×AHS at p 35. 31 For completeness, we will nevertheless address the Appellant’s allegation that the CNB officers planted the drugs in the Flat. This will be addressed later in the judgment (see below at [58]–[60]), alongside with our consideration of the Appellant’s allegation that the CNB officers had tampered with the evidence adduced against him. 32 Therefore, apart from the Appellant’s allegations of planting and tampering of evidence which he made against the CNB officers, we are satisfied that the evidence supported the Judge’s finding that the Appellant possessed the drugs found in the Flat.",
        "Possession of drugs in the Appellant’s car": "Physical control of drugs in the Appellant’s car 33 We now proceed to consider the evidence relating to the Appellant’s physical control of the drugs in his car. A summary of the evidence on this was provided by the Prosecution as follows:28Foot Note 28×RS at para 75, (l) the Appellant's DNA was found on the [Choices Bag] containing the drug exhibits; (2) the drug exhibits were recovered from the Appellant's own vehicle that was locked, and no one else besides the Appellant had access to the said vehicle; and (3) moments prior to the Appellant's arrest, [Senior Station Inspector Heng Chin Kok (“SSI Heng”)] had observed the Appellant walking to his vehicle whilst holding a white bundle. 34 In our view, the second point alone in the quotation above, established beyond a reasonable doubt that the Appellant had physical control of the drugs found in his car. The other points nevertheless remained pertinent to the inquiry of the Appellant’s knowledge, which we shall now turn to. Knowledge of the existence of the nature of the drugs in the Appellant’s car 35 In relation to the Prosecution’s claim that the Appellant took a white bundle into his car (the third point set out in [33] above), the Prosecution emphasised that the Choices Bag in which the drugs were found was white, and no other white bags or bundles were recovered from the Appellant’s car.29Foot Note 29×RS at para 78.The Appellant’s response was that the white bundle referred to by SSI Heng was not the Choices Bag, but actually the white envelope containing $3000 in $10 denominations, which the Appellant had passed to Ahad (as referred to above at [5]).30Foot Note 30×AHS at p 28. 36  It appears that this point alone left some room for doubt. We note that in SSI Heng’s oral testimony, he was unable to confirm that the white bundle he had seen was indeed the Choices Bag.31Foot Note 31×ROP Vol 1A, NE 8 October 2013 p 143 line 14–line 32.It is true that SSI Heng later confirmed to the court that the white bundle that he saw was not an envelope. However, “envelope” was described to him as “an envelope flat in shape”, one without “some thickness”.32Foot Note 32×ROP Vol 1A, NE 8 October 2013 p 142 line 9–p 143 line 9One must be mindful that the white envelope that the Appellant passed to Ahad contained 300 notes in a $10 denomination. Such an envelope may well be said to have “some thickness”. Nevertheless, this concern was not to be overstated. SSI Heng had also witnessed the Appellant carrying the white envelope that was passed to Ahad,33Foot Note 33×ROP Vol 1A, NE 8 October 2013 p 143 line 9–16.and should accordingly be able to differentiate between this white envelope and the white Choices Bag. Nevertheless, the evidence here is not as conclusive as it may have seemed at first sight. 37 However, whatever lingering doubts that might have remained in our minds were completely erased upon considering the totality of the evidence, and our assessment of the Appellant’s explanation for the presence of the drugs in his car. Keeping in mind that the presence of the Appellant’s DNA on the interior and exterior of the Choices Bag remains unexplained (as emphasised by the Prosecution at [33] above), we will examine the evidence that points towards the Appellant’s knowledge of the presence of the drugs found in his car. 38 In relation to the Appellant’s knowledge of the drugs in his car, the Prosecution emphasised the following pieces of evidence:34Foot Note 34×RS at para 82. (a) The newspaper wrappings of the drugs found in the car originated from a stack of newspapers found in the Flat. (b) The plastic packets of drugs found in the car were found through forensic evidence to have been heat-sealed by the same heat-sealer found in the Flat. (c) The Appellant’s DNA was found on the said heat-sealer. 39 In addition, the Prosecution also highlights the Appellant’s behaviour after his arrest.35Foot Note 35×RS at para 84.According to SSI Heng, the Appellant behaved aggressively towards the CNB officers and shouted vulgarities at them. When asked where he had parked his car, the Appellant looked away from SSI Heng and did not answer.36Foot Note 36×ROP vol 2C p 1756 at para 9.In light of the foregoing, the Prosecution suggests that such actions indicate a guilty mind and invited this court to infer that the Appellant knew of the existence of the drugs found in the Car. 40 The Appellant’s explanation for the presence of the drugs in the Car was that the drugs were planted by someone else. However, what is particularly significant is the fact that throughout the trial, he had identified different people as responsible for planting the drugs, and at times retracted his allegations. This shows that the Appellant was firing off baseless accusations as opposed to making allegations which he believed to be true. As recounted by the Judge at [28] of the GD: The accused claimed that he suspected that “someone” had planted the ‘Choices’ plastic bag in his car. In his long statement dated 12 October 2010, the accused claimed that he suspected Hashim, someone he met the evening before the date of his arrest, on 6 October 2010, to have planted the controlled drugs in his car. On the fifth day of trial, he suspected that [Woman Staff Sergeant Jenny Woo Yoke Chun] or her colleagues from CNB were the ones who planted the drugs in his car. Later on in the trial, the accused changed his mind and stated that he no longer believed that it was Hashim or CNB officers that planted the drugs. Instead, the accused claimed that it was a “mystery” as to how the drugs appeared in the car, and that some unknown person could have planted the drugs in the car. 41 Even at the hearing before us, it was not clear what the Appellant’s position was. The Petition of Appeal (which was filed while the Appellant was still represented) stated that “the drugs found in the [C]ar could easily have been planted whilst the Appellant was away from his car meeting his friend, [Ahad]”.37Foot Note 37×POA at para 5.This claim did not seem to be pursued by the Appellant after he discharged his lawyers. We thus need not dwell on it (although, for the avoidance of doubt, we find that it has no merit in any event), and will instead focus on his latest position, which is to be found in his handwritten submissions. There, the Appellant claimed that Rosli and Rosli’s drug trafficking contacts “could be” the ones who planted the drugs in the Appellant’s car, by taking the Appellant’s car key while the Appellant was sleeping at night. In support, the Appellant referred to the DNA found on the swabs of various exhibits recovered from the Car.38Foot Note 38×AHS p 26–28.The DNA results are summarised in the following table:39Foot Note 39×ROP vol 2 p 321 and 314. ExhibitsDNA foundSwabs of the Choices Bag (both interior and exterior)•  Appellant’s DNA•  DNA of “unknown person”Swabs of five packets of diamorphine found in the Choices Bag (“A1B4A”)•  DNA of “unknown male 2”1 rubber band (marked “Wipe-RB” along with a piece of cloth which it was found together with)•  DNA of “unknown person”The piece of cloth which the rubber band was found with contained the following DNA:•  Appellant’s DNA•  DNA of “unknown person” 42 In particular, the Appellant emphasised that the rubber band was “a significant [piece of] evidence that had been overlook[ed] until now”. The significance, according to the Appellant, was that the rubber band was similar to those used to package the drugs found in the Choices Bag. The Appellant also complained that despite “unknown person’s” DNA being found on the rubber band, DSP Tan did not investigate further.40Foot Note 40×AHS at p 27. 43 In our view, the Appellant has vastly overstated (indeed, grossly exaggerated) the significance of the rubber band. His allegation that the rubber band was similar to those used to package the drugs found in the Choices Bag appears to be nothing more than a bare (and desperate) allegation. Moreover, it is not clear what he meant by “similar”. At any rate, the rubber band was not found near the Choices Bag; it was found near the gear stick.41Foot Note 41×ROP Vol 2 p 204.This argument seems to us to be creating issues where none exists. 44 We also find the Appellant’s criticism of DSP Tan’s alleged failure to investigate further to be groundless. It is not clear to us what further investigations the Appellant thought DSP Tan should or could have undertaken. He could have meant that DSP Tan should have investigated further to find the person whose DNA matched the DNA of the “unknown person” found on the rubber band. If so, this was a misguided criticism, rooted in a failure to appreciate what the DNA report meant when it indicated that “unknown person[‘s]” DNA was found. This point was usefully explained during the trial by Dr Christopher Syn Kiu-Choong (“Dr Syn”), who had prepared the relevant reports. According to Dr Syn, a marking of a DNA finding as that of an “unknown person” meant that it wouldnotbe possible to match this DNA finding,even if a reference was provided.42Foot Note 42×ROP Vol 1E, NE 27 August 2014 p 14 line 8–10.There was thus no way for DSP Tan to investigate further into the “unknown person’s” DNA found on the rubber band. 45 Dr Syn also explained that, in contrast, where a DNA finding was stated in the report as belonging to, say, “male 1” or “male 2”, this meant that it was possible to do a matching if a reference was provided.43Foot Note 43×ROP Vol 1E, NE 27 August 2014 p 14 line 2–6.Given this explanation, we are more concerned about A1B4A, the swabs of five packets of diamorphine found in the Choices Bag that contained DNA of “unknown male 2”. This result meant that the DNA found on A1B4A certainly didnotcome from the Appellant (or Rosli).44Foot Note 44×ROP Vol 1E, NE 27 August 2014 p 17 line 25–31.Our possible concerns lie in the fact that DNA analysis of swabs of other plastic packets of diamorphine found in the car also did not indicate presence of the Appellant’s DNA; instead the other swabs failed to generate DNA profiles.45Foot Note 45×ROP vol 2 p 321 and 323. 46 Be that as it may, we are unable to accept the Appellant’s assertion that the drugs were planted by Rosli and his drug trafficking contacts. We do not see how this assertion can explain away the fact that the plastic packets of drugs were heat-sealed by a heat-sealer that contained the Appellant’s DNA, and which was found locked inside the luggage bag in the Flat. While another person (ie“unknown male 2”) could have had contact with the drugs, that possibility is neither here nor there. It only indicates that another person was involved in that packet but that can in no way raise reasonable doubts about the Appellant’s knowledge of the existence of the drugs found in his car, given the existence of his DNA found on some of the packets. Indeed, it is not unusual for multiple people to handle drugs (or the packaging of the drugs) at various stages of their manufacture, packing, transportation and distribution, and different people may or may not leave traces of their DNA behind. The relevant question is whether the Appellant was one of those people, and not whether others may at some point have been involved. 47 We accordingly agree with the Judge that the Appellant had actual knowledge of the drugs found in the Car. It is thus unnecessary to rely on the presumption under s 21 of the MDA to prove that the appellant had possession of the drugs in the Car. Had it been necessary to apply s 21 of the MDA, we would have found that the presumption of possession under that provision has not been rebutted by the Appellant. 48 For the avoidance of doubt, we wish to make one concluding observation on the interaction between the various presumptions under the MDA. As this court held inTangat [18]–[19], in order to make out the elements of possession and trafficking, the court mayeitherprove actual possession and then rely on the presumption of trafficking under s 17 of the MDA,orrely on the presumption of possession under s 18 of the MDA and then positively prove trafficking. The two presumptionscannot be combined. The same reasoning that applies to the presumption of possession under s 18 of the MDA also applies to the presumption of possession under s 21. Thus, if the Judge had relied on the presumption under s 21, it would have been an error for him to combine that with reliance on the presumption under s 17 (specifically, s 17(c)). 49 Despite having some initial concern that the Judge may have erroneously combined the two presumptions, we are of the view, having examined the GD more closely, that the Judge did not in substance do so. Although the Judge did refer to the Appellant’s failure to rebutbothpresumptions in [47] and [49] of the GD, it is clear from the same paragraphs that the Judge also found as a matter of fact that possession as well as trafficking had beenpositively provenon the evidence before him. Effectively, the Judge decided the case (rightly, in our view) on the basis that both elements had been positively proven, and referred to the presumptions more for the sake of completeness. In general, however, it would be advisable for the sake of clarity to set out expressly and distinctly which elements had been positively proven and which had been satisfied by recourse to a statutory presumption.",
        "Conclusion": "95 For the foregoing reasons, we could not find any basis to interfere with the Judge’s decision to convict the Appellant on both charges. The Appellant’s entire defence consisted of scurrilous accusations and wild, irrational, and unfounded theories which appeared to have been calculated to raise illusory doubts. It is of interest to note that in the Appellant’s written submissions for this appeal (which were prepared by his lawyer, Mr Amolat Singh, before he was discharged and re-appointed as a McKenzie friend as noted at [2] above), in a passage seeking to explain the Appellant’s inconsistent evidence as to who could have planted the drugs to frame him, it is stated that “[the Appellant’s] guess as to who might have planted the drugs necessarily entails a great degree of speculation on his part”.100Foot Note 100×Written submissions of the Appellant at para 27(a).That really says it all. The same goes for his Number Nine Theory (see [80] above). 96 While we note that the Appellant has also appealed against sentence, he has not presented substantive arguments in this regard. Given that (in the absence of a certificate of substantive assistance from the Public Prosecutor) the death penalty is mandatory for the capital charge, we are satisfied that it was correctly ordered. This renders the appeal against the sentence on the non-capital charge academic. In any event, we also find no reason to interfere with the sentence imposed for that charge. 97 We therefore dismiss the appeal in its entirety. 98 In closing, we wish to record our appreciation for the efforts of the various lawyers who served as the Appellant’s McKenzie friends and appointed counsel at trial and in the appeal before us. Although they were unable to dissuade the Appellant from his regrettable conduct of his defence, they should be commended for their service and professionalism under trying conditions. Chao Hick Tin      Andrew Phang Boon Leong    Judith PrakashJudge of Appeal     Judge of Appeal                            Judge of Appeal Amolat Singh (Amolat & Partners) and Liang Hanwen Calvin (Tan Kok Quan Partnership) as McKenzie friends for the appellant in person;Anandan Bala and Rajiv Rai (Attorney-General’s Chambers) for the respondent.",
        "Whether the Appellant’s allegation that he had been framed, through the planting of the drugs and tampering of the evidence, raised any reasonable doubts about his convictions": "",
        "The CNB officer’s alleged motives for tampering with the evidence": "51 According to the Appellant, the CNB officers planted the drugs in the Flat and tampered with the DNA evidence against him in order to hide two “aggravated assaults” which they had committed on him on the day of his arrest.46Foot Note 46×AHS at p 35.The first alleged assault took place in a CNB car, when he was driven from the place of his arrest to where the Car was parked,ie, the City Square Mall car park. During that short journey the Appellant was asked where his car key was, to which he responded with a vulgarity. A CNB officer then held the Appellant’s head in a headlock and asked him to apologise, while another CNB officer punched the Appellant in the left thigh.47Foot Note 47×ROP Vol 1, NE 2 October 2013 p 121 line 20–p 122 line 1. 52 The second alleged assault took place in the Flat some hours later, at 4.30pm, just before CNB officers began taking photographs and swabbing the exhibits for DNA analysis.48Foot Note 48×ROP Vol 1A, NE 10 October 2013 p 80 line 1–3.At this point the Appellant was restrained and seated on a swivel chair. A CNB officer allegedly slammed the Appellant’s right shoulder with the officer’s hand, while another CNB officer pulled the chair, causing him to fall to the ground in a sitting position.49Foot Note 49×ROP Vol 1A, NE 10 October 2013 p 79 line 8–11. 53 The Prosecution’s position was that neither of the assaults took place, although they accepted that in the Flat the Appellant had fallen onto the floor in a seated position.50Foot Note 50×PCS at para 20(e) (ROP at p 633).The explanation provided by DSP Tan for the Appellant’s fall was that the Appellant behaved aggressively and had to be compelled to be seated. At some point the Appellant “fell from his chair while attempting to stand up from the chair”.51Foot Note 51×ROP Vol 2C p 1837 (DSP Tan’s statement). 54 Looking at the medical evidence in this regard, we note that a letter from the Alexandra Hospital dated 6 October 2013 stated that when the Appellant was examined on 9 October 2010 (two days after the date of his arrest and the alleged assaults), there was “mild tenderness over the right lower back and right neck”, but “no obvious bruising noted”.52Foot Note 52×ROP Vol 2 p 284.This left some ambiguity as to what “mild tenderness” meant, but unfortunately the doctor who examined the Appellant was not called to give evidence. In oral arguments before us, the Prosecution suggested that the statement of “mild tenderness” could be a result of self-reporting by the Appellant,ie, “when the doctor examines [the Appellant], [he] says it is pain[ful] when the area is touched”.53Foot Note 53×Record of oral hearing at 11:23:55–11:24:06. 55 In our view, a literal reading of the phrase “mild tenderness” already suggested that if there were any symptom, it was mild. This was corroborated by the statement in the letter that there was a “lack of obvious bruising”. We also note that the Appellant had a medical history of cervical and lumbar spondylosis that gave him back and neck pain.54Foot Note 54×ROP Vol 2 p 277.His aggressive behaviour against the CNB officers might also have necessitated some degree of restraint being applied on him. On the whole, the evidence does not support the Appellant’s allegations that “aggravated assaults” took place, motivating the CNB officers to make “extensive efforts” (in the Appellant’s own words)55Foot Note 55×AHS at para 35.to frame him. 56 We would also wish to make these further observations on the alleged motivation of the CNB in wanting to frame the Appellant. 57 First, even if we assume for the sake of argument that the assaults took place and the Appellant wanted to cover up those assaults, it is difficult to understand how framing the Appellant with either or both of the two charges would help in covering up the assaults. Indeed, by framing the Appellant, the CNB officers would be laying the groundwork for the Appellant to be prosecuted in court, and in turn the Appellant would be sure to raise these assaults with the trial judge. 58 Further, it will be recalled that the Appellant had alleged (at least at trial, if not also before this court) that the CNB officers had planted the drugs in the Flat (see above at [29]–[30]). The planting of drugs in the Flat would raise the stakes insofar as it set the stage for acapitalcharge to be proceeded with against the Appellant. This was bound to invite further scrutiny into the acts of CNB officers, and was not something that CNB officers would do if all that they wanted was to cover up the alleged assaults. 59 Furthermore, the sequence of events also casts doubts on the Appellant’s allegations: on the Appellant’s case, the second alleged assault took place while he and the CNB officers had already come into the Flat. On his account of the events, the Appellant was saying that the planting of the incriminating evidence against him by CNB officers was done before he was brought to the Flat. So such planting of the incriminating evidence in the Flat could not have been motivated by the second assault which allegedly took place later at the Flat.  The assertion as regards the alleged second assault is thus flawed. 60 Moreover, the time lapse between the moment the Appellant was arrested up to the time he was brought back to the Flat was just a matter of a few hours. As mentioned above at [23], several things in the Flat relating to drug trafficking had his DNA, including some of those things in the locked main compartment of the luggage bag. It defies common sense and logic that CNB officers who were on standby and tailing him, presumably following a tip-off, would plan to “fix him up” even before knowing whether he would be cooperative or otherwise. It would have made no sense for them to have wanted to undermine the propriety or legality of their own actions. Equally importantly, there is nothing to suggest that any of the CNB officers had any cause to want to frame or fix him. Thus, in our judgment, the alleged assaults were very implausible sources of motivation for the alleged planting of drugs and tampering of evidence. The incoherence of the Appellant’s allegations suggest that it is far more likely that neither the planting of the drugs, nor the alleged assaults occurred. We draw a similar conclusion with regard to the claim regarding tampering with the DNA evidence. We would only add this. It is likely that based on what the CNB officers said, what transpired was not that the Appellant was assaulted, but that the Appellant’s aggressive behaviour towards the officers required him to be restrained. The overall picture that emerges – based not on only on the CNB officers’ testimony, but also the Appellant’s own statements that he was uncooperative and used vulgarities on the CNB officers – is that the Appellant was trying to be difficult and might even have been hoping to cause an altercation. 61  In any case, the evidence given by the CNB officers was not consistent with that of men who were trying to frame the Appellant and cover up the alleged assaults. It will be recalled that SSI Heng candidly admitted that he could not confirm that the white bundle that he saw the Appellant carrying was in fact the Choices Bag (see above at [36]). DSP Tan and other CNB officers also accepted that the Appellant had fallen in the Flat (see above at [53]). Further, there was no attempt to prevent or delay the medical examination of the Appellant (which occurred only two days after his arrest), even though this would have uncovered any significant injury which the Appellant would have suffered had he been physically attacked. 62 In sum, we are not persuaded that the CNB officers were motivated to frame the Appellant. We note as well that the Judge also found the Appellant not to be a credible witness at all. Nevertheless, we shall proceed to examine the precise allegations of tampering of evidence that the Appellant has raised.",
        "Allegations of evidence-tampering by the CNB officers": "63 The Appellant alleged that DSP Tan and other CNB officers (and at times with the assistance or at least acquiescence of the Health Sciences Authority (“HSA”))56Foot Note 56×AHS at p 41.had tampered with many different pieces of evidence. The alleged tampering efforts included the concealing of certain photographs,57Foot Note 57×AHS at p 3–4.the planting of the Appellant’s DNA on certain exhibits,58Foot Note 58×AHS at p 41.the concealing of certain long statements of the Appellant59Foot Note 59×AHS at p 23.and the alteration or forgery of other long statements given by the Appellant.60Foot Note 60×POA at para 8; AHS at p 52. 64 Given the central role that the DNA evidence has played in the present case, we will focus our analysis on the Appellant’s allegation that his DNA was planted by the CNB officers on the exhibits. We will then examine in detail another allegation made by the Appellant –  that a certain long statement that he had made was concealed by DSP Tan – as the issue was canvassed at length in the oral hearing before us. We will then briefly assess the remaining allegations. Allegations of planting the Appellant’s DNA evidence on certain exhibits 65 The Appellant places special importance on the  number nine in respect of his allegations that his DNA was planted on the exhibits by CNB officers (the number “nine” also played an important role for a few other allegations: see [27] of the GD). “Nine” was the team number of the CNB team who was investigating him, and the Appellant alleged that DSP Tan used the number nine to mark the exhibits which were tampered (or as the Appellant calls it, “contamination”). The Appellant submits before us that “any one of [DSP Tan’s] contamination exactly contain the number nine, each and every one of them”.61Foot Note 61×Record of oral hearing at 10:49:10–10:49:15. 66 The Appellant even went as far as to include the exhibit B1E2D1 (which was a swab of five plastic packets of diamorphine found in the flat) as one of the exhibits which he claimed was contaminated, even though DNA analysis of B1E2D1 did not generate any DNA profile. The Appellant’s explanation for doing so was that “it added to the number 9 to confirm as [DSP Tan’s] signature of tampering”.62Foot Note 62×AHS at p 41. 67 The proposed significance of this alleged pattern was that the number nine was a “rather proud insignia from Special Investigation Team 9 which was led by [DSP Tan] … to mark all false contaminations and events of cases”.63Foot Note 63×The Appellant’s Last Submissions dated 23 May 2017 at p 2.In other words, the number nine and its permutations were – according to the Appellant – a sort of calling card left by the CNB officers to mark their handiwork. This notion was referred to by the Judge as the Number Nine Theory (see GD at [27]), and we will adopt the same terminology. 68 We wish to state that the Number Nine Theory is absurd on its face, runs counter to common sense, and could justifiably be rejected out of hand. It relies on arbitrary and inconsistent methods of manipulating the characters used to mark the exhibits in order to arrive at the number nine. Moreover, if indeed the CNB officers had tampered with the evidence, the last thing they would have wished to do would have been to mark the exhibits in a manner which would point to a pattern of tampering. Despite these obvious weaknesses, we consider that given the great lengths to which the Appellant went in advancing his argument, it may be worth analysing the Number Nine Theory in greater depth in order to dispel all doubt. 69 As a starting point, we acknowledge that if it could be shown that the incriminating exhibits were all consistently marked in a certain manner which was unusual and departed from the usual practice of the CNB, and if no explanation was forthcoming, that might raise serious concerns. However, upon close scrutiny, we find the Number Nine Theory to be nothing more than a fanciful theory that was haphazardly constituted by applying different methods of calculation for different exhibits, with the sole aim of contriving to arrive at the number nine. The whole theory is baseless. We shall elaborate. 70  According to the Appellant, there were “exactly nine exhibits” with the Appellant’s DNA on them. The exhibits listed by the Appellant are:64Foot Note 64×AHS at p 41; Appellant’s reference at p 146 (page numbering following the PDF document). Marking on the exhibitDescription of exhibitA1Choices BagB1DOne of the three plastic bags containing diamorphine that was found in the luggage bag in the Flat.B1EOne of the three plastic bags containing diamorphine that was found in the luggage bag in the Flat.B1FA plastic bag containing trafficking paraphernalia that was found in the luggage bag in the Flat.B1GThe box of the heat-sealer found in the luggage bag in the Flat, as referred to above at [38(b)].B1G1The heat-sealer found in the luggage bag in the flat, as referred to above at [38(b)].B1HA disposable glove paper box.B1JOne of the three plastic bags containing diamorphine that was found in the luggage bag in the flat.B1J3Brush, knife with cover, scissors and empty plastic bags found in B1J. 71 The Appellant claims that the marking of the number nine on these exhibits “was the number of exhibits itself, ie, NINE!”65Foot Note 65×AHS at p 41.However, it seems to us that the selection of these nine exhibits served no other purpose, other than to add up to nine, thus creating anillusionof conformity with the Number Nine Theory. In fact, contrary to the Appellant’s claim that exactly nine exhibits contained his DNA, at least eight more exhibits have his DNA.66Foot Note 66×ROP Vol 2 p 314–316. 72 To be fair to the Appellant, it may be said that most of these eight exhibits were not incriminating (eg, sunglasses found in the car, or the piece of cloth found in the car that was found alongside the rubber band that was referred to above at [41]). However, there are two exhibits which have his DNA that are of some importance. First, there are the swabs of five plastic packets of diamorphine which were found in B1E and marked “B1E2F1”. Second, there is the Appellant’s hair which was found heat-sealed onto one of the plastic packets containing the diamorphine (as referred to above at [23(c)]). It appears that both this one plastic packet67Foot Note 67×ROP Vol 2C p 1748 (conditioned statement of Chow Yuen San Vicky from the Forensic Chemistry and Physics Laboratory of HSA).and the hair68Foot Note 68×ROP Vol 2A p 983 (report from the DNA Profiling Laboratory of the HSA).that was found on it were given the same marking, “COLLECTIVE5-B1E3D1 (Packaging)-E4”. For clarity, we will be using this marking to refer to the hair only. 73 The importance of these two exhibits was not lost on the Appellant: he had attempted to show that these exhibits were marked with the number nine for contamination. In relation to B1E2F1, he derived the number nine in the following manner. He assigned F a value of six as it is the sixth letter of the alphabet. He then added 2 + 6 + 1 (representing the last three characters of B1E2F1) to obtain the number nine.69Foot Note 69×AHS at p 39.We would observe, at this juncture, that if one were to apply the same method of calculation to B1E2D1 (which, as noted above at [66], was also alleged by the Appellant to have been tampered with), one would obtain the number seven instead.70Foot Note 70×2 + 4 + 1 = 7.Additionally, it should also be clear that this method of calculation could not be applied to the nine exhibits listed above as they did not have six characters. 74 As regards COLLECTIVE5-B1E3D1 (Packaging)-E4, the Appellant’s method of deriving nine was more complicated. This was done using the markings of the following three exhibits: ExhibitDescription of exhibitD1This is the weighing scale that was recovered from the kitchen (not to be confused with the two weighing scales found in the luggage bag) that was referred to at [8] above.71Foot Note 71×RS at para 24, item 10 of the table and the footnotes therein.This weighing scale was stained with diamorphine.72Foot Note 72×ROP Vol 2A at p 948.It was not sent for DNA analysis.73Foot Note 73×ROP Vol 2A at p 974.B1E2D1These are swabs of five plastic packets of diamorphine that were found in the flat (specifically, in B1E). This is the same exhibit referred to above at [66] and [73]. The Appellant’s DNA was not found on B1E2D1.A strand of hair was found heat-sealed on the same plastic packets that were subject of the swabs in B1E2D1. This strand of hair was also sent for DNA analysis but no DNA profile was generated.74Foot Note 74×ROP Vol 2A at p 316.B1E3D1This is another set of swabs of five plastic packets of diamorphine that were found in the flat (specifically, in B1E). The Appellant’s DNA was not found on B1E3D1.COLLECTIVE5-B1E3D1 (Packaging)-E4 was found heat-sealed on the same plastic packets that were subject of the swabs in B1E3D1. 75 We pause to observe that the marking “COLLECTIVE5-B1E3D1 (Packaging)-E4” was not directly used by the Appellant in his calculations. Nevertheless, we note that “B1E3D1” (which he used in his calculations) was also present in “COLLECTIVE5-B1E3D1 (Packaging)-E4” as well as the plastic packets on which his hair was found. These plastic packets were marked “COLLECTIVE5-B1E3D1 (Packaging)”.75Foot Note 75×ROP Vol 2B at p 1055.In any event, we will assess the Appellant’s case as he has presented it, and focus on the markings of the three exhibits that he has selected. 76 The Appellant then employed a similar methodology as was done with B1E2F1 by assigning the different letters a value based on each letter’s sequence in the alphabet. He thus obtained the following values for each exhibit: D1  4 + 1 = 5; B1E2D1  2 + 1 + 5 + 2 + 4 + 1 = 15; B1E3D1  2 + 1 + 5 + 3 + 4 + 1 = 16. Next, the Appellant added the three values together (ie, 5 + 15 + 16) to obtain 36. He then added three and six together to reach nine.76Foot Note 76×AHS at p 41. 77 We have difficulty comprehending the rationale for this method of calculation. To begin with, it is not clear why these three exhibits were considered together. The Appellant’s explanation is that “[i]t was a series of D1”.77Foot Note 77×AHS at p 41.We understand this to mean that the Appellant considered these three exhibits to be of the same series because “D1” appears in the markings of all three exhibits. Yet if this is the rationale, many other exhibits should have been included in this calculation too, such as  the exhibits marked “B1E1D1”, “B1E4D1”, “B1E5D1”, “B1E6D1” and “B1D1”.78Foot Note 78×ROP Vol 2A at p 974. 78 We also considered whether there is any other link among the three exhibits selected by the Appellant in his calculations, but could find none. For example, in terms of the handling of the exhibits, D1 was handed to the Illicit Drugs Laboratory of the HSA by DSP Tan on 12 October 2010,79Foot Note 79×ROP Vol 2A at p 948.while  B1E2D1 and B1E3D1 were handed to the DNA Profiling Laboratory of the HAS by DSP Tan on 13 October 2010.80Foot Note 80×ROP Vol 2A at p 974.Thus, we could find no good reason why the three exhibits selected by the Appellant could be considered of the same series. 79 In addition, the method of calculation used for these three exhibits was also inconsistent with prior methods. Unlike the method of calculation for the nine exhibits, the method of calculation here did not add up the quantity of exhibits. As compared to the method of calculation for B1E2F1, which also added up the values (and values assigned to the letters) of the exhibit’s marking, there were at least three inconsistencies. First, as mentioned, the values from the markings of different exhibits were now calculated together, instead of considering only one exhibit’s marking at a time. Second, when calculating the values for B1E2D1 and B1E3D1, the Appellant added the values for all six characters, despite only adding the values for the last three characters for B1E2F1. Third, this method of calculation involved a new step of adding the constituent numbers of the final sum (ie, 3 + 6) to arrive at nine, instead of just settling on the final sum (ie, 36). 80 The foregoing analysis clearly shows that the Number Nine Theory is either a consciously contrived excuse or – if the Appellant truly believes in its accuracy – a mere figment of his overactive imagination. In either case, the Number Nine Theory serves only to create an appearance of suspicion and/or doubt where none, in fact, exists. There was no uniformity in the way the Appellant analysed the characters used to mark the exhibits. His analysis was merely a discordant patchwork of calculation methods that strained to arrive at the figure nine. We accordingly do not consider the Number Nine Theory to have raised any reasonable doubt, or any doubt at all, about the Appellant’s convictions. To put it mildly, it is a fanciful conspiracy theory concocted to support his unfounded assertion that the CNB officers were intent on framing him for an offence he had no part in. The alleged missing statements 81 At the oral hearing before us, the Appellant placed particular emphasis on the allegation that there was a long statement of his that was concealed by DSP Tan (although the Appellant did maintain that all the statements he had made were important). This alleged missing long statement was said to be important for the Appellant because he claimed to have said in that statement that when he left his flat on that fateful morning, the luggage bag was not at the position in which it was eventually found.81Foot Note 81×Record of oral hearing at 10:22:13–10:24:18. 82 In support of his allegation, the Appellant referred to the testimony of the interpreter, Maria Binte Bazid (“the Interpreter”),82Foot Note 82×Appellant’s reference at p 89–90 (page numbering following the PDF document).who was present at the lock-up when two (out of a total of four) long statements of the Appellant were recorded. The two long statements the Interpreter was involved in were dated 14 October 2010 and 21 October 2010 respectively.83Foot Note 83×ROP Vol 2 p 144 and 148 (first pages of the long statements of 14 October 2010 and 21 October 2010).At trial, the Interpreter testified that she remembered that cancellations were made on a long statement (although the date of this long statement was not specified).84Foot Note 84×ROP Vol 1D, NE 19 August 2014 at p 21 line 19–20.The Appellant then asked for more details in the following exchange:85Foot Note 85×ROP Vol 1D, NE 19 August 2014 at p 22 line 2–4. Q  Okay, you said earlier that there were some cancellations, do you remember how many lines, just estimate, how many lines that I actually cancelled? A  I---I can’t really remember but probablymore than three lines. [emphasis added] 83 The Appellant seized upon the phrase “more than three lines” to support his allegation that there was a missing statement. It was clear that the two long statements in evidence that the Interpreter was involved in didnotcontain any cancellation of lines, though there were two instances of cancellation of individual words in the long statement taken on 14 October 2010.86Foot Note 86×ROP Vol 2 p 144–145.The Appellant therefore submitted that there must have been a long statement with cancellations of more than three lines that was concealed by DSP Tan. 84 We were unable to accept the Appellant’s submission. It was clear to us that the Interpreter herself was unsure of her answer in the passage cited above, for she had begun her answer with “I can’t really remember”. In addition, we note that the question of “how many lines were cancelled” was a matter of fine detail. The Interpreter could not have been expected, in a matter such as this, to recall with clarity when close to four years had elapsed since the event. In the nature of her job, undertaking such interpreting work would be routine. This was corroborated by the Interpreter’s own evidence, which she subsequently gave when recalled to the stand to clarify her evidence. She testified as follows:87Foot Note 87×ROP Vol 1F, NE 11 March 2016 p 41 line 20–31. Q Could you tell us what you were referring to when you said you remembered that lines were cancelled by the accused because these are the statements? So could you just tell us, looking at the statements, were you referring to anything in particular? A I can’t find the lines here--- Q Okay. A  ---the cancelled lines. So I’m---I’m not sure whether I got mixed up with another---erm, er, with another, er, interview---with another, er, interpreting---er, interview that I went. Er, so honestly I can’t remember right now. Q  So you are saying that you are not--- A  Yah, now I’m not sure. 85 The Appellant’s response to the Interpreter’s clarification was that he believed that the Interpreter “was told to create doubt” about her earlier testimony.88Foot Note 88×Appellant’s reference at p 90 (page numbering following the PDF document).No basis was provided for this allegation, and we are unable to give it any credit. We would emphasise that there is no suggestion that something unusual had occurred on those two occasions when the Interpreter was involved in the recording which would have made her remember the happenings on those two days. Common experience will tell us that that the inability to remember things which are routine is completely mundane and banal. 86 In addition, looking at the matter more broadly, it is hard to understand why the CNB officers would conceal the allegedly missing long statement. It is quite clear that the four long statements adduced in evidence are “negative statements”, in that the Appellant denied guilt in these long statements. The Appellant’s denials were dutifully recorded by the CNB officers in all four long statements (as well as in the two cautioned statements). Having done so, it was inconceivable that the CNB officers would conceal that particular long statement as alleged by the Appellant, just to suppress one particular denial regarding the luggage bag. It is senseless. We are satisfied that, like the Number Nine Theory, this alleged missing long statement is a desperate attempt to cast any possible doubt, however fanciful, on the way the CNB officers carried out their work. There was simply no basis to allege that the officers did suppress or would have wanted to suppress any of the information contained in the Appellant’s statements. 87 Accordingly, this allegation of the Appellant also does not raise any reasonable doubts as to the Appellant’s conviction. Other allegations of evidence-tampering 88 The Appellant has also made numerous other allegations of evidence-tampering. We do not propose to examine each and every allegation in detail in this judgment, as we are satisfied upon a perusal of the record that these allegations were thoroughly ventilated at trial and correctly dismissed by the Judge. 89 For example, in response to the Appellant’s allegation that the CNB officers had lied about his movement on the day of arrest, the tow truck driver who towed the Appellant’s car, Lim Ching Boon (“the Driver”) was called to give evidence. The testimony of the Driver and the receipts he produced corroborated the CNB officers’ accounts.89Foot Note 89×GD at [42(b)] and the references therein (ROP vol 3 at p 22).The Appellant’s response was to allege that the Driver did not in fact tow the Appellant’s car, and had been called by the CNB officers to testify as he was “willing to lie for the CNB”.90Foot Note 90×ROP Vol 1B, NE 21 May 2014 p 62 line 22–p 63 line 7. 90 Another example was the Appellant’s allegation that his statements had been altered or forged. In pursuit of this allegation, the Appellant applied to the Registrar for funds to appoint a handwriting expert, and his request was acceded to.91Foot Note 91×Letter from Registrar dated 13 February 2015.Yang Chiew Yang (“the Handwriting Expert”), a Consultant Forensic Scientist from The Forensic Experts Group, was appointed for this purpose. She then prepared a report in accordance with the Appellant’s instructions.92Foot Note 92×ROP Vol 2 p 302–304 (instructions); p 286–301 (Forensic report on handwriting). 91 The report of the Handwriting Expert, however, was not in the Appellant’s favour. The Handwriting Expert had examined,inter alia, 30 signatures of the Appellant that appeared in the four long statements of the Appellant and which the Appellant had questioned as possible forgeries. Her report indicated that 13 such signatures were written by him, three were “likely” to have been written by him”, and 13 had “indications” that they were written by him. The last remaining signature was inconclusive.93Foot Note 93×ROP vol 2 p 292–293.When the Handwriting Expert gave evidence in court as the defence’s witness, she explained that “inconclusive” meant that the signature was too different from the sample signature for any comparison to be made (as opposed to being an indication that the signature was a forgery).94Foot Note 94×ROP vol 1H, Day 43 p 49–51.Accordingly, the Handwriting Expert’s report severely undermined the Appellant’s allegation that his long statements had been altered or forged. 92 Faced with the unfavourable evidence from his own witness, the Appellant’s response was to allege that the Handwriting Expert “was instructed to LIE just as other witnesses had LIED”.95Foot Note 95×AHS at p 52. 93 We regret to observe that such a response was unfortunately characteristic of the Appellant’s conduct in these proceedings. When confronted with evidence showing his guilt, he was quick to make wild allegations that various persons had conspired to frame him. When these wild allegations were disproved by evidence from other sources, the Appellant would allege that these other sources were also part of the conspiracy with those persons. 94  This fictitious web of conspiracy that the Appellant had spun expanded over the course of the trial, had grown to a considerable size by the time of this appeal, and continued to grow even after the oral hearing through the Appellant’s unsolicited further submissions. This web engulfed not only the CNB officers, but also the HSA personnel, the Interpreter, the Driver, the security manager of City Square Mall,96Foot Note 96×The Appellant’s Final Further Submissions dated 29 May 2017 at pp 6–7.the Appellant’s family’s domestic worker, Meisaroh (see the GD at [32], [35], [43(d)–(e)] and [45]), and also the Appellant’s Handwriting Expert. The Judge, too, was accused of intimidating the Appellant (although the Appellant stopped short of asserting that the Judge was an actual member of the conspiracy), when all the Judge had done was ask a prisons officer present in the courtroom about what disciplinary measures could be used to deter the Appellant from persistently misbehaving himself during the trial.97Foot Note 97×The Appellant’s Last Submissions dated 23 May 2017 at p 1.Even the Appellant’s lawyers were not spared: two of his lawyers, having represented him for part of his trial, were accused by him of assisting the Prosecution “to introduce [a] false witness”.98Foot Note 98×AHS at para 49.By the Appellant’s own count, his case was that a total of 36 persons had lied simply to “fix him up”.99Foot Note 99×The Appellant’s Final Further Submissions dated 29 May 2017 at p 7.The Appellant would have this court believe thatallthese men and women, whether related to CNB or not, somehow agreed to frame the Appellant in acapital casejust to suppress two alleged assaults committed by CNB officers in which the Appellant allegedly suffered “mild tenderness”. Such an outrageous accusation has only to be stated to be dismissed; it does not come close to raising a reasonable doubt as to the Appellant’s guilt."
    }
}