{
    "case_title": "Harven a/l SegarvPublic Prosecutor",
    "ncitation": "[2017] SGCA 16",
    "coram": "Chao Hick Tin JA (delivering the judgment of the majority):",
    "sections": {
        "Introduction": "1 The appellant, Harven a/l Segar (“the Appellant”), was charged with three counts of trafficking in controlled drugs under s 5(1)(a) read with s 5(2) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the MDA”), and was convicted after a two-day trial of all three charges. He is appealing against his conviction on the basis that he did not know that the black bundles found in his possession contained drugs. He submits that based on the evidence before the court, the presumption of knowledge under s 18(2) of the MDA should be held to have been rebutted. 2 This court has, on numerous occasions, expounded on the burden and standard of proof imposed on an accused person seeking to rebut the presumption of knowledge under s 18(2) of the MDA. The burden of proving a lack of knowledge is undoubtedly for the accused person to discharge, and there are good reasons for having this exceptional evidential rule as part of our criminal law. But, the inherent difficulties of proving a negative (in the present context, a lack of knowledge) must be borne in mind (seePublic Prosecutor v Sibeko Lindiwe Mary-Jane[2016] SGHC 199 at [61]), and the burden on an accused person faced with this task should not be made so onerous that it becomes virtually impossible to discharge. How this burden may be discharged is certainly not a matter that can be spelt out in a fixed formula. It is the overall picture that emerges to the court which is decisive as the court is here concerned not with a scientific matter, but with the state of a person’s mind. A factor which is considered to be critical in one case may not be so in another.",
        "Background facts": "3 The Appellant was, at the material time, a 20-year-old Malaysian residing in Johor Bahru and working in Singapore as a prime mover driver at the premises of the Port of Singapore Authority (“PSA”).1Foot Note 1×Statement of Agreed Facts at para 2 (ROP vol 2 at p245)He had then held that job for about three years. He earned about $2,000 a month and commuted daily (except on his rest days) between Johor Bahru and Singapore for work. On 12 June 2013, at about 9.45pm, officers from the Central Narcotics Bureau (“CNB”) arrested the Appellant outside a 7-Eleven store situated at the entrance to Hoa Nam Building along Jalan Besar.2Foot Note 2×Statement of Agreed Facts at para 7 (ROP vol 2 at p246)The CNB officers were then in the vicinity looking out for one Sulaimi bin Ismail (“Sulaimi”), whom they believed to be involved in drug activities.3Foot Note 3×Statement of Agreed Facts at para 3 (ROP vol 2 at p245)The Appellant was apprehended after he was seen meeting and interacting with Sulaimi, and entering the 7-Eleven store with him.4Foot Note 4×Statement of Agreed Facts at para 5 (ROP vol 2 at p246)At that time, the Appellant was carrying a black haversack (“the Haversack”). In it, the CNB officers found,inter alia, two round bundles individually wrapped in black tape (“A1” and “A2”), one rectangular bundle wrapped in black tape (“A3”) and an unused roll of black tape.5Foot Note 5×Statement of Agreed Facts at para 8 (ROP vol 2 at p246) 4 A1, A2 and A3 (collectively, “the Bundles”) were analysed by the Illicit Drugs Laboratory of the Health Sciences Authority (“the HSA”) and were found to contain the following:6Foot Note 6×Statement of Agreed Facts at para 14 (ROP vol 2 at p247) (a) A1 and A2 contained a granular/powdery substance weighing a total of 902g, of which not less than 53.74g was diamorphine.7Foot Note 7×Statement of Agreed Facts at para 16 (ROP vol 2 at p248) (b) A3 contained: (i) 232.8g of vegetable matter which was found to be cannabis; and (ii) 259.8g of fragmented vegetable matter which was found to contain cannabinol and tetrahydrocannabinol.8Foot Note 8×Statement of Agreed Facts at para 17 (ROP vol 2 at p248) 5 Three charges under s 5(1)(a) read with s 5(2) of the MDA were brought against the Appellant for: (a) trafficking in a Class A controlled drug consisting of two packets of granular/powdery substance weighing a total of 902g which, upon analysis, was found to contain not less than 53.74g of diamorphine (the first charge); (b) trafficking in a Class A controlled drug consisting of 232.8g of vegetable matter which, upon analysis, was found to be cannabis (the second charge); and (c) trafficking in a Class A controlled drug consisting of 259.8g of fragmented vegetable matter which, upon analysis, was found to contain cannabinol and tetrahydrocannabinol (the third charge).",
        "The Appellant’s defence": "6 The Appellant’s sole defence at the trial was that he did not know that the Bundles contained controlled drugs.9Foot Note 9×Transcripts day 3, p3 at lines 3-6 (ROP vol 1)He claimed that the Bundles had been passed to him by one “Mogan”. The Appellant became acquainted with Mogan in Singapore in the course of work three weeks before he was arrested. In the course of those three weeks, the Appellant became friends with Mogan. He gave Mogan rides on his motorcycle between Johor Bahru and their workplace in Singapore, and also had breakfast with Mogan when they went back to Johor Bahru together in the morning after their night shifts.10Foot Note 10×Transcripts day 3, p4 at lines 10-19 (ROP vol 1) 7 The Appellant claimed that on 12 June 2013, Mogan asked him to bring some “jaman” (“things” in Tamil) to Singapore and deliver them to a friend as a favour because Mogan had lost his passport and could not travel to Singapore himself.11Foot Note 11×Transcripts day 2, p13 at lines 6-27; Transcripts day 3, p4 at lines 28-31, p5 at lines 1-2 (ROP vol 1)The Appellant agreed to do so because he trusted Mogan as a friend.12Foot Note 12×Transcripts day 3, p4 at lines 21-26, p5 lines 3-7 (ROP vol 1)The Appellant claimed that Mogan passed him a black plastic bag, but he did not know what was inside. He did not ask Mogan about the contents of that black plastic bag,13Foot Note 13×Transcripts day 3, p4 at lines 23-24 (ROP vol 1)nor did he have any reason to be suspicious about what was inside.14Foot Note 14×Transcripts day 3, p6 at lines 3-8, p10 at lines 13-32 (ROP vol 1)He simply placed the “jaman” in the front basket of his motorcycle.15Foot Note 15×Transcripts day 3, p5 at lines 12-13 (ROP vol 1)Mogan told the Appellant to call him after he reached Singapore for more details as to who to pass the “jaman” to and where to go to do that. Mogan gave a mobile phone of his (“HS-HP1”) to the Appellant for this purpose.16Foot Note 16×Transcripts day 2, p32 at lines 5-13 (ROP vol 1) 8 Before the Appellant cleared the Johor Customs, he stopped at a petrol kiosk to pump petrol. It was there that he saw that the black plastic bag which Mogan had passed to him was torn and discovered that there were three black-taped bundles (ie, the Bundles) inside.17Foot Note 17×Transcripts day 3, p5 at lines 15-18 (ROP vol 1)He thought that they were presents.18Foot Note 18×Transcripts day 3, p10 at lines 18-22 (ROP vol 1)Because the black plastic bag was torn, the Appellant threw it away and transferred the Bundles from the front basket of his motorcycle to the centre compartment of the Haversack.19Foot Note 19×Transcripts day 3, p5 at lines 18-20 (ROP vol 1)From the petrol kiosk, the Appellant drove to a food stall some distance away where he stopped to buy a packet of food. He likewise put the packet of food into the centre compartment of the Haversack.20Foot Note 20×Transcripts day 3, p5 at lines 26-31 (ROP vol 1) 9 The Appellant then proceeded to clear the Johor and the Singapore Customs. At the Singapore Customs, he opened the Haversack for inspection by the customs officers.21Foot Note 21×Transcripts day 3, p6 at lines 10-11 (ROP vol 1)After clearing customs, the Appellant called Mogan using the mobile phone HS-HP1 to ask him how and where to deliver the “jaman”. Mogan sent a text message to the Appellant on HS-HP1 with the telephone number of his friend, and asked the Appellant to contact the friend. Mogan’s friend turned out to be Sulaimi. The Appellant called the number sent by Mogan, and the person who answered the call (ie, Sulaimi) asked him to go to a 7-Eleven store along Jalan Besar. There, the Appellant met Sulaimi for the first time.22Foot Note 22×Transcripts day 3, p6 at lines 13-31 (ROP vol 1)Sulaimi asked the Appellant whether he wanted a drink and he said “yes”. Hence, they walked into the 7-Eleven store, where Sulaimi picked up some food and drink and the Appellant, only a drink. The Appellant came out of the store first and sat on a stone slab outside, waiting for Sulaimi to pay for the purchases. At that point, he was apprehended by a team of CNB officers. Because of the arrest, he did not have the chance to pass the Bundles to Sulaimi.23Foot Note 23×Transcripts day 3, p7 at lines 2-7 (ROP vol 1)",
        "The High Court’s decision": "10 The High Court judge (“the Judge”) convicted the Appellant of the three charges brought against him. He did not issue a written judgment. Instead, he delivered an oral judgment at the conclusion of the hearing on 30 September 2015, where he explained his reasons for convicting the Appellant as follows: (a) The Appellant had to rebut: (i) the presumption under s 18(2) of the MDA that he knew that the Bundles contained drugs; and (ii) the presumption under s 17 that he had the drugs for the purpose of trafficking.24Foot Note 24×Transcripts day 3, p33 at lines 2-7 (ROP vol 1) (b) One factor in the Appellant’s favour was that he openly gave the Haversack to the customs officers for inspection at the Singapore Customs without attempting to hide the Haversack or the Bundles in it.25Foot Note 25×Transcripts day 3, p34 at lines 6-21 (ROP vol 1) (c) The fact that the Appellant’s DNA was found on theadhesiveside of the tape used to wrap A2 was an important consideration. In this regard, the evidence of the Prosecution’s forensic expert, Ms Tang Sheau Wei June (“Ms Tang”), did not support the Defence’s submission that the Appellant’s DNA had been transferred to the adhesive side of the tape because of the way in which the tape was handled.26Foot Note 26×Transcripts day 3, p35 at lines 2-12 (ROP vol 1) (d) The unused roll of black tape found in the Haversack “require[d] explanation”.27Foot Note 27×Transcripts day 3, p35 at lines 13-17 (ROP vol 1) (e) There were sufficient suspicious circumstances to justify the Appellant asking Mogan what the Bundles contained, but he did not do so. These circumstances included the fact that the Appellant did not even know who to pass the Bundles to, and when and how the handover was to take place.28Foot Note 28×Transcripts day 3, p35 lines 23-27, p36 at lines 17-22 (ROP vol 1) (f) After the Appellant met Sulaimi at the 7-Eleven store, “nothing was said [and] nothing was done”. The Appellant walked out of the store without handing the Bundles to Sulaimi as he should have done. Again, this “require[d] explanation”, but none was offered.29Foot Note 29×Transcripts day 3, p36 at lines 4-11 (ROP vol 1) (g) On balance, the presumptions in ss 17 and 18(2) of the MDA were not rebutted.30Foot Note 30×Transcripts day 3, p36 at lines 23-28 (ROP vol 1) 11 With regard to sentence, the Prosecution extended the Appellant a certificate of substantive assistance under s 33B(2) of the MDA. Finding that the Appellant was “merely … a courier”,31Foot Note 31×Transcripts day 3, p 36 at lines 25-28 (ROP vol 1)the Judge sentenced him as follows: (a) On the first charge, the Judge exercised his discretion not to impose the death sentence and sentenced the Appellant to life imprisonment and the minimum 15 strokes of the cane.32Foot Note 32×Transcripts day 3, p37 at lines 20-23, p38 at lines 25-31 (ROP vol 1) (b) On the second and third charges, the Judge sentenced the Appellant to the minimum punishment of five years’ imprisonment and five strokes of the cane per charge.33Foot Note 33×Transcripts day 3, p38 at lines 1-9 (ROP vol 1) Since a sentence of life imprisonment had been imposed for the first charge, the sentences for the other two charges were ordered, pursuant to s 307(2) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”), to run concurrently with the life sentence. The total sentence imposed was thus life imprisonment and 24 strokes of the cane (24 strokes is the maximum number of strokes permitted under s 328(6) of the CPC).34Foot Note 34×Transcripts day 3, p39 at lines 5-6; Transcripts day 4, p2 at lines 3-21 (ROP vol 1)",
        "The appeal": "12 In this appeal, the Appellant is appealing only against hisconviction. In his petition of appeal, the Appellant submits that the Judge erred in the following ways: (a) in finding that the unused roll of black tape found in the Haversack required explanation (para 3); (b) in finding that the purpose of the Appellant’s trip to Singapore was to pass the Bundles to the person designated by Mogan, and that his failure to do so was not sufficiently explained (paras 4(a) and 7); (c) in failing to take into account the fact that the Appellant was not paid for the intended delivery of the Bundles (para 4(b)); (d) in finding that the presence of the Appellant’s DNA on the adhesive side of the tape used to wrap A2 was “the most incriminating evidence” (para 5); (e) in finding that there were sufficient suspicious circumstances to require the Appellant to ask Mogan what was in the Bundles (para 6); (f) in failing to take into account or give sufficient weight to the fact that what the Appellant stated in the eight statements which he made to the CNB officers after his arrest was consistent with his denial of any knowledge of the drugs (para 8); (g) in failing to give sufficient weight to the Appellant’s evidence that he had a sufficient level of trust in Mogan (para 9); (h) in failing to give sufficient reasons as to why the Appellant’s defence was rejected (paras 10–11); and (i) in failing to make a finding on the Appellant’s credibility (para 12). 13 The sole issue on appeal is whether the presumption of knowledge in s 18(2) of the MDA has been rebutted by the Appellant so as to justify his acquittal. In deciding this issue, we shall analyse: (a) the Appellant’s evidence in his eight statements to the CNB and on the witness stand; (b) the alleged suspicious circumstances which should have put the Appellant on notice, including: (i) the weight, shape and appearance of the Bundles; (ii) the fact that Mogan gave him the additional mobile phone HS-HP1; and (iii) the lack of details regarding the delivery of the Bundles to Mogan’s friend,ie, the intended recipient of those bundles; (c) the DNA evidence; (d) the Appellant’s mobile phone records; (e) the Appellant’s conduct upon meeting Sulaimi; (f) the unused roll of black tape found in the Haversack; (g) the existence or absence of payment for carrying out the “favour” for Mogan; and (h) the absence of evidence from Sulaimi and Mogan at the trial. 14 We shall first set out the applicable legal principles, and then analyse the evidence and the issues in the order set out above.",
        "The applicable legal principles": "15 Under s 18(2) of the MDA, the Appellant is “presumed to have known the nature of that drug” unless the contrary is proved. In this regard, it is well established that to rebut this presumption of knowledge, the Appellant “bears the burden of proving, on a balance of probabilities, that he did not know or could not reasonably be expected to have known the nature of the controlled drug that was found” (seeDinesh Pillai a/l KRaja Retnam v Public Prosecutor[2012] 2 SLR 903 (“Dinesh Pillai”) at [18]). 16 In this regard, a mere assertion of a lack of knowledge in circumstances where the accused was wilfully blind will be insufficient to rebut the presumption of knowledge. InMuhammad Ridzuan bin Md Ali v Public Prosecutor and other matters[2014] 3 SLR 721, this court explained at [76]: Wilful blindness refers to a persondeliberately refusingto inquire into facts and from which an inference of knowledge may be sustained … Put simply, wilful blindness is thelegal equivalentof actual knowledge. Wilful blindness, however, isnotnegligence or an inadvertent failure to make inquiries. Thus, inDinesh Pillaithe court held that the appellant concerned had been wilfully blind in refusing to take reasonable steps to find out what he was asked to deliver (ie, by opening the package) despite suspecting that it contained something illegal. [emphasis in original] 17 In every instance where an accused claims that he did not know that what he was carrying contained drugs, the court will have to carefully scrutinise all the pertinent facts – this being a highly fact-sensitive inquiry – in determining whether he has discharged the burden of rebutting the presumption of knowledge, including (inter alia) his background, how he received the drugs, how they were packed and how he handled or dealt with them. Ultimately, what the court is concerned with is the credibility and veracity of the accused’s account and how believable that account is.",
        "The Appellant’s evidence in his statements and on the witness stand": "18 Eight statements from the Appellant were recorded by the CNB officers after his arrest:35Foot Note 35×Statement of Agreed Facts at para 28 (ROP vol 2 at pp253-254) (a) a contemporaneous statement recorded on 12 June 2013 at 10.54pm right after the Appellant was apprehended; (b) a cautioned statement recorded on 13 June 2013 at 4.51pm under s 23 of the CPC in relation to the first charge; (c) an investigative statement recorded on 16 June 2013 at 9.40am under s 22 of the CPC; (d) an investigative statement recorded on 16 June 2013 at 3.05pm under s 22 of the CPC; (e) an investigative statement recorded on 17 June 2013 at 3.28pm under s 22 of the CPC; (f) an investigative statement recorded on 20 June 2013 at 10.38am under s 22 of the CPC; (g) a cautioned statement recorded on 20 June 2013 at 12.10pm under s 23 of the CPC in relation to the second charge; and (h) an investigative statement recorded on 25 September 2014 at 3.20pm under s 22 of the CPC. The statements at (c) to (f) above form a single narration of the events which occurred, but the recording of these statements was broken up to allow the Appellant to take breaks in between. 19 The Appellant’s eight statements and his evidence during cross-examination are generally consistent. We shall go through the broad points in the Appellant’s narrative to identify the areas of consistency and inconsistency in his account.",
        "Events prior to the offence – the Appellant’s relationship with Mogan": "20 The Appellant first mentioned Mogan as the person who gave him the Bundles in his cautioned statement recorded on 13 June 2013 at 4.51pm.36Foot Note 36×ROP vol 2 at p209He referred to Mogan as a “colleague of mine” and someone to whom he had given rides to Singapore. He subsequently elaborated on their relationship in his investigative statements. The Appellant claimed as follows in his investigative statement recorded on 16 June 2013 at 9.40am: (a) He got to know Mogan at his workplace in Singapore three weeks before he was arrested. He claimed that he did not ask Mogan about his personal life because he (the Appellant) himself was not a talkative person.37Foot Note 37×ROP vol 2 at pp213-214, para 6, p232 (b) Two to three days after their first meeting, Mogan asked the Appellant whether the Appellant could fetch him regularly to and from work on the Appellant’s motorcycle. The Appellant agreed.38Foot Note 38×ROP vol 2 at p214, para 8In particular, the Appellant stated: After the first time I met him on the lorry [during the trip from PSA’s gate to the area where the prime movers were parked], about 2 to 3 days later, I met “Mogan” in the morning after work … at the parking lot where I was getting my motorcycle … “Mogan” asked me where I was staying and further asked me if I could drop him at his place, at Bandar Uda. Since his house was on the way, I agreed to … That day, after I dropped “Mogan” at his house, he asked me for my handphone number and I gave it to him. I asked “Mogan” why he wanted my number and he told me that he wanted to call me and ask [me] to fetch him to work. … I only started to fetch “Mogan” from his place to go to work at PSA Singapore, about 4 to 5 days later from the said evening, sometime during the second week that we met. “Mogan” had called me on my handphone … and asked if I could fetch him from his house to go to work and I agreed. … “Mogan” would call me almost everyday at about 5pm to 5.30pm to ask me to pick him up. … “Mogan” did not mention how long he would be taking a ride with me. He just told me to try to bring him to work and send him home every day. For the past 2 weeks, I could not remember exactly how many times I have fetched “Mogan” from his house to Singapore. … (c) The Appellant and Mogan normally had breakfast after work at a Chinese coffee shop in Johor Bahru before the Appellant dropped Mogan off at the latter’s home. The Appellant would usually pay for the meal.39Foot Note 39×ROP vol 2 at p215, para 9 (d) The Appellant was “not close” to Mogan and did not know much about Mogan. They were just “normal friends”.40Foot Note 40×ROP vol 2 at p215, para 9 The Appellant’s account in cross-examination was consistent with the above, save that he added that he had gone out with Mogan once to Woodlands Centre for about an hour to buy a phone.41Foot Note 41×Transcripts day 2, p 26 at lines 2-10 (ROP vol 1) 21 Pausing here, we observe that the Prosecution has not raised any evidence to cast doubt on the Appellant’s account of how he met Mogan. The Prosecution would have had information about Mogan, and if he were, for example, not working with the Appellant at PSA as colleagues as the Appellant claimed, this would certainly have come up in the evidence. 22 Additionally, it may be said from the short account at [20] above that the Appellant comes across as a rather simple, quiet and helpful character who, in the short two to three weeks that he knew Mogan, was quite willing to be at the latter’s beck and call. In the same vein, it should also be borne in mind that the Appellant was, at the time of the offence, only 20 years old and still living with his father in Johor Bahru. Seen in this light, and taking into account the fact that the Appellant and Mogan were working at the same place, it is not that surprising that the Appellant would have unquestioningly agreed to do Mogan the “favour” which Mogan asked of him even though he had only known Mogan for three weeks at that time.Unlessthe Appellant did in fact suspect that there was something illegal in the “jaman” which he was to bring to Singapore for Mogan, he (and indeed, any reasonable person) was likely to have viewed the “favour” which he was to do for Mogan as a simple innocuous one, and we would not have faulted him for so thinking. We now turn to consider the Appellant’s evidence on how he came to do Mogan the “favour”.",
        "The “favour” on 12 June 2013": "23 The Appellant’s account of the events leading up to his agreement to help Mogan deliver the “jaman” to Mogan’s friend in Singapore is consistent across the eight statements which he gave to the CNB. In particular, he claimed throughout that he had no knowledge of the contents of the “jaman” which Mogan passed to him. 24 In his cautioned statement recorded on 13 June 2013 at 4.51pm, the Appellant stated:42Foot Note 42×ROP vol 2 at p209 … Last week, Mogan lost his passport and could not enter Singapore. … Yesterday, I was coming to work at night, at about 7pm when Morgan called me. He told me to go to his house, at Bandar Uda, Johor Bahru. At his house, Morgan gave me the bundles and told me to go to Singapore. He told me to call him when I reached Singapore. I did not know what was inside the bundles. … 25 Then, in the investigative statement recorded on 16 June 2013 at 9.40am, the Appellant elaborated:43Foot Note 43×ROP vol 2 at pp215-216, para 10-12 On 12 June 2013, my foreman, Siva called me at about 5pm and told me that I was to start work at 10.30pm. I was resting at home then. At about 5.30pm, “Mogan” called me on my handphone “HS-HP3” and asked me when I was starting work. I told him that I would start work at 10.30pm. “Mogan” then told me that he was giving me ‘jaman’ (Recorder’s notes: ‘jaman’ is Tamil word for ‘things’) and asked me if I could give the ‘jaman’ to his friend in Singapore. I told him ‘ok’ and that on my way to work, I would go to his place to get the ‘jaman’ from him. This was the first time that “Mogan” had asked me to give ‘jaman’ to his friend in Singapore. I reached his place at about 7.30pm to 7.45pm. I called “Mogan” and told him that I was at his place. “Mogan” then came down from his place. He was carrying a black plastic bag and told me that the ‘jaman’ were inside. Morgan passed me the black plastic bag and told me that after I reached Singapore, he would call me and tell me whom to pass the ‘jaman’ to. Specifically, “Mogan” told me to pass the ‘jaman’ to his friend. He said a friend would come and collect it. “Mogan” did not tell me who the friend was. I did not ask what his friend’s name was either. At that moment when “Mogan” passed me the black plastic bag, I did not open the plastic bag to see what was inside. “Mogan” did not tell me what or how many items were inside the black plastic bag either. I did not ask him what the “jaman” were. I did not ask why his friend wanted the ‘jaman’ for as well. I also did not ask “Mogan” why he did not bring the ‘jaman’ into Singapore himself as I knew that he had lost his passport about 3 days ago, sometime on 9 June 2013. I knew this as I overheard a group of workers talking about this during one of the lorry trips [from PSA’s gate to the area where the prime movers were parked]. … I did not ask “Mogan” any questions about the ‘jaman’ as I thought that since “Mogan” had asked me for help, I just thought I would do him a favour and helped [sic] him since he was my friend. I did not think that there was anything wrong. I did not suspect anything also. After I took the black plastic bag from “Mogan”, the black plastic bag felt heavy to me while I was holding it. I did not ask “Mogan” why the plastic bag was so heavy either. After he passed me the plastic bag, I then asked “Mogan” how I was supposed to contact his friend. “Mogan” then gave me his phone, a Singapore phone, “HS-HP1” … Mogan had told me that this phone had a Singapore number. “Mogan” told me that he would call me on the said phone “HS-HP1” when I reached Singapore, to tell me more about how to pass the ‘jaman’ to his friend. I was to call “Mogan” on the said Nokia phone “HS-HP1” to let him know that I had reached Singapore. After that, “Mogan” and I parted. I left his place at about 8.30pm for Singapore. 26 On the witness stand, the Appellant consistently testified that: (a) Mogan called him before he left for work on 12 June 2013 asking him to pass something to a friend in Singapore;44Foot Note 44×Transcripts day 2, p5 at lines 9-23 (ROP vol 1)(b) he left his house at around 7.30pm and went to Mogan’s house;45Foot Note 45×Transcripts day 2, p5 at lines 8 and 25 (ROP vol 1)(c) he received a “black plastic bag” from Mogan, but did not see what was inside;46Foot Note 46×Transcripts day 2, p5 at line 26, p8 at lines 16-20 (ROP vol 1)(d) he thought Mogan had asked him to do the “favour” because Mogan had just lost his passport and could not enter Singapore himself;47Foot Note 47×Transcripts day 2, p13 at lines 6-27 (ROP vol 1)(e) he was not told who to pass the black plastic bag to, but was given instructions to call Mogan after he reached Singapore;48Foot Note 48×Transcripts day 2, p6 at lines 14-16, p33 at lines 14-22 (ROP vol 1)and (f) he was given the mobile phone HS-HP1 for this purpose.49Foot Note 49×Transcripts day 2, p6 at lines 8-13 (ROP vol 1) 27 From the above, it is clear that the Appellant consistently testified to even the finer details of his narrative, such as the fact that Mogan had just lost his passport. Importantly, he maintained throughout that he had no knowledge of what was in the Bundles, and that he never asked or saw a need to ask. 28 The Appellant consistently testified both in the investigative statement recorded on 16 June 2013 at 9.40am and on the witness stand that: (a) After leaving Mogan’s house, he first went to a nearby petrol kiosk in Bandar Uda, Johor Bahru. There, he opened the black plastic bag which Mogan had passed to him, “poured” the three black “jaman” inside into the centre compartment of the Haversack and threw the black plastic bag away. Here, we note an apparent inconsistency in the Appellant’s evidence. In his 16 June 2013 statement, the Appellant said that he transferred the Bundles to the Haversack “so that it would be easier for [him] to carry around”.50Foot Note 50×ROP vol 2 at p216, para 14On the witness stand, however, he testified that he noticed at the petrol kiosk that the black plastic bag was torn and hence transferred the Bundles in it to the Haversack “in fear that the contents might spill”.51Foot Note 51×Transcripts day 2, p7 at lines 22-26, p34 lines 13-25 (ROP vol 1)In our view, this apparent inconsistency is easily reconcilable given that it would certainly have been easier for the Appellant to carry and secure the three black “jaman” if they were in the Haversack rather than in a torn plastic bag in his motorcycle basket. Furthermore, this apparent inconsistency was never put to the Appellant in cross-examination and thus, he had no chance to explain it. (b) When the Appellant saw the three black “jaman”, he thought they looked like presents because presents sent by post in Malaysia were wrapped in black tape and he had seen presents wrapped like that before.52Foot Note 52×ROP vol 2 at p216, para 13; Transcripts day 2, p35 at lines 4-29 (ROP vol 1) (c) The Appellant bought some bread from the petrol kiosk and some Indian food from a food stall near the Johor Customs. He touched the Bundles whenhe moved them aside to make space for his food in the Haversack.53Foot Note 53×ROP vol 2 at p217, para 15; Transcripts day 2, p14 at line 11- p15 line 32, p36 at lines 14-26 (ROP vol 1) (d) The Appellant then successfully cleared the Johor and the Singapore Customs.54Foot Note 54×ROP vol 2 at p217, para 15Specifically, he testified to the following events at the Singapore Customs on the witness stand: Q ... So from that Tamil food stall where you bought some food, did you ride into Singapore? A Yes, Your Honour. Q And was your haversack checked at the Singapore Customs? A They did, Your Honour. Q They did. You were watching them checking? A I was watching, Your Honour. Q Did they open the central compartment to look into it? A Yes, I’m the one who open it up, Your Honour. Q All right. The three black bundles which you have put into your haversack, was there anything concealing the three black bundles in your haversack? A No, Your Honour. While the details regarding the inspection of the Haversack at the Singapore Customs only came up during the Appellant’s cross-examination at the trial and did not feature in any of his eight statements to the CNB, we find it unexceptional that the Appellant might simply have left out this sort of detail when narrating the events to the CNB officers. In particular, we note that the CNB officers recording the Appellant’s statements never followed up with further questions as to what exactly transpired at the Singapore Customs; neither was the Appellant challenged on his assertion that he opened the Haversack for inspection by a customs officer at the Singapore Customs. 29 From the above, it is clear that the Appellant’s evidence was that he did not conceal the Bundles in the Haversack and that he readily opened the Haversack for inspection at the Singapore Customs.55Foot Note 55×Transcripts day 2, p 18 at lines 10 –18 (ROP vol 1)Indeed, we note that according to the Statement of Agreed Facts, the CNB officers found all the Bundles in the “main compartment” of the Haversack, rather than in any secret lining or hidden compartment of the Appellant’s motorcycle.56Foot Note 56×Statement of Agreed Facts at para 8 (ROP vol 2 at p246)The Judge found the lack of concealment to be a factor in the Appellant’s favour.57Foot Note 57×Transcripts day 3, p34 at lines 7-13 (ROP vol 1) 30 The Prosecution argues on appeal58Foot Note 58×Respondent’s submissions at para 81that the Appellant could have intended to conceal the Bundles when he transferred them from the exposed basket at the front of his motorcycle59Foot Note 59×ROP vol 2, p 7 (photo CH-P2)to the centre compartment of the Haversack.60Foot Note 60×ROP vol 2, p 9 (photo CH-P4)We do not think such an inference should be drawn because: (a) the Appellant would have known that there was a good chance that the Haversack would be checked at the Singapore Customs, given that prior to 12 June 2013, he had for some time been travelling in and out of Singapore every day; (b) the Appellant placed the Bundles openly in the centre compartment of the Haversack; (c) the Appellant gave a good explanation as to why he transferred the Bundles to the Haversack; and (d) the Appellant did not make any attempts to conceal the Bundles. In the circumstances, we find that the Appellant’s casual handling of the Bundles even at the Singapore Customs suggests an openness that is consistent with his genuinely not knowing that the Bundles contained drugs.",
        "Meeting Sulaimi": "31 The Appellant consistently stated in the investigative statement recorded on 16 June 2013 at 3.05pm and on the witness stand that after he cleared the Singapore Customs, he went to Woodlands Centre, where he called Mogan to ask the latter to whom and where he should pass the “jaman”. Mogan told the Appellant that he would send a telephone number to the Appellant via text message, and that the Appellant was to call Mogan’s friend directly for details as to where they were to meet.61Foot Note 61×ROP vol 2 at p223, para 21; Transcripts day 2, p18 at lines 21-28 (ROP vol 1)The Appellant then called the number sent to him by Mogan and was asked by Sulaimi (who answered the call) to meet at the 7-Eleven store along Jalan Besar.62Foot Note 62×ROP vol 2 at p224, para 23; Transcripts day 2, p19 at lines 14-18 (ROP vol 1)The Appellant therefore headed to the said 7-Eleven store, and when he reached there, he called the number again. He then met Sulaimi.63Foot Note 63×ROP vol 2 at p224, para 24; Transcripts day 2, p20 at lines 1-11 (ROP vol 1) 32 According to the Appellant, Sulaimi asked him whether he wanted a drink. At this juncture, we would point out that there is some inconsistency in what the Appellant said in response. In his contemporaneous statement recorded on 12 June 2013 at 10.54pm and in his cautioned statement recorded on 13 June 2013 at 4.51pm, the Appellant’s evidence was that he said “no” to the offer of a drink.64Foot Note 64×ROP vol 2 at p199 (A5) and p209However, in the investigative statement recorded on 16 June 2013 at 3.05pm65Foot Note 65×ROP vol 2 at pp 224-225, paras 25-26and on the witness stand,66Foot Note 66×Transcripts day 2, p20 at lines 8-21, p42 line 24-p25 line 26 (ROP vol 1)the Appellant claimed that he said he wanted a drink and passed the drink which he chose to Sulaimi before walking out of the 7-Eleven store, leaving Sulaimi to settle the bill. 33 This inconsistency was not put to the Appellant in cross-examination, and it is not clear why that was so. There is therefore no explanation before the court for this inconsistency. This was also not made the subject of the closing submissions in the court below, nor was it a factor that weighed on the Judge’s mind (based on the transcript of his oral grounds). On the whole, we find this to be a minor point that has little bearing on the main issue, which is whether the Appellant had knowledge of the contents of the Bundles. We would add that it is possible that the truth lies somewhere in between – it may be that the Appellant initially said that he did not want a drink, but, as he testified on the witness stand, he subsequently took one because Sulaimi told him to:67Foot Note 67×Transcripts day 2, p43 at lines 25-26 (ROP vol 1) Q You picked up a drink and you gave it to Sulaimi for payment. A He told me to take, that’s why I took. 34 On the whole, the Appellant’s story is largely internally consistent. It is worth emphasising that the Appellant’s first and contemporaneous response upon being apprehended and questioned by the CNB officers was that hedid not know what theBundles were.68Foot Note 68×ROP vol 2 at p200, Q12/A12This has remained his position since.",
        "Knowledge of Singapore’s drug laws": "35 For completeness, we note that under cross-examination, the Appellant denied any knowledge of the strict drug laws in Singapore.69Foot Note 69×Transcripts day 2 p 38 at lines 4-22 (ROP vol 1)The Prosecution submits that this could not be true. In this regard, we take judicial notice of the fact that there are clear warning notices about Singapore’s harsh drug laws both at the Singapore Customs and on the Disembarkation/Embarkation Cards that foreigners have to fill in before entering Singapore. Since, at the date of his arrest, the Appellant had already worked in Singapore for some three years and would have passed through the Singapore Customs countless times, we find that he would, at some point before his arrest, have come to know about Singapore’s strict drug laws. 36 The fact that the Appellant denied knowing about Singapore’s harsh drug laws even though he most likely did know about them does undermine his credibility to an extent. We struggle to understand why the Appellant denied having such knowledge, given that his denial did not advance his defence in the least. On the contrary, admitting to such knowledge would have helped in his defence. One possibility could be that the Appellant was simply afraid upon learning, after his arrest, that the Bundles contained drugs, and sought to distance himself from any association whatsoever with drugs. We do not, however, want to speculate on this issue. In any case, even if the Appellant did indeed lie about his lack of knowledge of Singapore’s drug laws, we do not think this single fact should be determinative – in the present context, this could be regarded as a peripheral fact which has little bearing on whether the Appellant knew or ought to have suspected that the Bundles contained drugs. Indeed, if the Appellant knew that Singapore had harsh drug laws and that the Bundles contained controlled drugs, it would be less likely that he would have agreed to do Mogan the “favour” without any reward in return (a point which will be discussed subsequently) and that he would have proceeded through the Singapore Customs so casually.",
        "The alleged suspicious circumstances": "37 We next consider the alleged suspicious circumstances which, the Prosecution argues, should have alerted the Appellant to the illegal nature of the contents of the Bundles. These include: (a) the weight, shape and appearance of the Bundles; (b) the extra mobile phone HS-HP1 that Mogan gave the Appellant; and (c) the lack of details regarding the delivery of the Bundles to Mogan’s friend in Singapore.",
        "The weight, shape and appearance of the Bundles": "38 The Prosecution argues that the manner in which the Bundles were packed and their weight should have raised alarm bells.70Foot Note 70×Respondent’s submissions at paras 78-81The Appellant’s explanation was that he did not find the Bundles suspicious because he thought they looked like “presents”. He said that in Malaysia, presents were sometimes wrapped in black tape when they were sent by post to prevent the items inside from falling out.71Foot Note 71×ROP vol 2 at p 216, para 13While the practice of wrapping presents to be sent by post in black tape is not something which we are familiar with in Singapore, there is no independent evidence to corroborate or refute the Appellant’s explanation that such a practice exists in Malaysia. Furthermore, we do not find his explanation completely fanciful or implausible. In the circumstances, we have no basis to reject the Appellant’s explanation, which, we would add, was given at the earliest opportunity he had, namely, when he was narrating his account of what happened in the investigative statement recorded at 9.40am on 16 June 2013, four days after his arrest (see [28(b)] above). 39 The Prosecution further argues that even accepting the Appellant’s explanation, there were no postage marks on the Bundles, which should have raised questions in the Appellant’s mind.72Foot Note 72×Respondent’s submissions at para 80In our view, it is not unreasonable for the Appellant to have given little thought to the matter since the Bundles were not intended to be conveyed by post. The relevant point is that bundles wrapped in black tape werenot an unfamiliar sightto the Appellantbecause, according to him, in Malaysia, presents to be sent by post were sometimes wrapped in that way. He therefore may not have found it odd or suspicious when he saw that Mogan had done the same for the “jaman” which Mogan asked him to bring to Singapore. As we remarked to counsel during oral arguments, we cannot assume that the Appellant was acquainted with the way in which drugs intended for trafficking are normally wrapped or knew that “jaman” was a known reference to drugs in Tamil.73Foot Note 73×Respondent’s submissions at para 90The average person with no previous acquaintance with drugs and/or the practices of the drug trade is unlikely to know how drugs meant for trafficking are normally packed or referred to. Indeed, if the Appellant had known that “jaman” was a common term used to refer to drugs in Tamil, it is unlikely that he would have referred to the Bundles as “jaman”, given his consistent defence that he did not know they contained drugs. 40 Further, the Appellant never really looked at the Bundles while he was at Mogan’s house. Indeed, it would have been dark at about 7.30pm when the Appellant reached Mogan’s house and received the black plastic bag. It was only at the petrol kiosk that the Appellant looked at the Bundles. By then, Mogan was no longer with him. While the Appellant could always have called Mogan to ask what was inside the Bundles, the Bundles obviously did not appear to the Appellant to be sufficiently suspicious (or suspiciousat all) to justify his calling Mogan. 41 In the circumstances, we are satisfied by the Appellant’s explanation as to what he thought the Bundles were. On its own, the fact that the Bundles were heavy and wrapped in black tape need not have raised the suspicion of the Appellant or, for that matter, a reasonable person not acquainted with the ways of the drug trade. To be fair to an accused like the Appellant, it is important that the court does not readily assume that an ordinary reasonable person would be familiar with the practices of the drug trade.",
        "The extra mobile phone HS-HP1": "42 In relation to the mobile phone HS-HP1 which Mogan passed to the Appellant for the purpose of carrying out the “favour”, it may be argued that the Appellant should have been put on notice when Mogan handed him that mobile phone as Mogan could simply have given him some money instead to cover the costs of the telephone call(s) which he would have to make. This is especially so as the Appellant already had two mobile phones at that time, including a mobile phone containing a Singapore number. 43 On the witness stand, the Appellant explained in more detail why Mogan had given him the mobile phone HS-HP1, as opposed to, potentially, simply compensating him for the costs of the telephone call(s) that he would have to make in the course of carrying out the “favour”:74Foot Note 74×Transcripts day 2, p6 at lines 8-13 (ROP vol 1) A After that, he asked me, “Is there money in your phone?” …; and then I told him that there is very little money in my phone. Only after that he told me that he would pass me his phone. Q Yes. A He gave me his phone to use since I was helping him and I had very little money left in my phone. Subsequently, when cross-examining the Appellant, the Prosecution insinuated that Mogan had told him that he could receive instructions only on the mobile phone HS-HP1, which should have raised suspicion. The Appellant, however, maintained in response that he had been given that mobile phone because there was insufficient money in his own mobile phone.75Foot Note 75×Transcripts day 2, p32 at lines 10-13, p33 at lines 25-27 (ROP vol 1) 44 In our judgment, the explanation given by the Appellant is plausible. His evidence was that he would have to go to Woodlands Centre to top up his mobile phone card76Foot Note 76×ROP vol 2 p223, para 20in order to carry out the “favour” for Mogan. To the Appellant, and indeed, any reasonable person, keeping in mind that the Appellant was then on his way to work, the fact that Mogan passed him a mobile phone for the purpose of carrying out the “favour” might have seemed to be a simple matter of convenience. There was therefore nothingper sesuspicious in that arrangement. We do not see the mere loan of the mobile phone HS-HP1 by Mogan to the Appellant as an indication that Mogan was up to something dubious or illegal, and that the Appellant should therefore have known about the contents of the Bundles. Moreover, it must not be forgotten that the Appellant would be travelling back to Johor Bahru after finishing work and could thus return the aforesaid mobile phone to Mogan. As we stated earlier, there was a perfectly good explanation for the arrangement fromtheAppellant’spoint of view. Whether or notMoganhad more sinister reasons for giving the Appellant that mobile phone is beside the point.",
        "The lack of details regarding the delivery of the Bundles": "45 Mogan did not give the Appellant any details as to who the “friend” whom the Appellant was supposed to pass the Bundles to was.77Foot Note 77×ROP vol 2, p 215, para 10Mogan also did not tell the Appellant how, when and where he was to hand over the Bundles to that friend. The Judge found that this lack of details should have put the Appellant on notice. The Prosecution submits that given the lack of details, the Appellant would and should have made inquiries to satisfy himself of the legality of the “favour” that he was asked to perform for Mogan.78Foot Note 78×Respondent’s submissions at para 67Further, the Prosecution submits that because the Appellant had already received a warning from his boss earlier on 12 June 2013 (the day of the offence) to duly report for work that day or risk having his work permit revoked, he could not have afforded to be late for work that day. In the circumstances, it would be unlikely that he would have agreed to do the “favour” for Mogan without knowing where and when he was to pass the Bundles to Mogan’s friend.79Foot Note 79×Respondent’s submissions at paras 71 and 72 46 As we see it, there is nothing suspicious about the aforesaid lack of details. Although the Appellant did not know who to pass the Bundles to as well as where and when he was supposed to do so, he was given clear instructions by Mogan as tohowthose details would be conveyed to him. The Appellant was told that he was to call Mogan using the mobile phone HS-HP1 when he reached Singapore, upon which Mogan would “tell [him] more”.80Foot Note 80×ROP vol 2, p 216, para 12There is nothingper sesuspicious or surprising about the arrangement that the exact venue and time for delivering the Bundles would be confirmed only later. Further, given that the Appellant did not expect to be acquainted with Mogan’s friend, it is not surprising that he did not bother to ask Mogan the exact identity of that friend. Finally, while the Prosecution submits that the Appellant risked being late for work by carrying out the “favour” for Mogan before going to work, nothing in the evidence suggests that this was the case. It appears that on 12 June 2013, the Appellant entered Singapore early enough to have sufficient time to carry out the “favour”. The Appellant only needed to be at work by 10.30pm,81Foot Note 81×Transcripts day 2 p4 at lines 31-32 (ROP vol 1)and he was arrested at 9.45pm. Traffic on the road at that time would likely have been light. If the Appellant had not been arrested and had completed the “favour”, it is likely that he would still have been able to make it for work in good time. We emphasise again that all these factors must be viewed in the light of the fact that the “favour” which Mogan asked the Appellant to carry out was, from the Appellant’s viewpoint, the request of a friend and colleague (albeit one whom the Appellant had known for only three weeks), as opposed to someone who was a known criminal or had a reputation for dealing in illegal substances.",
        "The DNA evidence": "47 We now move on to the area of evidence relating to the Appellant’s DNA. The expert evidence at the trial indicated that the Appellant’s DNA was found on the adhesive side of the tape used to wrap A2.82Foot Note 82×ROP vol 2 p 44In his petition of appeal, the Appellant submits that the Judge erred in holding that the presence of his DNA on the adhesive side of that tape was “the most incriminating evidence” against him (see [12(d)] above). 48 At the trial, the Appellant stated that he did not know why his DNA came to be found on the adhesive side of the tape used to wrap A2.83Foot Note 83×Transcripts day 2 p 24 at lines 21 - 27 and p 44 at lines 24 – 29 (ROP vol 1)The Appellant’s counsel submitted that the tape could have been unfastened and lumped together in one plastic bag before it was analysed, which could have caused the non-adhesive side of the tape to come into contact with the adhesive side, thereby transferring the Appellant’s DNA from the exterior non-adhesive surface of the tape to the interior adhesive surface.84Foot Note 84×Defence Closing Submissions p 10 at para 35.We are unable to accept this argument because it is not supported by the expert evidence given at the trial. Ms Tang, the DNA analyst from the HSA, testified that the various strips of tape used to wrap the Bundles were never lumped together and that their adhesive surfaces had not come into contact with their non-adhesive surfaces. She explained as follows:85Foot Note 85×Transcripts day 1 p 16 at lines 24 – 33 (ROP vol 1) Q Could you let the Court know which surface is---which sides of those exhibits they were found? A Your Honour, for the tape bundles, the tape bundle consist of plastic bag wrapped with tapes. Before the tapes were dismantled, the exterior of the tape bundle was swabbed for DNA and that is AREA 1. The interior of the tape bundle is swabbed as AREA 2 and after the tapes were removed, the adhesive side of the tapes are swabbed as AREA 3. And the non-adhesive side of the tapes are swabbed---are swabbed as AREA 4. The exterior of the plastic bag is swabbed as AREA 5 and the interior of the plastic bag was swabbed as AREA 6. 49 Ms Tang further explained during cross-examination:86Foot Note 86×Transcripts day 1 p 19 at lines 18 – 24 (ROP vol 1) Q … The tapes which you have before you now, did you receive them in this form or did you do anything to the tapes before analysis? A Your Honour, I didn’t receive the tapes in this form. It was all wrapped up with the plastic bag as a bundle. Q So you had unwrapped the tapes from the black plastic bag, right? A Yes. The tapes were dismantled from the black plastic bag in our lab. Based on Ms Tang’s evidence, we find it unlikely that the interior and exterior surfaces of the tape used to wrap A2 would have come into contact with each other before being tested for the presence of the Appellant’s DNA. 50 Ms Tang also testified that it was not theoretically possible for the Appellant’s DNA to have been transferred to the adhesive side of the tape wrapped around A2 if he had only touched the exterior surface of A2:87Foot Note 87×Transcripts day 1 p 18 at lines 13– 19 (ROP vol 1) Q Is it possible to get DNA transferred to the adhesive side of the tape of A2 just by touching the exterior of Exhibit A2? A  Your Honour, theoretically it is not possible. How---at---but I’m unable to comment how it got onto AREA 3. 51 Be that as it may, we are of the view that the probative value of the DNA evidence should be discounted due to the limitations of the DNA swabbing procedure carried out on the tape for the purposes of DNA analysis. The DNA swabbing procedure was discussed in the court below. Ms Tang testified that it was not possible to tell exactly where and to what extent the Appellant’s DNA was found on the adhesive side of the tape wrapped around A2. This was because that tape, which comprised over ten separate strips of tape, had been swabbed and analysed together, and not separately in individual strips. The material parts of Ms Tang’s cross-examination are reproduced below:88Foot Note 88×Transcripts day 1 p 21 at lines 18– 23 and p 23 at lines 15 – 24 (ROP vol 1) Q Now if you look at AREA 3, the adhesive side of the tapes, now can you tell the Court which part of the adhesive side of the tape was swabbed for DNA analysis? A Your Honour, it is all---the adhesive sides of all the tapes. Q Of the whole tape? A Yes, of all the tapes, the whole tape; there is no particular part. … Q … [B]ut why are you not able to say on which particular strip of the tape the DNA was found and on which strip it was not found? A Your Honour, all the swabs were combined and processed---all the swabs that was used to swab the adhesive side of the tapes were combined and processed for DNA. Hence I would not be able to comment on which strip the DNA was found---found. Q Yes. So from what you say, witness, if the DNA swab taken from, let’s say, one of the strips, you take a swab from one small portion of that strip and then you swabbed all the other strips so you combined everything. A Yes. 52 At the end of Ms Tang’s cross-examination, the Appellant’s counsel raised the point that given the way in which the tape wrapped around A2 had been swabbed, even if the Appellant had only “touched one small little tip, the end of a tape”,89Foot Note 89×Transcripts day 1 p 25 at lines 1-3 (ROP vol 1)his DNA would still be reported to be present on the adhesive surface of the tape. Ms Tang did not disagree. 53 In our view, the way in which the DNA swabs were taken and the tests carried out made it impossible to determinetheextentto which the Appellant’s DNA was present on the adhesive side of the tapeused to wrap A2. In this respect, we observe that the Appellant’s DNA was reported as a contributor of the “major component” of the DNA profile on the adhesive side of that tape.90Foot Note 90×ROP vol 2 p 50We note, however, that thesignificanceof the Appellant’s DNA being a contributor of the “major component”, as opposed to the “minor component”, was never explored in cross-examination or explained by Ms Tang. It is unclear to us whether the term “major component” in the context of DNA analysis bears a more specialised scientific meaning. Therefore, on the face of the DNA report, it is not clear whether the Appellant’s DNA was found all over the adhesive side of the tape used to wrap A2 or only at an edge of the adhesive side. 54 Assuming that the Appellant’s DNA was found only at the edge(s) of the adhesive side of the tape wrapped around A2, the DNA could very well have been transferred through the Appellant’s contact with A2 while he was transferring A2 (along with the rest of the Bundles) to the Haversackifthe ends of the tape had stuck out slightly. Based on the photographic exhibits in evidence, we observe that a small part of the end of the tape at the top right corner of A3 appears to be sticking out.91Foot Note 91×ROP vol 2 at p10The same cannot be observed in respect of A2, but a full picture of the Bundles is not before the court (the bottom and the sides of A2 cannot be seen in the picture of the Bundles adduced in evidence) and therefore, it cannot be definitively ascertained whether this was similarly the case with the tape used to wrap A2. 55 We also observe that noplausiblealternativetheoriesexplaining how the Appellant’s DNA evidence came to be found on the adhesive side of the tape wrapped around A2 have been presented by the Prosecution. Two factors stand out in this regard. First, the evidence does not support the inference that the Appellant helped topackthe Bundles (which, in any event, is not the Prosecution’s case given that it issued the Appellant a certificate of substantive assistance as a courier), especially since the Appellant’s DNA was not found on the adhesive side of the tape used to wrap A1 and A3. If the Appellant had indeed been involved in packing the Bundles, it would be odd that he helped only with the packing of A2, but not A1 and A3. Second, there is insufficient evidence to warrant drawing the inference that the Appellant hadunfastenedthe tape around A2 to see what was inside that bundle. Based on the photographic exhibits in evidence, it does not look like A2 had been unwrapped or otherwise interfered with and then wrapped up again (although, of course, as we have noted, the photographic evidence does not show the bottom and the sides of A2). Without aplausible case theory explaining why the Appellant’s DNA came to be found on the adhesive side of the tape used to wrap A2, the DNA evidence, although suggestive of the Appellant’s knowledge of the contents of A2, cannot be treated either as evidence that the Appellant did indeed have such knowledge or as evidence which confirms the presumption under s 18(2) of the MDA that he had such knowledge.",
        "The Appellant’s mobile phone records": "56 The Appellant’s two mobile phones were examined by the Technology Crime Forensic Branch of the Criminal Investigation Department. The mobile phone records did not reveal any incriminating information, such as messages suggesting that he had a history of being involved in drug-related activities. Instead, most of the Appellant’s messages were innocuous ones sent to his friends and family members.92Foot Note 92×ROP vol 2 at pp 96-116; 132-135While this is not necessarily determinative, we consider it to be a factor that reduces the possibility of the Appellant being involved with, and therefore having knowledge of, the drugs found on him.",
        "The Appellant’s conduct upon meeting Sulaimi": "114 The Appellant’s conduct upon meeting Sulaimi was a further factor that pointed towards his knowledge of the “jaman” that he had been asked to deliver. The Appellant said nothing to Sulaimi when they met at Jalan Besar. Neither did Sulaimi say anything to him except to ask whether he wanted a drink. While they were in the 7-Eleven Store, there was again no interaction concerning the “jaman”. The Appellant’s conduct during his meeting with Sulaimi must be examined in the light of the events that day. 115 As the Judge pointed out in his oral judgment, the sole purpose of the Appellant’s trip from Woodlands to Jalan Besar was to deliver the Bundles to Sulaimi. It was thus baffling that there was no interaction between Sulaimi and the Appellant when they met other than Sulaimi asking the Appellant whether he wanted a drink. There was no mention at all about the Bundles that the Appellant was supposed to deliver. The Appellant’s apparent lack of urgency and his unhurried demeanour at that meeting were even more baffling given that he could not afford to be late for work that day. This was because, earlier that day at 6.11pm, the Appellant had received a text message from his boss at his workplace which stated: “[i]f u go mia I m going to cancel your permit”.220Foot Note 220×Transcripts day 2, p30 at lines 14–17 (ROP vol 1); ROP vol 2 at p165This obviously meant that if the Appellant went “Missing in Action”, his work permit would be cancelled and he would not be able to continue working at PSA. During cross-examination, the Appellant agreed that he risked losing his job at PSA if he was late for work that day221Foot Note 221×Transcripts day 2, p30 at lines 25–31 (ROP vol 1)since he had been absent from work for the preceding two days. According to the Appellant, he had also told Sulaimi while they were speaking over the mobile phone before their meeting at Jalan Besar that he was already late for work (see [93] above). In those circumstances, the natural thing for the Appellant to do would have been to do the favour quickly for Mogan by delivering the Bundles and then head off to work immediately. After all, there was no instruction from Mogan to collect money from the recipient of the “jaman” or to do anything else besides handing over the “jaman”. Mysteriously, the Appellant appeared to have forgotten all these once he established contact with the recipient, who was said to be a stranger to him. 116 During cross-examination, the Appellant said that he was worried about being late for work and had informed Sulaimi about it when Sulaimi went into the 7-Eleven Store.222Foot Note 222×Transcripts day 2, p43 at lines 2–4 (ROP vol 1)According to the Appellant, Sulaimi’s response was “Wait a while, let me finish my work”.223Foot Note 223×Transcripts day 2, p43 at line 11 (ROP vol 1)When asked “What work?”, the Appellant replied, “He said wait for 5 minutes, he had to go and buy food”.224Foot Note 224×Transcripts day 2, p43 at lines 12–13 (ROP vol 1)When it was put to the Appellant that he could have passed the Bundles to Sulaimi without waiting for Sulaimi to buy his food, the Appellant’s response was “I told him that I would want to give it to him. However, he asked me to wait”.225Foot Note 225×Transcripts day 2, p43 at lines 16–19 (ROP vol 1)This alleged exchange, besides making no sense given the urgent circumstances that the Appellant was in at that moment in time, was not even mentioned in any of his statements to the CNB. On the contrary, the Appellant stated clearly in his statement recorded on 16 June 2013 at 3.05pm that he did not say anything about the “jaman” to Sulaimi after they met outside the 7-Eleven Store. In that same statement, the Appellant also seemed to suggest that the only interaction between him and Sulaimi was when Sulaimi asked whether he wanted a drink. The relevant paragraphs of that statement are set out below: 25. I then got off my motorbike, JPG 3592 to meet the man. I was still carrying my black backpack containing the 3 black ‘jaman’. I had the backpack with me all the while. Nobody else had access to the backpack. When the man approached me outside the 7-Eleven store, he asked me in Malay “Awa mau minum ka?” (Recorder’s notes: The Malay phrase meant ‘whether you wanted a drink’).The man did not say anything else.Since I was thirsty, I answered ‘yes’ in Malay. The man appeared to be normal and he spoke to me very calmly. When the man asked me if I wanted any drink in Malay, I recognized his voice as the same one which I had heard over the phone. It was the same voice, in a very calm tone. This is the first time that I have seen this man. I have never seen him before previously. 26. The man then entered the 7-Eleven store and I followed him. Inside the store, the man went to get some food and drink. I then got a bottle of orange juice for myself and passed it to the man for him to pay. I told the man that I needed this drink in Malay and passed the bottle to him. The man and I did not talk any further. Inside the 7-Eleven store, I had yet to pass the ‘jaman’ to him.I did not say anything about the “jaman” to the man in the 7-Eleven store. The man did not ask anything about the ‘jaman’ as well.Since the man wanted to get food, I thought I waited till he finished buying his food before I passed the “jaman” to him. We were inside the store for about 5 minutes. After I passed the bottle of orange to the man, I left the 7-Eleven store, while the man paid for his food and the drinks. After I walked out of the store, I sat on a slab of stone near the pavement. Moments later, before I could get up, I was arrested by some plain-clothes men. … [emphasis added in bold italics] 117 It can be seen from the above that a man in a hurry because his job was at stake was apparently calm and suddenly nonchalant about time, said nothing about the “jaman” that he was supposed to deliver to the stranger when they met and did not even try to hand over the “jaman” to him. Indeed, the Appellant did not even take the Bundles out of the Haversack. Instead, he was willing to waste more time waiting for the stranger to purchase food and drinks. Up to that point in time, the Appellant did not even know the recipient’s name. All these, in my view, led irresistibly to the inference that the meeting between the Appellant and Sulaimi on the night of 12 June 2013 was not for the simple act of handing over presents or some other legitimate stuff to an unknown friend of a friend.",
        "The unused roll of black tape in the Haversack": "62 The Judge was of the view that the unused roll of black tape found in the Haversack “require[d] explanation” (see [10(d)] above). We are afraid he was wrong on this point. That unused roll of black tape might appear superficially similar to the black tape used to wrap the Bundles. However, it is clear from the expert evidence that while the black tape used to wrap the Bundles could all have originated from the same roll of tape, the unused roll of black tape found in the Haversack wasnot associatedwith the tape used to wrap the Bundles.96Foot Note 96×ROP vol 2 at p61In the circumstances, it seems to us that the unused roll of black tape found in the Haversack has no probative value in this case. 63 Additionally, the Appellant has adequately explained why he had that unused roll of black tape in the Haversack. On the very day he was arrested, the Appellant told the CNB officers that that roll of tape was used to tape his mobile phone charger so as to prevent a short circuit when he charged his mobile phone while travelling in the lorry transporting him from PSA’s gate to the area within the premises where the prime movers were parked.97Foot Note 97×ROP vol 2 at pp200-201His subsequent evidence was entirely consistent with this explanation.",
        "The existence or absence of payment for performing the “favour”": "64 The Appellant’s evidence throughout was that he was never given or promised any payment for carrying out the “favour” for Mogan.98Foot Note 98×ROP vol 2 at p233 (A9)Indeed, we note that there isno evidenceto suggest that the Appellant was promised any sort of reward for doing that “favour”. The Prosecution submits that the lack of payment is “neither here nor there, and does not go towards rebutting the presumptions under ss 18(1) and 18(2) of the MDA”.99Foot Note 99×Respondent’s submissions at para 76We disagree. In our view, the fact that the Appellant did not receive payment for carrying out the “favour” is strongly exculpatory. It is unlikely that the Appellant (or, for that matter, any person in similar circumstances) would have knowingly and willingly agreed to be a drug courier for a colleague of only three weekswithoutreceiving any reward or benefit (whether monetary or otherwise) in return, especially given the high risk involved. The lack of reward is consistent with the Appellant’s assertion that he thought that in bringing the Bundles to Singapore for delivery to Sulaimi, he was simply doing Mogan an innocuous “favour”. 65 The Prosecution submits that it is not clear that no payment was promised to and/or received by the Appellant in return for doing the “favour” for Mogan. The Appellant admitted at the trial that he had previously sent a text message to Mogan with his Bank Rakyat account number (he could not, however, recall when he had sent Mogan that text message).100Foot Note 100×Transcript day 2, p27 at line 30- p28 line 6 (ROP vol 1)The Prosecution suggests that the Appellant did so in order to receive payment from Mogan for carrying out the “favour”. This, however, is not borne out by the evidence. The Appellant explained on the witness stand that he had given Mogan his bank account number so that Mogan could help him deposit MYR 100 into his bank account since Mogan was going to Bank Rakyat on the day the aforesaid text message was sent.101Foot Note 101×Transcripts day 2, p28 at lines 7-32 (ROP vol 1)While the Appellant agreed that he was in no hurry to deposit the MYR 100 into his bank account, he maintained that he had asked Mogan to do so out of convenience since Mogan was going to the bank that day. 66 We note that the Appellant’s explanation in respect of the aforesaid text message to Mogan is not externally corroborated by other evidence. However, we would point out that: (a) the Prosecution’s case theory that the Appellant gave Mogan his bank account number so that he could receive payment for being a drug courier was never put to the Appellant in cross-examination;102Foot Note 102×Transcripts day 2 pp28-29 (ROP vol 1)and (b) this was neither the Prosecution’s case in the court below nor the Judge’s finding. In this regard, it is worth reiterating the rule inBrowne v Dunn(1893) 6 R 67, which we recently affirmed inSudha Natrajan v The Bank of East Asia Ltd[2017] 1 SLR 141 at [48], that “where a submission is going to be made about a witness or the evidence given by the witness which is of such a nature and of such importance that it ought fairly to have been put to the witness to give him the opportunity to meet that submission, to counter it or to explain himself, then if it has not been so put, the party concerned will not be allowed to make that submission”. This squarely applies in the present case. Given that the Prosecution never put it to the Appellant that he sent Mogan the text message containing his bank account number in order to receive payment from Mogan for doing the “favour”, we do not think it is open to the Prosecution to now submit that that was the position. 67 As such, on the present evidence, and in all fairness, there is no basis for this court tospeculatethat the Appellant received or was promised payment in return for doing the “favour” for Mogan.",
        "The absence of evidence from Mogan and Sulaimi at the trial": "68 Finally, we note that there was no evidence either in the court below or before us from Sulaimi and Mogan. It is clear to us that both of them are material and critical witnesses who would have been able to either corroborate or rebut the Appellant’s defence. At the trial, Investigating Officer Yeo Wee Beng informed the court that both Sulaimi and Mogan had already been arrested by the CNB, convicted and sentenced (in Sulaimi’s case, to five years and six months’ imprisonment and three strokes of the cane, and in Mogan’s case, to 23 years’ imprisonment and 15 strokes of the cane).103Foot Note 103×Transcripts day 1, p81 at line 27 – p82 at line 14 (ROP vol 1)Given that both Sulaimi and Mogan were held in custody at the time of the trial, it is curious that neither the Prosecution nor the Defence called them to testify. The court was thus deprived of the assistance which they could have given. We would only observe that the Prosecution would have known, from the statements which both Mogan and Sulaimi had given to the CNB, what they were likely to say if they were called as witnesses at the trial, while the same could not be said of the Appellant. 69 At the hearing of this appeal, we asked the parties whether any of Sulaimi’s and/or Mogan’s statements had been disclosed to the Defence, and why their evidence had not been adduced in the court below. Defence counsel clarified that he had not received any statements from the Prosecution pursuant to the latter’s disclosure obligations underMuhammad bin Kadar and another v Public Prosecutor[2011] 3 SLR 1205 (“Kadar”); neither had he asked the Prosecution whether any relevant statements existed. The Prosecution confirmed that it had not disclosed any of Sulaimi’s and/or Mogan’s statements to the Defence, but maintained that there were no statements which it was obliged to disclose pursuant to itsKadarobligations. 70 On the one hand, we would have thought that the Prosecution would have called Sulaimi and/or Mogan as witnesses to rebut the Appellant’s defenceiftheir account of the events supported the Prosecution’s case that the Appellant was in the know throughout. On the other hand, while it is true that the Appellant could also have called Mogan and Sulaimi to testify for him at the trial, unlike the Prosecution, he would have done so without knowing what they were likely to say. To that extent, the Appellant was at a disadvantage.",
        "Conclusion": "125 The onus is on the Appellant to rebut the presumptions of possession and of knowledge of the nature of the drugs inss 18(1) and 18(2) of the MDA. The Appellant has attempted to do so by claiming that he thought that the Bundles were presents, without elaborating on the nature of the presents. Presents may also contain prohibited things. Such a defence is no different in effect from the not-uncommonly heard plaintive plea of “I really didn’t know they were drugs but I also didn’t know what they were”. In my opinion, such a defence has to be examined in the context of the factual situation in any particular case. On the evidence adduced in this case, I do not think the Appellant has managed to rebut the legal presumption of knowledge in any way. The Judge was therefore correct in convicting the Appellant on all three charges. There is no appeal against the sentences but I would add that I also see no reason to disagree with the Judge regarding his finding that the Appellant was a courier within the meaning of s 33B of the MDA and with his decision on sentence. Accordingly, I would dismiss the appeal. Tay Yong KwangJudge of Appeal Ram Goswami (Ram Goswami) and Cheng Kim Kuan (K K Cheng & Co) for the appellant;Kwek Mean Luck, Tan Wen Hsien and Sarah Shi (Attorney-General’s Chambers) for the respondent.",
        "The charges": "74 This is an appeal by Harven a/l Segar (“the Appellant”) against his conviction by the High Court judge (“the Judge”) on the following three charges under the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the MDA”):104Foot Note 104×ROP vol 2, pp1–2. That you,HARVEN A/L SEGAR, 1stCharge on the 12th of June 2013, at about 9.45 p.m., outside a 7-11 convenience store, at Hoa Nam Building, along Jalan Besar Road, Singapore, did traffic in a Class A Controlled Drug listed in The First Schedule to The Misuse of Drugs Act, Chapter 185 (“the said Act”),to wit, by having in your possession for the purpose of trafficking, two (02) packets of granular/powdery substance weighing a total of 902 grams which were subsequently analyzed and found to containnot less than 53.74 grams of diamorphine,without any authorization under the said Act or the Regulations made thereunder, and you have thereby committed an offence under section 5(1)(a) read with section 5(2) of the said Act and punishable under section 33 of the said Act, and further, upon your conviction under section 5(1)(a) read with section 5(2) of the said Act, you may alternatively be liable to be punished under section 33B of the said Act. 2nd Charge on the 12th of June 2013, at about 9.45 p.m., outside a 7-11 convenience store, at Hoa Nam Building, along Jalan Besar Road, Singapore, did traffic in a Class A Controlled Drug listed in The First Schedule to The Misuse of Drugs Act, Chapter 185 (“the said Act”), to wit, by having in your possession for the purpose of trafficking, 232.8 grams of vegetable matter which was subsequently analyzed and found to be cannabis, without any authorization under the said Act or the Regulations made thereunder, and you have thereby committed an offence under section 5(1)(a) read with section 5(2) of the said Act and punishable under section 33 of the said Act. 3rd Charge on the 12th of June 2013, at about 9.45 p.m., outside a 7-11 convenience store, at Hoa Nam Building, along Jalan Besar Road, Singapore, did traffic in a Class A Controlled Drug listed in The First Schedule to The Misuse of Drugs Act, Chapter 185 (“the said Act”), to wit, by having in your possession for the purpose of trafficking, 259.8 grams of fragmented vegetable matter which was subsequently analyzed and found to contain cannabinol and tetrahydrocannabinol, without any authorization under the said Act or the Regulations made thereunder, and you have thereby committed an offence under section 5(1)(a) read with section 5(2) of the said Act and punishable under section 33 of the said Act. The first charge is a capital offence, while the second and third charges are non-capital offences each carrying a minimum sentence of five years’ imprisonment and five strokes of the cane. At the conclusion of the trial, the Judge convicted the Appellant on all three charges. As the Appellant came within the terms of s 33B of the MDA, the Judge exercised his discretion not to impose the death penalty on the first charge. The final sentence imposed on the Appellant was life imprisonment together with 24 strokes of the cane in respect of the three charges. This appeal concerns only the Appellant’s conviction on the three charges. The majority decision of this court is to allow the appeal and to acquit the Appellant on the three charges. I hold a contrary view and would dismiss the appeal for the reasons set out in this judgment.",
        "The undisputed facts": "75 The events leading up to the Appellant’s arrest are set out in the Statement of Agreed Facts (“the SOAF”). The Appellant, a Malaysian citizen, was 20 years old at the time of his arrest.105Foot Note 105×Statement of Agreed Facts at para 1 (ROP vol 2 at p245)He was employed as a prime mover driver by TNS Ocean Lines (S) Pte Ltd and worked at the Port of Singapore Authority (“PSA”) located at Pasir Panjang, Singapore.106Foot Note 106×Statement of Agreed Facts at para 2 (ROP vol 2 at p245)He resided in Johor Bahru, Malaysia,107Foot Note 107×Statement of Agreed Facts at para 2 (ROP vol 2 at p245)and commuted to work in Singapore on a motorcycle which bore Malaysian registration number JPG 3592.108Foot Note 108×Record of Proceedings Vol 1, Transcripts 25 September 2013, p 4 at lines 6–16. 76 On 12 June 2013, at about 6.50pm, officers from the Central Narcotics Bureau (“CNB”) began surveillance in the vicinity of Madras Hotel Eminence (“the Hotel”) located at 407 Jalan Besar, Singapore.109Foot Note 109×Statement of Agreed Facts at para 3 (ROP vol 2 at p245)They were looking out for one male Malay, Sulaimi Bin Ismail (“Sulaimi”), who was believed to be involved in drug activities. At 8.15pm, the Appellant entered Singapore through Woodlands Checkpoint. 77 At about 9.35pm, Sulaimi left the Hotel and was seen walking towards Hoa Nam Building while talking on his mobile phone.110Foot Note 110×Statement of Agreed Facts at para 4 (ROP vol 2 at p245)At around the same time, the Appellant arrived in the vicinity and parked his motorcycle near the bus stop outside Hoa Nam Building.111Foot Note 111×Statement of Agreed Facts at para 4 (ROP vol 2 at p245)The Appellant was carrying a black haversack (“the Haversack”) at that time.112Foot Note 112×Statement of Agreed Facts at para 4 (ROP vol 2 at p245) 78 Sulaimi and the Appellant met at the bus stop and then entered the 7-Eleven store located at the entrance to Hoa Nam Building (“the 7-Eleven Store”).113Foot Note 113×Statement of Agreed Facts at para 5 (ROP vol 2 at p245)Shortly thereafter, the Appellant came out of the 7-Eleven Store and sat down beside the entrance to the store.114Foot Note 114×Statement of Agreed Facts at para 6 (ROP vol 2 at p246)Sulaimi remained inside the 7-Eleven Store.115Foot Note 115×Statement of Agreed Facts at para 6 (ROP vol 2 at p246) 79 At about 9.45pm, CNB officers moved in to arrest the Appellant just outside the entrance to the 7-Eleven Store.116Foot Note 116×Statement of Agreed Facts at para 7 (ROP vol 2 at p246)He did not resist arrest and was escorted into a car belonging to the CNB. A search was conducted on the Appellant, the Haversack which he had with him and his motorcycle. The CNB officers found various items on the Appellant and in the Haversack, including the following:117Foot Note 117×Statement of Agreed Facts at paras 8–10 (ROP vol 2 at pp246-247) (a) two round bundles individually wrapped in black tape, marked “A1” and “A2”; (b) one rectangular bundle wrapped in black tape, marked “A3”; (c) one roll of black tape, marked “A4”; (d) three mobile phones; and (e) personal documents and equipment. A raincoat, a motorcycle helmet and a packet of food were found on the motorcycle. The motorcycle was subsequently sent for backscatter and K-9 searches, but nothing incriminating was found. 80 The contents of A1, A2 and A3 (collectively, “the Bundles”) were marked “A1A”, “A2A” and “A3A”. A1A and A2A were subsequently analysed by the Health Sciences Authority (“the HSA”) and found to contain 53.74g of diamorphine.118Foot Note 118×Statement of Agreed Facts at para 16 (ROP vol 2 at p248)A3A was likewise analysed by the HSA and found to contain 232.8g of cannabis119Foot Note 119×Statement of Agreed Facts at para 17(a) (ROP vol 2 at p248)and 259.8g of fragmented vegetable matter containing cannabinol and tetrahydrocannabinol (ie, cannabis mixture).120Foot Note 120×Statement of Agreed Facts at para 17(b) (ROP vol 2 at p248) 81 The HSA analysis also showed the presence of the Appellant’s DNA on the exterior surface of all the Bundles and the non-adhesive side of the tape on these bundles. In addition, the adhesive side of the black tape used to wrap A2 also contained the Appellant’s DNA.121Foot Note 121×Statement of Agreed Facts at para 21 (ROP vol 2 at pp249-251)",
        "The statements given by the Appellant in the course of the investigations": "82 The following account is derived from the eight statements that were recorded from the Appellant in the course of the investigations. The primary areas of focus are: (a) the Appellant’s background; (b) the Appellant’s relationship with one “Mogan” who passed him the Bundles; and (c) the events on the day the Appellant was arrested.",
        "The Appellant’s background": "83 According to the Appellant, at the time of his arrest, he had been working at PSA for the past three years as a prime mover driver.122Foot Note 122×ROP vol 2 at p212, para 3His work shift would usually begin at 7.30pm and end at 7.30am the next day.123Foot Note 123×ROP vol 2 at p212, para 3If there were going to be fewer ships coming into the port, he would report for work at 10.00pm.124Foot Note 124×ROP vol 2 at p212, para 3His foreman would usually call him at 4.00pm to inform him what time he had to report for work that day. The Appellant said that his gross pay, including overtime pay, was around S$2,000 every month.125Foot Note 125×ROP vol 2 at p212, para 3Each time his salary was credited into his bank account in two tranches, he would withdraw the full sum that was credited to his account as he needed to help his father settle his loans.126Foot Note 126×ROP vol 2 at p223, para 19He would also send about MYR 300 to Kedah for a tontine.127Foot Note 127×ROP vol 2 at p230, para 43He would leave the required minimum balance of S$4 in his account.128Foot Note 128×ROP vol 2 at p230, para 43",
        "The Appellant’s account of how he met Mogan": "84 The Appellant claimed that the Bundles were passed to him by Mogan and he provided an account of how he met Mogan. According to the Appellant, he met Mogan at his workplace three weeks prior to his arrest.129Foot Note 129×ROP vol 2 at p213, para 6He explained that he would, together with the rest of the workers, take a lorry at PSA’s gate to get to the crane area where the prime movers would be parked.130Foot Note 130×ROP vol 2 at p213, para 6On one of these lorry trips, which took about 15 minutes, Mogan struck up a conversation with the Appellant131Foot Note 131×ROP vol 2 at p213, para 6and they became friends. From then onwards, whenever the Appellant met Mogan during the lorry trips, they would talk to each other.132Foot Note 132×ROP vol 2 at p214, para 7 85 According to the Appellant, two to three days after he first met Mogan, Mogan requested the Appellant to drop him off at his house in Malaysia.133Foot Note 133×ROP vol 2 at p214, para 8The Appellant agreed to do so since Mogan’s house was along his way.134Foot Note 134×ROP vol 2 at p214, para 8After the Appellant dropped Mogan off at his house, Mogan asked for the Appellant’s mobile phone number and the Appellant gave it to him.135Foot Note 135×ROP vol 2 at p214, para 8Mogan explained that he wanted the Appellant’s number so that he could contact the Appellant to ask the Appellant to fetch him to work.136Foot Note 136×ROP vol 2 at p214, para 8About four to five days after that, the Appellant began to fetch Mogan to and from work during the two weeks preceding his arrest. The Appellant could not remember how many times he fetched Mogan from his house to Singapore during that time.137Foot Note 137×ROP vol 2 at p214, para 8 86 The Appellant claimed that he would sometimes have breakfast with Mogan at a Chinese coffee shop in Johor Bahru after work.138Foot Note 138×ROP vol 2 at p215, para 9The Appellant would usually pay for the meal.139Foot Note 139×ROP vol 2 at p215, para 9According to the Appellant, apart from having breakfast with Mogan and fetching Mogan to and from work, he did not have much contact with Mogan.140Foot Note 140×ROP vol 2 at p215, para 9He also said that he was “not close” to Mogan.141Foot Note 141×ROP vol 2 at p215, para 9",
        "The Appellant’s account of the events on the day he was arrested": "87 The Appellant gave the following account of the events on the day he was arrested. On 12 June 2013, at 5.00pm, the Appellant’s foreman called the Appellant to inform him that he was to start work at 10.30pm that day.142Foot Note 142×ROP vol 2 at p215, para 10At about 5.30pm, Mogan called the Appellant to ask what time the Appellant would be starting work.143Foot Note 143×ROP vol 2 at p215, para 10Mogan then asked if the Appellant could pass some “jaman” (a Tamil word meaning “things”) to Mogan’s friend in Singapore.144Foot Note 144×ROP vol 2 at p215, para 10The Appellant agreed to do so as a favour for Mogan145Foot Note 145×ROP vol 2 at p217, para 16and told Mogan that he would collect the “jaman” on his way to work.146Foot Note 146×ROP vol 2 at p215, para 10 88 At about 7.30pm to 7.45pm that day, the Appellant reached Mogan’s house.147Foot Note 147×ROP vol 2 at p215, para 10There, Mogan passed the Appellant a black plastic bag.148Foot Note 148×ROP vol 2 at p215, para 10Mogan said that a friend would collect the “jaman” but did not tell the Appellant who the friend was.149Foot Note 149×ROP vol 2 at p215, para 10The Appellant did not ask Mogan for the friend’s name. Mogan also passed his mobile phone (“HS-HP1”) to the Appellant and told him that he would call the Appellant on that phone to provide further details about the delivery of the “jaman” when the Appellant informed Mogan that he had arrived in Singapore.150Foot Note 150×ROP vol 2 at p216, para 12Mogan explained that he was passing his mobile phone to the Appellant so that the Appellant would not have to use the credit in the Appellant’s own mobile phone to make the call.151Foot Note 151×ROP vol 2 at p226, para 31 89 The black plastic bag which Mogan handed over felt heavy to the Appellant but he did not ask Mogan why it was so heavy.152Foot Note 152×ROP vol 2 at p216, para 12Mogan also did not tell the Appellant what was inside the black plastic bag or how many items were in it.153Foot Note 153×ROP vol 2 at p215, para 11The Appellant did not open the black plastic bag to see what was inside154Foot Note 154×ROP vol 2 at p215, para 11or ask what the “jaman” in it were.155Foot Note 155×ROP vol 2 at p215, para 11He did not ask Mogan why he did not bring the “jaman” into Singapore himself as he knew that Mogan had lost his passport in Malaysia around 9 June 2013.156Foot Note 156×ROP vol 2 at p215, para 11The Appellant did not suspect anything.157Foot Note 157×ROP vol 2 at p215, para 11He parted company with Mogan at about 8.30pm and left for Singapore. 90 After collecting the “jaman”, on his way to Singapore, the Appellant stopped at a petrol kiosk.158Foot Note 158×ROP vol 2 at p216, para 13He pumped petrol into his motorcycle and bought “some roti” at the petrol kiosk.159Foot Note 159×ROP vol 2 at p216, para 13This “some roti”, it will be seen later in this judgment, turned out to be five packets of bread. He opened the black plastic bag that Mogan had given him earlier and saw that there were three black “jaman” inside.160Foot Note 160×ROP vol 2 at p216, para 13He thought the black “jaman” were presents because he had seen people wrapping things in black tape in the post office in Malaysia to send them by post.161Foot Note 161×ROP vol 2 at p216, para 13The Appellant “poured” the black “jaman” into the Haversack “so that it would be easier for [him] to carry around”.162Foot Note 162×ROP vol 2 at p216, para 14He held the bottom of the black plastic bag and turned the plastic bag upside down into the centre compartment of the Haversack.163Foot Note 163×ROP vol 2 at p216, para 14The black “jaman” then “fell” into the centre compartment of the Haversack.164Foot Note 164×ROP vol 2 at p216, para 14Thereafter, the Appellant threw the black plastic bag into a rubbish bin at the petrol kiosk.165Foot Note 165×ROP vol 2 at p216, para 14He did not check the “jaman” as he did not think it was “good manners” to check things belonging to others.166Foot Note 166×ROP vol 2 at p227, para 33 91 After the Appellant poured the “jaman” into the Haversack, he pushed them to a corner so that he could put his food inside.167Foot Note 167×ROP vol 2 at p217, para 15He then left the petrol kiosk and proceeded to an Indian food stall near the Johor Customs168Foot Note 168×ROP vol 2 at p217, para 15where he bought “cooked rice, some gravy items, some ikan belis and some egg sambal”.169Foot Note 169×ROP vol 2 at p217, para 15After buying the food, he went through the Johor Customs and proceeded to Woodlands Checkpoint.170Foot Note 170×ROP vol 2 at p217, para 15 92 Upon clearing the Singapore Customs at Woodlands Checkpoint, the Appellant rode his motorcycle to Woodlands Centre.171Foot Note 171×ROP vol 2 at p223, para 21There, he bought a can of drink, and while drinking it, he called Mogan using the mobile phone HS-HP1 that Mogan had passed to him earlier to say that he had reached Singapore.172Foot Note 172×ROP vol 2 at p223, para 21Mogan told the Appellant that he could not get through to the friend who was to receive the “jaman” but would send that friend’s number by SMS to the Appellant who would then be able to contact the friend directly.173Foot Note 173×ROP vol 2 at p223, para 21Mogan also told the Appellant that there was insufficient credit in his mobile phone for him to make further calls and told the Appellant to call him using the mobile phone HS-HP1 once the Appellant had delivered the “jaman”.174Foot Note 174×ROP vol 2 at p223, para 21 93 The Appellant called the Singapore number that was sent to him by Mogan. He informed the person at the other end in the Malay language that he was Mogan’s friend and that Mogan had asked him to bring the “jaman” to him.175Foot Note 175×ROP vol 2 at p223, para 21He asked that person where the latter was and where he should bring the “jaman” to. He also told that person over the phone that he (the Appellant) was already late for work.176Foot Note 176×ROP vol 2 at p224, para 23That person instructed the Appellant to go to the 7-Eleven Store at Jalan Besar.177Foot Note 177×ROP vol 2 at p224, para 23 94 The Appellant left Woodlands Centre for Jalan Besar.178Foot Note 178×ROP vol 2 at p224, para 24He said that he knew how to get to Jalan Besar as he had been there once to look at mobile phones.179Foot Note 179×ROP vol 2 at p224, para 24When the Appellant turned into Jalan Besar, he saw a 7-Eleven store on his left and parked his motorcycle along the side of the road.180Foot Note 180×ROP vol 2 at p224, para 24He called the Singapore number that Mogan had earlier given him and asked the person who answered the call if he was at the correct 7-Eleven store.181Foot Note 181×ROP vol 2 at p224, para 24Shortly after that, the Appellant saw a man “raising his right hand, palm facing out at [him]”.182Foot Note 182×ROP vol 2 at p224, para 24The Appellant knew that was the man he was supposed to pass the “jaman” to since that man was signaling “hi” to him.183Foot Note 183×ROP vol 2 at p224, para 24 95 The Appellant got off his motorcycle to meet the man. He had never seen that man before that day. That man was later established to be Sulaimi (see [76] above). When Sulaimi approached the Appellant outside the 7-Eleven Store, he asked the Appellant whether he wanted a drink. I note here that the Appellant was inconsistent as to whether he said he wanted a drink. In his contemporaneous statement recorded on 12 June 2013 at 10.54pm and again in his cautioned statement recorded on 13 June 2013 at 4.51pm, he claimed that he told Sulaimi “no” when he was asked if he wanted a drink.184Foot Note 184×ROP vol 2 at p199; ROP vol 2 at p 209.However, in his later statement recorded on 16 June 2013 at 3.05pm, he claimed that he said “yes” when asked whether he wanted a drink as he was thirsty.185Foot Note 185×ROP vol 2 at p224, para 25Sulaimi entered the 7-Eleven Store and the Appellant followed him in. The Appellant said that he took a bottle of orange juice for himself, passed it to Sulaimi for payment and then walked out of the store.186Foot Note 186×ROP vol 2 at p224, para 26While the Appellant and Sulaimi were inside the store, they did not say anything about the “jaman” and the Appellant did not pass the “jaman” to Sulaimi.187Foot Note 187×ROP vol 2 at p224, para 26According to the Appellant, since Sulaimi wanted to buy food, he decided to wait until Sulaimi had bought his food before passing the “jaman” to Sulaimi. The Appellant and Sulaimi were inside the 7-Eleven Store for about five minutes. After choosing his drink, the Appellant walked out of the store while Sulaimi paid for the food and the drinks.188Foot Note 188×ROP vol 2 at p224, para 26The Appellant sat down on a slab of stone outside the store and moments later, he was arrested.189Foot Note 189×ROP vol 2 at p224, para 26In the contemporaneous statement recorded soon after his arrest, the Appellant, when questioned by the CNB officers who had arrested him what the Bundles were, said he did not know.",
        "The proceedings in the court below": "",
        "The Prosecution’s case": "96 At the close of the trial, the Prosecution submitted that not only had the Appellant failed to rebut the presumption of knowledge set out in s 18(2) of the MDA, the evidence also supported a finding of actual knowledge because the Appellant had been wilfully blind to the nature of the things that he was carrying. The Prosecution pointed to a number of suspicious circumstances that surrounded the delivery of the “jaman”:190Foot Note 190×Transcripts day 3, p17 at line 26– p 24 at line 5 (ROP vol 1) (a) The Appellant was not close to Mogan even though he claimed that he trusted Mogan and that was why he agreed to deliver the “jaman” without any questions.191Foot Note 191×Transcripts day 3, p18 at lines 1–12 (ROP vol 1) (b) The Appellant claimed that he was unaware of Singapore’s tough drug laws despite having worked in Singapore for three years by the time of his arrest.192Foot Note 192×Transcripts day 3, p18 at lines 24–31 (ROP vol 1) (c) The Bundles were wrapped in black tape and were relatively heavy. Although the Appellant said that they looked like postage parcels, he acknowledged that the Bundles did not have any postage stamps or any postage marks on them.193Foot Note 193×Transcripts day 3, p19 at lines 22–30 (ROP vol 1) (d) The Appellant did not know whom to deliver the Bundlesto or where, when or how the delivery was to be made.194Foot Note 194×Transcripts day 3, p20 at lines 9–11 (ROP vol 1) (e) The Appellant failed to check the Bundles despite having ample opportunities to do so and was not able to provide a satisfactory explanation for his failure to do so.195Foot Note 195×Transcripts day 3, p21 at line 17–p22 at line 7 (ROP vol 1) (f) The “unspoken interactions” between Sulaimi and the Appellant when they met “[spoke] volumes” and “suggest[ed] that they knew the illicit nature of [their] transaction”.196Foot Note 196×Transcripts day 3, p22 at lines 8–20 (ROP vol 1) (g) The Appellant’s DNA was found on the adhesive side of the black tape wrapped around A2.197Foot Note 197×Transcripts day 3, p22 at lines 21–23 (ROP vol 1)",
        "The Defence’s case": "97 The crux of the Defence’s case at the trial was that the Appellant did not know that he was carrying drugs and therefore had no knowledge of the nature of the drugs in the Bundles.198Foot Note 198×Appellant’s submissions at para 7According to the Appellant, he agreed to deliver the Bundles as a favour for Mogan and he did not inquire further about the delivery as he trusted Mogan.199Foot Note 199×Transcripts day 3, p4 at lines 21–26 (ROP vol 1)He claimed that he thought the Bundles contained presents and it never occurred to him at any time that they contained drugs or anything illegal.200Foot Note 200×Transcripts day 3, p10 at lines 18–23 (ROP vol 1)Significantly, the Appellant claimed during the trial that he had voluntarily opened the centre compartment of the Haversack for inspection at Woodlands Checkpoint. It was submitted on his behalf that this pointed to his lack of knowledge of the presence of the drugs in the Bundles.201Foot Note 201×Transcripts day 3, p6 at lines 10–13 (ROP vol 1)",
        "The decision of the Judge": "98 The primary issue before the Judge was whether the Appellant had knowledge of the contents of the Bundles. On the facts, the Judge found that the Appellant had failed to rebut the presumption of knowledge set out in s 18(2) of the MDA. In particular, the Judge took into account the following matters in convicting the Appellant on the three charges: (a) The whole purpose of the Appellant’s trip to Jalan Besar on 12 June 2013 was to deliver the Bundles to a person that Mogan had designated.202Foot Note 202×Transcripts day 3, p35 at lines 18–23 (ROP vol 1)Thus, it was troubling that the Appellant did not know the “who, when or how” about the delivery. (b) The Appellant had only known Mogan for about three weeks prior to his arrest.203Foot Note 203×Transcripts day 3, p35 at line 30–p36 at line 1 (ROP vol 1) (c) After the Appellant met Sulaimi, nothing was said and nothing was done.204Foot Note 204×Transcripts day 3, p36 at lines 7–8 (ROP vol 1)Instead, the Appellant walked out of the 7-Eleven Store without passing the Bundles to Sulaimi. This was a matter which required explanation and such explanation was lacking. (d) The presence of the Appellant’s DNA on the adhesive side of the tape used to wrap A2 was “the most incriminating evidence”.205Foot Note 205×Transcripts day 3, p34 at lines 22–27 (ROP vol 1)The Judge appeared to have accepted the evidence of the forensic expert that it was theoretically impossible for the Appellant’s DNA to have been transferred onto the adhesive side of the tape from the way the tape was unravelled after his arrest or by the adhesive side of the tape lifting his DNA from the non-adhesive side.206Foot Note 206×Transcripts day 3, p35 at lines 4–12 (ROP vol 1) 99 The Judge found that the Appellant had trafficked the drugs as a “courier” within the meaning of s 33B of the MDA. As the Public Prosecutor had issued a certificate of substantive assistance under s 33B(2) of the MDA, the Judge decided not to impose the death penalty on the first charge and instead sentenced the Appellant to life imprisonment and the minimum of 15 strokes of the cane. On the second charge and the third charge, which, as mentioned earlier, were non-capital charges, the Judge imposed the minimum sentence of five years’ imprisonment and five strokes of the cane for each charge. The two five-year imprisonment terms were ordered to run concurrently with each other but consecutively with the life imprisonment term with effect from 14 June 2013, the date of the Appellant’s remand. A day after imposing these sentences, the Judge rectified the order on consecutive sentences because s 307(2) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”) provides that where life imprisonment is imposed, all other sentences of imprisonment must run concurrently with the life imprisonment sentence. The total sentence imposed was therefore life imprisonment with caning but limited to 24 strokes as provided in s 328(6) of the CPC.",
        "My decision": "100 In the present case, it is undisputed that the Bundles containing the controlled drugs were found in the Appellant’s possession. The Prosecution is therefore able to rely on the legal presumptions set out in ss 18(1) and 18(2) of the MDA. As a result, the Appellant is presumed, pursuant to s 18(2), to have knowledge of the nature of the controlled drugs contained in the Bundles and the burden falls on him to rebut that presumption by showing, on a balance of probabilities, that he had no knowledge of the nature of those controlled drugs. 101 The majority decision of this court is that the Appellant should be acquitted on the ground that he has succeeded in rebutting the said presumption on a balance of probabilities. I respectfully disagree with this. After studying the evidence and the arguments, I am convinced that the conviction by the Judge was correct and should be affirmed. I now set out my reasons.",
        "The Appellant’s relationship with Mogan": "102 The crux of the Appellant’s case was that he was completely unaware of the presence of drugs in the Bundles that he was tasked to deliver. According to him, he did not check the Bundles as he trusted Mogan. The Appellant’s counsel submitted that there was a relationship of trust between the Appellant and Mogan because of their “close interaction”:207Foot Note 207×Appellant’s submissions at para 30 (a) The Appellant and Mogan had breakfast together in the morning. (b) The Appellant gave Mogan rides to and from work. (c) The Appellant trusted Mogan so much that he even gave Mogan MYR 100 and his Bank Rakyat account number for Mogan to deposit the money into the account. 103 I find it incredible that the Appellant would have agreed to make the delivery for Mogan without even askingwhatthe “jaman” were,whomthey were to be delivered to andwhereandwhenthey were supposed to be delivered. At the time of the Appellant’s arrest, he had only known Mogan for about three weeks. While he had ferried Mogan to and from work on his motorcycle a number of times during the two weeks preceding his arrest208Foot Note 208×ROP vol 2 at  p214, para8and had eaten breakfast with Mogan occasionally on the way home from work,209Foot Note 209×ROP vol 2 at  p215, para 9he was, by his own admission, “not close” to Mogan.210Foot Note 210×ROP vol 2 at  p215, para 9; Transcripts day 2, p 26 at lines 11–13 (ROP vol 1)This is consistent with the fact that he did not know much about Mogan save for his place of work, his address and the fact that he was a divorcee. Thus, given that Mogan gave the Appellant practically no particulars concerning the “jaman” and their delivery, it is extremely surprising that the Appellant would have blindly followed Mogan’s instructions without a single question. 104 The nature of the favours that the Appellant had allegedly done for Mogan (such as giving Mogan rides on his motorcycle and buying Mogan breakfast) was quite different from the nature of the “favour” that led to the Appellant’s arrest. That “favour” involved the delivery of goods across international borders with the nature of the goods totally unknown to the Appellant. In addition, the goods were wrapped in black tape and were in odd shapes. They were also reasonably heavy. The circumstances surrounding such a delivery across international borders would surely have raised suspicions in the mind of any ordinary person and the Appellant has given no evidence that he was an unquestioning simpleton. As a frequent traveller between Malaysia and Singapore, the Appellant was surely aware that whatever he was carrying could be subject to inspection by the authorities on both sides of the Causeway. If he were asked by the authorities what the Bundles contained, what was he going to say? He could not simply open the Bundles up for inspection, at least not without tearing the packaging apart and possibly damaging or spoiling the contents, because the Bundles were wrapped snugly in black tape. 105 As was held by this court inYeo Choon Huat v Public Prosecutor[1997] 3 SLR(R) 450 at [22], ignorance is a defence only when there is no reason for suspicion and no right and opportunity of examination. Clearly, the Appellant should have had ample reasons for suspicion and he had many opportunities to find out more about the delivery that Mogan asked him to make. According to the Appellant’s evidence at the trial, he was with Mogan for about 15 minutes on the evening of 12 June 2013 before he set out for Singapore.211Foot Note 211×Transcripts day 2, p33 at lines 3-6 (ROP vol 1)In contrast, according to his statement recorded on 16 June 2013 at 9.40am, he was actually at Mogan’s house for about 45 minutes, having arrived there at about 7.30pm to 7.45pm and having departed therefrom for Singapore at about 8.30pm (see paras 10 and 12 of that statement). However, I would give allowance for the time that Mogan could have taken before he “came down from his place” to meet the Appellant, and I would accept that the meeting that evening lasted for about 15 minutes. In any case, these estimated times were quite inaccurate since it was accepted in the SOAF that the Appellant actually entered Singapore at 8.15pm that day (see [76] above). Even so, the Appellant had more than sufficient time to ask Mogan about the things that were in the black plastic bag handed to him, especially since they felt heavy. However, without even a hint of curiosity, all that the Appellant asked Mogan was how he was supposed to contact Mogan’s friend in Singapore. Mogan’s response in any event did not state even the friend’s name or the friend’s telephone number for the Appellant to establish contact in Singapore. In my opinion, the Appellant did not ask Mogan for more information about the Bundles because he did not need to. He did not need to because in all probability, he was aware of their contents.",
        "The Appellant’s nonchalance towards the “presents”": "106 In his statements to the CNB and at the trial, the Appellant maintained that he believed the Bundles contained “presents”, without elaborating on what he thought the “presents” consisted of, as he asserted that presents were often wrapped in black tape before being sent by post in Malaysia. In my view, there was no basis for his belief that the Bundles contained presents and neither was there any real evidence to support his claim that presents were usually wrapped and posted in this manner in Malaysia. In any case, the evidence discussed below will show that the Appellant could not have believed that the Bundles were presents to be passed to Mogan’s friend in Singapore. 107 At this juncture, I should point out that there appeared to be an inconsistency between the SOAF and the Appellant’s oral testimony at the trial as to where in the Haversack the Bundles were placed. It was not disputed that the Haversack had three compartments. In the SOAF, it was stated that the CNB officers found the Bundles, together with the roll of black tape A4 (see [79(c)] above) and the Appellant’s personal property, in the “main compartment” rather than the centre compartment of the Haversack. However, in his statements to the CNB and throughout his oral testimony during the trial, the Appellant said that he had placed the Bundles in the “centre compartment” of the Haversack and both the Prosecution and the Defence proceeded on that basis without contention. There was no evidence that the Appellant shifted the Bundles from the centre compartment of the Haversack into the main compartment after passing through Woodlands Checkpoint and before riding his motorcycle to meet Sulaimi. The discrepancy was therefore probably due to the different terminology used for the three compartments of the Haversack. Accordingly, I will proceed on the undisputed basis that the Appellant placed the Bundles in the Haversack’s centre compartment in the circumstances set out below. 108 In the course of making his defence at the trial, the Appellant claimed that he transferred the Bundles into the Haversack because he noticed a tear at the side of the black plastic bag handed to him by Mogan. This reason for the transfer of the Bundles into the Haversack (ie, the tear in the black plastic bag containing the Bundles) was not mentioned in the Appellant’s statements to the CNB. According to the Appellant, he turned the plastic bag containing the Bundles upside down and “poured” the Bundles into the centre compartment of the Haversack.212Foot Note 212×Transcripts day 2, p36 at lines 11-13 (ROP vol 1)He then “pushed” the Bundles into a corner of that compartment.213Foot Note 213×Transcripts day 2, p36 at lines 14-16 (ROP vol 1)When asked whether he was concerned that he might damage the Bundles by pouring them into the Haversack and pushing them into a corner, the Appellant said “no”, explaining that the Haversack was made of cotton, so “there was cotton all around”. Moreover, he had “slowly moved the [B]undles” and was “careful about how [he] placed [the Bundles]”. The Appellant explained that he could not place the Bundles in the basket at the front of his motorcycle because they would fall out. Although he did place the black plastic bag containing the Bundles in that basket during the journey from Mogan’s house to the petrol kiosk, that was a short journey lasting less than a minute. However, the Appellant’s professed care in handling the Bundles was at odds with his description in his statement to the CNB on 16 June 2013 at 9.40am of how he placed these bundles in the Haversack:214Foot Note 214×ROP vol 2 at  216, para14 … After I opened up the plastic bag and saw the ‘jaman’ inside, I unzipped the centre compartment of my backpack, and placed it on my lap while I was sitting on my motorbike, JPG 3592, in a riding position. Then I closed the opening of the black plastic bag, gripped it with my right hand and with my left hand,I held the bottom of the plastic bag and turned the plastic bag upside down into the centre compartment of my backpack.The 3 black ‘jaman’ thenfell into the centre compartment of my backpack. … [emphasis added in bold italics] Since the Appellant did not know what sort of things was in the three “presents”, the question immediately arises: what if the “presents” were some delicate or fragile items? Moreover, the Bundles were not packed in a protective container. Why was the Appellant not concerned at all that the pouring and falling of the Bundles into the Haversack might damage their contents? Again, this evidence pointed to the fact that the Appellant was aware of what the Bundles contained and was confident that their contents would not be damaged by his actions. 109 Another instance of the Appellant’s nonchalance towards the purported “presents” in the Bundles was the fact that he subsequently placed the packet of “cooked rice, some gravy items, some ikan belis and some egg sambal”215Foot Note 215×ROP vol 2 at p 217 para 15which he had bought at the Indian food stall (see [91] above) in the same compartment where the Bundles were. During his oral testimony in court, the Appellant explained that there was curry in the packet of food that came wrapped in brown paper and in a plastic bag. Although the five packets of bread which he bought earlier at the petrol kiosk and which he placed in the same compartment of the Haversack were not likely to damage or contaminate the contents of the Bundles, surely cooked food with curry, whether piping hot or not, was quite a different matter. Yet, the Appellant could casually do what he did despite the very real possibility that the food items could spill out during his motorcycle trip into and around Singapore and damage or at least dirty the “presents”. If the Appellant did not know what the Bundles contained and if he genuinely believed that they were presents, he would not have treated them so carelessly. The evidence showed clearly that the Appellant knew that the contents of the Bundles were not fragile even though they were not hard items and that they had been securely protected from damage or from contamination. That in turn must lead to the conclusion that the Appellant was aware of what the Bundles truly contained. There was also the question of why he kept putting things into the centre compartment of the Haversack when the Haversack had two other compartments and this will be discussed further below.",
        "The alleged Customs check at Woodlands Checkpoint": "110 At the trial, the Appellant attempted to show that he did not try to conceal the Bundles while he was at Woodlands Checkpoint but actually opened voluntarily the centre compartment of the Haversack (where the Bundles were) for inspection:216Foot Note 216×Transcripts day 2, p18 at lines 10–15 (ROP vol 1). Q And was your haversack checked at the Singapore Customs? A They did, Your Honour. Q They did. You were watching them checking? A I was watching, Your Honour. Q Did they open the central compartment to look into it? A Yes, I’m the one who open it up, Your Honour. Q All right. The three black bundles which you have put into your haversack, was there anything concealing the three black bundles in your haversack? A No, Your Honour. In his closing submissions before the Judge, counsel for the Appellant submitted that the Appellant had no suspicions of any kind and pointed to, among other things, the fact that the Appellant readily opened the Haversack for inspection at the Singapore Customs.217Foot Note 217×Transcripts day 3, p6 at lines 3-11 (ROP vol 1) 111 Even though this point was not pursued by the Prosecution during its cross-examination of the Appellant, I am not able to place any weight on the Appellant’s evidence about the alleged Customs check for a number of reasons. Firstly, the alleged Customs check surfaced in evidence only at the trial, some two years and three months after the Appellant’s arrest. The Appellant did not mention it at all in any of his eight statements to the CNB. This raises the question of whether there was really such an inspection. 112 Secondly, it is common knowledge that not every traveller’s belongings are subject to inspection at Singapore’s checkpoints. If the Haversack was subject to inspection at Woodlands Checkpoint on the night of 12 June 2013, then the Appellant must have been instructed by a customs officer there to open it for inspection. On this basis, the Appellant’s opening of the centre compartment of the Haversack was something he could not have avoided anyway. Thirdly, assuming that there was a request to the Appellant to open the Haversack for inspection, he did not say that he voluntarily showed the customs officer all the items in the centre compartment or that he took them out of the Haversack. Therefore, the Appellant’s response to the question in the extract quoted at [110] above as to whether there was anything concealing the Bundles could not be correct in the light of all that he had said about his seeming predilection for putting things into the centre compartment of the Haversack. On the contrary, there were at least several other items in the centre compartment at that point in time that could have prevented the customs officer from noticing the presence of the Bundles which were wrapped in black tape and carefully pushed into one corner of that compartment. 113 In my opinion, the evidence showed that the Appellant was conscious of the need to keep the Bundles away from sight. It will be recalled that the black plastic bag which contained the Bundles was initially placed by the Appellant in the basket at the front of his motorcycle. Shortly afterwards, the Bundles were poured into the centre compartment of the Haversack and pushed into a corner. The Appellant also placed the five packets of bread that he had bought at the petrol kiosk218Foot Note 218×ROP vol 2 at p271(see [90] above) into the same compartment. After that, came the packet of Indian cooked food with curry. Other than the packets of bread and the packet of cooked food, the compartment containing the Bundles also held the Appellant’s miscellaneous personal belongings such as a red Singtel pouch, a handkerchief, a mobile phone charger, a car charger, many sockets, an LCD screen cleaning kit, a plastic container with one earpiece, a piece of blue cloth and an Allen key.219Foot Note 219×ROP vol 2 at p271The circumstances therefore showed that the Appellant was trying to keep the Bundles away from sight by placing them in one corner at the bottom of the centre compartment of the Haversack. As I have indicated earlier, this also showed that he had no concern that the alleged presents in the Bundles could be damaged by all his other belongings in the same compartment. This was clearly one of the factors that pointed to his knowledge of the contents of the Bundles. I mention here in passing that by the time the Appellant arrived at Jalan Besar to meet the intended recipient of the Bundles (ie, Sulaimi), he had apparently taken the packet of cooked food out from the Haversack and placed it somewhere on his motorcycle, presumably in the basket at the front, because the CNB officers found the packet of cooked food on the motorcycle, as stated in the SOAF.",
        "The Appellant’s provision of his Bank Rakyat account number to Mogan": "118 The Appellant claimed that Mogan did not promise him any payment for delivering the Bundles. When confronted with a text message which showed that he had provided Mogan with his Bank Rakyat account number, the Appellant claimed that he had done so for the purpose of enabling Mogan to deposit cash into his (the Appellant’s) bank account. According to the Appellant, on a previous occasion, he handed MYR 100 to Mogan for him to deposit on his behalf because Mogan left work earlier on that day. Again, such an explanation makes no sense. The Appellant left for Johor Bahru every morning after finishing work at PSA. Why was there a need to deposit MYR 100 into his Bank Rakyat account urgently? Further, the Appellant appeared to be in constant need of money and was highly unlikely to have had spare cash to deposit. He said that he would withdraw all his salary the moment it was credited into his bank account in Singapore226Foot Note 226×ROP vol 2 at p230, para 43as there were demands on his salary. He kept only S$4 in his bank account here because that was the minimum balance required by the bank.227Foot Note 227×ROP vol 2 at p230, para 43Further, while the Appellant claimed in his statement recorded on 17 June 2013 at 3.28pm that he had never asked Mogan to lend him money,228Foot Note 228×ROP vol 2 at p231, para 49he said during cross-examination that there was one occasion when he asked Mogan for S$2 because he had insufficient money to buy food.229Foot Note 229×Transcripts day 2, p27 at line 6 (ROP vol 1)For these reasons, I could not accept the Appellant’s explanation on why he had provided his Bank Rakyat account number to Mogan. Instead, the evidence pointed clearly to the much higher likelihood that it was to enable Mogan to pay him for the illegal work done on Mogan’s behalf.",
        "The Appellant’s credibility": "119 V K Rajah J (as he then was, sitting as the trial judge in the High Court) said inPublic Prosecutor v Tan Kiam Peng[2007] 1 SLR(R) 522 at [11] that when apprentice couriers are apprehended, they will “almost invariably vigorously assert their innocence” and that “such denials of knowledge must be scrupulously analysed and warily assessed for consistency and credibility”. In the present case, the Appellant claimed not to have known about the strict drug laws in Singapore despite having worked here for three years by the time of his arrest.230Foot Note 230×Transcripts day 2, p38 at lines 4–12 (ROP vol 1)In this context, it would be apposite to note again the observations of Rajah J in the case cited above, at [12]: It bears emphasis that at all border control points and on all immigration entry cards, the mandatory penalties inextricably linked to trafficking or consuming drugs are clearly and unequivocally articulated. As a consequence, one can almost invariably assume that all persons entering Singapore would have been sufficiently alerted and sensitised of the need to take measures enabling them to ascertain the contents and nature of any substance they transport into or within Singapore. In my view, having worked here for three years and having entered Singapore on numerous occasions, the Appellant could not have been ignorant of all the warnings about bringing illegal drugs into Singapore. He must have been aware of our strict drug laws and was therefore being untruthful in his denial that he had such knowledge. 120 In addition, despite the attempts to portray the Appellant as a guileless person, I think the Appellant is a fairly intelligent man who was not as naïve as he was made out to be. Firstly, as pointed out by the Prosecution in the trial court, during medical check-ups done for the purpose of renewing his work permit, the Appellant was sharp enough to notice a specific question in the medical form asking whether he had taken drugs before. Yet, he claimed that he was not aware of the warning notices on drug trafficking which he would have come across each time he travelled to Singapore.231Foot Note 231×Transcripts day 3, p24 line 30 to p 25 line 3 (ROP vol 1). 121 Secondly, on the witness stand, the Appellant was able to adjust his answers in response to the questions posed. For example, he claimed that he had “poured” the Bundles into the centre compartment of the Haversack and then “pushed” them to one corner. When he was asked if he was worried that the Bundles would be damaged, he quickly added that he had taken care in placing the Bundles in the Haversack. This was despite his own description about how the Bundles were “poured” into the Haversack. Another example may be found in his answers in cross-examination on his interaction with Sulaimi. As noted above, his initial position (in his statement to the CNB recorded on 16 June 2013 at 3.05pm232Foot Note 232×ROP vol 2 at p 225, para26and during cross-examination)233Foot Note 233×Transcripts day 2, p42 at lines 21-29 (ROP vol 1)was that when he first saw Sulaimi, both of them acknowledged each other by nodding and that apart from telling Sulaimi that he wanted a drink, he did not say anything else to Sulaimi. When he was asked whether he informed Sulaimi that he was late for work, he was quick to describe a conversation to that effect with Sulaimi,234Foot Note 234×Transcripts day 2, p42 at line 30 to p 43 at line 19 (ROP vol 1)which, unfortunately for him, turned out to be inconsistent with his earlier position that there was no other interaction between him and Sulaimi save for Sulaimi asking him whether he wanted a drink and his answer to that question.",
        "The Appellant’s decision not to call Mogan or Sulaimi to give evidence": "122 Both Mogan and Sulaimi were serving sentences in prison here at the time of the Appellant’s trial235Foot Note 235×Transcripts day 1, p 81 at lines 29–30 (ROP vol 1); Transcripts day 1, p 82 at lines 12–14 (ROP vol 1)and were available as witnesses during the trial. Mogan had by then been sentenced to 23 years’ imprisonment and 15 strokes of the cane while Sulaimai had been sentenced to imprisonment of five years and six months and three strokes of the cane. Mogan would have been the best person to corroborate the Appellant’s assertion of his lack of knowledge of the contents of the Bundles. However, neither the Prosecution nor counsel for the Appellant decided to call Mogan or Sulaimi to testify at the trial. Upon whom then should the duty fall to call one or both of these witnesses to testify? In such a situation, the operation and effect of the legal presumptions under the MDA become highly significant. The Bundles containing the controlled drugs were found in the Appellant’s possession, thereby enabling the Prosecution to invoke the presumptions of possession and knowledge in ss 18(1) and 18(2) of the MDA respectively. In relation to the presumption of knowledge in s 18(2), it was the Appellant who bore the burden of proving on a balance of probabilities that he had no knowledge of the nature of the controlled drugs in his possession. It was not the duty of the Prosecution to call evidence to prove that the Appellant did not lack knowledge of the drugs in his possession because the s 18(2) presumption, once invoked, meant that the Appellant had knowledge of the nature of the drugs and the Prosecution was entitled to rest its case on that fact, leaving the Appellant to provide evidence to rebut the presumption (see the recent decision of this court inObeng Comfort v Public Prosecutor[2017] SGCA 12 at [33]–[40] of that judgment). If the Appellant did so, the Prosecution would then have to decide whether or not it was necessary to call evidence to rebut the Appellant’s evidence. Since the Appellant’s defence turned on his claim that he was simply doing Mogan a favour by delivering some “presents” to Mogan’s friend, it was open to, and indeed incumbent upon, the Appellant to call Mogan as his witness and to apply to cross-examine him if necessary. However, according to the Appellant’s counsel, the Appellant made a considered decision not to call Mogan as his witness at the trial. It should be noted too that the same counsel had also acted for Mogan when Mogan was brought to court to answer his case. 123 While the Appellant’s decision not to call Mogan and/or Sulaimi as witnesses was not conclusive of his guilt, the absence of these two men, particularly Mogan, from the trial meant that there was no independent evidence supporting the Appellant’s defence. Even if we leave aside any issue of adverse inferences to be drawn against the Appellant for failing to call Mogan and/or Sulaimi as witnesses, their absence, coupled with the suspicious circumstances surrounding the delivery of the Bundles and the Appellant’s lack of credibility, leads clearly to the conclusion that the Appellant has failed to rebut the presumption of knowledge set out in s 18(2) of the MDA.",
        "The DNA evidence, the extra mobile phone HS-HP1 and the roll of black tape A4": "124 In arriving at my decision on the Appellant’s guilt, I did not rely on the following evidence: (a) the presence of the Appellant’s DNA on the adhesive side of the black tape used to wrap A2; (b) the extra mobile phone HS-HP1 found in the Appellant’s possession; and (c) the roll of black tape A4 found in the Haversack. In respect of the DNA evidence, the argument was that there was a possibility that the Appellant’s DNA could have been left on the adhesive side of the black tape wrapped around A2 if he had touched an exposed part of the adhesive side of the tape because the forensic evidence did not specify the exact part of the tape that contained the Appellant’s DNA. The HSA has said that it was theoretically impossible that that could have happened here. I think the possibility is remote but I see no need to rely on the DNA evidence to establish the Appellant’s guilt. I also do not think that the extra mobile phone HS-HP1 which Mogan handed to the Appellant added much to the Prosecution’s case. As for the roll of black tape A4, the scientific analysis236Foot Note 236×ROP vol 2 at  p 61showed that it was not associated with the black tape used to wrap the Bundles and therefore, it could not suggest that the Appellant had participated in the wrapping of the Bundles. To this extent, I think the Judge was wrong when he said in his oral judgment that the presence of A4 in the Appellant’s possession “requires explanation” from the Appellant. Further, if that meant that the Appellant had assisted in the wrapping of the Bundles, it would contradict the Judge’s conclusion that the Appellant had merely been performing the job of a courier within the meaning of s 33B of the MDA. In any event, these three pieces of evidence are either immaterial or irrelevant to me in my evaluation of the entire case before the court."
    }
}