{
    "case_title": "Tan Cheng Bock vAttorney-General",
    "ncitation": "[2017] SGCA 50",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 This appeal turns on the correct interpretation of two provisions in the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint) (“Constitution”), Arts 19B and 164. Both provisions were inserted into the Constitution by the Constitution of the Republic of Singapore (Amendment) Act 2016 (Act 28 of 2016) (“2016 Amendment”), which was passed on 9 November 2016 and took effect on 1 April 2017. They were part of a raft of changes affecting the office of the President that were implemented by the 2016 Amendment. 2 Art 19B(1) introduces the concept of a “reserved election”. It provides that an election for the office of the President shall be reserved for candidates of a particular community if no person from that community has held the office of President for the five most recent terms of office. “Community” here refers to the Chinese, Malay, and Indian or other minority communities (Art 19B(6)(a)–(c)). As to how and when the framework for a reserved election shall take effect, Art 164 requires Parliament to specify by separate legislation “the first term of office of the President to be counted for the purposes of deciding whether an election is reserved under Art 19B” (“first term”). 3 Parliament subsequently specified, in separate legislation, the last term of office of President Wee Kim Wee as the first of the five most recent terms of the office of the President for the purposes of Art 19B. After President Wee’s term of office, the office was next held by President Ong Teng Cheong, President S R Nathan (who held the office for two terms) and the incumbent President, Dr Tony Tan Keng Yam. Since none of these persons were members of the Malay community, the effect of Parliament’s choice is that the next presidential election, which is to be held in 2017 (“2017 election”), will be reserved for candidates from that community. 4 The specification of President Wee’s last term of office as the first term has given rise to a question as to the correct interpretation of Arts 19B and 164. The Appellant, Dr Tan Cheng Bock, contends that this specification by Parliament was contrary to the Constitution. He maintains that the discretion that Art 164 affords Parliament is not an unrestricted discretion. Rather, he contends that Parliament can only designate, as the first (in time) of the “5 most recent terms”, one of the terms of office of any of those Presidents who were elected to office directly by the citizens of Singapore rather than by Parliament. President Ong was the first President to be so elected. The Appellant accordingly maintains that President Ong’s term of office is the earliest one that Parliament could lawfully have specified as the first term pursuant to Art 164. It follows, on this interpretation, that the next presidential election should not be reserved for candidates from the Malay community. 5 As against this, the Respondent, who is the Attorney-General (“AG”), argues that there is no such restriction on Parliament’s power under Art 164. Indeed, he contends that at the time Parliament passed the 2016 Amendment, Parliament had been apprised of the Government’s intention to specify President Wee’s last term of office as the first term. This the Respondent says is clear from the record of the Parliamentary debates. He maintains that in the circumstances, there can be no basis for concluding that Parliament then acted outside its constitutional limits when it subsequently specified President Wee’s last term of office as the first term – just as it had said it would at the time the relevant constitutional provisions were passed. 6 Properly framed, the issue we are asked to determine is what, if any, are the limitations on the “term of office” of the President that Parliament could lawfully choose to specify as the first term under Art 164. More specifically, the question is whether Parliament was restricted to choosing from the terms of office of the Presidents elected directly by the citizens of Singapore, as the Appellant contends. This has to be answered by interpreting the relevant constitutional provisions purposively, as mandated by s 9A of the Interpretation Act (Cap 1, 2002 Rev Ed) (“IA”).",
        "Background": "7 On 5 May 2017, the Appellant filed Originating Summons No 495 of 2017 (“OS 495”) in the High Court seeking a declaration that: (a) Section 22 of the Presidential Elections (Amendment) Act 2017 (Act 6 of 2017) (“PE(A) Act 2017”) is inconsistent with Arts 19B(1) and/or 164(1)(a) of the Constitution, and therefore void by virtue of Art 4 of the Constitution, which provides that the Constitution is the supreme law of Singapore and that any law enacted by Parliament which is inconsistent with it shall be void to the extent of the inconsistency; (b) In the alternative, the reference to President Wee in the Schedule referred to in s 22 of the PE(A) Act 2017 is inconsistent with Arts 19B(1) and/or 164(1)(a) of the Constitution, and therefore void by virtue of Art 4 of the Constitution. 8 The application was heard before a High Court judge (“Judge”) on 29 June 2016. On 7 July 2017, the Judge dismissed the application, providing his detailed reasons in a written judgment: seeTan Cheng Bock v Attorney-General[2017] SGHC 160 (“Judgment”). 9 On 12 July 2017, the Appellant filed the present appeal against the Judge’s decision. The appeal was expedited in view of the urgency of the matter: the Government had announced its intention to issue the writ of election for the next presidential election no later than 31 August 2017, that being the expiry of the term of office of the incumbent President, Dr Tony Tan (seeSingapore Parliamentary Debates, Official Report(6 February 2017) vol 94), and it was common ground between the parties that we should resolve this appeal before the writ is issued. 10 The Appellant is a medical doctor by profession, and stood as a candidate in the last presidential election that was held in 2011. Before that, he served as a Member of Parliament (“MP”) for 26 years. Before the Judge, the Respondent accepted that the Appellant had standing to bring this challenge under the Constitution (Judgment at [6]). For the reasons he gave at [7] of the Judgment, the Judge, too, thought that the Appellant satisfied the standing requirement. We proceed on the same basis.",
        "Evolution of the office of the President": "11 At [8] to [29] of the Judgment, the Judge detailed the evolution of the office of the President since Singapore gained independence on 9 August 1965. For the purposes of this appeal, it is unnecessary for us to repeat this in full. Instead, we highlight only some key historical developments in the office of the President, so as to provide some context for the discussion that follows. 12 Singapore separated from the Federation of Malaysia and became an independent nation on 9 August 1965. Prior to that, while Singapore was a constituent state of the Federation, the Head of State of the State of Singapore was the Yang di-Pertuan Negara. On Independence, the Head of State of the new nation was designated as the President of Singapore. At that time, the office of the President was largely a ceremonial one, albeit with immense symbolic importance. The President was elected by Parliament for a four-year term: see Art 17(1) of the Constitution of the Republic of Singapore (1980 Reprint) (“Constitution (1980 Reprint)”). In keeping with the ceremonial and symbolic role of the office, the President’s powers, for the most part, could only be exercised on the advice of the Cabinet or a Minister acting under its general authority. Despite subsequent amendments to the Constitution which expanded the scope of the President’s powers, the ceremonial and symbolic function of the President has never been abrogated. Indeed, this remained at the core of the President’s role as the Head of State and the personification of a multi-racial nation, even as the office was reshaped over time. Singapore has had four Presidents who were elected by Parliament: Encik Yusof bin Ishak, who had been the Yang di-Pertuan Negara and went on to become our first President; Dr Benjamin Sheares, who held office for three terms; Mr Devan Nair, who held office for one term; and President Wee, who held office for two terms and retired on 31 August 1993. 13 The year 1991 saw the transition to what is popularly referred to as the Elected Presidency. This involved several changes to the office of the President; for present purposes, of particular note is that the President was to be elected directly by the citizens of Singapore for a term of six years, rather than by Parliament for a term of four years. These changes were motivated by the desire to confer on the President the responsibility and power to act as a check on the Government when it came to safeguarding certain critical assets including, in particular, the financial reserves that Singapore had accumulated since Independence. The idea of the Elected Presidency was first mooted in 1984 by then Prime Minister Lee Kuan Yew. It was further developed in two White Papers issued in 1988 and 1990, which traced the contours of the proposed institution. On 3 January 1991, Parliament passed the Constitution of the Republic of Singapore (Amendment) Act 1991 (Act 5 of 1991) (“1991 Amendment”), which created the Elected Presidency. The amendments vested the President with important custodial powers which were not restricted to being exercised on the advice of the Cabinet, and which could potentially block the decisions of the Government. These powers related to two of Singapore’s key assets: its financial reserves and its public service. The President was empowered to veto decisions on a variety of matters concerning the use of Singapore’s financial reserves, as well as key appointments to the public service. The addition of these custodial functions to the Presidency also explains why the office was transformed from one elected by Parliament to one elected by the citizenry as a whole. A President elected into office by the citizens would have the direct mandate of the people and with it the democratic legitimacy and the moral authority to block the elected Government should the need arise. At the same time, it was thought necessary to balance this by ensuring that the President so elected would be suitably qualified to exercise these custodial powers. Hence, another critical feature of the 1991 Amendment was the introduction of stringent eligibility criteria that any aspiring candidate for the Elected Presidency would have to satisfy, and a pre-qualification process to verify that such criteria were in fact met. 14 The new provisions on the Elected Presidency came into operation while President Wee was still in his second (and last) term of office. The 1991 Amendment therefore included a transitional provision which provided that President Wee would continue to hold the office for the remainder of his term and would exercise, perform and discharge the functions, powers and duties conferred or imposed on the President following the 1991 Amendment. That transitional provision was Art 163 of the Constitution, which we will return to later in this judgment. 15 Following the completion of President Wee’s last term of office, the first President elected to the office by the citizens of Singapore was President Ong, who served one term from 1 September 1993 to 31 August 1999. He was succeeded by President Nathan, who served two terms from 1 September 1999 to 31 August 2011. President Tan, the incumbent President, became President on 1 September 2011 and his term of office will expire on 31 August 2017. 16 The next significant event occurred in 2016. The President’s custodial powers had been refined and in some respects narrowed through various constitutional amendments made after the 1991 Amendment, but 2016 was especially significant because of the comprehensive review of the Elected Presidency which was undertaken that year. On 27 January 2016, Prime Minister Lee Hsien Loong (“PM Lee”) announced his intention to establish a Constitutional Commission (“Commission”) to study and recommend changes to three aspects of the Elected Presidency, one of which was the representation of minority races in the Presidency. The Commission was appointed on 10 February 2016. After a national consultation process, the Commission issued its report dated 17 August 2016 (“Commission’s Report” or “Report”). In its Report, the Commission recommended a number of measures to address the concerns that had been identified in its terms of reference. Among these was what it called a “hiatus-triggered” safeguard to ensure that the office of the President would from time to time be held by members of all the principal racial communities in Singapore. This would later be given effect in the form of Art 19B(1) of the Constitution. 17 On 15 September 2016, the Government issued a White Paper (Review of Specific Aspects of the Elected Presidency) (15 September 2016) (“White Paper”), in which it indicated that it agreed in broad terms with the recommendations of the Commission. The Constitution of the Republic of Singapore (Amendment) Bill (Bill 28 of 2016) (“2016 Bill”), which included Arts 19B(1) and 164, was first read in Parliament on 10 October 2016 and debated from 7 to 9 November 2016 during its second reading. As mentioned, Parliament passed the 2016 Bill on 9 November 2016. It received the assent of President Tan on 21 December 2016 and came into operation on 1 April 2017. This date is referred to as the “appointed date” in Art 164 and we use that term in the same way. 18 Following that, the Presidential Elections (Amendment) Bill (Bill 2 of 2017) (“PE(A) Bill”) was read in Parliament on 9 January 2017. It was debated on 6 February 2017 and passed on the same day. It was assented to by President Tan on 13 March 2017 and this too came into operation on 1 April 2017. 19 In the PE(A) Act 2017, Parliament specified the first term for the purpose of determining whether and when a presidential election should be reserved under Art 19B(1). The PE(A) Act 2017 amended the Presidential Elections Act (Cap 240A, 2011 Rev Ed) (“PEA”) by inserting, among other provisions, a new s 5A, titled “Reserved elections: how counted”. Section 5A states that the Schedule to the PEA has effect for the purposes of determining whether an election is reserved under Art 19B(1) of the Constitution. That Schedule was inserted into the PEA by s 22 of the PE(A) Act 2017. It lists the terms of office of five previous Presidents and specifies the racial communities to which they belonged. The first term in that list is that of President Wee; it is not in dispute that this refers to President Wee’s second term of office which was from 1 September 1989 to 31 August 1993. 20 It was against the backdrop of these constitutional amendments and other legislative actions that the Appellant filed the originating summons which led to the present appeal.",
        "Decision below": "21 We briefly recount the principal reasons underlying the Judge’s decision to dismiss the Appellant’s application. 22 The Judge carefully considered the text of Arts 19B and 164. As a preliminary point, he did not accept the Appellant’s argument that, because these articles allegedly encroach on the fundamental right of a citizen to stand for office, Arts 19B and 164 of the Constitution should be construed restrictively (at [40]–[44] of the Judgment). 23 Instead, he adopted a purposive approach to interpreting the text of these provisions. The Judge first determined the ordinary meaning of Art 164, then that of Art 19B, before turning to extraneous material to see whether it could assist in determining their meaning. In his view, the following conclusions could be drawn from a plain reading of Art 164: (a) Art 164 expressly imposes a duty on Parliament to choose the first term and implicitly gives it the power to do so (at [50] of the Judgment). (b) Since on its terms Art 164 empowers Parliament to choose the first term, it follows that Art 19B does not determine what the first term should be. Nor does Art 164 state what the first term should be. Instead, Parliament is empowered to choose the first term, which explicitly could be one that commenced before the appointed date (1 April 2017) and in respect of which there was no express limitation as to how far back before the appointed date Parliament could go (at [51]). (c) Parliament’s power under Art 164 must nonetheless be exercised in accordance with Art 19B. Both articles must be read consistently and in the event of any inconsistency, Art 19B should prevail. That is because, on a plain reading, the purpose of Art 164 is to implement the reserved election model under Art 19B (at [52]). 24 The question then was whether Art 19B constrains Parliament’s power to act under Art 164. The Judge held that Art 19B does not limit Parliament’s power in any material way. In particular, it does not restrict Parliament to choosing only the terms of office of Presidents elected under the framework for the Elected Presidency when specifying the first term under Art 164 (at [67]). The Judge’s reasons were as follows: (a) The word “President” does not on the face of Arts 19B and 164 refer only to a President elected by the citizens (at [58]). Art 19B does not distinguish between Presidents elected by Parliament and those elected by the citizens (at [59]). It would have been easy for Parliament to draw such a distinction (at [61]), especially given that Parliament had explicitly excluded from the ambit of Art 19B those who exercise the powers and discharge the functions of the President when the office is vacant or when the President is under a temporary disability (at [62]). (b) Although Art 2 defines a “President” as one who is “elected under this Constitution”, this does not mean that the “President” must be one who is elected by the citizens; it could also include a President elected by Parliament (at [65(a)]). The fact that Art 17A of the Constitution, which was introduced as part of the 1991 Amendment, provides that Presidents are to be “elected by the citizens of Singapore” does not mean that the definition of “President” in Art 2 is limited to popularly-elected Presidents; this is because Art 17A was introduced in 1991 and sets out the position that prevails today (at [65(b)]). But the definition of “President” in Art 2 was introduced before that in the Constitution (1980 Reprint) and has not changed since then; the fact that Parliament retained this definition unchanged when it enacted the 2016 Amendment, suggested that the definition of “President” would include Presidents elected by Parliament. Such an interpretation would also ensure that the acts of those Presidents as well as any immunities conferred on them would not be rendered invalid. (c) The phrase “term of office” in Art 19B(1) does not mean that only a President who has served a term of six years falls within the scope of Art 19B(1). That argument assumes that “term of office” must be defined by reference to the position under the Constitution as it stands today (at [66]). 25 The Judge then considered the relevant extraneous material (meaning admissible material other than the text of the 2016 Amendment which might shed light on the legislative purpose), and concluded that this confirmed the ordinary meaning of Arts 19B and 164. There was nothing to suggest any fetter on Parliament’s power to specify President Wee’s second and last term of office as the first term (at [99]). 26 In the Judge’s view, there were three legislative purposes behind Arts 19B and 164, each more abstract and general than the one preceding it (at [85]). Parliament intended: (a) To be able to specify President Wee’s last term of office as the first term; (b) To ensure that the present system of choosing the President through popular elections produces Presidents from the minority communities from time to time; and (c) To uphold multi-racialism by ensuring minority representation in the Presidency. 27 As to these, the Judge’s views were as follows: (a) The first purpose was Parliament’s specific intention and he had to interpret Art 19B in light of that intention. PM Lee had said in Parliament during the second reading of the 2016 Bill that the Government would specify President Wee’s last term of office as the first term thus making the 2017 election a reserved election for candidates from the Malay community. Parliament passed the 2016 Amendment knowing that the Government intended to do this (at [89]–[90]). Therefore, Parliament intended to be able to specify President’s Wee’s last term of office as the first term, and Art 19B had to be interpreted in the light of that specific intention (at [90]–[91]). (b) The second purpose was the most favourable to the Appellant’s case because it suggested that only the terms of popularly-elected Presidents should be counted for the purpose of Art 19B (at [86]). However, although some speakers in Parliament referred to popularly-elected presidents and six-year terms during the reading of the 2016 Bill, no member specifically suggested that the count under Art 19B had to start from the first popularly-elected President; it was only by implication that one could surmise that the speakers’ intention was for only popularly-elected Presidents to be counted. Furthermore, even if one were to accept that Parliament’s primary purpose in enacting Arts 19B and 164 was to ensure that Presidents of minority races were elected by the citizens from time to time, Parliament did not only intend to ensure that the electoral process returned Presidents of minority races from time to time; it also considered other matters, such as the fact that Singapore had not had a Malay President for 46 years and that a Malay President might not be elected to the Presidency in the immediate future. Thus, any interpretation of Arts 19B and 164 had also to account for the more specific as well as the more abstract intentions of Parliament, that is, the first and third purposes. Purposive interpretation had to be true to Parliament’s purpose as a whole (at [87]). (c) The third purpose would be fulfilled regardless of whether the President was elected by the citizens or by Parliament. Interpreting Art 19B in the light of the first purpose would thus be consistent with the third purpose as well (at [92]). 28 The Judge rejected the Appellant’s arguments that the court should place little weight on Parliament’s intention (as reflected in PM Lee’s statement referred to at [27(a)] above) that President Wee’s last term be specified as the first term because it had been mistaken about the law. The Judge considered that Parliament could not have been mistaken about the law, because it was making new law, and in any event the courts were bound to give effect to Parliament’s clear intention even if it had been based on a mistake (at [94]–[95]). Whether Parliament based this intention on the AG’s advice was not relevant (at [96]). 29 Finally, the Judge found that the Commission’s Report and the White Paper did not support the Appellant’s interpretation of Arts 19B and 164 (at [97]). As for the Explanatory Statement to the 2016 Bill, this confirmed that Parliament did not intend that the power it conferred upon itself under Art 164 was to be limited to specifying as the first term, the term of office of a President who had been popularly elected (at [98]).",
        "The parties’ principal arguments on appeal": "30 Because of the expedited nature of this appeal, the Judge ordered the parties’ written submissions filed for OS 495 to stand as their respective cases on appeal. The parties’ grounds of appeal were set out in the skeletal submissions which they filed on 21 July 2107. 31 The Appellant raised three principal grounds of appeal in his skeletal submissions: (a) First, the Judge was wrong to hold that the definition of “President” in Art 2 refers both to Presidents elected by Parliament and Presidents elected by the citizens. Rather, the definition refers only to the latter category. It would follow from this that under Art 164, Parliament could only specify the term of office of a President who had been elected by the citizens. (b) Second, the Judge erred in finding that Parliament’s intention was specifically to permit the subsequent specification of President Wee’s last term as the first term. Instead, Parliament’s intention which emerges from the relevant extraneous material was to limit itself to specifying a term of office of a President elected by the citizens as the first term. (c) Third, Parliament’s specification of President Wee’s term as the first term was based on the misapprehension that President Wee was a President elected by the citizens. The Judge was wrong to have held otherwise. 32 Broadly speaking, the Respondent’s responses to these arguments were as follows: (a) First, as a matter of textual interpretation, Art 164 confers unlimited power on Parliament to specify the first term. On its face, it does not restrict Parliament to specifying the term of office of a popularly-elected President as the first term. Further, Art 19B does not impose any relevant constraints on Art 164. In particular, it is significant that Art 19B speaks of an election being reserved if no person from a racial community has “held the office of President”. This focuses on those who have in fact been President of Singapore and not on the method by which they came to hold that office. (b) Second, this textual analysis is supported by the relevant extraneous material evidencing Parliament’s intention. The specific intention of Parliament was to specify President Wee’s last term as the first term, which is evident from PM Lee’s statement to this effect (this is the statement we have referred to at [27(a)]). (c) Third, the Appellant’s argument that Parliament’s choice was based on a misapprehension of law was in fact circular. The Appellant (and for that matter the court) does not know the contents of the AG’s advice and he has seemingly concluded that the AG’s advice must have been wrong because it differed from the Appellant’s own interpretation of the relevant provisions of the Constitution. 33 We will examine the parties’ arguments in greater detail at the appropriate points below.",
        "Our decision": "",
        "The purposive approach to constitutional interpretation": "34 As we noted at the outset of this judgment, the question before us is one of constitutional interpretation. Hence, it is logical to begin our analysis of the issue before us by identifying the relevant principles of constitutional interpretation. In this connection, we were assisted by the fact that both counsel for the parties, Mr Chelva Retnam Rajah SC(“Mr Rajah”) for the Appellant and the learned Deputy Attorney-General Mr Hri Kumar Nair SC(“Mr Nair”) for the Respondent, were essentially in agreement on what these were. Nonetheless, it is useful for us to take this opportunity to emphasise the relevant principles. 35 It is common ground that the Constitution should be interpreted purposively. This follows from the fact that Art 2(9) of the Constitution provides that the IA shall apply in the interpretation of the Constitution; and the IA, as we note below, mandates the purposive approach. That means it should be interpreted in a way that gives effect to the intent and will of Parliament. This intent will generally be reflected in the text of the enactment. The Constitution’s words are to be read in their grammatical and ordinary sense and in their entire context, harmoniously with the scheme of the Constitution as a whole, and the relevant objects or intentions that may be gleaned from this. Additionally, the court may consider, in certain circumstances and subject to certain limitations, relevant extraneous material. We elaborate on this below. The relevant Parliamentary intention is to be found at the time the law was enacted or, in some circumstances, when it subsequently reaffirms the particular statutory provision in question: seeConstitutional Reference No 1 of 1995[1995] 1 SLR(R) 803 at [44]. 36 Purposive interpretation becomes, at least potentially, of particular relevance and assistance where there are two or more possible interpretations of a given legislative provision. Where this is so, the interpretation that promotes the purpose or object of the written law is to be preferred to the interpretation that does not. That is the effect of s 9A(1) of the IA, which as we have noted, applies equally to questions of constitutional interpretation. Section 9A of the IA provides: Purposive interpretation of written law and use of extrinsic materials 9A.—(1) In the interpretation of a provision of a written law, an interpretation that would promote the purpose or object underlying the written law (whether that purpose or object is expressly stated in the written law or not) shall be preferred to an interpretation that would not promote that purpose or object. (2) Subject to subsection (4), in the interpretation of a provision of a written law, if any material not forming part of the written law is capable of assisting in the ascertainment of the meaning of the provision, consideration may be given to that material — (a) to confirm that the meaning of the provision is the ordinary meaning conveyed by the text of the provision taking into account its context in the written law and the purpose or object underlying the written law; or (b) to ascertain the meaning of the provision when — (i) the provision is ambiguous or obscure; or (ii) the ordinary meaning conveyed by the text of the provision taking into account its context in the written law and the purpose or object underlying the written law leads to a result that is manifestly absurd or unreasonable. (3) Without limiting the generality of subsection (2), the material that may be considered in accordance with that subsection in the interpretation of a provision of a written law shall include — (a) all matters not forming part of the written law that are set out in the document containing the text of the written law as printed by the Government Printer; (b) any explanatory statement relating to the Bill containing the provision; (c) the speech made in Parliament by a Minister on the occasion of the moving by that Minister of a motion that the Bill containing the provision be read a second time in Parliament; (d) any relevant material in any official record of debates in Parliament; (e) any treaty or other international agreement that is referred to in the written law; and (f) any document that is declared by the written law to be a relevant document for the purposes of this section. (4) In determining whether consideration should be given to any material in accordance with subsection (2), or in determining the weight to be given to any such material, regard shall be had, in addition to any other relevant matters, to — (a) the desirability of persons being able to rely on the ordinary meaning conveyed by the text of the provision taking into account its context in the written law and the purpose or object underlying the written law; and (b) the need to avoid prolonging legal or other proceedings without compensating advantage. 37 The correct approach to purposive interpretation under s 9A was summarised following close analysis in the judgment of the minority inAttorney-General v Ting Choon Meng and another appeal[2017] 1 SLR 373 (“Ting Choon Meng”), a recent decision of this court on which both the parties and the Judge relied heavily. Although we refer principally to the minority judgement, there was no disagreement on the broad steps to be taken in purposively interpreting a legislative provision. It was noted at [59] that the court’s task when undertaking a purposive interpretation of a legislative provision involves three steps: (a) First, ascertain the possible interpretations of the provision, having regard not just to the text of the provision but also to the context of that provision within the written law as a whole. (b) Second, ascertain the legislative purpose or object of the statute. (c) Third, compare the possible interpretations of the text against the purposes or objects of the statute. These steps mirrored, and set out in greater specificity, the approach taken by the majority inTing Choon Meng, which also began by interpreting the text of the legislative provision in question in the context of the statute as a whole before considering its legislative purpose (seeTing Choon Mengat [19]). 38 The first of these steps is fairly uncontroversial. It requires a court to ascertain the possible interpretations of the provision. A court does so by determining the ordinary meaning of the words of the legislative provision. It can be aided in this effort by a number of rules and canons of statutory construction, all of which are grounded in logic and common sense. We mention two rules which we will refer to in due course. One is that Parliament shuns tautology and does not legislate in vain; the court should therefore endeavour to give significance to every word in an enactment (seeJD Ltd v Comptroller of Income Tax[2006] 1 SLR 484 at [43]). Another relevant rule is that Parliament is presumed not to have intended an unworkable or impracticable result, so an interpretation that leads to such a result would not be regarded as a possible one (seeHong Leong Bank Bhd v Soh Seow Poh[2009] 4 SLR(R) 525 at [40]). Distinguishing between specific and general purposes 39 It is the second step of the analysis – formulating the legislative purpose of a provision – which tends to present difficulty. Casting the legislative purpose differently or at different levels of generality may result in varying and even conflicting interpretations. The articulation of purpose at different levels of generality could also result in the court describing the purpose in whatever terms would support its preferred interpretation (as was observed inTing Choon Mengat [60]). Thus, properly identifying the legislative purpose is of paramount importance. 40 It is important here to distinguish between thespecificpurposeunderlying a particular provision and thegeneralpurposeor purposesunderlying the statute as a whole or the relevant part of the statute. As noted inTing Choon Mengat [60], the words of s 9A of the IA are ambiguous as to which purpose is best considered in this context. This is because it refers both to the purpose underlying the “written law” (in s 9A(1)) and to that underlying the “provision of the written law” (in s 9A(2)–(3)). As was observed inTing Choon Mengat [61], “the purpose behind a particular provision may yet be distinct from the general purpose underlying the statute as a whole”, and it may therefore be necessary to separately consider the specific purpose of a particular provision when the court endeavours to ascertain the legislative intent. This is only logical given that different provisions may target different specific mischiefs. 41 The distinction between the specific purpose of a provision and the general purpose of a statute is a significant one. The same point was made by the Federal Court of Australia inEvans v Minister for Immigration and Multicultural and Indigenous Affairs[2003] FCAFC 276 when it observed at [16] that “[u]nder the umbrella of the general object is a multitude of objects of specific provisions”, and by the New South Wales Court of Appeal inEdwards v Attorney General(2004) 60 NSWLR 667 when it observed at [72] that “it may be said that there is an underlying object of the Act as a whole and there may be a separate object of discrete parts of it, subject of course to the purpose of the whole”. We note from the use of the phrases “[u]nder the umbrella of the general object” and “subject of course to the purpose of the whole”, that these cases appear to contemplate that the specific purpose canneverbe contrary to the general purpose. We need not go quite as far given that this issue does not arise in this case; for present purposes we prefer to leave it on the footing that in a truly exceptional case, it may be that the specific intention of Parliament is so clear that the court should give effect to it even if it appears to contradict, undermine, or go against the grain of the more general purpose. Such cases would, however, be rare (as noted inTing Choon Mengat [60]), if they ever occurred at all. The court must begin bypresumingthat a statute is a coherent whole, and that any specific purpose does not go against the grain of the relevant general purpose, but rather is subsumed under, related or complementary to it. The statute’s individual provisions must then be read consistently withboththe specific and general purposes, so far as it is possible. Preferring internal to external sources in ascertaining purpose 42 The next question concerns how the relevant purposes may be discerned. There are two types of sources from which a court may draw to discern these purposes. The first and obvious source is the text of the relevant legislative provision itself and its statutory context. The second source is “any material not forming part of the written law” as set out in s 9A(2)–(3) of the IA – this is what has come to be referred to as “extraneous material”. 43 Consideration of extraneous material can be very helpful and such material tends to be referred to extensively in aid of purposive interpretation. However, we emphasise that in seeking to draw out the legislative purpose behind a provision, primacy should be accorded to the text of the provision and its statutory context over any extraneous material. The law enacted by Parliament is the text which Parliament has chosen in order to embody and to give effect to its purposes and objects. In line with this, the meaning and purpose of a provision should, as far as possible, be derived from the statute first, based onthe provision(s) in question read in the context of the statute as a whole. This approach also coheres with the language of s 9A(1), which suggests thepossibilityof the purpose or object of a statute being “expressly stated in the written law”. 44 There are three main textual sources from which one can derive the purpose of a particular legislative provision. First, the long title of a statute might give an indication of its purpose. If there is no contradiction between the general purpose of the statute and specific purpose of the legislative provision in question, the purpose stated in the long title may also shed light on the purpose of the specific legislative provision in question. Second, the words of the legislative provision in question will clearly be of critical importance. We agree with the Judge who noted (at [37(a)] of the Judgment) that if a provision is well-drafted, its purpose will emanate from its words. Third, other legislative provisions within the statute may be referred to, so far as they are relevant to ascertaining what Parliament was seeking to achieve and how. In particular, the structure of the statute as a whole and the location of the provision in question within the statute may be relevant considerations. 45 Furthermore, s 9A(4) of the IA expressly directs that when deciding whether any extraneous material should be referred to and/or what weight should be given to such material, consideration must be given to the desirability of persons being able to rely on the ordinary meaning conveyed by the text and to the need to avoid prolonging legal proceedings. This too suggests that the primary source of information as to the legislative intent should be the text itself. Consideration of extraneous material under s 9A(2) may then be had, but only in appropriate circumstances. It is to these we now turn. Consideration of extraneous material 46 We start by observing that the word “consider” as used (in its various forms) in s 9A implies more than mere reference; it implies some degree of reliance on the material for the purposes stated under s 9A(2). Before deciding whether to “consider” the extraneous material, the court would necessarily refer to it to make a preliminary assessment of whether it is capable of giving assistance. If it is incapable of giving assistance, then there is no question of “considering” it because no useful reliance can be placed on it. Only if the material is capable of giving assistance will the court proceed to “consider” the material in its full depth and breadth. That is how the court avoids being cast adrift on a sea of irrelevant material (seeTing Choon Mengat [63]–[64]). 47 InTing Choon Meng, the three situations under which the court may consider extraneous material as set out under s 9A(2) were outlined as follows (at [65]): (a) Under s 9A(2)(a), toconfirmthat the ordinary meaning deduced is the correct and intended meaning having regard to any extraneous material that further elucidates the purpose or object of the written law; (b) Under s 9A(2)(b)(i), toascertainthe meaning of the text in question when the provision on its face is ambiguous or obscure; and (c) Under s 9A(2)(b)(ii), toascertainthe meaning of the text in question where having deduced the ordinary meaning of the text as aforesaid, and considering the underlying object and purpose of the written law, such ordinary meaning is manifestly absurd or unreasonable. 48 It may be asked, if extraneous material is being considered under s 9A(2)(a), whether there is a real point to considering such material. If the extraneous material does not confirm the ordinary meaning – or even calls that ordinary meaning into question – the court is not permitted to use that extraneous material as a basis for departing from the ordinary meaning, as that is only permissible when reference is made under s 9A(2)(b). If instead the extraneous material does confirm the ordinary meaning, that too would not alter the result: the court would have had to apply the ordinary meaning in any event since s 9A(2)(b) was not invoked. It may seem from this that there is no point in referring to the extraneous material either way. 49 In our judgment, the explanation for this is a practical one: even though extraneous material referred to under s 9A(2)(a) alone cannot alter the outcome of a decision, it is useful for demonstrating the soundness – as a matter of policy – of that outcome. This is an important function given that the law is not only meant to be applied but is also, ideally, meant to be understood and appreciated by the people who are governed by it. In that sense, the availability of s 9A(2)(a) advances the rule of law by assuring the governed that the court is applying the law in keeping with the policy imperatives for which it was enacted. There is thus utility in having a provision of the IA which legitimises the outcome of the court’s inquiry in such situations. 50 It also bears mentioning that extraneous material cannot be used “to give the statute a sense which is contrary to its express text” (Seow Wei Sin v Public Prosecutor[2011] 1 SLR 1199 at [21]) save perhaps in the very limited circumstances identified in s 9A(2)(b)(ii) of the IA (see [47(c)] above). This echoes the broader principle that the proper function of the judge when applying s 9A of the IA is tointerpreta given statutory provision. Although purposive interpretation is an important and powerful tool, it is not an excuse for rewriting a statute (see [43] above). The authority to alter the text of a statute lies with Parliament, and judicial interpretation is generally confined to giving the text a meaning that its language can bear. Hence, purposive interpretation must be done with a view toward determining a provision’s or statute’s purpose and object “as reflected by and in harmony with the express wording of the legislation”:Public Prosecutor v Low Kok Heng[2007] 4 SLR(R) 183at [50]. 51 In our judgment, consideration of extraneous material should be tempered by these conditions set out in s 9A of the IA. Further, only material that is capable of assisting in ascertaining the meaning of the provision(s) by shedding light on the purpose of statute as a whole, or where applicable, on the purpose of particular provision(s) in question, should be referred to (Ting Choon Mengat [63]). 52 The extraneous material that is most commonly called in aid is the record of the Parliamentary debates on the Bill containing the legislative provision in question. This would comprise the speech made in Parliament by the Minister when the Bill containing that legislative provision was moved (s 9A(3)(c) of the IA) and other relevant material in any official record of debates in Parliament (s 9A(3)(d) of the IA). While the Parliamentary debates can often be a helpful source of information about the relevant legislative purpose, this does not mean thatanythingsaid in Parliament that could potentially touch on the purpose of the legislative provision in question is relevant. On this point, it is worth reiterating the following propositions noted inTing Choon Mengat [70]: (a) The statements made in Parliament must be clear and unequivocal to be of any real use. (b) The court should guard against the danger of finding itself construing and interpreting the statements made in Parliament rather than the legislative provision that Parliament has enacted. (c) Therefore, the statements in question should disclose the mischief targeted by the enactment or the legislative intention lying behind any ambiguous or obscure words. In other words, the statements should be directed to the very point in question to be especially helpful. 53 These propositions are relevant at two stages of the inquiry: to determine whether Parliamentary debates are capable of giving assistance such that they should be “considered”; and if so, to determine what weight should be placed on them. Furthermore, although these propositions are particularly important when dealing with statements made in Parliamentary debates, there is no reason why they should not also apply to other types of extraneous material. Purposive approach summarised 54 We summarise the legal principles that are applicable in the present case as follows: (a) The purposive approach to statutory interpretation, which is mandated by s 9A of the IA, applies to the interpretation of provisions in the Constitution by virtue of Art 2(9) of the Constitution. (b) The court must start by ascertaining the possible interpretations of the provision of the Constitution, having regard not just to its text but also to its context within the Constitution as a whole. (c) The court must then ascertain the legislative purpose or object of the specific provision and the part of the Constitution in which the provision is situated. The court then compares the possible interpretations of the provision against the purpose of the relevant part of the Constitution. The interpretation which furthers the purpose of the written text should be preferred to the interpretation which does not. (i) It may be necessary to distinguish between the specific purpose of the Constitutional provision in question, and the general purpose of the part of the Constitution in which it is found. If the general purpose sheds no light on the object of a given specific provision, it may be necessary to examine the specific purpose separately. (ii) The purpose should ordinarily be gleaned from the text itself. The court must first determine the ordinary meaning of the provision in its context, which might give sufficient indication of the objects and purposes of the written law, before evaluating whether consideration of extraneous material is necessary. (iii) Consideration of  extraneous material may only be had in three situations: (A) If the ordinary meaning of the provision (taking into account its context in the written law and purpose or object underlying the written law) is clear, extraneous material can only be used to confirm the ordinary meaning but not to alter it. (B) If the provision is ambiguous or obscure on its face, extraneous material can be used to ascertain the meaning of the provision. (C) If the ordinary meaning of the provision (taking into account its context in the written law and the purpose or object underlying the written law) leads to a result that is manifestly absurd or unreasonable, extraneous material can be used to ascertain the meaning of the provision. (iv) In deciding whether to consider extraneous material, and if so what weight to place on it, the court should have regard to the desirability of persons being able to rely on the ordinary meaning conveyed by the text of the provision (taking into account its context in the written law and the purpose or object underlying the written law); and the need to avoid prolonging legal or other proceedings without compensating advantage. The court should also have regard to (i) whether the material is clear and unequivocal; (ii) whether it discloses the mischief aimed at or the legislative intention underlying the statutory provision; and (iii) whether it is directed to the very point of statutory interpretation in dispute. 55 In that light, we turn to the specific provisions in dispute.",
        "The ordinary meaning of the text of Arts 19B and 164": "56 We begin with the text of Arts 19B and 164 in their relevant statutory context. Because of the need to have regard to the relevant context, it will also be necessary to have regard to other provisions in the Constitution such as Arts 2 and 163, among others, at a later stage of the analysis. 57 Art 19B provides, so far as is relevant: Reserved election for community that has not held office of President for 5 or more consecutive terms 19B.—(1) An election for the office of President is reserved for a community if no person belonging to that community has held the office of President for any of the 5 most recent terms of office of the President. … (3) For the purposes of this Article, a person who exercises the functions of the President under Article 22N or 22O is not considered to have held the office of President. (4) The Legislature may, by law — (a) provide for the establishment of one or more committees to decide, for the purposes of this Article, whether a person belongs to the Chinese community, the Malay community or the Indian or other minority communities; (b) prescribe the procedure by which a committee under paragraph (a) decides whether a person belongs to a community; (c) provide for the dispensation of the requirement that a person must belong to a community in order to qualify to be elected as President if, in a reserved election, no person who qualifies to be elected as President under clause (2)(a), (b) or (c) (as the case may be) is nominated as a candidate for election as President; and (d) make such provisions the Legislature considers necessary or expedient to give effect to this Article. … (6) In this Article — “community” means — (a)the Chinese community; (b) the Malay community; or (c) the Indian or other minority communities; … “term of office”includes an uncompleted term of office. … 58 Art 19B(1) is crucial in that it introduces the concept of a reserved election. That is apparent from its title: “Reserved election for community that has not heldoffice of Presidentfor 5 or more consecutive terms”. In this connection, it may be noted that the words “office of President” appear not just in the title but three times within the relatively short clause. The third time the expression “office of President” appears, it includes the definite article “the” before “President”, but that is in substance the same expression that has already been used twice in the same clause. Broken down, and ignoring for the moment any other clause, Art 19B(1) may be understood as follows: (a)“An election for the office of President”: As a matter of logic, this must be an election that has not yet been held because it would be meaningless, having regard to the subject matter of the clause, for Parliament to make provision reserving an election which has already taken place for candidates from a particular community. No election before the introduction of Art 19B had been reserved and it would make no sense for Parliament to enact legislation that purports to reserve an already completed election. By the same token, any such election would necessarily be an election for the office of Presidentunder the Constitution as it standsafter the coming into force of the 2016 Amendment(in other words, after the appointed date). Thus, it would seem that the words “office of President” refer to the office as it exists after the appointed date, and not as it existed previously. (b)“is reserved for a community”: This introduces the concept of the reserved election. (c)“if no person belonging to that community has held the office of President”: This is of interest to us for two main reasons. First, it identifies a part of the condition on which the election is to be reserved. That condition (in part) is that no person from the community for which the election is to be reserved has been the President for a time. But the second and significant point is that the condition is defined by reference to no such person having “held the office of President”. As to this, two points may be noted: (i) This part of Art 19B(1) uses the same expression “office of President” as does the first part referred to at (a) above. Where the identical expression is used in a statute, and all the more so, where it is used in the same sub-clause of a section in a statute, it should presumptively have the same meaning. This is a rule of interpretation rooted in simple logic. However, this is not an inflexible rule and the court may, on construing the provision in context, conclude that the identical expressions means different things: seeMadras Electric Supply Corporation Ltd v Boardland (Inspector of Taxes)[1955] 1 AC 667 at 685. However, unless we are satisfied that Parliament did intend that the identical expression, “office of the President”, in Art 19B(1) could mean two different things, the presumptive view would be that the condition – that no person of a given community has held the office of President – would be assessed by reference to those eligible for and holding that office under the Constitution as it stands after the appointed date; (ii) The second point to note is that it speaks not of a President who was elected to the office but of one who hasheld the office. This choice of words is potentially of wide application. There are potentially two categories of persons it could cover: those who have held the office in their own right, pursuant to an election (leaving to one side for the moment, whether this is by Parliament or by the citizens); and those who do not hold the office in their own right but exercise the functions and powers of the office for a time. In relation to the former category, namely those who hold the office in their own right, Art 19B is silent on how long a President must have held the term for. (d)“for any of the 5 most recent terms of office of the President”: This too is of interest for two reasons. First, it completes the condition for an election to be reserved by stipulating the duration for which no person of the community in question must have held the office. The second point is that it defines that duration by reference to the number of “terms of office of the President” rather than by reference to a certain length of time. As explained, “office of the President” here should bepresumedto mean the same as “office of President” as it is used throughout Art 19B(1). Therefore, the “5 most recent terms of office” referred to here are those terms of office held by Presidents under the Constitution as it stands after the appointed date. The practical effect of this interpretation is that any term of office held by a President before the appointed date cannot be counted, as it would have been a term of the office of the President as it existedundera previous version of the Constitution, and not a term of the office of the Presidentas it exists after the coming into effect of the 2016 Amendment. 59 Taken together, at least presumptively, and without regard to any other provision, Art 19B(1) appears to mean this: any election for the office of President to be held after the appointed date shall be reserved for a community if no person belonging to that community has, held the office of President for any of the five most recent terms of office of the President preceding that election. Furthermore, by reason of what we have said at [58(c)(i)] the process of reckoning the five terms would only begin after the appointed date. This goes further than even the Appellant’s position in terms of when the first reserved election can be, because it would suggest that the five terms of office to be counted can only be terms held after the appointed date. On this basis, no election can be reserved for a considerable time after the appointed date. 60 What remains uncertain or unclear, just on the basis of the language of Art 19B(1), are the following points: (a) Does Art 19B(1) refer to those who have not held the office in their own right but who have, on a temporary basis, exercised the functions and powers of the office? (b) In relation to those who have held the office in their own right, does it extend to those who have done so for an incomplete term? 61 In relation to the first point, we doubt that Art 19B(1) can refer to those who have not held the office in their own right since the legislative expression is “hold the office of President”. Those who exercise the functions or powers temporarily would not ordinarily be said to be holding the office but rather would be discharging the relevant functions either because the one who does hold the office is under a temporary disability or because the office is vacant. Reference to Art 22N and Art 22O, which deal with these situations, confirms this and there too, the expression used to describe such a person is one who shall “exercise the functions of the office of President” – see for example Art 22N(1) and Art 22O(1) – and the words “hold the office of the President” are not used to refer to such persons in Arts 22N or 22O. On the other hand, the definition of “President” in Art 2 (see below at [76]) suggests that it would include such a person who discharged the functions of the office unless the context suggested otherwise. Any ambiguity is resolved by Art 19B(3), which makes it clear that such a person is not considered to have held the office of President. Hence, the provision contemplates only those who have held the office in their own right. 62 As to the second of the points noted at [60] above, Art 19B(1) alone does not seem to distinguish between complete or partial terms. The only condition is that the President has held the office. Hence, looking at Art 19B(1) on its own, we do not think that the phrase “5 most recent terms of office” must necessarily be terms of office that have been completed. In any event, this doubt is clarified by looking beyond Art 19B(1) to Art 19B(6) which confirms that “term of office” includes an uncompleted term of office. 63 But the question of constitutional interpretation in this appeal does not concern only Art 19B; here we turn to Art 164, which provides: Transitional provisions for Article 19B 164.—(1) The Legislature must, by law — (a) specify the first term of office of the President to be counted for the purposes of deciding whether an election is reserved under Article 19B; and (b) if any of the terms of office that are counted for the purposes of deciding whether an election is reserved under Article 19B commenced before the appointed date, further specify the communities to which the persons who held those terms of office are considered to belong. (2) In this Article, “appointed date” means the date of commencement of section 9 of the Constitution of the Republic of Singapore (Amendment) Act 2016. As we shall see, Art 164 is of critical importance and, ultimately, must displace the presumptive position described above (at [59]). 64 Art 164 is a transitional provision. The function of a transitional provision is, as the Appellant rightly points out, “to make special provision for the application of legislation to the circumstances which exist at the time when that legislation comes into force” (Regina v Secretary of State for Social Security ex parte Britnell[1991] 1 WLR 198 at 202B–C). 65 That is what Art 164 does for Art 19B. Art 164(1)(a) mandates that Parliament shall specify the “first term of office” to be counted for the purposes of determining a reserved election under Art 19B; it is, as the Judge noted, a “duty-imposing” provision as much as a “power-conferring” one. Looking further,Art 164(1)(b) crucially adds that if any of the terms counted for the purposes of deciding if an election is reserved under Art 19B commencedbeforethe appointed date (1 April 2017), Parliament must specify the racial communities to which the persons holding the terms of office belonged. This cuts against, and must displace, the provisional and presumptive position arrived at above (see [59] above) that the first term should be oneafterthe appointed date. Art 164 clearly contemplates that Parliament may choose a term of office that commenced either before or after 1 April 2017 as the first term. If it chooses a term of officeafterthe appointed date, nothing further needs to be done. However, if it chooses a term of officebeforethe appointed date, then under Art 164(1)(b), in relation to any of the terms that are counted before the appointed date, the communities to which the persons “whoheldthose terms of office” [emphasis added] belong must also be specified. In the face of such clear and specific provisions, we can only conclude that the presumptive position earlier discussed cannot stand – it must be possible for Parliament to designate terms of the office of the President which were heldbeforethe appointed date, or else Art 164(1)(b) would be senseless and unnecessary. 66 That does not mean that Art 19B operates retrospectively in the strict sense. There is a distinction between legislating to alter or affect matters in the past and legislating to provide for the future consequences of past events: seeCraies on Legislation(Daniel Greenberg gen ed) (Sweet & Maxwell, 10th Ed, 2012) at paras 10.3.5–10.3.6. The former is clearly retrospective legislation. The scheme provided for under Arts 19B and 164 comes under the latter category. This is an instance of legislation allowing future action to be potentially influenced by past events. 67 In this light, we are driven to reconsider another aspect of the presumptive position that we preliminarily arrived at, namely that the expression “office of President” when used on each of the three occasions in Art 19B(1) means the same thing, which is the office of President under the Constitution as it stands today after the 2016 Amendment. 68 In our judgment, it remains clear, for the reasons set out at [58(a)] above that the only election that can possibly be reserved is one that is to be held after the appointed date; and therefore, the first reference to that expression, “office of President” in Art 19B(1) is to that office as it exists after the appointed date. 69 However, it is now also clear, in the light of Art 164 and what we have said at [65], that the second and third references to “office of President” and “office of the President” in Art 19B(1) cannot bear the same meaning without rendering the whole of Art 164(1)(b) and Art 164(2) otiose and meaningless. This is a conclusion to be avoided, since, as we have noted, Parliament should not be taken to have legislated in vain. Nor are the three separate references to “office of (the) President” irreconcilable. They can coexist perfectly well by construing the second and third uses of the expression “office of President” to mean the office as it was prior to the appointed date, under previous iterations of the Constitution. 70 However, this construction of Art 19B(1) read with Art 164 revives an issue that we did not previously have to deal with although we alluded to it fleetingly at [58(c)(ii)]: is the critical expression “has held the office of President” in Art 19B(1) and the corresponding variant in Art 164(1)(b) to be construed as excluding those who have held the office in their own rightbybeing elected to that office by Parliament rather than by the citizens? In the final analysis, this was the nub of the issue between the parties. “Terms of office” not restricted to terms of Presidents who were elected by citizens 71 Before we turn to examine this in detail, it would be helpful if we made some observations: (a) Because we consider that the earliest possible election that can be reserved is the 2017 election, it stands to reason that if Parliament were to start the count of the “5 most recent terms” under Art 19B(1) from before the appointed date, there would be no purpose in Parliament specifying as the first term any term before President Wee’s last term. We say this because that is the earliest of the five most recent terms preceding the 2017 election. Furthermore, this is also correct as a matter of logic. There would simply be no rational cause for Parliament to specify a term earlier than that because it would have the same effect as specifying President Wee’s last term as the first term. Parliament must be presumed to have acted rationally; it would not therefore have conferred on itself a power (in this case, the power to specify a term of office before President Wee’s last term) which is unnecessary for achieving a result which could equally have been reached without that power. This is an aspect of the principle we have stated above that Parliament does not legislate in vain. To this extent, and with respect, we disagree with the Judge’s observation that, in specifying the first term of office, there “is no limitation in Art 164 on how far back” Parliament can go (Judgment at [51(c)]). In our judgment, there is an implicit limit of five terms. (b) Of the five terms of office of the President preceding the 2017 election, the following may be noted: (i) None of the Presidents in question held the office pursuant to an election under the present iteration of the Constitution. This much is self-evident from the fact that extensive amendments were made, in the 2016 Amendment, to the relevant parts of the Constitution, including the eligibility criteria, the method of establishing such eligibility and the potential need to reserve elections from time to time. (ii) Four of the terms were held by Presidents who held the office pursuant to an election by the citizens under previous iterations of the Constitution. The Constitution has been amended from time to time including with respect to the functions and powers of the President. However, President Ong, President Nathan and President Tan each held office pursuant to elections held under the framework of the Elected Presidency as it was prior to the 2016 Amendment, in terms of the eligibility criteria, the method or need to establish such eligibility and without any need to consider whether an election had to be reserved. (iii) President Wee, alone in this group, held the office pursuant to an election by Parliament, under an even earlier iteration of the Constitution than his successors. However, President Wee continued to hold the office after the Elected Presidency was introduced and a specific transitional provision, Art 163, was passed at that time that was of particular relevance and application to him alone. We examine the significance of Art 163 a little later. (c) Although we will develop the point further below, in our judgment, it cannot meaningfully be contended, as Mr Rajah seemed to do, that President Wee did not “hold” the office of President. On any basis he did. And even though it is true that the office changed quite dramatically in the midst of his last term, there is simply no doubt at all that he continued to hold the office with the enhanced powers and functions under the framework of the Elected Presidency introduced by the 1991 Amendment. Lest any doubt persist, Art 163, to which we have already referred, is explicit in these terms: Person holding office of President immediately prior to 30th November 1991 to continue to hold such office 163.—(1) The personholding the office of Presidentimmediately prior to 30th November 1991shall continue to hold such office for the remainder of his term of officeand shall exercise, perform and discharge all the functions, powers and duties conferred or imposed upon the office of President by this Constitution as amended by the Constitution of the Republic of Singapore (Amendment) Act 1991 (Act 5 of 1991) (referred to in this Article as the Act), as if he had been elected to the office of President by the citizens of Singapore, except that if that person vacates the office of President before the expiration of his term of office, a poll shall be conducted for the election of a new President within 6 months from the date the office of President became vacant. [emphasis added] 72 In our judgment, on its terms, Art 163 applies only to President Wee, being the person who held the office of President immediately before 30 November 1991. What this provision does is to make it clear beyond argument that: (a) President Weeheld the officeof President; (b) He continued to hold the office after the 1991 Amendment; and (c) President Wee was the first President to exercise the enhanced powers of the Elected Presidency and was empowered to do so as if he had been elected by the citizens. 73 In the light of these observations, the scope of the controversy becomes even narrower. To succeed, the Appellant must establish that the expressions “has held the office of President” in Art 19B(1) and “the persons who held those terms of office [of the President]” in Art 164(1)(b) must be qualified or limited by construing the reference to “President” (explicit in the former and implicit in the latter) as referring to one who not only held the office with the accompanying enhanced powers inherent in the Elected Presidency, but who was also elected to that office under the framework that was introduced by the 1991 Amendment. 74 The Appellant faces several (and considerable) difficulties, of which we note these at the outset: (a) The focus of Arts 19B and 164 is on those who haveheldthe office of President, not those who have beenelectedto that office in a particular way; (b) Both before and after the introduction of the Elected Presidency framework, the President was elected, albeit initially by Parliament and only later by the citizens. Nothing in the text or context of Arts 19B and 164 suggests any concern over or preoccupation with the method by which they were elected; (c) Although President Wee was elected by Parliament, by virtue of Art 163, it was indisputable that he did, in fact and in law,holdthe office under the framework of the Elected Presidency. 75 These are the hurdles that the Appellant will have to clear to succeed in the appeal. In that light, we briefly set out the rest of the statutory context before turning to the Appellant’s principal arguments. (1) The statutory context 76 First, under Art 2 of the Constitution, unless the context otherwise requires, “President” is defined to mean: the President of Singaporeelected under this Constitutionandincludes any person for the time being exercising the functions of the office of President[emphasis added] It is obvious, by reason of Art 19B(3) and what we have said at [61] above, that the latter part of that definition cannot possibly apply in the context of this discussion. The material part of the definition is therefore the “President … elected under this Constitution”. Clearly, the manner of electing the President under the Constitution has been amended from time to time, notably in 1991 and 2016, but this definition predates both those sets of amendments and has not been amended since the Constitution (1980 Reprint). 77 Art 2 also defines “commencement” to mean: “commencement”, used with reference tothis Constitution, means 9th August 1965 [emphasis added] 78 This is potentially significant because it suggests that “this Constitution” commenced upon Independence, even though it has undoubtedly been amended from time to time. 79 As for the election of the President under the Constitution, Art 17A(1) provides: 17A.—(1) The President is to beelected by the citizens of Singaporein accordance with any law made by the Legislature. [emphasis added] 80 This compares with Art 17(1) of the Constitution (1980 Reprint) which was in force prior to the 1991 Amendment and which provided that: 17.—(1) There shall be a President of Singapore, whoshallbe elected by Parliament. [emphasis added] (2) The Appellant’s arguments 81 We turn to the Appellant’s principal arguments in relation to the interpretation of these provisions. 82 The Appellant’s case hinges largely on the definition of “President” in Art 2 read with certain provisions of the IA. His case may be summarised in this way: (a) Art 2 defines a President as one who is elected under “this Constitution”. This raises a question as to what “this Constitution” means. (b) Section 8(3) of the IA provides that any citation of an Act shall be construed as a reference to the Act as amended from time to time by any other Act. Section 15(2)(a) similarly provides that where a written law repeals any former written law, a reference in the written law to the repealed provision shall be construed as a reference to the re-enacted provision. (c) Parliament repealed Chapter 1, Part V of the Constitution (1980 Reprint), Art 17, which provided for the President to be elected by Parliament and replaced it with the Elected Presidency under the 1991 Amendment. (d) Therefore, the reference in Art 2 to a President elected under “this Constitution” must be a reference to Presidents elected under “this Constitution”as amendedby the 1991 Amendmentand it must therefore exclude President Wee who was elected under a previous iteration of the Constitution which included Art 17 and which has been repealed. 83 The relevant provisions of the IA are as follows: Mode of citing Acts 8.—(1) Where any Act is referred to… (3) Any such citation of an Act shall,unless the contrary intention appears, be construed as a reference to the Act as amended from time to time by any other Act. … References to amended and re-enacted provisions 15.—… (2) Where any written law repeals and reenacts, with or without modification, any provision of a former written law, then,unless the contrary intention appears— (a) any reference in any other written law to theprovision so repealedshall be construed as a reference to the provision so reenacted; ... [emphasis added] 84 It is necessary to unpack the Appellant’s argument as we have summarised it at [82] above in order to assess whether it has force. 85 If we take the Appellant’s reliance on ss 8(3) and 15(2)(a) of the IA to its logical conclusion, it would mean that a reference to “this Constitution” in the definition of “President” in Art 2 is a reference to the Constitution as it stands after the 2016 Amendment. 86 We should first say that s 15(2)(a) appears to be inapplicable. On its terms, it applies where one written law refers to a “provision” which has been repealed and re-enacted. As highlighted at [82(d)], the Appellant’s argument is that a reference in Art 2 to “this Constitution” (which is an entire Act, not a “provision”) must refer to the Constitution as it existed after the 1991 Amendment. Accordingly, there seems, to us, to be no basis for applying s 15(2)(a). 87 The more relevant provision is s 8(3) of the IA. First, it should be noted that s 8(3) is only applicable unless a “contrary intention appears” having regard to the text and context of the relevant provisions being construed. 88 We proceed on the basis that when applying s 8(3), the reference to “this Constitution” in the definition of “President” in Art 2 of the Constitution can be construed as a “citation of an Act”. Therefore, Art 2’s reference to “this Constitution” would, by virtue of s 8(3), “be construed as a reference to the [Constitution] as amended from time to time by any other Act”. The “other Act” for this purpose must refer to the 2016 Amendment. 89 Therefore, if the expression “this Constitution” that is contained in the definition of “President” in Art 2 is interpreted in accordance with s 8(3) of the IA, then the consequence would be that for the purpose of Art 19B(1) of the Constitution, the expression “has held the office of President” must mean someone who has held the office under the Constitution as it stood after the 2016 Amendment. Hence, applying s 8(3) of the IA, any citation of “this Constitution” must mean the Constitution as it was so amended. At one level, this would cohere precisely with the preliminary and presumptive construction of Art 19B, taken on its own, at which we arrived at [59] above. 90 The difficulty, however, is that adopting such a construction would do intolerable violence to Art 164, which is an essential provision to be considered when construing Art 19B – see further at [65]–[69] above. We cannot see how an interpretation which depends on so serious and glaring a contradiction can be justified. 91 Furthermore, such a construction would (as the Respondent points out) be inconsistent with the position the Appellant takes before us. The Appellant’s position is that the first term to be counted could be that of President Ong or any of the Presidents who took officeafterhim but not that of any who held the officebeforehim. Yet if we were to interpret “this Constitution” here to mean the Constitution as it stands after the 2016 Amendment, it would be impermissible to count the terms of office ofanyof the previous Presidents, regardless of how they were elected to office. This is because President Ong and each of his successors – although elected by the citizens of Singapore – were nonetheless elected under previous iterations of the Constitution, and not the Constitution as it now stands. For one thing, the 2016 Amendment updated the eligibility criteria and introduced a new certification process. These changes are reflected in the presently amended form of Art 19. It is undisputed that President Ong, President Nathan and President Tan all did not undergo the processes set out in the present iteration of Art 19. Hence, on this interpretation, Parliament could not specify the term of office ofanyprevious President as the first term, but as we have noted, this is so plainly contrary to the express terms of Art 164 that it must be rejected. 92 Such an interpretation of “this Constitution” could also make Art 19B unworkable moving forward. If “this Constitution” means the latest iteration of the Constitution as it stands from time to time, then the goal of having reserved elections might be frustrated indefinitely if the count has to start afresh each time any part of the Constitution is amended. This seems illogical and counter-intuitive. 93 When we pointed out to Mr Rajah these difficulties that would result if we applied s 8(3) of the IA, he clarified that his position was that at the time the 2016 Amendment was passed, the mode of electing Presidents was as set out in Art 17, that is, by the citizens. Hence, the reference in Art 2 to a President “elected under this Constitution” must be taken as a reference to a President elected by the citizens of Singapore under Art 17. As long as a President has been elected by the citizens of Singapore under Art 17, even under any previous iteration of the Constitution, the term of office of such a President could be counted for the purpose of Art 19B(1). 94 There are several difficulties with this. First, this is not a result that can be arrived at by calling in aid either s 8(3) or s 15(2)(a) of the IA. For the purposes of s 8(3) of the IA, the relevant Act that is referred to in the definition of “President” in Art 2 is “this Constitution”. For the reasons we have just set out, s 8(3) simply cannot apply in this context, given the express words of Art 164. Nor, for the reasons stated at [86] above, does s 15(2)(a) apply. 95 Second, the Appellant in effect seeks to draw a line at the 1991 Amendment and contends that Art 164 does not allow Parliament to specify the term of office of President Wee just because he was elected under an iteration of the Constitution prior to the 1991 Amendment. But this seems to us to be an arbitrary line. Once one accepts, as one must in the light of Art 164, that Parliament can stipulate, as the first of “the 5 most recent terms”, a term of office held by a President elected under a previous iteration of the Constitution, there is then no logical or principled basis for drawing the line at 1991. When pressed, Mr Rajah submitted that this rested on the fact that there was a major electoral reform to the office of the President in that year. But this does not afford a principled basis for drawing the line there. There was, after all, another major electoral reform in 2016; and significantly, as we have already noted, the processes that applied to each of the previous Presidents who held office after 1991 are different from those that apply today. It is also arbitrary given our observations at [74] above. (3) Our interpretation 96 In our judgment, the words “this Constitution” used in the definition of “President” in Art 2 refer to the Constitution as it has existed from time to time since it first came into force on Independence. We reach this conclusion not only as a matter of common sense, but also having noted that this is consistent with the date of commencement of “this Constitution” as specified in Art 2 of the Constitution, that is, “9th August 1965”. In short, “this Constitution” is that which commenced on Independence, which remains – in the relevant sense – the same Constitution notwithstanding the amendments which have been made to it from time to time. This interpretation is only sensible for it is not the case that, each time amendments have been made to the Constitution, Parliament has repealed the whole Constitution and started over with a new Constitution. 97 This is also consistent with the way the words “this Constitution” are used in the context of provisions that either did or could apply to situations that occurred in the past under different iterations of the Constitution: Succession to property 160. Subject to this Article, all property and assets which immediately beforethe commencement of this Constitution were vested in the State of Singaporeshall vest in the Republic of Singapore. … Existing laws 162. Subject to this Article, all existing laws shall continue in force on andafter the commencement of this Constitutionand all laws which have not been brought into force by the date of the commencement of this Constitution may, subject as aforesaid, be brought into force on or after its commencement, butall such laws shall, subject to this Article, be construed as from the commencement of this Constitution with such modifications, adaptations, qualifications and exceptions as may be necessary to bring them into conformitywith this Constitution. Person holding office of President immediately prior to 30th November 1991 to continue to hold such office 163.—(1) The person holding the office of President immediately prior to 30th November 1991 shall continue to hold such office for the remainder of his term of office and shall exercise, perform and discharge all the functions, powers and duties conferred or imposed upon the office of Presidentby this Constitutionas amended by the Constitution of the Republic of Singapore (Amendment) Act 1991 (Act 5 of 1991)… [emphasis added in italics and bold italics] 98 Arts 160 and 162 (among other provisions) refer to the “commencement of this Constitution”. Narrowly interpreting “this Constitution” in these contexts to mean the present iteration of the Constitution would simply be illogical and unworkable. As for Art 163(1), the portion emphasised above is a clear instance of the words “this Constitution” being used to refer to an earlier version than that which existed at the time the provision was introduced into the Constitution, which in that context was the Constitution as amended by the 1991 Amendment. This demonstrates that the words “this Constitution” in Art 163 need not refer only to the latest iteration of the Constitution. 99 Hence, in our judgment, the correct and applicable interpretation of a person “elected under this Constitution” in the Art 2 definition of “President” is a person who has been elected under the Constitution as it was from time to time since its date of commencement – that is, 9 August 1965 – and specifically as it was at the date on which the Presidents concerned were elected. It is neither restricted to Presidents elected under the current iteration of the Constitution as amended after the 2016 Amendment nor restricted to Presidents elected after the 1991 Amendment. Instead, the definition covers Presidents who were elected by Parliament under the previous Art 17(1), and those who were elected by the citizens of Singapore under the present Art 17A. In both cases, the relevant Presidents were “elected under this Constitution”. Hence, on this view, the “5 most recent terms” in Art 19B(1) can start from the term of any past President specified by Parliament, subject to the point we have made at [71(a)] above. 100 We make one final point, which we alluded to in passing earlier. As we noted at [72(a)], Art 163 confirms that President Wee was to be regarded as having “held the office” of President even after the 1991 Amendment altered the office of the President. When Art 19B was drafted, Parliament had knowledge of Art 163 and it seems reasonable to infer, as Mr Nair submitted, that the use of the words “held the office” in the former was influenced in part by their use in the latter. The relevant question is not whether President Wee was elected to the Presidency under the post-1991 Amendment iteration of the Constitution but whether he is properly to be said to have held that office even after the 1991 Amendment, and as to that, if there were any conceivable doubt over this, Art 163 makes it explicitly clear that he did. 101 We summarise our interpretation of the plain meaning of Arts 19B(1) and 164, having regard to the text of the provisions in their statutory context, as follows: (a) The counting of “terms of office” under Art 19B(1) may include terms already served, as well as partial terms of office that were uncompleted. (b) Art 164 allows Parliament to specify any of the past five terms of office of the President that immediately precede the 2017 election as the first term to be counted under Art 19B(1). (c) The focus of Art 19B(1) is on those who have “held the office of President” without any distinction made in relation to the method by which they were elected. (d) The definition of “President” in Art 2 applies to Arts 19B(1) and 164. The reference to “this Constitution” refers to the Constitution as it has stood and as it stands from time to time since 9 August 1965 and in this particular context, it is the Constitution as it stood at the date of the election of each of the Presidents in question. Hence, Presidents “elected under this Constitution” includes those elected by Parliament as well as those elected by the citizens. (e) It was therefore open to Parliament to specify President Wee’s last term as the first term under Art 164 for the purposes of Art 19B.",
        "The legislative purpose of Arts 19B and 164": "102 We turn to consider the legislative objects of Arts 19B and 164 and we are satisfied that they confirm the conclusion that we have reached by our construction of these provisions of the Constitution alone. Legislative purpose as gleaned from the text 103 What can be gleaned from the text is that the specific purpose of Art 19B(1) is to ensure periodic representation of all the principal communities of Singapore in the office of the President throughthe introduction of the hiatus-triggered reserved election model. 104 As for Art 164, which is a transitional provision, its specific purpose is to allow Parliament to determine when to effect the hiatus-triggered model by allowing Parliament to decide the first term to be counted for the purposes of Art 19B(1). Art 164 is not concerned with how the hiatus-triggered reserved election model is to work, but only with how and when it is to be implemented. 105 At this point of the analysis, we are satisfied that the ordinary meaning of Arts 19B and 164, their context in the written law, and the purpose underlying the written law as evident from our consideration of the provisions in their context all show that Parliament could specify any of the five most recent terms of office as the first term under Art 164 for the purposes of Art 19B. There is simply nothing that could reasonably lead us to a different view. 106 As we have mentioned, at this stage, the courtmayconsider relevant extraneous material. We think that in this case, the purpose of the provisions in question clearly supports only one textual interpretation, and thus, a court may only consider extraneous material toconfirmbutnot to alterthe ordinary meaning of the provision. Consideration of extraneous material in this case may be useful (for the reasons discussed at [49] above) but is by no means necessary to ascertain Parliament’s intent. The question is whether the extraneous material confirm that Parliament could specify any of the five most recent terms of office as the first term under Art 164 for the purposes of Art 19B. Extraneous material 107 The parties relied on the following extraneous material: (a) the Explanatory Statement accompanying the 2016 Bill; (b) statements made in the course of the Parliamentary debates on the 2016 Bill; (c) the Commission’s Report; and (d) the White Paper. 108 The range of extraneous material being relied on by the parties makes it important to analyse their relative usefulness and relevance. As we have noted at [52] to [53], the relevance of and weight to be given to such material depends on how clearly and unequivocally they are directed at the very point in question. The present dispute between the parties concerns a purely transitional issue that is governed by Art 164. The parties disagree on the scope of the discretion granted to Parliament under Art 164 in relation to the terms of office it may specify as the first term under Art 19B(1). No other future election would encounter this issue once Parliament exercises its discretion to specify the first term pursuant to Art 164. Hence, it is the specific purpose behind Art 164 that we should be most concerned with in this case. (1) The Commission’s Report and the White Paper 109 At the outset, we do not think we should consider the Commission’s Report or the White Paper when ascertaining the purpose of Art 164 because neither document addressed the question of whenand how the hiatus-triggered model would commence. Instead, these documents pertain to theconceptof the reserved election rather than to the specific question ofwhen the countcould startfor the purposes of determining if an election would be reserved. This is a critical distinction which, in our judgment, the case that was mounted on behalf of the Appellant wholly failed to account for. 110 The Commission simply did not consider when and how the model that it recommended should come into effect, but instead considered the options to ensure minority representation in the Presidency. This can be seen in the Commission’s terms of reference, which included the following: (2)  To consider and recommend what provisions should be made to safeguard minority representation in the Presidency, taking into account: (i) The President’s status as a unifying figure that represents multi-racial Singapore; and (ii) The need to ensure that candidates from minority races have fair and adequate opportunity to be elected to Presidential office. 111 The White Paper, which accepted the recommendations made in the Commission’s Report in relation to the mechanisms proposed in the Model, was also not directed to the point in dispute between the parties, which is when the reserved election model could be triggered pursuant to Art 164. 112 The Appellant relied on a number of statements in the Commission’s Report and the White Paper showing that the purpose of Art 19B was only to have a reserved election if five previouspopularelectionshad failed to produce a President from a particular racial community. That purpose, he says, explains the following statements (among others) in the Commission’s Report: 5.36 … the Commission considers that the hiatus-triggered model is the best model of those it examined, entailing the lowest degree of intrusiveness. … Most importantly, it has a “natural sunset” –if free and unregulated elections produce Presidents from a varied distribution of ethnicities, the requirement of a reserved election will never be triggered. It will only be invoked when there has been an exceedingly long period of time during which no member of a particular ethnic minority has occupied the Presidency, which is a scenario that the Commission would agree is “worrying”. … 5.39 All things considered, the Commission proposes setting “x” at the value of 5, as that would strike the right balance between these competing considerations. On this basis,a reserved election would be triggered if no candidate from aparticular racial group has held the office of President for 30 years or more. 5.40 … An election is reserved for racial group A because no candidate from racial group A has beenelectedfor 5 consecutive terms. … [emphasis added] 113 The Appellant also highlighted the following statements in the White Paper as supporting his view about the specific mischief Parliament sought to address: 81. Based on these principles, the Commission recommended a “hiatus-triggered” safeguard mechanism that operates as follows: … (b)  In the Commission’s view, this was the “best model” amongst those that were studied. Most importantly, it has a “natural sunset”.A reserved election will never arise if free and unregulated elections produce Presidents of varied ethnicities.It will only be invoked if there has not been a President of a given ethnicity for an “exceedingly long period”. … 82.The Government agrees with the approach proposed by the Commission. … [emphasis added] 114 With the greatest respect to the Appellant, these extracts were wholly irrelevant to the real controversy that was before us. It is plain from the Commission’s terms of reference that it was tasked with considering and proposing mechanisms to ensure minority representation in the Presidency given the form of the office of the President as it was at the time the Commission was established. References to “free and unregulated elections” producing Presidents from different races or to a “30-year” hiatus that may trigger a reserved election must be understood in that context as pointing to the desirability of establishing a reserved election model. The Commission was not asked under its terms of reference to address its mind to when and how the count would start for the purposes of Art 19B(1). Any explanation of theconceptof or the desirability of a reserved election in the Commission’s Report says nothing about the specific question of when the recommended model should take effect. Notably, the Commission expressly declined to comment on the issue of whether and, more importantly,whenany amendments to the Constitution should be implemented because it took the view that this was “a political matter for Parliament to determine” (see the Commission’s Report at para 7.19). 115 Thus, the Commission’s Report and the White Paper pertain mainly to the reasons for wanting to ensure minority representation in the office of the President through the introduction of the concept of the reserved election in Art 19B(1), as well as their reasons for proposing and choosing the specific mechanism of a hiatus-triggered reserved election. Both the Commission’s Report and the White Paper place strong emphasis on ensuring multi-racial representation given the President’s vital role as a symbol of national unity and an expression of our national identity. Theconceptof how this was to be achieved was recommended by the Commission after studying various other options, and was then accepted by the Government in the White Paper. However – and we have alluded to this at [109] – the legal inquiry before us does not require us to inquire more deeply into the legislative purpose behind Art 19B(1), which introduces the concept of a reserved election, and still less the underlying reasons for wanting to implement a mechanism for ensuring minority representation. Rather, what we need to determine is the specific purpose behind the transitional provision, Art 164. To this extent, the Commission’s Report and the White Paper have no utility in terms of shedding light on that. In other words, they are incapable of giving assistance in the relevant regard, and thus need not be considered. (2) The Explanatory Statement 116 Next, we turn to the Explanatory Statement. Its relevant paragraphs state: REPRESENTATION OF MAIN COMMUNITIES IN OFFICE OF PRESIDENT Clause 9 inserts a new Article 19B to provide for a Presidential election to be reserved for a community if no person belonging to that community has held the office of President for any of the 5 most recent Presidential terms. … Clause 32 requires the Legislature to make transitional provisions for the purposes of new Article 19B. Transitional provisions will specify the first term of office of the President to be counted for the purposes of deciding whether an election is reserved under Article 19B. If any of the Presidential terms to be counted commences before the date on which Article 19B is brought into force, the transitional provisions will also specify the communities to which the Presidents who held office for those terms are considered to belong. For future Presidents, the communities to which they belong will be decided in accordance with the laws enacted by the Legislature pursuant to Article 19B. 117 As the Judge rightly pointed out (at [98] of the Judgment), the relevant text of the Explanatory Statement roughly mirrors the text of both Art 19B and Art 164. It is therefore incapable of adding anything significant to the understanding which one may already glean from reading the provisions themselves. The Explanatory Statement too is therefore of limited utility and need not be considered. (3) The Parliamentary debates 118 We turn finally to the Parliamentary debates. One difficulty we must be mindful of and guard against in ascertaining legislative purpose from the Parliamentary record is that the debates feature different statements by various MPs, from which the court must extract the collective will and intent of Parliament. As we earlier indicated, we must also carefully assess whether the Parliamentary statements relied on are directed to the point in dispute. 119 In our judgment, our construction of the relevant provisions of the Constitution is directly confirmed by theonly partof the Parliamentary debates that addressed the specific issue that is before us (namely,whenthe reserved election model was to take effect andwhat was the extentof Parliament’s power when it came to specifying the first term under Art 164). This was covered in PM Lee’s speech which stated, in relevant part (seeSingapore Parliamentary Debates, Official Report(8 November 2016) vol 94): When should the racial provision start counting? The Constitutional Amendment Bill states that the Government should legislate on this point.The Government intends to legislate when we amend the Presidential Elections Act in January next year. We have taken the Attorney-General’s advice.We will start counting from the first President who exercised the powers of the Elected President, in other words, Dr Wee Kim Wee.That means we are now in the fifth term of the Elected Presidency. We also have to define the ethnic group of each of the Elected Presidents we have had so far. There is no practical doubt, but as a legal matter, we have to define it because you cannot convene the Committee retrospectively to certify them. So, the Act will deem: (a) Dr Wee Kim Wee as Chinese, (b) Mr Ong Teng Cheong as Chinese, (c) Mr S R Nathan, who served two terms, as Indian, (d) and Dr Tony Tan as Chinese. Therefore, by the operation of the hiatus-triggered model, the next election, due next year, will be a reserved election for Malay candidates.That means if a Malay candidate steps up to run, or more than one Malay candidate steps up to run, who is qualified, Singapore will have a Malay President again. As Minister Yaacob Ibrahim observed yesterday, this would be our first Malay President after more than 46 years, since our first president Encik Yusof Ishak. I look forward to this. [emphasis added in italics and bold italics] 120 This makes it explicit that the intention of Parliament was to allow itself the discretion, under Art 164, to specify the last term of President Wee as the first term. Moreover, PM Lee said explicitly that “We will start counting from the first President whoexercisedthe powersof the Elected President...” [emphasis added]. The Appellant took issue with subsequent references in the speech where PM Lee appeared to describe President Wee as a President who had been elected under the framework for the Elected Presidency. With respect, this could only be true if one were to ignore the first statement in this part of the passage (quoted above) as well as PM Lee’s ensuing statement, immediately thereafter, that “Thatmeans, we are now in the fifth term of the Elected Presidency” [emphasis added]. 121 As against this, the Appellant argues that all the other parts of the extraneous material, included the speeches made by other MPs, point to the intention of Parliament being to address a specific mischief created by open popular elections. That is undoubtedly true, but it misses the point. The issue underlying all those speeches pertained, as we have already said, to theconceptof a reserved election. As mentioned, the present issue between the parties is a purely transitional issue that is ultimately governed by Art 164. Even if Parliament did intend to address the mischief of free, open and unreserved elections having the effect of excluding particular communities from the office of the President through Art 19B, it was equally mindful of the fact that it had been 46 years since a member of the Malay community had held the office. There was nothing to stop Parliament fromalsodeciding – to address the latter fact – to allow itself the discretion under Art 164 to specify, in subsequent legislation, President Wee’s last term as the first term, such that if it did, the 2017 election would be reserved for candidates from the Malay community. It is evident from PM Lee’s speech that this is precisely what Parliament did decide. Hence, the various references to and illustrations of how the model would work and apply in the other speeches simply do not reveal any specific intention in relation to the meaning of Art 164. 122 Among other speeches in the Parliamentary debates, the Appellant relied on the following excerpts (see in generalSingapore Parliamentary Debates, Official Report(7–9 November 2016) vol 94): (a) President Tan’s message at the reading of the 2016 Bill on 7 November 2016 stating the following: … After the Elected Presidency was instituted, all, but one of the Elected Presidents have been Chinese, including myself. The role of the President as a titular Head of State representing our multi-racial society is important and we should have asystem that not only allows but facilitates persons of all ethnic groups to be President from time to time. The Government has accepted the Commission’s recommendation for amechanismof reserving a Presidential election for a specific ethnic group if a member of that group has not held the office of the Elected Presidency after five terms. I agree that this is a balanced approach. Themechanismensures that Singapore is assured of a minority Elected President from time to time, but does not kick in if one is elected in anopen election. … [emphasis added] (b) The speech of the Minister moving the 2016 Bill, Deputy Prime Minister Teo Chee Hean (“DPM Teo”), also made on 7 November 2016, which stated the following: … [A Reserved Election] involves minimal intervention, andwill come into play only if open elections fail to periodically return Presidents from the different races. … (c) Excerpts from speeches by MPs such as the following: (i) Ms Tin Pei Ling, who said on 7 November 2016: … [W]hen a member from any racial group has not occupied a President’s Office after 30 years, namely, five continuous terms, the sixth Presidential Election will be reserved for a candidate from that racial group to ensure that all races are treated equally. Basically, I hope that we will never have to have a reserved election. It is merely a preventive measure. … (ii) Mr Yee Chia Hsing, who said on 8 November 2016: … I agree with the introduction of the hiatus-triggered mechanism to ensure minority representation in our highest office. However, is a gap of five presidential terms, which is about 30 years, considered too long? I hope the Government would monitor public sentiments in this respect and to make the appropriate adjustments in future, if necessary. … 123 In these speeches, President Tan, DPM Teo and the other MPs were speaking to the merits of the reserved election model as a concept. They were not directing their speeches specifically to Art 164 and the discretion granted to Parliament by that provision in designating the first term. 124 Returning to PM Lee’s speech, which was the only one touching specifically on this point, it is clear from this that Parliament intended not to have limitations, of the sort contended by the Appellant, on its power to specify the first term pursuant to Art 164. PM Lee explicitly said that the Governmentwouldlater legislate pursuant to Art 164 to start the count from President Wee and that is exactly what later transpired. 125 We deal briefly with the Appellant’s final ground of appeal, which seeks to meet the force and weight of PM Lee’s speech in relation to the specific issue that is before us by contending that Parliament’s decision to choose President Wee’s term was based on the misapprehension that President Wee was an Elected President. The Appellant submitted that whether President Wee was an Elected President is a legal question and that the Government’s decision to specify President Wee’s term as the first term was evidently based on the AG’s advice. Based on what was said in PM Lee’s speech, this advice must – the Appellant argues – have erroneously suggested that President Wee was an Elected President. 126 To recapitulate, the Appellant’s reading of the provisions, as informed by their legislative purpose, is that: (a) Art 164 is qualified by the meaning of Art 19B purposively ascertained; (b) it was clearly the case, at least from those parts of the Parliamentary debates which we have highlighted earlier and which address the concept of a reserved election (see [122] above), that Art 19B was meant to correct a particular mischief – that of the failure ofopen and unregulated electionsto produce minority candidates; (c) therefore, the phrase “5 most recent terms of office” in Art 19B must be limited to the terms of office of those Presidents who were elected inopen and unregulated elections; and (d) similarly, Art 164 must be read in the same way, meaning that the choice of which term of office Parliament could specify under Art 164 as the first term must be restricted to those terms of office of those Presidents who were elected in open and unregulated elections. 127 There are a number of difficulties with this reading. First, it rests, not on the language of the provisions in question, but on extracts from the Parliamentary debates, and we have already cautioned against this. Second, even then, it plainly runs counter to PM Lee’s speech, which, as we said, is the only statement in Parliament which directly addresses the question of when Parliament intended that the count could start, and which specifically says that the Government intended to specify President Wee’s term as the first term even though he was plainly not a President elected in an open and unregulated election. 128 In order to square PM Lee’s speech with the Appellant’s reading of Arts 19B and 164, the Appellant argues that PM Lee must have been mistaken about President Wee being elected by the citizens and must have been misled by the AG’s advice. It would also follow on this basis that the other MPs in Parliament too thought that President Wee was popularly elected. 129 This in turn runs into difficulty at two levels. First, PM Lee in his speech, does not, on any reading, say President Wee’s term of office was being selected because he had been elected by the citizens of Singapore. Read in context, PM Lee was saying that President Wee’s term of office was chosen becausehe was the first to exercise the functions of the President, not because he was popularly elected(as we have explained at [120] above). Second, none of the other MPs could reasonably have been of the mistaken belief that President Wee was popularly elected. The Commission’s Report was published and released to the public on 7 September 2016, and the White Paper which makes extensive references to the Report was presented to Parliament on 15 September 2016. The Report was referred to repeatedly during the Parliamentary debate in question, and it stated quite clearly that President Wee was not a President elected by the citizens as the transformation of the office of the President occurred during President Wee’s last term of office (at para 7.43): The transformation of the Presidency into an elected office occurred during Mr Wee’s term as President but upon the expiration of his term, Mr Wee reportedly declined the invitation to run because he “could not reconcile himself with the need to campaign for votes”. [footnote omitted] 130 Hence, the conclusion that the Appellant advances cannot stand because it requires us to accept that a mistake took place when nothing in the text of the debates or in the material before the House supports this. 131 As for the AG’s advice, we think it is, in the final analysis, irrelevant. We put it to Mr Rajah during the course of oral argument, and he agreed, that nothing ultimately turned on this argument or on the correctness or otherwise of the AG’s advice. In our view, Mr Rajah’s third argument was really the first and second arguments put in a different way. If as a matter of law the correct interpretation of Art 19B read with Art 164 is that an election could only be reserved if five elections by the citizens of Singapore had failed to produce a President of a particular community, then Parliament could lawfully only specify the term of office of a President elected by the citizens as the first term. As we pointed out to Mr Rajah, if we agreed with that interpretation, Parliament’s choice would have been unconstitutional. It would not have mattered what the AG’s advice was in such circumstances, given that President Wee was not (on this assumption) in fact elected to the office by the citizens. 132 However, because we have disagreed with the Appellant’s interpretation of Art 19B(1), the issue of the AG’s advice is moot. Whatever that advice might have said, it has no bearing on our decision, which is that Art 164 empowers Parliament to specify the last term of President Wee as the first term. 133 In any event, it is appropriate for us to return to what we have said at [120] above and state explicitly that there is nothing to suggest that there was any misapprehension on the part either of PM Lee or the MPs that President Wee was an Elected President in the sense of his having been elected by the citizens. He was not. However, President Wee was the first President to hold the office with the enhanced powers of an Elected President. And it was in that explicit context that PM Lee referred to President Wee’s term, perhaps as a matter of convenience, but in no way erroneously, as one of the five terms of the Elected Presidency. And if there is no reason to think that PM Lee or the MPs were mistaken, the predicate for the Appellant’s argument – that a mistake was made – falls away. 134 In our judgment, consideration of the extraneous material in this case confirms the purposively-ascertained ordinary meaning of Arts 19B(1) and 164. It follows that Parliament could, under Art 164, lawfully specify President Wee’s last term as the first term.",
        "Conclusion": "135 We therefore dismiss the appeal. Unless the parties come to any other arrangement on costs, they may seek our directions on costs by making written submissions, limited to five pages each, on the appropriate order and quantum of costs, within 14 days of the date of this judgment. Sundaresh Menon     Judith Prakash      Steven ChongChief Justice      Judge of Appeal      Judge of Appeal Chua Lee Ming     Kannan RameshJudge        Judge Chelva Retnam Rajah SC, Earnest Lau and Zara Chan (Tan Rajah & Cheah) for the appellant;Deputy Attorney-General Hri Kumar Nair SC, Aurill Kam, Nathaniel Khng, Seow Zhixiang and Sivakumar Ramasamy (Attorney-General’s Chambers) for the respondent."
    }
}