{
    "case_title": "Micheal Anak GaringvPublic Prosecutor and another appeal",
    "ncitation": "[2017] SGCA 07",
    "coram": "Chao Hick Tin JA (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 Micheal Anak Garing (“MAG”) and Tony Anak Imba (“TAI”) were both tried in the High Court under s 300(c) of the Penal Code (Cap 224, 2008 Rev Ed) for the murder of one Shanmuganathan Dillidurai (“the deceased”). They were both charged with murder committed in furtherance of a common intention, and were thus liable to be punished under s 302(2) read with s 34 of the Penal Code. 2 MAG and TAI, together with two other friends, Hairee Anak Landak (“HAL”) and Donny Anak Meluda (“DAM”) (collectively, “the Gang”), had set out from a friend’s house on the night of 29 May 2010 with a preconceived plan to commit robbery. One of them was armed with a deadly weapon, aparang. Over the course of that night and the wee hours of the following day, the Gang attacked the deceased and inflicted the injuries which eventually led to his death. It transpired that the deceased was not the only person whom the Gang attacked that night. Prior to attacking the deceased, the Gang had set upon three other victims in order to rob them. Fortunately, none of those other victims succumbed to their injuries. For the attacks on those three victims, MAG and TAI each faced three charges (one in relation to each victim) of robbery while one or more of the Gang was armed with a deadly weapon which came to be used to cause hurt to the three victims, an offence punishable under s 394 read with s 397 of the Penal Code. Those charges were stood down at the trial. 3 The High Court judge (“the Judge”) convicted both MAG and TAI of their respective murder charges (seePublic Prosecutor vMicheal Anak Garing and another[2014] SGHC 13 (“the Judgment on Conviction”)). Given the amendments made to the Penal Code by the Penal Code (Amendment) Act 2012 (Act 32 of 2012), which came into effect on 1 January 2013, the Judge had the discretion to impose either the death penalty or life imprisonment with caning. The Judge sentenced MAG to suffer the death penalty, and sentenced TAI to life imprisonment with 24 strokes of the cane (seePublic Prosecutor vMicheal Anak Garing and another[2015] SGHC 107 (“the Judgment on Sentence”)). 4 Criminal Appeal No 9 of 2015 (“CCA 9”) is MAG’s appeal against his conviction on the murder charge and the death penalty imposed on him. MAG contends that his conviction should be overturned; alternatively, if the conviction were ordered to stand, the matter should be remitted to the Judge to reconsider the sentence meted out as the Judge erred in principle in sentencing him to suffer the death penalty. Criminal Appeal No 11 of 2015 (“CCA 11”) is the Prosecution’s appeal against the Judge’s decision to sentence TAI to life imprisonment and 24 strokes of the cane. The Prosecution contends that the death penalty should similarly have been imposed on TAI. For completeness, we should mention that TAI initially filed Criminal Appeal No 24 of 2015 (“CCA 24”) against his conviction on the murder charge and his sentence, but subsequently withdrew this appeal. 5 Before we outline the background facts, we shall first deal with a preliminary issue that was brought up at the hearing of these appeals.",
        "Preliminary issue: Relevance of the evidence relating to the first three attacks": "6 The preliminary issue concerns the relevance and, in turn, the admissibility of the evidence relating to the first three attacks perpetrated by the Gang. Counsel for MAG, Mr Ramesh Tiwary (“Mr Tiwary”), submits that this evidence should not be admitted because it is prejudicial to both MAG and TAI. 7 At the trial, a similar objection was raised before the Judge. The Judge ruled that the evidence concerning the three earlier attacks was admissible because those attacks formed part of the “crucial narrative” leading up to the commission of the offence in respect of which MAG and TAI were being tried. The Judge further opined that while each of those three attacks could be seen as an isolated incident, together, they formed “an integral act pursuant to a common intention to assault and rob”. The prejudicial effect of the evidence thus did not outweigh its probative value (at [2] of the Judgment on Conviction). 8 In our view, the Judge was plainly correct in admitting the aforesaid evidence. It cannot be denied that this evidence was prejudicial to both MAG and TAI in that it disclosed the commission of offences which were violent in nature. However, in determining the admissibility of evidence, the purpose for which the evidence is sought to be admitted is vital (seeTanMeng Jee v Public Prosecutor[1996] 2 SLR(R) 178 at [37];Public Prosecutor vPurushothaman a/l Subramaniam[2014] SGHC 215 at [60]). If the Prosecution seeks to admit evidence for the purpose of showing an accused person’s violent tendencies, such evidence would be unduly prejudicial and therefore inadmissible (seeMakin v Attorney General of New South Wales[1894] AC 57). However, as can be seen from [7] above, this was not the basis on which the Judge admitted the evidence relating to the three earlier attacks. 9 Section 6 of the Evidence Act (Cap 97, 1997 Rev Ed) provides that facts which are not in issue but which are nevertheless “so connected with a fact in issue as to form part of the same transaction” are relevant. A good illustration of this rule can be found in the case ofO’Leary v King(1946) 73 CLR 566. In that case, the High Court of Australia ruled on the admissibility of evidence of assaults committed by the appellant on different persons prior to his killing of one Ballard, for which the appellant was charged with murder. Latham CJ, Rich, Dixon and Williams JJ (Starke and McTiernan JJ dissenting) held that the evidence relating to the prior assaults was admissible at the appellant’s trial for murder as it disclosed a connected series of events which should be considered as one transaction. Dixon J explained his decision as follows (at 577): In my opinion the evidence objected to was admissible, because, from the time on Saturday 6th July when the [appellant] and the party with him came under the influence of drink right up to the conclusion of the scene in the early hours of the following Sunday morning in the presence of the deceased’s body lying in front of the huts, a connected series of events occurred which should be considered as one transaction. … … Without evidence of what, during that time, was done by those men who took any significant part in the matter and especially evidence of the behaviour of the [appellant], the transaction of which the alleged murder formed an integral part could not be truly understood and, isolated from it, could only be presented as an unreal and not very intelligible event. … 10 In our view, the reasoning inO’Leary v Kingapplies to the present case with equal force. It would be artificial to reject evidence of what the Gang did during the period between leaving their friend’s house on the night of 29 May 2010 and attacking the deceased. If this evidence were rejected, the court would have only a truncated version of the material events which might not shed true light on the attack carried out on the deceased, especially because all four attacks occurred within a short span of time. The evidence concerning the three earlier attacks is thus admissible as those attacks formed part of the same venture which the Gang agreed to undertake that night. 11 That evidence is also relevant as regards the state of mind of MAG and TAI. Section 14 of the Evidence Act provides that facts showing “the existence of any state of mind”, including intention and knowledge, are relevant when the existence of such state of mind is in issue. Explanation 1 to s 14 makes it clear that the facts in question have to show that a state of mind exists “not generally but in reference to the particular matter in question”. In the present case, both MAG and TAI were charged with committing murder in furtherance of a common intention. The attacks on the three victims that preceded the attack on the deceased are therefore highly material to the question of their state of mindat the time of theattack on the deceased. Moreover, as we shall elaborate, MAG’s and TAI’s knowledge of how each of them was likely to act in relation to the attack on the deceased has a material bearing on the question of sentence. In view of this, the evidence concerning those three attacks is relevant as evidence showing MAG’s and TAI’s state of mindat the time of the attack on the deceased. 12 For the above reasons, we agree with the Judge that the aforesaid evidence is admissible. With this preliminary issue disposed of, we turn to outline the material facts.",
        "The material facts": "",
        "Background": "13 MAG and TAI, who are now aged 28 and 38 respectively, are Malaysians from Sarawak. As earlier mentioned, HAL and DAM were the other members of the Gang. HAL, who was the Prosecution’s key witness in the court below, has already been convicted and sentenced for his role in the attacks. On 18 January 2013, he pleaded guilty to three charges of armed robbery with hurt, and was sentenced to 33 years’ imprisonment and 24 strokes of the cane. DAM, on the other hand, has only recently been arrested and charged for his role in the attacks.",
        "The attacks": "14 Sometime on 29 May 2010, the Gang were drinking at the house of a friend named Shaman in Geylang Lor 12.1Foot Note 1×NE 29 October 2013 lines page 3 line 16. ROP Vol 2 (page 50 of softcopy).At some point during the night, the Gang resolved to leave the house and commit robbery. MAG armed himself with aparang, which he claimed he found in the house.2Foot Note 2×NE 29 October 2013 page 4 lines 15–19. ROP Vol 2 (page 51 of softcopy).DAM armed himself with aterepi, which is a tap handle. 15 After leaving Shaman’s house, the Gang walked for ten to fifteen minutes until they reached a playground near Block 44 Sims Drive. There, they robbed one Sandeep Singh (“SS”).3Foot Note 3×P13 (picture) ROP Vol 3 page 18.TAI initiated the attack on SS and the rest soon joined in. At some point during the attack, TAI used a brick to hit SS on the head.4Foot Note 4×NE 30 October 2013 page 31 lines 20–24 ROP Vol 2 (page 131 of softcopy). NE 30 October 2013 page 3 line 32 – page 4 line 7 ROP Vol 2 (page 105 of softcopy). Picture of brick (P12) ROP Vol 3 Page 17.The attack lasted some two to three minutes. TAI robbed SS of his wallet and his mobile phone. As a result of the attack, SS sustained serious injuries, including slash wounds of various sizes, multiple open fractures of the metacarpal bones, lacerated tendons on the left hand and a fractured skull.5Foot Note 5×ROP Vol 3A page 378. NE 9 October 2013 page 39 at lines 17 – 22. ROP Vol 1 (page 147 of softcopy).The slash wounds on SS were so deep that the tendons beneath were exposed.6Foot Note 6×NE 9 October 2013 page 41 lines 1–4. ROP Vol 1 (page 149 of softcopy). 16 After attacking SS, the Gang walked for another ten to fifteen minutes towards Kallang MRT Station. There, they set their sights on one Ang Jun Heng (“Ang”), who was walking along a path under the MRT track between Aljunied MRT Station and Kallang MRT Station.7Foot Note 7×P50 and P51 (pictures) ROP Vol 3 at page 55 and 56.As a result of the attack, Ang suffered an amputation of his left hand with part of his palm and four fingers cut off.8Foot Note 8×ROP Vol 3A page 381.He also suffered a deep laceration down to the spine at the mid-cervical region. Had that laceration been any deeper, it would have reached his spinal cord.9Foot Note 9×NE 16 October 2013 page 3 lines 6–20. ROP Vol 1 (page 252 of softcopy).Ang was robbed of his mobile phone and his wallet. The assault on Ang similarly lasted about two to three minutes. 17 Roughly ten minutes later, after the Gang made their way to the footpath beside Kallang River (near Kallang MRT Station), they spotted one Egan Karruppaiah (“EK”) and assaulted him.10Foot Note 10×P75 – 79 (pictures of area). ROP Vol 3 pages 80–84.EK suffered amputations of his left index finger, as well as his right index, middle, ring and little fingers. In addition, he suffered lacerations to his left wrist which went “down to [the] bone” and fractures of his frontal sinus walls. Like SS and Ang, EK had his wallet and his mobile phone taken from him.11Foot Note 11×Medical report found at ROP Vol 3A page 384. 18 Approximately ten minutes later, while walking along Kallang Road near Riverine by the Park condominium, the Gang began their attack on the deceased, who was cycling on a footpath.12Foot Note 12×P99 (Picture of footpath). ROA Vol 3 page 105.Beside the footpath, there was an open field which was on slightly lower ground than the footpath.13Foot Note 13×P104 (picture). ROP Vol 3 page 110.There was street lighting along the footpath, but not in the open field. TAI initiated the attack by approaching the deceased from his left and knocking him off his bicycle down the slope into the open field. It is from this point onwards that the accounts of the events provided by MAG, TAI and HAL (who testified for the Prosecution) begin to diverge. Their respective versions of the events are set out below (at [25]–[33]). The deceased was robbed of his wallet. 19 For all four attacks, it was common ground that TAI was the initiator. DAM was the only one who used theterepi,14Foot Note 14×NE 24 October 2013 page 17 lines 12–25. ROP Vol 2 (page 22 of softcopy).while HAL was unarmed. It was also common ground that MAG used theparangfor the first three attacks and for at least part of the attack on the deceased.15Foot Note 15×NE 29 October 2013 page 13 at lines 23–29. ROP Vol 2 (page 60 of softcopy).Besides theparangand theterepi, no other weapon was used during the attacks.",
        "The discovery of the deceased and the autopsy": "20 The deceased was discovered by a security guard at about 7.30am on 30 May 2010. His body lay in the open field next to the footpath on which he had been cycling when he was attacked. Bloodstains were found on an electrical box located along the footpath near his body. 21 Dr Paul Chui (“Dr Chui”), a forensic pathologist, performed the autopsy on the deceased. His unchallenged findings are that the deceased suffered at least twenty injuries.16Foot Note 16×NE 9 October 2013 at page 5 lines 1–5. ROP Vol 1 (page 113 of softcopy). Photograph P181, 172In his opinion, the following four injuries were sufficient in the ordinary course of nature to cause death: (a) An injury to the top of the head that fractured the deceased’s skull.17Foot Note 17×NE 9 October 2013 at page 7 lines 23–28. ROP Vol 1 (softcopy page 115).According to Dr Chui, this injury could have been caused by a bladed weapon coming down with sufficient force from over the top of the deceased’s head, impacting the head from the left side, cutting the scalp and causing a fracture to the skull beneath.18Foot Note 18×Autopsy report ROP Vol 3A at page 389 (injury 3). (b) A wound to the neck that severed the jugular vein. This was a large gaping wound about 12cm long and 9cm wide running diagonally across the deceased’s neck.19Foot Note 19×Autopsy report ROP Vol 3A at page 389 (injury 6). P174 (picture of injury)It resulted in an almost complete severance of the airway. The deceased would have lost consciousness within a matter of seconds after sustaining this injury, and due to blood loss, death would have followed soon after.20Foot Note 20×NE 9 October 2013 at page 12 lines 17–20. ROP Vol 1 (page 120 of softcopy). (c) A wound to the back measuring 24.5cm long and 3.7cm wide. This wound penetrated the skin, subcutaneous fat and underlying muscles.21Foot Note 21×P155 (picture of injury). NE 9 October 2013 page 13 lines 18–22. ROP Vol 1 (page 121 of softcopy). (d) An amputation of the left hand, resulting in four fingers and a significant part of the palm being completely cut off.22Foot Note 22×P 141 and P 150 (picture of injuries). Apart from the above injuries, there was a cut to the deceased’s left forearm which was deep enough to expose the underlying bone.23Foot Note 23×P159 (picture of injury). NE 9 October 2013 at page 15. ROP Vol 1 (page 123 of softcopy). 22 Dr Chui certified that the cause of death was the multiple injuries sustained, including the wound to the neck,24Foot Note 24×NE 9 October 2013 at page 30 lines 20–25. ROP Vol 1 (page 138 of softcopy).the wound to the back (which resulted in a leak into the chest cavity) and the wound to the head that fractured the skull.25Foot Note 25×NE 9 October 2013 at page 36 line 26 –page 37 line 4. ROP Vol 1 (page 144 of softcopy).Dr Chui also testified that these injuries could have been caused by a bladed weapon with force that was at least moderate.26Foot Note 26×NE 9 October 2013 at page 16 lines 25–30. ROP Vol 1 (Page 124 of softcopy).",
        "The forensic evidence": "23 Traces of MAG’s DNA were found on five zipper heads of the deceased’s black Campro Equipment waist pouch.27Foot Note 27×Exhibit P387 (ROP Vol 3A page 429) read with ROP Vol 3B page 795 (MAG’s blood sample barcode is S017769).MAG’s and the deceased’s DNA were also detected on theparang.28Foot Note 28×ROP Vol 3A Page 501 read with Vol 3B Page 951 (SAR-26 is theparang).The deceased’s and Ang’s blood were found on clothes worn by MAG. A red T-shirt worn by TAI during the attacks contained traces of Ang’s blood. Additionally, the deceased’s DNA was detected on a belt attached to a pair of jeans that were seized from TAI upon his arrest. The DNA was detected at the end of the belt away from the buckle.29Foot Note 29×NE 10 October 2013 at page 63 lines 29–30. ROP Vol 1 (page 229 of softcopy).In his oral testimony at the trial, TAI was adamant that he had not been wearing a belt during the attack. He averred that the manner in which the investigators had collected the evidence had resulted in contamination.30Foot Note 30×NE 30 October 2013 at page 48 lines 23–30. ROP Vol 2 (page 148 of softcopy).",
        "The parties’ respective cases at the trial": "24 We turn now to the various versions provided by the parties at the trial as to how the attack on the deceased occurred. As we indicated earlier (at [18] above), the Prosecution, MAG and TAI each put forth differing accounts. We begin with the Prosecution’s version.",
        "The Prosecution’s case": "25 The Prosecution’s case at the trial rested primarily on HAL’s testimony. According to HAL, after TAI knocked the deceased off his bicycle, the deceased tried to flee, but TAI chased after him while MAG slashed him several times, inflicting the wounds on his back, his head and his left hand. TAI managed to grab hold of the deceased at around the spot where his body was eventually found.31Foot Note 31×P102 (picture of deceased in resting position). ROP Vol 3 page 108.TAI held the deceased in an armlock while MAG continued slashing him, inflicting further injuries, including the fatal wound to the neck. After sustaining that injury, the deceased quickly lost consciousness and the Gang left the vicinity. The Prosecution’s case was that MAG inflicted all the serious injuries suffered by the deceased, including the fatal injuries. TAI assisted MAG by holding the deceased in an armlock, and while in TAI’s clutches, the deceased sustained the fatal injuries inflicted by MAG.",
        "MAG’s defence": "26 By contrast, MAG claimed that he did not inflict the fatal injuries on the deceased. According to him, TAI took theparangfrom him sometime during the attack on the deceased and he had no knowledge of what happened thereafter as he left the scene. 27 According to MAG, the deceased attempted to flee after TAI initiated the attack. TAI gave chase and started fighting with the deceased. MAG, HAL and DAM went towards them.32Foot Note 32×NE 29 October 2013 at page 7. ROP Vol 2 (page 54 of softcopy).MAG took out theparangand swung it over the deceased’s head in order to scare him. No contact was made with the deceased as he dodged the blow.33Foot Note 33×NE 29 October 2013 at page 9. ROP Vol 2 (page 56 of softcopy).MAG then swung theparangagain, making contact somewhere on the deceased’s back.34Foot Note 34×NE 29 October 2013 at page 8. ROP Vol 2 (page 55 of softcopy).He swung theparangfor a third and final time, making contact with the left hand of the deceased as the latter had raised it in an attempt to shield his head. 28 After the deceased was struck with theparang, he stopped fighting and sat down to try to control the pain. MAG opened the deceased’s waist pouch and took his wallet. MAG claimed that after doing so, he made his way to the footpath and left the scene. 29 According to MAG’s oral evidence at the trial, at the electrical box mentioned at [20] above, which was some 5 to 10m from where the deceased’s body was later found, TAI snatched35Foot Note 35×NE 29 October 2013 at page 14 lines 18–20. ROP Vol 2 (page 60 of softcopy).theparangfrom his left hand36Foot Note 36×NE 29 October 2013 at page 10 line 12. ROP Vol 2 (page 57 of softcopy).and returned to where the deceased was lying in the open field.37Foot Note 37×NE 29 October 2013 at page 10 at line 14. ROP Vol 2 (page 57 of softcopy).MAG testified that he continued walking with HAL and DAM on the footpath, away from TAI and the deceased, towards Lavender Street. MAG only saw TAI later when the latter caught up with the other members of the Gang38Foot Note 38×NE 29 October 2013 at page 43 lines 9–11. ROP Vol 2 (page 90 of softcopy).at a traffic light further down the footpath near an Indian temple, a spot more than 200m from where the deceased lay.39Foot Note 39×NE 24 October 2013 at page 22. Line 17. ROP Vol 2 (page 27 of softcopy). P203 (picture of junction). See also NE 29 October at page 43 lines 12–32. ROP Vol 2 (page 90 of softcopy). 30 MAG claimed that he had no knowledge of how the fatal injuries came to be inflicted on the deceased as he left the scene after TAI snatched theparangfrom him at or near the aforesaid electrical box.",
        "TAI’s defence": "31 As TAI has decided not to proceed with his appeal in CCA 24 against his conviction and sentence (see [4] above), his defence at the trial is not of particular relevance for the purposes of the present appeals. Nevertheless, for completeness, we shall briefly outline his version of the events. 32 TAI’s oral testimony at the trial was that in relation to the attack on the deceased, he only had the intention to rob. He claimed that before the attack on the deceased, he reprimanded MAG multiple times for using theparang. TAI averred that during MAG’s attack on EK with theparang, theparangcame into contact with his hand.40Foot Note 40×NE 30 October 2013 at page 7 line 10. ROP Vol 2 (page 107 of softcopy).According to TAI, after he initiated the attack on the deceased, the latter became pinned under his bicycle. MAG then moved in, stepped on the bicycle and swung theparangat the deceased. The deceased broke free and attempted to flee, whereupon TAI gave chase. But before he could reach the deceased, HAL kicked the deceased in the ribs. TAI claimed that from that point onwards, he did not continue in the attack on the deceased. He shouted at MAG to stop attacking the deceased with theparangand to just take the deceased’s wallet, but MAG did not pay any heed.41Foot Note 41×NE 30 October 2013 at page 10 lines 5–10. ROP Vol 2 (page 110 of softcopy).TAI then grabbed HAL by the hand and they left the scene. 33 TAI testified that at no point during the attack on the deceased did he wield theparang.42Foot Note 42×NE 30 October 2013 at page 11 lines 26–27. ROP Vol 2 (page 111 of softcopy).Further, and contrary to the Prosecution’s case, he claimed that he never held on to the deceased while MAG inflicted the fatal injuries on the deceased with theparang.43Foot Note 43×NE 30 October 2013 at page 40 lines 22–28. ROP Vol 2 (page 140 of softcopy).",
        "The decision below": "",
        "Conviction": "34 In convicting both MAG and TAI of murder committed in furtherance of a common intention, the Judge found that the Prosecution had proved beyond reasonable doubt its case against both of them. The Judge held that the discrepancies in what MAG said TAI did with theparangand where TAI took it from him were not helpful to his defence. In this regard, the Judge noted that both HAL’s and TAI’s evidence consistently pointed towards MAG as the one who had used theparangon the deceased. In the Judge’s view, the attack on the deceased and the earlier attacks on the other three victims “took place as if the [G]ang were on a safari, hunting down one prey at a time, using the same method to trap and harm their victims” (at [8] of the Judgment on Conviction). In these circumstance, the Judge opined, it did not matter who had used theparangon the deceased. He was, however, satisfied based on the evidence that it was MAG who had struck the deceased with theparang(at [8] of the Judgment on Conviction). 35 With regard to TAI, the Judge reasoned that TAI could not have been oblivious to the fact that MAG had slashed the earlier three victims before the fatal attack on the deceased. Therefore, TAI could not say that he had not intended to join in the attack on the deceased with theparangand had only agreed or intended to rob. The Judge was thus satisfied that the Prosecution had proved beyond reasonable doubt its case that TAI acted in furtherance of a common intention with MAG not only to rob, but also to cause injuries to the deceased with theparang(at [9] of the Judgment on Conviction).",
        "Sentence": "36 In respect of sentence, the Judge sentenced MAG to suffer death because he was satisfied that it was MAG who had used theparangto inflict the fatal injuries on the deceased. The Judge did not, however, agree with the Prosecution’s submission that the death penalty should likewise be imposed on TAI. He exercised his discretion to sentence TAI to life imprisonment with 24 strokes of the cane. The Judge held that TAI’s culpability differed sufficiently from MAG’s because TAI had not used theparangto inflict the fatal injuries on the deceased.",
        "The arguments on appeal": "",
        "MAG’s appeal in CCA 9": "Conviction 42 We earlier outlined (at [37] above) Mr Tiwary’s argument that HAL’s evidence was inconsistent in so many respects that it could not, alone, satisfy the Prosecution’s burden of showing beyond reasonable doubt that MAG had used theparangto inflict the fatal injuries on the deceased. The inconsistencies in HAL’s evidence that Mr Tiwary relies on are as follows: (a) When testifying in court, HAL was adamant that a brick had been used only on SS (see [15] above) and that no brick had been used to hit the deceased. However, in a statement which HAL made to the police on 2 June 2010, he said that the deceased had been hit by TAI on the head with a brick. HAL admitted on the witness stand that his account to the police was wrong even though his memory at the time he gave his 2 June 2010 statement would have been fresher than when he was giving evidence in court.46Foot Note 46×NE 23 October 2013 at pages 4–5. ROP Vol 1 (page 322 of softcopy). (b) In court, HAL said that the deceased had been cycling on the footpath when TAI commenced the attack. Yet, in his 2 June 2010 statement, he told the police that the deceased had been sitting on the pavement talking on his mobile phone at that time. (c) In court, HAL testified that he first saw the deceased after crossing Kallang Road. But, in his statement to the police on 4 June 2010, he told the police that he saw the deceased first and then crossed the road.47Foot Note 47×NE 23 October 2013 at page 6. ROP Vol 1 (page 324 of softcopy). (d) In court, HAL said that DAM had been behind him while MAG and TAI had been in front of him when he crossed Kallang Road. Yet, in his 4 June 2010 statement to the police, he clearly stated that he had been the last to cross the road. (e) HAL’s evidence in court was that TAI initiated the assault on the deceased by elbowing the deceased and knocking him off his bicycle. Yet, in the statement of facts which HAL admitted to without qualification at his criminal mention (“the Statement of Facts”), it was stated that TAI had kicked (rather than elbowed) the deceased.48Foot Note 48×NE 23 October 2013 at page 9 lines 21–24. ROP Vol 1 (page 327 of softcopy). (f) In court, HAL said that he had only punched the deceased during the attack. Yet, the Statement of Facts stated that HAL had punchedandkicked the deceased. Further, HAL agreed on the witness stand that he had admitted to the Statement of Facts because it was convenient for him. (g) In court, HAL said that he only knew that the deceased was going to be the next victim after TAI had elbowed the deceased. However, in one of his statements to the police, he said that he knew the deceased was going to be the next victim even before TAI commenced the attack. When confronted with this discrepancy, HAL changed his evidence in court and adopted what he had earlier told the police. (h) In court, HAL claimed that he saw TAI dragging the deceased right after TAI knocked the deceased off the bicycle. Yet, in his 4 June 2010 statement to the police, HAL said that either TAIorMAG had dragged the deceased, while his version in the Statement of Facts was that both TAIandMAG had dragged the deceased. (i) In court, HAL said that he did not know MAG had aparangwith him when the Gang left Shaman’s house in Geylang Lor 12, but in the Statement of Facts, he admitted that he was aware that MAG had brought aparangalong. (j) In court, HAL testified that he did not see the wounds which MAG inflicted on the deceased with theparang. Yet, HAL had punched the deceased after MAG had used theparangon the deceased several times, which meant that HAL had been at arm’s length at that time and should therefore have seen the wounds.49Foot Note 49×NE 23 October 2013 at page 13 lines 7–16. ROP Vol 1 (page 331 of softcopy).Further, in his statement to the police on 7 June 2010, HAL said that MAG had bent down and used theparangto “potong” the deceased, suggesting that he had seen theparangmaking contact with the deceased. (k) In court, HAL said that after he punched the deceased, MAG continued hitting the deceased with theparangseveral times. However, in his statement to the police on 7 June 2010, HAL said that MAG hit the deceased with theparangonly once. (l) In court, HAL said that MAG and TAI had an argument over the deceased’s walletbeforethe Gang reached a bus stop in the vicinity of the scene of the attack. However, in his 4 June 2010 statement to the police, he told the police that no one had said anything at all about the deceased’s wallet on the way back to Syed Alwi Road, while in his 7 June 2010 statement, he said that the argument had occurredafterthe Gang reached the bus stop. 43 We note the discrepancies in HAL’s evidence which Mr Tiwary has pointed out. However, we do not think these discrepancies necessarily show that HAL’s testimony in relation towhoused theparangto inflict the fatal injuries on the deceased was unreliable. The crucial factual issue that concerned the Judge and that likewise concerns this court on appeal iswhoused theparangto inflict the fatal blows. HAL was consistent in all his accounts, whether in court, in his statements to the police or even in the Statement of Facts – he consistently pointed to MAG as the only person who wielded theparang. At no point did HAL say, as MAG would have us believe (see [29] above), that TAI took or snatched theparangfrom MAG. In our view, the discrepancies raised by Mr Tiwary fail to cast any reasonable doubt on this critical aspect of HAL’s evidence. At best, the discrepancies cast doubt on the penumbra and not the core of HAL’s evidence, which is that MAG alone wielded theparang. Moreover, as the Judge observed, HAL’s evidence on this issue was consistent with TAI’s evidence (see the Judgment on Conviction at [7]). There was no reason or obvious motive for HAL to lend support to TAI at the trial given that by then, HAL had already been fully dealt with for his role in the attacks. It is also vital, in considering the discrepancies in HAL’s evidence highlighted by Mr Tiwary, to bear in mind that HAL was recalling events which occurred in a fast and furious manner. For these reasons, we find that the discrepancies raised by Mr Tiwary do not meet the threshold for appellate intervention in relation to findings of fact made by a trial judge (seePublic Prosecutor v MuhammadFarid bin Mohd Yusop[2015] 3 SLR 16 at [54]). 44 Indeed, we are satisfied beyond reasonable doubt that MAG was the one who inflicted all the fatal injuries on the deceased with theparang. MAG accepts that he wielded theparangfor the first three attacks and for part of the attack on the deceased. The critical part of his defence is that sometime during the attack on the deceased, TAI snatched theparangfrom him. MAG, however, provided inconsistent accounts as to where and when theparangwas taken from him, and whether he saw TAI use theparangon the deceased. 45 In a contemporaneous statement which MAG provided, he said that theparangwas taken from himduringthe attack on the deceased, and after theparangwas taken from him, he proceeded to check the deceased’s waist pouch. In court, however, he claimed that TAI snatched theparangfrom him near the electrical boxafterhe left the open field and checked the deceased’s waist pouch. Further, in his 4 June 2010 statement to the police, MAG said that TAI snatched theparangfrom him and shouted “serigala” (the Malay word for “wolf”) “while running to toward[sic]the man and kicking him” [emphasis added].50Foot Note 50×ROP Vol 3A page 547.This suggests that MAG saw TAI attacking the deceased with theparang. Similarly, in his cautioned statement, MAG said that TAI snatched theparangfrom him and hit the deceased, again suggesting that he saw TAI attacking the deceased with theparang. This is diametrically opposed to what he said in court, when he testified that hedid notsee TAI using theparangon the deceased.51Foot Note 51×NE 29 October 2013 at page 40 lines 14. ROP Vol 2 (page 87 of softcopy).MAG’s explanation in court as to what he meant in his earlier statements – namely, that he hadmerely assumedTAI was going to hit the deceased with theparangafter TAI snatched it away from him because TAI shouted “serigala” while running towards the deceased – went against what was stated in those statements. In our judgment, these are material discrepancies (unlike the discrepancies raised by Mr Tiwary in relation to HAL’s evidence) which severely undermine MAG’s defence. Whether or not MAG saw TAI using theparangon the deceased in what (if TAI had indeed attacked the deceased as MAG alleged) would have been a brutal attack, given the injuries found on the deceased, was not something one could easily mix up. Further, the allegation that theparangchanged hands during the attack on the deceased is central to MAG’s defence, but MAG could not provide a consistent account of the location where theparangwas allegedly taken from him. This again undermines his claim that TAI snatched theparangfrom him during the attack. 46 Considering all the circumstances, we are satisfied that the Prosecution did prove beyond reasonable doubt that it was MAG who used theparangto inflict the fatal blows on the deceased. As MAG’s appeal against conviction rests solely on the ground that he did not strike the deceased with theparangand cause the fatal injuries, our finding above is sufficient to dispose of his appeal against conviction. We thus dismiss this aspect of his appeal in CCA 9. Sentence 47 Given that MAG was convicted of murder under s 300(c) of the Penal Code, he was liable to be sentenced under s 302(2), as opposed to s 302(1), of the Penal Code. The principles in relation to the imposition of the discretionary death penalty under s 302(2) were thoroughly considered by this court inPublic Prosecutor vKho Jabing[2015] 2 SLR 112 (“KhoJabing (Re-sentencing)”). In that case, we unanimously held that the test for determining whether to impose the death penalty in this context is whether the actions of the offender would outrage the feelings of the community (at [44]). We further elaborated that the death penalty would be appropriate in cases where the offender had acted in a way which exhibited viciousness or a blatant disregard for human life (at [45]). 48 InKhoJabing (Re-sentencing), the majority relied on three critical factors in deciding to impose the death penalty on the offender (seeKhoJabing v Public Prosecutor[2016] 3 SLR 135 (“KhoJabing (Criminal Motion)”) at [100]), namely: (a) the offender first struck the victim on the head from behind without warning, causing the latter to fall to the ground (seeKhoJabing (Re-sentencing)at [71(a)]); (b) the offender inflicted at least one more blow on the victim while the latter was lying defenceless on the ground (seeKhoJabing (Re-sentencing)at [71(b)]); and (c) even if the offender had inflicted only two blows on the victim, it would be fair to infer that those two blows must have been of such force that they caused extensive fractures to the victim’s skull and weakened it to the extent that the strike which the offender’s co-accused dealt to the victim with a belt buckle and/or the deceased’s fall to the ground could have caused further fracturing when, ordinarily, they would not have had such an effect (seeKhoJabing (Re-sentencing)at [67]–[68], [71(c)] and [78]). 49 In our judgment, MAG did act in blatant disregard for human life in the attack on the deceased. InKhoJabing (Re-sentencing), the offender used a piece of wood to strike the victim’s head with great force. Here, MAG used a 58cm longparangto slash the deceased. He struck the deceased with it on the top of his head with such force that it caused a fracture to the skull, and he also slit the deceased’s throat. MAG’s assault on the deceased was a vicious, savage and sustained onslaught. He swung the blade violently at different areas of the deceased’s body and eventually cut the deceased’s throat. The sheer brutality exhibited by MAG warrants the imposition of the death penalty – it seems to us that MAG attacked the deceased in a totally savage and merciless manner as though he were attacking a hunted prey. 50 We now deal briefly with Mr Tiwary’s submission that in sentencing MAG, the Judge erroneously took into account the evidence concerning the three earlier attacks on the other victims. While it may appear that the Judge took that evidence into account for sentencing purposes (see the Judgment on Sentence at [11]), we do not think he in fact did so. The Judge merelyopined, in response to Mr Tiwary’s submission that the evidence relating to those attacks should be disregarded, that that evidence could not be ignored because it was “relevant to the [P]rosecution’s narrative”. In our view, the Judge did not actually take that evidence into account when he sentenced MAG. 51 In any event, even if the Judge did err in taking into account the evidence concerning the three earlier attacks, we are satisfied, for the reasons stated above, that considering only the manner in which MAG attacked the deceased, the imposition of the death penalty is amply warranted because of the sheer viciousness of the attack. Accordingly, we also dismiss that part of MAG’s appeal in CCA 9 relating to sentence.",
        "The Prosecution’s appeal in CCA 11": "52 We turn now to the Prosecution’s appeal in CCA 11 against TAI’s sentence. The Prosecution submits that this is the first case in which the imposition of the discretionary death penalty falls to be considered in respect of asecondaryoffender,ie, an offender who did not inflict the fatal blow on the victim. In our view, there is no reason why the principles laid down by this court inKhoJabing (Re-sentencing)(see [47] above) should not equally apply to a secondary offender. InKhoJabing (Criminal Motion), we elaborated (at [89]) that the test of whether an offender’s actions “outrage the feelings of the community” is a “reasoned normative standardwhich future courts are to apply” [emphasis in original]. We further explained as follows (at [90]): 90 Determining whether an offender’s actions so “outrage the feelings of the community” and are “so grievous an affront to humanity and so abhorrent” that the death penalty is justified is an exercise in ethical judgment in which the sentencing court expresses the collective conscience of the community through the selection of a condign punishment. In performing this exercise, contrary to what [counsel] submitted, the remit of the sentencing court’s inquiry isnotcircumscribed. This court specifically stated in [KhoJabing (Re-sentencing)] that the sentencing court was to look widely, and that “allthe circumstances and factors of the case must be taken into consideration in meting out an appropriate sentence” … (at [37]), thus also ensuring that the inquiry would be anobjectiveone. Furthermore, at [51(d)], this court expressly highlighted that “the motive and intention of the offender at the time he committed the offence” was an important sentencing factor which must form part of the sentencing matrix. In the circumstances, we see no warrantable basis for concluding that this court applied the wrong test in [KhoJabing (Re-sentencing)]. [emphasis in original] 53 Bearing in mind these considerations, we deal first with the Prosecution’s submission that TAI and MAG bore equal culpability for the deceased’s death because they were convicted on the basis of their shared common intention to commit murder under s 300(c) read with s 34 of the Penal Code. In our view, s 34 equates the culpability of a principal offender with that of a secondary offender for the purposes ofdeterminingcriminal liability. Section 34, however, does not equate the principal offender’s and the secondary offender’s culpability for the purposes ofsentencing, where principles of (inter alia) and the personal circumstances of each offender are to be taken into account. The cases which the Prosecution relies on to support its submission on this point – namely, the High Court decision ofErJoo Nguang and another v Public Prosecutor[2000] 1 SLR(R) 756 and our decision inPublic Prosecutor v Leong SoonKheong[2009] 4 SLR(R) 63 (“Leong SoonKheong”) – do not assist the Prosecution because they merely stand for the proposition that a principal offender and a secondary offendermaybe regarded as bearing the same culpability for sentencing purposes. Indeed, these two decisions stand for the proposition that all the circumstances of the case must be considered, and it does not necessarily follow that a secondary offender always bears a lower degree of culpability than a primary offender simply because the former did not participate in the physical attack on the victim. This point is exemplified by the following passage inLeong SoonKheong(at [36]–[37]): 36 Contrary to the judge’s view, the law often does not benignly appraise the conduct of a “passive” participant in a group assault. In the context of determining participation under s 34 of the [Penal Code], this court inToo YinSheong v PP[1998] 3 SLR(R) 994 declared (at [37]) thatit is clear that the potential utility of a person present as a guilty confederate at the scene of the crime cannot be underestimated. Earlier in that decision, the court explained (at [27]) that the reason why all are deemed guilty intypicalcases under s 34 of the [Penal Code] was that the presence of accomplices gives encouragement, support and protection to the person actually committing the act. Surely, it cannot be said that a gang leader who directs an attack from the sidelines ought to be viewed more benignly and favourably than his gang members who execute his directions. Those who are not involved in executing physical attackscancarry thesamelevel of culpability as the attackers, if they participate in the common objectives of the group and/or encourage the attainment of the same. We must qualify this statement by emphasising that depending on the nature of the offence, the mere presence of a group member who isnot involved in the offending act itselfat the scene may not invariably be sufficient participation to affix culpability. This is especially true where no prior planning or discussion has taken place before individuals in a group act unilaterally without reference to the group’s objectives. 37 With due respect, the judge was far too charitable in assessing the [accused’s] role. While it is true that the [accused] may not have landed any blows or directly injured the Deceased personally, he was, at the very least, every bit as culpable as his accomplices were.A person, who by his presence and/or conduct authorises, instigates or supports an act of physical violence cannot avoid or limit his own personal responsibility by simply pointing to his lack of physical participation in the incident. The use of inflammatory words in a volatile situation often aggravates violence. Such words can incite or embolden an angry group to commit inexplicable acts of brutality.Words have the potential to generate even more harmful consequences than physical acts. The nub of the matter is that, in group offences such as this, the focus of the sentencing judge ought not to be on whether an offender has behaved actively or passively but on precisely what role he had in the incident. [emphasis in original in italics; emphasis added in bold italics] 54 In our judgment, in deciding for sentencing purposes whether a secondary offender acted in blatant disregard for human life, two particular factors are relevant: (a) the mental state of the offender at the time of the attack; and (b) his actual role or participation in the attack. It is the confluence of both factors, without one assuming a greater importance than the other, which ultimately determines whether the offender acted in blatant disregard for human life. We cannot but stress the importance of considering all the factual circumstances of each case. We should also clarify that the mere fact that an offender did not inflict the fatal blows does not necessarily mean that the death penalty would therefore be unwarranted. The Judge himself recognised this (see the Judgment on Sentence at [13]). With these considerations in mind, we turn to the facts pertinent to CCA 11, beginning with TAI’s mental state at the time of the attack on the deceased. 55 TAI does not dispute that at the very minimum, he had the intention to inflict on the deceased injury of the type specified in s 300(c) of the Penal Code (“s 300(c) injury”) as otherwise, criminal liability would not have attached to him in the first place (seeDaniel Vijay s/oKatherasan and others v Public Prosecutor[2010] 4 SLR 1119 at [167];KhoJabing and another v Public Prosecutor[2011] 3 SLR 634 at [32]–[33]). It follows that in every case where a secondary offender is held liable for murder committed in furtherance of a common intention under s 300(c) read with s 34, this mental element of intending to inflict s 300(c) injury is necessarily present. A sentencing court must be cognisant of this and guard against placing too much emphasis on the secondary offender’s common intention because that common intention results in the imposition of criminal liability in the first place. In such cases, where the mental element on the part of the secondary offender is merely the common intention to inflict s 300(c) injurywithout more, greater focus should be placed on the secondary offender’s actual role in the attack in determining the appropriate sentence. 56 In our judgment, TAI’s mental state went beyond the minimum required for a conviction of murder committed in furtherance of a common intention under s 300(c) read with s 34. Not only did TAI have the common intention to inflict s 300(c) injury on the deceased, he also knew that MAG would in all likelihood wield theparangindiscriminately when attacking the deceased. While there was no preconceived plan to kill the deceased by using theparangin asavage and mercilessmanner, TAI knew that MAG would in all likelihood do so as he had seen how MAG had used theparangindiscriminately on the earlier three victims. We do not accept that TAI did not know the extent of the injuries suffered by those victims, or that he did not know MAG would use theparangon the deceased. MAG had used theparangon all the earlier three victims despite TAI claiming that he told MAG not to, and there was nothing to suggest that MAG was going to behave differently in respect of the attack on the deceased. 57 Turning to TAI’s actual participation in that attack, it is not disputed that TAI acted according to the Gang’s plan and initiated the attack by knocking the deceased off his bicycle down the slope into the open field. The Prosecution’s case, based on HAL’s evidence, is that thereafter, TAI gave chase and held the deceased in an armlock while MAG inflicted the fatal injuries (see [25] above). TAI denies this. 58 On balance, we are not satisfied that TAI held on to the deceased for a significant period of time long enough for MAG to inflict the fatal injuries. There are several reasons why we have come to this conclusion. First, HAL’s evidence that TAI held on to the deceased for a significant period of time is not without difficulty since it has already been demonstrated that HAL had trouble recollecting the events which took place on the night of the four attacks. While we are satisfied that HAL’s evidence that MAG alone wielded theparangis reliable, the same cannot be said about his evidence on thedurationfor which TAI held on to the deceased while MAG struck the deceased with theparang. Second, we note that while there was street lighting on the footpath beside the open field where the attack took place, there were no lights in the open field (see [18] above), which was also where the fatal injuries were inflicted on the deceased. HAL’s vision would thus have been impaired by the lack of lighting. When this is considered together with the fact that the events during the attack on the deceased would have unfolded very rapidly, we are not satisfied that it is safe to rely on HAL’s testimony that TAI held the deceased for a sufficiently long period of time for MAG to inflict the fatal wounds. Third, we find persuasive the submission made by counsel for TAI, Mr Amarick Gill (“Mr Gill”), that it is unlikely that TAI could have held on to the deceased for a significant period of time while MAG wielded theparangindiscriminately without TAI himself suffering blows. It must be remembered that it was dark in the open field, and in all likelihood, TAI would not have held on to the deceased for the entire duration of the attack given the real possibility that he could himself have been struck by theparang. The Prosecution argues that it is reasonable to infer that TAI, in restraining the deceased, “positioned himself in such a way as to avoid the risk of injuries arising from MAG’s slashing”52Foot Note 52×Prosecution’s submissions at para 131.by pushing the deceased away from himself. We find this submission impermissibly speculative. There is no direct evidence that TAI in fact did so, and given that the burden of establishing this fact lies with the Prosecution, it would be improper to speculate and fill in gaps in the evidence. In the circumstances, we are not satisfied that TAI held on to the deceased for a significant period of time, allowing MAG to inflict the fatal injuries on the deceased. Given the risk to himself, it was just as likely that when MAG began to strike the deceased, TAI could have released his hold over the deceased. 59 We should add that Mr Gill has highlighted the fact that neither the deceased’s blood nor his DNA was detected on the clothes which TAI wore during the attack. According to HAL’s evidence, which was the key basis of the Prosecution’s case at the trial, TAI grabbed hold of the deceased after MAG slashed his back and held the deceased in an armlock (see [25] above). If TAI had indeed done so, his clothes would have come into contact with the deceased’s blood. The absence of the deceased’s blood and/or DNA on TAI’s clothes would strongly suggest, according to Mr Gill, that TAI did not in fact hold on to the deceased as HAL claimed. 60 No expert evidence was adduced at the trial as to whether blood stains and DNA on clothes can be completely removed by washing. The Prosecution seemed to have acknowledged that it is not possible to completely remove DNA from clothes contaminated by blood.53Foot Note 53×NE Day 12 at page 46.This appears to be reinforced by the fact that the clothes which TAI wore during the attack were shown to have Ang’s DNA even though there was evidence from the Prosecution that those clothes had been washed. This strongly suggests that washing clothes stained with DNA will not fully remove the DNA traces. On this basis, Mr Gill’s argument concerning the absence of the deceased’s blood and/or DNA on TAI’s clothes appears to have merit, indicating that it is highly unlikely that TAI held on to the deceased in the manner described by HAL. This in turn means that the fundamental plank on which the Prosecution rests its argument in CCA 11 that TAI should, like MAG, be sentenced to death is, in all likelihood, invalid. In any event, even if we take the view that it is not possible for us to make any firm conclusion on this matter given the available evidence and theabsenceof expert evidence on all the permutations of what most likely occurred during the attack on the deceased, the conclusion to be drawn would be neutral – neither detrimental nor favourable to TAI. The same can be said of the Prosecution’s reliance on the forensic evidence that the deceased’s DNA was found on TAI’s belt (see [23] above). This fact alone cannot tell us whether or not TAI did in fact hold on to the deceased for a sufficiently long period of time for MAG to inflict the fatal wounds on the deceased. 61 Considering both TAI’s mental state and his actual involvement in the attack on the deceased, we are not satisfied that he acted in blatant disregard for human life such that the ultimate sentence of death is warranted. There are a myriad of ways in which a guilty confederate may be involved in an offence of murder. On the facts of the present case, we accept that TAI initiated the attack on the deceased. We are, however, not satisfied that he held on to the deceased for a significant period of time long enough for MAG to inflict the fatal injuries on the deceased. We appreciate that TAI must have known that MAG would in all likelihood use theparangon the deceased in the same manner as he did in relation to the first three victims. Even so, we have doubts as to whether such knowledge on TAI’s part, coupled with his act of initiating the attack on the deceased, is,without more, sufficient to amount to a blatant disregard for human life. 62 Had there been a preconceived plan to inflict the heinous injuries which were sustained by the deceased (as opposed to knowledge that a savage and merciless attack on the deceased was likely), or a plan to kill the deceased in such a brutal manner, the imposition of the death penalty on TAImaywell have been justified. Similarly, had there been more certainty on the evidence as to TAI’s actual participation in the attack (eg, by holding on to the deceased so as to allow MAG to slash him or by egging MAG on (seeLeong SoonKheongat [37])) apart from his initiation of the attack, the death penaltymayalso have been warranted.We stress again that each case must turn on itsown facts. On the facts of this case, we do not see sufficient basis to disturb the Judge’s exercise of his discretion to sentence TAI to life imprisonment and 24 strokes of the cane instead of imposing the ultimate sentence of death.",
        "Our decision": "41 We shall first consider MAG’s appeal in CCA 9 against his conviction and sentence before turning to the Prosecution’s appeal in CCA 11 against TAI’s sentence.",
        "Conclusion": "63 In conclusion, we dismiss MAG’s appeal in CCA 9 against conviction and sentence, and we also dismiss the Prosecution’s appeal in CCA 11 against TAI’s sentence. We express our appreciation to Mr Tiwary, Mr Gill and the Prosecution for their diligence in the carriage of this matter. 64 At the end of the day, the punishment must fit the crime. We are satisfied that the death penalty is warranted for MAG given his savage use of theparangon the deceased. The same, however, cannot be said of TAI’s involvement in the attack on the deceased. In the context of the test expounded inKhoJabing (Re-sentencing), we are not satisfied that TAI’s culpability is sufficient to warrant the imposition of the death penalty, although we should add that our decision in this regard rests onavery fine balance. Chao Hick Tin        Andrew Phang Boon Leong     Judith PrakashJudge of Appeal       Judge of Appeal       Judge of Appeal Ramesh Tiwary (Ramesh Tiwary), Tng Soon Chye (Tng Soon Chye & Co) and Keith Lim Wei Ming (Quahe Woo & Palmer LLC) for the appellant in Criminal Appeal No 9 of 2015;Anandan Bala and Marcus Foo (Attorney-General’s Chambers) for the respondent in Criminal Appeal No 9 of 2015 and the appellant in Criminal Appeal No 11 of 2015;Gill Amarick Singh (Amarick Gill LLC), Loo Khee Sheng (K S Loo & Co) and Justin Tan Jia Wei (Trident Law Corporation) for the respondent in Criminal Appeal No 11 of 2015."
    }
}