{
    "case_title": "PT Bayan Resources TBK and another vBCBC Singapore Pte Ltd and another",
    "ncitation": "[2018] SGCA(I) 6",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 In 2006, the parties to the present appeal entered into a joint venture in the hope of exploiting a new technology to upgrade coal and then sell it commercially. In the ensuing years, their relationship came under increasing strain and eventually collapsed, leading the respondents to commence Suit No 1 of 2015 (“the Suit”) against the appellants. The trial was conducted before Quentin Loh J, Vivian Ramsey IJ and Anselmo Reyes IJ (collectively, “the Court”), and they ordered that it be heard in separate tranches, each dealing with specific issues. The Court rendered its decision in the first tranche in 2016 and in the second tranche in 2017: see respectively,BCBC Singapore Pte Ltd and another v PT Bayan Resources TBK and another[2016] 4 SLR 1 (“First TrancheJudgment”) andBCBC Singapore Pte Ltd and another v PT Bayan Resources TBK and another[2017] 5 SLR 77 (“Second TrancheJudgment”). No appeal was filed against theFirst TrancheJudgment, which primarily concerned the determination of the scope and content of the parties’ obligations under the joint venture. This appeal concerns only theSecond TrancheJudgment, which dealt largely with whether the parties had breached those obligations, and if so, what consequences flowed from such breaches.",
        "Background facts": "2 The facts relevant to the dispute are detailed in the two aforementioned judgments of the Court. It therefore suffices for us to set out just the relevant facts pertinent to the present appeal. 3 The appellants are PT Bayan Resources TBK (“BR”) and Bayan International Pte Ltd (“BI”). BR is a public-listed Indonesian company that owns a number of subsidiaries operating coal mines in Tabang, Indonesia, including PT Bara Tabang (“Bara”) and PT Fajar Sakti Prima (“FSP”). BI is a company registered in Singapore and associated with BR. We refer to BR and BI collectively as “the Appellants”. 4 On the other side of the dispute are the respondents, BCBC Singapore Pte Ltd (“BCBCS”) and Binderless Coal Briquetting Company Pty Limited (“BCBC”). BCBC is an Australian company that holds the exclusive worldwide licence for a coal-upgrading process known as the binderless coal briquetting process (“the BCB Process”), and BCBCS is a Singaporean company associated with it. Both BCBC and BCBCS are indirect wholly-owned subsidiaries of White Energy Company Ltd (“WEC”), a public-listed Australian company. These three companies are referred to in this judgment as “the WEC Parties”, while BCBCS and BCBC (the respondents in this appeal) are referred to as the “the Respondents”.",
        "Inception of the joint venture": "5 In 2005, the parties envisioned using the BCB Process to upgrade and then sell the Appellants’ coal. This eventually led to the execution of a joint venture deed (“the JV Deed”) between BCBC and BI in June 2006. Under the JV Deed, the parties agreed to construct and commission a coal briquette processing plant in Tabang, Indonesia (“the Tabang Plant”). The construction and commissioning of this plant will be referred to hereafter as “the project” where appropriate to the context. A deed of novation was executed in 2009, the effect of which was that BCBCS and BR were substituted for BCBC and BI respectively as the parties to the JV Deed. 6 In 2007, the parties incorporated an Indonesian joint venture company, PT Kaltim Supacoal (“KSC”), with BCBCS holding 51% and BI, 49% of the issued shares. With the execution of the JV Deed and the incorporation of KSC, the joint venture was underway, but friction between the parties started to develop by November 2007, when they realised that they had underestimated the costs of the Tabang Plant. To exacerbate matters, in the years following the execution of the JV Deed, the Indonesian government passed legislation that had the effect of adding to the cost of operating the Tabang Plant and KSC’s business. Of particular note is a piece of legislation known as “the HBA Regulations”, which came into force in October 2010 and which set the benchmark price for the sale of minerals and coal in Indonesia (“the HBA Price”). 7 These developments led the parties and KSC to enter into a series of funding agreements and memoranda of understanding in the years after the JV Deed was executed. For our purposes, the following are noteworthy: (a) In March 2009, the parties entered into two memoranda of understanding: first, a “Memorandum of Understanding (KSC Funding Arrangements)” (“the Funding MOU”), which set out the parties’ funding obligations; and second, a “Memorandum of Understanding (Expansion of joint venture)” (“the Expansion MOU”), which concerned the future expansion of the joint venture. (b) In September 2009, KSC entered into an agreement with Standard Chartered Bank for a US$10m working capital loan facility (“the SCB Loan Facility”). (c) In December 2010, KSC, BR and BCBCS entered into a “Priority Loan Funding Agreement” (“the PLFA”), which was backdated to April 2010. Under the PLFA, it was agreed that BCBCS would advance a revolving working capital facility of up to US$20m to KSC; while BR would provide KSC with a “Coal Advance”, which entailed BR supplying coal (through Bara and FSP) to KSC at the market price (approximately US$15 per tonne in March 2010) but requiring payment of only US$8 per tonne upon delivery, with the balance that remained due constituting the advance. The parties’ obligations under the PLFA were originally intended to last until June 2011, but this was later extended to 31 December 2011 by way of an addendum, which also increased the facility limit from US$20m to US$40m. (d) Between March and June 2011, KSC entered into coal supply agreements (“the 2010 CSAs”) with BR’s coal mining subsidiaries, Bara and FSP. The agreements were backdated to October 2010 when the HBA Regulations came into force, and the effect of this was that the obligation on Bara’s and FSP’s part was to supply coal to KSC at the HBA Price. Pursuant to the “Coal Advance” under the PLFA, however, KSC only had to pay US$8 per tonne upfront for the coal. 8 In October 2011, the Tabang Plant was shut down for modification works to take place. It was anticipated that the modification works would be completed around June 2012.",
        "Deterioration of the parties’ relationship": "The KSC board meeting in November 2011 9 Things came to a head in the last quarter of 2011. On 28 October 2011, the WEC Parties sent an information package to the Appellants, which revealed that KSC had exceeded its 2011 budget by nearly US$7m as at 30 September 2011. 10 On 2 and 3 November 2011, a KSC board meeting (“the November 2011 Board Meeting”) was held. Two sets of handwritten notes recording the discussions were in evidence, one taken by the WEC Parties and the other by the Appellants. These sets of notes are generally consistent. They record that BR’s shareholders had instructed BR’s management to address serious concerns over the feasibility of the joint venture. The Appellants indicated that they wanted to exit the joint venture, and that they were willing to sell their shares in KSC (as represented by BI’s 49% shareholding therein) to the WEC Parties. The Appellants were happy for the WEC Parties to continue with the joint venture on their own, and while BR remained willing to supply coal to KSC, this would have to be on arms’ length terms and “at commercial rates”. Cessation of coal supply to KSC on 9 November 2011 11 Following the November 2011 Board Meeting, the Appellants informed the WEC Parties on 4 November 2011 that as an interim measure, BR would continue supplying coal to KSC at the HBA Price. On 7 November 2011, KSC sought coal from Bara and FSP, informing them that it still needed “a lot of coal”. In total, KSC received some 8,000 tonnes of coal from Bara and FSP from 3 to 8 November 2011. 12 On 9 November 2011, WEC made a public announcement on the Australian Stock Exchange to the effect that BR had formed the view that the joint venture might not be economically viable, and that the price of the coal supplied to KSC had to be “substantially higher” than what had been agreed on under the 2010 CSAs. The announcement also stated that BR believed that it could generate much higher margins by selling the coal directly into the export market, and that these issues “[went] directly to the economic viability of [the Tabang Plant] and the willingness of each of the shareholders to continue with their investment in KSC”. 13 On the same day, after WEC’s announcement, BR e-mailed Bara and FSP instructing them to stop supplying coal to KSC. BR’s e-mail, the contents of which were eventually conveyed to KSC and WEC, was in the following terms: You may or may not be aware that Bayan has decided to withdraw from the KSC joint venture (see [WEC’s] press release attached). At this time we are still working out some of the commercial details surrounding this and therefore do not want to supply them any more coal until this has been resolved. In this regard, please stop all supply to them until further notice. The meeting on 17 November 2011 14 The cessation of coal supply to KSC was followed by a meeting on 17 November 2011 (“the 17 November 2011 Meeting”) attended by a few representatives from each side to discuss the “impasse relating to KSC”. The only record of the meeting consisted of a set of handwritten notes taken by Mr Brian Flannery (“Mr Flannery”), who represented the WEC Parties. His notes reflected the WEC Parties’ desire to bring the Tabang Plant to completion, and also KSC’s need for coal in order to bring the plant up to its design capacity. 15 During the meeting, the Appellants reiterated their desire to exit the joint venture, and again raised the possibility of the WEC Parties buying out their share of the joint venture for US$45m, which was the amount that they had invested in the project up to that point in time. Mr Flannery’s notes ended with a statement that “Bayan will only agree to supply coal if [the WEC Parties] pay $45m for their equity. [The WEC Parties] will not pay $45m for their equity”. Nothing further was recorded. This suggests that the understanding between the parties was that BR would not resume the supply of coal to KSC until the Appellants’ shares in KSC were bought out (“the Buyout Condition”), although the Appellants deny that they imposed such a condition. Allegations of breach 16 In the days following the 17 November 2011 Meeting, the parties exchanged a flurry of correspondence, with each side alleging that the other had breached its obligations under the JV Deed. 17 On 21 November 2011, BCBCS wrote to BR accusing it of breaching a number of clauses under the JV Deed. Among other things, BCBCS alleged that BR had breached its coal supply obligation by imposing the Buyout Condition, and demanded that this be remedied within seven days by BR directing the supply of coal to KSC to recommence in accordance with the 2010 CSAs. 18 On the same day, WEC released another public announcement through the Australian Stock Exchange. In this announcement, WEC set out its understanding of what had happened during the 17 November 2011 Meeting. It stated that it had requested BR to continue supplying coal to KSC up to the end of June 2012 in order to enable KSC to complete the testing of the Tabang Plant’s modifications, but BR had indicated that it would only supply coal at the HBA Price if WEC agreed to buy out the Appellants’ 49% stake in KSC for US$45m. WEC further stated that its board had concluded that it would not be in its shareholders’ interests to buy out the Appellants’ stake in KSC at that price, and that a notice had been issued to BR to rectify the breach stemming from its failure to meet its coal supply obligation. 19 The next day, on 22 November 2011, KSC ordered the short-term contractors working at the Tabang Plant to cease the modification works and demobilise immediately. The e-mail containing the instructions explained that the modification works were to stop because of the dispute between the parties. This order did not, however, apply to KSC’s regular employees, who continued working on the modifications in addition to carrying out their regular operational and maintenance work at the plant. 20 On 24 November 2011, BR replied to BCBCS’s notice of breach of 21 November 2011 (see [17] above), stating that the notice was “misconceived” because the Appellants had not linked their intention to withdraw from the joint venture to the question of coal supply to KSC. BR maintained that the Appellants’ desire to exit the joint venture stemmed from their view that the joint venture was “no longer feasible, both from a technical and commercial point of view”. It also stated that Bara would continue supplying coal to KSC pursuant to the 2010 CSAs and at the HBA Price in compliance with the HBA Regulations. 21 On 29 November 2011, the WEC Parties replied to BR. They maintained that the Appellants had imposed the Buyout Condition, but that they would be proceeding on the basis that the Appellants had withdrawn that condition. Further, they informed BR that KSC had exceeded its existing funding facilities under the PLFA and would require additional funding of up to US$20m through to the end of June 2012. They asked BR to confirm that it would provide 49% of the said funding in accordance with its obligations under the JV Deed and the Funding MOU. 22 On 2 December 2011, BR replied to the WEC Parties. It rejected the WEC Parties’ request for funding, and added that it had never suggested that “[Bara] would not comply with the [2010 CSAs]”. Nothing more was said about the Buyout Condition, and BR stated that it would not correspond further in the light of an extraordinary general meeting of KSC’s shareholders that was scheduled to be held on 6 December 2011 (“the 6 December 2011 EGM”). The 6 December 2011 EGM 23 The proceedings of the 6 December 2011 EGM were captured in a set of draft minutes of meeting which incorporated input from both sides. At the meeting, the Appellants reiterated their intention to exit the joint venture because they considered that the project was no longer viable. They also intimated their desire to liquidate KSC unless their stake in KSC was bought out. In addition, they denied having imposed the Buyout Condition, and maintained that BR would continue supplying coal to KSC at the HBA Price. It is undisputed that the meeting also touched on the possibility of putting the Tabang Plant into care and maintenance, with the plant’s operations suspended and only a limited number of workers retained onsite to maintain the plant’s facilities, although the parties are divided as to whether there was anagreementto do so. 24 Thereafter, on the same day, the Appellants instructed Bara and FSP to supply KSC with coal if KSC so requested. This, however, was not made known to either KSC or the WEC Parties, and it appears that they continued to operate under the impression that BR would supply coal to KSC, but only at the HBA Price, rather than on the terms set out under the PLFA. The aftermath of the 6 December 2011 EGM 25 The 6 December 2011 EGM was followed by a further exchange of correspondence between the parties and KSC. On 8 December 2011, KSC e-mailed BCBCS and BR setting out the cost estimates in relation to the care and maintenance program discussed during the 6 December 2011 EGM. 26 On 12 December 2011, the WEC Parties sent a letter to BR stating that BR’s refusal to provide 49% of KSC’s funding requirements amounted to a breach of BR’s obligations under the JV Deed and the Funding MOU. The WEC Parties gave BR until 13 December 2011 to confirm that it would meet 49% of KSC’s funding needs, and threatened to commence proceedings in Singapore if BR failed to do so. 27 On 13 December 2011, BR replied to the WEC Parties by way of a letter captioned “RE: DEFAULT NOTICE”. That letter incorporated a default notice pursuant to cl 13.1(b) of the JV Deed (the “Default Notice”), and accused BCBCS of the following breaches of the JV Deed: (a) breach of cl 7.1(s) and/or cl 7.1(bb) by unilaterally causing KSC to exceed its budget by about US$7m (“the Excess Expenditure”), and to exceed the PLFA facility limit of US$40m by extending a further loan of about US$6m to KSC (“the Excess Debt”); and (b) breach of cl 16.3, in that WEC had made public announcements about the joint venture without BR’s consent. 28 On 15 December 2011, the Tabang Plant was put into care and maintenance. 29 On 20 December 2011, the WEC Parties sent another letter to BR. They maintained that BR was in breach of its obligation to meet 49% of KSC’s ongoing funding requirements, and stated that “one of the consequences of BR’s refusal to provide funding in accordance with its obligations is that KSC will need to suspend its operations and implement a care and maintenance program”. In that regard, the WEC Parties also asked BR to confirm that it would provide 49% of the funding needed for the care and maintenance program. 30 On 22 December 2011, BR replied to the WEC Parties and again maintained that it had no funding obligations. As to funding the care and maintenance program, BR asked for “an exhaustive and detailed list of each and every item which [the WEC Parties] allege is required for the care and maintenance of the Project, together with the costs of each and every item” [underlining in original omitted] in order to consider its position. 31 On 23 December 2011, the WEC Parties replied to BR. In their letter, the WEC Parties reiterated their position on BR’s funding obligations, and noted that the breakdown requested by BR in relation to the costs of the care and maintenance program had already been provided to BR in KSC’s e-mail of 8 December 2011. The next day, on 24 December 2011, the WEC Parties sent another letter to BR asking it to withdraw its Default Notice. The commencement of the Suit and the termination of the JV Deed 32 On 27 December 2011, the Respondents initiated the Suit against the Appellants. Approximately two months later, on 20 February 2012, BCBCS wrote to BR, reiterating that BR had breached its coal supply and funding obligations and demanding that BR rectify someof its alleged breaches of the JV Deed. However, BCBCS did not require BR to recommence the supply of coal to KSC in this letter. Instead, BCBCS’s focus was on having BR meet its alleged funding obligations. 33 A day later, on 21 February 2012, BR wrote to BCBCS purporting to terminate the JV Deed. Among other things, BR reiterated its position that BCBCS had breached the terms of the JV Deed, highlighting the Excess Expenditure and the Excess Debt (see [27] above). BCBCS replied on 2 March 2012, stating that BR’s purported termination constituted a wrongful repudiation of the JV Deed, which it accepted.",
        "The Court’s decisions": "",
        "TheFirst TrancheJudgment": "34 The first tranche of the trial concerned the scope and content of the parties’ obligations under the joint venture. There were three categories of issues before the Court, namely: (a) funding issues; (b) coal supply issues; and (c) counterclaim issues. 35 With regard to the funding issues, the Court found that BR was not obliged to fund KSC during the period from November 2011 to 2 March 2012 (“the Relevant Period”). It found that the Funding MOU did not override the JV Deed, which entitled the parties to withhold consent to any call for funding. Further, the good faith obligation under the JV Deed did not require BR to approve all additional expenditure thought to be needed by BCBCS. The Court also held that BR had no obligation to consent to KSC drawing on the SCB Loan Facility to repay BCBCS a temporary loan of approximately US$3m which BCBCS had advanced in November 2011. However, contrary to what the Appellants contended, the Court held that BCBCS had not undertaken to fund the Tabang Plant until it achieved commercial production, save to the extent that BCBCS had agreed to provide such funding. 36 In respect of the coal supply issues, the Court held that the parties’ arrangements for the supply of coal were neither illegal nor tainted by illegality, in that the 2010 CSAs complied with the HBA Regulations. As for whether BR was obliged to ensure a supply of coal to KSC, the Court deferred its decision on this issue to the second tranche of the trial. It considered that there was insufficient evidence before it to ascertain the stage of commissioning which the Tabang Plant was at in November 2011, and whether it had sufficient coal for the commissioning process. 37 In relation to the counterclaim issues, the Court held that BCBCS was not under an obligation to provide technical assistance to KSC in relation to the design, building or operation of coal preparation and briquetting plants, nor was it under an implied contractual duty to use the reasonable skill and care expected of a competent designer, builder or operator of such plants. It also held that BCBCS was neither expressly nor impliedly obliged to ensure that the Tabang Plant would produce one million metric tonnes per annum (“1 MTPA”) of upgraded coal briquettes, which was the initial production target set out in cl 3.2 of the JV Deed, within a reasonable time. 38 As we mentioned at [1] above, no appeal was brought against the Court’s decision in theFirst Tranche Judgment.",
        "TheSecond TrancheJudgment": "39 In theSecond Tranche Judgment, the Court was confronted with a list of 11 issues that again fell into three groups, namely: (a) coal supply issues; (b) repudiation issues; and (c) causation and loss issues. The coal supply issues 40 The coal supply issues presented the Court with questions that essentially dealt with BR’s obligation to ensure a supply of coal to KSC under the JV Deed and the PLFA. Issue 1: BR’s coal supply obligation 41 The first issue was whether BR had aprima facieobligation to ensure a supply of coal to KSC under Art 7.1 of the PLFA and/or cl 3.8(b)(iii) of the JV Deed. If so, a related question arose as to the precise scope of BR’s obligation in the light of cl 3.9 of the 2010 CSAs (Second TrancheJudgmentat [69]). 42 The Court held that BR did have the aforesaidprima facieobligation. It noted that Bara and FSP were obliged under cl 3.9 of the 2010 CSAs to supply sufficient coal to KSC for testing the Tabang Plant up to the point where commissioning was achieved (Second TrancheJudgmentat [73]–[74]). Under Art 7.1 of the PLFA, BR had aprima facieobligation to ensure that Bara and FSP supplied coal to KSC in accordance with cl 3.9 of the 2010 CSAs, although this obligation extended only to 31 December 2011 (Second TrancheJudgmentat [77(a)]). And under cl 3.8(b)(iii) of the JV Deed, BR had a similarprima facieobligation to ensure that Bara and FSP fulfilled their coal supply obligations under cl 3.9 of the 2010 CSAs; but unlike the obligation under the PLFA, the obligation under the JV Deed persisted until the JV Deed was terminated (Second TrancheJudgmentat [77(b)]). Issue 2: The Tabang Plant and its supply of coal 43 The second issue was divided into several sub-issues, all of which related to the Tabang Plant and whether it had sufficient coal for testing. 44 The first sub-issue concerned the stage of commissioning that the Tabang Plant had reached by November 2011 (Second TrancheJudgmentat [78]). In this regard, the Court found that there were four stages of commissioning, namely: (a) modification works after construction; (b) commissioning to check the Tabang Plant’s individual components without a load; (c) load commissioning; and (d) ramping-up to commercial production (Second TrancheJudgmentat [80]). The last two stages would have involved testing the Tabang Plant’s production module with coal, and the Court found that these two stages were imminent in November 2011. The modifications to the plant, which were part of the commissioning process, were on their way to being completed in either November or December 2011, and the plant remained in the commissioning phase until 15 December 2011, when it was put into care and maintenance (Second TrancheJudgmentat [83]–[85]). 45 The second sub-issue that the Court had to address was whether the Tabang Plant had sufficient coal during the Relevant Period for testing purposes (Second TrancheJudgmentat [86]). The Court found that the plant did not have sufficient coal. It required 40,000 tonnes of coal; and as matters stood in November 2011, it had a stockpile of only about 15,500 tonnes of coal, which would have allowed its production module to run for only approximately eight days (Second TrancheJudgmentat [87] and [93]–[94]). 46 The third sub-issue was whether KSC made a request for coal in accordance with the 2010 CSAs during the Relevant Period (Second TrancheJudgmentat [95]). The Court held that it did, rejecting the Appellants’ argument that under the 2010 CSAs, KSC had to ask for coal in a specific format by providing Nominated Monthly Quantity (“NMQ”) notices to Bara and FSP. In this regard, the Court found that under cl 3.9 of the 2010 CSAs, the obligation to supply coal to KSC for testing the Tabang Plant was triggered “as and when” KSC made a request for coal; KSC was not obliged to specify any particular quantity of coal for there to be a valid request. It was only when the Tabang Plant went into production, and was thus in need of large quantities of coal, that NMQ notices would have been needed. Therefore, when KSC made a request for coal on 7 November 2011 (see [11] above), it did not have to comply with the NMQ procedure set out in cll 3.1 to 3.5 of the 2010 CSAs. KSC’s coal request was a valid request, and Bara’s and FSP’s obligations to supply coal under the 2010 CSAs were thereby triggered (Second TrancheJudgmentat [102]–[106]). 47 The fourth sub-issue was whether BR was under an obligation to ensure a supply of coal to KSC even if BCBCS and BR had not unanimously agreed to provide KSC with further funding, and where BCBCS was not prepared to further fund KSC on its own (Second TrancheJudgmentat [107]). The Court answered this in the affirmative, noting that the essential question was whether Bara’s and FSP’s coal supply obligations under cl 3.9 of the 2010 CSAs were dependent on KSC being willing and able to perform its obligation to pay for the coal (Second TrancheJudgmentat [112]). The Court held that Bara’s and FSP’s coal supply obligations were independent of KSC’s payment obligation (Second TrancheJudgmentat [111]–[115]). Accordingly, even if KSC could not have paid for the coal, Bara and FSP were contractually obliged to supply coal to KSC under cl 3.9 of the 2010 CSAs. Further, under Art 7.1 of the PLFA and cl 3.8(b)(iii) of the JV Deed, BR had an obligation to ensure that Bara and FSP fulfilled their coal supply obligations (Second TrancheJudgmentat [117]). 48 The fifth sub-issue was whether BR’s coal supply obligation continued to subsist during the Relevant Period in circumstances where: (a) the Tabang Plant was not operational; (b) KSC lacked funds and could not continue to operate; and (c) the Tabang Plant had been put into care and maintenance (Second TrancheJudgmentat [118]–[119]). The Court answered this in the affirmative. With respect to (a), the Court held that BR’s coal supply obligation did not abate simply because the Tabang Plant was not operational during the Relevant Period (Second TrancheJudgmentat [121] and [125]). In relation to (b), the Court found that BCBCS had expressed a willingness to fund KSC by itself, and noted again that BR’s coal supply obligation was in any event independent of KSC’s ability to pay for the coal (Second TrancheJudgmentat [123]–[124]). As for (c), the Court found that the Tabang Plant had been placed into care and maintenance on 15 December 2011 by agreement. Although the modification works at the plant had yet to be completed at that time, this did not affect Bara’s and FSP’s coal supply obligations under the 2010 CSAs and BR’s obligation to ensure that Bara and FSP fulfilled those obligations. KSC had properly made a request for coal for testing the Tabang Plant; and although testing might have been delayed due to the plant having been put into care and maintenance, the obligation to supply coal for testing “as and when requested” continued to apply (Second TrancheJudgmentat [126]). 49 The last sub-issue was whether BCBCS had caused KSC to cease its business without BR’s consent by unilaterally putting the Tabang Plant into care and maintenance. The Court decided that this question did not arise in the event, given its finding that the parties hadagreedto put the plant into care and maintenance (Second TrancheJudgmentat [128]–[129]). Issue 3: The scope of BR’s coal supply obligation 50 The third issue was whether there were any limitations on BR’s coal supply obligation, and whether the procedure governing how a request for coal was to be made under the 2010 CSAs had been done away with by the parties. In this regard, the Court reiterated its findings on the second issue, and held that there were no limitations on BR’s coal supply obligation (Second TrancheJudgmentat [132]). As for the procedure for requesting for coal under the 2010 CSAs, the Court noted that if cll 3.1 to 3.5 of the 2010 CSAs had stipulated a formal procedure for making requests for coal even before the Tabang Plant went into production, the parties had agreed to do away with that procedure in June 2010 and had replaced it with an informal procedure (Second TrancheJudgmentat [134]). Issue 4: Breaches of BR’s coal supply obligation 51 The fourth issue was essentially whether BR had breached its coal supply obligation. The Court held that it had done so by instructing Bara and FSP to cease their supply of coal to KSC on 9 November 2011, noting again Bara’s and FSP’s obligations under cl 3.9 of the 2010 CSAs to supply coal to KSC for testing the Tabang Plant, and BR’s obligation under cl 3.8(b)(iii) of the JV Deed and cl 7.1 of the PLFA to ensure that Bara and FSP fulfilled their coal supply obligations (Second TrancheJudgmentat [137] and [140]). The Court also found that BR had imposed the Buyout Condition during the 17 November 2011 Meeting, and that this too constituted a breach of BR’s coal supply obligation (Second TrancheJudgmentat [143]–[144]). 52 We pause here to note that the Court also found that BR had committed multiple repudiatory breaches of the PLFA (Second Tranche Judgmentat [145]). These breaches arose from BR’s representations during the November 2011 Board Meeting, in its letter dated 24 November 2011 and during the 6 December 2011 EGM that Bara and FSP would only supply coal to KSC at the HBA Price, when Bara and FSP were only entitled to upfront payment of US$8 per tonne under the terms of the PLFA (Second Tranche Judgmentat [29(d)], [46] and [51(b)]). The repudiation issues 53 The repudiation issues concerned the question of whether either BCBCS or BR had repudiated the JV Deed. It bears emphasis that this category of issues concerned only the JV Deed and not the PLFA, which, as we have just noted, was found to have been repudiated by BR. In relation to BCBCS, the focus was principally on the Excess Debt and the Excess Expenditure, which BCBCS had allegedly caused KSC to incur without BR’s consent. As for BR, the question of repudiation arose from its breach of its coal supply obligation under the JV Deed, its expressed desire to exit the joint venture as well as its purported termination of the JV Deed by way of its letter of 21 February 2012. Issue 5: BCBCS’s repudiation of the JV Deed 54 At the heart of the fifth issue was whether BCBCS had repudiated the JV Deed by unilaterally causing KSC to incur the Excess Expenditure (Second TrancheJudgmentat [147]) and the Excess Debt (Second TrancheJudgmentat [163]), and by unilaterally having KSC put the Tabang Plant into care and maintenance (Second TrancheJudgmentat [173]). The Court answered all three questions in the negative. 55 With regard to the Excess Expenditure, the Court noted that the members of KSC’s board of directors and management and operations team were all appointed in accordance with the agreed arrangements under the joint venture. Even if it were the case that the WEC Parties’ representatives comprised KSC’s management and operations team, it was up to both parties, as joint venture parties, to ensure that KSC did not exceed its budget (Second TrancheJudgmentat [154]). Additionally, the Court found that BR had a nominated signatory, Mr Lim Chai Hock (“Mr Lim”), in KSC. Mr Lim was a senior member of BR’s management and had the power to veto payments out of KSC’s bank accounts by withholding signature of KSC’s cheques. This co-signatory mechanism had been approved at a meeting between the parties on 22 November 2006, and its effect was that KSC could not spend without BR’s consent. It therefore could not be said that BR had no control over KSC’s expenditure (Second TrancheJudgmentat [155]). The Court further highlighted that BR had been aware by late April 2011 that KSC had been spending in excess of its budget and could easily have acted to stop KSC from incurring further expenditure by instructing Mr Lim to stop signing KSC’s cheques. BR had not, however, done so (Second Tranche Judgmentat [158]). 56 In relation to the Excess Debt, the Court found that it did not automatically follow that KSC had incurred a debt simply because BCBCS had advanced an additional US$6m to it on top of the US$40m facility under the PLFA. A debt would only have been incurred by KSC if the parties had subsequently ratified the additional US$6m funding by a shareholder loan agreement or a further addendum to the PLFA. It was not disputed that there was no such ratification. Therefore, BCBCS could not have recovered the US$6m from KSC, and KSC on its part could not be said to have incurred a corresponding debt to BCBCS (Second TrancheJudgmentat [168]). 57 As for the Tabang Plant being put into care and maintenance, the Court found that the parties hadagreedto this during the 6 December 2011 EGM. The Court also noted that while BR might have reserved its position as to how much was to be spent on the care and maintenance program, it was clear that BR had agreed to the implementation of such a program (Second TrancheJudgmentat [176]–[177]). Issue 6: Whether BR accepted BCBCS’s repudiation 58 The sixth issue was whether BR had accepted BCBCS’s repudiation of the JV Deed by way of its letter to BCBCS dated 21 February 2012. This issue fell away given the Court’s holding that BCBCS had not repudiated the JV Deed (Second TrancheJudgmentat [178]–[179]). Issue 7: BR’s repudiation of the JV Deed 59 The seventh issue was whether BR had repudiated the JV Deed: (a) by breaching its coal supply obligation; (b) by its words and conduct during the November 2011 Board Meeting and the 6 December 2011 EGM, where it intimated an intention to exit the joint venture; and/or (c) by purporting to terminate the JV Deed in its letter dated 21 February 2012 (Second TrancheJudgmentat [180]). 60 The Court held in the affirmative, finding that (a) and (c) were repudiatory breaches of the JV Deed. The Court found that cl 3.8(b)(iii) of the JV Deed, which provided that BR must “assist in procuring Coal for the operation of the Business”, was a condition of the JV Deed. It noted that the joint venture had been entered into in order to upgrade coal supplied by Bara and FSP, and therefore, BR’s obligation to procure the supply of coal to KSC was a matter of fundamental importance. By failing to meet this obligation, BR was in repudiatory breach of the JV Deed (Second TrancheJudgmentat [181]–[182]). As for the termination notice issued by BR on 21 February 2012, the Court found that BR had no grounds to issue that notice given that BCBCS was not in breach of the JV Deed; BR’s conduct in issuing that notice was therefore itself repudiatory of the JV Deed (Second Tranche Judgmentat [193]). 61 However, in relation to (b), the Court did not agree with the Respondents for several reasons (Second TrancheJudgmentat [187]–[191]). First, although BR had stated at the November 2011 Board Meeting and the 6 December 2011 EGM that it wished to exit the joint venture, this did not amount to an assertion that it would not perform its obligations under the JV Deed. Second, BR had proposed two exit options to BCBCS which were consistent with cll 11 to 13 of the JV Deed. These provided for the termination of the joint venture by consent and for the resolution of deadlocks. Third, BR’s repudiation of the PLFA did not entail that it had thereby repudiated the JV Deed as well because the PLFA did not refer to the JV Deed at all, unlike the 2010 CSAs. Fourth, while BR’s representatives had made statements at the November 2011 Board Meeting and the 6 December 2011 EGM which could be construed as indicating that BR no longer considered itself bound by the JV Deed, those statements did not unambiguously convey a settled and irrevocable decision on the part of BR that it would not perform its obligations under the JV Deed. Issue 8: Whether BCBCS accepted BR’s repudiatory breaches 62 The eighth issue was whether BCBCS had accepted BR’s repudiation of the JV Deed by way of its letter dated 2 March 2012. The Court answered this in the affirmative. It held that BR had repudiated the JV Deed by (among other things) issuing its termination notice of 21 February 2012 when it had no basis to do so, and BCBCS had validly accepted that repudiatory act by way of its letter dated 2 March 2012, which had the effect of terminating the JV Deed (Second TrancheJudgmentat [195]). The causation and loss issues Issue 9: Whether BR caused loss to BCBCS 63 The ninth issue, which was raised by the Appellants, was whether BCBCS should, in any event, be entitled to only nominal damages given that the Tabang Plant allegedly could not reach commercial production without further funding (Second TrancheJudgmentat [202]–[206]). In addition, the Appellants contended that any claim by BCBCS for lost profit would contravene the principle against claims for reflective loss because it was KSC (and not BCBCS) that had suffered the loss flowing from BR’s breaches (Second TrancheJudgmentat [228]). In this connection, the Appellants also argued that BCBCS ought not to be allowed to rely on what might have happened pursuant to the Expansion MOU in its claim for damages against BR (Second TrancheJudgmentat [232]). It may be noted that these arguments by the Appellants raised questions pertaining to damages, and on one view, it might have been thought that they were not appropriate for determination at the second tranche of the trial, which was essentially concerned with questions of breach. However, having regard to how these questions were framed by the Appellants, resting as they did largely on issues of law, the Court described them as being akin to “a strike-out argument” (Second Tranche Judgmentat [202]). 64 The Court declined to find, in any event, that only nominal damages could be awarded to BCBCS. Among other things, it found that it was not open to it, at that stage, to exclude the possibility of the Tabang Plant reaching commercial production within a reasonable time. Although the short-term contractors at the plant had been asked to suspend the modification works there on 22 November 2011, more than 300 regular employees of KSC continued to carry out the modification works. Further, while the plant had been put into care and maintenance on 15 December 2011, it could have been reactivated within a matter of days (Second TrancheJudgmentat [210]–[212]). 65 The above factors were not, however, conclusive because a critical element of BR’s case in this respect was that KSC would not have been funded to the point where the testing and commissioning of the Tabang Plant was completed, and this in fact rendered the question of damages theoretical. As to this, the Court found that on the evidence before it, it appeared likely that BCBCS would have been prepared to fund KSC unilaterally, and that BR would not have objected to such funding by BCBCS (Second Tranche Judgmentat [223]). Indeed, BR had known since at least June 2010 that BCBCS was funding KSC on its own and had not objected to such unilateral funding by BCBCS (Second TrancheJudgmentat [217]–[219]). The Court, however, concluded that there was insufficient evidence before it to determine whether BCBCS was indeed in a financial position to continue funding KSC on its own all the way until the completion of the testing and commissioning of the Tabang Plant. It therefore reserved its decision on this question to the next tranche of the trial, which it observed would be “specifically devoted to causation of damage and quantum” (Second TrancheJudgmentat [223]–[224]). 66 As for the Appellants’ arguments in relation to the reflective loss principle, the Court observed that BR had not properly pleaded the issue and so had unfairly denied BCBCS the opportunity to adduce evidence to show that the loss which it was claiming was either not reflective loss or fell within the exception to the principle barring recovery for reflective loss. The Court hence deferred that issue to the next tranche of the trial as well (Second TrancheJudgmentat [230]). Similarly, the question of whether BCBCS could claim damages predicated on what might have happened under the Expansion MOU was deferred to the next tranche so as to give BCBCS the chance to make such submissions and adduce such evidence as it deemed appropriate (Second TrancheJudgmentat [232]). Issues 10 and 11: The quantum of damages and the costs orders 67 Flowing from its decision on the ninth issue, the Court held that the issues relating to the quantum of damages and the costs orders to be made should be dealt with at the next tranche of the trial (Second TrancheJudgmentat [235]).",
        "The issues on appeal": "68 The Appellants have appealed against the whole of the Court’s decision in theSecond Tranche Judgment, save for the issue on which the Court did not rule against them. That issue was whether BR had repudiated the JV Deed by its words and conduct at the November 2011 Board Meeting and the 6 December 2011 EGM, which the Court determined in favour of the Appellants (see [61] above). The crux of this appeal turned on four main issues which were identified by the Appellants as follows: (a) first, whether BR was obliged to procure and/or ensure the supply of coal to KSC during the Relevant Period (“the Obligation Issue”); (b) second, if BR was under such an obligation, whether BR breached that obligation, and if so, whether that breach constituted a repudiation of the JV Deed (“the Breach Issue”); (c) third, whether BR repudiated the JV Deed by issuing the termination notice in its letter of 21 February 2012 (“the Repudiation Issue”); and (d) fourth, if BR were guilty of repudiating the JV Deed, whether such repudiation caused any loss to BCBCS, and if so, what is the period for which BCBCS is entitled to damages (“the Causation Issue”). 69 Some of these issues encompass sub-issues which we will address in the course of dealing with each of these issues in turn.",
        "The Obligation Issue": "",
        "The parties’ cases": "158 We turn finally to the Causation Issue. The Appellants argue that any breaches of the JV Deed found to have been committed by BR did not cause BCBCS any loss. First, they argue that KSC could not have continued operating without further funding from the parties. And because, so they maintain, KSC would not have been funded and thus would not have been able to get the Tabang Plant to the point where it could undertake commercial production, no loss can be said to have been caused to KSC by BR’s alleged breaches. This contention ultimately turns on whether BCBCS was able and willing to continue funding KSC. In response, the Respondents say that there were “extant funding arrangements in place at the material time”, and that “BCBCS would have continued to fund KSCby itselfon an as needs basis had BR not breached its coal supply obligation” [emphasis in original]. Second, the Appellants argue that even if KSC had suffered any loss as a result of BR’s alleged breaches of the JV Deed, the proper plaintiff should be KSC, and not BCBCS. They contend that the Court erred in characterising their argument on this point as “an argument on reflective loss” and in deferring this issue to the third tranche of the trial. Third, they argue that the Court erred in also deferring to the third tranche the issue of whether BR was obliged under the Expansion MOU to expand the capacity of the joint venture and the Expansion MOU’s effect on BCBCS’s claim for damages because the Expansion MOU clearly “did not impose any obligation on BR to expand the capacity of the joint venture”. The Respondents, on the other hand, contend that it was entirely correct of the Court to defer its decision on these issues to the third tranche in the circumstances since that tranche has been reserved for the assessment of damages. 159 Alternatively, the Appellants argue that any damages awarded to BCBCS should be limited to one of the following periods, beginning on 9 November 2011 (the date on which BR instructed Bara and FSP to stop supplying coal to KSC) and ending on: (a) 22 November 2011, this being the date of BCBCS’s decision to demobilise the Tabang Plant owing to an alleged lack of funding, which then rendered the issue of BR’s coal supply obligation irrelevant; or (b) 24 November 2011, this being the date on which BR offered to continue supplying coal to KSC based on the 2010 CSAs, which offer BR repeated at the 6 December 2011 EGM and followed up on by instructing Bara and FSP on the same day to supply coal to KSC if the latter so requested, but which BCBCS rejected because it was unwilling to fund KSC by itself; or (c) 29 November 2011, this being the date on which BCBCS stated that “its funding of KSC was subject to BR contributing 49% of KSC’s costs of commissioning, operation and maintenance”, warranting the finding that KSC would not have had the funds to continue operations from 29 November 2011 onwards even if BR had supplied coal to it; or (d) 15 December 2011, this being the date on which BCBCS unilaterally put the Tabang Plant into care and maintenance because of a lack of funding. 160 Many of these contentions clearly overlap with points that have been dealt with elsewhere in this judgment.",
        "Our decision": "Whether BCBCS was willing to fund KSC unilaterally 161 In our judgment, at the heart of the Causation Issue is the question of whether BCBCS was willingandable to fund KSC by itself. We agree with the Court that BCBCS waswillingto do so. 162 The Appellants rely on the WEC Parties’ letter to BR dated 29 November 2011 (see [21] above) to show that the Court erred in finding that BCBCS was willing to fund KSC unilaterally. In that letter, the WEC Parties appeared to condition BCBCS’s funding of 51% of KSC’s expenses on BR’s willingness to fund its 49% share of those expenses. The Appellants contend that this demonstrates that BCBCS was unwilling to fund KSC on its own. The salient portion of the letter is as follows: … Our assessment is that KSC will require funding of up to USD$20 million through to the end of June 2012. Please confirm BR will enter into a member loan with KSC to provide 49% of that funding in accordance with its JV Deed and MOU obligations. BCBCS confirms that it is willing to provide 51% of that funding.Once you have provided that confirmationwe can then take steps to ensure that KSC enters into loan agreements accordingly with BCBCS and BR. … [emphasis added] 163 We do not think this letter brings the Appellants’ case very far. We agree with the Court that “it does not logically follow that, if BCBCS (wrongly) believed that BR was legally obliged by the JV Deed to provide its share of funding, BCBCS was not prepared to fund KSC on its own in any circumstances” (Second TrancheJudgmentat [227]). The real question is whether BCBCS was in factwillingto proceed to unilaterally fund KSC. In our judgment, the evidence shows on the balance of probabilities that it was. 164 BCBCS in fact continued funding KSC all the way to 29 March 2012, well after the Suit was commenced. Further, the KSC loan drawdown schedule shows that BCBCS continued funding KSC even after the November 2011 Board Meeting, which was when BR first expressed its desire to withdraw from the joint venture. BCBCS also continued to fund KSC after the WEC Parties’ 29 November 2011 letter to BR, in which, according to the Appellants, the WEC Parties purportedly conditioned BCBCS’s funding of KSC on BR’s agreeing to co-fund KSC’s operations. Such continued funding by BCBCS is also consistent with Mr Flannery’s evidence in his affidavit of evidence-in-chief dated 28 December 2016 that the success of KSC and the Tabang Plant was crucial to the WEC Parties: 164. … [T]he WEC Board was always confident in the potential for commercial exploitation of the BCB Technology. … WEC’s core project was the Tabang Plant, and it was expected that after commissioning was completed, further plants would be constructed together with BR in Indonesia. … 166. The reality of the situation was that BCBCS was the sole shareholder which was cash funding the project after October 2009 for almost two years … WEC was willing to go above and beyond to fund BCBCS’s share in KSC because of the importance of the project to the [WEC Parties’] commercial interests, and did in fact do so by funding the project in excess of the US$40 million loan facility in the PLFA beyond August 2011. 165 In this connection, while Mr Singh is correct in his submission that the WEC Parties’ letters to BR towards the end of 2011 focussed to a very large extent on seeking funding from BR, it is clear from a close examination of the parties’ correspondence that the seeming shift in focus from coal supply issues to funding issues emerges from 12 December 2011 onwards, which was just after the parties had agreed at the 6 December 2011 EGM that the Tabang Plant was to be put into care and maintenance. Thereafter, the question of coal supply became less pressing, and in that context, it is unsurprising that the WEC Parties would cease asking for coal to be supplied to KSC and instead address the underlying question of funding. 166 Separately, the Appellants also argue that the Respondents’ pleaded case was that the Tabang Plant had been put into care and maintenance because of BR’s failure to provide funding to KSC, a point that was also observed by the Court in theSecond TrancheJudgmentat [58]. But the relevant portion of the Respondents’ SOC indicates that the care and maintenance program was implemented for two reasons – BR’s cessation of coal supplyandits refusal to provide further funding: At an extraordinary shareholders’ meeting of [KSC] held on 6 December 2011, representatives of [BR] communicated that [BR] would not be providing any further funding to [KSC]. In view of [BR’s] refusal to provide any further funding,and the cessation of coal supplyto [KSC] referred to at paragraph 47 below, [BCBCS] noted that [KSC] would need to suspend its operations and enter into a care and maintenance program if [BR] did not change its position. [emphasis added] 167 The short point is that by the end of November 2011, the project had reached a stage where some fundamental issues relating both to the supply of coal and the question of funding had arisen, and these needed to be resolved between the parties before matters could be taken further. It is unsurprising that the parties agreed to put the Tabang Plant into care and maintenance while these matters were being discussed. But this alone does not warrant the finding, which the Appellants urge upon us, that BCBCS was unwilling to fund KSC unilaterally. Whether BCBCS was able to fund KSC unilaterally 168 This brings us to the question of whether BCBCScouldhavefunded KSC by itself. As we noted earlier (at [65] above), the Court reserved its decision on this issue to the next tranche of the trial on the basis that there was insufficient evidence before it (Second TrancheJudgmentat [223]). It also reserved to the next tranche its decision on whether BCBCS was in substance claiming KSC’s reflective loss (Second TrancheJudgmentat [230]–[231]), and whether BCBCS could rely on what might have happened pursuant to the Expansion MOU in its claim for damages (Second TrancheJudgmentat [232]; see also [66] above). 169 The Appellants submit that the Court ought to have disposed of the three aforesaid issues instead of deferring them to the next tranche of the trial. They argue that the burden falls on the Respondents to establish causation and show that BCBCS would have suffered the loss that it is claiming. Thus, if the Court was of the view at the end of the second tranche of the trial that the evidence adduced was insufficient to establish causation, it ought to have found against the Respondents and held that either the loss claimed by BCBCS was not made out or the damages awarded for such loss should be limited to certain time periods. The Appellants submit that they have been prejudiced by the Court’s failure to determine the three above-mentioned issues based on the evidence before it because the Respondents have effectively been given another chance to establish causation at the next tranche of the trial. 170 We agree that where an issue is squarely and properly placed before the court, the court ought to decide it. Where the evidence is found to be incomplete such that the court cannot make a finding one way or the other, the question of fact that has been raised is to be decided on the basis of who bears the burden of proof. In this regard, the Appellants referred us to the decision of the English Court of Appeal inMorris v London Iron and Steel Co Ltd[1988] 1 QB 493, in which May LJ observed at 504 that where the court is unable to prefer one side’s story over the other, “the operation of the principle of the burden of proof comes into play and the plaintiff fails”. A similar observation was also made by the House of Lords inRhesaShipping Co SA v Edmunds[1985] 1 WLR 948, where Lord Brandon of Oakbrook observed at 955 as follows: … [T]he judge is not bound always to make a finding one way or the other with regard to the facts averred by the parties. He has open to him the third alternative of saying that the party on whom the burden of proof lies in relation to any averment made by him has failed to discharge that burden. … 171 In our view, whether or not the Court correctly deferred its final determination on causation to the next tranche of the trial hinges on the precise question of causation that was before it. The parties could not agree on the formulation of this question, and it was therefore reflected as follows in the list of issues to be decided at the second tranche of the trial: C.Causation 9. The Parties are unable to agree on the framing of this issue: WEC Parties If BR is found to be liable for breach of its obligation(s) in respect of coal supply and/or repudiation of the JV Deed, and on the agreed assumption that the Tabang Plant would have achieved a production capacity of approximately 1 MTPA, whether, as a result of such breach, BCBCS suffered loss. Bayan Parties Having regard, among other things, to the Court’s findings in [theFirst Tranche Judgment], including but not limited to its finding that BR was not obliged under the JV Deed or the Funding MOU to provide funding, and the matters pleaded in paragraph 178A of the [Appellants’ Defence and Counterclaim (Amendment No 5)], if BR is found to have breached the Alleged Coal Supply obligation and/or repudiated the JV Deed, and on the agreed assumption that the Tabang Plant would have achieved a production capacity of approximately 1 MTPA, whether such breach and/or repudiation caused loss to BCBCS and if so, what is the period that BCBCS is entitled to claim damages for. 172 Regardless of the nuances of the formulation that was preferred by each party, distilled to its essence, the central question of causation that was before the Court was whether BR’s breaches and repudiation of the JV Deed caused BCBCS to suffer any loss. 173 But the scope of the causation question before the Court also has to be assessed in the light of what was discussed at the CMC prior to the second tranche of the trial. From the CMC transcript, it is clear that the Respondents were reluctant to deal fully with matters of causation at the second tranche because that would have required evidence on the technical aspects of the Tabang Plant, which would likely not have fit into the allocated time for that tranche. The Court thus suggested to the parties that they deal with the question of causation on the assumption that the Tabang Plant would have been able to reach a production level of 1 MTPA of coal in November 2011. As we noted above (at [89]), both sides agreed to this, save that Mr Singh reserved the right to run the case that the WEC Parties did not subjectively believe that the plant was going to become operational as soon as the parties had hoped. The following statement from Mr Singh at the CMC reveals some insight into the argument that he sought leave to run: [The Respondents] asserts need for experts. But [the issues concerning BR’s alleged breaches of the JV Deed] would involve question of whether entire project doomed because there was no funding.Once we decided not to fund (and court has found we were not obliged to fund), they chose not to fund it themselves. Project would not have gone anywhere. They may well have taken view at that time that plant was not worth taking further.[emphasis added] As the Respondents put it, the issue framed by Mr Singh was “whether BCBCS [itself] subjectively believed in November 2011 that the project would have failed, and thereafter would have stopped funding the project and/or ended the joint venture. If such belief is established, BCBCS cannot attribute its losses to BR’s repudiation.” 174 Given this, it seems to us that the causation question that was before the Court was narrower than what was eventually reflected in the list of issues to be decided at the second tranche of the trial. It would also explain why the Court deferred the issues relating to reflective loss and the relevance of the Expansion MOU to the third tranche. It was simply not contemplated by either the parties or the Court that the arguments pertaining to these two issues would be run as part of the submissions on causation at the second tranche. Therefore, as far as these two issues are concerned, we find that the Court was correct to defer them to the third tranche because they were not before it. In our judgment, the Respondents would have been unduly prejudiced had they not been allowed to adduce the relevant evidence on these two issues. 175 Respectfully, however, we consider that the Court was not entitled to defer to the third tranche the issue of BCBCS’sabilityto fund KSC unilaterally. Given that this issue was intricately tied to the question of whether KSC had sufficient funds to keep operating the Tabang Plant, it seems to us to have been squarely before the Court. Moreover, looking at the Respondents’ submissions for the second tranche of the trial, it is clear to us that they were happy to address this point based on the evidence that was adduced at that tranche. For example, the following argument was made in their written closing submissions: … [I]t is untrue that … BCBCS was not prepared to further fund KSC on its own. BCBCS was the sole shareholder cash funding the joint venture from October 2009 onwards, and had every intention to continue doing so had BR complied with its continuing obligation to supply coal to KSC. Far from not being prepared to further fund KSC on its own, from 19 August 2011, BCBCS had demonstrated that it waswilling and ableto further fund KSC of its own accord, beyond the US$40 million it had committed under the PLFA. Mr Flannery further testified that BCBCS was furtherwilling and ableto continue cash funding the project until the Tabang Plant reached commercial production. … [emphasis added] 176 Accordingly, while the Court was correct to defer the issues regarding the reflective loss principle and the Expansion MOU to the third tranche of the trial, it ought to have decided the question of whether BCBCS had the financial wherewithal to fund KSC by itself. To the extent that there was insufficient evidence to arrive at a finding on this issue, it should have been determined according to who bore the burden of proof.",
        "Conclusion on the Obligation Issue": "99 For these reasons, we dismiss the Appellants’ arguments in relation to the Obligation Issue.",
        "The Breach Issue": "",
        "Conclusion on the Breach Issue": "113 For these reasons, we dismiss the Appellants’ arguments in relation to the Breach Issue.",
        "The Repudiation Issue": "",
        "Conclusion on the Repudiation Issue": "157 For these reasons, we find that the grounds on which BR’s termination notice of 21 February 2012 rested are not made out. It follows that BR, by issuing that notice when it was not entitled to do so, repudiated the JV Deed. In this regard, we note that the Appellants are not challenging the Court’s finding that BR’s repudiatory act was accepted by BCBCS, and that the JV Deed was thereby terminated.",
        "The Causation Issue": "",
        "Conclusion on the Causation Issue": "177 For these reasons, we find that BCBCS waswillingto fund KSC by itself. But we consider that the Court ought to have decided the issue of whether BCBCS had theabilityto do so, and we remit this issue to the Court for its determination. Save as aforesaid, we dismiss the Appellants’ submissions on the remaining aspects of the Causation Issue.",
        "Conclusion on the appeal": "178 In conclusion, we dismiss the Appellants’ appeal in relation to all of the four main issues set out at [68] above, save only that in respect of the Causation Issue, we remit to the Court the question of whether BCBCS had theabilityto fund KSC on its own. 179 Unless the parties are able to come to an agreement as to the appropriate order on costs within four weeks of the date of this judgment, they are to file and serve written submissions on this, limited to ten pages each, within six weeks of the date of this judgment. Sundaresh Menon          Judith Prakash            Dyson HeydonChief Justice           Judge of Appeal            International Judge Davinder Singh SC, Jaikanth Shankar, Chan Yong Wei, Lydia Ni Man Chuo, Phang Hwee Guang and Teo Li Fang (Drew & Napier LLC) for the appellants;Francis Xavier SC, Alina Chia and Tee Su Mien (Rajah & Tann Singapore LLP) for the respondents."
    }
}