{
    "case_title": "Parakou Investment Holdings Pte Ltd and anothervParakou Shipping Pte Ltd (in liquidation)and other appeals",
    "ncitation": "[2018] SGCA 3",
    "coram": "Andrew Phang Boon Leong JA (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 Parakou Shipping Pte Ltd (“Parakou”) is a company in liquidation. These appeals involve claims by its liquidator (“the Liquidator”) against its directors (“the Directors”) and their related companies (collectively, “the Defendants”) in respect of various transactions entered into by Parakou around the time of its insolvency. The Liquidator claims that the transactions were designed to strip Parakou of its assets and were in breach of the fiduciary duties of the Directors, and that the related companies were dishonest assistants and/or knowing recipients with regard to these wrongdoings. The Defendants assert, on the other hand, that these transactions were part of a pre-existing plan to restructure Parakou. 2 The High Court judge (“the Judge”) found primarily for the Liquidator based largely on the inexplicable haste with which the transactions had been entered into (seeParakou Shipping Pte Ltd (in liquidation) v Liu Cheng Chan and others[2017] SGHC 15 (“the Judgment”)). However, he exonerated the Defendants from liability for certain transactions which preserved the profits of Parakou and reduced its losses. The parties now challenge most of the findings that went against them in their respective appeals. 3 For the reasons set out below, we dismiss the appeals save for one narrow point each in favour of the Liquidator and the Defendants. At this particular juncture, it would be apposite to first set out the relevant background to the present appeals.",
        "Background": "4 Parakou was incorporated in 1995 with Mr Liu Cheng Chan (“C C Liu”) and his wife, Mdm Chik Sau Kam (“Chik”), as its shareholders and directors. Mr Liu Por (“Liu Por”), the son of C C Liu and Chik, became a shareholder in 2005, Vice-President in 2006, and a director in 2008. Mr Yang Jianguo (“Yang”), a family friend of the Lius, was appointed President in 2006 and became a shareholder and a director in 2008. C C Liu and Chik stepped down as directors and divested themselves of their shares in 2008. 5 By 2007, Parakou had the following three lines of business: (a) an outer port limit services business (“the OPL Business”), which was to provide offshore supply vessel services to ships in and around Singapore; (b) a ship management business (“the Ship Management Business”); and (c) a ship chartering business (“the Chartering Business”). 6 In or around 2008, Parakou purportedly entered into a charterparty with Galsworthy Limited (“Galsworthy”) for a ship named theCanton Trader, which Parakou planned (in turn) to sub-charter to Ocean Glory Shipping Ltd (“Ocean Glory”). 7 On 15 September 2008, however, the collapse of the global financial services firm, Lehman Brothers, triggered a worldwide financial crisis. The freight market plummeted. This severely affected the Chartering Business of Parakou. 8 On 30 October 2008, Parakou received an email warning it to “pay sharp attention to the financial condition” of Ocean Glory, which had re-delivered a vessel that it had chartered from another entity “earlier than the minimum period with extremely short notice”. 9 On 31 October 2008, Parakou received the original copies of the charterparty for theCanton Traderfrom Galsworthy. However, Parakou never signed the charterparty. Galsworthy eventually brought and succeeded in an action against Parakou in respect of this charterparty (“the Galsworthy Claim”). 10 Thereafter, Parakou engaged in the conduct that forms the subject matter of these proceedings, which conduct we broadly categorise as “the Disputed Transactions” and “the Legal Proceedings”.",
        "The Disputed Transactions": "11 In November 2008, Parakou sold 10 vessels and two uncompleted hulls (collectively, “the OPL Vessels”) to Parakou Investment Holdings Pte Ltd (“PIH”). At all material times, C C Liu, Chik, and Liu Por were directors and shareholders of PIH, with C C Liu holding 70% of the shares in PIH. 12 With effect from 30 November 2008, Parakou terminated 12 ship management agreements (“SMAs”) that it had entered into with 12 companies (“the 12 Pretty Entities”). The 12 Pretty Entities were controlled by C C Liu, Chik, Liu Por, and another son of C C Liu. Thereafter, the 12 Pretty Entities entered into contracts on substantially the same terms with Parakou Shipmanagement Pte Ltd (“PSMPL”). PSMPL had been incorporated on 18 November 2008 to take over the OPL Business and Ship Management Business of Parakou. The parties do not dispute that these acts effected a “transfer” of the SMAs from Parakou to PSMPL. 13 Between 12 and 24 November 2008, Parakou repaid debts of S$9,812,543 that it had owed to PIH (“the PIH Repayments”). These payments were approved by Liu Por and Yang. 14 On 5 December 2008, Parakou repaid debts of S$3,046,200 to Parakou Shipping SA (“the PSSA Repayment”). Parakou Shipping SA was wholly owned by C C Liu, and controlled by C C Liu as well as Chik. This payment was approved by Yang. 15 On 9 and 15 December 2008, Parakou set off a total of S$1,732,239 of debts that PIH owed to it in respect of the purchase of the OPL Vessels against debts that it owed to PIH for charter hire (“the PIH Set-Off”). This set-off was approved by Liu Por and Yang. 16 On 12 December 2008, Parakou paid a total of S$267,128 in bonuses to all four of the Directors (“the Bonus Payments”). Around the same time, Parakou increased the monthly salaries of Liu Por and Yang by S$2,000 each with effect from 1 January 2009 (“the Salary Increases”). Pursuant to these increases, Liu Por and Yang received a total of S$108,000 between January 2009 and March 2011. 17 On 22 December 2008, C C Liu and Chik transferred their shares in Parakou to Liu Por and Yang, and appointed them as directors in Parakou. With effect from 31 December 2008, C C Liu and Chik resigned as directors in Parakou. 18 On 23 December 2008, Parakou released 39 employees who had been affected by the termination of the SMAs with the 12 Pretty Entities. This decision was effected by way of a board resolution signed by Liu Por and Yang (“the 23 December 2008 Resolution”). These 39 employees were subsequently hired by PSMPL in January 2009. Nevertheless, Parakou continued to pay the salaries of six of these employees from January 2009 to December 2010. These payments total S$309,377 (“the Six Employees’ Salary Payments”). 19 Between January 2009 and December 2010, Parakou paid S$240,000 to PIH in respect of space that PIH had leased from a third party and then sub-tenanted to Parakou. This transaction gave rise to a claim by the Liquidator below (but which was not pursued by the parties on appeal) that Parakou had overpaid S$213,270 in rent (“the Excess Rent Payments”).",
        "The Legal Proceedings": "20 In the midst of the Disputed Transactions, on 11 February 2009, Parakou informed Galsworthy that it would not execute the charterparty for theCanton Trader. Galsworthy then commenced arbitration proceedings against Parakou in London (“the London Arbitration”). In response, Parakou commenced court proceedings in Hong Kong against the owners and/or demise charterers of theJin Kang(formerly, theCanton Trader) for an indemnity in respect of any liabilities that it might incur in the London Arbitration (“the HK Court Proceedings”). 21 During the London Arbitration, Liu Por and Yang admitted that if a valid charterparty did in fact exist between Parakou and Galsworthy, Parakou would be liable for damages of at least US$2,670,000. Shortly thereafter, the tribunal issued a decision finding that there had been a valid charterparty and ordering Parakou to pay interim damages of US$2,673,279 to Galsworthy with further damages to be assessed (“the First Award”). Around the same time, the HK Court Proceedings commenced by Parakou were struck out as a collateral attack on the London Arbitration and as an abuse of process. 22 In March 2011, Parakou entered provisional liquidation. 23 In April 2011, Parakou entered creditors’ voluntary liquidation. 24 In May 2011, the London tribunal assessed further damages of US$38,579,000 against Parakou (“the Second Award”). 25 Parakou incurred a total of S$6,223,238 in legal fees for both the London Arbitration and the HK Court Proceedings.",
        "The decision below": "26 The Judge found at the outset that there had been no restructuring plan. The board resolution of March 2008 (“the March 2008 Resolution”) on which the Defendants relied in support of their case that there had been such a restructuring plan did not, in his view, hold up against the other objective evidence. 27 The Judge held that most of the Disputed Transactions were in breach of the statutory and/or the fiduciary duties of the Directors: (a) The sale of the OPL Vessels was a transaction at an undervalue under the Companies Act (Cap 50, 2006 Rev Ed) read with the Bankruptcy Act (Cap 20, 2009 Rev Ed), as well as a breach of the fiduciary duties of the Directors. The gross sale price was S$9,905,600. This was S$1,192,900 less than what they could have fetched had the Directors not rushed the transaction and not sold the OPL Vessels to a related company. (b) The transfer of the SMAs to the 12 Pretty Entities was a transaction at an undervalue because Parakou received no consideration for the transfer. Even so, the transfer of the SMAs was not a breach of the fiduciary duties of the Directors because the Ship Management Business had been loss-making for Parakou. (c) The Bonus Payments were undervalue transactions as well as breaches of the fiduciary duties of the Directors. The bonuses were paid to the Directors even though Parakou was not contractually obliged to do so. Further, Parakou received no consideration for making the Bonus Payments. (d) The Six Employees’ Salary Payments were transactions at an undervalue as well as breaches of the fiduciary duties of the Directors. The six employees had left Parakou by the time the Six Employees’ Salary Payments were made. Further, Parakou received no consideration for the payments. (e) The Salary Increases were not transactions at an undervalue but were nevertheless breaches of the fiduciary duties of the Directors. It was unclear that the consideration received by Parakou was significantly less than the value provided by it. Even so, the Salary Increases were unjustified because Parakou had no contractual obligation to pay them and was in poor financial health at the time when it did so. (f) The Excess Rent Payments were neither transactions at an undervalue nor breaches of the fiduciary duties of the Directors. There was insufficient evidence to support such a conclusion. Further, the Liquidator had provided no evidence of the cost of the space that Parakou had actually used. (g) The PIH Repayments and PSSA Repayment were not undue preferences under the Companies Act read with the Bankruptcy Act, but were nevertheless made in breach of the fiduciary duties of the Directors. These payments preferred PIH and PSSA to the other creditors of Parakou. Moreover, the payments were made even though both PIH and PSSA had provided Parakou with letters of support stating their respective intentions to continue to provide financial support to it “until all other payables have been met”. Nonetheless, the PIH Repayments and PSSA Repayment took place outside the statutory clawback period. Even so, they were in breach of the fiduciary duties of the Directors because they had hardly been made in the interests of Parakou. 28 The Judge held, however, that the Directors had not breached their fiduciary duties in commencing and/or continuing the London Arbitration and the HK Court Proceedings. The Directors had done so simply as part of a viable strategy to incentivise Galsworthy to settle its claim. Moreover, the concession made by Liu Por and Yang in the London Arbitration led directly to the making of the First Award of US$2,670,000, which could have grounded liquidation proceedings against Parakou, even before the statutory clawback period had expired. 29 The Judge hence made the following findings on liability: (a) For the Directors’ breaches, each director was liable for damages in relation to the Disputed Transactions in which he or she was involved. (i) C C Liu and Chik were jointly and severally liable for the PSSA Repayment, the Bonus Payments, and the Salary Increases. Parakou had to elect between claiming for damages and an account of profits. (ii) Because PIH dishonestly assisted C C Liu and Chik in the sale of the OPL Vessels and the PIH Repayments, the three were jointly and severally liable. PIH was alternatively liable as constructive trustee for the profits made from the sale of the OPL Vessels. Parakou had to elect between these remedies. (iii) Liu Por and Yang were only involved in the Six Employees’ Salary Payments. PSMPL also dishonestly assisted in this transaction. Hence C C Liu, Chik, Liu Por, Yang, and PSMPL were jointly and severally liable for S$309,377. (b) However, not all the transactions at an undervalue could be reversed. The Judge ordered the Bonus Payments and Salary Increases to be returned. However, it was too problematic to reverse the sale of the OPL Vessels given the lapse of time; hence, the Judge ordered PIH to retain the OPL Vessels but to pay Parakou the loss of profit of S$1,192,900. The transfers of the SMAs were also not reversed as they were loss-making to begin with. (c) Damages were to be assessed for two unlawful means conspiracies: one between the Directors only, and another between the Directors and PIH. 30 The Judge also awarded S$600,000 in costs to the Liquidator in a separate costs judgment,Parakou Shipping Pte Ltd (in liquidation) v Liu Cheng Chan and others[2017] SGHC 91 (“the Costs Judgment”), which the Defendants also contest.",
        "Issues": "31 There are 11 substantive issues in these appeals: (a) whether there was a genuine plan to restructure Parakou. This issue turns on whether the March 2008 Resolution was genuine and whether it was corroborated by the objective evidence; (b) whether Parakou was insolvent in November 2008. This issue turns on whether the Galsworthy Claim can be considered, and if so, how much of its value can be considered; (c) whether C C Liu was a shadow director after 31 December 2008; (d) whether Liu Por and Yang werede factodirectors before 22 December 2008; (e) whether the sale of the OPL Vessels was a transaction at an undervalue and/or a breach of the duties of the Directors; (f) whether C C Liu, Liu Por and Yang breached their duties as directors in commencing and pursuing the London Arbitration and the HK Court Proceedings; (g) whether the transfer of the SMAs to PSMPL was a breach of the duties of the Directors; (h) whether the Bonus Payments and the Salary Increases were made in breach of the duties of the Directors; (i) whether the Six Employees’ Salary Payments were made in breach of the duties of the Directors; (j) whether the PIH Set-Off was a transaction at an undervalue and/or in breach of the duties of the Directors; and (k) whether the PIH Repayments and the PSSA Repayment were in breach of the duties of the Directors. 32 Before addressing these substantive questions, we turn to a preliminary issue that arose in the course of these appeals. On 6 May 2017, before the appeals were heard, C C Liu passed away intestate. Chik applied for and was granted the administration of the estate on 15 August 2017. However, Chik has not been able to extract the letters of administration in time for the appeals. The Liquidator now contests her authority to act for the estate of C C Liu in these appeals.",
        "Chik’s authority to act for estate of C C Liu": "33 On 27 October 2017, Chik wrote to the court asking that the hearing of these appeals proceed on the basis that she had obtained the administration of the estate of C C Liu. This request was challenged by the Liquidator, who expressed concern about the enforceability of any orders made in these appeals against the assets of C C Liu abroad. The Liquidator sought an undertaking by Chik that she would apply to represent the estate of C C Liu abroad, such that any orders made by us would be enforceable there. Chik replied that the assets that the estate of C C Liu had undertaken to maintain in Singapore for the purpose of these proceedings are more than sufficient to satisfy the judgment debt on the sums ordered by the Judge. Chik undertook further to use her best endeavours to give effect to our orders in the relevant foreign jurisdictions. 34 A problem arises in this case because a personal representative has yet to be appointed and, accordingly, the estate vests in the Public Trustee. As a general rule, an administrator is clothed with the authority to deal with the estate only when the grant of letters of administration has been extracted (see the decision of this court inChay Chong Hwa and others v Seah Mary[1983–1984] SLR(R) 505 at [8]). Where such grant has not been extracted and the administrator purports to act in a suit in a capacity that he does not possess, the action is a nullity and of no effect (see the decision of this court inTeo GimTiong v Krishnasamy Pushpavathi (legal representative of the estate of Maran s/o Kannakasabai, deceased)[2014] 4 SLR 15 at [21]). Therefore, Chikprima facieis not clothed with the authority to act for the estate of C C Liu because she has yet to extract the letters of administration. 35 We did not have to decide conclusively whether the court has the power to allow Chik to represent the estate of C C Liu in these proceedings despite the objections of the Liquidator, and whether on these facts we should do so, because of Chik’s undertaking that the Liquidator accepted. In light of this undertaking, we were satisfied that Chik could represent the estate of C C Liu in these appeals, and proceeded to hear them. 36 On 8 November 2017, the day after the oral hearing, the parties tendered their agreement on the precise terms on which they had agreed to proceed with these appeals, which agreement was signed by all the parties. The material terms of the agreement are as follows: (a) First, that Chik is to represent the estate of C C Liu in all matters concerning or relating to these appeals, be bound by the Judgment below and any orders made by this court, and be bound by the undertakings furnished to the court below as well as any variation thereto. (b) Second, that Chik undertakes to apply to be the personal representative or its equivalent in any foreign jurisdiction that the estate of C C Liu has assets or an interest in, and to use her best endeavours to ensure that our orders are given effect to in such foreign jurisdiction. (c) Third, that this agreement gives Chik no authority to dispose, transfer, or otherwise deal with any asset belonging to the estate of C C Liu.",
        "Substantive issues": "37 We now set out the 11 issues in these appeals (at [31] above). For ease of reference, we provide a summary of the various grounds of appeal and our respective findings as well as decisions on them in the table below: Ground of AppealOur decision1The Defendants challenge the decision of the Judge that there was no genuine plan to restructure Parakou.Appeal dismissed. We agree with the Judge that the contemporaneous evidence shows no plan to restructure Parakou at the material time.2The Defendants challenge the decision of the Judge that Parakou had become insolvent by November 2008, which meant that they needed to consider the interests of its creditors.Appeal dismissed. We agree with the Judge that the Galsworthy Claim had to be taken into account, and that Parakou had in consequence been insolvent in November 2008.3The Defendants challenge the decision of the Judge that C C Liu was a shadow director after 31 December 2008.Appeal dismissed. We agree with the Judge that even after 31 December 2008, C C Liu remained a key decision-maker whose directions continued to be sought by Liu Por and Yang.4The Liquidator challenges the finding of the Judge that Liu Por and Yang were notde factodirectors before 22 December 2008.Appeal dismissed. We agree with the Judge that before 22 December 2008, Liu Por and Yang had been acting only within their appointments as Vice-President and President. Any additional acts on their part had been authorised by board resolutions.5The Defendants challenge the decision of the Judge that the sale of the OPL Vessels was an undervalue transaction and a breach of the fiduciary duties of the Directors.Appeal allowed. The Judge erred in assessing the value of the OPL Vessels simply by taking the mid-point of a range of values provided by an independent valuer, and in failing to consider the effect of fleet discount on the sale. Because the Liquidator takes issue only with the price at which the OPL Vessels had been sold, the question of whether the Directors had breached their fiduciary duties in approving the sale does not arise given our finding that the OPL Vessels were not sold at an undervalue.6The Liquidator challenges the decision of the Judge that the PIH Set-Off was not a breach of the fiduciary duties of the Directors.Appeal dismissed. We agree with the Judge that the PIH Set-Off was valid. The Liquidator’s case hinges on the premise that the OPL Vessels were sold at an undervalue. Given our finding that the OPL Vessels were not sold at an undervalue, we find no reason to impugn the PIH Set-Off.7The Liquidator challenges the decision of the Judge that the commencement and/or continuance of the London Arbitration and HK Court Proceedings were not breaches of the fiduciary duties of the Directors.Appeal allowed. The Judge erred in failing to consider evidence showing that a key concern of the Directors in commencing and/or continuing these proceedings was avoiding a statutory clawback period.8The Defendants challenge the decision of the Judge that the Bonus Payments and Salary Increases were undervalue transactions and were made in breach of the fiduciary duties of the Directors.Appeal dismissed. We agree with the Judge that Parakou was not obliged to make these payments and received no consideration for them. Moreover, unlike what the Directors claim, Parakou was not making a profit.9The Defendants challenge the decision of the Judge that the PIH Repayments and PSSA Repayment were made in breach of the fiduciary duties of the Directors.Appeal dismissed. We agree with the Judge that there was no legitimate reason for Parakou to make the repayments.10The Defendants challenge the decision of the Judge that the Six Employees’ Salary Payments were in made breach of the fiduciary duties of the Directors.Appeal dismissed. We agree with the Judge that the six employees no longer worked for Parakou, or at the very least, also worked for PSMPL, at the time when Parakou made the Six Employees’ Salary Payments.11The Liquidator appeals against the decision of the Judge that the transfer of the SMAs from Parakou to PSMPL was not a breach of the fiduciary duties of the Directors because the Ship Management Business had been making losses.Appeal dismissed. We agree with the Judge that the transfer of the SMAs was not a breach of the fiduciary duties of the Directors because the Ship Management Business had been making losses. We now turn to elaborate on the reasons for the decisions summarised in the above table.",
        "Issue 1: Restructuring plan": "38 The Defendants challenge the finding of the Judge that there was no genuine plan to restructure Parakou in March 2008 on the basis that the Judge neglected to consider the following events: (a) first, that Parakou had sold off three vessels (theGolden Express,Golden Lily, andGolden Aruna) to unrelated parties between June 2008 and November 2008, which sales were independent of the sale of the OPL Vessels to PIH in November 2008; and (b) second, that C C Liu and Chik had discussed the restructuring of Parakou with its auditors in January 2008 or February 2008, which was before the date of the March 2008 Resolution. 39 We do not accept these arguments. First, the sale of three vessels to unrelated parties is not inconsistent with the absence of a plan to restructure Parakou. This is because the sale of the three vessels between June 2008 and November 2008 does not explain the haste with which the OPL Vessels were sold to PIH in November 2008. Second, the evidence does not bear out the claim of the Defendants that C C Liu and Chik had discussed the restructuring of Parakou with its auditors before the March 2008 Resolution was allegedly passed. The evidence of the auditor, Mr David Yeung, on which the Defendants rely in support of this claim, reveals only a plan for C C Liu and Chik to transfer their shares (and possibly their directorships) in Parakou to their son. It does not demonstrate any intention to jettison certain parts of the business of Parakou, which was what in fact transpired, allegedly pursuant to a restructuring plan. This evidence of the auditor is as follows: Q: … You had a discussion with Mr Liu and Mrs Chik about a restructuring that they were contemplating of Parakou Shipping Singapore? … A: I had a casual discussion with Mr Liu Por [sic] and Mdm Chik about theirtransferring the shares to their son. That is what I understand by restructuring. They did not talk to me about any business plan. They discussed wanting to transfer to their sons.The son was not at the meeting. Just Mr Liu and me. … Q: But you are a liquidator, doesn’t restructuring involve a re-organisation of the liabilities of the company? … A: No, restructuring can mean a number of things. The word restructuring was not used in our discussion with Mr Liu. It can mean many things. Transfer of shares to son is restructuring as the share holding change. When I talk to Mr and Mrs Liu, I also talked about share transfer and possible transfer of directorship. [emphasis added] 40 In any event, we agree with the Judge that the March 2008 Resolution, which is the only documentary evidence of the alleged restructuring, was an afterthought. It was only produced in 2009 under suspicious circumstances and lacked several crucial details about the alleged restructuring plan (see the Judgment at [43]–[55]). 41 Accordingly, we affirm the finding of the Judge that there was no genuine plan to restructure Parakou in March 2008.",
        "Issue 2: Galsworthy Claim and insolvency of Parakou in November 2008": "42 This point was not discussed extensively in the oral hearing before us and we propose to address it briefly. Essentially, the Directors argue that the Judge wrongly took into account the Galsworthy Claim in finding that Parakou was insolvent as it was only a contingent interest. Alternatively, the Directors argue that even if the Judge was correct in taking into account the Galsworthy Claim, the amount considered should not be the full sum claimed by Galsworthy, but only the S$3,000,000 that Liu Por and Yang had offered in settlement. 43 We dismiss this ground of appeal and affirm the Judge’s finding. The basis for the Directors’ appeal is that, as of November 2008, the charterparty did not exist and therefore could not be taken into account. This ignores the Judge’s factual finding that although there was no signed charterparty, the other objective evidence demonstrated that the Directors knew that they had entered into a binding charterparty with Galsworthy (see the Judgment at [80]). The Directors did not appeal against this factual finding and are therefore bound by it. 44 We also reject the Directors’ submission that only the settlement figure should be considered for two reasons. First, allowing the Directors themselves to determine the value of a claim using a settlement sum is inherently self-serving, as the Liquidator correctly suggests. The Directors rely on a passage in an English High Court decision,BTI 2014 LLC v Sequana SA and others[2016] EWHC 1686 (Ch) at [330], for the proposition that the question of how much a contingent claim should be taken into account was “a questionto be posed by the directors to themselvesconsidering the nature of the contingent and prospective liabilities” [emphasis added]. However, that case was decided in an entirely different context. The issue in that case concerned the interpretation of s 643(1)(a) of the relevant companies legislation, which required the directors to make a solvency statement abouttheir opinionof the company’s solvency. Thus the court applied a subjective test. The question in this case is an objective assessment of how much of the Galsworthy Claim should be taken into account for the purposes of assessing whether Parakou was insolvent. The two are entirely different. Hence, the Directors cannot rely on their subjective quantification of the Galsworthy Claim as a basis for the court’s assessment. We pause to note, parenthetically, that even a subjective test cannot furnish a licence for mere personal assertions which, if they are to persuade the court, must (as far as it is possible) be undergirded by the relevant objective evidence. 45 Second, the objective evidence appears to indicate that the Directors anticipated a claim larger than S$3,000,000. Both the Liquidator and the Judge relied on an email dated 19 November 2008 from Andy Ng to Rajah & Tann (the Directors’ then-lawyers) which noted that the Directors had anticipated a “big claim” and which reads as follows: Dear Chon Beng [ie, one of the lawyers from Rajah & Tann], Thanks for your comment. I discuss with Por for a while and we come up to some of the questions. 1. We also have a loan of USD 2M from a related company (with the common directors) registered in Panama. Is it possible for us to use the proceeds to repay it? Any difference between repay to this related company and repay to director? 2. Is it possible for the existing ship management company to operation until next April (which we expect the big claim may come) to use up the proceeds? Because currently we are making loss on the ship management. 3. When will you be available to have a meeting to discuss it in more detail? Can we make it this evening or tomorrow morning? Tks. The Judge found that this “big claim” referred to the Galsworthy Claim (see Judgment at [81]). 46 We note that there is nothing in the Judgment or the evidence that suggests what precisely the quantification of this “big claim” might be, or whether it was more than S$3,000,000. However, the Directors, as the party asserting that the Galsworthy Claim was only worth S$3,000,000, bear the burden of proving that fact. Without further evidence, we find that the objective evidence contradicts the Directors’ assertion that the Galsworthy Claim was only worth S$3,000,000. 47 Accordingly, we also dismiss this particular ground of appeal. We affirm the Judge’s finding that Parakou was insolvent as of November 2008; hence, the Directors had to consider the creditors’ interests in making their respective decisions.",
        "Issues 3 and 4: C C Liu as shadow director; Liu Por and Yang asde factodirectors": "48 We deal with Issues 3 and 4 together as they pertain to similar issues as to whether persons not formally appointed as directors could still be considered directors for the purposes of liability. (a) Issue 3: The Judge found that C C Liu was a shadow director after 31 December 2008. The Directors appeal against this finding on the basis that C C Liu’s apparent involvement was explained by his role as a patriarch in the family business. (b) Issue 4: The Judge found that Liu Por and Yang were notde factodirectors before 22 December 2008. The Liquidator appeals against this finding on the basis that they were responsible for Parakou’s management and day-to-day operations even before 22 December 2008. This included a wide discretion to sell the OPL Vessels, to make the PIH Repayments and PSSA Repayment and the PIH Set-Off, as well as to sign off on charterparties. 49 For Issue 3, we affirm the Judge’s finding that C C Liu was a shadow director even after 31 December 2008. We agree with the test adopted by the Judge, that what is needed is a “discernable pattern of compliance” and occasional departures from the pattern would not detract from this finding (see the Singapore High Court decision ofRaffles Town Club Pte Ltdv Lim Eng Hock Peter and others (Tung Yu-Lien Margaret and others, third parties)[2010] SGHC 163 (“Raffles Town Club”) at [45], cited in the Judgment at [34]). Although the Directors insist that C C Liu was merely a patriarch, there is no reason why being a patriarch and a shadow director should be mutually exclusive. Indeed, the fact that C C Liu was a patriarch suggests that he had the necessary influence that a shadow director requires. The evidence also suggests that C C Liu had, in fact, such influence: (a) C C Liu admitted to instructing the other Directors on some matters such as appointing a lawyer to represent Parakou, and confirmed that he had “certain influence” over Parakou (see the Judgment at [35]). (b) Du Hong (“Du”), Parakou’s senior manager, had asked the “bosses” (including C C Liu) to instruct him how to proceed. In an email dated 14 April 2010 – long after C C Liu stepped down formally – Du asked C C Liu for instructions on how to reply to one Zhong Zu about a long-term vessel charter: Chairman Liu, Mr Liu Hai, Please find below my email report dated 29 March. I have not received instructions about it from the company. Zhong Zu has been enquiring about our company’s response. May I trouble the bosses to clearly instruct me on how to respond? Thank you. These instances cited in the Judgment show that, contrary to the Directors’ submissions, C C Liu indeed played more than an advisory role in Parakou. 50 For Issue 4, we also affirm the Judge’s finding that Liu Por and Yang were notde factodirectors prior to 22 December 2008. Liu Por and Yang were the Vice-President and President of Parakou from 2006; and, where necessary, it appears that they were given wide authority to deal with the company’s various affairs. For instance, the directors passed a resolution on 14 November 2008 appointing Liu Por and Yang as Parakou’s “attorneys” to “[act] for and on behalf and in the name of [Parakou] to do the following acts, matters, deeds or things, mentioned in the [Power of Attorney]”. It also deemed “good, valid and effectual” all documents and matters agreed or signed by Liu Por and Yang as if they were agreed or signed by Parakou. The Power of Attorney encompassed a comprehensive list of dealings that could be made in relation to the OPL Vessels. The Directors also referred the court to other documents whereby Liu Por and Yang were authorised to perform routine tasks such as selling lorries. We find that since Liu Por and Yang had been authorised every step of the way, this is a sufficient explanation of their authority to deal with third parties in relation to Parakou’s assets. 51 In coming to this finding, we reject the Liquidator’s submission that Liu Por and Yang werede factodirectors simply by virtue of their wide mandate. The question to be asked is not how wide their mandate was, but whether they stood on the same footing as the other directors (seeRaffles Town Clubat [58]). Liu Por and Yang clearly did not stand on the same footing as a director if they had to be authorised by a resolution of the board of Parakou before acting. 52 Accordingly, we dismiss the appeals against the Judge’s findings in Issues 3 and 4.",
        "Issue 5: Sale of the OPL Vessels": "53 The Judge held that the OPL Vessels had been sold at an undervalue of S$1,192,900. Amsbach Marine (S) Pte Ltd (“Amsbach”), an independent valuer commissioned by the Defendants, estimated the gross sale price of the OPL Vessels to be S$9,906,000–S$12,291,000. This range was not disputed by the parties, and the Judge accepted the evidence of the Liquidator’s expert that a transaction at arm’s length would have closed at the mid-point of this range,viz, S$11,098,500. The difference between S$11,098,500 and the actual sale price of the OPL Vessels, S$9,905,600, was S$1,192,900 (see the Judgment at [95]–[99]). 54 The Defendants submit that it is wrong to use the mid-point of the Amsbach valuation range as the true sale price of the OPL Vessels. The OPL Vessels had been sold not individually but as a fleet. Hence, a fleet discount of 5–10% (and possibly as high as 15–20%) should apply. The Directors further point out that the Liquidator had confined his case on the sale of the OPL Vessels to thevalueof such sale, and did not challenge the decision to sell or the process of the sale itself. 55 The Liquidator responds by submitting that the Court should look not only at the sale price but also at the process through which that price was obtained. The Directors breached their duties because they rushed the sale of the OPL Vessels, and could have obtained a higher price if they had taken greater care in conducting the sale. 56 On balance, we are unable to conclude that the OPL Vessels were sold at an undervalue. Let us elaborate. 57 At the outset, we agree with the Defendants that the Liquidator confined his case to the saleprice(or value) of the OPL Vessels, and did not take issue with either the decision to sell or the process of the sale. This was confirmed on multiple occasions at trial by counsel for the Liquidator, Mr Edwin Tong SC (“Mr Tong”), as well as by the Liquidator himself, Mr Cameron Duncan (“Mr Duncan”). We illustrate as follows: (a) First, an exchange between then-counsel for C C Liu and Chik, Mr Lawrence Tan (“Mr Tan”), Mr Tong, and the Judge: COURT: Mr Tan -- and Mr Tong, please tell me if I have misunderstood your claim -- the claim is for sale at an undervalue, that’s all it is, and the only issue I have to deal with is whether it is undervalued. The profitability of that business will affect the value, I accept that. But the claim is that it’s undervalued sale. That’s all. In other words,I do not have to decide whether they were right or wrong to sell, I just have to decide whether the value was correct. Mr Tan: Grateful, your Honour. Could I just double confirm with my learned friend. That is your position only for this item? Mr Tong:Our claim is that the vessels were sold at an undervalue at the time they were sold, andthat’s our claim. [emphasis added] (b) Second, the cross-examination of the Liquidator by Mr Siraj Omar (“Mr Omar”): Mr Omar: We’ll move on to the sale of the OPL [V]essels. Your objection to the sale or your sole objection to the sale is to the fact that it was carried out at an undervalue, correct? Liquidator: Correct. … Mr Omar: Let me take you to paragraph 88 of your statement of claim … “As a result of the 3rd and 4th defendants’ breaches of duties owed to the plaintiff, the plaintiff has suffered loss and damage.” First is the sum of approximately 2.263 million and that is based on the fact that the sale was carried out but not at the correct price that you say, correct? Liquidator: Correct. Mr Omar: Then you ask for the loss of profits which the plaintiff would otherwise have received, correct? Liquidator: Correct, for the undervalue transaction. Mr Omar: Are they not inconsistent? If you are claiming for loss of profits, are you not contesting, or are you not saying that the vessels ought not to have been sold and that the plaintiff has suffered a loss in terms of the loss of profits as a result of the vessel being sold? Liquidator: No, we’re claiming the difference between what the plaintiff should have received if a proper transaction had occurred and what was actually received. Mr Omar: So this claim for loss of profits is not something you are pursuing, correct? Liquidator: We’re claiming the difference which is a loss on profit that they would have made on the sale of the vessel. Mr Omar: So, Mr Duncan, just to be clear, what you are seeking is really the sum of [S]$2,623,900? That is all you are seeking right? Liquidator: Correct, along with the other heads of claims. Mr Omar: In relation to the OPL [V]essels, your only claim is in relation to -- or is for a sum of [S]$2,263,900, correct? Liquidator: For the sale of the OPL [V]essels, yes. (c) Third, the cross-examination of the Liquidator by Mr Sim Chong (“Mr Sim”): Mr Sim: Next, you say that the sale process was concluded in an exceptionally short period of time. Let’s take this step-by-step. Your claim is that the sale of the OPL [V]essels was an undervalue transaction, correct? Liquidator: Correct. Mr Sim: We’re all clear on that, that’s your claim in relation to the OPL [V]essels. Your counsel has confirmed that in open court and you have confirmed that in open court, that your claim for the OPL [V]essels -- Judge: All right, all right, so many people have confirmed. Can we get on? 58 Having so emphatically confined his case to the value of the sale of the OPL Vessels, the Liquidator cannot now be allowed to resile from his case. Indeed, before us, the Liquidator did not make any submission to the contrary. Accordingly, we will evaluate only the price or value of the sale of the OPL Vessels, and not the defensibility of the decision to sell. 59 Comparing the value of the OPL Vessels with the consideration received by Parakou from their sale, we are, with respect, unable to agree with the Judge that the sale was at an undervalue. The expert for the Liquidator, Mr Michael Meade (“Mr Meade”), does not deny that the sale price of the OPL Vessels falls within the Amsbach valuation range. It is thus unclear to us why the Judge used a single point within that range, rather than the entire range of S$9,906,000–S$12,291,000 and all the points therein, to represent the value of the OPL Vessels. Big-ticket items such as the OPL Vessels can fetch a range of prices, as both Amsbach and Mr Meade acknowledge. Accordingly, as long as the consideration received by Parakou from the sale of the OPL Vessels falls within such range, such consideration cannot be “significantly less” than the value of the OPL Vessels for the purpose of s 98(3)(c) of the Bankruptcy Act read with s 329 of the Companies Act. Further, even if the value of the OPL Vessels could be represented by a single value within the Amsbach valuation range, there is little reason why the mid-point value should be taken as the value that parties at arm’s length negotiations would have arrived at. The only evidence in support of such a conclusion was a bare contention by Mr Meade to that effect. However, Mr Meade made two important concessions that limit the value of this evidence. First, he admitted that the estimate was made without reference to the OPL industry or the OPL Vessels in this case specifically, but purely on his general understanding of buyer-seller relationships. Second, he accepted that even parties with equal bargaining powers may not agree on a sale and purchase price at the exact mid-point of a valuation range. 60 Since Mr Meade’s range was only based on what he called a “prima facie” view, the Judge should, with respect, have determined which point on that range should be taken with reference to the specific facts of this case, and not simply have taken the mid-point value without more. 61 In contrast, as the Directors suggest, it is more likely that a lower point on Mr Meade’s range should have been taken. When queried on the market conditions for the sale of such vessels at the material time, the parties could only refer to the fact that the OPL Vessels had been sold as a fleet, which would require a fleet discount. Mr Meade conceded that such discount existed during cross-examination. He initially noted that a 5–10% discount was sufficient, but when pressed by the Directors’ counsel, agreed that it was “possible” that such discount would reach 15–20%. 62 As the Judge noted, the Amsbach valuation range of S$9,906,000–S$12,291,000 was calculated by aggregating the value of all the OPL Vessels (see the Judgment at [97]). It did not take into account any fleet discount. Applying even the smallest fleet discount accepted by Mr Meade (ie, 5%) to the Amsbach valuation range gives a range of S$9,410,700–S$11,676,450. The gross sale price of S$9,905,600 falls within this range. Accordingly, the sale of the OPL Vessels cannot have been an undervalue transaction for the purpose of statutory clawback because the gross sale price of S$9,905,600 was not “significantly less” than the value of the OPL Vessels. This does not mean that the OPL Vessels were sold at the best price or even at a good price. We agree with the Judge that the sale of the OPL Vessels was at least somewhat rushed (see the Judgment at [99]), and accept that a better price could have been realised with more diligence. But that is not the inquiry here. The only question is whether the consideration received by Parakou was “significantly less” than the value of the OPL Vessels. On the evidence, it was not. 63 We turn now to the question of whether the sale of the OPL Vessels was nevertheless a breach of the fiduciary duties of the Directors. The Liquidator has confined his objections to the value or price of the sale, and has abstained from challenging the fact of the sale (see above at [57]–[58]). Given the limited fashion in which the Liquidator has chosen to run his case, we are unable to find that the OPL Vessels were sold in breach of the fiduciary duties of the Directors. 64 Accordingly, we find that the OPL Vessels were not sold at an undervalue and that the Directors did not breach their duties in approving such sale, and allow the Defendants’ appeal to this extent.",
        "Issue 6: PIH Set-Off": "65 The Judge held that the PIH Set-Off of S$1,732,239 did not amount to a preference in favour of PIH because it did not improve the position of PIH in the event of the liquidation of Parakou. Pursuant to s 327(2) of the Companies Act read with s 88 of the Bankruptcy Act, mutual debts between Parakou and its creditors were automatically set off. Accordingly, Parakou was entitled to set off its debt to PIH in respect of charter hire against the debt which PIH owed to it for the purchase of the OPL Vessels (“the PIH Debt”). Where such statutory set-off is available, any prior agreement for set-off cannot be a void preference. Further, the availability of such a statutory set-off to Parakou meant that the PIH Set-Off could not have been contrary to the interests of the creditors of Parakou (see the Judgment at [125]–[126]). 66 The Liquidator accepts that the PIH Set-Off was not an undue preference under s 329 of the Companies Act read with s 99(3)(b) of the Bankruptcy Act because it took place outside the relevant clawback period of two years. Nevertheless, the Liquidator argues in his Case that the PIH Set-Off was a preference made in breach of the fiduciary duties of the Directors because statutory set-off was not availablevis-à-visthe PIH Debt. The PIH Debt was a “direct result of the sale of the OPL [V]essels at an undervalue, in blatant breach of the Directors’ fiduciary duties, and with the dishonest assistance / knowing receipt of PIH”. In other words, the PIH Debt “would not have arisen … if the Defendants had not acted dishonestly”. Tainted by the misfeasance of the Directors, the PIH Debt could not ground a statutory set-off, which has at its core “a principle of equity and justice/fairness”. 67 We agree with the Liquidator that as a general rule, statutory set-off is not available when the debt owed by the counterparty to the debtor is based on the misfeasance or other wrongdoing by the counterparty. As observed in Roy Goode,Principles of Corporate Insolvency Law(Sweet & Maxwell, 4th Ed, 2011) at para 9-29: The [counterparty] creditor cannot escape from the consequences of a misfeasance or other wrongdoing for which the company is making a claim by invoking a right of set-off against the claim. So the creditor cannot set off the debt owed to him by the company in liquidation against a claim by the company by way of misfeasance proceedings for the recovery of misappropriated funds or for damages for conversion or recovery of a sum paid to him by way of a voidable preference or settlement. Any other conclusion would enable the wrongdoer to benefit from his wrongdoing by recovery through set-off instead of having to prove in the winding up in competition with other creditors. 68 Nevertheless, the sole ground of appeal by the Liquidator in respect of the PIH Set-Off is that the PIH Debt arose as a “direct result of undervalue sale of the OPL Vessels” from Parakou to PIH, which sale was also in breach of the fiduciary duties of the Directors. Given our finding that the sale of the OPL Vessels was neither a transaction at an undervalue nor a breach of the fiduciary duties of the Directors (see [62]–[63] above), it follows that the PIH Debt arose legitimately. Statutory set-off thus remained available to PIH in respect of the PIH Debt. The PIH Set-Off pursuant to such entitlement must therefore be valid. 69 Further, even if the OPL Vessels had been sold at an undervalue, the PIH Debt would still have arisen. The only difference would be that the quantum of the PIH Debt, and consequently the amount that should have been set off against the debt owing from Parakou to PIH, would have been higher to the extent of the undervalue. This would not preclude PIH from setting off the S$1,732,239 outstanding on the price payable by it to Parakou for the OPL Vessels (ie, the PIH Debt) from the monies that Parakou otherwise owed to it. 70 In this particular regard, the decision of the English Court of Appeal inInre a Debtor (No 82 of 1926)[1927] Ch 410 is instructive. In that case, the provisional liquidator of an insolvent company paid to a director of the company an amount that was owing to the director in preference to the other creditors of the company. This payment was subsequently held to be void as a fraudulent preference, with the director liable to repay the moneys. As Clauson J explained in his concurring judgment (at 419–420), the amount of a debt to which a creditor is prevented from having recourse as a statutory set-off is the amount of the debt that he has wrongly received: If a creditor of a company receives payment of the sum due to him in such circumstances that the payment amounts to a fraudulent preference, the position is that he has no right to receive his debt in full, but has a right only to be paid a dividend on his debt pari passu with the other creditors: the decision of the Court, in a winding up subsequently supervening, that the payment to him was a fraudulent preference, must necessarily amount to a decision that he had no right to receive his debt in full, but had a right only, in the circumstances, to claim pari passu with the other creditors. It would be anabsurdityif the appellant were entitled toset off, against theclaim of the liquidator for themoney which he wrongly receivedin full, aclaim to be paid under his judgment an equivalent amountas a debt. The most that the appellant can be entitled to is to rank pari passu with the other creditors. [emphasis added in italics and bold italics] 71 We note the suggestion raised by the Liquidator belatedly in oral submissions that the PIH Set-Off should be impugned if any of the transactions between Parakou and PIH, particularly the PIH Repayments (at [107]–[112] below), were tainted by the misfeasance of the Directors and/or PIH. We do not accept this suggestion. As the Liquidator admits in his Case, the subject of the PIH Set-Off (ie, the PIH Debt) is attributablepurelyto the sale of the OPL Vessels. The PIH Repayments simply occurred in the “same context and time period”, and did not form the subject of the PIH Set-Off. As the Liquidator put it in his Case: First, the PIH Set-Off occurred in the same context and time period as the (wrongful) PIH and PSSA repayments. All of the repayments/set-off (totaling S$ 14m) were hurriedly made in the mere span of 5 weeks and in the midst of other disposals. These were not arm’s-length commercial transactions, but dishonest payments meant to defraud creditors. Second,the debt owing by PIH (which was the subject of the PIH Set-Off) was a direct result of the sale ofOPL Vesselsat an undervalue, in blatant breach of the Directors’ fiduciary duties, and with the dishonest assistance / knowing receipt of PIH … [emphasis added; emphasis in original omitted] 72 Accordingly, we uphold the finding of the Judge that the PIH Set-Off was valid.",
        "Issue 7: London Arbitration and HK Court Proceedings": "73 The Judge found that the Directors did not breach their duties in commencing and continuing the Legal Proceedings (ie, the London Arbitration and the HK Court Proceedings). He based his decision primarily on the concession by Liu Por and Yang in the London Arbitration that led to the First Award in August 2010, which was before the clawback period for challenging the Disputed Transactions expired in December 2010. He thus concluded that the Directors had commenced and continued these Legal Proceedings to incentivise Galsworthy to negotiate a settlement with it (see the Judgment at [142]). 74 The Liquidator challenges this finding on the basis that the Legal Proceedings were hopeless, and that C C Liu, Liu Por, and Yang knew as much but continued to protract the Legal Proceedings until the clawback period had expired in December 2010. Although the concession by Liu Por and Yang in the London Arbitration led to the First Award, such finding on liability would have been made in any case. Moreover, the sum conceded was but a small fraction compared to the sum eventually awarded to Galsworthy under the Second Award. The strategy of the Directors has to be looked at in its totality, and the evidence demonstrates that the Directors had their eyes fixed firmly on the expiry of the clawback period. 75 The Defendants resist the appeal on substantially the same grounds as those relied upon by the Judge. They emphasise that there was no reason for the Directors to make the concession before the clawback period expired if they were truly concerned about a potential clawback. 76 As a preliminary point, the parties (as well as the Judge) dealt with the London Arbitration and the HK Court Proceedings together. They also treated the two parts to the London Arbitration, which led respectively to the First Award and the Second Award, together. We therefore examine the Legal Proceedings as a composite whole. 77 We agree with the Liquidator that the Directors had breached their duties in commencing and continuing the Legal Proceedings for three reasons, which we will examine in detail below. First, the primary purpose of the Directors in commencing and continuing the Legal Proceedings was to avoid the clawback period. Second, this is not diminished by the concession by Liu Por and Yang in the London Arbitration, which led to the First Award. Third, given the quantum of the fees and costs incurred thereby, the Legal Proceedings were not in the interests of the creditors of Parakou. For completeness, although it is possible that the Directors could have had different intentions for the different proceedings at different points in time, this was not the Directors’ case. We therefore deal with the London Arbitration and the HK Court Proceedings together. 78 All of the Disputed Transactions took place by December 2008. The two-year clawback period for undue preference claims thus expired in December 2010. Parakou was eventually wound up in 2011. The Defendants do not deny that the Liquidator would have been able to lay claim to the Disputed Transactions as undue preferences but for the fact that they took place outside the clawback period (see the Judgment at [136]). Against this backdrop, the behaviour of the Directors in the days in and leading up to December 2010 assumes great importance. 79 In January 2009, the Directors wrote to the English counsel for Parakou, Mr Luke Parsons QC (“Parsons QC”), who advised unequivocally that Parakou would fail in the London Arbitration. The Directors asked him to reconsider his advice. On 3 February 2009, however, Parsons QC re-affirmed his view that “Parakou will face severe difficulties” in defending the London Arbitration. Nevertheless, the Directors continued with their defence of the London Arbitration. 80 In June 2009, Parakou commenced the HK Court Proceedings claiming damages and/or an indemnity in respect of any liability to which Parakou could have been exposed in the London Arbitration. At that time, Hong Kong counsel for Parakou noted his understanding that Parakou might be able to “hold off winding up proceedings in Singapore on the basis of a pending appeal in Hong Kong” (see the Judgment at [22]–[23], and [136(e)]). Clearly, the Directors commenced the HK Court Proceedings with the knowledge that it would affect potential winding-up proceedings against Parakou in Singapore. 81 By September 2010, any obstacles to potential winding-up proceedings appear to have fallen away. The First Award was made on 31 August 2010. On 22 September 2010, Parakou’s claim in the HK Court Proceedings was struck out on the basis that it was a collateral attack on the outcome of the London Arbitration and therefore an abuse of process. Parakou was left with the London Arbitration which, it should be recalled, Parsons QC noted that Parakou would face “severe difficulties” in defending (see the Judgment at [24]–[27] as well as above at [79]). 82 Parakou began corresponding with its opponents in the HK Court Proceedings about fixing dates for a possible appeal against the striking-out of this claim. If such appeal were heard and dismissed, that would bring an end to the HK Court Proceedings, which could affect the commencement of winding-up proceedings in Singapore. Hence, if the Liquidator was right that the Directors were focused on the expiry of the clawback period, then it would not have been in the Directors’ interests for the appeal in the HK Court Proceedings to be heard and dismissed before the clawback period expired. 83 The evidence indeed demonstrates that the Directors attempted to delay fixing the appeal date to December 2010. (a) On 23 November 2010, Hong Kong counsel for Parakou, Belinda Yan, sought the instructions of then-Singapore counsel for Parakou, Werner Tsu, as to “whether to take steps to procure the fixing of a hearing date for the appeal [in the HK Court Proceedings]”. (b) On the same day, Werner Tsu replied to suggest that the appeal be fixedin 2011rather than in 2010 as follows: Dear Belinda and Mary, When do you expect the CA to fix the hearing date? If it will certainly be sometime next year, then please proceed to do so. This was further confirmed by a follow-up email that Belinda Yan sent to Werner Tsu a few hours later: Dear Werner Thanks for your email. Mr. Justice Tang indicated at last Monday’s hearing that he had ascertained that our appeal is unlikely to be heard until about April next year. This corresponds with the information we have previously obtained from the Deputy Clerk of Court (Appeals). Although there is still a possibility that 2010 dates may become available at the time we fix the appeal date as appeal hearings of other cases are from time to time withdrawn. We should know better when our clerk attends the Court to fix the hearing date in consultation with Counsel’s diary. (c) Noting the possibility that the appeal could still be fixed in 2010, Werner Tsu emphasised that an appeal date should only be sought if it were in 2011: Appeal date – If we are not certain that the appeal will be fixed for next year, then please do NOT attempt to get an appeal date just yet. (d) The next day, 24 November 2010, Belinda Yan replied seeking further instructions from Werner Tsu: As for the appeal date, we note your concern not to have the appeal fixed for this year. However, given that we are approaching the end of the year and the fact that we are requesting to fix the hearing date in consultation with counsel’s diary, it is very unlikely that we will get a hearing date in December this year. Should the clients still wish us to hold off from getting an appeal date for now, we would of course defer liaising with Barlows [ie, the other party to the HK Court Proceedings] until mid December. (e) Werner Tsu then replied: “Please defer till mid-December”. 84 Werner Tsu was clearly alarmed at the prospect of an appeal date in December 2010: a date potentially within the two-year clawback period. He thus instructed Belinda Yan, on behalf of the Directors, to defer liaising with the other party to the HK Court Proceedings in relation to fixing an appeal date until mid-December 2010. 85 The significance of mid-December 2010 is not explicit in the above emails and neither is the concern relating to the clawback period. However, an email by Werner Tsu to Liu Por and Yang on 13 December 2010 makes it plain that their focus was on the clawback period. We set out the relevant parts of the email as follows: Dear Por and Mr. Yang, 1. Please see attached email from Hammonds. As 5 December 2008 was the date US$2 million was repaid by Parakou Shipping Pte Ltd to Parakou Shipping S.A. [ie, PSSA],the 2year clawback period is over. The fixing of the HK appeal anytime from now onwards is all right for us. … 3. Winding-up searches –we have been conducting 2searches per week. We would advise that this be reduced to 1 search per week– do you agree?Please ensure that Parakou Shipping’s bank account does not contain a lot of cash.With the partial award, Galsworthy is able to get a garnishee order from the Singapore courts to take the funds from that account. 4. It may be time to have a meeting todiscuss your strategy going forward? [emphasis added] 86 This email is significant in three respects. First, it makes express what was only implied in the previous emails to Belinda Yan (in which delicacy was obviously required): that the fixing of the appeal for the HK Court Proceedings hinged on whether the two-year clawback period had expired. Given that Hong Kong counsel for Parakou was also very much aware that the appeal process for these court proceedings would be able to delay a winding up in Singapore (see above at [80]), it is clear that the strategy of the Directors up until then was to delay the proceedings sufficiently until the clawback period had expired. 87 Second, this conclusion is confirmed by the statement by Werner Tsu at para 4 of his email (above at [85]), where he notes that it may be time to “discuss [the Directors’] strategygoingforward” [emphasis added], indicating that by 13 December 2010, their previous strategy would have come to fruition and that it would then be time to discuss a new strategy. This buttresses the conclusion that the object of the strategy was to avoid the two-year clawback period. 88 Third, Werner Tsu also recommended in para 3 of his email (above at [85]) that winding-up searches should be reduced from two per week to one per week. Clearly, the searches were conducted because the Directors were concerned that before the clawback period expired there would be winding-up applications that would derail their strategy. Once the clawback period had expired, these searches would no longer be as important. 89 Based on the clear intention expressed in these emails, we find that the strategy of the Directors in the HK Court Proceedings was not, as the Judge found, primarily to negotiate a settlement with Galsworthy (see the Judgment at [142]). While that may have been a concern at the back of their minds, the Directors’ primary concern was always to avoid the clawback period. To do so was not in the creditors’ interests and therefore in breach of directors’ duties. Although we note that these emails only pertain to the HK Court Proceedings, we have explained earlier that the Judge and the parties were content to treat the HK Court Proceedings and the London Arbitration as two integral parts of the same strategy executed by the Directors. Hence, it follows that both the London Arbitration and the HK Court Proceedings were commenced and/or continued in breach of these duties. 90 We turn now to explain why we arrived at this conclusion despite the concession by Liu Por and Yang in the London Arbitration that led to the First Award. The Judge had reasoned that there was no reason for Liu Por and Yang to make the admission that led to the First Award in August 2010 if their objective was to prevent any winding-up application from being made before December 2010 (see the Judgment at [142]). We accept that, at first blush, the concession appears to go against the grain of the strategy of the Directors to delay any proceedings until after December 2010. However, we find that the concession does not affect our conclusion for two reasons. 91 First, it is unclear whether Liu Por and Yang truly intended to make a concession that would allow Galsworthy to claim a partial sum and entice it to enter into a negotiated settlement. In the email by Werner Tsu on 13 December 2010 to Liu Por and Yang, he advised them to “ensure that [Parakou’s] bank account does not contain a lot of cash” because “[w]ith the partial award [ie, the First Award], Galsworthy [would be] able to get a garnishee order from the Singapore courts to take the funds from that account” (see above at [85]). This suggests that Liu Por and Yang may have wished to minimise the impact of the First Award even after the concession had been made. 92 Second, even if the First Award were truly a concession directed at enticing Galsworthy into a settlement, this was unlikelyto have been the Directors’primarypurpose. The First Award was only for US$2,673,279 (a much smaller sum compared to the further damages of US$38,579,000 in the Second Award) and only decided the preliminary issue of whether there was a binding charterparty between Parakou and Galsworthy. As the Judge himself noted on the evidence before him, “the objective contemporaneous evidence overwhelmingly proves” that there was a charterparty between Parakou and Galsworthy (see the Judgment at [80]). Hence, it would appear that the concession did not affect the overall objective of avoiding the clawback period as much as might initially appear. The concession would have to be weighed against the evidence that the Directors clearly had in the forefront of their minds the expiry of the clawback period. Balancing the two, we find that the Directors’primarypurpose of commencing and continuing the proceedings was to avoid the clawback period. This is borne out in an email by Liu Por to Werner Tsu on 2 September 2010, in which he appears to suggest that US$2,673,279 was “a very small figure”, and observes that Parakou was arguing the HK Court Proceedings just to “buy us time”. We set out the relevant parts of this email as follows: Dear Werner: Yours well noted with thanks! As a matter of fact, I would like you to go to HK rather than Luke [Parsons QC]. Therefore, please save your time for me, thanks! By the way, on quantum point, I thinkwe should stick to 2.6M, any otheradded quantum are not likely to be accepted by me, unless it is a very small figure.Anyway, are we just arguing it to buy us time?Thanks! Por [emphasis added in italics and bold italics] 93 Finally, apart from the emails, which demonstrate that the Directors were concerned primarily with the expiring clawback period, we also note thatthe amount of legal costs incurredalso suggests that the proceedings were not in the creditors’ best interests. Parakou had incurred S$6,223,238 in legal fees for both proceedings (see Judgment at [28]), which was far above the US$3,000,000 that Liu Por and Yang thought the Galsworthy Claim was worth (as they had offered Galsworthy a settlement proposal of US$3,000,000). Incurring this sum in legal costs to force a settlement forhalfthe sum ofthe legal costsis unlikely to be in the creditors’ best interests because, even if the settlement were reached, the effective amount taken to have reached the settlement would bethree timeswhat the Directors themselves valued the claim at. It is especially difficult to believe that the Directors considered this in the creditors’ best interests because of the large gulf between their settlement sum of US$3,000,000 and Galsworthy’s claim of some US$41,100,000, which must have suggested to the Directors that Galsworthy was unlikely to accept a settlement anywhere near the proposed settlement sum. 94 Accordingly, we allow the appeal on this particular issue. We find that the Judge, with respect, erred in finding that the commencement and continuance of the London Arbitration and the HK Court Proceedings were not breaches of directors’ duties. 95 We add that we are disturbed by Werner Tsu’s involvement in this matter. It is of concern to us that a solicitor appeared to advise his clients to institute legal proceedings for the mere purpose of buying time in order to evade the statutory clawback period. Solicitors owe a duty not only to their clients but also to the court. They are officers of the court who must ensure that they do not advise clients to waste the court’s time and resources.",
        "Issues 8 and 9: Bonus Payments, Salary Increases, PIH Repayments, and PSSA Repayment": "96 We will deal with Issues 8 and 9 together as they engage very similar lines of analysis. The Judge found that the Directors had breached their duties by making the Bonus Payments, Salary Increases, PIH Repayments, and PSSA Repayment. The Judge also found that PIH was liable for knowing receipt and dishonest assistance in respect of the PIH Repayments (see the Judgment at [115]–[124], [127], and [151]). 97 The Defendants appeal against these findings on the basis that: (a) The Bonus Payments were paid as a legitimate commercial decision as the Chartering Business had a profit of S$1,544,937 for the 2008 financial year. The Liquidator also did not challenge the S$354,458 paid as bonuses for 2008 to 32 other employees of Parakou. (b) The Salary Increases were also justified due to Parakou’s profits. (c) The PIH Repayments and PSSA Repayment were justified as the Directors had abona fidebelief that Parakou was not insolvent or in a parlous financial situation at the material time. The Directors also repaid other trade creditors, did not intend to prefer PIH and PSSA, and simply wanted to “have [Parakou] focus on the Chartering Business” and “did not want [Parakou] to have any outstanding debts to any of the related entities”. 98 We dismiss the appeals with respect to Issues 8 and 9 and affirm the Judge’s findings. We shall first explain why we reject the Defendants’ submission that the payments were justified as a legitimate commercial transaction. The Defendants’ appeal on all the payments fails based on this common factor alone. For completeness, we then turn to explain why the Defendants’ specific points of appeal in relation to each of the payments also fail. Parlous financial situation of Parakou at the material time 99 An issue common to all four payments is whether Parakou was in a parlous financial state at the material time or whether Parakou was making a profit. If Parakou was not making a profit and the Directors had no reason to believe that this was the case, then there could have been no genuine commercial reason to make the Bonus Payments and Salary Increases. The Directors also ought not to have made the PIH Repayments and PSSA Repayment if they knew or ought reasonably to have known that Parakou would not benefit from those repayments being made at the material time. 100 The Directors state that Parakou made a profit of S$1,544,937 for 2008. We do not accept this claim. First, we have found that Parakou was insolvent at the material time (ie, November 2008) because the Galsworthy Claim had to be taken into account in assessing Parakou’s liabilities (see [42]–[47] above). Second, and in any case, this alleged profit of S$1,544,937 does not square with the 2005–2009 audited financial statements of Parakou. We set out in Annex 1 to this judgment the 2005–2009 audited financial statements of Parakou as compiled by the expert for the Defendants, Mr Chee Yoh Chuang. 101 The Defendants’ claim that Parakou was making a profit is not borne out by the evidence of their own expert. Parakou on the whole did not make any profit but incurred a net loss of S$3,885,840 for 2008, following net losses of S$1,612,122 in 2005; S$653,375 in 2006; and S$279,207 in 2007 (see Annex 1). The evidence also does not support the Defendants’ alternative claim that the Chartering Business specifically made a profit. The figure of S$1,544,937 (which the Defendants refer to as the profit) is a grossprofit figure. It factors in only the costs directly incurred in the Chartering Business (ie, “Costs of Services Rendered” in the table above). It ignores a S$5,668,876 share of theoverheads attributable to the Chartering Business (ie, Other Operating Expenses in the table above). After including this S$5,668,876 share of the overheads, the Chartering Business had in fact made a netloss of S$4,123,939. 102 For these reasons, whether taking our earlier analysis which includes the Galsworthy Claim, or using the Defendants’ expert’s own figures, the claim that Parakou was making a profit is not borne out. In light of these net losses in consecutive years, all four transactions could scarcely have been legitimate commercial decisions. 103 As mentioned above, this alone is sufficient for us to dismiss the appeals against the Judge’s findings on the four payments. Nevertheless, for completeness, we briefly address some other arguments that have been made in relation to each of the payments. Bonus Payments 104 The Directors state that the fact that 32 other employees were also paid bonuses for 2008 indicates that the payments to the Directors were not made in breach of directors’ duties. 105 We disagree. Although the Liquidator does not challenge the fact that 32 other employees were also paid, this is at best tangential. The relevant inquiry is whether the payments made totheDirectorswere breaches of duties. The Directors do not dispute the Judge’s finding that no bonuses were paid to C C Liu, Chik, or Liu Por in 2006 and 2007 (see the Judgment at [102]). Hence, the 32 other employees’ bonuses would only become somewhat relevant if they could demonstrate to the court that Parakou also had no history of paying bonuses to its other employees prior to 2008. However, the Directors did not offer any such evidence. It is thus difficult to see how the fact that bonuses had been paid to such employees renders the Bonus Payments proper. This is particularly so in light of the high sums paid to each of the Directors (S$100,000 to C C Liu, S$80,000 to Chik, S$39,000 to Liu Por, and S$48,128 to Yang) in comparison to the S$354,458 shared across the 32 employees. Salary Increases 106 Although Parakou made net losses every year and the Chartering Business made a net loss overall, it is true that the Chartering Business made a profit for 2008. Nevertheless, this does not justify the Salary Increases made to Liu Por and Yang because the overall economic outlook of Parakou was uncertain. By that time, Parakou had lost two of its three business streams. The only remaining business, the Chartering Business, was in a poor state given the collapse of the shipping market and of its sole long-term charterer, Ocean Glory. For the Directors to increase the salaries of Liu Por and Yang in such circumstances cannot have been in Parakou’s interests. PIH Repayments and PSSA Repayment 107 The Defendants submit that the Liquidator should not be allowed to claim that these repayments were breaches of directors’ duties simply by showing that the Directors gave an undue preference and were influenced to do so by a desire to prefer. Since the repayments occurred outside the statutory clawback period, using those same facts to find breaches of directors’ duties would allow the Liquidator to, in effect, “[circumvent] the strict statutory criteria for an undue preference laid down by Parliament in the Bankruptcy Act”. Rather, the Liquidator must additionally show that the Directors “intentionally delayed the onset of liquidation so as to avoid the clawback period”. According to the Defendants, this was not the case for Parakou. 108 Against this the Liquidator submits that a finding of undue preference would “‘ipso facto[lead] to the conclusion’ that the director who procured the undue preference ‘breached [his] fiduciary duty to ensure that the company’s assets are not misapplied to the prejudice of creditors’ interests’”. The purpose of the duties of a director in corporate insolvency “‘mirrors that of the statutory avoidance provisions’i.e.to protect the general unsecured creditors from a diminution of assets available for distribution”. Hence, a finding of undue preference renders the inference of a breach of duty “practically inevitable”, relying on the Singapore High Court decision ofLiving the Link Pte Ltd (in creditors’ voluntary liquidation) and others v Tan Lay Tin Tina and others[2016] 3 SLR 621 (“Living the Link”) at [78]. 109 The Liquidator adds that a claim for unfair preference and a claim for breach of fiduciary duty are “premised on distinct causes of action” even when they concern the same subject matter. Accordingly, the claims can be brought concurrently (as inLiving the Link) or independently (as in the English High Court decision ofHellard and another v Carvalho[2013] EWHC 2876 (Ch) (“Hellard”) and the English Court of Appeal decision ofWest Mercia Safetywear Ltd (in liq) v Dodd and another[1988] BCLC 250 (“West Mercia”)). In any event, the Liquidator submits that the PIH Repayments and PSSA Repayment were patently in breach of the Directors’ duties to avoid conflicts of interest and to act in the best interests of the creditors. These duties operate independently of the statutory proscription of undue preferences, and a distinct claim in respect of them should be permitted. 110 We agree with the Judge and the Liquidator that a claim for breach of duty by the Directors in respect of the PIH Repayments and PSSA Repayment may be brought despite the two-year clawback period for undue preferences having expired. The two claims are premised on separate causes of action. They should therefore be maintainable both independently and concurrently. But where the transaction is outside the statutory clawback period, the party seeking recovery must prove that the acts are in breach of fiduciary duties, and in seeking to prove a breach, the mere fact of payments to related parties is not sufficient. 111 On the facts of the present case, there was an unmistakable desire to prefer PIH and PSSA on the part of the Directors. The Directors, by permitting the PIH Repayments and PSSA Repayment, subordinated the interests of Parakou to those of PIH and PSSA (in which they had personal interests), and therefore failed to act in the best interests of the creditors of Parakou. This can be seen from the following seven key facts: (a) First, as we noted above, the balance sheet of Parakou had reflected an (increasingly) negative equity position forsix yearsprior to the PIH Repayments and PSSA Repayment (see the Judgment at [68]). This “clearly showed that it [was] not just financially anaemic” but “insolvent” (see the decision of this court inLiquidators of Progen Engineering Pte Ltd v Progen Holdings Ltd[2010] 4 SLR 1089 (“Progen”) at [17]). (b) Second, the repayments were made to multiple related companies – “associates” – connected with Parakou in relation to whom there is a presumption of a desire to prefer under s 329 of the Companies Act read with s 99 of the Bankruptcy Act (seeProgenat [35] and [53]). (c) Third, the Directors were 100% owners of PIH and PSSA. The repayments thus conferred on them a “direct benefit …personally” [emphasis in original]. They were the “ultimate beneficiaries” of the totality of the repayments (seeProgenat [53]). (d) Fourth, the Directors were the “directing minds” behind the repayments. C C Liu demanded the repayment of the loan by PSSA to Parakou. Liu Por and Yang signed and approved all relevant payment vouchers and cheques. The Directors also sought legal advice on the methods of making the repayments and then structured their repayments around such advice. (e) Fifth, the Directors “brazenly disregarded” what were in essence “their very own assurances not to prefer”: the letters of support from PIH and PSSA (see the Judgment at [115]; see alsoProgenat [53]–[54]). (f) Sixth, the repayments were unprecedented. There was no evidence of any established past practice of similar payments. They were also, in the words of this court inProgenat [62], “one way traffic” in that neither PIH nor PSSA provided Parakou with any “new credit” in consideration for the repayments. (g) Finally, although the Directors emphasised at the oral hearing that there were similar numbers of payments made before and after September 2008, we find that to be unhelpful in the analysis. Since the inquiry before the court was whether the Repayments themselves were breaches of duties, the analysis should focus on the payments made after September 2008, and not before. In any event, even if we were to compare the payments made before and after September 2008, it is clear that there was a spike in the frequency of payments after that date – a sudden burst of activity. 112 Accordingly, we affirm the Judge’s findings on the PIH Repayments and PSSA Repayment in addition to his findings on the Bonus Payments and Salary Increases. We therefore dismiss the appeal in relation to Issues 8 and 9.",
        "Issue 10: Six Employees’ Salary Payments": "113  The Judge found that the Directors had breached their duties in approving the Six Employees’ Salary Payments, and that PSMPL was liable as a knowing recipient and a dishonest assistant for benefitting from the employees’ labour without paying for them. He rejected as a bare assertion the claims of the Directors and PSMPL that the six employees had remained under the employment of Parakou and that the inclusion of their names in the 23 December 2008 Resolution was erroneous. There was thus no legitimate reason for Parakou to make the Six Employees’ Salary Payments (see the Judgment at [104]–[106], [127], and [153]–[155]). 114 The Defendants appeal against this finding on the basis that the six employees continued to work for Parakou even after 23 December 2008. They rely on the evidence of Liu Por, who was responsible for the day-to-day affairs of Parakou, and various emails which also showed that at least some of the six employees continued to be involved in the Chartering Business in 2009. The Defendants submit that if they had intended to strip Parakou of its assets, they would have kept all 39 employees on the payroll of Parakou instead of merely six. 115 In response, the Liquidator argues that there is nobona fidereason for Parakou to have continued to pay the salaries of the six employees, who were working for the benefit of other companies. These payments were thus made in disregard of Parakou’s interests, and in breach of directors’ duties. 116 We agree with the Judge that the Directors breached their duties in relation tothe Six Employees’ Salary Payments. As the Judge found, the claim by the Defendants that the six employees were mistakenly included in the 23 December 2008 Resolution was a bare assertion not borne out by the objective evidence. Moreover, even if the six employees did continue to perform work for Parakou, they were also performing work for entities other than Parakou. For example, the Defendants assert that one Ko Chong Tak Frank (“Ko”) “did work in relation to the marketing aspect of the Chartering Business for [Parakou]” up until 31 March 2009. However, as Liu Por conceded at trial, Ko was also the Deputy CEO of Parakou Shipping Hong Kong. Further, the Defendants did not make any suggestion or offer any evidence that the work performed by the six employees for PSMPL complemented Parakou’s operations. The Directors thus breached their duties to act in the best interests of Parakou (and its creditors) by allowing Parakou to bear the salary expenses of these six employees. 117 It is no answer for the Defendants to contend that they could have depleted the assets of Parakou even further by keeping all 39 employees on Parakou’s payroll. That would simply have been a more egregious breach of duty by the Directors. It does not diminish the breach of duty by the Directors in relation to the Six Employees’ Salary Payments. 118 Accordingly, we affirm the Judge’s finding that the Six Employees’ Salary Payments were made in breach of directors’ duties. Given that PSMPL received the benefit of the six employees’ labour when it did not pay their wages, we also affirm the Judge’s finding that it was liable for dishonest assistance and knowing receipt.",
        "Issue 11: Transfer of SMAs": "119 The Judge held that the transfer of the SMAs from Parakou to PSMPL was a transaction at an undervalue pursuant to s 98 of the Bankruptcy Act read with s 329 of the Companies Act because Parakou had received no consideration for the transaction. However, the Judge found that the Directors did not breach their fiduciary duties in approving the transaction because the Ship Management Business had been loss-making. It was thus in the interests of Parakou and its creditors to dispose of the SMAs. The Judge thus made no order in respect of the transfer of the SMAs (see Judgment at [100]–[101], [128]–[129]). 120 The Liquidator submits that the SMAs had a value of up to approximately S$130,000,000, by reference to records showing that PSMPL had charged S$6,600 per vessel per day for its ship management services. He contends that while the Ship Management Business was loss-making in the hands of Parakou, it was profit-making in the hands of PSMPL. He argues that the Ship Management Business was simply an internal service centre that had no inherent value in and of itself. Its value varied with the identity of its owner and the method by which such owner accounted for it. 121 The Liquidator further submits that the value of the Ship Management Business with PSMPL is seen in a filing dated 19 March 2015 on the NASDAQ stock exchange by Parakou Tankers, Inc (“PTI”), of which PSMPL had become a wholly-owned subsidiary, and of which Liu Por is presently the sole shareholder. This filing states that PSMPL “provides technical management for [PTI’s] existing fleet and any new acquisitions, as well as two of the PIL vessels based on a daily technical management fee of [S]$6,600 per day per vessel”. In further elaboration, the Liquidator states that the Directors had been considering a liquidation of Parakou around the time when the SMAs were terminated in November 2008. The ensuing transfer of the Ship Management Business to PSMPL on 30 November 2008 was not to restructure Parakou but to place the Ship Management Business outside the hands of its creditors. 122 We reject any suggestion that the SMAs had a value of approximately S$130,000,000. This sum takes account only of the revenues associated with the SMAs. It neglectsthe costsassociated with the performance of the SMAs themselves. 123 We also reject any submission that the SMAs were profit-making or otherwise not loss-making. As the Judge notes, the Liquidator conceded at trial that the “ship management business was a loss-making business in 2008” and that there was “unlikely to be value” in the Ship Management Business at that time (see also the Judgment at [128]). But even if we were to accept that the Ship Management Business was profit-making in the hands of PSMPL, this does not automatically mean that the same business could not be loss-making in the hands of Parakou. The Liquidator offers little challenge to the evidence of the Defendants that the Ship Management Business caused Parakou losses of S$1,275,675 in 2007 and S$4,164,143 in 2008. Nor does the Liquidator meaningfully dispute the evidence of the Defendants that the Ship Management Business in the five years after its transfer to PSMPL (ie, 2009–2013) continued to incur losses of up to S$1,974,306 per year (in 2011). Coupled with the absence of any positive (and objective) evidence put forth by the Liquidator that the SMAs had an inherent value or were otherwise profitable, we are unable to disagree with the Judge that the Ship Management Business and the SMAs were loss-making. This is particularly since, we reiterate, that the Liquidator conceded the same at trial. 124 In any event, it is undisputed the SMAs were terminable on 30 days’ notice by the 12 Pretty Entities, as well as automatically upon the liquidation of Parakou. The Liquidator offers no response to the argument of the Defendants that the creditors were not prejudiced by the transfer of the SMAs, because the creditors were “not deprived of anything they would otherwise have received”. 125 Accordingly, we affirm the Judge’s finding that the transfer of the SMAs was not a breach of the Directors’ fiduciary duties.",
        "Remedies and orders": "126 We have set out the Judge’s findings on liability at [29] above. The Liquidator challenges the refusal of the Judge to grant him the option of electing the remedy of an account of profits in respect of the wrongdoing of the Defendants. Specifically, the Liquidator seeks: (a) the option to elect between equitable compensation and an account of profits against each of the Directors; (b) an account of profits and a piercing of the corporate veil to render their controllers primarily liable for their wrongdoing against PIH and PSSA; and (c) joint and several liability as co-conspirators for the reliefs against all of the Defendants. 127 The Liquidator submits that a fiduciary who by his breach of duty makes a profit for corporate vehicles under his control is subject to a strict and inflexible rule to account for the profits made by those corporate vehicles. It should not matter that the fiduciary did not personally receive the benefit of the unlawful transaction. The fiduciary cannot avoid his liability to account by hiding behind a corporate vehicle that is a mere cloak of his. Otherwise, he would be able to avoid having to account for profits by routing an unlawful transaction through a corporate vehicle. The Liquidator further argues that the corporate veil between the Directors and PIH as well as PSMPL should in any event be lifted. PIH and PSMPL were simply “corporate puppets” that the Directors had intentionally interposed between themselves and Parakou to absolve themselves of personal liability for the unlawful transactions. 128 The Defendants reply that an account of profits should not lie against those Defendants that did not receive the fruits of the unlawful transactions. Ordering an account of profits against such Defendants would result in double recovery for the Liquidator. The Defendants submit further that the corporate veil between the Directors and PIH and PSMPL should not be lifted because the Liquidator has not proved that the relevant Directors at the material time used the corporate structure of PIH and PSMPL to avoid or conceal their breaches of duty. 129 We agree with the Liquidator that the remedy of an account of profits is available against a fiduciary who procures an unlawful benefit for a corporate vehicle in which he has a substantial interest, particularly where the corporate vehicle is but a “mere cloak” for his unlawful conduct. A fiduciary “cannot avoid the rules concerning accountability for profits by arranging for the profit to be taken by his company (or a company in which he has a substantial interest) which is a mere cloak for the [fiduciary]” (see Lynton Tucker, Nicholas Le Poidevin & James Brightwell,Lewin on Trusts(Sweet & Maxwell, 19th Ed, 2015) at para 20-085). We find instructive the decision of the English High Court inCMS Dolphin Ltd v Simonet and another[2001] 2 BCLC 704 (“CMS Dolphin”), which was followed by Woo Bih Li J in the Singapore High Court decision ofSwiss Butchery Pte Ltd v Huber Ernst and others and another suit[2010] 3 SLR 813. InCMS Dolphin, a director (Simonet) diverted a business opportunity from his corporate principal to business vehicles that he had established (Millennium and Blue). The director argued that he “personally made no profits” and “that there is therefore nothing for which he should account”. In rejecting these protests, Lawrence Collins J held (at [100] and [131]): [100] Where the business is put into a company which is established by the directors who have wrongfully taken advantage of the corporate opportunity, it was held inCook v Deeks[1916] 1 AC 554, [1916–17] All ER Rep 285 (PC) that both the directors and the company are liable to account for profits. Directors of the Toronto Construction Co formed the Dominion Construction to divert a contract to build a railway line for the Canadian Pacific Railway. They entered into the contract personally and then subsequently ‘the contract was . . . taken over by this company, by whom the work was carried out and the profits made’ ([1916] 1 AC 554 at 561, [1916–17] All ER Rep 285 at 289). The conclusion was ([1916] 1 AC 554 at 563, 565, [1916–17] All ER Rep 285 at 290–291): ‘. . . the defendants T.R. Hinds and G.S. and G.M. Deeks were guilty of a distinct breach of duty in the course they took to secure the contract, and . . . they cannot retain the benefit of such contract for themselves, but must be regarded as holding it on behalf of the company . . . It follows that the defendants must account to the Toronto Company for the profits which they have made out of the transaction . . . Their Lordships have throughout referred to the claim as one against the defendants G.S. Deeks, G.M. Deeks, and T.R. Hinds. But it was not, and could not be disputed that the Dominion Construction Company acquired the rights of these defendants with full knowledge of the facts, and the account must be directed in form as an account in favour of the Toronto Company against all the other defendants.’ … [131] Mr Simonet put the benefit of the contracts or business opportunities in the partnership Millennium, and then he and Mr Patterson transferred the business without any consideration (other than perhaps the issue of shares) to Blue. Mr Simonet cannot escape the consequences of his own breach of fiduciary duty by transferring the fruits of that breach to a company. He remains the person principally liable … 130 The Defendants attempt to distinguishCMSDolphinon the sole ground that it involved a “corporate vehicle formed by [the wrongdoing directors] to take unlawful advantage of the business opportunities”. They argued that, in contrast, and “[c]ritically, there is no element of diversion of business in any of the transactions for which the [D]irectors were found to have breached their fiduciary duties”. We are unable to agree. The nature of the wrongdoing by the director inCMSDolphinis not materially different from the wrongdoing of the Directors. If anything, the wrongdoing of the Directors is more egregious: instead of an inchoate business opportunity, what they diverted out of Parakou were the monies of Parakou. The recipients of these diversions were, besides the Directors themselves, companies that theywhollyowned and controlled (ie, PIH and PSMPL). In the words of the court inCMS Dolphinat [97], each of the Directors “should be accountable for the profits properly attributable to [his or her] breach of fiduciary duty”. 131 Accordingly, we grant the following reliefs to the Liquidator: (a) for thelegal fees incurred in the London Arbitration and the HK Court Proceedings: the option to elect between damages and an account of profits jointly and severally against C C Liu, Liu Por, and Yang; (b) for theBonus Payments: the option to elect between damages and an account of profits jointly and severally against C C Liu, Chik, Liu Por, and Yang; (c) for theSalary Increases: the option to elect between damages and an account of profits jointly and severally against C C Liu, Chik, Liu Por, and Yang; (d) for thePIH Repayments: the option to elect between damages and an account of profits jointly and severally against C C Liu, Chik, Liu Por, Yang, and PIH; (e) for thePSSA Repayment: the option to elect between damages and an account of profits jointly and severally against C C Liu, Chik, Liu Por, and Yang; and (f) for theSix Employees’ Salary Payments: the option to elect between damages and an account of profits jointly and severally against C C Liu, Liu Por, Yang, and PSMPL. 132 We note that although the Liquidator may elect between damages and an account for profits for all of these breaches, it may turn out to be difficult to prove how many of these breaches (save for the PIH Repayments and the PSSA Repayment) generated profits for which the Directors are required to account. This is especially so in relation to the legal fees. Nevertheless, that is an issue that the Liquidator must deal with when exercising his right to elect between these alternative remedies. But as a matter of principle, because of thenatureof the breaches in this case (ie, breaches of fiduciary duties), the remedy of an account of profits would be available to the Liquidator regardless, subject to any equitable bars to recovery. 133 We summarise our orders against each of the Defendants in a table at Annex 2 of this judgment.",
        "Conclusion": "134 For all of the above reasons, we allow the appeal against the Judge’s findings in part (as summarised above at [37]). On the issue of costs (including points raised in the Costs Judgment), we direct the parties to file written submissions no longer than ten pages within three weeks of the date of this Judgment, as to the appropriate costs orders to be made both here and below in the light of the present Judgment. Sundaresh Menon      Andrew Phang Boon Leong      Steven ChongChief Justice       Judge of Appeal        Judge of Appeal Sim Chong, Yap Hao Jin and Tee Lim Min Joan (Sim Chong LLC) for the appellants in Civil Appeal No 55 of 2017 and the fifth and sixth respondents in Civil Appeal No 58 of 2017;Siraj Omar and Premalatha Silwaraju (Premier Law LLC) for the appellants in Civil Appeal No 56 of 2017 and the third and fourth respondents in Civil Appeal No 58 of 2017;Lok Vi Ming SC, Lee Sien Liang Joseph, Justin Chan and Natalie Joy Huang Kim Lian (LVM Law Chambers LLC) for the appellants in Civil Appeal No 57 of 2017 and the first and second respondents in Civil Appeal No 58 of 2017;Edwin Tong SC, Kenneth Lim Tao Chung, Chua Xinying, Yu Kexin, Nigel Yeo Kok Quan, Rebecca Chia Su Min and Wong Pei Ting (Allen & Gledhill LLP) for the respondent in Civil Appeals Nos 55 to 57 of 2017 and the appellant in Civil Appeal No 58 of 2017.",
        "Annex 1: Audited Financial Statements of Parakou (FY2005–FY2009)": "[arrows added]",
        "Annex 2: Summary of Reliefs Ordered": "Legal Fees (London/HK)Bonus PaymentsSalary IncreasesPIH RepaymentsPSSA RepaymentSix Employees’ Salary PaymentsC C LiuDamages / AccountDamages / AccountDamages / AccountDamages / AccountDamages / AccountDamages / AccountChik-Damages / AccountDamages / AccountDamages / AccountDamages / Account-Liu PorDamages / AccountDamages / AccountDamages / AccountDamages / AccountDamages / AccountDamages / AccountYangDamages / AccountDamages / AccountDamages / AccountDamages / AccountDamages / AccountDamages / AccountPIH---Damages / Account--PSMPL-----Damages / Account"
    }
}