{
    "case_title": "Benzline Auto Pte Ltd vSupercars Lorinser Pte Ltd and another",
    "ncitation": "[2018] SGCA 02",
    "coram": "Judith Prakash JA (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 This appeal arises from a dispute over a payment of $300,000 made by the respondents to the appellant (“the Payment”) while the parties were negotiating a contract of sub-dealership. The negotiations eventually failed and the respondents sued for the restitution of the Payment. The central question before the High Court judge (“the Judge”) was whether the retention of the Payment was conditional on the conclusion of the sub-dealership agreement. The Judge found for the respondents and ordered that the Payment be refunded. He also dismissed the appellant’s counterclaim for breach of contract. This is our decision on the appellant’s appeal against the Judge’s decision on both the claim and the counterclaim.",
        "Background": "",
        "The parties and otherdramatis personae": "2 The appellant, Benzline Auto Pte Ltd (“Benzline”), is in the business of retail sale and wholesale of car parts and accessories, and of providing modification services using those parts and accessories. It also engages in the parallel importation of cars. Benzline’s representatives during the period in which this dispute arose were Mr Ng Seng Keong (“Mr Ng”, also known as “Kevin”), who was and is Benzline’s managing director, and Mr Chong Ban Cheong (“Mr Chong”, also known as “George”), who was then Benzline’s marketing and business development manager. By the time of the trial, Mr Chong had left Benzline and he appeared at the trial as a witness for the respondents. 3 The second respondent, Supercars Singapore Pte Ltd (“Supercars Singapore”), is a car retailer. The first respondent, Supercars Lorinser Pte Ltd (“Supercars Lorinser”), was incorporated by the second respondent as a conduit for the intended retail sale of a specific brand of cars, which we shall discuss shortly. For convenience, we refer to them as a collective entity, “Supercars”, except where the context requires a distinction to be drawn. Supercars’ representatives were Mr Chua Yeow Kang (“Mr Chua”, also known as “Marcus”), a director of both respondents, and Mr Yu Ming Yong (“Mr Yu”), a shareholder of Supercars Singapore. 4 Looming large in the background of this dispute are two German entities which are not parties to these proceedings. Daimler AG (“Daimler”) is the automobile manufacturer which produces, among others, the Mercedes-Benz line of cars. It does so through subsidiaries bearing the Mercedes-Benz name, but for ease of reference, we shall refer simply to Daimler as a collective entity. One of Daimler’s customers is Sportservice Lorinser Sportliche Autoausrustung GmbH (“Lorinser”). Lorinser is in the business of customising and tuning Mercedes-Benz cars for sale to consumers. It orders Mercedes-Benz cars, modifies them using its own parts (“Lorinser car parts”), and sells the modified cars (“Lorinser cars”) under the Lorinser brand. It also sells the Lorinser car parts separately. Lorinser’s principal was Mr Marcus Lorinser and its main representative in its dealings with Benzline and Supercars was its export sales manager, Mr Evangelos Hatzikoitsis (“EH”). No witnesses from Daimler or Lorinser gave evidence in these proceedings. 5 What follows is a brief outline of the facts. Especially pertinent details will be explored in greater depth at the appropriate points of our analysis.",
        "The relationship between Benzline and Lorinser": "6 Benzline and Lorinser have a long history of business dealings. In 1993, Benzline was appointed the master dealer of Lorinser car parts in Singapore. In 2006, Benzline and Lorinser concluded a similar agreement in respect of Lorinser cars, and for a time Benzline actively pursued the importation and sale of Lorinser cars. Benzline’s efforts were impeded by one major obstacle: Daimler’s international consumer warranty (“the Daimler Warranty”), which in Singapore was provided through Cycle & Carriage, only applied to direct imports of Mercedes-Benz cars. Since the Lorinser cars were considered parallel imports, they were not covered by the Daimler Warranty in Singapore. This meant that any warranty would have to be provided by Benzline itself at an added fee charged to its customers, making Lorinser cars a markedly less attractive value proposition. Benzline sold about 60 Lorinser cars before abandoning the experiment in 2007. Thereafter, it continued to hold the master dealership rights, but in practice restricted itself (as far as Lorinser’s products were concerned) mainly to selling Lorinser car parts and customisation services, although it would occasionally order Lorinser cars at the special request of individual customers. 7 This state of affairs continued until 2013, when EH informed Mr Ng and Mr Chong that Lorinser had concluded an agreement with Daimler to extend the Daimler Warranty to Lorinser cars, provided they were sold by an authorised dealer. A dealer wishing to participate in this new arrangement (hereinafter referred to as the “Special Project”) would have to enter into a fresh agreement with Lorinser for that purpose. EH mentioned that negotiations with a possible dealer in Thailand had fallen through. He then suggested that Benzline consider applying to be Lorinser’s authorised dealer for Thailand, Malaysia, and/or Singapore for the purposes of the Special Project. Benzline was intrigued by the Special Project, but was not inclined to be the direct retailer of Lorinser cars due to its relative lack of car retail expertise and human resources. Benzline hence considered that it would be more advantageous to find another party to assume the role of sub-dealer, allowing Benzline to make some profits (essentially as a middleman) without having to develop its own retail capabilities.",
        "Negotiations between Benzline and Supercars": "8 It so happened that Mr Chong and Mr Chua were neighbours and had known each other for some years. Mr Chong was aware of Mr Chua’s role in Supercars, and he decided to inform the latter of the opportunity as well as to recommend Supercars to Mr Ng. The recommendation was well received by Mr Ng, and the three men began discussions with a view toward Benzline and Supercars entering into an exclusive sub-dealership agreement for the purposes of the Special Project (“the Exclusive Sub-Dealership Agreement”). Many of these discussions involved Lorinser as well. 9 At least initially, Supercars was interested in being the exclusive sub-dealer of Lorinser cars in Thailand as well as Singapore. Somewhere along the way, talk of operations in Thailand petered out, and the parties focused their discussions on the Singapore market. In late 2013, the discussions appeared to be going well, and both parties were confident that the Exclusive Sub-Dealership Agreement would materialise in due course. However, the decision was not entirely in their hands as Lorinser had the power to accept or reject a proposed sub-dealer. For this among other reasons (see [29]–[30] below), the terms of the Exclusive Sub-Dealership Agreement were dependent on the terms of a new master dealership agreement between Benzline and Lorinser (“the Benzline–Lorinser Agreement”), which was to cover the Special Project. As a consequence, the parties could not attempt to finalise the Exclusive Sub-Dealership Agreement until April 2014, when the final draft of the Benzline–Lorinser Agreement was produced.",
        "Scheduling complications and the making of the Payment": "10 During this waiting period, discussions continued regarding certain orders which had to be placed with Daimler (and which therefore first had to be placed with Lorinser). Daimler expected its buyers to provide it with projected yearly orders for planning purposes (“Planning Orders”). In order to actually obtain cars, buyers would subsequently have to place monthly orders (“Purchase Orders”) accompanied by a 30% deposit on each order. 11 In January 2014, EH reminded the parties that if the deposit on Supercars’ first Purchase Order (“the First Purchase Order”) was not placed soon, there could be a lengthy delay in the eventual delivery of the Lorinser cars, and this would hinder Supercars’ achievement of its sales target for the year 2014. The course of their correspondence on this matter was as follows: (a) On 17 January 2014, EH sent an e-mail to Mr Chua (copied to Mr Ng, Mr Chong, and Marcus Lorinser) to request Mr Chua to submit two things: an amended Planning Order for 2014 and “the [P]urchase [O]rders for the first order for May production (total[ling] 7x units)”. EH further requested that Mr Chua “transfer the deposit of 30% directly to [Lorinser’s] account”. (b) On 21 January 2014, EH sent an e-mail to Mr Ng containing the first draft of the Benzline–Lorinser Agreement (“the First Draft Agreement”) as an attachment. He requested that Mr Ng circulate the contents of the draft to Mr Chua and Mr Yu and “ask them to study it”. That was done and Mr Chua and Mr Yu then reviewed the First Draft Agreement. The terms of the First Draft Agreement are discussed in detail at [33]–[34] below. (c) On 22 January 2014, having discussed the matter with Mr Chua, Mr Yu met Mr Ng and, on behalf of Supercars, gave him a personal cheque for $300,000 drawn in favour of Benzline (ie, the Payment), accompanied by a payment voucher filled in by Mr Yu (“the Payment Voucher”) which stated the payment to be a “30% deposit for New Mercedes as attached”. Mr Ng signed and returned the Payment Voucher. (d) On 27 January 2014, Mr Chong sent an e-mail to EH (copied to Mr Ng) to place an order for nine cars (ie, the First Purchase Order). The e-mail stated the names and codes of the cars as well as the codes for the various customisation options to be applied to each car. These nine cars were described as being “for the initial launching”. (e) On 6 February 2014, EH sent an e-mail to Mr Ng (copied to Mr Chong) regarding some problems with the First Purchase Order. He informed Mr Ng that some of the models in that order were unavailable, and that this had caused Daimler’s system to reject the order. He listed the “[a]lternative and current[ly] available models” that could be ordered instead. Mr Chong forwarded EH’s e-mail to Mr Chua on the same day. (f) On 12 February 2014, Mr Chong sent an e-mail to EH (copied to Mr Ng, Mr Chua, and Marcus Lorinser) stating the desired substitute models. Further e-mail exchanges on the topic followed, and it appears that the First Purchase Order was finalised (after substitutions, and the number being reduced to seven cars) in late February 2014. 12 It is unclear from the evidence when precisely the First Purchase Order was successfully entered into Daimler’s system and when the Payment was used by Lorinser to place the deposit on the First Purchase Order. It is undisputed, however, that the Payment was sent to Lorinser by Benzline and that Lorinser did pay Daimler. Additionally, a Planning Order of 100 cars was agreed and submitted by Supercars.",
        "The breakdown of the relationship between Benzline and Supercars": "13 Between February and April 2014, the parties continued their discussions, and some additional Purchase Orders were placed (primarily through direct correspondence between Supercars and Lorinser), but Supercars did not make any payment to either Benzline or Lorinser in respect of those. 14 On 29 April 2014, EH sent Mr Ng a copy of the second and final draft of the Benzline–Lorinser Agreement (“the Second Draft Agreement”) who then forwarded the draft to Mr Chua. The parties dispute precisely the actions that were taken by Supercars and Benzline following this, but what is material and undisputed is that Mr Chua strongly objected to the inclusion of a clause (cl 18.2) which required Benzline to provide Lorinser with a standby letter of credit (“standby LC”) in the amount of €250,000. Since the Exclusive Sub-Dealership Agreement was to mirror the Benzline–Lorinser Agreement, the parties understood this to imply that Supercars would have to provide the standby LC. Mr Chua was unwilling to have Supercars do so, and Lorinser was, at least to Benzline’s understanding, equally unwilling to have the clause removed. 15 Between April and May 2014, the parties had a number of discussions concerning the problem. According to Supercars, a compromise was reached under which Supercars would contract directly with Lorinser and would be willing to provide the standby LC pursuant to that contract, with Benzline’s profits to be replaced by a separately negotiated commission; Benzline denies that there was any such compromise. Either way, on 21 May 2014, Mr Chua e-mailed Marcus Lorinser directly (without copying anyone from Benzline) to propose this new arrangement. Lorinser on its part did not reply and only forwarded the e-mail to Mr Ng, who did not react well to this development. Later in May 2014, Supercars caught wind that Benzline had instead entered into an exclusive sub-dealership agreement with a competitor, Regal Motors Pte Ltd (“Regal”). Supercars considered this to be an indication that its relationship with Benzline was at an end. At this point, no Lorinser cars had been delivered to Supercars. Supercars demanded a refund of the Payment, which Benzline refused to give. Supercars then commenced the proceedings below.",
        "The arguments and decision below": "16 Before the Judge, Supercars sought, primarily, a return of the Payment. Supercars pleaded its claim against Benzline in four alternative ways: first, as a claim for recovery of a pre-contractual deposit; second, as a claim for restitution for total failure of consideration; third, as a claim for money had and received; and fourth, as a claim for breach of contract (the breach being the failure to appoint Supercars as the exclusive sub-dealer) which caused the loss of the $300,000. It should be observed that the first three formulations pleaded are repetitive and needlessly confusing. Recovery of a pre-contractual deposit on a contract which fails or does not materialise is merely an instance of restitution for failure of consideration (also known as “failure of basis”). As for “money had and received”, that is not a cause of action, but merely an older label for a form of action which has now been subsumed within the contemporary rubric of unjust enrichment: seeAlwieHandoyo v Tjong Very Sumito and another and another appeal[2013] 4 SLR 308 at [124]–[125]. Therefore, the first three formulations of Supercars’ claim were not true alternatives but were instead aspects of a single claim: a claim in unjust enrichment for restitution of a pre-contractual deposit on the ground of a failure of basis. Supercars dealt with it as such in its arguments before us. So shall we. 17 In addition to the claim in unjust enrichment, Supercars also brought an alternative claim for breach of contract, which is not an issue before us and of which we shall say no more. 18 Benzline’s defence was that the Payment was a deposit on a standalone purchase of cars. Benzline also brought a counterclaim for breach of contract, seeking compensation for lost sales in Singapore and Thailand and damages incurred in the storage of and other costs relating to the cars which Supercars had not taken delivery of. 19 With regard to the Planning Orders and Purchase Orders, both parties adopted rather extreme positions. Benzline asserted that the Planning Order for 100 cars was binding, and that Supercars was thus obligated to pay for and accept all 100 cars; the First Purchase Order was merely part of implementing the performance of the Planning Order. Indeed, Benzline also asserted that an alleged order of 147 cars for sale in Thailand – for which no Planning Order was ever submitted – was also binding. Supercars on its part denied that any contractually binding orders were placed at all – it asserted thatallthe orders placed were for “planning purposes” only, and that nothing was to be binding unless and until the Exclusive Sub-Dealership Agreement was concluded. 20 The Judge allowed Supercars’ claim and dismissed Benzline’s counterclaim. His grounds of decision are reported inSupercarsLorinser Pte Ltd and another v Benzline Auto Pte Ltd[2016] SGHC 281 (“the GD”). Regarding the restitutionary claim, the Judge applied reasoning similar to that in the High Court decision ofUnited ArtistsSingapore Theatres Pte Ltd and another v Parkway Properties Pte Ltd and another[2003] 1 SLR(R) 791 (“United Artists”), which was affirmed on appeal without argument on this point. In brief, the Judge held that the Payment was a pre-contractual deposit (which was, in law, not a true deposit, but only a part-payment) made to demonstrate good faith and seriousness, and was therefore refundable when the Exclusive Sub-Dealership Agreement failed to materialise. He also agreed with Supercars that no binding contract (whether arising from the Planning Orders, the Purchase Orders, or otherwise) had been concluded, with the result that Benzline had no basis for its counterclaim.",
        "Benzline’s case": "21 Benzline’s appeal raises five main points: (a) There was no evidence to show that the Payment was made to demonstrate good faith and seriousness. Negotiations were at an advanced stage and Benzline was in no doubt as to Supercars’ good faith and seriousness. (b)United Artists([20]supra) could be distinguished on the facts and was misapplied by the Judge. (c) Mr Chua and Mr Yu had seen the First Draft Agreement before making the Payment, and would not have made the Payment if they had not considered the terms of that draft agreement to be acceptable. (d) The parties were aware that once the Payment was made and the First Purchase Order placed, the order and payment would flow upward to Daimler and the production process would irrevocably commence. (e) The Planning Order had been discussed over many meetings and e-mails and was a committed and firm order.",
        "Supercars’ case": "22 Supercars makes four main points: (a) Under cross-examination, Mr Ng had made numerous concessions supporting Supercars’ case, including admitting that the Payment was made on the basis that Supercars would be appointed the exclusive sub-dealer. Mr Chua’s and Mr Yu’s evidence supported this too. (b) It made little commercial sense for Supercars to purchase Lorinser cars except under the Exclusive Sub-Dealership Agreement, because they would otherwise be parallel imports and thus unattractive to consumers. (c) The Planning Orders were made for planning purposes only due to the time lag in the production of cars. Mr Chong’s evidence was that the figures contained therein were just a guide. (d)  Regal had taken over the Lorinser cars ordered by Supercars/Benzline and thus Benzline had suffered no loss. Additionally, Benzline’s evidence of losses was flawed.",
        "Our decision": "23 This appeal turns largely on one question: what was the Payment for? Three competing answers have been offered. Benzline says it was simply a deposit on a standalone purchase of cars. Supercars says it was a pre-contractual payment for cars, conditional on the parties subsequently entering into the Exclusive Sub-Dealership Agreement. The Judge thought it was a good faith payment meant to demonstrate the seriousness of Supercars’ interest in the deal. 24 In our view, none of these answers is quite right. The evidence, properly considered, points to a fourth explanation: the Payment was made for the specific purpose of enabling Lorinser to pay a deposit to Daimler, thus setting in motion the production process and avoiding what would otherwise have been an unacceptable delay in the eventual delivery of the cars. Although the Payment was conditional, it is in our view inaccurate to characterise that condition as being that the partieswouldenterintothe Exclusive Sub-Dealership Agreement. Rather, the Payment was conditioned on Supercarsbeing offeredthe choice to enter into the Exclusive Sub-Dealership Agreement on terms materially similar to the First Draft Agreement, which Supercars had reviewed immediately prior to making the Payment. That was the basis of/consideration for the Payment, and it did not fail; rather, Supercarschoseto reject the offer. Consequently, it is not entitled to restitution of the Payment. 25 Our detailed reasons follow.",
        "The full commercial context of the Payment": "26 To understand the purpose of the Payment, it is important to first appreciate the web of relationships between Supercars, Benzline, Lorinser, and Daimler. In this, we respectfully disagree with the Judge, who considered the arrangements between Lorinser and Daimler to be irrelevant to the dispute before him (see the GD at [56]). It is true that the court is not concerned with determining the rights and obligations between the parties and Lorinser, or Lorinser and Daimler. Nonetheless, the commercial reality of the situation was that the parties were only the last two links in a supply chain beginning, for our purposes, with Daimler and Lorinser. This reality shaped and informed the parties’ understanding leading up to the Payment, and must therefore be considered in full. The understanding between Supercars and Benzline 27 The starting point of our inquiry is the underlying logic of the deal which the parties contemplated. It is undisputed that Benzline had no interest in being the retailer of Lorinser cars, even if the cars were to be covered by the Daimler Warranty. Quite apart from its previous unsuccessful attempt to market Lorinser cars, Benzline was aware that it lacked both the expertise and the human resources to retail Lorinser cars on a significant scale; though it dabbled in parallel imports, its core business was in modifications. Supercars, on the other hand, was well placed to take up the opportunity, but had no prior connection with Lorinser and would not have been able to deal with Lorinser without Benzline acting as an intermediary. In short, each party had something the other needed and lacked: Benzline had access to the lucrative commercial opportunity offered by Lorinser, but not the ability and will to seize it, while Supercars was in the opposite position. 28 Unsurprisingly, then, the understanding which the parties reached was one under which Supercars was to have the lion’s share of both risk and reward. Although there was to be a notional sale of Lorinser cars by Lorinser to Benzline, and then from Benzline to Supercars, Benzline was to be in substance what Mr Chua described as a “commission agent”. The mechanics of the arrangement were that for every car ordered, Lorinser was to give Benzline a discount off the list price, and Benzline was then to give Supercars a slightly lower discount; the difference between the two would be Benzline’s profits. There was some dispute over the exact figure agreed on for the “commission”, though it appears to have been in the region of 2.5 to 5%. Adopting Mr Chua’s estimates, this would leave Supercars to benefit from a net discount of 18 to 19% on the base Mercedes-Benz cars and somewhere between 25 and 38% on the Lorinser parts used to modify them into Lorinser cars. If that seems a lopsided allocation of the fruits of the deal, it should be recalled that as the retailer, Supercars had to contend with the costs of marketing the cars and servicing consumers, as well as the risk of having unsold products, whereas Benzline’s costs and risks would be minimal. The rest of the parties’ dealings must be understood in this light. The Benzline–Lorinser Agreement and the Exclusive Sub-Dealership Agreement 29 Benzline’s status as Lorinser’s master dealer in Singapore did not automatically entitle it to participate in the Special Project. For that, the Benzline–Lorinser Agreement had to be negotiated. The terms of this agreement would carry implications for the relationship between Benzline and Supercars as well, because the rights which Benzline was to give Supercars were to be derived from the rights which Lorinser was to give Benzline; the former would be meaningless without the latter. It was therefore not possible for the Exclusive Sub-Dealership Agreement to be concluded until the Benzline–Lorinser Agreement had been finalised. 30 More than that, both parties accepted, and the key witnesses testified, that the Exclusive Sub-Dealership Agreement was intended to be “back-to-back” with the Benzline–Lorinser Agreement – that is to say, to mirror the terms of the Benzline–Lorinser Agreement. This intention explains why Mr Ng shared the drafts of the Benzline–Lorinser Agreement with Mr Chua and invited him to comment on and propose amendments to them: since the terms of the Benzline–Lorinser Agreement would determine the terms of the Exclusive Sub-Dealership Agreement, it followed that if the terms of the Benzline–Lorinser Agreement were not acceptable to Supercars, the terms of the Exclusive Sub-Dealership Agreement would not be acceptable either. 31  In our view, this intention for the contracts to be back-to-back is consistent with, and reinforces, the commercial understanding between the parties that Supercars was to bear the majority of the risk in exchange for reaping the majority of the rewards. If Benzline was to owe an obligation to Lorinser, Supercars was expected to owe a similar obligation to Benzline, so that Benzline would not be left with any liability to Lorinser which would not ultimately be covered by Supercars. That protection from risk was what enabled Benzline to charge Supercars only a modest 2.5 to 5% “commission”. 32 In examining the drafts of the Benzline–Lorinser Agreement, it should be remembered that it is not the task of this court in the present dispute to determine the actual contractual effect of the provisions. That is fortunate given that the provisions include a choice of law clause designating German law as the law of the contract (cl 16.2). Although the court may, in the absence of proof of foreign law, apply a presumption that the foreign law does not differ from Singapore law, this is not an ideal solution where it is obvious that there are, in reality, likely to be significant differences. In the present case, what we are interested in is not the correct legal interpretation of the relevant provisions, but rather, the insight they can give us intowhat the parties expectedwhen the Payment was made – no more and no less. Since the parties’ representatives were not legally trained, let alone in German law, it is sufficient to consider the common sense understanding which a businessperson would have obtained from reading these provisions. 33 The terms which the parties contemplated at the time the Payment was made are those contained in the First Draft Agreement, which Lorinser sent to Mr Ng on 21 January 2014 in partially translated form. Mr Chua and Mr Yu received it the day before the Payment was made, and both of them perused the document before deciding to make the Payment. The First Draft Agreement would therefore have been of central importance to the parties’ shared expectations at the relevant time. It contained the following notable features: (a) Under the section on orders and pricing, the translation of cl 6.2 provided that “[a]fter the annualplanningwith monthly volumes per vehicle model, the detailed monthlyorderis to be placed then in addition” [emphasis added], and that each such order was to be placed “in the middle of each month … 3 months in advance for vehicles produced in Germany”. (b) Under the section on the contract period and termination, the translation of cl 14.3 provided that one of the events which would allow Lorinser to terminate the agreement was “the failure to meet the indicated minimum purchase quantities according to [cl] 2.1 during a calendar year in case of a pro rata consideration by more than 50%”. We cannot help but note that this translation appears to differ from the German original (a defect corrected in the Second Draft Agreement); however, it is safe to assume that the parties, not being proficient in German, would have relied on the draft English translation. The gist of that translation is tolerably clear, despite some awkwardness in phrasing – Lorinser would be entitled to terminate the agreement if the number of cars actually purchased in a given calendar year fell below half of the minimum number under cl 2.1 (which we take to be a reference to cl 2, there being no cl 2.1). (c) Clause 2 unfortunately did not come with a translation, other than the phrase “[f]or 2014”. The full translation was provided only in the Second Draft Agreement. In that translation, cl 2 bore the heading “Expected purchase quantities”, and stated that “[d]ue to [Benzline’s] market analyses the partiesassumethe following yearly purchase quantities” [emphasis added], followed by a list of car models with quantities remaining to be filled in. The final Benzline–Lorinser Agreement contained the same wording, with the quantities added. It would, of course, not be right to impute precisely this understanding to the parties at the time the First Draft Agreement was receivedsanstranslation. What would have been clear to them, however, was that cl 2 was an uncompleted list of quantities of car models for 2014. (d) Clause 18.2 provided that the Benzline–Lorinser Agreement would only be binding after, in addition to both Benzline and Lorinser signing the agreement, Lorinser had been provided with a standby LC with a term of two years (this period being the initial term of the Benzline–Lorinser Agreement). In the First Draft Agreement, there were also clauses concerning when each order of cars would become binding on Benzline (cll 6.4 and 6.5), the terms of delivery (cl 7), the timing of payment for the base Mercedes-Benz cars and Lorinser modifications (cll 8.1 and 8.2), and title retention (cl 9). 34 Clause 18.2 is crucial, as its inclusion in the First Draft Agreement shows that Supercars was or should have been aware of the need for a standby LC from the time it received the First Draft Agreement; it was not a surprise sprung on Supercars in the Second Draft Agreement. Indeed, Mr Chua conceded under cross-examination that he had noticed cl 18.2 when he perused the First Draft Agreement. Although he also asserted that he had disregarded cl 18.2 because Mr Ng had assured him that no standby LC would be required, Mr Chua could offer no corroboration for this claim. In the absence of other evidence, and in the face of Mr Ng’s denial of such alleged agreement, we are unable to accept Mr Chua’s assertion on a balance of probabilities. Given his admission that he did read and understand cl 18.2 before procuring the Payment to be made, we must take him (and thus Supercars) to have been aware of cl 18.2’s existence and effect at the material time. 35 As for the other provisions summarised above, they have significant implications for the intended effects of the Planning Orders and Purchase Orders, to which we now turn. The Planning Orders and Purchase Orders 36 It will be recalled that Benzline’s position was that the Planning Orders and the Purchase Orders were both contractually binding on Supercars. We are unable to accept that assertion. It is clear from cll 2, 6.2 and 14.3 that a distinction was drawn between the Planning Orders and the Purchase Orders. Clause 6.2 referred to “annual planning” in contrast to “monthly order[s]”, implying that the planning figures did not constituteordersof carsper se. Moreover, cl 14.3 allowed for termination only if the Purchase Orders placed in a given calendar year amounted toless than halfof the Planning Orders placed for that year. If the Planning Orders were indeed intended to be contractually binding (between Daimler and Lorinser and/or between Lorinser and Benzline), it would be surprising for the threshold for termination to be set as low as that. 37 Further illumination can be gained from EH’s series of e-mails to the parties in which he explained, in piecemeal fashion, his understanding of the difference between Planning Orders and Purchase Orders. Since neither party made any objection to those explanations after receiving them, we take it that the explanations reflected the shared understanding of the parties as well. This applies equally to the e-mails pre-dating the Payment (which are obviously significant) and those post-dating the Payment (because one would expect that the parties would have objected had they thought that EH was resiling from their earlier understanding). We summarise EH’s explanations in the following table, with emphasis added, together with what we see as the implications of each statement: E-mail dateStatement(s) madeSignificance12 December 2013“Regarding yourplanning for 2014and the specified vehicle models, please find our excel list with the vehicles youintend and wish to buyand the allotment from Daimler to Lorinser for SGP and THAILAND in the attachment. Furthermore, please inform us about thedesired vehicle quantities per monthly order.”The “planning for 2014” was to be a list of vehicles which Supercars “intend[ed] and wish[ed] to buy”, as opposed to a list of vehicles for which it was placing a firm order. Moreover, terms such as “inform us” (instead of, say, “propose to us”) and “desiredvehicle quantities” suggest that EH was not inviting an offer in the contractual sense.17 January 2014“Regarding the Initial Order for production month May 2014, kindly I would like to ask you first to send me asap the newofficial planning 2014… [so that] I will be able to send to Daimler AG Berlin and second please preparing and send me asap thepurchase ordersincluding the colours and specs with the MB codes [ie, the codes identifying the car model] including the MB codes for SGP version for the May 2014 production … [P]lease preparing and send me thepurchase ordersfor the first order for May production ([totalling] 7x units) and transfer the deposit of 30% directly to our account …”This draws a clear distinction between the “purchase order[s]” and the “official planning”. It also shows that no deposit was to be paid until the Purchase Orders were sent.13 February 2014“[A]s I informed you today in the morning, we have talked to MBVD head office about your inquiries [for] the new MB models, which you [did not] put in your [planning] for 2014 and which were not approved by Daimler AG yet! … [T]hey could understand that due to new MB models we need some corrections and therefore they give us the chance now to check and preparing an exactly 100% new Planning for the rest of 2014 which MB models and quantity for each model we want to order!”This message is ambiguous. On the one hand, the reference to “an exactly 100% new Planning for the rest of 2014” could suggest that the Planning Order, once finalised, was intended to be binding. However, it could also mean that the Planning Order was to set – as a matter ofpractice– the quantity of cars which Daimler would allow a buyer tosubsequentlyorder in the Purchase Orders/“monthly orders”.17 February 2014“We need urgently your reply including thebinding new sales planning 2014for the 100x units approved [from] Daimler AG for Singapore!”Taken on its own, this could suggest that the Planning Orders themselves were contractually binding.17 February 2014“… Kevin … will talk to you and Supercars to preparing and send us thenew planning 2014asap! [Furthermore] we talked abouttheinitial order and the depositwe expecting urgently to order the cars by Daimler AG factory!”This appears to draw a distinction between the “new planning 2014” and “initial order” which was to come with a “deposit”.28 February 2014“We are very sorry but we [do not] asked and expected an amended sales forecast 2014, but theamended ordering plan 2014 commitment, which we must forwarding to Daimler AG head office and they canplanningourbinding purchase ordersfor the production within 2014 …”The use of the adjective “binding” in reference to the purchase orders, but not in reference to the “ordering plan 2014 commitment”, implies that the latter wasnotbinding. Rather, the “ordering plan 2014 commitment” was to be used by Daimler toplanthe “binding purchase orders”.3 March 2014“… Before I will forwarding thefinal planning order 2014for Singapore today to Daimler AG, please be informed that after talked to them today and try to get the info about the approx. Delivery time for [two car models], unfortunately they did not give me any delivery date …”This shows that the “final planning order 2014” was to be made at a time when crucial information, such as the estimated delivery dates for various car models, were not known. This fortifies the conclusion that the Planning Orders were not intended to be contractually binding.29 April 2014“… [W]e must not forget that we have to realise our planning for Singapore market for 2014 too! There are approx. 100 units MB/LO cars we have agreed to selling in Singapore market within 2014and have to show Daimler AG that we can realise our planningwe sent them for the Singapore market[so that] they will send us their positive answer for other additional new marketsin the future too!”This implies that failure to order the quantity stated in the Planning Orders would not be a breach of contract. The consequence was instead a practical one: Daimler would be less willing to allocate units to Lorinser for new markets if Lorinser did not show that it could achieve the existing targets set in the Planning Orders. 38 EH’s e-mails were not always consistent in their terminology. But when pieced together within their context, and interpreted in a common sense manner, it is clear that terms such as “planning”, “ordering plan”, “sales planning”, “official planning” and “ordering plan … commitment” all referred to the same thing – the Planning Orders – and that they were intended to allow Daimler to plan its production for the year. Only the Purchase Orders were understood to be contractually binding, a fact reflected in the timing for the payment of each deposit (ie,only after a Purchase Order had been placed). This confirms the view which we reached on the basis of the First Draft Agreement alone. 39 This is not to say that the Planning Orders lackedpracticalsignificance. Daimler was free to refuse to allow buyers to subsequently purchase cars which were not included in the buyer’s submitted Planning Order for the year (and, indeed, Daimler might not be able to accommodate such unplanned orders even if it wished to). Moreover, falling significantly short of a submitted Planning Order could have adverse consequences for a buyer’s future allocations. Thus, Daimler’s buyers were aware that Daimler both expected the Planning Orders to be substantially adhered to and had the means to commercially penalise buyers who failed to adhere to them. It was in that sense that the Planning Orders were “firm” or “binding” commitments. 40 During the oral arguments before us, we shared our provisional views on the issue with Benzline’s counsel, Mr Leslie Yeo (“Mr Yeo”), and invited him to clarify and justify Benzline’s position. After a few somewhat circular exchanges, Mr Yeo stated that Benzline was not asserting that the Planning Orders constituted a contract, and agreed that the Planning Orders were in the nature of a set of intentions and expectations, rather than binding contractual obligations. It was, he said, the Purchase Orders which implemented those intentions and expectations in a binding form. We find that revised position much more sensible. 41 In contrast to the Planning Orders, it is not seriously disputed that the Purchase Orders were intended to be binding, at least as between Daimler and Lorinser. For that purpose, the Rubicon would be crossed once Lorinser had placed a Purchase Order and then paid the deposit to Daimler. Mr Ng explained the process as follows during the trial below: Q  So this confirmation that comes from Daimler [after a Purchase Order is placed] which you mention is just to say, “I can produce this car for you”? A  Yes. Q  But no production starts? A  That’s right. Q  And for Lorinser to place a firm order, Lorinser would require a 30% deposit for the cost of the cars from Benzline, agree? A  Yes. Q  And without receiving this 30% deposit, Lorinser is not going to tell Daimler, “Okay, please proceed to the order”? A  That’s right. They wanted us to confirm. Q  And Benzline similarly wouldn’t want to provide a 30% deposit until Supercars comes up with a 30% deposit? A  That’s right. Q  So when Supercars failed to come up with a 30% deposit, Benzline had---did not pay 30% deposit to Lorinser? A  That’s right. Q  And Supercars would be confirming orders by way of providing you with a 30% deposit? A  To confirm orders, orders had to be placed. Q  That means the 30% deposit also had to be provided to you? A  Yes. Q  So when Supercars did not provide 30% deposit for some of the cars, those orders were not confirmed orders? A  That’s right. Mr Chong’s evidence was consistent with this: he testified that to his knowledge, once a deposit had been paid to Daimler, Lorinser would be unable to cancel a Purchase Order. It should be remembered that Mr Chong was testifying for Supercars when he gave this evidence. Mr Chua conceded the same, although he qualified it by stating that more minor modifications to an order (such as changing the options or the variant of a model) were permissible. 42 The significance which the Planning Orders were to have as between Lorinser and Benzline (and, by implication, between Benzline and Supercars) was slightly different. The relevant provisions of the First Draft Agreement stated, in translation: 6.4 Basically, the order is concluded by remittance of Lorinser’s pro-forma invoice including particulars concerning the order such as the expected date of delivery, etc. 6.5 However, the contract of sale is concluded subject to a condition precedent that the purchase price, described under clause 8.1 concerning the base vehicle of Mercedes Benz, was received by Lorinser. … 8.1 Payment of full purchase price with respect to Mercedes Benz base vehicle within two weeks after receipt of the Lorinser pro forma-invoice. Payment can be made by bank transfer or by means of an irrevocable, confirmed letter of credit in favour of Lorinser. 8.2 Payment to be remitted for the Lorinser remodelling as soon as the manufacture delivered the vehicles to Lorinser. Delivery must be pre-announced approximately 7–14 days in advance at the Authorised Dealer. The Lorinser remodelling is only and only then to be carried out when Lorinser received the respective payment for the remodelling. Payment is to be made by bank transfer. 43 The effect of these terms was that as between Lorinser and Benzline, each Purchase Order was to be binding once apro formainvoice from Lorinser, including the necessary details, was received by Benzline, provided that Lorinser then received full payment for the base Mercedes-Benz cars (but not the Lorinser modifications). In practical terms, this meant that Benzline was bound once full payment for the base Mercedes-Benz cars had been received. The difference between this and the arrangement between Daimler and Lorinser can be better explained with the aid of the following chart, which depicts the relevant part of the ordering process:  Under the Benzline–Lorinser Agreement, Benzline was to be bound by a Purchase Order at stage A as depicted in the chart, when it had paid Lorinser for the base Mercedes-Benz cars. As between Lorinser and Daimler, Lorinser was to be bound at stage B instead, when the 30% deposit had been paid to Daimler. 44 What is striking about this arrangement is that Lorinser made sure to more than cover its liabilities to Daimler: by the time Lorinser paid a deposit and became bound by its Purchase Order to Daimler, it would have already received full payment for the cars it was ordering from Daimler. It follows that, once the Exclusive Sub-Dealership Agreement was concluded on back-to-back terms, Benzline would have been similarly protected. In the ordinary run of things, Daimler’s processes would only be set in motionafterfull payment for the Mercedes-Benz cars had been channelled from Supercars to Benzline and subsequently to Lorinser.",
        "Was there a failure of consideration/basis grounding a claim in unjust enrichment?": "The law 45 The three requirements of a claim in unjust enrichment are (a) enrichment of the defendant, (b) at the expense of the plaintiff, and (c) circumstances which make the enrichment unjust (ie, the presence of an “unjust factor”): seeSkandinaviskaEnskilda Banken AB (Publ), Singapore Branch v Asia Pacific Breweries (Singapore) Pte Ltd and another and another appeal[2011] 3 SLR 540 at [110]. Additionally, the defendant may attempt to raise defences to defeat the claim in whole or to reduce the quantum of the claim. In the present case, the first two requirements are not seriously contested. The crucial question is whether the third requirement is satisfied. 46 The specific unjust factor relied upon in this case was pleaded as a failure of consideration, which the Judge referred to instead as a “failure of basis”; the two terms are synonymous (and should not be confused with the more controversial thesis, which is not before us, that the law of unjust enrichment should be centred around the concept of “absence of basis”: see Prof Andrew Burrows,The Law of Restitution(Oxford University Press, 3rd Ed, 2011) (“The Law of Restitution”) at pp 95–116). The concept of failure of basis is succinctly summarised in Prof Charles Mitchell, Prof Paul Mitchell & Dr Stephen Watterson,Goff & Jones: The Law of Unjust Enrichment(Sweet & Maxwell, 9th Ed, 2016) (“Goff & Jones”) at para 12–01, as follows: … The core underlying idea of failure of basis is simple: a benefit has been conferred on the joint understanding that the recipient’s right to retain it is conditional. If the condition is not fulfilled, the recipient must return the benefit. … The inquiry has two parts: first, what was the basis for the transfer in respect of which restitution is sought; and second, did that basis fail? 47 The first stage is largely common sense, but three less obvious points must be observed. 48 First, it is important not to confuse “consideration” in the familiar contractual sense with “consideration” or “basis” in the law of unjust enrichment. Consideration in contract law refers to a counter-promise given in exchange for a promise. But in the law of unjust enrichment, consideration/basis refers to one of two things. 49 In the promissory sense, consideration/basis is the performance of a counter-promise, to be distinguished from the counter-promise itself: seeFibrosaSpolka Akcyjna v Fairbairn Lawson Combe Barbour Ltd[1943] AC 32 (“Fibrosa”) at 48. This is only logical: when a party performs its part of the bargain, it does so not in reliance on the mere legal existence of the counter-promise, but rather in the expectation that the counter-promise willactually be performed. As the House of Lords put it inFibrosa(at 48), in the context of a payment made on a contract which was frustrated,“[t]he money was paid to secure performance and, if performance fails the inducement which brought about the payment is not fulfilled”. 50 Additionally, in the context of unjust enrichment, consideration/basis can also refer to what Prof Burrows describes as “a non-promissory contingent condition”,ie, an expected event or state of affairs which neither party is responsible for bringing about: seeThe Law of Restitution(supraat [46]) at pp 320–321; Prof Peter Birks,Introduction to the Law of Restitution(Oxford University Press, 1985) at pp 223–224, quoted with approval by Robert Walker LJ inGribbonv Lutton[2002] 2 WLR 842 at [61]. An example of restitution being ordered for failure of this sort of basis isUnited Artists([20]supra), in which the High Court ordered restitution of a payment made as a pre-contractual deposit on an anticipated contract which eventually failed to materialise. Similarly, inRoxboroughv Rothmans of Pall Mall Australia Ltd[2001] HCA 68 (“Roxborough”), the High Court of Australia ordered restitution of a payment intended to cover a tax which was later declared to be invalid. InUnited Artists, there was no promise that a contract would materialise, just as inRoxboroughthere was no promise that the tax would be validly imposed; the conclusion of the contract and the validity of the tax were both conditions which no party was obligated to bring about, but which the parties expected would be fulfilled in future. Nonetheless, restitution was available when those conditions failed. 51 Secondly, not every expectation which a party has in making a transfer forms part of the basis of that transfer. The basis of a transfer must be objectively determined based on what is communicated between the parties; the parties’ uncommunicated subjective thoughts are irrelevant: seeGoff & Jones(supraat [46]) at para 13-02. A basis may be expressed, but it may also be implied, as was done inRowland vDivall[1923] KB 500 (“Rowland”). In that case, the English Court of Appeal found that the basis for a car buyer’s payment was that the seller had good title to the car to sell, even though nothing had been said in that regard. That the seller had good title to pass to the buyer was a fundamental feature of the sale and could be implied as part of the basis for the payment: seeGoff& Jonesat para 13-06. Significantly, it is clear from the authorities that even where a basis is implied, that implication must be based on objective features of the transfer and its context, and not merely on a fortuitous overlap between the unexpressed expectations of the parties. InRowland,the passage of good title was objectively fundamental to the sale of a car, and this would have been apparent to any observer. The reasoning inRoxboroughcan be analysed in the same way. Although there had been no express provision or discussion regarding whether the disputed portion of the payment was conditional on the tax being payable, it was objectively ascertainable that the tax being payable was an implied basis for that portion of the payment: that portion was reflected in the invoices as a “tobacco licence fee”, and it therefore stood to reason that it was dependent on a tobacco licence fee being payable to the government in the first place. 52 Thirdly, although it is usual and convenient to refer tothebasis of a transfer, the reality is that, as the learned authors ofGoff & Jonesobserve at para 13-14, a transfer may have more than one basis.Rowlandis an example of such a situation: the physical delivery of the car was, no doubt, a basis of the buyer’s payment, but, equally fundamentally, was the transfer of good title. Thus, the relevant “basis” inRowlandwas delivery of the caraccompanied bytitle. The fact that the car was delivered without good title meant that a fundamental component of the basis had failed, such that it could (under the orthodox position that total failure is required) legitimately be said that the basis had wholly failed even though the buyer had physical possession of the car for several months before the defect in title was discovered. 53 Having identified the basis of the transfer, the next step is to determine whether that basis has failed. The prevailing position is that the failure must be total, not partial. The exception, if it can be called one, is where a contract is divisible such that it can be said that there has been a total failure of the consideration for/basis of a discrete part of that contract: seeMax Media FZ LLC v Nimbus Media Pte Ltd[2010] 2 SLR 677 at [24], citingFibrosaat 77. 54 It has been argued that the requirement of a total failure is artificial, and that the law should evolve to recognisepartialfailure of consideration/basis as a ground of restitution even in indivisible contracts. Prof Burrows inTheLaw ofRestitution(supraat [46]) contends at pp 325–326 thatRowlandand similar cases should be reinterpreted as allowing restitution of money for partial failure of consideration. Such arguments were not, however, raised by the parties in the present dispute, nor does it appear that they would make a difference in the result. We therefore proceed on the footing that the failure must be total, without necessarily foreclosing the possibility of future developments in this regard. 55 Finally, we touch briefly on one situation which can give rise to particular difficulties: that of advance payment on a contract. The availability of restitution often depends on whether such a payment is characterised as a deposit (properly so called) or only a part payment. A useful summary can be found in Prof Yeo Tiong Min, SC’s lecture “Deposits: At the Intersection of Contract, Restitution, Equity and Statute” (Yong Pung How Professorship of Law Lecture, 16 May 2013) at para 4. In brief, the basis for the payment of a deposit is to serve as an earnest for the payor’s performance,ie, as a disincentive (by the mechanism of forfeiture or retention of the deposit) to the payor’s breach. Naturally, the ability of the payee to forfeit or retain the deposit also helps to protect the payor from the losses which would be caused by the breach. However, the incurring of loss by the payor isnot, unless otherwise provided, a precondition for the forfeiting or retention of the deposit, nor is it part of the basis for the payment. 56 There are, of course, situations in which even that basis can totally fail (such as thepayee’srepudiatory breach), but termination by the payee for thepayor’srepudiatory breach is not one of them. This is because, among other things, ordering restitution in such circumstances would allow the payor to profit from his own breach: seeLee Chee Wei v TanHor Peow Victor and others and another appeal[2007] 3 SLR(R) 537 at [84]. Application to the present appeal 57 The Judge found that the Payment was made in order to show good faith and seriousness, and that an implicit and integral part of its basis was that it should be refunded if the Exclusive Sub-Dealership Agreement was not concluded. We respectfully disagree. The Judge’s analysis was – understandably but erroneously – modelled on the reasoning inUnited Artists(supraat [20]). In that case, Belinda Ang J found that the payments made by the plaintiffs were intended as “pre-contract deposits which served as an indication of the plaintiffs’ confidence with funding, genuine interest and seriousness” in the deal (at [186]). Put differently, the payments were made on the basis that they were todemonstratethat the plaintiffs were willing and able to perform the contemplated agreement, rather than to serve as an earnest for performance. This was despite the fact that the payments were used, and the plaintiffs knew that they would be used, to pay differential premium payments due to the Land Office. 58 It may appear that the facts in the present appeal are analogous to those inUnited Artists. The contemplated Exclusive Sub-Dealership Agreement corresponds to the contemplated development and lease agreement, the Payment here corresponds to the payments there, and the use of the Payment to pay the deposit to Daimler corresponds to the use of the payments to make differential premium payments due to the Land Office. On closer examination, however, we agree with Benzline’s submission that that appearance is misleading. 59 To begin with, three important facts were present inUnited Artistswhich are absent here. First, there were multiple references to “good faith payment” and the like in the documentary evidence (at [185]); second, the defendants had specifically sought “tangible assurance of [the plaintiffs’] financial ability” to complete the deal (at [186]); and, third, it had been repeatedly emphasised during the negotiations that all the arrangements were “subject to contract” (at [61]). It is unsurprising, given these facts, that Ang J reached the conclusion that the payments were – objectively – intended to be recoverable in the event of failure to reach a final agreement. 60  In contrast, we agree with Benzline’s submission that there is no evidence in the present case to suggest that good faith payment was ever discussed, or even that Supercars’ good faith, seriousness, or ability to perform was ever in doubt. In fact, the witnesses were unanimous in their evidence that, by the time the Payment was made, both sides were bullish about the success of the deal and saw the entry into the Exclusive Sub-Dealership Agreement as inevitable or even a mere formality. Moreover, although it is not disputed that only non-binding drafts of the contemplated Exclusive Sub-Dealership Agreement were ever exchanged, there was no express indication thatnoneof the arrangements were to be binding until the Exclusive Sub-Dealership Agreement was concluded. 61 If demonstrating good faith and seriousness was not the reason for the Payment, what was? We need not search far for that answer. The evidence shows that the Payment was requested because Daimler had been pressing Lorinser to pay the deposit on the Purchase Order for the first batch of cars, and Lorinser in turn had been pressing Benzline to pay or procure the money for the deposit (see [10]–[11] above). This explains why the sum was, in Mr Chong’s words, “urgently needed” by Benzline. This was not news to Supercars, as EH had, in his e-mail of 17 January 2014 sent to Mr Chua and copied to Benzline, urged Supercars to submit the First Purchase Order and to pay the deposit to Lorinser’s account, so as to allow Lorinser to pay the deposit to Daimler. Supercars was thus aware that Lorinser expected to receive payment from Supercars and that the payment would subsequently be channelled to Daimler. EH’s e-mail also reiterated to Supercars the fundamental concern that if the First Purchase Order was not placed soon and the deposit on it was not paid, the first batch of cars would be delayed and this in turn could make it difficult for Supercars to meet the sales target for 2014. This was because, from the time the supply process was set in motion, there would be a delay of some months (three to four months for cars produced in Germany, without factoring in time required for shipping and Lorinser’s modifications) before the cars would be available for sale in Singapore. All this was accepted by both Mr Chua and Mr Ng on affidavit and was not departed from at trial. 62 It should be noted that had the Exclusive Sub-Dealership Arrangement already been concluded (on terms mirroring the First Draft Agreement), such difficulties would not have arisen. Ordinarily, full payment for the base Mercedes-Benz cars would have been made by Supercars upon receipt of aproformainvoice. This full payment would have been channelled by Benzline to Lorinser, and Lorinser would have paid the deposit out of those moneys. But because neither the Benzline–Lorinser Agreement nor the Exclusive Sub-Dealership Arrangement was in place, there was nothing to oblige Supercars to make full payment to Benzline or to oblige Benzline to make full payment to Lorinser. Lorinser thus had no moneys (other than its own, which it was unwilling to risk) to pay the deposit out of. That was why anad hocarrangement had to be negotiated to allow the Daimler production process to be set in motion. 63 Adding to the time pressure was the fact that Daimler’s and Lorinser’s requests for payment came shortly before the Chinese New Year period. Supercars’ evidence was that its officers and employees were in the habit of taking a break of 10–14 days during this period. Further, Mr Yu would be returning to Malaysia for two to three weeks. It followed that if the Payment was not effected before the Chinese New Year period, there would likely have been a significant delay before Supercars would have been administratively capable of attending to the Payment. 64 In short,someonehad to immediately come up with the funds to pay Daimler in order to avoid an undesirable delay in the supply of Lorinser cars further down the road, and thus to allow the expected Exclusive Sub-Dealership Agreement to be effectively performed. Lorinser was unwilling to do so. So was Benzline, since it saw itself as essentially a middleman. Benzline therefore took the view that Supercars should be the one to come up with the money. Supercars, conscious of the urgency of the situation, acquiesced and made the Payment, and this allowed the First Purchase Order to be placed and the deposit on that order paid. Benzline in fact did use the $300,000 to pay the deposit to Lorinser, which then paid the deposit to Daimler, as stated by Mr Ng in re-examination. 65 For these reasons, we find that the purpose of the Payment was to enable Lorinser to pay Daimler the deposit and thereby to avoid future delay, and not to show good faith and seriousness. To her credit, counsel for Supercars, Ms Ho May Kim (“Ms Ho”), did not dispute the latter point before us. Instead, she focused on Supercars’ argument that – although the Payment was intended to be used to pay the deposit to Daimler – a further and integral part of the basis of the Payment was that it was conditional on the parties subsequently entering into the Exclusive Sub-Dealership Agreement. This argument had considerable force, particularly in the light of frankly disastrous testimony by Mr Ng in which, under cross-examination by Ms Ho, he agreed that the First Purchase Order was “placed on the condition that Supercars would be sub-dealer” (as noted at [52] of the GD) and that “[t]he $300,000 deposit was a pre-contractual deposit on the basis that the parties were going to sign a sub-dealer contract”. 66 Despite the attractiveness of Supercars’ argument, we have come to the view that the true basis of the Payment was slightly (but crucially) different from what Supercars asserts. Mr Ng’s testimony must be interpreted bearing in mind his lack of legal training. What a layperson describes as a “condition” or “basis” may not be that in law. In the present case, it is equally plausible that, when read in context, Mr Ng’s answers reflect only that the partiesexpectedorassumedthat the Exclusive Sub-Dealership Agreement would be entered into, and not necessarily that this expectation/assumption was communicated and formed the legal basis for the transfer. When the testimony of the other witnesses is considered, it appears to us that there was no such communication, and that the assumption (if any) was just that: an assumption. Here, Mr Chua was the only witness to assert, at trial, that there had been express communication – allegedly by Mr Yu to Mr Ng – that the Payment was to be refunded if the Exclusive Sub-Dealership Agreement did not materialise. His assertion was at odds with his own affidavit of evidence-in-chief (“AEIC”) as well as that of Mr Yu, which stated merely that no one from Benzline had told them that the Payment wasnotrefundable. Since any express statement of refundability/conditionality by either party would be obviously beneficial to Supercars’ case, the absence of any mention of it in Mr Chua’s and Mr Yu’s AEICs gives rise to a strong inference that there was no such communication. Mr Yu’s own oral testimony was that he had anunderstandingthat the Payment was refundable, and that this understanding was based on unspecified conversations between both sides to the effect that the Exclusive Sub-Dealership Agreement “was [the] basis for the whole thing … to start off with”. In essence, it seems that he had taken the importance of the Exclusive Sub-Dealership Agreement, and the fact that it had sparked the process of negotiation in the first place, and had jumped to a conclusion on his own as to the refundability of the Payment. The last nail in the coffin is Mr Chong’s unequivocal answer on the topic of refundability of the Payment: “Nothing of that sort was discussed.” 67 Since the weight of the evidence is against there having been any express understanding that entry into the Exclusive Sub-Dealership Agreement formed part of the basis of the Payment, the next question is whether that basis can be objectively implied. In our view, it cannot be. As earlier stated (at [51] above), mere fortuitous agreement between parties’ unspoken assumptions is insufficient; the basis to be implied must be fundamental to the transaction, or otherwise obvious to an objective observer. It was inherently unlikely that Benzline would be willing to place in Supercars’ hands the ability to claw back the Payment simply by refusing to sign the Exclusive Sub-Dealership Agreement later. This would have placed on Benzline the very risk which it had taken pains to avoid, and which had led it to involve Supercars in the first place: the risk of being liable for the Lorinser cars and potentially having to sell them directly. Apart from the unfairness to Benzline, that interpretation would also come close to allowing Supercars to be rewarded for its own wrong (although, strictly speaking, the withholding of agreement would not generally be a wrong). Such a perverse incentive to withdraw would cut against both parties’ intentions for the venture to succeed. Moreover, Supercars did not make the Payment blindly, but having had sight of the First Draft Agreement. Objectively, this must indicate that the terms in that agreement were, in the main, acceptable to Supercars. It would make little sense for Supercars to be able subsequently to back out and retrieve the Payment due to disagreement with a term already in the First Draft Agreement. 68 In these circumstances, we find that the implied basis for the Payment was not that the partieswouldenterintothe Exclusive Sub-Dealership Agreement, but that Benzline wouldofferSupercars the Exclusive Sub-Dealership on terms which would correspond in material ways to the First Draft Agreement. That is what an objective observer would conclude from the whole course of conduct of the parties leading to that point. 69 Moving on to the second stage of the inquiry, we find that this basis did not fail. Benzline was prepared to move forward with the Exclusive Sub-Dealership Agreement. It was Supercars which threw a spanner in the works by refusing to agree to provide a standby LC and, subsequently, suggesting that it contract directly with Lorinser and by-pass Benzline altogether. Given the existence of that unresolved agreement (an apparently irresolvable one, given Lorinser’s insistence on a standby LC), there would have been no point in Benzline drafting and sending Supercars a copy of the Exclusive Sub-Dealership Agreement for signature; Supercars would, on its own evidence, have declined to execute it. Granted, had the Second Draft Agreement contained terms drastically different from those of the First Draft Agreement, Supercars might have had a good argument that the introduction of the new terms meant that the basis earlier defined had failed. But that was not the case: the term requiring a standby LC had been included, and translated, in the First Draft Agreement (as cl 18.2). All that was missing from cl 18.2 was the quantum of the standby LC. Although that detail was doubtless significant, Mr Chua clearly stated, at numerous points in his oral testimony, that his objection was based not on the quantum, but on the fact that a standby LC was required at all. Moreover, the quantum of the standby LC (€250,000) was not outlandish given the value of the car orders which the parties expected to be placing. In other words, the situation which arose – disagreement over a term which had earlier been communicated to Supercars – did not to any extent undermine the basis for the Payment. 70 For the avoidance of doubt, we note that our analysis has not required us to determine, first, whether the First Purchase Order gave rise to a binding contract and, if so, between whom, and second, whether the Payment was a deposit as between Supercars and Benzline. That is all for the better, as the answers to those questions would not be straightforward. On the contract point, the fact that the First Purchase Order was placed by communications between Supercars and Lorinser, without Benzline’s involvement, and at a time subsequent to the Payment, points toward Supercars and Lorinser being the contracting parties, if there was a contract formed. Yet there are indications to the contrary as well, such as the fact that parties all along intended to structure their dealings as notional sales from Benzline to Supercars. On the deposit point, although the Payment was no doubt intended to finally be used to pay a deposit (in the strict sense) to Daimler, it is less clear whether it was also intended to be a deposit (whether in the strict or loose sense) as between Supercars and Benzline. Regardless, it is for a plaintiff seeking restitution to identify the basis of a transfer and show that it has failed, and not for a defendant to positively establish its nature and continuing validity. For that reason, Supercars’ claim fails.",
        "Benzline’s counterclaim": "71 Since the Planning Orders were never intended to be contractually binding, the counterclaim for lost profits on the Planning Order for the Singapore market must also fail. 72 The same applies to the counterclaim for lost sales in Thailand. Further, the Judge was right to observe that not only was there “scant evidence that any agreement was reached in respect of cars for the Thai market”, there had not even been any Planning Orders submitted in respect of Thailand (see the GD at [87]). Thus, even if we had found that the Planning Orders were contractually binding, Benzline would still have no basis for this counterclaim. 73 Finally, the counterclaim for damages for breach of the Purchase Orders placed has more substance to it, but is ultimately also unsustainable. Even if we assume that the Purchase Orders gave rise to binding contracts, that Benzline is the proper party to bring a claim under them, and that the contracts were breached, we agree with Supercars that Benzline has not shown that it suffered any loss from the breach. Supercars points out that there are a number of significant evidential deficiencies in Benzline’s proof of losses suffered. More importantly, on Benzline’s own evidence, it has managed to find a substitute sub-dealer willing to take on both the exclusive sub-dealership and the purchase of cars. That substitute is Regal. As Mr Ng stated, it “agreed to take over the 30 cars as well as to commit to the balance of 70 cars for 2014”. Moreover, Regal has taken up the agreementon the same termswhich Supercars had intended to, as Mr Ng acknowledged at trial. Consequently, the burden of selling the Lorinser cars and recouping their costs has been passed to Regal, as he also acknowledged. This is confirmed by the terms of the contract between Benzline and Regal, which, as Supercars points out in its written submissions, give Benzline a contractual right to claim from Regal the costs of the cars, bank charges, freight, and the Lorinser modifications. 74 It follows from the above that any loss suffered by Benzline was a result of Regal’s default (ie, its failure to perform the contractual obligations it had taken on). Such loss was not caused by Supercars. Under cross-examination, Mr Ng effectively conceded as much in the following exchange: Q  And can I point you to paragraph 53 of your affidavit, the last sentence or the last two sentences? I’ll read it out: [Reads] “… However, since the 2nd Plaintiff was not able to fulfil their terms I then looked to Regal Motors. After discussion with Regal Motors, they agreed to take over the 30 cars as well as to commit to the balance” ---of--- “70 cars for 2014.” So I put it to you thatyou have sold the 30 cars and you do not have a claim for Euro 1.4 million.Do you agree? Just yes or no. AI agree but then again they have agreed to buy from me but they have not made full payment. [emphasis added in italics and bold italics] There is no indication that Benzline has attempted to sue Regal or otherwise compel Regal to perform its obligations. 75 During the oral hearing of this appeal, we gave Benzline’s counsel, Mr Yeo, an opportunity to address these problems. His frank admission that he saw the difficulty and had no answer is to be credited.",
        "Conclusion": "76 For the reasons given above, we find that both Supercars’ claim and Benzline’s counterclaim should fail. We therefore allow the appeal against the Judge’s decision in so far as it relates to Supercars’ claim, and affirm the Judge’s decision in so far as it relates to Benzline’s counterclaim. We set aside the order made by the Judge that Benzline pay Supercars Lorinser the sum of $300,000. As for the costs of the trial, the Judge’s order that Benzline pay the same is also set aside. 77 We will hear the parties on costs. The parties shall file and exchange their respective submissions on the costs here (including on quantum as we are likely to fix costs) and below (on principle, not quantum, as the costs below must go for taxation) within 21 days hereof. Such submissions shall be limited to ten pages each. Thereafter, they may file reply submissions within the following seven days, limited to five pages each. 78 For the parties’ guidance, we observe that this is a case where both the plaintiffs’ claim and the defendant’s counterclaim should have been (and have now been) dismissed. The applicable principles as to costs in such an outcome are accurately summarised in the headnote toMokKwong Yue v Ding Leng Kong[2012] 1 SLR 737 as follows: (1) … in a situation where both a claim and the counterclaim failed and were dismissed with costs and where there was a separate and substantial question raised by the counterclaim, there had to be substantial costs paid by the defendant to the plaintiff in relation to the counterclaim, and an apportionment of the costs. But where the subject matter of the counterclaim was identical to the defence or part of the defence, no apportionment should be ordered, but rather the plaintiff should be allowed only the extra costs incurred by reason of the counterclaim. … 79 In the court below, there was some overlap between the counterclaim and the defence to the claim, but it cannot be said that the counterclaim was “identical to the defence or part of the defence”. Benzline’s pleaded defence was simply that the Payment sought to be recovered was a deposit on a standalone agreement for the purchase of cars. Its counterclaim ranged much wider, embracing the enforceability of the Planning Orders, lost sales in Singapore and Thailand, and other matters which do not appear to be material to the defence. 80 In the present appeal, Benzline has succeeded but only in part and the issue on which it succeeded is distinct from the issue on which it failed. What is the correct costs order to be made in this situation? Applying the principles stated above, there appears to be a need for an apportionment of costs between Supercars and Benzline, albeit that apportionment would take into consideration those parts of Benzline’s counterclaim which would have had to be raised in any event as part of Benzline’s defence. Whether this is indeed correct and, if so, how the costs should be apportioned are issues which ought to be addressed in the parties’ submissions on costs.  Sundaresh Menon     Andrew Phang Boon Leong Judith PrakashChief Justice      Judge of Appeal   Judge of Appeal Leslie Yeo (Sterling Law Corporation) for the appellant;Ho May Kim and Harry Zheng (Selvam LLC) for the respondent."
    }
}