{
    "case_title": "BOIvBOJ",
    "ncitation": "[2018] SGCA 61",
    "coram": "Andrew Phang Boon Leong JA (delivering the grounds of decision of the court):",
    "sections": {
        "Introduction": "1 The field of litigation is a potential hotbed for excessive friction and, on the rare occasion, even the flaring of tempers and the engendering of ill-will. Fortunately, this is rare. Unfortunately, the present application allegedly involves one such occasion. It concerns a broken and severely fractured relationship between former spouses. Counsel for the Appellant (the ex-wife), Mr Thomas Sim, described it as a “high-conflict case”. But, indeed, he went further in this application: he argued that the High Court judge (“the Judge”) did not give his client a fair opportunity to put forward her case through her then counsel (his colleague). The Appellant therefore wanted the Judge to recuse herself from the case. An application was brought after consultation with her lawyers. The Judge heard and rejected the application. That led to the present appeal. We dismissed the appeal and now give the detailed grounds for our decision. 2 At the outset, two general but important observations, which also apply to the present case, are in order. 3 First, counsel are not the mere “mouthpieces” of their clients. They are not mere automatons, executing every instruction of the client, especially where the client wants each and every point to be taken in order to inflict maximum “damage” on the other party, and where the taking of such points is – in a word – pointless and would not only engender a wastage of the other party’s, but also the court’s, time and resources. There is a reason why lawyers are also known as “counsel” – in such situations, lawyers mustcounseltheir clients and apprise them of what is permissible and what is not. We operate within an adversarial system. However, as the learned Lord Chief Justice Cockburn observed in an extra-judicial address (see George P Costigan Jr, “The Full Remarks on Advocacy of Lord Brougham and Lord Chief Justice Cockburn at the Dinner to M Berryer on November 8, 1864” (1931) 19 Cal L Rev 521 at p 523), which our courts have endorsed and recapitulated on several occasions (most recently by this Court inGoh Seng Heng v Liberty Sky Investments Ltdand another[2017] 2 SLR 1113 at [62]): My noble and learned friend, Lord Brougham ... said that an advocate should be fearless in carrying out the interests of his client; but I couple that with this qualification and this restriction—thatthe arms which he wields are to be the arms of the warrior and not of the assassin. It is his duty to strive to accomplish the interests of his clientsperfas, but notpernefas; it is his duty, to the utmost of his power, to seek to reconcile the interests he is bound to maintain, and the duty it is incumbent upon him to discharge, with the eternal and immutable interests of truth and justice. [emphasis added] 4 In order to wield the “correct” set of arms, the lawyer, whilst owing a duty to his or her client, obviously cannot be the mere conduit pipe of that client. He also owes a duty – and indeed a paramount one – to the court. A lawyer has to tread afine linewhen adhering to these occasionally inconsistent duties in practice, but that is thevery essenceof being a legal professional. 5 On a related note, the lawyer also needs to guard against his or her own bias, which may be subconscious and insidious. In particular, the lawyer must guard against taking on, especially subconsciously, thepersonaof his or her client. This is all the more so in cases where the parties’ emotions run high. There is sound logic in this because a lawyer who takes on thepersonaof his or her client is also likely to lose his or her objectivity and sense of perspective. And such loss often results (ironically) in advice and possibly even outcomes that are ultimately to the client’s detriment. 6 Secondly, whilst patience and rectitude ought to be the ideal at all times, we are all only human. Hence, there must be the proverbial give and take on the part of both judge and counsel alike. This relates to the issue ofperspective, and the following oft-cited advice from a father to his daughter in a famous novel ought to be noted (see Harper Lee,To Kill A Mockingbird(William Heinemann Ltd, 1960; reprinted in the New Windmill Series, 1966) at p 35): First of all, … if you can learn a simple trick, Scout, you’ll get along a lot better with all kinds of folks. You never really understand a person until you consider things from his point of view … until you climb into his skin and walk around in it. 7 This sage advice was quoted by the Court of Three Judges inSingapore Medical Council v Wong Him Choon[2016] 4 SLR 1086(at [4]) in relation to the need for a doctor to be cognisant of the patient’s perspective as well, but it embodies a universal truth that applies perhapsa fortiorito the present case. In our view, both judge and counsel could have been more patient with each other had they stepped into each other’s shoes even if for a brief moment – with the lawyers concerned simultaneously realising that, if they had inadvertently stepped into their client’s shoes, they ought to have stepped out of them with some haste. 8 That having been said, impatience has never been a ground for recusal of a judge. The hope is that everyone is an angel but the truth is that we are all only human and ought to bear, as far as possible, with each other’s foibles and weaknesses. One cannot help but feel that had there been more give and take in the present case, it would not have escalated into the proceedings that we now have before us. Perhaps some good can come out of this unfortunate situation if judges and lawyers (and, indeed, all who are involved in the discipline of law) learn the lesson, if not of perfect patience, then at least of the need for perspective as well as for self-restraint that has the quest for patience at its foundation, especially when every fibre within oneself seeks (or even cries out) to conduct oneself otherwise. Notwithstanding the fact that it is often bandied about out of context, there is much truth in the old adage that one ought to at least disagree without being disagreeable. 9 With these observations in mind, we now turn to the case proper.",
        "The factual backdrop": "10 The parties to the present appeal are former spouses. The Appellant commenced divorce proceedings on 23 December 2013 and interim judgment was granted on 4 February 2014. 11 The ancillary matters were scheduled to be heard before the Judge on 9 November 2016, 8–9 February, 18 April, 21 April, and 20–21 June 2017. A further full day hearing date was fixed on 11 July 2017. 12 On 7 July 2017, the Appellant filed Summons No 240 of 2017 (“SUM 240”) in the High Court seeking the recusal of the Judge from hearing the ancillary matters, and for another judge to hear the same. The application for recusal was premised on the Judge’s alleged conduct at the hearings on 18 April, 21 April, 20 and 21 June 2017. 13 On 2 October 2017, the Judge heard the parties and dismissed SUM 240. 14 In the parties’ submissions below, the Appellant’s main ground for recusal was that the Court had been infected by apparent bias. The Appellant elaborated that this was because her counsel had been unduly hampered in the presentation of her case before the Judge; the Judge had favoured the Respondent by giving his counsel more time and greater leeway; and the Judge had prejudged the case against the Appellant without having heard the parties fully. 15 The Respondent submitted that apparent bias was not made out on the facts. The Respondent added that the recusal application was a backdoor appeal prematurely brought before any order was made by the Judge because the Appellant was unhappy with the Judge’s factual findings. Further, as a matter of public policy, the recusal application should not be allowed as it would condone “judge shopping”. 16 At the time this appeal was heard, the hearing of the ancillary matters in the divorce suit had not concluded and no orders had been made.",
        "The decision below": "17 The Judge saw no reason to recuse herself. In her unpublished grounds of decision, she began by describing the general procedure in ancillary matters hearings. Unlike trials, ancillary matters hearings do not involve cross-examination of parties and witnesses. Instead, evidence for such hearings would comprise affidavits of assets and means as well as joint summaries of relevant information. The evidence is supplemented by written submissions. All the court is concerned with is the objective evaluation of what has been placed before it. The court can therefore adopt a more interventionist judge-led approach. This, according to the Judge, is reinforced by r 22 of the Family Justice Rules 2014 (GN No S 813/2014) (“the FJR”), which provides as follows: Power to make orders and give directions for just, expeditious and economical disposal of proceedings 22.—(1) Despite anything in these Rules, the Court, when dealing with any cause or matter, is to adopt a judge‑led approach — (a) to identify the relevant issues in the cause or matter; and (b) to ensure that the relevant evidence is adduced by the parties to the cause or matter. (2) In adopting a judge‑led approach, the Court may, at any time after the commencement or at the hearing of any proceedings, of its own motion or on an application by any party to the proceedings, direct any party or parties to those proceedings to appear before it, for the Court to make such order or give such direction as it thinks fit, for the just, expeditious and economical disposal of the cause or matter. … The Judge added that the court has wide powers to manage the flow of the proceedings, including the power to limit time for oral arguments. 18 Next, the Judge rejected the allegation of prejudgment on her part. She explained that after she had reviewed each issue with counsel, she would sometimes indicate her finding or likely findings. In any case, there were still issues that had not been covered, and she could not have prejudged the outcome of the case since the factual matrix would have to be viewed in its entirety in order to arrive at a decision on the division of matrimonial assets and maintenance. 19 The Judge also made some observations on counsel’s conduct of the case. Acknowledging that she had been less than patient with lead counsel for the Appellant below, Ms Linda Joelle Ong (“Ms Ong”), she also commented that Ms Ong tended to prevaricate and not give direct answers to questions or issues posed. Additionally, Ms Ong frequently engaged in whispered exchanges with her assistants and spent time looking for documents and affidavits. On the other hand, counsel for the Respondent below, Ms Judy Ang (“Ms Ang”), was direct in answering questions and upfront in acknowledging any point that she had not covered or was not sure about. 20 The Judge further explained that her approach was to pose questions in order to furnish counsel the opportunity to specifically address her concerns, and to provide clarification whenever such clarification was required.",
        "The issues": "21 We first set out the gist of the parties’ cases on appeal. We will delve into further details where appropriate. 22 The Appellant’s case was essentially two-pronged. First, the Appellant argued that the Judge was apparently biased against her and that she had wrongly applied the “real danger” or “real likelihood” test, as opposed to the “reasonable suspicion” test, in determining whether apparent bias had been made out. 23 Secondly, the Appellant reiterated largely the same arguments on apparent bias as she did before the Judge below: (a) The Judge had unduly obstructed and hampered Ms Ong from effectively presenting the Appellant’s case. (b) The Judge had treated the parties unequally by giving Ms Ang more leeway and time. (c) The Judge had prejudged the case in a manner adverse to the Appellant and was not open to hearing evidence that did not conform to her pre-formed views. On one occasion, the Judge led Ms Ang to make certain arguments that purportedly reached the conclusion that the Judge had already made. 24 The Respondent refuted the above arguments, reiterating in particular the policy argument that the Appellant’s unfounded allegations of bias should not be allowed as they would create doubt in the public’s mind about the impartiality of the judiciary and hinder the effective administration of justice. 25 We will address three grounds for recusal, although we note from the outset that the Appellant subsumed the second and third grounds under an overarching argument in relation to apparent bias: (a) whether the doctrine of apparent bias was made out; (b) whether the Judge had predetermined the issue; and (c) whether the Judge interfered excessively in the proceedings, thus denying the Appellant a fair opportunity to present her case. 26 Given that these grounds overlap to some degree and, as counsel for the Appellant noted in his oral submissions, the arguments made were interrelated points, we will begin by setting out the applicable legal principles before applying them to the facts.",
        "The applicable principles": "",
        "Apparent bias": "115 The Appellant raises the following arguments to support her case on apparent bias: (a) First, the Appellant argues that Ms Ong was unduly hampered in the presentation of the Appellant’s case because she was allegedly interrupted mid-sentence and berated constantly by the Judge. The “harsh comments” and “hostile environment” made it “impossible for [Ms Ong] to effectively present the [Appellant’s] case to the Court”. According to the Appellant, the Judge repeatedly raised her voice, used harsh rebukes such as “Stop”, “Enough”, “No”, “Never mind”, and “Don’t bother”, and, on at least two occasions, slammed her hand on the table. (b) Second, the Appellant argues that the Judge pre-judged certain issues, including the purpose of moneys that the Appellant loaned from her sister. (c) Third, the Appellant argues that the Judge treated the parties unequally, and this can be seen from (a) the wide latitude given to the Respondent to introduce new arguments and/or allegations that were unsupported by affidavit evidence; (b) the relatively less intense scrutiny given to the Respondent’s case; and (c) the Judge’s inclination to find in favour of the Respondent on issues in the absence of documentary proof from the parties. 116 We disagree with the Appellant’s arguments, and we find that the circumstances would not give rise to a reasonable suspicion or apprehension of bias on the part of the fair-minded and informed observer. We make five points in relation to this. 117 But before we elaborate on these points, we make a preliminary observation. The recusal application was brought based on what transpired during the final ancillaries hearings, and the proceedings were captured by Appellant’s counsel in an unofficial transcript that the Appellant has relied heavily upon. The Respondent has not objected to the accuracy of this transcript. We note, however, the Judge’s comment that she did not accept it wholesale though it did cover the salient aspects of the proceedings. Indeed, we find the transcript to be tinted with a certain view of the Judge and the proceedings. This is evident from the various editorial adjustments to the transcript, such as the use of uppercase, multiple exclamation marks and the inclusion of the recorder’s comments in parentheses. 118 For instance, during the proceedings on 18 April 2017, it was recorded that the Judge went “on rant for 2 minutes about tables and their importance”. Further, the following exchanges between the court, Ms Ang, and Ms Ong (both counsel were referred to as “JA” and “LO” respectively in the transcript) transpired on 18 April 2017: Court:  Cut to the chase. Show me that JA: This is at Vol 2 (Part A), Tab 12, page 48. End of policy year 8 is 14 November 2014, as YH can see the policy inception date([Judge]reads document with no objection-asks for a letter from [Ms Ang])) LO:  YH we have… Court:MS.ONG I’m recording this, please! (she not typing) … JA:  Ok the later affidavit is Tab… Court:  They obviously consider it VERY important (so sarcastic/snide) LO:  No YH, my point wa… [emphasis added in bold italics] 119 In our view, the heavy editorial hand that ran throughout the transcript demonstrated – quite ironically − a loss of objectivity anda subconscious bias againstthe Judge. This is the very pitfall that we cautioned against at [5] above, and it is indicative that the Appellant’s counsel has failed to take a dispassionate view of the proceedings.It also brings to the fore the importance of bearing in mind that the reasonable observer is not to be confused with the person who has brought the complaint (see [101] above). We are satisfied that even if we were to wholly accept the transcripts (including whatthe use of uppercase was intended to convey as well as the aforesaid parenthetical remarks), there would still not have been a reasonable suspicion or apprehension of bias. 120 The first reason for this is that the manner in which the proceedings panned out required the Judge to play a more active role in case management. As the parties had said, the case was a “high conflict” one, and parties therefore had little success in narrowing the disputed issues and facts down to a more limited scope. In fact, we had the impression that counsel were instructed to challenge every last point, and this unnecessarily prolonged the proceedings to a great extent. 121 For instance, one of the issues that caused annoyance was an asset referred to as monies in a Thinkorswim account. The Judge thought that there were many aspects of this account that the parties could have reached agreement on – such as the date on which the account was opened, the date on which the account was closed and the closing balance. Yet, a considerable amount of time was expended on these easily ascertainable (and objective) facts, as the Appellant sought to argue that she had suffered a net loss in relation to that account, which was a wholly separate substantive point. 122 Shortly thereafter, the parties dealt with another asset, a fixed deposit account, which the wife had labelled as “unknown” in the parties’ joint summary. The Judge thought that the account should be excluded from the matrimonial pool because the account had been closed on 31 May 2008, many years before the divorce proceedings. The Appellant explained that she had labelled the account as “unknown” because the Respondent had claimed, in an earlier affidavit, that the account was closed on 1 June 2007 instead, and because they were not aware of the closing balance of the account. Again, a lot of time was expended, even though it would not have mattered whether Ms Ong was right about the date or not. As the Judge noted (based on the Appellant’s transcript), after listening to what counsel had to say: There was an email of 1 February 2016 from the same person at DBS saying that the account was closed as of 1 June 2007, which was exhibited in the husband’s affidavit of 12 February 2016 at page 17, Tab 55, Vol 13. As it would seem that this account was closed by June 2007 or May 2008. This account, as earlier stated will not be included in the pool. All this time wasted. … 123 This was, in fact, the basic manner in which the proceedings unfolded, as the Judge trudged through the items on the parties’ summary of assets, repeatedly imploring both counsel to narrow the scope of their dispute. Neither budged very much, purportedly on their clients’ instructions. Matters were made worse by the fact that the joint summary prepared by the parties did not state clearly what the dispute was, and after some questioning by the Judge, it became clear that, in respect of numerous issues, there was no real dispute to begin with and the parties could have come to an agreement between themselves. This led the Judge to tell the parties the following: … I told lawyers before as well as parties, it’s not the job of the court for both counsels or both parties to simply disagree. And then I run through and say after going through all of this don’t you agree that its very obvious? This is this, so why can’t you concede so that we can save time. So this approach I prefer to take. … … [In relation to the fixed deposit account earlier mentioned:] All I’m saying is that if it was factual, when the account was opened, when the account was closed, it’s factual. Agree or not? Cause if I were to look at it I can’t see anything to disagree. There is nothing for me to decide. So let’s not disagree for the sake of disagreement. … 124 The present case was therefore one that cried out for judicial intervention. The Judge had to keep a tight rein on the proceedings and steer them in the direction of a resolution of the final ancillary matters. We have some sympathy for the Judge because of the unenviable task that she faced. While she had to intervene and pose questions to the parties frequently, this was necessitated by how the proceedings were progressing (or, rather, not progressing). 125 It also did not help that the Appellant could not furnish information for matters that would ordinarily be within her knowledge. For instance, the Appellant, despite being the owner of the Thinkorswim account, did not know when the account was opened. Further, in relation to a car owned by the Appellant, the Appellant claimed to not have records of the value of the car at the time of the interim judgment because it was driven by the Respondent. The Judge offered a solution – to take the value of the Certificate of Entitlement at the time of the interim judgment and then to make adjustments based on that. She sought information in respect of this. Ms Ong agreed to speak to the client during the lunch break. When she returned after lunch, Ms Ong essentially repeated her client’s position that they had no evidence pertaining to the value of the car as of the interim judgment date, and that her client “leaves it to the court” to decide on the value of the car. 126 In our judgment, the fair-minded observer would have concluded that the Judge was not affected by apparent bias, but was determined to expedite the proceedings instead. As we have mentioned above, the observer may be taken to know generally that the court would adopt reasonable efforts to confine proceedings within appropriate limits and to ensure that time is not wasted (see [100] above), even if the observer is not to be taken to know of the minutiae of court procedure such as the judge-led approach provided for under r 22 of the FJR (cfthe Judge’s reasoning at [17] above). 127 On a related note, our second reason as to why the observer would not have reasonably apprehended or suspected bias is the fact that the Judge treated Ms Ang in asimilarmanner. For instance, in relation to the value to be ascribed to the Appellant’s car mentioned at [125] above, Ms Ang was admonished for not providing a proper basis of valuation: Court:  What value do you then propose? You cannot just disagree. When you do a Joint Summary, you take a position on it. JA: Estimated value of $25,000 Court: And how did you work that out? Based on? JA:  Based on my client’s car value, half of that YH. Court: I don’t think it helps me. I don’t know what your client’s car is. And half of that? Of what? Look this is a Court of Law it’s not a … 128 The Judge’s annoyance with the snail’s pace at which the proceedings were going was expressed towardsbothparties and their respective counsel. For instance, Ms Ang was chided for not promptly providing the relevant information to the Judge: Court:  So Ms Ang the next time you give me dates that would sort it out JA: Sorry YH Court:  If the wife or the husband takes issue with everything under the sun, right? Whether it is the wife or the husband then you point out to me all relevant information so I don’t spend 10 minutes or 20 minutes going through the dates!! JA:  Sorry YH And when Ms Ang unnecessarily wasted the court’s time, she too was admonished by the Judge. In particular, the Judge (understandably) grew annoyed when Ms Ang informed her belatedly of her client’s intention to exclude certain insurance policies reflected in the Joint Summary. The following exchange is recorded in the Appellant’s transcript of the proceedings: Court:  4F!!!! You mean we wasted all that time for a policy that was going to be excluded?? I cannot believe this!!!! I’m going to record this, I just cannot believe this! So which other policies are we excluding please? … Court:  … Counsel then informed the Court that 12 policies were excluded, including policy (f) for which we had spent time at the hearing to determine if the bonus was payable at time of IJ, when such an exercise was wholly unnecessary as this policy had been agreed for exclusion. Directions had even been given. Directions given for documentary evidence to be produced by Prudential are therefore revoked. I don’t wish to belabour the point, I just do this to illustrate all I’m asking for… look just be aware, WHY did we spend time on that policy?! And why was the comment made about that policy? Alright? JA: Do we still have to produce a document? Ct: NO! We don’t disagree for everything simply because, you know. These exchanges demonstrate very clearly that the Judge’s patience was being tested bybothcounsel’s inability to cut down on the issues of dispute, the unnecessary wastage of time, and the “high conflict” nature of the case. 129 This takes us to our third point: even if the Judge expressed her annoyance and frustration and was not a model of patience with the parties, that would not amount to apparent bias. Discourtesy is generally to be discouraged – but try as judges may, they will not always maintain a perfect judicial temperament, especially in a case like the present. We have touched on this above at [7]–[8]. 130 During the oral hearing of this appeal, counsel for the Appellant suggested that the question as to when discourtesy crosses into bias is a question of degree. His case on apparent bias is premised on the sustained, multiple occasions on which the Judge allegedly spoke to Ms Ong harshly. But we do not think that the test of apparent bias can be reduced to the number and severity of instances when the judge may be said to have been discourteous towards counsel. There is no magical threshold at which a judge is so discourteous that there is a reasonable suspicion of bias. The question is simply whether the fair-minded observer would reasonably apprehend or suspect bias, viewing the alleged instances of discourtesy in their respective contexts, and also taking into account other relevant circumstances (for example the judge’s demeanour towards opposing counsel). As we have earlier mentioned, the reasonable observer is taken to know of the traditions of integrity and impartiality that courts have to uphold. He or she will not jump to hasty conclusions of bias simply based on isolated episodes of temper or remarks taken out of context. Given the context earlier described, we do not think that apparent bias is made out at all. 131 The fourth point relates to the Appellant’s argument on prejudgment. The issue that the Appellant claims the Judge prejudged is whether loans taken by the Appellant from her sister were wholly for her legal bills (and should therefore be disregarded) or whether they went towards meeting family and household expenses. The Appellant’s argument on this issue is that the Judge focused solely on the evidence that supported the view that the loaned moneys were used for the Appellant’s legal bills and was not receptive to evidence that supported the other view, which Ms Ong highlighted the following day. 132 We do not agree with the Appellant. In the first place, the Judge refrained from making any final orders in relation to the division of assets until the outcome of this appeal. Putting that to one side, even if we accept that the issue was discrete, we do not think that the Judge pre-judged the matter. When this issue was first raised before the Judge on 20 June 2017, Ms Ong did not even put any contrary views across. During the hearing on 21 June 2017, Ms Ong then decided to highlight statements made by the Appellant in her affidavit which supported the Appellant’s position that the loaned sums were used for household expenses instead. The Judge responded with “Fine I will record it. I have gone through this but I can” and “Let me record so I don’t miss it”. She proceeded to note the citations given by Ms Ong. She then mentioned that the Appellant had made statements to that effect multiple times. She even invited Ms Ang to pick up the affidavits to look at what Ms Ong was referring to. This sequence of events detracts from there being prejudgment on the part of the Judge in two main respects. In the first place, the Judge had already seen and considered the evidence that Ms Ong wanted to raise. All Ms Ong did on 21 June 2017 was to highlight what the Judge already had sight of. Hence, even if the Judge had reached a firm conclusion after reading the affidavits, and Ms Ong did not have the opportunity to orally reiterate what was in the affidavits, that would not amount to prejudgment. More importantly, the Judge’s mind was not closed to what Ms Ong was raising. She wanted to record what Ms Ong said so that she would not miss it, only stopping when she realised that Ms Ong was raising something that she had already read. In our view, what the Appellant has raised is far removed from being a case of prejudgment. 133 Finally, we find that the Appellant’s argument on unequal treatment (which, in a nutshell, is based on the Judge’s preference for the Respondent’s case and the greater leeway that the Judge purportedly showed to the Respondent in respect of documentary proof) should more properly be regarded as a matter for appeal, not recusal.",
        "Prejudgment": "107 The rule against prejudgment prohibits the decision-maker from reaching a final, conclusive decision before being made aware of all relevant evidence and arguments which the parties wish to put before him or her. The primary objection against prejudgment is the surrender by a decision-making body of its judgment such that it approaches the matter with a closed mind (Sim Yong Tengat [50]). 108 While it has been said that prejudgment is distinct from (though related to) apparent bias (see the Singapore High Court decision ofPublic Prosecutor v Chua Siew Wei Kathleen[2016] 2 SLR 713 (“Kathleen Chua”) at [24]), the preponderance of authority has referred to prejudgment as something thatamounts to apparent bias. Locally, inSim Yong Teng, the appellants’ argument on prejudgment or predetermination was characterised as an apparent bias argument (at [47]). This Court agreed (at [63]–[64]) that any reasonable, fair-minded and fully informed observer looking at the circumstances of the case would have formed the view that there was prejudgmentamounting to apparent bias. In addition, inKay Swee Pin v Singapore Island Country Club[2008] 2 SLR(R) 802, this Court regarded prejudgment as a form of apparent bias (at [65]). Prejudgment has also been classified as a form of apprehended bias in most other jurisdictions: seeJohnson, and in particular [21], whereSouth African Rugby Football Union, Auckland Casino Ltd,Rv S (RD)andLocabailare cited; see also the recent High Court of Australia decision ofLaurie(where the High Court found that the reasonable observer would apprehend that the judge might not move from the position expressed in an earlier interlocutory judgment) and the English Court of Appeal decision ofOtkritieInternational Investment Management Ltd and others v Urumov[2014] EWCA Civ 1315 at [1]. 109 To establish prejudgment amounting to apparent bias, therefore, it must be established that the fair-minded, informed and reasonable observer would, after considering the facts and circumstances available before him, suspect or apprehend that the decision-maker had reached a final and conclusive decision before being made aware of all relevant evidence and arguments which the parties wish to put before him or her, such that he or she approaches the matter at hand with a closed mind. 110 To this, we would add the following. Judges are obliged to make the effort to prepare for a hearing beforehand and inevitably, provisional views and conclusions would be formed during such preparations: see the decision of this Court inPrometheusMarine Pte Ltd v King, Ann Rita and another appeal[2018] 1 SLR 1 (“Prometheus”)at [39]. The court inPrometheusalso noted that an open mind does not mean an empty mind and it is consistent with the judicial function to pose provisional views and concerns to counsel for them to be addressed. Indeed, as the court went on to observe, citingRe ShankarAlan, counsel are often assisted by the chance to peek into the judicial mind as they then have the opportunity to persuade the court to come to a different view if they so wish. The same view was expressed inJohnsonat [13]. The High Court of Australia noted that the reasonableness of any apprehension of bias was to be considered in the context of the exigencies of modern-day practice and the need for active case management. Judges could not be expected to sit mute until the presentation of the parties’ cases was over, and prejudgment could not be made out solely because tentative views reflecting a certain tendency of mind were expressed during exchanges with counsel.",
        "Excessive judicial interference": "134 The circumstances supporting the Appellant’s argument on apparent bias overlap with the basis on which the Appellant purports to demonstrate excessive judicial interference by the Judge, and we reiterate what we have set out at [120]–[130] above. 135 As this Court held inMohammed Ali bin Johariat [175(d)], what is crucial is thequalitative(not only the quantitative) impact of the judge’s interventions. The ultimate question to be answered, paraphrasing what was held inValley, is whether a reasonably minded person present throughout the ancillaries hearing would consider that the Appellant had not had a fair hearing. We answer this question in the negative and find that the Appellant was not hampered in the presentation of her case. 136 UnlikeNimMinimaartandKathleen Chua(see [113] above), the Appellant has not demonstrated how her case was hampered in any way. In addition, unlike a trial where evidence is to be elicited from the witness orally, Ms Ong was given ample opportunity to tender written submissions and joint summaries, which the Judge took note of. For these reasons, Ms Ong was not unduly hampered in the presentation of the Appellant’s case. 137 The Appellant argues that the Judge descended into the arena by asking leading questions to counsel for the Respondent in order to reach a conclusion that she had already made. The sole basis for this argument is the following exchange between the Judge and counsel for the Respondent on 20 June 2017: JA:  This was the 4th tranche Ct:So you are saying that the evidence could have been obtained well before? JA:Yes.I note that the Wife’s request to DBS for this confirmation was made on 2 December 2016, with the confirmation given on the same day Ct:So what does that imply to you? JA:It impliesto me she could have made the request and obtained it on the same day before the AM was filed. Ct:  Why could she have produced it on the same day? What could she have produced? She could have produced her bank statement, or anything.Is there anything you wish to imply? JA:It impliesthat she could have gotten the information before the filing the 2nd AM, with the cheque no. and cheque date. I take that this is an application for them to admit this evidence, and if it is admitted I will accept that this is the Wife’s contributions [emphasis in original] We reject this argument. The exchange is short and one-off, and on this sole basis, it seems too much of a stretch to draw the conclusion that the Judge descended into the arena and was pursuing a particular position as an advocate. We agree with the Respondent that the Judge was merely expanding upon and clarifying the point that the Respondent was making.",
        "Our findings": "",
        "Conclusion": "138 For the reasons set out above, we find that apparent bias was not made out and that the Judge did not interfere excessively in the proceedings. In the circumstances, the appeal is dismissed. 139 We would like to conclude much as we began. First, as we emphasised right at the outset of this judgment (at [3] above), counsel are not the mere “mouthpieces” of their clients. They have to be especially aware of this in family proceedings (such as the present) because such proceedings are frequently driven by emotional and even bitter clients. To the extent that they do not counsel (and/or even, if necessary, admonish) their clients and scrupulously observe their duty to the court, lawyers fail to live up to their calling as members of a profession whose hallmarks are honour and justice. 140 We also emphasised the importance ofperspective(at [6]−[7] above). It bears reiterating that had all concerned stepped into the other’s shoes, if even for a brief moment, the present situation might well have been averted. As we also said, however, counsel should alsoavoidstepping into their client’s (ill-fitting) shoes and should, if they have inadvertently done so, step out of them with some haste. There is some evidence that at least suggests that counsel were, in fact, guilty of this in the present case. Be that as it may, theperspectiverequired here is one characterised bypatience and empathy– the completeantithesisof what happened in this case. 141 Finally, we cannot emphasise enough how extremely serious allegations of judicial bias are. Indeed, such allegations can be utilised not only as a weapon of abuse by disgruntled litigants but also waste valuable court time and resources in the process. We would imagine that, by their very nature, such allegations would be rare in the extreme. Should such proceedings arise before the court in the future and be found to be unmeritorious, there may be serious consequences. Sundaresh Menon       Andrew Phang Boon Leong             Judith PrakashChief Justice        Judge of Appeal                             Judge of Appeal Sim Yuan Po Thomas, Linda Joelle Ong and Lim Xiao Wei Charmaine (Engelin Teh Practice LLC) for the appellant;N Sreenivasan SC and Lim Shu Fen (Straits Law Practice LLC) for the respondent."
    }
}