{
    "case_title": "Public Prosecutor vChia Kee Chen and another appeal",
    "ncitation": "[2018] SGCA 30",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 The present appeals arise out of the bloody and brutal killing of Dexmon Chua Yizhi (“the Deceased”). At some time between the late evening of 28 December 2013 and the early hours of the next day, the Deceased was abducted from the multi-storey car park near his home and forced into a van. He was then severely assaulted, as numerous blunt force blows were inflicted to his head and face, causing extensive fractures in his skull. Almost every bone from the bottom of his eye socket to his lower jaw was fractured. The Deceased was then dumped in the Singapore Armed Forces (“SAF”) live firing area in Lim Chu Kang. 2 The family of the Deceased reported on 29 December 2013 that he was missing. In connection with this, Chia Kee Chen (“Chia”), the appellant in Criminal Appeal No 41 of 2017 (“CCA 41”), was subsequently arrested on 31 December 2013 at the Woodlands immigration checkpoint, as he was returning from a short family holiday in Malaysia. On 1 January 2014, Chia led the police to what by then was the partially-decomposed body of the Deceased. 3 Chia was tried in the High Court, and the High Court judge (“the Judge”) convicted him of one count of murder under s 300(c) of the Penal Code (Cap 224, 2008 Rev Ed) (“the PC”) in furtherance of a common intention shared with one Febri Irwansyah Djatmiko (“Febri”), punishable under s 302(2) read with s 34 of the PC. He was sentenced to a term of life imprisonment. The Judge’s decision is published asPublic Prosecutorv Chia Kee Chen[2017] SGHC 5 (“the Judgment”). Chia appealed against the conviction in CCA 41 while the Prosecution has appealed against the sentence in Criminal Appeal No 40 of 2017 (“CCA 40”), seeking the imposition of the death sentence. 4 After hearing oral submissions on 9 April 2018, we dismissed Chia’s appeal in CCA 41 and upheld his conviction, for reasons which we will set out below. We reserved judgment in respect of the Prosecution’s appeal in CCA 40, which raises an important question concerning the relevance and weight to be placed on medical evidence pertaining to Chia’s mental state, in determining the appropriate sentence. In brief terms, we consider that in assessing the relevance of such evidence, the key question is whether there is a causal link between the medical condition that has been diagnosed and the factors that go towards the exercise of the court’s discretion in deciding whether to impose the death sentence. 5 In the present case, the Defence sought to rely on a psychiatric report which opined that Chia suffered from major depressive disorder at the time of the offence in December 2013. In our judgment, this report should be entirely disregarded because it fails to meet even the basic requirements that we expect of an expert report. Experts are duty-bound to be neutral and independent, and to assist the court rather than to advocate for a cause in a partisan manner. This remains the case regardless of how sincerely the expert may sympathise with the cause of his client. In any event, even taking the report as it stands, it would not be material because there is nothing in it that establishes the necessary causal link we have mentioned. We also take the opportunity in this judgment to reiterate the approach that a sentencing court should take when determining whether to impose the death penalty. Applying this approach, we allow the Prosecution’s appeal in CCA 40 and substitute the sentence of life imprisonment with the sentence of death. We now explain our decision.",
        "Background facts and charges": "",
        "The parties": "6 Chia is a 58-year-old male. He is married to Serene Goh Yen Hoon (“Mdm Goh”). 7 The Deceased was a 37-year-old male at the time of his death. He and Mdm Goh had been colleagues. They had an affair which began in August 2011 and ended sometime in June 2012. Chia found out about their affair sometime in November 2012. 8 Chia’s accomplice, Febri, is a 36-year-old male Indonesian. Febri was Chia’s long-time friend, having previously operated Chia’s fish farm in Tanjung Pinang, Indonesia. Febri remains at large in Indonesia. 9 Another involved party is Chua Leong Aik (“Chua”), a 68-year-old male. He too was Chia’s long-time friend. At the material time, he resided in an electrical substation beside Block 435, Choa Chu Kang Avenue 4, Singapore (“the substation”). He was arrested in the course of the investigations into the death of the Deceased, and subsequently pleaded guilty to charges of causing grievous hurt and abduction. At the time of Chia’s trial, Chua was serving a five-year imprisonment term.",
        "The discovery of the body of the Deceased": "10 In the afternoon of 29 December 2013, the Deceased was reported missing by his family members. The police found his car, which had been parked at Deck A3, Lot 290 in the multi-storey car park located at Block 429A, Choa Chu Kang Avenue 4, Singapore (“the car park”). The police found blood on the ground near the car and on its windows as well as above the car. 11 In connection with this, Chia was subsequently arrested at the Woodlands immigration checkpoint on 31 December 2013 while he was returning from a short family holiday in Malaysia. The next day, he informed the police that he “may know” where the Deceased’s body was. He then led the police to the SAF live firing area off Lim Chu Kang Road, where they discovered the Deceased’s body.",
        "The charges": "12 Chia was charged with one count of murder and one count of abduction, as follows: 1st CHARGE Between 28 December 2013 at about 9.44 p.m. and 29 December 2013 at about 3.17 p.m., together with one Febri Irwansyah Djatmiko, in furtherance of the common intention of you both, did commit murder by causing the death of one Dexmon Chua Yizhi in a motor van bearing registration number GX 4154D, somewhere in Singapore, and you have thereby committed an offence under section 302(2) read with section 34 of the Penal Code (Cap 224, 2008 Rev. Ed.). 2nd CHARGE Between 28 December 2013 at about 9.44 p.m. and 29 December 2013 at about 3.17 p.m., at the multi-storey carpark at Block 429A, Choa Chu Kang Avenue 4, Singapore, together with one Febri Irwansyah Djatmiko and one Chua Leong Aik, in furtherance of the common intention of you all, did abduct one Dexmon Chua Yizhi, to wit, by force compelling him from the multi-storey carpark at Block 429A Choa Chu Kang Avenue 4, and you have thereby committed an offence under section 362 punishable under s 363A read with section 34 of the Penal Code (Cap 224, 2008 Rev. Ed.).",
        "The proceedings below": "13 At trial, the Prosecution proceeded on the murder charge while the abduction charge was stood down.",
        "Parties’ cases": "Prosecution’s case (1) Conviction 14 The Prosecution’s case was that Chia had meticulously planned the assault on the Deceased intending to murder him. Chia bore a grudge against the Deceased because of his affair with Mdm Goh. There was evidence in the form of police reports lodged by the Deceased that between December 2012 and July 2013, Chia had stalked the Deceased, made threatening phone calls and sent abusive messages to him. 15 According to the Prosecution, Chia recruited Febri and Chua to assist him in carrying out his plan to murder the Deceased. On Chia’s instructions, Febri came to Singapore from Indonesia on 26 December 2013 and stayed with Chua at the substation. There, on 27 December 2013, the trio allegedly had a detailed discussion about the plan and assigned tasks. In the evening of 28 December 2013, with the assistance of his brother-in-law’s wife, Chua Chiew Hoon, also known as Doreen (“Mdm Chua”), Chia borrowed a van (“the van”) from Ong Soon Yee Vincent (“Ong”), who was a friend of Mdm Chua. 16 On the night of 28 December 2013, Chia met Febri and Chua at the substation. Chia allegedly brought along two knives, something described as an “electrode”, a torchlight and a packet of gloves. Chia then drove Febri and Chua in the van to the car park where the car belonging to the Deceased was later found and parked the van at Lot 291. After some time, the Deceased drove into the car park and parked his car at the adjacent Lot 290. Once the Deceased stepped out of his car, he was confronted by the assailants who assaulted and then pushed him into the cabin of the van where his wrists and ankles were bound with nylon cord to restrain him. Chia and Febri were in the cabin with the Deceased while Chua was directed to drive the van out of the car park towards Lim Chu Kang. 17 In Chia’s statements to the police given on 10 and 11 January 2014, he said that he and Febri took turns to use a hammer-like object to hit the Deceased. (For the purposes of this judgment, we will refer to this object simply as “the hammer”.) Chua’s evidence was that before he started driving, he heard “knocking” noises in the cabin of the van and smelt blood. Chua said that near the “Lim Chua Kang 19 milestone”, he stopped the van and got out because he was so “frightened” by what was going on that he could not continue. Chia then took over as the driver. At about 3am, Chia called his brother-in-law, Goh Beng Huat (“Goh”), and asked to meet him. They subsequently met at the void deck of the block where Goh’s home was. According to Goh, Chia told him that Mdm Goh (Chia’s wife and Goh’s sister) had been put under a “spell” by someone, and that there had been a fight with that person who had then collapsed. Chia allegedly asked Goh for help to carry the body but Goh declined. (As explained below at [25(h)], Chia disputed that account of his conversation with Goh.) 18 According to Chia’s statement to the police given on 11 January 2014 (“Chia’s 11 January statement”), after the conversation with Goh, he and Febri disposed of the body of the Deceased at the SAF live firing area in Lim Chua Kang. Febri threw the hammer into a canal when they drove past Kranji Road. It was never recovered by the police. 19 At about 9am on 29 December 2013, Chia and Febri washed the van at a fish farm in Lim Chu Kang. Chia then refuelled the van and returned it to Ong at about 2pm. Then, at around 3pm, Chia, his family and Febri drove to Johor, Malaysia. Febri returned to Indonesia from there. 20 The Prosecution’s case was that Chia and Febri had assaulted the Deceased with multiple blows of great force aimed at his face and head. The craniofacial blunt force trauma inflicted on the Deceased was, according to the medical evidence given by Assoc Prof Gilbert Lau, sufficient in the ordinary course of nature to cause death. 21 The Prosecution further submitted that the assault was pursuant to Chia’s and Febri’s common intention to commit murder. In this regard, the Prosecution relied in particular on the account of the events in a statement dated 3 February 2014 that Febri had given to the Indonesian police (“Febri’s statement”). Febri said that on 24 December 2013, Chia called him saying that he needed help to “take revenge on someone in Singapore by killing him because that person had raped his fat wife”. Febri agreed and came to Singapore on 26 December 2013, and on 27 December 2013, Chia “invited” him to Chua’s substation where the three of them “discussed the murder plan and assigned the tasks”. The plan was as follows: when the Deceased arrived at the car park, Chua and Chia would confront him and Chia would pull him into the van through its side door, which Febri would hold open. Chia and Chua would each hold a knife. Chia instructed Febri to use the “electrode” on the Deceased to cause him to lose consciousness, and also taught him how to tie the Deceased up. Febri’s account of the actual abduction was largely in line with this plan. As to subsequent events, we address them in greater detail later but in general, Febri’s account suggested that Chia inflicted most of the injuries, and then the two of them dumped the Deceased’s body at the SAF live firing area and disposed of his belongings at various locations. The Prosecution submitted on this basis, that Chia was the main instigator of the events leading to the death of the Deceased. The Defence challenged the admissibility of Febri’s statement but after an ancillary hearing on the fifth day of trial,the Judge admitted Febri’s statement as corroborative evidence (see [34] below). 22 The Prosecution also relied on the fact that Chia was the only individual involved in this event who had a personal motive to harm or kill the Deceased. Chia’s hatred for the Deceased could be discerned also from his statements to the police, in which he repeatedly referred to the Deceased as “that bastard”. (2) Sentence 23 As to sentence, under s 302(2) of the PC, the court has the discretion to impose on a person convicted of murder under s 300(c), the death penalty or a term of life imprisonment (with or without caning). The Prosecution submitted that Chia’s actions exhibited viciousness and a blatant disregard for human life such as would outrage the feelings of the community (seePublic Prosecutorv Kho Jabing[2015] 2 SLR 112 (“KhoJabing(2015)”) at [44]–[45]). In particular, the Prosecution emphasised Chia’s role as the mastermind of the entire plan, the significant degree of premeditation and planning involved, the brutality of the attack (as seen from the nature and extent of the injuries sustained by the Deceased and the extensive blood impact spatter found at the car park and in the cabin of the van), the attempts to cover up the crime, and his lack of remorse. In these circumstances, the Prosecution sought the imposition of the death sentence. Case for the Defence 24 It should first be noted that the position of the Defence at trial as to the account of the relevant events differed significantly from the eventual position that was taken at sentencing. Chia’s oral testimony at trial was also inconsistent with the statements he had earlier given to the police. We highlight some of these inconsistencies, where relevant, below. 25 At trial, Chia maintained that an Indian man named “Ali” was involved in the abduction and murder of the Deceased. Chia said that Ali was a part-time security guard working in the Choa Chu Kang area and that he had known Ali for several years though they were not close. Sometime in May or June 2013, Chia met Ali in Johor Bahru, where he told Ali that he had problems retrieving from the Deceased a thumbdrive that contained various video recordings of the sexual activities of Mdm Goh and the Deceased (“the recordings”). Ali agreed to help Chia if he was paid RM5,000. The rest of Chia’s evidence may be summarised as follows: (a) Febri visited Singapore to buy baby fish, and Chia borrowed the van from Ong in order to help Febri transport the fish to the port. (b) Ali came to the substation on the night of 28 December 2013 in a van driven by an unknown Indian man, and directed Chia to wait at the car park for the Deceased to return. Febri and Chua went along in the van to the car park. (c) At the car park, Ali caught hold of the Deceased’s neck and pushed him into the cabin of the van from the side door. Chia and Febri went into the cabin, but Ali did not. Chia then told Chua to drive them to the Armour Camp at Lim Chu Kang, as Ali had earlier instructed them to meet at the traffic light in that vicinity at 12.30am. (d) While in the back of the van, Chia, Febri and the Deceased kicked at each other. Chia also told the Deceased that he was Mdm Goh’s husband and asked about the recordings. (e) After passing Tengah Air Base, Chua said that he did not want to continue driving and left. Chia then took over as driver. While driving, he heard Febri and the Deceased quarrelling in the cabin and at some point a fight broke out between the two although Chia was unable to say who hit whom. (f) At the meeting point, Ali’s van stopped behind them. Ali then came to the van and told Chia that he wanted to tie the Deceased to a tree. Chia opened the side door of the van and Ali and Febri dragged the Deceased into Ali’s van. Ali drove off and Chia did not see where he went. (g) Chia dropped Febri off at the substation and then drove home. He then left his home again and met Ali at a bus stop near Lot One, a shopping mall in Choa Chu Kang. Chia asked Ali about the recordings and was told he would get it later at around 5 or 6am. Chia then picked Febri up and dropped Ali off. (h) After dropping Ali off, Chia and Febri drove to Goh’s block, where they spoke about the market price of birds and a bird-singing competition. This was following Chia’s earlier phone call to Goh, which had taken place sometime around 3am. (i) At around 5am, Chia and Febri drove to the live firing area in Lim Chu Kang to see whether Ali had the recordings, but they did not see Ali there. (j) Chia and Febri then washed the van at the fish farm because the tires were muddy from driving into the live firing area earlier. Febri also washed the interior of the van because it was oily. (1) Conviction 26 Theprimarysubmission of the Defence at trial, based on Chia’s oral testimony, was that Chia did not commit murder by causing the death of the Deceased in the van, in furtherance of a common intention shared with Febri. Essentially, Chia sought to pin the blame for the Deceased’s death entirely on Ali. However, since it remains the Defence’s position on appeal (as was its position by the time of sentencing) that Chia’s oral testimony at trial had been almost entirely untrue and that there was in fact no person known as “Ali” involved, it is not necessary to set out this submission in any further detail. 27 For present purposes, it is only necessary to consider thealternativesubmission of the Defence, which was to the effect that the elements of the charge were not made out because (a) Chia and Febri did not share a common intention to commit murder under s 300(c) of the PC, and (b) it was Febri (and not Chia) who inflicted the fatal injuries on the Deceased after he was abducted at the car park. It is important to note that this alternative submission was premised on Chia’s 11 January statement, and it was mounted on the premise that Chia’s oral testimony was not accepted. As we have already foreshadowed, there were several inconsistencies between Chia’s 11 January statement and Chia’s oral testimony. For instance, in the former, Ali was not involved at all in the abduction of the Deceased at the car park, while he was in the latter (see [25(c)] above). The most significant inconsistency, however, was that in the former, Chia admitted to taking turns with Febri to hit the Deceased on his head with the hammer; while in the latter, Chia said that he did not hit the Deceased with any such object; that he did not see Febri hitting the Deceased with it either; and that the three of them had only kicked at each other (see [25(d)] above). 28 On the first argument, namely that Chia and Febri did not share a common intention to commit murder under s 300(c) of the PC, the Defence referred to the portion of Chia’s 11 January statement in which he said that it was Febri who took the hammer, “became crazy” and “swung the hammer repeatedly on [the Deceased]”; that Febri then passed the hammer to Chia who used it to hit the Deceased on the forehead once and again with the same on the thigh area; and that Febri then took the hammer back and continued to hit the Deceased on and near his head. The Defence argued that there was no evidence that Chia knew Febri had the hammer when they set off; nor that Chia had instructed Febri to hit the Deceased on his head with the object. The Defence further submitted that it was wholly unexpected that Febri would repeatedly hit the Deceased on his head with the object. Hence, Febri’s assault on the Deceased was not an act in respect of which Chia shared a common intention with Febri. The most that could be said was that Chia did not stop Febri from hitting the Deceased. 29 On the second argument, namely that the fatal injuries were inflicted by Febri, the Defence submitted that since the cause of death was identified as craniofacial blunt force trauma, it must have been Febri who inflicted the fatal injuries on the Deceased since he had been responsible for most of the attack after the abduction at the car park. 30 On the whole, the Defence submitted that the Prosecution failed to prove the elements of the charge beyond reasonable doubt, and therefore Chia could only be convicted on a charge of voluntarily causing hurt under s 323 of the PC. (2) Sentence 31 As mentioned above at [26], by the time of sentencing, the Defence accepted that Chia’s oral testimony had been almost entirely untrue and that there was no person known as “Ali” involved; rather, it was Chia who had engaged Febri and Chua to abduct the Deceased to retrieve the recordings and to teach him a lesson. 32 The Defence did not dispute the legal principles inKhoJabing(2015) relied on by the Prosecution, but emphasised that inMichealAnak Garing v Public Prosecutor and another appeal[2017] 1 SLR 748 (“MichealAnak Garing”) at [54], we had set out two factors relevant to the question of whether an offender had acted in blatant disregard for human life, namely, (a) the offender’s mental state at the time of the attack; and (b) the offender’s actual role or participation in the attack. The Defence submitted that the death penalty should not be imposed on Chia because (a) he was suffering from major depressive disorder at the time of the offence; and (b) there was uncertainty as to the precise roles played by Chia and Febri in the assault on the Deceased: (a) On the first submission, the Defence relied on the psychiatric report of Dr John Bosco Lee dated 21 June 2017 (“the Lee Report”), which was obtained after conviction (and after Chia engaged new counsel). Dr Lee diagnosed Chia as suffering from major depressive disorder in 2013, and identified one of the stressors that triggered Chia’s mental condition as his obsession with the recordings and his belief that he had received “affirmation” from various mediums and gods that the Deceased had used those recordings to practise black magic or cast a spell on Mdm Goh. Dr Lee also concluded that Chia’s mental condition had “affected his perceptions, his emotional responses [and] his behavio[u]ral responses”, and “contributed much to his disturbed mental state around the time of the offence” [original emphasis omitted]. (b) On the second submission, the Defence argued that because the accounts provided by Chia, Febri and Chua diverged in many respects, there was a patent lack of clarity as to each individual’s specific role in the assault. (A summary of Chua’s evidence may be found at [51] below.) It was thus unsafe to impose the death penalty on Chia.",
        "The decision below": "33 On 17 January 2017, the Judge convicted Chia of murder under s 300(c) of the PC. Subsequently, on 4 August 2017, the Judge sentenced Chia to a term of life imprisonment. We summarise the Judge’s decision on the admissibility of Febri’s statement and on conviction and sentence. Admissibility of Febri’s statement 34 As mentioned at [21] above, the Defence challenged the admissibility of Febri’s statement. Febri never returned to Singapore and he could not be arrested, prosecuted or compelled to give evidence. However, with the co-operation of the Indonesian police, Febri’s statement was recorded by Police Brigadier Jhon Frenky Damanik, at the Bintan police station. Inspector Cyndi Koh Yu Shan and Senior Station Inspector (2) (“SSI(2)”) Mazlan Bin Shariff, both of the Singapore Police Force, were present when Febri’s statement was recorded. At trial, the Prosecution sought to admit Febri’s statement under s 32(1)(j)(iii) of the Evidence Act (Cap 97, 1997 Rev Ed) (“the EA”) on the ground that Febri was outside Singapore and that it was not practicable to secure his attendance. 35 After an ancillary hearing,the Judge admitted Febri’s statement on the fifth day of trial. The Judge subsequently gave his reasons at [10] of the Judgment, as follows: (a) Febri was an accomplice and would have been subject to prosecution. It was therefore not surprising that he refused to testify in Singapore. (b) The recording officer, Brigadier Damanik, had checked with Febri who affirmed that he was well and fit to have his statement recorded. Insp Koh, who was also present at the recording, testified that Febri looked well. (c) Febri’s statement was recorded in one session which did not seem unreasonably long. (d) The Judge admitted Febri’s statement not as “primary evidence against Chia, but as a further piece of corroborative evidence.” The Judge observed that although Febri did not know the proper names of the various people involved, his narrative was consistent in material respects with Chia’s and Chua’s evidence. Febri’s statement referred to Chia as “ACIA”, Chua as “WATER”, Mdm Chua as the “fat wife” and Mdm Goh as the “thin wife”. Febri also identified the persons he described when their photographs were shown to him. The Judge thus concluded that the probative value of Febri’s statement warranted its admission into evidence. 36 Additionally, in the context of his reasons for convicting Chia, the Judge acknowledged that neither Febri nor Chua gave a “fully consistent” statement. However, the Judge noted that they had not contradicted themselves in the way that Chia had (at [18] of the Judgment). Conviction 37 Chia was the only witness for the Defence, and the Judge found that he was “an unreliable witness” because he had “contradicted himself many times over”, or his evidence was “contradicted by the evidence of other witnesses”, or he had simply “given incredible accounts” (at [18] of the Judgment). For instance: (a) Chia in cross-examination denied leading the police to the canal in Kranji into which Febri had thrown the hammer. This was odd because Chia had drawn the object in his 10 January 2014 statement, and there was “incontrovertible evidence” of the police having searched the area although the object was ultimately not recovered (at [16] of the Judgment). (b) In Chia’s cautioned statements dated 1 January 2014 and 11 November 2014, he denied being at the car park and also his involvement in the abduction and murder. This was contradicted by the evidence of other witnesses. It was also contrary to the position eventually taken in the closing submissions of the Defence, where it was admitted that Chia, together with Febri and Chua, abducted the Deceased from the car park (at [17] of the Judgment). (c) Chia’s account that he had called Goh at 3am on 29 December 2013 to ask about the market price of birds could not be believed. There was “incontrovertible evidence that he had just spent the earlier part of the morning in the van with Chua, Febri, and [the Deceased]” such that “[a]ny thought of buying birds at that time [was] surely a flight of fancy” (at [18] of the Judgment). (d) Chia claimed that “Ali” and an unnamed Indian man were involved in the abduction and murder, but there was absolutely no evidence of the existence of these persons (at [18] of the Judgment). 38 The Judge found as follows (at [19] of the Judgment): (a) Chia “alone had the motive and intention to kill or cause grievous hurt to [the Deceased]”. On 27 December 2013, he finalised his plans. On the evening of 28 December 2013, he gathered Febri and Chua to assist him. Chua drove the van. The three of them waited in the car park for the Deceased to arrive. When the Deceased arrived, they “accosted him and bundled him into the van” where he was assaulted by Chia and/or Febri. (b) The assault was so severe that the Deceased suffered injuries sufficient in the ordinary course of nature to cause death, and the Deceased indeed died from these injuries. (c) There was no need to prove whether a hammer was used in the assault, or whether the hammer, if used, had been found. There was some evidence that a hammer was used. There was also some evidence that the head of the Deceased had been smashed against the van. Either way, the injuries that led to his death “were intentional”. The evidence of the injuries showed “repeated blows”, which excluded the possibility of these being accidental in nature. (d) Both Chia and Febri had the common intention to assault the Deceased as they did: (i) It “did not matter who dealt the crucial blow” although it seemed to the Judge that it was likely to be Chia, he being the one “with the motive and the hatred for [the Deceased]”. (ii) Since the limbs of the Deceased were tied using a form of knot that had to be constantly held to maintain fastness, either Chia or Febri held down the Deceased while the other hit him. Their common intention was to inflict the physical harm that was in fact inflicted. There was no evidence that “either had not intended that”; neither was there “evidence that either of them had a change of mind during the assault”. Both would have been guilty of causing those injuries that were sufficient in the ordinary course of nature to cause death. 39 Accordingly, the Judge convicted Chia of murder under s 300(c) of the PC punishable under s 302(2) read with s 34 of the PC (at [20] of the Judgment). Sentence 40 In his brief oral grounds delivered on 4 August 2017, the Judge reasoned that although Chia “may have had the motive and probably the intention to kill”, the charge against him was brought under s 300(c) and not s 300(a) of the PC. He also noted that it was possible that “it was one of the other accomplices [namely, Febri] who had inflicted the fatal blows”. Accordingly, he sentenced Chia to a term of life imprisonment, with effect from 1 January 2014 (the date of first remand).",
        "CCA 41: Appeal against conviction": "41 As mentioned, Chia appealed against his conviction in CCA 41 while the Prosecution appealed against the sentence in CCA 40. We will deal with each appeal in turn, beginning with CCA 41.",
        "Parties’ cases on appeal": "Case for the Defence 42 The Defence raised several grounds of appeal in its Petition of Appeal, which may be summarised as follows: (a) the Judge erred in admitting Febri’s statement into evidence and/or in placing undue weight on Febri’s statement; and (b) the Judge erred in making the following findings at [19] and [20] of the Judgment: (i) that Chia alone had the motive and intention to kill or cause grievous hurt to the Deceased; (ii) that Chia and Febri had the common intention to assault the Deceased as they did; (iii) that it “did not matter who dealt the crucial blow” although it seemed that it was probably Chia who did; (iv) that there was “no evidence” that either Chia or Febri had not intended the harm that was in fact inflicted on the Deceased; and (v) that “[w]hen the common evidence and the incontrovertible forensic evidence are examined, there can be only one conclusion”. 43 As subsequently became clear from the written and oral submissions of the Defence, the crux of the case for the Defence was that Chia and Febri did not share a common intention. According to the Defence, Chia only had the intention to abduct the Deceased and cause hurt, or at most, grievous hurt. On the other hand, Febri (alone) had the intention to inflict the fatal craniofacial injuries. The Defence argued that the Deceased was still alive when Chua left the van and Chia took over as driver. Accordingly, there was a possibility that Febri had single-handedly inflicted the fatal craniofacial injuries on the Deceased when the two of them were in the cabin of the van. The Defence submitted that it was not part of Chia’s plan for Febri to have assaulted the Deceased in the way that he did. In other words, in inflicting the fatal craniofacial injuries, Febri went beyond the scope of their common intention. Prosecution’s case 44 The Prosecution submitted that the Judge correctly admitted Febri’s statement as a piece of corroborative evidence. Further, the Prosecution submitted that the Judge correctly concluded that Chia alone had the motive and intention to kill the Deceased, and had recruited Febri and Chua to help him do so. The trio accosted the Deceased, and then Chia and Febri – in furtherance of their common intention – assaulted the Deceased to death in the cabin of the van by hitting him repeatedly in the head and face.",
        "Applicable legal principles": "110 The legal principles relating to the imposition of the death penalty are not in dispute. The relevant principles enunciated by this Court inKhoJabing(2015) andMichealAnak Garingcan be summarised as follows: (a) The death penalty will be warranted where the actions of the offenderoutrage the feelings of the community. Capital punishment is appropriate if the offender’s actions are “so grievous an affront to humanity and so abhorrent that the death penalty may … be the appropriate, if not the only, adequate sentence” (KhoJabing(2015)at [44]). (b) The actions of the offender would outrage the feelings of the community if the offender had acted in a way which exhibitsviciousnessor ablatant disregard for human life. The manner in which the offender has acted is a critical inquiry: the number of stabs or blows, the area of the injury, the duration of the attack and the force used are all relevant considerations. For instance, in the case of a violent act causing death, the savagery of the attack would be indicative of the offender’s disregard for human life (KhoJabing(2015)at [45]). (c) In deciding whether an offender has acted in blatant disregard for human life, two particular factors are relevant: (i) the mental state of the offender at the time of the attack; and (ii) his actual role or participation in the attack (MichealAnak Garingat [54]). By way of illustration, inMichealAnak Garing, the inquiry on the first point centred on whether the secondary offender, Tony Anak Imba, onlyhad the intention to inflict a s 300(c) injury without more, or whether his intention went beyond than that – for instance, whether he knew that the primary offender would in all likelihood use the weapon indiscriminately in attacking the deceased (at [55]–[56]). The inquiry on the second point concerned whether Imba had held the deceased in an armlock for a significant period of time, allowing the primary offender to inflict the fatal injuries (at [57]–[60]). We observed thatifthere had been more certain evidence that Imba had in fact held onto the deceased as described above or had otherwise egged on the primary offender, the death penaltymighthave been warranted (at [62]). (d) In any event, all the circumstances must be weighed, including the motive and intention of the offender at the time he committed the offence. While “the offender’s regard for human life remains at the forefront of the court’s consideration, other factors such as the offender’s age and intelligence could well tilt the balance” (KhoJabing(2015) at [51(d)]).",
        "Our decision": "Whether Chia’s alleged medical condition was a relevant mitigating factor 111 We begin by considering the submission of the Defence that Chia’s MDD is a relevant mitigating factor, and take the opportunity to explore whether and how an offender’s mental condition may be relevant to sentencing in cases involving the imposition of the discretionary death sentence under s 302(2) of the PC. (1) Principles relating to relevance of mental conditions to sentencing in cases involving the discretionary death sentence 112 As a matter of general principle, mental conditions are relevant to sentencing if they lessen the offender’s culpability for the offence and therefore justify a reduced sentence. As we stated inLimGhim Peow v Public Prosecutor[2014] 4 SLR 1287, the extent of such relevance depends on the circumstances of each case, in particular the nature and severity of the mental condition (at [25]). It is imperative that the sentencing court “examine the nature and gravity of the offender’s mental disorder and its impact on the commission of the offence before arriving at a sentence that takes into account and balances the relevant sentencing objectives” (at [52]). 113 In our judgment, the same general principle applies in cases involving the possible imposition of the death penalty. The culpability of the offender is measured by whether his actions outrage the feelings of the community, and this in turn is measured by whether the offender acted viciously or in blatant disregard for human life (see [110] above). Thus the offender’s mental condition is relevant insofar as it bears on the question of whether the offender can be said to have acted viciously or with blatant disregard for human life. By way of illustration, it may be established that an offender’s mental condition significantly diminished his capacity to comprehend his actions or appreciate the wrongfulness of his conduct at the material time. This might militate against a finding that the offender acted in blatant disregard of human life (as compared to an offender who acted with full knowledge and appreciation of the gravity of his actions), because the apparent viciousness of the attack would, at least in part, be attributable to the fact that the offender was suffering from that mental condition at the relevant time. In such circumstances, the retributive principle ought to be given less weight, militating against the imposition of the death penalty. 114 In other words, the proper test in relation to the relevance of medical evidence in the context of cases involving the discretionary death sentence is whether acausal linkhas been established between thediagnosis of the mental conditionand thefactors that go towards the imposition of the death penalty. This, of course, presupposes that thereisin the first place, a diagnosis of a recognised medical condition that the court is able to accept on the evidence. 115 If either the diagnosis itself or the causal link is contested, then a Newton hearing should be held. We emphasise that the purpose of a Newton hearing is to enable the court to resolve a difficult question of contested facts that is material to the court’s determination of the appropriate sentence (seeNg ChunHian v Public Prosecutor[2014] 2 SLR 783 at [24]). It is not an opportunity for either party to supplement its case and introduce new facts which have not already been put before the sentencing court. 116 In the present case, applying the test set out at [114] above, the key question before us is whether the Lee Report, which contains a diagnosis of MDD, sufficiently establishes a causal link between that diagnosis and the factors that go towards the imposition of the death penalty. If so, Chia’s MDD may be taken into account as a mitigating factor in the sentencing exercise. However, prior to considering the question of the causal link, it is necessary to determine whether there is aproperdiagnosis of a recognised medical condition in the first place. It is therefore appropriate to first evaluate the quality of Lee Report, which is the sole basis for the submission of the Defence that Chia suffered from MDD at the material time. (2) Principles relating to expert evidence 117 The principles relating to expert evidence bear emphasis. First and foremost, an expert must beneutral and independent. A useful starting point is O 40A r 2 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“the Rules”). While the Rules apply to civil proceedings only, the principles relating to an expert’s duty to the court set out therein are equally applicable to criminal proceedings. As stated in O 40A rr 2(1) and 2(2) of the Rules respectively, the duty of an expert is to assist the court on matters within his expertise and this duty “overrides any obligation to the person from whom he has received instructions or by whom he is paid”. An expert should neither attempt nor be seen to be an advocate of for a party’s cause. That being said, it is “entirely permissible for him to propound and press home the opinion he seeks to persuade the court to accept” (seePacific Recreation Pte Ltd v S Y TechnologyInc and another appeal[2008] 2 SLR(R) 491 (“Pacific Recreation”) at [70], citingVita Health Laboratories Pte Ltdand others v Pang Seng Meng[2004] 4 SLR(R) 162 at [82]–[83]). The court “will not hesitate, in an appropriate case, to disregard or even draw an adverse inference against expert evidence that exceeds the judicially determined boundaries of coherence, rationality and impartiality” (seePacific Recreationat [71], citingJSI Shipping (S) Pte Ltd vTeofoongwonglcloong[2007] 4 SLR(R) 460 at [63]). 118 It is also critical that an expertprovides the reasoning behind his conclusions. A report that states conclusions without reasons and which cannot be probed or evaluated is useless and prone to be rejected. In this connection, our observations inPacific Recreation(at [85]) bear repeating: Whatever the case,it is clear that the expert cannot merely present his conclusion on what the foreign law is without also presenting the underlying evidence and the analytical process by which he reached his conclusion. For instance, inThe H156([69]supra) at [27], Selvam J quite rightly warned against “the expert deciding the issue by assuming the power of decision”, saying: The function of an expert on foreign law is to submit the propositions of foreign law as fact for the consideration of the court. The court will then make its own findings of what the foreign law is. Even though the expert may submit his conclusions, he must present the materials and the grounds he uses to make his conclusions. The expert may not usurp the function of the court and present his finding. Further he cannot decide the issue by applying the law to the facts without setting out the law and the reasoning process. … [emphasis added] 119 AlthoughPacific Recreationwas a case which involved an expert witness on foreign law, there is no reason why the basic principles relating to an expert’s duty to give reasons that were enunciated there should not apply equally in the context of criminal cases where expert medical evidence is provided by psychiatrists. As noted by the High Court inChong YeeKa v Public Prosecutor[2017] 4 SLR 309, whether appointed by the Prosecution or the Defence, a psychiatrist “ought to do his utmost to assist the court”. He should “state his opinion as definitively as possible to the best of his ability, avoiding ambiguity and minimising room for subjectivity in interpretation. Otherwise, his opinion may be unhelpful and unreliable” (at [49]). Ultimately, if the psychiatric report appears “contrived and flimsy”, or the psychiatric report does not show that the offender is “suffering from a clearly diagnosed and recognised psychiatric disorder”, the court will be justified in rejecting the evidence of the offender’s purported mental condition (Kow Keng Siong,Sentencing Principles in Singapore(Academy Publishing, 2009) at para 18.139, citingPublic Prosecutorv Goh Lee Yin and another appeal[2008] 1 SLR(R) 824 at [82]). 120 Bearing all these principles in mind, we turn to consider the Lee Report proper. For ease of reference, we set out a summary of the main findings of the Lee Report in the paragraphs that follow. (3) Summary of findings in the Lee Report 121 The Lee Report, which spanned 15 pages, was prepared with reference to court papers and interviews conducted with Chia, Mdm Goh and their two daughters between April and May 2017. The Lee Report detailed the development of the relationship between Mdm Goh and the Deceased, what was described as Mdm Goh’s “mental disturbance” in 2013 arising from the Deceased’s refusal to “return” the recordings, and Chia’s own mood and behavioural changes as a result of “the sorrow and changes in [Mdm Goh] which he witnessed daily”. The Lee Report reported Chia as saying, among other things, that he felt depressed for most of 2013, stopped going to the coffee shop which he used to enjoy frequenting, contemplated suicide, and had recurrent and persistent thoughts about how he could retrieve the recordings and “protect [Mdm Goh’s] dignity”. 122 The main conclusion of the Lee Report was that Chia suffered from MDD around the period of the offence in December 2013. In the section titled “Summary and Opinions”, Dr Lee opined that the following mood and behavioural changes in Chia “[met] the diagnoses of the mental disorder”: (a) Over a period of several months in 2013, Chia experienced depression and a loss of sense of pleasure almost daily, suffered from affected sleep and appetite, and was more easily agitated and had to smoke more to keep his mood under control. (b) Chia had “recurrent ruminating thoughts” about the Deceased and the recordings which were “intrusive and unwarranted”. Dr Lee opined that these thoughts were of sufficient duration and frequency as to be considered “obsessions”, and that this was consistent with the statements of the Deceased that he felt he was being “stalked”. 123 Dr Lee opined that Chia’s MDD in 2013 had been triggered by stressors that were “severe and persistent”, and which related to his perception of the need to protect his family. These stressors included: (a) Mdm Goh’s unstable mental state in 2013 which affected him daily; (b) Chia’s obsession with the Deceased and the recordings, and his belief that he had received “affirmation” from various mediums and gods that the Deceased had used the recordings to practise black magic or to cast a spell on Mdm Goh; (c) Chia’s “persistent heightened vigilance to protect his family from further spells”; and (d) Chia’s “cultural tradition to maintain a stoic front” for his family. 124 Overall, Dr Lee opined that although Chia’s MDD did not qualify for diminished responsibility, it had “affected his perceptions, emotional responses [and] his behavio[u]ral responses”, and “contributed much to his disturbed mental state around the time of the offence” [original emphasis omitted]. For present purposes, it is important to note that this portion of the Lee Report did not containanyfurther explanation or elaboration at all. As we explain below, this was a critical flaw which severely undermined the quality of the Lee Report. (4) Our assessment of the Lee Report 125 In our assessment, although the Lee Report contains, on its face, a diagnosis of a recognised medical condition, the overall quality of the Lee Report is so lacking that it fails to meet theminimumstandards of expert evidence, and must therefore be disregarded. We explain our reasons below. 126 First, there wasno explanationof how the mood and behavioural changes allegedly observed in Chia “[met] the diagnoses of [MDD]”. Other than a cursory reference to the “American Psychiatric Association 2013”, the Lee Report did not provide any definition or explanation of MDD, let alone specify the key symptoms of such a medical condition. Without this key information, it is impossible for us to assess the correctness of the conclusion or the cogency of the reasoning. 127 Second, the mood and behavioural changes and “stressors” cited by Dr Lee for the basis of his diagnosis of MDD were, in large part,based on self-reported information by Chia, including his version of events. However, some of those were not accepted facts. As the Prosecution rightly points out, the account that the Deceased had gone to Chia’s flat on the 1st and 15th days of Chinese New Year in 2013 and that the Deceased had shown the recordings to people in Chia’s neighbourhood had never been established in the trial below. It is unclear to us whether Dr Lee’s diagnosis of MDD would be maintained if these disputed facts are disregarded. 128 Third, the Lee Reportomitted or failed to consider certain key materials. The entirety of the section titled “[Chia’s] account of the offence” comprised just three short paragraphs. It provided no detail about what actually occurred during the offence and simply reiterated Chia’s alleged overwhelming desire to retrieve the recordings from the Deceased. Critically, there was no consideration of the narrative of the offence contained in Chia’s statements to the police, in particular his 11 January statement, where Chia admitted to joining Febri in the assault on the Deceased with the hammer, and also explicitly stated at various points that while hitting the Deceased, Chia wanted the Deceased to die. 129 Fourth, the Lee Report wasdevoid of reasoning and purely conclusory in nature. As alluded to above, there was no explanation or elaboration in relation to the crucial conclusion that MDD “affected” or “contributed much to” Chia’s mental state around the time of the offence [original emphasis omitted]. The language employed in the Lee Report lacked specificity and elaboration, and could lend itself to any number of interpretations. For instance, since Chia’s mood and behaviours were “affected”, it could mean that Chia had impulse control issues or had become more prone to violence. On the other hand, it could also mean that Chia did all that he did, just because he was upset that his wife had had an affair with the Deceased. Simply put, it is impossible to determine from such vague phrasing what the Lee Report really meant and it inevitably raises the question as to whether this was calculatedly so. 130 Finally, the Lee Report was, in our judgment,partisan and contrived at parts. We refer in this regard to a particularly curious paragraph in the section titled “Mental state examination”, which we reproduce below: 81. As part of the examination, [Chia] was asked what his three wishes would be, he answered: a. That the “家伙” fellow (the Deceased) is not dead. I only wanted the thumb-drive. b. No prison for me. c. That My mother is not dead d. Hope wife’s incident didn’t happen. This portrayed Chia as a husband who only did what he did because he wanted to protect his wife from humiliation, and who regretted having caused the Deceased’s death because all he wanted to do was to retrieve the recordings. However, it conveniently ignored existing narratives of the offence, and was simply inconsistent with Chia’s own statements to the police. It is difficult to avoid forming the impression that the inclusion of Chia’s “three wishes” (or more accurately, four wishes) was a calculated attempt to extract sympathy from the court, and in effect, attempting toadvocatefor Chia rather than seeking to provide real, independent assistance to the court. 131 Therefore, having regard to the principles set out at [117]–[119] above, we conclude that the Lee Report fails to meet the minimum standards of expert evidence. It is ambiguous, wholly lacking in reasoning and simply states conclusions. It is also partisan and contrived at parts. In the premises, we entirely disregard it. 132 Even if the Lee Report were to be accepted as it stands, it would not meet the threshold ofrelevancebecause there is nothing in it which establishes the necessary causal link between the diagnosis of MDD and the factors that go towards the imposition of the death penalty. The Lee Report only contained vague conclusory statements to the effect that MDD would have “affected” or “contributed much to” Chia’s mental state around the time of the offence [original emphasis omitted]. There was no explanation of how Chia’s mental condition bore any relevance to whether he had acted viciously or in blatant disregard for human life, and therefore whether his actions would outrage the feelings of the community. 133 For completeness, we are satisfied that it is not necessary to convene a Newton hearing to determine whether a diagnosis of MDD may be sustained or the causal link between MDD and the factors that go towards the imposition of the death penalty, given that we disregard the Lee Report entirely, and also because even if it were admitted as it stands, there is nothing in it that would be relevant to the question of sentence, as explained in the preceding paragraph. 134 Before leaving this point, we wish to briefly address the criticism raised in the Lee Report that Dr Saluja had allegedly “missed critical mental health symptoms which a mental health professional would have picked up from open and direct questions when one suspects incongruence in words, behaviour and speech during the psychiatric assessment interviews”. This was yet another example of an unsubstantiated assertion in the Lee Report. There was simply no elaboration on what “critical mental health symptoms” or “incongruence” Dr Saluja was expected to pick up on. We digress to note that if any “incongruence” should have been picked up, it would have been the obvious inconsistencies between Chia’s responses in his examination by Dr Lee as compared to his contemporaneous accounts of the offence as provided in the statements to the police. It is also, in our view, most unfair to make these belated allegations against a fellow medical practitioner in circumstances where the medical evidence in question had gone entirely unchallenged at trial. Whether Chia’s actions were such as would outrage the feelings of the community 135 We turn finally to consider the parties’ remaining submissions on whether Chia’s actions warrant the imposition of the death penalty. In this regard, most of the submissions made by the Defence fall away in view of our findings in CCA 41. 136 First, we have found that Chia was themastermindof the plan to abduct the Deceased from the car park and to beat up the Deceased severely (see [62]–[68] above). Hisoperative motivewas to exact revenge on the Deceased. On this basis, we reject the submission by the Defence that Chia was motivated by love and that he only wanted to retrieve the recordings from the Deceased. 137 We also reject the submission of the Defence to the effect that an inquiry into the offender’s “actual role and participation in the attack” (a relevant consideration in determining whether the death penalty should be imposed: seeMichealAnak Garingat [54], cited at [110(c)] above)necessarilyrequires the court to attribute each blow to a particular offender. Chia shared acommon intentionwith Febri to inflict the fatal craniofacial injuries on the Deceased (see [89]–[94] above). We reiterate our earlier observation that for this reason, and at least in the context of this case, it is irrelevant that Chia’s actual involvement in the physical assault was more limited than Febri’s, and that it was possible that Febri was the one who inflicted the fatal s 300(c) injuries (see [89] above). We say this because Chia was the mastermind who not only directed but also actively participated in the assault that killed the Deceased. It seems to us that one who hires an assassin to kill another or who otherwise controls a killer, cannot be less culpable than the one who does the killing. If that is correct, still less can it be relevant where the mastermind not only directs but actuallyparticipatesin the killing. 138 In this connection, it is apposite to contrast the present case withMichealAnak Garing. In that case, Imba (the secondary offender), Garing (the primary offender) and two of their friends embarked on their plan to commit robbery. Garing was armed with aparang. Imba initiated the attack against the deceased by knocking him off his bicycle. The group then set upon him. It was undisputed that Garing inflicted the fatal injuries to the deceased’s neck; the critical question was whether Imba had held the deceased in an armlock for a sufficiently long period of time so as to allow Garing to inflict those injuries. We found that there was insufficient evidence to prove this. Overall, having regard to Imba’s mental state (meaning his intention to inflict a s 300(c) injury and his knowledge that Garing would in all likelihood wield theparangindiscriminately) and his actual involvement in the attack on the deceased, we concluded that Imba did not act in blatant disregard for human life and thus the imposition of the death penalty was not warranted (at [57]–[62]). The similarities between Imba and Chia’s circumstances begin and end with the fact that their actualinvolvement in the physical assault was relatively limited. The critical distinguishing factor is that Chia, unlike Imba, was the mastermind of the plan to attack the victim. Thus even if Febri had inflicted the majority of the blows, Febri had done so pursuant to Chia’s plan. Chia did not at any point in time direct or instruct Febri to stop although he was in a position to do so (see [92] above). In contrast, Imba did not instruct Garing to inflict the fatal neck injuries; neither was Imba in a position to stop Garing from doing so. In the circumstances, Chia cannot be regarded as an ordinary “secondary offender” like Imba, whose actual role and participation in the attack was limited. Chia must bear responsibility for Febri’s actions which were undertaken at his direction and with his active participation. 139 We also note that as the mastermind, Chia demonstrated ahigh degree of planning and premeditation. We agree with the Prosecution’s submissions that there is overwhelming evidence which amply demonstrates that this was not an opportunistic crime (see [99] above). This distinguishes the present case fromKhoJabing(2015), where the offenders were both unarmed when they decided to rob the victim. They made weapons out of the materials around them only as they approached the victim: one of them had armed himself with a belt wrapped around his fist with the metal buckle exposed, while the other had picked up a piece of wood from the ground. The opportunistic and improvised use of weapons inKhoJabing(2015) stands in stark contrast with the meticulous planning that permeated every aspect of the venture to abduct and harm the Deceased in this case. 140 Second, theviciousness of the attackcannot be denied. The objective forensic evidence speaks for itself. Bloodstains were found on the ground near the Deceased’s car, on its windows as well as on the ceiling of the car park above the car (see [69]–[70] above). Bloodstains were also found on the ceiling, rear door and both side walls of the cabin of the van; further, a wooden floorboard that was originally in the cabin of the van was stained with blood (see [71] above). This showed that a violent assault against the Deceased had already commenced in the car park where he was abducted, and continued in the cabin of the van. The various blunt force blows were directed at the Deceased’s face, a vulnerable part of his body. As a result of the assault, the Deceased suffered extensive fractures in his skull: almost every bone from the bottom of his eye socket to his lower jaw was fractured (see [101] above). 141 Third, Chia demonstrated ablatant disregard for thelife of the Deceased. We need only refer to various statements that Chia made in his 11 January statement, which we have already cited at [65], [79] and [94] above. Viewed as a whole, the unmistakeable picture that emerges is that Chia desired for the Deceased tosufferas much as possible before dying. The only regret that Chia ever expressed was that the Deceased had died before he could cause the Deceased even more suffering. We also agree with the Prosecution that the evidence showed Chia to have remained calm, collected and deliberate before and throughout the execution of the offence. He remained so even after the killing – on the very day that he murdered the Deceased and dumped the battered body in a secluded area, Chia was able take a two-day long trip to Malaysia with his wife and two young daughters.",
        "Conclusion": "142 The death sentence is the final and terminal sentence which a convicted person can suffer, and where it is at the discretion of the court, it should only be imposed after the most anxious consideration. Such consideration is to be guided by the jurisprudence of the court, for that is the only assurance that the gravest of judicial tasks is undertaken in accordance with the law. Having regard to all the facts and circumstances, we agree with the Prosecution that Chia’s actions exhibited such viciousness and such a blatant disregard for the life of the Deceased, and are so grievous an affront to humanity and so abhorrent that the death penalty is the appropriate, indeed the only adequate sentence. 143 For these reasons, we allow the Prosecution’s appeal against sentence in CCA 40, and substitute the sentence of life imprisonment with the sentence of death. Sundaresh Menon         Judith Prakash    Tay Yong KwangChief Justice        Judge of Appeal   Judge of Appeal Hri Kumar Nair, SC, Tan Wen Hsien and Dora Tay (Attorney-General’s Chambers) for the appellant in Criminal Appeal No 40 of 2017 and the respondent in Criminal Appeal No 41 of 2017;Anand Nalachandran (TSMP Law Corporation) and Ngiam Hian Theng, Diana (Quahe Woo & Palmer LLC) for the respondent in Criminal Appeal No 40 of 2017 and the appellant in Criminal Appeal No 41 of 2017.",
        "CCA 40: Appeal against sentence": "97 We turn to consider the Prosecution’s appeal against sentence in CCA 40, for which we reserved judgment. As noted at the outset, this appeal raises an important issue regarding the relevance of medical evidence to the exercise of the court’s sentencing discretion in cases involving the imposition of the death sentence.",
        "Parties’ case on appeal": "Prosecution’s submissions 98 The Prosecution contends that the Judge erred in concluding that the imposition of the death penalty was not warranted simply because there remained a possibility that Febri, and not Chia, had struck the mortal blow. Aside from this, the Prosecution submits that a proper application of the principles as set out inKhoJabing(2015) andMichealAnak Garingrequires a consideration of four points. 99 The first point concerns themental state of the offender. The Prosecution submits that two aspects of this must be taken into consideration. First, Chia was the only one with the motive to cause grievous hurt to the Deceased for the reasons we have already covered (see [14] and [22] above). Second, Chia demonstrated a high degree of planning and premeditation. The Prosecution points to the following: (a) Chia knew to wait for the Deceased at the precise location in question – the multi-storey car park near his house. The only inference was that he knew the Deceased’s movements well; this was consistent with the police report lodged by the Deceased on 12 July 2013, in which the Deceased stated that Chia had parked under his block and was looking at his unit, and that this was the third such incident in just that month. (b) Chia engaged Febri and Chua to assist him in his plan because he knew that the Deceased was bigger in size. (c) Chia borrowed the van for use in the abduction. (d) Chia procured and brought along knives and other paraphernalia for use in the abduction. (e) Chia knew exactly where to dump the Deceased’s body. The SAF live firing area in Lim Chu Kang was a gated and secluded area, and the body would likely have remained undiscovered for a considerable time if not for his leading the police there on 1 January 2014. (f) Chia made plans to bring Febri out of the jurisdiction after the murder in order to avoid Febri being arrested and possibly giving evidence against him. (g) The only argument that the Defence raised against these submissions was that Chia had beenforcedto call upon his brother-in-law, Goh – a person he had not originally intended to involve in the plan – in the middle of the night and seek his assistance in disposing of the body of the Deceased, all of which suggested a chaotic and unplanned state of affairs. As against this, the Prosecution argues that far from demonstrating Chia’s lack of planning, it demonstrates Chia’s complete presence of mind. Chia realised that without Chua, who by then had abandoned the venture, they required help to dispose of the body because the Deceased was a large man weighing around 80kg. Not only was Goh a somewhat heavyset man who could have been useful for this purpose, he was also a family member and so would have been less likely to report Chia’s actions to the police. 100 Taken together, the Prosecution submits that the highly premeditated nature of Chia’s offence makes him in relative terms more culpable than the accused persons in other cases involving charges under s 300(c) read with s 34 of the PC such asKhoJabing(2015) where the offence in question was opportunistic in nature. 101 The second point concernswhether the offender showed a blatant disregard for human life, in accordance with the test laid down inKhoJabing(2015) (see [23] above). The Prosecution emphasises that Chia was the mastermind of the plan to attack the Deceased, and the forensic evidence made clear that this attack was extremely brutal. The Deceased was restrained while blows were targeted at his head and face, which are vulnerable regions of the body. As a result, the Deceased suffered extensive fractures of almost every single bone from the bottom of his eye socket to his lower jaw. The attack was so severe that one of his teeth was found lodged in his brain. The forensic evidence was that no typical defensive injuries were found on the Deceased’s body; in other words, it was entirely a one-sided assault without resistance. Further, the brutal attack occurred over a prolonged period, beginning with the abduction in the car park and continuing in the cabin of the van, resulting in a “slow, painful death” for the Deceased. The Deceased was also humiliated by being attacked while his limbs were tied up and then being “unceremoniously dumped in the jungle”. The Prosecution also relies on Chia’s 11 January statement where he states that the plan was to abduct the Deceased, hit him, tie him up, bring him to a remote area and for the trio to have their way with him. Chia’s only regret was that the Deceased died too soon and that they did not have sufficient opportunity to further torture him. 102 The third point concernsthe actual role played by the offender in the commission of the offence. The Prosecution emphasises that Chia was the mastermind of the plan. He recruited Febri for the very purpose of severely beating up the Deceased. Unlike the secondary offender inMichealAnak Garingwho was in no position to direct or instruct the primary offender, Chia could have told Febri to stop – but he did not. For this reason, it was not a mitigating factor that Chia’s involvement in the actual physical assault (helping to restrain the Deceased’s legs and personally striking the Deceased on the forehead with the hammer once and then again on the thigh area) was less extensive than Febri’s. 103 Finally, the fourth point concerns thecircumstances of the particular offender. The Prosecution submits that there are no mitigating factors at all. On the day of the offence, Chia appeared perfectly normal and even attended a wedding in the morning. He calmly executed the attack that night, even retaining the presence of mind to call Goh for assistance when Chua abandoned the plan. After the murder, Chia set out to evade detection by disposing of the Deceased’s belongings and the hammer. He washed the bloodstains off the van, refuelled it and returned it to Ong while apologising for and promising to replace the missing components (which he had removed during the clean-up). Finally, Chia calmly left for Malaysia with his wife and two daughters for their family trip, taking the opportunity to spirit Febri out of the jurisdiction. The Prosecution also submits that Chia demonstrated no remorse at all. At trial, he tried to avoid liability by fabricating the character “Ali”; and when that version of accounts was rejected, Chia tried to blame everything on Febri. Significantly, the only regret that Chia expressed was that the Deceased had died too quickly. The submissions of the Defence 104 The Defence on the other hand submits that the sentence of life imprisonment is not manifestly inadequate and should be upheld. 105 First, the Defence argues that Chia’s actions could not be said to be such as would outrage the feelings of the community. Chia’s plan was not to kill or murder the Deceased; it was only to abduct the Deceased and to teach him a lesson. The death that resulted was unplanned and unexpected. Further, the plan was not driven by hatred or revenge for the Deceased, but by love for his wife: Chia wanted to protect Mdm Goh from humiliation by any further dissemination of the recordings. Having regard to this underlying motivation, Chia’s actions could not be said to be so outrageous. 106 Next, the Defence submits that Chia did not exhibit viciousness or blatant disregard for human life. The Defence submits that the assault in the car park and in the van was not as one-sided as the Prosecution submits. The evidence does not conclusively show that the Deceased had been tied up with the nylon cords beforethe assault; the possibility remained that he was only tied up after.Further, the Defence emphasises that for the purposes of sentencing, it is necessary to determine the actual role or participation of the particular offender in the attack (seeMichealAnak Garingat [54]). Chia’s actual role was limited to his hitting the Deceased on the forehead once and on the thigh area using the hammer. Again, the Defence makes the point that it was Febri who inflicted the fatal craniofacial injuries on the Deceased. 107 The Defence also makes the following points in response to the Prosecution’s submissions: (a) Chia did not execute the plan in a calm and calculated manner. The events were chaotic and Chia was forced to make a frantic phone call to Goh at around 3am after Chua abandoned the enterprise. (b) Chia did not take deliberate steps to avoid detection. If he did, he would have returned to the car park to remove any evidence that an assault had taken place there. He did not wash the van in order to evade detection, but rather, because he had to return the van to Ong in its original condition so far as this was possible to do. (c) Chia had not allowed Febri to accompany him to Malaysia with the specific intention of helping Febri to escape the jurisdiction. If that was his intention, logically Chia himself should have wanted to flee. Instead, he returned to Singapore. (d) Chia did not display a lack of remorse. At the mitigation stage, he did admit to playing a part in the assault on the Deceased. 108 Finally, the Defence submits that there are two mitigating factors that warrant the imposition of a sentence of life imprisonment instead of the death penalty. First, Chia assisted the police by leading them to the location where the body of the Deceased had been dumped. Second, and more importantly, according to the Lee Report tendered by the Defence, Chia suffered from major depressive disorder (“MDD”) at the material time in 2013, which affected “his perceptions, his emotional responses [and] his behavio[u]ral responses”, and “contributed much to his disturbed mental state around the time of the offence” [original emphasis omitted]. 109 The diagnosis in the Lee Report stood in contrast with the report of the Prosecution’s psychiatric expert, Dr Bharat Saluja, dated 4 February 2014, which found that Chia did not suffer from any mental disorder and had normal intelligence adaptive functioning. At trial, Dr Saluja’s opinion was not challenged at all and no suggestion of any mental impairment was advanced by the Defence. Nonetheless, the Defence contends that the Lee Report ought to be preferred because Dr Lee conversed with Chia in Mandarin (which Chia was comfortable in) and not in English, as Dr Saluja did. There was some suggestion that the language barrier had prevented Dr Saluja from fully and accurately comprehending Chia. Further, Dr Lee elicited more personal information from Chia and his family. As a result, Dr Lee had a deeper and more extensive understanding of Chia’s background and mental state leading up to the accident."
    }
}