{
    "case_title": "Public Prosecutor vMohd Ariffan bin Mohd Hassan",
    "ncitation": "[2018] SGCA 10",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 The three conditions for the admission of fresh evidence on appeal as articulated by Lord Denning inLadd v Marshall[1954] 1 WLR 1489 (“Ladd v Marshall”) have stood largely unchanged for more than 60 years. The longevity of that formulation attests to the succinct yet comprehensive manner in which the three conditions – non-availability at trial, relevance and reliability – encapsulate the relevant considerations for the court in determining whether it is appropriate to allow evidence that was not placed before the trial judge to be brought belatedly into play. Our courts have adopted theLadd v Marshallconditions in the context of civil appeals as the criteria for determining whether there exist “special grounds” warranting the admission of further evidence after the conclusion of the trial, pursuant to O 57 r 13(2) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed), as well as in criminal appeals to ascertain if the further evidence is “necessary” within the meaning of s 392(1) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”). 2 The present application by the Prosecution for the adduction of further evidence provides an opportunity for us to consider three particular aspects ofLadd v Marshallin the context of criminal appeals. The first concerns whether the approach ought to be the same regardless of whether the application is brought by the Prosecution or by the accused person. The second pertains to the condition of non-availability and whether this should be understood to include evidence that, although physically available at trial, was reasonably not thought to be necessary at that time. The third raises an additional consideration of proportionality – that is, whether the court in deciding such an application should consider the likely procedural consequences of admitting the further evidence and the potential prejudice that might be occasioned to the respondent if this were done, and weigh this against the justification advanced in support of the application. 3 The present application has been brought by the Prosecution in the context of its appeal against the trial judge’s acquittal of the respondent on several charges involving allegations of serious sexual offences. In support of its appeal, the Prosecution seeks to have two sets of further evidence admitted under s 392(1) of the CPC. We begin with an account of the background to the appeal.",
        "Background facts": "4 As the subject of this judgment is the application filed by the Prosecution to admit further evidence on appeal, we will limit ourselves to providing a brief sketch of the facts and the proceedings leading to this application. In recounting the facts, we will focus on those aspects of the parties’ cases that concern the new evidence sought to be admitted.",
        "The charges": "5 A total of six charges were brought against the respondent. The second charge against the respondent was for the offence of aggravated outrage of modesty under s 354A(1) read with s 354A(2)(b) of the Penal Code (Cap 224, 2008 Rev Ed) (“the Penal Code”), allegedly committed against the complainant’s sister. That single charge was stood down at trial and has yet to be decided. The Prosecution proceeded with the five remaining charges at trial and they all concern sexual offences allegedly committed by the respondent against the complainant. They are summarised as follows: (a) The first charge (“the First Charge”) was for the offence of aggravated outrage of modesty under s 354A(1) of the Penal Code. In March 2009, sometime at night, the respondent is alleged to have touched and kissed the complainant’s breasts in a prime mover (“the Prime Mover”) which was parked in a forested area in Punggol. In order to commit the offence, he wrongfully restrained the complainant by confining her in the Prime Mover. The complainant was 15 years old at the time. (b) The third charge (“the Third Charge”) was for the offence of sexual assault by digital penetration under s 376(2)(a) of the Penal Code. Sometime in the beginning of June 2010, in the morning, the respondent is alleged to have penetrated the complainant’s vagina with his finger without her consent, in the living room of the flat where the complainant stayed with her mother, sister and brother (“the Unit”). The complainant was 16 years old then. (c) The fourth charge (“the Fourth Charge”) was likewise for the offence of sexual assault by digital penetration. Sometime at the end of June 2010, in the afternoon, the respondent is alleged to have penetrated the complainant’s vagina with his finger without her consent, in the bedroom of the Unit. The complainant was 16 years old at the time. (d) The fifth charge (“the Fifth Charge”) was for the offence of rape under s 375(1)(a) of the Penal Code. Sometime in the beginning of January 2010 at about 10pm, the respondent is alleged to have raped the complainant by penetrating her vagina with his penis without her consent in the Prime Mover, which was parked in a forested area in Punggol. The complainant was 15 years old when this occurred. (e) The sixth charge (“the Sixth Charge”) was likewise for the offence of rape. Sometime in the early part of 2011, at night, the respondent is alleged to have raped the complainant in the Prime Mover in a forested area in Punggol. The complainant was 16 years old at the time.",
        "The trial": "6 The trial took place over a period of 10 days. The Prosecution called a total of 13 witnesses, including the complainant; the respondent took the stand as the only witness for the defence (“the Defence”). 7 The Prosecution’s case was primarily based on the complainant’s account of events. According to the Prosecution, the respondent came into the complainant’s life sometime in 2004, when he began a relationship with the complainant’s mother. He moved into the Unit soon after this and then lived with the complainant’s mother, sister, brother and the complainant herself. The sexual abuse began in March 2009, when the complainant was just 15 years old. The respondent took her out in the Prime Mover, a vehicle that was owned by Sim Hock Beng Company (“the Company”), which was the respondent’s employer. According to the complainant, the Prime Mover was red and bore the registration number XB4268Z. The respondent drove to a forested area in Punggol, where he caressed and kissed the complainant’s breasts in the cabin of the Prime Mover. This was the subject of the First Charge. The respondent’s misconduct escalated when he committed digital-vaginal penetration on the complainant on two occasions during the June 2010 school holidays, while they were in the Unit. This formed the subject of the Third and Fourth Charges. He also raped the complainant on two occasions, in the beginning of 2010 and 2011 respectively. The rapes occurred in the cabin of the Prime Mover, which was parked in a forested area in Punggol. These were the subject of the Fifth and Sixth Charges. 8 The events came to light only gradually. The complainant first confided in her boyfriend sometime in 2010. The boyfriend pressured the complainant to inform her mother about the incidents and the complainant eventually told her mother aboutsomeaspects of the sexual abuse in 2011. The full extent of the respondent’s alleged wrongdoing only came to light towards the end of 2012, after the complainant spoke with her sister on 25 December 2012. Her sister then revealed that she had similarly been subjected to unwanted sexual advances from the respondent. They then decided to inform their brother about the respondent’s conduct. The brother in turn lodged a police report on 27 December 2012. 9 The respondent contested all five charges that the Prosecution proceeded with, and denied that he had ever sexually assaulted or raped the complainant. In relation to the charges concerning the offences that allegedly occurred within the Prime Mover (namely,the First, Fifth and Sixth Charges), the respondent claimed that he had never driven the Prime Mover, whether with or without the complainant. The Defence also contended that in any event, the rapes could not have occurred in the cabin of the Prime Mover as alleged, since that area was dirty and contained tools and heavy items. Notably, the Defence relied on the testimony of Mr Sim Hock Beng, the owner of the Company. Mr Sim testified under cross-examination that between 2009 and 2011, one “Idris” had been assigned to drive the Prime Mover “[m]ost of the time”. “Idris” had, however, passed away three or four years prior to the trial. Mr Sim also stated that Idris “would drive and sleep in the vehicle”, and not go home because “he was tired from his work”. He “would park at … East Coast Park” and sleep in the vehicle. It is not disputed that this was the first time that the existence of “Idris” was made known to the Prosecution. 10 The respondent also contended that the allegations relating to his use of the Prime Mover were implausible, having regard to their frequency and duration. The Prosecution’s case was that the respondent had brought the complainant out for two-hour stretches at night, two or three times a week over a period of one and a half years. As to the Third Charge, the Defence contended that if the respondent had in fact sought to sexually assault the complainant in the manner alleged, while they were in the living room of the Unit, the complainant would surely have run to the safety of the bedroom where her mother was sleeping at that very time. In relation to the Fourth Charge, the Defence sought to cast doubt on the Prosecution’s case that the respondent had contrived a situation to be alone with the complainant by sending her sister out on an errand to buy lunch. The Defence suggested that it was “curious” that the complainant had failed to accompany her sister so as to avoid remaining in the Unit alone with the respondent. 11 The issue of whether, in making its case before the trial judge (“the Judge”), the Defence had relied on the complainant’s alleged delay in communicating her allegations to her boyfriend and family members as well as her reluctance in reporting the matter to the police, is one of the central matters in issue in the Prosecution’s present application to admit further evidence. We explore this issue further below.",
        "The Judge’s decision": "12 The Judge acquitted the respondent of all five charges against him:Public Prosecutor v Mohd Ariffan bin Mohd Hassan[2017] SGHC 81 (“the GD”) at [45]. The Judge found that the complainant’s evidence was not unusually convincing. He also found that the remaining evidence did not significantly strengthen the Prosecution’s case and in fact contained substantial flaws and shortcomings. In the result, he concluded that the Prosecution failed to prove the elements of the charges beyond a reasonable doubt: the GD at [44]. As it is one of the Prosecution’s submissions in the present application that it was unaware that the complainant’s delay in making her allegations would be of any significance in the proceedings until the Judge rendered his decision, it is necessary to have close regard to the reasoning in the GD. 13 The Judge began by considering the evidence concerning the offences that were allegedly committed in the Prime Mover. He noted that Mr Sim had given evidence that the respondent was not permitted to drive the Company’s prime movers, that the keys to the prime movers were kept in the Company’s store and – importantly for present purposes – that Idris drove the Prime Mover between 2009 and 2011 and would sleep in the vehicle after work instead of going home: the GD at [24]–[25]. He described at [26]–[32] what he perceived to be various inconsistencies between Mr Sim’s evidence and that of the complainant concerning the interior of the Prime Mover, and held at [33] that “[t]he upshot of the [respondent’s] evidence, taken together with Mr Sim’s evidence, was to put in real doubt the [Prosecution’s] case on the identity and use of the [Prime Mover]”. 14 Turning to the charges in respect of those offences that allegedly occurred in the Unit, the Judge pointed out a number of “disquieting aspects” of the complainant’s evidence: the GD at [34]–[35]. In relation to the Third Charge, he noted that “[d]efence counsel [had] pointed out that [the complainant] could have ran [sic] back to the bedroom to the protection of her mother, or to raise alarm and complain to her about him, but inexplicably she did neither and remained silent for half a year before telling her that he touched her body”. Regarding the Fourth Charge, the Judge observed that “no questions were asked and no information volunteered” from the complainant’s sister as to the complainant’s claim that the respondent had instructed the complainant’s sister to leave the Unit to buy lunch, leaving the complainant alone with the respondent in the Unit. According to the Judge, this omission “raised questions over the [complainant’s] account [of] the [incident]”. He proceeded to refer to the possibility of drawing an adverse inference against the Prosecution pursuant to Illustration (g) to s 116 of the Evidence Act (Cap 97, 1997 Rev Ed) (“the Evidence Act”), but stopped short of explicitly doing so, finding only that the omission “had a negative impact on the [Prosecution’s] case”. 15 In the next section of the GD which was titled “Review”, the Judge first agreed with the Prosecution’s submission that the case rested primarily on the credibility of the complainant and respondent: the GD at [37]. He then quoted extensively from our decision inAOF v Public Prosecutor[2012] 3 SLR 34 (“AOF”), focusing on [111]–[115] ofAOFwhich concern the requirement that a complainant’s evidence be “unusually convincing” in circumstances where there is no corroborative evidence. The Judge also consideredKwan Peng Hong v Public Prosecutor[2000] 2 SLR(R) 824 at [32]–[33], where Yong Pung How CJ emphasised the need for caution in relying solely on the evidence of the complainant to ground a conviction: the GD at [38]. 16 The Judge then observed that, strictly speaking, the complainant’s evidence “did not stand alone”, given the evidence of her mother, brother, sister and boyfriend whom she had told about the respondent’s conduct. He then referred to s 159 of the Evidence Act, which provides as follows: Former statements of witness may be proved to corroborate later testimony as to same fact 159.In order to corroborate the testimony of a witness, any former statement made by such witness, whether written or verbal, on oath, or in ordinary conversation, relating to the same fact at or about the time when the fact took place, or before any authority legally competent to investigate the fact, may be proved. 17 The Judge noted Yong CJ’s observation inKhoo Kwan Hain v Public Prosecutor[1995] 2 SLR(R) 591 at [49] that although s 159 of the Evidence Act had “the effect of elevating a recent complaint to corroboration, the court should nevertheless bear in mind the fact that corroboration by virtue of s 159 alone isnotcorroboration byindependentevidence” [emphasis in original]. The Judge found that there were no reasons to account for the complainant’s failure to promptly complain to her boyfriend and family members about the sexual assaults. He also observed that when she eventually broke her silence, her accounts were “contradictory and inconsistent” despite the fact that she had ample time to recall the forms of abuse that she had suffered: the GD at [40]–[41]. 18 The Judge found that the complainant’s description of the cabin of the Prime Mover and the respondent’s alleged frequent usage of the Prime Mover was contradicted by Mr Sim’s evidence: the GD at [42]. He again pointed out (in relation to the Fourth Charge) that “nothing was mentioned” by the complainant’s sister of the complainant’s claim that the respondent had sent her out of the Unit so that he could be alone with the complainant. The Judge surmised that “[t]hese, and the other matters I have referred to have a negative impact on [the complainant’s] credibility”: the GD at [43]. He concluded that the complainant’s evidence was “not usually compelling or convincing and the other evidence did not strengthen the [Prosecution’s] case in any significant way”, and that there were “substantial flaws and shortcomings in the evidence” that led to his finding of reasonable doubt: the GD at [44]. He then acquitted the respondent of the charges in respect of offences against the complainant.",
        "The Prosecution’s appeal and application to admit further evidence": "19 The Prosecution has appealed against the acquittal (Criminal Appeal No 19 of 2017) and has, at the same time, also filed an application to admit further evidence pursuant to s 392 of the CPC. The further evidence consists of: (a) Affidavits by the Head of the Serious Sexual Crime Branch, Criminal Investigation Department of the Singapore Police Force, Superintendent Chua Teck Wah (“Supt Chua”); Senior Investigation Officer, Assistant Superintendent Jagathiswari Jaganathan (“ASP Jaga”); and, more crucially, Muhammad Matin bin Idris (“Matin”), who is the son of Idris bin Mohamed (“Idris”). The affidavits of Supt Chua and ASP Jaga merely outline their investigations regarding Idris; it is Matin’s affidavit that is key. (b) An affidavit by Ms Ng Pei Yu, Vivienne, who is the Chief Psychologist at the Office of the Chief Psychologist, Ministry of Social and Family Development (“MSF”). An expert report by Ms Ng dated 17 October 2017 (“the expert report”) is annexed to her affidavit. We briefly outline the contents of each of these affidavits and the expert report.",
        "Matin’s affidavit": "20 According to Matin, Idris passed away on 26 November 2012. Before this, Idris had lived with Matin as well as Matin’s mother and sister at a flat in Tampines since 1999. 21 Idris had worked as a prime mover driver since 1996 or 1997 for a number of companies. He workedad hocaccording to demand and was allowed to drive the prime movers home. Matin explained that “[m]ost of the time”, Idris would park the prime movers at heavy vehicle parking areas at Tampines SAFRA or near the family home. The prime movers that Idris drove home were of different colours – Matin recollected that they were “mostly fully white, dark blue on top and yellow below”, while other prime movers were “brightly coloured”. Crucially, Matin had “never seen [his] late father drive a red prime mover before”. 22 Matin also stated that Idris “did not have a habit of sleeping in prime movers”. On the contrary, he would always return home to sleep. Idris was “a very loving and caring father, and was very close to [Matin’s] sister”. As such, Idris would “make it a point to come back home and spend time with her”. As far as Matin knew, Idris did not sleep overnight in prime movers. In addition, he would only park his prime movers near the family home in Tampines.",
        "Ms Ng’s expert report": "23 Ms Ng is a registered psychologist and a clinical supervisor with the Singapore Registry of Psychologists of the Singapore Psychological Society. She undertook postgraduate training in Clinical Psychology and worked for nine years at the Institute of Mental Health (“IMH”), where she was appointed Deputy Head of the Division of Psychiatric Emergency (Trauma Clinic) which provided treatment for patients who had a history of trauma. Ms Ng explained that she has significant experience working with adults who had experienced trauma either as an adult or a child and who suffered from various disorders or behaviour problems. She subsequently worked at the Clinical and Forensic Psychology Branch at the Rehabilitation and Protection Group at the MSF and, among other appointments, she spearheaded the Services for Trauma and Abuse Recovery team. In that capacity, she was heavily involved in developing protocols for clinical assessment and intervention for clients with trauma and their families. She also developed and evaluated a group treatment programme for children and youth who had been sexually abused. As mentioned, Ms Ng is presently the Chief Psychologist at the Office of the Chief Psychologist at the MSF. 24 Ms Ng was requested by the Prosecution to prepare an independent expert opinion in relation to the Prosecution’s appeal. She was provided by the Prosecution with (a) the GD; (b) the charges against the respondent that concerned the complainant; (c) a selection from the Notes of Evidence that contained the oral evidence of the complainant, her mother, brother, sister and boyfriend, and the gynaecologist and the IMH psychiatrist who had examined the complainant; (d) the conditioned statements of the complainant, her mother, the gynaecologist and the IMH psychiatrist; and (e) the medical report and handwritten medical form for complaints of sexual offences provided by the gynaecologist, the psychiatric assessment of the complainant provided by the IMH psychiatrist, and the summary of facts provided by the investigation officer. 25 Broadly speaking, the expert report consists of two segments: (a) a summary of expert studies on rape trauma, common rape myths and the psychological responses of rape victims; and (b) an application of the findings in these studies to the complainant’s evidence and behaviour in this case. Ms Ng concludes her report by observing that, in light of her “research findings as well as professional experience”, the complainant’s behaviour was “highly realistic”.",
        "Parties’ submissions": "26 The Defence resists the Prosecution’s application to admit either the affidavits concerning Matin’s evidence or the expert report. Significantly, there is a fundamental dispute regarding the proper approach to be taken toward assessing applications by the Prosecution to admit fresh evidence on appeal. 27 We have already referred to the well-known decision of the English Court of Appeal inLadd v Marshall, where Lord Denning famously synthesised the requirements to be met before an appellate court allows fresh evidence to be introduced as follows (at 1491): … To justify the reception of fresh evidence or a new trial, three conditions must be fulfilled: first, it must be shown that the evidence could not have been obtained with reasonable diligence for use at the trial; secondly, the evidence must be such that, if given, it would probably have an important influence on the result of the case, though it need not be decisive; thirdly, the evidence must be such as is presumably to be believed, or in other words, it must be apparently credible, though it need not be incontrovertible. 28 InJuma’at bin Samad v Public Prosecutor[1993] 2 SLR(R) 327 (“Juma’at”) at [13], Yong CJ referred to these three requirements as “non-availability”, “relevance” and “reliability” respectively. Of these, the parties’ dispute in the present case centres on the first, namely, non-availability.",
        "Prosecution’s submissions": "29 The Prosecution submits that a “less restrictive approach” to the requirements articulated inLadd v Marshallwould be “more … consonant with s 392 [of the] CPC”, which only requires that the additional evidence be considered “necessary”. According to the Prosecution, in deciding whether the additional evidence is “necessary”, the remaining two conditions inLadd v Marshall–that of relevance and reliability – are “more important” and ought to be regarded as “the key determinators”. 30 The Prosecution further submits that there is “no principled basis to apply different standards or criteria to applications made by the accused or the Prosecution”. The requirement of non-availability “is meant to prevent admission of evidence that is clearly within the possession of parties below but which parties hadchosennot to admit” [emphasis in original], and it “should not be strictly applied when the point of evidence or issue only became apparent during a late stage of the trial or in the Trial Judge’s grounds of decision”. Reasonable diligence “has to be ascertained in relation to what parties were cognisant of, taking into account the evidence and issues during the litigation below”. 31 The Prosecution argues that Matin’s evidence could not have been obtained with reasonable diligence at the trial because “[t]he first time that the Prosecution had even heard of the existence of Idris, was when [Mr Sim] suddenly raised this while he was on the stand during his cross-examination”. This came as a “complete surprise” to the Prosecution. 32 In relation to the expert report, the Prosecution contends that the requirement of non-availability is met because the Judge’s “reasoning in relation to a rape victim’s behaviour only became known when he issued his grounds of decision”. It would be “unjust for the Prosecution not to be able to address the wrongful and harmful conceptions of rape victims [that] the Trial Judge had relied upon in his grounds of decision … especially since these conceptions only became apparentafterthe Trial Judge issued his grounds of decision” [emphasis in original]. The Prosecution emphasises that “[t]his is not [a] case where a factual witness is called to testify about his or her knowledge of the charge; rather, the purpose of [the expert] report is to obtain an expert opinion on an issue which was only revealed to bepresentanddeterminativefor the Trial Judge after he delivered his verdict” [emphasis in original]. On the requirement of relevance, the Prosecution contends that the expert report “directly contradict[s] the Trial Judge’s assessment of [the complainant’s] credibility based on his misconception of what is typical rape victim behaviour”.",
        "Defence’s submissions": "33 In its written submissions, the Defence describes the Prosecution’s account of the law as “misconceived”. Relying onSoh Meiyun v Public Prosecutor[2014] 3 SLR 299 (“Soh Meiyun”), it argues that the requirement of non-availability is less stringently applied in relation toaccused personsbecause of the drastic ramifications that a wrongful conviction can have for an accused person. In contrast, “where the countervailing consideration is instead a desire tosecure a conviction, the balance should be struck differently and the principle of finality must carry greater weight” [emphasis in original]. The Defence acknowledges that “the public interest in securing the correct substantive outcome with respect to criminal matters is a weighty concern as well”, but nevertheless argues that when the Prosecution seeks to admit further evidence, “the overarching controlling principle is one of ‘necessity’ of the evidence being sought to be admitted to enable the court to arrive at a just and fair verdict”. In order to justify “such an intrusion in the principle of finality, the further evidence should be … likely to have adecisive effecton the result of the case, such that a miscarriage of justice would ensueif the evidence is not admitted” [emphasis in original]. 34 The Defence further denies that Matin’s or Ms Ng’s evidence could not have been obtained with reasonable diligence. In relation to Matin’s evidence, it suggests that the investigation team had “failed the Prosecution by failing to secure obviously relevant evidence in the first instance”. It is unclear if the investigation team had ever made enquiries with Mr Sim to find out the identity of the drivers of the Prime Mover between 2009 and 2011. The Defence similarly contends that the expert report does not satisfy the requirement of non-availability, arguing that if a “lack of awareness as to a trial judge’s perception as to the credibility of a witness sufficed to satisfy the [condition of non-availability], it wouldstrip this condition of any utility” [emphasis in original]. The Prosecution should have known that such expert opinion on the nature of a rape victim’s evidence would be a relevant fact in a rape trial; it “does notbecomea relevant fact only after the trial judge’s grounds of decision [are] released” [emphasis in original].",
        "Key issues": "35 The first issue for our decision concerns the proper approach to be taken in determining whether further evidence should be admitted in a criminal appeal on an application made by the Prosecution. Specifically, the inquiry is whether theLadd v Marshallrequirementsought in any way to be modified – whether by way of attenuation or enhancement – when it is the Prosecution, as opposed to an accused person, who makes such an application. This will require an identification of the reasons for attenuating these requirements in the context of applications by accused persons and a subsequent assessment of whether those likewise apply to applications by the Prosecution; and whether there exist any sound reasons for modifying the requirements in the context of applications by the Prosecution. 36 The remaining issues concern more specific aspects of theLadd v Marshallconditions. First, we examine the requirement of non-availability and whether this encompasses evidence that was technically available to an applicant in the sense that he could physically have obtained it for use at trial, but had not done so because that evidence was not reasonably thought to be necessary at that time. Second, we also examine whether theLadd v Marshallapproach should be modified so as to include a consideration of the procedural implications of allowing the fresh evidence to be adduced after the trial and whether such consequences would be disproportionate when viewed against the ostensible reasons for admitting that evidence. Having set out the correct approach to be taken in each of these respects, we will then apply the analysis to the Prosecution’s application in this case. 37 It is useful to begin by reviewing the key cases on the taking of further evidence on appeal so as to identify the existing state of the law in this area.",
        "The law on taking additional evidence in a criminal appeal": "38 Section 392(1) of the CPC provides as follows: Taking additional evidence 392.–(1) In dealing with any appeal under this Part, the appellate court may,if it thinks additional evidence is necessary, either take such evidence itself or direct it to be taken by the trial court. [emphasis added] This somewhat bland reference to the necessity of allowing the additional evidence has, quite inevitably, been the subject of elaboration in the case law. A review of the jurisprudence suggests a gradual relaxation of theLadd v Marshallconditions in the context of criminal proceedings, culminating in the recent decision of Chao Hick Tin JA inSoh Meiyun. However,Soh Meiyunconcerned an application made by the accused person and not the Prosecution.",
        "The original restrictive approach": "39 We begin with the decision of the Court of Criminal Appeal inRajendra Prasads/o N N Srinivasa Naidu v Public Prosecutor[1991] 1 SLR(R) 402 (“Rajendra”). In determining whether an application by the accused person to adduce additional evidence in the form of a specialist report should be allowed, the court considered s 55(1) of the Supreme Court of Judicature Act (Cap 322, 1985 Rev Ed), which is essentially in the same terms as s 392(1) of the CPC. It recognised at [13] that the approach articulated inLadd v Marshallshould be appliedto guide the court’s discretion under s 55(1). Yong CJ, giving the decision of the court, noted at [14] that Lord Denning’s dictum inLadd v Marshallhad been repeatedly applied in various English and Malaysian decisions, and should likewise be applied in Singapore. 40 Subsequently, inJuma’at, Yong CJ referred toRajendraand reiterated at [13] thatLadd v Marshallprovided the applicable framework for considering such matters. He held at [15], however, that “the circumstances in which an application to introduce fresh evidence will be allowed are extremely limited”, citing the observation of Edmund Davies LJ inR v Stafford(1969) 53 Cr App R 1 at 3 that “public mischief would ensue and legal process could become indefinitely prolonged were it the case that evidence produced at any time will generally be admitted by this court when verdicts are being reviewed”. Yong CJ also approved of Hallet J’s remark inR v Jordan(1956) 40 Cr App R 152 at 154 that it was only in “the most exceptional circumstances, and subject to what may be described as exceptional conditions, that the court is ever willing to listen to additional evidence”. 41 Nevertheless, Yong CJ was mindful that the requirements should not be so strict that new evidence could hardly ever be admitted. He rejected the view taken in an earlier case that the need for the additional evidence should be apparent from the record itself, holding at [18] ofJuma’atthat this would “impose an unwarranted restriction on the already very narrow scope of s 257 of the CPC” (s 257 which is referred to is the present s 392 of the CPC). More crucially, with regard to the requirement of non-availability, Yong CJ held as follows: 34 It is true thatthere are situations where the court would allow additional evidence to be called even though it could not be strictly said that the evidence was not available at the time of the trial, if it can be shown that a miscarriage of justice has resulted.The core principle in s 257 of the CPC, after all, is that additional evidence may be taken if it is necessary, which must meannecessary in the interests of justice. That said, it must be emphasised in no uncertain terms thatsuch a situation will arise only in the most extraordinary circumstances. … 36 However, it is equally clear thatthe court will not allow theintroduction of the additional evidence if it was actually considered by counsel at the trial but rejected because it was thought to be unnecessary or inappropriate or of doubtful assistance to the defence(see for exampleR vPerry and Harvey(1909) 2 Cr App R 89 andR v Gatt). As recently proclaimed by the Privy Council inRodolpho de los Santos v R[1992] 2 HKLR 136, if defending counsel in the course of a case made a decision or took a course which later appeared to have been a mistake or unwise, that, generally speaking, has never been regarded as a proper ground of appeal.Aconscious decision not to adduce evidence, unless it amounted to flagrantly incompetent advocacy, did not provide a reasonable explanation for the failure to call at the trial the evidence which is sought to be introduced at the appeal. … 37 Admittedly,there have been isolated instances where in an effort tocorrect glaring injustice, evidence which was in fact considered at the trial has been allowed to be introduced in an appeal. But this is warranted only by the most extenuating circumstances, which may include the fact that the offence is a serious one attracting grave consequences and the fact that the additional evidence sought to be adduced was highly cogent and pertinent and the strength of which rendered the conviction unsafe(see for exampleMohamed bin Jamal v PPandR v Lattimore). … [emphasis added] 42 In summary, Yong CJ recognised that even if the evidence sought to be admitted on appeal was available at the time of trial (thus failing the requirement of non-availability), the appellate court retained the discretion to admit it if this was necessary to prevent a miscarriage of justice, since the court’s overriding objective was to do justice in the case before it. This would, however, be the case only in “the most extraordinary circumstances”. There could not be said to have been a miscarriage of justice if counsel had actually considered adducing the evidence at trial but decided not to do so for tactical or other reasons. But Yong CJ pointed out that even this qualification of the exception toLadd v Marshallwas itself subject to an exception; in order to prevent “glaring injustice”, evidence that was considered by counsel at the trial could nevertheless be allowed on appeal. The “extenuating circumstances” required for this to occur essentially included situations where the other two requirements inLadd v Marshallwere satisfied to the highest degree; that is, where the additional evidence was “highly cogent” (this affecting the requirement of reliability) as well as “pertinent and the strength of which rendered the conviction unsafe” (this affecting the requirement of relevance). It is clear that in Yong CJ’s view, the lodestar for the court in any application to admit additional evidence on appeal remained the need to ensure that justice was done in the case before it.",
        "Relaxation of the non-availability condition": "43 The cautious attitude inJuma’atremained the prevailing philosophy for more than two decades thereafter (see, for instance,Ang Kah Kee v Public Prosecutor[2002] 1 SLR(R) 555). However, a shift in attitude can be discerned in this court’s decision inMohammad Zam bin Abdul Rashid v Public Prosecutor[2007] 2 SLR(R) 410 (“Mohammad Zam”), which concerned an application by an accused person to admit fresh evidence on appeal against the sentence that had been imposed after he had pleaded guilty. The court noted that theLadd v Marshallprinciples had been adopted inJuma’atand that Yong CJ had described s 257 as a “narrow exception” applicable only in “extraordinary circumstances”. The court observed at [6] that “[it] would, however, emphasise that what is paramount under s 55(1) of the SCJA and s 257 of the CPC is the question of the relevancy, more specifically, materiality, as well as the credibility, of the further evidence to be adduced”. 44 Notably, it was also observed at [7] that the application in question had not arisen from a trial but from proceedings in which the accused person had pleaded guilty, and that the issue before the court related only to sentence “which, generally, [was] a matter of the judge’s discretion”. The court then continued as follows: … AlthoughLadd v Marshallhad been used as a reference [in cases such asJuma’at], we are mindful that it was a civil case. In criminal cases, where the standard of proving guilt is higher, s 55(1) and s 257 of the respective Acts would be the more direct starting points of reference.The three conditions ofLadd v Marshallmay be useful points of consideration even in a criminal case (after all, they are valid and reasonable considerations) so long as the court, in considering them, remains mindful of the higher burden of proving guilt in a criminal case.In a case such as the present,where the only issue is that of sentence, the question of the burden of proof does not have the same significance.That is because, traditionally, counsel has much latitude in what he may say by way of mitigation. In the unusual case in which a particular fact might be crucial and the court thinks that the fact is relevant, it may require it to be proved. … [emphasis added] 45 On the facts ofMohammad Zam, the judge below had, in imposing the sentence of life imprisonment, found that the accused was unlikely to have family support upon his release. On appeal, counsel for the accused submitted that it was due to an inadvertence that the judge had been led to believe that there would be no family support, and sought to adduce fresh evidence consisting of affidavits by the appellant’s brothers to show that such support existed. After explaining the views described at [43]–[44] above, the court found that none of theLadd v Marshallconditions was satisfied. The defence was aware that it would need to show family or other support of a reliable nature that would address the accused’s need for long-term medical treatment but had failed to deal with the matter below; and the affidavits it produced on appeal did not sufficiently address the need for close supervision of the accused. Furthermore, the affidavits were not reliable given that they contradicted the statement of facts. Notably, none of the accused’s siblings had visited him in remand. The court therefore refused the application. 46 We make two observations on the court’s reasoning inMohammad Zam. First, the court highlighted the need for sensitivity to the fact that the application was made in the context of criminal proceedings, where the standard of proof (to be met by the Prosecution) was higher than that in civil proceedings (to be met by the plaintiff). This is simply another way of saying that the considerations in criminal proceedings – in which issues of life and liberty are potentially at stake – are of a different nature from those which arise in civil proceedings. This is a point that was subsequently elaborated upon by Chao JA inSoh Meiyun, to which we will shortly turn. Second, the court must be sensitive to the procedural background of the application and the type of outcome with which the proceedings are concerned. If the application is made following a plea of guilt and the only issue before the court is that of sentencing and not conviction, the court may decide to accord greater latitude to the applicant, not least because if there is a dispute over the matter covered by the new evidence, the court may require the new evidence to be proved (for instance, by remitting the matter to the trial judge to convene a Newton hearing – for an example of this, seeNg Chun Hian v Public Prosecutor[2014] 2 SLR 783). Having said that, careful evaluation of the application remains necessary even if the court is willing to afford greater latitude to the applicant. 47 In that light, we turn to Chao JA’s decision inSoh Meiyun. The appellant in that case was convicted after trial of causing hurt to a domestic maid and was sentenced to a total of 16 months’ imprisonment. She appealed against the sentence, seeking also to adduce a psychiatric report which stated that she had suffered from major depressive disorder and obsessive compulsive disorder at the time of the offences. Chao JA began by noting the requirement in s 392(1) of the CPC that the fresh evidence be “necessary”, and that the case law required the court to assess this by applyingLadd v Marshall. He observed at [15] that followingJuma’at, the Court of Appeal inMohammad Zamappeared to have “favoured a less restrictive approach”, placing greater emphasis on the requirements of relevance and reliability rather than non-availability. Chao JA then reasoned as follows at [16]: In my view,where the fresh evidence would go towards exonerating a convicted person or reducing his sentence, the spirit of greater willingness to admit such evidence on appeal as demonstrated by the Court of Appeal inMohammad Zamis to be preferred. TheLadd v Marshallcondition of non-availability is designed to prevent the waste of judicial resources that results from reopening cases which ought to have been disposed of the first time around, but there is thecountervailing consideration that an erroneous criminal conviction or erroneously heavy punishment will have drastic ramifications for the convicted person. It could spell an unjustifiably lengthy period of incarceration and/or corporal punishment, or in the worst case, death. Even if none of these undeserved penalties ensues, since one of the functions of the criminal law is to label persons as deserving of society’s condemnation by reason of their conduct, a conviction carries with it an indelible moral stigma that affects the person’s life in many real ways. Hence,an appellate court exercising criminal jurisdiction should generally hold that additional evidence which is favourable to the accused person and which fulfils theLadd v Marshallconditions of relevance and reliability is “necessary” and admit such evidence on appeal. [emphasis added] 48 On the facts of the case, Chao JA found at [17] that although the conditions of relevance and reliability were satisfied, that of non-availability was not since the psychiatric report was based on the accounts provided by the appellant and her husband of the appellant’s mental state at the time of the offences, and therefore could not be said to be new information discoverable only at a later stage. He also found that if counsel for the appellant had searched with reasonable diligence for mitigating circumstances at the trial below, he would have obtained such information from the appellant. Nevertheless, Chao JA decided at [20] that the psychiatric report should be admitted: At stake here is a person’s liberty. For that reason,where there is someevidence that is not incredible and would be an important influence on the appellate court’s decision on whether leniency is called for towards the appellant, the court should be slow to reject that evidence outright, even if the evidence could, with reasonable diligence, have been discovered for use at trial.I thought that this was true of the Medical Report in the present case. As a consequence I considered that the Medical Report was “necessary” and allowed its admission into evidence. [emphasis added] 49Soh Meiyunmade it clear that in determining whether an application by anaccused personto admit further evidence on appeal should be allowed, the key considerations are the relevance and reliability of the evidence. Notably, althoughSoh Meiyun(likeMohammad Zam) involved an appeal againstsentence, Chao JA held that the less restrictive approach would also apply in cases “where the fresh evidence would go towards exonerating a convicted person” (see [47] above), that is, where the appeal was againstconviction. More recently, inIskandar bin Rahmat v Public Prosecutor and other matters[2017] 1 SLR 505, we affirmed the principles governing the admission of fresh evidence in a criminal appeal as set out inSoh Meiyun, recognising at [72] that Chao JA had preferred “the less restrictive approach” favoured inMohammad Zamand that the condition of “non-availability” was to be regarded as “less paramount than the other two conditions”.",
        "Applications by the Prosecution": "50 In recent years, the High Court has also had the opportunity to consider applications under s 392(1) made by the Prosecution (as opposed to accused persons). InPublic Prosecutor v Development 26 Pte Ltd[2015] 1 SLR 309 (“Development 26”), the Prosecution appealed against the sentence imposed on the respondent company for the offence of carrying out works within a conservation area without having obtained prior permission. Its appeal was coupled with an application to admit further evidence in the form of affidavits of certain officials from the Urban Redevelopment Authority (“URA”), explaining that there was great national and public interest in the protection of conservation areas such that carrying out unauthorised works in such areas ought to be considered a serious offence. See Kee Oon JC (as he then was) held at [10] that although the affidavits fulfilled the conditions of relevance and reliability, they did not meet the condition of non-availability given that the matters attested to were within the knowledge of the URA personnel long before the respondent’s guilty plea was taken. This led See JC to consider whether a failure to meet the condition of non-availability necessarily precluded an appellate criminal court from permitting the adduction of the additional evidence. He held at [11] that “the answer [was] ‘no’” and that “in [his] estimation this answer in the negative [was] more emphatic now than it was two decades ago”. 51 Following a brief review of the cases, See JC then observed as follows at [15]: Therefore, it was clear to me from the authorities that the failure in the present case to fulfil the condition of non-availability was not fatal to the Prosecution’s application to adduce additional evidence. The question that remained was whether I ought to allow it in spite of that failure. My answer to this, in turn, was “no”.The appellate criminal court must balance procedural fairness and concerns of finality and due process on one hand with the public interest in ensuring the correct substantive outcome on the other, and in my view the balance came down firmly in favour of finality in the circumstances of the present case. [emphasis added] 52 There were essentially two reasons for See JC’s decision to refuse the Prosecution’s application. First, given that the respondent had pleaded guilty in circumstances where no statement of facts had been prepared and no address on sentence had been made, it would “completely alter the factual basis for the plea of guilt” if the Prosecution were allowed to adduce additional evidence on appeal: at [17]. We will elaborate on See JC’s reasoning on this point later at [76] below. Second, accused persons who plead guilty “ought to be able to expect that their acceptance of their guilt and election not to proceed to trial will bring speedy closure to the criminal proceedings against them”: at [18]. In See JC’s view, the respondent ought to be able to expect that having pleaded guilty, the Prosecution “would not thereafter seek on appeal to increase the sentence imposed while simultaneously seeking to alter the entire factual basis for its plea of guilt”. That was “inherently unfair” to the respondent. See JC concluded his analysis on the following note (at [20]): I should add that I do not rule outthe existence of situations in which upholding an accused person’s expectation of finality in pleading guilty would lead to some intolerable injustice such that it would be right to allow the Prosecution to introduce additional evidence on appeal. The appellate criminal court mustbalance competing considerationsand in other cases there may be circumstances which compel a different result. [emphasis added] 53 In short, where the application to admit further evidence is made by the Prosecution, the interest in ensuring the correct substantive outcome is to be balanced against the need for finality in litigation, the relevance and importance of which depends once again on the procedural background of the application (such as, for instance, the fact that the application is made following a plea of guilt by the accused person who would therefore be entitled to expect that facts concerning the nature of his misconduct would not be reopened). In every case, however, the court will ultimately be guided by the need to do justice and it therefore remains within its discretion to allow the further evidence if this is necessary to avoid substantial injustice. 54 InPublic Prosecutor v Kong Hoo (Pte) Ltd and another appeal[2017] 4 SLR 421 (“Kong Hoo”), the Prosecution’s application to admit further evidence was filed only after the hearing of the appeal, but before the appeal had been decided. For present purposes, it suffices to note See Kee Oon J’s comment at [24] that in contrast to an application made by an accused person, “there [were] reasons … to think that astricterapproach should apply where it is the Prosecution that is making such an application” [emphasis added], although See J ultimately declined to express any concluded view on this point because “even applying the more liberal approach set out inSoh Meiyun”, the Prosecution’s application would nonetheless have failed.",
        "Approach to assessing applications by the Prosecution to admit further evidence on appeal": "",
        "Rationale for assessing applications by accused persons differently": "55 Having reviewed the case law on the admission of new evidence in a criminal appeal, we now turn to consider whether there should be any difference in the approach adopted by an appellate court in assessing applications made by accused persons and those by the Prosecution. 56 In our judgment, unlike applications by accused persons, the conditions set out inLadd v Marshallshould continue to apply in an unattenuated manner to applications by the Prosecution to admit further evidence in a criminal appeal. The simple but compelling reason for this difference in treatment is that the justifications for attenuating theLadd v Marshallconditions in assessing applications by accused persons simply do not apply where the applicant is the Prosecution. We will elaborate. 57 To begin, as Chao JA emphasised inSoh Meiyun(see [47]–[49] above), there is a dire anxiety on the part of the court not to convict an innocent person or to impose a sentence that is out of proportion to the criminality of an offender’s conduct. The first and most obvious reason for treading carefully is to avoid the considerable prejudice that would be suffered by an accused person who is wrongfully convicted or who receives a manifestly disproportionate sentence relative to his culpability. As we observed inKho Jabing v Public Prosecutor[2016] 3 SLR 135 (“KhoJabing”) at [2], “the cost of error in the criminal process is measured not in monetary terms, but in terms of the liberty and, sometimes, even the life of an individual”. And the consequences of error are suffered not merely by the accused person but society as a whole. Deane J remarked inVan Der Meer v R(1988) 82 ALR 10 at 31 that there is a “searing injustice and consequential social injury … when the law turns upon itself and convicts an innocent person”. Every wrongful conviction or excessive sentence not only undermines public confidence in the ability of the courts to reach correct decisions but also, and more fundamentally, runs contrary to the very purpose of criminal law itself, which is to punish the guilty and protect the innocent. The cost of error is therefore also the erosion of the moral legitimacy of the criminal justice system. For these reasons, there is lasting wisdom in what has become known as Blackstone’sratio: “[F]or the law holds, that it is better that ten guilty persons escape, than that one innocent suffer” (Sir William Blackstone,Commentaries on the Laws of Englandvol 4 (Oxford Clarendon Press, 2nd Ed, 1765–1769) at 352). The law strains against and works doubly hard to prevent any erroneous deprivation of liberty. 58 A second reason for assessing applications by accused persons more leniently than those by the Prosecution is the disparity of resources between the Prosecution and accused persons generally. The Prosecution works in tandem with law enforcement agencies, including the police, to obtain the evidence needed to build a case against an accused person. The CPC accords the police wide-ranging powers to collect any evidence it deems necessary. For instance, it may order that a person produce any document or thing in his possession which it believes necessary or desirable for any investigation (s 20 of the CPC), require the attendance of any person acquainted with the facts and circumstances of the case being investigated and record statements from that person (ss 21 and 22 of the CPC) and, in the appropriate circumstances, search for and seize property suspected to constitute evidence of an offence (ss 34 and 35 of the CPC). Having received from the police the recorded statements of the accused person and the witnesses as well as any other evidence, the Prosecution is then well-placed to make decisions as to whether charges should be brought against the suspected offender and, if so, the nature of the charges to be brought, what evidence to lead at trial and how to run its case generally. While the introduction of the criminal case disclosure procedures in 2014 (see ss 157–171 of the CPC) go some way toward reducing asymmetries of information between the Prosecution and accused persons (by creating “a formalised system of reciprocal disclosure that imposes obligations on both the Prosecution and accused to reveal aspects of their cases and the evidence that each party intends to rely on at the pre-trial stage”:Public Prosecutor v Li Weiming and others[2014] 2 SLR 393 (“Li Weiming”) at [25]), there remains a real, obvious and undeniable gap between the resources of the Prosecution and accused persons in general. This forms the basis for a reasonable expectation that the Prosecution is in possession of all the evidence it deems necessary to make its case by the time of trial. Conversely, it also justifies a comparatively more accommodating attitude in relation to attempts by accused persons to admit new evidence on appeal. 59 In addition, we note that the point in time at which the Prosecution formally brings charges against an accused, thereby initiating the criminal litigation process, is a matter that is essentially within the Prosecution’s discretion. This means that the Prosecution has the opportunity to ensure that the evidence it has gathered with the assistance of the police is in a satisfactory state before it mounts charges against the accused. Once the criminal case disclosure procedure has commenced, the CPC prescribes specific timelines for the submission of the required documents (such as the Cases for the Prosecution and the Defence). One of the objects behind the introduction of the criminal case disclosure procedure is the timely disclosure of information between the Prosecution and the defence, so as to facilitate the efficient dispensation of criminal justice:Li Weimingat [26]. The necessary consequence of these timelines, however, is that both the Prosecution and the defence only have a limited duration to prepare their respective cases, identify the relevant witnesses, and marshal the evidence to be relied upon. But because the Prosecution has the lead time before it presses charges against the accused, the length of which is largely within its control, the effect of these timelines for case disclosure is felt much more acutely by accused persons. This furnishes yet another reason for recognising that an accused person may not have as full an opportunity to deliberate on his litigation strategy and gather the evidence he wishes to put before the trial judge. It is therefore at least in part to ensure greater parity between the Prosecution and the defence that more leniency is afforded to accused persons wishing to have fresh evidence admitted on appeal. 60 Finally, it should not be forgotten that an accused person defending criminal charges experiences a strain and anxiety that is difficult for those who have not endured a similar ordeal to imagine. Potentially at stake for the accused are his reputation, career, relationships with friends and loved ones, his property, liberty and perhaps even his life. The implications of a criminal conviction and sentence will surely weigh heavily on his mind. Once investigations against the accused have commenced and been made known to him, he will also have to cooperate with police investigations, which may be an extended obligation causing disruption to his employment and routine. In addition, the accused will have to deal with any estrangement or suspicion arising from the social stigma attaching to these investigations. In short, the life of an accused person may be completely upended by the criminal investigations and subsequent proceedings. It is a lonely and quite possibly lengthy process, at the end of which – even if the result is an acquittal – the accused’s life may no longer resemble what it might once have been. It is in this state of considerable mental and emotional distress that the accused has to determine how to run his case at trial and the evidence required to establish it. Fairness demands that we accord sufficient recognition to the harrowing nature of this individual experience and its likely effect on the accused’s ability to fully and soundly consider the nature of the evidence he will need at trial. 61 For these reasons, we find that the more accommodating attitude toward applications by accused persons as adopted inSoh Meiyunis entirely justified. As Chao JA held inSoh Meiyunat [16] and [20], that relative leniency sounds in a moderation of the condition of non-availability, such that if the court is satisfied that the additional evidence which is favourable to the accused fulfils the requirements of relevance and reliability, that evidence is likely to be regarded as “necessary” within the meaning of s 392(1) of the CPC and admitted. 62 Counsel for the Prosecution, Deputy Attorney-General Mr Hri Kumar Nair, argued before us that the Prosecution has a countervailing interest in criminal proceedings which likewise justifies according it greater leniency in its applications to admit new evidence on appeal. In pursuing the litigation, the Prosecution acts to protect the public interest and cannot be considered to be akin to a party in civil proceedings contesting private interests. Mr Nair further pointed out that the rules of criminal litigation already contain safeguards for accused persons, such as the need for the Prosecution to prove beyond a reasonable doubt that the accused person committed the alleged offences, even if the Prosecution succeeds in its application to admit further evidence on appeal. 63 We accept that in initiating and pursuing criminal proceedings, the Attorney-General is exercising a public function – he is acting in his capacity as the Public Prosecutor pursuant to s 11(1) of the CPC. Accordingly, he does not act out of self-interest but rather out of a statutory duty to ensure that the criminal laws of our country are enforced and offenders are made to suffer the legal consequences of their actions. As See JC noted inDevelopment 26(see [51] above), there is a public interest in ensuring correct substantive outcomes, and this clearly applies to the Prosecution’s endeavour to ensure that crimes do not go unpunished. But the inquiry is much more specific than the consideration of whether the Prosecution has a legitimate interest in the proceedings, even if this interest is one as crucial as the protection of the public through the enforcement of criminal law. The inquiry really concerns the ability of the Prosecution (as compared to accused persons in general) to obtain and marshal the evidence required to support its case at trial. The focus is therefore on the powers, resources and time available to the party in question. And as we have explained, there exists a significant disparity between the Prosecution and accused persons in this regard. The court is also particularly mindful of the especial harm and injustice that results from a wrongful conviction or a manifestly disproportionate sentence. It is for these exceptional reasons of fairness and principle that the court countenances an attenuation ofLadd v Marshallfor accused persons in the manner described inSoh Meiyun. 64 Having said that, we also do not see any reason why theLadd v Marshallconditions should conversely be enhanced when it is the Prosecution that makes the application. As Yong CJ observed inJuma’at(see [41] above), the court should not “impose an unwarranted restriction on the already very narrow scope of [s 392] of the CPC”. The result is that theLadd v Marshallconditions – including the condition of non-availability – should apply without modificationto applications by the Prosecution to admit further evidence on appeal.",
        "EvaluatingLadd v Marshallmore specifically": "65 We mentioned at the beginning of this judgment that the conditions of non-availability, relevance and reliability as articulated by Lord Denning inLadd v Marshallcontinue to represent the core considerations of the court in determining how its discretion under s 392(1) of the CPC should be exercised. One observes from the case law described above that in recent years, our courts have initiated a gradual refinement of theLadd v Marshallconditions in the context of criminal proceedings. In a similar vein, the present case throws into sharp relief two particular aspects ofLadd v Marshallthat, in our view, call for reconsideration. Evidence not reasonably thought to be necessary at trial 66 As defined inLadd v Marshall, the requirement of non-availability requires the applicant to show that the evidence “could not have been obtained with reasonable diligence for use at the trial” (see [27] above). Typically, this invites a consideration of whether the evidence was physically available to the applicant such that he could have, with reasonable diligence, obtained it for use at trial. For instance, inSoh Meiyun(see [48] above), Chao JA held at [17] that the psychiatric report sought to be adduced on appeal did not satisfy this requirement because the psychiatrist’s diagnosis was based on the accounts provided by the appellant and her husband at the time of the offences and thus “was not some new information discoverable only at a later stage”. InKong Hoo, See J likewise held that the requirement was not met, finding at [25] that the evidence put forward by the Prosecution (official documents from the Madagascan government that purportedly demonstrated that the respondents’ evidence of authorisation to export Madagascan rosewood from the Madagascan authorities was false) could have been procured with reasonable diligence by the Prosecution, since the Prosecution “ought to have been aware at least as early as [almost a year before the appeals were heard] that they could have located these potential sources of information”. Accordingly, the crux of the court’s analysis in these cases has been whether the applicant would, with reasonable diligence, have known of the existence of the information and been able to obtain it for use at trial. 67 The application before us presents a somewhat different complexion. The Prosecution’s argument is not that it could not, with reasonable diligence on its part, have known of the existence of the further evidence and physically obtained it for the Judge’s consideration at trial, but rather that itcould notreasonably have known that the evidence would be necessary, such that it should have adduced it at trial. More precisely, it could not reasonably have known that the Judge would draw conclusions about the complainant’s credibility based on his own impressions of how rape victims in general come forward to disclose the abuse they have suffered. The need for the Prosecution to address that issue came to light only after the Judge explained his reasoning in the GD (see [32] above). 68 We will consider later when we apply the legal framework to the facts before us in this case, whether, given the manner in which the litigation unfolded, the Prosecution can truly be said to have been caught unawares as to the need to adduce evidence to address the issue of the complainant’s disclosure of the sexual abuse. As a matter of law, however, we consider that when the court determines whether the requirement of non-availability has been satisfied, it should also turn its mind to the issue of whether the evidence sought to be admitted on appeal was reasonably not thought to be necessary at trial. If a party ought reasonably to have been aware, either prior to or in the course of trial, that the evidence would have a bearing on its case, and that party fails to make a sufficient attempt to adduce the evidence at trial, this should militate against permitting the party to subsequently have that evidence admitted on appeal. But where it was reasonably not apprehended that the evidence would or could have a bearing on the case at hand, a different result should ensue. Counsel cannot be expected to consider things that, objectively and reasonably, would not have been thought to be relevant to the case. The determination of whether a party would reasonably not have thought the evidence to be necessary at trial naturally requires consideration of the issues that the party would reasonably have become aware of either before or during the course of trial. 69 In our judgment, the inquiry as to whether a party would reasonably have been aware of and procured the further evidence in the course of trial is an essential consideration to ensure fairness and due process. Having said that, we think the need for such an inquiry will be rare because the trial judge is, in the general run of things, unlikely to have unilaterally propounded an issue or decided it without the aid of evidence or submissions. But where this does arise, we consider that a party should be afforded the opportunity to belatedly put forward the evidence necessary to address that issue and such evidence should also be found to satisfy the condition of non-availability underLadd v Marshall. 70  We do not accept, however, the Prosecution’s submissions that the condition of non-availability is meant to prevent admission of evidence that is within the possession of parties below but which parties had simply chosennot to admit, and that reasonable diligence “has to be ascertained in relation to what parties were cognisant of, taking into account the evidence and issues during the litigation below” (see [30] above). The former submission has utterly no basis in the case law. As for the latter submission, it does not find favour with us because it injects a subjective element into the process, namely what the parties “were cognisant of” when we think the correct approach is to adopt an objective analysis of what should reasonably have been anticipated, having regard, as we observed above, to what they would reasonably have become aware of before or during the trial. 71 We likewise reject the Defence’s suggestion that where the Prosecution seeks to admit further evidence on appeal, the further evidence must be likely to have a “decisive effect” on the result of the case (see [33] above). This amounts to a requirement that the new evidence be dispositive of the dispute, and essentially involves elevating the second requirement inLadd v Marshall– that of relevance – to a degree that goes significantly beyond what was contemplated by Lord Denning, which is that the evidence “must be such that, if given, it would probably have an important influence on the result of the case,though it need not be decisive” [emphasis added] (see [27] above). No reason was advanced to justify such an elevation and we can think of none. Proportionality 72 In our judgment, it is also relevant to bear in mind the implications of allowing the application on the course of the proceedings and the position of each party. This requires the court to look prospectively at the likely consequences of a decision to admit the fresh evidence. The court may deem it necessary, if it were to admit the evidence, to remit the matter to the trial judge to take further evidence or even conduct a retrial. There are two reasons why such consequences should feature in the court’s consideration of whether the evidence should be admitted: first, the need for the expeditious conduct and conclusion of litigation; and second, the prejudice that might be occasioned to the respondent in the application. Put another way, it is relevant for the court to consider theproportionalityof allowing the application and admitting the further evidence. This requires the court to assess the balance between the significance of the new evidence, on the one hand, and the need for the swift conduct of litigation together with any prejudice that might arise from the additional proceedings, on the other. We will briefly explain. 73 If the court finds, for instance, that the respondent should be given an opportunity to cross-examine the maker of the new evidence (assuming the new evidence was admitted), and possibly other relevant witnesses as well and therefore decides that the matter should be remitted to the trial judge, this will necessarily delay the disposal of the litigation by a considerable degree. And where the appellate court takes the view that the proper consequence of allowing the fresh evidence is a retrial, the resulting expense of judicial resources as well as the time, effort and cost on the part of the witnesses will all be substantial. In cases involving vulnerable witnesses, the court should also bear in mind the considerable trauma these witnesses might experience in having to testify and be cross-examined on their experiences a second time. We explained inKho Jabingat [55] that it is in the wider public interest that there be an efficient and economical allocation of court resources. 74 Perhaps even more crucially, the respondent in the application may suffer prejudice going beyond cost, time and effort if further proceedings are ordered. InDennis Reid v The Queen[1980] AC 343 (which we cited with approval inAOFat [296]–[298]), Lord Diplock, giving the unanimous opinion of the Board of the Privy Council, held as follows (at 350): … So too [is it a relevant] consideration thatany criminal trial is to some extent an ordeal for the defendant, which the defendant ought not to be condemned to undergo for a second time through no fault of his own unless the interests of justice require that he should do so. The length of time that will have elapsed between the offence and the new trial if one is ordered may vary in importance from case to case, though having regard to the onus of proof which lies upon the prosecution lapse of time may tend to operate to its disadvantage rather than to that of the defendant. Neverthelessthere may be cases where evidence which tended to support the defence at the first trial would not be available at the new trial and, if this were so, it would be a powerful factor against ordering a new trial. [emphasis added] 75 In our view, where evidence that favoured the respondent at the trial would no longer be available at the further proceedings (whether this is a retrial or some other type of proceedings) to be ordered if the new evidence were admitted, and it would be necessary for this evidence to be re-examined or led again at the further proceedings in light of the new evidence, this would weigh heavily against allowing the application. The respondent would otherwise be severely prejudiced, through no fault of his own, by intervening events or the lapse in time between the trial and the further proceedings. In our judgment, the court should be sensitive to this and other such factors at the time it decides whether to allow the application. 76 A careful review of the case law reveals that considerations of proportionality and prejudice have already featured in the local decisions on applications under s 392(1) of the CPC. InDevelopment 26(see [50]–[52] above), one of See JC’s primary reasons for refusing the Prosecution’s application to admit affidavits by URA personnel on appeal was that the respondent’s guilty plea would have to be set aside, and this was thought to be a disproportionate outcome. At the plead guilty mention, the Prosecution had not submitted any statement of facts or delivered any address on sentence. See JC explained at [16] that an accused person’s guilty plea “marks [his] acceptance of the charges against [him] as well as what is set out in the statement of facts if one is prepared. The charges and the statement of facts constitute the four corners of the case against them.” It was accordingly an “important procedural safeguard” that “the plea of guilt does not and cannot extend to additional facts or information outside of what has been conceded”. Given the circumstances, See JC reasoned as follows at [17]: … If the Prosecution were allowed to adduce additional evidence on appeal, this would completely alter the factual basis for the plea of guilt. This was not merely a plausible risk but a patent reality. In my opinion that would then require the court toseriously consider setting aside what was otherwise a perfectly valid and proper plea. I did not think this at all a desirable outcome and this weighed against allowing the Prosecution to adduce the additional evidence.The respondent had no reason to wish to retract the plea and had been duly convicted and sentenced. The fines had been paid. … See JC therefore concluded at [19] that it was “[i]n the interests of justice and fairness” that the Prosecution’s application should be dismissed. 77 InKong Hoo(see [54] and [66] above), the respondents faced charges under s 4(1) of the Endangered Species (Import and Export) Act (Cap 92A, 2008 Rev Ed) (“ESA”). The district judge initially found that the Prosecution had not established a case for the defence to answer and thus acquitted the respondents. See J allowed the Prosecution’s appeal and remitted the matter to the trial judge for the defence to be called. Before the district judge, the respondents elected to remain silent and offered no evidence in their defence. The district judge acquitted the respondents and rejected the Prosecution’s subsequent application, made after the district judge had delivered her decision, to have the charges amended to offences under a different provision of the ESA. The Prosecution appealed a second time and, following the hearing of the appeal, filed an application to admit further evidence as described at [66] above. 78 See J dismissed the application, finding at [25]–[28] that the further evidence did not satisfy the conditions of non-availability and reliability. He then went on at [29] to expressly address the prejudice that would have occasioned to the respondents if the application were allowed: Finally, there was the issue of prejudice. When the matter was remitted for the defence to be called, the charge that was preferred against each respondent was one under s 4(1) of the ESA and the evidence was as it stood before me at the time of the first appeal. The respondents clearly made their decision not to offer evidence in their own defence on that basis.If the Motion were allowed,fairness would demand that the respondents be permitted at least the opportunity of reconsidering their decision not to give evidence, if not a retrial of the matter in its entirety. Either way, this would allow relitigation of the matter at a stage when the appeals have already been heard and judgment is about to be delivered.In [Mohammad Zam] at [6], the Court of Appeal stressed that the power granted to the court to permit further evidence on appeal always had to be “balanced by the public interest in the finality of trial and ensuring that trials are not reopened each time evidence that should have been admitted at first instance was not admitted”. I bear this well in mind. In my judgment, this was not a case in which leave should be given for further evidence to be adduced. [emphasis added] In short, See J was influenced by the fact that the implications of allowing the further evidence – that is, allowing the respondents to reconsider their decision to remain silent at trial, or a retrial of the entire matter – would be disproportionate, particularly in the light of the advanced stage of the proceedings. This strongly militated against permitting the application. 79 Finally, we also note that proportionality has been alluded to as a relevant consideration in the context of applications to adduce further evidence in civil appeals. InChong Joon Wah v Tan Lye Thiang[1991] 2 SLR(R) 277, the respondent had appealed to the High Court against the decision of a district judge who had ordered him to pay damages of $3,629 following a motor accident. The respondent also sought to admit the evidence of an additional witness in the appeal. The High Court judge allowed the application and decided that a retrial was necessary in the light of the further evidence. The Court of Appeal set aside the High Court judge’s decision, finding at [7]–[8] that the evidence of the new witness could not have had an important influence on the result of a fresh hearing before another district judge and that the respondent had also failed to provide a sufficient explanation as to why that evidence could not have been obtained with reasonable diligence for use at the trial. Yong CJ, who delivered the judgment of the court, then remarked as follows (at [9]): It need hardly be said that there must be finality in litigation. Even apart from the principles laid down inLadd v Marshall([6]supra), the costs of litigation require thatsome semblance of proportion must be maintained, and the Court of Appeal would be reluctant to order a new trial when the amount at stake is so small and the proceedings in court have already taken so long. [emphasis added] 80 In closing, we wish to highlight that considerations of proportionality and prejudice are also relevant to the court’s identification of thetypeof further proceedings to be ordered, if it has formed the view that the new evidence should be admitted. For reasons of economy and efficiency, we think that the court should generally only order such additional proceedings as are necessary to address the issues raised by the new evidence. To accomplish this, the court must, with the assistance of the parties, identify with as much precision as possible the witnesses who are to be recalled and the particular issues on which their testimony is required in the light of the new evidence.",
        "Application to the facts": "81 Given the principles outlined above, the unattenuated requirements inLadd v Marshallwill apply to the Prosecution’s application to admit the evidence relating to Matin and Ms Ng. We will consider the two categories of fresh evidence in turn, beginning with the affidavits relating to Matin’s evidence.",
        "Matin’s evidence": "82 In our judgment, the affidavits relating to Matin’s evidence (namely, the affidavits of Supt Chua, ASP Jaga and Matin) fail to meet the condition of non-availability. 83 The Prosecution argues that Matin’s evidence could not have been obtained with reasonable diligence at trial because “[t]he first time that the Prosecution had even heard of the existence of Idris, was when [Mr Sim] suddenly raised this while he was on the stand during his cross-examination”. We disagree for two reasons. First, there is no evidence to show that the Prosecution or the investigation team had made sufficient enquiries of Mr Sim to ascertain the identity of the drivers of the Prime Mover between 2009 and 2011. If such investigations (which are to be reasonably expected given the significance of the Prime Mover to the First, Fifth and Sixth Charges) had been conducted, the existence of Idris would likely have surfaced much earlier. Second, even assuming that the Prosecution would not have known of Idris’ existence had it or the investigation team exercised reasonable diligence prior to trial, it is undeniable that the Prosecution became aware of Idris’ existence when Mr Sim was cross-examined on 22 July 2016. This was at least four days before the Prosecution decided to close its case on 26 July 2016. In this intervening period, after learning of Idris’ potential involvement, the Prosecution could have chosen to seek an adjournment for further investigations instead of closing its case. This would reasonably have been the expected course, given the importance of the evidence disclosed. If Mr Sim’s claim that Idris was the primary driver of the Prime Mover were accepted, this would obviously cast doubt on the Prosecution’s case that the respondent had regular access to and use of the Prime Mover. 84 In fact, in oral argument, Mr Nair conceded that insufficient investigations had been done in this regard prior to the trial, and that at trial the Prosecution had made the decision to “press on” and not to seek an adjournment of the proceedings for further investigations even after the existence of Idris was made known. Mr Nair expressly accepted that sufficient “digging was not done”. Having made the “conscious decision” not to ask for an opportunity to obtain further evidence in this regard before closing its case (seeJuma’atat [36], cited at [41] above), we do not think the Prosecution’s argument that this evidence could not have been obtained with reasonable diligence can now be accepted. 85 For this reason, we decline to admit the affidavits relating to Matin’s evidence.",
        "Ms Ng’s evidence": "86 The question of whether Ms Ng’s evidence should be admitted is more complex and requires a closer examination of the expert report. It is necessary to begin, however, with the specific findings made by the Judge that prompted the present application. Judge’s findings 87 The application to admit the expert report stemmed primarily from the observations made by the Judge at [40]–[41] of the GD (briefly alluded to at [17] above), which have been described by the Prosecution to be “disquieting in several aspects”. The material parts of those paragraphs read as follows: 40 … The focus on a complaint made “at or about the time when the fact took place”, or a “recent complaint” is apposite. Good sense dictates that a complaint should be made within a reasonable time after the event. Where a person remains silent, and only complains after a long delay, that delay must be scrutinised. In the present case, the girl was not at all prompt in her complaints although she had every opportunity to complain. There were no reasons for her not to confide in members [of] her family or her boyfriend. She had ample time to recover from any distress or embarrassment that she may [have] experienced. 41 Someone so abused and humiliated would be expected to seek help and redress when she breaks her silence. In her case, however, she was still reluctant to make a police report. Furthermore, when she did speak, what she said was contradictory and inconsistent, with allegation of touching (and no rape) to the mother, and rape (and no digital penetration) to the brother, sister and boyfriend. With the passage of time, the girl should not have difficulty to recount accurately the forms of abuse she was put through. 88 To provide some context, the Judge’s reference to a “recent complaint” at [40] flowed from his earlier discussion on the corroborative effect of the evidence given by the complainant’s family members and boyfriend under s 159 of the Evidence Act (see [16] above). At the hearing before us, it was common ground that the Judge’s subsequent observations at [40]–[41] went beyond the narrow issue of corroboration under s 159. More specifically, the Judge’s findings on the complainant’s delay in disclosure and reluctance to make a police report affected his general assessment of the complainant’s credibility. This is evident from the subsequent findings he went on to make with respect to the complainant’s credibility and his eventual conclusion that the complainant’s evidence “was not unusually compelling or convincing”: 43 Looking at [the complainant’s] evidence of the [respondent] sending her sister out of the flat so that he can be alone with her (which should be corroborated by her sister), nothing was mentioned by the sister at all.These, and the other matters I have referred to have a negative impact on her credibility. … 44 The [complainant’s] evidencewas not unusually compelling or convincing and the other evidencedid not strengthen the prosecution[’s] case in any significant way. ... [emphasis added] Contents of the expert report 89 There is a total of 12 sections in the expert report. Sections 1 to 3 set out the circumstances leading to Ms Ng’s preparation of the report, her acknowledgement of her duties to the court as an expert witness as well as a description of her credentials and experience. Sections 4 to 9 of the expert report are the material portions that concern Ms Ng’s expert knowledge on the psychological effects of sexual abuse. Section 4 briefly describes the symptoms of trauma experienced by victims of sexual abuse and rape; section 5 describes and debunks commonly held “rape myths”; section 6 explains the victims’ psychological responses during and after rape; section 7 discusses various characteristics of victims’ disclosure of sexual abuse, including reasons for delay in disclosure of child sexual abuse; section 8 summarises behavioural and neuroscience research on the effects of emotion on memory; and section 9 sets out the reasons for inaccuracies and inconsistencies in victims’ accounts of sexual abuse. 90 Section 10 essentially consists of Ms Ng’s application of the information set out in sections 4 to 9 to the circumstances of the complainant. Ms Ng considers the complainant’s delay in disclosing her experiences to her family members and boyfriend, her reluctance to report the matter to the police, her failure to provide a detailed account of the rape to her mother, reasons for her apparently contradictory and inconsistent account of the sexual abuse, as well as reasons for her apparent inability to provide a detailed description of the interior of the Prime Mover. Notably, in section 11, entitled “Limitation of my expert opinion”, Ms Ng highlights that “all the information about [the complainant] that [she had was] from the materials [described at [24] above]”. She had not “personally conducted a face-to-face assessment or personally questioned [the complainant]”. Section 12 (which is the final part of the expert report) contains Ms Ng’s conclusion that the complainant’s behaviour was “highly realistic”, in the light of what she had said earlier in section 10. Parties’ submissions during and after the hearing 91 In oral argument, Mr Nair focused on the Judge’s analysis of the complainant’s apparent delay in communicating her allegations to her family members as well as her reluctance to report the matter to the police even after she had informed her family members about the respondent’s misconduct, as set out in [40]–[41] of the GD (reproduced at [87] above). When we asked Mr Nair whether either party had made submissions to the Judge on these matters or if the complainant had been questioned at trial about her reasons for such delay and reluctance, Mr Nair responded that it had not been suggested or put to the complainant that her delay in making her complaint demonstrated that her evidence was false. The timing of her complaints “[did not] feature much” in the cross-examination. On the topic of relevance, Mr Nair submitted that one of the reasons the Judge found the complainant unconvincing was her delay in disclosure and that this had impacted the Judge’s assessment of her credibility. 92 We also asked counsel for the Defence, Mr Abraham Vergis (who had also acted for the Defence in the trial below), whether in the course of cross-examination, he had questioned the complainant on the delay in her disclosure of these matters. Mr Vergis responded that he had cross-examined the complainant on the circumstances in which she had made her complaint, such as her disclosure to her boyfriend and family members. According to Mr Vergis, “the evidence was there to suggest a live issue”, but he did not think that the Defence had made arguments in its closing submissions to the same effect as that which the Judge found at [40]–[41] of the GD. The Defence had not sought to rely below on the complainant’s delay in disclosure because it had taken the view that there were much better grounds on which to make its case. Mr Vergis indicated that the Defence would likewise not be placing any reliance on the findings at [40]–[41] of the GD in this appeal. 93 In letters that were subsequently sent by the parties to this court, the Prosecution reiterated its position that the Defence “did not deal with the issue of delay in the cross-examination of [the complainant] in the manner which the trial Judge did at [40] and [41] of the [GD], whether in context or in substance”, and that there were “only two brief mentions” of the issue of delay in the closing submissions of the Defence below. The Defence simply stated in its letter that “[i]nsofar as the delay in reporting the alleged sexual assaults has been raised to draw the conclusions at [40] and [41] of the [GD], the [Defence] confirms that it made no submissions to that effect before [the Judge] in the course of making its closing submissions”, and that this was consistent with its earlier submission before this court that it would be placing “no reliance on the [Judge’s] line of reasoning at [[40]–[41] of the GD] to support the case for an acquittal”. Our analysis 94 In our judgment, the issue of whether the complainant’s delay in her disclosure of the alleged abuse to her boyfriend and family members and her reluctance to report the matter to the police negatively impacted her credibility was not a live point of contention at trial. As the Defence itself accepts (see [92]–[93] above), it had not sought to make any such argument in its closing submissions at the trial below; nor does it now seek to do so on appeal. In our view, the parties’ closing submissions provide an accurate and realistic indication of the issues that they considered to have been canvassed and remained in dispute at trial. The fact that neither party made any argument as to whether the complainant’s delayed disclosure and reluctance to make a police report had any bearing on her credibility furnishes strong grounds to think that the parties simply had not considered this to be an area of contention. It is also worth noting that the parties’ written closing submissions, which included reply submissions, were extremely substantial, with submissions for the Defence totalling over 150 pages. As Mr Vergis quite candidly explained at the hearing before us (see [92] above), the Defence had not raised this as an issue at trial because it had considered that there were better points on which to construct its case. Consistent with this, we reject Mr Vergis’ suggestion that “the evidence was there to suggest a live issue”. Mr Vergis did not point us to any part of the transcripts to support this suggestion; nor, from our review of the transcripts, was there any evidence to provide such support. Mr Vergis’ cross-examination of the complainant on these matters merely consisted of expository queries on the chronology of her disclosure to her boyfriend and family members and what she had communicated to them, rather than whether she had unreasonably delayed disclosing her experiences and, if so, the reasons why. 95 In the circumstances, we find that the Prosecution cannot reasonably be expected to have considered at trial that it would be necessary to adduce an expert report dealing with how rape victims tend to approach the disclosure of sexual abuse, in the particular context of there having been a considerable delay in making such disclosure. Consequently, section 7 of the expert report, which discusses various characteristics of victims’ disclosure of sexual abuse, including reasons for delays in the disclosure of child sexual abuse, satisfies the condition of non-availability. The same can also be said with respect to the following paragraphs in section 5 as they pertain to the same issue: 5.3.4.  Very few victims report immediately to law enforcement, but if they do report to law enforcement, it is oftenafter a delayof days, weeks, months, or even years(please see Section 7 on difficulties in disclosure and delay in reporting). … 5.5  Research with jurors indicate that many do not hold accurate knowledge of victim psychology and victim response to sexual assault, and some may hold stereotyped beliefs about victims' responses and endorse some degree of belief in rape myths (Ellison & Munro, 2008; Freyd, 2008; Frazier & Borgida, 1998; Mason & Lodrick, 2013). In a mock experiment of jury deliberation processes, \"jurors\" were influenced by their personal expectations about the instinct to fight back,the compulsion to reportimmediately, and the inability to control one's emotions (Ellison & Munro, 2008). They judgeda delay in reportingand a calm demeanour as problematic victim behaviours. Educating about victim response to sexual assault may enable jurors' common sense and reasoning to become more accurate and informed by empirical knowledge (Freyd, 2008)… [emphasis added; emphasis in original omitted] 96 Regarding the condition of relevance, we find that these parts of the expert report are germane to the issues in the appeal and could have an important influence on our findings with respect to the Judge’s decision as to whether the complainant was “unusually convincing”. There is also no dispute between the parties as to the reliability of these parts of the expert report. This is unsurprising given Ms Ng’s obviously extensive learning and clinical experience concerning trauma experienced by victims of sexual abuse, as reflected in the well-referenced and substantiated nature of her report. Finally, we also note Mr Vergis’ indication at the hearing before us that the Defence would not object to the admission of the parts of the expert report that concerned Ms Ng’s general opinion and learning (as opposed to her opinion specifically in respect of the complainant). 97 We do not find, however, that the other parts of the expert report can likewise be said to satisfy the requirement of non-availability. Ms Ng’s discussion of (a) the general symptoms of trauma experienced by victims of sexual abuse (section 4); (b) “rape myths” that are unrelated to the manner in which rape victims report the incident (section 5); (c) rape victims’ psychological responses during and after rape (section 6); (d) behavioural and neuroscience research on the effects of emotion on memory (section 8); and (e) reasons for possible inaccuracies and inconsistencies in victims’ accounts of sexual abuse (section 9), all concerned issues that the Defence had raised in the trial below. For instance, one of the Defence’s clearly expressed contentions was that the complainant’s description of the interior of the Prime Mover was inconsistent with that of Mr Sim. The Prosecution was plainly aware of the issue at trial and, to the extent that it desired to rely on behavioural and neuroscience research on the effects of stress and trauma on memory formation and recollection, it should have adduced expert evidence in this regard at trial. The same can be said about the arguments mounted by the Defence in relation to the inconsistencies in the disclosures made by the complainant to various persons and the complainant’s behaviour during the period of the alleged offences. We also observe that Mr Nair did not argue before us that any of the other parts of the expert report concerned issues that took the Prosecution by surprise, unlike that of the complainant’s delayed disclosure and reporting. 98 With respect to the two sections in which Ms Ng applied her expertise to the facts of this particular case, namely sections 10 and 12, we agree with Mr Vergis that these do not satisfy the condition of reliability. As Mr Vergis pointed out (and that Ms Ng herself highlighted in section 11 (see [90] above)), in preparing her views on the complainant, Ms Ng had not interviewed the complainant and was provided by the Prosecution with only a part of the evidence. She therefore had an incomplete picture of the complainant and, indeed, of the case as a whole. In these circumstances – and through no fault of Ms Ng – we think that her opinion specifically concerning the complainant is largely theoretical and therefore cannot be considered, to use the language ofLadd v Marshall, to be “apparently credible” in the circumstances. 99 We now turn to consider the potential implications on the proceedings were we to admit section 7 and paragraphs 5.3.4 and 5.5 of the expert report, which we have found to satisfy theLadd v Marshallconditions. As explained at [72]–[75] above, the inquiry at this stage is whether, if the further evidence were to be admitted, further proceedings would be necessitated and, if so, whether this outcome and its implications for the respondent would be disproportionate to the justification for admitting the new evidence. 100 Before us, Mr Nair contended that it was very difficult to determine the extent to which the Judge’s view of the complainant’s credibility had been affected by his findings on the complainant’s delay. He suggested that the Judge’s findings on the delay might in fact have “infected” his assessment of all the other factual claims made by the complainant. Since the present case falls to be resolved by reference to which of two conflicting accounts is to be preferred, the credibility of the complainant must have played a “pivotal role” in the Judge’s decision. Accordingly, Mr Nair submitted, it would be “artificial” for this court to simply sever [40]–[41] of the GD (see [87] above) from the Judge’s overall analysis, were it minded to do so. On this basis, Mr Nair leaned in favour of a retrial of the entire matter. 101 Mr Vergis strongly objected to a retrial on the ground that this would be a disproportionate outcome given that the Defence has indicated that it would not be placing any reliance the complainant’s delay in disclosure and reluctance to report the matter to the police. As mentioned, Mr Vergis also indicated that the Defence is only taking issue with section 10 of the expert report, and would not apply to cross-examine Ms Ng if section 10 is not admitted. 102 In our judgment, the Prosecution’s submission that the Judge’s findings on delay “infected” his assessment of all the other factual claims made by the complainant finds no basis in the reasoning of the Judge. A careful reading of the GD bears this out. The Judge clearly provided a number of reasons other than the complainant’s delayed disclosure and reluctance to report the matter to the police in reaching his conclusion that she lacked credibility. These reasons include but are not limited to: (a) the “contradictory and inconsistent” account of the respondent’s sexual advances that the complainant gave to her mother as compared to what she told her brother, sister and boyfriend: the GD at [41]; (b) the fact that the complainant’s descriptions of the cabin of the Prime Mover and of the respondent’s use of the Prime Mover were contradicted by Mr Sim’s evidence: the GD at [42]; and (c) the failure of the complainant’s sister to corroborate the complainant’s evidence with respect to the Fourth Charge: the GD at [43]. 103 The Judge did not rank these findings in any order of importance and appears to have simply identified them as cumulative reasons for concluding that the complainant could not be said to be “unusually convincing”. Accordingly, we find that there is no indication from the Judge’s reasoning that his findings on the delayed disclosure marred his view of the complainant’s credibility to such an extent that it compromised his assessment of all the factual allegations that the complainant made. We reject Mr Nair’s submission in this regard and, consequently, also his suggestion that a retrial would be necessitated if the further evidence were to be admitted. For this reason, and in the light of Mr Vergis’ confirmation that the Defence would not seek to cross-examine Ms Ng or any other witnesses if section 10 of the expert report is not brought into evidence, we find that no further proceedings will be necessary upon the admission of section 7 and paragraphs 5.3.4 and 5.5 of the expert report and therefore the consequences of allowing the admission of this evidence cannot be said to be disproportionate to the benefits of doing so. Instead, the parties will be at liberty to make submissions at the hearing of the substantive appeal with reliance on these parts of the expert report.",
        "Conclusion": "104 For these reasons, we dismiss the Prosecution’s application to admit the affidavits of Matin, Supt Chua and ASP Jaga, but we allow in part its application to admit the evidence of Ms Ng. Ms Ng’s affidavit as well as section 7 and paras 5.3.4 and 5.5 of the expert report are admitted as further evidence in this appeal. The parties are to attend before the Registry for the fixing of a hearing date for the substantive appeal to take place on this basis. Sundaresh Menon    Andrew Phang Boon Leong  Judith PrakashChief Justice     Judge of Appeal   Judge of Appeal Hri Kumar Nair SC, Charlene Tay Chia, Crystal Tan and Michael Quilindo (Attorney-General’s Chambers)for the Prosecution;Abraham S Vergis (Providence Law Asia LLC) and Sadhana Rai (Law Society’s Criminal Legal Aid Scheme) for the respondent."
    }
}