{
    "case_title": "Ma Wai Fong KathrynvTrillion Investment Pte Ltd and othersand another appeal[2019] SGCA 18",
    "ncitation": "[2019] SGCA 18",
    "coram": "Judith Prakash JA (delivering the grounds of decision of the court):",
    "sections": {
        "Introduction": "1 These grounds of decision relate to three connected appeals and three connected companies belonging, in the main, to three brothers. The appellant herein is the widow of one of the brothers and the executrix of his estate. After her husband’s death, the relationship between the appellant and her brothers-in-law broke down and she subsequently filed applications to have the three companies wound up on the “just and equitable ground”. After hearing the parties, we allowed one appeal and dismissed another. No decision was made in the third appeal as the parties accepted at the hearing that the company concerned should be wound up as it had never conducted any business and it served no purpose to keep it going. Accordingly, a consent order to that effect was made. 2 The two cases on which we reached a decision were Civil Appeal No 44 of 2018 (“CA 44”) and Civil Appeal No 45 of 2018 (“CA 45”). They involved Trillion Investment Pte Ltd (“Trillion”) (the subject of CA 44) and Double Ace Trading Company (Private) Limited (“Double Ace”) (the subject of CA 45). The original winding up applications were made by Madam Kathryn Ma Wai Fong (the “Appellant”) who also applied for the third company, Faxlink Trading Pte Ltd (“Faxlink”), to be wound up. The three applications were heard by the same Judge (“the Judge”) who, as mentioned earlier, eventually dismissed all of them. After hearing the appeals against these decisions, we dismissed the appeal in respect of Trillion but allowed that in respect of Double Ace and ordered that the latter company be wound up as we considered it would be just and equitable to do so.",
        "Background": "3 The Appellant’s late husband was Wong Kie Nie (“WKN”), a Malaysian businessman and one of the three sons of the late Datuk Wong Tuong Kwong (“Datuk Wong”). The other two sons are Wong Kie Yik (“WKY”) who was the second respondent in both CA 44 and CA 45, and Wong Kie Chie (“WKC”) who was the third respondent in CA 44. 4 WKN was a shareholder and director of Trillion, Double Ace and Faxlink (collectively “the Companies”). He ran all the Companies until March 2011 when he fell ill with cancer. WKN passed away on 11 March 2013.",
        "The business empire": "5 The Companies originally formed the Singapore section of the business empire of Datuk Wong who was a highly successful Malaysian businessman. His empire covered a wide array of businesses including timber logging and harvesting, land development, trading, manufacturing, oil palm plantations, oil milling, the hotel business and travel services. WTK Realty Sdn Bhd was the flagship company of the group which comprised over 50 companies operating in jurisdictions like Australia, Liberia, the British Virgin Islands, Papua New Guinea and Singapore. 6  Datuk Wong managed all his companies, including Trillion and Double Ace, from their respective inceptions till about 1990 when he suffered a stroke. WKN then took over Datuk Wong’s position and managed the business empire until he himself fell ill in 2011.",
        "Trillion and Double Ace": "7 Trillion was incorporated in Singapore in 1979 and was brought into Datuk Wong’s group by WKY in 1982. The purpose of the acquisition was to operate Trillion as an investment holding company which invested in real estate. Around 1984, Trillion purchased the office unit known as 3 Shenton Way, #20-08, Shenton House, Singapore (the “Trillion unit”). The purchase price was approximately $1.139 million. Ever since acquiring it, Trillion has been renting the Trillion unit to Double Ace for $5,000 a month. From the accounts, however, it appeared that Double Ace had not paid the rent and the same was reflected in Trillion’s accounts as a debt due. 8  As at 9 June 2017, Trillion had an issued share capital of $150,000 divided into 150,000 shares of $1 each. WKY, the Appellant (as executrix of WKN’s estate) and WKC are recorded as the registered shareholders, each holding 50,000 shares in Trillion. 9 Double Ace was incorporated on 15 May 1972 by Datuk Wong and his brother-in-law, Mr Lau Hieng King, who were the initial subscribers in equal shares. Double Ace was set up for the purpose of trading in spare parts to supply other companies in the group. Subsequently, Double Ace also acted as an agent for some of these other companies and generated healthy revenues for the services it rendered. 10 As for Double Ace’s shareholding, sometime after 24 April 1973 WKY became a shareholder and later WKN became a shareholder as well as a director. Presently, Double Ace has an issued share capital of $50,000 divided into 50,000 ordinary shares of $1 each. The Appellant (as executrix of WKN’s estate) holds 19,500 shares, WKY holds 19,998 shares, WKY’s son holds two shares while the remaining 10,500 shares belong to other members of Datuk Wong’s family. 11 In the late 1970s, Double Ace purchased the office unit known as 3 Shenton Way, #20-07, Shenton House, Singapore (the “Double Ace unit”) for approximately $71,000. Double Ace did not use these premises as its office but instead rented them out for approximately $2,500 per month. As mentioned, Double Ace is the tenant of the Trillion unit and uses the same as its office address. According to Ong Kim Siong (“Mr Ong”), a director of Double Ace, at about the time the proceedings commenced, its liability to Trillion for unpaid rental was in the vicinity of $890,169.44. As we understood the position, no rental had been paid by Double Ace thereafter and therefore the liability had increased. 12 Prior to the death of WKN, the Appellant was not a shareholder of Trillion or Double Ace and was never involved in the management of these two companies.",
        "The dispute below": "13  Since WKN’s passing, the Appellant and the rest of Datuk Wong’s family have been embroiled in litigation across multiple jurisdictions. According to WKY, as at 30 August 2017, a total of 69 legal proceedings had been filed by the parties in Malaysia, the British Virgin Islands and Singapore. 14 In August 2017, the Appellant filed the originating summonses HC/OS 163, 164 and 165 of 2017 to wind up Trillion, Double Ace and Faxlink respectively under s 254(1)(i) of the Companies Act (Cap 50, 2006 Rev Ed) (the “Act”). The Appellant gave three grounds for her contention that the Companies should be wound up under the section. 15 First, the Appellant alleged that the relationship of trust and confidence shared between WKN, WKY and WKC (“the Wong Brothers”) in the running of the Companies extended to the members of their respective families. This relationship of trust and confidence had irretrievably broken down after WKN’s passing as evidenced by the Appellant’s exclusion from participation in the management of the Companies despite her request to be made a director of the Companies. 16 Second, the Appellant alleged that there had been mismanagement on the part of the directors and/or employees of the Companies. The Appellant contended that the directors and/or employees of the Companies were “obscuring their financial misappropriations”. As such, the Appellant argued that a private liquidator should be appointed to investigate the Companies’ affairs. 17 Finally, she alleged that there had been a loss of substratum of the Companies. In particular, the Companies had abandoned the businesses which each was set up and/or acquired to do. 18 In reply, the Respondents (being WKY, WKC, WKY’s son and the respective companies) denied all the allegations made by the Appellant in the three winding up applications. First, the Respondents argued that the relationship of mutual trust and confidence in the running of the Companies had only been amongst the Wong Brothers. When WKN passed away, this relationship ended. Second, there was no mismanagement of the Companies such that a winding up on just and equitable grounds was warranted. Finally, there was no loss of substratum in respect of any of the Companies save for Faxlink. In any event, the Respondents submitted that the Articles of Association (the “Articles”) of Double Ace and Faxlink contained an exit mechanism which the Appellant should utilise before filing a winding up application. WKY and WKC also argued that the court should order that the Appellant’s shares in the Companies be bought out instead of ordering the winding up the Companies.",
        "The decision below": "19 The Judge dismissed the appellant’s application to wind up the Companies on the grounds given inMaWai Fong Kathryn v Trillion Investment Pte Ltd and other matters[2018] SGHC 88. The Judge’s decision is summarised below. 20 First, on the Appellant’s argument that there had been a breakdown of mutual trust and confidence between the Appellant and the other shareholders of the Companies, the Judge found that although the Companies were run on the basis of mutual trust and confidence amongst the Wong Brothers, this relationship did not extend to the Appellant as executrix of WKN’s estate. 21 Secondly, on the Appellant’s contention that there had been mismanagement of the Companies on the part of the Companies’ directors and/or employees, the Judge found that there was no ground to suspect any lack of probity on the part of the directors of the Companies. The facts raised by the Appellant were mere suspicions. 22 Finally, as for the Appellant’s contention that there had been a loss of substratum of the Companies, the Judge found that the Appellant did not have any standing to raise this argument. On the facts, the Judge found that it could not be said that the Appellant’s participation in the Companies was predicated on the assumption that the Companies would be conducting any specific business. As for Faxlink, although it was a dormant company, as the Judge had already found that the Appellant had no basis to insist on participating in the management of the Companies, the demise of Faxlink should be left to the managers of Faxlink. 23 Accordingly, the Judge held that there was no injustice or unfairness which warranted the winding up of the Companies under s 254(1)(i) of the Act.",
        "Issues that arose in these appeals": "24 Section 254(1)(i) of the Act provides: Circumstances in which company may be wound up by Court 254.– (1) The Court may order the winding up if – ... (i)  the Court is of the opinion that it is just and equitable that the company be wound up; … 25 We agreed with the Judge that unfairness forms the foundation of the Court’s jurisdiction under s 254(1)(i) and that a company may not be wound up “just because a minority shareholder feels aggrieved or wishes to exit at will” (seeSim Yong Kim v Evenstar Investments Pte Ltd[2006] 3 SLR(R) 827 (“Evenstar”) at [31]). 26 As the parties managed to reach a consent order in respect of CA 43, we did not need to consider the parties’ submissions raised at this appeal. Therefore, in these grounds of decision, we will only give the reasons for our decisions in CA 44 and CA 45. In these two appeals, the following issues arose for our determination: (a) whether the relationship of mutual trust and confidence between the Wong Brothers which formed the basis of the management of Trillion (in CA 44) and Double Ace (in CA 45) extended to the Appellant when WKN died; (b) whether the Appellant had proved that there was a lack of probity in the management of Trillion and Double Ace by its directors and/or employees such that it would be just and equitable for the court to wind up these companies under s 254(1)(i) of the Act; (c) whether the Appellant, as executrix of WKN’s estate, was entitled to assert a loss of substratum in relation to Trillion and Double Ace as a ground to wind up those companies under s 254(1)(i) and whether there was in fact a loss of substratum of Trillion and/or Double Ace; (d) if there were just and equitable grounds on which to wind up Trillion and Double Ace, the effect on the Appellant’s case of the exit mechanism present in Double Ace’s Articles; and (e) whether it would be appropriate for the court to make an order under s 254(2A) of the Act for the Appellant’s shares in Trillion and Double Ace to be bought out by the other shareholders of those companies. 27 We address each of these issues in turn.",
        "Issue 1: whether the relationship of mutual trust and confidence between the Wong Brothers extended to the Appellant upon WKN’s death": "",
        "The law": "76 InPerennialat [67], we held that where there is an exit mechanism within a company’s articles of association, any unfairness found to have satisfied s 254(1)(i) of the Act can be negated: Where there is an exit mechanism within the company’s articles [of association], and the other shareholders are willing to purchase the disaffected shareholder’s shares, that mechanism should be adopted (or else, unfairness is unlikely to be established), unless there are extenuating circumstances including situations where the articles in question are arbitrary, artificial and do not capture the legitimate expectations of the parties when it comes to share valuation. We certainly did not think it appropriate that shareholders be allowed to march into the court with a winding-up application because they held the view that it wasunfairfor them to be bound to apply a contractual mechanism that they had agreed to when drafting their company’s constitution. [emphasis in italics in original] 77 As for an equitable buyout under s 254(2A) of the Act, before the court can consider whether to grant this order, the test for ordering a winding up under s 254(1)(i) must first be established (TingShwu Pingat [33] to [46]). This test had been established in the case of Double Ace but not with respect to Trillion. 78 We considered, therefore, whether the Appellant ought to utilise the Double Ace exit mechanism to negate the unfairness of being locked into a company that had lost its substratum and if the exit mechanism was unable to negate the unfairness, whether we should order the remaining shareholders of Double Ace to buy over the Appellant’s shares in Double Ace under s 254(2A).",
        "Analysis": "79 Although the evidence was insufficient to support a finding of lack of probity on the part of the directors, we agreed that some aspects of Double Ace’s financial affairs were unclear as seen from the inconsistent explanations of Double Ace’s financial statements by WKY, Mr Ong and Mr Tiang (see above at [51] to [60]) and the other questions arising in relation to the accounts which were pointed out by the Appellant and which we recounted at [51] to [54] above. Accordingly, we considered that it was unlikely that a fair and proper valuation of Double Ace could be done without a thorough investigation into Double Ace’s financial records and activities. 80 A liquidator with the appropriate powers under the Act could achieve this and would be, indisputably, a neutral party. 81 Therefore, we found that it was indeed just and equitable to wind up Double Ace and that the exit mechanism provided by the Articles did not negate the unfairness that had been established.",
        "Issue 2: Whether there was a lack of probity in the management of Trillion and Double Ace": "",
        "Issue 3: whether Trillion and Double Ace had suffered a loss of substratum": "61 The Judge noted that where a company had lost its substratum, the unfairness “arises not from the loss of substratumper se, but from the majority using its legal powers to maintain the association in circumstances to which the minority can reasonably say it did not agree”. She cited Lord Hoffman’s decision inO’Neill v Phillips[1999] 1 WLR 1092 at 1101H. The Judge then went further and stated that a shareholder of a company may rely on the loss of substratum ground to wind up a company on just and equitable grounds “if he had joined the company on the understanding that it would continue pursuing certain goals”. For this proposition, the Judge citedWalterWoon on Company Law(Sweet & Maxwell, Rev 3rd Ed, 2012) at paragraph 17.59. 62 On the foregoing basis and in the light of the facts before her, the Judge found that the Appellant’s participation in the Companies by her acquisition of shares therein was not predicated on the assumption that the Companies would be conducting any specific business. This was because such acquisition of shares had taken place in the context of the Appellant’s position as the executrix of WKN’s will. In this capacity, her task was only to transfer WKN’s shares in the Companies to the trust company specified in WKN’s will. The Judge therefore found that the Appellant had no basis to expect the Companies to be run in a particular way and so could not raise a loss of substratum as a ground for winding up the Companies. 63 With respect, we could not accept that loss of substratum can only be relied upon by a non-founding shareholder if the shareholder has taken up shares on an assumption that the company will continue to run a particular business. The loss of substratum argument is much wider than that. A company’s substratum is the main object which it was formed to achieve and when it is no longer able to carry on that object,anymember may petition for a winding up order on the just and equitable ground (seeReGoodwealth Trading Pte Ltd[1990] 2 SLR(R) 691 at [25]). This is only fair because in situations where the main objective of the company can no longer be achieved through no fault on the part of the parties, the unfairness lies in holding the parties to the association despite the loss of substratum, and a winding up order under s 254(1)(i) is often justified (Hans Tjio, Pearlie Koh & Lee Pey Woon,Corporate Law(Academy Publishing, 2015) at paras 11.103 – 11.104 cited with approval inPerennial (Capitol) Pte Ltd and another v Capitol Investment Holdings Pte Ltd and other appeals[2018] 1 SLR 763 (“Perennial”) at [45]). 64 Another situation where the loss of substratum argument is available to an aggrieved shareholder is where the company is effectively dormant at the time of the application (contrary to what it was set up to do) and its finances are poor such that the company is no longer viable (NgSing King and others v PSA International Pte Ltd and others[2005] 2 SLR(R) 56 at [23] and [173]). In such a situation, it can be said that the company had stopped conducting the business it was set up to do and, given its poor financial state, there is no longer any reasonable prospect that the company will achieve its substratum. 65 In other words, the guiding principle to bear in mind when assessing whether to wind up a company on the basis that it has lost its substratum is to consider whether there is unfairness in keeping the aggrieved shareholder (whatever her reason for becoming a member of the company) locked into a company which is no longer carrying out and/or can no longer carry out the business it set out to do. 66 In that light, we examined whether either Trillion or Double Ace had lost its substratum as a matter of fact.",
        "Issues 4 and 5: alternatives to winding up": "74 The Respondents argued that in the event the court found that just and equitable grounds to wind up either Double Ace or Trillion had been established, the Appellant could have recourse to the exit mechanism provided by the respective Articles to exit the company. The availability of this mechanism would, they said, negate any unfairness found in the case. 75 The Respondents further argued that the court should order the Respondent to buyout the Appellant’s shares in Trillion and Double Ace under s 254(2A) of the Act instead of winding up these companies.",
        "Conclusion": "For the foregoing reasons, we dismissed the appeal in CA 44 but allowed the appeal in CA 45. We therefore ordered that Double Ace be wound up under s 254(1)(i) of the Act. We further ordered that the parties were to endeavour to agree on a private liquidator to be appointed to wind up Double Ace. In the event that the parties were unable to agree on the private liquidator to be appointed, the court would appoint the liquidator. Judith Prakash      Steven Chong       Quentin LohJudge of Appeal     Judge of Appeal       Judge Rethnam Chandra Mohan, Chia Xin Ran Alina and Stella Ng Yu Xin (Rajah & Tann Singapore LLP) for the appellant inCivil Appeals Nos 44 and 45 of 2018;                                               The first respondent in Civil Appeals Nos 44 and 45 2018not represented; andPalmer Michael Anthony, Reuben Tan Wei Jer and Amanda Chen (Quahe Woo & Palmer LLC) for the second and third respondents in Civil Appeals Nos 44 and 45 of 2018.   `"
    }
}