{
    "case_title": "BLV vPublic Prosecutor",
    "ncitation": "[2019] SGCA 06",
    "coram": "Aedit Abdullah J:",
    "sections": {
        "Introduction": "1 These are the findings made by this Court under s 392 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”) on the remittal of the case in Criminal Appeal No 10 of 2017, following the Accused’s application to admit further evidence in Criminal Motion No 5 of 2018.",
        "Facts": "",
        "Procedural history": "2 The Accused was convicted by me on 10 charges of various forms of sexual assault on his daughter (“the Victim”), and sentenced to 23 years and 6 months’ imprisonment, with 24 strokes of the cane:PP v BLV[2017] SGHC 154. Much of the case turned on the form and shape of the Accused’s penis, which went towards whether the Accused was in fact capable of committing some of the alleged acts of sexual assault, such as penile penetration, as well as the credibility of the Victim and that of the Accused’s wife, whose evidence was used to support that of the Victim. 3 At the appeal hearing in January 2018, the Accused by way of criminal motion sought to adduce fresh evidence from one Mohamad Bin Alwan, who could testify as to the shape and appearance of the Accused’s penis after seeing the same while at a public toilet. Directions were given for the filing of the criminal motion; as it was, when the criminal motion was filed, the Accused instead sought to adduce the evidence of another person, Muhammad Ridzwan Bin Idris (“the Witness”), who also saw the Accused’s penis in a public toilet. 4 The Court of Appeal directed that this Court was to receive additional evidence, consisting of: (a) the Accused’s evidence, to explain the circumstances in which he found two witnesses within two weeks who had seen his penis at the time of the offences; and (b) the evidence of the Witness. Specifically, the Accused’s evidence was to be received in order to establish whether the Accused was party to any abuse of process. 5 As to the other, putative, witness, Mohamad Alwan, the Prosecution was to consider whether it wished to interview him to determine whether there had been abuse of process and whether it wished to adduce his evidence. In the event, Mr Alwan was not called. 6 The Court of Appeal directed that this Court state its conclusions on the additional evidence and state under s 392(4) of the CPC what effect, if any, that additional evidence had on the verdict. The matter was then to be restored for the resumed hearing of the appeal.",
        "Summary of the further evidence": "7 The  Witness testified that he had seen the Accused’s penis in 2013 when it was the same shape as the Accused had alleged, contrary to the evidence of the Victim and her mother. The Witness happened to see the penis during the period when he and the Accused were working at a stall at the Singapore Expo that year, during the Muslim fasting month. The Accused testified corroborating that he and the Witness did so work together. Both the Witness and the Accused testified as to the circumstances when the two had met in 2018, how the Witness came to put himself forward, and the state of their relationship. 8 If true, the Witness’ testimony would go some way towards exonerating the Accused, because the shape and condition of the Accused’s penis as described by the Accused and the Witness would contradict the account of the Victim and her mother. This would have pointed to the Victim and her mother either being mistaken or having lied. On such a material point, this contradiction would have undermined the credibility of the Victim and her mother and undermined the version presented by the Victim.",
        "Defence’s submissions on the further evidence": "9 The Appellant argued that the evidence of the Witness should be accepted. A reasonable doubt was raised as to the condition of the Accused’s penis in 2013. Nothing was shown that the circumstances of the observation of the penis were not as described by the Witness; nothing was adduced that they were not running a stall at the Singapore Expo in 2013, or that they not smoked cigarettes together, or that they did not happen to go to the toilet together, or that the Witness had not seen the penis then. 10 That the Accused was able to find two persons who had seen his penis did not mean his evidence should not be accepted. In any event, the other witness did not testify. Nothing was shown that what the Accused said about this other witness was untrue. 11 The circumstance of the meeting between the Witness and Accused were not such as to be treated as false. Coincidences do happen. The high degree of similarity between the photograph of the Accused’s penis and the drawing made by the Witness could not be taken against the defence; the Accused had testified that he did not have a copy of the photograph and the Witness had testified that the first time he saw the photograph was at the proceedings. What was drawn by the Witness was just a simple drawing. 12 No reason existed for the Witness to risk himself by giving false evidence. Nothing showed any conspiracy or collusion between the Accused and the Witness to give false evidence in court.",
        "Prosecution’s submissions on the further evidence": "13  The Prosecution argued that the evidence received should not be accepted. Both the Witness and Accused had lied about the evidence, as shown by the falsehoods about their friendship, how they met in February 2018, and the circumstances of the occasion on which the Witness saw the Accused’s penis in 2013. It was shown that the Accused had in all likelihood colluded with the Witness in an attempt to get an acquittal. The additional evidence should not have any impact on the conviction. 14 The Prosecution submitted that the conduct of the Accused amounted to an abuse of process. In addition, the court was invited to indicate that if the matter of sentence were before it, it would have ordered an uplift in sentence.",
        "Decision on the further evidence": "15 I do not accept the Accused’s new evidence coming from the Witness. The circumstances of how he came to meet the Witness, including their prior relationship, his reaction and what followed, trigger concerns about the truth of what was recounted as well as the credibility of the Accused and the Witness. The evidence presented by the Accused and the Witness as to how the  Witness came to see his penis, as well as what the Witness saw, is also wanting in several respects. Taking everything together, I cannot accept the new evidence as truthful. That being so, the new evidence does not alter my original verdict. 16 In addition, these very factors that lead me to the rejection of the evidence lead me to the conclusion, beyond a reasonable doubt, that the Accused has committed abuse of process. I find that he and the Witness colluded to introduce false evidence into court. The evidence presented was false, and the circumstances are such that no reasonable explanation can be offered to establish that the Accused did not know that the evidence was false. Indeed, the evidence points incontrovertibly to the conclusion that the Accused knew that the evidence was false, and the inevitable inference is that he was at least a party to, if not the instigator of, an enterprise to introduce such false evidence. 17 I should note that for the purposes of the assessment in this case, I took take at face value the credit of the Accused. The fact that I had convicted him, rejecting his evidence, was put to one side in my determination.",
        "Circumstances of the encounter": "18 I do not accept the evidence of the Witness and the Accused about how they came to meet each other, and how the Witness came to learn of the Accused’s need for someone to testify about the condition of his penis. The following circumstances raise considerable doubt about veracity of the evidence: (a) the Accused’s failure to ask the Witness what he saw; (b) the fact that the Accused informed his lawyer late; and (c) the existence of discrepancies between the Accused’s and Witness’ accounts of their meeting with the Accused’s lawyer. 19 These were important matters, as they related to the pending appeal. Given the significance to the Accused of what the Witness saw, what would have been expected would be at least some discussion and confirmation of what was seen. The Accused would only be served if the Witness had seen the penis in the form that the Accused testified, or at least, in a rather deformed state. The Accused should have tried to confirm this. There was also apparently no discussion about how what the Witness saw would assist the Accused. A natural and immediate issue for the Witness would be how the penis was to play a role in the deliberations of the Court of Appeal. Otherwise, there would be no context for his evidence, or in lay terms, no understanding of how what he would say would in fact help the Accused. 20 It would also have been expected given that the appeal hearing was imminent that the Accused would have been anxious or at least driven enough to ensure that the information, particularly that there was support for the Accused’s version that his penis was indeed deformed at the time of the assault complained of by the Victim, was brought speedily to his lawyer. As it was, the Accused only informed his lawyer four days later. A weekend did apparently intervene, but in the circumstances a four-day gap still seems rather unexpectedly lackadaisical. One would have expected an appellant, faced with an imminent appeal and the prospect of losing a witness that was supposed to assist him, to have acted with greater alacrity and expedition. 21 As noted by the Prosecution, the Accused said he was relieved but the Witness testified that the Accused did not display any special emotion; he looked normal. That there was no discussion about these matters or promptness taken raises grave suspicion about the whole encounter. 22 There is also the question of the meeting with the lawyer. The versions given by the Accused and the Witness differ significantly. The Accused said the Witness went to see the lawyer alone; the Witness said that he had met the Accused, and that thereafter they went to the lawyer together. This discrepancy is wholly surprising on a matter of such importance. 23 On the other hand, I cannot accept that the other matters relied upon by the Prosecution point to the incredibility of the version given by the Accused and the Witness. The following matters are to my mind only minor discrepancies, and do not determine the credibility of either of them: (a) the duration of the conversation; (b) the circumstances of the meeting and the conversation; (c) what the Witness was doing at the place of the meeting, in or around Bussorah Street; and (d) whether drinks were consumed and where. Any discrepancy over such matters is not outside the realm of reasonable possibility. Any two persons meeting, even for an important matter, may be expected to have differences in recollection concerning peripheral matters. I cannot conclude that these matters invoked by the Prosecution warrant the rejection of the Accused’s evidence.",
        "The nature and extent of the friendship": "24 The Witness misled the Court about the nature and extent of the friendship that he had with the Accused. In his affidavit, the Witness stated as follows: I have known [the Accused] since 2012 when we played football together. We played between 2012 and 2013. We have [sic] also gone fishing together in 2013 once. In August 2013, we were selling malay [sic] snacks at the Singapore Expo. We were selling the snacks between 1st and 4th August 2013. That description does not paint a picture of particular closeness, but instead essentially portrays the relationship as being really one of acquaintanceship. As noted by the Prosecution, the Witness when questioned denied that he had ever gone to Malaysia with the Accused. 25 This as it turned out was untrue. The Prosecution adduced evidence that on three occasions in 2013, the Witness and the Accused had gone to Malaysia together. Again as noted by the Prosecution, the Witness was then able, after being confronted with the trips, to recall what they did and who else was with them. Such recollection put paid to any explanation that he may have innocently forgotten about these events; the number of occasions as well as the details provided by the Witness show that these trips did not fall out of his memory. Nor was any other plausible explanation given by the Witness why he could not have recalled these trips in the first place. 26 In addition, Immigration and Checkpoints Authority (“ICA”) records show that in 2011, the Accused and the Witness went to Malaysia within minutes of each other. The inference from this is that the two probably knew each other then, which contradicts the Witness’ evidence that he had only known the Accused from 2012. The Witness did not maintain that he only knew the Accused from 2012 when he was confronted with the 2011 ICA record, but only stated that he could not really remember if he had gone to Malaysia with the Accused then or if he did know the Accused in 2011. 27 The fact that these trips were not put to the Accused is not material. This issue goes to the credibility of the Witness, and it is sufficient for that purpose that the Witness was confronted with it. 28 It is thus clear that the Witness in his affidavit evidence was trying to downplay or minimise his connection with the Accused. While it is true, as argued by the Defence, that the two were not bosom friends on the evidence before me, in the circumstances of this hearing, the only reasonable inference is that the downplaying was to protect the parties from allegations of collusion by emphasising their slight acquaintanceship.",
        "The substance of the evidence": "29 The thrust of the evidence is that the Witness saw that the penis of the Accused was deformed, which would, if accepted, put into doubt the Victim’s account that the Accused assaulted her as she described. However, the evidence given by the Witness that he did see the Accused’s penis in that state is doubtful for the following reasons: (a) the Witness’ recollection of the occasion appeared to be contrived; (b) there would have been little opportunity to observe the Accused’s penis in the manner described; (c) the Witness would not have been expected to have seen the penis in the form that he drew; and (d) what the Witness drew is suspiciously similar to the photograph. The recollection was contrived 30 It is doubtful that the Witness could have specifically recollected what he did near the time when he happened to see the penis. No doubt the penis, if it was deformed then, would have stuck in his mind, but there was nothing else about the event that should have made the surrounding event stick in his mind in the way he described. 31 The  Witness was able to recollect that they were selling snacks at Expo on specific dates from 1 to 4 August, and could recall that he saw the Accused’s penis on 3 August. There was no vagueness in his recollection of the dates; he was definite that he saw the penis on 3 August. No reason was given how he could remember the dates in question. One would have expected some vagueness in recollection of dates from five years before, unless some reason existed that would fix the dates in the mind of the Witness. Observing the state of the Accused’s penis would not be the sort of thing that would be expected to cause this. In light of this, it must be concluded, as submitted by the Prosecution, that there is something contrived and manufactured about the whole event. The fact that in contrast the Accused did not recall the specific date is not material to this conclusion. The opportunity to observe 32 I also accept that it was highly unlikely that the Witness would have been able to see the Accused’s penis in the manner described. Given that they were at the urinals, even taking for the moment that the Witness was able to see the penis, the time for observation could not have been more than fleeting. It may be expected from a short glance for the Witness to have seen a deformed penis, but not in the precise and accurate way that the Witness recollected. That would have required close observation, which the Witness did not say that he was able to do. What was observed 33 The Witness drew the shape of what he observed. This appeared to be a top down view of the shape of the Accused’s penis. As the Witness would have observed the penis from the adjoining urinal, he would have seen the penis from an oblique angle, to the side. That would have a different shape from a top down view. There is thus considerable doubt about this aspect of the Witness’ evidence as well. What was drawn 34 What the Witness drew matched a photograph tendered in the main trial. While generally a match would support the case being put forward, here the match was very close, to the extent of being suspiciously close. Taken together with the fact that the Witness should not have observed a top-down view, it raises great doubt about the Witness’ veracity and whether his evidence should be relied upon. While there was no evidence about how the Witness came to be able to refer to the photograph in question, the similarity and the circumstances above raise the inevitable inference that he copied the photograph.",
        "Credibility of the Witness and the Accused": "35 The various discrepancies and shortcomings identified above put the credibility of both the Accused and the Witness into significant doubt. This is not just a situation where recollection may have been faulty, or where there is doubt about the inherent probability of what was being described. The various inconsistencies and shortcomings, taken together with the fact that the evidence was offered in suspicious circumstances and without any sufficient explanation, mean that the only reasonable conclusion was that the Accused and the Witness colluded to introduce false evidence.",
        "Abuse of process": "36 Following from the finding that the Witness’ evidence is contrived and false, I find also that the Accused was involved in, or at least knew of, the manufacturing of evidence. There was nothing raised that the Witness had manufactured the evidence without the Accused’s knowledge or that the Accused was just as misled as everyone else. The Accused thus stood or fell alongside the Witness. 37 The circumstances surrounding how the evidence came to light and was brought to court lead invariably to the inference that the Accused must have known of its falsity. The only reasonable explanation is that the Accused was involved in the arrangements for such evidence to be brought before the court. There is no room for his involvement to have been the result of any mistake or misapprehension. 38 The fact that the Accused came to know, just over a short period of a couple of weeks, of two witnesses who saw his penis in similar circumstances, just at or near the time of the hearing of his appeal and application for further evidence, raises serious concerns about the veracity of his evidence and that of the Witness, and indeed Mr Malwan, had he come forward. The Accused’s answer to this appears to be that coincidences do happen. That is true, but coincidences are unlikely. Where unlikely things happen against the context of suspicious circumstances, as here, with: (a) one the one hand, the coincidence of witnesses able to testify as to the form of the Accused’s penis being found so close to each other and the hearing; and (b) on the other hand, the inconsistencies and falsity of the evidence given; the only conclusion that can be drawn is that matters are contrived and not innocent happenstance. 39 For the avoidance of any doubt, I should mention that there is absolutely nothing before me that would be implicate learned counsel for the defence.",
        "Effect on verdict": "40 Given my rejection of the Witness’ evidence, I would not reach a different verdict. I would note that had the finding gone the other way, with the Witness confirming that the Accused’s penis was deformed as of 2013, the Victim’s evidence would have had to be rejected: If she had been assaulted in the way she described, she would have seen the penis in the shape as described by the Witness. The inconsistency would have raised a reasonable doubt in favour of the Accused.",
        "Enhanced sentence": "41 The Prosecution invited the Court, in the event that abuse of process was made out, to indicate that the sentence imposed should be enhanced to reflect such abuse; it was suggested that an uplift of one and half years should be indicated. The Defence argued that it would not be appropriate for this Court to do so. 42 I am of the view that it would not be appropriate for this Court to so indicate. The remission under the CPC was for a specific purpose; the matter is before the Court of Appeal and any submission on sentence or other consequences should be made by the Court of Appeal.",
        "Consequences for the Witness": "43 I have found that the Witness’ evidence was false. Any consequence of this would have to be pursued separately, if at all. Aedit AbdullahJudge Ramesh Chandr Tiwary (Ramesh Tiwary) for the appellant; Mohamed Faizal Bin Abdul Kadir, April Phang Suet Fern and James Chew Shi Jun (Attorney-General’s Chambers) for the respondent."
    }
}