{
    "case_title": "Lim Ah Leh vHeng Fock Lin",
    "ncitation": "[2019] SGCA 26",
    "coram": "Andrew Phang Boon Leong JA (delivering the oral judgment of the court):",
    "sections": {
        "Introduction": "1 This is an appeal against the decision of the High Court judge (“the Judge”) inLim AhLeh v Heng Fock Lin[2018] SGHC 156 (“the GD”). 2 The appellant is a citizen of New Zealand and carries on business there, while the respondent is a citizen of Singapore and carries on business here. From 1993 to 2007, the appellant paid various sums of money in different currencies to the respondent for the latter to manage and invest on his behalf. The total sum paid amounted to around S$3.5m at current exchange rates. 3 A portion of these sums was invested in a company which we shall refer to as “GK Holding”. Further, part of this arrangement involved an elaborate process through which the appellant sent substantial sums of his money to the respondent (from New Zealand to Singapore) in the form of cash or traveller’s cheques and then had those sums sent back to him by the respondent (from Singapore to New Zealand). 4 In 2014, the appellant commenced an action seeking an order that the respondent account for the money paid. The appellant claimed that: (i) the respondent was the trustee of the money paid; (ii) she owed him a number of fiduciary duties, including a duty to account for how she had managed and invested the money; and (iii) she was in breach of those fiduciary duties.",
        "The decision in the court below": "5 The Judge found that the respondent became a resulting trustee of the sums received from the appellant: the GD at [128]–[137]. The Judge also found that the respondent owed a number of fiduciary duties to the appellant. These included the duty to account for the money she received, the duty to act honestly and in good faith, the duty not to profit from the trust property and the duty not to place herself in a position where her personal interest actually conflicts or may conflict with her fiduciary duties: the GD at [159]. 6 However, the Judge held that the appellant’s action was barred by s 6(2) of the Limitation Act (Cap 163, 1996 Rev Ed) (“Limitation Act”). He also found that none of the exceptions in s 22(1) applied. The exception relevant to this appeal is s 22(1)(b), which provides: Limitation of actions in respect of trust property 22.—(1) No period of limitation prescribed by this Act shall apply to an action by a beneficiary under a trust, being an action— … (b) to recover from the trustee trust property or the proceeds thereof in the possession of the trustee, or previously received by the trustee and converted to his use. 7 The Judge noted that the effect of s 22(1)(b) is that no limitation period applies to a beneficiary’s action to recover from his trustee the trust property or its proceeds in two broad situations: (i) where the property or proceeds are still “in the possession of the trustee” (“the possession limb”) or (ii) where either was “previously received by the trustee and converted to his use” (“the conversion limb”): see the GD at [236]. (a) On the possession limb, the Judge first held that the appellant bore the burden of proving that the respondent was still in possession of trust property. The Judge found that the appellant had adduced no evidence to show that any of the trust money was in the respondent’s possession when he commenced this action. He held that it was not sufficient for the appellant to rely simply on the fact that the respondent had received substantial sums from the appellant in the past: see the GD at [242]–[243]. (b) On the conversion limb, the Judge rejected for want of evidence the appellant’s argument that the respondent had no means to make her own investments out of her own financial resources and therefore must have misappropriated the appellant’s money to do so. The Judge also rejected as irrelevant the argument, even if correct, that the respondent misappropriated the appellant’s share of dividends declared in respect of shares in GK Holding, because she had never held those shares on trust for the appellant: see the GD at [244]. 8 Thus, the appellant’s action for an account against the respondent was barred by s 6(2) of the Limitation Act and none of the exceptions in s 22(1) applied. On this ground alone, the Judge dismissed the appellant’s claim in its entirety. The Judge held that even if the appellant’s action were not statute-barred, he would have exercised his discretion not to grant an order for an account.",
        "The appeal": "",
        "Preliminary observations": "9 A great many issues were canvassed in the court below. However, the present appeal focuses only on exceedingly specific points (which we will deal with it a moment). 10 However, before we deal with the specific points raised in the present appeal, we note that, given the nature of the present appeal, it is unnecessary to deal with the other issues that were the subject of the GD but which do not form part of the present appeal. In particular, the Judge made some observations on the nature of fiduciary duties in general and (in a more specific vein) the scope of this Court’s decision inTan Yok Koon v Tan ChooSuan and another and other appeals[2017] 1 SLR 654 (“Tan Yok Koon”): see the GD, especially at [145]–[149]. We make no pronouncement on these observations, save to note that they may not be entirely consistent with what this court held at [194] ofTan Yok Koon. In any event, the Judge himself acknowledged that, even based on his preferred approach arising from the aforementioned observations, there would have been no difference to the result in the present case: see the GD at [149] and [210]–[211]. Indeed, as the Judge also noted, the parties themselves had made their submissionswithout the benefitofTan Yok Koonas it was handed down too close to the date on which the Judge had heard their submissions: see the GD at [151]. These observations were therefore mereobiter dictaat best and we will deal with them when they next arise directly for decision. 11 We also note that the interpretation of s 22(1)(a) of the Limitation Act is also no longer an issue on appeal and that we therefore make no pronouncement on the Judge’s observations with regard to this provision (in particular whether it requires fraud to be an element of the plaintiff’s cause of action: see the GD at [200]–[202]). 12 Returning to the present appeal, we note, first (and as the respondent also points out), the appellant has not appealed against the Judge’s alternative ground for finding against him,viz, that even if the appellant’s claim were not barred by the Limitation Act, the Judge would have exercised his discretion to refuse the account sought by the appellant. This is curious because even if the appellant were to succeed on all his arguments raised in this appeal, the appeal could still be dismissed on this alternative ground. However, as we shall elaborate upon in a moment, we do not, in any event, accept the appellant’s arguments. It is therefore also unnecessary to consider whether the Judge’s alternative ground constitutes part of the Singapore legal landscape (although the Judge derived some support from the High Court decision ofFooJee Boo and another v Foo Jhee Tuang and others[2016] SGC 260 at [81]). This Court will deal with this particular point when it next arises directly for decision. 13 We turn now to deal with the appellant’s arguments proper.",
        "The appellants’ arguments": "14 The appellant submits, first, that the Judge erred in finding that the appellant had failed to discharge his burden in respect of s 22(1)(b) of the Limitation Act. He highlights that the total amount of money received by the respondent was more than $3m, and after deducting the money used for acquiring various investments, there was a balance of about $1.2m which remained unaccounted for. There is “no reason why this should not satisfy the Appellant’s case in that these sums would still be in the possession of the Respondent. It is the only and inexorable conclusion that can be drawn from this accounting”. To require more evidence from the appellant would be to place a “wholly unreasonable and unjustifiable burden” on him. 15 Second, he submits that the Judge erred in not finding any obligation to account for the period from 2008 until the commencement of the proceedings, because there was a substantial amount of money that the respondent had received (before that period) and was in possession of (during that period), and the money “could or may” have been utilised for any purpose. We note, parenthetically, that this argument would fail unless the appellant succeeds on his arguments set out in the preceding paragraph. 16 The appellant’s third broad submission relates to shares in GK Holding, some of which were purchased with his money: he submits that the respondent had misappropriated his share of dividends declared by GK Holding. He further submits that the Judge erred in finding that those dividends did not form part of the money that the respondent held on trust for the appellant.",
        "The respondent’s arguments": "17 The respondent points out that the appellant’s calculations leave out the sums which the appellant had brought into Singapore and which were subsequently sent back to the appellant. The appellant thus has not proven that the respondent is still in possession of trust property. 18 In relation to the dividends, the respondent submits that the Judge was correct to hold that the respondent had set off the dividends due to the appellant against a debt which the appellant owed to her and her sisters-in-law and another debt which he owed to GK Holding. The respondent also adopts the Judge’s view that the appellant should have pursued his remedies in his capacity as a shareholder of the company.",
        "The issues": "19 There are essentially two issues in this appeal. 20 The first issue is whether the Judge erred in holding that the exception in s 22(1)(b) was not made out. To succeed on this point, the appellant must show that the respondent was in possession of trust money when the appellant commenced the action or that the respondent had converted trust money to her own use. If the appellant were to fail on this issue, his second ground of appeal (see [15] above) would fail as well. 21 The second issue is whether whether the Judge erred in finding that the allegedly misappropriated dividends (in respect of the shares in GK Holding) were not part of the money that the respondent held on a resulting trust for the appellant.",
        "Our decision": "",
        "Issue 1: Section 22(1)(b)": "22 To recapitulate, the appellant compared the amount of money the Judge found had been sent by him to the respondent with the amount of money which the respondent invested on his behalf, and surmised that the shortfall must still have been in the respondent’s possession at the commencement of the action. In our judgment, this approach cannot be accepted. 23 First, the appellant is effectively asking the respondent to account for the shortfall. But this is the precise remedy which he seeks in this action. It would be circular for the appellant to seek an account from the respondent by arguing that the respondent had failed to provide him with a complete account. 24 Second, the appellant did not take into account the money which was sent back to him by the respondent in his calculations. For reasons best known to the appellant, the transfers were effected in a way that was difficult to trace: see the GD at [37]. As a result, it is not possible to determine with any precision the total amount of money that was transferred back to the appellant. Thus, the appellant has failed to prove that the respondent was in possession of trust money at the commencement of the action, and the exception in s 22(1)(b) of the Limitation Act is not made out. 25 The appellant cites a number of cases in support his submission that to fall under the exception in s 22(1)(b), he only needs to prove that the respondent had received trust money, without further showing that the respondent had retained possession of or converted trust money to her own use. 26 The first is the decision of Steven Chong J (as he then was) in the Singapore High Court decision ofPanweldTrading Pte Ltd v Yong Kheng Leong[2012] 2 SLR 672 (“YongKheng Leong”). The appellant relies on the following passage ofYongKheng Leong(at [68]): 68 Indeed, Mr Foo relied onJJHarrisonto bring the claim against Mr Yong within s 22(1) of the Act. Mr Retnam accepts this position, and I find, rightly so. Although there was no express trust, Mr Yong was a fiduciary of Panweld, and as director, stood in a trustee-like positionvis-à-visPanweld’s assets (seeCradock([62]supra) andHalsbury’svol 9(2)([39]supra) at para 110.588 n 2),ie, he was a trustee of the monies before he wrongfully paid them to Mdm Lim. This brought his breach within Class 1 constructive trusteeship and thus disentitled him from raising the limitation defence… 27 He argues that inYongKheng Leong, it was sufficient to prove that the money was received by the defendants, without needing to also show that it was still in the possession of the defendants at the relevant time. 28 The plaintiff inYongKheng Leongwas a company who brought a claim for breach of fiduciary duty against one if its directors (“the first defendant”). The company claimed that the first defendant had paid his wife (“the second defendant”) salaries even though she was never an employee of the company. The company’s claim against the second defendant was based on dishonest assistance and knowing receipt. 29 Pertinently, the question of whether the defendants were in possession of trust property within the meaning of s 22(1)(b) wasnotin issue inYongKheng Leong. First, it was common ground that the claim against the first defendant was not time-barred. As for the second defendant, the issue before the court was whether someone who is liable for dishonest assistance and/or knowing receipt (what Chong J called a “Class 2 constructive trustee”) is a “trustee” within s 22(1) of the Limitation Act. Chong J answered the question in the negative,ie, s 22(1) did not apply to the claim against the second defendant. As a result, the interpretation of s 22(1)(b) was moot.YongKheng Leongdoes not assist the appellant at all. 30 We now turn toJJ Harrison (Properties) Ltd v Harrison[2002] 1 BCLC 162 (“Harrison”), a decision of the English Court of Appeal. The appellant submits that inHarrison, “there was not apparently any finding that the [defendant] there was still actually holding on to the money. It was enough that it was established that he had received the sale proceeds”. In that case, the defendant purchased land from the claimant property company without disclosing a side letter from the valuer stating that the land may have some development potential. The defendant subsequently sold the land at a profit before resigning from the company. The court noted that the action was not an action to recover trust property “in the possession of the trustee” (ie, the possession limb), because the land was no longer vested in the defendant, and there was no claim to trace the proceeds of the sale of the land”. The court then accepted that this was an action “to recover trust property or the proceeds of trust property previously received by the trustee and converted to his own use” (ie, the conversion limb). It thus held that the defence of limitation did not apply:Harrisonat [40]–[41]. However,Harrisoncan be distinguished because it was clear that the defendant had pocketed the sale proceeds of the land. Indeed, that was why he had hidden the side letter from the claimant company in the first place. But this is not the case here. The respondent had invested the appellant’s money and returned an unspecified amount to the appellant. The appellant has not shown that the respondent had retained possession of or converted trust money for her own use. Thus,Harrisondoes not assist the appellant as well. 31 The appellant also relies on the following extract from the UK Supreme Court decision ofBurndenHoldings (UK) Limited v Fielding and another[2018] AC 857 (“Burnden”) at [17]: 17 The starting point in the construction of section 21(1)(b) is to pay due regard to its purpose. This was laid down, in relation to its predecessor, inInre Timmis,Nixon v Smith[1902] 1 Ch 176 at 186 by Kekewich J as follows: \"The intention of the statute was to give a trustee the benefit of the lapse of time when, although he had done something legally or technically wrong, he had done nothing morally wrong or dishonest, but it was not intended to protect him where, if he pleaded the statute, he would come off with something he ought not to have, ie, money of the trust received by him and converted to his own use.\" That this is the purpose of what is now section 21 was confirmed by Chadwick LJ in theHarrisoncase at para 40. Mr Chivers did not, when it was put to him, challenge it in any way. 32 The appellant submits that “[i]f that is indeed the purpose, that it was not to protect a trustee where he would come off with something that he ought not to have, then we would say that this is exactly the applicable situation here”. With respect, this argument fails in its inception. It assumes that the respondent has converted trust money to her own use, which is precisely what the appellant has failed to prove. The appellant also relies onBurndento point out that the English equivalent of s 22(1)(b) of the Limitation Act would not apply where the trustee was neither in possession of trust property nor had he converted to his own use. The appellant submits that this is not the case here, because “there is a balance amount of trust property unaccounted for”. As we pointed out above, the appellant has not proven that the respondent had retained any balance trust money. Thus,Burndendoes not assist the appellant as well. 33 The appellant further citesInre Loftus decd[2007] 1 WLR 591 (“Loftus”), a decision of the English Court of Appeal. That case involved a claim against the administratix of an estate who had failed to provide any or adequate accounts, failed to complete the administration of the estate and failed to make distributions. The appellant relies on the following extract (at [32]): 32 In my view, there can be no doubt that the claims against [the defendant] to an account and payment are claims in respect of property, real and personal, which came into her hands as administratix of the deceased’s estate; that these claims fall within section 21(1)(b) of the 1980 Act .. 34 The appellant submits that the court had “applied the section on the basis of what had come into the hands of the administrator”. However,Loftuscan be distinguished because the administratix had transferred estate property to her son, and thus had clearly converted trust property to her own use: seeLoftusat [3]. In contrast, the appellant has not shown that the respondent was in possession of trust property when the action was commenced, or that the respondent had converted trust money to her own use. 35 Finally, the appellant cites the English High Court decision ofNelson v Rye and another[1996] WLR 1378 and relies on the following extract at 1391: … I reject Mr Oppenheim’s argument that section 21(1)(b) does not apply because the constructive trust contained no property in specie. The subsection requires that the action be one to recover from the trustee “trust property or the proceeds of turst property in the possession of the trustee”. Mr Rye received Mr Nelson’s income. That was trust property. The balance left after all the proper deductions is also trust property. This is an action to recover that property. 36 The appellant submits that this is exactly the case here, as the respondent had received trust property and there is a balance even after deductions are made for what has been invested. This argument similarly failsinliminebecause the appellant has not proven that the respondent had retained any balance trust money. 37 Accordingly, none of the cases assists the appellant. The Judge was correct, in our view, to find that this case did not fall within the exception in s 22(1)(b) of the Limitation Act.",
        "Issue 2: Misappropriated dividends": "38 In so far as the respondent’s alleged misappropriation of the appellant’s share of dividends is concerned, the appellant does not challenge the Judge’s finding that the respondent never held shares in GK Holding on trust for the appellant. In particular, those shares were purchased in two tranches: the Judge found that while the first tranche of shares were purchased with the appellant’s money, those shares were transferred immediately and directly into his name. As for the second tranche, the respondent and her sisters-in-law may have paid for the appellant’s shares first. Thus, the appellant could not prove that the respondent used trust money to make the second purchase: see the GD at [217]–[218]. In our judgment, since the respondent had never held the shares on trust for the appellant, she could not have held the dividends declared in respect of those shares on trust for the appellant as well.",
        "Conclusion": "39 For the foregoing reasons, we dismiss the appeal. 40 We will now hear the parties on costs. Andrew Phang Boon Leong            Belinda Ang Saw Ean           Quentin LohJudge of Appeal           Judge                        Judge Tan Sia Khoon Kelvin David and Sara Ng Qian Hui (Vicki Heng Law Corporation) for the appellant;Yeo Choon Hsien Leslie and Jolene Tan (Sterling Law Corporation) for the respondent."
    }
}