{
    "case_title": "BRS vBRQ and another and another appeal",
    "ncitation": "[2020] SGCA 108",
    "coram": "Woo Bih Li J (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 BRS (“the Seller”) was undertaking a project to build a hydroelectric power plant (“the Project”) through a special purpose vehicle company, BRR (“the SPV”). While the Project was underway, the SPV ran out of funds, and BRQ (“the Buyer”) entered the picture as an investor to inject fresh funds for the Project to continue. Under a Securities Purchase Agreement (“the SPA”), the Buyer contracted to buy all the shares in the SPV. In the SPA, it was envisaged that the Project would be completed or “wet commissioned” by 31 March 2013, and further that the Project cost would be about S$170m (“the Project Cost”). 2 The Project was not wet commissioned on 31 March 2013. For present purposes, the parties proceeded on the premise that the Project achieved wet commissioning more than two years later on 31 October 2015. As a result of delays in the Project, and as the actual costs of the Project exceeded the Project Cost, the Buyer and the SPV (collectively, “the Claimants”) initiated arbitration proceedings against the Seller, claiming payment for the additional costs above the Project Cost and damages that were incurred due to the delay in completion. The arbitral tribunal (“the Tribunal”) issued a final award that was in substance in favour of the Claimants (“the Award”). However, it limited the Seller’s liability with respect to certain time-dependent components to 30 June 2014 (the “Cut-off Date”). In the Tribunal’s view, the Project could have achieved wet commissioning on the Cut-off Date (rather than the eventual date of 31 October 2015) if the Claimants had undertaken the construction and commissioning of the Project in the most prudent and cost-effective manner after their takeover of the Project in early 2014. 3 Both the Seller and Claimants were dissatisfied with various aspects of the Award, and they each filed separate Originating Summonses to set aside portions of the Award, on the bases that the Tribunal had either acted in breach of natural justice and/or in excess of its jurisdiction. Both setting-aside applications were dismissed by the High Court judge (“the Judge”), giving rise to the present appeals.",
        "Background facts": "4 The facts are largely undisputed, and both parties accept that the background to the dispute have been distilled at [5]–[25] of the Judge’s grounds of decision inBRQ and another v BRS and another and another matter[2019] SGHC 260 (“the GD”).1Foot Note 1×Appellant’s Case for CA 34 para 5 and Respondent’s Case for CA 35 at para 15.In this judgment, we set out the salient facts in chronological order. We should clarify that the sums of money referred to in this judgment are converted to their approximate Singapore currency equivalent for anonymity. For consistency, we have utilised the same rate of conversion as that utilised by the Judge in the GD.",
        "The parties": "5 The Seller is a company engaged in the business of developing, constructing, operating and maintaining infrastructure and power projects. The Seller was awarded a government concession to build and operate a hydroelectric power plant (ie,the Project). To pursue the Project, the Seller, with other investors, set up the SPV. 6 The SPV carried on with the Project from 2007 to 2011. By the end of 2011, it had run out of funds. The Seller and its parent company, which collectively owned about 95% of the shares of the SPV at the time, were unable to inject more funds into the SPV to guide the Project to completion. Therefore, an external investor was sought, and the Buyer entered the picture as that external investor.",
        "The SPA": "7 Following the completion of the Buyer’s due diligence, on or around 19 September 2012, the parties entered into the SPA,2Foot Note 2×Joint Core Bundle Vol II, Part N p 159, para 10.under which the Buyer agreed to purchase all the shares in the SPV for about S$70m (“the Purchase Consideration”).3Foot Note 3×Joint Core Bundle Vol Vol II, Part B pp 30 to 31, cl 6.4.1; Joint Core Bundle Vol II, Part N p 70, para 13; Appellant’s Case for CA 34 at para 9 and Appellant’s Case for CA 35 at para 14.Under cl 9.1 of the SPA, it was acknowledged that the Purchase Consideration payable by the Buyer was based on a number of assumptions, key among which were: (a) cl 9.1.1: that the “Wet Commissioning Date”, defined as “the date on which [the Buyer’s] Engineer certifies that the Project is fully operational”,4Foot Note 4×Joint Core Bundle Vol Vol II, Part B p 21.shall occur no later than 31 March 2013 (“Wet Commissioning Date”); and (b) cl 9.1.4: that any “Cost Overrun”, defined as any and all Project costs in excess of [the Project Cost],5Foot Note 5×Joint Core Bundle Vol Vol II, Part B p 10.shall be borne by the Seller alone (and not by the SPV or the Buyer). 8 Recognising these assumptions, and in order to support the calculation of the Purchase Consideration, the Seller undertook certain obligations: (a) As regards the Wet Commissioning Date, (i) The Seller was obliged to furnish a “Security Bond I” for a certain amount. If the Wet Commissioning Date was after 7 April 2013, cl 9.3 entitled the Buyer to call on Security Bond I in full. (ii) If the wet commissioning was not achieved by 31 March 2013, cl 9.10(a) obliged the Seller, at the option of the Buyer, to “cede control of the construction and commissioning of the Project to the [buyer/SPV]”. In the circumstances that the Buyer exercised its right to take over control of the Project, it was obliged, under the same clause, “to undertake the construction and commissioning of the Project in themost prudent andcost effective manner” [emphasis added]. (b) As regards the Cost Overrun, (i) The Seller was obliged under cl 10.2.4 to “bear and contribute or indemnify and hold harmless (as the case may be), as and when required, any and all Cost Overrun”. (ii) To lend teeth to the obligation to indemnify any Cost Overrun, pursuant to cl 6.4.1(b)(iv), the Buyer agreed to pay about S$5.1m of the Purchase Consideration directly to the SPV, on behalf of the Seller. This payment would serve as new subordinated loans to the SPV from the Seller (ie,the Seller’s Subordinated Loans, hereinafter “the SSL”).6Foot Note 6×Joint Core Bundle Vol II Part B p 30.In the event of a Cost Overrun (ie,when the costs of the Project exceeded the Project Cost), cl 9.7 provided that the claimants “shall notify [the Seller] … to provide such amounts to the [SPV], as is necessary to meet the Cost Overrun” (“the Cost Overrun Notice”). If the Cost Overrun Notice was not satisfied within 14 business days, “the [SSL] from or repayable to [the Seller] shall forthwith stand reduced in the books of the [SPV] by such amount as is specified in the Cost Overrun Notice”.7Foot Note 7×Joint Core Bundle Vol II Part B p 41.",
        "The Bulk Power Transmission Agreement": "9 There was a separate contract, the Bulk Power Transmission Agreement (“BPTA”), which is also relevant to the parties’ dispute. The SPV had entered into the BPTA with a grid company in 2009 (before the entry of the Buyer). Under the BPTA, the SPV agreed to pay transmission charges to the grid company in exchange for access to its power grid for 25 years. Access to this grid was necessary for the SPV to transmit electricity generated by the Project to consumers and to thereby earn revenue from the Project. 10 This BPTA obliged the SPV to begin paying transmission charges to the grid companybeforethe Wet Commissioning Date. To minimise the Buyer’s outlay under the BPTA in the event that the Wet Commissioning Date was delayed, cl 11.4 of the SPA required the Seller (and another party whose identity is not material) to indemnify the SPV “against all payment obligations and Losses in relation to or arising under the [BPTA]on or beforethe Wet Commissioning Date” [emphasis added].8Foot Note 8×Joint Core Bundle Vol II Part B, p 52.",
        "Delays in the Project and Cost Overrun": "11 The Project failed to achieve wet commissioning on the contemplated date of 31 March 2013. A reason for the delay was the occurrence of multiple failures of a “penstock”, which is a pipe that transports water at high pressure to the turbines. 12 On 16 October 2013, the Buyer issued a Cost Overrun Notice to the Seller, informing the Seller that there was a Cost Overrun of about S$9.6m, and calling upon the Seller to pay the said amount to the SPV within 14 business days.9Foot Note 9×Joint Core Bundle Vol II, Part L pp 51 to 52.The Seller acknowledged the Cost Overrun Notice in its reply dated 1 November 2013, but did not challenge the correctness or validity of the notice.10Foot Note 10×Joint Core Bundle Vol II, Part L p 55.The Seller did not pay the amount demanded in the Cost Overrun Notice by the stipulated 14 business days deadline, nor did it do so thereafter. 13 From November 2013, as was its entitlement under cl 9.11 of the SPA, the Buyer began to oversee the Project more closely. However, the Buyer did not formally exercise its right to take control of the Project until March 2014, when, in accordance with cl 9.10(a) of the SPA (see [8(a)(ii)] above), the Buyer issued a takeover notice, and took over full control of the Project. This included the taking of steps to address the penstock failure as well as to rectify defects in other areas of the Project, such as the transmission line.",
        "The arbitration": "14 On 31 December 2014, while the Project was still under construction, the Buyer initiated arbitration proceedings against the Seller and its parent company (who is no longer a party to the present proceedings) pursuant to the arbitration agreement in cl 14 of the SPA.11Foot Note 11×Notice of Arbitration: Joint Core Bundle Vol Vol II, Part B, pp 100 to 118. Relief sought 15 In the arbitration, the Buyer sought a range of reliefs, the main ones being orders:12Foot Note 12×Amounts claimed revised from time of Notice of Arbitration, see Award at: Joint Core Bundle Vol II Part A, pp 116 to 117, para 27(c) and (g). (a) for the Seller to pay the SPV the Cost Overrun amount, or, in the alternative, to indemnify the Buyer for the Cost Overrun amount of about S$70.8m (“the Cost Overrun claim”); and (b) for the Seller to indemnify and hold the SPV harmless for any payment obligations and losses incurred by the latter in relation to the BPTA until the achievement of the wet commissioning on 31 October 2015, amounting to S$13.7m (“the BPTA claim”). 16 Apart from denying liability,13Foot Note 13×Joint Core Bundle Vol II Part A, pp 118 to 119, para 29.the Seller brought a counterclaim, seeking, among others, an order that the Buyer and the SPV pay about S$5.1m million, representing the portion of the SSL that was allegedly due to the Seller.14Foot Note 14×Joint Core Bundle Vol II Part A, pp 119 to 120, para 32. 17 For the purposes of the arbitration and the present applications, the parties have proceeded on the basis that the Project was wet commissioned on 31 October 2015, which was when the first discrete part of the Project was wet commissioned. Tribunal’s Award 18 The Award was issued on 24 January 2018 but received by the parties on 31 January 2018. The Tribunal of three arbitrators found largely in the Claimants’ favour in respect of the issues of liability. However, the Seller’s liability with respect to time-dependent components of the Cost Overrun and BPTA claims were limited to the Cut-off Date of 30 June 2014 (as opposed to the Wet Commissioning Date of 31 October 2015). The Cut-off Date was decided upon because, in the Tribunal’s view, the Project would have been completed on that date had the Claimants acted in a reasonable, most prudent and cost-effective manner after taking over the Project.15Foot Note 15×Joint Core Bundle Vol II Part A pp 151 to 152, para 255. 19 As a result, the Tribunal held as follows:16Foot Note 16×Joint Core Bundle Vol II Part A pp 237 to 238, para 392. (a) As regards the Cost Overrun claim, that the Seller was to pay about S$17.3m to the SPV (reduced from the total Cost Overrun allowed of about S$25.3m, after adjusting for the S$6.9m recovered by the Buyer by encashing on Security Bond I and S$1.1m paid by the Seller towards the Cost Overrun). (b) As regards the BPTA claim, that the Seller was to pay the SPV S$5.5m. (c) The counterclaim by the Seller for the recovery of the SSL was dismissed, as the loans stood adjusted towards the Cost Overrun, which was claimed by way of the Cost Overrun Notice of 16 October 2013, but which remained unpaid by the Seller (see [12] above).17Foot Note 17×Joint Core Bundle Vol II Part A pp 218 to 219, paras 356 to 359.",
        "The setting-aside applications": "20 The Claimants and Seller were dissatisfied with various aspects of the Tribunal’s Award. On 30 April 2018, the Claimants applied by way of Originating Summons No 512 of 2018 to set aside part of the Award. The Seller responded in kind on 22 June 2018, seeking to set aside other parts of the Award through Originating Summons No 770 of 2018. 21 The Claimants sought to set aside the finding in relation to the Cut-off Date, this being the key reason that the allowed sum was lower than what they had claimed for. In support, the Claimants alleged that there was a breach of the rules of natural justice under s 24(b) of the International Arbitration Act (Cap 143A, 2002 Rev Ed) (“IAA”) and Art 34(2)(a)(ii) of the UNCITRAL Model Law on International Commercial Arbitration (“Model Law”).18Foot Note 18×GD at [172] and [173].The Model Law is incorporated in the IAA as Schedule 1 thereof. 22 The Seller contended that the Tribunal’s findings that it was liable for the Cost Overrun and BPTA charges, as well as the rejection of its counterclaim for the SSL, ought to be set aside. In the event that the Seller succeeded on any of these points, it sought the consequential order that the Award on interest and costs be set aside to that extent. In this regard, the Seller relied on the breach of natural justice ground (s 24(b) of the IAA), and further asserted that the Tribunal had exceeded its jurisdiction, as the Award dealt with disputes not contemplated by or not falling within the terms of the submission to arbitration (Art 34(2)(a)(iii) of the Model Law) (“the excess of jurisdiction ground”).19Foot Note 19×GD at [68]–[71]. 23 In refuting the Seller’s setting-aside application, the Claimants raised the preliminary issue that the Seller’s application had been filed out-of-time, as the parties had received the award on 31 January 2018. This meant that the three-month time limit to commence such an application began on that date. By filing its application on 22 June 2018, the Seller had exceeded the three-month time limit stipulated under Art 34(3) of the Model Law. On the other hand, the Seller submitted that on 1 March 2018, it had requested the Tribunal to correct the Award in various respects under Art 33 of the Model Law. We will refer to this alleged correction request as “the Correction Request”. The Seller submitted that as the Tribunal had dismissed the Correction Request only on 23 March 2018, the three-month time limit to apply to court to set aside the Award only began to run from 23 March 2018. Hence its application to court filed on 22 June 2018 was filed within time.20Foot Note 20×GD at [37] and [55].",
        "The Judge’s decision": "24 The Judge dismissed both setting-aside applications, such that the Tribunal’s award remained fully intact.",
        "The preliminary issue": "25 As regards the preliminary issue of whether the Seller had exceeded the three-month time limit, the Judge held that the Correction Request postponed the time limit, such that it only began to run from 23 March 2018, when the Correction Request was dismissed by the Tribunal. Since the setting-aside application was filed on 22 June 2018, and within three months from the date when the Correction Request was dismissed, the Seller’s setting-aside application to the court was filed within time (GD at [50] and [54]–[55]).",
        "The Seller’s setting-aside application": "26 Turning to the setting-aside application proper, the Judge dismissed all seven grounds raised by the Seller for setting aside the Award. 27 First, he rejected the assertion that the Tribunal had acted in breach of natural justice by relying on correspondence between the Buyer and the Seller, without explicitly considering the Seller’s contention that such correspondence was inadmissible as they were covered by the without prejudice privilege (“the Admissibility issue”). In the Judge’s view, it was not “clear and virtually inescapable” that the Tribunal had failed to apply its mind to this issue, and it was inferred that the Tribunal had admitted the correspondence without seeing a need to articulate its reasons for rejecting the Seller’s objections regarding admissibility (GD at [84]–[86]). Furthermore, no prejudice was caused to the Seller as even if the correspondence was inadmissible, this would have had no bearing on the Tribunal’s finding that the Seller was liable for the Cost Overrun, as the Project had exceeded the Project Cost (GD at [91]–[92]). 28 Second, the Judge also determined that the Tribunal was not in breach of natural justice or in excess of its jurisdiction when it found that the Seller would be liable for the Cost Overrun even if the Seller was not in breach of the SPA (“the Breach issue”).21Foot Note 21×See Award: Joint Core Bundle Vol II Part A, pp 120 – 121, paras 215 to 217.In the Judge’s finding, the Claimants’ pleaded case was that the Seller would be liable for Cost Overrun once the Project Cost had been exceeded and this was independent of a breach on the Seller’s part (GD at [98]–[103]). For the same reason, the Tribunal did not exceed its jurisdiction, as it correctly apprehended the true basis of the Claimants’ case (GD at [111]). Even if the Seller only knew that this was the Claimants’ case on the last day of oral hearings, the Seller then had a reasonable opportunity to present its case in the intervening four months during which parties were entitled to file their closing submissions (GD at [107]–[108]). 29 Third, the Judge rejected the Seller’s assertion that the Tribunal was in breach of natural justice as it had failed to give parties the opportunity to address which components of the Cost Overrun were time-dependent (“the Time-dependency issue”). Even without the benefit of arguments specifically on whether each Cost Overrun component was or was not time-dependent, the full extent of the evidence on the Cost Overrun components was before the Tribunal. This would have been sufficient for the Tribunal to come to a conclusion on whether each component was time-dependent, and an error by the Tribunal in this regard was not a basis for setting aside the award (GD at [123]–[125]). 30 Fourth, the Judge did not consider that the Tribunal was in breach of natural justice by failing to consider the Seller’s “extensive submissions” on why it could not be liable for the transmission line costs (“the Transmission Line issue”). The Seller’s defence in relation to the Transmission Line issue was that it had no liability whatsoever as it was the Buyer who was throughout thede factocontroller of the works. This was implicitly rejected by the Tribunal, which found that the Cost Overrun included “any and all project cost in excess of” the Project Cost. This would include any costs incurred for the transmission line works, which could therefore be added to the Cost Overrun claim (GD at [130]–[132]). 31 Fifth, the Judge rejected the submission that the Tribunal was in breach of natural justice or had acted in excess of its jurisdiction in denying the Seller’s counterclaim for the SSL (“the SSL issue”). In his view, the Tribunal clearly and properly considered this issue, and found that the entire SSL stood adjusted towards the amount specified in the Cost Overrun Notice, and this extinguished the SSL entirely (GD at [143]–[146]). 32 Sixth, the Tribunal did not fail to consider (but in fact, explicitly considered) the Seller’s arguments that the BPTA Charges claim should be rejected entirely (“the BPTA Charges issue”). The Seller’s real complaint was that the Tribunal had arrived at a conclusion that was against what it had advocated (GD at [151] and [157]). 33 Finally, on the issue of whether the Tribunal had acted in breach of natural justice when it awarded the Claimants pre-award interest on the Cost Overrun claim from 4 July 2014 (“the Pre-award interest issue”), it was held that while neither party had argued for the interest to start from such an early date, the issue of the pre-award interest was in the discretion of the Tribunal, as provided under s 20(1) of the IAA (GD at [161]). In any event, the date of 4 July 2014 was not “plucked from the air”, as it was the date when the Claimants sent a legal notice of the Cost Overrun claim to the Seller (GD at [164]).",
        "The Claimants’ setting-aside application": "84 We turn to the third issue which involves a consideration of the Claimants’ setting-aside application. In substance, this was a challenge against the Tribunal’s finding that the Project should have been wet commissioned by the Cut-off Date of 30 June 2014 had the Claimants acted in the most prudent and cost-effective manner. In the Tribunal’s view, the most prudent and cost- effective measure was for the Claimants to simply repair the penstock by patching and re-welding its cracked areas (the “Rewelding Method”). Instead of doing so, the Claimants decided to completely reline the penstock with a different grade of steel (the “Relining Method”). Had the Rewelding Method been adopted, the Project should have been completed by 30 June 2014. Instead, because of the Claimants’ decision to adopt the Relining Method, works on the penstock extended up to the middle of 2015, and this consequently delayed the wet commissioning of the Project.38Foot Note 38×Joint Core Bundle Vol II Part A, pp 146 – 152 paras 254 – 256. 85 This finding limited the Seller’s liability for various time-dependent components to the Cut-off Date of 30 June 2014, rather than the later wet commissioning date of 31 October 2015. 86 In its setting-aside application, the Claimants levied two main arguments against the Tribunal’s finding on the Cut-off Date: (a) First, the Tribunal failed to consider unchallenged evidence that the Relining Method was the reasonable, prudent and cost-effective manner of achieving wet commissioning, and that the Rewelding Method, which had been utilised by the Seller, would not have allowed the Project to achieve wet commissioning.39Foot Note 39×Appellant’s Case for CA 35, paras 42, 48 – 51 and 52 – 53. (b) Second, the Tribunal failed to consider evidence that the transmission line (which is separate from the penstock) suffered from several design flaws. This led to delays in the transmission line works, which were not completed until 17 October 2015. Hence, the Project could not have been wet commissioned on 30 June 2014, as the completion of the transmission line was another necessary element for wet commissioning.40Foot Note 40×Appellant’s Case for CA 35, paras 66, 68 – 69. 87 In view of the Tribunal’s alleged failure to consider the above evidence, the Claimants submitted that there has been a breach of natural justice which has caused real and actual prejudice to them. Hence, the Tribunal’s finding that the Seller was not liable for the time-dependent components of the Cost Overrun and BPTA charges (and interest thereon) from 1 July 2014 to 31 October 2015 (ie,after the Cut-off Date of 30 June 2014) should be remitted to the Tribunal for its reconsideration.41Foot Note 41×Appellant’s Case for CA 35, paras 90 – 91. 88 The Seller rejected this contention. It highlighted that the Tribunal had considered a critical part of the Claimants’ Relining Method evidence, and that the evidence that was allegedly overlooked would in any event not support the assertion that the Relining Method wasnecessaryto achieve wet commissioning.42Foot Note 42×Respondent’s Case for CA 35, paras 32 and 34.As regards the transmission line evidence, the Seller accepted that the Tribunal didnotconsider the parties’ extensive arguments and evidence in relation to the transmission line works.43Foot Note 43×Respondent’s Case for CA 35, paras 44 to 45.However, this did not cause any prejudice to the Claimants given the finding that the Project would have been completed by the Cut-off Date if the Claimants acted in a reasonable, most prudent and cost-effective manner. In any case, the Claimants have not pointed to evidence which clearly established that the transmission line could not have been completed before 17 October 2015, such evidence being necessary to contradict the Cut-off Date.44Foot Note 44×Respondent’s Case for CA 35, paras 50 to 51.",
        "Issues on appeal": "39 By Civil Appeal No 34 of 2019 and Civil Appeal No 35 of 2019 (“CA 35”), the Seller and the Claimants respectively appealed against parts of the Judge’s decision. In so doing, both sides rehashed most of the same arguments with respect to thesameissues that were considered and decided by the Judge. As a result, the issues that arise in these appeals reflect those considered by the Judge, namely: (a) whether the Seller’s setting-aside application was filed within the three-month time limit; (b)ifthe Seller’s setting-aside application was filed within time, whether the Tribunal acted in breach of natural justice and/or in excess of jurisdiction in respect of any of the seven issues raised by the Seller, namely (a) the Admissibility issue; (b) the Breach issue; (c) the Time-dependency issue; (d) the Transmission Line issue; (e) the SSL issue; (f) the BPTA Charges issue; and (g) the Pre-award interest issue; and (c) whether the Tribunal acted in breach of natural justice by failing to consider certain evidence and arguments of the Claimants in fixing the Cut-off Date at 30 June 2014. 40 We consider each issue in turn.",
        "Whether the Seller’s setting-aside application was filed out of time": "",
        "The text of the Model Law": "41 The relevant provisions of the Model Law are Arts 33(1) to (4) and 34(3) are as follows: Article 33. Correction and interpretation of award; additional award (1) Within thirty days of receipt of the award, unless another period of time has been agreed upon by the parties: (a) a party, with notice to the other party, may request the arbitral tribunal tocorrect in the award any errors incomputation, any clerical or typographical errors or any errors of similar nature; (b) if so agreed by the parties, a party, with notice to the other party, may request the arbitral tribunal to give aninterpretation of a specific point or part of the award. If the arbitral tribunal considers the request to be justified, it shall make the correction or give the interpretation within thirty days of receipt of the request. The interpretation shall form part of the award. (2) The arbitral tribunal may correct any error of the type referred to in paragraph (1) (a) of this Article on its own initiative within thirty days of the date of the award. (3) Unless otherwise agreed by the parties, a party, with notice to the other party, may request, within thirty days of receipt of the award, the arbitral tribunal to make anadditional award as to claims presented in the arbitral proceedings but omitted from the award. If the arbitral tribunal considers the request to be justified, it shall make the additional award within sixty days. (4) The arbitral tribunal may extend, if necessary, the period of time within which it shall make a correction, interpretation or an additional award under paragraph (1) or (3) of this Article. … Article 34. Application for setting aside as exclusive recourse against arbitral award … (3) An application for setting asidemay not be made after three months haveelapsed from the date on which the party making that application had received the awardor,if a request had been made under Article 33,from the date on which thatrequest had been disposed of by the arbitral tribunal. … [emphasis added] 42 There are thereforethreetypes of Art 33 requests: (a) a request for “the arbitral tribunal to correct in the award any errors in computation, any clerical or typographical errors or any errors of similar nature” (Art 33(1)(a) of the Model Law) (“Art 33 correction request”); (b) a request for “the arbitral tribunal to give an interpretation of a specific point or part of the award” (Art 33(1)(b) of the Model Law) (“Art 33 interpretation request”); and (c) a request for “the arbitral tribunal to make an additional award as to claims presented in the arbitral proceedings but omitted from the award” (Art 33(3) of the Model Law) (“Art 33 additional award request”). 43 The crucial question is what the phrase in Art 34(3) “if a request had been made under Art 33” (“the Phrase”) means. The next question is whether the Correction Request in this case comes within the meaning of the Phrase.",
        "The parties’ submissions": "44 The Claimants submitted that while the Seller had made the Correction Request, this was not a request that wasin substancean Art 33 correction request.22Foot Note 22×Respondents’ Case for CA 34, paras 10 – 11 and 13.Instead, it was a disguised attempt to seek a review of the merits of the Award, since each of the Seller’s requests would have required the Tribunal to overturn its express findings of fact. Hence, the three-month time limit under Art 34(3) of the Model Law was not extended, and the Seller’s setting-aside application, having been filed on 22 June 2018 (more than three months after the Award was received on 31 January 2018), was time-barred. 45 In response, the Seller submitted that the court ought not to be concerned with whether a correction request was in substance an Art 33 correction request. It sufficed that the Correction Request was made for the Tribunal to “effect corrections in the Award as envisaged in Rule 29.1 of the [Singapore International Arbitration Centre Rules (5th Edition, 1 April 2013)]”, which is in substance similar to Art 33(1)(a) of the Model Law.23Foot Note 23×Appellant’s Skeletal Arguments for CA 34, para 4.In essence, the Seller’s submission was that it was sufficient if a request made under Art 33 was described as such a request seeking a relief specified thereunder. For example, if the request merely stated that it was made under Art 33 to correct a computational error with the consequential relief, that was sufficient. It would not matter if in substance, it was not seeking the correction of a computational error. 46 The parties referred mainly to Indian and New Zealand authorities which we address below.",
        "The Indian authorities": "47 The Claimants relied on the decision of the Supreme Court of India inState of Arunachal Pradesh vDamani Construction Co(2007) 10 SCC 742 (“Damani”). There, the appellant contended that the three-month time limit for filing its setting-aside application was extended as it had filed a request for review, allegedly under s 33 of the Arbitration and Conciliation Act 1996 (“the Indian 1996 Act”) which isinpari materiawith Art 33 of the Model Law. Section 34 of the Indian 1996 Act is also inparimateriawith Art 34 of the Model Law. The relevant portion of the appellant’s request inDamaniwere in these terms (Damaniat [7]): While submitting the request forreviewof the case, it is also requested that your honour may kindly consider (sic) the following points regarding mode of payments,if at all, the payment is to be made, as the award given by your honour is for the interim payment … [emphasis added] 48 The court rejected the contention that such a request was sufficient to trigger a time extension as the letter, being an application for review wasnotan application falling under s 33 of the Indian 1996 Act (Damaniat [8]): Firstly, the letter had been designed not strictly under Section 33 of the [Indian 1996 Act] because under Section 33 of the [Indian 1996 Act] a party can seek certain correction in computation of errors, or clerical or typographical errors or any other errors of a similar nature occurring in the award with notice to the other party or if agreed between the parties, a party may request the Arbitral Tribunal to give an interpretation of a specific point or part of the award.This application which was moved by the appellant does not come within any of the criteria falling under Section 33(1) of the[Indian 1996 Act]. It was designed as if the appellant was seeking review of the award. Since the Tribunal had no power of review on merit, therefore, the application moved by the appellant waswhollymisconceived. Secondly, it was prayed whether the payment was to be made directly to the respondent or through the court … Both these prayers in this case werenot within the scope of Section 33. Neither review was maintainable nor the prayer which had been made in the application had anything to do with Section 33 of the [Indian 1996 Act]. [emphasis added] 49 The Claimants also relied on the decision of the High Court of Delhi inShayamSunder v Kotak Securities Ltd(2017) Del 4157 (“ShayamSunder”)24Foot Note 24×Supplementary Bundle of Authorities Tab 11.which followedDamani. There, the court said at [4]: … It has been held by the Supreme Court in the judgment in the case of [Damani] that even if an application is titled as under Section 33 of the [Indian 1996 Act] but the same is beyond the scope of Section 33 of the [Indian 1996 Act], and is in fact a review application, then the period spent of pendency of the application under Section 33 of the [Indian 1996 Act] will not be excluded for determining the limitation period for filing of objections under Section 34 of the [Indian 1996 Act]. … 50 The Seller submitted thatDamaniwas of no assistance to the Claimants as the Supreme Court of India did not consider the interpretation of Arts 33 and 34(3) of the Model Law.ShayamSunderwas also of no assistance to the Claimants as the Delhi High Court had simply appliedDamaniwithout analysing the reasoning of the Indian Supreme Court.25Foot Note 25×See paras 24(a) and (b) of the Appellant’s Reply for CA 34. 51 On the other hand, the Seller relied on the subsequent unreported decision of the Indian Supreme Court inM/sVed Prakash Mithaland SonsvUnion of India(“VedPrakash Mithal”).26Foot Note 26×Further Supplementary Bundle of Authorities Tab 4.In that case, the respondent received the tribunal’s award on 7 November 2015. Subsequently, the respondent made an application to correct the tribunal’s award on 16 November 2015. This request was dismissed by the tribunal on 14 December 2015. On 11 March 2016, more than three months after the respondent received the award, but within three months of the date of disposal of the correction request, the respondent applied under s 34 of the Indian 1996 Act to set aside the award. The only issue before the Indian Supreme Court was whether the setting-aside application had been made within the three-month time limit under s 34(3) of the Indian 1996 Act. The district judge held that the respondent’s application was time-barred, as the application should have been made within three months from the date of receipt, given that there was no correction made to the award (VedPrakash Mithalat [4]). This was rejected by the Supreme Court of India, which reasoned that “a ‘disposal’ of the application [under s 34(3) of the Indian 1996 Act] can be either by allowing it or dismissing it” (VedPrakash Mithalat [8]). Hence, notwithstanding that the correction request was dismissed by the tribunal, it sufficed to extend time under s 34(3), such that the setting-aside application was not time-barred. According to the Seller, this meant that the period for filing an application for setting-aside “will run from the date of decision of an application made under Section 33 of the [Indian 1996 Act], whether the same is allowed or dismissed” [emphasis in original removed].27Foot Note 27×Appellant’s Reply for CA 34, para 24(c). 52 We agree thatDamaniis not of much assistance to the Claimants. There, the letter sent under s 33 of the Indian 1996 Act did not even seem to be a letter applying for correction of an award. Instead, it was seeking a review. Secondly, if and in so far as it could be said that the court did consider the letter to determine whether it was in substance an application to correct an award, there was no argument or discussion as to the meaning of the Phrase in the Indian 1996 Act. 53 InShayamSunder, the court had interpretedDamanito mean that if an application was titled as being under s 33 of the Indian 1996 Act but was in fact a review application, it would not extend the limitation period for filing a challenge to court under s 34. In other words, the court was suggesting that the substance of such an application could be considered to see if it in fact fell within the scope of s 33. However, we agree that this was a conclusion derived from the court’s view ofDamaniand there was also no argument or discussion on the meaning of the Phrase. Hence,ShayamSundertoo is not of much assistance to the Claimants. 54 On the other hand, we are also of the view thatVedPrakash Mithaldoes not assist the Seller at all. There, the issue was not the meaning of the Phrase but whether the reference to the date of disposal by the tribunal under s 34 only meant a disposal which was favourable to the applicant seeking a correction or would include either outcome. 55 We add that in another Indian case, Municipal Corporation v WalterBauAG(2019) SCC OnLine Bom 2920,28Foot Note 28×Further Supplementary Bundle of Authorities Tab 2A.the issue was whether the relevant date of disposal under s 34 of the Indian 1996 Act was the date of decision of the tribunal pursuant to a request under s 33 of the Indian 1996 Act or the date when that decision was received by the parties. The Bombay High Court proceeded on the assumption that it could consider whether, in substance, the application for correction was within the parameters of s 33 (at [16]–[18]). Again, there was no argument or discussion on the meaning of the Phrase.",
        "The New Zealand authorities": "56 We now address two New Zealand cases. InOpotiki Packing &Coolstorage Ltd v Opotiki Fruitgrowers Co-operative Ltd (In Receivership)[2003] 1 NZLR 205 (“Opotiki”), the New Zealand Court of Appeal employed the same approach of considering whether the request amounted,in substance, to a request under Art 33 of the First Schedule of the New Zealand Arbitration Act (Act No 99 of 1996) (“the NZ 1996 Act”) which is inparimateriawith Art 33 of the Model Law. Likewise, Art 34(3) of the NZ 1996 Act is inparimateriawith Art 34(3) of the Model Law save that the former has an exception for awards induced or affected by fraud or corruption. There, the plaintiff’s solicitors had sent a letter to the arbitrator on 6 March 1998, seeking, among others, what it stated to be “an interpretation of the award” that was made pursuant to the equivalent of Art 33(1)(b) of the Model Law. It was contended that this letter extended time under the equivalent provision of Art 34(3) of the Model Law. Rejecting this assertion, the court observed that the requests in the 6 March 1998 letter were neither correction, interpretation nor additional award requests within the terms of Art 33, and so could not operate to extend time under Art 34(3) (Opotikiat [25]–[28]): 25 Article 33(1)(a) provides for correction of errors in computation but [counsel for the plaintiff] accepted [that] his complaint of inconsistency on the drawdown rate could not be so characterised. 26 Article 33(1)(b) provides for requests for interpretations but only if agreed by the parties. There was no agreement in this case. 27 Article 33(3) deals with additional awards on claims omitted from the award. That can have no application to the drawdown issue. It was dealt with in the award of 10 December. The alleged omission of the other matters raised has already been dealt with. 28 Accordingly the requests made in the letter of 6 March [1998] are not such as are within art 33 and cannot operate to keep open the time limit in art 34(3). 57 However, again, there does not appear to be any argument or discussion inOpotikion the meaning of the Phrase. 58 The Seller placed much reliance onTodd Petroleum Mining Co Ltd v Shell (Petroleum Mining) Co Ltd[2015] 2 NZLR 180 (“Todd Petroleum”), which was also a decision of the New Zealand Court of Appeal. In that case, the applicant (“Todd”) filed a request for an additional award relating to transport charges under the equivalent of Art 33(3) of the Model Law (“the Transport Charges question”). While its additional award request was pending before the arbitrator, both parties filed applications to the New Zealand High Court, seeking to appeal a number of questions arising from the arbitrator’s award. However, since its additional award request was pending before the arbitrator, Todd did not refer the Transport Charges question to the court. Eventually, the arbitrator denied Todd’s request for an additional award. Todd then applied to refer the Transport Charges question to the court, but this was dismissed by the High Court judge, who held that Todd’s additional award request did not operate to extend time under Art 34(3). According to the judge, Todd could not reasonably treat it as “aproperapplication in the sense of being within the arbitrator’s jurisdiction to consider, and tenable on the evidence and outcomes to that point” (Todd Petroleumat [20]–[21] referring toShell (Petroleum Mining) Company Limited v Todd Petroleum Mining Company LimitedCIV-2009-485-2024 (8 June 2010) at [16] and [140]). 59 On appeal, the respondent (“Shell”) sought to uphold the judge’s decision while not endorsing the particular language of “proper” request employed by the High Court. Shell submitted that “[i]n order to defer time in which to appeal from running under art 34(3), … the request must objectively satisfy the requirements for the exercise of jurisdiction under art 33” (Todd Petroleumat [24]). In other words, Shell posited that only a request that isgrantedby the tribunal will operate to extend time under art 34(3) (seeTodd Petroleumat [37]–[39]). Todd challenged Shell’s approach, contending that time was automatically extended “whenever a party to an arbitral award makes a request for an additional award under art 33(3). There is no additional qualitative requirement for the request to meet any merit-based threshold” (Todd Petroleumat [28]). 60 The New Zealand Court of Appeal rejected Shell’s approach, holding thus (Todd Petroleumat [37]–[41]): 37 There is no support in the statutory language of either arts 33(3) or 34(3) for a qualitative gloss on the nature of the request for an additional award. We reject Shell’s submission to the contrary. Adding a qualitative requirement that a request under art 33(3) be a “proper” request would mean that a party would not know whether it has made a request in terms of that article until the arbitral tribunal either grants or rejects its application. Moreover, the notion of a requirement for a proper request is inconsistent with the language of art 34(3) which speaks only of a request being “disposed of”. It is not limited to cases where the request is “granted”. 38We agree with the submission by [counsel for Todd] that, if the drafters of art 34(3) had intended only to extend time for art 33 requests that were to be accepted by the arbitrator, it would have been easy to do so. 39 One consequence of an interpretation adding this qualitative requirement is that the requesting party may be obliged to file in the High Court an application for leave to appeal to preserve its appeal rights. This is because if its request has not been disposed of by the arbitral tribunal within the three-month time period allowed for seeking leave to appeal against an arbitral award, the party will lose its right to recourse from the High Court under art 34(4). Under Shell’s interpretation, that party cannot be sure time will stop running under art 34(3). The party will not know whether the tribunal will consider its “request” to be a proper request until it has been determined. 40 This would be inconsistent with the policy of maintaining the integrity of the arbitration process and placing limits on the role of domestic courts in private litigation. To require a requesting party to file both a request for an additional award and apply for leave to appeal to the High Court at the same time is not consistent with the policy of the Act. 41 The legislative history of the Model Law says little about the inter-relationship between arts 33 and 34(3). On the question of time limits, the Fourth Report of the Working Group noted that the time periods under art 33 ought to be taken into account when ultimately fixing the time for bringing a setting aside or omission claim under art 34(3). Including the reference to art 33 was a reasonable consequence of allowing applications. Its Fourth Report supports the proposition the Model Law intended all requests under art 33 should operate to stop time running for challenging an award under art 34(3) and pointed to those time-limits as a mechanism to prevent delay tactics. 61 The New Zealand Court of Appeal summarised its reasons for declining to include a qualitative gloss to Art 33 requests as follows (Todd Petroleumat [56]–[58]): (a) First, the NZ 1996 Act is intended to be publicly accessible and user friendly so that it is comprehensible to both lawyers and lay persons alike. That goal would be defeated by the inevitable complexity introduced by a qualitative requirement which is not apparent or necessary on the words of the articles concerned. (b) Second, the applicable time limits in Art 34(3) are firm in that there is no discretion to extend them. Preferring an interpretation which does not include a qualitative gloss on the statutory wording would serve the imperatives of certainty and finality in arbitration proceedings. (c) Third, the policy in favour of autonomy of the parties to choose the tribunal to determine their dispute is preserved by the interpretation which the court was upholding, as it limited the court’s review of arbitral awards.",
        "The Judge’s view onTodd Petroleum": "62 The Judge accepted the reasoning inToddPetroleum.He was of the view that any concern about the abuse of Art 33 of the Model Law, if there was no qualitative requirement, was overstated as there were certain time frames within Art 33 which constrain the temporal effect of any abuse. In his view, this approach was supported by the Report of the Working Group behind the Model Law (GD at [49]): 49 Finally, there is no evidence that the drafters of the Model Law intended that the second limb of Art 34(3) be triggered by a qualitative test. On the contrary, the discussion of Art 34(3) in the seventh session of the UNCITRAL Working Group on International Contract Practices (“Report of the Working Group on International Contract Practices on the Work of its Seventh Session”, UNCITRAL, 17th Sess, UN Doc A/CN.9/246 (“Report of the Working Group”) at para 138) shows that the drafters were alive to the risk of abuse without a qualitative test, but considered it a constrained risk and accepted that risk in the current drafting of Art 34(3): … As regards the words “or, if a request had been made under article 33, from the date on which that request had been disposed of by the arbitral tribunal”, there was considerable support for deleting those words since they might open the door for dilatory tactics by a party and because an unbreakable time-limit for applications for setting aside was desirable for the sake of certainty and expediency.The prevailing view, however, was to retain those words since they presented the reasonable consequence of article 33 which allowed a party to request a correction, interpretation or an additional award.It was also pointed out thatthe periods of time contained in article 33 enabled the arbitral tribunal to minimize the risk of dilatory tactics and provided a basis for calculating the possible extension of the time-limit prescribed in paragraph (3) of article 34. [emphasis added] 63 The Judge was also concerned that a qualitative test would introduce great uncertainty post-award. No one would know when an award is indeed final until the qualitative determination is made. That uncertainty would also lead to a potential waste of time and costs as a party making the request under Art 33 would file a concurrent setting-aside application in court under Art 34 out of an abundance of caution (GD at [47] and [48]).",
        "Our decision on the Phrase": "64 However, it seems to us that undue reliance was placed onToddPetroleumby the Seller and by the Judge. In that case, the qualitative requirement was that the request must be acceded to before the extension of time under Art 34(3) would kick in (see [59] above). That was not the argument before us. The Claimants were not suggesting that the request must be acceded to but that the court could and should consider the substance of the Correction Request to see if it fell within the scope of any of the three types of requests in Art 33 (set out at [42] above). In the present case, the only applicable request was the one for correcting an award. If the substance of the Correction Request fell within the scope of Art 33(1)(a), it would not matter if in fact the tribunal were to dismiss the request, as in fact it did. The extension of time would still apply. 65 However, in essence, what the Seller was suggesting was that theformof the Correction Request would suffice. Hence, so long as the Correction Request was said to be made under Art 33 and was seeking in terms a correction of the Award by the Tribunal, it would not matter even if insubstanceit was clearly not an Art 33 correction request. 66 To the extent thatTodd Petroleumdecided that a request under Art 33 of the NZ 1996 Act need not be granted before the extension of time under Art 34(3) applies, we agree. This was also the holding of the Supreme Court of India inVedPrakash Mithal.We are of the view that if the Correction Request was in substance an Art 33 correction request, the extension of time would apply even though the Correction Request was eventually dismissed. If, however,Todd Petroleumis to be construed as deciding that theformof such a request is sufficient to trigger an extension of time under Art 34(3), we would respectfully part company with it. 67 The “strongest” argument in favour of the Seller’s submission appeared to be the Report of the Working Group as cited by the Judge at [49] of the GD (set out at [62] above). However, it is not clear to us what the reference to “dilatory tactics” means. For example, it could refer to a request which was genuinely in substance seeking a correction, but the correction to be made was immaterial to the conclusion of the tribunal. In that sense, such a request, while coming within the scope of Art 33, could be perceived as a dilatory tactic as it would be immaterial to the tribunal’s conclusions. Alternatively, the reference to “dilatory tactics” could also refer to a situation where quite clearly the substance of the request fails to meet any of the criteria in Art 33. The report did not mention an abuse of the process. It only referred to “dilatory tactics”. Hence, in our view, the report does not clearly assist us in determining the appropriate meaning to be attributed to the Phrase. 68 We are mindful that if we were to agree with the Claimants’ contention, there would be less certainty as only requests that arein substanceArt 33 requests will qualify to extend time under Art 34(3) of the Model Law. There would also perhaps be more complexity if the party making the request under Art 33 also files a concurrent setting-aside application to court as a matter of caution in case its request is not considered in substance to be one coming within the scope of Art 33. We add, however, that it is not always the case that such a concurrent application to the court will have to be made with the making of the request to the tribunal. If the tribunal has decided on the request within the initial three-month time limit in Art 34(3),ie, applying the date when the award is first received by the parties, then the applicant may still file its setting-aside application to court within that time limit. In other words, the three-month time limit that begins from the receipt of the tribunal’s award would not have expired if the tribunal had disposed of the request within that time limit. Hence, a concurrent application under Art 34 need not always be filed with the request under Art 33. If, however, the tribunal has not decided on the request under Art 33 within the initial time limit in Art 34(3), then the setting-aside application under Art 34 should be filed as a matter of caution before the expiry of the initial time limit. 69 Notwithstanding the arguments for certainty and simplicity, we are of the view that it is important to bear in mind that Art 33 is an exception to the initial time limit in Art 34(3). It delineates three types of requests which would in fact extend that time limit. In the case of an Art 33 correction request, the provision does not merely refer to a request to correct an error in an award. It goes on to elaborate that the error is to be “in computation, any clerical or typographical errors or any errors of similar nature” (Art 33(1)(a) of the Model Law). 70 This is the equivalent of what is often referred to in court proceedings as the slip rule (see Sundaresh Menon et al,Arbitration in Singapore: A PracticalGuide, Sweet & Maxwell, 2nd Ed 2018, at paras 13.044–13.045). The Seller accepted in oral argument that that was likewise the purpose of Art 33 correction requests. It seems to us that it would be incongruous and an abuse of Arts 33 and 34 if a party could claim that its request for correction comes within the meaning of the Phrase so long as its terms state that it is made under the relevant provision in Art 33 and it seeks a correction of the award in question, even if in substance it is clearly nothing of the sort. That would defeat the purpose of specifying only three types of requests in Art 33 and render them otiose as effectively any request to the tribunal would suffice to extend time for making a setting-aside application to court so long as the request is drafted to follow the terms of the applicable provision(s) in Art 33. 71 Another illustration is useful. InOpotiki, the request was made to the tribunal for an interpretation of the award. However, the relevant provision in the NZ 1996 Act allowed such a request to be made only if it was agreed to by the parties, similar to the situation under Art 33(1)(b) of the Model Law. The request referred to the relevant provision in the NZ 1996 Act and stated the applicant’s request for various interpretations of the award without mentioning whether the parties had agreed on such a request. However, the court noted that in fact there was no agreement by the parties for such a request for interpretation to be made. If the Seller’s contention for the Phrase were upheld, it would suffice for a request to a tribunal to allude to the relevant provision for interpretation and say that the request had been agreed to when in fact that was not so. That cannot be right. 72 Accordingly, we are of the view that the Phrase means that the substance of a request under Art 33 must come within the scope of the relevant provision in order that the request has the effect of extending the initial time limit under Art 34(3). Consequently, the court may consider the substance of the request to see if it comes within the scope of the relevant provision.",
        "Whether the substance of the Correction Request came within the scope of Art 33(1)(a) of the Model Law": "73 In the present case, the Seller expressly stated in the Correction Request that it was “requesting the Tribunal to effect corrections in the Award”.29Foot Note 29×Joint Core Bundle Vol II(M) p 205, para 1.However, upon reviewing the application, it can be seen that the “corrections” sought by the Seller were in truth reviews of the Tribunal’s decision on substantive matters. First, the Seller submitted that the Tribunal had failed to consider that certain components under the Cost Overrun claim were in fact time based, such that the Seller ought not to have been liable for them after the Cut-off Date of 30 June 2014.30Foot Note 30×Joint Core Bundle Vol II(M), pp 205 to 206, “Cost Overrun Computation”.Secondly, the Seller also contended that the Tribunal had “erred in not adjusting the [SSL] amount against the Cost Overrun amount in spite of … repeated admissions [on the Claimants’ part] that the same is to be adjusted against the amounts claimed by them in the arbitration.”31Foot Note 31×Joint Core Bundle Vol II(M), pp 211 to 212, para 10. 74 Plainly, these requests fall outside the permissible corrections that can be made by a tribunal under Art 33(1)(a), and do not qualify as requests madeunderArt 33 of the Model Law. 75 In oral submissions, the Seller highlighted the third set of “corrections” in the Correction Request to substantiate its case that the request did come within the scope of Art 33(1)(a). This was that the Tribunal had erred in awarding interest to the Claimants from 4 July 2014. According to the Seller, the legal notice for the arbitration proceedings issued on 4 July 2014 was issued by the Buyer alone, and not by the SPV. The SPV only joined in by an arbitration notice on 31 December 2014. Given that the award of interest was in favour of the SPV, and not the Buyer,32Foot Note 32×See Joint Core Bundle Vol II, Part A, p 238 para 392(c).the interest ought to run from 31 December 2014 when the SPV became a party to the arbitration, rather than 4 July 2014.33Foot Note 33×Joint Core Bundle Vol II, Part M, pp 212 to 213, paras 12 to 15. 76 The Seller relied on the English court’s decision inGannet Shipping Ltd vEastrade Commodities Inc and another application[2002] 1 QB (Com Ct) 713 (“Gannet Shipping”)34Foot Note 34×Further Supplementary Bundle of Authorities Tab 2.where the court referred to authorities which drew a distinction between “errors affecting the tribunal’s thought (which can be corrected) and errors in the tribunal’s thought process (which cannot)” (at [24]).35Foot Note 35× 77 In that case, the ship-owners claimed demurrage in excess of US$300,000 against the charterers of its ship. The matter proceeded to arbitration and in the final award, the arbitrator set out a final account in which he awarded US$35,330.85 to the ship-owners. This included a sum of US$21,858.33 for loadport demurrage. That was, however, an error as the parties had agreed to a figure of US$860 for loadport demurrage. On publication of the final award, this error was pointed out by the charterers and accepted by the ship-owners. The parties then disputed whether the arbitrator would award not only the principal amount in the award but also the award of costs arising from the error and made written submissions to the arbitrator. The arbitrator corrected his final award, reducing the award in favour of the ship-owners to US$15,119.96. The arbitrator also reduced the costs awarded to the ship-owners in view of the reduction of the principal amount. The ship-owners then applied for a declaration by the court that the correction to the final award be declared to be of no effect in so far as it purported to reduce the award on costs. 78 The ship-owners’ application was rejected by the court, which held that the tribunal had jurisdiction to correct the costs award as it was “an error ‘arising from’ the ‘accidental slip’ in the amount of the award” (Gannet Shippingat [21]). We do not findGannet Shippingto be of much assistance to the Seller. In that case, the court was faced with the entirely different issue of whether the tribunal had the jurisdiction to make a consequential correction to the costs award after it had corrected and reduced the principal amount awarded to the owners under the slip rule. There was no dispute that the request for correction of the principal amount came within the relevant provision for correction. 79 The Buyer pointed out that a similar argument, namely, that the 4 July 2014 notice had been issued by the Buyer only and not the SPV, had been made before the Tribunal. Rejecting this argument, the Tribunal held at [70] of the Award that the Seller was in any case informed by notices, including the notice of 4 July 2014, of the SPV’s claims regarding the Cost Overrun and BPTA claims. The Buyer had also issued two Cost Overrun notices for the Seller’s payment of the Cost Overrun to the SPV. Such notices were issued with copies to the SPV and it could be inferred that they were issued by the Buyer on behalf of the SPV also.36Foot Note 36×Respondent’s Case for CA 34, para 82; Joint Core Bundle Vol II, Part A p 37, para 70. 80 In our view, this third set of “corrections” was an attempt to ask the Tribunal to review its decision on the point and vary it. It was not a request to correct under the slip rule. 81 Accordingly, we are satisfied that the Correction Request was not in substance an Art 33 correction request. The Seller has also not contended that the Correction Request was either an Art 33 interpretation request or an Art 33 additional award request. Hence, there was no request madeunderArt 33 that triggered the extension of the initial time limit under Art 34(3) of the Model Law in the present case. Since the Seller’s setting-aside application was filed more than three months after the Award had been received by the parties, and as the court does not have the power to otherwise extend the three-month time limit in Art 34(3) (ABC Co v XYZ Co Ltd[2003] 3 SLR(R) 546 at [9];BXS v BXT[2019] 4 SLR 390at [41]), the Seller’s application to set aside the award is time-barred. 82 We reiterate that the Tribunal had dismissed the Correction Request on 23 March 2018.37Foot Note 37×Joint Core Bundle Vol II, Part A, pp 252 to 253.This was before the expiry of the three-month period that started when the Seller received the Award on 31 January 2018, and it was thus open to the Seller to file its setting-aside application by 30 April 2018. For reasons that were not provided to us, the Seller did not do so, and it instead elected to file its setting-aside application on 22 June 2018. While this did not influence our decision on this issue, we mention it to show that the Seller could have avoided any argument about the lateness of its application but decided, unwisely as it turned out, to file its application after 30 April 2018. 83 This suffices to dispose of the Seller’s setting-aside application. Accordingly, the grounds raised by the Seller in support of its setting-aside application and the second issue are academic.",
        "Applicable principles": "89 A party seeking to set aside an arbitral award on the breach of natural justice ground must identify (Soh Beng Tee & Co Pte Ltd v Fairmount Development Pte Ltd[2007] 3 SLR(R) 86 (“Soh Beng Tee”) at [29]): (a) the relevant rule of natural justice that was breached; (b) how the rule was breached; (c) in what way the breach was connected to the making of the award; and (d) how the breach prejudiced its rights. 90 The relevant rule of natural justice which the Claimants alleged to have been breached is the fair hearing rule. This has several aspects, with the relevant one being that the tribunal has to consider all important issues. This is a necessary corollary of the principle that parties to an arbitration have a general right to be heard onevery issuethat may be relevant to the resolution of a dispute:Soh Beng Teeat [65]. As this court observed inAKN and another v ALC andothers and other appeals[2015] 3 SLR 488 (“AKN”) at [46]: “[t]o fail to consider an important issue that has been pleaded in an arbitration is a breach of natural justice because in such a case, the arbitrator would not have brought his mind to bear on an important aspect of the dispute before him. Consideration of the pleaded issues is an essential feature of the rule of natural justice…”. Where it is contended that the tribunal “wholly missed one or more important pleaded issues”, “the inference … if it is to be drawn at all, must be shown to beclear and virtually inescapable” [emphasis added] (AKNat [46]). 91 Nonetheless, even if a rule of natural justice has been breached and the breach was connected to the making of the award, it is necessary to prove that the breach caused “actual or real prejudice” to the party seeking to set aside an award (Soh Beng Teeat [86]). While this is “a lower hurdle than substantial prejudice, it certainly does not embrace technical or procedural irregularities that have caused no harm in the final analysis.” This means that “the breach of the rules of natural justice must, at the very least, have actuallyaltered the finaloutcome of the arbitral proceedingsin some meaningful way” [emphasis added] (Soh Beng Teeat [91]).",
        "The Relining Method evidence": "92 Returning to the setting-aside application, it is clear thatcertainevidence and arguments raised by the Claimants relating to the necessity of the Relining Method were not expressly mentioned in the Award. For example, while the Award mentioned an expert report by Mr B (“Mr B”) commenting on the necessity of the Relining Method (“the B Report”), the Award did not consider the substance of the report.45Foot Note 45×Joint Core Bundle Vol II Part D, pp 177 to 274.Briefly, the B Report considered that it was“inappropriateto consider any type of partial repair solution with an expectation of long term liner integrity” [emphasis added]. Hence, “the repair methodology adopted by the [C]laimants was theonlyoption which could be implemented in the shortest time”, and the relining work that was eventually conducted was “technically appropriate” [emphasis added].46Foot Note 46×Joint Core Bundle Vol II Part D, p 224, paras 4 to 6. 93 In our view, it is not a “clear and virtually inescapable” conclusion (AKNat [46]) that the Tribunal had missed such arguments. In the Award, the Tribunal had expressly acknowledged that it had in evidence the B Report, and that Mr B had been fully cross-examined on the report on 3 September 2016.47Foot Note 47×Joint Core Bundle Vol II Part A pp 247 to 248, paras 33 and 37; p 249 para 55.Nonetheless, the Tribunal focussed on other evidence which had been put forward by theClaimants. In this regard, it placed emphasis on a report dated 30 December 2013 by Mr C (“Mr C”), the Vice-President of theBuyer(“the C Report”). The C Report mentioned four repair options. The first was the Rewelding Method. This would require four months to execute. The Buyer itself initially proceeded with the Rewelding Method. Subsequently, Mr C suggested the Relining Method. The Buyer ultimately preferred the Relining Method “in order to guarantee the safety and integrity of the structure”.48Foot Note 48×Joint Core Bundle Vol II Part A, pp 149 to 151.In the Tribunal’s view, if the Claimants had acted in a reasonable, most prudent and cost-effective manner, it would have stuck to the Rewelding Method which would have been completed within three to four months from March 2014, which was when the Buyer formally took over control of the Project. Hence, the Seller ought not to be liable for any time-dependent component after 30 June 2014.49Foot Note 49×Joint Core Bundle Vol II Part A, pp 250 to 251, para 255. 94 In our view, it is crucial that the Tribunal had relied on theBuyer’sown evidence (in the C Report) to come to its conclusion on the most prudent and cost-effective manner for correcting the penstock issue. This resolved the issue of whether the Claimants had acted in a sufficiently prudent manner, with the result that there was no need for the Tribunal to go on to consider other evidence and arguments that were tendered by the Claimants. As Chan Seng Onn J observed at [76] ofTMM Division Maritime SA de CV v Pacific Richfield Marine Pte Ltd[2013] 4 SLR 972,“[a]s long as one argument resolves the issue, there is no justification for insisting that the arbitral tribunal go on to consider the other arguments which have been rendered academic.” This appliesa fortiorito the present situation, where the argument which resolved the issue had been put forward by the Claimants themselves. 95 Furthermore, even if such an omission to consider the Relining Method evidence constituted a breach of natural justice, no real prejudice resulted. As the Tribunal explained at [256] of the Award,50Foot Note 50×Joint Core Bundle Vol II Part A, p 152, para 256. [t]he issue under examination does not relate to the need for safety measures. The question under examination is whether [the Buyer], having entered into the SPA subject to a requirement that wet commissioning should be achieved by executing the project with reference to the existing design at a particular price, can add additional safety features which were not in contemplation when the SPA was entered and indemnity was granted, even if such additional features were subsequently found to be necessary.Even if relining was necessary, [the Seller’s] Cost Overrun indemnity will not cover the cost of relining or the interest and establishment expenditure incurred by [the SPV] during the extended period required for completion by reason of the relining of the penstock.To put it differently, [the Buyer], having decided to acquire the project through share purchase route with a condition that [the Seller] should ensure completion of the [P]roject according to the then existing parameters/specifications/designs, cannot subsequently say that for safety purposes it would have other features and [the Buyer] should pay for the time spent for installing the additional features or the cost of the additional features. [emphasis added] 96 Hence,even ifthe Tribunal had found, on the basis of the B Report and other evidence which it omitted to expressly mention, that the Relining Method was necessary, this would not have changed the outcome. This is because, in the Tribunal’s view (whether rightly or wrongly), such relining amounted to a departure from the “existing parameters/specifications/designs” that the parties had contracted upon, and on which basis the indemnities were granted by the Seller. Hence, even if the departure wasnecessary(as posited in the B Report), the Seller would not be liable for delays that flowed from such a departure.",
        "The Transmission Line evidence": "97 However, that is not the end of the matter. The Claimants also alleged that the Tribunal failed to consider its Transmission Line evidence, which would have shown that the Project could not have achieved wet commissioning by 30 June 2014 in any case. 98 As mentioned above, when it is contended that the tribunal “wholly missed one or more important pleaded issues”, “the inference … if it is to be drawn at all, must be shown to be clear and virtually inescapable” (AKNat [46]). In this regard, it isinsufficientto show that the tribunal was mistaken as to the law, or that it had misunderstood the aggrieved party’s case, with the consequence that it chose not to deal with a point because, flowing from this misunderstanding, it considered it to be unnecessary to deal with the point (AKNat [46]). It is only a “failure to even consider that argument” that amounts to a breach of natural justice (AKNat [47]). 99 An instance where such a “clear and inescapable” inference that the tribunal had failed to consider an important issue isFront Row Investment Holdings (Singapore) Pte Ltd v Daimler South East Asia Pte Ltd[2010] SGHC 80 (“Front Row”), where there was no real dispute that the arbitrator had wholly failed to consider the aggrieved party’s pleaded representations because of his mistaken belief that they had been abandoned. 100 Similarly, inAKN, an issue was whether the tribunal had failed to consider the appellants’ contention that the time for its performance of certain obligations to settle specific claims had yet to expire. This court found that the tribunal had mistakenly considered that the appellants had conceded this contention, with the result that it “plainly overlooked” the appellants’ case in this regard (AKNat [105]). Finding that this caused actual prejudice to the appellants, the court set aside the portion of the award relating to the issue. 101 In this case, the Claimants had pleaded in the Amended Statement of Claim that there were design flaws in the transmission line being built by the Seller that were identified in October and November 2013. One such design flaw was that the transmission line being built by the Seller had been built too close to another transmission line (“the KWA Line”), such that it would violate the domestic Electricity Rules.51Foot Note 51×Joint Core Bundle Vol II Part B pp 153 to 155, paras 60 to 62;It was further alleged that owing to delays in connecting the transmission line of the Project with the inter-state grid through the KWA Line, “the Project was unable to start commercial operations until … [t]he connection with the KWA Line was finally done on 17 October 2015.”52Foot Note 52×Joint Core Bundle Vol II Part H p 32 para 14.73 and to p 35 para 14.73.6; Appellant’s Case for CA 35, para 67.In other words, the Claimants had pleaded that one reason for the Project being unable to achieve wet commissioning was the transmission line defects, which wereindependentfrom the issues with the penstock. 102 The Seller did not dispute that the Tribunaldid notconsider the parties’ evidence and submissions in relation to the transmission line works. As stated in the Seller’s Respondent’s Case for CA 35, “the Tribunalonlytook into account the parties’ arguments, evidence and submission regarding the relining of thepenstockbut inexplicably madeno referenceto any of these evidence, arguments and/or submissions on thetransmission line works…” [emphasis in original].53Foot Note 53×See Respondent’s Case for CA 35, paras 44 and 45. 103 Despite this, the Tribunal eventually allowed the entirety of the claimants’ claim for the transmission line works for the period of 1 February 2014 to 31 October 2015 (ie,past the Cut-off Date) because it considered that there was the “absence of any valid and logical objection thereto” raised by the Seller (Award at [266]).54Foot Note 54×Joint Core Bundle Vol II Part A, p 157 para 264 and p 158 para 266.While this may be seen as an implicit consideration of the arguments and evidence in relation to the transmission line works, this finding must be seen in the appropriate context. When making such a finding, the Tribunal had already decided that the Seller was liable for Cost Overrun (which included costs incurred for transmission line works), and the only outstanding issue which it considered to be remaining relating to the transmission line works was the quantification of the costs of such works. Hence, at [264] of the Award, the Tribunal only considered the transmission line evidence in so far as was necessary to ascertain thequantumof such costs – in this relation, the Tribunal was satisfied that there was sufficient evidence to support the Claimants’ claim for “[about S$8.3m] for transmission line cost”, and it therefore awarded that sum to the Claimants. This was, however, separate and distinct from the Claimants’ argument that the Project could not achieve wet commissioning until 31 October 2015 because, among others, there were delays in the transmission line which were caused by previously undetected design flaws. It is this latter set of arguments which the parties agree wasnotconsidered by the Tribunal. 104 In fact, the Judge also agreed that the Tribunal failed to consider such arguments (at [184]–[186] of the GD): 184 The [C]laimants point to evidence showing that there were also defects in the transmission line … and that this would have delayed the [Wet Commissioning Date] far beyond 30 June 2014. In fact, the transmission line works were completed only on 17 October 2015. 185 Despite this evidence, the [T]ribunal made no reference to the time required to complete the transmission line works when it held that the Project ought to have been (sic) achieved wet commissioning by 30 June 2014 … 186 There is some truth to the [C]laimants’ submission. The transmission line is a component of the Project that must be complete and in place for wet commissioning. …The[T]ribunal, in finding that the Project would have been completed by 30 June 2014 if the [C]laimants had completed the Project in the most prudent and cost effective manner,did not address oranalyse the delay caused by the rectification works being carried out on the transmission line. [emphasis added] 105 Notwithstanding that finding, the Judge found that there was no breach of natural justice as “[a] possible explanation is that the [T]ribunal believed that in assessing the earliest time that the Project could be completed, if the claimant had employed the most prudent and cost effective method, any ongoing transmission line works (which were the obligation of the [parent company of the Seller]) were of no factual or legal relevance” (GD at [187]). 106 With respect, we find this to be speculative. As seen from the above, it is undisputed, as between the partiesandthe Judge, that the Tribunal simply failed to consider any arguments on this point, notwithstanding the pleadings by the claimants to this effect. In our view, this falls squarely within the factual scenario inFront RowandAKN, where the respective tribunals had similarly failed entirely to consider an important pleaded issue raised by the parties. As explained inAKNat [45], it is not necessary in this relation that the tribunal also committed a mistake in failing to consider the relevant issue – “[t]he fact of the arbitrator’s mistake was irrelevant except to evince clearly that he had not considered the other pleaded representations at all.” Here, as inFront Row, there isno disputethat the Tribunal failed to consider, whether explicitly or implicitly, the Claimants’ arguments relating to the transmission line defects being a separate cause of the delay in achieving wet commissioning. This suffices to amount to a breach of natural justice. 107 This breach of natural justice caused real and actual prejudice to the Claimants. The Tribunal limited the Claimants’ entitlement to indemnity for certain components as at 30 June 2014 because it considered that, if the Claimants had acted in a reasonable, most prudent and cost-effective manner, “the Project would have been completed within three to four months from 1 February 2014 … This means, that [the Seller] is liable to bear the cost overrun components which were dependent on the time factor … only till 30 June 2014”.55Foot Note 55×Joint Core Bundle Vol II Part A, pp 151 to 152, para 255.The Cut-off Date was contingent on the premise that the [C]laimants’ failure to complete the Project was causedsolelyby its failure to undertake the penstock repairs in the most prudent and cost effective manner.56Foot Note 56×See Joint Core Bundle Vol II Part A, pp 151 to 152, paras 254 to 256.But, had the Tribunal considered the Claimants’ arguments that the defects in the transmission line works were analternateandindependentsource of the delay of the wet commissioning of the Project, it might have arrived at a different Cut-off Date. This is because, even if the penstock had been completed on 30 June 2014, the Project would not have achieved wet commissioning as cl 1.1 of the SPA separately required the transmission line to be completed before the Project could be wet commissioned.57Foot Note 57×Joint Core Bundle Vol II Part B, pp 21 – 22 at cl 1.1: “Wet Commissioning Date” means the date on which the [Buyer’s] Engineer certifies that the Project is fully operational, including without limitation (a) no further construction of, or rectification to, any components of the Project is required for the Project to commence commercial operations … the penstock, …the loop-in-loop-out transmission lineor to any other allied civil works, … 108 The four requirements under the breach of natural justice ground, as set out inSoh Beng Teeat [29], are accordingly satisfied.",
        "The Award should be remitted to the Tribunal": "109 Yet the Seller contended that a remission of the Award is inappropriate, and that “the net result arising from the Tribunal’s (undisputed) failure to consider this key issue [of the transmission line costs] must be that the Tribunal’s consequential award on the Cost Overrun claim … should be set aside.”58Foot Note 58×Respondent’s Case for CA 35, para 52.This was notwithstanding the fact that it was the Buyer, not the Seller, who had challenged this aspect of the Award. 110 InSoh Beng Teeat [92], we observed that: … assuming that the breach is in respect of only asingle isolated or stand-alone issue or point, it would normally not be sensible or appropriate to set aside the entire award. Instead, the policy of minimal curial intervention implies that the court’s focus should be on the proportionality between the harm caused by the breach and how that can be remedied… In the present case, for instance, had there been a breach of the [respondent’s] right to be heard, theappropriate remedy would have been to remit the matter to the Arbitrator for him to receive further evidence on the Dispute Issue. This is because setting aside the whole Award would have forced the parties to re-arbitrate the entire case when the Disputed Issue was only one among several other severable issues that the Arbitrator had decided… [emphasis added] 111 Similarly, in this case, the transmission line issue, which pertains more broadly to whether the Cut-off Date of 30 June 2014 was appropriate, is but an isolated issue that is severable from the rest of the Award, which includes findings on the liability of the Seller for Cost Overrun and the BPTA Charges. If the Cut-off Date were to be revised, this would only affect the quantum of indemnity payable by the Seller to the Claimants, which could be effected without upending the entire Award. Accordingly, pursuant to Art 34(4) of the Model Law, we remit the issue of whether the transmission line delays would have affected the Cut-off Date of 30 June 2014 to the Tribunal for its consideration. For the avoidance of doubt, the Award remains intact in all other respects.",
        "Approbation and reprobation": "112 There is one final issue. The Seller also submitted that the Claimants are nonetheless precluded from challenging the Award as they have sought to enforce the Award in court proceedings in respect of the Cost Overrun claim, which comprises the time-dependent components which were cut-off at 30 June 2014.59Foot Note 59×Joint Core Bundle Vol II Part N p 83 at para 31(c).The doctrine of approbation and reprobation thus operates to prevent them from seeking to challenge the Award in their setting-aside application. 113 The Seller relied onEuropean Grain and Shipping Ltd v Johnston[1983] 2 WLR 241.60Foot Note 60×Supplementary Bundle of Authorities Vol 1 Tab 8.In that case, the English Court of Appeal was concerned with an arbitral award pertaining to a contract for the sale of wheat. The sellers had contracted to deliver 200 tonnes of wheat to the buyer, but only 100 tonnes of wheat was delivered. During the arbitration, the sellers sought payment for the delivery of the 100 tonnes of wheat that had been delivered, while the buyer argued that he had a cross-claim in respect of the other 100 tonnes which had not been delivered. In its award, the tribunal ordered the buyer to pay the sellers £2,775 with interest for the first 100 tonnes of wheat that had been delivered. The tribunal also allowed the cross-claim, and ordered the sellers to pay the buyer the sum of £2,859.64, this being the difference between the contractual purchase price and the actual price paid by the buyer to make up for the 100 tonnes of undelivered wheat. 114 The buyer accepted the entirety of the award, and paid the sellers the sum of £2,775 with interest. The sellers accepted the payment, but took exception with the second part of the award which held that they were liable for the cross-claim. They then applied to set aside the tribunal’s award on the basis that one of the arbitrators who had to go to Australia, had signed a blank form of award before he left and before all the submissions were made. He left it to the other arbitrators to fill in the award. The English Court of Appeal accepted that it was misconduct on the part of the arbitrator to sign the award form in blank without taking part in the decision-making process and for the other arbitrators to endorse his action. The whole award was thereby defective (at 245). Nonetheless, since the sellers had taken the benefit of the award (by accepting the buyer’s payment in full), they were not entitled to have it set aside. Doing so would amount to approbating the award by claiming the benefit thereunder, before reprobating it by saying that it was wrong and ought to be substituted with another award (at 245–246). Lord Denning MR said at 245: … It seems to me quite impossible for them to say, “Oh, well; we like that part of the award but we do not like the other part where we were ordered to pay damages. We do not like that and therefore we want it set aside.” That certainly cannot be done. The principle was stated long ago inDextersLtdvHill Crest Oil Co (Bradford) Ltd[1926] 1 KB 348 where Scrutton LJ said that a person could not reap the fruits of an award – because that infers that the award was right – and afterwards say that the award was wrong. He said, at p 358: That is the same thing as saying first: ‘I approbate this award and claim a benefit, £2,000, under it; pay me that £2,000’; and then when he has got it, saying: ‘I reprobate this award and say it is wrong and ask you to substitute another award …’ 115 At 247, Kerr LJ also said: … The sellers have taken the benefit of this award—they have taken the benefit of that part of it which they like—and they cannot possibly now come to the court and ask the court to set the award aside. 116 This is however not the situation before us. As we explained inBWG v BWF[2020] 1 SLR 1296 at [118], the doctrine of approbation and reprobation applies when “the parties who sought to advance inconsistent positions had already secured actual benefits from their prior positions”. The Claimants cannot be said to be approbating and reprobating because there is nothing inconsistent about enforcing the Award in its present form on the one hand and seeking to claimmoreby challenging another part of the Award on the other hand. In so doing, they are simply accepting the full benefits of the Award and looking to expand upon it. Indeed, if the Seller were correct, it would mean that a party who is awarded relief by a tribunal cannot commence action in a court to enforce that part of the award granting it relief if it is also seeking to claim more by challenging another part of the award, until its challenge is finally determined by the court or the tribunal. In our view, that cannot be right.",
        "Conclusion": "117 For the foregoing reasons, we dismiss Civil Appeal No 34 of 2019 as the Seller’s setting-aside application is time-barred. We allow Civil Appeal No 35 of 2019 in part and remit the issue of whether the transmission line delays would have postponed the Cut-off Date to the Tribunal for its decision. 118 Costs follow the event, and we award costs of the two appeals in favour of the Claimants fixed at $90,000 inclusive of disbursements. The usual consequential orders apply. 119 We vary the costs order below and grant the Claimants the costs of both applications fixed at $60,000 inclusive of disbursements. Judith Prakash     Steven Chong Woo Bih LiJudge of Appeal     Judge of Appeal Judge Nakul DewanSA(instructed), Lin Weiqi Wendy, Goh Wei Wei and Teh Zi Ling, Stephanie (WongPartnership LLP) (instructing) for the appellant in Civil Appeal No 34 of 2019 and the respondent in Civil Appeal No 35 of 2019; Dhillon Dinesh Singh, Toh Jia Yi and Chee Yi Wen, Serene (Allen & Gledhill LLP) for the respondents in Civil Appeal No 34 of 2019 and the appellants in Civil Appeal No 35 of 2019. ."
    }
}