{
    "case_title": "Lim Chong Poon vChiang Sing Jeong",
    "ncitation": "[2020] SGCA 27",
    "coram": "Andrew Phang Boon Leong JA (delivering the judgment of the courtex tempore):",
    "sections": {
        "Introduction": "1 This is an appeal brought by the plaintiff, Lim Chong Poon, against the High Court judge’s (“the Judge”) assessment of the damages resulting from the defendant’s breach of the trust deed dated 28 February 2007. Pursuant to this deed, 310,000 shares in Sentosa Tiger Island, which we refer to as “STI”, were held on trust by the defendant for the plaintiff. We refer to these shares as the “Trust Shares” in these grounds. 2 The trial for the assessment of damages was heard on 6 and 7 March 2019. The issue to be determined was the value of the Trust Shares as at 13 October 2009 (see the Judgment (“the GD”) at [5]). The valuation date was not in dispute. Each party tendered expert reports on the value of the Trust Shares and on the value of STI’s main asset, a property at No 11 Siloso Road, which we refer to as “the Property”. Having considered the submissions and evidence before her, the Judge was not persuaded that the valuations reached by both parties’ experts reflected the value of the Trust Shares. The Judge was unable to reach a quantum that satisfactorily reflected the value of the Trust Shares at the relevant date. As such, the Judge awarded the plaintiff $10,000 in nominal damages. 3 Having carefully considered the parties’ arguments, we see no reason to interfere with the Judge’s decision. Accordingly, we dismiss the appeal. What follows are brief grounds for our decision.",
        "Our decision": "4 Three main issues arose for our determination in this appeal. (a) whether the Judge erred in rejecting the evidence of Dr Lim, the plaintiff’s expert, on the value of the Property; (b) whether the Judge erred in rejecting the evidence of Mr Kon, the plaintiff’s other expert, on the value of the Trust Shares; and (c) whether, having rejected the valuations of the Trust Shares provided bybothparties’ experts, the Judge ought to have gone on to either adjust those figures, or otherwise come to a substantive finding as to the value of the Trust Shares on the evidence. 5 Before we address each of these issues in turn, we outline the well-established legal principles on assessing expert evidence. Specifically, it is within the court’s powers to choose between conflicting expert testimony and determine which,if any, to adopt having regard to what best accords with logic and common sense (see the Singapore High Court decision ofLee Hsien Loongv Review Publishing Co Ltd and another and another suit[2007] 2 SLR(R) 453 at [105]). In considering conflicting expert evidence, it is the consistency and logic of the preferred evidence that is paramount (see the Singapore High Court decision ofSakthivel Punithavathi v Public Prosecutor[2007] 2 SLR(R) 983at [75]).",
        "Value of STI’s interest in the Property": "6 The Property had originally been leased to Sentosa Adventure Golf Pte Ltd (“SAG”) by Sentosa Development Corporation (“SDC”) under a Building Agreement dated 11 December 1991. Pursuant to a Deed of Novation and Supplemental Agreement, STI was conferred all of SAG’s rights and obligations in relation to the Property from 26 February 2007 to 14 November 2026 on similar terms, with some minor differences (see the GD at [15] and [16]). The value of STI’s interest in the Property is a source of dispute between the parties, and is relevant to the asset-based approach of valuing the Trust Shares. 7 Both Dr Lim and the defendant’s expert, Ms Chua, considered the value of (1) the land, or more specifically, STI’s leasehold interest in the land (“leasehold tenure”) and (2) the buildings and improvements thereon in assessing the value of the Property. 8 Dr Lim assessed the value of the leasehold tenure using the income capitalisation approach, using a capitalisation rate of 4.5%. The Annual Value of the Property as at the valuation date was said to be S$688,000, notwithstanding the fact that IRAS had stated in a letter dated 16 January 2018 that the Annual Value of the Property was S$482,000 from 1 March 2007. Applying the capitalisation rate, the market land value of the freehold estate was S$15,288,289. Given that the remaining leasehold interest was for 17 years’ tenure, the market value of the leasehold tenure for the remaining 17 years was estimated at S$6,635,378. The value of the buildings and improvements to the land were assessed using the replacement cost method of valuation. Using the construction cost rate published by the Building & Construction Authority for the 4th quarter of 2009, and accounting for depreciation, the depreciated replacement cost of the building structure and other improvements at the valuation date was said to be S$6,287,806.32. Adding that figure to the value of the leasehold tenure, the fair open market value of the leasehold estate over the Property was S$12,923,184.00. As a cross-check, Dr Lim applied a discounted rate to the annual payments provided for under the Supplemental Agreement and valued the Property at S$10,287,806.00. 9 The Judge rejected Dr Lim’s evidence and preferred the opinion of Ms Chua, the defendant’s expert. Ms Chua’s position was that the market value of STI’s leasehold tenure was of no value, essentially because no upfront premium was paid and the land use rights to the land was subject to the payment of hefty annual “ground rentals”. The only upfront payments were either expressly said to be for services provided by SDC or were too meagre to be a land premium. The Judge accepted her assessment that there was no “profit rent” enjoyed by STI, particularly since the Supplemental Agreement included a clause which linked the annual sum payable to the lessee’s profit. The annual payment to be made was also a large one of at least S$250,000 (see the GD at [19] and [22]). Similarly, she accepted Ms Chua’s evidence that STI’s interest in the value of the buildings and improvements to the land was of no value. This was on the basis that a new lessee was under no obligation to salvage the value of the existing property and a prudent valuer would therefore not build the value of existing improvements in (see the GD at [24] and [25]). 10 We agree with the Judge that STI’s interest in the Property was of no value. 11 First, we note that STI was ordered to deliver possession of the Property to SDC as a result of the breaches of the Building Agreement inSentosa Development Corp v Sentosa Tiger Island Pte Ltd[2011] SGHC 168. This decision was affirmed by the Court of Appeal on 29 November 2011. Kan Ting Chiu J found,inter alia, that STI had breached cl 15(ii) of the Building Agreement when it failed to seek SDC’s consent for the issuance of shares to Almega Investments Pte Ltd (“Almega”) and Tan Tee Seng (“Tan”), as well as for the appointment of Soh Kee Hoon (“Soh”) as a director of STI. As such, Kan J held that SDC was entitled under cl 17 to recover possession of the Property (at [17]). As set out inAlmega Investments Pte Ltdand another v Chiang Sing Jeong[2017] SGHC 196 at [5], the shares were allotted to Tan and Almega on 8 March 2007 and 25 September 2007. Soh was appointed to the board of directors on 27 February 2008. These occurred before the valuation date on 13 October 2009. Since the Building Agreement had been breachedbeforethe valuation date, STI’s interest in the Property was subject to SDC’s entitlement to recover possession of the Property. This strongly supports the Judge’s finding that STI’s interest in the Property was of no value. 12 Separately, we note that the valuation reports produced by Robert Khan & Company Pte Ltd dated 12 August 2003 and 15 November 2006 (collectively, the Khan reports)bothascribed nil value to the leasehold tenure on the basis that STI did not have “real legal ownership” and the lease was subject to a guaranteed annual payment. This would seem to lend credence to Ms Chua’s valuation, which was made on a similar basis. 13 We note that the Khan reports seemed to value the improvements to the land at S$5,156,535 and S$9m, respectively. However, in our view, the Judge was correct to find that a new lessee is under no obligation to salvage the value of the existing property. Even the 15 November 2006 Khan report was careful to make clear that the value of the property was being determined in respect of itsexisting use. It also appears that the plaintiff accepted in cross-examination that the improvements to the land may not be of value if a subsequent lessee utilises the Property for a different purpose. 14 For these reasons, we affirm the Judge’s finding that STI’s interest in the Property was of no value.",
        "Value of the Trust Shares": "15 We turn now to address the value of the Trust Shares, in particular, Mr Kon’s market-based approach. It is clear that in so far as Mr Kon’s alternative “cross-check” method was based on Dr Lim’s evidence on the value of the Property, this should be rejected, and we do not consider this further in these grounds. 16 In brief, the plaintiff’s expert witness on the value of the shares, Mr Kon, relied primarily on a market-based approach or, more specifically, the merged and acquired company method. Under this approach, transactions involving the sale and purchase of comparable companies are considered and used as a starting benchmark. Such transactions includebona fideoffers to buy or sell the company. While there were no actual transactions involving the acquisition of STI, there had been an offer from Royal Raffles Resort Pte Ltd (“RRR”) in early 2008 to purchase all of STI’s shares for $16m. Of this sum, S$14.4m was to be distributed to the various shareholders. Further, on or around 7 May 2008, the defendant, Kek (another shareholder of STI) and Amelga entered into an agreement the parties refer to as the “Terms of Transfer” (“TOT”) so as to facilitate the sale of STI to RRR. The parties entered into a separate agreement referred to as the “Supplemental Terms of Transfer” (“STOT”) under which the defendant was to buy the Trust Shares. Again, the plaintiff’s evidence was that the parties had entered into the STOT to facilitate the sale of STI’s entire shareholding to RRR, and on the understanding that the shares would then be sold to RRR. After performing its due diligence, RRR decided to withdraw from investing in STI. 17 Broadly speaking, Mr Kon’s first report referred to twobona fideoffers. The first was an email dated 6 March 2008 in which the defendant’s son set out the manner in which the S$14.4m from RRR was to be distributed between the shareholders. This stated that the plaintiff would receive $4,752,000 from the sale of the 33% share he owned beneficially. On a pro-rata basis, the proceeds from the Trust Shares would have been S$2,232,000. 18 Second, Mr Kon referred to the TOT and STOT. Under the STOT, the Trust Shares were to be purchased by the defendant for S$752,000. Mr Kon then stated that the pro-rata method applied to the 6 March 2008 email provided a more evenly distributed and fairer value compared to the TOT and STOT. Under the latter two agreements, the consideration for the 17.5% shares held by Almega on trust for the plaintiff and the Trust Shares were not apportioned evenly. It therefore seemed from his first report that Mr Kon was relying on the 6 March 2008 email as opposed to the STOT to value the Trust Shares. However, Mr Kon later stated that the valuation in the 6 March 2008 email was consistent with that in the TOT and STOT had the proceeds of the shares beneficially owned by the plaintiff been divided equally. The operating conditions did not change significantly between the date of the TOT, STOT and the valuation date. If at all, the value determined on the basis of these agreements would provide a conservative fair value given the increased visitorship to Sentosa in the interim. On this basis, he concluded that the fair value of the Trust Shares as at 13 October 2009 was S$2,232,000. 19 On the other hand, Mr Iyer, the defendant’s expert witness, applied an asset-based approach and concluded that the Trust Shares were of no value. 20 We do not accept Mr Kon’s valuation of the Trust Shares. The TOT and STOTat bestrepresent what the defendant was willing to pay for the shares. As we accepted inAbhilash s/o Kunchian Krishnan v Yeo Hock Huat and another[2019] 1 SLR 873 at [75], there could be buyers who are willing to purchase an asset at a huge premium over its fair market value, perhaps due to special synergistic considerations which the buyer might have. We said in that decision that where there is evidence of a genuine third-party offer to acquire shares, made at arm’s length, and which is not speculative or conditional, this should be taken into account when determining the fair market value of those shares. However, we also said that such offers would not invariably represent the best evidence of the shares’ fair market value (at [76]). 21 In the present case, it would seem that the STOT is not a good basis on which to determine the fair market value of the Trust Shares as it appears that the offer therein was made due to special synergistic concerns. As the Judge noted, the TOT and STOT were “connected” to an offer made by RRR to purchase all of STI’s shares for $16m (see the GD at [34]). Whether the TOT and STOT werecontingenton the RRR offer is immaterial. 22  The plaintiff’s position on affidavit was that the defendant had suggested that the Trust Shares and the shares held by Almega be sold to the defendantto facilitate the sale of the entire shareholding in STI to RRR. The understanding had been that, after purchasing these shares, the defendant would sell them together with his own shares in STI to RRR. Therefore, on the plaintiff’s own case, the defendant had been motivated by a desire to facilitate the sale to RRR when he entered into the STOT. The offer embodied in the STOT was therefore not based simply on the value of the Trust Shares, but instead on the RRR offer. In this connection, we note that the RRR offer was eventually withdrawn following its conduct of due diligence, suggesting that RRR had assessed that STI was not a good investment at the price it had offered to pay. We also do not accept the plaintiff’s characterisation of RRR as an insider, which, in our view, is far-fetched. 23 To the extent that the offer in the STOT was made based on an assessment of the value of the Trust Shares, we agree with the Judge that too much weight was given to the notion of the parties being willing buyers and sellers with insider knowledge. The plaintiff makes much of the fact that the parties had “full insider knowledge of STI”. From this, the plaintiff asserts that the defendant would have been “fully apprised of how much the shares could realistically fetch in the market”. This is a doubtful proposition – one may be well acquainted with a company’s affairs but not be apprised of the company’s value. The latter involves a difficult and specialised inquiry, as is perhaps evidenced by the disagreement between the experts in the present case. 24 We note for completeness that, in our view, there were also other difficulties with Mr Kon’s evidence. For example, as Mr Kon accepted, the figure stated in what he referred to as thebona fideoffer set out in the STOT was in fact S$752,000 for the Trust Shares. However, he candidly noted that this would result in a “nonsensical” allocation of values, and conceded that while the STOT was abona fideoffer made by the defendant to the plaintiff, the figure specified was “not a fair value”. He agreed that he had “ignored thebona fideoffer because … based on [his] assessment, thatbona fideoffer was not fair”. He instead applied a pro rata method, as we indicated earlier. In short, that was noactualoffer to purchase the Trust Shares for S$2,232,000. This undermined the credibility of his evidence, and is another reason we do not accept his valuation. 25 For the reasons we have set out above, our view is that the “bona fideoffer” embodied in the TOT and STOT is not a good basis on which to determine the value of the Trust Shares. We similarly reject the valuations provided by the plaintiff’s experts. Notably, while the Judge accepted that STI’s interest in the Property was of no value (see the GD at [24]), she expressed concerns in accepting Mr Iyer’s conclusion, which was that the Trust Shares were of no value (see the GD at [40]). In short, she rejectedbothparties’ expert evidence on the value of the shares. We emphasise that the Judge was entitled to do so: she was under no legal obligation to accept either expert’s opinion, and instead rightly examined the basis for their conclusions before rejecting them.",
        "Whether there was sufficient evidence to award substantive damages": "26 The next question the plaintiff has placed before us is whether, having rejected the evidence of both parties’ experts, the Judge ought to have considered the evidence, made any necessary adjustments to the experts’ valuations, and awarded substantive damages. The plaintiff refers to our decision inRobertson Quay Investment Pte Ltd v Steen Consultants Pte Ltdand another[2008] 2 SLR(R) 623 (“Robertson Quay”)at [28] for the proposition that the mere fact that damages cannot be assessed with certainty does not relieve the wrongdoer of the necessity of paying damages. Further, the plaintiff argues that the burden of proof is on the defendantquatrustee to show that the plaintiff suffered no loss, and that the defendant has not done so, particularly since his experts did not provide a positive case and instead offered criticisms of the plaintiff’s experts’ conclusions. 27  We do not accept the plaintiff’s submissions. InRobertson Quay, a case involving a breach of contract, we stated that the starting point is that a claimant must satisfy the court both as to the fact of damage and as to its amount before an order for substantive damages can be justified. If the fact of damage is shown, but no evidence given as to its amountso that it is virtually impossible to assess damages, then, generally, only an award of nominal damages will be permitted (Robertson Quayat [27], citingMcGregor on Damages(Sweet & Maxwell, 17th Ed, 2003 at para 8-001). It was in this context that we went on to recognise that there may be cases in which absolute certainty and precision as to the quantum of damage will be impossible to achieve (seeBiofuel IndustriesPte Ltd v V8 Environmental Pte Ltd and another appeal[2018] 2 SLR 199 at [42] citingRobertson Quayat [30]). In cases where precise evidence cannot be obtained, the court must do the best it can to assess the damage suffered. However, we also emphasised that the evidence must becogentbefore the court will allow the recovery of damages where the quantum of loss cannot be determined with certainty (at [31]). 28 Those statements were made in the contractual context. Nevertheless, the principles are relevant in so far as it remains that both the fact and quantum of loss must be proved before substantive damages can be ordered. Where breaches of fiduciary duty are concerned, as the plaintiff argues, itmaybe that the burden of proof is not necessarily on the claimant or the innocent beneficiary. The Judge did not come to a landing on whether the burden of proof was on the defendant to prove that the plaintiff suffered no loss, instead finding that, even if this were the case, she would in any event have been unable to deduce a quantum that would satisfactorily reflect the value of the shares (see the GD at [42]). 29 We agree with the Judge that where the burden of proof lies is not material in the present case. This is since, regardless of which party bore the burden of proof, the evidence before the Judge was inadequate. Put simply, there was insufficient evidence on the basis of which the court could determine the quantum of damages to be ordered in a principled manner. This could not be done simply by makingadjustmentsto Mr Kon’s and Dr Lim’s conclusions given our fundamental disagreements with them, which we have explained above. 30 The other approaches suggested by the plaintiff are also unsatisfactory. We give two of the more pertinent examples. One argument made is that even if the Judge was of the view that the TOT and STOT were contingent on the RRR offer, the Judge should have applied an appropriate discount to the resulting value of the Trust Shares to reflect the risks of not completing the RRR offer. It is unclear how the quantum of this discount can be measured in a non-arbitrary manner, and the plaintiff has not explained how this can be done. The same reasoning can be applied to the plaintiff’s suggestion that an appropriate adjustment could be applied to STI’s assets since the Judge had found that STI was in a net asset position and that there was some value to the shares even without including the value of the Property. It is difficult to determine what the appropriate adjustment would be, and further, unclear to what extent Mr Kon’s assessment of the value of STI’s assets (excluding the Property) would be a sound basis on which to value STI’s shares. We are additionally not persuaded that the offer by PMG Asia, or the other valuation reports in evidence, provide a sound basis on which to value the Trust Shares. 31 For the above reasons, the appeal in CA 174/2019 is dismissed with costs of $30,000 (all-in) to be paid by the plaintiff to the defendant. There will be the usual consequential orders. Andrew Phang Boon Leong                    Belinda Ang Saw EanJudge of Appeal                    Judge Tan Gim Hai Adrian, Ong Pei Ching, Yeoh Jean Ann and David Aw Jingwei (TSMP Law Corporation) for the appellant; Pratap Kishan (Kishan Law Chambers LLC) for the respondent.",
        "": ""
    }
}