{
    "case_title": "Kreetharan s/o KathiresonvPublic Prosecutor and other matters",
    "ncitation": "[2020] SGCA 91",
    "coram": "Andrew Phang Boon Leong JA (delivering the grounds of decision of the court):",
    "sections": {
        "Background facts": "4 The applicants were tried along with another co-accused person, Narenthiran s/o Kathireson (“B2”), who faced four similar conspiracy to cheat charges, but was acquitted of the said charges following the trial. References to B2 were thereafter deleted from the cheating charges against the applicants, who were then convicted of the amended charges (see the GD at [7]). 5 The amended charges alleged that on 30 April 2017, the applicants had engaged in a conspiracy to cheat four individuals (collectively, “the victims”) and that pursuant to this conspiracy, Miah Sohel (“V1”) and Afsari Mohammad Malek (“V2”) had been deceived into believing that the applicants were police officers, and Hossain Mohommad Amir (“V3”) and Hossain Jalal (“V4”) had been deceived into believing that the applicants were personnel from the Criminal Investigation Department (“CID”). It was alleged that the applicants had known this to be false, and, that by such “manner of deception”, B1 and B4 had dishonestly induced the victims to deliver to B1 a total of S$18,115 in cash and six mobile phones. B3 was also charged with having voluntarily caused hurt to V3 by punching him on the face and the abdomen. 6 The applicants claimed that they had approached the victims because B1 had been told that V1 and V3 had been selling false safety certificates allegedly issued by A Star Safety Centre Pte Ltd (“A Star”), a company which B1 operated. In this regard, the applicants’ position was that B1 had previously reported other individuals, including one “Sufon” to the police for selling fake safety certificates. The applicants denied having told the victims they were police officers or CID personnel and argued instead that the victims had followed them back to B1’s office (“the Office”) because they knew that they were “in the wrong”. They denied taking money from the victims and claimed that V1, V2 and V3 had handed over their phones as it had been agreed that the applicants would delete their business contacts from the victims’ phones, in exchange for not reporting the victims to the police. 7 In convicting the applicants of the cheating charges, the trial judge found the victims to be internally consistent in their evidence and to have corroborated each other on material matters (see the GD at [115]). In particular, the trial judge observed that the victims had consistently rejected the applicants’ accounts that they had been asked and had agreed to leave their phones behind so that the contacts and contents of their phones could be deleted, and had denied having been involved in the selling of fake safety certificates (see the GD at [119]). While the applicants took issue with the fact that the money which they had allegedly received from the victims as a result of cheating them was not recovered, which their counsel argued cast doubt on the victims’ accounts, the trial judge noted that the Office was not searched immediately after the incident, and that a mini-mart, which was owned by B1’s family and situated a short distance away from the Office, was not searched. The accused persons had travelled between the Office and the mini-mart on the date of the incident. While B1 and B2 were arrested on 30 April 2017, B3 and B4 were not arrested until after 30 April 2017 (see the GD at [128]). 8 The trial judge observed that the victims’ evidence was also corroborated by other witnesses as well as by external evidence. For instance, the prosecution adduced a statement from Jahangir, an employee of B1, which stated that one of the victims had told him that B1 had taken S$10,000 from him, and that Jahangir had told B1 to return the money, albeit to no avail. The trial judge considered that Jahangir’s statement should be given full weight despite the fact that he did not give evidence since he would only have known about S$10,000 being taken from V3 if this had been told to him by the latter (see the GD at [131]). 9 In contrast, the trial judge held that the applicants’ evidence was largely illogical, unsubstantiated and quite incredible (see the GD at [148]). B1’s story about having received a tip-off that V1 and V3 were selling fake certificates on the date of the incident was unbelievable. Further, B1’s explanation as to why he had asked the victims to go to the Office, their willingness to do so, and B1’s account as to why he had “retained” the victims’ handphones made no sense (see the GD at [149]–[151]). The applicants’ assertions were also uncorroborated and contradicted by objective evidence (see the GD at [155]). Finally, the trial judge held that there were material discrepancies in the applicants’ evidence in court, the account given in their statements, and their Case for the Defence, some of which related to material matters (see the GD at [160]). For the above reasons, the trial judge convicted the applicants on all the cheating charges. 10 On the charge of voluntarily causing hurt against B3, the trial judge found V3’s evidence to be credible, convincing, clear and internally consistent. V3 was also found to be a forthcoming witness whose testimony was supported by that of Mr Victor Kuah (“Mr Kuah”), who was an independent eyewitness to the assault (see the GD at [165]–[170]). B1’s claim that V3 had grabbed his arm and his pouch when they were outside the Office made no sense if, as B1 claimed, V3 had amicably surrendered his phone to him in exchange for B1’s agreement to not file a police report (see the GD at [172]). B1’s and B3’s evidence were also contradictory. The trial judge therefore convicted B3 on the charge for voluntarily causing hurt (see the GD at [176]). 11 The applicants were each sentenced to a global term of 14 months’ imprisonment for the four cheating charges. B3 was sentenced to an additional 2 weeks’ imprisonment for the s 323 charge, making a total of 14 months and 2 weeks’ imprisonment (see the GD at [200]). The Judge also made compensation orders, which are summarised at [9] of the GD. 12 The applicants then filed an appeal against the convictions and sentences imposed. Before the High Court, they sought to challenge thefindings of factmade by the trial judge. They argued that the victims should not be believed as (a) their evidence was internally and externally inconsistent; (b) they had been evasive and/or lied and/or embellished their evidence and had reason to collude against the applicants; and (c) there was no corroborative evidence to plug the weaknesses in the victims’ testimonies. They argued that, in contrast, the applicants’ testimonies were consistent and amply supported by external evidence, and that they had therefore adduced enough evidence to raise a reasonable doubt. In an oral judgment, the High Court dismissed the appeals against both conviction and sentence.",
        "Our decision": "13 We turn now to set out our decision with respect to the applications, considering thembothas applications for the High Court’s decision to be reviewed and as applications for leave to refer questions of law of public interest to this court, respectively.",
        "Review application": "14 It is apparent that in so far as the applications were brought to review the High Court’s decision, they failinlimine. Under s 394H(1) of the CPC, an applicant must first obtain leave from theappellate courtbefore making a review application. Pertinently, the court which exercised its appellate jurisdiction in the present case, and whose decision is to be reviewed, was the High Court (see s 373 of the CPC). Any application for leave to bring a review application should therefore have been made to the High Court andnotthe Court of Appeal. To be clear, while s 394I(7)(a) of the CPC permits the Court of Appeal to hear a review application made to the High Court in respect of an earlier decision of the High Court, this does not detract from the fact that the application, both for leave and for review, must first be made to the relevant appellate court. 15 For completeness, while this court inKhoJabing v Public Prosecutor[2016] 3 SLR 135 (“KhoJabing”)held that it had the inherent power to reopen a concluded appeal to prevent a miscarriage of justice as the final appellate court in Singapore, the court inKhoJabinghad been concerned with the question as to whether it could review itsowndecision on appeal. The court inKhoJabingtherefore held at [77(a)] that “[w]hen the court exercises [the] power of review, it is actingwithin the scope of its statutorily-conferredappellate jurisdiction, which is not completely exhausted merely by the rendering of a decision on the merits of the appeal” [emphasis added in italics and bold italics]. The decision inKhoJabingon the Court of Appeal’s inherent powers, and indeed s 394J(1)(b) of the CPC, therefore did not assist the applicants in the present case. It followed that the applicants should have brought their applications for leave in the High Court, and, if such leave were to be granted, review applications before the High Court as well. 16 That the applications for leave to review the High Court’s decision should have been filed in the High Court was in fact highlighted to the applicants at the CMC. Notwithstanding this, the applicants confirmed that they nevertheless wished to proceed with the applications before the Court of Appeal. This appeared to be motivated, at least in part, by a desire to have their case heard by the Court of Appeal instead of the High Court (which had already dismissed their appeals). While they were unrepresented before us, having had their attention drawn to the statutory framework of the CPC and its requirements, their decision to persist with the applications filed before this court bordered on (or even constituted) an abuse of its process. On this basis alone, our view was that the applications, in so far as they were made to review the High Court’s decision, should be dismissed. 17 In any event, we were satisfied thateven ifthe applications had been correctly brought (which wasnotthe case), leave would in any case have been refused. During the relevant Parliamentary Debates, the then Senior Minister of State for Law, Ms Indranee Rajah (“Ms Rajah”), stated that the procedure with regard to the re-opening of a decision arrived at by the court provided for in the CPC is largely a codification of a number of considered decisions made by the Court of Appeal on the manner in which the interests of finality should be balanced against the need to prevent a miscarriage of justice (seeSingapore Parliamentary Debates,Official Report(19 March 2018) vol 94 at p 79 (Indranee Rajah, the Senior Minister of State for Law)). The inclusion of the leave stage appears to be a codification of the suggestions made by this court inKhoJabingat [133] and [134], where we expressed the opinion that the introduction of a leave stage for applications to reopen concluded appeals would better balance the rights and interests of all persons who make use of scarce judicial resources and allow unmeritorious applications for review to be weeded out at an early stage. This would allow only those applications which disclose a legitimate basis for the exercise of this court’s power of review to proceed. In the present case, we were satisfied that the applications were clearly unmeritorious and did not disclose a legitimate basis for the exercise of the court’s power of review. 18  Specifically, we agreed with the Prosecution that the applicants had not raised any material which might meet the statutory requirements of s 394J of the CPC. Under s 394J(2) of the CPC, the applicant in a review application must satisfy the appellate court that there is sufficient material, whether evidence or legal arguments, on which the appellate court may conclude that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made. “Sufficient” material is defined in s 394J(3) of the CPC, under whichallof the following requirements must be satisfied: (a) before the filing of the application for leave to make the review application, the material has not been canvassed at any stage of the proceedings in the criminal matter in respect of which the earlier decision was made; (b) even with reasonable diligence, the material could not have been adduced in court earlier; (c) the material is compelling, in that the material is reliable, substantial, powerfully probative, and capable of showing almost conclusively that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made. 19 These requirements reflect the fact that the s 394H and s 394I procedure does not provide a second-tier appeal, but, instead, concerns the distinct situation where the case, by this point, has been heard at least twice. Indeed, Ms Rajah observed as follows (seeSingapore Parliamentary Debates,Official Report(19 March 2018) vol 94 at p 79 (Indranee Rajah, the Senior Minister of State for Law)): Before the filing of the application of leave to make the review application, the material must not have been canvassed at any stage of the proceedings in the criminal matter, in respect of which the earlier decision was made. So,it must be remembered that this scenario is different from a scenario where something is coming up for consideration for the first time. This is intended to address the scenario where it has been heard once –it has been appealed, it has been heard – and, therefore, you are trying to re-open it again, which means the Court has already applied its mind. Therefore, the threshold is different. You therefore have to show that it is something where it could not or had not been canvassed at an earlier stage. Because if it had been canvassed at an earlier stage and it was considered, and the Court had said no,then really, it should follow the normal procedural rules, which is that you do not re-open concluded hearings. It is also a requirement that even with reasonable diligence, the material could not have been adduced in Court earlier. Obviously, that is to impress upon parties that they must take all reasonable efforts to look for the relevant evidence. … [emphasis added] 20 Where the material concerned consists of legal arguments, it must, in addition to satisfying the requirements in s 394J(3)of the CPC, be based on a change in the law that arose from any decision made by a court after the conclusion of all earlier proceedings relating to the criminal matter in respect of which the earlier decision was made (s 394J(4) of the CPC). The appellate court may conclude that there has been a miscarriage of justice only if the earlier decision is demonstrably wrong, or if the earlier decision is tainted by fraud or a breach of the rules of natural justice, such that the integrity of the judicial process is compromised (s 394J(5) of the CPC). 21 It was apparent that nothing raised by the applicants in their affidavits or submissions met the conjunctive requirements in s 394J of the CPC based on any standard and that no legitimate basis for the court to exercise its power of review had been disclosed. In this regard, it is clear from the foregoing that it isinsufficientfor an applicant to attempt to re-characterise the evidence already led below or to mount fresh factual arguments on the basis of such evidence. To a large extent, this was what the applicants sought to do before us. Any new points raised by the applicants were either unhelpful or could have been raised earlier with reasonable diligence. 22 The applicants raised several factual allegations and questions in their affidavits and submissions, and we deal only with the main points in these grounds. 23 At the outset, we note that several points made by the applicants had no relevance to their conviction or sentences. For example, the queries raised by the applicants relating to the seizure and retention of B1’s property, including his car, and to the fact that the initial charges preferred against the applicants were for robbery with hurt (as well as their subsequent amendment to charges for engaging in a conspiracy to cheat), had no bearing on the conviction of and sentences imposed on the applicants. 24 More significantly, the assertions the applicants made in their affidavits largely reiterated their evidence and positions below, and would therefore not constitute material which “ha[d] not been canvassed at any stage of the proceedings in the criminal matter in respect of which the earlier decision was made” (see s 394J(3)(a) of the CPC). We give three non-exhaustive examples. 25 First, the applicants asserted in their affidavits that they had approached the victims because B1 had, earlier in the evening on 30 April 2017, been told that two individuals (ie,V1 and V3) had been seen selling fake security certificates from A Star. They asserted also that they had not impersonated police officers or CID personnel. This was the crux of their defence which had been carefully considered and rejected by both the trial judgeandthe High Court. While they emphasised that the monies seized from B1 have now been returned to him, this essentially echoed their arguments below arising from the fact that the monies seized were not those which the victims had allegedly been cheated of. This was a point which the trial judge had considered (see [7] above). The fact that the seized monies have now been returned to B1 was also of limited relevance as it would not necessarily follow from the fact that the seized monies did not belong to the victims that the convictions were unsafe or that the offences had not been committed. 26 Second, in so far as the applicants sought toquestionthe credibility of the victims and other witnesses, this didnotconstituteevidenceor legal arguments based on a change in the law arising from a decision following the High Court’s decision (see s 394J(4) of the CPC). The evidence on which the applicants sought to make these arguments was, in material respects, led at the trial below. This could clearly be seen from, for example, the applicants’ statements, in their affidavits, that they were “unsure and very unclear” why the 12 inconsistencies and the “serious gaps” highlighted by their counsel were considered to be immaterial. This was in itself recognition that these points had already been canvassed in the proceedings below. The same might be said of the applicants’ arguments concerning the evidence given by Naba and Mr Kuah, who were Prosecution witnesses. 27 Third, in relation to the s 323 charge, B3 submitted that he was wrongly convicted since there were no medical reports, the victim had not been sure exactly who had punched him, and Mr Kuah, who had been 2m away from the incident, did not see any bleeding despite V3’s claim otherwise. B3 also referred to the First Information Reports in evidence and argued that they presented two different accounts, and that Mr Kuah’s account was “inconsistent with the evidence in [the] record of proceedings”. Again, it was clear that these submissions do not constitute new evidence or material which might satisfy s 394J of the CPC. Indeed, we observe that the trial judge specifically noted that no medical report had been produced, and had found this to be unsurprising given V3’s testimony that he had been focused on trying to get his money back, rather than on seeking medical treatment after the assault (see the GD at [167]). Further, as the trial judge noted at [168(c)], Mr Kuah’s evidence had been that he wasunsurethere was any bleeding after V3 was punched on the head, although Mr Kuah did not see any blood. 28 As the Prosecution noted, there were a few ways in which the applicants’ accounts in the affidavits filed for the present applications differed from the evidence they had given at trial. To this limited extent, there might arguably have been material which had not been canvassed at any stage of the proceedings in the criminal matter in respect of which the earlier decision was made (see s 394J(3)(a) of the CPC). However, on a closer analysis, this “material” simply constituted, in our judgment, ancillary aspects of evidence which had already been given prior to the present applications. For instance, as the Prosecution noted, there appeared to be a slight disparity between the account given in B1’s affidavit and the evidence B1 had given at trial, namely, as to whether B1 had specifically asked V1 and V2 if they were selling fake safety certificates when he first approached them near Mustafa Centre, or if he had only done so in the Office. Further, there appeared to be an inconsistency in so far as as B1’s position below was that he had offered V1 achoiceas to whether he wanted to let B1 delete the contacts from his phone or reformat it instead of reporting V1 to the police, whereas the affidavits filed for the present applications suggested that V1 had taken the initiative to offer his phone to B1. The applicants also stated, in their affidavits, that one “Shofun” had previously been involved in the selling of the fake certificates and that the applicants had met “Shankar”, Shofun’s “boss”, who had negotiated with B1 and B2 not to report Shofun to the police and even tried to hail a taxi for Shofun to run away. This “Shofun” appears to have been the “Sufon” referred to at trial. The Prosecution noted that, at trial, no evidence was given of Shankar’s attempts to hail a taxi for Shofun. Finally, we note that B1 had also asserted, in the affidavits, that he had asked the individual who had told him about V1 and V3 selling A Star’s safety certificates to send him the photos of V1 and V3 through Whatsapp, while his evidence at trial was that he had not asked this individual to send him a copy of the photographs (see the GD at [74]). 29 To the limited extent that any of the assertions made by the applicants before this court were new, we could see no reason why the applicants could not have adduced this material at an earlier stage with reasonable diligence. As the Prosecution noted, all the factual allegations made in the affidavits related to events that occurred before the trial. We would also have hesitated to find, without a clear explanation as to why any new allegations had not been made at an earlier stage despite the applicants having been well-represented both at trial and on appeal, that these were reliable or powerfully probative (see s 394J(3)(c) of the CPC). 30 For the above reasons, we dismissed the applications for the High Court’s decision to be reviewednot onlybecause the applications were not filed in compliance with the statutorily prescribed process for leave applications, butalsobecause we were satisfied that the applications were wholly without merit and did not disclose any legitimate basis for leave to be granted. It was apparent to us that, even if leave could be and had been granted, any review application brought on these grounds would have failed. As we indicated above, in so far as the applications sought to challenge the findings already made by the courts below on the basis of evidence which had already been adduced below and which could not, on any standard, satisfy s 394J of the CPC, the applications were without basis. For these reasons, we therefore declined to grant leave.",
        "Leave to bring criminal reference": "31 We turn now to address the applications for leave to bring a criminal reference. We cautioned inHuangLiping v Public Prosecutor[2016] 4 SLR 716at [20] and [21] that s 397 of the CPCcannotbe utilised as a covert or “back-door” appeal that merely seeks to re-litigate issues of fact that have already been decided in the courts below. Instead, s 397 of the CPC furnishes anexceptionallegal mechanism in situations where a point of law of public interest needs to be clarified by this court in order to furnish the requisite legal guidance for the sake of the legal system generally. Construing s 397 too liberally would seriously undermine the system of a one-tier appeal, and where it is evident that an applicant is seeking to disguise an impermissible appeal as a reference on a question of law of public interest, this would border on (or even constitute) an abuse of the process of the court. In this regard, it is well-established that before leave can be granted for a criminal reference to be brought, the following conditions must be satisfied (see, for example, the decision of this court inPublic Prosecutor v LamLeng Hung and others[2018] 1 SLR 659 at [51], citingMohammad Faizal binSabtu and another v Public Prosecutor and another matter[2013] 2 SLR 141 (“Mohammad Faizal”)at [15]): (a) the reference to the Court of Appeal can only be made in relation to a criminal matter decided by the High Court in exercise of its appellate or revisionary jurisdiction (“the first condition”); (b) the reference must relate to a question of law and that question of law must be a question of law of public interest (“the second condition”); (c) the question of law must have arisen from the case which was before the High Court (“the third condition”); and (d) the determination of that question of law by the High Court must have affected the outcome of the case (“the fourth condition”). 32 InMohammadFaizalat [19], this court affirmed the following approach articulated by the Malaysian Federal Court inARagunathan v Pendakwa Raya[1982] 1 MLJ 139 at 141: … We think that the proper test for determining whether a question of law raised in the course of the appeal is of public interest would bewhether it directly and substantially affects the rights of theparties and if so whether it is an open question in the sense that it is not finally settled by this court … or is not free from difficulty or calls for discussion of alternative views. If the question is settled by the highest court or the general principles in determining the question are well settled and it is a mere question of applying those principles to the facts of the case the question would not be a question of law of public interest. [Court of Appeal’s emphasis inMohammad Faizaladded in italics] 33 InPublic Prosecutor v Teo Chu Ha[2014] 4 SLR 600 at [31], this court held that, as a matter of principle, the courts must determine whether there is sufficient generality embedded within a proposition posed by the question which is more than just descriptive but also contains normative force for it to qualify as a question of law. 34 The questions raised by the applicants include those pertaining to (a) the propriety of the initial robbery charges and their subsequent amendment to the charges on which the applicants were tried; (b) whether various individuals should have been called to give evidence; (c) the seizure and retention of B1’s property; (d) the trial judge’s finding that the victims were credible, including the possibility that the victims had “targeted” B1; (e) whether the victims’ statements should have been produced in court; and (f) whether the court can convict the applicants despite the lack of objective evidence. 35 At the outset, we note that the questions pertaining to (a) whether particular witnesses, for example, Jahangir, should have been called; (b) the propriety of the initial robbery charges and their subsequent amendment; as well as (c) whether the other statements given by the victims should have been produced were not determined by the High Court judge. To the extent that the High Court judge referred to Jahangir’s unavailability to testify, it was also held that there would be no difference to the outcome of the case if Jahangir’s statement was not relied on. The third and fourth conditions were thus not met in relation to these questions. These questions were, in any event, not sufficiently general to constitute questions of law of public interest (see [33] above). Further, as we have indicated above, the questions relating to the seizure and retention of B1’s property had no bearing on the applicants’ convictions and sentences. 36 In our view, it was also apparent that the remaining questions framed by the applicants are not questions of law of public interest. The legal principles applicable to the “unusually convincing” standard and what constitutes a reasonable doubt have been considered by this court and are well-established. Indeed, extensive submissions were made on these principles before the High Court. The questions posed by the applicants relating to whether the victims’ claims were believable despite, for example, the lack of any bank statements from the victims showing they had possessed the monies the applicants allegedly cheated them of, were no more than attempts to re-litigate issues of fact that have already been decided in the courts below. As we have said above at [31], this was an impermissible attempt to subvert the purpose of s 397 of the CPC, and bordered on (or even constituted) an abuse of process of the court. Similarly, while the applicants suggested, in their affidavits, that it was possible the victims had “targeted” B1 as he had reported other individuals from the same “cartel” which sold fake safety certificates, the High Court judge held that the victims hadno reasonto falsely implicate the applicants, and the applicants’ attempts to challenge this finding through applications under s 397 of the CPC were impermissible. These findings were fact-sensitive and involved the application of well-settled principles to the facts of the present case and provide no basis whatsoever for the applications to be brought under s 397 of the CPC. 37 Finally, B1 contended that it was wrong for the trial judge to have held that the applicants “should not expect the sentencing discount that normally accrues from a plea of guilt” since the reason they did not plead guilty was that they were innocent and this would amount to punishing them further for not pleading guilty. He also asserted that they did not know that not pleading guilty would be an “aggravating factor” in sentencing. This submission was misguided on a few levels. First, the trial judge did not hold that the failure to plead guilty was an aggravating factor, but rather observed that the sentencing discount which normally followed a plea of guilt was inapplicable in the present case (see the GD at [196(c)]). In this regard, there is a principled difference between an aggravating factor and the absence of a mitigating factor. The principles on the circumstances under which a plea of guilt can justify a reduction in sentence are also well-settled. The trial judge wasnotsuggesting that the applicants could not claim trial and, indeed, had acknowledged that the applicants were “perfectly entitled to deny the allegations and to contest the charges” (see the GD at [196(c)]). Second, while the applicants continued to assert their innocence, the courts below found that the applicants were guilty of the charges preferred against them and we found that there was no basis for this court to interfere with that finding. Again, we saw no question of law of public interest. For the avoidance of doubt, if this particular argument was intended as part of the review applications instead, it would be irrelevant as it did not raise either new evidence or a legal argument falling within s 394J(3) or s 394J(4) of the CPC.",
        "Conclusion": "38 For the reasons we have given above, we were satisfied that the applications were without basis and should be dismissed. These applications appeared to us to be a desperate attempt by the applicants to have their case heard by this court by whatever means possible, and were made without due regard to thelimitedavenues by which this can be done under the CPC. The applicants appeared to concede as much when they stated, at the CMC, that their motive was to have their case heard by this court. While the applicants were unrepresented before us, the affidavits they filed demonstrated that they hadsomeunderstanding of the relevant statutory requirements. Despite this, they impermissibly sought to re-litigate points which were already canvassed before the courts below. 39 Indeed, we would go further to say that the present case was one which we would have been inclined to deal with summarily without setting it down for hearing (see s 394H(7) of the CPC and s 397(3B) of the CPC, with the former on the assumption that the applications had been made to the correct court for leave to make the review application as required pursuant to s 394H(1) of the CPC (which, as we have explained, wasnotthe case here)). This was because it had been apparent from the affidavits and submissions filed by the applicants that there was no legitimate basis or merit to the applications. Having considered the parties’ oral submissions, our view remained the same. As we indicated earlier, given the manner in which the applications sought to challenge the findings of fact made by the courts below, it appeared to us that the applications were,in substance, attempts to bring a “back-door” appeal. 40 Where the applications to review the High Court’s decision were concerned, it was particularly clear that they had to fail since they had not even been filed with the correct court. We also add that these applications were so devoid of merit that had they in fact been made to the correct appellate court (in this case, the High Court), it is very likely that leave to make a review application would similarly not have been granted for the reasons we have given above, and indeed, would have been dealt with summarily (see 394H(7) of the CPC). 41 In future cases of this kind, applicants should be prepared that the courtmaysummarily dismiss their applications without further hearing –especially after the views expressed in the present judgment. For the reasons set out above, we dismissed the applications. We ordered that the applicants were to report to the State Courts on 21 September 2020 at 12.00pm to begin serving their sentences in accordance with the terms of the last extension of their bail. Andrew Phang Boon Leong            Woo Bih Li        Quentin LohJudge of Appeal             Judge          Judge The applicants in person;Grace Lim (Attorney-General’s Chambers) for the respondent."
    }
}