{
    "case_title": "SAR Maritime Agencies (Pvt) Ltd vPCL (Shipping) Pte Ltd",
    "ncitation": "[2020] SGCA 23",
    "coram": "Steven Chong JA (delivering the judgment of the courtex tempore):",
    "sections": {
        "Background": "1 The present appeal arises from the Appellant’s, SAR Maritime Agencies (Pvt) Ltd (“SAR”), claim against the Respondent, PCL (Shipping) Pte Ltd (“PCL”) for 1% commission on the freight of each cargo shipped by PCL for Ceylon Shipping Corporation Limited (“CSCL”) from October 2014 to May 2019.",
        "Parties to the dispute": "2 SAR is a shipping agent and brokerage company incorporated in Sri Lanka. Mr Raju Radha (“Raju”) is the Managing Director of SAR, and he shared a personal relationship with Captain Robin Perera (“Robin”), who was employed in PCL’s Melbourne’s office. 3 PCL is a shipping company incorporated in Singapore. It owns and operates a fleet of dry bulk vessels, providing worldwide transportation of dry bulk cargoes such as coal, iron, grain and fertiliser. At the material time, the Managing Director of PCL was one Govind Ramanathan (“Govind”). Robin reported to Govind. 4 From 2011 to 2014, SAR was PCL’s vessel handling agent.",
        "Expression of interest for the transport of coal": "5 On 2 December 2013, CSCL, a Sri Lankan company that is fully owned by the Government of Sri Lanka, published an advertisement to invite expressions of interest (“EOI”) from shipowners for the transport of coal to Sri Lanka. The stipulated deadline for the submission of an EOI was 31 December 2013. It is unclear whether PCL submitted its EOI by the stipulated deadline. Nonetheless, on 31 January 2014, allegedly after some efforts on SAR’s part, PCL was invited by CSCL to submit its “firm offer … on or before 28/02/2014.” 6 Subsequently, on 28 February 2014, CSCL held a meeting to open the firm offers which it had received from nine shipowners, including PCL, in response to its advertisement. No concluded agreement was reached with any shipowner on that day.",
        "The Brokerage Agreement": "7 On 8 May 2014, while discussions with CSCL were still ongoing, PCL and SAR signed a single-paged document headed the “Brokerage Agreement”. The Brokerage Agreement was in relation to a “Proposed Coal Transportation Agreement” between CSCL, PCL and SAR, and provided, among others, that the total brokerage payable by PCL to SAR would be 1% commission on the freight of each cargo under PCL’s proposed coal transportation agreement with CSCL (“the Brokerage Agreement”). 8 Shortly thereafter, on 21 May 2014, Robin wrote to Raju, stating that PCL had decided that SAR’s “services in lobbying and representing PCL are no longer required for this particular Coal tender with CSCL as of immediate effect.”",
        "The CSCL contracts": "9 After PCL informed SAR that the latter’s services were no longer required, PCL appointed Sathak Abdul Kadar (“Sathak”) of M/S Trade and Logistics to represent PCL in its negotiations with CSCL. 10 Following Sathak’s appointment, on 30 May 2014, CSCL wrote to PCL, seeking PCL’s revised proposal by 16 June 2014. This revised proposal was submitted by Sathak on PCL’s behalf on 16 June 2014. After several rounds of negotiations with CSCL without SAR’s participation, PCL entered into a Contract of Affreightment with CSCL for the transportation of coal to Sri Lanka on 28 November 2014 (“the First Contract”). 11 The First Contract was replaced with another Contract of Affreightment on 22 October 2015, which was subsequently extended by Addendum No 2 and Addendum No 4, the latter of which extended the contract to 31 May 2019 (collectively, “the CSCL contracts”). Pursuant to the CSCL contracts, between November 2014 to May 2019, PCL earned about US$98m in freight from CSCL.",
        "Commencement of the present action": "12 On 24 May 2017, SAR commenced the present action against PCL, seeking a 1% commission on the freight of each cargo shipped by PCL for CSCL. SAR alleged that its entitlement to such commission stemmed from the Brokerage Agreement entered into between the parties on 8 May 2014.",
        "The Judge’s decision": "13 After a six-day trial, the Judge dismissed SAR’s claim in its entirety. In her unreported decision, she held that there was no concluded brokerage agreement. Even if there was a concluded brokerage agreement, the Judge held that it was terminated on 21 May 2014, by way of the email sent by Robin to Raju (see [8] above). Further, SAR would not be entitled to any commission as it was not the effective cause of PCL’s contracts with CSCL.",
        "Binding agreement": "14 Before us, Mr Adrian Tan (“Mr Tan”) submitted on SAR’s behalf that there was a concluded brokerage agreement, as evidenced by the 8 May 2014 “Brokerage Agreement” and the prior discussions between the parties. This was refuted by counsel for PCL, Mr Jason Chan SC (“Mr Chan”), who submitted that an objective interpretation of the express terms of the Brokerage Agreement indicated that neither party intended for the agreement to be legally binding. As the Judge observed, such a lack of intention is supported by the behaviour of the parties after 8 May 2014, which “[did] not show [the] parties acting as if they had a concluded contract”. 15 In our view, the three requirements that are necessary for contractual formation, namely an identifiable agreement that is complete and certain, consideration, as well as an intention to create legal relations (Gay Choon Ing v Loh SzeTi Terence Peter and another appeal[2009] 2 SLR(R) 332 (“Gay Choon Ing”)at [46]) are present, and a binding brokerage agreement was therefore entered into by the parties on 8 May 2014. Under the agreement, the payment of the brokerage commission was subject to the condition subsequent of a “formal execution of the Coal Transportation Agreement”. We elaborate.",
        "Express terms of the Brokerage Agreement": "16 To begin with, regardless of the contents of the prior negotiations which took place between the representatives of SAR and PCL, on 8 May 2014, the parties executed the Brokerage Agreement, which was in relation to a “Proposed Coal Transportation Agreement” between CSCL, PCL and SAR (as the Broker). While brief, the document stated, in unequivocal terms, that: It has this day been mutually agreed between [PCL] and [SAR] that: Consistent with the normal shipping industry practice, the total brokerage payable by [PCL] is 1.00% on freight of each cargo under the said proposed Coal Transportation Agreement. The parties agree that a final brokerage agreement confirming the above will be signed upon formal execution of the Coal Transportation Agreement. 17 Considering the plain language of the Brokerage Agreement, it can be seen that the partiesmutually agreedthat, should PCL enter into a “Coal Transportation Agreement” with CSCL, SAR, as the envisaged broker of the agreement, would be entitled to “1.00% on freight of each cargo under the said proposed Coal Transportation Agreement.” In other words, pursuant to the Brokerage Agreement, the parties had agreed that SAR would be entitled to a 1% commission on the cargo of each shipmentifSAR successfully brokered a “Coal Transportation Agreement” betweenPCL and CSCL.",
        "Behaviour of the parties after 8 May 2014": "18 This, in our view, is buttressed by the conduct of the parties after the Brokerage Agreement was signed on 8 May 2014. Reviewing the correspondence between the parties between 8 and 21 May 2014, the latter date being when Robin sent the email seeking to terminate SAR’s brokering services, it is clear to us that the parties had agreed that SAR would be paid a 1% brokerage commission although the parties continued to negotiate as towhenandhowsuch a 1% commission would be disbursed. 19 In this respect, while SAR was seeking a partial “advance” of the commission prior to the signing of the CSCL contracts, PCL remained adamant that any such “advance” would only be paidafterPCL was awarded the CSCL contracts. Hence, on 14 May 2014, Syed, an employee of PCL, wrote to Raju, proposing that an “advance” of US$200k be paid to SAR “at the time of finalisation of the contract / charter party between PCL/[CSCL]” [emphasis added], and for such an advance to be clawed back from SAR’s 1% commission for successfully brokering the envisaged contract. 20 Read in light of the terms of the Brokerage Agreement, it is obvious that the parties had, as of the 8 May 2014, agreed that SAR’s brokerage commission would be 1%. All the discussions about the “advance”, and the “clawback” of the advance, merely concernedhowthe advance would be off set against the commission, as and when it was earned. Such discussions did not change the fact that a binding brokerage agreement had by then already been concluded. If no agreement was then concluded on the advance or the clawback, all it would mean is that the parties would then fall back to the default position under the signed Brokerage Agreement, which provided that SAR was entitled to a 1% commission “on [the] freight of each cargo”, when such freight was earned. 21 As such, it is plainly wrong to suggest that there was no intention to create legal relations when the parties signed the Brokerage Agreement. As this court held inGay Choon Ing([15]supra)at [72], “in business and commercial arrangements, there is a … presumption to the effect that it is presumed that the parties do intend to create legal relations” [emphasis in original removed]. The Brokerage Agreement in this case was concluded between commercial parties, and no reason was proffered for why they would have signed such a document had they not intended to create such legal relations. While brief, the terms of the agreement were also complete and certain, with PCL agreeing to pay a 1% commission upon the successful brokering of the First Contract by SAR. The consideration provided by both parties is also readily apparent. In the circumstances, a binding agreement which was subject to the condition subsequent of a “formal execution of the Coal Transportation Agreement”, was entered into on 8 May 2014, by way of the single-paged Brokerage Agreement.",
        "Termination of the Brokerage Agreement": "22 Nonetheless, Mr Chan submitted that, even if there was a binding Brokerage Agreement, this was terminated by Robin’s email to Raju on 21 May 2014. Raju himself then accepted this termination, when he wrote to Robin on 5 June 2014, stating that he would “suspend [his] lobbying” with CSCL. 23 Mr Tan contended that while Raju had agreed tosuspendhis lobbying for PCL, this did not mean that he also accepted theterminationof the parties’ Brokerage Agreement, as SAR’s lobbying efforts was but one aspect of the work carried out by SAR in brokering the CSCL contracts. 24 In our view, Mr Tan’s submission is untenable in light of the emails sent by Raju after Robin had sent the email to terminate SAR’s lobbying services. As alluded to, on 5 June 2014, Raju had written to Robin stating that he would suspend his lobbying. Significantly, at the end of the email, he then expressed that hehopedto be reimbursed for the expenditure that he had incurred in his lobbying efforts. Shortly after, on 16 June 2014, Raju sent an email to Govind, stating that he had received a call on 6 June 2014, “after the mail that for me to sit back onlobbying,, and just remain as thehandling agent” [emphasis added]. In that email, he sought Govind’s clarification on whether PCL “has communicated on any new agent”, stating that if this was so, it was “highly unethical” of PCL to have done so. 25 Faced with no reply, on 18 June 2014, Raju wrote to Robin (copying Govind), and stated that he would support Sathak’s takeover of SAR’s lobbying efforts, “on condition that your company (ie,PCL) confirm not terminating and continuing ashandlingand husbanding agents,,,” [emphasis added]. Later in the same email, Raju stated that “the Presidents son (sic)office has reapproached us asking if we can pay USD 1.25 per ton,,, We have informed them that we are not involved inlobbying” [emphasis added]. Again, PCL did not reply to Raju’s email. 26 The emails that were sent by Raju on 5, 16 and 18 June 2014 make clear that he understood, and accepted, that SAR had been replaced by Sathak as PCL’s agent to lobby with CSCL for the coal transportation agreement. In effect, Raju accepted that SAR’s services in relation to the brokering or lobbying for the contract with CSCL had been terminated. To mitigate the impact of the termination, Raju sought what was at best a gratuitous reimbursement ofexpenditurein his 5 June 2014 email; this starkly contradicts SAR’s case that there remained an obligation to pay a brokeragecommissionafter that date. Later, as seen from the 18 June 2014 email, Raju then tried to seek confirmation from Robin that PCL was not also terminating SAR’s services as handling and husbanding agents. As seen from the 16 and 18 June 2014 emails, and as Raju admitted on cross-examination, SAR’s role as a handling and husbanding agent was “obviously” different from its role as a broker and lobbier for PCL. 27 Accordingly, we find that the Brokerage Agreement was terminated by mutual agreement on 5 June 2014, when Raju accepted, on SAR’s behalf, that PCL was terminating SAR’s lobbying services. In so doing, SAR had ceased to be PCL’s broker for the negotiations with CSCL.",
        "Effective cause": "28 However, that the Brokerage Agreement was terminated would notipso factodeprive SAR of its brokerage commission. As this court held inGoh LayKhim and others v Isabel Redrup Agency Pte Ltd and another appeal[2017] 1 SLR 546 (“IsabelRedrup”) at [33], “[i]n the absence of clear and express language to the effect that the agent’s right to commission would only crystallise if it saw the transaction to the end”, it is implied that an agent would be entitled to commission if his services were the “effective cause” of the transaction. 29 Mr Tan submitted that SAR, being the party who introduced PCL to CSCL, was theeffective causeof the CSCL contracts, such that SAR ought to be paid the 1% commission stipulated in the Brokerage Agreement notwithstanding the termination. In support, he referred to the following passages fromCarver’s Carriage by Seavol 1 (Raoul Colinvaux) (London Stevens & Sons, 13th Ed, 1982) (“Carver’s”) at para 595: Broker must have introduced parties. If the contract is, in fact, brought about through the broker’s introduction of the parties, he is entitled to his commission, whether he himself works the matter out, or the principals complete it without his help. His introduction, however, must have been direct: it is not enough that he has mentioned the matter to somebody else, who has brought the parties together. Nor would it suffice that he had introduced the shipowner to another broker who effected a charter of the ship. … Where several brokers employed. Where several brokers have been employed to obtain a charter for his ship, the broker who first introduces the principals to one another is entitled to commission; and, generally, none of the other brokers is entitled to anything from the shipowner. … 30 Insofar as the above passages fromCarver’ssuggest that the introducing broker is necessarily the effective cause of the eventual contract, we do not accept such a wide-ranging proposition. As we cautioned at [37] ofIsabelRedrup, “[n]o precise definition of ‘effective cause’ has been attempted in case law given that the inquiry is fact specific. …No one factor isdeterminativeand the inquiry entails a holistic assessment of all the relevant facts of each case. It is insufficient for the agent to show that it was one of the causes of the sale; it would have to show that it was the critical cause” [emphasis added]. While our observations were made in the context of a real-estate transaction, we find them to be equally apposite in the context of brokering and chartering cases. In our view, what is important is that the “broker” in any type of brokerage agreement must effectively broker the deal (ie,it must bethe effective cause). 31 In ordinary chartering cases, such as the ones which appear to have been contemplated by the authors ofCarver’sin the passages above (at [29]),the introduction by the broker is crucial because the owner would not know the identity, needs and requirements of the charterer without the introduction of such broker. If the charterparty is concluded thereafter, that broker should therefore ordinarily be entitled to the commission because, under those circumstances, the broker would indeed be the effective cause of thesinglecharterparty. 32 Unlike those cases, the present case involved a long-term transportation agreement that would span several years, and there was a public tender by CSCL, in which several shipowners were invited to provide their offers. Under such circumstances, any introduction by SARper sewould not be effective because whether the contract was ultimately awarded to PCL or any of the eight other tenderers would depend on many factors, such as the price, reputation and other terms which CSCL deemed relevant. The present case therefore differs significantly from a one-off charterparty situation discussed above. 33 Mr Tan sought to convince us that SAR was nevertheless the effective cause of the CSCL contracts as, apart from introducing PCL to CSCL, SAR had lobbied for CSCL to accept PCL’s EOI after the stipulated 31 December 2013 deadline. PCL also provided invaluable information, such as the freight rates of competitors, as well as CSCL’s requirements for the training of local cadets, which enabled PCL to formulate its firm offer to CSCL. Furthermore, SAR consistently lobbied on PCL’s behalf in respect of the tender from January to May 2014. Owing to these efforts, it was submitted that, by the time Sathak came into the picture, PCL was already in a “strong position” to secure the First Contract, and any further steps only went towards finalising the terms of that contract, and the applicable freight rates therein. 34 While SAR seemed to attach significant weight to its allegation that it had successfully lobbied for CSCL to accept PCL’s EOI after the stipulated deadline, the burden was on SAR to establish, as a matter of fact, that (i) PCL’s EOI had been submitted out of time; and (ii) that this was only possible with SAR’s assistance. However, at trial, Raju admitted that the two parties whom he was working with to seek the extension of time werenotin fact in the position to accept PCL’s EOI out of time, and that the only evidence in support of his assertion that he had successfully lobbied for the extension of time was CSCL’s advertisement, which provided that the deadline for submission was 31 December 2013. This was plainly insufficient to meet SAR’s burden of proof, and we therefore find that, from an evidential point of view, SAR’s persistent allegation that it had successfully procured an extension of time on PCL’s behalf was a non-starter. 35 Nonetheless, even if SAR had indeed lobbied for CSCL to accept PCL’s EOI’s after the stipulated deadline, such would not be sufficient to prove that SAR was the effective cause of the First Contract. This is because, on 28 February 2014, PCL’s EOI was opened along with the EOIs ofeightother shipowners, and no contract was entered into with any of the shipowners on that date. Furthermore, whatever information and lobbying services that was provided by SAR, it is evident that such were insufficient to put PCL’s offer firmly ahead of the other offers, such that it was inevitable that PCL would secure the First Contract by May 2014. Indeed, PCL’s initial offer to CSCL was not the most competitive. Also, while SAR asserted that the requirement for training local cadets was of utmost importance, the First Contract that was eventually concluded did not make any provision for the number of training berths, thereby suggesting that the provision for training berths was not as material a factor as SAR sought to portray. SAR’smodusof brokering the CSCL contracts by way of political lobbying was also not followed through with, and was ironically one of the reason that led to PCL terminating the Brokerage Agreement. This was because PCL disapproved of SAR’s lobbying efforts as it did not “like any political interference and prefer[red] to work on commercial terms only.” Hence, by the time the Brokerage Agreement was terminated, PCL was not, as Mr Tan seemed to suggest, working towardsfinalisingan agreement with CSCL. 36 In fact, when SAR was replaced by Sathak, another bidder, one “Mercator”, was also shortlisted and remained in the running for the CSCL contracts. With Sathak’s assistance, PCL sent multiple revised proposals to CSCL, and met with representatives of CSCL on several occasions. The extended negotiations and meetings eventually culminated in the execution of the First Contract on 28 November 2014, some six months after SAR had been replaced. The terms of the First Contract were also quite different from the terms set out in the initial offer which PCL had submitted (with SAR’s assistance) – for instance, the First Contract included the freight rates for nine additional ports of loading, and, as stated, it did not make any provision for the number of sea-cadet training berths, a requirement which SAR asserted to be a key consideration for CSCL. 37 In our judgment, all of these demonstrate that SAR could not possibly have been the effective cause of the First Contract, and the Judge was amply justified in coming to her conclusion that “the matter took a wholly new trajectory” after Sathak’s entry, with the latter playing a “pivotal role” in brokering the contract between CSCL and PCL.",
        "Conclusion": "38 Hence, while we find that there was a binding Brokerage Agreement entered into between the parties subject to the condition subsequent of the formal execution of the Coal Transportation Agreement, we ultimately dismiss SAR’s appeal since the Brokerage Agreement was terminated by mutual consent and the evidence is clear that SAR wasnotthe effective cause of the CSCL contracts. 39 Costs is to follow the event, and we award costs of the appeal in the sum of $40,000 (inclusive of disbursements) to PCL, to be paid out of the security for costs of $40,000 which SAR has paid for the present appeal.  Steven Chong Belinda Ang Saw Ean Quentin LohJudge of Appeal Judge Judge Tan Wen Cheng Adrian and Tan Choon Yuan Delson (August Law Corporation) for the appellant;Chan Tai-Hui, Jason SC, Kek Meng Soon, Kelvin, Oh Jialing, Evangeline and Alisa Toh Qian Wen (Allen & Gledhill LLP) for the respondent."
    }
}