{
    "case_title": "Kardachi, Jason Aleksander vAttorney-General",
    "ncitation": "[2020] SGCA 92",
    "coram": "Woo Bih Li J (delivering the grounds of decision of the court):",
    "sections": {
        "Introduction": "1 The appellant, Mr Jason Aleksander Kardachi, is a restructuring and insolvency professional.1Foot Note 1×Appellant’s Case at para 8.In HC/OS 1282/2018 (“OS 1282”), the appellant applied for leave to act as a director under s 155A(3) of the Companies Act (Cap 50, 2006 Rev Ed). In the alternative, he applied for a declaration that he had not been disqualified as a director under s 155A(1) of the Companies Act. We set out the precise terms of the appellant’s originating summons at [18] below. 2 The respondent, representing the Minister for Finance (“the Minister”), opposed OS 1282. On 8 April 2019, the High Court judge (“the Judge”) dismissed OS 1282. The Judge held that s 155A(1) was triggered on 8 January 2018. Thus, the appellant was disqualified as a director for a five-year period which commenced on 9 January 2018. The Judge also dismissed the appellant’s leave application under s 155A(3). 3 The appellant appealed against the entirety of the Judge’s decision. On 12 August 2020, we dismissed the appeal with brief oral grounds. However, in respect of the date of disqualification, we held that s 155A(1) was not triggered on 8 January 2018. It was instead only triggered on 6 August 2018. As a result, the appellant was disqualified from 7 August 2018. 4 At the hearing of the appeal, we indicated that we would issue detailed grounds in due course given the important legal issues that arose in this case. These issues included the proper construction of s 155A(1) as well as the relevant principles in determining whether leave should be granted under s 155A(3).",
        "The relevant statutory provision": "5 Section 155A of the Companies Act is a provision that came into force on 3 January 2016.2Foot Note 2×Respondent’s Case at para 17.Section 155A states as follows:3Foot Note 3×Appellant’s Bundle of Authorities at Tab 3. Disqualification for being director in not less than 3 companies which were struck off within 5-year period 155A.—(1) Subject to subsection (5), a person — (a) who was a director of a company (Company A) at the time that the name of Company A had been struck off the register under section 344; and (b) who, within a period of 5 years immediately before the date on which the name of Company A was struck off the register under section 344 — (i) had been a director of not less than 2 other companies whose names had been struck off the register under section 344; and (ii) was a director of those companies at the time the names of the companies were so struck off the register, shall not act as director of, or in any way (whether directly or indirectly) take part in or be concerned in the management of, any company or any foreign company to which Division 2 of Part XI applies for a period of 5 years commencing after the date on which the name of Company A was struck off. (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. (3) A person who is subject to a disqualification under subsection (1) may apply to the Court for leave to act as director of, or to take part in or be concerned in the management of, a company or a foreign company to which Division 2 of Part XI applies during the period of disqualification upon giving the Minister not less than 14 days’ notice of his intention to apply for such leave. (4) On the hearing of any application under this section, the Minister may be represented at the hearing and may oppose the granting of the application. (5) This section shall only apply where Company A and the companies referred to in subsection (1)(b)(i) were struck off on or after the date of commencement of section 76 of the Companies (Amendment) Act 2014. 6 At the outset, we note that a person who is disqualified under s 155A(1) is not merely prohibited from acting as a director. He is also not permitted to “take part in or be concerned in the managementof, any company or any foreign company to which Division 2 of Part XI [of the Companies Act] applies”. Accordingly, in these grounds of decision, phrases such as “disqualified as a director” and “leave to act as a director” should be understood as no more than convenient shorthands.",
        "Background facts": "7 The following facts were not in dispute. On 6 September 2010, the appellant was appointed as the Managing Director of Borrelli Walsh Pte Ltd (“Borrelli Walsh”).4Foot Note 4×Appellant’s Core Bundle Vol II(A) at page 16 – Appellant’s 1st affidavit dated 18 October 2018 at para 13.Borrelli Walsh is an international consulting company that specialises in restructuring, insolvency and forensic accounting.5Foot Note 5×Appellant’s Core Bundle Vol II(A) at page 14 – Appellant’s 1st affidavit dated 18 October 2018 at para 5.The appellant is based in its Singapore office.6Foot Note 6×Appellant’s Core Bundle Vol II(A) at page 14 – Appellant’s 1st affidavit dated 18 October 2018 at para 4. 8 In the course of his work as a restructuring and insolvency professional, the appellant would be appointed as a director of distressed or insolvent companies. According to the appellant, this was to ensure that he had control over these companies and unfettered access to their books and records.7Foot Note 7×Appellant’s Core Bundle Vol II(A) at pages 16 and 17 – Appellant’s 1st affidavit dated 18 October 2018 at paras 14 and 15. 9 In 2010, the appellant undertook the task of restructuring an international group of companies known as the Global Brands Group (“GB Group”). In order to “quickly seize control of the assets of the GB Group and minimize the risk of the dissipation of the same”,8Foot Note 8×Appellant’s Case at para 11.the appellant was appointed to the boards of various companies in the GB Group. On 8 November 2010,9Foot Note 9×Record of Appeal Vol III(F) at page 154 – Appellant’s 3rd affidavit dated 1 March 2019 at page 152.the appellant was appointed as a director of the following four companies: (a) Global Brands F&B Pte Ltd (“GB F&B”); (b) Consolidated Brands (Asia) Pte Ltd (“CB Asia”); (c) Global Brands Retail Pte Ltd (“GB Retail”); and (d) Global Brands Holdings Pte Ltd (“GB Holdings”). 10 Subsequently, these four companies were struck off by the Registrar of Companies (“the Registrar”) under s 344 of the Companies Act:10Foot Note 10×Appellant’s Case at paras 2 and 19. S/NName of CompanyDate of Striking Off1GB F&B7 November 20162CB Asia8 January 20183GB Retail8 January 20184GB Holdings6 August 2018 11 As of the dates on which they were struck off, all four companies had failed to lodge their annual returns under s 197 of the Companies Act for at least three years.11Foot Note 11×Appellant’s Bundle of Authorities at Tab 4.This gave the Registrar reasonable cause to believe that they were not carrying on business or were not in operation.12Foot Note 12×Respondent’s Case at para 3.Indeed, there was no dispute that all four companies were insolvent and had ceased business prior to the appellant’s appointment as a director.13Foot Note 13×Appellant’s Core Bundle Vol II(A) at page 24 – Appellant’s 1st affidavit dated 18 October 2018 at para 37. 12 For present purposes, it suffices to note that the appellant contended that there were exculpatory circumstances in respect of his failure to procure the striking off of the four companies under s 344A of the Companies Act before they were struck off by the Registrar.14Foot Note 14×Appellant’s Bundle of Authorities at Tab 6.We will elaborate on these circumstances when we set out our reasons for dismissing the appellant’s leave application at [84]–[96] below. 13 In late August 2018, the appellant was unable to lodge documents electronically through the Accounting and Corporate Regulatory Authority’s (“ACRA”) web portal.15Foot Note 15×Appellant’s Case at para 1.His associate in Borrelli Walsh sought ACRA’s assistance to lodge the documents. On 12 September 2018, ACRA sent an e-mail to the appellant’s associate which stated as follows:16Foot Note 16×Appellant’s Core Bundle Vol II(A) at page 39. … I refer to your email of 12 September 2018. 2 Based on our record, Mr Jason Aleksander Kardachi has been disqualified to be a director. As a consequences [sic] of the disqualification, he will not be able to perform any electronic transactions via Bizfile+ which explains the error message your [sic] encountered. 3 If Mr Jason Aleksander Kardachi wishes to find out more on his disqualification, kindly advise him to write in directly to us. Thank you. … 14 According to the appellant, this was the first time that he had been informed about his purported disqualification.17Foot Note 17×Appellant’s Core Bundle Vol II(A) at page 20 – Appellant’s 1st affidavit dated 18 October 2018 at para 26.This led to a series of correspondence between the appellant and ACRA through e-mail. On 14 September 2018, the appellant wrote to ACRA, seeking to find out “the reason behind [his] disqualification as a director”.18Foot Note 18×Appellant’s Core Bundle Vol II(A) at page 39.ACRA replied on the same day:19Foot Note 19×Appellant’s Core Bundle Vol II(A) at page 38. Dear Mr Jason Kardachi, We refer to your email of 14 September 2018. 2 Our record shows that you are listed on our register as a director of not less than 3 companies that had been struck off by ACRA pursuant to section 344(1) of the Companies Act, Cap. 50 (“the Act”). 3  For your appointment as a director of at least 3 companies that were struck off by the Registrar within 5 years,you have been disqualified pursuant to section 155A of the Act from being a director of any existing company for a period of 5 years from 8 January 2018. During this period of disqualification, you will not be able to perform any electronic transactions via Bizfile+. 4 On your disqualification under section 155A of the Companies Act, Cap. 50 (“CA”), we would advise you to seek legal advice under section 155A(3) CA for an application to the High Court for leave to act as a director of, or to take part in or be concerned in the management of a company. Thank you. … [emphasis added] 15 On 27 September 2018, the appellant requested ACRA to “provide the full name and UEN number of each of the relevant Companies and the dates that they were struck off”.20Foot Note 20×Appellant’s Core Bundle Vol II(A) at page 37. 16 On 2 October 2018,21Foot Note 21×Appellant’s Core Bundle Vol II(A) at page 37.ACRA replied to the appellant as follows:22Foot Note 22×Appellant’s Core Bundle Vol II(A) at page 37. Dear Mr Jason Kardachi, We refer to your email of 27 September 2018. 2 Attached herein is the registered letter sent to you with regard to your disqualification under section 155A of the Companies Act, Cap. 50 (“CA”). The letter contains the names and UEN numbers of the struck off entities which you requested for. Thank you. … 17 We reproduce the letter that was attached by ACRA to its e-mail dated 2 October 2018 (“31 August 2018 Letter”):23Foot Note 23×Appellant’s Core Bundle Vol II(A) at page 44. … DISQUALIFICATION UNDER SECTION 155A OF THE COMPANIES ACT You were listed on our register as a director of the following companies that had been struck off by ACRA pursuant to section 344(1) of the Companies Act:  Name of CompanyUENDate company struck off from the register by the Registrar(i)[GB F&B]200701077E07/11/2016(ii)[CB Asia]200515377E08/01/2018(iii)[GB Retail]200604618M08/01/2018 2. As you were a director of at least 3 companies that were struck off by the Registrar within 5 years,you were thereby disqualified pursuant to section 155A of the Companies Act from being a director of any existing company for a period of 5 years from 08/01/2018. 3. During this period of disqualification, you will not be able to perform any electronic transactions via Bizfile+ as a director. Please also note that if you continue to act as a director of any company or directly or indirectly take part in or be concerned in the management of any company, you can be guilty of an offence that carries a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or both. 4. If you have any queries, you may contact us at ED_ Investigation@acra.gov.sg. Thank you.  Enforcement Department (Investigation) Accounting and Corporate Regulatory Authority  [emphasis added]",
        "OS 1282": "18 In OS 1282, the appellant sought the following relief:24Foot Note 24×ROA Vol II at page 7. 1. That the Honourable Court grant leave for the [appellant] to act as director of, or take part in or be concerned in the management of (i) companies incorporated pursuant to the Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”) (or pursuant to any corresponding previous written law); or (ii) foreign companies to which Division 2 of Part XI of the Companies Act applies. This includes the companies set out in Annex A and all other such companies in the future; 2. That the leave referred to in prayer 1 be effective from 8 January 2018; 3. That alternative to prayer 2, a declaration that the [appellant] has not contravened Section 155A(1) of the Companies Act from 8 January 2018 to the date of the order made herein; and 4. Such further and/or other relief as the Honourable Court deems fit. 19 It is convenient here to make three brief observations. 20 First, through prayer 3, the appellant sought a declaration that he had not contravened s 155A(1) from 8 January 2018. However, assuming that s 155A(1) was triggered on 8 January 2018, the relevant date should have been 9 January 2018 instead, because the five-year disqualification period only commencesafterthe date s 155A(1) is triggered (see [5] above). We note that the same mistake was made by ACRA in its e-mail dated 14 September 2018 and the 31 August 2018 Letter (see [14] and [17] above). 21 Second, the sequence of the prayers was incorrect. The appellant should first have applied for a declaration that he had not been disqualified at all (as opposed to from 8 January 2018), and alternatively for leave to act as a director. However, nothing material turns on this incorrect sequence. 22 Third, prayer 3 was framed in terms of a declaration that the appellant had notcontraveneds 155A(1) from 8 January 2018 to the date of the order made by the court. However, as a matter of drafting, the prayer should simply have stated that the appellant was seeking a declaration that he had not beendisqualifiedunder s 155A(1).",
        "The decision below": "23 As mentioned at [2] above, the Judge dismissed OS 1282. We summarise the Judge’s oral grounds as follows.25Foot Note 25×Appellant’s Core Bundle Vol II(B) at pages 287 and 288. 24 The Judge held that s 155A(1) was triggered on 8 January 2018 when CB Asia and GB Retail were struck off. Although the appellant had only been a director of one other company that was struck off by the Registrar before that date, the Judge declined to apply the ordinary meaning of s 155A(1). Instead, he was of the view that it was appropriate to adopt a rectifying construction of s 155A(1). The Judge explained as follows: I accept that on 8 January 2018, when the second and third companies were struck off, the effect was to disqualify the [appellant] automatically with effect from 9 January 2018. I arrive at that conclusion on the basis that the purpose of s 155A(1) is to disqualify a director automatically if three of his companies are struck off within five years, with such disqualification to take effect after the date of the third striking off. I interpret s 155A(1) purposively, bearing in mind (1) the marginal note or heading; (2) the consequences of the interpretation advanced by the [appellant], which to my mind cannot be what Parliament intended; (3) the extrinsic material which I consider I am permitted to have regard to; and (4) the power which the court has to adopt a rectifying interpretation or rectifying construction in order to give effect to the manifest intention of Parliament. 25 The Judge considered that it was unnecessary to decide whether s 155A(1) was triggered on 6 August 2018 when GB Holdings was struck off. This was because he had already concluded that s 155A(1) was triggered on 8 January 2018, and neither party had asked the court to determine when the appellant’s disqualification period ended. 26 Turning to the leave application, the Judge noted that the appellant had sought retrospectiveleave with effect from his date of disqualification. The Judge considered that the discretion to grant leave “cannot be exercised so as to nullify the automatic disqualification”. The Judge was also of the view that the appellant’s status as a restructuring and insolvency professional did not distinguish his case from that of any other professional fee-earning director.",
        "Issues to be determined": "27 There were three main issues in the appeal before us: (a) First, whether s 155A(1) was triggered on 8 January 2018 when CB Asia and GB Retail were struck off (“Issue 1”). (b) Second, whether s 155A(1) was triggered on 6 August 2018 when GB Holdings was struck off (“Issue 2”). (c) Third, whether the appellant should be granted leave under s 155A(3) (“Issue 3”). 28 We briefly outline the parties’ respective positions on these three issues. 29 On Issue 1, the appellant contended that the Judge had erred in holding that s 155A(1) was triggered on 8 January 2018. The Judge ought to have applied the ordinary meaning of s 155A(1), which required the appellant to have been a director oftwoother companies that were struck off by the Registrarbefore8 January 2018.26Foot Note 26×Appellant’s Submissions at para 5.However, prior to 8 January 2018, the appellant had only been a director ofoneother company that was struck off by the Registrar (see [10] above). Furthermore, the appellant submitted that the Judge had erred in adopting a rectifying construction of s 155A(1) as the relevant test, which is set out at [38] below, was not satisfied.27Foot Note 27×Appellant’s Submissions at para 34. 30 The respondent took the position that it was appropriate for the Judge to adopt a rectifying construction of s 155A(1). The words “immediately before the date” in s 155A(1) should be replaced with the words “ending on the date”.28Foot Note 28×Respondent’s Submissions at para 8(b). 31 With regard to Issue 2, the appellant contended that s 155A(1) was not triggered on 6 August 2018 when the fourth company, GB Holdings, was struck off. In essence, the appellant’s argument was based on the doctrine of substantive legitimate expectations. The appellant highlighted that ACRA’s 31 August 2018 Letter only identified GB F&B, CB Asia and GB Retail as the companies that formed the basis of his disqualification. GB Holdings was not identified at all (see [17] above). Accordingly, there arose the legitimate expectation “that his disqualification would be limited to that which was pronounced by ACRA”.29Foot Note 29×Appellant’s Submissions at para 54(a). Appellant’s Case at para 109.On the contrary, the respondent submitted, the doctrine of substantive legitimate expectations was not recognised under Singapore law and, in any event, was inapplicable in the present case.30Foot Note 30×Respondent’s Case at paras 55 and 56. 32 Finally, as regards Issue 3, the appellant highlighted that there were exculpatory circumstances in respect of his failure to procure the striking off of the four companies.31Foot Note 31×Appellant’s Submissions at para 47.Among other things, he also submitted that given his role as a restructuring and insolvency professional, there was “arguably more room for the Court to cast a benign eye on his role in the administrative lapses” that occurred in the companies that were struck off.32Foot Note 32×Appellant’s Submissions at para 49.On the other hand, the respondent submitted that the Judge’s decision to dismiss the leave application should be affirmed. In applying for leave to act as a director of any company that he may be appointed to, and for such leave to take effect from 8 January 2018, the appellant was essentially seeking to completely negate the application of s 155A(1).33Foot Note 33×Respondent’s Case at para 65.The appellant had not shown any exculpatory or mitigating factors for his failure to prevent the four companies from being struck off by the Registrar.34Foot Note 34×Respondent’s Submissions at para 36.There was also no basis to treat restructuring and insolvency professionals any differently from other directors.35Foot Note 35×Respondent’s Submissions at para 38.",
        "Issue 1: Whether s 155A(1) was triggered on 8 January 2018": "33 We turn to the first issue, namely, whether s 155A(1) was triggered on 8 January 2018 when both CB Asia and GB Retail were struck off by the Registrar.",
        "The ordinary meaning of s 155A(1)": "34 In our judgment, whether or not s 155A(1) was triggered on 8 January 2018 was simply a matter of determining and applying its ordinary meaning. In the present case, our analysis was greatly simplified by the fact that there is no ambiguity or obscurity on the face of s 155A(1). It provides that a person is disqualified from acting as a director for five years if he was a director of a company that was struck off by the Registrar under s 344 of the Companies Act and within a period of five yearsimmediately before that date, was also a director of no fewer thantwoother companies that were similarly struck off. It was clear that the ordinary meaning of s 155A(1) was not manifestly absurd or unreasonable (and we elaborate on this at [47] and [48] below). 35 Accordingly, applying the ordinary meaning of s 155A(1), the provision was not triggered on 8 January 2018 because the appellant had only been a director ofoneother company that was struck off by the Registrar before that date (namely, GB F&B, which was struck off on 7 November 2016).",
        "Whether a rectifying construction should be adopted": "36 Notwithstanding the ordinary meaning of s 155A(1), the Judge considered that it was appropriate to adopt a rectifying construction of the provision (see [24] above). In effect, the Judge replaced the words “immediately before the date” with the words “ending on the date”. That was the construction of s 155A(1) that the respondent sought to uphold on appeal. 37 The doctrine of rectifying construction involves the addition or substitution of words to give effect to Parliament’s manifest intention. It is founded on the basis of rectifying “obvious drafting errors” and “plain cases of drafting mistakes” on the part of the Legislature (seeWong Souk Yee v Attorney-General[2019] 1 SLR 1223at [63], citing Diggory Bailey & Luke Norbury,Bennionon Statutory Interpretation(LexisNexis, 7th Ed, 2017) at pp 425–426). 38 The test to determine whether a rectifying construction should be adopted was summarised by this court inNam Hong Construction &Engineering Pte Ltd v Kori Construction (S) Pte Ltd[2016] 4 SLR 604 (“NamHong”) at [55]:36Foot Note 36×Appellant’s Bundle of Authorities at Tab 22. The test for when the adoption of a rectifying construction is permitted was set out by us inKokChong Weng v Wiener Robert Lorenz[2009] 2 SLR(R) 709 (“KokChong Weng”) at [57] where we adopted the test that was set out by of the House of Lords inWentworth Securities Ltd vJones[1980] AC 74, as refined inInco Europe v First Choice Distribution[2000] 1 WLR 586. Chan Sek Keong CJ, delivering the judgment of the Court of Appeal, held that the following three cumulative conditions had to be adopted before the court would read words into a statute to rectify what it perceived to be an error in legislative drafting (seeKokChong Wengat [57]): (a) first, it was possible to determine from a consideration of the provisions of the Act read as a whole what the mischief was that Parliament sought to remedy with the Act; (b) second, it was apparent that the draftsman and Parliament had by inadvertence overlooked, and so omitted to deal with, the eventuality that was required to be dealt with so that the purpose of the Act could be achieved; and (c) third, it was possible to state with certainty what the additional words would be that the draftsman would have inserted and that Parliament would have approved had their attention been drawn to the omission. 39 On the first condition, it is plain from s 155A itself that the mischief sought to be remedied was that of directors allowing defunct companies to remain on the register and leaving them to be struck off by the Registrar. Instead, directors should either wind up such companies or procure their striking off under s 344A of the Companies Act.37Foot Note 37×Appellant’s Bundle of Authorities at Tab 6.As the respondent submitted, it is undesirable for directors to allow their defunct companies to languish on the register, since this would place an administrative burden on the Registrar.38Foot Note 38×Respondent’s Case at para 23. Respondent’s Submissions at para 10.Indeed, Annex C of the “Consultation on Part Two of Companies (Amendment) Bill 2013” (“Annex C”) states at page 9:39Foot Note 39×Appellant’s Bundle of Authorities at Tab 40. Proposed change [ie, s 155A] complements existing ACRA’s power to strike-off a company on its own initiative.The proposed change is intended to prompt directors of the company to take active stepsto wind-up a defunct company on their own accord.This provision is consistent with section 155, which disqualifies a person from acting as a director if he has committed three or more breaches of not filing documents with ACRA within a period of five years. [emphasis added] 40 Having identified the mischief sought to be remedied by s 155A(1), we turn to the second condition which has to be satisfied before the court can adopt a rectifying construction. In our judgment, this condition was not satisfied. It was not “apparent that the draftsman and Parliament had by inadvertence overlooked, and so omitted to deal with, the eventuality that was required to be dealt with so that the purpose of the Act could be achieved” (seeNam Hongat [55], cited at [38] above). 41 In fact, we considered that it was more likely that the draftsman and Parliament had made a conscious and deliberate decision for s 155A(1)notto apply simply because a person was a director in not less than three companies that were struck off within a five-year period. Otherwise, s 155A(1) could have been worded like s 155(3) of the Companies Act. It should be noted that s 155 was expressly referred to in Annex C (see [39] above).40Foot Note 40×Appellant’s Submissions at para 9.Section 155(3) states as follows:41Foot Note 41×Appellant’s Bundle of Authorities at Tab 2. Disqualification for persistent default in relation to delivery of documents to Registrar 155.— (3) For the purposes of this section, the fact that a person has been persistently in default in relation to relevant requirements of this Act may, subject to subsection (8), be conclusively proved by showing that,within a period of 5 years, he has been adjudged guilty of 3 or more offences in relation to any such requirements or has had 3 or more orders made against him under section 13 or 399 in relation to those requirements. [emphasis added] 42 Accordingly, the way in which s 155A(1) was drafted, when contrasted with s 155(3), suggested that there was no drafting error or mistake. We did not accept the respondent’s submission that the differences in language between the two provisions could be ascribed merely to differences in drafting style.42Foot Note 42×Respondent’s Submissions at para 18. 43 Next, the respondent relied on the following two sources as evidence to support the rectifying construction: (a) First, the heading of s 155A, which reads: “Disqualification for being director in not less than 3 companies which were struck off within 5-year period”.43Foot Note 43×Respondent’s Case at para 27. Respondent’s Submissions at para 16. (b) Second, a sentence in Annex C which is materially similar to the heading of s 155A:44Foot Note 44×Respondent’s Case at para 46. Respondent’s Submissions at para 24. Introduce section 155A, which disqualifies a person from acting as a director, if three or more companies in which he was a director of, are struck off as a result of ACRA-initiated review within a period of five years. 44 The Judge had similarly relied on these two sources in deciding that it was appropriate to adopt a rectifying construction of s 155A(1) (see [24] above). 45 We noted that the Judge and the respondent may have assumed that there was someinconsistencybetween the two sources and s 155A(1). However, on closer examination, the two sources were silent on whether the rectifying construction or the ordinary meaning of s 155A(1) was to be preferred. In substance, both sources simply stated that a person would be disqualified if he was a director in not less than three companies that were struck off by the Registrar within a five-year period. But this did not directly answer the issue before us, namely, whether the first two companies had to be struck off: (a) within a five-year periodimmediately before the datethe third company was struck off; or (b) within a five-year periodending on the datethe third company was struck off. In other words, the two sources were silent on how the five-year period was to be calculatedvis-à-visthe striking off of the three companies. 46  Accordingly, these two sources did not constitute clear evidence of there being a drafting error or mistake that the court should rectify. They were only intended to provide a summary of s 155A(1), and did not encapsulate the precise mechanism through which the provision was designed to operate. As stated by the High Court inEzionHoldings Ltd v Teras Cargo Transport Pte Ltd[2016] 5 SLR 226 at [18], “the title, header or marginal note to a section is not determinative of its contents: it is intended only to summarise the contents of sections for ease of reference, and is not always exhaustive or precise”.45Foot Note 45×Appellant’s Bundle of Authorities at Tab 15. 47 Finally, the respondent also contended that the ordinary meaning of s 155A(1) (which was referred to as the literal construction) “would lead to arbitrary differences that do nothing to promote the legislative purpose of the provision”.46Foot Note 46×Respondent’s Case at para 40.The ordinary meaning would be “manifestly absurd or unreasonable”.47Foot Note 47×Respondent’s Case at para 47.According to the respondent, this was because applying the ordinary meaning of s 155A(1) would result in the following consequences: (a) A director who had three companies struck off by the Registrar would fall afoul of s 155A(1) if the first two companies were struck off on the same day and the third company was struck off on a later day. The respondent referred to this as a “2 plus 1” sequence. However, a director whose companies were struck off in a “1 plus 2” sequence, like the appellant, would not face disqualification.48Foot Note 48×Respondent’s Case at para 41. (b) A director who had 100 companies struck off by the Registrar on the same day would avoid disqualification.49Foot Note 49×Respondent’s Case at para 41. (c) A director who had his second and third companies struck off by the Registrar at 8.00am and 8.00pm on the same day could avoid disqualification under s 155A(1), but a director who had his second and third companies struck off at 8.00pm on one day and 8.00am on the next would fall afoul of the provision.50Foot Note 50×Respondent’s Case at para 42. 48 In our judgment, there was no basis to find that the ordinary meaning of s 155A(1) was manifestly absurd or unreasonable simply because the examples raised by the respondent did not fall within the scope of the provision. Indeed, the appellant suggested that given the adverse consequences arising from disqualification, this would be in keeping with Parliament’s intent for the director to receive two “prompts” or “warnings”beforethe date on which the third company was struck off.51Foot Note 51×Appellant’s Submissions at para 1.If the director did not take steps to prevent a third occurrence, it was only then that he would face the consequences of disqualification under s 155A(1). In the light of this possible explanation as to why s 155A(1) was drafted as it was, there was simply no reason for us to find that its ordinary meaning was manifestly absurd or unreasonable. 49 For completeness, we note that inKokChong Weng and others v Wiener Robert Lorenz and others (Ankerite Pte Ltd, intervener)[2009] 2 SLR(R) 709 andNam Hong([38]supra), the test to determine whether a rectifying construction should be adopted was based on the three cumulative conditions set out by the House of Lords inInco EuropeLtd and others v First Choice Distribution (a firm) and others[2000] 1 WLR 586 (“Inco”).52Foot Note 52×Appellant’s Bundle of Authorities at Tabs 17, 20 and 22.However, inInco, the House of Lords cautioned that the satisfaction of these three conditions does not necessarily mean that a rectifying construction should be adopted. It was stated at 592: … Sometimes, even when these conditions are met, the court may find itself inhibited from interpreting the statutory provision in accordance with what it is satisfied was the underlying intention of Parliament. The alteration in language may be too far-reaching. InWestern Bank Ltd. v. Schindler[1977] Ch. 1, 18, Scarman L.J. observed that theinsertion must not be too big, or too much at variance with the language used by the legislature. Or thesubject matter may call for a strict interpretation of the statutory language, as in penal legislation. … [emphasis added] 50 In the present case, the second condition was not satisfied. Thus, it was unnecessary for us to consider whether these other considerations mentioned inIncoare relevant in determining whether a rectifying construction should be adopted. We leave this question open to be decided on a future occasion.",
        "Issue 2: Whether s 155A(1) was triggered on 6 August 2018": "51 We turn to the second issue, namely, whether s 155A(1) was triggered on 6 August 2018. The appellant did not dispute that a fourth company, GB Holdings, was struck off by the Registrar on that date (see [10] above). It was also beyond dispute that based on the ordinary meaning of s 155A(1), that meant that the appellant was disqualified for a five-year period commencing on 7 August 2018. Indeed, the appellant’s own contention in respect of Issue 1 would mean that he was disqualified for a period commencing on 7 August 2018, instead of 9 January 2018. 52 However, the appellant contended that he was not disqualified from 7 August 2018 because the doctrine of substantive legitimate expectations precluded the respondent from relying on GB Holdings as forming the basis of his disqualification. 53 InSGBStarkstrom Pte Ltd v Commissioner for Labour[2016] 3 SLR 598 (“SGBStarkstrom”), we described the doctrine as follows (at [41]):53Foot Note 53×Appellant’s Bundle of Authorities at Tab 29. … the doctrine of substantive legitimate expectations seeks, in essence, to bind public authorities to representations, whether made by way of an express undertaking or by way of past practice or policy, about how these authorities will exercise their powers or otherwise act in the future, in circumstances where a representation has been made by the authority in question and relied on by the plaintiff to his detriment. … 54 The appellant’s submission was premised on ACRA’s 31 August 2018 Letter (see [17] above). Through this letter, ACRA had allegedly made a representation which “pinned down” GB F&B, CB Asia and GB Retail as the companies that formed the basis of the appellant’s disqualification.54Foot Note 54×Appellant’s Submissions at para 37.There was no reference to GB Holdings. In the circumstances, there arose the legitimate expectation “that his disqualification would be limited to that which was pronounced by ACRA”.55Foot Note 55×Appellant’s Submissions at para 54(a). Appellant’s Case at para 109.According to the appellant, directors “ought to be able to look to ACRA as the administering body of the Companies Act and rely on its declarations as conclusive pronouncements of [their] present rights and liabilities under the law”.56Foot Note 56×Appellant’s Case at para 108. 55 Furthermore, the appellant argued that he did in fact place reliance on the 31 August 2018 Letter. He had informed the companies of which he was a director that he had been disqualified from 8 January 2018. He had also commenced OS 1282 based on the 31 August 2018 Letter.57Foot Note 57×Appellant’s Case at para 107(b).There was detriment because the case he had to meet in the present proceedings was fundamentally altered.58Foot Note 58×Appellant’s Submissions at para 37. 56 As a preliminary issue, we noted that whether or not the doctrine should be recognised in Singapore remains an open question. Although the doctrine was recognised by the High Court inChiu Teng @ Kallang Pte Ltd v Singapore Land Authority[2014] 1 SLR 1047 (“Chiu Teng”),59Foot Note 59×Appellant’s Bundle of Authorities at Tab 13.we decided inSGBStarkstormto neither affirm nor overruleChiu Teng, since it was not necessary for us to decide the issue in that case (at [41]). Nonetheless, we expressed the view that the doctrine would represent a “significant departure from our current understanding of the scope and limits of judicial review” and that the “difficulties inherent in accepting the doctrine … in Singapore should not be underestimated” (at [59] and [60]). 57 Similarly, in the present case, it was not necessary for us to decide the threshold question of whether the doctrine is or should be accepted as part of our law. This is because we were satisfied that it would be of no assistance to the appellant in any event. 58 In essence, the doctrine was inapplicable in the present case. The issue was whether s 155A(1) was triggered on 6 August 2018 when GB Holdings was struck off. This was purely a legal determination that was for the court to make, and not ACRA. The appellant appeared to assume that ACRA had the discretion to decide which companies formed the basis of his disqualification and the relevant disqualification period. However, if the facts before the court showed that s 155A(1) was triggered on the date on which GB Holdings was struck off, such that the appellant was disqualified for five years thereafter, the fact that ACRA failed to mention GB Holdings in the 31 August 2018 Letter would not in any way affect that outcome. 59 As was stated inSGBStarkstromat [42], the doctrine is concerned with “regulating the exercise of executive powers in the administration of executive actions or policies”. For example, inRegina v North and East Devon Health Authority; Ex parte Coughlan[2001] 1 QB 213, referred to inSGBStarkstromat [37], the applicant agreed to move to a nursing home on the health authority’s clear promise that the nursing home would be her home for life. Subsequently, the health authority decided to close down the nursing home. The applicant challenged this decision by way of judicial review, on the ground that she had a legitimate expectation that the nursing home would be her home for life. The English Court of Appeal granted the appellant the substantive relief she sought and ordered the health authority not to close down the nursing home. 60 On the other hand, the doctrine is irrelevant when what is in issue is purely a question of law to be determined by the court based on the relevant statutory provision. 61 In any case, even if the doctrine was applicable in Singapore, and even if we had considered that the doctrine was potentially relevant to the issue of whether s 155A(1) was triggered on 6 August 2018, the appellant would not have satisfied the necessary requirements under the doctrine (seeChiu Teng([56]supra)at [119]). In particular, we did not see how the appellant could havereliedon the 31 August 2018 Letter when he in fact disagreed with the very basis of the letter,ie, that he was disqualified when CB Asia and GB Retail were struck off on 8 January 2018. It was central to the appellant’s case in respect of Issue 1 that ACRA had, in its 31 August 2018 Letter, erred in its assessment of his disqualification and the attendant disqualification period. We did not see how the appellant could then argue, as part of Issue 2, that he had relied on the 31 August 2018 Letter to his detriment, such that any subsequent striking off not stated in the letter should be disregarded by the court. 62 The appellant argued that he had written to the companies of which he was a director to inform them of his purported disqualification from 9 January 2018. However, this point was of no assistance to the appellant. It was not as though the appellant hadacceptedhis purported disqualification and informed the relevant companies that he would cease acting as a director. In fact, it was expressly stated in his letters to the companies that he would becontestingACRA’s assessment by applying to the court for a declaration that he had not contravened s 155A(1).60Foot Note 60×Appellant’s Core Bundle Vol II Part A at page 165. 63 The appellant also submitted that even if we were not inclined to recognise and apply the doctrine, his legitimate expectation of receiving “procedural fairness” should be recognised.61Foot Note 61×Appellant’s Submissions at para 38.As a matter of “procedural fairness”, the respondent should not be permitted to object to OS 1282 on the basis of GB Holdings, when this was not communicated as a basis for the appellant’s disqualification. We did not see how the substance of this submission was any different from that based on the doctrine. 64 Apart from the doctrine of substantive legitimate expectations, counsel for the appellant, Mr Eddee Ng, argued before us that it would be “unfair” to take into account the striking off of GB Holdings on 6 August 2018. This was because prior to that date, the appellant had already been put under the pain of the penalty of offending under s 155A(2) of the Companies Act. Pursuant to s 155A(2), any person who contravenes s 155A(1) is potentially liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding two years or to both (see [5] above). 65 We had difficulty understanding why there would be any question of unfairness. If s 155A(1) prescribed certain consequences upon the occurrence of certain events, the court simply did not have the discretion not to give effect to those consequences. Furthermore, although it would be unsustainable in any event, any question of unfairness would only arise if the appellant had ceasedto act as a director from 9 January 2018 because of the risk that he might be prosecuted for an offence under s 155A(2). However, as stated at [14] above, the appellant did not even know of his purported disqualification until 12 September 2018. 66 Accordingly, we held that s 155A(1) was triggered on 6 August 2018. The appellant was disqualified for a period of five years which commenced on 7 August 2018.",
        "Issue 3: Whether the appellant should be granted leave under s 155A(3)": "67 We turn to the appellant’s leave application under s 155A(3) of the Companies Act: (3) A person who is subject to a disqualification under subsection (1) may apply to the Court for leave to act as director of, or to take part in or be concerned in the management of, a company or a foreign company to which Division 2 of Part XI applies during the period of disqualification upon giving the Minister not less than 14 days’ notice of his intention to apply for such leave.",
        "The applicable framework": "68 We begin by setting out the applicable framework which ought to govern leave applications under s 155A(3). 69 In this regard, it is helpful to refer to the decision of the High Court inBijynaths/o Ram Nawal v Innovationz Pte Ltd (Accounting and Corporate Regulatory Authority, intervener)[2020] 4 SLR 534 (“Bijynath”).62Foot Note 62×Appellant’s Bundle of Authorities at Tab 12.There, the High Court considered that the “predominant factors” to consider for a s 155A(3) application were “the circumstances leading to [the applicant’s] disqualification” and the “likelihood of compliance with the statutory requirements for filings going forward” (at [52]). However, it was not necessary in that case to consider whether the applicant ought to have been granted leave under s 155A(3) as relief was granted under s 344G(3) of the Companies Act instead (at [75]). 70  We agreed with both parties that the factors identified inBijynathwere relevant in a leave application under s 155A(3),63Foot Note 63×Appellant’s Case at para 123. Respondent’s Case at para 62.although we did not regard them as being the “predominant factors”. In our judgment, whether leave should be granted will depend on a holistic assessment of the following considerations. We emphasise that these considerations are not intended to be exhaustive. 71 First, the court should consider the applicant’s capacity for compliance in the future. In the case of defunct companies of which he is a director, the applicant should take steps to wind up these companies or strike them off the register under s 344A of the Companies Act. If, for whatever reason, the applicant is unable to do so, he should ensure that these companies comply with the statutory requirement to file annual returns under s 197 of the Companies Act. He should also ensure that his active companies comply with their filing requirements so that the Registrar would not think that they are defunct companies and proceed to initiate a striking off.64Foot Note 64×Respondent’s Case at para 25. 72 Second, it should be considered whether there were any exculpatory reasons for the applicant’s failure to wind up or procure the striking off of the companies that were struck off by the Registrar. 73 Third, we were also provisionally of the view that, as a general rule, it should be incumbent on an applicant to provide some detail about the specific company or group of companies for which leave is being sought. He should also explain why it is necessary for him to be a director in these companies. The court will then examine whether leave should be granted in respect of each company individually. Save in exceptional cases, leave should not be granted to an applicant who seeks leave to act as a director in any company that he may be appointed to. We refer to this as a “blanket leave application”. 74 While the suggested approach is a provisional view given that we did not have the benefit of full arguments on this point, there are at least three reasons which support it. 75 First, s 155A(3) itself appears to contemplate leave being granted in respect of a specific company or group of companies. Section 155A(3) specifically states that a disqualified director can apply to the court for leave to act as a director of “acompany oraforeign company” [emphasis added]. The plain wording of s 155A(3) does not refer to a blanket leave application and instead suggests that the applicant has to identifythe relevant company or companies. Section 155A(3) also states that the applicant has to give the Minister not less than 14 days’ notice of his intention to apply for leave. This again suggests that he has to identify and give reasons specific to the company or companies for which leave is sought, so that the Minister can decide whether to oppose his application. 76 Second, s 155A(3) does not provide the court with the discretion toreducethe five-year disqualification period. However, that would in effect be the outcome of a successful blanket leave application. Accordingly, the approach that we have suggested would ensure that the court does not undermine the default position set out by Parliament, namely, a five-year disqualification period in respect of all companies. 77 Third, some guidance can be drawn from leave applications under s 154(6) of the Companies Act. Section 154 of the Companies Act provides that a director is disqualified if he is convicted of certain offences. It is well-established that in considering whether leave should be granted under s 154(6), the court may have regard to various factors, one of which is “the structure and the nature of the business of each of the companies which the applicant seeks the leave of the court to become a director of or to take part in its management”. The court may also consider “the interests of the general public, the shareholders, creditors and employees of these companies and the risks to the public and to those persons should the applicant be permitted to be a director or to take part in management” (seeHuang Sheng Changand others v Attorney-General[1983–1984] SLR(R) 182 at [38]).65Foot Note 65×Appellant’s Bundle of Authorities at Tab 16.It appeared to us that these considerations would also be relevant for leave applications under s 155A(3), which would therefore require an examination into the specific companies that the director is seeking leave for. 78 Indeed, in the context of s 155A(3), this approach would be consistent with the decision of the High Court in HC/OS 1342/2018,Re Ronnie Tan Siew Bin.66Foot Note 66×Appellant’s Bundle of Authorities at Tab 36.There, the applicant, a practising advocate and solicitor, was disqualified under s 155A(1). He sought leave to act as a director of nine companies. One of these nine companies was the law firm in which the applicant was the founder and managing director. Leave was granted for the applicant to act as a director in respect of his own law firm, although leave was refused for the remaining eight companies. While there were no written or oral grounds for the High Court’s decision, it is implicit that the approach adopted by the High Court was to consider whether leave should be granted in respect ofeachcompany. It seemed to us that all things being equal, the court would be more inclined to grant leave if the applicant depends on the relevant company for his livelihood, although this would not be determinative of the application.",
        "Whether the appellant should be granted leave": "79 We now explain our reasons for dismissing the appellant’s leave application. The appellant’s leave application was framed in the following terms in the originating summons: 1. That the Honourable Court grant leave for the [appellant] to act as director of, or take part in or be concerned in the management of (i) companies incorporated pursuant to the [Companies Act] (or pursuant to any corresponding previous written law); or (ii) foreign companies to which Division 2 of Part XI of the Companies Act applies. This includes the companies set out in Annex A and all other such companies in the future; 2. That the leave referred to in prayer 1 be effective from 8 January 2018; 80 In the present case, a significant plank of the appellant’s leave application was his explanation for why he did not or could not procure the striking off of the four companies. However, we held that these reasons did not provide a sufficient basis for granting leave. We preface that analysis with some preliminary observations. Preliminary observations 81 First, prayer 1 of the originating summons made clear that the appellant had filed a blanket leave application (see [79] above). In keeping with the framework suggested above, the appellant should have identified the specific company or group of companies that he was seeking leave for. He should have explained why it was necessary for him to be a director in these companies (for example, because he was a key executive involved in day-to-day operations). The court would then examine whether leave could be granted in a way that was limited in scope. 82 Second, we noted that the appellant had set out in Annex A of the originating summons a list of 123 companies, although this was not intended to be an exhaustive list of the companies for which he was seeking leave to be a director of. At the hearing before us, we observed that a significant number of these companies had already been struck off and those companies were reflected as such in Annex A. Mr Ng also confirmed that the appellant did not intend for these struck-off companies to be restored to the register. In the circumstances, it was unclear to us what the purpose of Annex A was. 83 Third, through prayer 2 of the originating summons, the appellant had sought for any leave granted by the court to be effective from 8 January 2018 (see [79] above). In other words, the appellant had soughtretrospectiveleave. It would appear that the purpose for seeking retrospective leave was to regularise acts performed by the appellant as a director notwithstanding his deemed disqualification. In the light of our decision not to grant leave, it was unnecessary to decide whether the court was permitted under s 155A(3) to grant retrospective leave. We therefore leave this issue open for determination on a future occasion. There were no exculpatory circumstances in respect of the appellant’s failure to procure the striking off of the four companies 84 We turn to the reasons provided by the appellant as to why he did not or could not procure the striking off of the four companies.67Foot Note 67×Appellant’s Submissions at para 47. (1) GB F&B 85 According to the appellant, he was content for GB F&B to be struck off by the Registrar because he was under the impression that no action was required on his part. To this end, the appellant relied on a letter sent to him by ACRA on 29 July 2016. The purpose of this letter was to give notice of the Registrar’s intention to strike GB F&B off the register, pursuant to s 344(1) of the Companies Act.68Foot Note 68×Appellant’s Bundle of Authorities at Tab 5.We refer to this as a “Section 344(1) Letter”. The Section 344(1) Letter for GB F&B included the following extract:69Foot Note 69×Appellant’s Core Bundle Vol II(A) at page 47. Action Needed: If your company is still in operation and you would like to keep the company on the register, please:- 1 Submit the ‘Lodgement of an Objection against Striking Off’ via www.bizfile.gov.sg, within 30 days from the date of this letter. 2 Thereafter, file all the outstanding Annual Returns within 60 days from the date of this letter 3 Appoint a new director if there is no local resident director If you do not wish to carry on business and have no objection to the striking off, no action is needed. [emphasis added] 86 As stated at [5] above, s 155A(1) came into force on 3 January 2016. According to the appellant, as of the date he received the Section 344(1) Letter for GB F&B, he was unaware of s 155A(1).70Foot Note 70×Appellant’s Core Bundle Vol II(A) at page 26 – Appellant’s 1st affidavit dated 18 October 2018 at para 42.However, we agreed with the respondent that ACRA was not under a duty to provide legal advice to the appellant on the consequences of a striking off by the Registrar.71Foot Note 71×Respondent’s Case at para 72.Instead, it is incumbent on directors to remain informed about the latest legislative amendments, especially those that pertain to their responsibilities as a director. This appliesa fortiorito professionals such as the appellant who are regularly appointed as directors in the course of their work. As reflected in Annex A of his originating summons, the appellant had been a director of at least 123 companies in Singapore prior to his disqualification. The appellant should have been aware of s 155A, notwithstanding that it was not referred to in the Section 344(1) Letter for GB F&B. 87 That said, we were also of the view that it was potentially misleading for ACRA to have stated that “no action is needed”, especially when there was no reference to s 155A in the letter. In our view, such wording should be avoided by ACRA. Nonetheless, on the facts of this case, there was no prejudice caused to the appellant. This was because the Section 344(1) Letters for CB Asia, GB Retail and GB Holdings all contained references to s 155A(1).72Foot Note 72×Appellant’s Core Bundle Vol II(A) at pages 51, 71 and 72.Thus, the appellant would have been aware of the consequence of the Registrar striking off these companies. The striking off of these three companies alone, without taking into account GB F&B, would have triggered s 155A(1) on 6 August 2018. (2) CB Asia 88 In respect of CB Asia, the appellant instructed his team at Borelli Walsh to strike off CB Asia on 18 April 2016.73Foot Note 73×Appellant’s Case at para 15.The appellant claimed that he was under the impression that his application was successful. He alleged that there was no notification sent by ACRA to inform him that his application had been rejected. 89 The respondent disputed the fact that there was no notification sent by ACRA.74Foot Note 74×Respondent’s Case at para 74.It produced an undated e-mail from ACRA which stated that the appellant’s application to strike off CB Asia had been rejected.75Foot Note 75×ROA Vol III(C) at page 197.However, we noted that there was no indication of the recipient of this e-mail. 90 That said, even if we assumed that no notification was sent by ACRA to the appellant to inform him about his rejected application, on 27 September 2017, ACRA did send a Section 344(1) Letter regarding CB Asia to the appellant .76Foot Note 76×Appellant’s Core Bundle Vol II(A) at page 51.By that time, the appellant ought to have known that his application to strike off CB Asia had been rejected. Otherwise, there would be no need for ACRA to send a Section 344(1) Letter informing the appellant of the Registrar’s intention to strike off CB Asia. At the very least, it ought to have alerted the appellant to inquire about the status of the application. In any event, a notice pursuant to s 344(2) of the Companies Act was also sent to the appellant on 1 November 2017.77Foot Note 77×Appellant’s Core Bundle Vol II(A) at page 167. 91 In the circumstances, there was no merit in the appellant’s argument that he was under the impression that CB Asia had already been struck off. Instead, the evidence before us suggested that he had made insufficient efforts to follow up and check with ACRA about the status of his own application to strike off CB Asia. (3) GB Retail and GB Holdings 92 In so far as GB Retail and GB Holdings were concerned, the appellant claimed that he could not strike these companies off the register because he was unable to obtain a release of the securities that were granted over their assets. 93 To elaborate, both companies had guaranteed debts owed by the GB Group to a third-party creditor. On 27 June 2016, the appellant had requested the third-party creditor to authorise the release of the securities in order to enable him to apply to strike-off GB Retail and GB Holdings “within the month”.78Foot Note 78×Appellant’s Core Bundle Vol II(A) at page 62.However, the letter of authorisation was only executed by the third-party creditor on 5 September 2018,79Foot Note 79×Appellant’s Core Bundle Vol II(A) at page 32 – Appellant’s 1st affidavit dated 18 October 2018 at para 64.after the Registrar had struck off GB Retail and GB Holdings on 8 January 2018 and 6 August 2018 respectively. 94 Nonetheless, in the intervening period, it was incumbent on the appellant to ensure that GB Retail and GB Holdings complied with the basic filing requirements. The companies would not have been struck off by the Registrar had he done so. Indeed, the appellant was aware of his filing responsibilities, as stated in the e-mail dated 27 June 2016 to the third-party creditor:80Foot Note 80×Appellant’s Core Bundle Vol II(A) at page 62. As Director of the GB Entities, I continue to be obligated to perform certain statutory duties such as the holding of Annual General Meetings and submission of Annual Returns to [ACRA]. 95 Furthermore, pursuant to s 344(1) and s 344(2) of the Companies Act, the appellant would have been informed in advance of the Registrar’s intention to strike off the companies. Accordingly, the appellant could and should have informed the Registrar that he was taking steps to get the companies struck off and the intended time frame to do so, so that the Registrar could decide whether to postpone any contemplated action. As noted by the respondent during the hearing before us, it would have taken minimal effort for him to do so. 96 Accordingly, there were no exculpatory circumstances in respect of the appellant’s failure to procure the striking off of the four companies. The appellant’s capacity for compliance 97 The appellant submitted that he had shown a capacity for compliance in the future.81Foot Note 81×Appellant’s Submissions at para 48.By the time of the hearing before the Judge on 8 April 2019, he had caused all but three of 26 companies which had previously failed to file their annual returns to meet their filing requirements. At the time of the hearing before us, two of the three remaining companies had also satisfied their latest filing requirements. 98 However, we agreed with the respondent that while the appellant had taken further steps since his disqualification to demonstrate a capacity for compliance,82Foot Note 82×Respondent’s Case at para 81. Respondent’s Submissions at para 37.this was a basic requirement for any applicant seeking leave under s 155A(3). We were therefore not satisfied that this factor alone warranted granting leave to the appellant. The appellant’s status as a restructuring and insolvency professional 99 The appellant also argued that in considering whether to grant leave, the court should have regard to his status as a restructuring and insolvency professional.83Foot Note 83×Appellant’s Submissions at para 49.He was appointed as a director to restructure and rehabilitate the companies to maximise their shareholder returns. He was not engaged in the day-to-day running of the companies and other operational aspects. Thus, there was more room for the court to cast a “benign eye” on his role in the administrative lapses of the companies which were struck off. 100 We agreed with the respondent that there was no basis to take a more benign view of the circumstances leading to the appellant’s disqualification on account of his role as a restructuring and insolvency professional.84Foot Note 84×Respondent’s Case at para 82. Respondent’s Submissions at para 38.We noted that while the appellant said that he did not seek a “special category of exception” for such professionals,85Foot Note 85×Appellant’s Submissions at para 52.his submissions appeared to suggest that such individuals should be treated differently from other directors,ie, he was using his position as a restructuring and insolvency professional to make a blanket leave application. In our view, such a professional would still have to show why he should be allowed to act as a director with elaboration on the specific company or companies in question and not simply argue that his work requires him to act as a director. 101 In our judgment, the mere fact that the appellant was a restructuring and insolvency professional did not mean that he had any less responsibility as regards the striking off of the four companies, or to ensure that they complied with their filing requirements if he was unable to procure their striking off. In fact, with the exception of GB F&B, the appellant did assume the responsibility of striking off the remaining three companies. In respect of CB Asia, he had asked his team to apply to strike the company off the register (see [88] above). In respect of GB Retail and GB Holdings, he had also requested the third-party creditor to authorise the release of the securities in order to enable him to “apply for their strike-off within the month” (see [93] above). 102 The appellant also argued that if he was granted leave, this would serve the interests of various parties – creditors, employees, and shareholders of the companies that he was appointed to lend his restructuring expertise to.86Foot Note 86×Appellant’s Submissions at para 51.However, the appellant did not identifythese companies. Nor did he elaborate why it was necessary for him to be a director in these companies in order to protect their interests. In short, the appellant did not provide sufficient elaboration to allow us to make the necessary determination. The period of disqualification served by the appellant 103 In support of his leave application, the appellant highlighted that he had “ceased to act as a director of companies upon his disqualification”.87Foot Note 87×Appellant’s Case at para 147(a).Taking the starting date of his disqualification as 9 January 2018, he would already have served a disqualification period of two years and seven months.88Foot Note 88×Appellant’s Submissions at para 53. 104 The respondent contended that this was a belated claim which was not made in the proceedings below. It was common ground then that the appellant had not ceased to act as a director upon his disqualification.89Foot Note 89×Respondent’s Case at para 87.Accordingly, the respondent filed an application to adduce further evidence in CA/SUM 63/2020 to prove that the appellant had continued to act as a director after 9 January 2018. 105 The respondent’s application was granted on 22 June 2020. Among other things, the further evidence showed that the appellant had filed or verified the annual returns of 26 companies between 3 August 2018 and 28 February 2019.90Foot Note 90×Respondent’s Submissions for CA/SUM 63/2020 at para 4(b). Appellant’s Submissions for CA/SUM 63/2020 at para 1.There was therefore no basis for the appellant to have claimed that he had ceased to act as a director upon his purported disqualification. Indeed, as we have already stated, the appellant was unaware of his purported disqualification until 12 September 2018 (see [14] above).91Foot Note 91×Appellant’s Submissions at para 53.Accordingly, we did not give any weight to the appellant’s contention that he had served a disqualification period of two years and seven months. Leave application for Borrelli Walsh 106 Finally, at the hearing before us, Mr Ng urged us to consider granting leave for the appellant to act as a director of Borelli Walsh, in the event that we were to dismiss his blanket leave application. However, this was a change of position on appeal. As we explained to Mr Ng at the hearing, we considered that the proper course was for the appellant to first give notice to the Minister of his intention to specifically apply for leave in respect of Borrelli Walsh. This was a procedural requirement mandated by s 155A(3). Further, the evidence in support of this leave application should be adduced through an affidavit filed by the appellant, rather than by way of submissions from the Bar. To be clear, we do not in these grounds of decision express any view on the merits of such an application.",
        "Conclusion": "107 In the circumstances, we dismissed the appeal. However, we differed from the Judge in respect of the date of disqualification. Since s 155A(1) was not triggered on 8 January 2018, and was only triggered on 6 August 2018, the appellant’s disqualification period commenced on 7 August 2018. 108 On costs, we ordered the appellant to pay the respondent costs fixed at $20,000 inclusive of disbursements. The usual consequential orders applied. Judith Prakash                         Steven Chong                     Woo Bih Li Judge of Appeal                      Judge of Appeal             Judge Ng Ka Luon Eddee, Muhammad Imran bin Abdul Rahim, Cha Meiyin and Yeow Yuet Cheong (Tan Kok Quan Partnership) for the appellant; Joel Chen Zhi’en, Evans Ng, Lim Wei Wen Gordon and Teo Meng Hui Jocelyn (Attorney-General’s Chambers) for the respondent."
    }
}