{
    "case_title": "Low Yin Ni and another vTay Yuan Wei Jaycie (formerly known as Tay Yeng Choo Jessy) and another",
    "ncitation": "[2020] SGCA 58",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the courtex-tempore):",
    "sections": {
        "Introduction": "1 This is an appeal brought by the appellants in relation to the beneficial ownership of a Housing and Development Board flat (“the Flat”). The Flat is legally owned by the parties as joint tenants. The appellants are the parents of the second respondent, while the first respondent is the second respondent’s estranged ex-wife. 2 The Flat was originally purchased by the appellants in 1999, with the respondents being added as legal owners several years later in October 2011. Proceedings were originally commenced by the first respondent to determine the parties’ respective beneficial interests in the Flat in connection with her divorce from the second respondent. The High Court judge (“the Judge”) who heard the matter applied the principles set out by this court inChan Yuen Lan v See Fong Mun[2014] 3 SLR 1048 (“Chan Yuen Lan”), finding that the first respondent was entitled to an 8.11% beneficial interest in the Flat on account of her contributions to its purchase price in October 2011 on the basis of a resulting trust. As for the second respondent, who as noted above, was the son of the appellants, the Judge held that the presumption of advancement operated in his favour on account of the parent-child relationship and as a result, the Judge concluded that the effect of the appellants adding the second respondent as one of the registered proprietors of the Flat was to constitute him a co-owner of the beneficial interest in it in equal shares with them regardless of what his financial contribution was towards its acquisition.  The effect of this was that after taking account of the first respondent’s share, the remaining beneficial ownership in the Flat was found to vest equally in the appellants and the second respondent, giving each of them a 30.63% beneficial interest.",
        "Substance of the appeals": "3 The appellants appeal only against the Judge’s finding that an unrebutted presumption of advancement arose in favour of the second respondent. The main argument advanced before us was that the second respondent’s interest in the Flat should be determined in accordance with his direct contributions to its purchase price, which the Judge found to be 2.44% and which the parties do not dispute. The appellants also advanced a number of alternative arguments, which for reasons that will shortly become apparent, are unnecessary for us to rehearse.",
        "Decision": "4 The main issue in this appeal is whether the Judge was correct to hold that the presumption of advancement operated in favour of the second respondent and if it did, that it had not been rebutted on the facts. In our judgment, the Judge erred in that on the evidence before the court it was clear that the presumption of advancement was amply rebutted. 5 InLau Siew Kim v Yeo Guan Chye Terence and another[2008] 2 SLR(R) 108 at [78], this court noted that the key inquiry when considering the presumption of advancement is in substance directed atdiscerning the presumed intention of the transferor. This is plainly correct. After all where the transferor’s intention has been explicitly articulated there will generally be no room for invoking any presumption in this regard. Hence the presumption operates in circumstances where on the face of the transaction, the transferor appears to have paid for the acquisition of an interest in property in the name of a third party or to have transferred some interest in property to a third party. The law deals with these situations with a pair of presumptive positions. Where there is no relationship between the parties, in general it is presumed that the payer or the transferor, as the case may be, intended to retain the beneficial interest in the property and this is achieved by the device of a presumption of resulting trust. The effect of this is that the transferee or recipient is constituted a trustee of the property for the benefit of the transferor or the payer. But in certain circumstances, in particular where the transaction occurs in the context of certain recognised categories of relationships, one of which is that between parents and their children, the presumption of advancement operates to rebut the presumed resulting trust and it rests on the notion that the parents intended to benefit the child in question by the transaction. This is so because in these categories of cases, parties do often act in line with such a presumptive intention to benefit their children. However, this is no more than a rough and ready guide and is not meant to be approached rigidly. On the contrary this is a flexible doctrine that is designed to guide the court in its ultimate inquiry into just what the parties intended rather than operating as a strict rule. It follows from this that the strength of the presumption will vary based on the prevailing circumstances of the case, with key elements in the inquiry including in particular the nature and state of the relationship between the parties. This makes perfect sense, of course, because if the basis of the presumption is the fact of the relationship, then the state of that relationship will have a bearing on the strength of the presumption and the amount of evidence required to rebut it. Also specific to the parent-child context, the number of children the parent has might be another of the factors which the court will take into account in assessing the strength of the presumption. These are not necessarily meant to constrain the inquiry, which should really be concerned with examining all the surrounding and relevant circumstances. Included among these is the plausibility of the intention to make a gift having regard to the financial status of the parties at the relevant time. 6 Against that backdrop, we turn to the facts before us. At the outset, it may be noted that this case was plagued with certain difficulties because of the way in which it arose and was approached by the parties. The context in which the issue arose was this: the respondents became spouses and then became co-registered proprietors of the Flat which had been acquired by the appellants earlier. When the respondents subsequently embarked on matrimonial proceedings leading to their divorce, it became necessary to determine what if any interest they each had in the Flat. This was relevant at two levels: first, to the extent they each had an interest arising directly from any monetary contribution that they had made, the first respondent was keen to realise her share given the divorce; and second, if either of the respondents otherwise acquired a share, that too could fall to be divided as part of the matrimonial assets in the divorce. Indeed, as counsel for the first respondent, Mr Mohammad Shafiq, candidly accepted before us, his client was seeking to maximise the size of the pool of matrimonial assets for the purposes of the ancillary matrimonial proceedings. In that light, it was significant in our judgment that the second respondent did not participate in the proceedings below. The appellants were therefore principally concerned with meeting the first respondent’s claim to some share in the Flat. Among the positions the appellants took before the Judge was a contention that that they did not know about or remember signing the transfer forms. The Judge rejected this, in our view, correctly. However, the appellants did not also contend, in the alternative, that even if they had agreed to the addition of the respondents as joint owners, they never intended in effect to gift a half share in the Flat to the respondents so that each person’s share in the Flat would thereafter be a quarter, or indeed a third share to their son. Because of their focus on the first respondent’s claims, the appellants’ submissions before the Judge addressed the calculations of the respondents’ alleged financial contributions to the purchase price of the Flat, which was material to the first respondent’s claim that was founded primarily on a resulting trust analysis;1Foot Note 1×Record of Proceedings (“ROP”) Vol 4A, p 30 at para 6.but given the passive role of the second respondent, the appellants never dealt with the application of the presumption of advancement in relation to the second respondent, or indeed what his beneficial ownership in the Flat should be. The Judge might have been assisted if she had considered inviting submissions on these points before ruling on the latter question of the presumption of advancement in favour of the second respondent as she did. In our judgment, this contributed to what we consider was her implausible ruling that left the appellants potentially losing a third of their principal asset to the second respondent and through that potentially some part to the first respondent through the matrimonial proceedings. 7 We turn to the surrounding circumstances, which the Judge did not adequately take into consideration. 8 In this case, it is clear on the evidence that any presumption of advancement in favour of the second respondent at the time he was added as a registered co-owner of the Flat would have been an extremely weak one. In her affidavit at para 13, the second appellant set out some critical background to the marriage between the respondents. Amongst other things, she was unhappy that her son had chosen to marry the second respondent who was a divorcee with two children from a previous marriage to a convicted offender. Her disapproval of the proposed union between the respondent was so vehement that she refused even to attend the registration ceremony of their marriage. In these circumstances, it does not seem to us conceivable that the presumption of advancement could be said to apply such that in adding the respondents as co-registered proprietors, the appellants should be taken to have intended thereby to confer on the second respondent an equal share in the Flat. Mr Mohammad Shafiq submitted that the issue should be approached by reference to what was happening at the time of the transfer. In this case, that took place slightly more than a year after the marriage. The respondents lived with the appellants during that time. We agree that the material time would be the time of the transfer, but it is impossible to read too much into the fact that the parties had all been living together for that brief period. In truth, it seems that they were trying to make the best of a difficult situation. The real question in the end is what was likely to be the operating motive behind the transaction? This leads us to the second critical point. 9 It is a point of importance that aside from the difficulties in the relationship between the appellants and the respondents arising from the concerns they harboured over the first respondent in particular, the appellants’ financial circumstances at the time of the transfer were such that it would not have been consistent with any intention on their part to make a gift of a substantial part of what was in truth their principal asset. From the time of their initial purchase of the Flat in 1999, the appellants had faced persistent difficulties in making payments on the mortgage. These payments were made irregularly and were often missed or insufficient to even cover the interest component of the mortgage. This caused the balance of the mortgage toincreasein the years between 1999 and 2010.2Foot Note 2×Core Bundle Vol 2, pp 145–158.Given these financial realities, we do not see how the appellants could realistically have contemplated making a gift of a quarter or a third of their beneficial interest in the Flat to the second respondent. Rather, it appears to us that what was really happening was precisely as the first respondent claimed in her affidavit: namely that the respondents were added as legal co-owners of the Flat to enable them to use their moneys in the Central Provident Fund to help pay down part of the mortgage because of the appellants’ dire financial straits.3Foot Note 3×Core Bundle Vol 2, p 9 at para 14; p 31 at para 8. 10 For these reasons, we are satisfied that the presumption of advancement in favour of the second respondent was amply rebutted in the circumstances. In the absence of any evidence that the parties are to hold the beneficial interest in a proportion different from their respective contributions to the purchase price, the presumption of resulting trust applies. The appeal is accordingly allowed. We hold that the parties hold their shares in the Flat in accordance with their direct financial contributions as follows: PartyContribution (%)First respondent8.11Second respondent2.44First appellant and second appellant (jointly)89.45 As we have found in favour of the appellants on the main issue, it is unnecessary for us to deal with the remainder of their arguments. 11 We will hear the parties on costs here and below. Sundaresh Menon Chao Hick Tin Quentin LohChief Justice Senior Judge Judge Liaw Jin Poh (Tan, Lee & Choo) for the appellants; Abdul Rahman bin Mohd Hanipah and Mohammad Shafiq bin Haja Maideen (Abdul Rahman Law Corporation) for the first respondent; The second respondent absent and unrepresented.",
        "": ""
    }
}