{
    "case_title": "Lin Jianwei vTung Yu-Lien Margaret and another",
    "ncitation": "[2021] SGCA 67",
    "coram": "Andrew Phang Boon Leong JCA (delivering the grounds of decision of the court):",
    "sections": {
        "Introduction": "1 These grounds concern the latest instalment in the long running feud between Mr Lin Jianwei (“Lin”) and Mdm Tung Yu-Lien Margaret (“Tung”), the only two shareholders and directors of Raffles Town Club Pte Ltd (“RTC”). As we will elaborate upon later, this unfortunate episode takes the form of a tangled and costly procedural mess which serves no one, least of all, RTC. 2 By way of a brief overview, CA/SUM 90/2020 (“SUM 90”) and CA/SUM 91/2020 (“SUM 91”) are Tung’s applications to strike out Lin’s Notices of Appeal in CA/CA 137/2020 (“CA 137”) and CA/CA 140/2020 (“CA 140”), respectively. 3 CA/OS 42/2020 (“OS 42”) is Lin’s application for leave to appeal against the decision of the High Court judge (“the Judge”) in HC/SUM 3929/2020 (“SUM 3929”) or, in the alternative, leave to appeal against the Judge’s decision in HC/SUM 1281/2020 (“SUM 1281”) and the consequent grant of an extension of time (“EOT”) in respect of such leave. 4 CA/SUM 27/2021 (“SUM 27”) is Lin’s application to adduce further evidence in respect of his appeal in CA 137. 5 We heard these cross-applications (“Cross Applications”) on 1 April 2021 and allowed SUM 90 and SUM 91 to strike out the Notices of Appeal in CA 137 and CA 140, respectively, as Lin had filed the notices without first obtaining the requisite leave to appeal. In the light of our decision on SUM 91, we dismissed OS 42 which engaged much of the same issues. As for SUM 27, the question of whether leave ought to be given for Lin to adduce further evidence in SUM 27 for the substantive appeal in CA 137 was rendered nugatory in the light of our decision to strike out the Notice of Appeal for CA 137, and we thus dismissed it as well. We ordered Lin to pay Tung a global sum of $40,000 in costs (all-in) in respect of SUM 90, SUM 91, SUM 27 and OS 42. There were to be the usual consequential orders. 6 We now give the detailed grounds for our decision.",
        "Facts and background": "7 Lin is the Executive Director and Chairman of RTC. He owns 60% of RTC’s shares. Tung is the only other director of RTC and holds the remaining 40% of its shares. RTC did not take an active part in the Cross Applications. 8 The genesis of the Cross Applications can be traced to HC/OS 1446/2018 (“OS 1446”). This was commenced by Lin on 23 November 2018 to: (a) seek a declaration that one Mr Poon Hon Thang (“Mr Poon”) had been validly appointed as a third director of RTC; or, alternatively, (b) seek an order for the court to convene a shareholders’ Extraordinary General Meeting (“EGM”) to effect Mr Poon’s appointment. By way of her reply affidavit dated 18 January 2019, Tung counterclaimed in OS 1446 for orders and declarations that several notices of EGMs and the decisions taken at those EGMs, as well as several notices of board of directors’ meetings and the decisions made at those meetings, were invalid and of no effect. 9 On 11 October 2019, Lin withdrew his claims in OS 1446, leaving only Tung’s counterclaims. OS 1446 is stayed pending the outcome of HC/S 1048/2018 – a suit between Lin and Tung concerning the transfer of shares in RTC and its related companies, as well as certain sums owed between them in relation to RTC’s affairs. 10 A slew of related disputes subsequently arose between Tung and Lin, which resulted in a flurry of applications being filed in court. Unsurprisingly, the parties’ dispute in OS 1446 spawned a tangled procedural tapestry. Before laying out the chronology of these related disputes, it is helpful to provide a map of this tapestry.",
        "Issues to be determined": "27 The following issues arose for our consideration in the Cross Applications: (a) SUM 90: Whether leave to appeal was necessary in respect of CA 137. (b) SUM 91: Whether leave to appeal was necessary in respect of CA 140. (c) OS 42: Whether leave to appeal against the Judge’s decision in the Leave Judgment ought to be granted. (d) SUM 27: Whether leave ought to be granted for Lin to adduce further evidence in respect of CA 137. 28 As we will explain below, OS 42 hinged on the outcome of SUM 91 as it engaged much of the same issues. Similarly, SUM 27 was contingent on Lin being allowed to continue with his putative appeal in CA 137 and thus depended entirely on the outcome of SUM 90.",
        "The parties’ submissions": "",
        "SUM 90": "43 We deal first with our decision to allow SUM 90 as the sole issue therein (ie,whether the only issue in CA 137 relates to costs such that leave to appeal was necessary) also featured in SUM 91. Lin’s counsel for SUM 91 and OS 42, Mr Kenneth Tan SC (“Mr Tan”), confirmed before us that the “main string to [Lin’s] bow” for SUM 91 was that his arguments “[we]re linked to [OS 320]”,ie,that leave to appeal was not necessary in respect of CA 140 as it did not engage para 1(b). He added that his approach on this point was not entirely dissimilar to that adopted by Lin’s counsel for SUM 90, Mr Eugene Singarajah Thuraisingam (“Mr Thuraisingam”). 44 To recapitulate, para 1(b) of the Fifth Schedule to the SCJA provides as follows: 1.  … an appeal may be brought to the Court of Appeal only with the leave of the High Court or the Court of Appeal, in any of the following cases: … (b) where the only issue in the appeal relates to costs or fees for hearing dates; 45 Paragraph 1(b) is familiar territory which had been considered extensively in this court’s decision inKosui, a case which concerned s 34(2)(b), an earlier iteration of the SCJA which is identical to para 1(b). There, the appellant, Kosui Singapore Pte Ltd (“Kosui”), applied to the High Court for leave to tax the solicitor’s bills of the respondent, Mr Thangavelu, pursuant to s 122 of the LPA as more than a year had passed since Kosui had paid Mr Thangavelu. After the High Court judge rejected Kosui’s application, Kosui filed an appeal. Mr Thangavelu subsequently applied to strike out Kosui’s Notice of Appeal on the ground that no leave had been obtained. 46 This court struck out Kosui’s appeal. It made clear that the terms of para 1(b) did not relate to a distinction between substantive and ancillary, or interlocutory matters, but to asubject matterrestriction on the right to appeal. It recognised that Parliament had enacted that appeals on questions of costs may only be made with leave and that “[i]t is irrelevant for this purpose that the decisions affect substantive rights” (seeKosuiat [28]). 47 The court also rejected Kosui’s argument that an application under s 122 of the LPA is distinct from the issue of costs as the provision required consideration of whether special circumstances existed so that leave should be granted to tax Mr Thangavelu’s fees, and reasoned as follows (seeKosuiat [31] and [33]): 31 We did not agree. To accept the appellant’s argument meant that we would be restricting the meaning of the term “only issue … relates to costs” in s 34(2)(b) to the issue of quantum of costs. There is no reason why that term should be limited in this way.When one is considering an issue relating to costs, one can be considering a whole host of matters. For example, whether or not costs should be awarded at all or whether parties should be allowed to argue about costs in a taxation (pers 122 of the LPA) or whether costs should be fixed or whether separate costs orders should be made in respect of separate issues.There are many aspects that may need a court’s attention when it has to decide issues which relate to costs, whether at first instance or on appeal.Further, the application under s 122 of the LPArelates to costs in a fundamental way:unless it is allowed the client will have no way in which to contest the costs levied by his erstwhile solicitor and will be liable for the full amount of the same. … 33  The appellant’s other argument on the meaning of “costs” was that it should be understood as referring to party-and-party costs only and not to solicitor-and-client costs as well. The appellant said that the word ‘costs’ in the sub-section must be read as referring only to costs orders made in relation to proceedings in court. As stated above, in making this argument the appellant cited the Canadian case ofMacKimmie([22] supra). The appellant foundMacKimmieto be instructive on two points. First, the court there stated (at [9]) that because of the discretionary nature of the order of party-and-party costs, the order should be and is only subject to appeal in limited circumstances, with leave, and not as of right. The basis of the rule in the view of the Canadian court was to bring finality to litigation and to conserve the appellate court’s time by screening appeals on issues of costs alone (at [6]). We had no quarrel with this reason for the rule in relation to discretionary costs but did not see how such a justification meant that non- discretionary costs could not be subject to a similar rule for a similar reason. It would be recalled that in 1993, the language in s 34(2)(b) (which was previously s 34(1)(d)) that limited the operation of the section to discretionary costs was deliberately altered so that the word “costs” is not now qualified in any way.Although the 1993Hansard does not contain any specific discussion of this amendment, bearing in mind that Parliament’s intention in this legislation as a whole has always been to assist the efficient working of the Court of Appeal by allowing the screening of certain categories of appeals, it would be hard to argue that Parliament did not intend to widen the scope of the word “costs” when it removed the phrase that had hitherto qualified it and limited it to costs orders made by the court. [emphasis in original in italics; emphasis added in bold italics] 48Kosuimade clear that the words “only issue … relates to costs” should not be interpreted restrictively and would cover a whole host of matters such as whether costs should be awarded, and whether a party should be granted leave to tax its solicitor’s fees pursuant to s 122 of the LPA (at [31]). More fundamentally,Kosui, in our view, had set down the principle that para 1(b) is engaged if thecrucial questions raised in the appeal all ultimately serve to resolve a dispute over costs. 49 In our judgment, the principle laid down inKosuiis logical and entirely aligned with the plain wording of para 1(b). The provision refers to whether the “only issuein the appeal relates to costs” [emphasis added]andnotwhether the issues in the appeal relateonly to costs.As we had explained to the parties during the hearing, the operative words in the provision are “relates to”. As the Judge observed, this indicates that para 1(b) is engaged when the central plank of the appeal focuses on costs, even if there may be tangential issues which do not. There is thus some latitude afforded to the court in assessing whether the issues on appeal bear relation to costs (see the First Judgment at [28]). 50 Turning to SUM 90, it was unclear to us how Lin’s s 216A derivative action in OS 320 (ie,the subject of the appeal in CA 137) could be said to fall outside the scope of para 1(b). While Lin submitted that CA 137 concerned the interpretation of the 4 March 2019 Consent Order as well as disparate inquiries on whether the requirements under s 216A of the Companies Act had been fulfilled (see above at [31]), Lin could not run away from the fact that the s 216A derivative action was ultimately a procedural device to tax the Lawyers’ Fees and the crucial questions raised therein ultimately served to resolve a dispute overcosts– specifically, a dispute over the fixing of the quantum of costs payable by a litigant/client to its own solicitor (seeKosuiat [36]). 51 As we had pointed out to Mr Thuraisingam during the hearing, to view OS 320 in isolation from the rest of the procedural tapestry of the parties’ dispute would be tantamount to saying that Lin was seeking leave to commence a 216A derivative action for the sake of a derivative action. This was circular, senseless and, in fact, an abuse of process. 52 In this connection, CA 137 did not raise any issues concerning the validity of JTJB and N&C’s appointment as solicitors for RTC or their duties. Lin’s concern over the Lawyers’ Fees was simply over their quantum – he did not dispute RTC’s liability in respect of the same. As such, the only issue in CA 137 related to costs asperpara 1(b) and leave to appeal was required but not obtained. We thus allowed SUM 90 and struck out Lin’s Notice of Appeal in respect of CA 137. 53 As for the question of whether special circumstances existed within the meaning of s 122 of the LPA, as well as Lin’s alternative position that s 122 of the LPA did not apply to CA 137, these issues did not arise as leave to appeal was not obtained in the first place.",
        "SUM 91": "54 To recapitulate, SUM 91 was Tung’s application to strike out Lin’s Notice of Appeal in CA 140 in respect of the Judge’s decision in SUM 1281 as contained within the First Judgment. SUM 1281 was Tung’s application for an order that she be reimbursed for the Lawyers’ Fees that she had paid on behalf of RTC. 55 Two sub-issues arose for our consideration in SUM 91: whether leave to appeal was necessary pursuant to either para 1(h) or para 1(b) for CA 140. We answered both question in the affirmative. Whether SUM 1281 was an interlocutory application on which an interlocutory order was made 56 Paragraph 1(h) of the Fifth Schedule to the SCJA provides as follows: 1.  … an appeal may be brought to the Court of Appeal only with the leave of the High Court or the Court of Appeal, in any of the following cases: … (h)  where a Judge makes an order at the hearing of any interlocutory application … 57 InTelecom Credit Inc v Midas United Group Ltd[2019] 1 SLR 131 (“Telecom Credit”), this court reiterated that “order” within the context of what is now para 1(h) refers to an interlocutory order, which is one that does not finally dispose of the rights of the parties (at [19(a)]–[19(b)]). The concept of an “interlocutory order” is separate and distinct from that of an “interlocutory application”. If an application is interlocutory, the court must look further at whether the order is also interlocutory (seeTelecom Creditat [18]). 58 As for the meaning of “interlocutory application”, the court held (at [26]) that: In our judgment, an“interlocutory application” is simply an application whose determination may or may not finally determine the parties’ rights“in the cause of the pending proceedings in which the application is being brought”… That is why it is necessary to look at whether the order which is made on such an application determines the parties’ rights on theBozsontest. … [emphasis in original in italics; emphasis added in bold italics and underlined bold italics] 59 The principle embodied in the first sentence quoted in the preceding paragraph was derived from this court’s earlier judgment inThe “Nasco Gem”[2014] 2 SLR 63 (“TheNasco Gem”) at [16]: In our judgment, an application for a warrant of arrest, whether allowed or denied, does not determine the substantive rights of the parties or the relief claimed in the originating process. The outcome of the application for a warrant of arrest merely determines whether the arresting party will be entitled to arrest the ship and obtain security for its claim. It is clearly an interlocutory application in the admiralty suit. … At this juncture, we think it necessary to refer to the following written submissions of the Applicant which, in our view, are erroneous: In determining whether an application is ‘interlocutory’, emphasis is placed on the relief that is sought; if the sole purpose of the application is the relief sought, then once the application is determined, the entire matter ends there i.e. the subject-matter of the application is spent, then the application is not interlocutory. … With respect, what is wrong with the approach advanced in the Applicant’s submissions is that it focuses on the application instead of the cause in the pending action. The result of the above argument will be that every order made by the court on an application made in a pending action would have to be regarded as final, even in respect of (for example) an order refusing further and better particulars.To determine whether an order made at an interlocutory application is final, the matter must be viewed in the context of the cause in the pending action. To reiterate, it is the cause of the pending proceedings in which the application is being brought which is significant, not the specific purpose of the application. [emphasis in original omitted; emphasis added in italics] 60The Nasco Gemis instructive as it makes clear that the focus is on the cause of the pending proceedings in which the application is being brought, andnotthe specific purpose of the application. 61 In our judgment, SUM 1281 was an interlocutory application which did not finally determine the parties’ rights in the cause of the pending proceedings in OS 1446. 62 SUM 1281 was a summons filed in OS 1446 and was ancillary to the main dispute in OS 1446. As has been noted above at [11]–[16], SUM 4 arose from the parties’ dispute over RTC’s legal representation in OS 1446. SUM 1281, in turn, stemmed from Tung’s application in SUM 4 in which she sought to control the appointment of solicitors for RTC and the 4 March 2019 Consent Order recorded the parties’ compromise in respect of SUM 4. As Tung subsequently paid the Lawyers’ Fees from her own pocket, she sought reimbursement from RTC by way of SUM 1281. Put another way, SUM 1281 was undertaken to facilitate the resolution of further disputes that had arisen in the course of the resolution of the parties’ main dispute in OS 1446. 63 Unsurprisingly, the outcome of SUM 1281 would not affect, let alone dispose of, the parties’ substantive rights in OS 1446. OS 1446 concerns only Tung’s counterclaim for orders and declarations that several notices of EGMs and the decisions taken at those EGMs, as well as several notices of board of directors’ meetings and the decisions taken at those meetings, were invalid and of no effect (see above at [8]). Whether or not Tung succeeded in obtaining reimbursement for the Lawyers’ Fees had no impact on the reliefs sought in OS 1446. 64 Lin’s submissions did not address the above point head on. Instead, he claimed that the focus on OS 1446 was “fallacious” given that the phrase “proceedings in which the application is being brought” might well refer to SUM 4 or OS 320, both of which he characterised as standalone applications. He submitted that SUM 1281 finally determined the parties’ rights in respect of those applications. 65 We were unable to accept either of these arguments. First, SUM 4 could not be considered a “pending proceeding” or a “pending action” within the contemplation of the principle set outinTelecom Creditat [26] andThe Nasco Gemat [16]. For the purposes of this argument, we took Lin’s argument in respect of SUM 4 and the 4 March 2019 Consent Order at its highest and accepted that SUM 1281 concerned the proper construction of the 4 March 2019 Consent Order and would finally determine the scope of Tung’s rights under the said order. The problem here was that SUM 4 was itself an interlocutory application that arose from an ancillary dispute between the parties in the course of their main dispute in OS 1446. SUM 4 was filed by Tung in a bid to control the appointment of solicitors to represent RTC for OS 1446 and its related proceedings (see [11] above). It did not have any relation to any of the reliefs sought in OS 1446. 66 Lin acknowledged that SUM 4 “bears absolutely no relation to the ultimate issue to be determined in OS 1446”. He nonetheless sought to leverage on this to argue that because the issues to be ventilated in SUM 4 would not feature in the substantive hearing of OS 1446, SUM 4 was a “standalone application” which could easily have been presented to the court in the form of an originating summons –ie,a pending proceeding which was finally determined by the determination of SUM 1281. 67 This submission missed the point completely. The issue regarding the appointment of solicitors in SUM 4 was not brought before the court as an application that existed in and of itself. As a matter of logic, solicitors are appointed to represent a client in a dispute. It would be illogical to say that lawyers were appointed to represent parties in SUM 4 for the sole purpose of resolving a dispute on the appointment of lawyers for RTC without explaining the context in which lawyers were necessary for RTC (ie,OS 1446). 68 Second, we found it difficult to see how SUM 1281’s determination could have finally determined the parties’ rights in OS 320. While OS 320 was undoubtedly an originating process, it wasnotthe originating processfor SUM 1281. 69 Lin’s response was that the court should not take a “one-dimensional” view of the factual matrix in the Cross Applications and submitted that “where there are multiple originating processes, … what may be an interlocutory application in one may in fact have the effect of finally determining another originating process”. In his view, SUM 1281 and OS 320 were the classic example of this because “SUM 1281 is [so] intricately enmeshed with OS 320” that “whichever way [the Judge] decided in SUM 1281, it would inevitably finally determine the parties’ rights in OS 320”. 70 Quite apart from the fact that Lin was unable to cite any authority for his proposition, Lin’s claim of intricate enmeshment appeared to us to be grossly exaggerated. While there was an overlap between the two matters in the sense that the fees that Tung sought to be reimbursed for were the fees that Lin sought leave to tax in RTC’s name under s 216A of the Companies Act, the crux of OS 320 was Lin’s unhappiness with thequantumof the Lawyers’ Fees, while the core of SUM 1281 concerned Tung’s personal right to be reimbursed for them entirely. As pointed out by the Judge, a court may well choose to grant OS 320 but simultaneously order RTC to reimburse Tung for the Lawyers’ Fees pending the taxation proceedings (see the Leave Judgment at [96]). 71 Turning finally to the question of whether the Judge’s order in respect of SUM 1281 was an “interlocutory order” within para 1(h), our answer to this was also in the affirmative. SUM 1281 concerned Tung’s right to be reimbursed – this had no impact on the substantive issues raised in OS 1446. Therefore, it was evident to us that the Judge’s order did not dispose of the parties’ substantive rights or the reliefs claimed by Tung in OS 1446. 72 With the foregoing reasons in mind, we thus took the view that leave to appeal in respect of CA 140 was necessary pursuant to para 1(h) given that CA 140 was an appeal against an interlocutory order made in an interlocutory application. Lin’s failure to obtain leave to appeal was fatal and this court did not have the jurisdiction to hear CA 140 (seeTelecom Creditat [3]). We therefore allowed SUM 91 and struck out Lin’s Notice of Appeal in respect of CA 140. Whether the only issue in CA 140 relates to costs 73 Our finding that it was necessary for Lin to obtain leave to appeal for CA 140 pursuant to para 1(h) was sufficient to dispose of SUM 91. Nonetheless, as Mr Tan confirmed before us that the main string in his bow in respect of SUM 91 was that his arguments “[we]re linked to [OS 320]”,ie,that leave to appeal was not necessary in respect of CA 140 as it did not engage para 1(b), we deal with para 1(b) in these grounds as well. This can be done briefly given that Mr Tan’s arguments on this point bore material similarities to Mr Thuraisingam’s arguments in SUM 90 (see above at [43]). 74 Lin submitted that the issues raised in CA 140 did not invariably relate to costs. He gave three examples of these issues: (a) First, CA 140 would involve issues relating to the construction of the 4 March 2019 Consent Order. (b) Second, CA 140 would involve issues relating to Tung’s misconduct and breaches of duties as a director of RTC. (c) Third, CA 140 would involve issues relating to whether Lin could invoke s 216A of the Companies Act to apply for the taxation of the Lawyers’ Fees on RTC’s behalf. Focusing on the last point, Lin argued that even though CA 140 was not an appeal against OS 320, the issues in OS 320 were still relevant to CA 140 because OS 320 was Lin’s defence to SUM 1281; if Lin were unable to pursue OS 320, it would be difficult for him to resist SUM 1281. 75 We refer to these three issues as “Anticipated Issues”. 76 Given our conclusion in SUM 90 that leave to appeal was necessary in respect of the Judge’s decision on OS 320 pursuant to para 1(b) (see above at [50]–[52]), Lin’s third Anticipated Issue worked against him and illustrated that the one of the key issues in CA 140didin fact relate to costs. 77 Lin elaborated on the second Anticipated Issue by stating that Tung’s misconduct and breaches of fiduciary duties owed to RTC consisted “in unilaterally making full payment of [the Lawyers’ Fees] from her personal account without consulting the Board of Directors of RTC”. This, however, was simply a reproduction of one of the sub-issues raised in the context of the construction of the 4 March 2019 Consent Order as follows: Whether [Tung] was entitled to pay the [Lawyers’ Fees] from her own bank account, without first presenting the bills to RTC and its Board of Directors for consideration and review, and simply to seek reimbursement from RTC afterwards. The 4 March [2019 Consent] Order is clearly silent on any express power for [Tung] to do this. 78 Lin’s overarching argument in respect of both the first and second Anticipated Issues was merely that the appeal against the Judge’s decision in SUM 1281 concerned the construction of the 4 March 2019 Consent Order, and as such, the issues in CA 140 did not all relate to costs. This argument, however, was destined to fail. 79 As we had pointed out to Mr Tan during the hearing, even if we accepted that the 4 March 2019 Consent Order did not expressly entitle Tung to payallLawyers’ Fees on behalf of RTC first and subsequently to be reimbursed for them entirely (ie,on the basis that clause 7 of the order simply states that Tung could be reimbursed for N&C’s fees and makes no mention of JTJB’s fees), clause 2 of the order provided expressly that: … RTC will pay for all that law firm’s fees and expenses without requiring … the law firm or [Tung] to produce the instructions from [Tung] … the advice from that law firm or communications, oral or otherwise, between that law firm and [Tung] or anyone on her behalf; This meant that under the 4 March 2019 Consent Order, RTC must pay JTJB’s fees. Given that we had allowed SUM 90 and struck out the Notice of Appeal in CA 137 for leave to commence a s 216A action in RTC’s name to tax the Lawyers’ Fees, there could no longer be any challenge to the quantum of the said fees and RTC would be liable under clauses 2 and 7 for the same. It would then follow that Tung would be entitled to be reimbursed for the fees – not on account of any right under the 4 March 2019 Consent Orderper se,but rather because she had discharged an incurred liability on behalf of RTC. Mr Tan accepted that this was “inexorable logic”. 80 In any event, if Lin was truly so concerned about what he perceived as Tung’s misconduct and breaches of fiduciary duties in respect of the Lawyers’ Fees, the proper course would have been for Lin to pursue an action in RTC’s name against Tung for breach of directors’ duties rather an action for taxation (see the Leave Judgment at [71], repeating an observation made by the Judge in the First Judgment at [20]). We go further to say that as Lin’s “position [was] that [Tung] had deliberately concealed [the Lawyers’ Fees], and only presented them to RTC long after she had already paid them”, an action for taxation would have been the most ineffectual and roundabout manner of vindicating this alleged wrong. It served only to further entangle the strands in the already messy tapestry of disputes between Lin and Tung.",
        "OS 42": "81 During the hearing, we dismissed OS 42 on the basis that it engaged much of the same issues raised in SUM 91 and would necessarily fail in the light of our decision to allow SUM 91. Nonetheless, given that OS 42 was responsible for much of the procedural untidiness and legal complexity in the Cross Applications, we take some time to unravel its tangled threads. 82 At its core, OS 42 stemmed from Lin’s dissatisfaction with the Judge’s order in SUM 1281 for Tung to be reimbursed in respect of the Lawyers’ Fees. However, Lin did not file a leave to appeal application against the Judge’s decision in SUM 1281 (ie,against the First Judgment). Instead, he filed OS 42 as a leave to appeal application against the Judge’s decision in SUM 3929 (ie,against the Leave Judgment). This failure to follow the proper processes of the court generated a very convoluted procedural situation because Lin was, in substance and in effect, bringing a leave to appeal application against a leave to appeal decision (ie,the Leave Judgment) with the ultimate aim of circumventing or regularising the jurisdictional deficit caused by Lin’s failure to apply for leave to appeal against the First Judgment. We return to this point at [106] below. 83 To understand OS 42, it is necessary to have regard to the two main reliefs sought by Lin: 1. That leave be granted to the Applicant to bring an appeal to the Honourable Court of Appealagainst the decision of the [Judge] given on 26October 2020 in HC/SUM 3929/2020of HC/OS 1446/2018 in respect of Prayer 1 of the said summons. That iswhere the [Judge] refused to grant a declaration that the Applicant does not require leave of the court to bring an appeal to the Court of Appeal against the orders of the [Judge] made on 27July 2020 in HC/SUM 1281/2020[ie,in the First Judgment]. 2. That the Applicant be granted an extension of time to apply for leave to bring an appeal to the Honourable Court of Appeal against the orders of the [Judge] made on 27 July 2020 in HC/SUM 1281/2020 [ie,in the First Judgment], andleave be so granted to bring an appeal to the Honourable Court of Appeal against the 27July Orders. [emphasis added] 84 Prayer 1 of OS 42 was an application for leave to appeal against the Judge’s decision in SUM 3929 (as contained in the Leave Judgment), while Prayer 2 was anapplication for leave to appeal against the Judge’s decision inSUM 1281(as contained in the First Judgment) including the requisite EOT to apply for leave to do so. Crucially, SUM 3929 was itself an application for a declaration thatleave to appeal in respect ofSUM 1281 was not necessary.OS 42 was thus an application to the Court of Appeal for leave to appeal against a decision of the Judge which concerned an application for leave to appeal against an earlier decision of the Judge. Whether leave ought to be granted for Lin to appeal against the Judge’s decision in SUM 3929 85 It is well settled that for leave to appeal to be granted, there must be: (a) aprima faciecase of error; (b) a question of general principle decided for the first time; or (c) a question of importance upon which further argument and a decision of a higher tribunal would be to the public advantage (seeLee Kuan Yew v Tang Liang Hong and another[1997] 2 SLR(R) 862 at [16]). 86 In our view, there was no reason for this court to grant leave to Lin to appeal against the Judge’s decision in SUM 3929 (ie,Prayer 1 of OS 42). The Judge’s refusal to grant a declaration that Lin did not require leave to bring an appeal against the Judge’s decision in SUM 1281 (ie,that leave to appeal in respect of SUM 1281 is necessary) is entirely consistent with our decision on SUM 91 above. Further, any questions raised in the course of determining whether leave was required in respect of the Judge’s decision in SUM 1281 would already have been raised in the context of SUM 91, and as seen from our discussion of SUM 91 above, involved only the application of established principles regarding para 1(b) and para 1(h). There was thus no question of general principle or importance that warranted the grant of leave. Whether an EOT ought to be granted for Lin to apply for leave to appeal against the Judge’s decision in SUM 1281 87 As for whether Lin ought to be granted leave to appeal against the Judge’s decision in SUM 1281 (ie,Prayer 2 of OS 42), Lin must first cross the hurdle of obtaining an EOT to file for leave. 88 In our judgment, Lin was not entitled to any EOT. Lin filed SUM 3929 36 days after the deadline to do so. Lin’s sole explanation for the delay was that there was “a bona fide mistake borne out of complexity in applying the relevant legal principles to the present facts”. Lin also explained that he was apprehensive of taking out an application for a declaration that no leave to appeal was required (and had hence delayed in filing SUM 3929) as he had paid heed to the High Court’s admonishment inThe“Xin Chang Shu”[2016] 3 SLR 1195 (“TheXin Chang Shu”) at [9] that an application for a declaration that leave to appeal is not required should only be made “if there isgenuineuncertainty” [emphasis in original]. 89 We were unable to accept this argument. A 36-day delay is not insubstantial, and in so far as Lin was arguing that his failure to file for leave was a “bona fidemistake” and hence an oversight on his part as well as of his solicitors, the law is clear that a mere assertion that that there has been an oversight is “obviously insufficient” to justify an EOT (seeLeeHsien Loong v Singapore Democratic Party and others and another suit[2008] 1 SLR(R) 757 at [22]). 90 Lin’s reference toTheXin Shu Changin fact supported Tung’s case. If, the application of the relevant legal principles was of such complexity as Lin contended (see above at [88]), the appropriate course of action for Lin was to have expeditiously sought a declaration from the Judge that leave to appeal was not necessary, and not wait 36 days to do so. As explained by Steven Chong J (as he then was) at [9] ofThe Xin Chang Shu: … [the Court of Appeal] suggested that in an appropriate case, where there is uncertainty over whether leave to appeal is required, the proper approach is for the appellant to seek a declaration from the judge that it does not need leave to appeal (at [57]). I should mention that it is implicit in the suggestion by the Court of Appeal that any application to seek clarification from the judge should be made in good time.Certainly, the application should be made within the seven-day deadline stipulated under O56 r 3(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”)for the appellant to apply for leave to appeal, if required. The same application should also include a fall back prayer seeking leave to appeal, so as to avoid a situation where the appellant finds itself with insufficient time to apply for leave if the court finds that such leave is required.Such an application should only be made if there isgenuineuncertainty.… [emphasis in original in italics; emphasis added in bold italics] 91 Having regard to Lin’s arguments across the tapestry of the Cross-Applications, it appeared to us that ifLin’s averments as to hisapprehension in bringing an application for a declaration and his account of the facts in the lead up to SUM 3929 and OS 42 were to be taken at face-value and believed, this was a case involving “genuine uncertainty” as to whether leave to appeal was required. 92 First, in SUM 91, Lin sought to advance a position that SUM 1281 was not an interlocutory application within para 1(h) as SUM 1281 finally determined the parties’ rights in OS 320. To get around the fact that SUM 1281 had been filed in OS 1446 andnotOS 320,Lin argued that it would be wrong to take a “one-dimensional” view of the factual matrix in the present case and focus only on OS 1446 as the entire tapestry was made up of multiple originating processes. Lin was unable to cite any authority for this proposition. In fact, he explicitly stated that the “[j]udgments dealing with [para 1(h)] do not deal with factual matrices such as ours”. In other words, Lin and/or his solicitors were aware that their success in arguing that leave to appeal was not necessary in respect of the Judge’s decision in SUM 1281 hinged on the court first accepting anovel proposition of lawthat was unsupported by the existing (and established) case law on para 1(h). There would thus have been clear uncertainty as to whether leave to appeal was required. 93 Second, the issue of whether leave to appeal was necessary surfaced almost immediately after the Judge handed down his decision in SUM 1281. When Lin’s counsel applied to stay the Judge’s order in SUM 1281, counsel for Tung, Mr Davinder Singh SC, immediately pointed out that “insofar as [SUM 1281] is concerned, he will need leave to appeal…there is no automatic right of appeal … [a]nd there is no application for leave to appeal before [the Judge]”. Lin and his solicitors had thus been alerted to the fact that the question of whether leave to appeal was necessary for SUM 1281 might become a contested issue between the parties (see the Leave Judgment at [54]). The “uncertainty” had thus been apparent from the very beginning of the seven day deadline to file for leave to appeal against SUM 1281, and not merely when Tung filed SUM 91 to strike out the Notice of Appeal in CA 140 on 27 August 2020. 94 In the circumstances, if Lin had truly found that there was no uncertainty as “the present factual matrix strongly [militated] towards the conclusion that leave is not required to appeal from the [SUM 1281] Orders”, he should have applied for a declaration that leave to appeal was not required expeditiously (seeTheXin Chang Shuat [9]). As the Judge eloquently put it (see the Leave Judgment at [55]): … [Lin] cannot have his cake and eat it too; he cannot contend that the facts and/or legal principles were so complex that abona fidemistake was justifiably made, yet not complex enough to warrant an application for a declaration that leave was not required. … 95 Bearing the above in mind, we thus declined to grant Lin’s request for an EOT in Prayer 2 of OS 42. The delay was substantial and the reason put forth by Lin for delay was unsatisfactory. Whether leave to appeal ought to be granted to Lin 96 In any case, even if we were inclined to grant an EOT for Lin to seek leave to appeal, we would not have granted such leave. 97 The firstprima facieerror of law identified by Lin (see [41(a)(i)] above), amounted to an allegation that the Judge wrongly interpreted the 4 March 2019 Consent Order, in particular, its meaning and scope. However, this is not an error of law as such and leave ought not be granted when this was a mere question of fact to be considered (see the decision of this court inIW v IX[2006] 1 SLR(R) 135 at [20]) 98 The secondprima facieerror of law identified by Lin (see [41(a)(ii)] above) related to the Judge’s alleged finding that Lin’s conduct of both OS 320 and SUM 1281 lacked good faith. This was not a fair reflection of the Judge’s reasoning. The issue of good faith was only relevant to OS 320 since it is one of the statutory prerequisites under s 216A of the Companies Act, and it cannot therefore be said to be an error of law in relation to SUM 1281. 99 The third set of errors of law identified by Lin consisted in the questions under s 122 of the LPA which are also said to be questions of general principle being decided for the first time or questions of importance (see [41(a)(iii)] and [41(b)] above). However, these questions turn on the continued existence of OS 320, as issues under s 122 LPA can only remain relevant if the fees sought are to be taxed, and the only way taxation of the fees can be sought in the present case is if Lin obtains leave to commence a derivative action. OS 320 was, however, dismissed on a threshold question of fact – namely, the Judge’s finding that the evidence did not show that Lin was acting in good faith (see the First Judgment at [8]–[13]). There is currently no prospect of Lin being able to challenge this finding of fact given our decision to allow SUM 90. The questions with regard to s 122 of the LPA are thus academic and there is no reason to grant leave to pursue these questions. 100 We therefore found that there was no reason to grant Prayer 2 of OS 42.",
        "Our decision": "",
        "SUM 27": "101 In SUM 27, Lin sought to adduce further evidence in respect of his substantive appeal in CA 137. This took the form of an affidavit by one Mr Teo Chee Seng dated 5 March 2021 and was meant to show that the Lawyers’ Fees were “indeed unreasonable and excessive” so as to bolster Lin’s case in CA 137. 102 Following from our decision to strike out Lin’s Notice of Appeal for CA 137 in SUM 90, the question of whether leave ought to be given for Lin to adduce further evidence in SUM 27 for the substantive appeal in CA 137 became nugatory. We thus dismissed SUM 27.",
        "Our observations on OS 42 and SUM 3929": "103 Having analysed and set out the entire procedural tapestry of Lin’s and Tung’s disputes therein, it was clear to us that OS 42 and SUM 3929 constituted egregious abuses of the process of this court. 104 OS 42 stemmed from SUM 3929 which appeared to us to be a backdoor method to circumvent and defeat Tung’s application in SUM 91 to strike out the Notice of Appeal in CA 140. SUM 3929 was filed on 11 September 2020, a mere 15 days after Tung filed SUM 91 and a day after Lin filed his affidavit (“Lin’s SUM 91 Affidavit”) in response to Tung’s account of facts in SUM 91. Pertinently, Lin’s SUM 91 Affidavit was almost identical to his supporting affidavit for SUM 3929 (“Lin’s SUM 3929 Affidavit”). This may have been explicable in respect of the common background facts leading to the parties’ disputes (see Lin’s SUM 3929 Affidavit and Lin’s SUM 91 Affidavit at paras 7–94, and in particular para 94(d) which even contains the same grammatical error). However, even the substantive sections of the affidavits, namely, the section titled “Circumstances leading to [SUM 3929]” in Lin’s SUM 3929 Affidavit at paras 95–99 and the section titled “[Tung’s] Application to strike out my Notice of Appeal filed in CA 140 is without merit” in Lin’s SUM 91 Affidavit at paras 95–101), were almost identical. 105 The fact that Lin sought leave at para 100 of his SUM 91 Affidavit to refer to the matters referred to therein for the purposes of SUM 3929 buttressed our point above. This is because it demonstrated that SUM 3929 was filed with SUM 91 in mind since, in Lin’s view, the facts which grounded hiscounterargumentsagainst Tung in SUM 91 could simply be ported over to SUM 3929. While there is authority that a party is entitled to (and in fact, encouraged to) seek a declaration that leave is not required in a particular matter (seeThe Xin Chang Shuat [9]), “[s]uch an application should only be made if there isgenuineuncertainty” [emphasis in original] and should be made expeditiously. It is not meant as a procedural weapon to stymie an opposing party’s striking out application in a bid toex-post factoremedy one’s own mistake in failing to seek leave to appeal. SUM 3929 was thus an abuse of process of court. 106 OS 42 was couched as an application for leave to appeal against a first instance decision of the Judge on a summons in line with the two-tier system for obtaining leave to appeal under s 34(2) of the SCJA. However, as we have made clear above, OS 42 was, in substance and in effect, an application for leave to appeal against a leave to appeal decision (see above at [82]) with the ultimate aim of circumventing or regularising the jurisdictional deficit in CA 140. As a result of this, most of the issues raised in OS 42 had already been dealt with in SUM 91 and were essentially being relitigated in OS 42. This being the case, OS 42 amounted to a blatant attempt to bring an appeal against a decision of the Judge not to grant leave to appeal. This was akin to the abuse of process contemplated inThe Xin Chang Shuat [49]: … The proper procedure to be followed, after the High Court refuses leave, is for the appellant to bring asubsequent applicationto the Court of Appeal as clearly set out in O 57 r 2A of the [Rules of Court]. … Thus if an appellant ignores the procedure laid down in O 57 r 2A of the ROC and instead attempts to bring an appeal against the refusal of the High Court to grant leave, this would amount to an abuse of process. [emphasis in original] As we had pointed out to the parties during the hearing, the laws of civil procedure are intended to ensure the smoothness of proceedings and to facilitate efficient case management rather than to obfuscate matters. Lin’s misuse of the court’s processes have led to the opposite outcome as it has generated a garbled mess of tangled proceedings for matters which simply relate to costs. SUM 3929 and OS 42 were thus entirely ill-advised.",
        "Conclusion": "107 Bearing in mind the foregoing, we allowed SUM 90 and SUM 91 and struck out Lin’s Notices of Appeal for CA 137 and CA 140. We dismissed OS 42 as it engaged much of the same issues raised in CA 140, and SUM 27 on the basis that the putative appeal in CA 137 could no longer proceed. 108 We conclude by returning to where we first began. Surveying the tapestry of the parties’ disputes as a whole, it was evident to us that the Cross Applications and their underlying applications (ie,OS 320, SUM 1281 and SUM 3929) were borne out of the parties’ personal disputes but were brought under the guise of safeguarding RTC’s interest. Lin claimed that he had filed OS 320 because the Lawyers’ Fees were unreasonable, disproportionate and/or extortionate. However, in filing OS 320 and the consequent matters flowing from it (ie,CA 137, SUM 90, and to a certain extent, SUM 27), Lin incurred personal legal fees that are certainly far in excess of whatever savings could be gained from taxation proceedings. As we have stated above at [80], if Lin was truly so concerned that there had been breaches of fiduciary duties and misconduct on Tung’s part, the proper way forward was to commence a statutory derivative action in RTC’s name for those breaches. This entire process was the most inefficient and roundabout way to deal with what was essentially a dispute over costs. 109 This needless and costly dispute was even more incredible when one considers that the Lawyers’ Fees were incurred and paid pursuant to aconsentorderwhich expressly stated that: (a) Tung was authorised to give instructions to RTC; (b) Tung was entitled to be reimbursed for a portion of the Lawyers’ Fees incurred by N&C and (c) RTC would pay for the fees of whichever law firm was picked by Tung without requesting for any of Tung’s instructions to the firm, or the advice produced by it. While Tung cannot be said to be entirely blameless in these disputes, she was forced to incur legal costs in filing SUM 1281 to safeguard her right to be reimbursed for the fees (a mere day after Lin had filed OS 320) and two striking out applications in SUM 90 and SUM 91. At the end of the day, the ultimate outcome of our decision on the Cross Applications was that Lin is to reimburse Tung for the Lawyers’ Fees which were incurred pursuant to the 4 March 2019 Consent Order. The parties return to square one and no one has received an iota of benefit, least of all RTC. Andrew Phang Boon LeongJustice of the Court of AppealSteven ChongJustice of the Court of AppealBelinda Ang Saw EanJudge of the Appellate Division Eugene Singarajah Thuraisingam, Chooi Jing Yen and Joel Wong En Jie (Eugene Thuraisingam LLP) for the appellant in CA/CA 137/2020; Kenneth Tan SC (Kenneth Tan Partnership) (instructed), Eng Zixuan Edmund, Tham Wei Chern, Brinden Anandakumar, Danica Gan Fang Ling and Chang Chee Jun (Fullerton Law Chambers LLC) for the appellant in CA/CA 140/2020 and applicant in CA/OS 42/2020; Davinder Singh s/o Amar Singh SC, Cheryl Tan Siew Wei, Pardeep Singh Khosa, Tan Mao Lin, Kenneth Koh Tze Wei and Chua Shu Yuan Delvin (Davinder Singh Chambers LLC) for the first respondent; The second respondent absent."
    }
}