{
    "case_title": "Ang Jian Sheng Jonathan and anothervLyu Yan",
    "ncitation": "[2021] SGCA 12",
    "coram": "Andrew Phang Boon Leong JCA (delivering the judgment of the courtex tempore):",
    "sections": {
        "Introduction and background": "1 The respondent (“Lyu Yan”) was a private bank customer of BNP Paribas Singapore (“BNP”). She wanted to remit money from her China bank accounts to her Singapore bank accounts. Her BNP relationship manager referred her to the first defendant in the suit below (“Joseph”) to help with the remittance. 2 In September 2018, Lyu Yan instructed Joseph that she wished to transfer the equivalent of US$3m in RMB from her Chinese bank account to her Singapore bank account with Credit Suisse (“the First Transaction”). For the First Transaction, Joseph used a licensed Indonesian remittance company. Lyu Yan transferred money from her China bank accounts to other China bank accounts nominated by Joseph (who, in turn, obtained them from the Indonesian remittance company). She subsequently received the equivalent amount in US Dollars in her Singapore Credit Suisse bank account from a Hong Kong bank account. 3 In October 2018, Lyu Yan engaged Joseph for another remittance (“the Second Transaction”), which forms the subject of this appeal. On 16 October 2018, she agreed to engage Joseph’s services to convert RMB21,075,000 to US$3m at an exchange rate of USD1 = RMB7.025, and to remit the funds in USD from her China bank account with China Merchant Bank to her Singapore bank account with BNP (“the Agreement”). For the Second Transaction, Joseph enlisted the help of the second and third defendants in the suit below (“Jonathan” and “Derek”, respectively), who are the first and second appellants in this appeal. 4 Later the same day, Lyu Yan transferred money from her China bank accounts to various China bank accounts nominated by Joseph (who, in turn, obtained the accounts from Jonathan and Derek). Jonathan and Derek transferred all the money away between 17 October 2018 and 18 October 2018. The money disappeared. Lyu Yan chased Joseph for the money, who in turn chased Jonathan and Derek. Derek eventually told Joseph on 18 October 2018 that his counterparty was one “Allan”, and added Joseph to a WhatsApp group chat called “Fast Remittance” with himself, Allan and Jonathan. In that group chat, Allan purported to give various assurances that he would make the transfers, but stopped replying on 22 October 2018.",
        "Proceedings below": "5 Lyu Yan commenced proceedings against Joseph, Jonathan and Derek. Her claims against Jonathan and Derek based on the torts of conspiracy and negligence, as well as unjust enrichment were allowed by the Judge. Specifically against Joseph, Lyu Yan had a further claim in contract pursuant to the Agreement as well as for misrepresentation. It should also be noted that there was a claim for breach of fiduciary duties against all the defendants which was dismissed by the Judge. 6 Jonathan and Derek’s factual defence was that they had passed Lyu Yan’s money to Allan, who had absconded. Their legal defence was that the rule in the English Court of Appeal decision ofFoster v Driscoll[1929] 1 KB 470 (“Foster v Driscoll”) operated to bar Lyu Yan’s claims. 7 The High Court Judge (“the Judge”) found that Allan did not exist, and that the rule inFoster v Driscolldid not assist Jonathan and Derek (seeLyu Yan v Lim Tien Chiang[2020] SGHC 145). He allowed Lyu Yan’s claims against Jonathan and Derek in conspiracy, negligence and unjust enrichment. Dissatisfied, Jonathan and Derek appealed (the Judge also found Joseph liable for breach of contract and in negligence as well as unjust enrichment, albeit not in conspiracy or for misrepresentation, but there has been no appeal by him).",
        "Issues on appeal": "8 Jonathan and Derek make substantially the same arguments as those made before the Judge: (a) First, that Allan exists, and it is Allan who defrauded Lyu Yan of her money instead of them; and (b) Second, that the rule inFoster v Driscollis engaged to defeat all of Lyu Yan’s non-contractual claims against them. 9 The Judge was not persuaded by their arguments, and neither are we. Let us elaborate.",
        "Whether Allan exists": "10 At the outset, we note that it is Jonathan and Derek who bear the burden of proving that Allan exists. We say so for two reasons: (a) First, the admitted facts are that Lyu Yan gave Jonathan and Derek her money, and that the money disappeared. Based on these facts alone, it must follow as a starting point that Jonathan and Derek had absconded with the money unless they can displace this conclusion in some way. As a corollary, Allan’s existence is necessary to show that Jonathan and Derek did not in fact misappropriate the money. In other words, Allan’s existence is thematerial factpleaded by Jonathan and Derek in order to establish their defence. Since he who asserts must prove, it is clearly Jonathan and Derek’s burden to show that Allan exists (see the decision of this court inSCT Technologies Pte Ltd v Western Copper Co Ltd[2015] SGCA 71 at [17]). (b) Second, should the burden of proof fall on Lyu Yan, she would have the unenviable (if not nearly impossible task) of proving a negative,ie, that Allan does not exist. 11 Having established that the burden of proof lies with Jonathan and Derek, it must follow that this burden has not been discharged. Their case, both at first instance and on appeal, is limited to justifying theirlackof evidence. Even if their justifications pass muster, those cannot, in and of themselves, constitute a basis for this court to assume that Allan exists.Positiveevidence is required. However, Allan’s contact number could not be reached, and messages coming from Allan could have been sent by anyone. It follows that there is nopositiveevidence of Allan’s existence, and all Jonathan and Derek have is a bare assertion. That cannot suffice to discharge their burden of proof. 12 In any event, we are not persuaded that the explanations given for the lack of evidence pass muster: (a) They claim that they destroyed their correspondence with Allan for fear of prosecution from Chinese authorities. However, theydidsend Joseph screenshots of WhatsApp messages purportedly from Allan instructing them to transfer RMB7.1m from the nominated accounts. If they really wanted to cover their tracks, it was strange of them to have shared with Joseph their correspondence with Allan,especially since at that point the Second Transaction had alreadybecome problematic. Further, nothing was put before us to establish that all their purported exchanges with Allan over the course of many years, though in softcopy form and deleted, could not have been recovered. That they also took no steps to attempt to recover the supposedly deleted correspondence makes their claim of Allan’s existence even more implausible. (b) They claim that they were involved in the Second Transaction for the commission. However, if this was so, they would have kept some of Lyu Yan’s money for themselves. Instead, they sent all the money away. They give two explanations for this, both of which are incredible. The first explanation is that Derek would collect the commission from Allan in cash in Singapore. This would defeat the whole point of Allan trying to keep his identity secret if he was now to give Derek the money in person. The second explanation is that they knew and trusted Allan, having been introduced to him through one “Lan Da Tong” and having worked with him in a similar transaction in 2017. No evidence whatsoever was given on their past dealing with Allan in 2017. In the same vein, nothing was said of “Lan Da Tong”, who might have supported Jonathan and Derek’s claim that they got to know “Allan” through him. 13 Having found that Allan is fictitious, Lyu Yan’s claim in conspiracy succeeds. Their various misrepresentations to Joseph (including those made after 16 October 2018 regarding “Allan’s” purported involvement), which they clearly knew and/or intended would be conveyed by Joseph to Lyu Yan, as well as their actual receipt of Lyu Yan’s money and subsequent transfers of the same elsewhere, amounts to fraud. 14 Having found that Allan is fictitious, Lyu Yan’s claim in unjust enrichment also succeeds. Jonathan and Derek argue that the basis of Lyu Yan’s transfer of her money to them is simply thatthey would pass her money to Allan. Allan being non-existent, this basis must fail. Neither can Jonathan and Derek rely on the defences of ministerial receipt and change of position, since they were lying to Lyu Yan, and thus were not acting honestly or in good faith. 15 However, we have some doubts on whether the Judge was correct to allow the claim in negligence. The essence of negligence is a failure to exercise due care. To that extent, we do not easily see how an intention to defraud, as is the case here, could be regarded as negligence. A defendant can be intentional in his decision not to take care, but this is still a step removed from the intention toactively inflict injury onto another. As such, we are not fully satisfied that the claim in negligence should be allowedtogetherwith the claims in conspiracy and unjust enrichment, considering that the latter two claims were founded on Jonathan and Derek’s intentional lies to Lyu Yan. Fortunately for Lyu Yan, she needs only succeed in one cause of action, but Jonathan and Derek need to successfully defend all three.",
        "Whether the rule inFoster v Driscollapplies": "",
        "Whether Lyu Yan intended or knew that the Second Transaction would violate Chinese law": "16 The rule inFoster v Driscollonly applies if Jonathan and Derek can show that Lyu Yan intended, or at the very least knew, that the Second Transaction violated Chinese law. We are of the view that this was not the case. The evidence as presented to us does not establish that Lyu Yan knew that the Second Transaction violated Chinese law. 17 Lyu Yan knew she was prohibited from remitting money directly from her China bank accounts to her overseas bank accounts. However, Lyu Yan also thought that there was a legitimate way around this prohibition. The evidence is clear: she was under the impression that if she transferred money from her China bank account to another China bank account “Z”, that would not violate the prohibition if the person who owned account Z arranged for a corresponding transfer of foreign currency to her bank account in another jurisdiction. This alternative structure is still in effect a remittance, but that is beside the point because that is precisely what a workaround is. In other words, Lyu Yan thought that the First and Second Transactions,as structured, were perfectly legitimate under Chinese law. 18 Lyu Yan’s position was not controverted by the contemporaneous evidence. Whilst Lyu Yan requested for fictitious loan documents to show her Singapore banks, so that these banks would think that the moneys being remitted to her Singapore bank accounts were loan repayments, this at its highest might show Lyu Yan’s knowledge of some potential illegality underSingaporelaw. The fictitious loan documents were never shown to the Chinese authorities. Further, Lyu Yan asked for the fictitious loan documents because her Singapore bank manager instructed her to do so. We think that Lyu Yan was entitled to assume that her bank manager would not have instructed her to break the law. 19 Further, when Lyu Yan engaged Joseph for the First Transaction, she repeatedly asked Joseph if the First Transaction was safe. We do not think Lyu Yan’s repeated questions showed that she knew the First Transaction (and by extension, the Second Transaction) were illegal under Chinese law. She asked these questions because Joseph had said that he would be engaging the services of a third party (which was the Indonesian remittance company for the First Transaction), and therefore wanted to be assured that this third party was trustworthy. Further, she asked these questions because Joseph had told her that the remittance would be sent to her directly from the third party instead of going through Joseph first. Lyu Yan was not familiar with this structure, and therefore wanted to make sure it was still legitimate. Additionally, and most importantly, Joseph himself expressly assured Lyu Yan many times that the transaction was safe. 20 Therefore, at the point when the Agreement was entered into for the Second Transaction to be carried out, it appears on the evidence that Lyu Yan thought that the First and Second Transactions, as structured, were legitimate under Chinese law. The First Transaction itself also took place without a hitch. In the circumstances, there would have been no reason for Lyu Yan to suspect that the Second Transaction would fall foul of Chinese law. Any impropriety, if present, related only to Singapore law. Consistent with this, once the Second Transaction began to unravel, Lyu Yan specifically asked if there was any concern with illegality – and once again Joseph assured her that there was nothing to worry about. 21 In sum, the evidence shows that at the material time when the Agreement was entered into for the Second Transaction to be carried out, Lyu Yan did not know, let alone intended, that the Second Transaction violated Chinese law. Her impression that the Second Transaction was legitimate was reinforced by Joseph’s repeated assurances to the same effect, and by the fact that the similarly-structured First Transaction proceeded without a hitch. Further, as already noted,Josephhimself did not appeal against the Judge’s decision. Joseph, who was directly liaising with Lyu Yan for the First and Second Transactions, did not find it worthwhile to contest the Judge’s finding that Lyu Yan thought the Second Transaction was legitimate. Accordingly, we agree with the Judge that the rule inFoster v Driscollwas not engaged.",
        "The scope of the rule inFoster v Driscoll": "22 The foregoing analysis suffices to dispose of this appeal. However, Jonathan and Derek also raise an interesting argument on the interface between the rule inFoster v Driscolland the framework dealing with contractual illegality laid down by this court inOchroid Trading Ltd and another Chua Siok Lui (trading as VIE Import& Export) and another[2018] 1 SLR 363 (“OchroidTrading”). We find it apposite to make some tentative observations on this interface – principally in relation to setting out the potential problems. 23 Jonathan and Derek correctly state that the rule inFoster v Driscoll, once engaged, renders the Agreement void and unenforceable. However, they recognise that Lyu Yan’s claims against them are not in contract, and they also recognise thatOchroid Tradingpermitsthe possible recovery of benefits conferred pursuant to an illegal contract via non-contractual means (albeit not in a situation where the principle of stultification applies (see also [27] below)). They thus argue that the rule inFoster v Driscoll, being one pertaining to theconflict of laws, is not to be read together with theOchroid Tradingframework, which deals withdomestic illegality. They further argue that the rule inFoster v Driscollalso defeats Lyu Yan’s non-contractual claims, since the remedies granted for these non-contractual claims (ie, damages to the tune of US$3m) entail the economic equivalent of enforcing the Agreement. 24 We find it necessary to unpack Jonathan and Derek’s argument by way of an example. Suppose A and B enter into a contract with the intention of violating the law of country X. A pays B, but B refuses to perform his part of the contract. A subsequently sues B in the Singapore court. 25 We address the first situation whereonlythe rule inFoster v Driscollapplies (ie, theOchroid Tradingframework isnotapplicable). In this situation, according to Jonathan and Derek, the contract between A and B is void and unenforceable. A thus cannot claim against B in contract. Further, A also cannot claim against B fornon-contractualcauses of action, if these non-contractual claims have the economic effect of enforcing the void and unenforceable contract. 26 This argument fails, because the rule inFoster v Driscollcan only be used to defeat a claim incontract, and isnotapplicable in relation tonon-contractual claims: see, for example, the English High Court decision ofLilly Icos LLC v 8PM Chemists Ltd[2010] FSR 4 at [266]. In other words, ifonlythe rule inFoster v Driscollapplies, Awillgenerally be allowed to makenon-contractualclaims against B, even though these non-contractual claims have the economic effect of enforcing the void and unenforceable contract. 27 We turn now to address the second situation, whereboththe rule inFoster v Driscolland theOchroid Tradingframework apply (ie, that they are to beread together). Once again, A cannot claim against B in contract. However, according to Jonathan and Derek, theOchroid Tradingframework nowpermitsA to claim against B in relation tonon-contractualcauses of action, if the policy rendering the contract void and unenforceable is notstultifiedby allowing the non-contractual claims (ie, if the principle of stultification does not apply). 28 Jonathan and Derek’s analysis in the second situation is correct. If the rule inFoster v Driscollisread togetherwith theOchroid Tradingframework, Amay(and notwill) be allowed to makenon-contractualclaims against B. This explains why they are most anxious to avoid the second situation: theyerroneouslythought that in the first situation (ie, whenonlythe rule inFoster v Driscollapplies),non-contractualclaims areall barred. In fact, it is theopposite: in the first situation,non-contractual claimsaregenerally permitted(see [26] above). In other words, possiblerecovery for A via non-contractual means in thesecondsituation isnarrowerthan that in the first situationbecause of the additional application of the principle of stultification in the second situation(see [27] above). 29 Jonathan and Derek should have therefore relied on thesecond, and not thefirst,situation to support their proposition that A’snon-contractualclaims against B should be barred. 30 That brings us to the interesting, albeit difficult, question as to whether the rule inFoster v Driscollshould be read together with theOchroid Tradingframework in the first place. TheOchroid Tradingframework is part of Singapore contract law, and thus applies only to contracts governed by Singapore law. However, the rule inFoster v Driscollapplies to disputes heard before the Singapore courts arising out of contractsregardless of their governing laws(seeDicey, Morris and Collins on the Conflict of Lawsvol 2 (Sweet & Maxwell, 2012) (“Dicey”) at para 32-193). If, indeed, it is accepted that the rule inFoster v Driscollis one pertaining tothe conflict of laws, then one possible argument is that it isseparate and distinctfrom theOchroid Tradingframework and that both should consequentlynotbe read together. 31 Possible difficulties ariseonly ifthe rule inFoster v Driscollisread together with theOchroid Tradingframework. We note that the rule inFoster v Driscollapplies to all contractsregardlessof their governing law, whilst theOchroid Tradingframework appliesonly to contracts governed by Singapore law. Therefore, the only situation where the rule inFoster v Driscollcanbe read together with theOchroid Tradingframework is wherethe impugned contract is governed by Singapore law. 32 If the rule inFoster v Driscollisread together with theOchroid Tradingframework forcontracts governed by Singapore law, there will be a possibleanomalybetween contracts governed by Singapore law on the one hand and those not governed by Singapore law on the other. 33 We demonstrate this possible anomaly by way of another example. Suppose A and B enter into a contract governed by the law of Country X, with the intention of violating the laws of Country Z. A pays, but B refuses to perform. A sues B in a Singapore court. The Singapore court will find that the contract is void and unenforceable by virtue of the rule inFoster v Driscoll, but A will generally be permitted to recover from B innon-contractualcauses of action. However, if the contract between A and B is governed by Singapore law, A may not be allowed to recover from B in respect ofnon-contractualcauses of action if theOchroid Tradingframework also applies, and where the principle of stultification is also found to apply, thus giving rise to a different result. 34 We have concerns with whether this possible disconnect or anomaly should be permitted. There is no principled reason why recovery vianon-contractual meansshould be narrower for A when the contract is governed bySingapore law, and broader when the contract is governed byforeign law. Nevertheless, this is a complex and difficult question, which we do not propose to address in this appeal, given that, as already noted, it does not arise for our determination. At this preliminary juncture, we make only one observation about how the rule inFoster v Driscolldoes share acommonalitywith theOchroid Tradingframework. The rule inFoster v Driscollwill not apply to defeat a contract entered into with the intention of breaking the laws of a foreign state, if the foreign law being violated is in itself repugnant to Singapore public policy (seeDiceyat para 31-191). TheOchroid Tradingframework will not apply to defeat non-contractual recovery for benefits conferred pursuant to an illegal contract if the policy that rendered the contract illegal is not violated by allowing the non-contractual claim. In both situations, the concept ofpolicyserves as a limiting factor to ensure that theillegalityinvolved does notinflexiblydefeat recovery where such recovery is justified.",
        "Conclusion": "35 For the reasons set out above, the appeal is dismissed. Having regard to the parties’ respective costs schedules, we award the respondent costs in the sum of $ 38,500 (all-in). There will be the usual consequential orders. Sundaresh MenonChief JusticeAndrew Phang Boon LeongJustice of the Court of AppealBelinda Ang Saw EanJudge of the Appellate Division Chooi Jing Yen and Joel Wong En Jie (Eugene Thuraisingam LLP) for the appellants; Jimmy Yap (Jimmy Yap & Co) for the respondent.",
        "": ""
    }
}