{
    "case_title": "Koh Lian Chye and anothervKoh Ah Leng and anotherand another appeal",
    "ncitation": "[2021] SGCA 69",
    "coram": "Belinda Ang Saw Ean JAD (delivering the grounds of decision of the court):",
    "sections": {
        "Introduction": "1 These are cross-appeals against the decision of the High Court Judge (“the Judge”) inKoh Lian Chye and another v Koh Ah Leng and another[2020] SGHC 131 (the “Judgment”). They concern the attempts of two brothers, Mr Koh Lian Chye (“Lian Chye”) and Mr Koh Ah Leng (“Ah Leng”) to each claim sole title to a property which is currently registered as belonging jointly to them and their late father, Mr Koh Cheng Kang (“Mr Koh”). The property in question is a two-storey Housing and Development Board (“HDB”) shophouse unit known as Block 323 Bukit Batok Street 33 #01-112, Singapore 650323 (“the Property”). 2 Lian Chye is the first appellant in Civil Appeal No 120 (“CA 120”) and is also the second appellant in that action in his capacity as the administrator of Mr Koh’s estate. In these capacities, he is also the first and second respondent in Civil Appeal No 122 (“CA 122”). Ah Leng is the first respondent in CA 120 and the first appellant in CA 122. He and Mr Koh were partners in Koh Seng Hin, a partnership in the business of running a provision shop. Koh Seng Hin is the second respondent in CA 120 and the second appellant in CA 120 and its business was previously carried out in the Property. 3 In the course of the dispute, each brother attempted to bolster his case with differing and often directly contradictory allegations of what the actual intentions of their late father had been. Such contradictory accounts are, of course, not uncommon in property disputes of this kind. Having considered the parties’ arguments and the facts of these appeals, we dismissed them on 5 May 2021 and upheld the decision of the Judge. Our view was that Lian Chye was beneficially entitled to 14.3% of the Property under a purchase price resulting trust, with Mr Koh being beneficially entitled to the remaining 85.7%.  By reason of the operation of the presumption of advancement, Mr Koh’s 85.7% share had to be regarded as having beengiftedjointly to Lian Chye and Ah Leng. The end result was that Lian Chye and Ah Lenglegallyheld the Property as joint tenants by operation of the principle of survivorship upon Mr Koh’s death. However, thebeneficial interestin the Property was held by Lian Chye and Ah Leng under a tenancy-in-common inequityin the ratio of 57.15:42.85. 4 We now set out the full grounds for our decision.",
        "Facts": "5 The Property was registered in the names of Mr Koh, Lian Chye and Ah Leng as joint tenants up until Mr Koh’s death, whereupon pursuant to the right of survivorship applicable to joint tenancies, Lian Chye and Ah Leng became the legal joint tenants of the Property. 6 Mr Koh maintained two families. With his first wife, he had seven children: Ah Leng (who was an adopted son); Koh Suan Cho; Koh Suan Choo; Koh Lian Thye; Koh Ah Swan; Lian Chye and Koh Lian Huat. With his second wife, he had three children: Koh Bee Hoon (“Bee Hoon”), Koh Chye Hin and Koh Bee Choon. 7 Mr Koh started his provision shop business, Koh Seng Hin, as a sole proprietorship in 1968. In 1975, Koh Seng Hin was converted into a partnership and Ah Leng was made a partner. Lian Chye was never a partner of Koh Seng Hin. Koh Seng Hin originally conducted its business in a HDB shophouse in Choa Chu Kang. In 1986, it relocated to the Property, with Ah Leng and Mr Koh (as partners of Koh Seng Hin) entering into a lease agreement for the Property with the HDB. Subsequently, in 1996, the HDB offered the Property for sale. Mr Koh and Ah Leng first added Lian Chye as a joint lessee of the Property, and then the three of them purchased it for $537,800 (excluding interest and fees) as joint tenants. 8 The purchase of the Property was financed by a bank loan of $570,800 secured by a mortgage over the Property in favour of United Overseas Finance Limited (“the Mortgage”). The Mortgage was signed by Mr Koh, Ah Leng and Lian Chye as joint borrowers and mortgagors. In connection with the purchase, Lian Chye had applied to the Central Provident Fund Board (“CPF Board”) for, and had received, permission to use up to $527,100 of his CPF monies towards paying down the Mortgage. Between 1997 and 2001, Lian Chye applied $76,800 of that sum towards payment of the Mortgage instalments. In 1998, Mr Koh prepared his last will and testament, which did not provide for how the Property was to be dealt with. Mr Koh paid off the rest of the Mortgage, which was discharged in 2005. Significantly, Ah Leng did not contribute financially to the purchase of the Property in any way. 9 After the Mortgage had been paid off, on 17 February 2005, Mr Koh, accompanied by Ah Leng and Lian Chye, went to the law firm of Irene Lim & Associates (“ILA”) to discuss procuring the discharge of the Mortgage and also the possibility of the Property being owned by Mr Koh alone by severing the joint tenancy such that Mr Koh, Ah Leng and Lian Chye would hold shares in the Property in the ratio of 98:1:1, with Ah Leng and Lian Chye thereafter transferring their shares to Mr Koh.1Foot Note 1×Appellants’ Core Bundle in CA 122 (“ACB-CA122”), vol 2 (“2ACB-CA122”) at p 106.Nothing discussed at the meeting was, however, acted upon subsequently. 10 On 31 May 2011, there was a discussion between Mr Koh, who was then 78 years old,2Foot Note 2×2ACB-CA122 at p 101.and Bee Hoon. The discussion took place at Mr Koh’s bedside in the hospital, where Mr Koh was then warded, and was recorded by Bee Hoon in two videos (“the Videos”). In the Videos, Mr Koh appeared to be contemplating a return of $100,000 to Lian Chye so that he would “withdraw his name” and for the Property to be held by Ah Leng and Mr Koh himself, “just as before, in the past”. Mr Koh further asserted, in the Videos, that the Property was bought by him, and that “his son” (referring to Lian Chye) only borrowed monies from the bank and used his CPF monies to pay down the bank loan. Mr Koh further remarked that while Lian Chye’s share in the Property “cannot eat” the shares held by Ah Leng and himself, their shares could “eat” Lian Chye’s share. The transcript of the Videos recorded Mr Koh as speaking in a “very soft” and “breathy” manner.3Foot Note 3×2ACB-CA122 at pp 129–141. 11 On 21 January 2012 and in March 2012, Mr Koh consulted Dr Nagaendran Kandiah (“Dr Kandiah”), a Senior Consultant of the Department of Neurology at the National Neuroscience Institute, “for symptoms of forgetfulness, change in behaviour and unsteadiness of 6 month duration”. Dr Kandiah diagnosed Mr Koh as having “mild dementia of the mixed type (Alzheimer’s disease with cerebrovascular disease)”. During follow-up consultations, Dr Kandiah observed that Mr Koh’s “memory difficulty [had] gradually progressed and he needed supervision with most activities of daily living”. By 7 November 2013, Dr Kandiah noted that Mr Koh “continued to have deficits in memory and needed supervision for all his daily activities”.4Foot Note 4×2ACB-CA122 at p 103. 12 Mr Koh passed away on 1 June 2014. On 21 June 2014, Ah Leng’s youngest son, Koh Chee Keong (“Chee Keong”), was added as a partner of Koh Seng Hin, pursuant to an alleged agreement between Ah Leng and Mr Koh prior to the latter’s death for Chee Keong to take Mr Koh’s place as a partner of Koh Seng Hin. 13 Subsequently, Lian Chye took steps to assert his purported sole beneficial ownership of the Property. This prompted the dispute over the Property which was the subject of the proceedings below. 14 Before the Judge, Lian Chye asserted that he was the sole beneficial owner of the Property upon Mr Koh’s death, pursuant to a common intention constructive trust founded upon the parties’ agreement (the “Common Agreement”). Alternatively, he was so entitled on the basis of proprietary estoppel arising out of the existence of the Common Agreement. Further, in the alternative, Lian Chye contended that the Property was held on a purchase price resulting trust in the proportions of 98.01:1.99 or 59.1:40.9 between Lian Chye and Mr Koh. 15 Ah Leng, on the other hand, asserted that it wasKoh Seng Hinwhich was the sole beneficial owner of the Property pursuant to the parties’ agreement (the “Defendants’ Agreement”). Alternatively, he asserted thathe, not Lian Chye, was the sole beneficial owner of the Property since the amount contributed by Lian Chye towards paying down the Mortgage was a loan. Consequently, Mr Koh was solely beneficially entitled to the Property, and his beneficial interest passed to Ah Leng pursuant to the operation of the presumption of advancement. Further, in the alternative, he argued that the Property was held on a purchase price resulting trust in the proportions of 85.7:14.3 between himself and Lian Chye.",
        "The decision below": "16 The Judge made the following salient findings of fact: (a) There was no agreement between Ah Leng and Mr Koh for Chee Keong to take the latter’s place as a partner of Koh Seng Hin (Judgment at [19] and [23]). The evidence in support of that agreement was internally inconsistent (Judgment at [20]–[21]), and if Mr Koh had intended to make Chee Keong a partner, he could have done so when he was alive (Judgment at [22]). (b) There was no Common Agreement between the parties for Lian Chye to be the sole beneficial owner of the Property upon Mr Koh’s death. Lian Chye did not identify a single instance where Mr Koh’s conduct was probative of (as opposed to being merely not inconsistent with) the existence of the Common Agreement (Judgment at [36]). (c) Similarly, there was no Defendants’ Agreement between the parties for Koh Seng Hin to be the sole beneficial owner of the Property upon Mr Koh’s death. There was no objective evidence supporting that assertion (Judgment at [47]) and Ah Leng’s own witnesses gave evidence that contradicted the details of the Defendants’ Agreement as alleged (Judgment at [50]–[51]). In any case, the fact that Mr Koh had attempted (although abortively) to remove Lian Chye and Ah Leng as joint tenants of the Property in 2005 contradicted the Defendants’ Agreement (Judgment at [52]). (d) In this connection, it was unsafe to place reliance on the Videos to show that Mr Koh did not intend to give Lian Chye any interest in the Property, since it was possible that Mr Koh was suffering from Alzheimer’s disease when the Videos were recorded (Judgment at [59]) and was evidently extremely physically and mentally frail at that point, having great difficulty articulating himself (Judgment at [60]). His responses also appeared to have been prompted by leading questions from Bee Hoon (Judgment at [61]). (e) The $76,800 contributed by Lian Chye to the Mortgage payments was not a loan. This assertion was not supported by the evidence and, if it was indeed true, Mr Koh could have repaid the purported loan when he was alive (Judgment at [64]). It was unlikely that Lian Chye would have contributed that sum for nothing in return (Judgment at [63]). (f) The Property was not acquired using money belonging to Koh Seng Hin because there was no evidence that Mr Koh had used Koh Seng Hin’s money to pay down the Mortgage (Judgment at [72]–[74]). This allegation was in any case inconsistent with the fact that Lian Chye, who was not a partner of Koh Seng Hin, had been added as a joint tenant of the Property (Judgment at [76]) and that Mr Koh had contemplated removing Ah Leng as a joint tenant of the Property, even though he was a partner of Koh Seng Hin (Judgment at [77]). Moreover, the Property was not listed as a partnership asset in the accounts of Koh Seng Hin (Judgment at [78]). 17 On the basis of the above findings, the Judge concluded that there was no common intention constructive trust in the terms of the Common Agreement or those of the Defendants’ Agreement over the Property. The presumption of a purchase price resulting trust therefore applied, with Lian Chye being entitled to a 14.3% beneficial interest in the Property which was proportional to his contribution of $76,800 towards paying off the Mortgage, and Mr Koh (notKoh Seng Hin) being entitled to the remaining 85.7% (Judgment at [95]). 18 The Judge next turned to the issue of how Mr Koh’s 85.7% beneficial interest ought to be dealt with, which in turn depended on whether the presumption of advancement applied to Ah Leng and/or Lian Chye. The Judge found that the presumption of advancement applied tobothof them and, applying the maxim “equality is equity”, the Judge held that Mr Koh’s 85.7% beneficial interest in the Property ought to be shared between Ah Leng and Lian Chye equally (Judgment at [97]). 19 Thus, the Judge declared that the Property was held by Ah Leng and Lian Chye under a beneficial tenancy-in-common in the ratio of 42.85:57.15 (Judgment at [98]). Significantly, the language used by the Judge was that the Property was “held on apurchase price resulting trustfor [Lian Chye] and [Ah Leng] in the ratio of 57.15:42.85” (Judgment at [105]). We shall discuss the implications of this in due course. The Judge then ordered the Property to be sold and for the proceeds of sale, together with the rental income after 1996, to be apportioned on that basis (Judgment at [106]).",
        "The parties’ cases on appeal": "20 We now turn to the parties’ cases on appeal. For convenience, we shall refer to the cases of the appellants in CA 120 and the respondents in CA 122 as the case of or the position taken by Lian Chye, and the cases of the respondents in CA 120 and the appellants in CA 122 as the case of or the position taken by Ah Leng.",
        "Lian Chye’s case": "21 On appeal, Lian Chye substantially repeated his arguments below. His primary case was that by the Common Agreement, he was solely entitled to the Property upon Mr Koh’s death under a common intention constructive trust or by operation of the doctrine of proprietary estoppel.5Foot Note 5×Appellants’ Case (CA 120) (“AC-CA120”) at paras 1.3.1 to 1.3.2, 6.1 and 6.11.4.Alternatively, the Property was held under a purchase price resulting trust between himself and Mr Koh’s estate in the ratio of 59.1:40.9 (based on a purported agreement between himself, Mr Koh and Ah Leng in 1996)6Foot Note 6×AC-CA120 at para 5.1.3.or 14.3:85.7 (based on hisactualfinancial contributions towards the Property).7Foot Note 7×AC-CA120 at para 4.1.3.",
        "Ah Leng’s case": "22 Ah Leng also substantially repeated the arguments he had made below. His position was that there was no Common Agreement as alleged by Lian Chye. Lian Chye’s contribution towards paying off the Mortgage was a loan and therefore Mr Koh was the sole beneficial owner of the Property under a purchase price resulting trust. The sole beneficial interest in the Property passed from Mr Koh to Ah Leng by operation of the presumption of advancement.8Foot Note 8×Respondents’ Case (CA 120) (“RC-CA 120”) at para 9.Alternatively, Mr Koh’s 85.7% beneficial interest in the Property under a purchase price resulting trust (as found by the Judge) likewise went solely to Ah Leng by operation of the presumption of advancement.9Foot Note 9×RC-CA120 at para 11.",
        "Our decision": "",
        "Outline of the relevant legal framework": "23 The parties accepted the proposition of law that two presumptions (which we elaborate on below) arise in circumstances where, on the face of the transaction, a person (referred to as the transferor) appears to have paid for the acquisition of an interest in property in the name of a third party or to have transferred some interest in property to a third party. Their dispute was over the application of the two presumptions in this particular case. 24 Where there is no relationship between the parties, it is presumed that the payer or the transferor intended to retain the beneficial interest in the property in proportion to his financial contributions toward the acquisition of the property. This is the presumption of resulting trust and it constitutes the transferee (who holds the legal interest in the property) a trustee of the property for the benefit of the transferor or the payer to the extent of the aforesaid beneficial interest. In other words, this presumption divorces the equitable (ie,beneficial) interest in the property from the legal interest. In the case of a joint tenancy over property, it should be noted that the right of survivorship operatesonlyon the legal interest andnotthe beneficial interest: seeEstate of Yang Chun (Mrs) née Sun Hui Min, deceased v Yang Chia-Yin[2019] 5 SLR 593 at [56]. 25 Where the transfer occurs in the context of certain recognised categories of relationships (eg,between parents and children), the presumption of advancement operates torebutthe presumption of resulting trust, on the basis that the parents intended to benefit the children in question by the transaction: seeLow Yin Ni and another v Tay Yuan Wei Jaycie (formerly known as Tay Yeng Choo Jessy) and another[2020] SGCA 58 at [5]; see alsoChan Yuen Lan v See Fong Mun[2014] 3 SLR 1048 (“Chan Yuen Lan”) at [160]. The effect of the operation of the presumption of advancement is that the transfer of the interest in the property will be presumptively treated as agiftfrom the transferor to the transferee. The burden is then on the person who is challenging the claim of the transferee to rebut the presumption by proving that the transfer was not intended to be a gift and that, instead, the transferee held the interest on trust for the transferor:Lau Siew Kim v Yeo Guan ChyeTerence and another[2008] 2 SLR(R) 108 (“Lau SiewKim”) at [56]–[57]. 26 Notwithstanding the above, the presumptive positions set out in the preceding paragraphs can also be rebutted by sufficient and compelling evidence of an express or inferred common intention that the parties should hold the beneficial interest in certain proportions. In such a case, the parties would hold the beneficial interest in the property according to such common intention under a common intention constructive trust. If there is neither sufficient evidence of the aforesaid common intention nor of the parties’ respective financial contributions towards the acquisition of the property, the parties would hold the beneficial interest in the same manner as that in which the legal interest is held:Chan Yuen Lanat [160]. 27 With these principles in mind, we turn to the factual findings made by the Judge.",
        "The findings made by the Judge": "28 Notwithstanding the arguments that the parties put forward, we were not persuaded that any of the factual findings made by the Judge (as set out at [16]–[18] above) were wrong. Our reasons follow. There was no Common Agreement between the parties 29 We agreed entirely with the Judge’s view that there was no Common Agreement between the parties (Mr Koh, Lian Chye and Ah Leng) in the terms alleged by Lian Chye on appeal (ie,that he was to have sole beneficial ownership in the Property after Mr Koh’s death). The crux of Lian Chye’s case was that, at the time the Property was acquired, both Mr Koh and Ah Leng had an outstanding bank loan of $300,000 (which was paid off on 15 January 2004),10Foot Note 10×Respondents’ Case (CA 122) (“RC-CA122”) at para 2.1.10.and were in no position to take on further debt.11Foot Note 11×RC-CA122 at para 2.4.8(2).Lian Chye’s participation in the acquisition of the Property was thus “necessary and critical”,12Foot Note 12×RC-CA122 at para 2.4.8(3).and he entered into a purported agreement with Mr Koh under which, in exchange for his agreeing to use his CPF funds to pay for the Property, he would become the sole beneficial owner of the Property upon Mr Koh’s death.13Foot Note 13×AC-CA120 at paras 6.1(7)–6.1(9).Ah Leng was not a party to this purported agreement. Lian Chye’s contention was plainly a non-starter since Ah Leng was not a party to any such agreement and therefore there could have been no common intention held by the legal owners of the Property, namely, Mr Koh, Lian ChyeandAh Leng. The Judge was correct to find that there was in fact no Common Agreement. On that basis, Lian Chye’s assertion that he was solely beneficially entitled to the Property by reason of proprietary estoppel, which was predicated on the existence of the Common Agreement, also failed. Lian Chye’s financial contribution was not a loan 30 We also agreed with the Judge’s rejection of Ah Leng’s argument that Lian Chye had no beneficial interest in the Property at all as his financial contribution towards the purchase of the Property was in the nature of a loan, and that therefore Mr Koh was the sole beneficial owner of the Property. This argument necessarily implied that Lian Chye had agreed to an arrangement by which he would not acquire a share of the Property despite having financially contributed to its purchase. We agreed with the Judge’s finding that this was highly unlikely. Further, the Videos were central to Ah Leng’s case before the Judge and on appeal, but, as the Judge found, their evidential weight was negligible. There was no reason, in our view, to interfere with the Judge’s refusal to place any reliance on the Videos (as evidence that Lian Chye’s contribution of $76,800 of his CPF monies towards payment of the Mortgage was in the nature of a loan) because Mr Koh’s judgment was likely impaired by dementia at the time the Videos were recorded. In coming to this conclusion, the Judge relied on Dr Kandiah’s expert evidence. It is well-settled that an appellate court will be slow to criticise a trial court’s findings on expert evidence, unless there is doubt as to whether the trial judge satisfactorily sifted or assessed the evidence:Sakthivel Punithavathi v Public Prosecutor[2007] 2 SLR(R) 983 at [74]. More generally, it is also trite that an appellate court will not overturn a trial judge’s findings of fact unless they can be shown to be plainly wrong or against the weight of the evidence:Ng Chee Chuan v Ng Ai Tee (administratrix of the estate of Yap Yoon Moi, deceased)[2009] 2 SLR(R) 918 at [12]–[13]. These principles give due regard to the trial judge as the primary trier of fact. 31 Here, not only had the Judge accepted Dr Kandiah’s evidence of Mr Koh’s possible dementia at the time the Videos were recorded, she had also been able to view the Videos and assess for herself Mr Koh’s frailty and his difficulty in articulating his thoughts. Further, it was not disputed that Mr Koh was diagnosed with dementia in March 2012,14Foot Note 14×Record of Appeal, vol 3(H) at p 112.less than a year after the Videos were recorded in May 2011. It was entirely reasonable, in our view, for the Judge to conclude, on the facts and evidence before her, that Mr Koh, who was elderly, frail and on the cusp of recognisable dementia, would likely have been suffering from deficient judgment at the time the Videos were recorded, so as to render unsafe any reliance on them as evidence of his intentions. 32 In any event,even ifthe Videos were taken into consideration, they did not assist Ah Leng’s case. The Videos, at best, indicated that Mr Koh was contemplating paying Lian Chye a sum of $100,000 in exchange for him giving up his interest as a joint tenant of the Property.15Foot Note 15×Appellants’ Supplemental Core Bundle (CA 120) vol 2 at pp 1399–1400.This was not at all probative of the fact that Lian Chye had understood that his financial contribution towards the Property was in the nature of a loan. There was thus no reason to disturb the Judge’s finding that Lian Chye’s contribution was not in the nature of a loan. Lian Chye’s and Mr Koh’s beneficial interests in the Property 33 We turn next to the Judge’s finding that the Property was beneficially held by Lian Chye and Mr Koh under a purchase price resulting trust in the ratio of 14.3:85.7. We agreed with the Judge on this point. It was not disputed that that ratio represented theactualcontributions of Lian Chye and Mr Koh towards paying off the Mortgage. We also noted that the parties did not dispute that this allocation of beneficial interests was correct. Indeed, this was the basis of both Lian Chye’s second alternative case and Ah Leng’s primary case on appeal (see [21]–[22] above). 34 In our judgment, there was no merit in Lian Chye’s first alternative case, namely that he was beneficially entitled to 59.1% of the Property under a purchase price resulting trust on the basis that there was an agreement for him to contribute $1,600 per month to pay the monthly Mortgage instalments of $2,706 (see [21] above). The Judge found that this was unmeritorious since Lian Chye had only paid such instalments from 1997 to 2001 (totalling $76,800) with Mr Koh paying the remaining instalments in full. We were entirely in agreement with the Judge’s reasoning on this point. 35 We accordingly uphold the Judge’s finding that the Property was beneficially held by Lian Chye and Mr Koh under a purchase price resulting trust in the ratio of 14.3:85.7. As joint tenants in law, Mr Koh, Lian Chye and Ah Leng held the Property on trust for Mr Koh (85.7%) and Lian Chye (14.3%). The applicability of the presumption of advancement 36 We now turn to the issue of how Mr Koh’s 85.7% beneficial interest in the Property was dealt with. The Judge held that (Judgment at [96]–[97]): 96 … since [Mr Koh] was the parent of [Lian Chye] and [Ah Leng], the presumption of advancement should apply so as to displace the presumption of resulting trust. The presumption of advancement means that [Mr Koh] is presumed to have intended his contributions to the acquisition of the Property to be a gift to his children – [Lian Chye] and [Ah Leng] – and that he did not intend to retain any interest in the Property (Lau Siew Kimat [56] and [62]). The presumption of advancement applies even in a relationship between a parent and an adult child (Neo Hui Ling v Ang Ah Sew[2012] 2 SLR 831 at [44]). There is nothing on the evidence to rebut this presumption. 97 I note that the presumption of advancement in this case applies two ways: as between [Mr Koh] and [Lian Chye], and as between [Mr Koh] and [Ah Leng]. Applying the maxim “equality is equity”, it would be presumed that [Mr Koh] intended to benefit [Lian Chye] and [Ah Leng] equally … 37 Just for clarity, we repeat some of the relevant facts and principles. The Property was purchased in three names: Mr Koh’s, Lian Chye’s and Ah Leng’s. They were registered as joint tenants which meant that at law each of them had an undivided share in the whole of the Property. In equity, each of them was the beneficial holder of a one-third share. However, their financial contributions were unequal and as between unrelated persons that would have meant a purchase price resulting trust in the terms explained in [35] above. We then come to the operation of the presumption of advancement on the beneficial interests under that trust. It only operates in respect of certain categories of relationship; it does not operate between brothers or from child to father. Therefore, it could not operate in relation to the purchase price resulting trust that enured to Lian Chye’s benefit from his own financial contributions. However, it has long been recognised as being applicable between a father and his adult children, subject to rebuttal by proof of a different intention. 38 Therefore, when Mr Koh acquired the Property in the names of himself and his sons, it had,prima facie, to be presumed that his intention then was that any beneficial interest that he acquired in it was to be gifted to his sons. In this connection, it should be remembered that Mr Koh was not only the father but also the senior partner in Koh Seng Hin. He would have been the one to decide to purchase the Property and that it should be owned by the three of them, not just himself. While one of the reasons for making Lian Chye a co-owner was to get the benefit of his CPF contributions, it was obvious from the start that additional payments would need to be made since the monthly mortgage instalments were more than $1,000 in excess of the amount that could come from Lian Chye’s CPF account. This was a responsibility Mr Koh knew he would have to bear. He did not ask either of his sons to top up those payments; he paid the additional amounts himself and subsequently, when Lian Chye ceased to make any payment, Mr Koh took over the whole burden, apparently without demur. Mr Koh’s preeminent position in the family was also shown when his sons accompanied him to the ILA meeting and listened, without objection, when he asked for advice on taking over the Property entirely. It was thus clear to us that it was Mr Koh’s decisions on the acquisition of the Property that resulted in his sons becoming (and remaining) legal co-owners with him. 39 We now consider whether there was anything on the facts that rebutted the presumption of advancement. We could not find any evidence to this effect. Indeed, what evidence there was seemed to indicate the contrary: that Mr Koh intended his share in the Property to be given to Lian Chye and Ah Leng. 40 First, as mentioned at [8] above, about two years after the purchase of the Property, in July 1998, Mr Koh executed his last will. In the will, he devised and bequeathed all his share and interest in a house he had in Choa Chu Kang Road to named children and grandchildren in specified shares.16Foot Note 16×Record of Appeal (CA 122) Vol 3 Part D at p 49.Mr Koh did not, however, make any bequest of the Property. It was not even mentioned in the will. It can be inferred from this that he saw no need to make provision for the Property as his share had already been given to the sons whom Mr Koh wished to benefit. 41  Second, the evidence of what occurred shortly after Mr Koh had paid off the Mortgage also supports a contrary view. As stated, in February 2005, Mr Koh accompanied by Ah Leng and Lian Chye visited the offices of ILA to obtain advice regarding the Property. One of the purposes of the visit was to instruct the firm to prepare the discharge of the Mortgage so that the title deeds of the Property could be released. Mr Koh, in addition, asked ILA for advice as to how he could become sole owner of the Property and procure the removal of Lian Chye’s and Ah Leng’s names from the title. He was then advised on the various steps that would need to be taken to obtain this outcome, namely the transfer of the legal interest in the Property held by his two sons to himself by way of gift or sale, which would in turn attract stamp duty implications requiring him to prove the extent of his interest in the Property to the Commissioner of Stamp Duties in respect of any such transfer.17Foot Note 17×Appellants’ Core Bundle in CA 122 (“ACB-CA122”), vol 2 (“2ACB-CA122”) at p 106.Having received this advice, Mr Koh took no further action thereafter to become the sole owner of the Property. This inaction for the ten years or so that had elapsed before he died indicated that Mr Koh was perfectly happy with the status quo. It also supported the presumption of advancement because it reflected his intention of gifting his interest in the Property to his sons (Ah Leng and Lian Chye). 42 We therefore agreed with the Judge’s conclusion that the presumption of advancement had not been rebutted on the evidence. It would thus be presumed that Mr Koh intended, when he acquired the Property in the names of his sons and himself in the knowledge that he would be paying most of the acquisition costs (in the form of the Mortgage payments), to make a gift of his  beneficial interest in the Property to Lian Chye and Ah Leng. 43 As there was no evidence as to the proportions in which Mr Koh intended to apportion his beneficial interest in the Property as between Lian Chye and Ah Leng, the Judge applied the maxim “equality is equity” such that they were each entitled to half of Mr Koh’s beneficial interest, that is, a 42.85% beneficial interest in the Property. In our view, this was an acceptable approach. Mr Koh was aware, after the ILA visit if not before, that upon his decease, Lian Chye and Ah Leng would bothjointlysucceed to his legal interest under the principle of survivorship as joint owners of the Property as a whole. A joint tenancy, however, is abhorred in equity and thus equity presumes that legal joint owners of a property interest hold the said interest under an equitable tenancy-in-common in equal shares under the “equality is equity” maxim. As we stated inLau Siew Kimat [83]: … It is trite law that joint tenancies are generally abhorred by equity and unless there is an express declaration or any other intention shown to the contrary, or unless the parties have contributed to the purchase money in equal shares, legal joint tenants of a property will be presumed to hold that property as beneficial tenants in common of shares proportionate to their contribution to the acquisition of that property … This proposition is explained inHalsbury’s Laws of Singaporevol 9(2) (LexisNexis, 2003) at para 110.026 as follows: In a specialised instance, the maxim that equality is equity finds expression in the abhorrence of a joint tenancy or correspondingly, the preference for a tenancy in common as a form of common ownership of property. The right of survivorship which is an incident of a joint tenancy has the effect of divesting a deceased joint tenant of his unsevered interest and giving the survivor the entirety of the estate, producing a disproportionate effect. The preference for a tenancy in common means that in equity, the court construing the intentions of the parties leans towards holding that they are tenants in common in proportion to their contributions to the purchase price. The parties will only be held to be joint tenants when they purchase in equal shares and no contrary intention is shown that they were to be otherwise than joint tenants. 44 We were therefore of the view that the Judge was correct to apply the “equality is equity” maxim to the joint interest of Lian Chye and Ah Leng in Mr Koh’s 85.7% beneficial interest in the Property such that Lian Chye and Ah Leng were each beneficially entitled to an equal share therein.",
        "Basis of the parties’ beneficial interests in the Property": "45 From the foregoing analysis, a 14.3% beneficial interest in the Property was held by Lian Chye under a presumed purchase price resulting trust. By operation of the presumption of advancement, Lian Chye obtained by way of gift a further 42.85% from Mr Koh. The operation of the presumption of advancement was also the basis on which Ah Leng obtained his 42.85% beneficial interest in the Property (ie, by way of gift from Mr Koh). 46 Thus, the Judge was, with respect, wrong to have held (at [105] of the Judgment) that Lian Chye and Ah Leng respectively heldthe full57.15% and 42.85% of the beneficial interest in the Property pursuant to a purchase price resulting trust.",
        "Conclusion": "47 For the reasons set out above, we dismissed the appeals and upheld the Judge’s orders below, including the Judge’s orders for the Property to be sold and the proceeds divided between Lian Chye and Ah Leng in the proportion of their beneficial interests in the Property,ie, 57.15:42.85, and for the rental income from the Property to be apportioned on the same basis. We extended the time for the sale of the Property to 31 December 2021 and granted the parties liberty to apply to the Judge in relation to the sale and the time of sale. As none of the parties succeeded in their appeal, we ordered each party to bear their own costs of the appeals with the usual consequential orders to apply. Judith PrakashJustice of the Court of AppealBelinda Ang Saw EanJudge of the Appellate DivisionQuentin LohJudge of the Appellate Division The appellants in Civil Appeal No 120 and the respondents in Civil Appeal No 122 in person and unrepresented;Chan Yew Loong, Justin and Kevin Cheng (Tito Isaac & Co LLP) for the respondents in Civil Appeal No 120 and the appellants in Civil Appeal No 122."
    }
}