{
    "case_title": "Datchinamurthy a/l Kataiah vPublic Prosecutor",
    "ncitation": "[2021] SGCA 30",
    "coram": "Chao Hick Tin SJ:",
    "sections": {
        "Factual and procedural background": "2 The facts relating to the Applicant’s case were summarised by the trial judge (“the Trial Judge”) at [2]–[17] ofPublic Prosecutor vChristeen d/o Jayamany and another[2015] SGHC 126 (“Datchinamurthy (HC)”). 3 The Applicant had entered Singapore on 18 January 2011 on his motorcycle and travelled to a fruit stall at Woodlands Central, where he met an unknown Indian man. The Applicant told that man that he was supposed to deliver five packets of drugs for one “Rajah”. The Indian man told the Applicant that there were two packets in a red plastic bag in the front basket of a motorcycle bearing registration plate number JJS 2021 which was parked in the vicinity, and three more packets stuffed under its seat. The Applicant retrieved the three packets from under the seat and placed them with the two other packets. He then contacted Christeen d/o Jayamany (“Christeen”) and arranged to meet her at Depot Close. The Applicant travelled there on JJS 2021 and met Christeen. Christeen passed him a brown sling bag, and the Applicant placed something red into the sling bag and returned it to Christeen. They then parted ways. Officers from the Central Narcotics Bureau arrested both of them. A red plastic bag containing five packets of brown granular substance was retrieved from the sling bag. The substance was later found to contain not less than 44.96g of diamorphine. The Applicant faced a single charge under s 5(1)(a) punishable under s 33 of the MDA as follows: That you,2. DATCHINAMURTHY A/L KATAIAH, on 18 January 2011, at or about 9.05 a.m., along Depot Close, Singapore, did traffic in a controlled drug specified in Class A of the First Schedule to the Misuse of Drugs Act, Chapter 185, to wit, by giving to one Christeen D/O Jayamany (NRIC No.: [xxx]) five (5) packets of granular/powdery substances, which were analyzed and found to containnot less than 44.96grams of diamorphine, without any authorization under the said Act or the Regulations made thereunder, and you have thereby committed an offence under section 5(1)(a) of the Misuse of Drugs Act, Chapter 185, which punishable under section 33 of the Misuse of Drugs Act, Chapter 185, or you may alternatively be liable to be punished under section 33B of the Misuse of Drugs Act, Chapter 185. [emphasis in original] 4  The Trial Judge convicted the Applicant of the single charge. The Applicant’s defence was that he did not know the nature of the contents of the packets that he had delivered – he claimed that he thought he was carrying illegal Chinese medicine and not diamorphine:Datchinamurthy (HC)at [15]–[18]. The Judge’s main findings were as follows: (a) The Applicant had delivered drugs to Christeen on three separate occasions, including the last occasion on the date of his arrest,viz, 7, 14 and 18 January 2011: at [19]. (b) The presumption of knowledge under s 18(2) of the MDA (“the s 18(2) presumption”) applied to the Applicant, as it was not disputed that he was in physical possession of the bag containing the five packets of diamorphine prior to delivery: at [20]. (c) The Trial Judge found that the Applicant “had at least a strong suspicion that he was carrying diamorphine and that he turned a blind eye to it”: at [35]. First, the Applicant was rewarded “rather generously” for collecting and delivering the drugs: at [36]. Second, the Applicant’s claim to have trusted Rajah’s assurance that the drugs were not serious was incredible, since the evidence “show[ed] at most an arms-length relationship” between them: at [37]. Third, the Applicant had “no real basis to conclude that the drugs were ‘illegal Chinese medicine’”, as he had no real knowledge about such medicine: at [38]. Fourth, the “scale of the operations” and surreptitious nature of the transactions would have suggested to the Applicant that what he was carrying was more illegal and serious than illegal Chinese medicine: at [39]. Fifth, the Applicant had done two prior transactions and he had ample time to check what the drugs were, but the fact that he did not do so suggested that he was willing to ferry whatever drugs they were: at [40]. On the basis of the same evidence, the Trial Judge also found that the Applicant had not rebutted the s 18(2) presumption: at [43]. (d) The Trial Judge found that the Applicant was more than a mere courier: at [87]. In any event, the Prosecution did not provide a certificate of substantive assistance: at [47]. Therefore, the Trial Judge passed the mandatory death sentence on the Applicant: at [88]. 5 The Applicant appealed against his conviction and sentence. On 5 February 2016, the Court of Appeal, consisting of Andrew Phang Boon Leong JA, Kan Ting Chiu SJ and myself, dismissed the Applicant’s appeal inDatchinamurthy (CA), with oral decisions recorded in the Minute Sheet dated 5 February 2016. I set out the oral grounds here in full: This is the decision of the court. The issue in this case is whether the presumption under s 18 of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) has been rebutted. For the reasons set out in [36] to [42] of the Grounds of Decision, we agree with the finding of the trial judge that the appellant has not rebutted the presumption. We note the arguments of counsel for the appellant that there was no wilful blindness on the part of the appellant. On the facts of the case, we do not think that we need to take that route. The burden is on the appellant to rebut the presumption on the balance of probabilities and taking the entire evidence before the court we are satisfied that the presumption has not been rebutted. Accordingly, the appeal is dismissed. 6 On 21 January 2020, the President of the Republic of Singapore ordered the sentence of death imposed on the Applicant to be carried out on 12 February 2020. On 31 January 2020, the President ordered a respite of the execution pending any further order. For completeness, I would add that the Applicant has also been involved in a series of other proceedings that dealt with various other issues surrounding his execution. None of those other proceedings touch on the question of his conviction and they are thus not relevant to the present proceedings. 7 On 3 February 2021, the Applicant filed the present criminal motion. The Prosecution sought and was granted an extension of time to file its written submissions by 22 February 2021, which it did. Subsequently, the Applicant sought leave to submit a written reply, and I granted leave for him to do so. I state here for the avoidance of doubt that the Applicant did not have a right to file written reply submissions. The granting of leave in this case should not be taken as an indication that such leave will be granted as a matter of course in future applications of a similar nature. 8  On 15 March 2021, I also directed the parties to address the court, if they wished, on the Court of Appeal’s reasoning inDatchinamurthy (CA)as recorded in the Minute Sheet dated 5 February 2016, which both the Applicant and Prosecution had omitted to refer to in their submissions. I received their respective further submissions on 22 March 2021 and considered them in coming to my conclusions.",
        "The parties’ cases": "",
        "The Applicant’s case": "9 The Applicant’s position was based essentially on the Court of Appeal’s decision inGobi a/lAvedian v Public Prosecutor[2021] 1 SLR 180 (“Gobi”), in which the Court of Appeal held that the s 18(2) presumption did not include wilful blindness, and that wilful blindness as such should not “feature in the analysis of whether the s 18(2) presumption has been rebutted”:Gobiat [56]. Mr Ravi s/o Madasamy (“Mr Ravi”), counsel for the Applicant, deposed that the legal arguments relied upon in the application were the following:1Foot Note 1×Mr Ravi’s Affidavit at para 15. a. There was a failure by the prosecution at trial to distinguish between actual knowledge and wilful blindness in both fact and law. b. The Applicant had been wrongly presumed to be wilfully blind under s 18(2) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed). c. The burden had been wrongly placed on the Applicant to rebut wilful blindness on a balance of probabilities. d. There was limited, if any, evidential and legal analysis into each of the mixed questions of fact and law that must be proved in order to establish wilful blindness. e. Consequently, the trial judge had wrongly found that the Applicant was guilty because he had not rebutted the ‘presumption of wilful blindness’ pursuant to s 18(2) of the MDA. 10 In his submissions, the Applicant took the position that the Prosecution’s case against him at trial was one of “actual knowledge”.2Foot Note 2×Applicant’s Written Submissions (“AWS”) at paras 4.4–4.12.Indeed, he submitted that the Prosecution did not make reference to wilful blindness proper (as clarified inAdiliChibuike Ejike v Public Prosecutor[2019] 2 SLR 254 (“Adili”) andGobi). However, in the alternative,ifthe Prosecution’s case was not one of actual knowledge, but included wilful blindness as an alternative, the Applicant submitted that the procedural safeguards were not met as there was no distinct inquiry into whether the facts were sufficient to establish wilful blindness.3Foot Note 3×AWS at paras 4.15–4.19. 11 The Applicant also submitted that the Trial Judge’s legal analysis would differ significantly in the light ofGobi, as (a) no reference to wilful blindness should have been made in the context of analysing whether the s 18(2) presumption had been rebutted; (b) the case ofDinesh Pillai a/l K RajaRetnam v Public Prosecutor[2012] 2 SLR 903 (“Dinesh Pillai”)relied upon by the Trial Judge could not be taken to suggest that there was an objective inquiry; and (c) the criteria for wilful blindness would have been referred to specifically.4Foot Note 4×AWS at para 5.2.The Applicant then described the Trial Judge’s factual findings, concluding that the Judge “was satisfied that, even if the Applicant did not have knowledge of the nature of the drug, he was ‘at least suspicious’, and therefore he was ‘wilfully blind’ because he nonetheless proceeded with the delivery or failed to take further action to identify the true nature of the drug”.5Foot Note 5×AWS at para 5.8. 12 The Applicant then referred to the arguments he made when his appeal against the decision of the Trial Judge came up to the Court of Appeal inDatchinamurthy (CA), observing that one argument was that the Trial Judge’s findings of wilful blindness were inconsistent with the Prosecution’s case at trial of actual knowledge, and that the arguments raised on appeal anticipated those accepted inGobi. However, as the Court of Appeal did not, at the time, have the benefit of the reasoning in the later judgments inAdiliandGobi, the Applicant’s arguments must have been rejected.6Foot Note 6×AWS at paras 6.1–6.2.The Applicant also alluded to the fact that in the Prosecution’s case on appeal, the Prosecution had insisted  that its case at trial included wilful blindness as a legal equivalent of knowledge.7Foot Note 7×AWS at paras 6.4–6.5.However, the Prosecution had failed to distinguish between actual knowledge and wilful blindness, combined the s 18(2) presumption with the allegation of wilful blindness, and also mischaracterised wilful blindness.8Foot Note 8×AWS at paras 6.6–6.10.The Applicant argued that the Prosecution’s submissions on appeal would now be rejected in the light ofGobi.9Foot Note 9×AWS at para 6.11. 13 In coming to the Court of Appeal’s judgment inDatchinamurthy (CA), the Applicant argued that in the absence of a written judgment, it could be assumed that “some or all of the arguments” proposed by the Prosecution at the hearing of the appeal were accepted, or at least, that the Applicant’s submissions were rejected.10Foot Note 10×AWS at para 7.1.However, the arguments raised by the Applicant that (a) wilful blindness would play no part in the application of the s 18(2) presumption; and (b) thatDinesh Pillaidid not give rise to an objective inquiry, have since been accepted inAdiliandGobi, and the result of the Applicant’s appeal would have been “fundamentally different”.11Foot Note 11×AWS at para 7.3. 14 Hence, it should now be recognised that there was “procedural and substantive unfairness” in the Applicant’s trial that gave rise to a miscarriage of justice. First, the Prosecution should have made it clear that they were running alternative cases of actual knowledge and wilful blindness at trial. Second, the question of whether the s 18(2) presumption was rebutted and whether the Applicant was wilfully blind would have been two distinct inquiries. Third, the Prosecution’s understanding of wilful blindness was misguided or unclear, such that the case against the Applicant was unclear. Fourth, the Trial Judge had found (contrary to the principles articulated inGobi) that the s 18(2) presumption was not rebutted because he was wilfully blind. Fifth, the facts would have been insufficient to establish wilful blindness.12Foot Note 12×AWS at para 8.1.Sixth, on the facts, the Applicant would have been acquitted. The Trial Judge did not make a finding that the Applicant possessed actual knowledge and, from his reasoning, could be assumed to have found that the Applicanthadshown that he did not have actual knowledge.13Foot Note 13×AWS at para 8.3.Insofar as the Trial Judge based his finding on wilful blindness, the Judge was not entitled to do so as the Prosecution’s case was one of actual knowledge. Further, the Trial Judge had failed to apply the criteria of wilful blindness. Finally, the evidence adduced at trial was insufficient to make a finding that the Applicant was wilfully blind.14Foot Note 14×AWS at para 8.4. 15 The Applicant therefore submitted that in the exercise of the power under s 390(2) and (4) of the CPC and upon a review of its earlier decision, the Court of Appeal should now convict him only on a substituted charge of attempted trafficking of a Class C controlled drug.15Foot Note 15×AWS at para 9.3. 16 In his reply, the Applicant essentially argued that the Prosecution’s  case at trial and on appeal should not have been accepted. He maintained that the Prosecution’s only legitimate case at trial was that of actual knowledge, and that there was no properly framed case of wilful blindness. The Prosecution had amistakenunderstanding of wilful blindness and the Trial Judge’s findings of wilful blindness would have been based on that same misunderstanding.16Foot Note 16×Applicant’s Reply Submissions at paras 3.4, 3.6, and 3.7.The Trial Judge had not made an express finding that the Applicant had actual knowledge or that the Applicant had notdisprovedactual knowledge.17Foot Note 17×Applicant’s Reply Submissions at para 4.1.The Prosecution’s characterisation of its case in these proceedings conflicted with how it had characterised its case at the appeal hearing inDatchinamurthy (CA), where it defined wilful blindness in an extended sense.18Foot Note 18×Applicant’s Reply Submissions at paras 5.2 and 5.6.The Applicant also took issue with the Prosecution’s reference to “indifference”, arguing that this was inconsistent with a case of actual knowledge and, in any event, had not been properly put to the Applicant at trial.19Foot Note 19×Applicant’s Reply Submissions at paras 7.5 and 7.6. 17 In response to the court’s specific direction on 15 March 2021, the Applicant filed further submissions in which he argued that the Court of Appeal’s findings inDatchinamurthy (CA)were “ambiguous as to whether it found that the Applicant had not rebutted the presumption of actual knowledge” under s 18(2) of the MDA.20Foot Note 20×Applicant’s Further Submissions at para 4.The Court of Appeal did not criticise the Trial Judge’s findings that the Applicant had turned a blind eye or the Trial Judge’s approach which treated “suspicion and the Applicant’s ineffective inquiries to be sufficient basis for him to conclude” that the s 18(2) presumption had not been rebutted, and instead accepted the findings of the Trial Judge.21Foot Note 21×Applicant’s Further Submissions at paras 6–8.Had the Court of Appeal disagreed with the mistaken reference to wilful blindness and found on its own assessment that the Applicant had not rebutted the presumption of actual knowledge, one would expect the Court to have issued a “reasoned judgment”. However, since the approach based onDinesh Pillaiwas “trite” at the time, there was no reason for the Court to have provided detailed reasons.22Foot Note 22×Applicant’s Further Submissions at para 9.The Applicant submitted that, in any event, in the absence of a full written judgment , it was “unwise to rely on the abbreviated views” of the Court of Appeal inDatchinamurthy (CA).23Foot Note 23×Applicant’s Further Submissions at para 10.",
        "The Prosecution’s case": "18 The Prosecution submitted that the application for leave should be summarily dismissed. The Prosecution’s arguments centred on the element of miscarriage of justice, arguing that no miscarriage of justice has arisen in the present case.24Foot Note 24×Prosecution’s Written Submissions (“PWS”) at para 22.First, the Prosecution’s case at trial was one of actual knowledge and relied on the s 18(2) presumption. The Applicant himself accepted this, and there was no confusion as to the case that the Applicant had to meet. The Prosecution’s case on appeal was also one of actual knowledge. Second, the Trial Judge found that the s 18(2) presumption was not rebutted, butnoton the basis of wilful blindness in the extended sense. The use of the phrase “turned a blind eye” was consistent with the authorities and only referred to the Applicant’s “evident indifference” as to what he was delivering, which prevented him from rebutting the s 18(2) presumption. 19 In response to the specific direction given on 15 March 2021, the Prosecution also filed further submissions in which it argued that the reasons in the Minute Sheet reinforced its position thatthe application for a review was baseless. The Court of Appeal inDatchinamurthy (CA)was clear in its approach to the s 18(2) presumption as a distinct route from the doctrine of wilful blindness, and it made plain that wilful blindness was not the basis of its decision to uphold the conviction, as that conclusion was reached on the basis of all the evidence adduced at trial.25Foot Note 25×Prosecution’s Further Submissions at para 3.Hence, there was no miscarriage of justice.26Foot Note 26×Prosecution’s Further Submissions at paras 5–6.There was no confusion about the Prosecution’s case at trial.27Foot Note 27×Prosecution’s Further Submissions at para 7.The Applicant was therefore also unable to show that the Court of Appeal’s basis for upholding his conviction was erroneous.28Foot Note 28×Prosecution’s Further Submissions at paras 9–12.",
        "Applicable law": "20 Division 1B of Part XX of the CPC provides for a mechanism by which an earlier decision of an appellate court may be reviewed. There is no dispute that the decision of the Court of Appeal inDatchinamurthy (CA)is susceptible to review: see s 394G(1)(a) of the CPC. Under s 394H, before making a review application, the applicant must apply to the appellate court for, and obtain, leave to do so. The present application is an application for leave to commence the review application. 21 As the Court of Appeal stated inKreetharans/o Kathireson v Public Prosecutor and other matters[2020] 2 SLR 1175 (“Kreetharan”) at [17], only an application that discloses a “legitimate basis for the exercise of this court’s power of review” should be allowed to proceed. In order to determine if such a legitimate basis exists, the court hearing the leave application would have to consider the requirements for a review application prescribed in s 394J of the CPC (see alsoMoadFadzir bin Mustaffa v Public Prosecutor[2020] 2 SLR 1364 at [10];ChanderKumar a/l Jayagaran v Public Prosecutor[2021] SGCA 3 at [14]). 22 Under s 394J(2) of the CPC, the applicant in a review application has to demonstrate to the appellate court that there is sufficient material on which  the appellate court may conclude that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made (see alsoGobiat [24]). The requirement ofsufficiencyis set out in s 394J(3) of the CPC, as follows: (3) For the purposes of subsection (2), in order for any material to be ‘sufficient’, that material must satisfy all of the following requirements: (a) before the filing of the application for leave to make the review application, the material has not been canvassed at any stage of the proceedings in which the criminal matter in respect of which the earlier decision was made; (b) even with reasonable diligence, the material could not have been adduced in court earlier; (c) the material is compelling, in that the material is reliable, substantial, powerfully probative, and capable of showing almost conclusively that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made. 23 As the Court of Appeal observed inSyed Suhail bin Syed Zin v Public Prosecutor[2021] 1 SLR 159 at [18], these arecumulativeconditions and “[t]he failure to satisfyanyof these requirements will result in the dismissal of the review application” [emphasis in original]. Where the new material consists of new legal arguments, s 394J(4) of the CPC also provides an additional requirement: (4) For the purposes of subsection (2), in order for any material consisting of legal arguments to be ‘sufficient’, that material must, in addition to satisfying all of the requirements in subsection (3), be based on a change in the law that arose from any decision made by a court after the conclusion of all proceedings relating to the criminal matter in respect of which the earlier decision was made. 24 The requirement that the court must conclude that there has been amiscarriage of justiceis elaborated in ss 394J(5)–(7) of the CPC which read: (5) For the purposes of subsection (2), the appellate court may conclude that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made, only if — (a) the earlier decision (being a decision on conviction or sentence) is demonstrably wrong; or (b) the earlier decision is tainted by fraud or a breach of the rules of natural justice, such that the integrity of the judicial process is compromised. (6) For the purposes of subsection (5)(a), in order for an earlier decision on conviction to be ‘demonstrably wrong’ — (a) it is not sufficient that there is a real possibility that the earlier decision is wrong; and (b) it must be apparent, based only on the evidence tendered in support of the review application and without any further inquiry, that there is a powerful probability that the earlier decision is wrong. (7) For the purposes of subsection (5)(a), in order for an earlier decision on sentence to be ‘demonstrably wrong’, it must be shown that the decision was based on a fundamental misapprehension of the law or the facts, thereby resulting in a decision that is blatantly wrong on the face of the record. 25 At this juncture I should underscore the point that, as a matter of law, the review process provided under Division 1B of Part XX of the CPC is directed at the earlier decision of the appellate court, in this case, the decision of the Court of Appeal inDatchinamurthy (CA). Section 394F(1) of the CPC defines the relevant decision as the “earlier decision of an appellate court”. Under s 394G(1), the review application is again directed to the “earlier decision of an appellate court”. Section 394J(5) defines miscarriage of justice in the criminal matter in relation to the earlier decision as being established only if “the earlier decision” is demonstrably wrong (s 394J(5)(a)) or was tainted by fraud or breach of the rules of natural justice (s 394J(5)(b)). The focus of any application for leave to commence a review application should, therefore, be on the relevantappellate court’sdecision (which, in the present instance, wouldbeDatchinamurthy (CA)), which is the decision that must be shown to be demonstrably wrong to establish a miscarriage of justice.",
        "Issues to be determined": "26 The Prosecution did not appear to dispute that the legal principles articulated by the Court of Appeal inGobiconcerning wilful blindness and the s 18(2) presumption would constitute “sufficient” material within the meaning of ss 394J(3) and (4) of the CPC. The central issue in this case is whether there is a miscarriage of justice in the Applicant’s case arising from the earlier decision of this court inDatchinamurthy (CA). In order to determine this issue, the parties have raised various arguments about the entire history of the Applicant’s case, from trial to appeal. However, with respect to both parties, not all of these arguments were relevant to the central issue in this case. In the following paragraphs, I will deal with the arguments concerning three key aspects of the prior proceedings: (a) the Prosecution’s case at trial; (b) the Trial Judge’s decision; and (c) the Court of Appeal’s decision inDatchinamurthy (CA). 27 In summary, I find that the Prosecution’s case at trial was one of actual knowledge. I also find that the Trial Judge’s decision cannot be faulted on the grounds raised by the Applicant. In any event, and more importantly, the relevant decision under consideration is not the Trial Judge’s decision but the decision inDatchinamurthy (CA), and no miscarriage of justice is disclosed in that decision.",
        "Analysis": "",
        "The Prosecution’s case at trial": "28 The Applicant and Prosecution are in agreement that the Prosecution’s case at trial was one of actual knowledge. This is apparent from the Prosecution’s cross-examination of the Applicant:29Foot Note 29×See PWS at para 25. Q Now, I’m putting to you, witness, when you delivered the five packets to Christeen on the 18th of January 2011, you knew you were delivering heroin to her. A I disagree. … Q And lastly, if you had not---sorry, on the---on the issue of knowledge, you did not ask Rajah or Lan, also known as Boy, or Christeen, any questions on what you were delivering because you already knew what you were in fact dealing with, which is heroin. A I disagree. 29 There is, however, a dispute over the nature and relevance of the references to “wilful blindness” in the Prosecution’s written submissions. The Applicant appeared to take the position that the references to “wilful blindness” were, in effect, a defective attempt to rely on the extended sense of “wilful blindness”. In that sense, a “properly framed case of wilful blindness when judged according to the law as it is now understood (as a result ofAdiliandGobi) was not mounted,”30Foot Note 30×Applicant’s Reply Submissions at para 3.6.and the Prosecution’s attempt to do so was an error of law. 30 I accept that there was some ambiguity in the language used in the Prosecution’s written submissions. However, in any event, the Prosecution’s case is defined by its caseat trialand not, in the final analysis, by its submissions. As this court observed inGobiat [111]: … [E]ven if the Submissions suggest that the Prosecution’s case at the trial was one of actual knowledge, the Prosecution’s case must, in the final analysis, be informed by what was put to the Applicant and how the Prosecution crystallised its case at the end of the cross-examination. 31 The same principle applies here. The determinative factor is how the Prosecution had run its case during cross-examination. On this point, the Applicant accepts that the only case run by the Prosecution during cross-examination was one of actual knowledge. It is pertinent to note that at paras 4.4–4.5 of his written submissions (in relation to the present application), the Applicant had clearly taken the position that the Prosecution’s case at trialduring cross-examinationwas one of actual knowledge. There is no suggestion that the Prosecution’s case during cross-examination was one of wilful blindness. Indeed, one of the Applicant’s arguments is that the Prosecution’s case could not properly have been one of wilful blindness because that was never put to the Applicant at trial.31Foot Note 31×Applicant’s Written Submissions at para 4.13.The Applicant has not been able to point to any part of the record to show that the cross-examination was conducted on the basis of wilful blindness. 32 Indeed, the Applicant knew at all times that the case that he had to meet was one of actual knowledge. This is evident from what the Applicant had argued before the Court of Appeal inDatchinamurthy (CA). At the very outset of the Applicant’s submissions on appeal, it was argued:32Foot Note 32×See paras 1, 5–7 of the Appellant’s Written Submissions in CA/CCA 8/2015. Can it be said that the Appellant’s conviction of a capital charge of trafficking in Diamorphine is safe where: (a) the case put to the Appellant during cross-examination was not the case submitted by the Prosecution in its closing submissions (actual knowledge vs wilful blindness); (b) arising from the Prosecution’s change in its case (as mentioned above), not only was the Appellant deprived of the opportunity to answer to the allegation of wilful blindness, but the Prosecution had failed to establish the constituent elements to support a finding of wilful blindness (the high threshold level of suspicion founded on targeted facts coupled with a deliberate decision to turn a blind eye); … It was clearly the Applicant’s position inDatchinamurthy (CA)that the Prosecution’s case during cross-examination was one of actual knowledge, but that the Prosecution haddeparted from its case at trialin its submissions by relying on wilful blindness. 33 I therefore find that the case run by the Prosecution at trial was that of actual knowledge.",
        "The Trial Judge’s decision": "34 I turn then to consider the Trial Judge’s decision. The Applicant contends that the Trial Judge had made his decision on the basis of wilful blindness. The Prosecution, however, sought to characterise the Trial Judge’s assessment as one relating to the Applicant’s credibility, and argued that the Trial Judge did not make any finding that the Applicant was wilfully blind in the extended sense. As I have observed above, the Applicant must show a miscarriage of justice arising not from the High Court’s decision, but the Court of Appeal’s. However, as the matter has been canvassed before me on this basis and for completeness, I will also provide my views on whether the Trial Judge’s decision can be shown to be demonstrably wrong for the purposes of establishing a miscarriage of justice. 35 In my judgment, this inquiry should not focus only on the phrases that were used, especially since the law has developed (subsequent to the earlier decisions in the Applicant’s case), but on the substance of the analysis and findings. For example, as the Court of Appeal inGobirecognised at [73], the phrase “could not reasonably be expected to have known” inDinesh Pillaiwas capable of taking on a permissible meaning (where it is taken in the context of subjective inquiry and in the context of an allegation ofindifference), or an impermissible meaning (if it is taken to import an objective test: see [74]). A phrase like “turned a blind eye” is also capable of having a permissible and an impermissible sense in this context (Gobiat [73]). The central question is whether the Trial Judge had made a finding or framed his analysis on the basis that the Applicant did not subjectively know the nature of the drugs. That is the crux of the distinction between actual knowledge and wilful blindness (which falls short of actual knowledge but is treated as its legal equivalent):Adiliat [47]. 36 The Trial Judge discussed how the s 18(2) presumption could be rebutted as follows (Datchinamurthy (HC)at [20]): To rebut the presumption of knowledge in the context of s 18(2) of the MDA, they must prove on a balance of probabilities that they did not know or could not reasonably be expected to have known that the thing in their possession contained that controlled drug (Dinesh Pillai a/l K RajaRetnam v Public Prosecutor[2012] 2 SLR 903 at [21]).Knowledge will be established under the doctrine of wilful blindness if they had a strong suspicion that they were carrying diamorphine but had turned a blind eye to that fact.[emphasis added] 37 Following that, the Trial Judge’s first summary finding of fact was stated at [35] ofDatchinamurthy (HC): However, based on the evidence which follows, it was clear to me that Datchinamurthy had at least a strong suspicion that he was carrying diamorphine and that he turned a blind eye to it. In this paragraph, I accept the Applicant’s contention that the Trial Judge had not made an express finding that the Applicant knew the nature of the drugs. However, subsequently, the Trial Judge made anadditionalfinding at [43]: Based on all the evidence above, I wasalsosatisfied that the presumption of knowledge operated against Datchinamurthy and that he failed to rebut it on a balance of probabilities. [emphasis added] 38 The use of the word “also” in [43] has to be duly recognised. The Trial Judge’s reasoning shows that the same evidence described at [36] to [42] ofDatchinamurthy (HC)gave rise totwoconclusions, first, that the Applicant hadat leasta strong suspicion that he was carrying diamorphine and that he turned a blind eye to it, and second, that the Applicant was unable to rebut the s 18(2) presumption on a balance of probabilities. Even if I accepted that the former was a finding of wilful blindness in the extended sense, the latter was not, on the Trial Judge’s reasoning, based on any finding of wilful blindness, but simply on the evidence discussed at [36] to [42]. Hence, I could not agree that the Trial Judge had thereby conflated wilful blindness with the s 18(2) presumption. The question, ultimately, must be whether the evidence referred to at [36] to [42] ofDatchinamurthy (HC)and the Trial Judge’s reasoning based on that evidence showed that the Trial Judge had misunderstood how wilful blindness related to the s 18(2) presumption or had improperly imported an objective test to assess whether the Applicant could rebut the presumption. 39 In my judgment, there was nothing in the Trial Judge’s reasoning at [36] to [42] ofDatchinamurthy (HC)that showed that the Trial Judge had concluded that the s 18(2) presumption was not rebutted because the Applicant was wilfully blind or because he had failed to act reasonably on an objective standard. On the contrary, his analysis of the facts was entirely consistent with a case of actual knowledge and, in the final analysis, focused on the Applicant’s subjective state of mind. (a) The Trial Judge’s finding that the Applicant was rewarded generously for his involvement (at [36]) could go towards both (i) the lack of credibility in the Applicant’s claim not to know what he was deliveringor(ii) giving grounds for a targeted suspicion as to the nature of the drugs. However, in the final sentence of that paragraph, the Trial Judge then stated: “It seems that he wasfully awarethat he was carrying something which, if he was caught, would attract a capital charge” [emphasis added]. That last sentence directs attention to the Applicant’s subjective knowledge of the nature of the drugs. (b) The Trial Judge also found that the Applicant’s claim that he believed Rajah’s assurances that the drugs were not serious was “incredible” given the Applicant’s relationship with Rajah (at [37]). This is consistent with an analysis of actual knowledge, since the Trial Judge was rejecting the Applicant’s claim that he believed that what he was carrying was not serious. (c) The Trial Judge then rejected the Applicant’s claim that he believed that the drugs were “illegal Chinese medicine” (at [38]). This supports a case of actual knowledge, since if the Applicant’s assertion of what he believed he was carrying was rejected, it would follow that the Applicant could not prove that hedid not knowthe nature of the drugs. (d) The Trial Judge then considered the Applicant’s knowledge of “the scale of the operations and the furtiveness of the transactions”, from which the Trial Judge concluded: “I cannot see how Datchinamurthy did not think that these drugs were highly illegal” (at [39]). In other words, the Trial Judge found that the Applicantdidthink that the drugs were highly illegal. This went to the Applicant’s subjective knowledge of the nature of the drugs. (e) The Trial Judge discussed the fact that the Applicant had time to check what the drugs were but did not, finding that this was “because he was willing to ferry the drugs around Singapore regardless of what they were” (at [40]). This statement suggests that the Applicant wasindifferentto the nature of the drugs, which the Court of Appeal inGobihas clarified is well within the scope of the analysis of whether the s 18(2) presumption has been rebutted. An accused person who is indifferent to what he is carrying “cannot be said to believe that the nature of the thing in his possession is something other than or incompatible with the specific drug he is in possession of”, since he had not formed any view of what the item in his possession is or is notGobiat [65]. In the light of the above finding, having rejected the Applicant’s defence of what he believed the items to be, the Trial Judge appears to suggest at [40] that, at the very least, the Applicant had not applied his mind to forming a positive view of the exact nature of the drugs, although he believed them to be highly illegal and attracting the death penalty. 40 The above clearly shows that the Trial Judge at no point concluded that the Applicant did not know the nature of the drugs, or that the Applicant’s purported belief that the items were Chinese medicine could be accepted as fact. The Trial Judge did not impose an objective test either, but focused on the inferences that could be drawn from the evidence. He had rejected the Applicant’s claims to believe that the items were illegal Chinese medicine (at [38]) and that they were not “serious” (at [37]), found that the Applicantdidbelieve that the items were illegal (at [39]) and that if he was caught with the item that “wouldattract a capital charge” [emphasis added] (at [36]), and was at least indifferent to the exact nature of the drug (at [40]). He did not find in his analysis that the Applicant didnotknow the nature of the drugs or that the Applicant actually believed that the items were something other than diamorphine. Each of the reasons identified by the Trial Judge was consistent with the Court of Appeal’s guidance inGobiconcerning how the s 18(2) presumption should be analysed. 41 Therefore, none of the principles of law raised by the Applicant could be said to show that the Trial Judge’s decision was demonstrably wrong.",
        "The Court of Appeal’s decision": "42 In any event, even if I took the Applicant’s case at its very highest, and assumed that both the Prosecution and the Trial Judge had erred in applying an analysis of wilful blindness to the s 18(2) presumption, this would not get the Applicant far enough. This is because the Court of Appeal’s decision inDatchinamurthy (CA), which is the “earlier decision” that would be under review, cannot be shown to be demonstrably wrong, giving rise to a miscarriage of justice. It is convenient to set out again the Court of Appeal’s reasons for dismissing the appeal: This is the decision of the court. The issue in this case is whether the presumption under s 18 of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) has been rebutted. For the reasons set out in [36] to [42] of the Grounds of Decision, we agree with the finding of the trial judge that the appellant has not rebutted the presumption. We note the arguments of counsel for the appellant that there was no wilful blindness on the part of the appellant. On the facts of the case, we do not think that we need to take that route. The burden is on the appellant to rebut the presumption on the balance of probabilities and taking the entire evidence before the court we are satisfied that the presumption has not been rebutted. Accordingly, the appeal is dismissed. 43 Mr Ravi submitted that the reasoning was still ambiguous as to whether the s 18(2) presumption dealt with actual knowledge. With all due respect to Mr Ravi, I was unable to accept his interpretation of the Court of Appeal’s reasoning. The Court of Appeal’s decision not to pursue an analysis of wilful blindness was made in the context of extensive arguments on wilful blindness by both the Applicant and the Prosecution on appeal. Given the submissions on wilful blindness that were made, this court’s reasoning cannot be taken for anything other than what it says explicitly, that it declined to take the path of analysing whether the Applicant was wilfully blind or not. Further, the Court of Appeal’s adoption of [36] to [42] ofDatchinamurthy (HC)did not involve an adoption of any concept of wilful blindness or an objective test. As stated above, the Trial Judge’s analysis of the evidence in those paragraphs is entirely consistent with an analysis of actual knowledge. There is no reason to second-guess the Court of Appeal’s reasoning given the express reasons given in the oral judgment. In my opinion, this court’s reasoning inDatchinamurthy (CA)was based simply on a finding that the evidence prevented the Applicant from proving that he did not know the nature of the drugs, and thereby, prevented him from rebutting the s 18(2) presumption. 44 Hence, having regard to the actual decision of the Court of Appeal inDatchinamurthy (CA), all of the various arguments on the alleged errors of the Prosecution and Trial Judge fall away. Far from there being an error in the earlier decision of the Court of Appeal, all the arguments advanced by the Applicant in this application (taking them at their highest) in fact show that the Court of Appeal’s decision inDatchinamurthy (CA)was correct. Even if I accepted the Applicant’s submissions that the Prosecution and Trial Judge had erred in their reliance on wilful blindness, that in truth leads to the conclusion that the Court of Appeal was correct to reject any reliance on wilful blindness. Instead, what the Court of Appeal had done, and correctly, was to decide the appeal on the basis of the entire evidence adduced at trial, and consistently with the Prosecution’s case which was one of actual knowledge. 45 It was clearly open to the Court of Appeal to take this approach. First, the Prosecution’s case at trial was one of actual knowledge, as the parties in the present proceedings both agree upon. Second, the Trial Judge’s findings on which the Court of Appeal relied were entirely consistent with and supported an analysis based on actual knowledge. Hence, when the Court of Appeal cited the Trial Judge’s reasoning at [36]–[42] ofDatchinamurthy (HC), it was not conflating wilful blindness and s 18(2) of the MDA. Instead, since the reasoning was consistent with a case of actual knowledge, the Court of Appeal was adopting the same reasons to conclude that the s 18(2) presumption was not rebutted. 46 It is useful here to distinguish the decision inGobifrom the present application.In that case, the Court of Appeal found that the Prosecution’s case at trial was in fact one of wilful blindness, in that the Prosecution’s case was that the accusedbelievedwhat he had been told about the items in question and did not, therefore, know the nature of the drugs:Gobiat [117]. The Prosecution was not at will to change its case to one of actual knowledge on appeal since, given the clarifications that have been provided inGobiitself, the case of actual knowledge advanced at the appeal wasinconsistentwith the case of wilful blindness that was run at trial. This switch prejudiced the accused in that case as he had never been “squarely confronted with the case that he did not in fact believe” what he had been told about what he was doing:Gobiat [120]. Furthermore, because its case was one of wilful blindness, the Prosecution was prevented from relying on the s 18(2) presumption:Gobiat [121]. 47 However, the Court of Appeal’s prior reasoning in allowing the Prosecution’s appeal and convicting the accused inGobiwasbased onits finding that the accused had failed to rebut the presumption ofactual knowledgeunder s 18(2) of the MDA. That could not form the basis of the accused’s conviction because the Prosecution’s case of actual knowledge was not properly put to the accused and further because the Prosecution’s case of wilful blindness foreclosed reliance on the s 18(2) presumption. Therefore, the Court of Appeal had to consider, on the review application, whether the Prosecution’s true case at trial, that the accused was wilfully blind, was established on the facts:Gobiat [122]. The Court of Appeal concluded that this case was not made out (Gobiat [124]), and it therefore set aside the conviction on the capital charge and convicted the accused on the amended charge (Gobiat [128]). 48 The key distinction to note in the present application is that the Court of Appeal’s findings inDatchinamurthy (CA)were based on a case that was actually run by the Prosecution at trial. Hence, no prejudice was caused to the Applicant. Furthermore, that case was entirely consistent with the use of the s 18(2) presumption as the case was one ofactualknowledge and not wilful blindness. Hence, none of the principles relating to wilful blindness and the s 18(2) presumption would have made any difference to thereasoninganddecisionof the Court of Appeal inDatchinamurthy (CA). The Applicant has not shown that the decision inDatchinamurthy (CA)is wrong. 49 The Court of Appeal’s decision inDatchinamurthy (CA)was simply a decision that the s 18(2) presumption was not rebutted on the facts, without reference to wilful blindness.  This was the same case that the Prosecution had run at trial. There is no basis for concluding, even taking the Applicant’s case at its highest, that the Court of Appeal’s decision inDatchinamurthy (CA)was demonstrably wrong. Therefore, the Applicant cannot show that there was a miscarriage of justice in his case.",
        "Conclusion": "50 Under s 394H(7) of the CPC, the court may summarily dismiss an application for leave to commence a review application. Before it does so, it must consider the applicant’s written submissions (if any) and may consider the Prosecution’s written submissions (if any): s 394H(8) of the CPC. Having considered the written submissions tendered by the Applicant and Prosecution, including a reply submission from the Applicant, and the further submissions of parties pursuant to the court’s specific direction given on 15 March 2021, I find that the Applicant has failed to show any legitimate basis for this court to  exercise its power of review of its earlier decision. The application is therefore summarily dismissed.     Chao Hick Tin Senior Judge Ravi s/o Madasamy (Carson Law Chambers) for the applicant; Anandan Bala, Marcus Foo and Lee Zu Zhao (Attorney-General’s Chambers) for the respondent."
    }
}