{
    "case_title": "Nazeri bin LajimvPublic Prosecutor",
    "ncitation": "[2021] SGCA 41",
    "coram": "Tay Yong Kwang JCA:",
    "sections": {
        "Introduction": "1 The applicant was convicted in 2017 by the High Court on a capital charge of possessing two bundles of drugs containing not less than 33.39g of diamorphine for the purpose of trafficking. He was sentenced to the mandatory death penalty pursuant to s 33(1) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“MDA”). His appeal against his conviction and sentence was dismissed by the Court of Appeal in CA/CCA 42/2017 (“CCA 42/2017”) on 4 July 2018. 2 In this criminal motion, the applicant seeks the court’s leave pursuant to s 394H of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”) to file an application for review of the Court of Appeal’s decision in CCA 42/2017. Pursuant to s 394H(6)(a) of the CPC, such a leave application is to be heard by a single Justice of the Court of Appeal. 3 The applicant raises several grounds in support of his application, including purportedly new legal arguments based on changes in the law, allegations of inadequate legal assistance from his former defence counsel and new evidence in the form of a psychiatric report obtained after the appeal was concluded.",
        "Background facts and procedural history": "4 The applicant claimed trial to the following charge: That you … on 13 April 2012, at about 5.05 a.m., at the junction of Anguilla Park and Orchard Road, Singapore, along the pavement near Far East Shopping Centre, did traffic in a Controlled Drug specified in Class ‘A’ of the First Schedule of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (‘the Act’),to wit, by having in your possession for the purpose of trafficking, two (2) bundles containing a total of 906.4 grams of granular/powdery substance which was analysed and found to contain not less than 35.41 grams of diamorphine, without any authorisation under the Act or the regulations made thereunder, and you have thereby committed an offence under s 5(1)(a) read with 5(2) and punishable under s 33(1) of the Act, and further upon your conviction under s 5(1)(a) of the Act, you may alternatively be liable to be punished under s 33B of the Act. 5 The applicant was tried jointly with one Dominic Martin Fernandez (“Dominic”). Dominic was charged with trafficking the drugs in question by delivering the two bundles to the applicant. 6 The applicant did not dispute possession of the two bundles or that the bundles contained diamorphine. He also did not dispute that some of the drugs in the bundles were meant to be repackaged and sold.The applicant’s primary defence was that he had ordered only a 400g bundle of heroin (a street name for diamorphine) but Dominic delivered the two bundles weighing 453g and 453.4g respectively to him. He also claimed that a portion of the drugs in the 400g bundle was meant for his own consumption and that he had intended to sell only about 13.318g of the diamorphine. If so, the amount of diamorphine that was in his possession for the purpose of trafficking was below the threshold amount of 15g for a capital offence. 7 The High Court (“the Judge”) convicted both the applicant and Dominic inPublic Prosecutor v Dominic Martin Fernandez and another[2017] SGHC 226 (“the Judgment”). The Judge found that the applicant had ordered the two bundles of heroin that he received from Dominic. Although the Judge rejected the applicant’s testimony at trial that he would have kept ten or 12 packets, each containing 8g of diamorphine, for his own consumption, the Judge accepted the applicant’s admission in his investigation statement that he would have kept five such packets for his own consumption. The Judge held that based on the evidence, the two bundles would have yielded at least 116 such packets. Deducting five packets from the total, 111 packets would have been meant for trafficking. Calculating from the total diamorphine content as stated in the charge, the 111 packets would have contained about 33.89g of diamorphine (35.41g x 111 ÷ 116). There was a mistake in an earlier computation during the trial which arrived at the amount of 33.39g instead of the correct amount of 33.89g. The Judge held that the use of the incorrect lower weight did not prejudice the applicant. The Judge therefore convicted the applicant of trafficking in the lower amount of 33.39g of diamorphine by having the drugs in his possession for the purpose of trafficking (the Judgment at [51]–[54]). 8 The mandatory death penalty was imposed on the applicant because he could not fulfil any of the requirements for alternative sentencing under s 33B of the MDA. However, Dominic fulfilled the requirements under s 33B(2) of the MDA and was sentenced to life imprisonment and 15 strokes of the cane. 9 On 4 July 2018, the Court of Appeal (comprising Andrew Phang JCA, Chao Hick Tin SJ and me) dismissed the applicant’s appeal against his conviction and sentence by way of an oral judgment in CCA 42/2017. The Court of Appeal upheld the Judge’s finding that the applicant had ordered two bundles of drugs. The Court of Appeal agreed with the Judge that the applicant would have kept, at best, only five packets for his own consumption and that the claim of 12 packets was a belated attempt at inflating his drug consumption. The Court of Appeal also found it unbelievable that the applicant would have consumed so much of the drugs given his lack of financial means which drove him to drug-trafficking in the first place. It opined that even if the applicant had ordered only one bundle of drugs and assuming that bundle was the one with the lower diamorphine content of 17.11g instead of the other with 18.3g, the defence of consumption would not have reduced the weight of the diamorphine trafficked to below 15g.",
        "The parties’ arguments": "",
        "The applicant’s arguments": "10 In this application, the applicant raises four main grounds which are summarised as follows: (a) The applicant contends that the Judge relied erroneously on Dominic’s confession in finding that he had ordered two bundles of drugs. The applicant highlights that the Judge was not permitted to do so under s 258(5) of the CPC then in force and asserts thatRamesha/l Perumal v Public Prosecutor and another appeal[2019] 1 SLR 1003 (“Ramesh”)occasioned a change in the law in this regard. (b) The applicant citesRameshand argues that he had intended to traffic only one bundle of drugs as he had intended to return the second bundle to his supplier. (c) The applicant alleges that his former defence counsel at the trial and at the appeal, Mr James Masih (“Mr Masih”), provided inadequate legal assistance, thereby resulting in a miscarriage of justice. (d) The applicant seeks to adduce a new medical report from a psychiatrist, Dr Ken Ung (“Dr Ung”), to support his claim that he would have kept 12 rather than five packets of heroin for his own consumption.",
        "The Prosecution’s arguments": "11 The Prosecution submits that the application should be dismissed as the applicant has not shown that there is sufficient material on which this court may conclude that there has been a miscarriage of justice in respect of the decision in CCA 42/2017. The Prosecution’s arguments in respect of each of the grounds raised by the applicant can be summarised as follows: (a)Rameshdid not give rise to a change in the law but simply affirmed the proper construction of s 258(5) of the CPC. In any event, even if Dominic’s confession were to be disregarded, there was still sufficient evidence to show that the applicant had ordered two bundles of drugs. (b) There is no evidence to show that the applicant had intended to return anyof the bundles to his supplier. Accordingly, his reliance on the bailment defence set out inRameshis misplaced. (c) The applicant’s allegations of inadequate legal assistance are not based on any change in the law. Moreover, the alleged deficiencies in Mr Masih’s conduct of the applicant’s defence were not the result of egregious incompetence on Mr Masih’s part. Instead, Mr Masih had made various strategic decisions in cross-examination so as to minimise the damage caused by the applicant’s own inconsistent evidence. Further, Mr Masih’s conduct of the trial did not prejudice the applicant in any way. (d) Dr Ung’s report is of limited utility as it was prepared some eight years after the applicant’s arrest. More importantly, Dr Ung’s report is not “compelling” material as it is devoid of reasoning and rests heavily on the veracity of the account provided by the applicant.",
        "The applicable legal principles": "12 For leave to be granted, the applicant must show a “legitimate basis for the exercise of the court’s power of review” (seeKreetharans/o Kathireson v Public Prosecutor and other matters[2020] 2 SLR 1175 at [17] andMoadFadzir bin Mustaffa v Public Prosecutor[2020] 2 SLR 1364 at [10]). Such a legitimate basis will only be disclosed if the following stringent requirements in s 394J of the CPC are met: (2) The applicant in a review application must satisfy the appellate court that there is sufficient material (being evidence or legal arguments) on which the appellate court may conclude that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made. (3) For the purposes of subsection (2), in order for any material to be ‘sufficient’, that material must satisfy all of the following requirements: (a) before the filing of the application for leave to make the review application, the material has not been canvassed at any stage of the proceedings in the criminal matter in respect of which the earlier decision was made; (b) even with reasonable diligence, the material could not have been adduced in court earlier; (c) the material is compelling, in that the material is reliable, substantial, powerfully probative, and capable of showing almost conclusively that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made. (4) For the purposes of subsection (2), in order for any material consisting of legal arguments to be ‘sufficient’, that material must, in addition to satisfying all of the requirements in subsection (3), be based on a change in the law that arose from any decision made by a court after the conclusion of all proceedings relating to the criminal matter in respect of which the earlier decision was made. (5) For the purposes of subsection (2), the appellate court may conclude that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made, only if — (a) the earlier decision (being a decision on conviction or sentence) is demonstrably wrong; or (b) the earlier decision is tainted by fraud or a breach of the rules of natural justice, such that the integrity of the judicial process is compromised. (6) For the purposes of subsection (5)(a), in order for an earlier decision on conviction to be ‘demonstrably wrong’ — (a) it is not sufficient that there is a real possibility that the earlier decision is wrong; and (b) it must be apparent, based only on the evidence tendered in support of the review application and without any further inquiry, that there is a powerful probability that the earlier decision is wrong.",
        "The Judge’s reliance on Dominic’s confession": "13 According to the applicant, the Judge erred in relying on Dominic’s confession in his investigation statement that he was informed by the applicant that the applicant would be collecting two bundles. Under s 258(5) of the CPC then in force, when “more persons than one are being tried jointly for the same offence, and a confession made by one of such persons affecting himself and some other of such persons is proved, the court may take into consideration the confession as against the other person as well as against the person who makes the confession”. CitingRamesh, the applicant contends that the Judge was not entitled to rely on Dominic’s confession ashe and Dominic were tried for different offences. 14 The applicant’s legal argument is untenable for three reasons. First, his argument fails to satisfy s 394J(4) of the CPC as it is not based on a “change in the law”. Second, even if Dominic’s confession were disregarded, there is still sufficient evidence to show that the applicant had ordered two bundles of drugs. Third, even if the applicant had intended to receive only one bundle from Dominic, he would still have been in possession of more than 15g of diamorphine for the purpose of trafficking. 15 The applicant’s legal argument is not based on a change in the law, as required under s 394J(4) of the CPC.Rameshdid not change the law on the admissibility of confessions by co-accused persons. It affirmed the proper construction of s 258(5) of the CPC. As is evident from the decision inRameshitself (at [62]),Rameshsimply reiterated the interpretation of s 258(5) of the CPC laid down inLee Yuan Kwang and others v Public Prosecutor[1995] 1 SLR(R) 778. The applicant himself states in his written submissions thatRamesh“provides greater clarity and reaffirms the interpretation of s 258(5) of the CPC”. 16 Apart from Dominic’s confession, there was ample evidence to show that the applicant had ordered two bundles instead of one. This included the applicant’s own statements. For example, in his second contemporaneous statement recorded on 13 April 2012 at 5.15am, the applicant made unqualified references to two bundles of heroin: Q3) What is inside the bag. A3) Heroin Q4) How much heroin? A4) 2 17 In his statement of 19 April 2012, the applicant reiterated that he was expecting to receive two bundles of drugs from Dominic. He stated as follows: … So I had used two envelopes to separate the cash. I am asked what the cash shown in the photograph was for. I had this cash with me to pay ‘Dominic’ when I get the two bundles of heroin from him. … 18 The cash that the applicant referred to in his statement of 19 April 2012 was another piece of objective evidence against him. It was undisputed that the applicant handed $10,450 in cash to Dominic when he received the two bundles from Dominic. It was the applicant’s evidence that a 400g bundle would cost $5,000 while a bundle of 450g–453g would cost $5,400 (see the Judgment at [43]). As the Court of Appeal noted in its oral judgment in CCA 42/2017 (at [10]), the applicant’s payment of $10,450 to Dominic “closely resembled the price of twobundles of heroin”. Although the applicant claimed at the trial that part of the payment of $10,450 was meant for a bundle of drugs from a previous transaction, the Court of Appeal rejected this explanation. In this application, the applicant has not adduced any material to undermine the Court of Appeal’s conclusion that the payment of $10,450 to Dominic was in exchange for the two bundles. 19 Accordingly, even if Dominic’s confession were disregarded, it would not affect the Judge’s and Court of Appeal’s conclusions that the applicant had ordered two bundles of drugs. The applicant therefore fails to show that there is a powerful probability that the decision in CCA 42/2017 is wrong (per s 394J(6)(b) of the CPC). 20 As mentioned earlier, even if the applicant had ordered only one bundle of drugs, he would still have been in possession of more than 15g of diamorphine for the purpose of trafficking. The Court of Appeal affirmed the Judge’s finding that the applicant would have kept only five packets at most for his own consumption and rejected the applicant’s contention that he would have kept 12 packets for himself. The Court of Appeal found it unbelievable that the applicant would have consumed so much of the drugs ordered by him given his lack of financial means which drove him to drug trafficking in the first place. In fact, the applicant’s evidence at the trial was that for the transaction in question, he ordered a 400g bundle of drugs rather than a 450g bundle because he was “short of cash” (see the Judgment at [42]). 21 For the foregoing reasons, the applicant’s argument in respect of the Judge’s reliance on Dominic’s confession is unmeritorious and fails to show in any way that the decision in CCA 42/2017 was demonstrably wrong (see ss 394J(5)(a) and 394J(6) of the CPC).",
        "The applicant’s claim to be a mere bailee of one bundle of drugs": "22 The applicant’s second contention is that he had intended to return one of the two bundles to his supplier. Relying on the bailment defence set out inRamesh(at [110]), the applicant argues that he should only have been convicted of trafficking one bundle of drugs, not two. 23 At the trial, there was no evidence at all to suggest that the applicant had intended to return one of the bundles to his supplier. In his statement of 18 April 2012 and in his closing submissions at trial, the applicant stated that he had intended to call his supplier upon reaching home to clarify his receipt of the two bundles. Nothing was said about returning one bundle to his supplier. 24 Contrary to the applicant’s belated assertion that he was a mere bailee of one bundle of drugs, the evidence indicated clearly that he had intended to receive two bundles from Dominic. In any event, the bailment defence would make no difference to the applicant’s case because, as stated earlier, even if he had intended to traffic in only one bundle, he would still be guilty of possession of more than 15g of diamorphine for the purpose of trafficking.",
        "The allegations of inadequate legal assistance": "25 In Mr Ravi s/o Madasamy’s (“Mr Ravi”) affidavit filed in support of the present application, it is stated (at para 9) that “If permitted, the applicant will also argue that the defence counsel who appeared at the trial and at the appeal was incompetent or ineffective in his representation of the Applicant and this has led to a miscarriage of justice”. In his written submissions, the applicant asserts that the Judge and the Court of Appeal commented adversely on Mr Masih’s conduct of the trial and that “the Court of Appeal underlined the ‘critical failings in Nazeri’s defence’ which arose out of defence counsel’s conduct of the case”. The applicant states that the “critical failings” include: (a) failure to comply with the rule inBrowne v Dunn(1893) 6 R 67 (“Browne v Dunn”)by neglecting to cross-examine Dominic on crucial aspects of his evidence that conflicted with the applicant’s account; (b) failure to put to the applicant Dominic’s conflicting account and to allow the applicant to respond to it; (c) failure to comply with the rule inBrowne v Dunnby neglecting to cross-examine the investigating officer or the interpreter with regard to the applicant’s allegation that the investigating officer had told the applicant to lower the amount of heroin for his personal consumption during the recording of his statement; (d) failure to ask the applicant to clarify the reason for the inconsistency in his testimony regarding the amount of drugs he consumed, namely, ten packets in contrast to 12 packets consumed every fortnight; and (e) failure to adduce any medical evidence to support the applicant’s claim that he consumed a higher daily dosage of heroin than what was recorded in his statements. 26 It is submitted that, as a result, there was a failure at the trial “such that the integrity of the judicial proceedings itself has been impugned”. It is also submitted that this is reinforced by the fact that both the Judge and the Court of Appeal based their findings on issues connected to Mr Masih’s alleged ineffectiveness or incompetence. 27 The two-step approach for dealing with allegations of inadequate legal assistance was set out inMohammadFarid bin Batrav Public Prosecutor andanother appeal and other matters[2020] 1 SLR 907 (“Farid”)at [134]. The first step is to assess counsel’s conduct of the case and the second is to assess whether that conduct affected the outcome of the case, in that it resulted in a miscarriage of justice. 28 At the time of the applicant’s trial in the High Court, Mr Masih was a criminal defence lawyer with about 33 years of experience. He ceased practising law in December 2020. In a letter dated 19 February 2021, he made his response to the letter dated 9 February 2021 from the applicant’s present counsel’s law firm which enclosed a draft affidavit of Mr Ravi. In his response, Mr Masih stated that he accepted the comments by the Judge and the Court of Appeal regarding the shortcomings of defence counsel at the trial. He then went on to discuss some of the evidence adduced at the trial. In the concluding paragraphs of his response, Mr Masih said: 23 In Conclusion, I wish to say that I honestly did my best for the Applicant at the trial and at the Appeal. On hindsight I accept that I overlooked certain matters which could have helped the defence of the Applicant. 24 I humbly leave the matter to the Honourable Court to make such orders as may be deemed appropriate on the application of Nazeri Bin Lajim. 29 Many of us would probably acknowledge, with the benefit of hindsight and upon further reflection and discussions, that we could have done better or said something more effectively than we did or even that we overlooked certain matters. This could be in the context of a debate, a discussion, a speech, a trial or an appeal. It would have to be a very bold and brash person who dares to proclaim that he has done a perfect job each time. 30 In order to overturn his conviction or to re-open his appeal, the applicant must show that Mr Masih’s “conduct of the case fell so clearly below an objective standard of what a reasonable counsel would have done or would not have done in the particular circumstances of the case that the conduct could be fairly described as flagrant or egregious incompetence or indifference” (seeFaridat [135]). Looking at the entire conduct of the trial and of the appeal, despite Mr Masih’s candid acknowledgement that he overlooked certain matters which could have helped the applicant’s defence, I do not think that the way he handled this case came anywhere close to the point where it “could be fairly described as flagrant or egregious incompetence or indifference”. A trial is dynamic. However well prepared a counsel is, he is not likely to be able to anticipate every question that will be asked in cross-examination and, certainly, there could be surprises in what witnesses or a co-accused or even the client may say in oral testimony. As will be seen later in this judgment, the applicant did surprise Mr Masih with some new evidence while the applicant was being cross-examined by the Prosecution at the trial. 31 In any event, assuming that the applicant has established a case of inadequate legal assistance and if Mr Masih had done what the applicant now asserts he should have done during the trial, is there a real possibility that the outcome might have been different for the applicant such that a miscarriage of justice could be said to have occurred in this case? I note that inFaridat [139], the Court of Appeal adopted the standard of “real possibility” in contrast to that of “powerful probability” used in s 394J(6)(b) of the CPC. The Court of Appeal explained that the higher threshold of “powerful probability” was warranted in that statutory provision because for a review application, there would already have been a concluded appeal which did not succeed. Unlike the situation inFaridwhich involved an appellant contending on appeal that his trial counsel had failed him, the present case is an application for leave to file a review application. The higher threshold should therefore apply. However, for the present discussions, I am prepared to use the lower threshold of real possibility. 32  The state of the evidence given by the applicant in his statements and in his oral testimony must be borne in mind. It was clear from the totality of the applicant’s evidence that he had been hopelessly inconsistent concerning the number of bundles he was supposed to receive from Dominic as well as on the issue of his rate of consumption of heroin. I have already set out the inconsistencies and the other evidence earlier. 33 Further, as evidenced in the notes of evidence, the applicant’s initial instructions to Mr Masih were that his statements were recorded correctly but he realised later that his “very rough estimate about his consumption habits” was not correct. Mr Masih cross-examined the CNB witnesses on that basis. It was only when the Prosecution cross-examined the applicant about the discrepancy between his statements and his oral testimony concerning his consumption rate that he alleged that the CNB officer had told him to change his statement to state a lower consumption rate. According to the applicant, he told the CNB officer during the recording of his statements that he smoked ten packets within two weeks but the CNB officer said “ten packets too much” and would not believe him. The CNB officer then told him he should change his statement and he did as instructed. The applicant conceded that he did not inform Mr Masih about this allegation against the CNB officer. This is the “new evidence” from the applicant during cross-examination that I mentioned earlier. 34 In the light of all the evidence adduced at the trial, there is surely no real possibility that recalling the CNB officer for further cross-examination would have made a difference to the outcome of the trial. Similarly, a less passive cross-examination of Dominic or any other witness could not possibly have changed the result. It was obvious that Mr Masih did his best to put forward the applicant’s “one bundle” defence and his drug consumption rate on the state of the evidence. Mr Masih certainly could not make such hopelessly inconsistent evidence inject reasonable doubt into the Prosecution’s case, much less build a credible defence on such evidence. 35 There is no requirement in law or in practice that medical evidence has to be adduced in support of an accused person’s drug consumption rate. This is not a case where the applicant had been receiving medical treatment for drug addiction close to the time of his arrest and there was readily available medical evidence relating to his drug consumption rate at the material time which Mr Masih knew about but failed to adduce at the trial.",
        "Dr Ung’s medical report": "36 Finally, the applicant relies on a medical report by Dr Ung in support of his claim that he would have kept 12 packets of heroin for his consumption. This is the “new evidence” that the applicant hopes to adduce and which he claims should have been called and adduced at the trial by Mr Masih. 37 Dr Ung assessed the applicant in Changi Prison on 30 June 2020, almost two years after the Court of Appeal dismissed the applicant’s appeal against conviction and sentence. Dr Ung’s report states that “The accuracy of this report is predicated on the truthfulness and accuracy of the report given by Mr Nazeri”. No one else was interviewed as Dr Ung believed they would not have been able to give significant information regarding the applicant’s drug usage pattern in 2012. Dr Ung’s psychiatric diagnosis was that the applicant “was suffering from Opioid, Stimulant (Methamphetamine), Cannabis and Sedative (Hypnotic) Use Disorder at the time of his arrest”. 38 Dr Ung states (at para 30 of his report) that the applicant informed him that he funded his drug consumption habit through selling drugs and that he would usually order a bundle every two weeks or so, sell some and use some for his own consumption. Dr Ung notes (at para 31 of his report) that the applicant “was broadly consistent in his explanation to me (compared to his explanation in Court)”. At para 46 of his report, Dr Ung opines that although it is not possible to state with certainty whether the applicant’s daily consumption of heroin was four grammes or eight grammes, he sets out some factors which would favour the higher consumption rate. One of the factors was that higher usage is related to availability and that means having the means to purchase the drug as well as a regular supply source. Dr Ung opines that this was consistent with the applicant’s report of high consumption “as he was able to fund his drug habit as well as anticipate regular supplies”. 39 It is clear from the report that the applicant’s account to Dr Ung was neither truthful nor accurate. The applicant’s alleged consumption pattern was rejected by the Judge and the Judge’s finding of fact was upheld by the Court of Appeal. The applicant’s professed consumption rate is also inconsistent with the medical evidence adduced at the trial which Dr Ung did not appear to be privy to. The contemporaneous medical reports indicated that the applicant was not observed to be suffering from any drug-induced psychiatric condition at the time of his arrest and that he suffered only mild to no withdrawal symptoms in the two or three days after his arrest. 40 In addition, the applicant’s assertion that he had the financial means to support his claimed consumption rate appears to have been accepted by Dr Ung at face value. It did not appear that the applicant informed Dr Ung that he had testified at the trial that he was “short of cash” at the material time. In any event, the Court of Appeal has ruled that the applicant’s claimed consumption rate was unbelievable given his lack of financial means which drove him to drug trafficking in the first place. It is not permissible for the applicant to revisit factual matters by merely repeating his evidence. 41 All relevant evidence was tested rigorously at the trial and on appeal. On the totality of the evidence adduced, the applicant’s testimony was found to be untruthful. The mere repetition of evidence by the applicant to a psychiatrist when that evidence has been rejected by the courts cannot possibly alter the fact that the evidence was found to be not credible. Dr Ung’s report also fails to take into account other evidence such as the applicant’s mention of “two bundles” in his statements and his payment of $10,450 to Dominic. 42 To qualify as “compelling” material within the meaning of s 394J(3)(c) of the CPC, Dr Ung’s report must be “reliable, substantial, powerfully probative, and capable of showing almost conclusively that there has been a miscarriage of justice” in the Court of Appeal’s decision in CCA 42/2017. It is clear to me that the report does not even come close to meeting any of those statutory descriptions.",
        "Conclusion": "43Section 394H(7) of the CPC allows the court to dismiss a leave application summarily without setting it down for hearing. Before doing so, the court must consider the applicant’s written submissions (if any) and may, but is not required to, consider the Prosecution’s written submissions (if any): s 394H(8) of the CPC. I have considered the application, Mr Ravi’s affidavit and both the applicant’s and the Prosecution’s written submissions. For the reasons set out above,there is clearly no “sufficient material” on which it may be concluded that there has been a miscarriage of justice in CCA 42/2017. I therefore dismiss this application summarily. Tay Yong KwangJustice of the Court of Appeal Ravi s/o Madasamy (Carson Law Chambers) for the applicant; Anandan Bala, Tan Wee Hao and Rimplejit Kaur (Attorney-General’s Chambers) for the respondent."
    }
}