{
    "case_title": "Loh Der Ming AndrewvKoh Tien Hua",
    "ncitation": "[2021] SGCA 2",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 InIskandar bin Rahmat v Law Society of Singapore[2021] SGCA [1] (“Iskandar”), the Court of Appeal held that it has the jurisdiction to hear an appeal against a decision of a judge made pursuant to s 96 of the Legal Profession Act (Cap 161, 2009 Rev Ed) (“the LPA”). In doing so, it disagreed with our earlier decision inLaw Society of Singapore v Top Ten EntertainmentPte Ltd[2011] 2 SLR 1279 (“Top Ten Entertainment”) where the court considered that it did not have jurisdiction over such an appeal. 2 The present appeal concerns a decision of a judge pursuant to s 97 of the LPA. While the appeal inTop Ten Entertainmentconcerned s 96 of the LPA, the court saw fit to extend its reasoning to ss 95 and 97 by analogy because the provisions referred to a decision by a “Judge” and involved the exercise of the disciplinary jurisdiction of the court (Top Ten Entertainmentat [39] and [44]). InIskandar, we observed that our analysis of s 96 would inform the proper analysis of s 97 but cautioned that the court should in each instance consider the language of the specific provision that is in question in the case at hand (at [18] and [89]). This appeal presents us with the opportunity to clarify the jurisdiction of this court over an appeal against a decision of a judge pursuant to s 97 of the LPA.",
        "Background": "3 The respondent in the appeal, Mr Koh Tien Hua (“Mr Koh”), is an advocate and solicitor of the Supreme Court who was called to the Bar in 1994. From 7 July 2015 to 12 August 2015, he represented the appellant, Mr Andrew Loh Der Ming (“Mr Loh”), in the latter’s divorce proceedings. Mr Loh’s complaints arise out of a pre-trial hearing on 27 July 2015 at which, he alleges, Mr Koh made certain misrepresentations to the court and acted without proper instructions. The details of the allegations against Mr Koh are not relevant at this time. 4 On 12 May 2016, Mr Loh filed a complaint against Mr Koh with the Law Society of Singapore (“the Law Society”). An Inquiry Committee was constituted on 1 August 2016 and found that almost all the heads of complaint against Mr Koh had not been made out save for one, and for that, it recommended the imposition of a penalty of $2,500. The Council of the Law Society (“the Council”) accepted and adopted the findings and recommendations of the Inquiry Committee, and it declined to seek the appointment of a Disciplinary Tribunal to formally investigate the complaint. 5 Mr Loh was dissatisfied with that decision and on 29 March 2017, he applied to a judge seeking an order directing the Law Society to apply to the Chief Justice for the appointment of a Disciplinary Tribunal pursuant to s 96 of the LPA. The judge allowed the application (seeLoh Der Ming Andrew v Law Society of Singapore[2018] 3 SLR 837 at [170]). A Disciplinary Tribunal was duly constituted on 20 November 2017. Mr Loh had conduct of the proceedings and brought 14 charges against Mr Koh. The Disciplinary Tribunal found Mr Koh guilty of two charges but determined that no cause of sufficient gravity for disciplinary action existed under s 83 of the LPA, and recommended that Mr Koh be ordered to pay a penalty of $10,000. 6 Again dissatisfied, Mr Loh applied for a review of the Disciplinary Tribunal’s determination pursuant to s 97 of the LPA. Mr Loh argued that the Disciplinary Tribunal erred in not finding Mr Koh guilty of all the charges and in determining that Mr Koh’s conduct did not constitute cause of sufficient gravity for disciplinary action. The application was heard by a different judge (“the Judge”) who found that two additional charges had been made out, but agreed that on the whole, there was no cause of sufficient gravity to warrant referral to the C3J and a penalty was sufficient. She substituted the Disciplinary Tribunal’s recommendation of a penalty of $10,000 with a recommended penalty of $12,500. We digress to note that inIskandar([1]supra), we observed at [33] that a Judge acting under s 97(1) of the LPA does not have the power to decide on any penalty or even to make any recommendations on penalty. 7 Mr Loh filed the present appeal on 21 December 2019. He is represented in this appeal by Mr Chen Kok Siang Joseph (“Mr Chen”).",
        "The present application": "8 On 6 January 2020, Mr Koh applied to strike out the appeal pursuant to O 57 r 16(10) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) on the ground that the appeal was scandalous, frivolous or vexatious or otherwise an abuse of the process of the court. In his affidavit filed in support of the application, Mr Koh indicated that he was relying on the decision of this court inTop Ten Entertainment([1]supra) to contend that the Court of Appeal does not have jurisdiction to hear the appeal. 9 Mr Chen submitted that the appeal should not be struck out. He argued that this court was not bound byTop Ten Entertainmentand that, in any event, the present appeal could be distinguished on the facts. Mr Chen also appeared to argue that the court had jurisdiction to hear the appeal pursuant to principles within the rule of law, and also referred to the scope of judicial review over proceedings under the LPA, with particular reliance on the decision of the High Court inDeepak Sharma v Law Society of Singapore[2016] 4 SLR 192 (“Deepak Sharma”). He also raised some arguments on the substantive merits of the Judge’s decision. 10 Mr Narayanan Sreenivasan SC (“Mr Sreenivasan”), counsel for Mr Koh, submitted thatTop Ten Entertainmentwas clear authority for the proposition that there is no right of appeal against the Judge’s decision, and any factual differences betweenTop TenEntertainmentand the present matter were irrelevant because the existence of a right of appeal was a matter of law and legal principle. Mr Sreenivasan also submitted that Mr Chen’s reliance onDeepak Sharmawas misplaced and that the submissions on the merits of the Judge’s decision were unmeritorious or irrelevant. 11 On 7 September 2020, we directed the parties to file further written submissions on two questions: (a) Is the Court of Appeal seised of jurisdiction to hear the appeal, with particular reference to the two threshold requirements set out inRe Nalpon Zero Geraldo Mario[2013] 3 SLR 258 (“Re Nalpon Zero”)? (b) Is the Supreme Court’s disciplinary jurisdiction over advocates and solicitors part of the civil jurisdiction of the court, with particular reference to ss 16(1) and 16(2) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“the SCJA”)? 12 The parties filed their supplementary submissions on 11 September 2020. Briefly, Mr Sreenivasan submitted that this court was not seised of jurisdiction to hear the appeal because the threshold requirements inRe Nalpon Zerohad not been met. He submitted that a decision of a judge pursuant to s 97 of the LPA was neither a decision of the High Court nor a decision in the exercise of civil jurisdiction. Instead, it was an exercise of the disciplinary jurisdiction of the court, a unique jurisdiction derived from the LPA and not from the SCJA. On the other hand, Mr Chen submitted that the present appeal was inextricably linked to the High Court because it had been heard by two judges and in the light of the decision inDeepak Sharma,disciplinary proceedings should no longer be seen assui generisbut rather as part of the civil jurisdiction of the court. Mr Chen also contended that Mr Koh had submitted to the jurisdiction of the court by appearing as the defendant in the application before the Judge. 13 We heard the parties on 15 September 2020 and reserved judgment. On 22 October 2020, a five-membercoramof the Court of Appeal heard arguments inIskandar([1]supra),which was a similar application in a separate appeal that concerned the jurisdiction of the Court of Appeal over a decision pursuant to s 96 of the LPA. The appellant in that appeal, Mr Iskandar bin Rahmat (“Mr Iskandar”), had filed a complaint with the Law Society against his defence counsel at trial. An Inquiry Committee constituted to inquire into the complaint recommended that the complaint should be dismissed, and the Council accepted that recommendation and informed Mr Iskandar that it would not take further action. Mr Iskandar applied to a judge seeking an order directing the Law Society to apply to the Chief Justice for the appointment of a Disciplinary Tribunal pursuant to s 96 of the LPA, but the judge affirmed the Council’s determination. Mr Iskandar filed an appeal against the judge’s decision and the Law Society, who was the respondent in that appeal, applied to strike out the appeal on the authority ofTop Ten Entertainment([1]supra). 14 After reviewing the disciplinary framework in the LPA and examining the precedents in detail, the Court of Appeal unanimously held thatTop Ten Entertainmentwas wrongly decided on this point and that it has the jurisdiction to hear an appeal against a decision pursuant to s 96 of the LPA. That jurisdiction is founded in s 29A(1)(a) of the SCJA as the two threshold requirements identified inRe Nalpon Zero([11(a)]supra)had been met. First, a decision pursuant to s 96 of the LPA was a decision of the High Court as the application was made to a “Judge”, who was defined as “a Judge of the High Court sitting in chambers” in s 2 of the LPA, and there was no reason to disregard this definition (seeIskandarat [59]–[68]). Second, the decision was made in the exercise of the civil jurisdiction of the High Court because the disciplinary jurisdiction of the court falls within its civil jurisdiction pursuant to s 16(2) of the SCJA (seeIskandarat [75]–[81]). The Law Society’s application was accordingly dismissed.",
        "Our decision": "15 The issue before us in this appeal concerns this court’s jurisdiction to hear an appeal against a decision pursuant to s 97 of the LPA. 16 The disciplinary framework under the LPA is set out in detail inIskandar(see [20]–[36]). Briefly, Part VII of the LPA sets out a stepped process where a complaint against a solicitor is assessed by various bodies constituted under the LPA before it may be referred to “a court of 3 Judges of the Supreme Court” constituted under s 98(7) (“the C3J”). At any stage of the assessment, the committee or tribunal or Council may decline to refer the matter to the next stage, thus bringing the disciplinary proceedings to an end. For that reason, there are various route of review provided for in the LPA and at common law. Sections 96 and 97 of the LPA are two of the provisions that provide for a statutory route of review. Section 96 operates sequentially before s 97 as it permits a complainant to challenge the decision of theCouncilnot to seek the appointment of a Disciplinary Tribunal, while s 97 permits a complainant to challenge the decision of theDisciplinary Tribunalnot to refer the matter to the C3J (among other possible challenges by other parties). What is relevant for present purposes is that the two provisions employ similar language and provide for the power of review by a “Judge”. For that reason, we observed inIskandarthat our analysis, though focused on s 96, would also inform the proper analysis of s 97 (Iskandarat [18]). 17 We said inIskandar([1]supra) that in order to invoke the Court of Appeal’s jurisdiction under s 29A(1)(a) of the SCJA, the decision on appeal must be: (a) a decision of the High Court; and (b) in the exercise of its original or appellate civil jurisdiction (seeIskandarat [57]). In doing so, we agreed with the court’s earlier decision inRe Nalpon Zero,notwithstanding that s 29A of the SCJA had been amended since that decision, as the relevant subsection remained substantially similar (seeRe Nalpon Zeroat [44] andIskandarat [54] and [57]). Section 29A(1)(a) of the SCJA states: Jurisdiction of Court of Appeal 29A.—(1)  The civil jurisdiction of the Court of Appeal consists of the following matters, subject to the provisions of this Act or any other written law regulating the terms and conditions upon which those matters may be brought: (a) any appeal from any judgment or order of the High Court in any civil cause or matter, whether made in the exercise of its original civil jurisdiction or made in the exercise of its appellate civil jurisdiction; … 18 Prior to our decision inIskandar, we directed the parties in the present appeal to address the court on the threshold requirements identified inRe Nalpon Zero([11(a)]supra) (see [11] above). At the hearing, Mr Sreenivasan contended that there was a third threshold requirement represented by the phrase “any civil cause or matter” in s 29A(1)(a). He argued that this had to be understood as representing an additional requirement because otherwise the words that followed, “whether made in the exercise of its original civil jurisdiction or made in the exercise of its appellate civil jurisdiction”, would be rendered otiose. He further suggested that this implied that the court could exercise civil jurisdiction over a non-civil cause or matter and that the present appeal was an example of this, so that disciplinary proceedings might fall within the civil jurisdiction of the courts, even though they were not a civil matter. 19 We do not agree with this submission. There is no evidence of any Parliamentary intent to insert anadditionalthreshold requirement by the inclusion of the words “any civil cause or matter”. In our judgment, this would not result in the subsequent words, “whether made in the exercise of its original civil jurisdiction or made in the exercise of its appellate jurisdiction”, being rendered otiose. Instead, the latter clause emphasises that the civil jurisdiction of the Court of Appeal is abroadone, encompassing appeals from the High Court whether made in its original or appellate jurisdiction. This interpretation is easily supported by considering the development of the relevant provision. At the time of the decision inRe Nalpon Zero, s 29A(1) of the SCJA referred only to “any civil cause or matter whether made in the exercise of its original or of its appellate jurisdiction”, reflecting the broad-based nature of civil jurisdiction. In 2018, s 29A was amended by s 127(2) of the Criminal Justice Reform Act 2018 (Act 19 of 2018) and the words “civil jurisdiction” were included in s 29A(1)(a). In our judgment, this was done in order to differentiate it from the criminal jurisdiction, which is what the amendments to s 29A were primarily concerned with.  In that light, it seems to us to be excessive and unwarranted to infer that the reference to “civil” jurisdiction was inserted in order to impose an additional threshold requirement to found the civil jurisdiction of the court. In addition, we do not follow or accept the argument that a court could exercise civil jurisdiction over a non-civil cause or matter. 20 That being the case, we affirm our decision inIskandar, which followed the earlier decision inRe Nalpon Zeroon this point, that there are two threshold requirements to invoke the jurisdiction of the Court of Appeal pursuant to s 29A(1)(a) (Iskandarat [57]). We consider this court’s jurisdiction over the present appeal in the light of these two requirements. 21 With the benefit of the analysis inIskandar([1]supra), it is apparent that the first threshold requirement is met. A decision by a judge pursuant to s 97 of the LPA is a decision of the High Court for the same reasons that a decision by a judge pursuant to s 96 of the LPA is a decision of the High Court (seeIskandarat [60]–[68]). A “Judge” is defined in s 2 of the LPA as “a Judge of the High Court sitting in chambers”, and there is nothing in the statute that suggests that this definition is inadequate or should be excluded. Our reasoning is fortified by the definition of “court” in s 2 of the LPA as “the High Court or a Judge when sitting in open court”, and the fact that references to a “court” and a “judge” throughout the LPA are sometimes used interchangeably (see for example, s 88(4)(a) read with s 95(3)(a) and s 97(1) read with s 94(2)). 22 Second, a decision pursuant to s 97 of the LPA is an exercise of the High Court’s civil jurisdiction because the disciplinary jurisdiction of the court falls within its civil jurisdiction (seeIskandarat [70]–[88]). This is pursuant to s 16(2) of the SCJA, which provides for the general civil jurisdiction of the court and states that the High Court shall have such jurisdiction as is vested in it by any other written law. The references to the “disciplinary jurisdiction” of the court in the precedents are simply descriptive of the body of law exercised by the court, and the jurisdiction is vested in the High Court by the relevant provisions of the LPA. 23 Both s 96 and s 97 involve the Judge’s review of the correctness of a decision made by a body constituted under the LPA, albeit at different stages of the assessment of the merits of the complaint. In fact, as was alluded to inIskandar, the nature of proceedings under s 97 might be said to be even clearer than that under s 96 (seeIskandarat [30]–[32]). Section 97(4) of the LPA states: (4) The Judge hearing the application — (a)  shall have full power to determine any question necessary to be determined for the purpose of doing justice in the case, including any question as to the correctness, legality or propriety of the determination or order of the Disciplinary Tribunal, or as to the regularity of any proceedings of the Disciplinary Tribunal; and (b)  may make such orders as the Judge thinks fit, including — (i) an order directing the person who made the complaint or the Council to make an application under section 98; (ii) an order setting aside the determination of the Disciplinary Tribunal and directing — (A) the Disciplinary Tribunal to rehear and reinvestigate the complaint or matter; or (B) the Society to apply to the Chief Justice for the appointment of another Disciplinary Tribunal to hear and investigate the complaint or matter; or (iii) such order for the payment of costs as may be just. 24 Under s 97(4)(a), the Judge is expressly empowered to consider the correctness, legality or propriety of any determination or order of the Disciplinary Tribunal. In this respect, proceedings under s 97 of the LPA are akin to judicial review proceedings (seeIskandarat [32], citingMohd Sadique bin Ibrahim Marican and another v Law Society of Singapore[2010] 3 SLR 1097 at [10]andLaw Society of Singapore v Yeo Khirn Hai Alvinand another matter[2020] 4 SLR 858 at [25]). This is further supported by s 91A(1) of the LPA, which restricts judicial review in any court of any act or decision of the Disciplinary Tribunal “[e]xcept as provided in sections 82A, 97 and 98”. As the statutory power is limited to a review of the proceedings, the Judge hearing an application under s 97 cannot punish the solicitor directly and can only, if he or she disagrees with the Disciplinary Tribunal, direct the Law Society to make an application to the C3J or direct that the matter be sent back to be investigated by the same or a different Disciplinary Tribunal. In an appeal against the Judge’s decision, the Court of Appeal is only concerned with the correctness of that decision and cannot exercise the powers reserved to the C3J. The jurisdiction of the C3J, which is specially constituted under the LPA, may be said to besuigeneris, and there is no dispute that there can be no appeal against the decisions of the C3J (see s 98(7) of the LPA). But that unique jurisdiction does not arise in an appeal against a decision pursuant to s 97 of the LPA (see alsoIskandarat [85]–[87]).",
        "Conclusion": "25 We therefore hold that there is a right of appeal to this court against decisions pursuant to s 97 of the LPA, and we dismiss the respondent’s application to strike out the notice of appeal. We reiterate our comments inIskandarthat legislative reform would be very welcome to clarify the disciplinary framework in the LPA (Iskandarat [34] and [91]). 26 We will hear parties on the substantive appeal in due course. The costs of this application are reserved pending the determination of the substantive appeal. Sundaresh MenonChief JusticeJudith PrakashJustice of the Court of AppealSteven ChongJustice of the Court of Appeal Chen Kok Siang Joseph (Joseph Chen & Co) for the appellant;Narayanan Sreenivasan SC and Ranita Yogeeswaran (K&L Gates Straits Law LLC) for the respondent."
    }
}