{
    "case_title": "Tan Hock Keng vMalaysian Trustees Bhd",
    "ncitation": "[2022] SGCA 14",
    "coram": "Andrew Phang Boon Leong JCA (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 InUJM v UJL[2021] SGCA 117 (“UJM”), we emphasised that the Appellate Division of the High Court (“AD”) will, in the vast majority of cases, serve as the final appellate court and that an application for leave to appeal from a decision of the AD (“AD/CA Leave Application”) will be subject to searching scrutiny, with leave to bring a further appeal granted only in rare and exceptional cases (at [129]).UJM, which was also the first AD/CA Leave Application before this court, presented us with an opportunity to consider the statutory scheme governing AD/CA Leave Applications as contained in s 47 of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”) and O 57 r 2A(3) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“Rules of Court”). The application before us (“OS 32”) is yet another AD/CA Leave Application which presents us with an opportunity to apply those principles which we have set out inUJM.",
        "Background": "2 OS 32 is an application by Mr Tan Hock Keng (“Mr Tan”) for leave to appeal from the decision of the AD inTan Hock Keng v Malaysian Trustees Bhd and another matter[2021] SGHC(A) 18 (“the Judgment”). In the Judgment, the AD upheld the decision of a judge in the General Division of the High Court (“the Judge”) inMalaysian Trustees Bhd v Tan Hock Keng[2021] SGHC 162 (“the GD”) on a Registrar’s Appeal. The background facts have been set out in the Judgment and the GD and we only summarise the main points in so far as they are relevant for present purposes. 3 Mr Tan had entered into a settlement agreement with the respondent, Malaysian Trustees Bhd (“MTB”), in connection with disputes between MTB and another Malaysian company, Pilecon Engineering Bhd (“PEB”). Mr Tan is a director of PEB and he had provided a guarantee in respect of PEB’s debts to MTB in 2015. On 8 November 2019, the Kuala Lumpur High Court (“KLHC”) granted a consent judgment pursuant to a settlement agreement between Mr Tan and MTB for the sum of RM 60m with interest thereon (“the Consent Judgment”). The Consent Judgment provided that its enforcement was to be withheld on terms. 4 In the event, those terms were not fully performed. In August 2020, MTB filed an application in the KLHC (which was allowed) for certification of a true copy of the Consent Judgment under the Malaysian Reciprocal Enforcement of Judgments Act 1958. In September 2020, Mr Tan filed an application (“Malaysia OS 455”) in the KLHC, seeking, amongst other things, a declaration that the Consent Judgment is “valid and binding” on the parties and a reasonable extension of time for himself and the other parties to the Consent Judgment to comply with their obligations under the Consent Judgment. 5 In November 2020, MTB registered the Consent Judgment in the Singapore courts under the Reciprocal Enforcement of Commonwealth Judgments Act (Cap 264, 1985 Rev Ed) (“RECJA”). In December 2020, Mr Tan applied to set aside MTB’s registration on the grounds of there being,inter alia, an “appeal” within the terms of s 3(2)(e) of the RECJA, citing Malaysia OS 455. The assistant registrar (“AR”) allowed Mr Tan’s application. 6 MTB filed an appeal (“RA 83”) against the AR’s decision. For RA 83, Mr Tan similarly relied on Malaysia OS 455 as the “appeal”. He also argued that the word “appeal” ins 3(2)(e) of the RECJA should be given an extended definition like that found in s 2(1) of the Reciprocal Enforcement of Foreign Judgments Act (Cap 265, 2001 Rev Ed) (“REFJA”), as including “any proceedings by way of discharging or setting aside a judgment or an application for a new trial or stay of execution” (“the Extended Meaning”). The Judge held that Malaysia OS 455, which affirmed the validity and binding nature of the Consent Judgment, could not amount to an “appeal”, even if that word were given the Extended Meaning contended for by Mr Tan (see the GD at [16]). The Judge therefore allowed RA 83 and upheld the registration of the Consent Judgment. In the circumstances, it was unnecessary for the Judge to decide if the word “appeal” should indeed be given the Extended Meaning, but he considered that it should not (see the GD at [17]). 7 After RA 83 was allowed in MTB’s favour, Mr Tan filed a suit (“Malaysia Suit 437”) in the KLHC against MTB seeking,inter alia, rectification of the Consent Judgment so that it properly reflected the intention of the parties. Mr Tan also filed an appeal (“CA 54”) against the Judge’s decision, which was heard by the AD. For CA 54, Mr Tan relied, not on Malaysia OS 455, but on Malaysia Suit 437, as the proceeding constituting an “appeal” within s 3(2)(e) of the RECJA. In connection with his attempt to rely on Malaysia Suit 437, Mr Tan also filed an application (“SUM 26”) to adduce in evidence before the AD the cause papers relating to Malaysia Suit 437. 8 At the outset, the AD dismissed SUM 26. It considered that the requirements inBNX v BOE and another appeal[2018] 2 SLR 215 (“BNX”) for receiving further evidence on appeal as to matters occurring after the date of the hearing below were not satisfied. The AD held that it was not sufficient that the further evidence notionally affects the basis of the decision of the court below; it must “at the very least relate to the decision that is appealed against” (see the Judgment at [11]). The AD considered that evidence of Malaysia Suit 437 did not relate to the Judge’s decision at all because the Judge’s decision had been entirely premised on Malaysia OS 455 and not on Malaysia Suit 437, which offered an entirely new basis for the legal inquiry into what would qualify as an “appeal” for the purposes of s 3(2)(e) of the RECJA (see the Judgment at [12]). 9 With the dismissal of SUM 26, the only question remaining before the AD was whether Malaysia OS 455 constituted an “appeal”. The AD held that it did not. That was because Malaysia OS 455, which only sought to affirm the Consent Judgment rather than challenge or correct anything about that judgment before a court of superior jurisdiction, did not amount to an “appeal” within the ordinary meaning of the word (see the Judgment at [19]-[21]). The AD also affirmed the Judge’s decision and considered that the word “appeal” in s 3(2)(e) of the RECJA should not be given the Extended Meaning, because while the word “appeal” appears in both the RECJA and REFJA, they are respectively couched in a different inquiry unique to the concerns animating the registration regime underlying each statute, and are not used in the same sense even though the context in both statutes are identical, namely, the setting aside of the registration of a foreign judgment (see the Judgment at [25] and [28]). The AD also considered that, even if the Extended Meaning applied, that did not assist Mr Tan, because any extended meaning associated with the word “appeal” cannot displace the natural meaning of the word (see the Judgment at [30]). Therefore, Malaysia OS 455 would still not amount to an “appeal” within s 3(2)(e) of the RECJA, even if the Extended Meaning applied (see the Judgment at [31]).",
        "Mr Tan’s application in OS 32": "10 Mr Tan submits that OS 32 ought to be allowed as his appeal raises two points of law of public importance. The first point of law is the interpretation of the word “appeal” in s 3(2)(e) of the RECJA, and whether it should be given the Extended Meaning (“the RECJA Point”). The second point of law is the AD’s imposition of a requirement that the further evidence must relate to issue(s) considered by the court below before it can be “potentially material” to the issues in the appeal (“the Further Evidence Point”). We refer to the appeal which Mr Tan seeks leave to bring as the “Intended Appeal”. 11 Most of the arguments advanced by Mr Tan in support of OS 32 deal with why the AD’s decision on the RECJA Point and the Further Evidence Point was wrong. Since these arguments pertain to the substantive merits of the Intended Appeal, we do not consider them for the purposes of OS 32. The remaining points raised by Mr Tan, which are relevant to the question of whether leave should be granted, are as follows: (a) In connection with the RECJA Point, Mr Tan says this is the first time the Singapore courts have been asked to interpret the word “appeal” in the RECJA and consider whether the Extended Meaning should be adopted. (b) In connection with the Further Evidence Point, Mr Tan says that the AD’s decision introduces a new criterion to the requirements inBNXfor receiving further evidence on appeal as to matters occurring after the date of the hearing below. (c) Finally, Mr Tan says that the interests of the administration of justice require this court to consider these points of law, because the AD’s decision on both points had caused material prejudice to him: (i) in connection with the RECJA Point, the outcome in CA 54 would have been different if Malaysia OS 455 and/or Malaysia Suit 437 had been determined in his favour prior to the hearing of CA 54, and the AD’s decision also results in him being subject to the Consent Judgment even though “the extant [Malaysian] proceedings challenging [the Consent Judgment] have yet to be concluded”; and (ii) in connection with the Further Evidence Point, Malaysia Suit 437 had been disregarded for the purposes of his challenge to the registration of the Consent Judgment in the Singapore courts, notwithstanding the character of the reliefs sought therein, simply because it had been commenced after RA 83 was concluded.",
        "The applicable principles": "12 The principles relating to AD/CA Leave Applications, which we have recently set out inUJM([1] above), are as follows. 13 There are three stages in respect of the AD/CA Leave Application, which can only be made in respect of cases that do not fall within the Ninth Schedule to the SCJA. First, the applicant must show that the intended appeal is one which raises a point of law of public importance. InUJM(at [64(d)]), we referred to this as the “Threshold Merits Requirement” which, if not satisfied, will automatically prevent any prospect of the grant of leave. Second, the applicant must show that that it is appropriate for the Court of Appeal to hear the intended appeal. InUJM(at [66(a)]), we referred to this as the “Discretionary Appropriateness Requirement”, which provides the Court of Appeal with the discretion to determine whether the intended appeal ought to be heard. Third, even if both the Threshold Merits Requirement and Discretionary Appropriateness Requirement are fulfilled, that only goes towards increasing the applicant’s prospects of obtaining leave, and not towards guaranteeing it (seeUJMat [82]). The Court of Appeal may nevertheless refuse the grant of leave even if both these requirements are satisfied. 14 The Threshold Merits Requirement is encapsulated in s 47(2) of the SCJA, which states that the Court of Appeal may grant leave “only if the appeal will raise a point of law of public importance”. To fulfil the Threshold Merits Requirement, the applicant must show: (a) how the alleged “point of law of public importance”, which must have been considered by the AD in its decision and reasoning, will arise on the facts of the case for the Court of Appeal’s determination and have a substantial bearing on the outcome of the intended appeal if leave is granted (seeUJMat [102]–[103]); and (b) how that point (when adjudicated upon) will have weighty ramifications which go beyond the parties to the dispute (seeUJMat [109(b)]). Obvious examples of appeals which will fulfil the Threshold Merits Requirement are those which will engage new questions of law of general application and those that will involve conflicting decisions of the Court of Appeal or the AD which need to be resolved so as to bring certainty to significant areas of law (seeUJMat [109(c)]). 15 The Discretionary Appropriateness Requirement is found in O 57 r 2A(3) of the Rules of Court, which states that the Court of Appeal, in deciding whether to grant leave to bring a further appeal from the Appellate Division, in addition to considering whether the appeal raises a point of law of public importance, is to have regard to: … whether it isappropriatefor [the] Court to hear a further appeal from the Appellate Division, taking into accountall relevant matters, including either or both of the following: (a)  whether a decision of the Court of Appeal is required to resolve the point of law; (b)  whether the interests of the administration of justice, either generally or in the particular case, require the consideration by the Court of Appeal of the point of law. [emphasis added] 16 The Court of Appeal’s discretion in respect of the Discretionary Appropriateness Requirement can only be exercised after considering, at the minimum, one of the two “Stipulated Considerations” under O 57 r 2A(3)(a) and O 57 r 2A(3)(b) of the Rules of Court, along with any other matter it considers relevant (seeUJMat [119]). 17 In so far as O 57 r 2A(3)(a) is concerned, it must be shown that no court apart from the Court of Appeal is capable of resolving the instant point of law that arises in the intended appeal. Such situations will be rare and exceptional; for example, if there are conflicting decisions of the Court of Appeal and/or the AD on a particular point of law, where the bench of the AD diverged on a particular point of law and contributed to a split on the result of the case, or where the bench of the AD expresses serious reservation or strong disagreement with legal principles set out in a past decision of the Court of Appeal which they were nevertheless bound by law to apply (seeUJMat [120]). We emphasised inUJMthat it is not enough simply for the point of law to be novel or for it to be one that has not been considered by the Court of Appeal before, because the AD itself is well-equipped to resolve novel and complex points of law (seeUJMat [120]). 18 In so far as O 57 r 2A(3)(b) is concerned, it must be shown that a decision of the Court of Appeal on the point of law concerned is not only “required” in a general sense, but is also required for the specific purpose of furthering the interests of the administration of justice in the particular case. However, we emphasised inUJMthat cases where this Stipulated Consideration will be engaged will be few and far between. We posited some examples of such cases, like those which concern the functioning of crucial aspects of Singapore’s legal system, or where the Court of Appeal’s consideration of the point of law is necessary to remedy serious injustice (seeUJMat [122]–[124]). 19 Finally, and as stated at the outset of this judgment, only a truly exceptional case will warrant the grant of leave because the AD is meant to function as the final appellate court in the vast majority of cases. We also emphasised that parties must be circumspect and realistic when considering whether or not to bring AD/CA Leave Applications. Unmeritorious applications brought by applicants who fail to (a) address specifically both the Threshold Merits Requirement and Discretionary Appropriateness Requirement, and (b) show satisfactorily that both requirements could plausibly be fulfilled on the facts of the case, will be met with cost consequences (seeUJMat [130]).",
        "Our decision": "20 At the outset, we observe that the RECJA Point (as defined at [10] above) would not arise for this court’s determination in the Intended Appeal unless Mr Tan is allowed to rely on some proceeding other than Malaysia OS 455 as the “appeal” within s 3(2)(e) of the RECJA, such as Malaysia Suit 437. That is because the AD had held that Malaysia OS 455 did not constitute an “appeal”even if the Extended Meaning were applied to s3(2)(e) of theRECJA. In other words, the AD’s decision in CA 54 would have been the same, whether or not the Extended Meaning applied. That issue would therefore have no bearing on the outcome of the Intended Appeal if Mr Tan remains confined to Malaysia OS 455 for the appeal. We therefore consider if the Intended Appeal fulfils the requirements for grant of leave in respect of the Further Evidence Point (as defined at [10] above) first, which is determinative of whether Mr Tan can adduce evidence of Malaysia Suit 437 in the Intended Appeal, before turning to the RECJA Point, if necessary. 21 In respect of the Further Evidence Point, we are of the view that the Intended Appeal doesnotfulfil even the Threshold Merits Requirement. As we have held inBNX, in determining if further evidence as to matters occurring after the hearing or trial below is to be admitted, the appellate court must be satisfied that such evidence would have a perceptible impact on the decision that is being appealed from (at [97] and [99]). It is implicit that such further evidence cannot simply be in respect ofanymatter occurringafter the trial or hearing below; it must affect thebasisof the decision below or substantially affect theassumptionsunderlying the same, if it can be said to have anyimpactat all (see the decision of this court inZhu Xiu Chun (alias Myint Myint Kyi) v Rockwills Trustee Ltd (administrators of the estate of and on behalf of the dependants of Heng Ang Tee Franklin, deceased) and other appeals[2016] 5 SLR 412at [58]; see theJudgmentat [11]). It would therefore have been part of the requirements inBNXthat further evidence capable of being adduced on appeal must relate to issue(s) that were considered by the court below. In these circumstances, the AD’s decision on the Further Evidence Point was simply an application of established legal principles to the facts and does not give rise to any normative proposition. Accordingly, there can be no “point of law” arising from this part of the Intended Appeal. 22 In any event, we are also of the view that the Intended Appeal in respect of the Further Evidence Point doesnotfulfil the Discretionary Appropriateness Requirement, even if the Threshold Merits Requirement was satisfied. First, given the reasons which we have explained earlier as to why the Intended Appeal in respect of the Further Evidence Point does not satisfy even the Threshold Merits Requirement, the Stipulated Consideration in O 57 r 2A(3)(a) of the Rules of Court isa fortiorinot engaged. A case like the present, where the AD had simply applied established legal principles to the facts, cannot be one in which a decision of the Court of Appeal is “required”. 23 Second, there are also no interests in the administration of justice on the particular facts of the case which require this court to consider the Further Evidence Point, and, thus, the Stipulated Consideration in O 57 r 2A(3)(b) of the Rules of Court is similarly not engaged. This case is far removed from the examples which we posited inUJMas being likely to engage O 57 r 2A(3)(b) (seeUJM([1] above) at [124]; see also [18] above). Further, as a matter of principle, the non-consideration of Malaysia Suit 437per secannot occasion any injustice to Mr Tan that is capable of engaging the Stipulated Consideration in O 57 r 2A(3)(b) because that had simply been the result of the AD’s application of established legal principles to the facts, rather than the AD’s decision on any point of law. It is also difficult to see how Mr Tan has suffered any prejudice from the non-consideration of Malaysia Suit 437 by the AD in CA 54 (see [11(c)(ii)] above), when that had been the result of his own doing by relying on Malaysia OS 455 as the ground for setting aside the registration of the Consent Judgment up until RA 83, and commencing Malaysia Suit 437 only when it transpired after RA 83 that Malaysia OS 455 no longer assisted him. 24 Since the Intended Appeal in respect of the Further Evidence Point doesnotfulfil even the Threshold Merits Requirement, Mr Tan will be confined to Malaysia OS 455 for the Intended Appeal. Accordingly, the RECJA Point will not arise for this court’s determination in the Intended Appeal and can have no bearing on the outcome of the Intended Appeal if leave is granted. The Intended Appeal in respect of the RECJA Point likewise fails to satisfy even the Threshold Merits Requirement. Accordingly, in our judgment, OS 32 fails. 25 We add that, in any event, the Intended Appeal in respect of the RECJA Point would alsonotfulfil the Discretionary Appropriateness Requirement. As we emphasised inUJM, it is not enough simply for the point of law to be novel or for it to be one that has not been considered by the Court of Appeal before (seeUJMat [120]; see also [17] above). Thus, the fact that the RECJA Point is a novel point of lawper sedoes not engage the Stipulated Consideration in O 57 r 2A(3)(a) of the Rules of Court. Moreover, the fact that there have been no prior decisions of the Singapore courts on the RECJA Point means that the AD is just as well-equipped as the Court of Appeal is to resolve this point of law and the case cannot be one for which a decision of the Court of Appeal is “required”. 26 As for the Stipulated Consideration in O 57 r 2A(3)(b) of the Rules of Court, we note that any issue associated with interpreting the word “appeal” deals with the scope of proceedings in a foreign jurisdiction which a litigant may rely on in seeking to set aside the registration in the Singapore courts of a judgment obtained in that jurisdiction. It involves the application of the legislative policy underlying the relevant statutory regime for the registration of foreign judgments and is unlikely to raise any concerns about the administration of justice. Therefore, in respect of the RECJA Point, the case is also far removed from those situations which we posited inUJMas being likely to engage O 57 r 2A(3)(b) (seeUJMat [124]; see also [18] above). 27 Finally, we address the two complaints of prejudice raised by Mr Tan in connection with the AD’s decision on the RECJA Point (see [11(c)(i)] above). At the outset, we note that these complaints arise from the AD’s decision in CA 54 as a whole, which would have been the same regardless of how the AD had decided the RECJA Point (see [20] above). Therefore, even if there was any merit in Mr Tan’s complaints of prejudice, the Stipulated Consideration in O 57 r 2A(3)(b) would nevertheless not be engaged, because these complaints do not arise from the AD’s decision on the RECJA Point, which Mr Tan says this court must consider in the Intended Appeal. In any event, there is no merit in Mr Tan’s complaints of prejudice. First, Mr Tan complains of prejudice arising from the fact that there would have been a different outcome in CA 54 if Malaysia OS 455 had been resolved in his favour prior to the hearing of CA 54. However, the AD’s decision in CA 54 was premised on the character of the reliefs sought in Malaysia OS 455, and would have been the same whatever the outcome of Malaysia OS 455 might have been. Second, Mr Tan complains of prejudice as a result of being subject to the Consent Judgment even though there remain “extant [Malaysian] proceedings challenging [the Consent Judgment]”. By this argument, Mr Tan must be referring to Malaysia Suit 437, because only that, and not Malaysia OS 455, challenges the Consent Judgment (see [9] above). However, that is the consequence of the AD’s non-consideration of Malaysia Suit 437, which in turn, had been the result of Mr Tan’s own doing in relying on Malaysia OS 455 as the ground for setting aside until it transpired after RA 83 had been heard that Malaysia OS 455 was of no assistance to him (see [23] above).",
        "Conclusion": "28 For the foregoing reasons, we dismiss OS 32 on the basis that the Intended Appeal (in respect of the Further Evidence Point, and in turn, the RECJA Point) does not fulfil even the Threshold Merits Requirement. Mr Tan is to pay costs of $5,000 (all-in) to MTB. The usual consequential orders will apply. Andrew Phang Boon LeongJustice of the Court of AppealSteven ChongJustice of the Court of Appeal Raeza Khaled Salem Ibrahim and Ammani Mathivanan (Salem Ibrahim LLC) for the applicant; Ng Yeow Khoon, Claudia Marianne Frankie Khoo and Tham Xue Yi Fiona (Shook Lin & Bok LLP) for the respondent.",
        "": ""
    }
}