{
    "case_title": "Milaha Explorer Pte LtdvPengrui Leasing (Tianjin) Co Ltd",
    "ncitation": "[2022] SGCA 9",
    "coram": "Andrew Phang Boon Leong JCA:",
    "sections": {
        "Introduction": "1 The Appellate Division of the High Court (the “AD”) was created to alleviate the growing caseload of the Court of Appeal and to facilitate the efficient administration of justice. Given that the regime is still relatively new, it is understandable that parties may face some difficulties navigating the regime. In time to come, such difficulties should lessen as the regime becomes more familiar to all. Nevertheless, counsel are reminded that they shouldalwaysbe guided by reasonableness and common sense, even as they assist their clients in navigating an unfamiliar legal regime. They shouldalwaysseek to act in the interest of the efficient administration of justice, not against it. Any significant failure in this regard might be met with adverse costs orders.",
        "The transfer application": "2 The present application brings into sharp focus the need for counsel to act reasonably and sensibly. It is an application by the applicant, Milaha, to transfer AD/CA 118/2021 (“AD 118”) from the AD to the Court of Appeal. Milaha acknowledges that it had inadvertently filed the appeal to the AD when the appeal should have been made to the Court of Appeal pursuant to s 29C(2) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”), read with para 1(c) of the Sixth Schedule to the SCJA. Milaha submits that AD 118 arises from a case relating to the law of arbitration and thus falls within para 1(c) of the Sixth Schedule to the SCJA. 3 The respondent, Pengrui,agreesthat the appeal should have been made to the Court of Appeal for the same reasons stated above by Milaha. This should have promptly resolved the present application. However, Pengrui does not agree to the transfer of AD 118. It argues that Milaha should withdraw AD 118 and file a fresh appeal to the Court of Appeal. 4 The reason behind Pengrui’s curious position is that it had filed AD/SUM 35/2021 (“SUM 35”) to strike out AD 118 on the basis that Milaha failed to seek leave to appeal as required under para 3(l) of the Fifth Schedule to the SCJA, and that the appeal was filed to the wrong court. As such, Pengrui argues that AD 118 is invalid and is not an appeal in existence. It argues that such an appeal cannot be transferred.",
        "My decision": "5 Without expressing any views on the merits of SUM 35, in my view, Pengrui’s opposition towards the transfer of AD 118 is problematic. 6 The relevant portions of the Fifth Schedule to the SCJA read as follows: Definition 1. In this Schedule, “appellate court”, in relation to an appeal against a decision of the General Division, meansthe court to which the appeal is to be made under section29C. … Interlocutory decisions, etc. 3. Subject to paragraph 4(2),the leave of the appellate courtis required to appeal against a decision of the General Division in any of the following cases: … (l) where a Judge makes an order at the hearing of any interlocutory application other than an application for any of the following matters … [emphasis added] 7 The parties are not in dispute that the appeal should have been made to the Court of Appeal in accordance with s 29C(2) of the SCJA. As such,ifleave to appeal is required, it is to be sought from the Court of Appeal, which is the correct “appellate court” under paras 1 and 3 of the Fifth Schedule to the SCJA, read with para 1(c) of the Sixth Schedule to the SCJA. 8 Pengrui’s argument that AD 118 is invalid and is not an appeal in existence proceeds on the false premise that SUM 35 is already before the correct “appellate court” pursuant to paras 1 and 3 of the Fifth Schedule to the SCJA. Since Pengrui acknowledges that the appeal should be before the Court of Appeal instead of the AD, it cannot use the fact that AD 118 is presently pending striking outbefore theADto argue that AD 118 is invalid and is not an appeal in existence. This puts the cart before the horse. Instead, the proper course of action is to transfer AD 118 from the AD to the Court of Appeal, and for the Court of Appeal to hear SUM 35 on the striking out of AD 118 for lack of leave to appeal thereafter. 9 In essence, the correct “appellate court” as defined under the Fifth Schedule to the SCJA needs to be determined first, before striking out or leave to appeal applications can be made to and/or decided by that court. Since parties do not dispute what the correct “appellate court” is in the present case, there really should not have been any issues affecting the transfer of AD 118 from the AD to the Court of Appeal. 10 Pengrui’s suggestion that Milaha should withdraw AD 118 and file a fresh appeal ignores the potential prejudice that would be caused to Milaha, given that the time for filing a notice of appeal has already lapsed. AsperO 57 r 4 of the Rules of Court (2014 Rev Ed), the notice of appeal is to be filed within one month from the date of the refusal of an application. Pengrui’s suggestion would mean that Milaha will need to file another application for the extension of time to file an appeal, before filing a fresh notice of appeal. This is a circuitous route that would only waste costs and time for the parties and militates against the efficient administration of justice. The provisions in the SCJA relating to transfers seek to resolve cases where the appeal was filed to the wrong appellate court without causing such prejudice to appellants. Such provisions should be utilised in appropriate cases (such as the present) and counsel should be guided by reasonableness and common sense in advising their clients on whether to consent or object to a transfer.",
        "Conclusion": "11 Accordingly, I order the transfer of AD 118 and all related applications from the AD to the Court of Appeal. Given the circumstances of the transfer, I make no order as to costs. The usual consequential orders apply. 12 However, I emphasise once again that counsel should always properly evaluate whether the positions that they take are reasonable and sensible, and whether such positions delay proceedings unnecessarily (such as that suggested at [10] above). As I have stated at the outset of this Judgment, a failure in this regard might be met with adverse costs orders in the future. Andrew Phang Boon LeongJustice of the Court of Appeal Edgar Chin Ren Howe and Ch’ng Cheng Yi Samantha(Ascendant Legal LLC) for the applicant; Henry Li-Zheng Setiono (Ang & Partners) for the respondent.",
        "": ""
    }
}