{
    "case_title": "Xitrans Finance Ltd vRappo, Tania and another matter",
    "ncitation": "[2023] SGCA 22",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 These are two applications which seek the partial lifting of theforum nonconveniensstay that was ordered by this Court inRappo, Tania v Accent Delight International Ltd and another and another appeal[2017] 2 SLR 265 (“the Stay Judgment”). For the reasons that follow, we dismiss the applications.",
        "Facts": "",
        "The parties": "2 Accent Delight International Ltd (“Accent”) and Xitrans Finance Ltd (“Xitrans”) are companies incorporated in the British Virgin Islands. They are owned by the family trusts of Mr Dmitry Rybolovlev (“Mr Rybolovlev”). Mr Rybolovlev is a Russian magnate who was, until 2010, the chairman of the Board of the Uralkali group in Russia. Xitrans is the applicant in both CA/SUM 2/2023 (“SUM 2”) and CA/SUM 3/2023 (“SUM 3”) (collectively, the “Applications”). 3 The respondents in SUM 3 are Mr Yves Charles Edgar Bouvier (“Mr Bouvier”) and MEI Invest Limited (“MEI Invest”). We will refer to them collectively as the “Bouvier parties”. Mr Bouvier is a businessman in the international art scene. MEI Invest is a Hong Kong incorporated company that Mr Bouvier controls and uses for his business purposes. From around 2002 or 2003, Mr Bouvier and Mr Rybolovlev had a course of dealing that stretched over a decade in the course of which Mr Rybolovlev amassed a significant art collection which includes masterpieces by highly renowned artists such as Vincent van Gogh, Pablo Picasso, Henri Matisse, Claude Monet and Leonardo da Vinci. The underlying dispute between the parties concerns Mr Bouvier’s role in those dealings. 4 The respondent in SUM 2 is Ms Tania Rappo (“Ms Rappo”). Ms Rappo was close to the Rybolovlev family (though the extent of this closeness is the subject of dispute). She met Mr Rybolovlev in Geneva in either 1995 or 2000. She struck up a close friendship with Mr Rybolovlev’s wife, and later became godmother to one of Mr Rybolovlev’s children who was born in 2001. Ms Rappo was the one who introduced Mr Bouvier to Mr Rybolovlev. 5 Because Xitrans and Accent are the respondents in the underlying appeals from which the Applications arise (see [14] below), we will refer to them collectively as the “respondents” (even though Xitrans is the applicant in the Applications). Mr Bouvier, MEI Invest and Ms Rappo will be referred to collectively as the “appellants” (even though they are the respondents in the Applications).",
        "Events leading up to the Stay Judgment": "6  The events leading up to the Stay Judgment are set out in detail at [10]–[39] of the Stay Judgment. Here, we summarise the key facts that are relevant to the Applications. 7 As we have mentioned, Mr Bouvier was involved in Mr Rybolovlev’s acquisition of artwork for over a decade starting in 2002 or 2003. The parties disagree as to the nature of each individual’s respective role in the acquisition process. According to Mr Bouvier, Mr Rybolovlev had a clear idea of which art pieces he wished to acquire and was knowledgeable about the art market. He would therefore express interest in specific pieces of art, after which Mr Bouvier would locate the piece and acquire it from its owner. Mr Rybolovlev, through one of the respondents, would then purchase the piece from Mr Bouvier. Mr Bouvier’s position is that he was at liberty to “on-sell” the artwork to Mr Rybolovlev at a profit, with the profit margin being determined by what he considered to be the value of the art piece. To Mr Bouvier, the “value” of the art piece was essentially the price that Mr Rybolovlev was willing to pay. 8 According to the respondents, however, Mr Bouvier was meant to act as Mr Rybolovlev’s agent in sourcing and acquiring artwork. Mr Bouvier was believed to be able to acquire artwork at better prices given his expert knowledge and contacts from his business. The respondents claim that Mr Bouvier would first inform Mr Rybolovlev of an opportunity to purchase a particular artwork and provide advice on the price at which it could be obtained. Mr Rybolovlev and his representative would then give instructions as to the terms they found acceptable, and Mr Bouvier was then to negotiate the purchase with the owner in accordance with those terms. For his services, Mr Bouvier was only entitled to charge a commission calculated at 2% of the sale price. 9 Over their long relationship, Mr Bouvier was involved in Mr Rybolovlev’s acquisition of 38 pieces of art. For the purposes of the Applications, what is important is that six pieces of art were acquired between August 2003 and July 2007 (the “Category 1 Transactions”), two were acquired between July 2007 and December 2007 (the “Category 2 Transactions”), and 30 were acquired between February 2008 and September 2014 (the “Category 3 Transactions”). The Applications concern only the Category 1 and Category 2 Transactions. For all of these transactions, Xitrans was the purchaser. This is why Accent is not involved in the Applications. 10 Sometime towards the end of 2014, the relationship between Mr Bouvier and Mr Rybolovlev broke down. In December 2014, Mr Rybolovlev claims to have learned that the seller of one of the paintings that he had purchased had received US$93.5m by way of sales proceeds. Accent, however, had paid Mr Bouvier US$118m for that same painting. Mr Rybolovlev also discovered that another painting which he had purchased through Mr Bouvier for US$127.5m had been sold by its previous owner for between US$75m and US$80m. This led Mr Rybolovlev to believe that Mr Bouvier had been dishonestly inflating sale prices for much, or even all, of the artwork that he had purchased. 11 On 9 January 2015, Swiss counsel for the respondents at the time (“Ms Bersheda”) made a criminal complaint in Monaco against “[Mr Bouvier] and any participant” in the purchases. On 25 February 2015, when Mr Bouvier went to Mr Rybolovlev’s residence in Monaco purportedly to discuss an outstanding payment, he was arrested. Ms Rappo was arrested on the same day. On 27 February 2015, Ms Bersheda wrote to the investigating judge of the criminal complaint and informed him that the respondents and Mr Rybolovlev’s daughter, Ms Ekaterina Rybolovleva, wished to join the proceedings against Mr Bouvier and Ms Rappo as civil parties. 12 On 12 March 2015, the respondents commenced Suit No 236 of 2015 (the “Suit”) in Singapore. In the Suit, the respondents alleged that Mr Bouvier had breached his fiduciary duties as their agent and committed the tort of deceit. The respondents also alleged that MEI Invest and Ms Rappo were liable for dishonest assistance and knowing receipt. They alleged that all the appellants conspired to wrongfully cause loss to them. 13 On 15 April 2015, Mr Bouvier and MEI Invest applied for a stay of the proceedings in Singapore on two grounds: first, there was alisalibi pendensin Monaco and second, Switzerland was the appropriate forum for the determination of the respondents’ claims. On 22 April 2015, Ms Rappo made a similar application, on the grounds that both Monaco and Switzerland were more appropriate fora than Singapore. 14 The appellants’ stay applications were dismissed by a High Court Judge on 17 March 2016 (seeAccent Delight International Ltd and another v Bouvier, Yves Charles Edgar and others[2016] 2 SLR 841). The Bouvier parties filed an appeal in CA/CA 113/2016 and Ms Rappo filed an appeal in CA/CA 110/2016 (collectively, the “Appeals”). We heard the Appeals on 1 March 2017.",
        "The Stay": "15  On 18 April 2017, we allowed the Appeals for the reasons set out in the Stay Judgment. One key issue in the Appeals was whether Switzerland was a more appropriate forum than Singapore for the parties’ dispute. For a number of reasons, we decided that Switzerland was clearly the more appropriate forum for the parties’ dispute (see [68]–[91] of the Stay Judgment). 16 In response, the respondents argued that Switzerland was not available as a forum because, under the Swiss Federal Act on Private International Law of 18 December 1987 (the “PILA”), the Swiss courts did not have jurisdiction over the dispute. The parties called experts to testify on this issue. Ultimately, we preferred the view of the appellants’ expert which was that the Swiss courts would have jurisdiction over the parties’ dispute by virtue of the written undertakings of the appellants that they “recognise and accept the jurisdiction of the civil courts of Geneva, Switzerland, in respect of any dispute in connection with the sale of artworks to [the respondents] and/or any related transactions” (the “Written Undertakings”). We were satisfied that the Written Undertakings would “provide the Swiss courts with a firm footing on which to assume jurisdiction” and that the language of these undertakings was “broad enough to encompass the claims” brought by the respondents against the appellants (see [96] of the Stay Judgment). In response to a suggestion by the respondents’ counsel that the Written Undertakings were not “wide enough” and that further challenges to the Swiss courts’ jurisdiction could be expected, counsel for the Bouvier parties and counsel for Ms Rappo confirmed to the court that (see [97] of the Stay Judgment): the Appellants’ written undertakings were intended to be expressed in the “widest possible sense”, and, specifically, that the Appellants would submit to the Swiss courts’ determination on the merits of any claims that the Respondents might bring against them in Switzerland in respect of the matters set out in [the Suit]. 17 We will refer to these oral undertakings as the “Further Undertakings”. We will refer to the Written Undertakings and Further Undertakings collectively as “the Undertakings”. 18 Respondents’ counsel then expressed the concern that if, for some reason, the Swiss courts decided not to assume jurisdiction following a stay of the Suit in Singapore, the respondents would be effectively shut out from seeking any remedy for wrongs which they allegedly suffered. We did not agree: 101 … if the Swiss courts were to decide, upon a commencement of an action by the Respondents there, that they do not have jurisdiction, it will be open to the Respondents to return to the Singapore courts to seek an order lifting the stay so that they might continue to pursue their action here. After all, as noted at [68] above, at the first stage of theSpiliada([68] supra) framework, the court is engaged in only aprima faciedetermination of whether there is some other available forum that is more appropriate for the trial of the case. Since a court which grants a stay remains seised of the proceedings and may in principle lift the stay at a later date (see our recent ex tempore judgment inRotary Engineering Ltd vKioumji & Eslim Law Firm[2017] SGCA 24 (at [24]), if the premise on which it decides to grant a stay should turn out to be mistaken or unduly optimistic, we see no reason why the stay cannot, in such “exceptional circumstances which strike at the very basis on which the stay was granted”, be revisited (at [25]). 102    We hasten to add that the Swiss courts should be given an opportunity to make a full and final determination that they indeed do not have jurisdiction over the parties’ dispute before the Respondents can again seek to trigger the exercise of the Singapore courts’ jurisdiction. … 19 Ultimately, we concluded that Switzerland was the more appropriate forum for the dispute and ordered a stay of the Suit in Singapore (the “Stay”).",
        "The proceedings in Switzerland": "20 On 8 March 2017, the respondents filed a criminal complaint with the Public Prosecutor’s Office in Bern against Mr Bouvier, Ms Rappo and others in respect of the 38 acquisitions of art referred to at [9] above. In this criminal complaint, the respondents asserted their civil claims against Mr Bouvier and Ms Rappo pursuant to Art 119(2)(b) of the Swiss Code of Criminal Procedure. Under Swiss law, one who has suffered harm as a result of an alleged criminal offence may obtain civil compensation by attaching their civil action to the criminal proceedings. We will refer to these proceedings as the “Swiss Criminal Proceedings”. 21 In September 2017, the criminal complaint was transferred from the Public Prosecutor’s Office in Bern to the Public Prosecutor’s Office in Geneva. A supplementary criminal complaint was later filed on 16 October 2019 by the respondents against Mr Bouvier, MEI Invest and Ms Rappo. 22 Between March 2017 and the summer of 2020, the Swiss Public Prosecutor (“Swiss PP”) investigated the criminal complaints. On 14 December 2020, the Swiss PP informed the parties that the Swiss Criminal Proceedings would be discontinued. The respondents objected to the discontinuance in a letter sent to the Swiss PP on 29 January 2021. They sent a further letter on 12 May 2021, stating that they would refer the matter to the Geneva Court of Appeal (“Geneva CA”) on the grounds of denial of justice unless the Swiss PP resumed the investigations. On 28 May 2021, the respondents filed such an application to the Geneva CA (the “Referral”). 23 On 15 September 2021, the Swiss Criminal Proceedings were formally discontinued by the Swiss PP through the issuance of a “Dismissal Order”. The respondents appealed against the Swiss PP’s issuance of the Dismissal Order to the Geneva CA on 27 September 2021 (the “Dismissal Appeal”). 24 The Geneva CA issued its decision on the Referral and the Dismissal Appeal on 26 July 2022. It decided: (a) There was no denial of justice or unjustified delay by the Swiss PP in the Swiss Criminal Proceedings.(b) The conditions for dismissal were not met. The continuation of the investigation in keeping with the fundamental rights of the accused persons was perfectly achievable.(c) That said, some of the transactions complained of occurred outside the 15-year limitation period for the investigation of criminal offences under Swiss law. For such transactions, the investigation could not be continued. The Dismissal Order was thus annulled in respect of the offences which fell within the 15-year limitation period. 25 Given that the Geneva CA’s decision was given in July 2022, the Geneva CA identified the Category 1 Transactions as those which fell outside the 15-year limitation period and for which the criminal investigations could not continue. By the time the Applications were filed in January 2023, however, the Category 2 Transactions also fell outside the 15-year limitation period. The parties agree that as a consequence of the Geneva CA’s decision both the Category 1 Transactionsandthe Category 2 Transactions can no longer be investigated in the Swiss Criminal Proceedings. We will refer to the civil claims arising from these transactions collectively as the “Discontinued Claims”. The parties also agree that the Discontinued Claims can no longer be pursued in the Swiss Criminal Proceedings. The investigations in the Swiss Criminal Proceedings in respect of the other claims are ongoing. 26 Following the Geneva CA’s decision, there was some correspondence between the parties concerning what was to be done next in respect of the Discontinued Claims. On 22 August 2022, the respondents’ Singapore lawyers (“Drew & Napier”) wrote to Ms Rappo’s Singapore lawyers (“TKQP”) and the Bouvier parties’ Singapore lawyers (“Allen & Gledhill”). Drew & Napier explained the effect of the Geneva CA decision and stated that “the civil law claims asserted by [the respondents] in accordance with Article 119(2)(b) of the Swiss Criminal Procedure Code derived from the criminal offences committed prior to July 2007 [could] no longer be determined in the Swiss Criminal Proceedings”. They then stated (at para 5 of the letter) the respondents’ position that, under Swiss law, they were “nevertheless entitled to independently pursue civil law claims derived from the criminal offences committed prior to July 2007”. They asked Allen & Gledhill and TKQP to state by 31 August 2022 “whether [their] respective clients take the same position”. 27 Allen & Gledhill responded on 16 September 2022. They stated the following: 3.  As regards paragraph 5 of your Letter, our clients disagree with your clients’ position and/or interpretation of the Swiss law. 4. All of our clients’ rights, including as to the effect of the [Geneva CA’s judgment], are fully and expressly reserved. 28 TKQP responded on 20 September 2022. Their response to Drew & Napier’s request was as follows: 3.  As regards paragraph 5 of your 22 August Letter, our client sees no reason to comment on your clients’ position and rights under Swiss law, on which your clients have presumably sought legal advice. Indeed, it is your clients’ prerogative to pursue any claims in Switzerland as they are entitled and advised by their Swiss counsel. 29 Drew & Napier then wrote in to the Supreme Court Registry to provide a material update in relation to the proceedings in Switzerland. They explained the Geneva CA’s decision and the effect of this decision on the Category 1 Transactions in the Swiss Criminal Proceedings. They then stated that: 7. … both [Ms Rappo] and [the Bouvier parties] have refused to accept that our clients can proceed with the [civil claims concerning the Category 1 Transactions], notwithstanding that the stay of proceedings which they previously obtained from the Singapore Court in [the Appeals] was premised on [their] then-position that all the claims in [the Suit] could be pursued and determined on the merits in Switzerland. Drew & Napier then stated that the appellants had therefore clearly departed from their initial position in the Appeals. Accordingly, the Stay should be lifted so that the claims in the Suit could resume and proceed to a final determination on the merits. 30 Allen & Gledhill and TKQP sent in letters in response, disagreeing with Drew & Napier’s position that the Stay should be lifted. 31 On 11 January 2023, Xitrans filed the Applications, seeking a variation of the order given in the Stay Judgment such that the Stay be lifted in respect of the Discontinued Claims.",
        "Parties’ cases": "",
        "Xitrans’ case": "32 The Applications are premised on our remarks in The Stay Judgment at [101] (see [18] above). As explained inRotary Engineering Ltdand others v Kioumji & Eslim Law Firm and another and another appeal[2017] 1 SLR 907 (“Rotary Engineering”) at [24]–[25], if the premise on which the court decides to grant a stay should turn out to be mistaken, the court may, in such exceptional circumstances which strike at the very basis on which the stay was granted, exercise its discretion to lift the stay. 33 As mentioned at [25] above, following the Geneva CA’s decision, the Discontinued Claims can no longer be pursued in the Swiss Criminal Proceedings because the alleged criminal offences to which they relate are no longer being investigated. According to Xitrans, it is nonetheless entitled to pursue the Discontinued Claims in independent Swisscivilproceedings. Xitrans takes issue with the fact that both Ms Rappo and the Bouvier parties are unwilling to confirm that they accept this position. Xitrans argues that, if it were to commence civil proceedings in Switzerland in respect of the Discontinued Claims, Ms Rappo and the Bouvier parties clearly intend to prevent a determination on the merits of the claims by making complicated arguments that the Discontinued Claims are time-barred. 34 Xitrans argues that these are unique and exceptional circumstances; the appellants have reneged on the Undertakings given in the Appeals to submit in the widest possible sense to the respondents’ claims being determined on the merits by the Swiss courts. Accordingly, there has been a departure from the basis on which the Stay was ordered. The Stay order should therefore be lifted in respect of the Discontinued Claims so that they can be determined on the merits in the Suit in Singapore. 35 Xitrans submits that by the Undertakings the appellants agreed that “there would be a reckoning of whether Bouvier and his co-conspirators had deceived the [respondents] and fraudulently earned secret profits from the artwork transactions”. It is said that because the appellants clearly intend to raise time-bar or other procedural objections to the Discontinued Claims in Switzerland such that they should not be determined on their substantive merits, the appellants have resiled from the Undertakings. For the appellants to abide by the Undertakings, there should not be any time-bar challenges made in respect of the respondents’ claims in Switzerland. 36 Xitrans also highlights that during the Appeals it may have been thought that the respondents’ claims in Switzerland would have been determined within a reasonable time. With hindsight, this can be said to have been overly optimistic. A number of years have passed without significant progress in Switzerland. Xitrans argues, as a secondary ground for its application, that the length of time elapsed and absence of significant progress in Switzerland should be an additional factor in support of a lifting of the Stay.",
        "Ms Rappo’s case": "37  Ms Rappo argues that there are no exceptional circumstances which warrant the lifting of the Stay. 38 Ms Rappo submits that she has not resiled from the Undertakings. According to Ms Rappo, the Undertakings were simply that she “recognises and accepts the jurisdiction of the civil courts of Geneva, Switzerland, in respect of any dispute in connection with the sale of works of art and/or any transactions related to [Mr Bouvier]”. Nothing in her response to the respondents’ position on their ability to pursue the Discontinued Claims has suggested that she does not recognise or accept the jurisdiction of the Swiss courts. On the contrary, she has repeatedly confirmed in correspondence and on affidavit that she recognises and accepts such jurisdiction. 39 Key to Ms Rappo’s case is the proposition that time-bar objections are not jurisdictional objections under Swiss law. Ms Rappo has adduced expert evidence from Professor Francois Bohnet (“Prof Bohnet”) on this and other issues. Prof Bohnet explains that under Swiss law, a time-bar is a substantive defence which goes to the merits of a matter. Given that this is the case, Ms Rappo can raise a time-bar objection without departing from her undertaking to submit to the Swiss courts’ jurisdiction. 40 While it is true that six years have passed since the Stay Judgment, there is no severe delay which amounts to substantial injustice such that a lifting of the Stay is warranted. The doctrine offorum nonconveniensis premised on the principle of international comity, and therefore courts are generally hesitant to stigmatise a foreign legal system by holding that delays are so egregious as to amount to substantial injustice. Accordingly, there is a high threshold for Xitrans to meet, and it has not done so. In this case, it is relevant that the Geneva CA itself considered that there was no unjustified delay by the Swiss PP in the Swiss Criminal Proceedings. It is also suggested that we must take into consideration the fact that the respondents themselves have been in a large part responsible for the delay in Switzerland. 41 Finally, Ms Rappo highlights that a lifting of the Stay in respect of the Discontinued Claims would fragment the respondents’ case against the appellants, and this would be undesirable. There would be a risk of duplicative proceedings and inconsistent findings.",
        "The Bouvier parties’ case": "42 Like Ms Rappo, the Bouvier parties submit that there are no exceptional circumstances here and the premise on which the Stay was ordered has not changed. This is not a case where the Swiss courts have decided not to assume jurisdiction over the Discontinued Claims such that we were mistaken or optimistic in our assessment that they would decide to do so. Like Ms Rappo, Mr Bouvier emphasises that the issue of a time-bar is distinct from the issue of the Swiss courts’ jurisdiction. Furthermore, the respondents have not even given the Swiss courts the opportunity to decide whether the Discontinued Claims are time-barred. This is despite the respondents’ acknowledgement that theycoulddo so. The Undertakings given by the appellants do not prevent them from exercising all rights and defences available to them in the Swiss courts under the applicable law. 43 Like Ms Rappo, Bouvier also argues that partially lifting the Stay such that the Discontinued Claims are heard in Singapore would fragment the respondents’ claim across two jurisdictions, which is not desirable. 44 Finally, Mr Bouvier highlights that the respondents commenced the Swiss Criminal Proceedings on 8 March 2017, more than a month before the Stay Judgment was issued. He suggests that this shows the respondents’ propensity to forum shop. It is submitted that we should not exercise our discretion to partially lift the Stay in favour of such “frivolous and/or disingenuous litigants”.",
        "Issues before this court": "45 There is no dispute that the basis for lifting aforum nonconveniensstay is that set out inRotary Engineeringat [24]–[25] and the Stay Judgment at [101]. 46 The primary issue to be determined is therefore whether there has been a departure from the very basis upon which the Stay was ordered. It is only in such circumstances that we will consider revisiting the Stay. Xitrans has cited two ways in which there has been such a departure: (a) the appellants’ failure to abide by the Undertakings; and (b) the substantial delay that has occurred in the Swiss Criminal Proceedings. We will therefore consider whether: (a) the appellants have reneged on the Undertakings such that there has been a departure from the basis upon which the Stay was granted; and(b) there has been substantial delay in the Swiss Criminal Proceedings such that there has been a departure from the basis upon which the Stay was granted. 47 Then, given that lifting the Stay is ultimately matter of discretion, we will consider whether there are any other factors which weigh against the lifting of the Stay.",
        "Have the appellants reneged on the Undertakings such that there has been a departure from the basis upon which the Stay was granted?": "",
        "The scope of the Undertakings": "48 To answer this question, it is first important to determine the scope of the Undertakings. 49 According to Xitrans, the Undertakings were “not limited to just a submission to the jurisdiction of the Swiss courts”. They encompassed an agreement to “submit to a determination on the merits of the parties’ underlying dispute, i.e.whether [Mr Bouvier] had acted as the Respondents’ agent in each of the transactions, what duties were owed by [Mr Bouvier] to the Respondents, and whether he breached those duties”. 50 According to Ms Rappo, the Undertakings were simply to “recognise and accept the jurisdiction of the civil courts of Geneva, Switzerland”. 51 According to Mr Bouvier, despite the Undertakings, the appellants are “fully entitled to defend themselves in any civil proceedings in Switzerland, including exercising all rights and defences that are available to them under the applicable law”. 52 The starting point in this inquiry is the context in which the Undertakings were given. As can be seen from [16]–[18] above, the Undertakings were given to satisfy us that the Swiss courts would have jurisdiction over the parties’ dispute. The Undertakings were relevant to the question of the Swiss courts’jurisdictionbecause such jurisdiction was said to arise from Art 6 of the PILA, which reads: In matters involving an economic interest, a court shall have jurisdictionif the defendant proceeds on the merits without reservation, unless such court denies jurisdiction to the extent permitted by Article 5, paragraph 3. [emphasis added] For the Swiss courts to have jurisdiction by virtue of Art 6, the appellants would have to proceed on the merits without reservation in Switzerland. The Undertakings allowed us to be confident that the appellants would do so, and therefore that the Swiss courts would have jurisdiction by virtue of Art 6 of the PILA. This is made clear in the following extract from [96] of the Stay Judgment: On the contrary, we are satisfied that the written undertakings provided by each of the Appellants will provide the Swiss courts with a firm footing on which to assume jurisdiction. We are also of the view that the language of the undertakings is broad enough to encompass the claims that the Respondents wish to bring against the Appellants. 53 In favour of its interpretation of the Undertakings, Xitrans highlights that while the Written Undertakings were expressly limited to an agreement to recognise and accept the jurisdiction of the Geneva civil courts, the Further Undertakings were not so limited. The Further Undertakings referred to an agreement to “submit to the Swiss courts’ determination on the merits” of any of the respondents’ claims. Xitrans interprets the phrase “determination on the merits” to mean “a reckoning of whether Bouvier and his co-conspirators had deceived the Respondents and fraudulently earned secret profits from the artwork transactions”. This is where Xitrans’ argument fails. The “determination on the merits” referred to in the Further Undertakings should not be interpreted in that way for two reasons. 54 First, it ignores the context in which the Further Undertakings were given. The Further Undertakings were given in response to the suggestion by the respondents’ counsel that “the written undertakings proffered by the Appellants were not wide enoughand that further challenges to the jurisdiction of the Swiss courts could be expected” [emphasis added]. The key concern was whether the Swiss courts would have jurisdiction over the parties’ dispute, and whether the appellants would challenge such jurisdiction. Having regard to the wording of Art 6 of the PILA, it makes sense why the word “merits” was used in the Further Undertakings; for Art 6 to apply, the defendant must proceed on the “merits”. Thus, the word “merits” in the Further Undertakings should not be interpreted any more widely than the word “merits” in Art 6 of the PILA. There is no suggestion by Xitrans that the raising of a time-bar objection defeats the application of Art 6 of the PILA because the defendant will no longer be considered to have proceeded on the merits. In fact, Xitrans appears to accept that time bar objections do not defeat the Swiss courts’ jurisdiction over the dispute. Xitrans must therefore accept that, even if the appellants raise time-bar objections to the Discontinued Claims in Swiss civil proceedings, they will have proceeded on the merits for the purposes of Art 6 of the PILA. 55 Second, Xitrans’ interpretation of the Further Undertakings is much wider than any possible interpretation of the Written Undertakings. Based on Xitrans’ interpretation of the Further Undertakings, the appellants would effectively have relinquished their right to take any action in Swiss civil proceedings that would avoid a reckoning of whether Mr Bouvier and his co-conspirators fraudulently deceived the respondents and earned secret profits. This involves giving up a number of substantive defences that are typically available to litigants. This would include making arguments that the respondents’ claims are time barred, and also applying for the respondents’ claim to be struck out for procedural irregularity. The Written Undertakings are clear and relate only to jurisdiction. There is nothing in the Stay Judgment to suggest that by giving the Further Undertakings, the appellants drastically exceeded the scope of the Written Undertakings. Indeed, we recognised that the Further Undertakings were “completely consistent with and, indeed, merely a reaffirmation of the Appellants’ earlier written undertakings” (the Stay Judgment at [100]). 56 Xitrans has therefore misinterpreted the Undertakings. Our concern, in imposing the Undertakings, had been to ensure that the Swiss courts, which were determined to be clearly the more appropriate forum, would be in a position to deal with the respondents’ claims in accordance with the applicable law and procedure. The Undertakings were required to address the respondents’ concerns that the appellants would raise jurisdictional objections and refuse to submit to the jurisdiction of the Swiss courts. But while we insisted on a submission to jurisdiction and to a waiver of anyjurisdictionalobjection, we did not require, and indeed could not properly have required, the appellants to give up substantive defences. The Undertakings as interpreted by Xitrans require the appellants to do exactly that – to give up any substantive defences which would defeat the respondents’ claims without a “a reckoning of whether Bouvier and his co-conspirators had deceived the Respondents and fraudulently earned secret profits from the artwork transactions”. There was never an expectation or requirement that the appellants had to submit to a reckoning by the Swiss Courts on such terms. The respondents are therefore mistaken on the position they take before us.",
        "Have the appellants reneged on the Undertakings?": "57 The appellants have been clear that they continue to accept and recognise the jurisdiction of the Swiss courts to hear the dispute. There is no suggestion by Xitrans that the appellants will refuse to submit to, or will challenge, the jurisdiction of the Swiss courts to hear the Discontinued Claims in separate Swiss civil proceedings. Any time-bar challenge, if raised, would not be ajurisdictionalchallenge. We consider that the invocation of a limitation defence goes to the merits of a claim and does not go to jurisdiction. This accords with Prof Bohnet’s expert opinion on Swiss law (see [39] above). Indeed, Xitrans does not even suggest that the raising of a time-bar objection by the appellants would constitute a challenge to, or put in jeopardy, the Swiss courts’jurisdictionover the Discontinued Claims. 58 It is therefore clear that the appellants have not breached the Undertakings, nor have they indicated that they will take action that will amount to such a breach. There has therefore been no departure from the basis upon which the Stay was granted.",
        "Has there been substantial delay in the Swiss Criminal Proceedings such that there has been a departure from the basis upon which the Stay was granted?": "59 Xitrans also argues that the length of time elapsed in the Swiss Criminal Proceedings constitutes a departure from the basis on which the Stay was granted. The argument is that the Stay was granted on the premise that proceedings in Switzerland would conclude within a reasonable time, and this premise has been shown to be mistaken given that there has been no significant progress in Switzerland over the past six years. 60 In applying the test fromSpiliadaMaritime Corporation v Cansulex Ltd[1987] AC 460 (“Spiliada”), potential delays in the foreign forum come into play at the second stage, when the court considers if there are circumstances by reason of which justice requires that a stay should not be granted. In sufficiently serious circumstances, a court may choose not to grant a stay in favour of the more appropriate forum because the delay that the claimant will face in that forum would amount to a denial of substantial justice:Grains and Industrial Products Trading Pte Ltd and another v State Bank of India and others[2019] SGHC 292 at [121]. The first premise of Xitrans’ submission, therefore, has merit. While not explicitly stated in the Stay Judgment, we likely assumed that there would be no delay amounting to a denial of substantial justice in the Swiss courts when we decided to grant the Stay. The problem with Xitrans’ submission, however, is the second premise, that it can now be said with hindsight that it has faced delay amounting to a denial of substantive justice in the Swiss courts. In its decision on the Referral and the Dismissal Appeal, the Geneva CA found that there was no unjustified delay by the Swiss PP in the Swiss Criminal Proceedings. In these circumstances, it would be difficult for us to find that the respondents have been denied substantial justice by the delay in the Swiss Criminal Proceedings. As we recognised in the Stay Judgment at [110], there is a general policy that a court should proceed cautiously before it pronounces that a litigant will experience a deprivation of substantial justice in a foreign forum, especially where that forum operates a well-established and well-recognised system of justice. 61 Therefore, the delay experienced by Xitrans in Switzerland is not one that can be said to amount to a denial of substantial justice, and the conclusion at [112] of the Stay Judgment on the second stage of theSpiliadatest was not based on a “mistaken or unduly optimistic” assumption. There has been no departure from the basis upon which the Stay was granted.",
        "Other factors weighing against the lifting of the Stay": "62 Having determined that there is no basis for the Stay to be lifted, we need not consider whether there are any factors which militate against exercising our discretion to do so. That said, we note that the effect of revoking the Stay in respect of the Discontinued Claims would be to split the litigation between the respondents and the appellants across Singapore and Switzerland. The Discontinued Claims would be determined in the Suit and the claims relating to the Category 3 Transactions would be determined in the Swiss Criminal Proceedings. This would be a highly undesirable state of affairs given the extent of factual and legal overlap between the two sets of claims. This factor would therefore have weighed against revoking the Stay in the manner sought by Xitrans.",
        "Conclusion": "63 For these reasons, we are satisfied that there is no basis to revoke the Stay in respect of the Discontinued Claims. While Xitrans may not wish to have to deal with time-bar objections in Swiss civil proceedings that it may commence in respect of the Discontinued Claims, this Court’s continuing discretion to lift aforum nonconveniensstay will not be exercised to allow litigants to re-agitate settled issues because they happen to encounter inconveniences or setbacks in prosecuting their claims:Rotary Engineeringat [25]. 64 We dismiss the Applications. For each of SUM 2 and SUM 3, we order costs and disbursements in the aggregate sum of $20,000 in favour of the Bouvier parties and Ms Rappo respectively. The usual consequential orders apply. Sundaresh MenonChief JusticeJudith PrakashJustice of the Court of AppealAndrew Phang Boon LeongSenior Judge Cavinder Bull SC, Lim Gerui and Lea Woon Yee (Drew & Napier LLC) for the applicant in Summonses Nos 2 and 3 of 2023; Pek Aik Hin, Leong Yi-Ming, Chua Xinying and Abigail Anousha Fernandez (Allen & Gledhill LLP) for the respondent in Summons No 2 of 2023; Kenneth Michael Tan SC (instructed), Seah Zhen Wei Paul, Alcina Lynn Chew Aiping and Mohamed Shafie bin Allameen (Tan Kok Quan Partnership) for the respondent in Summons No 3 of 2023."
    }
}