{
    "case_title": "CODvCOE",
    "ncitation": "[2023] SGCA 29",
    "coram": "Belinda Ang Saw Ean JCA (delivering the grounds of decision of the court):",
    "sections": {
        "Introduction": "1 The appellant, COD, in CA/CA 32/2002 (“CA 32”) appliedvideCA/SUM 22/2022 (“SUM 22”) for liberty to adduce further evidence at the hearing of the appeal in CA 32. This court heard SUM 22 before oral arguments on the main appeal on 26 June 2023. 2 Both SUM 22 and CA 32 were dismissed on 26 June 2023. At the conclusion of the oral hearing, we affirmed the Judge’s decision published inCOD v COE[2022] SGHC 126 (“COD v COE (HC)”). We agreed with the analysis and reasoning of the Judge in refusing to set aside the arbitral award. As we did not add to the grounds of the Judge’s decision, no written grounds for dismissing CA 32 were required. However, we now issue our written grounds for dismissing SUM 22. Any reference to CA 32 is only for the purpose of providing necessary background to SUM 22. 3 The main issue in SUM 22 was whether the further evidence in the sense of fresh or new evidence on the purported market value of two cranes that were the subject of the underlying arbitration, might be admitted in an appeal to set aside the tribunal’s final award issued on 21 June 2021 (“the Final Award”) in a non-jurisdictional challenge where the new evidence had not been adduced in the arbitration or in the setting aside application before the Judge below. A related issue (better characterised as one that is anterior to the main issue) was whether such an application was flawed and indeed an abuse of process and should be dismissedinlimine.Suffice it to say for now that the appellant sought to adduce new evidence before this court in order to use that evidence as its basis to raise new arguments on appeal which had not been canvassed before the Judge below. Such an approach could hardly be the basis of the appeal. In so doing, the appellant also sought to adduce new evidence in aid of a position in the appeal which was inconsistent with the appellant’s position taken below. A factor for consideration was whether the appellant should be permitted at the appeal to assume a position opposite from the one taken on the same matter before the Judge. We set out our full grounds for dismissing SUM 22.",
        "Background": "",
        "Parties and the underlying dispute": "4 The appellant was a company incorporated in Singapore which was engaged in,inter alia, leasing, building and selling offshore vessels. The respondent, a local company, was in the business of fabricating marine and offshore equipment. 5 The appellant appointed the respondent to fabricate and deliver two fibre rope cranes (the “Cranes”) under two contracts (the “Contracts”) containing the same terms and arbitration clauses. Subsequently, the appellant terminated both Contracts on the ground of the respondent’s non-compliance with contractual specifications and requirements. The appellant declined to take delivery of the Cranes.",
        "The arbitration": "6 On 6 November 2015, the respondent commenced two arbitrations against the appellant. The two arbitrations were consolidated and will be referred to collectively as the “Arbitration”. The respondent averred that the appellant had breached the Contracts due to its wrongful refusal to take delivery of the Cranes. The respondent sought specific performance and payment of the balance contract price of the Cranes, with damages in the alternative. 7 In response, the appellant contended that the weight of the Cranes had exceeded the contractually specified limit and that it was entitled to terminate the Contracts. The appellant counterclaimed for the sums it had previously paid to the respondent and other losses accruing from the respondent’s delay in the delivery and/or non-delivery of the Cranes. 8 On 28 April 2020, the arbitral tribunal (“the Tribunal”) issued an interim award (the “Interim Award”). The Tribunal held that while the Cranes did not comply with the contractual specifications for weight, that non-compliance did not justify the appellant’s termination of the Contracts. The Tribunal further held that damages would be a just and appropriate remedy to restore the respondent to the position it would have been had the Contracts not been wrongfully terminated and invited further submissions on the quantum of damages. 9 On 21 June 2021, the Tribunal issued the Final Award. The Tribunal awarded damages to the respondent in the following manner. First, the Tribunal awarded to the respondent the purchase price of the Cranes together with variation orders that increased the price, less amounts paid to the date of the Final Award (the “Balance Price”). Next, the Tribunal deducted from the Balance Price the resale value of the Cranes,ie, scrap value as set out in the respondent’s witness statement. 10 The Tribunal also awarded damages to the appellant for the costs it would have incurred in modification and rectification works due to the Cranes’ non-compliance with contractual specifications, and for the respondent’s late delivery of the Cranes.",
        "Application to set aside Final Award": "11 On 10 September 2021, the appellant applied to the General Division of the High Court by way of HC/OS 925/2021 (“OS 925”) to set aside the Final Award. OS 925 was dismissed in its entirety on 25 May 2022.",
        "The appeal in CA 32": "12 CA 32 was filed on 5 August 2022 against the whole of the decision in OS 925. The grounds relied on by the appellant on appeal were the same as below. The appellant argued that the Final Award should be set aside under ss 48(1)(a)(iii) and/or 48(1)(a)(vii) of the Arbitration Act (Cap 10, 2002 Rev Ed) (“AA”) as the appellant was unable to present its case or that there was a breach of the rules of natural justice. The appellant contended that the Tribunal had allowed the respondent to advance a claim for damages (the “Damages Claim”) for the first time after the issuance of the Interim Award without giving the appellant a fair and reasonable opportunity to respond to this claim. 13 The second and alternative ground relied on by the appellant was that the Final Award should be set aside under s 48(1)(a)(v) of the AA as the Tribunal had not complied with the arbitral procedure agreed on by parties,ie, to have one tranche of hearing without it being bifurcated into phases on liability and damages. The Tribunal had instead proceeded to a bifurcation in which the respondent was allowed to introduce the Damages Claim.",
        "Application in SUM 22 for permission to adduce further evidence": "14 On 1 November 2022, the appellant filed the present summons, SUM 22, under O 19 r 7(7) of the Rules of Court 2021 (“ROC 2021”) and s 59(5) of the Supreme Court of Judicature Act 1969 (2020 Rev Ed) (“SCJA 1969”) for the appellant to be at liberty to adduce further evidence at the hearing of the appeal in CA 32. The appellant made that application on the basis that it had found out after OS 925 had been decided that the Cranes were being advertised for sale for US$1m to US$2m on an as is where is basis or US$3m to US$4m in reconditioned operational condition. The appellant’s position was that the evidence it sought to adduce (the “Further Evidence”) would show that the respondent had lied to the Tribunal that the Cranes were merely worth their scrap value when there was an available market for them. 15 The Further Evidence was contained in two draft affidavits. The first draft affidavit was furnished by the Technology General Manager (the “TGM”) of the appellant’s parent company. His evidence was that on 1 August 2022, he had received an email from a vessel assets broker (“the Broker”) offering two offshore cranes for sale (the “Marketed Cranes”). He confirmed by way of the model number and specifications stated in the email and a phone call with the Broker that these were the Cranes and that they were on sale as functional cranes and not for scrap. He had also received a similar email from the same Broker earlier on 29 July 2022, offering the Marketed Cranes for sale. Further, the company’s chief executive officer also received an email from the Broker on 5 September 2022 offering the two Marketed Cranes for sale. 16 The appellant then engaged a firm of professional marine surveyors to inspect the Marketed Cranes. The second affidavit was furnished by a Marine Consultant at the firm, who presented a report of the inspection he had conducted and the photographs he had taken. The TGM’s evidence was that he had reviewed the photographs and found that the Marketed Cranes had the same serial numbers and project codes as well as the same unique parts as the Cranes which were the subject of the Arbitration. 17 In its reply affidavit, the respondent contended that the Further Evidence did not affect the Tribunal’s findings in its Final Award or the conclusion reached in OS 925 that there was no breach of natural justice. The Further Evidence comprised advertisements offering the Cranes for sale (with a price tag of US$1–2m on an as is where is basis and US$3–4m in reconditioned operational condition specified in one of the three emails sent). Notably, the point was that the advertisements were not proof that the Cranes had been sold so as toprima facieestablish a market value that was determined on the basis of a willing seller and willing buyer. The respondent also stated that the Cranes could no longer be sold as functional cranes given their condition as reflected in the photographs. 18 Further, the respondent denied selling the Cranes in the open market. Rather, it averred that it had sold the Cranes for scrap to a local company, “Buyer 1”, on 27 August 2020 for S$185,000.00 before GST or S$92,500.00 per crane. In support of this claim, the respondent exhibited an invoice from itself to Buyer 1 as well as its acceptance of the latter’s offer.",
        "The parties’ submissions on SUM 22": "",
        "Appellant’s submissions": "19 The appellant’s submissions as the applicant in SUM 22 centred on the materiality of the Further Evidence to its alleged ground of a breach of natural justice. Essentially, the appellant contended that the Further Evidence undermined the allegation made by the respondent in the Arbitration that there was no market for the Cranes in their existing state and that the Cranes had no value except as scrap metal. The Further Evidence also contradicted the respondent’s allegation in OS 925 that the appellant was not prejudiced by the alleged breach of natural justice since the Cranes had no market and value; in fact, the new evidence would point to serious prejudice to the appellant in the face of the contradictions. In other words, the prejudice suffered by the appellant resulted from a breach of natural justice,ie, in being denied the opportunity to investigate and present its own evidence on the Damages Claim. 20 The appellant submitted that since the Further Evidence came into existence after the judgment date, the modified version of theLadd vMarshallrequirements (the “Ladd v MarshallModified Test”) as provided for inBNX v BOE and another appeal[2018] 2 SLR 215 (“BNX v BOE”) (at [97]–[99]) would apply instead of the full-blown test inLadd v Marshall[1954] 1 WLR 1489 (the “Ladd v Marshalltest”). Applying theLadd v MarshallModified Test, the Further Evidence was indeed relevant to matters of which evidence was sought to be given, was at least potentially material to issues in the appeal and at least appeared to be credible. Even if theLadd v Marshalltest applied, the appellant submitted that the requirements of the test were satisfied. First, the Further Evidence could not have been obtained with reasonable diligence for use in the hearing as it did not exist at the hearing of OS 925. Second, the Further Evidence would probably have an important influence on the result of the case, as the fact that the Broker was marketing the cranes for sale demonstrated that the appellant could have adduced evidence of an available market for the Cranes and their market value in their existing state if it had a reasonable opportunity to respond to the respondent’s Damages Claim. Thirdly, the evidence was apparently credible, as it was in the form of documents and there was no dispute as to its authenticity.",
        "Respondent’s submissions": "21 The respondent’s position was that the appellant’s case in SUM 22 was a “conjecture based on conveniently timed advertisements which [the appellant] was conveniently the recipient of”. The respondent also submitted that it did not make any misrepresentation or perpetrate any fraud at any stage of the Arbitration. 22 In assessing the admissibility of the Further Evidence, the respondent contended that theLadd v Marshalltest should apply as the evidence related to whether there was an available market for the Cranes at the time of the Arbitration. Applying theLadd v Marshalltest, the respondent submitted that firstly, evidence of the alleged available market, if any, could have been adduced by the appellant with reasonable diligence. Secondly, the Further Evidence was not relevant as it did not show whether there was an available market at the time of the Arbitration or even now. The evidence in fact reflected that the cranes were unserviceable and non-functional. Also, the Further Evidence was a mere advertisement for sale and did not show there was a market, let alone anavailablemarket. Further, the respondent no longer had ownership, custody, possession and/or control over the Cranes as it had sold the Cranes to Buyer 1. The appellant had also not confirmed with the Broker if the respondent was behind the sale. Thirdly, the Further Evidence was not credible as it lacked details as to how the Cranes were obtained or who had commissioned the Broker to make the sale. The respondent also submitted that it was suspicious that the Broker had only sent the first email to the appellant on 29 July 2022 (four days after the decision in OS 925) when the appellant had previously received unsolicited emails from the same Broker in October 2020 expressing interest in the Cranes, especially given the appellant’s failure to even try to determine the identity of the party on whose behalf the Broker was selling the Cranes.",
        "Anterior issue: Whether a party should be permitted to adduce new evidence to raise new arguments which had not been put before the Judge in OS 925": "23 We alluded to this anterior issue at [3] above. Before we discuss the anterior issue in detail, we set out the background facts on a prior application taken out by the appellant to adduce further evidence in OS 925, namely, HC/SUM 991/2022 (“SUM 991”). 24 The background of SUM 991 was as follows. The appellant had sought to adduce evidence that comprised: (a) an email and valuation report by the same Broker; (b) various industry news reports and articles showing a market for fibre optic cranes, and various articles and websites evincing possible ways of dealing with the Cranes apart from selling them for scrap; and (c) witness statements contained in an affidavit in specific response to allegations raised in the affidavits of the respondent’s witnesses. 25 The email and valuation report (ie, item (a) above) were of especial interest to SUM 22. The Broker’s email, which was dated 1 December 2021, stated that the Broker was actively looking for all types of offshore cranes currently available for sale. Meanwhile the valuation report, which was dated 10 March 2022, was furnished by a director of the Broker in response to Mr Winston Kwek’s (counsel for the appellant) request for a valuation. The valuation report purportedly valued the Cranes at US$2.5 to US$3m each as of 2022 on the same footing as steel wire cranes and clarified that whilst the Broker was aware of each Crane in stock, it had not been approached by the respondent to market or sell the Cranes. 26 During the oral hearing of SUM 991, counsel for the appellant (instructed), Mr Chan Leng Sun SC (“Mr Chan”), asked that the Judge stand over SUM 991 until the end of the main hearing. Counsel for the respondent, Mr Tan Boon Yong Thomas, submitted that this was impractical and that should the court allow the application in SUM 991, the respondent ought to be granted leave to respond. The upshot of that exchange would result in an adjournment of the setting aside hearing. Mr Chan then stated that they would make a “judgment call” to withdraw SUM 991, “bearing in mind that if [the appellant] lose[s] these [two] days, [the appellant] [has] no idea when the next hearing might be”. The Judge did note that the matter could also go to another Judge in any event, but accepted Mr Chan’s “judgment call” that the appellant could proceed with the hearing of the setting-aside application without the aid of evidence sought to be adduced in SUM 991. 27 Although the appellant did not rely on all the same documents in SUM 991 and in SUM 22, importantly the sets of correspondence with the Broker in bothsummonses pertained to the same subject matter which was whether the Cranes had any market value (as opposed to only scrap value). The new evidence in SUM 991 on the purported market value would have suggested that as of late 2021 to early 2022, the Broker considered the Cranes to be of value and also that the Broker itself was looking to buy offshore cranes in general. By the time SUM 22 was filed, the Broker appeared to have come into possession of and was offering to sell the Cranes in July to September 2022 either on an as is where is basis or in a reconditioned state. There was a conspicuous absence of information as to when and how the Broker purportedly came into possession of the Cranes, but the point is that one of the advertisements dated 29 July 2022 (after the decision in OS 925) had given a price tag premised on whether they were being sold on an as is where is basis or in a reconditioned state. Put simply, although SUM 22 relied on emails that came into existence only after the judgment in OS 925, the fact remained that thesubject matterin question was the same, having already been raised in an affidavit in support of SUM 991. 28 Against this backdrop, we formed the view that SUM 22 was an application which was flawed and indeed an abuse of process for at least three main reasons. First, the application offended the rule of finality in proceedings. SUM 22 was demonstrably a reversal of the position the appellant had taken before the Judge below. The appellant had already known of evidence suggesting that the Broker had considered the Cranes to be of substantial value and not merely of scrap valuebeforeOS 925 was heard but had decided to proceed with OS 925 without the evidence on the available market for the Cranes and their market value which it had sought to adduce in SUM 991. The appellant was now attempting to rely on the Further Evidence to raise and make new arguments at the appeal in CA 32 that the respondent had been wrong in suggesting that the Cranes were of scrap value only, or even to the extent that the respondent had lied to the Tribunal about the scrap value of the Cranes. Notably, such arguments were not put forward during the hearing of OS 925. Therefore, our second reason was that the Further Evidence sought to be adduced in SUM 22 could hardly form the basis of an appeal moving forward. Our third reason was that SUM 22 was an abuse of process as it was an attempt to fill the evidential gap that arose from the appellant’s “judgment call” in the proceedings below rather than from a dissatisfaction with the decision below.  We now elaborate on the three reasons. 29We begin withUJN v UJO[2021] SGCA 18 (“UJN vUJO”). The facts are not relevant to the present application, but the propositions enunciated by this court in that case are apposite. A court would generally be disinclined to allow a party to adduce fresh evidence on appeal if that evidence is in aid of a position which is inconsistent with the applicant’s position below (UJNv UJOat [7]): … The interest of finality in proceedings is still relevant and the interest to hold parties to their positions is equally, if not more, important as it would often be unfair to the opponent and to the court if a party were to take one position in the hearing below and yet be allowed to resile from it on appeal. The waste of court resources is another factor. Indeed it could also be said that running a contrary case on appeal is an abuse of process as the appeal would not really arise from dissatisfaction with the decision below but really with the conduct of the case below on the part of the dissatisfied party… 30 As stated, SUM 22 was not the first time the appellant had sought to adduce further evidence in the sense of fresh evidence in relation to the question of whether there was an available market for the Cranes and their market value, and whether the appellant could have adduced evidence to establish this during the Arbitration. We have already explained what had happened to SUM 991. 31Going further, it is worth noting that the appellant did not adduce evidence of an available market for the Cranes and their market value in the arbitration. That meant that the evidentiary record of the arbitration did not contain such evidence for the Judge to consider. This was even though the respondent’s argument that there was no market for the Cranes had already been in play during the Arbitration. Returning to the Tribunal’s observations regarding the appellant’s contention at the Arbitration (ie, that the appellant had been misled into thinking that the respondent was not claiming for a remedy of the price of the Cranes less scrap value and did not have a chance to address this claim with evidence or cross examination), the Tribunal had found in its Final Award that: 57. In like manner, I find that by virtue of the [respondent’s] Statement of Claim, the [appellant] would have had fair notice of the alternative case for damages should specific performance be granted. I do not agree with the [appellant’s] contention that it was unable to know the case it had to meet:the [appellant] would have had sufficient notice of the [respondent’s] alternative claim for damages, and accordingly would have been aware of the need to address the various issues relating to a claim for damages. That the [appellant] did not choose to do so, for example by adducing evidence on the issue of damages through its witnesses, or challenging the [respondent’s] entitlement to damages, should not be attributed to themanner in which the [respondent] had run its case. … 61. In my view, [the appellant’s]'s grievance stems from the fact that it did not adduce nor seek to challenge the evidence that [the respondent] had adduced in the proceedings in relation to damages. [The appellant] contends that [the respondent] never adduced evidence going towards a claim for the cost price minus scrap value. 62. But is this really the case? In respect of evidence supporting a claim for the cost price of the Cranes, it is a straightforward matter of producing the relevant contracts in question to derive the price of each Crane: it is not disputed that both contracts for the Cranes have indeed been adduced. In respect of the evidence of the Cranes' scrap value, such evidence has in fact been put forward by [the respondent], and can be located in the Affidavit of Evidence in Chief (\"AEIC\") of one of [the respondent]'s witness, [Y]. [Y] posited a value attributable to the scrap value for the Cranes, and had indicated how that value was derived, with several documents to support his contention. It is clear from paragraph [275] of [Y]'s AEIC that [the respondent] was seeking damages in the event that specific performance was not granted. 63. I find that the [respondent] did in fact adduce evidence going to the scrap value of the Cranes.The [appellant] was free to adduce evidence to the contrary, or to test the veracity of the evidence adduced by the [respondent] during the substantive hearing… 64.The [appellant] did not do so despite having ample opportunity. [emphasis added] 32 It was plain from the Final Award that a key gap in the appellant’s case was that it had not adduced evidence to show that the Cranes had market value. Evidence of market value was also not before the Judge hearing the application to set aside the arbitral award in OS 925, given that the appellant had made the considered decision not to proceed with SUM 991. It was from the conduct of the case first before the Tribunal and then before the Judge below that the filing of SUM 22 manifested an abuse of process by a dissatisfied party who deployed a procedural tool to run a contrary case on appeal. SUM 22 was an attempt to fill the evidential gap in order to run new arguments that were not made below to the Judge. As such, the new evidence and arguments could not form the basis of an appeal. 33 For the reasons stated, SUM 22 was dismissedinlimine.",
        "Admissibility of new evidence on appeal to set aside an arbitral award on non-jurisdictional grounds: the merits of SUM 22": "34 Having dismissed SUM 22inlimineit was strictly not necessary to express our views on the merits of the application proper. However, as the parties had submitted on the merits, we considered them for completeness. 35 OS 925 was the appellant’s application to set aside the Final Award on non-jurisdictional grounds, namely that there had been a breach of natural justice, that the appellant was unable to present its case and that the Tribunal had proceeded in a manner contrary to the arbitral procedure agreed by parties. It was important to emphasise that the role of the supervisory court is one of minimal curial intervention, that the court will not interfere with the merits of the case and that a setting-aside application is not an opportunity for the appellant to take a second bite of the cherry. 36 It is with these propositions in mind that a court approaches an application by a party to adduce further evidence in the sense of new or fresh evidence to aid its application to set aside an arbitral award, whether at first instance or on appeal. When such an application is brought, the test to be applied for such an application is either theLadd v Marshalltest or theLadd v MarshallModified Test. Both theLadd v Marshalltest and theLadd v MarshallModified Test are meant to uphold the procedural interest in imposing a degree of finality in the parties’ opportunity to obtain and produce evidence in dispute-resolution proceedings (Vitol Asia Pte Ltd vMachlogic Singapore Pte Ltd[2021] 4 SLR 464 at [42]). 37 As provided for in s 59(4) of the SCJA 1969 read with O 19 r 7(7) of the ROC 2021, should the Further Evidencenotrelate to matters occurring after the date of the decision appealed against, then an applicant must showspecialgroundswarranting the admission of further evidence in an appeal by satisfying the three cumulative conditions in theLadd v Marshalltest(seeBNX v BOEat [74];AnAn Group (Singapore) Pte Ltd v VTB Bank(Public Joint Stock Co)[2019] 2 SLR 341 at [21]),ie, that: (a) the evidence could not have been obtained with reasonable diligence for use in the lower court; (b) the evidence would probably have an important influence on the result of the case, although it need not be decisive; and (c) the evidence must be apparently credible, although it need not be incontrovertible. 38 However, if the Further Evidence relates to matters occurringafterthe date of the decision appealed against, s 59(5) of the SCJA 1969 provides that the evidence “may be given to the Court of Appeal without permission” and O 19 r 7 of the ROC 2021 provides that it is exempt from the requirement that further evidence may not be given except on special grounds. The court should hence apply theLadd v MarshallModified Test (seeBNX v BOEat [97] to [99]) which entails the following: (a) to ascertain what the relevant matters are, of which evidence is sought to be given, and ensure that these are matters that occurred after the trial or hearing below; (b) to satisfy itself that the evidence of these matters is at least potentially material to the issues in the appeal; and (c) to satisfy itself that the material at least appears to be credible. Additionally, where the application to adduce further evidence pertains to appeals against decisions regarding the setting aside of an arbitral award onnon-jurisdictionalgrounds, the Singapore courts have been guarded in permitting the admission of evidence that is relevant to the court’s consideration of the engaged grounds of setting aside, and in declining to admit further evidence that seeks to challenge the arbitral tribunal’s findings on themeritsof the parties’ underlying disputes (see, for example,PT Perusahaan Gas Negara (Persero) TBK v CRW Joint Operation[2015] 4 SLR 364 at [40]–[44]). That being said, fraud or corruption is one non-jurisdictional ground on which the court may generally be more open to the admission of further evidence. We are here referring to the ground that the making of the award was induced or affected by fraud or corruption (s 48(1)(a)(vi) of the AA). This is because fresh evidence is often necessary to show some degree of fraudulent or corrupt activity which had induced the award. 39 Of course, at the end of the day, the court’s approach to further  evidence in the sense of fresh or new evidence adduced for setting-aside applications on non-jurisdictional grounds is a fact-dependent exercise, and the court must pay attention to the nature of the ground for setting-aside relied on by the parties, the facts and circumstances of the case, as well as the question of whether this evidence could have been brought prior to the challenge (See, for example,Radisson Hotels APSDanmark v Hayat Otel Isletmeciligi Turizm Yatirim Ve Ticaret Anonim Sirketi[2023] EWHC 892 (Comm) at [127]–[128]). We see, for example, inCEF and another v CEH[2022] 2 SLR 918 (at [30] and [54]–[56]) (“CEF vCEH”), that the court had admitted and considered additional evidence relevant to the question of whether the appellants’ argument that an order made by the arbitral tribunal (the “Transfer Order”) was impossible or unworkable was in fact an afterthought and a contrivance. While this may at first blush appear to be an admission of evidence of matters going to the merits of the tribunal’s decision, we note that the appellants had relied on the alleged unworkability of the Transfer Order to say that the same order should be set aside under Art 34(2)(a)(iv) of the UNCITRAL Model Law on International Commercial Arbitration as the arbitral procedure was not in accordance with the agreement of the parties (at [32]). On the specific facts of that case, the court was hence justified in admitting this evidence and had not gone beyond the limits of its supervisory jurisdiction. 40 The case ofBNX v BOEwas also illustrative in this regard. InBNX v BOE, BNX had appealed against the dismissal of its application to set aside an arbitral award against it. The two sets of documents which BNX sought to adduce on appeal were intended to support non-jurisdictional grounds for setting aside the arbitral award, namely, to show that the Award was induced or affected by fraud, there was a breach of the rules of natural justice in connection with the making of the award by which BNX’s rights were prejudiced and/or the award was contrary to public policy (at [59]). Applying theLadd v Marshalltest to the first set of documents, this court found that the documents could have been obtained if BNX had acted with reasonable diligence during the arbitration, and the omission to disclose these documents in the arbitration also did not suffice to show fraud on the part of BOE (at [77], [86] and [88]). This court also found that the documents were not relevant and in any event, it was not shown that the same result would not have ensued on the basis of the alternative independent grounds on which the tribunal arrived at its decision (at [91]–[94]). As for the second set of documents, the court applied theLadd v MarshallModified Test and found that the evidence was of what had been told to BOE’s representativesbeforethe arbitration and hence did not concern matters after the date of the decision below (at [102]). This court also found that the matters that the documents purported to relate to were not potentially material as they did not show that BOE’s representatives had given false evidence during the arbitration and the setting aside proceedings (at [103]). 41 Returning to the present application, the appellant had applied to rely on the Further Evidence to establish that a breach of the rules of natural justice had occurred in connection with the making of the Final Award by which its rights had been prejudiced. UnlikeCEF vCEH, there was no inevitable or excusable overlap present between the issues determined in the underlying Arbitration and the issues on appeal in CA 32. As such, the Further Evidence could only have been admitted if it pertained to the Tribunal’sconductof the arbitration and whether that conduct was in breach of the rules of natural justice – in other words, “the overall conduct of the proceedings with particular attention paid to the conduct of the tribunal and the parties themselves” (DongwooMann+Hummel Co Ltd v Mann+Hummell GmbH[2008] 3 SLR(R) 871 at [55]). We hence turned to consider whether this was indeed the case. 42 In SUM 22, the Further Evidence related to emails sentafterthe decision in OS 925. As such, s 59(5) SCJA 1969 was applicable to the Further Evidence and we hence applied theLadd v MarshallModified Test in determining whether the Further Evidence should be admitted for the purposes of CA 32. 43 In our view, the appellant was not able to satisfy the requirements of theLadd v MarshallModified Test. Specifically, the Further Evidence was not at least potentially material to the issues on appeal in CA 32. 44 The appellant’s argument was that the Further Evidence would show that there was indeed a market for the Cranes and that the appellant had been prejudiced as it had not been able to adduce evidence to this effect before the Tribunal. Its supporting affidavit for SUM 22 stated that the respondent’s representations in the Arbitration and in OS 925 that the Cranes had no market and were worth only scrap value were false, and that the respondent did not believe these representations to be true. The appellant’s written submissions maintained that the Further Evidence demonstrated the severe prejudice occasioned to the appellant as the Cranes were clearly marketable and valuable in their existing state. At the oral hearing, when asked how the Further Evidence in 2022 established that the respondent had misled the Tribunal in 2015, Mr Chan then said it did not go directly to the question of misleading but to the question of whether the cranes had value. But even on that basis, the appellant faced difficulties in establishing the potential materiality of its fresh evidence. 45 We agree with the respondent’s submissions that the appellant had been “happy to proceed” with OS 925 without the evidence in SUM 991 and that conduct suggested either that the appellant did not believe that there had been an available market at the material time, or that it “did not believe that such evidence was relevant or important enough to their case before the High Court”. Putting aside the appellant’s conduct that undermined its application in SUM 22, there are other reasons in play. 46 The Broker’s emails dated 29 July 2022, 1 August 2022 and 5 September 2022 did not show that there was a market for the Cranes or their market value. The respondent submitted that the email merely stated that the Broker was offering the Cranes for sale, and only to the appellant which had rejected the Cranes in the first place. Indeed, the emails stated only that the Broker “can offer for sale” the two Cranes. Further, only the email dated 29 July 2022 provided an indicative pricing of the Cranes, while the other two emails offered to “provide full specifications and guidance on pricing” if the appellant was interested. Taken at its highest, the evidence only suggested that there was a seller of the Cranes with indicative prices and would not be potentially material to the issues of whether there was a market for the Cranes and whether they had any value higher than scrap value. 47 Moreover, as mentioned above at [31], the Tribunal had noted in its Final Award that the appellant had failed to adduce evidence on the existence of an available market for the Cranes and the market value of the Cranes and to challenge the respondent’s evidence in relation to damages. To suggest that the Further Evidence would show that the appellant had been prejudiced in being deprived of an opportunity to adduce evidence in this regard would in fact turn reality on its head, and require the court to intervene in the Tribunal’s factual finding as to the market for and value of the Cranes – this was an untenable line of inquiry for this court and did not pertain to the live issues on appeal in CA 32. 48 Secondly, the date of the breach as determined by the Tribunal was 2015. The indicative value provided in the Further Evidence was provided by the Broker as of 2022. Simply put, the appellant had not adduced evidence about the value of the Cranes at the time of the breach. It was artificial for the appellant to try to make use of the supposed value of the Cranes in 2022 as a proxy to suggest that at the time of the breach in 2015, there was a market for the Cranes and that their values were more than their scrap values. 49 Thirdly and for completeness, it would in any event have been fanciful to suggest that evidence of the value of the Cranes in 2022 would show that the Tribunal was misled by the respondent in light of an evidential gap of seven years. This was especially because there was no evidence that the Broker was representing the respondent. To the contrary, the respondent had furnished evidence in response in SUM 22 to say that they had sold the cranes to Buyer 1 at scrap value in August 2020 after the Interim Award which was issued in April 2020. Payment for the cranes was then made in September 2020. What had been done with the Cranes after the respondent had sold them would have no bearing on thebona fidesof the respondent at the time of the arbitration. We digress to mention the evidence in the respondent’s reply affidavit that Buyer 1 had sold the Cranes to a third party, “Buyer 2”, for the price of S$400,000 before GST. As was highlighted to counsel for the appellant at the oral hearing of SUM 22, any buyer of the Cranes (even if they had bought them for scrap) would be entitled to maximise its returns, and this had nothing to do with the respondent who had already sold the Cranes. The assertion that the respondent had lied to the Tribunal on the scrap value was at best speculative, and again was not potentially material to the issues in the appeal. 50 As such, the requirement for the evidence to be at least potentially material under theLadd v MarshallModified Test had not been made out. Not only did the Further Evidence not in any way point to any concealment or disingenuous conduct on the part of the respondent, the fact that a claim for damages and the scrap value of the Cranes were issues already canvassed in the Arbitration, as highlighted by the Tribunal in its Final Award, further diminished any potential relevance of the Further Evidence in explaining away why the appellant did not deal with the claims and evidence that were clearly placed before it in the Arbitration.",
        "Conclusion": "51 For the foregoing reasons, we dismissed SUM 22. Judith PrakashJustice of the Court of AppealSteven ChongJustice of the Court of AppealBelinda Ang Saw EanJustice of the Court of Appeal Chan Leng Sun SC, Rachel Low (instructed counsel); Kwek Choon Lin Winston and Lim Zhi Ming, Max (Rajah & Tann Singapore LLP) for the applicant; Tan Boon Yong Thomas, Amos Julian Sivasupramaniam and Lee Yong Yee (Haridass Ho & Partners) for the respondent."
    }
}