{
    "case_title": "Lim Choon Beng vPublic Prosecutor",
    "ncitation": "[2023] SGCA 18",
    "coram": "Tay Yong Kwang JCA:",
    "sections": {
        "Introduction": "1 This is an application under s 394H(1) of the Criminal Procedure Code 2010 (2020 Rev Ed) (the “CPC”) for permission to make an application to review an earlier decision of the Court of Appeal. The applicant, who is 37 years old, acts in person. He is currently serving his imprisonment sentence. 2 In 2016, the applicant pleaded guilty to and was convicted by the High Court on four charges involving sexual offences. He consented to having four other charges taken into consideration for sentencing. In the High Court, Foo Chee Hock JC (“the Judge”) imposed a global sentence of 16 years, ten months and two weeks’ imprisonment and 22 strokes of the cane. The Judge’s grounds of decision are set out inPP vLim Choon Beng[2016] SGHC 169 (“Lim Choon Beng (HC)”). 3 The applicant appealed against his sentence. The Court of Appeal (comprising Sundaresh Menon CJ, Chao Hick Tin JA and myself) dismissed his appeal with a brief oral judgment on 29 November 2016 (“Lim Choon Beng (CA)”). 4 In this application, the applicant contends that there is “a gross miscarriage of justice” in the sentence imposed by the Judge. He seeks, in substance, a reduction of almost two years of his global sentence to 15 years’ imprisonment. This is on the sole basis that the Judge had referred to an earlier High Court decision,Public Prosecutor v Chang Kar Meng[2015] SGHC 165 (“Chang Kar Meng (HC)”), in his deliberations on the sentence to be imposed for the rape charges. InChang Kar Meng (HC), the High Court imposed a sentence of 12 years’ imprisonment and 12 strokes of the cane for a rape charge and the minimum sentence of 5 years’ imprisonment and 12 strokes of the cane for a robbery with hurt charge. On appeal, the Court of Appeal reduced the sentence of 12 years’ imprisonment for the rape charge to ten years’ imprisonment (seeChang Kar Meng v Public Prosecutor[2017] 2 SLR 68 (“Chang Kar Meng (CA)”)). As the Court of Appeal’s decision was delivered after the conclusion of the applicant’s appeal, he submits that this constituted a change in the law within the meaning of s 394J(4) of the CPC.",
        "Factual background": "",
        "Proceedings before the High Court": "The charges 5 The applicant pleaded guilty to four charges on 22 September 2016. The four charges are set out as follows: The second charge(the “OM Charge”) ... on 9 February 2013, sometime around 3.15 a.m., along Martin Road, in front of the ‘Watermark’ condominium located at No. 1 Rodyk Street, did use criminal force to one [xxx] (Date of Birth: [xxx]), intending to outrage her modesty, to wit, by grabbing and kissing her left breast, and in order to facilitate the commission of this offence, you voluntarily caused wrongful restraint to the said [xxx] by sitting on her body, and you have thereby committed an offence punishable under Section 354A(1) of the Penal Code, Chapter 224 (2008 Rev. Ed.). The third charge(the “First Rape Charge”) ... on 9 February 2013, sometime around 3.25 a.m., along Martin Road, in front of No. 100 Robertson Quay, did commit rape of one [xxx] (Date of Birth: [xxx]), to wit, you penetrated the vagina of the said [xxx] with your penis without her consent, and you have thereby committed an offence under Section 375(1)(a) and punishable under Section 375(2) of the Penal Code, Chapter 224 (2008 Rev. Ed.). The sixth charge(the “Second Rape Charge”) ... on 9 February 2013, sometime around 3.35 a.m., along River Valley Close, near lamp post no. 16, did commit rape of one [xxx] (Date of Birth: [xxx]), to wit, you penetrated the vagina of the said [xxx] with your penis without her consent, and you have thereby committed an offence under Section 375(1)(a) and punishable under Section 375(2) of the Penal Code, Chapter 224 (2008 Rev. Ed.). The seventh charge(the “Penile-Oral Charge”) ... on 9 February 2013, sometime around 3.35 a.m., along River Valley Close, near lamp post no. 16, did penetrate the mouth of one [xxx] (Date of Birth: [xxx]) with your penis without her consent, and you have thereby committed an offence under Section 376(1)(a) and punishable under Section 376(3) of the Penal Code, Chapter 224 (2008 Rev. Ed.). I refer to the First Rape Charge and the Second Rape Charge collectively as the “Rape Charges”. 6 The accused also consented to have four other charges taken into consideration for the purposes of sentencing. Of the four charges taken into consideration, three pertained to sexual offences committed by the applicant against the same victim, consisting of one count of rape, one count of digital-vaginal penetration and one count of penile-oral penetration. The last charge was for the possession of obscene films. Facts pertaining to the proceeded charges 7 The full facts of the proceeded charges are set out inLim Choon Beng (HC). In brief, the applicant raped and sexually assaulted the victim, a Chinese national who was then 24 years old, successively at three locations along public roads in February 2013. The applicant approached the victim while she was walking home by herself and spoke to her. When the victim did not reply and walked away, he grabbed her buttocks. She pushed him away and continued walking. A while later, the applicant grabbed her shoulders and pushed her backwards. When the victim fell, he sat on her lower body. He then pulled at her dress, pulled down her bra, grabbed her left breast and kissed it. This was the subject of the OM Charge. 8 On seeing some cars passing by, the applicant got off the victim and pulled her across the street. He hit her head against a wall and then pinned her to the ground. He then penetrated the victim’s vagina with his penis even though she had informed him that she was having her menses. This was the subject of the first Rape Charge. 9 After some time, the applicant withdrew his penis and put on his trousers. The applicant told the victim that he wanted to bring her home. In a bid to seek help from the security guard in her apartment building, the victim told the applicant that they could go to her home instead. When they reached a grass patch, the applicant suddenly pinned the victim to the ground. He inserted his penis forcefully into her mouth. After some time, the applicant inserted his penis into her vagina. This was the subject of the second Rape Charge and the Penile-Oral Charge. 10 The applicant only stopped when a taxi stopped near them. As the applicant stood up to wear his trousers, the victim managed to escape to seek help. Sentences imposed by the Judge 11 In respect of each of the charges, the Judge imposed the following sentences: (a) For the OM Charge, 30 months’ imprisonment and four strokes of the cane. (b) For the Penile-Oral Charge, three years, ten months and two weeks’ imprisonment and four strokes of the cane. (c) For each of the two Rape Charges, 13 years’ imprisonment and seven strokes of the cane. The Judge ordered the imprisonment terms for the First Rape Charge and the Penile-Oral Charge to run consecutively. The total sentence was therefore 16 years, ten months and two weeks’ imprisonment and 22 strokes of the cane. 12 For each of the Rape Charges, the Judge considered (a) the relevant aggravating and mitigating factors; (b) three sentencing precedents, one of which was the decision inChang Kar Meng (HC); (c) the four charges taken into consideration for the purposes of sentencing and (d) the totality principle. It was only in this context that the Judge consideredChang Kar Meng (HC)to be comparable to the applicant’s case given the similarities between the two cases (such as the commission of the offences in public and near the victim’s residence) and the aggravating factors.",
        "Proceedings before the Court of Appeal": "13 The applicant appealed against his sentence. On 29 November 2016, the Court of Appeal dismissed his appeal with the following oral judgment: This is our judgment. We dismiss the appeal. A total of eight charges were brought against the appellant. Of these, the appellant pleaded guilty to four charges: one count of aggravated outrage of modesty, two counts of rape, one count of penile-oral penetration. The appellant also consented for four other charges to be taken into consideration for the purposes of sentencing. These were for: one count of rape, one count of digital-vaginal penetration, one more count of penile-oral penetration, and one count of the possession of obscene films. We are satisfied that the individual sentences were well within the range for offences of this nature. Taking the rape charges, the Judge, if anything, had been lenient in classifying this as Category 1 offences under thePublic Prosecutor v NF[2006] 4 SLR(R) 849 framework. Having regard to the aggravating factors, including those he mentioned at [66] of the Grounds of Decision, namely the fact that the rape at the second location occurred in public, near the victim’s home and with a substantial degree of violence, as well as having regard to the other charges which the Judge was entitled, indeed obliged, to take into consideration for the purposes of sentencing, the sentence of 13 years’ imprisonment and 7 strokes of the cane is entirely defensible. As for the penile-oral penetration charge which was proceeded with, the Judge in fact reduced the sentence for this charge on the basis of the totality principle. In all the circumstances, we do not find any error in his sentencing consideration and we therefore dismiss the appeal.",
        "The decision in Chang Kar Meng (CA)": "14Chang Kar Meng (CA)was heard on 16 August 2016 and the judgment was delivered on 30 March 2017. InChang Kar Meng (CA), the Court of Appeal reduced the aggregate sentence imposed inChang Kar Meng (HC)from 17 years’ imprisonment to 15 years’ imprisonment. As mentioned earlier, inChang Kar Meng (HC), the accused pleaded guilty to one charge of rape and one charge of robbery with hurt. A sentence of 12 years’ imprisonment and 12 strokes of the cane was imposed for the offence of rape whereas a sentence of 5 years’ imprisonment and 12 strokes of the cane, which was the mandatory minimum sentence, was imposed for the offence of robbery with hurt. The imprisonment term of the two sentences were ordered to run consecutively, giving rise to the aggregate sentence of 17 years’ imprisonment and 24 strokes of the cane. 15 The Court of Appeal inChang Kar Meng (CA)reduced the aggregate imprisonment term on the basis that the prevailing sentences imposed for cases involving the offences of rape and robbery ranged from 11 to 15 years. The Court of Appeal accepted that the aggregate sentence of 17 years’ imprisonment, while not manifestly excessive, was out of line with the relevant precedents and the sentences meted out in previous cases with broadly similar circumstances. The Court of Appeal also accepted that the appellant in that case should be entitled to rely on the existing sentencing range and saw no basis for ignoring the appellant’s legitimate expectations, having regard to the general range of sentences imposed in similar cases involving both rape and robbery. 16 The Court of Appeal therefore reduced the aggregate sentence to 15 years’ imprisonment by reducing the imprisonment term for the rape charge from 12 years to ten years. The Court of Appeal made it clear at [76] that moving forward, offenders convicted of rape and robbery should not expect to benefit from similar leniency and a sentence of 17 years’ imprisonment and 24 strokes of the cane would not, in similar circumstances, be treated as manifestly excessive.",
        "The parties’ cases": "17 The applicant contends that there is a miscarriage of justice and asks for his total sentence to be reduced to 15 years’ imprisonment, a reduction of almost two years. This is because the Judge had relied onChang Kar Meng (HC)in arriving at the sentence imposed for the Rape Charges in his case. Since the term of imprisonment for the rape charge inChang Kar Meng (HC)was reduced by two years by the Court of Appeal inChang Kar Meng (CA), this renders the sentence imposed in his case to be wholly disproportionate given that the sentence imposed inChang Kar Meng(HC)has a direct proportional outcome on his sentence. 18 The Prosecution submits that the application is without merit. The application does not meet the statutory requirement under s 394J(2) of the CPC of having “sufficient material” on which the court may conclude that there is a miscarriage of justice. In particular, the decision inChang Kar Meng (CA)did not constitute a change in the law as it was concerned solely with the issue of whether the sentence inChang Kar Meng (HC)was manifestly excessive.The Prosecution further submits that the decision of this court to dismiss the applicant’s appeal inLim Choon Beng (CA)was not demonstrably wrong. 19 Although the applicant was not given permission to file further submissions in response to the Prosecution’s submissions, he did so on 29 May 2023. I directed the Registry of the Supreme Court to accept the applicant’s further submissions as an elaboration of his earlier submissions and also to inform the applicant that he is not allowed to file any more submissions without the permission of the court. 20 In the applicant’s further submissions, he maintained thatChang Kar Meng (HC)should not have been adduced as a precedent in the first place. It had “led to a fundamental misapprehension of sentencing law when the Judge utilized it to compute the overall sentence”. The applicant argues further thatChang Kar Meng (HC)had a significant bearing on his case and substantial injustice had arisen because the previous erroneous understanding worked to his detriment in that he was sentenced to more than what he should have been. This could arguably be said to be a fundamental misapprehension of the law. 21 The applicant submits further that there was also “a fundamental misapprehension of the facts” as stated in s 394J(7) of the CPC in that the Judge believed that 17 years was the appropriate figure when it should actually be 15 years instead. This caused the applicant to be sentenced to two additional years that were wholly unwarranted and unconstitutional. Had the correct sentence of 15 years’ imprisonment inChang Kar Meng (HC)been put before the Judge, he would have pronounced an imprisonment sentence of 15 years instead of 17 years on the applicant. 22 The applicant also referred to Art 11 of the Constitution of the Republic of Singapore (2020 Rev Ed) (the “Constitution”), particularly the words “no person shall suffer greater punishment for an offence than was prescribed by law at the time it was committed”. In this context, he argues that the clarification by the Court of Appeal at [76] ofChang Kar Meng (CA)(see [16] above) should not apply to him as it was said to have prospective effect only.",
        "My decision": "",
        "Applicable law": "23 To obtain permission under s 394H(1) of the CPC to make a review application, the application for permission must disclose a “legitimate basis for the exercise of the [appellate court’s] power of review”:Kreetharans/o Kathireson v Public Prosecutor and other matters[2020] 2 SLR 1175 at [17]. To show a legitimate basis for the appellate court’s exercise of its power of review, the applicant must show that the cumulative requirements for the appellate court’s exercise of its power of review are satisfied. These requirements are those contained in s 394J of the CPC:Roslanbin Bakar and others v Public Prosecutor[2022] 1 SLR 1451 at [21]. 24 Section 394J(2) of the CPC requires the applicant to show that there is “sufficient material” on which the appellate court may conclude that there has been a “miscarriage of justice” in the criminal matter in respect of which the earlier decision was made. Section 394J(3) then defines “sufficient material” as material which satisfies all the following requirements: (a) It must not have been canvassed at any stage of proceedings in the criminal matter before the application for permission to make the review was made (s 394J(3)(a) of the CPC);(b) It could not have been adduced in court earlier even with reasonable diligence (s 394J(3)(b) of the CPC); and(c) It must be compelling, in that it is reliable, substantial, powerfully probative and capable of showing almost conclusively that there has been a miscarriage of justice in the criminal matter (s 394J(3)(c) of the CPC). Section 394J(4) then clarifies that, for any material consisting of legal arguments to be considered “sufficient”, it must, in addition to the three points above, be based on a change in the law that arose from any decision made by a court after the conclusion of all proceedings relating to the criminal matter in issue. 25 To determine whether there was a miscarriage of justice, the appellate court has to consider if the earlier decision that is sought to be reopened is “demonstrably wrong”. For an earlier decision on sentence to be “demonstrably wrong”, it must be shown that the decision was based on a fundamental misapprehension of the law or the facts, thereby resulting in a decision that is “blatantly wrong on the face of the record” (see ss 394J(5)(a) and 394J(7) of the CPC). In the alternative, the court may conclude that there has been a miscarriage of justice if the earlier decision is “tainted by fraud or a breach of the rules of natural justice” (see s 394J(5)(b) of the CPC). 26 In the present application, the applicant relies on a change in the law effected inChang Kar Meng (CA).Specifically, he relies on the Court of Appeal’s decision to reduce the sentence imposed for the rape charge inChang Kar Meng (HC)from 12 years’ to ten years’ imprisonment. This impacts his case because the Judge had placed reliance onChang Kar Meng (HC).",
        "Application to the facts": "27 It is important to note that a review application is an application to review an earlier decision of an “appellate court” (s 394F(1) of the CPC). At various times, the applicant’s submissions appear to be impugning the decision inLim Choon Beng (HC)in that the Judge relied on the sentence in a precedent case which was subsequently reduced on appeal. In this judgment, I shall therefore focus on whetherLim Choon Beng (CA), notLim Choon Beng (HC), resulted in a miscarriage of justice. 28 The decision by the Court of Appeal inChang Kar Meng (CA)to reduce the aggregate sentence imposed inChang Kar Meng (HC)was for reasons unrelatedto the correctness of the sentences imposed by the High Court. InChang Kar Meng (CA),the Court of Appealheld that the overall sentence imposed by the High Court befitted the appellant’s culpability for his criminal acts and that it was not “crushing or otherwise manifestly excessive” (at [55]). The Court of Appealnoted that the sentence of 12 years’ imprisonment and 12 strokes of the cane for the rape charge “cannot be said to be manifestly excessive” (at [52]) and the sentence for the offence of robbery with hurt was the mandatory minimum sentence imposed by Parliament such that no issue could be taken with that sentence (at [54]). 29 The reduction of the imprisonment term imposed was on the basis of a survey of six sentencing precedents involving cases of rape and robbery where the imprisonment terms imposed ranged from 11 to 15 years (at [57] and [72]). The Court of Appeal accepted that “the Appellant should be entitled to rely on the existing sentencing range established by the relevant precedents” andsaw no basis for ignoring the appellant’s legitimate expectations (at [75]). Thus, the Court of Appealfound it appropriate to “reduce the Appellant’s aggregate imprisonment sentence to 15 years” (at [76]). To effect this adjustment, the imprisonment term for the rape charge was reduced from 12 years to ten years. It is clear therefore that the sentence for the rape charge was not wrong in principle and neither was it manifestly excessive. 30 Moreover,Chang Kar Meng (CA)was concerned with the facts of the particular case before it and that case involved rape and robbery. The sentencing range in issue related only to that for rape and robbery cases. The applicant’s case involved only rape, other sexual offences and possession of obscene films. A proper study ofChang Kar Meng (CA)also makes it clear that the only change in the law that it made was at [76] of the judgment where it held that “... moving forward, offenders who are convicted of rape and robbery should not expect to benefit from similar leniency, and a sentence such as the aggregate sentence of 17 years’ imprisonment and 24 strokes of the cane that was meted out by the Judge [inChang Kar Meng (HC)] will not, in similar circumstances, be treated as manifestly excessive”. This change in the law has no impact at all on the applicant’s case because his charges did not involve both rape and robbery. 31 Even if we have to consider the applicant’s criticisms against the decision inLim Choon Beng (HC), it is plain that the Judgedid not rely solely or even principally onChang Kar Meng (HC)in calibrating the sentence to be imposed. The Judge referred to two other cases,Sivakumar s/oSelvarajah v Public Prosecutor[2014] 2 SLR 1142 andPublic Prosecutor vHaliffie bin Mamat[2015] SGHC 224, which imposed imprisonment terms of ten and 11 years respectively for rape. The Judge also considered the four other charges that were taken into consideration for the purposes of sentencing, the totality principle and the aggravating factors of the case. The Judge was certainly not constrained nor did he feel bound to follow the sentencing decision inChang Kar Meng (HC). 32 I reiterate here that the decision susceptible to review in a review application is that of the appellate court, not that of the trial court:Datchinamurthya/l Kataiah v PP[2021] SGCA 30 at [25]. In the present application, it is the decision inLim Choon Beng (CA)that is the subject of review. 33 InLim ChoonBeng(CA), the Court of Appealdismissed the applicant’s appeal for reasons unrelated to any reliance onChang Kar Meng (HC).The sentences imposed for the Rape Charges were held to be “entirely defensible”. Having regard to the aggravating factors, including those mentioned at [66] ofLim Choon Beng (HC)and the other charges, the Court of Appeal held that there was no error in the Judge’s sentencing consideration. At [66] ofLim Choon Beng (HC), the Judge stated that the case before him had its own aggravating factors which made it comparable toChang Kar Meng (HC). However, the Court of Appeal’sreference to [66] ofLim Choon Beng (HC)was confined to the Judge’s listing of the aggravating factors. No reference was made toChang Kar Meng (HC)at all. There was no nexus betweenChang Kar Meng (HC)and the Court of Appeal’s reasoning inLim Choon Beng (CA)in respect of the sentences imposed for the Rape Charges. Therefore, even ifChang Kar Meng (HC)was considered wrongly decided (and it clearly was not), it had no impact whatsoever on the decision inLim Choon Beng (CA). 34 Further, the Court of Appeal inLim Choon Beng (CA)viewed as “lenient” the Judge’s classification of the Rape Charges as Category 1 offences under the framework inPublic Prosecutor v NF[2006] 4 SLR(R) 849. This suggests that the rape offences couldhave been classified as Category 2 offences and this would mean a starting point of 15 years’ imprisonment and 12 strokes of the cane under theNFframework. The resulting sentence therefore would, in all likelihood, be more severe than the 13 years’ imprisonment that the applicant received. 35 The applicant’s reliance on Art 11 of the Constitution is completely misplaced. On the facts as set out above, he is certainly not suffering greater punishment for an offence than was prescribed by law at the time it was committed.",
        "Conclusion": "36 In the circumstances, the applicant has failed to show that there is sufficient material upon which this court may conclude that there has been a miscarriage of justice. The decision inChang Kar Meng (CA)has no impact on his case. There is clearly no miscarriage of justice in his sentencing and the sentences imposed for the Rape Offences were in fact considered to have been lenient. 37 None of the cumulative requirements set out in s 394J of the CPC is satisfied. Pursuant to s 394H(7) of the CPC and having considered the parties’ submissions, I dismiss summarily this application for permission to make a review application without setting it down for hearing. Tay Yong KwangJustice of the Court of Appeal The applicant in person; Selene Yap and Ashley Poh (Attorney-General’s Chambers) for the respondent."
    }
}