{
    "case_title": "Tika Pesik vPublic Prosecutor",
    "ncitation": "[2023] SGCA 44",
    "coram": "Tay Yong Kwang JCA:",
    "sections": {
        "Introduction": "1 The applicant, Tika Pesik, was convicted on one charge of trafficking in 26.29g of diamorphine (the “Drugs”) with common intention under s 5(1)(a) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (the “MDA”) read with s 34 of the Penal Code (Cap 224, 2008 Rev Ed). The mandatory death sentence was imposed on the applicant. On 20 August 2018, the Court of Appeal (comprising Sundaresh Menon CJ, Andrew Phang Boon Leong JA and Tay Yong Kwang JA) dismissed the applicant’s appeal against her conviction and sentence in CA/CCA 29/2017 (“CCA 29”). 2  On 17 August 2023, the applicant filed CA/CM 37/2023 (“CM 37”) for permission to review the decision of the Court of Appeal pursuant to s 394H of the Criminal Procedure Code 2010 (2020 Rev Ed) (“CPC”). The applicant alleges that there is new evidence which will prove her innocence in the drug trafficking charge. 3 avign rgHaving The applicant tendered her handwritten submissions in Malay which were translated into English. The Prosecution filed its submissions on 14 November 2023. Having considered both parties’ submissions, I dismiss CM 37 summarily.",
        "Facts": "4 The applicant was charged with having shared a common intention with Muhammad Farid bin Sudi (“Farid”) to traffic in a controlled drug. She had made arrangements for Farid to collect the controlled drug and deliver it to Hamzah bin Ibrahim (“Hamzah”) between 19 and 20 December 2013. Farid delivered two packets containing not less than 26.29g of diamorphine to Hamzah in the afternoon of 20 December 2013 while they were in a car driven by Farid. 5 The applicant was tried jointly with Farid and Hamzah in the High Court. Farid testified that he was recruited by the applicant to deliver drugs for her, while Hamzah admitted that he had arranged with the applicant to purchase drugs. The applicant denied any involvement in the drug transaction. She was arrested many months after the drug transaction. She claimed to have been “played out” by her then-lover, K Saravanan A/L Kuppusamy (“Saravanan”), who had been selling drugs.  She claimed that Saravanan must have used her mobile phone to contact Farid about the drug transaction without her knowledge. She also claimed that Farid and Hamzah must have colluded to implicate her falsely. 6 The trial Judge (the “Judge”) convicted all three accused persons. Farid’s evidence on how he was instructed by the applicant to collect and to deliver the drugs to Hamzah was corroborated by Hamzah. In contrast, the Judge found the applicant’s denial of any involvement to be vague, unsatisfactory and unbelievable. Her account was contradicted by Farid, Hamzah and Saravanan. The Judge also found that there was no reason for Farid to frame the applicant. The three men’s evidence and the objective evidence from Farid’s mobile phone records, together with the applicant’s implausible account, showed that the applicant was guilty as charged. 7 Farid qualified for the alternative sentencing regime under s 33B(2) of the MDA and was sentenced to life imprisonment and 15 strokes of the cane. The alternative sentencing regime did not apply to the applicant and Hamzah as they were not couriers. As a result, the mandatory death sentence was passed on the applicant and Hamzah. 8 The applicant appealed in CCA 29 against her conviction and sentence. Hamzah appealed against only his sentence in CA/CCA 26/2017. Both appeals were dismissed by the Court of Appeal on 20 August 2018. In delivering the oral judgment of the court, Sundaresh Menon CJ held that the applicant’s argument that she was innocent and was a victim of a conspiracy between Farid and Hamzah, acting under the direction of Saravanan to give false evidence, was without merit. The Prosecution’s position had always been that Hamzah was not a courier and Hamzah had every reason to expect that he would not qualify for the alternative sentencing regime. Yet, there was no attempt by Hamzah to retract his evidence incriminating the applicant. 9 Apart from this, there was other evidence that the Judge had relied on to arrive at her findings. The Court of Appeal also stated that the Judge had analysed the facts carefully. As the Court of Appeal was satisfied that there was no merit in the appeals, they were dismissed accordingly.",
        "The parties’ cases": "10 In the present application, the applicant states that there is new evidence which proves her innocence: (a) First, there is possible closed-circuit television (“CCTV”) footage at Marsiling, in-car footage from the car that Farid was driving and immigration entry records of a person known as “Kanaku” who arrived in Singapore on 20 December 2013. According to the applicant, “Kanaku” was the person who passed the plastic bag containing the drugs to Farid. (b) Second, the applicant argues that there is possible CCTV footage at Jalan Kukoh, which would show that the $1,800 found in Farid’s possession during his arrest did not come from Hamzah as payment for the Drugs. Instead, it had been given to Farid by one “Maren” in the morning of 20 December 2013. 11 The Prosecution submits that CM 37 does not disclose any legitimate basis for the exercise of the court’s power of review. This is because there is no material to suggest there has been a miscarriage of justice. The applicant has not adduced any of the video footage or records and merely relies on her own hearsay evidence of their possible existence and contents. In any case, the Central Narcotics Bureau (“CNB”) has filed an affidavit to state that there are no such video recordings available. 12 Even if such material did exist, there is no reason why it could not have been adduced earlier. The applicant was represented by two sets of defence counsel at the trial and at the appeal and they did not seek to obtain and adduce evidence of such alleged new evidence. 13 Moreover, the applicant’s account in CM 37 contradicts her own sworn testimony at the trial on her communication with Farid and Saravanan on 20 December 2013. She is using the review procedure to change her evidence. 14 Finally, even if such material was available, it would not be compelling. There was objective evidence from Farid’s mobile phone and the evidence of the three men involved.",
        "My decision": "15 An application for permission to review the decision of an appellate court must show a legitimate basis for the exercise of the court’s power to review (Kreetharans/o Kathireson v Public Prosecutor and other matters[2020] 2 SLR 1175 at [17]). Such an application must demonstrate that there is sufficient material in the form of new evidence or new legal arguments on which the court may conclude that there has been a miscarriage of justice. The material must satisfy all the conditions set out in s 394J(3)(a) to (c) of the CPC. 16 Section 394J(3) of the CPC provides that in order for any material to be “sufficient”, that material: (a) must not have been canvassed at any stage of the proceedings in the criminal matter in respect of which the earlier decision was made before the filing of the application for permission to make the review application; (b) could not have been adduced in court earlier even with reasonable diligence; and (c) must be compelling, in that it is reliable, substantial, powerfully probative and capable of showing almost conclusively that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made. 17 Having considered the parties’ submissions, it is clear that CM 37 is a futile attempt by the applicant to re-argue CCA 29 on the facts. The applicant also appears to be trying to change her narrative at the trial. 18 The applicant states that there should be CCTV footage from Marsiling and Jalan Kukoh as well as footage from the in-car camera of the vehicle Farid was driving. The applicant has done no more than to raise an assertion that such material exists. It is in essence an application to the court to order the CNB to conduct further investigations and to produce further evidence. This is a matter that should have been canvassed during the investigations or at least pursued during the trial. 19 The applicant raises these factual assertions close to a decade after the events in December 2013. Such evidence, even if it existed, is highly unlikely to be available now. In any case, the CNB has confirmed on affidavit that there is no such evidence available. 20 The Court of Appeal in CCA 29 was satisfied that the Judge had relied on other evidence (apart from Farid’s and Hamzah’s testimony) to arrive at her findings and that the Judge had analysed the facts carefully. The Court of Appeal was therefore satisfied that there was no merit in the applicant’s appeal. There is therefore absolutely nothing in the present application to suggest that there has been a miscarriage of justice in this case.",
        "Conclusion": "21 The applicant’s assertions do not come anywhere close to satisfying the requirement that there be sufficient material on which this court may conclude that there has been a miscarriage of justice in CCA 29. Her assertions fall far short of demonstrating a powerful probability that the decision to dismiss her appeal in CCA 29 was wrong. Accordingly, CM 37 is dismissed summarily. Tay Yong KwangJustice of the Court of Appeal The applicant in person; Wong Woon Kwong SC and Chan Yi Cheng (Attorney-General’s Chambers) for the respondent.",
        "": ""
    }
}