{
    "case_title": "Muhammad Faizal Bin Mohd ShariffvPublic Prosecutor",
    "ncitation": "[2023] SGCA 15",
    "coram": "Tay Yong Kwang JCA:",
    "sections": {
        "Introduction": "1 In January 2019, the applicant, Muhammad Faizal Bin Mohd Shariff, was convicted by Chan Seng Onn J (“the trial Judge”) in the High Court on a charge of possessing drugs (cannabis) for the purpose of trafficking (seePublic Prosecutor v Muhammad Faizal Bin Mohd Shariff[2019] SGHC 17 (“Faizal (HC)”)). As the Public Prosecutor did not issue the applicant a Certificate of Substantive Assistance, he was sentenced to undergo the mandatory death penalty. 2 In CA/CCA 3/2019 (“CCA 3”), the applicant appealed against the High Court’s decision. In conjunction with his appeal, he applied to the Court of Appeal by way of CA/CM 13/2019 (“CM 13”) for an order that the Prosecution disclose copies of the report(s) of any analyses performed on the mobile phones and/or SIM cards that were in the possession of the applicant and Kow Lee Ting Serena (“Serena”) (whose role in this case will be explained later in this judgment) shortly before or upon their arrest on 14 February 2016, pertaining in particular to any incoming calls that day, and that any documents ordered to be disclosed be admitted as further evidence at the appeal. In August 2019, the Court of Appeal (comprising Sundaresh Menon CJ, Judith Prakash JA and Chao Hick Tin SJ) dismissed CM 13 as well as CCA 3. An oral judgment was delivered by the Court of Appeal (“Faizal(CA)”). 3 On 10 May 2023, the applicant’s family was informed by the Singapore Prison Service that the death sentence passed on the applicant would be carried out on 17 May 2023. On 11 May 2023, the applicant filed the present application supported by an affidavit by the applicant’s counsel and written submissions. On 15 May 2023, the Prosecution filed its written submissions in response. 4 Before the present application, the applicant was involved as one of the applicants/claimants in related civil proceedings in the High Court. The proceedings were in HC/OS 975/2020, HC/OS 825/2021, HC/OS 1025/2021 and HC/OC 166/2022. All these proceedings were either dismissed or struck out by various Judges in the High Court. There was no appeal against the High Court’s decisions in the first three cases. The fourth case went on appeal to the Court of Appeal and that appeal was dismissed in August 2022.",
        "The present application": "5 The present application seeks permission under s 394H of the Criminal Procedure Code 2010 (2020 Rev Ed) (“CPC”) to make a review application in respect ofFaizal(CA). The outcome that the applicant seeks is “a reduced sentence of life imprisonment or a reduced charge to a non-capital offence”.1Foot Note 1×Applicant’s written submissions, para 33. 6 The applicant submits that there has been a change in the law on disclosure brought about by the Court of Appeal’s decision inMuhammad Nabill bin Mohd Fuad v Public Prosecutor[2020] 1 SLR 984 (“Nabill”), a decision delivered afterFaizal(CA)was decided. The applicant also contends that additional evidence has “come to light” and that such evidence ought to have been disclosed by the Prosecution pursuant to the principles enunciated inNabill. 7 The Prosecution submits that the applicant has failed to raise “sufficient material”, as defined in ss 394J(2) and (3) of the CPC, on which this court may conclude that there has been a miscarriage of justice. The Prosecution argues that every issue raised in the present application (a) has been addressed inFaizal (HC)and/orFaizal (CA); (b) is irrelevant; or (c) even contradictory to submissions made by the applicant in earlier proceedings. It also contends that the present application is nothing more than an impermissible attempt to make a second appeal against the decision inFaizal (HC)and it therefore invites the court to dismiss the present application summarily pursuant to s 394H(7) of the CPC.",
        "Factual background": "8 On 14 February 2016, the applicant and Serena were arrested by the Central Narcotics Bureau (“CNB”) in relation to another case. They were staying in a condominium apartment at 95 Pasir Ris Grove #06-41, NV Residences, Singapore 518912. The apartment was rented by Serena from the landlady, Ong Bee Leng (“Ong”), on a short-term basis from 1 to 15 February 2016. Serena had informed Ong that she would be staying in the apartment with the applicant. Serena also told Ong that Muhammad Hizamudin Bin Sheik Allahudin (“Arab”) and Leonard Cheng Lee Siang (“Leo”) would also come to the apartment occasionally. Apart from these four persons, no one else had access to the unit. 9 On 15 February 2016, one day after the applicant’s and Serena’s arrest, when Ong could not contact Serena at the end of the short-term rental, she went to the apartment with her husband. In the apartment, Ong gathered the belongings of the temporary occupants and left them with the condominium’s security for safekeeping. 10 The next day, on 16 February 2016, Ong returned to the apartment to clean it. She found three big blocks and three smaller blocks of substance wrapped in cling wrap in the drawer of the television console in the master bedroom. This was an area she had not checked the night before. She placed these six blocks in a plastic bag and passed them to the condominium’s security supervisor to be placed with the belongings handed over the day before. Later that day, the security supervisor informed Ong and her husband that there was a strong smell coming from the plastic bag and that he suspected that it contained illegal drugs. Ong’s husband then called the police. 11 CNB officers arrived subsequently and seized the six blocks (marked E1 to E6). The six blocks were analysed by the Health Sciences Authority to contain the following: ExhibitCannabis (g)Cannabis mixture (g)Total weight (g)E1328.80507.90836.70E2412.90478.40891.30E3426.40434.50860.90E489.77138.80228.57E5108.70152.10260.80E6196.40265.40461.80Total1562.971977.103540.07 These six blocks were the subject of the charge on which the applicant was convicted inFaizal (HC). The charge alleged that the applicant had in his possession for the purpose of trafficking, the six blocks containing not less than 3,540.07g of vegetable matter which was found to contain 1,562.97g of cannabis.",
        "The applicant’s submissions": "12 It was not disputed at the trial and at the appeal that on 9 February 2016, the applicant collected four blocks of cannabis, that he referred to as “storybooks”, himself and brought them to the apartment. There, he cut and repacked one of the four blocks into the three smaller blocks E4, E5, and E6. The applicant claimed that he placed the three big blocks and the three small blocks of cannabis in the refrigerator. In his defence at the trial, the applicant asserted that the blocks of cannabis were jointly owned by him, Serena, Arab and Leo. He testified that the big blocks E1, E2 and E3 were not part of the four blocks that he had collected. According to his evidence, when he looked into the refrigerator a few days later, only the small blocks E4, E5 and E6 were still inside. He accepted that the three small blocks belonged to him. From the above table, it can be seen that the cannabis content in the three small blocks would not have attracted the death penalty. He claimed that he did not know how the six blocks of cannabis (which included E4, E5 and E6) came to be in the drawer in the master bedroom. 13 The applicant argued that there was reasonable doubt as to whether he was in possession of the big blocks E1, E2 and E3 because his fingerprints and DNA were not found on them. He was arrested on 14 February 2016 and the drugs were found only on 16 February 2016. There were others who had access to the apartment. 14 Where the allegation of trafficking was concerned, the applicant claimed that he possessed E4, E5 and E6 for the purpose of consumption and that only a small portion was meant for sale. However, he also testified that he had never smoked cannabis before and that the cannabis was for “future use”. He had never tried cannabis before and so he wanted to do it “bit by bit”.",
        "Faizal (HC)findings": "15 The trial Judge held that the applicant had actual possession and knowledge of the nature of all six blocks of cannabis. He based his decision on the following main findings: (a) The applicant had admitted that E4, E5 and E6 belonged to him and that he knew the nature of the drugs. (b) The objective and circumstantial evidence, considered together, led to the irresistible inference that E1, E2 and E3 were the other three blocks that the applicant collected on 9 February 2016. The applicant had also admitted in a statement recorded from him on 21 February 2016 (the “21 February 2016 statement”) that E1, E2 and E3 were three of the four blocks that he had collected. (c) The applicant was the person who placed the six blocks in the drawer in the master bedroom. (d) The blocks of cannabis were not jointly owned by Serena, Arab, Leo and the applicant. Instead, they were owned solely by the applicant. Although Serena was a prosecution witness at the trial, the applicant did not even put to her that she owned the blocks jointly. Further, the applicant did not request that Arab and Leo be called to testify in order for him to put his assertion of joint ownership to them. None of the six blocks contained Arab’s or Leo’s DNA. (e) Serena, Arab and Leo did not have possession or knowledge of the nature of the cannabis. 16 The trial Judge also held that the applicant possessed all six blocks of cannabis for the purpose of trafficking. Further, the applicant failed to rebut the presumption of trafficking under s 17 of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (the “MDA”). This finding was supported by the following: (a) The applicant admitted in his 21 February 2016 statement that the cannabis was meant for sale. (b) The applicant dealt with the cannabis in a manner consistent with a person intending to traffic in it. He had weighed one of the blocks and cut it into three smaller portions. He used cling wrap to wrap each portion and then weighed each of the three portions individually. This was to ensure that their weights were correct in order to facilitate their future sale or distribution. (c) The cannabis could not have been intended for the applicant’s own consumption. Such a large quantity of cannabis must have been for the purpose of trafficking. The applicant had stated in his 21 February 2016 statement and in his oral testimony in court that he had never smoked cannabis before. It was incredible that someone who had never tried cannabis before would have spent so much money to purchase such a large amount for his own consumption. One block would have cost about $9,500. (d) Given the large quantity of cannabis and the fact that the applicant was heavily in debt, it was unlikely that he would have been supplied with so much cannabis on credit if it was indeed meant for his own consumption. 17 As noted above at [1], the trial Judge convicted the applicant on the trafficking charge and the mandatory death penalty was imposed.",
        "Faizal (CA)findings": "18 At the appeal, the applicant contended that his 21 February 2016 statement (which was admitted at the trial without challenge) did not amount to an admission that he knew anything about the three big blocks of cannabis (E1, E2 and E3). He maintained that he only knew about the three small blocks of cannabis (E4, E5 and E6) which belonged to him. The applicant submitted that he had merely identified E1, E2 and E3 in his statement as blocks of cannabis and it was not an admission that they were the actual blocks collected by him. 19 In its oral judgment, the Court of Appeal held that the applicant’s 21 February 2016 statement was an admission. He was asked, by reference to photographs of the six bundles marked E1 to E6, whom they belonged to. Nowhere did the applicant say that he did not know if E1 to E3 were the bundles that he had collected. The applicant had also proceeded to say that he had divided the fourth big block (or “storybook”) into three smaller bundles. The Court of Appeal held that this admission was fatal to the applicant’s case. The applicant’s admission was also corroborated strongly by other facts: (a) The very bundles of cannabis that he had admitted to collecting and repacking were precisely what were found in the apartment. (b) It was wholly improbable that the remaining three big blocks that the applicant admitted that he had collected had somehow inexplicably gone missing but then were replaced by three other similar blocks that some other person had inexplicably placed there. It should be noted that the three blocks cost around $30,000. (c) The blue packaging of E4 matched the blue packaging used for E1, E2 and E3. The applicant’s former Defence counsel accepted that the applicant had reused the blue packaging from the fourth big block that he collected to repack one of the three small bundles. 20 The Court of Appeal was satisfied that the applicant was in possession of the bundles and that he knew they contained cannabis. On the element of trafficking, it held that the Prosecution was entitled to rely on the presumption in s 17 of the MDA and that the presumption was not rebutted. Accordingly, the Court of Appeal dismissed the applicant’s appeal and his application in CM 13.",
        "My decision": "21 InRahmat bin Karimon v Public Prosecutor[2021] 2 SLR 860, the Court of Appeal held that an application under s 394H of the CPC must disclose a legitimate basis for the exercise of the court’s power of review. The court hearing such an application has to consider the requirements in s 394J of the CPC, in particular, the requirement that there is sufficient material on which the appellate court may conclude that there has been a miscarriage of justice. 22 The relevant provisions in s 394J of the CPC state: (2) The applicant in a review application must satisfy the appellate court that there is sufficient material (being evidence or legal arguments) on which the appellate court may conclude that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made. (3) For the purposes of subsection (2), in order for any material to be ‘sufficient’, that material must satisfy all of the following requirements: (a)before the filing of the application for permission to make the review application, the material has not been canvassed at any stage of the proceedings in the criminal matter in respect of which the earlier decision was made; (b)even with reasonable diligence, the material could not have been adduced in court earlier; (c)the material is compelling, in that the material is reliable, substantial, powerfully probative, and capable of showing almost conclusively that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made. (4) For the purposes of subsection (2), in order for any material consisting of legal arguments to be ‘sufficient’, that material must, in addition to satisfying all of the requirements in subsection (3), be based on a change in the law that arose from any decision made by a court after the conclusion of all proceedings relating to the criminal matter in respect of which the earlier decision was made. (5) For the purposes of subsection (2), the appellate court may conclude that there has been a miscarriage of justice in the criminal matter in respect of which the earlier decision was made, only if — (a)the earlier decision (being a decision on conviction or sentence) is demonstrably wrong; or (b)the earlier decision is tainted by fraud or a breach of the rules of natural justice, such that the integrity of the judicial process is compromised. (6) For the purposes of subsection (5)(a), in order for an earlier decision on conviction to be ‘demonstrably wrong’ — (a)it is not sufficient that there is a real possibility that the earlier decision is wrong; and (b)it must be apparent, based only on the evidence tendered in support of the review application and without any further inquiry, that there is a powerful probability that the earlier decision is wrong. 23 InKreetharan s/o Kathireson v Public Prosecutor and other matters[2020] 2 SLR 1175, the Court of Appeal observed at [21]: 21 It was apparent that nothing raised by the applicants in their affidavits or submissions met the conjunctive requirements in s 394J of the CPC based on any standard and that no legitimate basis for the court to exercise its power of review had been disclosed. In this regard, it is clear from the foregoing that it isinsufficientfor an applicant to attempt to re-characterise the evidence already led below or to mount fresh factual arguments on the basis of such evidence. To a large extent, this was what the applicants sought to do before us. Any new points raised by the applicants were either unhelpful or could have been raised earlier with reasonable diligence. [emphasis in original] Where an application merely rehashes the submissions made at the trial and on appeal, permission to file a review application will not be granted (Sinnappan a/l Nadarajah v Public Prosecutor[2021] SGCA 10 at [33]). A review application is certainly not a second appeal. It is also not an opportunity for further arguments if there is no new law or new evidence within the meaning of s 394J of the CPC. 24 The present application relies on “new” material. The applicant claims that the conviction is unsafe because: (a) There was a change in the law brought about by the Court of Appeal’s decision inNabill. (b) The Prosecution failed to disclose the statements of Arab and Leo and also failed to disclose the forensic phone records and phone conversations relating to Serena, Arab and Leo. The disclosure of the forensic phone records and conversations “would undoubtedly prove that Arab was involved in the transaction, as well as the involvement and participation in joint ownership” of the drugs by Serena and Leo. The entire blame for the drugs should not be pinned solely on the applicant. (c) There has been “proliferation” of CCTV and the applicant remembers that inNabill, the investigators produced a photograph from the CCTV cameras in Nabill’s home to establish that he had brought a luggage bag into his home. The investigators in the present case “should also have carried out the same exercise to establish if the Applicant or someone else brought the Drugs” into the apartment. If the relevant footage were retrieved, it would show whether Arab or Leo went to the apartment and would “in all likelihood” show that Arab carried the drugs into the apartment. This would corroborate the applicant’s version of the events that he drove the car while Arab handled the drugs. (d) If reliance is placed on the applicant’s admission that he collected all the drugs by himself, there is no reasonable explanation why his fingerprints or DNA were not found on the big bundles E1 to E3. (e) Legal possession of the drugs should be attributed to Serena as she was the tenant of the apartment. 25 InTangaraju s/o Suppiah v Public Prosecutor[2023] SGCA 8(“Tangaraju”), the application under s 394H of the CPC was premised on the decision inNabillconstituting “new material” that could form the basis for review. While the Court of Appeal found thatNabillrepresented a change in the law, this did not mean by itself that such a change constituted “sufficient material” (Tangarajuat [4]). The impact, if any, that this change in the law has brought about must be considered. 26 The applicant submits that Arab’s and Leo’s statements would shed light on their involvement in the drugs. However, although the applicant asserted inFaizal (HC)that the drugs were owned jointly by himself, Serena, Arab and Leo, the trial Judge noted that this assertion was never put to Serena (who testified as a prosecution witness) and that the applicant did not ask that Arab and Leo be called as witnesses in order that this assertion could be put to them. The accused’s conviction was based on his admission in his 21 February 2016 statement and the applicant did not challenge its voluntariness or its accuracy. On appeal, the applicant sought to cast a different light on the statement and, as stated earlier, that was rejected inFaizal (CA)where the Court of Appeal said that the admission was fatal to the applicant’s case. 27 The applicant now says that “I was always told to not incriminate anyone else if arrested, whether it be Nabil[l], or Arab. [This was the main reason why I admitted to trafficking blocks E4, E5 and E6. I would otherwise not be able to get hold of the drugs which I was dependent on.]”. The applicant is therefore suggesting that he took the blame for the cannabis in question without implicating the others because otherwise he would not be able to have the drugs that he was dependent on. This makes hardly any sense. He was already under arrest and accused of trafficking in a large quantity of cannabis. Would his self-restraint in not incriminating the others have helped him obtain drugs from any of them? 28 The applicant’s allegation of joint ownership of the cannabis was rejected by the trial Judge. Arab’s and Leo’s accounts would therefore be of limited value. As the Prosecution has submitted, if those statements could aid the applicant’s defence, they would have been disclosed for the trial under the Prosecution’s obligations on disclosure as set out inMuhammad bin Kadar and another v Public Prosecutor[2011] 3 SLR 1205. 29 Further, the applicant’s allegations relating to Arab’s and Leo’s involvement in the drugs were also canvassed in his application in CM 13 to adduce further evidence. As noted earlier in this judgment, that too has been dismissed by the Court of Appeal. His new claim that Arab accompanied him in the collection of the four big bundles was never brought up at the trial or at the appeal. Instead, his account at the trial was that he arranged, collected and transported the four bundles of drugs to the apartment by himself. Deciding to change or to add to his evidence after his appeal failed does not create new evidence that satisfies the requirements for a review application under the CPC. 30 The applicant admitted that bundles E4, E5 and E6 belonged to him. The issue relating to his possession and knowledge of bundles E1, E2 and E3 has already been examined in bothFaizal (HC)andFaizal (CA). In so far as the present application attempts to raise the same arguments or to recast some or all of them regarding this issue, that is not allowed in an application for permission to review a concluded appeal. I repeat here that a review under the CPC is neither a second appeal nor an opportunity for further arguments on the same evidence. 31 The applicant’s request for disclosure of forensic phone records was made in CM 13 which was dismissed by the Court of Appeal. In the applicant’s affidavit filed in support there, he claimed that he had received two phone calls from Arab on 14 February 2016 before his arrest. Arab was said to have asked the applicant where he was. On both occasions, the applicant replied that he “was not able to talk” and that he “want to kena already”. On the applicant’s account, his conversations with Arab did not mention the cannabis. In the present application, the applicant also states that he did not give any evidence about the alleged phone calls at the trial because “I was never asked, and it was never thought that this was a significant point at all.” In any case, at the hearing of the appeal inFaizal (CA),the Court of Appeal was aware of the applicant’s affidavit in CM 13 and found that it had no bearing on the outcome of the appeal. This issue should not therefore be revived and argued again. 32 The applicant also refers to CCTV footage that will “in all likelihood” corroborate his account. However, no CCTV footage was adduced at the trial and, according to the Prosecution, no such footage exists. The applicant’s contentions about CCTV footage therefore appear to assume that there is footage available because of a “proliferation” of CCTV and because the applicant remembers the investigators inNabilldid obtain CCTV footage, the investigators in this case ought to have done the same. 33 The applicant’s contention that because Serena was the tenant of the apartment, legal possession of the drugs should be attributed to her, appears to be an argument on legal principle. However, in whatever way it is framed, the argument on this issue has been considered. Serena was a prosecution witness at the trial and, as the trial Judge noted, the applicant did not even put to her as a fact that she was in joint ownership or possession of the drugs. If the applicant is now seeking to invoke some legal presumption against her, she was not given an opportunity to rebut it. In any case, the findings of the trial Judge and of the Court of Appeal in this case contradict completely the applicant’s contentions.",
        "Conclusion": "34 The present application is clearly an impermissible attempt at re-opening and re-arguing the appeal inFaizal (CA).There is no new evidence that will satisfy the requirements of a review application and while there is new law inNabill, the principles enunciated there have no application to or impact on the facts in this case. I therefore dismiss summarily the present application for permission to make a review application without setting it down for hearing, pursuant to this court’s powers under s 394H(7) of the CPC. Tay Yong KwangJustice of the Court of Appeal Ong Ying Ping (Ong Ying Ping Esq) for the applicant; Terence Chua, Stephanie Koh and Chong Yong (Attorney-General’s Chambers) for the respondent."
    }
}