{
    "case_title": "Public ProsecutorvBWJ",
    "ncitation": "[2023] SGCA 2",
    "coram": "Tay Yong Kwang JCA (delivering the grounds of decision of the court):",
    "sections": {
        "Introduction": "1 The respondent, whose name has been redacted as “BWJ”, was charged with aggravated rape of the complainant (“V”) under ss 375(1)(a) and (3)(a)(i) of the Penal Code (Cap 224, 2008 Rev Ed) (the “PC”). The charge was as follows: You are charged at the instance of the Public Prosecutor and the charge against you is: That you, [BWJ], on 6 August 2017 sometime in the afternoon, at Blk [address redacted], Singapore, did commit aggravated rape of [V], female/then-29 years old (DOB: [redacted]),to wit, you penetrated her vagina with your penis without her consent, and in order to facilitate the commission of the offence, you voluntarily caused hurt to her by strangling her neck, and you have thereby committed an offence under Section 375(1)(a) of the Penal Code (Chapter 224, 2008 Rev Ed) and punishable under Section 375(3)(a)(i) of the same Code. 2 V was BWJ’s girlfriend from early 2012 to sometime in 2017. The exact date on which their relationship came to an end in 2017 was a matter in dispute both at the trial and on appeal. On the Prosecution’s case, V ended her relationship with BWJ prior to 6 August 2017 (the date of the alleged rape) and BWJ, refusing to accept this fact, turned to violence and raped her on 6 August 2017. BWJ did not dispute that he had sexual intercourse with V on this date. However, he asserted that their relationship had not ended at that time and the sexual intercourse was consensual.",
        "History of the proceedings": "3 On 7 August 2017, the day after the alleged rape, BWJ was arrested and remanded. Eventually, BWJ was tried in the High Court on the charge over 11 days in March, June, August and October 2019. To prove its case, the Prosecution led evidence from a total of 29 witnesses, including V. Of the other 28, there were 17 through whom various exhibits and reports were admitted without cross-examination by Defence Counsel for BWJ, Ms Megan Chia (“Ms Chia”). The remaining 11 witnesses were cross-examined. These witnesses included those who interacted with the complainant shortly after the alleged rape, the investigation officers and an analyst from the Health Sciences Authority (“HSA”). For the Defence, only BWJ gave evidence. 4 Following the trial, the parties filed closing and reply submissions on 6 and 21 November 2019, respectively. On 2 December 2019, the trial Judge in the High Court (the “Judge”) heard the parties’ oral arguments and reserved judgment. On 26 June 2020, the Judge acquitted BWJ, giving brief reasons for his decision and stating that his full written grounds would follow. On the same day, the Prosecution filed its notice of appeal. The next day, 27 June 2020, BWJ was released on bail pending appeal, with the bail amount fixed at $20,000 (without the requirement of a monetary component) with one surety. 5 There was then a lull in the proceedings for nearly two years. On 17 May 2022, the Judge certified that the brief oral reasons that he had given on 26 June 2020 constituted the full grounds of his decision. This delay was significant because BWJ, a Malaysian citizen, could not leave Singapore without permission and was also not allowed to work while he was on bail pending appeal. On 4 February 2022, BWJ was given leave to travel to Johor Bahru from 5 February to 5 March 2022 to attend his brother’s funeral. He was supposed to return to Singapore on 6 March 2022 but could not do so because of travel restrictions imposed in connection with the COVID-19 pandemic. On 4 March 2022, BWJ was granted permission to remain in Johor Bahru until four weeks before the appeal. On 3 June 2022, about two weeks after the Judge certified that no further written grounds of decision would be issued, the Supreme Court Registry informed the parties that the Prosecution’s appeal would be heard between 5 and 16 September 2022. In compliance with the conditions of his bail, BWJ returned to Singapore on 6 August 2022. 6 On 13 September 2022, we heard the Prosecution’s appeal. We allowed the appeal, set aside the Judge’s acquittal and convicted BWJ on the charge. We directed the parties to file their written submissions on sentence within one week. Pending sentencing, the Prosecution argued that the quantum of BWJ’s bail ought to be increased. We agreed and fixed bail at $120,000 with one surety. As BWJ was unable to furnish bail, he was remanded. On 20 September 2022, the parties filed their written submissions on sentence. At the further hearing on 27 September 2022, we ordered that BWJ be imprisoned for 13 years and that he receive 12 strokes of the cane. BWJ’s imprisonment term was backdated to 7 August 2017, the date of his arrest. However, we directed that the period from 27 June 2020 to 12 September 2022 (the period that BWJ was on bail pending appeal) was not to be included in the computation of the sentence served. 7 We now provide the reasons for our decision. For easy reference and, in particular, for the purpose of understanding our decision on sentence, we set out below a chronology of the relevant dates in this case’s procedural history: S/NDateEvent16 Aug 2017The alleged rape took place.27 Aug 2017BWJ was arrested and placed in remand.319 Mar 2019BWJ’s trial in the High Court commenced.47 Oct 2019The evidential portion of the trial concluded.52 Dec 2019The Judge heard the parties’ oral arguments and reserved judgment.626 Jun 2020BWJ was acquitted and the Judge gave brief oral grounds for his decision with full grounds to follow.7The Prosecution filed its notice of appeal.827 Jun 2020BWJ was released on bail, fixed at $20,000 with one surety, pending the Prosecution’s appeal.94 Feb 2022BWJ was granted permission to travel to Johor Bahru to attend his brother’s funeral. He was supposed to return to Singapore on 6 March 2022.105 Feb 2022BWJ travelled to Johor Bahru.114 Mar 2022COVID-19 travel restrictions prevented BWJ from returning to Singapore by 6 March 2022. He was given permission to remain in Malaysia until four weeks before the Prosecution’s appeal.1217 May 2022The Judge certified that the oral grounds he delivered on 26 June 2020 constituted the full grounds of his decision.133 Jun 2022The Supreme Court Registry informed the parties that the Prosecution’s appeal would be heard between 5 and 16 September 2022.146 Aug 2022BWJ returned to Singapore for the appeal.1513 Sep 2022The Prosecution’s appeal was heard and allowed. BWJ’s acquittal was set aside and he was convicted on the charge he faced.16BWJ’s bail was fixed at $120,000 with one surety. BWJ was unable to furnish bail and was remanded pending sentencing.1727 Sep 2022BWJ was sentenced to 13 years imprisonment and 12 strokes of the cane.",
        "The factual background and evidence": "",
        "From 2011 to 1 August 2017": "8 V and BWJ, both Malaysian citizens, met sometime in 2011 when they were working in Singapore. In early 2012, they entered into a romantic relationship. It was not in dispute that they were sexually intimate. 9 The facts surrounding the early stages of their relationship up to the end of 2015 were also not in dispute. However, as they were largely irrelevant to the charge brought against BWJ, we highlight only two matters from this period: (a) First, from the outset, V’s parents did not approve of her relationship with BWJ and their dislike of him never abated. The relevance of this fact will become apparent when we turn, at [26] below, to describe the events which took place shortly before the alleged rape on 6 August 2017. (b) Second, in November 2015, after going through various living arrangements, V and BWJ eventually signed a two-year lease for a two-bedroom Housing Development Board flat in the north-central region of Singapore (the “Flat”). The charge alleged that BWJ raped V in this Flat. 10 V and BWJ had communicated very actively using WhatsApp. Records of the messages exchanged between them from 30 May 2016 to 7 August 2017 were adduced at the trial. A perusal of these messages showed that their relationship was on a relatively steady keel in 2016 and for at least a part of 2017. For example, on 31 May 2016, more than 140 messages were exchanged between them, with a roughly equal number of messages from one to the other. On 8 June 2016, the pair sent around 50 messages to each other but, on 9 June 2016, they were back to exchanging around 140 messages within the day. On both days, the number of messages sent was roughly equal between them. All these indicated that V and BWJ were on relatively good terms in 2016. 11 Their exchanges were not always happy or even amicable. From time to time, they engaged in quarrels over WhatsApp. For example, on 7 December 2016, the following exchange took place between 7.22pm and 8.06pm (quoted verbatim): BWJ: I think u go n find better guy or maybe u already find a guy that’s why you don’t have time for me already Somore she from raffles work in finance she buy chic rice I saw her what is wrong with you V: I seriously dunno wtf u r rushing. 6.50 u got the bus d, ask u come tpy dinner u said not enough time, ask u come tpy wait me u said rushing. Amk to city hall nearer to tpy to city hall nearer. Again n again I found something fishy from u. U not tired I’m tired OK, need to everyday check on u OK. If u think tht the world outside is more fun n interesting u can go ahead OK. I can work n stay alone. Rather thn I everyday have worry so many things, my brain non stop, in office worry on work go home worry on u. BWJ: Do u think properly if I come tpy then walk to foodcourt n take dinner then go mrt again am of course I will be late ok I just wanna see u more n have time with u but in the end all is my fault it’s ok no one is understand me It’s your wish ok It’s your decision if you already think like that I cannot stop u I’m not angry with u ok I go u Now … 12 However, the evening after this exchange, V and BWJ conversed normally in their messages, making arrangements to meet each other for dinner before BWJ went to work a night shift and after V finished her own workday. We highlight this example to illustrate that, during this period of their relationship, although V and BWJ may have quarrelled on occasion, it was evident from their exchanges subsequent to those arguments that their relationship continued. This was so until around April or May 2017, when there appeared to be a palpable shift in the character of their exchanges over WhatsApp. To appreciate this shift, it is useful to contrast their communications and the state of their relationship from the earlier part of 2017. 13 In January 2017, V and BWJ were still messaging each other actively over WhatsApp. For example, on 17 January 2017, when BWJ was in Malaysia visiting his family, V was the first to send a morning greeting to BWJ after she woke up at 6.53am. That afternoon, BWJ was scheduled to return to Singapore and V sent him several messages to check if he had reached the airport and whether “everything” was alright. In fact, when asked by BWJ if she wanted to pick him up from the airport, she responded “yeah” and asked him to confirm the arrival terminal. 14 In February 2017, BWJ was retrenched from his job in Singapore. As a result, his work permit was cancelled. He was therefore unable to remain in Singapore for extended periods of time and could only do so on social visit passes. Nevertheless, during the periods when BWJ had to return to Malaysia, he and V continued to communicate almost daily on WhatsApp. In fact, their messages near the end of February 2017 showed them expressing affection for each other. On the night of 27 February 2017, V sent a loving emoji to BWJ before saying “Nightzz” to him. BWJ then responded, “Okok gd nite baby I love you”. 15 In March 2017, V visited BWJ and his family in Ipoh. While there, they took a short trip to the Cameron Highlands and it was not disputed that they had sexual intercourse during that trip. According to V, that was the last time she and BWJ had consensual sex. It was therefore clear from V’s evidence that their relationship had not ended in March 2017. 16 However, by April 2017, tension in their relationship began to build up. According to V, the tension arose because of BWJ’s constant demands to know where she was and what she was doing. During her examination-in-chief, V testified that BWJ’s calls and messages were a “disturbance” and that he would often call her while she was at work and assert that she was “with someone else”. This was supported by the content and the tone of BWJ’s messages. For example, on 21 April 2017, the following messages were exchanged from around 7.05pm to 8.05pm, while V was out at dinner with her cousins (quoted verbatim): BWJ: I’m just asking can u go back early only V: Okok, I’ll try BWJ: Okok What u eat … Hello hello baby why u never reply me U online but didn’t Wan to reply me V: Eating BWJ: Where is your Cousin pic V: No hand to reply Wait la He go toilet BWJ: From just now he go toilet ha What u eat la V: Wahlao we eat by hand, so dirty how to message U r so irritating BWJ: I’m asking u few times ready what u eat V: 4 fingers Fried cgick Chick … 17 BWJ continued messaging the complainant incessantly from 9.13pm on 21 April 2017 to 1.05am on 22 April 2017. During this time, he demanded that she inform him about her location and he also insisted that she return home to the Flat. Their exchange read (quoted verbatim): BWJ: So what time u go back home … Baby where are u now 9.35 pm ready … So what time u wanna gonna come baby … It’s already 10.25pm why u like to go back home late la V: Haizz We r really not suitable … BWJ: So what time u wanna go now already 12 midnite ready Hello where are u now V: Orchard BWJ: What time now ha why u still on Ochard I know u sure at bar drinking Can u tell me now what u wanna go back where are u now If u really not doing wrong thing why u wanna ignore me Reply me now now now U keep online but didn’t wanna reply me Where are u where are u where are u What time ready what time ready Where time u go out u sure will do like this ignore me n don’t wanna reply me go back very very late U liar … It’s ok la u enjoy la that is it i know what is going on there don’t worry I won’t sms u anymore n call u anymore ok u just sms me once u reach home I will delete your from my heart V: Okok … BWJ: Send me pic that u really at home … I wanna see your pic not the bed pic … V: If think I’m liar.. If u think u cannot accept I always go out so late.. If u think I go out w my cousins also u have so many comments I tink we r not suitable BWJ: Yea Coz u wanna enjoy now n I don’t know wether u go with your Counsin or with someone else … From today I will try to forget u Next week I will come n take my things n I will go so next weeks onwards u can go where u like n do what u like … 18 Unlike their quarrels in 2016 which would abate and then their conversations would return to a normal tone, the quarrels which they had during this time indicated a marked deterioration in their relationship. Although V gave evidence that she still referred to BWJ as her “boyfriend” in May 2017 and travelled with him to Kuala Lumpur to attend a friend’s wedding, she also testified that, during the trip, she rejected BWJ’s request to have sexual intercourse. By the end of May 2017, she had asked him to move out of the master bedroom of the Flat because she wanted to “stop the relationship”. 19 The fact that their romantic relationship had essentially ended by this time was also evident from the messages that they exchanged. As mentioned earlier, BWJ lost his job in February 2017 and was unable to remain in Singapore for extended periods of time. Following a visit to Singapore on a social visit pass, on the night of 28 June 2017, when BWJ returned to Malaysia by bus, V did not see him off. This was despite the fact that he had overstayed his social visit pass and would not be able to return to Singapore for at least 30 days. Around 9.00pm, he messaged her, “Ok I’m going out now I know u won’t come and see me take care”. At 9.49pm, he messaged, “At least reply me la or call me say bye to me”. At 10.40pm, he messaged, “It’s ok la I’m really sad I won’t disturb u anymore I leave my heart n my soul here in Singapore only body is going to Ipoh”. V did not reply to any of these parting messages. 20 Although V responded to BWJ’s further messages later, her replies were generally terse or monosyllabic. Moreover, for an unbroken stretch of more than ten days from 21 July 2017 at around 9.00pm to the end of 1 August 2017, she ignored about 100 messages received from BWJ. At the appeal hearing, the Prosecution clarified that BWJ did not allege, nor was there evidence, that V did not respond to BWJ’s messages for some other reason, such as her mobile phone was not in working condition. The clear inference, from V’s total lack of response to his numerous messages, was that their romantic relationship had already ended by this time.",
        "From 2 to 5 August 2017": "21 On 2 August 2017, without informing V in advance, BWJ returned to Singapore and let himself into the Flat using his spare key. There was no dispute that V was not expecting his return. On BWJ’s own evidence, she was “shocked” to see him in the Flat that day. He claimed that he returned to Singapore to celebrate V’s birthday which was in the second half of the month. However, there was no evidence that V was pleased to see him or that she responded to his sudden presence with warmth, something which would have been expected if they were still lovers who had just been reunited after having been apart for more than a month. On the contrary, over the next three days, V avoided and ignored BWJ, even leaving the Flat on 4 and 5 August 2017 to stay with her aunt. 22 In the morning of 3 August 2017, BWJ sent a message to V to remind her to eat breakfast and not to work on an empty stomach. This message was ignored and, 20 minutes later, he implored V to respond to his messages at least “for courtesy”. BWJ sent a few more messages that day but V did not respond. 23 On 4 August 2017, BWJ asked V if they could have dinner together. V declined, stating that she was having dinner with her parents. She also told him that she was unlikely to return to the Flat as she would be staying with her aunt. 24 The next day, BWJ repeated his request to have dinner with V, to which she replied curtly, “I’ll b late”. Thereafter, V ignored BWJ’s further messages in which he asked about her parents and whether she had eaten dinner. 25 It was obvious by this time that BWJ’s return to Singapore did nothing to help improve the dismal state of his relationship with V. Her coldness and indifference towards him despite his many gestures showed that she regarded their relationship as having ended and she was not interested at all in reviving it.",
        "6 August 2017 and after": "26 On the night of 4 August 2017, V informed BWJ that her parents would be visiting the Flat and that when they did so, he was to “excuse [himself]”. On V’s evidence, her parents were visiting the Flat to collect some of her unused belongings and transport them to Malacca. This was with a view to helping her move out of the Flat when the lease expired in November 2017. V followed this up in the morning of 6 August 2017, when she sent the following terse message to BWJ: “We r [on the way], Pls excuse yourself”. Shortly after noon, BWJ asked V whether he could return to the Flat. Eventually, she responded that she and her parents had left the Flat, thereby indicating that he was free to do so. 27 Sometime around 1.00pm, V returned to the Flat alone. She testified that BWJ was sitting on the sofa in the living room and asked to speak with her. He proceeded to ask V where she intended to move to when the lease on the Flat expired in November 2017. As V did not wish to answer this question, she stood up and walked to the master bedroom to continue packing her things in preparation for her move out of the Flat. BWJ followed her into the bedroom and continued to ask her questions. V’s mobile phone sounded and she looked at the message received. This angered BWJ, who snatched the phone to check whom she was communicating with. When V asked for her phone to be returned, BWJ slapped her and suddenly ripped her T-shirt and brassiere off. He covered her mouth when she attempted to shout for help, strangled her and said to her in Malay, “now you die”. When she grew faint, he took off her shorts and her underwear. At this point, V told BWJ that she was menstruating and begged him not to continue. However, BWJ ignored her pleas and inserted his penis into her vagina. This lasted for around one or two minutes before BWJ withdrew his penis and ejaculated onto V’s stomach.",
        "BWJ’s version of the events": "28 Before we turn to what happened next, we set out BWJ’s version of the events on 6 August 2017. In BWJ’s first statement to the police dated 8 August 2017, he claimed that after he followed V into the master bedroom of the Flat, he hugged her from her right side. She then turned to face him and stepped backwards, which caused him to release his hug. BWJ then “stretched out [his] right hand to grab [V’s] T-shirt by [the] collar” because he wanted to pull her back towards him so as to hug her. BWJ claimed that as a result of this, V’s T-shirt ripped. Next, according to BWJ, V attempted to “shout that she want[ed] to go out” but he used his right hand to cover her mouth. After that, she acquiesced to having sex with him and did not resist. 29 We use the word “acquiesced” here because, even on BWJ’s own account, V did not consent expressly. In his second statement to the police, in response to the question, “Did [V] consent to the sex”, BWJ answered, “I do not know. As she did not say [n]o. She did not say yes also”. He repeated this position in his fourth statement to the police as well as in his testimony in cross-examination: BWJ: Oh, com -- sorry, now I understand. Is this whether she okay with me or not okay with me to having sex? Court: Yes, correct. BWJ: Okay, after -- before -- I explain first, Your Honour. Okay, after we discussed after we kissed, yes, she did have sex with us -- with -- with me. But before we was talking to each others, I could not whether is she willing or not. But when I hug her, when I kissed her, yes, she agreed. But she didn’t say no to me. 30 At this point, we focus on the movements which caused V’s T-shirt to rip. In his second statement to the police, BWJ stated that he believed he “used force” when he pulled V’s T-shirt but he did not do so with an intention to hurt her as he loved her. The apparent lack of an intention to cause hurt suggested that he probably did not use much force. In his fourth statement, BWJ stated that when he grabbed V’s T-shirt by the collar, it only tore “a bit at the ne[ck] area”. However, during his examination-in-chief, BWJ testified that he did not see a tear in the T-shirt. He only heard a tearing sound which caused him to let go. We reproduce his evidence on this point when questioned by his Defence Counsel, Ms Chia: Ms Chia: Was the T-shirt -- what was the state of the T-shirt at that time? BWJ: I didn’t see any tear or tearness [sic] over on the shirt. Ms Chia: Okay. BWJ: There -- but I heard there is a tearness [sic] sound in the shirt, so I let it go. 31 BWJ testified that he did not see any tear in V’s T-shirt although the tear was extensive. An image of the torn T-shirt is reproduced below:  Image (1). V’s damaged T-shirt 32 At the first appeal hearing on 13 September 2022, the Prosecution showed us the T-shirt which had been tendered as an exhibit during the trial. Even on a quick view of the T-shirt, it was plain that the damage was very extensive. As we have indicated with red lines in the photograph above, the front of the T-shirt was ripped across practically the entire collar and almost all the way down the wearer’s right side. 33 The obvious incompatibility of BWJ’s account of the sexual encounter with the objective evidence also featured in his description of how he removed her brassiere prior to the sexual intercourse. In BWJ’s first statement to the police, he asserted that after he hugged V and caused the tear in her T-shirt, they lay on the bed and started kissing. BWJ also gave V two or three love bites on her neck. While they were lying down, BWJ claimed that he unhooked V’s brassiere in a normal manner. During his examination-in-chief, BWJ maintained the position that he did not use any force when he removed V’s brassiere: Ms Chia: Was it easy to remove her bra? BWJ: Not very easy, not very difficult, because I have a space for my hand to enter and I unhook it, and then I took from the front, I pull one side. Ms Chia: Did you pull the bra in any way? BWJ: No. Ms Chia: Did you use any force? BWJ: No. 34 Again, contrary to BWJ’s evidence, the brassiere was quite obviously damaged, indicating some rough action during the sexual encounter on 6 August 2017. At the trial, the Prosecution led evidence from Ms Sherni Koh Peck Chu (“Ms Koh”), an HSA analyst engaged to examine V’s T-shirt and brassiere and to conduct tests to determine the types of motions which could have caused the sort of damage that the clothing items sustained. Ms Koh described the precise damage caused to each item of clothing. She identified the damage to the brassiere as follows: 14. The bra was constructed to fasten at the back with a fastening system consisting of three columns of three eyes each and a single column of hooks. 15. Two eyes from the innermost column were dislodged from their original locations and found attached to their corresponding hooks: (a) The stitching that originally held both eyes in place was found to be torn, with indications of recent damage; (b) The hooks were found to be distorted in shape. 35 The photographs below show V’s brassiere damaged fastening system:  Image (2). Columns of eyes  Image (3). Hooks and two dislodged eyes 36 These images revealed that at least some force must have been used to remove V’s brassiere. During Ms Chia’s cross-examination of Ms Koh, she took issue only with the experimental method used to recreate and identify the type of motions which could have caused the sort of damage sustained. Ms Chia did not suggest to Ms Koh that her assessment of the damage done to the brassiere was incorrect. 37 We now return to V’s account of the events after BWJ had ejaculated onto her stomach. BWJ proceeded to clean himself up. While he was doing so, V told him that she was experiencing extreme abdominal pains and begged him to take her to a doctor. BWJ initially refused and accused her of lying so that she could escape. There was blood on the mattress. Eventually, he relented after she continued to plead with him. At this point, BWJ helped V to wash up and to get dressed. Before leaving the Flat, BWJ apparently took her wallet, mobile phone and house keys. He then took her to a nearby clinic called “UniHealth 24-Hr Clinic” (the “Clinic”). 38 At the Clinic, V spoke to two persons who testified at the trial. The first was Foo Yi Sing (“Ms Foo”), a clinic assistant. Ms Foo testified that V entered the Clinic around 1.30pm on 6 August 2017, with BWJ supporting her. Ms Foo observed that V had a “deep reddening around the front of her neck” and that she seemed to be in a “lot of pain”. Ms Foo came to this conclusion because V was holding her stomach and trembling as she sat in the waiting area. Given the state in which V appeared to be, Ms Foo asked V to enter the consultation room ahead of another patient who had arrived earlier. 39 The second person to whom V spoke was the doctor in the consultation room, Dr Jason Tan (“Dr Tan”). On Dr Tan’s account, after V entered the consultation room, he saw that she was experiencing lower abdominal pains. He asked her whether they were menstrual pains and V denied that they were. He then offered her an injection to ease the pain but she declined. Dr Tan testified that, at this point, V became agitated, broke into tears and informed him that she had been sexually assaulted by BWJ. Dr Tan offered to refer her to KK Women’s and Children’s Hospital for a formal examination and to receive proper treatment. He also directed Ms Foo to call the police. At that point, BWJ walked out of the consultation room. 40 After BWJ had left and after Ms Foo had called the police but before the police arrived, Dr Tan conducted a more “focussed examination” of V and noted a two-to-three-centimetre bruise at the front of her neck. V informed him that the bruise was sustained by strangulation and Dr Tan was of the view that the appearance of the bruise was consistent with V’s explanation. However, he did not make any assessment that the bruise was caused by strangulation. 41 Ms Foo’s evidence was broadly consistent with Dr Tan’s in respect of these events. On Ms Foo’s account, it was also after V had declined Dr Tan’s offer to administer a pain-relieving injection that she said in Mandarin that BWJ had raped her. BWJ then attempted to take V out of the consultation room but V did not follow him. Upon hearing this exchange, Ms Foo asked BWJ to wait outside the consultation room. He was initially hesitant but subsequently complied. Before he left the room, V told him to hand over her mobile phone. He did so and then left the Clinic. Ms Foo then called the police and reported that V’s modesty had been outraged, not that she had been raped. She made the report in that manner although her clear recollection was that V had said that she was raped. 42 Ms Foo explained that Dr Tan had instructed her to report to the police in that manner because he had not conducted any medical examination to ascertain if V had actually been raped. However, when Dr Tan was cross-examined on this point, he stated that he did not inform Ms Foo what to report to the police. There was therefore at least some uncertainty regarding what V actually informed Dr Tan and Ms Foo at the Clinic. 43 There were also differing accounts as to whether BWJ had V’s mobile phone with him and, therefore, whether he handed it to V before leaving the Clinic or whether he had to return to the Flat to get the mobile phone before returning to the Clinic to hand it to V. The more general questions which arose from these discrepancies were whether BWJ returned to the Clinic and, if so, how he behaved when he did. 44 The first account was that of Ms Foo. As stated earlier, Ms Foo testified that BWJ handed over V’s mobile phone before leaving the Clinic. She also stated that he later returned with a “black haversack” but V did not wish to see him. Ms Foo then told BWJ to take a seat but he left to “get a drink” and did not return thereafter. The police then arrived and interviewed V. 45 Second, V testified that BWJ brought her mobile phone to the Clinic. She further testified that after she informed Dr Tan that she was raped by BWJ, Dr Tan directed Ms Foo to call the police and BWJ left the Clinic upon being “chased out” by V. He returned with her mobile phone and left it with Ms Foo at the reception counter of the Clinic. Ms Foo handed it to V and V then waited for the police to arrive. 46 BWJ’s account was different. During his examination-in-chief, BWJ testified that while Dr Tan was examining V in the consultation room, BWJ touched her shoulder. This caused V to shout at him not to touch her and to get away from her. BWJ was confused by this and asked V why she was acting in that manner. In response, V demanded that BWJ hand over her mobile phone and wallet or that he call her aunt, failing which she would call the police. BWJ stated that he did not have V’s mobile phone with him. He had only his own phone and both their wallets. He therefore went back to the Flat to get V’s mobile phone from the master bedroom and placed it in a backpack alongside a pair of pants and two shirts which he planned to use while staying at his “friend’s house” as V was “[m]aybe angry or whatever”. After that, he returned to the Clinic. The police had not arrived yet. BWJ entered the Clinic and handed V’s phone and wallet directly to her in the consultation room. V then yelled at BWJ again to “go away” and he left the consultation room. Ms Foo asked him to take a seat but he informed her that he was going to buy a drink and that he would return shortly. After BWJ bought his drink, he wanted to return to the Clinic. However, he saw that the police had arrived and, out of a general fear of the authorities, he stood about one block away for an hour or two. After that, he went to a carpark nearby and sat in a stairwell until about 8.00pm. 47 Although these accounts differed in their details, the differences were not material ones. Ms Foo’s recollection that BWJ handed over V’s mobile phone before leaving the Clinic was, in all likelihood, an error. Both V and BWJ stated that BWJ had to retrieve V’s phone from the Flat and this explained why he returned to the Clinic with a backpack. The fact that Ms Foo remembered BWJ returning to the Clinic with a “black haversack” was consistent with this. 48 However, Ms Foo, V and BWJ’s accounts were consistent on the following points. First, BWJ took V to the Clinic but was asked by her to leave and to hand over her mobile phone. Second, BWJ left the Clinic and returned soon thereafter. Lastly, BWJ left the Clinic a second time before the police arrived and he did not return to the Clinic at all after that. These points established a clear basis from which certain inferences could be drawn. For example, the reason why V asked BWJ in a discourteous manner to leave the Clinic although he had taken her there upon her request and why BWJ did not return to the Clinic after the police arrived and had to resort to watching the Clinic from a distance, despite knowing that someone he claimed he loved was unwell and still in the Clinic. 49 Further and stronger inferences may be drawn from the numerous messages that BWJ sent to V, not long after he left the Clinic the second time and did not return. These messages showed that BWJ was begging V not to file a police report against him. On 6 August 2017, from 2.00pm to around midnight, he sent her 50 messages to which V did not reply. We set out a few of these messages to show their tone and content: BWJ: [2.26pm] [V] and I’m so sorry I will go back Malaysia and I will never see u again n pls don’t make police report pls pls pls pls forgive me … [2.55pm] Now I really don’t know what to do now pls pls I’m really regret pls pls … [5.41pm] Pls answer my [V] I’m sorry I know what I did is wrong give me one last chance I promise in my Mom I will pack my things n go Malaysia … [5.43pm] My Mom starts to crying already pls pls [V] … [6.11pm] Once u take back the report I will go n pack my things n go [V] trust me this time I really will go I promise … [8.23pm] [V] pls reply me pls I’m sorry pls if u do report pls take back n I will back I won’t Disturb u [V] pls pls … [11.53pm] [V] pls help me [V] pls answer my call n help take back the report so I will go back Malaysia n never disturb u anymore pls 50 On 7 August 2017, BWJ continued sending similar messages to V from 2.24am to 6.44pm. Again, it is useful to set out some of these messages to show the state of mind that BWJ was in at that time: BWJ: [9.25am] [V] pls help me [V] I’m sorry pls help I wanna go back Malaysia I’m scared if u did police report they will catch me at checkpoints can u pls tell me u did the report or not pls … [4.55pm] [V] we been couple for past 6 years we have very good time together now u Wan me to go away from u ok I will go don’t worry I won’t see u or even sms u once I go back Malaysia pls help me … [5.00pm] U just help me for my Mom only pls u know my Mom like so much rite pls pls pls [V] … 51 It can be seen from these messages that BWJ did not say why he thought V would file a police report against him. At the trial, he maintained that he did not know why she would contemplate doing so. During cross-examination, he ventured a guess that she was angry at him and that it could have been due to him having torn her T-shirt. However, BWJ was not able to provide any credible explanation for V’s outburst at him at the Clinic, why she would be filing a police report against him, why he was so fearful of arrest over the tearing of her T-shirt and why he sent all those desperate-sounding messages to her after having had allegedly consensual sex with her recently. The most that he could state, in the abstract, was that he was afraid of the impact which a police report against him would have on his life and future and that this was why he pleaded with V not to file a police report. 52 While BWJ was pleading with V not to file a police report, he was also in contact with his family members. On 7 August 2017, around midnight, BWJ sent one of his nephews the following voice messages, which were translated and transcribed as follows: BWJ: [12.34am] … She has to withdraw the case, if she doesn’t withdraw the case, I do not know what report she has made. Whether if it is an attempted rape or it is just an ordinary fight. If it is a report of a fight then it’s not a problem but if it is an attempted rape report, they will put me in jail for two or three years. If she withdraws the case, there will be nothing against me. If she informs that she made the report out of anger, then the case will be closed. … [12.41am]Attempted rapeget you six strokes of the cane or two or three years’ jail. She is very arrogant now. 53 Later that day, BWJ sent the following three voice messages to another nephew: BWJ: [3.35pm] I’m going to take all my things from Singapore and put them in JB. Can I put my things in your house for a few days? I have a TV, a hifi and about ten boxes of things. I packed the things in boxes. Can you keep them for a few days? If everything is ok, I will come and take the things in a lorry and leave for Ipoh. Is it okay? … [3.44pm] There is some work in JB. Okay? Only you have to come. You come and take the things and go. I can’t go to JB. I have small problem. I’ll tell you. I have a police report against me. I can’t leave for JB. Okay? You come soon and one day I will tell you about it. Got some problems. If I’m caught, I can’t leave. It’s a fighting case. There was a fight. Okay? … [3.45pm] If need [other nephew’s name], I will ask him to come. [Other nephew’s name] will come and help you. Okay? There’s a fight. A fighting case. A police report has been made against me. She’s my girlfriend indeed. It became a problem. I hit (her). She went to the police and made a report. Don’t know when I will be arrested. Don’t tell anyone about this. Okay? 54 We now return to the events from V’s perspective, after BWJ left the Clinic the second time and did not return. The police arrived at the Clinic not long thereafter. The first officer to arrive was Senior Staff Sergeant Muhammad Taufiq Bin Rosli (“SSS Taufiq”). He testified that when he arrived at the Clinic, he saw that V was teary. When he attempted to interview her, she was also visibly uncomfortable. SSS Taufiq therefore requested the presence of a female officer. 55 Inspector Teng Yin Hang (“INSP Teng”) arrived at the Clinic shortly thereafter. She observed that V was in distress and crying. INSP Teng’s interview at this point was brief. She recounted it as follows during examination-in-chief: DPP: Alright. Did you speak to the victim? INSP Teng: Yes, I did. DPP: Alright. And … what did she tell you? INSP Teng: When I was in the room with the victim, she told me that she was crying when I was talking to her. And she said that the ex-boyfriend actually sat on her and tried to strangle her. And she -- and he also tried to rip her clothes off. DPP: Did she say anything else? INSP Teng: Not that I can recall of. 56 At around 4.00pm, SSS Taufiq and INSP Teng escorted V to a police post nearby to be interviewed formally. On the way, V contacted a neighbour and close friend who regarded V as a goddaughter. V informed her that she was strangled and raped by BWJ. V also told this neighbour that she was afraid to return to the Flat as BWJ might be there and that she would find somewhere else to stay for the night. This neighbour asked V to meet her after she concluded her interviews with the police. 57 At around 5.00pm, V was interviewed by Station Inspector Muhammad Azhari Bin Mohamad Said (“SI Azhari”). Three points arose from this interview. First, V stated that her relationship with BWJ “turned sour” after his retrenchment in February 2017 and that they “eventually” broke up, although she did not specify when. Second, she informed SI Azhari that while in the Flat, BWJ slapped her face, ripped her shirt and brassiere off, held her down on the bed and covered her mouth to muffle her shouting for help. BWJ then began to remove her shorts and underwear. When she tried to stop him, he strangled her until she was unable to breathe. She tapped him to stop and he did but she felt weak and dizzy as a result. V said she told BWJ that her abdomen was in great pain and that she wanted to go to the Clinic. Despite the fact that the encounter she described to SI Azhari seemed to be leading up to a sexual offence, V did not inform him that BWJ raped her. Finally, V also told SI Azhari that she told Ms Foo at the Clinic that she was “beaten”, not that she was raped. 58 V’s interview with SI Azhari concluded around 6.00pm. After that, he, V and a police photographer went to the Flat in search of BWJ. In the Flat, SI Azhari found and seized V’s torn T-shirt and damaged brassiere. Photographs were also taken of V, in particular, the bruising on her neck, the torn T-shirt and damaged brassiere, as well as the Flat. 59 The police gave V a referral and asked her to go to Tan Tock Seng Hospital (“TTSH”) to have a check-up for her injuries. She did so. At around 11.25pm that evening, she was examined by Dr Man Shiu Yuen under the supervision of Dr Lee Chiao Hao (“Dr Lee”). Dr Lee subsequently produced a medical report based on this examination stating that V had “sustained facial and neck contusions” and was also seen to have bruises on her neck. 60 On 7 August 2017, one day after the sexual incident, V met her godmother at the latter’s request. V showed her the bruising on her neck and again informed her that BWJ raped her, although she did not elaborate. That evening, around 10.00pm, V and her godmother went to the Flat to get V’s clothing. When they arrived at the Flat, they noticed that the padlock used to secure the front gate had been changed. They also heard the ringing of a phone coming from within the Flat. They called the police, concerned that BWJ might be inside the Flat. 61 The police arrived shortly thereafter and arrested BWJ who was inside the Flat. The police interviewed BWJ on 8, 12 and 15 August 2017. In the first statement he gave to the police, he stated that he had cut the previous padlock in order to enter the Flat. 62 In the morning of 9 August 2017, the police asked V to attend a further examination at the obstetrics and gynaecology division of KK Women’s and Children’s Hospital (“KKH”). This was for the purpose of examining her for injuries specifically relating to sexual assault. The examining physician was Dr Chuah Theng Theng (“Dr Chuah”). During this examination, V informed Dr Chuah that the last time she had sexual intercourse was in November 2016 and described the incident on 6 August 2017 as an “assault”, not rape or sexual assault. She also told Dr Chuah that she was slapped, that her mouth was covered when she attempted to shout for help, that she was held down by her wrists and that she was strangled to the point of nearly fainting. Dr Chuah subsequently reported that V’s physical state was generally unremarkable. No injuries were seen on her mouth and wrists at the time of consultation. Although bruises were seen on her neck and chest, they were “superficial injuries caused by trauma”. Dr Chuah further noted that “the sizes of the bruises were small” and that she did not see “any finger mark[s] [on] the complainant’s neck”. Hence, she was “unable to comment further on the cause of the bruise[s]”.",
        "The Judge’s reasons for acquittal": "63 The Judge acquitted BWJ on the charge. The brief reasons for his decision are reproduced in full below: The accused faces one charge of aggravated rape. The accused and complainant were both Malaysians working in -- working and residing in Singapore. They were boyfriend and girlfriend and lived together in a rented HDB flat. There were some despite over whether their relationship had ended by the time the incident, although it is not disputed that the complainant had communicated the intention to break up the relationship and the relationship had somewhat soured by the time of the incident. It is also not disputed that the accused and the complainant had sexual intercourse on the day in question. And it was also not disputed that the accused had torn the complainant’s shirt, although it is disputed whether the tear was deliberate or accidental and the extent of the tear was also disputed. There were no witnesses to the incident, so the case turns largely on the credibility of the complainant’s account versus the credibility of the accused’s account. Having assessed all the evidence in this, my conclusion that there remains reasonable doubt over the guilt of the accused. I will now provide some brief explanation but were to issue written grounds later, I will elaborate on -- to supplement these grounds. In my view, the defence had, in their closing submissions, successfully raised a number of inconsistencies in the complainant’s action, testimony and versions of events. These inconsistencies include her account of how the offence occurred and her deliberate downplaying of the state of her relationship with the accused. I find that these inconsistencies affects her credibility, and together with the inconclusive nature of the forensic and medical evidence, that leaves me with reasonable doubt over the guilt of the accused. On the accused’s part, I do not find that the 60-over text messages sent by the accused, apologising to the complainant, to be conclusive. None of these messages confessed the rape. They could have been sent simply because he feared that she would get him into trouble with the police, for reasons he may not be fully aware of. Significantly, the accused offered to meet up with the complainant. He did not flee and remained in the shared HDB flat. In fact, it was the accused who volunteered information to the police that he had sexual intercourse with the complainant. In the circumstances, I find it unsafe to convict the accused of the offence charged. I, therefore, find the accused not guilty and acquit him accordingly.",
        "The parties’ cases on appeal": "",
        "The Prosecution’s case": "64 The Prosecution’s appeal against the Judge’s acquittal was premised on three main points. First, the Judge erred in finding that the case turned largely on V’s credibility. This ignored the objective evidence that was adduced. 65 Second, V’s account of her relationship with BWJ as well as how it deteriorated over time was credible and consistent with the objective evidence provided by the messages on WhatsApp. The Judge therefore erred in determining that V had “downplayed” her relationship with BWJ and that her credibility suffered as a result. The Prosecution also contended that the Judge erred in taking the view that V’s credibility had been affected by the fact that she did not report the rape to the police, Dr Lee of TTSH or Dr Chuah of KKH. V’s demeanour showed that she continued to be affected by the incident even during the trial. There was also no reason for V to fabricate the rape. 66 Third, V’s account of the rape was “textured, cogent and logical”. It was supported objectively by the extent of damage to her T-shirt and brassiere as well as by the bruises on her neck. In contrast, BWJ’s account of the sexual intercourse was inconsistent not only with these objective facts but also with the state of his relationship with V. The way V and BWJ interacted in the days immediately leading up to the day of the alleged rape supported the inference that she would not have consented to sexual intercourse with BWJ on that day. Further, the Judge was wrong not to give weight to BWJ’s messages to V on 6 and 7 August 2017. Read in the context of the whole case, his messages were highly probative of his guilt notwithstanding the fact that he did not confess specifically to the rape. The Judge also erred in giving weight to the fact that BWJ did not flee. The communications with his family members showed that he was preparing to leave Singapore. The fact that he did not succeed in doing so was not relevant. 67 In summary, the Prosecution contended that the Judge’s reasons for concern ought not to have given rise to reasonable doubts in his mind. The doubts he had expressed were addressed squarely by the evidence adduced and his decision was therefore against the weight of the evidence.",
        "BWJ’s case": "68 BWJ’s submissions on appeal supported the Judge’s decision on four points. First, the Judge was right to find that the damage to V’s T-shirt and brassiere was inconclusive. The tests conducted by the Prosecution’s forensic witness, Ms Koh, were not able to show that the damage could have been caused by the motions described by V. They were therefore not corroborative. Something similar could be said of the bruises observed on V’s neck. V testified that BWJ used both hands to strangle her until she nearly fainted. However, she did not suffer serious injuries which would be consistent with such a description. Further, the physicians who examined her did not conclude independently that the bruises on her neck were caused by strangulation. Their conclusion was based on V’s account. 69 Second, as there was no objective evidence which lent support to V’s account, the Judge was right to find that the case turned on the credibility of her evidence. More specifically, the Judge needed to be satisfied that her evidence was “unusually convincing”: seePublic Prosecutor v GCK andanother matter[2020] 1 SLR 486 at [99]–[104]. 70 Third, V was not an unusually convincing witness as her account of events was both internally and externally inconsistent. Internally, she vacillated as to when her relationship with BWJ came to an end so as to downplay their relationship. For example, during her medical examination at KKH, she informed Dr Chuah that the last time she had sexual intercourse with BWJ was in November 2016. However, at the trial, she admitted that, as late as March 2017, she had sex with BWJ during their trip to the Cameron Highlands. V also gave varying accounts of the alleged offence. During her medical examination by Dr Tan at the Clinic, she claimed to have been raped. However, when recounting the incident to the police and to Dr Chuah, she stated that she was beaten or assaulted. There was no mention of a sexual offence. Externally, V’s account of the alleged manner in which BWJ ripped off her T-shirt and brassiere was contradicted by Ms Koh’s inability to recreate such damage in her tests applying the motions described by V. Her account of the alleged strangulation was also not consistent with the superficial bruises suffered. There was no medical evidence that those bruises were caused by strangulation. It was therefore reasonable to believe that they were “love bitemarks” as stated by BWJ in his evidence. 71 Fourth, beyond highlighting the flaws in the evidence adduced by the Prosecution, Ms Chia submitted that the Judge was right not to give much weight to BWJ’s communications with V and his family members after the alleged rape. In respect of the 60-over messages that BWJ sent after the alleged rape, Ms Chia argued that it was reasonable for BWJ, having seen that V had called the police who arrived at the Clinic, to apologise to her without knowing what he had actually done wrong. This would have served to calm V down and de-escalate the situation. Although BWJ’s communications with his family members seemed to indicate that he was intending to leave Singapore, Ms Chia argued that it was reasonable for him to make the arrangements to transport his belongings out of the Flat. He was no longer residing in Singapore and the lease on the Flat was going to end soon. Further, BWJ remained near the Flat and the Clinic while the police was in the area and could be looking for him. To conclude from all this that BWJ was attempting to escape from Singapore would be to suggest quite illogically that he was prioritising his personal belongings over a high risk of arrest. 72 The thrust of BWJ’s case on appeal was that the Judge had considered the case before him carefully and the Prosecution was not able to show that the Judge’s decision to acquit was against the weight of the evidence. There was therefore no basis for appellate intervention.",
        "Our decision on guilt": "73 The principles governing appellate intervention in criminal matters are settled law. The relevant authorities were cited and affirmed by VK Rajah JA inSakthivel Punithavathi v Public Prosecutor[2007] 2 SLR(R) 983 at [66]–[69]. Two principles are typically at play. First, appellate review is of a limited nature and appellate courts will be slow to overturn a trial judge’s findings of fact unless they are shown to be plainly wrong or against the weight of the evidence (see also s 394 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed). This is particularly so where the findings rest on the trial judge’s assessment of the credibility and veracity of witnesses. Second, a trial judge’s findings of fact are distinct from the inferences he draws from such findings. An appellate court is justified in differing from the inferences drawn by a trial judge if they are not supported by the primary or objective evidence on record. As the learned Chief Justice stated recently inLoh Der Ming Andrew v Koh Tien Hua[2022] 3 SLR 1417 at [98], a trial judge “has no advantage over, and therefore commands no deference from [an appellate court] when it comes to drawing inferences from established, objective facts”. These two general principles apply equally to appeals against acquittal and to appeals against conviction. 74 Applying these principles, it was clear to us that the Judge’s decision to acquit was wholly against the total weight of the objective evidence and the testimony of the Prosecution’s witnesses. There were essentially four factual issues where the evidence supported factual conclusions that led us to conclude that the Prosecution had proved the charge against BWJ beyond reasonable doubt.",
        "State of the relationship": "75 The first factual issue was that the romantic relationship between V and BWJ had clearly ended before the alleged rape on 6 August 2017. We have set out the evidence on this in detail earlier. We would emphasise two points. First, when BWJ returned to the Flat unannounced on 2 August 2017, V had not communicated with him since 21 July 2017. This was despite the fact that he had sent her more than 100 messages during this period. Second, V’s response to BWJ’s return between 2 and 5 August 2017 showed without a doubt that she was completely cold towards him and was totally uninterested in interacting with him, even as a friend. This was evident not only from the one-sided nature of their exchanges over WhatsApp but also the fact that she sought to distance herself physically from him. For instance, she left the Flat to stay with her aunt on 4 and 5 August 2017. 76 The clear picture from the evidence overall was that the romantic relationship had ended before BWJ’s return to Singapore and V would not have consented to having sexual intercourse with BWJ on 6 August 2017. Based on his evidence, after he hugged V in the master bedroom and while he was progressing to more intimacy, she shouted that she wanted to go out and he had to cover her mouth to stop her from shouting further. This was not a playful shout and she was not teasing him. Even if she “did not say no” and also “did not say yes”, her conduct at that moment was obviously conveying a big “No” to his unwelcome sexual advances.",
        "Bruising on V’s neck and damage to clothing": "77 The second factual issue was the use of violence which was evident from the extent of the tear in V’s T-shirt and the damage to the fastening system of her brassiere. In addition, there was the objective evidence of the bruises on V’s neck. BWJ disputed both at the trial and on appeal that weight could be given to these facts in the light of: (a) Ms Koh’s inability to come to a conclusion on the cause of the damage to V’s clothing; and (b) the absence of medical evidence to indicate that the bruises on the neck were caused by strangulation, apart from V’s assertions. However, BWJ’s stand was that there was no violence involved and it was not his case that the sexual intercourse was a session of rough sex. Therefore, the objective evidence that there was violence militated sharply against any suggestion that V consented to sex, even implicitly. BWJ claimed that the bruises on V’s neck were “love bites”. However, they did not appear to be so from the appearance of the bruises in the photograph shown below:  Image (4). Bruising on V’s neck In any case, BWJ was not able to explain the line between the two bruises on the sides of V’s neck which indicated that some injury was inflicted. 78 The extensive damage caused to V’s T-shirt could not be the result of a non-violent pull at the neck of the T-shirt by BWJ to bring V back into his embrace. BWJ’s evidence that he did not see any tearing of the T-shirt was unbelievable. Similarly, the damage to V’s brassiere would not have happened if there was no forceful tug in the process of removing it. Even if Ms Koh of the HSA was not able to ascertain the cause of such damage, they corroborated V’s account that BWJ used violence to subdue her.",
        "BWJ’s behaviour after the alleged rape": "79 The third factual issue was BWJ’s behaviour after the visit to the Clinic on 6 August 2017. In our judgment, his conduct that day betrayed his guilt beyond reasonable doubt. A lover of V who had consensual sex with her a short while earlier would not be fearful or sound so desperate in the more than 60 messages which BWJ sent to V while she was at the Clinic after the police arrived. If he had done nothing wrong earlier that day, why would he be so fearful of the police’s presence at the Clinic? Even if, as BWJ claimed, he did not wish to go near the police because he had a general aversion and fear of authorities, why were his multiple messages all begging and pleading V not to file a police report against him? What possible wrong could he have done to warrant such intense fear? Why was he suddenly promising to leave V and to pack up and leave Singapore? 80 These messages may not have confessed to having raped V but there was at least one message to a nephew in which BWJ admitted that he hit V even though his defence was that there was no violence involved. We disagreed completely with the Judge that BWJ could have been apologising out of an unparticularised fear of trouble. This was a man who claimed that he had consensual sex with his lover a few hours earlier and who took her to the Clinic when she said she was in great pain. Even if he did not understand why V shouted at him in the Clinic, that could not translate suddenly into a bizarre fear that she was going to make a police report against him for some unknown wrong and have him arrested. He did not even dare to return to the Clinic after the arrival of the police. Further, why was he suddenly not concerned about his lover’s well-being after having taken her to the Clinic because she was in great pain? None of his messages asked V whether she was feeling better and whether she could return home after seeing the doctor. 81 The messages which BWJ sent to V did not stand alone. When they are considered alongside the urgent voice messages that he was sending concurrently to his family members, we have a clear insight into the so-called “unparticularised fear of trouble”. He was actually afraid that V would accuse him of “attempted rape” and cause him to be imprisoned although there was no evidence from him at all that V was somehow angry with him after the consensual sex and had threatened to make a false report against him about rape. Although his understanding of the legal term “attempted rape” was flawed because sexual intercourse had taken place, the contents and the intensely desperate tone of the messages led clearly to the conclusion that he could not have believed that V had consented to sex, implicitly or otherwise. He knew that he had forced sex on V and had used violence to achieve his purpose. 82 This inference is bolstered by the fact that BWJ was trying to leave Singapore urgently. We did not accept Ms Chia’s argument that it made no sense for BWJ to linger around the Flat and risk getting arrested. The voice messages to his relatives showed that he was making plans to move his belongings to Malaysia. The fact that he was willing to have the lock on the Flat’s gates cut in order to enter the Flat showed that his belongings were important to him. The voice messages also showed that he did not dare to exit Singapore at that time because he was apprehensive about being arrested at the checkpoint if V had made a police report against him at the Clinic. He was therefore extremely concerned about whether V had made a police report against him. If he held the genuine belief that he and V had consensual sex, there would have been absolutely no reason for him to assume that the police was at the Clinic because of him. BWJ’s conduct pointed clearly to a guilty mind and his guilt stemmed from the fact that he knew that the recent sexual encounter with V involved violence to subdue V in order that he could force sex on her.",
        "V’s allegedly inconsistent evidence": "83 The final factual issue concerned the veracity of V’s evidence. We disagreed with the Judge that V’s credibility was affected by inconsistencies in her evidence and with his finding that those inconsistencies were sufficient to generate reasonable doubt in the Prosecution’s case. First, we did not agree that V downplayed her relationship with BWJ. We were aware that she informed Dr Chuah that the last time she had sex with BWJ was in November 2016 and that this was inaccurate as she admitted in court later that the last time was in March 2017 while they were in the Cameron Highlands. We also noted that V informed the police that her relationship with BWJ “turned sour” in February 2017 although she was still willing to have sex with him a month later and to travel with him to Kuala Lumpur some three months later. These statements were inconsistencies. However, they did not affect the pivotal point of the totality of the evidence that V’s relationship with BWJ had ended before his return to Singapore in August 2017. As we have pointed out, V was completely distant mentally from BWJ when he made his unannounced return to Singapore and she was trying to be distant physically from him as well. Further, the fact that BWJ had to use violence against her showed clearly that the sexual intercourse was not consensual but coerced. 84 Second, it was unclear to us what the Judge meant when he said that there were inconsistencies in V’s account of “how the offence occurred”. If the Judge was referring to the fact that V did not mention to the police or to Dr Chuah that she was raped but reported only a non-sexual assault, V had explained that she read the numerous messages from BWJ and considered holding back her police report because BWJ’s family had been nice to her, in particular, his mother. This made complete sense in the context of some of the messages from BWJ which made use of his family to exert emotional pressure on V. For instance, his message that “My Mom starts to crying already pls pls” and “U just help me for my Mom only pls u know my Mom like so much rite pls pls pls”. 85 Further, it was not the case that V never mentioned that she was raped. As pointed out earlier, she did say so to Dr Tan, Ms Foo as well as her godmother. Dr Tan and Ms Foo were independent witnesses who had no reason to support V’s allegations. We noted Ms Chia’s contention that there was a contradiction between Dr Tan and Ms Foo’s evidence. Ms Foo gave information to the police that it was a case of outrage of modesty and did not mention rape. Although she claimed to have reported in this manner on Dr Tan’s instructions, her claim was contradicted by Dr Tan. We do not see how this contradiction could cast doubt on Dr Tan’s and Ms Foo’s evidence that V informed them that she was raped or sexually assaulted since BWJ did not dispute that sexual intercourse did take place and when it was considered in the context of all the other evidence which we have discussed above. The only issue was whether the sexual intercourse was with V’s consent.",
        "The totality of the evidence": "86 Having considered the four material factual issues in our analysis, there was no doubt in our minds that the Judge’s decision went against the weight of the overwhelming evidence that BWJ was guilty of rape as charged. It was clear that V wanted nothing to do with BWJ by the time he returned to Singapore in August 2017. The objective evidence of violence and BWJ’s admission to his nephew that he had hit V contradicted his assertion that there was no violence in the sexual encounter. His inexplicable behaviour in avoiding the Clinic after the police’s arrival, his multiple messages begging V not to make a police report against him and his all-consuming fear of arrest at the checkpoint all led inexorably to the conclusion that V did not consent to having sex with him on 6 August 2017. It was clear that he raped her and to facilitate the rape, he caused her hurt by strangulation. 87 For all these reasons, we set aside the acquittal, found BWJ guilty as charged and convicted him accordingly. We then directed the parties to file their written submissions on the question of sentence and heard them again two weeks later.",
        "The sentence": "88 The parties agreed that the applicable framework for sentencing rape offences was the one set out inNg Kean Meng Terence v Public Prosecutor[2017] 2 SLR 449 (“Terence Ng”) at [39]–[74]. There was also no dispute that this case, which involved one charge of aggravated rape punishable under s375(3)(a)(i) of the PC, fell within band 2 of the framework. The indicative sentence within band 2 ranges from 13 to 17 years’ imprisonment with 12 strokes of the cane. As observed inTerence Ng, “[c]ases which contain any of the statutory aggravating factors and prosecuted under s 375(3) of the Penal Code will almost invariably fall within [band 2]” (at [53]). 89 The statutory minimum number of strokes of the cane prescribed for rape punishable under s 375(3)(a)(i) of the Penal Code is 12. The Prosecution did not submit that there were factors suggesting that BWJ should receive a higher number of strokes than 12. We also did not see any such factors. Therefore, the only three issues we needed to determine were: (a) where this case fell within band 2 as an indicative starting point for the imprisonment term; (b) whether there were any factors justifying an upward or downward calibration from the indicative starting point; and (c) how the periods during which BWJ was remanded and later released on bail pending appeal ought to be taken into account.",
        "The indicative starting sentence within band 2": "90 In determining the indicative starting point for the imprisonment sentence within the first stage of theTerence Ngframework, the court must identify and have regard to offence-specific factors. These are the factors relating to the manner and mode in which the offence was committed as well as the harm caused to the victim. The indicative sentence should reflect the “intrinsic seriousness of the offending act” (seeTerence Ngat [39]). At [44] ofTerence Ng, the court set out several examples of offence-specific aggravating factors with reference to the case law. There were four such factors which were potentially relevant to the present case: (a) abuse of position and breach of trust; (b) the existence of a prior relationship; (c) violence; and (d) severe harm to the victim. The first two, however, were closely connected in the circumstances of this case. 91 For BWJ, Ms Chia contended that BWJ’s use of violence to facilitate the rape was the only offence-specific factor which aggravated the seriousness of the offence. In this connection, she also submitted that as the hurt suffered by V, which were the bruises on her neck, had abated by the third day after the offence, the harm she suffered was not sufficiently severe to amount to an offence-specific aggravating factor. She therefore submitted that the indicative starting sentence for BWJ should be 13 years’ imprisonment, the sentence at the lowest end of band 2. 92 Ms Chia also argued that the existence of a prior relationship between V and BWJ ought to be regarded as an offence-specific mitigating factor. For this, she relied onPublic Prosecutor v Mohammed Liton Mohammed Syeed Mallik[2008] 1 SLR(R) 601, which suggested that the prior relationship between an accused person and a victim could be an aggravating, a mitigating or a neutral factor (see [99]–[116]). Ms Chia made the following two points. First, BWJ’s act was one of impulse fuelled by his desperation to convince V that their relationship was not over. Second, the act was an escalation of a quarrel and was wholly unplanned and unforeseen. 93 On the other hand, the Prosecution contended that the prior relationship between V and BWJ allowed BWJ to abuse the trust that V had in him. This was shown by the fact that BWJ could still gain access to the Flat despite their relationship having ended. In respect of the harm suffered, the Prosecution submitted that the harm suffered by strangulation in this case was “particularly aggravating” because it was to the extent of causing her to fear death. On the basis of these factors as well as the violence used, the Prosecution submitted that the indicative starting imprisonment term should be 15 or 16-years’ imprisonment. 94 In our view, violence was the only aggravating factor in this case. This included ripping of V’s clothing, slapping her, strangling and smothering her when she attempted to shout for help as well as threatening to end her life. We noted that the doctors who gave evidence at the trial did not suggest, as the Prosecution did before us, that the physical harm resulting from strangulation was particularly severe. The bruises at V’s neck region had faded by the third day or so and there was no residual injury. There was also no clear evidence that the extreme abdominal pain that V suffered was caused by the rape. While V and BWJ were in the Clinic, V said to him that he ought to know what caused the pain. This, without elaboration, was insufficient to show that the pain was caused by BWJ during the rape. 95 On the question whether BWJ abused the trust which existed by virtue of his and V’s prior romantic relationship, we regarded this as a neutral factor. In respect of Ms Chia’s argument set out above, we did not see any factual basis for BWJ to think that their prior relationship created any ambiguity as to whether V consented to sex. The fact that the rape was fuelled by his emotional desperation to win her back or that it took place in the heat of a quarrel would certainly not lessen his culpability. 96 In most cases where it was held that rape was facilitated by an “abuse of trust”, familial or unequal relationships existed where the offender was expected to care for the victim or was specially tasked to do so, for example, in parent-child and teacher-student relationships. In the present case, the “trust” which the Prosecution pointed to was that BWJ had continued access to the Flat because of V’s and BWJ’s previous romantic relationship. In our view, this did not explain why the trust arising from such a prior relationship made the rape worse than it would have been had there been no trust or prior relationship at all. 97 Based on the various acts of violence which BWJ used to facilitate the rape and V’s consequent fear that she was going to be killed by him, we determined that the appropriate starting indicative sentence in this case should be 14 years’ imprisonment.",
        "Calibration of BWJ’s indicative sentence": "98 The second stage of theTerence Ngframework requires the court to have regard to offender-specific factors. These relate to the personal circumstances of the offender in question and cannot include factors already taken into account in characterising the severity of the offence at the first stage (seeTerence Ngat [39]). Several examples of offender-specific aggravating and mitigating factors were listed at [64] and [65] ofTerence Ng. 99 Ms Chia submitted that the only offender-specific mitigating factor was the fact that BWJ had complied strictly with his bail conditions. In support of this proposition that such compliance was a relevant mitigating factor, she relied on the decision of See Kee Oon JC (as he then was) inPublic Prosecutor v Sivanantha a/l Danabala[2015] 4 SLR 585 (“Sivanantha”). In that case, the accused, a Malaysian citizen, was charged with importing a controlled drug into Singapore contrary to s 7 of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed). He was acquitted after trial after being remanded for 19 months. The Prosecution appealed against the acquittal and the accused spent about seven months on bail pending the Prosecution’s appeal. During this period, he was allowed to return to Malaysia. Eventually, See JC overturned the acquittal and in sentencing the accused, he made the following remarks at [43]: In the circumstances, I sentenced the respondent to five years and six months’ imprisonment and five strokes of the cane. It would not be appropriate to impose the mandatory minimum sentence given the quantity of drugs involved and the fact that he had been convicted after trial. But for his youth and lack of any known antecedents and evidence of drug dependency, I would have imposed a longer imprisonment sentence. I also took the view that he deserved some credit for returning to Singapore to attend the hearing of the appeal against his acquittal. This reflected a basic sense of responsibility and respect for the law. 100 The logic underlying See JC’s remarks was applicable to the present case. As stated earlier, BWJ was allowed to travel to Johor Bahru in February 2022 to attend his brother’s funeral and was required to return to Singapore in August 2022. He returned dutifully to Singapore to face the Prosecution’s appeal. Indeed, BWJ also complied with all other bail conditions imposed on him during the two-year and two-month period before the present appeal was heard. If strict compliance with bail conditions was a relevant offender-specific mitigating factor, BWJ ought naturally to receive some credit. 101 However, the Prosecution argued that BWJ ought not to be given any credit for complying with his bail conditions and returning to Singapore for the appeal because he was expected to do so in any event. At the hearing, we invited the Prosecution to address us on the view taken inSivanantha, which contradicted its stand here. Ms Selene Yap (“Ms Yap”) for the Prosecution did not suggest that See JC erred in taking such a factor into account as a mitigating factor nor did she give a cogent explanation why no weight should be accorded to an accused person for his dutiful compliance with his bail conditions and for returning from abroad as directed. Instead, she resorted to the contingent argument that, even if this court were to accept that strict and dutiful compliance with bail conditions was a mitigating factor, it ought to be given “little weight”. 102 We see no flaw in See JC’s remarks inSivanantha. Some credit ought to be given to an accused person who complies dutifully with the court’s directions in the same way a clean record can be seen as a mitigating factor, especially when it has stood for many years. If we take the view that no one should get any credit for doing what he was obliged by law to do anyway, it could be equally argued that a clean record has no mitigatory value because everyone is expected and obliged not to infringe the law at all. However, a clean record can indicate that a person has been law-abiding for much of his life and that the index offence was merely an aberration in his character explainable perhaps by some special circumstance. Some credit therefore should be given for a person who complies strictly with the court’s directions even on an individual occasion as when he complies with the law generally on all other occasions. The question is how much credit should be given and that depends of course on an assessment of the merits of compliance in individual cases. 103 Here, BWJ is a foreigner with hardly any roots in Singapore besides having worked here for a number of years. There was a lot of incentive for him to abscond and not return for the appeal in case the appeal went against him. This is because the offence he was charged with carries a heavy imprisonment term with mandatory caning of at least twelve strokes. We therefore bore this mitigating fact in mind when considering his sentence.",
        "Treatment of remand and bail periods": "104 In sentencing, the court will generally take into account periods that an accused person has spent in remand, even if there was a “break” in the period of custody during which the accused person was released on bail: seeSivanantha[33]–[41] andVasentha d/o Joseph v Public Prosecutor[2015] 5 SLR 122 at [86]. The somewhat novel issue in this case was whether the court ought to grant a discount in sentence to BWJ for the unusually long period that he was on bail pending appeal, especially since he could not work while in Singapore during much of that period and he did not contribute to any part of the delay. 105 BWJ was placed in remand on 7 August 2017 after his arrest that day and was released on bail pending appeal on 27 June 2020. The Judge’s oral grounds were certified only on 17 May 2022 and the Prosecution’s appeal could proceed only on 13 September 2022. This delay was significant to BWJ because, though on bail, he was not permitted to work and could not return to his home in Malaysia until the funeral of his brother. He had to live in Singapore for a substantial period of time without being able to make a living. Against this backdrop, Ms Chia submitted that BWJ should be given a full discount by way of a backdated sentence which included the whole of the bail period. In our view, this was plainly untenable as it would equate bail with imprisonment, especially when he did spend some time back in Malaysia, although still under bail conditions. In the alternative, Ms Chia argued: (a) that BWJ’s compliance with his bail conditions in the face of such circumstances could be treated as a mitigating factor; or (b) that an overall discount could be applied without characterising the circumstances as mitigatory. 106 Ms Yap’s contention was that no discount ought to be applied, whether by way of backdating or by a general reduction because it was not possible to determine in any principled manner how much of BWJ’s bail period should be taken into account. The only two principled answers, she suggested, were either to take into account all or none of the bail period. If it was patently illogical to grant BWJ a discount for the entire period of his bail, the only answer which emerged was that he ought not to be given any credit at all. 107 We agreed that the special circumstances here justified a reduction in BWJ’s imprisonment term. This court has stated previously that sentencing is not a science: see,eg,ADF v Public Prosecutor and another appeal[2010] 1 SLR 874. We do not need to have precise arithmetic computations in sentencing. As we have stated above, BWJ did not contribute to any part of the delay before the Prosecution’s appeal could be heard. Further, BWJ complied with all conditions imposed on him. We decided it would be fair to reduce his imprisonment term by one year. This brought his indicative sentence down from 14 to 13 years’ imprisonment. 108 In addition, we also decided to backdate his imprisonment term to the date of his arrest on 7 August 2017. However, the period while he was on bail would not be treated as part of his imprisonment term. We believe such a formulation did substantial justice to BWJ in that his period in remand was accounted for fully while his restricted freedom on bail pending appeal and his dutiful compliance with the bail conditions were accounted for by the one-year reduction.",
        "Conclusion": "109 For the reasons given, we allowed the Prosecution’s appeal, set aside BWJ’s acquittal and convicted him on the charge. We sentenced BWJ to 13 years’ imprisonment and the mandatory minimum 12 strokes of the cane. We backdated his imprisonment to 7 August 2017, the date of his arrest. However, the period of bail from 27 June 2020 (after his acquittal by the Judge) to 12 September 2022 (the date before the first hearing of this appeal) which amounts to two years, two months and 17 days, was not to be included in the computation of his sentence already served. 110 We repeat here our appreciation to both the Prosecution and the Defence for their clear and comprehensive submissions on the issue of guilt and on the question of sentence.  Judith PrakashJustice of the Court of AppealTay Yong KwangJustice of the Court of AppealWoo Bih LiJudge of the Appellate Division Ng Yiwen, Yvonne Poon Yirong and Selene Yap Wan Ting (Attorney-General’s Chambers) for the appellant; Chia Ru Yun Megan Joan and Tay Beng Tiat Reuben (Tan Rajah & Cheah) and Luke Anton Netto (Netto & Magin LLC) for the respondent."
    }
}