{
    "case_title": "Alternative Advisors Investments Pte LtdvAsidokona Mining Resources Pte Ltd and another",
    "ncitation": "[2024] SGCA 3",
    "coram": "Steven Chong JCA (delivering the judgment of the court):",
    "sections": {
        "Introduction": "1 This appeal concerns an action for repayment of a loan of $2m (the “Loan”) under a written contract (the “Loan Agreement”) between Supreme Star Investments Ltd (“SSI”) and the first respondent, Asidokona Mining Resources Pte Ltd (“Asidokona”). A claim for repayment of a written loan is typically relatively straightforward and rarely complex. However, in this case, the claim became somewhat convoluted owing to multiple amendments to the pleadings arising from disclosure of additional and conflicting information through discovery and interrogatories. What is perhaps most unusual about this case is that the named lender (ie, SSI) denied any knowledge of the Loan even though there is no dispute that the named borrower(ie, Asidokona) did, in fact, receive the Loan. 2 It is under these circumstances that we examine whether the Loan Agreement could be validly ratified by the named lender. Ratification usually concerns a situation where an agent without or in excess of authority purports to act for a principal in a transaction and the principal, upon being made aware of the transaction, agrees to adopt it by an act of ratification. In this unique case, there are several layers of complexity in relation to the ratification. First, the plaintiff is not the named lender under the Loan Agreement. Instead, the plaintiff is purportedly an assignee of the Loan Agreement. It goes without saying that the plaintiff can only take a valid assignment from a party that was, in fact, the lender under the Loan Agreement. Second, at the time when the action was commenced, the named lender did not appear to be aware of the Loan. Third, there is a dispute as to whether the person who signed the Loan Agreement and the assignment was properly authorised by the named lender to do so. Fourth, there is both a factual and legal dispute over the source of the funds for the Loan. Did the named lender provide the funds for the Loan and, if not, would that defeat the repayment claim, as was apparently found by the Appellate Division of the High Court (“AD”) below? Fifth, can the Loan Agreement be validly ratifiedafterthe commencement of this suit? Finally, at the heart of the appeal is the appellant’s allegation that the AD went beyond the ambit of permissible appellate intervention in raising additional legal and factual issues leading to the appeal being allowed. Due to these layers of complexity, it is vital for this court to properly define the relevant issues for determination and the order in which the issues should be examined. 3 As we indicated to counsel at the hearing of the appeal, there is no serious dispute that the respondents are liable to repay the Loan. The crux of the appeal is whether the appellant, Alternative Advisors Investments Pte Ltd (“AAI”), is thecorrectplaintiff entitled to pursue the repayment of the Loan. The answer to this question is, however, obscured by the lack of transparency and propriety in the arrangement of the Loan, the evolving cases run by the parties and the contradictory evidence furnished by key witnesses at the trial. 4 The background to this dispute has been succinctly stated by the General Division of the High Court (“GDHC”) and again on appeal to the AD. For context, we highlight the salient points.",
        "The material facts": "",
        "The parties": "5 Asidokona is a Singapore-registered company carrying on the business of mining activities. Its sole director and shareholder is the second respondent, Mr Soh Sai Kiang (“Mr Soh”). 6 AAI is a Singapore-registered company carrying on the business of providing professional services to companies and investors. Its managing director is Mr Wong Joo Wan (“Mr Wong”). Mr Soh and Mr Wong are old acquaintances. 7 SSI is a company registered in the British Virgin Islands (the “BVI”). Its sole shareholder and director is Ms Lou Swee Lan, who is also known as Mrs Stephanie Wong (“Ms Lou”). Ms Lou’s husband is Mr Wong Kup Loon (“Mr William”). 8 The solicitor who arranged the Loan between the parties was Mr Ong Su Aun Jeffrey (“Mr Ong”), who was, at the time, an advocate and solicitor and the managing partner of JLC Advisors LLP (“JLC Advisors”). He has since been convicted of various offences (which are not related to this case) and is currently serving a sentence of 19 years’ imprisonment.",
        "Background to the dispute": "The Loan Agreement 9 In June 2016, Mr Soh approached his old acquaintance Mr Wong to seek assistance to procure a loan of $2m for Asidokona (ie, the Loan). Mr Wong, who was confident of raising only $1m, in turn approached Mr Ong, who informed him that he had a client who would be willing to contribute the other half of the Loan. Mr Ong did not reveal the identity of the client and simply referred to the client as a “HK investor”. Mr Ong informed Mr Soh (through Mr Wong), that this “HK investor” would like to “take charge” of the Loan, and that security from Asidokona was required. 10 Mr Soh agreed, and Mr Ong drew up the Loan Agreement. Under the Loan Agreement, SSI was the named lender and Asidokona was the named borrower. The material terms of the Loan were that the monthly interest rate was 5%, with a default interest rate of 6% per month. Under the arrangement, Mr Wong would contribute $1m and SSI would raise the balance. The Loan was secured by: (a) a guarantee by Mr Soh (the “Personal Guarantee”); and (b) a charge over Mr Soh’s shares in Asidokona, representing 100% of its issued and paid-up capital (the “Share Charge”). (The Loan Agreement, Personal Guarantee and Share Charge are, collectively, referred to as the “Loan Documents”.) 11 Thereafter, on 19 July 2016, Mr Wong was provided with a copy of thedraftLoan Agreement (when he was copied in on Mr Ong’s correspondence to Mr Soh). However, it was his evidence that, despite being provided with a copy of thedraftLoan Agreement, he did not know that the “HK investor” was SSI, the named lender identified in thedraftLoan Agreement. Mr Wong testified that, although there was an “indication” that SSI was the named lender, he had not bothered to confirm it. His oral testimony was that there was some inconsistency in the draft that was sent by Mr Ong – although the named lender appeared on the first page of thedraftLoan Agreement, the execution block of the document named one “Secure Capital Holdings Limited” as the lender. Mr Wong’s evidence was that he had assumed that thedraftLoan Agreement was a boilerplate loan agreement used by JLC Advisors, and did not pursue the identity of the named lender further. 12 Mr Wong and Mr Soh agreed to schedule the execution of the Loan Agreement on 22 July 2016. Mr Wong later informed Mr Soh that he could not attend, but assured him that Mr Ong was handling the matter, and that the funds were ready for release. On 22 July 2016, Mr Soh duly executed the Loan Documents on behalf of Asidokona at JLC Advisors’ office. However, the Loan Agreement was not signed by SSI at that time. 13 Nevertheless, on that same day, $1.69m was disbursed by JLC Advisors to Asidokona, being the Loan quantum of $2m less $300,000 (the upfront coupon payment for the first three months) and $10,000 (payment for the Loan expenses). Mr Wong raised $1m of this sum, though it should be noted that the present matter does not concern an attempt by Mr Wong, either by himself or through AAI, to recover his investment. Instead, the action is solely to enforce the asserted rights under the Loan Agreement. Receipt of the Loan was not disputed by Asidokona and Mr Soh. 14 At all material times leading up to the conclusion of the Loan Agreement, and for two years thereafter, Mr Wong did not know of Ms Lou and SSI. Mr Wong’s evidence was that he “did not bother to find out the identity [of the HK investor] as [he] thought they had skin in the game”. Mr Ong only ever told Mr Wong that the other party who provided the $1m was a “HK investor”, and all communications with the “HK investor” were made through Mr Ong. According to Mr Wong, it was only in June or July 2018, when the Loan Agreement was purportedly assigned by SSI to AAI, that Mr Ong informed him that the “HK investor” was, in fact, Ms Lou, the sole director and shareholder of SSI. It was also at this time that Mr Ong informed Mr Wong that the named lender on thedraftLoan Agreement that Mr Wong previously received was the “HK investor”. As explained at [11] above, Mr Wong had not appreciated this at that time due to the inconsistency in the identity of the named lender between the face of the document and the execution block. Asidokona’s default on the Loan Agreement 15 By May 2017, Asidokona had defaulted on the Loan. It is not disputed that, by that time, repayments amounting to $900,000 had been made by Asidokona. As at 15 May 2017, Asidokona failed to redeem the Loan and a statutory demand in the name of SSI was issued to Mr Soh through JLC Advisors on the same day. Subsequent efforts to recover the Loan 16 By the first quarter of 2018, after multiple extensions of the Loan tenure, Asidokona continued to make empty promises to repay the Loan. It was evidently decided (though it is not clear who the parties to this discussion were save that it involved Mr Wong and Mr Ong) that, since Mr Wong and AAI had been instrumental in putting together the transaction which resulted in the Loan to Asidokona, Mr Wong would arrange for AAI to take over the Loan from SSI, and for any sums recovered from Asidokona to be repaid to SSI and AAI in equal proportions. 17 Thereafter, SSI purportedly assigned its interest under the Loan Agreement to AAI through the following documents: (a) the Loan Agreement and the Personal Guarantee were assigned pursuant to a deed of assignment dated 30 March 2018 (the “First Deed of Assignment”); and (b) the Deed of Charge was assigned pursuant to a deed of assignment dated 15 November 2018. (These are collectively referred to as the “Deeds of Assignment”.) The Deeds of Assignment were, however, signed, not by Ms Lou of SSI, but by Mr Wong, purportedly for and on behalf of SSI, and one Mr Yong Chor Ken (another director and shareholder of AAI) on behalf of AAI. 18 It was only around June or July 2018 that the Loan Agreement (which was then still unsigned by SSI) was executed by Mr Wong, purportedly on SSI’s behalf. According to Mr Wong’s testimony, he had never seen the executed copy of the Loan Agreement until then. It was also at this meeting (when the executed Loan Agreement was purportedly shown to him for the first time) that Mr Wong was allegedly informed by Mr Ong that: (a) he was authorised to execute the Loan Agreement on behalf of SSI; and (b) the “HK investor” referred to Ms Lou of SSI (see [14] above). After Mr Ong told him that he was authorised to act for SSI, Mr Wong’s evidence was that he then called Mr William to confirm his authority, as well as the fact that SSI had sufficient funds in 2016 to finance the Loan. Upon receiving Mr William’s oral confirmation, he signed the Loan Agreement on behalf of SSI. Mr Wong also informed Mr William that he would be initiating an action to recover the Loan due from Asidokona and Mr Soh and approval was granted by Mr William. Mr Wong’s execution of the Loan Agreement on behalf of SSI was witnessed by Mr Ong. On 20 July 2018, AAI commenced HC/S 734/2018 (the “Suit”). It is significant to note that no evidence was provided by Ms Lou that she had authorised either Mr Ong or Mr William to communicate the confirmations on behalf of SSI to Mr Wong. 19 Prior to the commencement of the trial, owing to Ms Lou’s answers to interrogatories in 2021 where she denied, for the first time, any knowledge of the Loan and the purported authorisation of Mr Wong, Mr Wong’s authority to sign the Loan Documents, which had previously been accepted by Asidokona and Mr Soh, was called into question. This triggered a further round of amendments to the pleadings (see [25] below), following which SSI passed a resolution in 2021 (the “Resolution”) to approve the following: (a) the prior execution of the Loan Documents by Mr Wong; (b) the commencement of the Suit by AAI; and (c) the joinder of SSI to the Suit. (These are collectively referred to as the “Proposed Actions”.) As we will elaborate below (at [28]), it is this Resolution that is the foundation of the alleged ratification by SSI.",
        "Procedural history": "",
        "The pleadings": "AAI’s pleaded case 20 As foreshadowed above, this case was complicated by the multiple amendments to the pleadings. Due to AAI’s contention that the AD erred in raising additional legal and factual issues, it is necessary to examine whether the issues which were considered by the AD fell within the ambit of the parties’ pleadings. 21 AAI’s case against Asidokona was that Asidokona was in default of its payment obligations under the Loan Agreement, and, against Mr Soh, AAI brought its claim on the Personal Guarantee and the Deed of Charge. 22 AAI initially pleaded that Mr Wong was the authorised attorney of SSI, who had arranged for SSI to extend the Loan to Asidokona. Despite multiple extensions on the Loan, Asidokona failed to repay the Loan in full and SSI was no longer agreeable to further extensions of the Loan. Thereafter, SSI assigned the Loan Documents and the claims arising therefrom to AAI, who duly commenced the Suit for recovery of the Loan. The first to fifth iterations of Asidokona and Mr Soh’s pleaded Defence 23 Asidokona and Mr Soh’s pleaded Defence saw four rounds of amendments. They initially denied that the Loan was between SSI and Asidokona, and averred instead that the Loan was between AAI and Mr Soh, in his personal capacity. This was their primary case, but it was dropped entirely at the opening of the trial. Instead, the first to third iterations of the Defence raised a host of defences, namely: (a) allegations of SSI’s breaches of the Moneylenders Act 2008 (2020 Rev Ed); (b) an invocation of the penalty doctrine; (c) the First Deed of Assignment savoured of maintenance and champerty; (d) the funds disbursed under the Loan were tainted by illegality; and (e) AAI as an equitable assignee did not havelocus standito bring the Suit. These defences were rejected by the GDHC and the AD and were not pursued before us in this appeal. 24 To add to the complications, between the third and fourth iterations of the Defence, SSI was struck off the BVI Register of Companies on 1 November 2019. As a result of this, SSI, who was the second plaintiff at that time, had its claim struck out for non-compliance with an “unless” order. 25 In the fourth and fifth iterations of the Defence and the subsequent Replies, two defences were added, which are of particular relevance to this appeal. First, in the fourth iteration of their Defence, Asidokona and Mr Soh alleged, for the first time, that Mr Wong hadnoauthorityto sign the Loan Documents on behalf of SSI. This marked a significant change from their previous admission that Mr Wong was “SSI’s principal” (the “Lack of Authority Defence”). 26 Secondly, Asidokona and Mr Soh amended their pleadings following Ms Lou’s answers to further interrogatories. In those responses, Ms Lou averred,inter alia, that she had never appointed JLC Advisors to act for her or SSI, and had never maintained a pool of funds with JLC Advisors. Consequently, Asidokona and Mr Soh argued that SSI had not appointed JLC Advisors to act as SSI’s solicitors and that SSI had not authorised the release of any funds for the Loan. These amendments caused yet another round of pleadings, namely, AAI’s fifth and sixth amended Reply and Asidokona and Mr Soh’s Rejoinder. In these amendments, AAI pleaded that Mr Wong was informed by Mr Ong (but not Ms Lou) that SSI had authorised him to sign the Loan Agreement. 27 Further, in response to Ms Lou’s change in position, which led to the amended fifth iteration of the Defence, AAI stated in its fifth amended Reply that it would pass a director’s resolution to adopt and ratify the Loan Documents, its execution by Mr Wong, and the commencement of the Suit. On 23 July 2021, SSI was restored to the BVI Register of Companies and SSI duly passed the Resolution on 26 July 2021. The Resolution stated that Ms Lou, the sole director of SSI, had reviewed the Loan Documents and the Deeds of Assignment, and thepurposeof the Resolution was to approve (a)the execution of the Loan Documents by Mr Wong; (b) the commencement of the Suit by AAI; and (c) the joinder of SSI to the Suit. 28 AAI then filed a further amended Reply to reflect that SSI passed the Resolution dated 26 July 2021. Asidokona and Mr Soh then filed Rejoinders to this further amended Reply, averring that the ratification was invalid (the “Invalid Ratification Defence”). They pleaded in the Rejoinder that the alleged ratification done by way of the Resolution dated 26 July 2021 (the “Ratification”) was problematic for several reasons: (a) it was plagued by unreasonable delay; (b) it was underinclusive as it did not ratify the disbursement of the funds for the Loan by SSI; and (c) it sought to whitewash an abuse of process in that Mr Wong continued to act for SSI even though it was struck off the BVI Register of Companies. 29 It was under these circumstances that the evolving pleadings led to the Ratification issue taking centre stage in the appeal before the AD and this court.",
        "The GDHC Judgment": "30 At the close of AAI’s case, Asidokona and Mr Soh made a submission of no case to answer. The GDHC found that AAI had proven the validity of the Ratification and expressly rejected all the defences raised by Asidokona and Mr Soh, save for the Lack of Authority Defence, on which it made no finding. The GDHC considered that, even if Asidokona and Mr Soh could prove on the evidence that Mr Wong or Mr Ong lacked the requisite authority, that argument would be moot if the Ratification was valid. As the GDHC found that the Ratification was valid, it did not consider it necessary to address the Lack of Authority Defence. 31 In relation to the Invalid Ratification Defence, the GDHC did not agree with Asidokona and Mr Soh that the Ratification was invalid. It found that SSI, in particular, Ms Lou, had full knowledge of the material facts pertaining to the unauthorised actions of Mr Wong at the time of the Ratification. The GDHC also found that SSI made the Ratification within a reasonable time, as it had done so within three days of being restored to the BVI Register of Companies. Finally, the GDHC found that the Ratification was not an abuse of process because Asidokona and Mr Soh’s allegation – that Mr Wong had misled the court by representing himself to be SSI’s authorised agent despite knowing that he was not – was not borne out by the evidence. As regards the scope of the Ratification, the GDHC found that the Ratification extended to the Loan Documents as well as the Proposed Actions as stated in the Resolution (at [19] above).",
        "The AD Judgment": "32 On appeal to the AD, Asidokona and Mr Soh challenged the GDHC’s findings on all the pleaded defences save for the defence of illegal moneylending (see above at [23]). 33 The AD upheld the findings of the GDHC in rejecting the pleaded defences, save for the invocation of the penalty doctrine on which it did not make any finding and the Invalid Ratification Defence, on which it allowed the appeal. 34 The AD held that AAI was precluded from reviving its case that Mr Wong was authorised to act for SSI as this ground was not raised in AAI’s case on appeal before the AD. The AD reasoned that, since the GDHC had made no finding on Mr Wong’s authority, if AAI wished to rely on Mr Wong’s authority to affirm the GDHC’s decision, the burden was on AAI to raise this on appeal. On that premise, the AD determined the appeal on theassumptionthat Mr Wong did not have authority from SSI. More will be said about this “assumption” below. 35 The AD allowed the appeal on two bases: (a) The AD disagreed with the GDHC with respect to the Invalid Ratification Defence. (b) The AD found that, even if the Ratification was valid, the Suit was commenced without a valid cause of action, and that the Ratification could not retrospectively validate any non-existent cause of action (the “Cause of Action Issue”). The Invalid Ratification Defence 36 In its analysis of the Invalid Ratification Defence, the AD examined two questions: (a) whether Mr Wong purported to act on behalf of SSI in relation to the Loan (the “First Question”); and (b) whether SSI provided the funds for the Loan (the “Second Question”). 37 The AD found, on the First Question, that Mr Wong could not have purported to act on behalf of SSI at the material time between 2016 and 2018 because he only found out in March 2018 that SSI had not signed the Loan Documents and that he was not aware that he was authorised to sign the Loan Documents on behalf of SSI until he spoke to Mr Ong and Mr William in June or July 2018. 38 On the Second Question, the AD found that there was no evidence that SSI had contributed the funds for the Loan, because there was no documentary evidence to support Mr Ong’s evidence that the transfer of funds for the Loan came from SSI’s client account with JLC Advisors. 39 Under these circumstances, the AD held that SSI could not validly ratify the Loan Documents because: (a) it could not be shown that Mr Wong had purported to act for SSI between 2016 and 2018; and (b) it had not been shown that the funds came from SSI, thus, validating the Ratification would permit it to adopt as its own that which did not belong to it. The Cause of Action Issue 40 The AD found that AAI did not have a valid cause of action at the commencement of the Suit because the Loan Documents and the Deeds of Assignment, even if they were validly ratified, were not ratified prior to the commencement of the Suit. This meant that at the time when the Suit was commenced, no contract had been validly formed between SSI and Asidokona, and accordingly, no rights under the Loan Documents could have been assigned by SSI to AAI. 41 The AD further held that the Ratification could not validate a cause of action which was not in place when the action was commenced. The AD reasoned that a Suit commenced without a cause of action is voidab initio, and thus, acts undertaken post-commencement cannot restore validity to the Suit.",
        "Permission to appeal": "42 AAI appliedvideCA/OA 2/2023 for permission to appeal against the decision of the AD. AAI’s case was that the AD’s decision raised two points of law of public importance, first, the extent of permissible appellate intervention, and, second, whether an assignee of a loan can maintain an action where the commencement of the action predated the ratification of the loan and its assignment. On the first point, AAI raised two sub-issues: whether an appellate court can determine an appeal by (a) making factual findings on issues not raised in the Appellant’s Case and which were not addressed by the parties; and/or (b) adopting its own reasoning on factual issues not raised in the Appellant’s Case and which is contrary to the findings of the trial judge. 43 This court granted AAI permission to appeal against the decision of the AD. In granting permission to appeal, this court directed the parties to address twospecificissues in addition to other issues which the appellants might wish to raise in the appeal: (a) When a borrower is sued for repayment of a loan disbursed under a loan contract with a named lender, does the named lender have to prove that it provided the funds for the loan in order to maintain the action? (b) Can a named lender ratify a loan contract even if it cannot be established that it had provided the funds for the loan?",
        "The parties’ cases": "",
        "The appellant’s case": "44 AAI’s case on appeal, in essence, is that the AD went beyond the ambit of permissible appellate intervention in raising additional legal and factual issues, and the determination of these issues led the AD to incorrectly allow the appeal. More specifically, AAI contends that the AD incorrectly introduced the following legal issues: (a) whether SSI was aware of and consented to the Loan; (b) whether Mr Wong purported to act for SSI; (c) whether SSI performed the Loan; and (d) whether AAI had a valid cause of action at the time of commencement of the Suit (which turns on whether SSI had a valid cause of action at that material time). 45 AAI also says that the AD erred in making several findings of fact. These are: (a) the assumption that Mr Wong had acted without authority; (b) Mr Wong did not purport to act on behalf of SSI; (c) SSI did not perform the Loan; and (d) AAI did not have a valid cause of action at the commencement of the Suit. 46 We pause to observe that these arguments ultimately turn on the ambit of the parties’ pleadings. Hence, we devoted some attention to understand the pleadings before us.",
        "The respondents’ case": "47 Asidokona and Mr Soh opposed the appeal on two principal grounds: (a) The AD correctly found that AAI did not have a valid cause of action at the commencement of the Suit, because it was not proven that Mr Wong had been authorised to act on SSI’s behalf in relation to the Loan Agreement. They argue that the AD was correct in holding that the subsequent Ratification cannot, as a matter of law, retrospectively validate a non-existent cause of action. (b) In any event, the AD was correct to find that the Ratification was invalid.",
        "Issues to be determined": "48 The crux of this appeal turns on the validity of the Ratification. However, before the validity of the Ratification can be meaningfully considered, there is an anterior question that must first be examined: whether Mr Wong was validly authorised by SSI to enter into the Loan Agreement in 2016. If Mr Wong was indeed so authorised, then the question of the validity of the Ratification falls away because SSI, as Mr Wong’s principal, would have been a party to the Loan Agreement in 2016 when it was formed. This preliminary issue, though conceptually simple, was complicated by the GDHC’s non-finding on the issue of Mr Wong’s authority: the GDHC’s non-finding was premised on its decision that the Ratification was valid, which on appeal, was decided to the contrary by the AD. 49 It was in this context that the AD dealt with this issue on the basis of an assumption that Mr Wong lacked authority from SSI. However, in examining the issue of the Ratification, as we observe below, the AD appeared to us to have conflated the analysis of Mr Wong’s actual authority with whether any want of authority had been cured by a valid Ratification. 50 Therefore, we first consider whether Mr Wong was authorised by SSI in 2016 to enter into the Loan. This inquiry has a material impact on the question of whether SSI intended to enter into the Loan Agreement with Asidokona in 2016. At the hearing of the appeal before us, counsel for AAI, Mr N Sreenivasan SC (“Mr Sreenivasan”), devoted a substantial part of his submissions to persuade us that Mr Wong was so authorised. The foundation of his submission was premised on an alleged admission in the pleadings of Asidokona and Mr Soh that Mr Wong did act on behalf of SSI. 51 We note that the issue of Mr Wong’s authority does squarely arise from the pleadings, as pointed out at [25] above. AAI pleaded that: (a) Mr Wong was SSI’s “authorised Attorney”. (b) “Mr Wong entered into the Loan Agreement on behalf of SSI and acted as SSI’s principal and/or authorized attorney” and that there was thereafter an “affirmation of Mr Wong’s authority to act on its behalf for the purposes of the Loan Agreement …”. Therefore, the burden to establish that Mr Wong was authorised by SSI in respect of the Loan Documents clearly lay on AAI, since this was part of its pleaded case. 52 The AD, however, found that AAI was not permitted to pursue this point (as it was not raised in AAI’s case before the AD). On the issue of the validity of the Ratification, we think that it will be apposite to frame the issues bearing in mind the legal requirements for ratification: (a) the act or contract must be one capable of being ratified; (b) the principal seeking to ratify must be capable of ratifying the act or contract; (c) the principal must have the necessary level of knowledge for ratification; (d) there is conduct on the part of the principal amounting to ratification; and (e) there are no applicable limiting principles on ratification. (See generallyBowstead & Reynolds on Agency(Peter G Watts and FMB Reynolds eds) (Sweet & Maxwell, 22nd Ed, 2021) (“Bowstead & Reynolds”)at paras 2-047–2-087; Tan Cheng Han,The Law of Agency(Academy Publishing, 2nd Ed, 2017) (“The Law of Agency”) at paras 06.004–06.090). 53 It appears to us that the key requirements in dispute in this appeal relate to the second and third requirements,ie, whether there was any nexus between SSI and the act or contract which SSI seeks to ratify and whether SSI had the requisite level knowledge of the Loan for the Ratification. This entails a consideration of the following sub-issues: (a) Whether the conditions necessary for a valid ratification were present,ie, whether the acts purportedly done by Mr Wong on behalf of SSI to form the contract with Asidokona and Mr Soh were done by Mr Wongpurporting to actas an agent for SSI. (b) Whether AAI had a valid cause of action to commence the Suit, which in turn depends on whether SSI was a party to the Loan at that material time. (c) Whether it is necessary for SSI to prove that it provided the funds for the Loan in order to validly ratify the Loan Documents.",
        "Whether Mr Wong had authority to enter into the Loan Agreement in 2016": "54 We first deal with AAI’s argument that the AD erred in approaching the Ratification issue “on theassumptionthat [Mr Wong] was not authorised” [emphasis in original]. rather than making afinding of fact on the evidence. 55 In our view, the choice of the word “assumption” by the AD was perhaps infelicitous. It appears to us that the AD in fact did not analyse the evidence on anassumptionthat Mr Wong did not have any authority from SSI. What the AD meant was that it would address the question of the validity of the Ratification on the basis that Mr Wong’s authorityremained unproved(as this was not decided by the GDHC) and, therefore, if Mr Wong wished to rely on his authority to affirm the GDHC’s decision, it was incumbent upon him to prove it. In other words, the AD’s use of the word “assumption” meant only that it approached the issue of Mr Wong’s authority with reference to the parties’ respective burdens of proof. As explained above at [25] and [51], it was AAI’s own pleaded case that Mr Wong had been authorised by SSI. 56 The AD explained (a) that since the GDHC did not make a finding on the issue of authority; (b) that AAI had not revived its case on authority in its case on appeal; and (c) that it was for AAI to prove Mr Wong’s authority, it followed that it remained unproved that Mr Wong had been authorised by SSI to enter into the Loan Agreement in 2016. Quite apart from the question of whether AAI is permitted to raise the issue of Mr Wong’s authority on appeal before us, we are satisfied that the evidence does not support a finding of Mr Wong’s authority to enter into the Loan Agreement on behalf of SSI. 57 In response, AAI submitted that the AD erred as Asidokona and Mr Soh had admitted in its pleadings that SSI was a party to the Loan Agreement, and, further, Asidokona and Mr Soh’s submission of “no case to answer” meant that AAI had proved its case on a balance of probabilities.",
        "Asidokona and Mr Soh did not admit that SSI was a party to the Loan Agreement": "58 AAI submits that there was no dispute that Mr Wong had the authority to enter into the Loan Agreement in 2016 as Asidokona and Mr Soh had admitted that SSI was a party to the Loan Agreement. It relies on two distinct admissions. First, thatthe Loan Agreement, which names SSI as the lender, constitutes an admission. This is plainly wrong. AAI cannot claim to prove that SSI was a party to the Loan Agreement by relying on the very document in contention. Second, AAI submitted at the hearing before us thatAsidokona andMr Soh’s pleadingscontained an admission that SSI was a party to the Loan Agreement. 59 When asked to identify the specific pleadings which AAI claims constitute Asidokona and Mr Soh’s admission, Mr Sreenivasan referred to the following: (a) Paragraphs 8, 9(a) and 9(g) of the Defence of the 1st Defendant (Amendment No 4). But this was merely an admission of theexistenceof the Loan, and, as we pointed out during the hearing, this was not an admission thatSSI wasa party to the Loan. The fact that the Loan exists is clearly uncontroversial since Asidokona undoubtedly received the Loan. (b) Paragraphs 8, 9(f) and 9(g) of the Defence of the 1st Defendant (Amendment No 4). He submitted that these amounted to admissions that SSI was a party to the Loan Agreement because it “refers to the loan agreement [and therefore] means SSI is the lender”. But that is what the Loan Agreement states and not what Asidokona and Mr Soh have pleaded. Furthermore, as we explained to Mr Sreenivasan at the hearing, the use of the word “purported” in the Defence suggests that Asidokona and Mr Soh do not accept that the Loan Agreement is binding on SSI. This is hardly the clear and unequivocal admission (that SSI entered into the Loan Agreement) that AAI claims was made. (c) Paragraph 9(k) of the Defence of the 1st Defendant (Amendment No 4). Mr Sreenivasan submitted that, since Asidokona and Mr Soh admitted to some terms of the Loan Agreement and those terms of the Loan Agreement set out the identity of the lender, they have admitted that SSI was a party to the Loan Agreement. However, an admission to thetermsof an agreement is distinct from an admission as to the identity of thecontracting party. Paragraph 9(k) clearly states “… onlyadmitted insofar as it sets out some of the termsof the Loan Agreement [ie, cll 2, 5.1, 6, 7, 8.1, 9, 10 and 12] (the‘PurportedLoan Agreement’). However, [Asidokona and Mr Soh]did not agreeto the terms …” [original emphasis in bold removed, emphasis added in italics]. The response provided by AAI was that Asidokona and Mr Soh challenged only Mr Wong’s authority, but not the fact that the lender was SSI. However, that still does not constitute an admission that SSI was a party to the Loan Agreement, and that is especially so in the present circumstances, where AAI’s case is that it was validly assigned the rights under the Loan Agreement from SSI which had acquired those rights by the acts of Mr Wong. 60 We therefore cannot agree with AAI’s submission that Asidokona and Mr Soh had admitted in their pleadings that SSI was a party to the Loan. 61 Instead, it appears to us that Asidokona and Mr Soh clearly denied that SSI was a party to the Loan Agreement. AAI specifically pleaded that “[t]he terms of the Loan were set out in a Loan Agreement between SSI and the Company signed on 22 July 2016” were denied. AAI cannot therefore rely on any purported admission to argue that Mr Wong had authority from SSI to enter into the Loan Agreement in 2016.",
        "Asidokona and Mr Soh’s “no case to answer” submission does not mean that AAI proved that Mr Wong was authorised to enter into the Loan Agreement": "62 AAI’s primary argument that Mr Wong was authorised by SSI to enter into the Loan Agreement in 2016 has its basis in Asidokona and Mr Soh’s submission of “no case to answer”. AAI claims that, because the Lack of Authority Defence was raised by Asidokona and Mr Soh, it was for them to prove that Mr Wong was not authorised to act for SSI. Furthermore, where a submission of “no case to answer” is made and Asidokona and Mr Soh elected not to call any evidence, AAI would be regarded as having proven its case on abalance of probabilities, so long as it satisfies the Court that it had established aprima faciecase:Ma Hongjin v SCP Holdings Pte Ltd[2021] 1 SLR 304 (“Ma Hongjin”)at [31]. 63 In our view, this is a misunderstanding of a submission of a “no case to answer”. The burden to establish that Mr Wong was authorised by SSI in respect of the Loan Documents lay on AAI, since this was part of its pleaded case. We therefore agree with Asidokona and Mr Soh’s submission that Mr Wong’s authority to act for SSI in relation to the Loan was an essential ingredient of SSI’s cause of action against them. The burden to prove the fact of Mr Wong’s authority thus lay on AAI. 64 AAI would only be correct to say that it was for Asidokona and Mr Soh to argue and prove, on appeal, that Mr Wong was not authorised to act for SSIif the GDHC had accepted that AAI had established aprima faciecase that SSIhad authorised Mr Wong. But the GDHC made no such finding, since it found that AAI had “proven its case” against Asidokona and Mr Sohon the basis of the Ratification, and not on Mr Wong’s authority. Therefore, it cannot be said that AAI successfully discharged its legal burden of proving on a balance of probabilities that Mr Wong was an authorised agent of SSI. 65 At the hearing of the appeal before us, AAI argued that GDHC did not make a finding on Mr Wong’s authority because it was not challenged at that stage. That misstates the state of affairs at the trial. By the time of the trial, Asidokona and Mr Soh’s pleadings had already been amended to the effect that Mr Wong was not authorised by SSI to enter into the Loan Agreement. If AAI was dissatisfied with the GDHC’s reasoning on that front, it ought to have appealed against it, which, as the AD noted, it did not do. In any event, as explained below, even if AAI had appealed against the GDHC’s non-finding of Mr Wong’s authority, the outcome would still have been the same,ie, that Mr Wong was not authorised by SSI to conclude the Loan Agreement in 2016.",
        "SSI did not authorise Mr Wong to enter into the Loan Agreement": "66 We agree with the AD’s assessment that there was no such authorisation. Ms Lou’s evidence 67 The person best placed to give evidence on the conduct and intention of SSI was Ms Lou, the sole shareholder and director of SSI. Her evidence was that SSI had not authorised Mr Wong to enter into the Loan Agreement. 68 AAI submitted that the AD erred in considering the threshold question as to whether SSI was even aware of and consented to the Loan. However, it appears from [28] of the AD’s judgment that the AD did not in fact make any such finding since “the parties did not make their case on appeal on this basis”. That having been said, the question of whether SSI was aware of and consented to the Loan, though related, is distinct from the issue of whether Mr Wong was authorised by SSI. In so far as Mr Wong’s authority on behalf of SSI is concerned, there can be no doubt that this issue does squarely arise from the pleadings. 69 It was only at the hearing of the appeal before us that AAI called the AD’s observation into question, by arguing that Ms Lou’s evidence was not credible because she had sought to distance herself from the Loan after Mr Ong’s criminal wrongdoing was brought to light by way of a “somewhat threatening” letter. Mr Sreenivasan submitted that the “distancing” from matters pertaining to the Loan occurred after Ms Lou received a “somewhat threatening” letter on 27 November 2020 from M&A Law Corporation (acting on behalf of Asidokona), which stated that Mr William was the subject of investigations by the Commercial Affairs Department of the Singapore Police Force for conspiring with Mr Ong in alleged cheating offences. AAI highlighted the following events which occurred after Ms Lou received the letter: (a) In her response to interrogatories, she asserted that she had not authorised the Loan, that SSI had not contributed to the Loan, that SSI had not appointed Mr Wong as SSI’s “authorised attorney/principle/representative with respect to the [Loan Agreement] [sic]”. She also stated that she had never appointed Mr Ong to act for SSI in the Loan, had not placed a sum of $1.7m in JLC Advisors’ client account at the material time. (b) In a further response to interrogatories, Ms Lou asserted that she had never appointed JLC Advisors as her solicitors and never maintained a pool of funds in JLC Advisors’ client account. (c) Thereafter, Asidokona and Mr Soh’s Defences were amended to state that Mr Wong’s authority was disputed. 70 AAI also pointed to the GDHC’s finding that Ms Lou had a reason to distance herself from transactions involving Mr Ong, including the Loan Agreement. The GDHC assessed that Ms Lou gave unhelpful evidence in court because she was trying to distance herself from the dealings with Mr Ong after her husband, Mr William, had been named as a co-conspirator with Mr Ong in charges of conspiracy around 2020. On this basis, it found that Ms Lou’s testimony did not undermine AAI’s claim that SSI had contributed the funds for the Loan. We respectfully disagree with the GDHC on this point for several reasons which we set out below. It should be noted that AAI had no knowledge of the relevant facts and largely depended on what was said by Mr Ong; but this in turn is to be seen in the context of the fact that, if Mr Ong had indeed been authorised by SSI in respect of the Loan, there would inevitably have been a documentary trail to corroborate this and as we shall shortly point out, this was not only conspicuously absent, it was contradicted by the evidence that was before the GDHC. 71 We first observe that Ms Lou was the only person who could speak to what SSI did or did not do. Her evidence, ever since her answers to interrogatories in 2021 (see [19] above), was consistently that SSI did not authorise Mr Wong to enter into the Loan Agreement in 2016. AAI’s argument that Ms Lou changed her evidence because she received the abovementioned letter amounts to no more than mere speculation. As we pointed out at the hearing, if a principal denies conferring authority upon a purported agent, agency cannot be established solely by the purported agent claiming that they were authorised. 72 When we brought this to AAI’s attention at the hearing, AAI responded that, according to Mr Ong, SSI had sent funds amounting to $1m to JLC Advisors, albeit three months earlier. AAI contended that these funds were for the Loan, which therefore supported the conclusion that SSI knew of and funded the Loan. But this runs into the problem that the AD identified: Mr Ong’s evidence is to be treated cautiously given the grave personal situation he was in at the material time, and the most straightforward way to show that the funds came from SSI would have been to adduce evidence of the transfer from JLC Advisors’ client account, but that was not done. We address this more fully below at [74]–[77]. In any case, this argument does not support its submission that Ms Lou’s evidence should not be believed. 73 Consequently, the evidence before the court from the key person who could speak to the issues from SSI’s perspective is to the effect that SSI was not aware of the Loan Agreement at the time it was purportedly made. It follows, as a matter of logic, that SSI could not have authorised Mr Wong to enter into the Loan Agreement. Source of the funds disbursed as the Loan 74 As noted at [72] above, the inquiry into the source of the funds for the Loan became relevant in this case as an evidential tool to establish that SSI in fact knew of the Loan, and put JLC Advisors in funds to enable the Loan to be made. If this were true, it would undoubtedly be a significant evidential point toward establishing that SSI intended to be the lender under the Loan Agreement. We make this point to explain that there would usually be no need to establish the source of the funds that are advanced by way of a loan when making a claim for repayment; but, in this case, that became an evidential pillar for AAI’s claim that SSI had in fact intended to make the Loan. 75 For the reasons that follow, we agree with the AD’s assessment that there is insufficient evidence to establish that SSI provided funds for the Loan. This pillar of AAI’s case therefore falls and, when taken together with Ms Lou’s evidence, leads to the conclusion that SSI was not a party to the Loan Agreement and had not authorised Mr Wong to enter into the Loan Agreement in2016. 76 The AD attached weight to Mr Ong’s admission that there was no record that there had been any money in JLC Advisors’ client account available for disbursement when the Loan had been disbursed on 22 July 2016. The AD also noted that there was no documentary evidence of the client account of JLC Advisors to which the $1m was allegedly sent and from which it was allegedly subsequently deployed under the Loan Agreement. Further, following multiple discovery applications, a partner of JLC Advisors, Mr Vincent Lim, attested that the firm could not locate any physical file to evidence the transfer, and that their server and email records did not directly show that $1m for the Loan came from SSI. In this regard, the AD accepted the evidence of Ms Lou in her testimony and interrogatories that she never maintained a pool of funds in JLC Advisors’ client accounts. The AD also found that there was a discrepancy in the amount supposedly contributed by SSI. The AD reasoned that as Mr Wong had testified that he contributed a sum of $1m towards the Loan, that meant that SSI would have, at most, contributed the balance of $0.69m since this was the net amount in fact advanced to Asidokona. However, it was never the evidence before the court that the amount allegedly advanced by SSI was $0.69m and as a result there was an unsatisfactory lack of clarity as to the source of the funds that were loaned under the Loan Agreement. This, the AD found, was an inherent difficulty with AAI’s case that SSI had contributed $1m. 77 The seeming coincidence between the alleged disbursement of $1m by SSI to JLC Advisors some months earlier and the remaining portion of the Loan after accounting for Mr Wong’s contribution of $1m is insufficient to establish that SSI was the lender under the Loan Agreement. Aside from what we have said above, this transfer occurred in April 2016, some two months before Mr Soh even approached Mr Wong to assist with the procuring of the Loan in June 2016. The seeming coincidence in quantum, given the lack of objective evidence as to SSI’s purpose in making that $1m transfer, is insufficient to discharge AAI’s burden of proof to show that the $1m disbursed to JLC Advisors was for the purposes of SSI’s performance of the Loan. We therefore do not find that there is a basis to draw the inference that the transfer was for the Loan. 78 Further, given that AAI’s case is that Mr William was allegedly the person who represented SSI (though he was neither an officer nor shareholder of SSI) in making the decisions pertaining to the Loan (as opposed to Ms Lou), one would have expected AAI to call Mr William as a witness to testify about the reason for the transfer of $1m, but this was not done. Instead, AAI was left to rely on Ms Lou’s evidence, which completely undermined its own case. As stated above at [71], we have not been provided with any good reason to doubt Ms Lou’s evidence. As such, she remains the person best placed to testify on SSI’s intentions at the material time. For these reasons, we differ from the GDHC’s finding that Ms Lou gave “inconsistent, evasive and unhelpful evidence in court” in order to distance herself from the dealings with Mr Ong after her husband, Mr William, was identified as a co-conspirator with Mr Ong in 2020. We further consider that, if that was indeed the case as was found by the GDHC, then there would have been no reason at all for Ms Lou toratifythe Loan Documents on 26 July 2021, evenafterthe receipt of the 27 November 2020 letter from M&A Law Corporation. It would make no sense for her to have done so. In our view, the objective evidence, as a whole, points to the conclusion that AAI failed to prove that the transfer of $1m to JLC Advisors by SSI in April 2016 was for the purposes of the Loan. 79 There is yet another troubling feature of the Loan which reinforces our finding. If SSI was indeed a party to the Loan, then it would be expected that repayments by Asidokona would be credited proportionately to SSI and Mr Wong. However, the evidence is to the contrary. All the repayments by Asidokona were instead made to Mr Wong, Mr Ong or JLC Advisors’ client account and none was ever received by SSI. Mr Wong admitted on the stand that he had no knowledge if SSI ever received any repayments, and that there was no documentary evidence of the same. 80 Given that the evidence does not establish that SSI was or intended at the material time to be a party to the Loan Agreement in 2016, it must logically follow that Mr Wong was not and could not possibly have been authorised by SSI to enter into the Loan Agreement on its behalf. 81 Where, as is the case here, an agreement appears to have been concluded but it subsequently emerges that one of the parties denies entering into the contract, a number of possibilities arise. There may be a failed contract and it may be the case that, if benefits have passed pursuant to the purported agreement, those may be recovered under a different cause of action by the party who provided the benefits. Or, if it can be established that the contract was concluded by an agent who hadapparentauthority, the principal may be bound by the contract notwithstanding the lack of an agent’sactualauthority. Or in some circumstances, the entity on whose behalf the contract was entered into may subsequently ratify the contract and step into the position as if it had been a party from the outset. In the present case, AAI seeks to take the latter position: in short, it contends that if there was a want of actual authority, as we have found to be the case, then SSI has subsequently ratified the lack of authority. Before we turn to consider this, we digress briefly to set the remarks of the AD on the relevance of the source of the funds to the question of the validity of the ratification in the proper context.",
        "Whether SSI provided the funds for the Loan": "82 The AD held that “if it cannot be shown that the Loan was in fact funded by SSI, it would also not be correct to conclude that SSI could ratify”. This was a point raised by the AD in its judgment and was not an issue which the parties were specifically invited to address. 83 To the extent that the AD purported to lay down a legal requirement that a lender must first establish that it provided the funds in order to be able to ratify a loan contract, with respect, we disagree. In our judgment, there is no such requirement in law. We should add that counsel for Asidokona and Mr Soh, Mr Gregory Vijayendran SC, candidly acknowledged at the appeal hearing that he was unable to identify any authority to support this requirement. 84 A loan may be arranged on terms that the funds emanate from a third party for whatever reason. If this is correct, there is no reason for thinking that the lender in a case like the present, must have provided the funds for the Loan, in order to be able to ratify and/or enforce the Loan Documents. The fact that a consequence of ratifying a contract is the incurrence of liability for non-performance means just that: if such a lender had an executory obligation to advance the loan and failed to do so, it would be liable. But that does not mean that performance must be proven, in the sense that it must already have provided the money, in order for it to ratify a loan contract made on its behalf. It is imperative not to confuse performance of a contract, which is a separate issue, with a contracting party’s capacity to ratify a contract. This is because ratification is focused on the adoption of rights and liabilities under a contract as opposed to whether those rights and liabilities have been discharged. 85 It seems to us that the AD was looking at the relevance of the source of funds from the evidentiary perspective of examining whether SSI was in fact the party on whose behalf the Loan Agreement was purportedly entered. This is a relevant inquiry as we shall shortly explain. However, to be clear, it is not a requirement that a ratifying party have actually performed the contract in order to be capable of ratifying it. 86 If the funds were provided by a named lender, there would be no question that that lender was a party to the loan for the purposes of ratification. However, where the funds were not so provided, it would be for that lender to prove that it was nonetheless intended to be a party to the loan such that it could validly ratify the loan contract. On that note, we turn to address the validity of the Ratification.",
        "Whether the Loan Agreement was validly ratified by way of the Resolution in 2021": "87 As noted by the AD, the only act of ratification pleaded by AAI is the Resolution passed in 2021 (ie, the Ratification). AAI’s pleaded case is that SSI ratified “Mr Wong’s authority to act on behalf of SSI in respect of … the ‘Purported Loan & Action’”. AAI says that the Ratification was done by way of the Resolution dated 26 July 2021. 88 Although the Resolution recounted the background of Mr Wong’s acts (cll 1.1 to 1.4), the exact wording of the Ratification only approved and adopted (a)the execution of the Loan Documents by MrWong; (b) the commencement of the Suit by AAI; and (c) the joinder of SSI to the Suit (cll 1.5, 1.6 and 2.1). There was no specific ratification of Mr Wong’s purported acts on behalf of SSI (ie, negotiating and entering into the Loan Agreement), and no ratification of the funds allegedly disbursed by SSI, especially given that the funds were purportedly transferred by SSI to JLC Advisors’ client account in April 2016 before the Loan was even discussed in June 2016. This clearly contradicts AAI’s pleading that the Resolution ratifies and adoptsallthe acts of Mr Wong since 2016. 89 As indicated above, AAI did not plead that SSI’s ratification was done by any other method. Therefore, the sole question which arises from the pleadings is whether the Ratification was sufficient to adopt the Loan Documents such that SSI could have a valid contract to sue on.",
        "Mr Wong did not purport to act on SSI’s behalf in entering into the Loan Agreement": "90 As we had alluded to at [52(b)] above, for the Ratification to be valid, the principal seeking to ratify,ie, SSI, must be capable of ratifying the act or contract. This requires some form of nexus between the principal and the act or contract which the principal seeks to ratify. Such nexus is made out by an act of an agent whopurported to act on itsprincipal’s behalf(Wilsonand another v Tumman and Fretson(1843) 6 Man & G 236 at 242;Keighley, Maxsted & Co v Durant[1901] AC 240 (HL) (“Keighley”) at 244, 246–247, 249–250, 256–257, 259;The Law of Contract in Singapore(Andrew Phang Boon Leong gen ed) (Academy Publishing, 1st Ed, 2012) at para 15.019;The Law of Agencyat para 06.032). 91 According to AAI’s pleadings, the purported agent of SSI is Mr Wong. Although AAI did not plead specifically that Mr Wong did purport to act for SSI in 2016 and the GDHC made no finding on this issue, we find that the AD rightly queried whether Mr Wong had indeed purported to act on behalf of SSI in respect of the Loan Documents in 2016. This is because AAI pleaded that Mr Wong’s acts had been validly ratified by SSI. However, in order for the Ratification to be valid, it is necessary to establish that Mr Wong had purported to act for SSI in relation to the Loan in 2016. The GDHC did not deal with this question as the issue was not squarely raised before it. However, whether Mr Wong had purported to act for SSI in relation to the Loan Agreement in 2016 was a critical part of the inquiry into the validity of the Ratification, and this is what the AD considered. 92 AAI submits that Mr Wong did, between July 2016 and 2018, represent SSI in the negotiation, conclusion and performance of the Loan, therefore, he did purport to act for SSI in the Loan. This, AAI says, overrides the fact that Mr Wong was only informed in 2018 that he had authority to sign the Loan Documents on SSI’s behalf. We first make an observation on AAI’s position: if Mr Wong had in fact been purporting to act on behalf of SSI in the negotiation and conclusion of the Loan from 2016, then we agree that it would not be fatal to AAI’s case that Mr Wong was only clothed with the authority to do so in 2018. But this rests on the factual position that Mr Wong was, in fact, purporting to act on behalf of SSI from 2016. 93 We note that there are two possible points in time to assess whether Mr Wong had purported to act for SSI: (a) when he negotiated with Mr Soh in 2016 prior to finalising the terms of the Loan Agreement, the formation of the Loan Agreement with Asidokona and the disbursement of funds to Asidokona pursuant to the Loan Agreement; and (b) when he executed the Loan Documents in 2018 following the discovery of SSI’s identity as the named lender. 94 In our judgment, the relevant time for assessing whether Mr Wong had purported to act for SSI in relation to the Loan Agreement was in 2016, because that was when the Loan was negotiated, drafted, and concluded. It is not disputed that the contract between the parties, if any, would have been formed then. Thereafter, notwithstanding the lack of signature on the part of SSI when the Loan Agreement was entered into in 2016, the Loan was performed: the funds were disbursed on that day and Asidokona duly made repayments under the Loan Agreement. Therefore, the key act to be ratified, for SSI to have a valid cause of action to assign to AAI, would be the acts of Mr Wong in 2016. This is consistent with the authorities: the court inKeighleyfound that acontract made by a person intending to contract on behalf of a principal, but without his authority, cannot be ratified by the principal so as to render him able to sue or liable to be sued on the contract, where the person who made the contract did not professat the time of making itto be acting on behalf of the principal (Keighleyat 240 and 263). 95 In this regard, we agree with the AD that Mr Wong did not and could not have purported to act on SSI’s behalf in 2016. As the AD noted, AAI’s case is that Mr Wong must have purported to act on behalf of SSIbecausehe was duly authorised by SSI to act on its behalf. As we have observed above, AAI did not discharge its burden of proving that Mr Wong was indeed so authorised by SSI. We should add that the issue of whether Mr Wong was authorised by SSI to conclude the Loan Agreement in 2016 (which if so, would render the question of ratification moot) is entirely separate and independent from the question of whether Mr Wong had purported to act for SSI. Conflating these two issues only serves to confuse the crucial inquiry. 96 In unequivocal terms, Mr Wong’s oral testimony was that he was not the representative of SSI when the Loan was being entered into, but rather, it was only in 2018 that he considered himself to be a representative of SSI. In fact, he did not even know of SSI’s identity until 2018. When queried as to who would have represented SSI in 2016 when the Loan was entered into, Mr Wong’s answer was that it was Mr Ong. Finally, when asked further as to who from SSI dealt with Mr Ong, Mr Wong admitted that he would not know, and that he had not seen the Loan Documents prior to signing them in 2018 (see above at [14]). 97 We also observe that Mr Wong’s behaviour during his discussions with Mr Soh in 2016 suggests a lack of concern as to the identity of the party who would eventually be the named lender in the Loan Agreement. Instead, his primary focus was to secure the opportunity to benefit financially from the attractive interest rates under the Loan Agreement. His role and focus were simply toparticipatein this business opportunity. Given his acquaintance with Mr Soh and his prior dealings with Mr Ong, it appears that he “did not bother to find out the identity [of the HK investor]”. In fact, he cited the fact that Mr Ong was managing the matter of the Loan Agreement as a reason he did not attend to the execution of the Loan Agreement. His lack of concern as to the identity of the lender of the Loan was also clear from his testimony that it was only in 2018 that he came to know that he had SSI’s authority, and, crucially, he “would not know” who represented SSI prior to that. 98 At the risk of stating the obvious, it must not be overlooked that Mr Wong did not sign the Loan Documents in 2016 and therefore it appears obvious that he could not have purported to act for SSI in relation to the Loan Agreement in 2016. That being the case, Mr Wong’s acts cannot be validly ratified by SSI. We therefore uphold the AD’s finding with respect to the invalidity of the Ratification. 99 Given our agreement with the AD’s decision that the Ratification is not valid, it is not necessary to consider the other defences. However, we address them briefly, for completeness. 100 We see no reason to disagree with the GDHC’s finding that there was no unreasonable delay by SSI in the Ratification had the other conditions for a valid ratification been met. 101 It is also strictly unnecessary to comment on whether AAI had a valid cause of action at the commencement of the Suit, especially since this issue was considered by the AD on its own accord without the benefit of full arguments. It follows that it is equally unnecessary for us to decide whether the Ratification could retrospectively validate a cause of action that was voidab initio. In any event, we do not think that this defence was even pleaded by Asidokona and Mr Soh in the first place. 102 Although Asidokona and Mr Soh claim that they pleaded that “[AAI] has no cause of action … as SSI did not authorise the [Loan] and the [Deed of Assignment]”, we do not think that this was, in fact, pleaded. Instead, all that was pleaded was that SSI did not authorise Mr Wong to act in relation to the Loan, including the execution of the documents: the header reads “SSI DID NOT AUTHORISE THE PURPORTED LOAN & THE ALLEGED DEED OF ASSIGNMENT”. At its highest, this pleading merely challenges anelementof the plaintiffs' claim, rather than an assertion thatno cause of actionexistedto begin with.",
        "Conclusion": "103 We therefore dismiss AAI’s appeal. 104 We award costs in Asidokona and Mr Soh’s favour in the sum of $100,000, inclusive of: (a) disbursements; and (b) the costs and disbursements of CA/OA 2/2023. Sundaresh MenonChief JusticeSteven ChongJustice of the Court of AppealBelinda Ang Saw EanJustice of the Court of Appeal N Sreenivasan SC, Muralli Rajaram and Tan Si Xin Adorabelle (K&L Gates Straits Law LLC) for the appellant; and Gregory Vijayendran Ganesamoorth SC and Tomoyuki Lewis Ban (Rajah & Tann Singapore LLP) (instructed), Mulani Prakash P and Ng Ying Tian (M&A Law Corporation) for the respondents."
    }
}