{
    "case_title": "Shen Hanjie vPublic Prosecutor",
    "ncitation": "[2024] SGCA 6",
    "coram": "Tay Yong Kwang JCA (delivering the grounds of decision of the court):",
    "sections": {
        "Introduction": "1 The appellant appealed against his conviction by the High Court on a charge of trafficking in a controlled drug by having in his possession for the purpose of trafficking not less than 34.94g of diamorphine. The packets of diamorphine in question were found in a drawer in his bedroom at the time of his arrest. 2 For sentencing, the trial Judge held that the appellant was not a mere courier for the purpose of the alternative sentencing regime under s 33B(1) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“MDA”). In addition, the Public Prosecutor did not issue a Certificate of Substantive Assistance (“CSA”) to the appellant. Accordingly, the mandatory death penalty was passed on the appellant. 3 This appeal was originally scheduled for hearing in August 2023 but it was adjourned because the appellant wanted to change his counsel. He has now gone back to the counsel assigned for the High Court trial. 4 The appellant confirmed that he was not pursuing the point set out in his Petition of Appeal on the chain of custody of the drug exhibits in question in this appeal. His two main points on appeal against conviction were whether: (a) The trial judge was wrong in holding that the presumption of knowledge of the nature of the drugs set out in s 18(2) MDA was not rebutted. (b) The trial judge was wrong in holding that the appellant had the intention to traffic in the drugs. 5 On sentence, the appellant maintained that he was a mere courier on the occasion stated in the charge although he acknowledged that the outcome would  not be different so long as the Public Prosecutor did not issue him a CSA.",
        "Knowledge of the nature of the drugs": "6 As the presumption of knowledge of the nature of the drugs set out ins 18(2) of the MDA was invoked by the Prosecution, it was incumbent on the appellant to rebut this presumption. 7 The appellant submitted that he was generally forthcoming and cooperative during the investigations. He detailed all the drugs that he had helped Alan, who was allegedly a drug supplier, to pass on to others but he never mentioned diamorphine. He did mention “hot one” (“shao de” in Chinese) but he understood this term to be the same as “grass” or “ganja” because Alan told him so when the appellant asked him. He had always believed that the bundles in issue contained cannabis, referred to in drug jargon as “gu” or “grass” or “ganja”. 8 The trial Judge found that it was improbable that Alan lied about the type of drugs involved as the appellant was keeping detailed records of the transactions in his notebooks so that he could account to Alan on the movement of the drugs. The records included the type of drugs passed on to the recipients, the recipients’ names and the locations where the drugs were left at for their collection. The appellant made only a few face-to-face deliveries to a person named Ah Poh. The jargon “hot” (or “hot one”) and “gu” could not be the same thing because the appellant’s notebooks referred to them by these different names. 9 We agreed with the trial Judge. We were similarly not satisfied that Alan lied to the appellant that the drugs were cannabis instead of diamorphine. In any case, even if Alan had lied to him, it was unbelievable that the appellant would trust and believe Alan totally and accept his explanation at face value. Alan was someone the appellant had met only once at a playground some months before the transactions and the appellant was aware that Alan was dealing in illegal drugs. 10 Further, even if Alan had lied to the appellant about the nature of the drugs in question, there was no assertion by the appellant that he would have refused to help Alan if the drugs were diamorphine. He was indifferent  as to the nature of the drugs which were being sent to him by Alan and appeared to be interested in their names only for the purpose of recording all the transactions so that he could give a proper account to Alan when asked. 11 We make one minor observation about the appellant’s submissions that he was generally forthcoming and cooperative in the recording of the investigation statements. In the contemporaneous statement recorded soon after his arrest, he was asked: Q4 What else did Alan asked you to keep? A4 Ice, Red Wine, grass, “k” and some red tablet. Q5 What is Red Wine, grass and the red tablets? A5 Red Wine is “S”, grass I don’t know and the red tablets are “WY”. 12 It can be seen from his answer at A5 that the appellant was far from being forthcoming as he made a blatantly false statement that he did not know what grass was. Later evidence would show that he was quite familiar with grass as he had helped Alan distribute this drug before. He even stated that he had smoked grass before but did not like the smell. Although he referred to it as “gu” in his notebooks, in his evidence, he accepted that “gu”, “grass” and “ganja\" all meant the same drug, cannabis. This answer also showed that he did not believe that the drug bundles D4 to D9 contained cannabis. In any event, he had already stated in answer A1 that he did not know what those bundles contained. 13 Based on all the evidence before the Court, the trial Judge held that the presumption in s 18(2) of the MDA was not rebutted by the appellant. We agreed with the trial Judge. We also agreed that the appellant was not a credible witness.",
        "Recording inaccuracies and Bailment defence": "14 The appellant argued that he was not holding the drugs in question for the purpose of trafficking. Instead, he was merely safekeeping the drugs for Alan and would return them when Alan’s men came to collect the drugs from him (the bailment defence). 15 In the contemporaneous statement at Q3, the recording officer, then SI Eugene Eng from the Central Narcotics Bureau (“CNB”), asked the appellant why the bundles of drugs in question were with the appellant. The appellant was recorded as saying in A3, “Alan asked me to keep. He will ask me to pass it to others”. At the trial, the appellant claimed that his actual response was, “Alan asked me to keep for him first. Within a month, he would ask his man to take them from me”. 16 Taking the appellant’s case at its highest, this did not support the bailment defence because it would involve the appellant delivering the drugs to someone other than Alan. 17 It could not be such a remarkable coincidence that all the alleged inaccuracies in the appellant’s statements canvassed during the trial pertained to the appellant’s defence of bailment. Everything else was apparently interpreted from the Chinese language correctly and recorded accurately. The statements were read back to the appellant and he affirmed their correctness. 18 The trial Judge believed the recording officer’s evidence that he recorded accurately what he heard from the appellant. We saw no reason to disagree and nothing capable of creating a reasonable doubt was canvassed before us. 19 There was no dispute that the appellant was in possession of the drugs in question. There could be only three possible reasons for the appellant to be in such possession. The drugs were either: (a) for his own consumption, (b) for safe keeping with a view to returning them to Alan or (c) for delivery to other persons on Alan’s instructions. 20 Personal consumption of the drugs was not asserted by the appellant. The drugs were therefore in the appellant’s possession either because he was a bailee for Alan or because they were for distribution and therefore trafficking. 21 We noted that this incident was not the appellant’s first transaction with Alan. For all the previous transactions, the appellant admitted that he would deliver the drugs to other persons as directed by Alan. The appellant did not claim that any of the previous transactions involved only safe keeping of the drugs for Alan. The immediate difficulty for the appellant would be to provide an adequate explanation why this transaction was going to be different. In our view, not only did he fail to do so, his response in A3 contradicted that position and, as we have held above, A3 was recorded accurately. 22 While the appellant’s admissions that he had helped Alan deliver drugs on previous occasions could not be used to prove that this would also be the case for this transaction, the relevance lay in disproving the contention about the alleged recording inaccuracy. The absence of any reasonable explanation why this transaction should be different from the previous occasions was entirely consistent with the appellant’s response in A3 as recorded by the CNB officer and completely undermined the appellant’s speculative case theory. 23 It was apparent from the appellant’s statements that the appellant was passing the drugs received from Alan to third parties by leaving them at designated locations when directed by Alan to do so. This was also evidenced by the appellant’s notebook entries. The appellant had been out of work for about two years before his arrest. He was paid by Alan to distribute the drugs. In addition, there was drug-related paraphernalia found in his bedroom(Public Prosecutor v Shen Hanjie[2022] SGHC 103 at [8]) such as two rolls of clear wrap, numerous empty packets, numerous black packets and black tape. All these items pointed clearly to the fact that the appellant was involved in the distribution of the drugs for Alan. In addition, there was also DNA evidence showing that the appellant had repacked some of the drug packets.",
        "Whether the appellant was a mere courier": "24 The appellant had to acknowledge that he had repacked some of the packets when confronted with  the presence of his DNA on those packets. He claimed that he did so only when the plastic wrapping of the packets was torn. 25 The drug-related paraphernalia in his bedroom showed that he was doing more than mere delivery. Further, he was involved in recording the transactions in his notebooks so that he could account to Alan on the type of drugs involved, where the drugs were deposited for collection and whom they were meant for. 26 Clearly, the trial Judge was correct in holding that the appellant did not qualify as a mere courier for sentencing purposes. In any case, as acknowledged by the appellant, even if he was found to be a courier, he did not receive a CSA from the Public Prosecutor and therefore could not come within the alternative sentencing regime in s 33B of the MDA.",
        "Conclusion": "27 Overall, we saw no error in the trial judge’s treatment of the evidence and in his application of the legal principles in his rather detailed judgment. Accordingly, we dismissed the appeal against conviction and sentence. Tay Yong KwangJustice of the Court of AppealSteven ChongJustice of the Court of AppealBelinda Ang Saw EanJustice of the Court of Appeal  Cheong Jun Ming, Mervyn (Advocatus Law LLP) and Lau Kah Hee (BC Lim & Lau LLC) for the appellant; Wuan Kin Lek Nicholas, Pavithra Ramkumar & Heershan Kaur (Attorney-General’s Chambers) for the respondent."
    }
}