{
    "case_title": "Public Prosecutor v Abdul Hamed bin Yahya",
    "ncitation": "[2000] SGHC 193",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "THE CHARGES": "1 The Accused is now 38 years old. He\n\npleaded guilty to two Charges under Section 354 of the Penal Code involving outrage of\n\nmodesty committed against his niece in September 1997 and November 1999 when she was then\n\n10 and 12 years old respectively. His niece (hereinafter referred to as \"the\n\nvictim\") is an orphan living with her sisters in their grandmother’s flat. The\n\nAccused also pleaded guilty to three Charges under Section 377 of the Penal Code for\n\nhaving carnal intercourse against the order of nature with the victim by causing her to\n\nperform fellatio on him in November 1997, December 1997 and October 1999.2 In addition, the Accused admitted 21\n\nother Charges of outrage of modesty under Section 354 of the Penal Code committed against\n\nthe victim between May 1997 and October 1999. These 21 Section 354 of the Penal Code\n\nCharges alleged that the Accused caressed the victim’s body, fondled her nipples and\n\nrubbed his erect penis against her vagina.3 The first Section 354 of the Penal Code\n\nCharge to which he pleaded guilty alleged kissing of the mouth, sucking of the nipples and\n\nrubbing his erect penis against her vagina. The second alleged that he caressed her body,\n\nfondled her nipples and kissed her mouth.4 The Statement of Facts added a prelude\n\nto the first outrage of modesty Charge which took place in the Accused’s\n\nbrother-in-law’s flat which was the one next to the victim’s grandmother’s.\n\nThe Accused first kissed the victim’s face and mouth and then put some facial cream\n\non her hand and taught her to masturbate him. When he ejaculated, she was shocked and ran\n\ninto the toilet. The Accused then called her to the bedroom again and asked her to lie\n\ndown on the floor. After that, he pushed up her t-shirt and sucked her nipples. He also\n\nkissed her mouth and inserted his tongue therein. He then removed her pants and panties\n\nand told her to spread her legs. He next went on top of her and rubbed his penis against\n\nher vagina until he ejaculated onto a piece of tissue. They then washed themselves and\n\nwent next door to the victim’s grandmother’s flat.5 The second outrage of modesty Charge to\n\nwhich the Accused pleaded guilty was the last in the series of offences committed against\n\nthe victim. That took place at the Accused’s home on 6 November 1999. The victim had\n\ngone there with some relatives. The Accused and his wife were home. At first, everyone in\n\nthe flat was doing karaoke singing in the living room. The Accused then went to one of the\n\nbedrooms to rest. When the victim entered that bedroom to get a compact disc, he asked her\n\nto lock the door but she merely closed it. He asked her to sit on the bed and, after\n\npushing her gently to lie down, proceeded to fondle and suck her nipples and to kiss her.\n\nHe then placed her body on top of his with her back towards him. Before anything else\n\nhappened, the Accused’s wife entered the bedroom whereupon the Accused released the\n\nvictim and both of them jumped off the bed. A heated argument between the Accused and his\n\nwife ensued while the victim ran out of the bedroom in tears. She was subsequently brought\n\nhome.6 On 13 November 1999, the victim’s\n\nstep-sister brought her to Tanglin Police Division Headquarters to lodge a report that the\n\nvictim had been raped by the Accused. Subsequent investigations revealed that she was not\n\nraped but that the offences in question had been committed against her.7 In respect of the three Section 377 of\n\nthe Penal Code Charges, the victim was asked each time to lick the Accused’s penis\n\nuntil it became erect and then to suck it. He would then withdraw his penis and ejaculate\n\nonto a piece of tissue.THE PROSECUTION’S SUBMISSIONS ON\n\nSENTENCE8 The Prosecution noted that Section 377\n\nof the Penal Code provides for imprisonment for life or for up to 10 years with a\n\ndiscretionary fine and that Section 354 of the Penal Code provides for imprisonment of up\n\nto two years or a fine or caning or any two of such punishments. CitingChia Kim Heng\n\nFrederick v PP[1992] 1 SLR 361, the Prosecution submitted that the Court should take\n\ninto account the victim’s young age, the Accused’s position of responsibility\n\nand trust vis--vis the victim and any perversions or gross indignities forced on the\n\nvictim. Although that case involved the offence of rape, the Prosecution argued that those\n\nfactors in sentencing were equally apposite here as the present offences were also sexual\n\nin nature.9 Stressing that the victim was only 10\n\nyears when the first abuse took place and the fact that she is an orphan depending heavily\n\non her extended family for care and emotional support, the Prosecution pressed for a\n\ndeterrent sentence to be imposed on the Accused. In addition, the Prosecution pointed out\n\nthat the Accused had told the police that he would often tell the victim that he would buy\n\nher sweets and other things if she allowed him to touch her. He had also shown her obscene\n\nvideo tapes of people engaging in sexual intercourse on three occasions when he molested\n\nher. It was also emphasized that the offences were a series committed over some two years.10 Relying onWong Kai Chuen Philip v\n\nPP[1991] 1 MLJ 321, the Prosecution submitted that the Accused’s plea of guilt\n\nshould not be the dominant consideration in deciding the appropriate sentence here because\n\nhe was practically caught red-handed by his wife, had confessed at a \"family\n\nmeeting\" that he had \"disturbed\" the victim and had admitted the offences\n\nto the police. He was therefore pleading guilty when he had \"no means of escape\"\n\n(words borrowed from the case cited).THE MITIGATION PLEA11 Defence Counsel informed me that the\n\nAccused was working as a postman for 20 years. He was also a first offender. He is married\n\nwith two young children. His wife is a full-time homemaker.12 The victim was said to be very fond of\n\nand very attached to the Accused.13 After the confrontation in the\n\nAccused’s flat on 6 November 1999, the Accused’s wife informed her mother (the\n\nvictim’s grandmother) who questioned the victim and disciplined her by beating her.\n\nThat angered the victim’s elder step-sister who decided to lodge a police report\n\nafter discussing the matter with other family members.14 The Accused was remorseful and had\n\nadmitted everything to the police. He had not used force or threats against the victim at\n\nany time. He was exempted from performing reserve service after his full-time national\n\nservice on medical grounds. Defence Counsel also urged me to backdate the imprisonment\n\nsentence to the date of his arrest on 3 May 2000. While not implying that the victim had\n\nconsented to the acts, Defence Counsel submitted that if the Accused had thought about the\n\nmatter, he would have obtained her consent as she was already 12 years old in 1999.THE DECISION OF THE COURT15 This is another sad and sordid case of\n\nan erstwhile innocent young girl sexually abused by an adult relative. The victim was only\n\n10 years old when the first of the series of offences took place. She is now 13 years old\n\nand has just begun secondary education.16 The Accused, now 38 years old, instead\n\nof displaying avuncular love, chose to bury the sweet innocence of his young niece in an\n\navalanche of lust. The series of sexual assaults stretched over a period of more than two\n\nyears. An uncle should be buying games and toys for his growing niece, not treating her as\n\nfair game and playing with her as if she were his toy.17 Children of such tender age and in such\n\nan emotionally dependent situation as the present must be protected against adult\n\npredators who entice them with gifts or attempt in any way to deprive their young minds of\n\ninnocence and to deprave their young bodies.18 Sexual offences committed by relatives\n\ncause waves of emotional distress and recrimination long after the events because the\n\noffender and the offender’s family are likely to come into contact with the victim\n\nand her family again. Relationships among family members can become extremely strained if\n\nnot altogether destroyed. It is therefore appropriate that accused persons in such\n\nsituations should be kept out of society for a sufficiently long period of time in order\n\nto assuage the hurt and to allow the painful memories to fade away.19 The Accused has no previous conviction\n\nbut that fact must be viewed in the context that his offences were not uncovered for more\n\nthan two years. That again underlines the insidiousness of offences committed by adult\n\nrelatives – they have every reason to be near their vulnerable victims who may feel\n\ngreat discomfort in making any complaints against their uncle. The Accused has however\n\nadmitted his offences, first, in front of his relatives, and later, when questioned by the\n\npolice. He has also pleaded guilty and admitted all the offences, obviating the need for\n\nhis niece to come to Court to face him and to recount all the embarrassing and hurtful\n\nevents of the past few years. For this, appropriate credit will be given in the sentences.20 Mr Abdul Hamed Bin Yahya, I now\n\npronounce the sentences of this Court on you. For the 1stand 23rdCharges under Section 354 of the Penal Code – I sentence you to one year imprisonment\n\nand eight strokes of the cane per Charge. For the 24th, 25thand 26thCharges concerning Section 377 of the Penal Code – I sentence you to seven years\n\nimprisonment per Charge. The imprisonment terms for the 1st, 24thand 25thCharges will run consecutively while the rest will run concurrently\n\nwith the other sentences, making a total of 15 years imprisonment and 16 strokes of the\n\ncane. The imprisonment terms are backdated to commence on 3 May 2000.Tay Yong KwangJudicial CommissionerCopyright © Government of Singapore."
    }
}