{
    "case_title": "Low Fun Boon and Others v Wong Teck Chow and Others",
    "ncitation": "[2000] SGHC 183",
    "coram": "Woo Bih Li JC",
    "sections": {
        "Introduction": "1.    The Plaintiffs are members of the\n\nFourth Defendant, the Char Yang (Dabu) Lee Chee Association (‘the Association’).2.    The First, Second and Third\n\nDefendants are the President, Secretary and Treasurer of the Association respectively.3.    On 20 June 2000, the High Court\n\ngranted an injunction against the Defendants restraining them from convening with the\n\nadjourned AGM for any or all the purposes set out in the notice dated 10 June 2000 unless\n\nthe following motions were tabled at the adjourned AGM and members were given notice of\n\nthe said motions:-(a) that the name of the Fourth Defendant in Mandarin be\n\n  reinstated from ‘Gong Hui’ to ‘She’(b) that the First Defendant be removed as President of\n\n  the Fourth Defendant(c) that the First Plaintiff be elected as President of\n\n  the Fourth Defendant(d) that all proceedings at the annual general meeting\n\n  held on 26 March 2000 after the departure of the First to Third Defendants were valid(e) that the sum of $19,500 of the Fourth Defendant’s\n\n  funds utilised by the First to Third Defendants for the purposes of the suit is improper\n\n  and not approved(f) that the Suit No 266 of 2000 be continued by the\n\n  Plaintiffs and another suit by Mr Yee Tar Swee representing all members and also the\n\n  Fourth Defendant against the First to Third Defendants in their personal capacity.4.    On 23 June 2000, the Defendants\n\napplied for an injunction to restrain the Plaintiffs from proceeding with the adjourned\n\nAGM until trial or further order.5.    On 24 June 2000, the High Court made\n\nan order in the following terms:‘(a) The adjourned annual general\n\n  meeting will not proceed on 25 June 2000 as originally scheduled(b) The adjourned annual general meeting will be adjourned\n\n  to a date to be fixed at such time as will allow sufficient notice under the Rules and\n\n  Regulations to be given to all members and in any event the adjourned annual general\n\n  meeting is to take place by 24 August 2000(c) The First Defendant is to convene and hold the\n\n  adjourned annual general meeting as the purported President of the Association and the\n\n  First Defendant will chair the adjourned annual general meeting according to the Rules and\n\n  Regulations as the purported President of the Association(d) All motions on record including those contained in the\n\n  Order of Court dated 20 June 2000 and any new motion which complies with the Rules and\n\n  Regulations are to be included in the adjourned annual general meeting(e) To the extent the Order herein so contradicts the\n\n  earlier Order of Court made on 20 June 2000, the earlier Order of Court is hereby varied\n\n  accordingly.’6.    This Order of 24 June 2000 was then\n\namended to better reflect the intention of the court.7.    On 1 August 2000, the Defendants made\n\nan application to court. The material part of the application sought:(1) That the Order of Court dated 20 June 2000 and\n\n  paragraph 4 of the Amended Order of Court dated 24 June 2000 be discharged;(2) Alternatively, that paragraph 4 of the Amended Order\n\n  of Court dated 24 June 2000 be varied as follows:-a) all motions on record and any new motion which complies\n\n    with the Rules and Regulations, excluding the six (6) motions contained in the Order of\n\n    Court dated 20 June 2000, to be tabled in the adjourned annual general meeting.(3) Pending the hearing of this application, paragraph 2\n\n  of the Amended Order of Court dated 24 June 2000 be suspended8.    This application was heard on an\n\nurgent basis on 18, 19 and 21 August 2000 as the adjourned AGM was scheduled for 24 August\n\n2000. On 21 August 2000, I dismissed the application and reserved costs.9.    The Defendants have appealed against\n\nmy decision.",
        "Background": "10.    On 15 November 1998, one Chew Tong\n\nShing had proposed at a Council meeting of the Association to change the name of the\n\nAssociation from ‘She’ to ‘Gong Hui’ in Mandarin. This proposal was\n\nnot carried.11.    Subsequently, the Association held\n\nits Annual General Meeting (‘AGM’) on 10 January 1999. The items on the agenda\n\ndid not include any proposal to change the name of the association. However, as was the\n\npractice, members were allowed to write in if they wanted any matter to be discussed at\n\nthe AGM.12.    Chew Tong Shing had written in to\n\npropose the same change of the name of the Association.13.    His proposal was put to the members\n\nat this AGM and was carried by a majority of twenty-nine against twenty-three with four\n\nspoilt votes.14.    On 25 January 1999, thirty-two\n\nmembers of the Association wrote to the First Defendant requesting an Extraordinary\n\nGeneral Meeting (‘EGM’) to discuss the change of name and to set out their\n\nreasons for their request. The request was made pursuant to Rule 21 of the\n\nAssociation’s Rules & Regulations (although it referred to Article 21 of the\n\nConstitution).15.    The First Defendant’s reply was\n\ndated 22 March 1999. In essence, the request was rejected although this was put in an\n\nindirect manner. He said that the request would be brought up for discussion at the next\n\nBoard of Directors’ meeting (meaning the next Council meeting) if the parties\n\nrequesting could put forward a more fair and sensible and legitimate proposal. The letter\n\nalso said that if these members were not satisfied, they could lodge their complaint with\n\nthe relevant authorities.16.    By a letter dated 27 March 1999, M/s\n\nJames Chia & Co, acting for thirty-two members (presumably the same thirty-two who had\n\nrequested the EGM), wrote to the Registrar of Societies (‘ROS’) stating that the\n\nnotice of the AGM was in violation of Rule 21 as it did not mention the issue about the\n\nchange of name. They sought ROS’s intervention to require the Council members to\n\nconvene an EGM.17.    ROS replied on 23 April 1999 stating\n\nthat he was in no position to rule on whether the notice of AGM was in violation of Rule\n\n21.18.    ROS also pointed out that under Rule\n\n21.1, an EGM could be convened in response to the written request of at least twenty\n\nmembers of the Association and as the council had not acceded to the request, it was clear\n\nwhat these members needed to do if they wanted an EGM to be convened.19.    However, nothing else was done for\n\nabout a year.20.    By a notice dated 17 March 200, two\n\nmembers, Yu Da Shui (also spelt Yee Tar Swee) and Luo Huan Wen, gave notice of a motion to\n\nrepudiate the previous motion regarding the change of name. This notice was given so that\n\nthe motion could be tabled at the next AGM fixed for 26 March 2000.21.    This notice was followed by another\n\nletter dated 23 March 2000 to amend the earlier notice to include four more words.22.    By a letter also dated 23 March\n\n2000, the First Defendant replied to the notice dated 17 March 2000. He pointed out, inter\n\nalia, that the change of name had been decided upon at the last AGM. He said that that\n\ndecision was final. The letter also said that if these members were not satisfied, they\n\ncould proceed by legal means to establish that the change of name was illegal.23.    At the AGM on 26 March 2000,\n\npandemonium broke out.24.    Yu Da Shui took exception to the\n\nrefusal to table the motion which he and another member had requested and the First\n\nDefendant was asked to explain. Some members were protesting and cursing the First\n\nDefendant and they sought to impeach him.25.    The First Defendant claimed that he\n\nthen adjourned the meeting and left. The Second and Third Defendants left with him.26.    The Defendants alleged that they did\n\nnot hear the First Defendant say anything about adjourning the meeting although he said\n\nthat he could no longer chair the meeting and left.27.    The Defendants also alleged that\n\nafter the First to Third Defendants had left, the AGM repudiated the earlier change of\n\nname in 1999, removed the First Defendant as President and elected the First Plaintiff as\n\nPresident.28.    By a letter dated 28 March 2000, the\n\nFirst Defendant wrote to all Council members calling for a Council meeting on 5 April 2000\n\nto discuss a date for the adjourned AGM held on 26 March 2000.29.    By a letter dated 20 March 2000, the\n\nFirst Plaintiff wrote to the First Defendant stating that the latter was no longer the\n\nChairman and Director (meaning the President and Council member) of the Council as he had\n\nbeen ousted on 26 March 2000.30.    By a letter dated 4 April 2000,\n\nfourteen Council members (out of twenty-three) wrote to the First Defendant stating that\n\nthe AGM held on 26 March 2000 was legally binding. Presumably they meant that the\n\nresolutions purportedly passed after the Defendants had left the AGM were legally binding.\n\nThe letter also stated that there was no reason to attend the Council meeting convened by\n\nthe First Defendant for 5 April 2000.31.    On 25 April 2000, the First\n\nDefendant issued a notice calling for a Council meeting to be held on 3 May 2000 to\n\ndiscuss fixing the date to hold the adjourned AGM. A note to this notice stated that\n\naccording to the practice of societies if such a meeting fails twice, then at the third\n\nmeeting, half an hour’s waiting time would be provided if there were insufficient\n\nCouncil members, after which the meeting would proceed.32.    In response, the First Plaintiff did\n\non 3 May 2000 summon an EGM of Council members to discuss various matters including the\n\nconfirmation of resolutions purportedly passed on 26 March 2000 regarding the change of\n\nname of the Association from ‘Gong Hui’ back to ‘She’ and the removal\n\nof the First Defendant as President and the election of the First Plaintiff as President.\n\nOne other item was to discuss the use of the funds of the Association by the First\n\nDefendant or others who supported him to meet legal costs of matters arising out of the\n\nAGM held on 26 March 2000. Another item was to declare that the notice of 25 April 2000\n\nissued by the First Defendant invalid.33.    On 3 May 2000, the fireworks\n\ncontinued. The First Defendant purported to chair and conduct the meeting which he had\n\ncalled. He proposed the motion to fix the date of the adjourned AGM. The First Plaintiff\n\nasked for a vote on the motion. The First Defendant rejected the need for a vote. However,\n\nthe First Plaintiff insisted on a vote and eleven Council members voted against the\n\nadjourned AGM. It is not clear to me how many voted for the motion.34.    The First Defendant then announced\n\nthat he was sacking the First Plaintiff and all those who had voted against having the\n\nadjourned AGM for failing to comply with his direction as President. He tore the notice\n\ndated 3 May 2000 from the First Plaintiff. He then called his meeting to a close.35.    The First Plaintiff then carried on\n\nwith the Council meeting which he had purportedly convened and resolutions were\n\npurportedly carried out at this Council meeting in accordance with the First\n\nPlaintiff’s notice dated 3 May 2000. The First Defendant and his supporters remained\n\nin the vicinity but apparently did not participate in the First Plaintiff’s meeting.36.    By a notice dated 9 May 2000, the\n\nFirst Defendant summoned the dissenters to a disciplinary hearing on 17 and 18 May 2000.37.    This led to the initiation of this\n\naction on or about 17 May 2000. The Plaintiffs also sought an injunction to restrain the\n\nDefendants from holding the disciplinary hearing until after trial or further order. The\n\nHigh Court granted the injunction on 17 May 2000. This injunction is not the subject of\n\nthe subsequent application heard by me and I need say no more about it.38.    Following this injunction, there\n\nwere further steps and correspondence.39.    On 8 June 2000, the Ninth Plaintiff\n\ndiscovered that the First to Third Defendants had issued or caused to be issued two\n\ncheques for a total of $19,500 in favour of M/s Lourdes Chen & Lee.40.    On 10 June 2000, the First Defendant\n\nissued a notice to members of the Association to continue with the AGM held on 26 March\n\n2000. The notice fixed the adjourned AGM on 25 June 2000. Under the Agenda, it was stated\n\nthat no resolution had been proposed by members.41.    By a letter dated 14 June 2000, M/s\n\nHee Theng Fong & Co (who act for the Plaintiffs) wrote to M/s Lourdes Chen & Lee\n\n(who act for the Defendants). They said that the fixing of the adjourned AGM on 25 June\n\n2000 was contrary to the resolution of the Council on 3 May 2000 (at the meeting convened\n\nby the First Plaintiff).42.    In any event, they proposed six\n\nmotions for the adjourned AGM. M/s Lourdes Chen & Lee replied on 15 June 2000 and\n\nrejected the request. One of the points that they took was that the adjourned AGM should\n\nnot include any new item.43.    As a consequence, the Plaintiffs\n\nmade another application to court. This was the application filed on or about 20 June 2000\n\nseeking to restrain the Defendants from continuing with the adjourned AGM on 25 June 2000\n\nunless the six motions were included at the adjourned AGM.44.    As I have mentioned, the Court did\n\non 20 June 2000 grant the order sought.45.    It is to be noted that this order\n\nwas a mandatory order in a limited sense. It only required the Defendants to table the six\n\nmotions if the Defendants were continuing with the adjourned AGM. Thus, if the Defendants\n\ndid not continue with the adjourned AGM, the six motions need not be tabled.46.    However, on 21 June 2000, the\n\nPlaintiffs’ solicitors issued a notice to the members of the Association stating that\n\nthe (adjourned) AGM would be held on 25 June 2000 and setting out the six motions.47.    As a consequence, the Defendants\n\nthen applied on 23 June 2000 for an injunction to restrain the Plaintiffs from holding or\n\nproceeding with the adjourned AGM until trial or further order.48.    The Defendants took the point that\n\nthe notice from the Plaintiffs’ solicitors dated 21 June 2000 was unconstitutional\n\nand wrong for the following reasons:(a) Under Rule 21 of the Rules and Regulations, the\n\n  general meeting can only be summoned by the President and no one else. Neither the\n\n  Plaintiffs’ solicitors nor any of their clients not being the President of the\n\n  Association have the power nor authority to call for the aforesaid general meeting.(b) Notice of the aforesaid general meeting must be given\n\n  to members at least 2 weeks prior to the meeting. In this instance, the purported Notice\n\n  does not have the pre-requisite notice period.49.    The Defendants said that since the\n\n20 June 2000 order, they were not intending to hold the adjourned AGM (fixed for 25 June\n\n2000) but had to apply to court to restrain the Plaintiffs from proceeding with it.50.    Therefore, the parties had reversed\n\ntheir positions. The Defendants who had wanted to proceed with the adjourned AGM on 25\n\nJune 2000 no longer wanted to do so and the Plaintiffs who had taken the position that\n\ncertain resolutions had already been passed now wanted the adjourned AGM to proceed\n\nprovided the six motions were tabled at the adjourned AGM.51.    On 24 June 2000, the High Court\n\nrestrained the Plaintiffs from proceeding with the adjourned AGM presumably in the light\n\nof the technical objections raised by the Defendants. However, the court ordered that the\n\nadjourned AGM be adjourned to a date no later than 24 August 2000. This was to enable\n\nsufficient notice to be given to all members of the next meeting date and of the six\n\nmotions to be tabled.52.    The Court also ordered the First\n\nDefendant to convene and hold the adjourned AGM as the purported President of the\n\nAssociation.53.    Subsequently the order of 24 June\n\n2000 was amended to reflect the court’s intention. The amendment is not material for\n\npresent purposes.54.    Not being satisfied with the order\n\nof 24 June 2000, the Defendants launched another counter-attack on 1 August 2000 by filing\n\nthe application to discharge the Order of Court dated 20 June 2000 and paragraph 4 of the\n\nAmended Order dated 24 June 2000, alternatively that paragraph 4 of the Amended Order be\n\nvaried to exclude the six motions from being tabled at the adjourned AGM.55.    At that time, notice of the meeting\n\nof the adjourned AGM had still not been given by the First Defendant to the members of the\n\nAssociation, no doubt because he had hoped that the Defendants’ application would be\n\nsuccessful before notice to members had to be given of the adjourned AGM and the six\n\nmotions to comply with the 24 August 2000 dead-line.56.    When the application first came up\n\nfor hearing before me on 7 August 2000, the Defendants sought an adjournment to file an\n\naffidavit or affidavits in response to those recently filed for the Plaintiffs on 5 August\n\n2000 and an urgent hearing date thereafter. They also sought a suspension of the earlier\n\norders on 20 and 24 June 2000 regarding the dead-line to hold the meeting by 24 August\n\n2000 pending the hearing of the application as the notice for the adjourned AGM had to be\n\ngiven very soon to meet that dead-line.57.    I granted the Defendants an\n\nadjournment and an urgent hearing date thereafter but did not order a suspension of the\n\nearlier orders as to do so would effectively mean that the six motions would not be tabled\n\nat the adjourned AGM on 24 August 2000 or that the adjourned AGM would not take place on\n\n24 August 2000, thus circumventing the earlier orders even before I had heard the\n\napplication.58.    After all affidavits had been filed,\n\nthe application was heard on 18, 19 and 21 August 2000. On 21 August 2000, I dismissed the\n\napplication.",
        "Defendants’ reasons for their\n\napplication before me": "59.    The Defendants alleged that there\n\nwas deliberate and/or reckless non-disclosure of material facts by the Plaintiffs.60.    Assuming that there was material\n\nnon-disclosure, the principles of law on the effect of such non-disclosure were not\n\ndisputed. They have been recently reiterated by the Court of Appeal inTay Long Kee\n\nImpex Pte Ltd v Tan Beng Huwah t/a Sing Kwang Wah(2000) 2 SLR 750.61.    In brief, once material\n\nnon-disclosure is established, the court has a discretion to discharge the interlocutory\n\ninjunction. All the more so if it is deliberate. However, the court still retains a\n\nresidual discretion, in such circumstances, whether to continue the ex parte injunction or\n\nto grant a fresh one.62.    The existence of this discretion\n\nmust not, of course, undermine the principle that it is the duty of a party who seeks an\n\nex parte application to make full and frank disclosure of all material facts, including\n\nthose which may be used against him.63.    It all depends on the nature of the\n\nnon-disclosure and the circumstances of each case and the test of the ‘lower risk of\n\ninjustice’ should be considered.64.    I would reiterate that the order of\n\n24 June 2000 was not made on the Plaintiffs’ application but on the Defendants’\n\napplication although the order made that day was not what the Defendants had sought.65.    Thus, the Plaintiffs had argued,\n\ninter alia, that the Defendants were precluded from making the application which I heard\n\nas they had already made an application which was heard by the court on 24 June 2000. On\n\nthe other hand, the Defendants said they had not had sufficient time to present full facts\n\nand arguments as they were reacting to the order of 20 June 2000 and the Plaintiffs’\n\nconduct of 21 June 2000 in stating that the meeting of 25 June 2000 would continue with\n\nthe six motions.66.    While there was some similarity in\n\nthe two applications, I did not think that the Defendants were precluded from making the\n\napplication before me especially in view of the tight time frame in which they had to\n\nreact. However what they should have done was to alert the court then that in view of the\n\ntight time frame, they were not able to file a more comprehensive affidavit and would seek\n\nto do so some time in the near future with the view of presenting more arguments before\n\nthe court.67.    The Defendants’ first\n\nallegation of non-disclosure was that the Plaintiffs were wrong to assert that the Chinese\n\nversion of the Rules and Regulations of the Association takes precedence over the English\n\nversion. The argument was that the Plaintiffs had failed to disclose that:‘(i) only the English version of the\n\n  Rules and Regulations are approved by the Registrar of Societies;(ii) the Chinese version of the Rules and Regulations are\n\n  translated from the approved English version and that todate, there are at least 4\n\n  unofficial Chinese versions;(iii) under the Societies Act, the Association’s\n\n  Rules have (sic) to be prior approved by the Registrar and that only the English\n\n  version is approved;(iv) (sic) purporting to remove the President of\n\n  the Association under the Chinese version of the Rules when the official English version\n\n  only provides for censure;(v) (sic) purporting to validate the convening of\n\n  the Extraordinary Council Meeting on 3rdMay 2000 by the 1stPlaintiff and his other 10 Council Members (the other 10 Plaintiffs) under the Chinese\n\n  version of the Rules when the official English version does not give them such powers or\n\n  authority.’68.    The Defendants seemed to think that\n\nbecause the English version of the Rules and Regulations is approved by the ROS, that\n\nversion must necessarily prevail. I did not agree.69.    There was also a dispute as to\n\nwhether the Chinese version was translated from the English version or vice versa.70.    The fact that there were four\n\nChinese versions was neither here nor there because the material parts of the Chinese\n\nversions were not inconsistent inter se. Furthermore, the existence of the four Chinese\n\nversions did not necessarily mean that they were all translated from the English version\n\nfirst.71.    As regards the Defendants’\n\nargument that the English version provided for censure of the President, contrary to the\n\nChinese version, the English version states:‘6. GENERAL MEETINGGeneral Meeting is the highest authority\n\n  of the Association which has the power to pass or revise the Rules and Regulations of the\n\n  Association, to elect the officer-bearers, to supervise, censure the Presidents and\n\n  Offices Bearers as well as approve the annual budget, to propose or adopt all the\n\n  proposals aimed at developing the Association.’72.    The English translation of the\n\nChinese version states:‘Article 7: General Meeting:General Meeting is the highest authority\n\n  of the association. It can adopt or amend the Constitution of this association, monitor,\n\n  impeach the Chairman and Directors, approve the Annual Budget as well as propose and adopt\n\n  all proposals for the development of our association.’73.    Leaving aside the difference in\n\nnumbering between the two versions which did not appear material to the parties, the\n\nDefendants argued that the English version only allowed censure of the President whereas\n\nthe English translation of the Chinese version allowed him to be impeached.74.    In so far as the Defendants were\n\nrelying on non-disclosure on this point, I did not accept their argument. The Plaintiffs\n\ndid disclose both the English version and the Chinese version (and the English translation\n\nthereof). Indeed the English version is in the first page of the exhibits to the first\n\naffidavit filed for the Plaintiffs on 17 May 2000.75.    The Plaintiffs took the position\n\nthat the Chinese version superceded the English version and although the Defendants\n\ndisagreed, this point, if still material, could be resolved by the court later but it did\n\nnot mean that the Plaintiffs must accept the Defendants’ position.76.    However, there was a more important\n\nconsideration. Both sides thought that the President could only be removed under the\n\nChinese version because it used the word ‘impeach’ instead of\n\n‘censure’.77.    I was of the view that neither of\n\nthese words allow the General Meeting to remove the President. All the arguments over the\n\nEnglish and Chinese version were therefore unnecessary.78.    However, as the General Meeting had\n\npower to elect office-bearers, I was of the view that it must also have the implied power\n\nto remove such office-bearers, see Halsbury’s Laws of England (Fourth Edition) Volume\n\n9 at para 1266 andChen Cheng & Anor v Central Church & another(1996) 1\n\nSLR 313.79.    Furthermore, the General Meeting is\n\nthe highest authority of the Association which has the power to pass or revise the Rules\n\nand Regulations of the Association. Accordingly, it could pass a resolution to remove the\n\nPresident as an ad hoc revision of the Rules and Regulations.80.    The purpose of such a provision was\n\nto allow the General Meeting to do anything, within the law, provided adequate notice had\n\nbeen given to all members. The concern about adequate notice was already addressed by the\n\ncourt when it postponed the adjourned AGM to a date not later than 24 August 2000.81.    The argument about the validating of\n\nthe convening of the Extraordinary Council Meeting on 3 May 2000 by the First Plaintiff\n\nwas not a material argument.82.    The second and third grounds of\n\ncomplaint by the Defendants about non-disclosure were that the Plaintiffs:‘b) has asserted that Mr Chew Tong\n\n  Shing attended the Council Meeting on 15 November 1998 when he (sic) not a council\n\n  member and that the Council Meeting voted against his proposal for the change of name when\n\n  they knew at all times and have failed to disclose that ….:(i) Mr Chew Tong Shing is (sic) a Honorary Advisor\n\n    to the Association and that he is well entitled to attend the Council Meeting in that\n\n    capacity;(ii) Mr Chew Tong Shing was merely trying to get the\n\n    Council Meeting to agree to propose the change of name as a \"Council Member’s\n\n    Proposal\";(iii) The Council Meeting in any event does not have the\n\n    powers or authority to pass any motion to change the name of the Association when that\n\n    power and authority is reserved to the general meeting ….’,and‘c) The Plaintiffs had asserted that\n\n  despite the above, the Defendants allowed Mr Chew to make the proposal to change the name\n\n  of the Association by way of \"Member’s Proposal\" at the general meeting on\n\n  10thJanuary 1999 and passing the resolution without giving a proper notice for\n\n  the AGM in respect of the change of name as it is a serious and unusual matter when they\n\n  knew at all times and have failed to disclose that …. :(i) the Association has always given notice of their AGMs\n\n    in a standard format without much significant change for many years of their existence\n\n    without any protest from the members, including the Plaintiffs;(ii) the Association has an established practice whereby\n\n    members may make proposals to be tabled at the next AGM provided that the proposal is sent\n\n    to the Association and approved by the President, whereupon, the said Member’s\n\n    proposal will then be written on a white board on the stage at the AGM to be discussed and\n\n    voted upon by the general meeting;(iii) the Association had in 1991 undergone a change of\n\n    name when Mr Yee Tar Swee (the Plaintiff in Suit No. 393/2000 - a similar and related\n\n    matter) was the President of the Association and how that change of name was\n\n    effected….’83.    I did not think it was material that\n\nChew Tong Shing was an Honorary Advisor. Furthermore, I had some doubt as to whether as\n\nHonorary Advisor he was ‘entitled’ to attend a Council meeting. In any event,\n\nwhether he was entitled to attend or not was also not material.84.    The crux of the Plaintiffs’\n\ncomplaint regarding the background, and as stated in the 1staffidavit of 17\n\nMay 2000, was that a motion to change the name of the Association was tabled in the 1999\n\nAGM without adequate notice to members.85.    This brings me to the third ground\n\nof complaint of non-disclosure.86.    The Plaintiffs did not inform the\n\ncourt that the manner in which the motion (to change the name of the Association) was\n\ntabled in the 1999 AGM was the way in which any other motion, not already on the agenda,\n\nwas tabled i.e any member could give notice of his intended motion by a dead-line and that\n\nmotion would be put up on a white board at an AGM for all attending members to see and\n\nsubsequently discuss and vote thereon. This was not a satisfactory procedure as other\n\nmembers who did not attend the AGM would not know of any new motion being proposed by any\n\nmember. However that was the practice.87.    Indeed, in 1991, a change of name\n\nwas proposed and carried out in the same manner.88.    Plaintiffs’ Counsel submitted\n\nthat the change in name in 1991 was not a material change whereas in 1999 it was a\n\nmaterial change.89.    However that was not the point. The\n\npoint was whether the practice of the Association had been followed for the change of name\n\nin 1999. Apparently it was, whereas the Plaintiffs had given the impression that it was\n\nnot and that the events leading to the change in 1999 were done in some sort of\n\nsurreptitious manner.90.    I found that the omission was\n\nmaterial in the context of how the Plaintiffs had painted the Defendants out to be. Even\n\nif it was not deliberate as there was obviously much sound and fury, it was reckless.91.    However, Plaintiffs’ Counsel\n\nsubmitted that the court was still correct in granting the mandatory injunctions on 20 and\n\n24 June 2000 because the Plaintiffs were not relying so much on the alleged unconscionable\n\nconduct of the Defendants but on the right of members to decide anything, within the law,\n\nat an AGM. In other words, whether the Defendants had acted within the practice of the\n\nAssociation or not regarding the change of name in 1999, it was open to the AGM to pass\n\nyet another resolution in the year 2000 to change the name back to its pre-1999 name. I\n\nagreed. Notwithstanding the Plaintiffs’ non-disclosure, the court would have allowed\n\nthe motion on the change of name to be tabled at the next AGM. In any event, I was\n\nprepared to allow this.92.    The fourth ground of alleged\n\nnon-disclosure was that the Plaintiffs had asserted:‘d) that the Defendants have breached\n\n  the rules of Regulations of the Association in rejecting the request of 32 of its members\n\n  for (sic) a EOGM to repudiate the earlier resolution for the change of name and\n\n  that the Defendants have thus acted improperly and wrongfully when they knew at all times\n\n  and have failed to disclose that ….:(i) a Council Meeting was held on 14thMarch\n\n    1999 whereby it was the collective decision to ask the 32 members to clarify and\n\n    substantiate their request to the Council before the Council would consider it and that as\n\n    such, at no time was the request refused as alleged;(ii) a total of six of the Plaintiffs were present in the\n\n    said Council Meeting held on 14thMarch 1999 where this decision was reached;(iii) the 9thand 10thPlaintiffs\n\n    have now filed an affidavit on 5thAugust 2000 to affirm that the Council never\n\n    rejected the 32 member’s request (see paragraph 5 therein);(iv) in any event, it is the Defendant’s submission\n\n    that the 32 member’s request is called to suspicion because (a) 5 of the\n\n    member’s signature are different from the Association’s records; and (b) 9 of\n\n    the member’s records cannot be traced ….’93.    I was of the view that the request\n\nwas effectively refused (see paragraph 15 above).94.    Also, the real reason for the\n\nrejection was not any suspicion of the authenticity of certain signatures.95.    The Defendants’ main argument\n\non this ground was that it was for the Council members to convene an EGM of members and\n\nthe Council had decided not to do so (although apparently this was not a unanimous\n\ndecision).96.    The basis of the Defendants’\n\nmain argument was Rule 21.2. The English version states:‘2. Council Meeting --- Council\n\n  Meeting shall be held once very two months. The Council Meeting shall be summoned by the\n\n  President. If necessary, anExtraordinary General Meeting of Membersmay be\n\n  convened in response (sic) of the written requests of at least one-thirdof the\n\n  Council members. Fourteen members of the Council members shall form a quorum. Notice\n\n  of Council Meeting shall be given to members not less than one week before the date of the\n\n  Meeting together with the agenda by the president. If the number of members present is\n\n  insufficient to form a quorum, a time grace of half an hour will be given. If there are\n\n  still insufficient members to form a quorum, the Meeting shall be adjourned to another\n\n  date.’[Emphasis added.]97.    The Defendants said that under Rule\n\n21.2, the thirty-two members were not entitled to call for an EGM of members and only\n\none-third of the Council members could do so.98.    The Plaintiffs on the other hand\n\nsaid that the Chinese version of Clause 21.2 allowed members to call an EGM of members.99.    In my view, the parties had again\n\nmade much over the wrong provision.100.    The relevant provision was Rule\n\n21.1 (and not 21.2) which, even under the English version (which was relied upon by the\n\nDefendants), states:‘Rules No. 21 - Meeting1. General Meeting - annual General\n\n  Meeting shall be held once a year in January/February. The Meeting shall be summoned by\n\n  the president. Whenever necessary,an extraordinary General meeting may be convened in\n\n  response (sic) of the written requests (sic) by at least twenty members of\n\n  the Association. At least fifty members shall form a quorum for a General Meeting. Two\n\n  week prior to the date of the Annual General Meeting and the extraordinary General\n\n  Meeting, notice shall be given to the members together with the agenda by the President.\n\n  In the event of there being no quorum present at a General Meeting, one hour grace will be\n\n  given. If there is still an absence of quorum after the one-hour-grace, the meeting shall\n\n  still be convened irrespective of the absence of the quorum, however, they have no power\n\n  to alter, amend or make additions to any of the existing Rules and Regulations.’[Emphasis added.]101.    I would add that the ROS had\n\nalready drawn attention to Rule 21.1 (and not 21.2) when he replied on 23 April 1999 to a\n\nletter sent by the Plaintiffs (see paragraph 18 above).102.    Therefore that part of Rule 21.2,\n\nwhich was relied upon by the Defendants, was clearly an error. It applied not to EGMs of\n\nmembers but of Council members and two-thirds of the Council members may request an EGM of\n\nCouncil members.103.    In any event, even if the\n\nDefendants were correct about members not being entitled to call for an EGM of members,\n\nthis was immaterial. The Plaintiffs were not seeking a mandatory injunction to hold an EGM\n\nin 1999. They had waited one year till 2000 to table a motion for the change of name at\n\nthe next AGM.104.    The fifth ground of non-disclosure\n\nrelied on by the Defendants did not apply to the application before me and so it was not\n\npursued by Defendants’ Counsel.105.    The sixth ground of non-disclosure\n\nrelied on by the Defendants was that the Plaintiffs had asserted:‘f) that the 1stDefendant\n\n  (sic) have acted improperly and wrongfully in refusing the inclusion of the motion\n\n  proposed by Mr. Yee Tar Swee to repudiate the previous resolution when they knew at all\n\n  times and have failed to disclose that….:-(i) although it was well within the powers of the 1stDefendant to reject Mr Yee Tar Swee’s proposal as a President of the Association, he\n\n    nonetheless called an urgent Council Meeting on the 22ndMarch 2000 to discuss\n\n    the same;(ii) the Council meeting could not go on as there was (sic)\n\n    lack of quorum (only 13 Council members attended) but the same proceeded as a Council\n\n    Discussion. After all due deliberations, the 13 Council Members collectively decided to\n\n    reject Mr Yee Tar Swee’s proposal;(iii) the 6thand 11thPlaintiff (sic)\n\n    was present in the said Discussion and both of them were similarly (sic) not in\n\n    approval of Mr Yee Tar Swee’s proposal….’106.    The main crux of the\n\nDefendants’ argument on this point was that any motion proposed to be tabled at an\n\nAGM was still subject to approval by the President. They said that this was the practice\n\nalthough apparently the President had never exercised this veto power before.107.    In my view, the Defendants have not\n\nestablished that the President has a veto power by practice which, if established, would\n\nmean that he can prevent a motion from being considered by members simply by exercising\n\nthat power.108.    I would add that the Council also\n\nhad no power to prevent a motion from being put before the AGM if it was properly raised.\n\nTherefore the omission to mention what had transpired at the Council meeting to consider\n\nthe motion from Yee Tar Swee was not a material omission in any event.109.    The seventh ground of\n\nnon-disclosure alleged by the Defendants was that the Plaintiffs had asserted:‘g) that the 1stDefendant\n\n  did not adjourn the general meeting on 26thMarch 2000 and that accordingly, Mr\n\n  Yee Tar Swee was entitled to be elected temporary chairman of the meeting and to go on\n\n  with the general meeting on 26thMarch 2000 to validly pass all the\n\n  resolutions, the subject of which is comprised, inter alia, in the six motions which is\n\n  the subject matter of this application when they knew at all times and failed to disclose\n\n  that….:(i) the 1stDefendant did call the general\n\n    meeting to an end and adjourned after the chaos created by Mr Yee Tar Swee and his\n\n    supporting members;(ii) Mr Yee Tar Swee who is neither the President or\n\n    Vice-President of the Association is not entitled under the Rules and Regulations to chair\n\n    any general meeting for that matter;(iii) Mr Yee Tar Swee who is an undischarged bankrupt is\n\n    not allowed to hold any post in the Association, let alone be the chairman of the general\n\n    meeting;(iv) The resolutions purportedly passed by the general\n\n    meeting were not on the agenda of the general meeting and no due notice was given;(v) The English version of the Rules and Regulations of\n\n    the Association does not provide for removal of the President but only to censure the\n\n    President;(vi) The general meeting only has power to elect Council\n\n    Members but not elect them to specific posts. By the past precedence of the Association\n\n    since inception, all elected Council members will elect amongst themselves to the\n\n    different posts of the Association.’110.    The short answer to this objection\n\nis that the court had by its orders of 20 and 24 June 2000 directed that the adjourned AGM\n\nbe convened by 24 August 2000 so that all the members could be given adequate notice of\n\nthe six motions. In other words, it was like a new AGM. The six motions to be tabled at\n\nthe adjourned AGM included the three motions which were purportedly passed on 26 March\n\n2000 regarding:(a) the change of name back to the pre-1999 name,(b) the removal of the First Defendant as President,(c) the election of the First Plaintiff as President.111.    The fourth motion was to ratify\n\nwhat was done at the AGM of 24 June 2000 after the AGM was allegedly adjourned.112.    It was therefore for the members to\n\ndecide at the adjourned AGM whether they wanted those three motions to be carried or not\n\nand put an end to the objections raised regarding the passing of the three motions on 26\n\nMarch 2000.113.    I have already dealt with the\n\nquestion whether the General Meeting can remove the President and need only address one\n\nother argument of the Defendants on this point.114.    The Defendants argued that the\n\nGeneral Meeting only had power to elect Council Members who would then elect among\n\nthemselves the officials of the Association. Even if that was true, I have already\n\nmentioned that the General Meeting is the highest authority of the Association. It can\n\npass whatever resolution it wants, within the law, and provided sufficient notice is given\n\nto all members.115.    The eighth ground of non-disclosure\n\nalleged by the Defendants was that the Plaintiffs had asserted:‘h) that the 1stPlaintiff\n\n  is capable of calling (sic) a Extraordinary Council Meeting on the 3rdMay 2000 to pass and ratify essentially all the resolutions which were passed at the\n\n  general meeting held on 26thMarch 2000 and chaired by Mr Yee Tar Swee when\n\n  they knew at all times and failed to disclose that….:(i) under the Association’s Rules and Regulations,\n\n    only the President can call for a Council Meeting and the 1stPlaintiff being\n\n    only a vice-president of the Association does not have such powers or authority;(ii) all the eleven Plaintiffs have attended the Council\n\n    Meeting chaired by the 1stDefendant and have partook in the same until the 1stDefendant closed the Council Meeting after having finished all the business on the agenda,\n\n    whereupon, the 1stPlaintiff then proceeded to purportedly hold his own Council\n\n    Meeting thereafter amongst eleven of the Council members only, who are the Plaintiffs\n\n    herein;(iii) the Council Meeting purportedly chaired by the 1stPlaintiff lacked the necessary quorum of 14 Council members….’116.    This allegation depends on whether\n\nthe First Defendant was still President after 26 March 2000 which in turn depended on\n\nwhether the three motions purportedly passed that day were valid.117.    In my view, whether the First\n\nPlaintiff was in a position to call an Extraordinary Council Meeting on 3 May 2000 or not\n\nis immaterial. The court had directed that the adjourned AGM scheduled for 25 June 2000 be\n\npostponed to another date no later than 24 August 2000 so that all members could receive\n\nsufficient notice of the six motions and not because the First Plaintiff had validly\n\ncalled an Extraordinary Council Meeting on 3 May 2000.118.    The ninth ground of alleged\n\nnon-disclosure did not pertain to the application before me.119.    The Defendants also argued that the\n\nsix motions would perpetrate the wrongful and unconstitutional acts of the Plaintiffs on\n\n26 March 2000. I did not agree. The first four of the six motions, when tabled at the\n\nadjourned AGM on 24 August 2000, were to put an end to the argument whether the\n\nresolutions passed on 26 March 2000 had been validly passed.120.    The Defendants also argued that no\n\nreason was given to repudiate the earlier motion in 1999 on the change of name and to do\n\nso in 2000 would disregard the wishes of the members who attended the AGM in 1999.121.    This was an argument without merit.\n\nNo reason needs to be given for any resolution although the reality is that reasons would\n\nprobably be given at the meeting if the proposers hope to have it passed then.\n\nFurthermore, a subsequent meeting, properly convened, can always make decisions\n\nsuperceding what had been decided earlier, leaving aside third parties’ rights for\n\nthe time being.122.    It is ironical that the Defendants\n\nshould argue that the wishes of the members who attended the 1999 AGM would be\n\ndisregarded.123.    In the first place, not all the\n\n1999 members were aware that a motion would be proposed in 1999 to change the name. Only\n\nthose who attended the 1999 AGM were aware. Indeed that was the crux of the\n\nPlaintiffs’ complaint (even though the manner in which the motion was put to the 1999\n\nAGM was in accordance with the practice of the Association).124.    With the adjourned AGM being held\n\nby 24 August 2000, sufficient notice would be given to all members, and not just to those\n\nwho attended the 1999 AGM.125.    In addition, as Plaintiffs’\n\nCounsel had stressed, the Plaintiffs were not asking the court to compel the members to\n\nvote for or against any particular motion but simply to allow the six motions to be\n\ntabled.126.    It was the Defendants who were\n\nseeking to avoid the wishes of the members by raising various technical objections to stop\n\nthe six motions from being tabled.127.    The Defendants’ argument that\n\nthe Association had conducted its business based on the change in name in 1999 is also\n\nwithout merit. A further change in name, even if it is with retrospective effect, has no\n\neffect on transactions already entered into by the Association.128.    I now come to the Defendants’\n\nobjections to the fifth and sixth motions being tabled.129.    As regards the fifth motion, the\n\nDefendants said that:‘- the motion is ultra vires and\n\n  wrongful as under the Rules and Regulations, the President has powers to approve expenses\n\n  up to the limit of $20,000.00 and the said expenditure of $19,500.00 was duly approved by\n\n  the 1stDefendant acting under the powers given to him as the President ….- the expenditure is properly expended\n\n  with valid supporting vouchers and documents duly approved by all the relevant office\n\n  bearers of the Association;- the motion is wrongful as the 1stto 3rdDefendants were in this instance sued in the capacity of their office in\n\n  the Association and not in their respective personal capacity and that accordingly, the 1stto 3rdDefendants are entitled to an implied indemnity in law ….- the motion is wrongful as the\n\n  Association is also a Defendant in this action and would therefore have to be liable for\n\n  legal costs incurred herein;- the Council Meeting on the 16thAugust 2000 has already passed the resolution to approve the utilization of the (sic)\n\n  Associations funds for this action up to the limit of $50,000.00 in accordance with the\n\n  powers given under the Rules and Regulations of the Association;- the Court has on 12thJuly\n\n  2000 refused to make the Order on the (sic) Plaintiffs application to injunct the\n\n  Defendants from utilizing funds belonging to the Association for the purposes of this\n\n  Suit;- there is no basis in fact or in law as\n\n  disclosed in the Plaintiffs’ affidavits filed herein to substantiate their allegation\n\n  that the utilization of the $19,500.00 was improper.’130.    I was of the view that the point\n\nwas not so much whether the President had power to approve such an expense and so on but\n\nwhether the use of the funds for the purpose mentioned was an abuse of power.131.    It may well be that the use of\n\nfunds was not wrongful. In any event, that was a question for the court to decide.132.    However if the Plaintiffs wanted to\n\nmake a point at an AGM I did not see why they should be stopped from doing so.133.    As for the Defendants’\n\nargument that the court did refuse on 12 July 2000 to injunct the Defendants from using\n\nthe Association’s funds for the suit, that did not stop members from putting the\n\nquestion up for discussion and voting on it.134.    As regards the sixth motion, the\n\nDefendants argued that:‘- The Court has already by way of an\n\n  earlier order changed the action into a representative action and thus this motion is\n\n  redundant and academic;- The Association is also a party to both\n\n  actions as the 4thDefendants (sic) as thus this motion is redundant and\n\n  academic;- The statement of claim as filed herein\n\n  clearly shows that the nature of this action against the 1stto 3rdDefendants herein are in their capacity as office bearers of the Association and not in\n\n  their personal capacity and thus this motion is wrongful.’135.    Again I was of the view that if the\n\nPlaintiffs wanted to table the sixth motion for consideration by the members, they should\n\nnot be stopped. Indeed they run the risk that if the members reject the motion, then their\n\nrepresentative action might be in jeopardy.136.    I was also informed that the\n\nPlaintiffs intended to apply for the Association to be added as a co-plaintiff and to be\n\ndeleted as a defendant.137.    As regards whether the First to\n\nThird Defendants should be sued in their personal capacity, any motion passed on this\n\npoint was not binding on the court.138.    It appeared to me that the fifth\n\nand sixth motions were introduced to give moral support to the Plaintiffs and to condemn\n\nthe Defendants and not so much because they had any legal effect.139.    The Defendants also argued that the\n\nsix motions were sub-judice. I did not agree. If they were right, no mandatory injunction\n\ncould ever be granted because of the argument that the subject matter of the injunction\n\nwas before the court.140.    At the end of the day, I also had\n\nto take into account the fact that three of the motions had already been purportedly\n\npassed. There was a dispute whether they had been validly passed and pending the\n\nresolution of the dispute both camps were acting on different bases.141.    The name of the Association was\n\nbeing disputed. The Defendants acted on the basis that it had not been changed back to the\n\npre-1999 name whereas the Plaintiffs acted on the basis that it had.142.    Furthermore, the First Defendant\n\nwas acting on the basis that he was still the President while the First Plaintiff was\n\nacting on the basis that he was the new President.143.    The main arguments of the\n\nDefendants against these motions were technical and could be resolved by having them\n\ntabled and voted on again at the adjourned AGM provided sufficient notice was given.144.    Presumably the court on 20 and 24\n\nJune 2000 was of the view that the best way to resolve these disputes was by letting the\n\nmembers decide rather than let this unsatisfactory state of affairs continue any longer.\n\nNotwithstanding all the arguments vigorously raised by the Defendants before me, I agreed.145.    The fourth motion followed the\n\nfirst three. The fifth and sixth motions were additional ones. As there was going to be an\n\nadjourned AGM with sufficient notice being given to all members anyway, I did not think I\n\nshould divorce the fifth and sixth motions from the first four.146.    If the six motions tabled have been\n\ncarried and if I should be wrong in my tentative conclusions, the resolutions can always\n\nbe set aside by order of court. There is no irreparable damage. In that event, the name of\n\nthe Association would be changed to the post January 1999 name and the First Defendant\n\nwould be reinstated with retrospective effect as the President until such time as he\n\nretires from office. He has no particular benefit such as a source of income from holding\n\nthe position. The extent of the injury to him would have been a slap in the face if the\n\nmotion to remove him has been passed. However, if that resolution is subsequently set\n\naside by order of court, he would be vindicated to the extent of the reason(s) for setting\n\naside the resolution.147.    Likewise for the third and fourth\n\nmotions and for the fifth and sixth motions which affect the other Defendants as well.148.    There is another point I would wish\n\nto make.149.    Neither side was entirely\n\nblameless. However, the First Defendant, as the principal office bearer, and by reason of\n\nhis conduct in trying to shut out the motion to change the name as well as his replies\n\ntelling certain members that they could lodge their complaint with the relevant\n\nauthorities or to proceed by legal means if they were not satisfied (see paragraphs 15 and\n\n22 above), must take the lion’s share of the responsibility for this sad state of\n\naffairs.150.    In any event, both camps should be\n\nacting in the interest of members and the Association but the reality was that each camp\n\nwanted to have its own face. The disputes could and should have been resolved with more\n\ngive-and-take from each camp.Woo Bih LiJudicial CommissionerCopyright © Government of Singapore."
    }
}