{
    "case_title": "Tan Poh Leng Stanley v Tang Boon Jek Jeffrey",
    "ncitation": "[2000] SGHC 260",
    "coram": "G P Selvam J",
    "sections": {
        "The law of functus officio": "The doctrine of functus officio owes its origin to a wider principle expressed in the Latin maxim:Nemo debet bis vexari pro eadem causa(No man should be twice troubled.) The purpose of the principle is finality to dispute resolution. When applied to litigation and arbitration, this principle may take the form of res judicata, issue estoppel and functus officio. Finality may also be reached by the operation of the doctrine of merger and the doctrine of extinction of a cause of action.The meaning and effect of what has been said crystallize into the principle that: Once a matter is finally adjudicated or arbitrated no party bound by it is permitted to reopen it. The court or the arbitrator becomes functus officio. They have exhausted their jurisdiction or mandate as the case may be. A decision in favour of the claimant merges the claim into a judgment or arbitral award. If the claim is disallowed the cause of action is extinguished. There is nothing to adjudicate or arbitrate. The doctrine of functus officio is analogous to the effect of the Statute of Limitation which extinguishes the claim. Under the regime of the Act and the Model Law the original cause of action and the arbitrator have no life after the release of the final award.The doctrine of functus officio is expressed lucidly inRussell On Arbitration(21st Ed, 1997) para 5-235:Proceedings will close after the oral hearings have finished and any post-hearing submissions have been made. Thereafter the tribunal makes its award. Once a final award is made, the tribunal becomes functus officio. This means that its authority to act ceases, the reference terminates and the award cannot thereafter be amended.There are statutory exceptions in Arbitration Acts to the basic rule that once the tribunal has made its final award it becomes functus officio and cannot subsequently amend the award. Section 17 of the English Arbitration Act 1950 for instance conferred the power on the arbitrator to correct in an award any clerical mistake or error arising from any accidental slip or omission.The fact that this is an exception created by statute emphatically affirms the basic rule that the arbitrator has no power to reconsider or make a reversal of the substantive award even if it is perceived to be in error. Any attempt on the part of the arbitrator to confer upon himself such power would be utterly without authority and against the policy, purpose and scope of the Arbitration Acts. The principle and logic are stated in the eloquent words of Spencer Bower, Turner and Handley`sThe Doctrine of Res Judicata(3rd Ed, 1996) at para 128:Where the arbitral tribunal is shown to have acted within, or is not shown to have acted in excess of, its jurisdiction, and the other conditions of a valid res judicata are  established, the award binds the parties and cannot be impeached for error of law or fact. Jurisdiction, for this purpose, does not mean jurisdiction to give a correct decision only. At common law if error in law appeared on the face of the award, or in any memorandum intended to form part of it, it might be set aside, or remitted on the motion of the party aggrieved, except where a specific question of law was submitted, or the tribunal had authority to adjudicate upon a debt of honour, or other matter not cognisable by the courts of law. This jurisdiction was abolished by section 1(1) of the Arbitration Act 1979. The award may be remitted to enable the arbitrator to rectify any mistake of fact apparent on its face, or to which the arbitrator calls attention, and an arbitrator or umpire now has statutory authority `to correct any clerical mistake, or error arising from any accidental slip or omission`. The existence of these powers shows that, unless and until they are exercised, the award, however wrong in law, or mistaken in fact, operates as a res judicata.In the case ofThe Montan[1984] 1 Lloyd`s Rep 389at p 394, Hobhouse J pointed up the point of principle that the power to correct a clerical error must not be converted into a power to reconsider and reverse the substantive decision:It is an exception to the rule that the award as published is final and the arbitrator having made his award is functus officio. This rule is one of fundamental importance. arbitrators cannot be allowed to have second thoughts or to change their minds after making their awards. Such a reconsideration by the arbitrator can only occur if the court has remitted the award to him under the Arbitration Acts. There are very strong reasons of policy which underly this. There must be an end to an arbitration, as to litigation. The exception which s 17 allows is very limited. It in no way allows any change of mind by the arbitrator, nor does it allow the arbitrator to correct mistakes of reasoning or of evaluation or assessment or even of expression.Fidelitas Shipping Co Ltd v V/O Exportchleb[1966] 1 QB 630is authority for the proposition that once the arbitrator has made a formal award on a specific matter he has no power to reconsider that award.The doctrine of finality and functus officio is expressed in art 32 of the Model Law:The arbitral proceedings are terminated by the final award. The mandate of the arbitral tribunal terminates with the termination of the arbitral proceedings, subject to the provisions of arts 33 and 34(4).Article 33 empowers the arbitral tribunal to correct in the award (a) any errors in computation, any clerical or typographical errors or any errors of similar nature; (b) to give an interpretation of a specific point or part of the award; and (c) to make an additional award as to claims presented in the arbitration proceedings but omitted from the award.Article 34(4) provides as follows:The court, when asked to set aside an award, may, where appropriate and so requested by a party, suspend the setting aside proceedings for a period of time determined by it in order to give the arbitral tribunal an opportunity to resume the arbitral proceedings or to take such other action as in the arbitral tribunal`s opinion will eliminate the grounds for setting aside.Article 34 is important. It is the only article in Chapter VII of the Model Law. It provides for recourse against an award. The heading of the section is as follows:Application for setting aside as exclusive recourse against arbitral award.Paragraph 1 of art 34 says that recourse to a court against an atrbitral award may be made only by an application for setting aside in accordance with paras (2) and (3) of this article.There is nothing in the Model Law which authorises the arbitrator to recall or reconsider his award after he has made the final award and his mandate is thereby terminated.The quest for justice under a hierarchical court system can be a long haul. Under it justice inclines now one side and now to another side. Sometimes she makes a full circle and returns to where she started. Model Law regime avoids such vicissitudes entirely. There is no provision for appeals or to recall, reconsider and reverse of a substantive award which the loser perceives to be in error. Furthermore, the scheme and substance of the Model Law are entirely against the court making the substantive decision or investigating the correctness of the decision.",
        "A historical note": "It is fitting moment to make a historical note. It was a time when London was the bastion of transnational arbitration. London`s role as international arbitration and commercial litigation centre was part of its paraphernalia as the foremost financial centre and commercial exchange. It was `a valuable economic asset, part of its capital, although an intangible one`. By the 1970`s, however, foreign parties became disillusioned with English arbitration jurisprudence. This was because of the procedures of stating-a-case for a ruling by the court and the procedure of error of law or fact on the face of the award. Defeated parties used these methods to delay and at times defeat arbitral justice. These interminable procedures were radically different from and unknown to Europe and America. They brought a bad name to London. In the result foreign parties began to avoid London. Paris and New York found much favour. This prompted the English Parliament to pass the Arbitration Act of 1979 to remove the pitfalls mentioned above. It prescribed judicial review in the form of appeals in extremely circumscribed circumstances. Singapore followed suit in 1980: see Act 2 of 1980. The hallmark of the Model Law is that it does not provide for appeals on the merits of an arbitral decision even on points of law. It gives effective force to the doctrine of functus officio in respect of the substantive decision contained in an arbitral award. The powers to recall, reconsider and reverse does not fit in well with the fit of things of the Model Law. It is foreign to the jurisprudence of the Model Law. The omission of the power to recall and reconsider is deliberate. We have accepted the United Nations`s Model Law as the transcending copybook instead of the traditional English precedent. So, the only eyes with which we must view an award made under the Model Law are the eyes of the Model Law and no other law - written or unwritten. We must not go our own way in transnational arbitration.In respect of an arbitration governed by the Act and the Model Law, art 34(4) applies only to an award made before the mandate of the arbitrator is terminated as provided in art 32 and no other. The court has no choice on the matter.",
        "The decision": "The foregoing analysis of the law and facts decrees me to conclude that the March award was made by the arbitrator outside his mandate. It was a nullity and accordingly without any force or effect.The arbitrator, in order to get around the lack of power and the fact of functus officio wrote his own writ. He admitted that there was no provision in the Act or the Model Law which enabled him recall and reverse the award. But, he said, he had the power because `It is inconceivable that the law or public policy would permit such a situation.` He assumed the authority to add something to the Act and the Model Law. The arbitrator added this to justify his unauthorised assumption of power:I am therefore of the view that an arbitrator can reconsider the award not only on the terms of art 33(1) of the Model Law but under the general powers given to him to determine the rules and procedure of the tribunal which would include the power to reconsider an award before enforcement if the arbitrator so decide. If I have good reasons to reconsider the matter, I should be allowed to do it. Otherwise, an injustice would be perpetuated.The propositions of the arbitrator assume that there is a shortcoming in the Model Law to provide for a possible shortcoming of an arbitrator. I repeat that the absence of the power on the Model Law to recall, reconsider and reverse the decision contained in an award is deliberate and is founded on the principle of finality and public policy to bring an early end to commercial disputes. Its purpose is to compel the arbitrator to act with extreme care and decide with competence and decisiveness. An inclusion of the powers the arbitrator argues for will encourage defeated parties to reopen the arbitration even after his mandate has been terminated. It will provide for indecisive and incompetent arbitrators a second chance. I repeat that what the arbitrator attempted to do was to write his own writ. It was utterly outside the parameters and dynamics of the Act and the Model Law. Once he became functus officio he had no power to recall and reverse the award. More importantly he had no power to create that power when it is not contained in the Act or the Model Law. The only powers he had an award after he became functus officio were those under art 33. Article 33 did not empower the arbitrator to recall and reverse a final award.Counsel for Jeffrey Tang referred to s 12 of the Act which confers certain powers on the arbitrator relating to the conduct of an arbitration. These include the powers to make orders or give directions in relation to security for costs, discovery of documents, and securing the amount in dispute. It also enables the arbitrator to award any remedy or relief which could be ordered by the High Court if the dispute had been subject of civil proceedings in that court. These are limited procedural powers which can only be exercised during the arbitration before the arbitrator becomes functus officio. There is nothing in s 12 of the Act which empowers the arbitrator to recall and reverse a final award. The arbitrator quite rightly did not rely on s 12 of the Act.Finally, counsel for Jeffrey Tang asked me to invoke art 34(4) and suspend the setting aside proceedings before me and remit the award to the arbitrator. I cannot do that. Article 33(4) can be invoked only when there are irregularities in  the award and not when the award is a nullity. Furthermore the power to remit does not apply to an award made after the arbitrator became functus officio. The court has no power to resuscitate a dead arbitrator.By reason of the maters stated above I set aside the March Award and let the January award stand.Outcome:The respondent (Jeffrey Tang) shall pay the costs of the applicant (Stanley Tan).Copyright © Government of Singapore."
    }
}