{
    "case_title": "Public Prosecutor v Netto Michael George",
    "ncitation": "[2000] SGHC 261",
    "coram": "Amarjeet Singh JC",
    "sections": {
        "(ii) Written Statement dated 4thApril.2000 at 2.30 pm": "11.7Before the above statement was made, the Accused had on 30thMarch 2000 made two statements (Exhs. D6 and D7) one at 12.01am (rape) and the\n\nother at 12.40 am (robbery) under s 122(6) after the notice under the said section had\n\nbeen read to him. The Defence admitted these statements through the Investigating Officer.\n\nS/S/Sgt Lai had recorded the statements. In the statements, the Accused had stated that he\n\nhad nothing to say.At 1.15 am on 30.3.2000 S/S/Sgt Lai had proceeded to record the s 121\n\nstatement (the long statement) from the Accused and completed it at 2.40 am The\n\nProsecution did not seek to admit this statement.In seeking to admit only paragraphs 17 – 29 of the long statement\n\nmade on 4.4.2000 at 2.30 pm, S/S/Sgt Lai who recorded it, stated that he had brought the\n\nAccused to his room where the Accused after telling him that he wished to speak in English\n\nvolunteered the statement in question. S/S/Sgt Lai stated that he simultaneously recorded\n\nwhat the Accused said. After the completion of the statement, it was read out to the\n\nAccused. The Accused signed it after some corrections were made. The statement made was\n\nfree from threats, inducements or promises.In hiscross-examination, S/S/Sgt Lai admitted that paragraphs\n\n17 – 29 of the statement of the Accused made on 4.4.2000 which the Prosecution sought\n\nto admit, covered the same ground as the earlier long statement made by the Accused on 30\n\nMarch 2000 at 1.15 am. He agreed that essentially it was the same save the date on which\n\nthe rape and robbery had taken place had been mistakenly put down by him as 15.3.2000 when\n\nit should have been 15.1.2000. The Accused had correctly referred to the date as 15.1.2000\n\nin his statement dated 4.4.2000. The mix-up of the dates was the subject matter of only\n\none small paragraph. When asked why did he wish to cover the same grounds on 4.4.2000 in\n\nrespect of all the paragraphs, S/S/Sgt Lai stated that he could not give any reason.The Accused, on the other hand, in his statement stated that he had sat\n\nin front of S/S/Sgt Lai while S/S/Sgt Lai typed the whole statement. Before giving it to\n\nhim to sign it, S/S/sgt Lai had told him to \"sign it and forget about it\". He\n\nhad resisted signing it but eventually he signed it as he had no choice because of the\n\ninsistence of S/S/Sgt Lai telling him you have already admitted it and just to project\n\nthat he would get 10 – 15 years imprisonment.Ruling12. Having considered and assessed all the evidence, it appeared to me\n\nthat the two statements sought to be admitted by the Prosecution had been caused by\n\nthreats as a result of the Accused believing that his family members would be spared if he\n\nmade the statements as required by the two officers i.e. that he would thereby gain an\n\nadvantage by making the statements as required by the officers. I found the evidence of\n\nInsp Halim questionable when he stated that he did not have much knowledge of the facts of\n\nthe case and that he simply let the Accused tell him about what he had done and the\n\nAccused had as such volunteered the statement. Insp Halim’s admission that he did not\n\neven tell the Accused what the charges were against him was unconvincing. He was a senior\n\nofficer. He took part in the arrest of the Accused. He must have known what the Accused\n\nwas being arrested for and he must have told what the charges were against him. The\n\nAccused was also rushed to Insp Halim’s room without even his arrest being registered\n\nin the charge book or the lock up. It appeared to me the pressure was put on him to admit\n\nthe charges and to make the statementExh P49(id). I was equally disdainful if the\n\nevidence of S/S/Sgt Lai concerning the making of the statementExh. P54(id). I was\n\nsatisfied, having heard and observed the versions of the evidence given by the Accused and\n\nhis family that threats had been made by the two said police officers to the Accused at\n\nthe CID and in his house to him and members of his family that they could be arrested for\n\nharbouring the Accused as a deserter. Their evidence had a ring of truth and remained\n\nintact during the Prosecution’s cross-examination The Prosecution had therefore not\n\ndischarged its burden of proving beyond a reasonable doubt that the statements were\n\nvoluntarily made. InPoh Kay Keng v P P(CA) [1996] 1SLR pg 209 threats\n\nagainst the Accused’s family members to have them charged or have their property\n\nconfiscated were held to be an inducement vitiating the Accused’s statement. In this\n\ncase as in the above case, I similarly held on the evidence that the Accused was induced\n\nby the threats made against his family to make the statements he made. As such, I rejected\n\nthe statementsExhs. P49 (id) and P 54(id)and returned them to the Prosecution.Prima Facie Case13. Defence Counsel did not make a ‘no case’ submission.In the light of the Complainant’s identification of the Accused as\n\nthe one who had forcibly committed the offence after putting her in fear of death at knife\n\npoint and in view of the Accused’s identity being further established as a result of\n\nthe DNA results of semen stains which matched his blood group, I was satisfied that aprima\n\nfaciecase against the Accused had been made out in respect of the offences of rape\n\nand the other charges which if unrebutted would warrant his conviction. The\n\nComplainant’s evidence of the open window in the bathroom circumstantially showed\n\nthat the Accused had climbed in through the window to break into the house as he was not\n\nthere at her invitation. The other doors and windows according to the Complainant were all\n\nclosed. There was nothing inherently incredible about her evidence on these matters and on\n\nthe other offences relating to unnatural sex (oral sex), the criminal force used on her as\n\nstated in the charge and robbery of the $50/- in her wallet although the police had\n\nomitted to recover the wallet from her. She had indeed withdrawn $300/- on 10thand\n\n12thJanuary 2000 from her bank and as she had said, remitted most of the\n\nmonies to the Philippines leaving the $50/- as her change in her wallet.In the circumstances, I called for the Accused to enter his defence.The Accused elected to give evidence on oath.Defence14. The Accused’s defence was that he had been introduced to the\n\nComplainant, a Lina, by Colin in a coffee shop along Jalan Selaseh in Seletar. A few days\n\nafter Christmas in December 1999, Colin took him to Lina’s house at 1.00 am The\n\nComplainant allowed them through the front gate and front door of the house and went to\n\nthe kitchen where the Complainant made coffee for them. Colin then went into her room and\n\ncame out 5 – 10 minutes later and after that left the house. She thereafter took the\n\nComplainant to her room saying she wanted to speak to him and there they had sexual\n\nintercourse after she undid his pants. He had used a condom. On this occasion the\n\nComplaint had told them not to make noise because her employers might wake up. He did not\n\nask her if the owners were in. He next met her at the same coffee shop in early January\n\n2000 when he saw the Complainant using a phone at the provision store. He made an\n\narrangement to see her that night. On arrival at the place where she stayed, he was again\n\nallowed in by the front entrance and they had sexual intercourse. He had noticed a car\n\nparked in the porch of the house and he had suspected the owners were in and because of\n\nthat she did not go to the dining area.14.1 He went a third time to see the Complainant in the house on 15thJanuary 2000 at about 3.00 am after leaving a bar art Chijmes accompanied by Colin who\n\nsaid Lina was free that night. They were again allowed in by the front door. They chatted\n\nin the kitchen where the light was on. The Complainant then said she wanted to talk to him\n\nand took him to the room where he had sexual intercourse with her again for two to three\n\nminutes with a condom which he threw into the waste paper basket after using it. As for\n\nconversation with her before the intercourse, she had not said anything but after\n\nintercourse she asked him for a loan of $5,000/- as she had problems at home in the\n\nPhilippines. He said he didn’t have that kind of money and offered her $50/- which\n\nshe refused. He went back to the kitchen and told Colin about it and he told him to help\n\nher if he could. The Complainant then came out and to put in the Accused words\n\n‘everything was normal. She didn’t mention about money ….’. And half\n\nan hour later he left leaving Colin behind.14.2 As for the black cap found in the Complainant’s room, he had\n\ngiven it to her as a present on the second occasion they met in her house as he had\n\nreceived several caps as gifts at about that time.14.3 After 15thJanuary 2000 he met her again on 16 March\n\n2000 at Selaseh Park along Jalan Selaseh at about 4.00 pm. The park was about 150 metres\n\nform his house. The house in which the Complainant worked was a few houses away from his\n\nown. He made an appointment to meet her outside her house at 10.30 pm. He met her as\n\nscheduled and they then went to the Ipanema Bar in Orchard Towers where she ordered a\n\nBudweiser Beer and he a jog of Tiger. He produced a receipt of his expenses at the barExh.\n\nD4. After the drinks he picked up some condoms from a 7-Eleven Store nearby (receipt\n\n–Exh. D5) and he then took her to Balestier Hotel at after midnight on 17thMarch 2000 where they had sexual intercourse. Only his name was registered there. The\n\nComplainant left the hotel at about 6.00 am saying she had to go back in case her\n\nemployers woke up. He took her back in a cab and got down near her house as his house was\n\nonly 50 metres away. The Complainant knew where he lived. They parted company.14.4 Thereafter to the date of his arrest on 30thMarch 2000\n\nin his house, he had not met up with her.14.5 Asked by his Counsel if he was facing any problems at about during\n\nthis one or two months, the Accused stated that he was away without leave (AWOL) for more\n\nthan 2 months from National Service and was going through a kind of depression. He agreed\n\nhe had not been paid for 2 months as a National Serviceman but that he works as a deejay.\n\nOn the night of 15thJanuary, he still at about $150/-. When asked if he had\n\nheard the evidence of Colin and that Colin had denied introducing him to Lina or ever\n\ngoing into the house where the Complainant worked on the 2 occasions they met. He\n\ndisagreed. Asked why Colin would testify in that manner, the Accused said he had come up\n\nwith his own ideas as to why he was doing this. He had eavesdropped on a conversation at\n\nPeyton Place bar which Colin was having with a male Chinese. The Accused said:-\" …..I heard Colin mentioned to this male Chinese something\n\n  about drugs. So when I heard this, I knew Colin was dealing in some kind of drugs. I left\n\n  Peyton Place straightaway. ……….And then after I walked out, I went to 7-Eleven. I bought a drink. I\n\n  was walking back when Colin ---I saw Colin outside. Then he asked me, \"Eh, you\n\n  haven’t finished your work.\" So I brought up the matter to him. I confronted him\n\n  with it and I told him, \"I overheard what you were telling that guy. You are dealing\n\n  in some kind of drugs here.\" I got into a heated conversation with him and he told me\n\n  to mind my own business and to do the job that I was paid for. So I didn’t say\n\n  anything to him.………………..THIS IS THE REASON WHY COLIN MAY HAVE ASKED THE VICTIM TO DO THIS TO ME BECAUSE----Because I have knowledge that he is not only dealing with these drugs but I have been on\n\n  other occasions with him to Peyton Place where I have seen him collecting a lot of money.…..He collected money on a few occasions when I went with him. And he collected it from a\n\n  Filipino girl. I don’t know who this girl is. Because there are a lot of Filipino\n\n  girls that patronise this pub called Peyton Place.…..I don’t know the figure, Sir, but I saw a stack of $50 notes, Sir.………About half an inch, Sir.…………So he must be doing something behind the scenes, for a Filipino to give him the money.\n\n  \"14.6 Asked inCross-Examinationwhat he had in mind when he saw\n\nthe Accused having the cash transactions with a Filipino girl, the Accused replied:\"A: I didn’t know about it. Didn’t look illegal. I\n\n  didn’t have any proof that it was illegal also so I didn’t think anything of\n\n  it.\"14.7 The Accused also stated that he asked Colin what were the\n\ntransactions about and Colin replied it was for some work and he had to take his word for\n\nit.14.8 As for the incident concerning the drugs, it had taken place\n\nsomewhere around the 2ndor 3rdJanuary 2000. When they parted\n\ncompany after a heated conversation their relationship was tense. However, he added Colin\n\nmet him a few days again and did some work for him and was paid. Asked if he didn’t\n\nfeel uncomfortable being in Colin’s presence, he replied, ‘Not really. After the\n\n15thJanuary 2000 when he and Colin were at the Complainant’s house after\n\ngoing to Chijmes, everything was back to normal with them.14.9 Asked what the Complainant’s reaction was when he refused her\n\na $5,000/- loan and offered only $50/-, which she refused to take, she did not say\n\nanything to him. Subsequently he had not asked Colin if he had given her $5,000/-.14.10 As for the risk he was taking in going to the Ketumbit house on\n\nvarious occasions in the event that the owners were in, his answer was that he\n\n‘didn’t make anything out of it’. He did not also think he was doing\n\nanything wrong seeing the maid late at night without the knowledge of the houseowner.14.11 As for the Notice Statement made by the Accused under s 122(6) of\n\nthe CPC the Accused replied to questions that whilst he was informed of the charges, the\n\nNotice of Warning was not read to him by the Investigating Officer nor did he read it when\n\nhe made the statement ‘I have nothing to say’. He merely said this because he\n\nwas ‘very confused’ at the time and he did not want to ‘provoke’ the\n\nInvestigating Officer.14.12 The Accused agreed with the Prosecution that the Complainant had\n\nnot given to him her telephone number and he knew nothing of her person.14.13 InRe-Examination, the Accused explained that at that\n\npoint of time he ‘didn’t want to say anything’.14.14 In clarification, when asked by the Court why the Defence had not\n\nput to Colin that he had asked the Complainant to make the allegation of rape and the\n\nother sexual allegations against him as charged because the Accused had discovered Colin\n\nto be dealing in drugs and stacks of currency bills and had confronted him and that Colin\n\nhad therefore ill-will against him for that reason, the Accused’s answer was:\"A: I cannot explain, Sir\"He went on to say he had instructed his Counsel on this matter so it\n\nwas up to Counsel to ask or not to ask.14.15 Asked by the Court why the Complainant would go out with him or\n\nhave sexual intercourse again with him on 16th/17thMarch 2000 when\n\nshe had already made a police report of rape, his answer was:\"I cannot explain.\"",
        "Evaluation and Finding": "15. The applicable law in a sexual offence which I had to bear in mind\n\nin coming to my findings was that there was no legal necessity that I had to warn myself\n\nexpressly of the danger of convicting the Accused assuming that the Complainant’s\n\nevidence was uncorroborated. I though bore in mind the principle that it was dangerous to\n\nconvict on the words of the Complainant alone unless her evidence was ‘unusually\n\ncompelling or convincing’. That phrase was explained inKwan Peng Hong v P P[2000] 4SLR 96 where Yong C.J. stated:\"The phrase ‘unusually compelling or convincing’ simply\n\n  means that the complainant’s evidence was so convincing that the prosecution’s\n\n  case was proven beyond reasonable doubt, solely on the basis of that evidence.…….what is important is for the trial judge to analyse the\n\n  evidence for the prosecution and for the defence with a view to deciding whether a\n\n  conviction based solely on the complainant’s evidence is not unsafe. If it is not\n\n  unsafe to so convict, the trial judge need not go further, except to explain clearly the\n\n  reasoning behind the findings of fact.….if it is unsafe to convict, the trial judge should identify\n\n  which aspect of the evidence is not so convincing. The trial judge should then look for\n\n  supporting evidence and ask whether in taking the weak evidence, together with the\n\n  supporting evidence, the trial judge is convinced that the prosecution case is proven\n\n  beyond reasonable doubt.\"The learned Chief Justice also went on in that case to explain the\n\nnature of corroborative evidence as follows:\"Finally, in analysing the evidence, the trial judge must weigh it\n\n  carefully, always bearing in mind the relevant aspects of human nature and behaviour. But\n\n  it would be wrong to be bogged down by technicalities, especially when they have no\n\n  logical bearing to the case in hand. Our approach is clear. We have left behind a\n\n  technical and inflexible approach to corroboration and its definition. ……….Instead, our approach is liberal, ensuring that the trial judge has the\n\n  necessary flexibility in treating relevant evidence as corroborative. This is in line with\n\n  the approach of other jurisdictions. What is important is the substance and the relevance\n\n  of the evidence, and whether it is supportive or confirmative of the other weak evidence.Essential qualities of corroborative evidence are its independence,\n\n  admissibility and whether it implicates the accused in a material particular.Even if the evidence is capable of corroboration, whether it does\n\n  supply corroboration still depends on all the circumstances of the case. The trial judge\n\n  must pay particular consideration to the extent to which the evidence that is capable of\n\n  corroboration does provide the corroborative evidence to satisfactorily dispel any doubt\n\n  on the guilt of the accused. This flexible approach to corroboration ensures that proper\n\n  weight is given to the right evidence and no undue weight is assigned to some evidence\n\n  merely because it is called ‘corroboration’.\"16. The main issue raised in the case was whether the sexual\n\nintercourse was consensual. In this regard, the Accused’s case was that he had been\n\nintroduced to the Complainant some time before Christmas 1999 at a coffee shop at Jalan\n\nSelaseh in Seletar by Colin for whom he did contract work off and on and then subsequently\n\nhe had consensual intercourse with the Complainant at her employer’s house in the\n\nearly hours of the morning by visiting her on three occasions there. The three occasions\n\nwere when he went there with Colin just after Christmas 1999, again when he went there\n\nalone in early January 2000 and then again when he went there with Colinon 15thJanuary 2000, the date relevant to the charges on which he was being triedand finally\n\nagain on 17thMarch 2000 when he met her alone on 16thMarch 2000\n\nand took her for a drink to the Ipanema Bar in Orchard Tower and thereafter to Balestier\n\nHotel. He produced two receipts. He had a receipt for drink purchases (Budweiser beer for\n\nthe Complainant and a jug of beer for himself) together with a receipt for purchase of\n\ncondoms at a 7-Eleven Store nearby before leaving for the Hotel with the Complainant. The\n\nProsecution did not dispute that he went to the Hotel. The Prosecution case was that it\n\nwas not the Complainant he went there with. The Accused’s evidence was that on each\n\noccasion when he visited the Complainant at her employer’s house, he was allowed by\n\nthe Complainant to enter into her employer’s house through the front gate and front\n\ndoor and would then be led to either the kitchen and/or into the maid’s room\n\nthereafter. On the first occasion when he went with Colin, the Complainant invited Colin\n\nfirst into the maid’s room and when he came out to the kitchen where the Accused\n\nwaited, he was led to the maid’s room next. Colin left the house when he went into\n\nthe maid’s room with the Complainant. She had also earlier made coffee for them. The\n\nkitchen lights were on. On the second occasion on 15thJanuary 2000 when he\n\nwent with Colin again, he had gone into the maid’s room first and after he had sexual\n\nintercourse, the Complainant had asked him for $5,000/- as she had financial difficulties\n\nin the Philippines. He told her he could not afford to pay her and offered her $50/- which\n\nshe declined to accept. In the event he paid nothing to her. He had conveyed this request\n\nfor the money to Colin who was waiting in the kitchen when he came out and Colin merely\n\ntold him to help her if he could. As for the Complainant she did not say anything more\n\nabout the $5,000/- then or subsequently when they met again.17. I found that all considered, the Accused’s defence of\n\nconsensual sexual intercourse on 15 January 2000 or on the other dates consisted of only\n\nhis bare word. It was plain to see that the two receipts did not at all connect the\n\nComplainant with an outing with him on 16th/ 17thMarch 2000 leave\n\nalone her accompanying him and having sexual intercourse with him on that day at the\n\nBalestier Hotel. Nevertheless, I bore in mind that a ‘bare word’ defence where\n\ncircumstances permit is capable of raising a reasonable doubt on the Prosecution case.17.1 As for the Complainant, she had denied that she had ever been\n\nintroduced to the Accused before or had ever met him otherwise or had sexual intercourse\n\nwith him save that as she slept in the maid’s room of her employers’ house, she\n\nwas suddenly awakened by him on 15thJanuary 2000 with a knife pointing at her\n\nneck. He then raped her and narrated the commission of the other offences as set out in\n\nthe charges. She denied knowing Colin or such a person ever accompanied the Accused into\n\nher employers’ house or had sexual intercourse with her.18. The Complainant wascross-examinedintensively by Defence\n\nCounsel. She withstood thecross-examinationand the credibility of her complaints\n\nas charged against the Accused remained without blemish and intact.19. I found that there were significant aspects of both the Prosecution\n\nand Defence case which convinced me that the Complainant’s evidence was unusually\n\ncompelling and hence convincing. Soon after the Accused had left the Complainant in the\n\nearly hours of that morning, the Complainant had telephoned Diana Yee who was a former\n\nemployee of her employer as her employer and her husband had left for China the previous\n\nevening. It was Diana Yee’s evidence that the Complainant was crying and she had told\n\nher that a man had come into the house whereupon Diana Yee had driven immediately off to\n\nsee the Complainant and on her arrival saw her crying and in a state of shock although she\n\nsettled down later. She was told a man had come into the house and raped her. Diana Yee\n\nmade a 999 call to the police and the recorded time of that call is 7.32 am (Exh. P50:\n\n‘Case of Rape reported’). The Complainant had therefore reported the matter\n\npromptly and she was also seen in a distressed state when Diana Yee came and saw her.\n\nIndependent evidence of a distressed condition after an alleged offence can amount to\n\ncorroborating evidence of the offence:R v Redpath[1962] 46 Cr App Rep 319.\n\nI found the fact that the Complainant had made a contemporaneous report to Diana Yee and\n\nshe had conveyed the information to the police soon thereafter as corroborative evidence\n\nof her complaint that she had been raped, robbed and other indignities as charged\n\ncommitted on her. The proviso under s 159 of the Evidence Act provides that former\n\nstatements of a witness may be proved to corroborate later testimony as to the same fact.\n\nIt was not necessary for her in the distressed condition she was, to immediately have\n\nnarrated all the other indignities she charged the Accused with and robbery of $50/- from\n\nher. It was sufficient that she told the police of these in recorded statements later as\n\nshe did. Her distressed state further constituted corroboration of her complaint against\n\nthe Accused. I found it improbable in the light of the evidence and the inferences I drew\n\ntherefrom that her complaint and her distress was feigned.19.1 As for no medical injuries being found on her neck and back area\n\nwhere the Complainant said the Accused had pointed his knife, the Complainant’s\n\nexplanation which I found plausible was that the Accused had not pressed the knife hard on\n\nher body. I also accepted as plausible the Complainant’s explanation that the cap\n\nfound in the Complainant’s room was not given to her by the Accused. I was satisfied\n\nthat the Accused had inadvertently left the cap behind when he left the Complainant’s\n\nroom.20. Defence Counsel had submitted that if the Complainant’s story\n\nwas true that she did not know him previously and the Accused had broken into the\n\nComplainant’s employer’s house and raped her in the maid’s room which was\n\nthen dark as it was in the early hours of the morning, she could not have seen his face\n\nand identified him at the identification parade and in any case the Accused was not aware\n\nthat he had been identified by the Complainant as the Complainant never appeared in the\n\npresence of the Accused to identify him at the parade and as such the identification was\n\nflawed.20.1 The Defence Counsel’s submission ignored the evidence of the\n\nComplainant that she was able to see the ‘face’ and ‘built’ of the\n\nAccused because of the light coming in through the window of her room from the\n\nneighbouring house as he had stood near the window ‘putting on his clothes’ and\n\nhad asked her also to open the window before leaving the room through the window. When she\n\nwas told that the Accused had a moustache and a beard at that time, she said she had not\n\nnoticed it. In this regard, Wei Fong, PW21, the neighbour testified that she normally left\n\nall her garden lights on and her compound was always brightly lit as there had been a few\n\nrobberies in the area. There were three lights according to her which shone into the\n\ncompound bordering the side where the maid’s room was. Her evidence was not\n\ndiminished by Defence Counsel’scross-examination. From the photographs, I\n\nnoticed that the two houses were very close. I was satisfied that the Complainant was able\n\nto see the Accused’s face, recognise it and later identify it from a set of\n\nphotographs of several persons shown to her by the police and thereafter identify the\n\nAccused at an identification parade. As for the Accused’s defence that he was unaware\n\nthat he had been identified, the explanation lay in the fact that the identification was\n\ndone in the CID from an adjoining room through the glass panel through which only a one\n\nway view could be had of the parade. This procedure was used for the protection of\n\nwitnesses in certain cases, for example, the Complainant in this case and I found nothing\n\nimproper in the procedure.21. The Accused’s version of the events and the manner his case\n\nwas conducted begged many pertinent questions which went unanswered. In all, I was\n\nsatisfied that against the backdrop of the Complainant’s evidence, the Accused’s\n\ndefence of the Complainant being a friend with whom he previously had sexual intercourse\n\nand again after the 15thJanuary 2000 notwithstanding that she had already made\n\na police report concerning the incident of the 15thJanuary 2000 were all, in\n\nmy opinion, a desperate and elaborate lie to establish his defence. I had asked the\n\nAccused in clarification as to why the Complainant would go out with him to have sexual\n\nintercourse with him on 17thMarch 2000 in view of a report of rape committed\n\non her on 15 January 2000. His answer was: ‘I cannot explain’.21.1 I found the Accused’s defence of consensual intercourse on 15thJanuary 2000 and the other incidents of consensual sexual intercourse with the\n\nComplainant, incapable of standing up to scrutiny for compelling reasons:",
        "(i)the Accused’s defence was refuted by Colin, PW20": "Accused’s Counsel had indicated to me early during the trial that\n\nthe Defence was intending to call Colin as a defence witness. Later during the Prosecution\n\ncase, I was informed that the Accused was not calling him as a witness. In the event, he\n\nwas called by the Prosecution as a witness pursuant to the usual notice being served,\n\nCounsel for the Accused not objecting. Colin denied he knew the Complainant or had ever\n\nbeen to her employer’s house alone or with the Accused as alleged by the Accused. He\n\nthough admitted that he knew the Accused and the Accused had been doing some contract work\n\nfor him. He stated that as far as he could recollect, he had only seen the Complainant\n\npassing by on an occasion at or near a coffee shop in Jalan Selaseh which is a close-by\n\nshopping area for the estate where the Complainant lived. Defence Counsel in hiscross-examinationwas unable to impugn the evidence of Colin.",
        "(ii)the Accused’s allegation that Colin had an ulterior motive\n\nfor giving evidence unfavourable to him entirely lacked credibility": "22. The Accused in his defence from the witness stand, alleged that\n\nColin did not tell the truth about his involvement with the Complainant. He attributed a\n\nsinister motive to Colin in giving unfavourable evidence against him namely that they had\n\nfallen apart because the Accused had eavesdropped and heard a conversation between Colin\n\nand another that Colin was involved in dealing in drugs. He had also seen Colin being\n\ngiven a stack of $50/- notes. He had also stated he believed Colin was doing something\n\nbehind the scene although he didn’t have proof that anything was illegal about it.\n\nThe Accused had confronted him with what he had overheard and seen. As a result, there was\n\na heated argument between Colin and himself. The Accused then stated in evidence:‘This is the reason why Colin may have asked the victim to do this\n\n  to me’.22.1 The Accused’s brother as a witness for the defence, further\n\nalleged against Colin that Colin was involved in prostitution and that he had on one\n\noccasion seen Colin at the Jalan Selaseh coffee shop nodding in the direction of the\n\nComplainant when she approached the coffee shop. The net value of all this evidence was to\n\ndiscredit Colin’s denial that he knew the Complainant and that both he and the\n\nAccused were involved in consensual sexual trysts with the Complainant.22.2 I found the Accused’s allegations of ulterior motive against\n\nColin completely lacked credibility and this finding by me was accentuated by his Counsel\n\nin not attributing orputtingsuch a motive to Colin.22.3 If the Complainant was doing the bidding of Colin in a situation\n\nwhere Colin stage-managed for the Complainant and the Accused to have sexual intercourse\n\non 15thJanuary 2000, then the Complainant having made a police report, would\n\nhave informed the police to arrest him soon after the 15thJanuary 2000 as the\n\nevidence was undisputed that the Accused lived in the same estate as the Complainant and\n\nhis house was only a few doors away from that of the Complainant’s employer’s\n\nhouse as he had got down from a taxi near her employer’s house to walk to his house\n\non one occasion. If the Complainant had not seen exactly which house he lived in, she\n\nwould know the precise vicinity in which he lived. The Complainant would have tipped off\n\nthe police as to the vicinity he lived in after the matter was reported to the police.\n\nAgain, she could have arranged for the police to arrest him on 16thMarch 2000\n\nwhen the Accused made arrangements to meet her that night and allegedly took her out for\n\nanother sexual escapade. As the evidence turned out, the police spent more than 2 months\n\nto track down the Accused and arrest him from a description given of the Accused by the\n\nComplainant.22.4 Though the Accused claimed that he had informed Defence Counsel of\n\nthe Accused’s ulterior motive, the same was neverputto Colin although\n\nDefence Counsel had ample opportunity to do so and Defence Counsel had repeatedly\n\nconsulted with the Accused in the dock throughout the trial. I was satisfied that the\n\nAccused had not informed Defence Counsel of these allegations he uttered in his evidence\n\nfrom the witness stand as in my opinion he made them up as he went along giving his\n\nevidence. Otherwise, Defence Counsel would have put the Accused’s allegations of what\n\nhe had overheard and seen to Colin as well as the allegations made by the Accused’s\n\nbrother i.e. that of prostitution and his noticing Colin acknowledging the Complainant one\n\nday at the coffee shop in Jalan Selaseh. They would have been the central planks of his\n\ndefence to demolish the credibility of Colin. Further, if it was the belief of the Accused\n\nthat there was collusion between Colin and the Complainant for whatever reason be that one\n\nthe quarrel between Colin and the Accused or the Accused not paying the Complainant\n\n$5,000/-, such collusion was not put to the Complainant and her response tested.22.5 I held that the Defence could not, in the circumstances, rely on\n\nall these allegations of the Accused and his brother to discredit the evidence of Colin.\n\nIt is sufficient in this regard for me to refer to the rule as enunciated inBrown\n\n& Dunn:\"it seems to me to be absolutely essential to the proper conduct\n\n  of a cause, where it is intended to suggest that a witness is not speaking the truth on a\n\n  particular point, to direct his attention to the fact by some questions put in\n\n  cross-examination showing that that imputation is intended to be made and not to take his\n\n  evidence and pass it by as a matter altogether unchallenged, and the, when it is\n\n  impossible for him to explain, as perhaps he might have been able to do if such questions\n\n  had been put to him, the circumstances which it is suggested indicate that the story he\n\n  tells ought not to be believed, to argue that he is a witness unworthy of credit. …it\n\n  will not do to impeach the credibility of a witness upon a matter on which he has not had\n\n  any opportunity of giving an explanation by reason of there having been no suggestion\n\n  whatever in the course of the case that his story is not accepted.\"The above rule was endorsed in the case ofArts Niche Cyber\n\nDistribution Pte Ltd v Public Prosecutor:\"[a]ny matter upon which it is proposed to contradict the\n\n  evidence-in-chief given by the witness must normally be put to him so that he may have an\n\n  opportunity of explaining the contradiction, and failure to do this may be held to imply\n\n  acceptance of the evidence-in-chief.\"",
        "(iii)the highly questionable nature of the Accused’s alleged\n\nrelationship with Complainant": "23. The Accused’s evidence was to the effect that he was close to\n\nthe Complainant and could see her at his will and have sexual intercourse with her either\n\nat her employer’s house or outside. Yet, he had not exchanged any contact telephone\n\nnumbers with the Complainant although the Complainant had a personal cellular phone in her\n\npossession. Then again, I failed to understand why the Complainant who was in need of\n\nmoney and had asked the Accused for $5,000/- on 15thJanuary 2000 would\n\ncontinue to have sexual intercourse with him as he had told her he had no such amount to\n\npay her and had offered her instead $50/- which payment she had rejected. The\n\nAccused’s evidence was also very strange when he stated that notwithstanding him not\n\npaying her the $5,000/- or any other sum, his relationship with her was normal and she had\n\nnever raised the question of asking money from him again. The Accused had also stated that\n\nhe had other girlfriends younger than the Accused. Yet, curiously he had to go each time\n\nto the Complainant’s employer’s house to meet the Complainant who was 43 years\n\nold in the dead of night being completely averse to the risk that the owners of the house\n\nmay be in and they may wake up and find him there as their master bedroom was on the\n\nground floor not far from the maid’s room. The Accused’s explanation that there\n\nwas nothing wrong with going to the employer’s house to see the Complainant in the\n\nearly hours of the morning shows his daring and disregard for consequences. I agree with\n\nthe Prosecution that the logical explanation was that the Accused was not a truthful\n\nwitness when he said that the Complainant and he knew each other at all.",
        "(iv)that the Accused used a condom before having sexual intercourse\n\non 15thJanuary 2000": "24. The Accused’s evidence was that he had used a condom to have\n\nsexual intercourse and then discarded it in the waste-paper basket next to the bed. This\n\nshowed that the sexual intercourse was consensual as the Complainant allowed him to wear\n\nthe condom. Whilst I did not quite understand this piece of evidence, it was obvious that\n\nin this regard the Accused was untruthful. The police had searched the waste-paper basket\n\nand had not recovered any condom, only 2 pieces of tiny crumbled white papers and the\n\npieces of damp tissues (Exh. P65) which proved negative for any DNA. The Accused\n\nthen explained that the Complainant would have thrown away the condom before calling the\n\npolice. This again did not make sense because the Accused had testified he believed Colin\n\nhad set him up or framed him by conniving with the Complainant though this had never been\n\nput to the Complainant. As such, there was all the more reason to keep the incriminating\n\ncondom for DNA testing to nail the Accused. I therefore accepted the Complainant’s\n\nversion that the Accused had masturbated and ejaculated outside her after having sexual\n\nintercourse with her. This is also consistent with her evidence that she had not washed\n\nher bottom and was consistent with the DSS evidence that no DNA profile was yielded on\n\nvaginal smears taken from her. She had, she explained, only brushed her teeth and washed\n\naround the mouth area as was her daily morning habit.",
        "(v)the damming circumstancial evidence of the Accused’s entry\n\ninto the house through the bathroom window of the master bedroom": "25. The evidence of the Complainant was that the Accused left her room\n\nafter raping her by opening her bedroom window and climbing out. She had thereafter gone\n\nto inspect all the doors and windows and had found the window of the master bedroom toilet\n\nopen. She believed the Accused would have come into the house through the said window. She\n\nshowed the open window to Shi Hao, PW14, after she woke him, who confirmed that the said\n\nwindow was wide open. There was some minor discrepancy as to how wide the window was open\n\nbut the important consideration was that I was satisfied that its opening was large enough\n\nin view of the dimensions given by the Investigating Officer, for the Accused to enter\n\nthrough it as he was slim and that he did enter through this window to gain access into\n\nthe house. The entry is confirmed by a body brush with a long handle and a shampoo tube\n\nwhich lay at the bottom of the window on the grass verge outside the house. The evidence\n\nof the Complainant and her employer was that normally these were placed on the window\n\nsill. The only reasonable inference for me to draw, which I drew was that the Accused in\n\norder to climb through the window picked up the brush and shampoo tube and threw them out\n\nto gain an unimpeded entry through the window and into the house. He had thus committed\n\nhousebreaking by night as charged.",
        "(vi)the unrealistic return to normality of the relationship of the\n\nAccused with Colin": "26. In this regard, the Accused’s evidence was that\n\nnotwithstanding the heated quarrel Colin had with the Accused upon accusing him of drug\n\ndealings and collecting money under dubious circumstances, ‘everything was back to\n\nnormal’ between Colin and him so much so that they were beginning to go to nightspots\n\nand Colin also took him to the Complainant’s employer’s house on 15thJanuary 2000. I disbelieved the Accused’s evidence that their relationship would have\n\nmended so speedily, if at all in view of the various serious accusations he alleged he\n\nmade against Colin. I also noticed that the Accused had a habit when giving evidence of\n\nexplaining away uncomfortable questions with phrases such as ‘I didn’t make\n\nanything of it’, ‘everything was back to normal’, ‘I didn’t think\n\nanything was wrong’ and ‘it did not occur to me’. He did not strike me as a\n\ncredible witness.",
        "(vii)the Accused’s failure to mention his defence in his\n\nNotice Statements under s 122(6) of the CPC": "27. The Defence admitted two statementsExh. D6(Rape) andD7(Robbery) by the Accused on 30thMarch 2000. The Defence admitted these\n\nstatements through the Investigating Officer. I accepted these were voluntarily made\n\notherwise the Defence would not have admitted then. In both statements the Accused had\n\nstated:\"I have nothing to say’Asked incross-examinationwhy he had not stated in his defence\n\nafter the Notice of Warning had been read to him, he stated he was in a confused state and\n\nhe did not wish to state matters which would prejudice his case. I rejected the\n\nAccused’s explanation as the statements were admitted by the Defence. The purpose of\n\ngiving the Notice of Warning to an accused under s 122(6) is to enable him, upon being\n\ncharged, to raise his defences then and to guard against an accused raising defences at\n\nhis trial which are merely afterthoughts. The Accused could have simply mentioned that he\n\nknew the Complainant and he had consensual sexual intercourse with her. There was nothing\n\ncomplicating in stating this. The Accused’s failure to mention this showed that his\n\ndefence was an afterthought of his.28. The Accused had totally denied that he had had unnatural sex (oral)\n\nwith the Complainant or that he had outraged her modesty by licking her vagina or robbed\n\nher of $50/-. Counsel for the Defence pointed out that the police had not seized the\n\nComplainant’s wallet in which she said she kept the $50/-. I found that the police\n\nhad not seized the wallet as a result of inadvertence and the Complainant had taken back\n\nthe wallet and left it in the Philippines when she went home for a visit there. The\n\nimportant fact was that the Complainant had withdrawn a total of $300/- on the 10thand 12thJanuary 2000 from an Automated Teller Machine (ATM) and evidence of\n\nthe same was furnished in Court. Some of the money had been remitted to the Philippines\n\naccording to the Complainant and some lent to her Filipino friends. There was no reason in\n\nthe circumstances for the Complainant to concoct the charge of robbery concerning a small\n\nsum of $50/- which in all probability she had in her wallet.29. There was also no reason advanced by the Defence why the\n\nComplainant would exaggerate and add the offences of unnatural sex and outraging modesty\n\nas stated above to the charge of rape. She had given her evidence quietly and had sobbed\n\non one or two occasions. I found her narration of the events that night orderly, precise\n\nand clear and unusually convincing in the light of all the circumstances I have raised and\n\ndiscussed. I was also satisfied that no reasonable doubt had been thrown on the\n\nProsecution case by the Defence.As such, I found the Accused guilty as charged and convicted him on all\n\nthe charges.Sentence30. I was informed by the Prosecution that the Accused had previous\n\nconvictions. He was convicted on 6thOctober 1994 under s 456 read with s 511\n\nof the Penal Code – attempted housebreaking by night with common intention together\n\nwith other offences under s 457, 454 and 380 which were taken into consideration - and\n\nsentenced to 2 years probation for the said offences.30.1 Subsequently, the Accused was also convicted on 8thMay\n\n1995 and 6thJune 1995 under s 448 of the Penal Code for house trespass and\n\nsentenced to 3 months imprisonment for the former offence and under s 9(1) of the\n\nProbation of Offenders Act Cap 252 for having committed further offences during probation\n\nfrom which he had been sentenced to the Reformative Training Centre (RTC).30.2 I took all these offences into consideration as they were recent\n\noffences and bearing in mind at the same time the totality principle that the sentence\n\nshould not be a crushing one as all the offences occurred in one transaction, I sentenced\n\nthe Accused who had little to say by way of mitigation as follows:(i) 1stCharge – Housebreaking under s 458: 2 years\n\n  imprisonment plus 3 strokes(ii) 2ndCharge – Rape under s 376(2)(b): 11 years\n\n  imprisonment plus 12 strokes(iii) 3rdCharge – Unnatural Sex under s 377: 1 year\n\n  imprisonment(iv) 7thCharge – Outraging Modesty under s 354A: 2\n\n  years imprisonment plus 3 strokes of the cane(v) 9thCharge -(a) Robbery under s 392: 3 years imprisonment plus 12 strokes of the\n\n    cane.(b) Committing Robbery when armed under s 397: 12 strokes of the cane.Sentences in respect of the 2ndcharge of rape and that of\n\n  robbery i.e. 9thcharge to run consecutively. The other 3 sentences of\n\n  imprisonment to run concurrently with the 2ndand 9thcharges. The\n\n  maximum number of strokes to be imposed shall not exceed 24.The total sentence of 14 years imprisonment is backdated to 30thMarch 2000 being the date of Accused’s arrest and remand.Amarjeet SinghJudicial CommissionerCopyright © Government of Singapore."
    }
}