{
    "case_title": "Public Prosecutor v Lee Wee Cheng",
    "ncitation": "[2000] SGHC 249",
    "coram": "Amarjeet Singh JC",
    "sections": {
        "Charge": "1. The Accused was charged and tried on the following amended charge:-You, LEE WEE CHENGare charged that you on the 7thday of June 2000, between 12\n\n  a.m. and 4.55 a.m. at Blk 668-C, Jurong West ST 64 #15-144, Singapore, did commit culpable\n\n  homicide not amounting to murder, by causing the death of one Lee Luan Ku (male/68 years),\n\n  to wit, by punching his head and kicking his body, which act was done with the intention\n\n  of causing such bodily injury as was likely to cause death and you have thereby committed\n\n  an offence punishable under section 304(a) of the Penal Code, Chapter 224.1. The Accused killed his own father by kicking and punching him\n\nviolently for reprimanding him for sniffing glue in the toilet of his house. The Accused\n\nhad earlier consumed a fair amount of alcohol. The prosecution in its facts conceded that\n\nthere was some evidence that the Accused was to some extent intoxicated with alcohol and\n\nas a result of glue sniffing.2. The Deceased’s death resulted from bleeding internally due to\n\nmultiple chest and abdominal injuries as certified by the Pathologist.3. It has been drawn to my attention that the Accused has a previous\n\nconviction for voluntarily causing grievous hurt by a dangerous weapon in 1981 for which\n\nhe was sentenced to 12 months imprisonment. Although the offence took place long ago it\n\ndoes appear that the Accused continues to have a residual propensity for violence.4. The fact that the Accused was to some extent intoxicated by alcohol\n\nand as a result of glue sniffing in committing the offence has already been taken into\n\nconsideration by the prosecution in reducing the charge from murder to culpable homicide\n\nnot amounting to murder.5. However in relation to sentencing the Accused on the charge I am of\n\nthe opinion that drink constitutes an aggravation, as an assault by an aggressor under\n\nsuch influence tends to frighten an average person much more.6. I accept that the case has some mitigational aspects such as the\n\nAccused having called the police some hours later when he saw his father lying unconscious\n\non the floor as well as the remorse he has expressed.7. Although the Accused will no doubt live in shame and sorrow for the\n\nrest of his life for this patricide I have to view both the circumstances of the offence\n\nand the relationship of the Accused as a son to the Deceased - and at that an adult -\n\nseriously.8. In the circumstances I sentence the Accused to 9 years imprisonment.\n\nThe sentence is backdated to 7thJune 2000.Amarjeet SinghJudicial CommissionerCopyright © Government of Singapore."
    }
}