{
    "case_title": "United Eng Contractors Pte Ltd v L & M Concrete Specialists Pte Ltd",
    "ncitation": "[2000] SGHC 74",
    "coram": "Lai Kew Chai J",
    "sections": {
        "The claim": "5 The plaintiffs filed the writ on 2 September 1998 and they claimed\n\nagainst the defendants the sum of $385,008.32 for work done and materials supplied under\n\nthe sub-contract. The final contract sum was stated to be $757,605.22 inclusive of GST.\n\nThe previous payments of $372,596.22 was deducted. The claim was the balance. The\n\ndefendants filed their Defence and Counterclaim on 7 September 1999. Para 2 of the Defence\n\nand Counterclaim averred, quite defectively, that \"the true accounts between the\n\nplaintiffs and the defendants\" were as follows:Value of work done$637,113.45Non-provision of Performance Bond($2,500.00)Retention Fund($15,865.34)Contra Charges($657,641.08)Previous payments made($361,744.56)Sum owing to the defendants($400,637.53)",
        "The Counterclaim": "6 On the first day of the hearing, counsel for the defendants applied\n\nto amend the Defence and Counterclaim. The original para 2 was renumbered para 3 and it\n\nread as followings:\"The Defendants aver that the true accounts between the Plaintiffs\n\nand the Defendants are as follows:Original value of work done$550,663.32AddCertified variations$97,771.39Total Value of Work done$648,434.71Add GST 3%$19,453.04Sub Total$667,887.75LessBack charges($348,238.57)Less GST 3%($10,447.16)Sub Total($358,685.73)Previous payments made($372,596.90)Sum owing to the defendants($63,394.88)7 The defendants explained that the amendments which reduced their\n\nclaims came about as a result of their settlement with their employers and owners of the\n\napartments. The defendants’ claim for liquidated damages which was not pleaded in\n\ntheir Defence & Counterclaim, but which was claimed in the affidavit of Tan Chye Seng\n\nfiled on their behalf was withdrawn. As the application was not opposed, I granted the\n\napplication to amend.8 As expected, plaintiffs’ counsel applied to strike out various\n\nparagraphs of the affidavit evidence in chief of both Tan Chye Seng and S R Sivakumar\n\nwhich were filed on behalf of the defendants. They were all set out in the\n\nplaintiffs’ submissions on this preliminary issue. I need not repeat them. They all\n\nrelate to what has been defectively and ambiguously described as \"Back Charges\"\n\nin the sum of $348,238.57 plus GST. It was a much reduced figure compared to the original\n\nclaim of \"Contra Charges\" of $657,641.08. The constituent items, as elaborated\n\nin the two affidavits in question, were in substance claims for special damages. The\n\namounts were quantified. But the causes of action and the material particulars were not\n\npleaded at all. There was no averment that there was a breach of the material terms of the\n\nsub-contract. The alleged defective works, both in terms of nature and extent, were not\n\nidentified. According to counsel for the defendants, the defendants had to compensate\n\nowners of the apartments in Hilltop Apartments and part of the \"Back charges\"\n\nwas made up of the compensation which the defendants alleged by way of affidavit evidence\n\nthey had to pay to the owners of the apartments. All these different claims were\n\nunhelpfully compressed under the master item described as \"Back Charges\".9 It is a settled rule of procedure under O18 r. 7 of the Rules of\n\nCourt that \"every pleading must contain, and contain only, a statement in summary\n\nform of the material facts on which the party pleading relies for his claim…\":\n\nseeBanner Investments Pte Ltd v Hoe Seng Metal Fabrication & Engineers (S) Pte Ltd[1997] 1 SLR 461. Plainly, the verbal shorthand \"Back charges\" did not disclose\n\nany cause of action and ran foul of the rule. It is also settled rule of procedure that I\n\ncould not hear any evidence led in any affidavit evidence in chief and proceed to make\n\nmaterial findings on matters not pleaded: seeUnited Malayan Banking Corp Bhd v\n\nMasagoes[1994] 1 SLR 766. The plaintiffs’ application to strike out the\n\nparagraphs in the two affidavits was allowed with cost.10 After striking out the paragraphs because the causes of action were\n\nnot pleaded or because they were special damages and were not pleaded, I had two courses\n\nopen to me: either to dismiss the counterclaim or to strike it out with liberty to the\n\ndefendants to institute fresh proceedings. I decided on the latter course, having regard\n\nto all the circumstances. In the preceding interlocutory proceedings between them, the\n\ndefendants had deposed to the nature of their counterclaims. The defendants had attempted\n\nto answer them in those proceedings. On the first day of the trial, plaintiffs’\n\ncounsel in fact told me that he was \"prepared to meet the defendants’\n\ncounterclaims for materials and labour allegedly supplied\". But he indicated that he\n\nwas not in a position to meet any other claims such as for special damages or for the\n\nprice of materials supplied as a result of the alleged breaches of the sub-contract by the\n\nplaintiffs. He did not have the causes of action and the particulars. He did not apply for\n\nan order to dismiss the counterclaims which were described vaguely as \"Back\n\nCharges\" and did not take up the point about striking out the relevant paragraphs in\n\nquestion on the ground that they had not been pleaded. Instead parties wanted to negotiate\n\nand settle their disputes over this project as well as those involving another project at\n\nthe Sinsov Building.11 The plaintiffs took the further step of negotiating and agreeing\n\nwith the defendants that they would accept liability and quantum over the five invoices\n\nmentioned above but they disputed the rest.12 It is true that all issues between the parties to a piece of\n\nlitigation should be disposed off and in principle it is wrong to truncate a trial and\n\nhave parts of what are actually one transaction, broadly speaking, tried by more than one\n\naction. Hence the res judicata rule that a judgment after a trial settles the issues and\n\nall other issues which would to have been raised, tried and adjudicated upon. I was\n\nprepared to depart from this general rule because of the conduct of the plaintiffs who\n\nhad, in a sense, led the defendants on with the not unreasonable expectation that they\n\nwould defend the counterclaim, having in substance known what they were, although they\n\nwere not pleaded. I was not willing to allow a further amendment by the defendants to\n\nelaborate on and plead the \"Back Charges\" according to the usual rules of\n\npleadings because (1) the documents and the affidavits were not organised; and (2) there\n\nwere no particulars of the special damages. An adjournment would have been one way to get\n\nthe case ready for continued trial. But in my judgment, it was far neater for the\n\ndefendants to institute fresh proceedings on the counterclaim and it was only responsible\n\non my part to deal with the claims.13 I now turn to my rejection of the plaintiffs’ claim of $45,000\n\nunder Bill 1 for \"Preliminaries and General.\" In the plaintiffs’ offer of\n\n30 May 1996 which appeared in the FINAL SUMMARY, they added by words in handwriting the\n\nfollowing: \"(For Supervision Costs only)\" for which they put down the figure of\n\n$82,500.00. The defendants’ award contained the FINAL SUMMARY which had the item\n\n\"PRELIMINARY AND GENERAL\" and the amount put against it was $45,000.00.14 I concluded that the plaintiffs’ earlier and limited meaning\n\nascribed to this item, which in this business usually covers a contractor’s site\n\noffice, site staff, own tools and machinery and transport of workers, was never at any\n\ntime accepted by the defendants. Their award, which was accepted by the plaintiffs who\n\nproceeded with the works on the basis of the award, must therefore in this respect carry\n\nthe usual meaning.15 It was also contended on behalf of the plaintiffs that the\n\ndefendants did not object to the plaintiffs’ definition of what constituted\n\n\"preliminaries and general\". That was in one sense true as a matter of fact. But\n\nthat was beside the point. The defendants did not accept the definition by repeating them.\n\nAs the words were omitted, that expression must be taken as referring to the ordinary\n\npreliminary and general items in any building contract.16 In fact, in an earlier affidavit affirmed by Eng Meng Chor on 27\n\nOctober 1998 he deposed under para 14.4(4) that the preliminaries of $45,000.00 were for\n\n\"transporting of workers, own tools and machinery, site office and site staff\".\n\nThe claim of the plaintiffs was based on the provision of two site supervisors (one of\n\nwhom included Mr Eng himself) who kept an eye on the work of the plaintiffs’\n\nsub-contractors. No evidence was led by the plaintiffs regarding transport of workers,\n\nprovision of own tools and machinery, site office (of which there was none provided in\n\nfact) and site staff. The plaintiffs’ claim therefore was not proved.17 As there is no appeal against my decision allowing the claims of the\n\nplaintiffs, I need only say that it was refreshing to hear the defendants’ witnesses\n\nhonestly admitting the claims of the plaintiffs.Lai Kew ChaiJudgeCopyright © Government of Singapore."
    }
}