{
    "case_title": "Public Prosecutor v Thiruselvan s/o Nagaratnam",
    "ncitation": "[2000] SGHC 204",
    "coram": "Chan Seng Onn JC",
    "sections": {
        "Brief facts": "1.    The accused,\n\nThiruselvan s/o Nagaratnam, was a lashing worker working in the Port of Singapore\n\nAuthority (‘PSA’). He resided at Blk 645 Ang Mo Kio Avenue 6, #12-4995,\n\nSingapore. He was charged with abetting one Katheraven s/o Gopal (‘Katheraven’)\n\nin trafficking in 807.6 grams of cannabis on 13 January 2000 at about 3.40 p.m. at Ang Mo\n\nKio Avenue 6, Singapore.2.    The prosecution led\n\nevidence that Katheraven met an undercover Narcotics Officer, Sgt Andrew John Joachim\n\n(‘Andrew’), at Blk 123, Bukit Merah View on 13 January 2000 at about2.45 p.m.\n\nKatheraven offered to sell 1 kilogram of cannabis to Andrew at a price of $2200 plus $500\n\nas commission. Andrew asked if the price could be lowered. Katheraven made some calls on\n\nhis handphone (number 97603714) and spoke in Tamil. Later Katheraven told Andrew that the\n\nprice could not be lowered. Upon confirmation of the deal, Katheraven made some calls on\n\nhis handphone number 97603714.3.    Based on the Mobile\n\nOne (Asia) Pte Ltd records, there were 4 successive outgoing calls from Katheraven’s\n\nhandphone traced to a pager no: 96069940 belonging to the accused between 3.00 pm and 3.04\n\npm. followed by a return call from the accused’s home telephone number 4525161 at\n\nabout 3.05 p.m., which lasted for about 3 minutes and 20 seconds. Another call came\n\nthrough to Katheraven’s handphone a few minutes later at 3.13 p.m. again from the\n\naccused’s home telephone and this call was 1 minute and 43 seconds long.4.    Katheraven then\n\ninformed Andrew that his supplier was about to leave his house. As Katheraven had to go to\n\nAng Mo Kio to collect the drugs, Andrew obliged Katheraven by giving him a lift in his\n\ncar. Katheraven directed the way and eventually, they arrived at the car park at Blk 646\n\nAng Mo Kio Street 61 at about3.30 p.m.5.    Katheraven informed\n\nAndrew that he would be back in ten minutes. He then got out of the vehicle and walked\n\ntowards the direction of Blk 648 Ang Mo Kio. The telephone records showed that\n\nKatheraven’s handphone had been used to page the accused’s pager twice at 3.36\n\np.m. and 3.40 p.m.6.    Subsequently,\n\nKatheraven was seen running back towards Andrew carrying something underneath his T-shirt.\n\nHe got into the vehicle, lifted his shirt and took out a slab of cannabis, which was\n\ntucked in his pants. After Katheraven handed the slab to Andrew, he was arrested.7.    Following\n\nKatheraven’s arrest, there were altogether 20 incoming calls to Katheraven’s\n\nhandphone from the accused’s home telephone between 3.49 p.m. and 6.37 p.m., which if\n\nnot answered, would be diverted to the voice mail facility on Katheraven’s handphone.\n\nCpl Anan Devan (‘Anan’) testified that Katheraven’s handphone rang several\n\ntimes but he answered only four calls, all of which were from the same caller.1sttelephone call8.    According to Anan, he\n\nanswered the 1stcall at about7.20p.m. Based on the telephone records,\n\nthere was an incoming call to Katheraven’s handphone at7.13p.m. lasting some\n\n2 minutes and 28 seconds from telephone number 4549968 which was a public phone at Sin\n\nHong Heng Department Store at Blk 632 Ang Mo Kio #01-952. It was not disputed that the\n\naccused had made this call.9.    It would appear that\n\nthe times indicated in the telephone records and those recorded by the CNB officers were\n\nout of synchronization by about 7 minutes. I suspected this to be the case with the other\n\ntimes given by the rest of the CNB officers in their conditioned statements.10.    The caller in this 1stcall asked for \"Kathi\". Anan told him that \"Kathi\" was not around and\n\nthat he was holding on to Katheraven’s handphone. When the caller asked who he was,\n\nAnan said that he was a friend of \"Kathi\". The caller identified himself as\n\n\"Thiruchy\". Anan could not remember most of the other details of the\n\nconversation. However, he distinctly remembered the caller saying in Tamil, \"Porula\n\nEdutha Karsai Tharunam\", which meant, \"If the thing is taken, the money must be\n\npaid.\" Anan then told the caller that he would not cheat him but would pay him the\n\nmoney.11.    Anan believed that\n\nthe caller mistook him for someone else and he informed the other members of the CNB team\n\nof it. When asked by defence counsel, who the witness thought the accused had mistaken him\n\nfor, Anan said it could be someone who had purchased the drug and who would be able to pay\n\nhim the money. Counsel put to Anan that the accused had told him the following in this 1stcall:(a) Kathi (in short for Katheraven) had\n\n  got him into some trouble.(b) Kathi had taken something using his\n\n  name.(c) People were there now demanding money\n\n  from the accused.(d) Kathi was to come down to Ang Mo Kio,\n\n  Blk 632 to sort out the matter.(e) He was to tell Kathi to bring down the\n\n  money and pay them off.12.    Anan denied that the\n\naccused had said any of the above to him. He maintained that the accused told him to pay\n\nup the money whereupon he replied that he would come and pay the money, and that he would\n\nnot cheat him.2ndtelephone call13.    Shortly thereafter,\n\nthe same caller (i.e. Thiruchy) called Kathevaren’s handphone and Anan answered the\n\ncall. The telephone records revealed that this 2ndincoming call at 7.30 p.m.\n\nwas again from the same public phone. It lasted a short 31 seconds.14.    Thiruchy asked for\n\nKathi. Anan said he was not around. Anan then asked where he wanted the money to be handed\n\nover to him. Thiruchy replied that he would be at the coffee shop at Blk 630 Ang Mo Kio.\n\nAnan asked how he was to recognise him. Thiruchy said that he would be wearing a\n\n‘Milan’ white soccer jersey and a pair of soccer shorts. Anan told him that he\n\nwould be there shortly to pass him the money.15.    Counsel put to Anan\n\nthat he told the accused that he would come with Kathi down to Blk 632. Anan disagreed.\n\nAnan further denied that the accused ever told him to come down quickly and that the\n\npeople were waiting.16.    It made no sense for\n\nAnan to say that he would be bringing Katheraven with him since Katheraven had been\n\narrested. Undue suspicions would be raised if Anan were to be seen coming without\n\nKatheraven. I was thus inclined to believe Anan’s evidence.3rdtelephone call17.    Whilst Anan was\n\nproceeding to Ang Mo Kio, Thiruchy called him again asking when he would reach the coffee\n\nshop. Anan informed him that he was on his way. From the records, this 3rdcall\n\nwas at 7.47 p.m. from telephone number 4520742 lasting some 1 minute and 53 seconds.18.    Counsel put to Anan\n\nthat similarly in this third call, the accused had expressed his grievances repeatedly,\n\n\"Look, Kathi has put me in trouble. What are you guys doing? You all have spoilt my\n\nname. People are chasing me now. Come down quickly.\" Anan categorically denied this.4thtelephone call19.    On arrival, Anan\n\ntogether with SSgt Mohd Azam spotted a male Indian fitting the description of Thiruchy in\n\nthe company of two other male Indians in a coffee shop at Blk 632, next to an open garden\n\nas was earlier described by Thiruchy.20.    At about8.15p.m., Thiruchy called again. The telephone records showed a call made from a public phone\n\n(no: 4522407) at Lian Gee Huat Restaurant at Blk 632 Ang Mo Kio #01-948 to\n\nKatheraven’s handphone at8.09p.m. lasting some 41 seconds. The\n\nout-of-synchronization in the timing would be some 6 minutes.21.    At this 4thand final telephone call, Thiruchy asked Anan where he was and whether he was on his way.\n\nAnan told Thiruchy that he was in the vicinity but he did not feel safe to go to the\n\ncoffee shop. Instead, he would meet him in front of the bus stop at Blk 639 Ang Mo Kio\n\nAvenue 6. Thiruchy agreed.22.    Counsel put to Anan\n\nthat the accused had told him that the party waiting to collect the money had left and\n\ntherefore Anan need not come. Again Anan disagreed.Arrest of the accused23.    At the bus stop, the\n\naccused was arrested. He was wearing a ‘Milan’ white soccer jersey. It was put\n\nto Anan that he had asked the accused where were the people now i.e. those persons waiting\n\nto collect their money. Anan denied that he had ever asked that question.24.    When the accused was\n\nbeing brought to his registered address for a search, the accused denied that he was the\n\ncaller or that he was known as \"Thiruchy\".25.    Upon reaching the\n\naccused’s flat, Anan knocked on the door and a lady, later ascertained to be the\n\naccused’s wife, opened the door. When Anan asked her in Tamil if Thiruchy was in, she\n\nsaid that he was not at home. At this juncture, the accused shouted in Tamil that he was\n\nonly known by his first name ‘Thiruselvan’.26.    The accused was\n\nlater brought back to Ang Mo Kio Police Division HQ for an Instant Urine Test for\n\ncontrolled drugs. He was tested positive for opiates.",
        "Voluntary statements of the accused": "27.    As the accused had\n\nnot challenged the voluntariness of several statements given, they were accordingly\n\nadmitted into evidence without any voire dire. I would set them all out.28.    At 10.45 p.m. on 13\n\nJanuary 2000, Inspector Xavier Lek recorded the following answers of the accused to his\n\nquestions:Q: Do you know Katheraven s/o Gopal?A: I do not know his real name but I know him as ‘Kathir’.Q: How do you know ‘Kathir’A: By my wife. My wife stay in Bukit Merah in the past and get to know him.Q: What are you doing at the bus stop in\n\n  front of Blk 639 Ang Mo Kio?A: I went to take money and then take bus to interchange.Q: Who are you take the money from?A: My friend told me to take the money from a guy wearing a black top and black pant.Q: Who is your friend?A: My friend is ‘Thambi’, he used to sit with me at the coffeeshop of Blk 632\n\n  Ang Mo Kio.Q: How can you find ‘Thambi’?A: I can find him at Blk 632 Ang Mo Kio coffeeshop.Q: Do you know ‘Thambi’ contact\n\n  number?A: I don’t know.29.    At 2.10 a.m. on 14\n\nJanuary 2000, the accused gave the following answers which ASP Fan Tuck Chee (‘ASP\n\nFan’) recorded in his field book:Q1: Why were you arrested?A1: Because I went to take the money. One of my friends tell me to go and take the money\n\n  from somebody.Q2: Who is your friend?A2: His name is ‘Thambi’. He is a Malaysian.Q3: How did ‘Thambi’ inform you\n\n  to collect the money?A3: He paged me to ask me to come to the coffeeshop. ‘Thambi’ then called me and\n\n  asked me to collect the money from a man with black shirt and trousers. He also asked me\n\n  what I wear and told him I am wearing soccer shirt and trousers.Q4: What time did ‘Thambi’ page\n\n  you?A4: 3 to 4 o’clock.Q5: What number?A5: A handphone starting with 9760. The rest I can’t remember.Q6: How did you call him back?A6: I call from my house phone 4525161.Q7: Who was at home when you called?A7: Only me, my wife and 2 children.Q8: How much money you suppose to collect?A8: Thousand something.Q9: What is the money for?A9: He told me that it’s worker’s money.Q10: Do you know this man?A10: I got see him before but I never talk to him. My wife knows him as a neighbour. He\n\n  also ever see me with my wife.Q11: How many times did you call\n\n  ‘Thambi’ on the day when you were arrested?A11: 2 times. Both from home.30.    In another statement\n\ngiven later at 3.40 p.m. to ASP Fan, the accused explained that his urine was tested\n\npositive because he had taken a cough mixture. He stated, inter alia, that on 13 January\n\n2000, while he was with Shanmugam drinking beer at the coffee shop, Thambi telephoned him\n\nand requested a favour from him to collect money from somebody as he had urgent matters in\n\nJohor to attend to. Thambi asked him what he was wearing and the accused said that he was\n\nwearing a ‘Inter Milan’ jersey and shorts. Thambi said he would call him again.\n\nThambi later called back and told the accused that he had already informed this person\n\nwhat he was wearing. If a man wearing black shirt and trousers approached him, he was to\n\nidentify himself as a friend of Thambi and a sum of money of thousand plus dollars would\n\nbe given to him. The man would be at the bus stop in front of Blk 639 Ang Mo Kio. Thambi\n\nsaid he would page the accused to collect the money from him. In this statement, the\n\naccused denied knowing Katheraven. When ASP Fan showed him a photograph of Katheraven, the\n\naccused did not recognise him. The accused denied knowing that the money he was collecting\n\nwas drug money. He was only helping a friend whom he did not know was involved in drugs.31.    In his cautioned s\n\n122(6) statement recorded 5 days later on 19 January 2000, the accused denied the charge\n\nof abetting Katheraven in an offence of trafficking and stated the following in his\n\ndefence:I do not know this person at all. I have\n\n  never spoken to him also. An acquaintance of mine requested me to do a favour for him. He\n\n  told me to collect money supposed to be given to workers from a person. When I asked him\n\n  how I could recognise him, he told me that the person would be wearing black shirt and\n\n  black pants and would be waiting at the bus-stop. He asked me what attire I would be\n\n  wearing and I told him I would be in a football attire. I further told him that I would go\n\n  there but I would leave immediately if I could not see the person and I would not wait as\n\n  I have to buy some things for my children. I went there but left the place when I do not\n\n  see anyone there. When I was walking away, some men came and arrested me. I do not plea\n\n  guilty to this charge. The salary that I am earning is more than enough for my family. As\n\n  such, I do not have to do this. I will not trust any friends anymore. Please show leniency\n\n  towards me for something I have not done.32.    Up till now, the\n\naccused was giving the version that he did not know Katheraven. In this version, he had\n\nnot spoken with Anan in any of the said 4 telephone calls. Neither had he arranged with\n\nAnan to meet at the bus stop where he was eventually arrested. He merely agreed to doa\n\nfavourfor Thambi who instructed him to collect a sum of over a thousand dollars from\n\na person wearing black shirt and trousers at the bus stop. There was no mention that he\n\nwas threatened or compelled by Thambi or Joe into doing it. Neither was there any mention\n\nof any conversation concerning a $300 loan by Katheraven at this stage.33.    Some 6 days later on\n\n25 January 2000, the accused gave a further statement to ASP Fan where he said that he had\n\nnot told the whole truth. I noted that the accused had plenty of time by now to mull over\n\nhis case and the events. He said that he had not mentioned ‘Joe’ a friend of\n\nThambi. He now admitted knowing Katheraven and that Katheraven did contact him on 13\n\nJanuary 2000 and that he had given him his pager number 96069940. Katheraven called him\n\n‘Thirichi’. He narrated the following the events that took place on 13 January\n\n2000:24. On 13 January 2000 at about 2\n\n  something in the afternoon, ‘Kathi’ paged me and asked if ‘Thambi’ had\n\n  called me. He also told me that he had arranged to meet ‘Joe’ or\n\n  ‘Thambi’ and ‘Thambi’ was actually supposed to call him. As I had the\n\n  number of ‘Joe’ then, ‘Kathi’ asked me to call ‘Joe’ and I\n\n  agreed. I then called ‘Joe’ and told him that there was an arrangement between\n\n  ‘Thambi’ and ‘Kathi’ to meet up and ‘Kathi’ is waiting for\n\n  the call from ‘Thambi’. ‘Joe’ informed me that he is aware of the\n\n  arrangement and he is waiting for ‘Thambi’s call. Further to that,\n\n  ‘Joe’ asked for ‘Kathi’s phone number and told me that he will contact\n\n  ‘Kathi’ when he reaches Ang Mo Kio. In the meantime, I am to inform\n\n  ‘Kathi’ that ‘Joe’ is on the way to Ang Mo Kio. All this while, I was\n\n  using my house phone to contact both ‘Joe’ and ‘Kathi’.25. About 30 to 40 minutes later,\n\n  ‘Kathi’ paged me again. I returned his page and he informed me that he is on the\n\n  way to Ang Mo Kio. I then gave him the handphone number of ‘Joe’ so that he\n\n  could contact ‘Joe’ direct. I cannot remember \"Joe’’s handphone\n\n  number now because I wrote in on a piece of paper and I had already returned it to\n\n  ‘Joe’.26. About another 10 minutes later,\n\n  ‘Kathi’ paged me to ask if I will be there to see him. I replied no and he hung\n\n  up the phone. ‘Karthi’ had paged me using his handphone and I cannot remember\n\n  the number. I am now given my pager to check for ‘Kathi’’s handphone number\n\n  but I cannot recall which is the handphone number of ‘Kathi’. (Recorder’s\n\n  note:- Accused was asked to identify the handphone number of ‘Kathi’ from his\n\n  pager which was seized but he could not identify any).27. On 13.1.2000 at about 6.40 p.m., while\n\n  I was at the coffeeshop at Blk 632 Ang Mo Kio Street 61 with ‘Shanmugam’,\n\n  ‘Thambi’ approached me when ‘Shanumgam’ was not around. He asked me to\n\n  follow him to the coffeeshop at Blk 630 Ang Mo Kio Street 61 as ‘Joe’ is at that\n\n  coffeeshop. I told ‘Thambi’ that I could not leave as yet and asked\n\n  ‘Thambi’ to go back first. When ‘Shanmugam’ returned, I told him that\n\n  I have to go somewhere and left for the coffeeshop at Blk 630 Ang Mo Kio. Shanmugam was\n\n  still at the coffeeshop when I left.28. When I reached the coffeeshop at Blk\n\n  630 Ang Mo Kio, ‘Joe’ and ‘Thambi’ were sitting there.\n\n  ‘Thambi’ then asked me how well I know ‘Kathi’ and I replied that he\n\n  is a close friend. ‘Joe’ asked me where ‘Kathi’ is staying and I asked\n\n  him why he needs to know the home address. ‘Thambi’ then told me that on\n\n  12.1.2000, when ‘Thambi’ managed to get ‘Kathi’ on his handphone and\n\n  ‘Kathi’ asked him to recommend a seller for something. I asked\n\n  ‘Thambi’ what is that something and he told me that it is ‘ganja’.\n\n  ‘Thambi’ also told me that he recommended ‘Joe’ who sells ‘ganja’\n\n  to ‘Kathi’. He also told me that on 13.1.2000, ‘Kathi’ contacted\n\n  ‘Joe’ directly and I was asked how did ‘Kathi’ get\n\n  ‘Joe’’s number as ‘Kathi’ was supposed to wait for\n\n  ‘Thambi’ to call. I replied that I was the one who gave the number to\n\n  ‘Kathi’. ‘Joe’ then told me that ‘Kathi’ took the\n\n  ‘thing’ from him and when ‘Joe’ asked for the money, ‘Kathi’\n\n  told him that he will return the money later. ‘Joe’ initially refused but\n\n  ‘Kathi’ said that he is a very close friend of mine and finally ‘Joe’\n\n  agreed with the arrangement. ‘Joe’ also informed me that ‘Kathi’ took\n\n  the ‘ganja’ and never came back. ‘Joe’ insisted that I pay$2,220/-on behalf of ‘Kathi’ and I refused. We quarrelled and ‘Joe’ asked me\n\n  to return the money by 8 o’clock that night but he did not tell me how am I going to\n\n  hand over the money. ‘Joe’ threatened me that if I do not return the money by 8\n\n  o’clock, he will harm me. He also told me that the money used to buy the ‘ganja’\n\n  is workers’ money and they need the money back. I told them that I will contact\n\n  ‘Kathi’ and if I find him, I will ask him to pay up. I then left and returned to\n\n  the coffeeshop at Blk 632 Ang Mo Kio and met up with ‘Shanmugam’ again.29. At the coffeeshop at Blk 632 Ang Mo\n\n  Kio, I called ‘Kathi’ on his handphone and somebody answered the phone, it was\n\n  not ‘Kathi’. I spoke to the person in Tamil and asked him who he was and the\n\n  person identified himself as ‘Kathi’’s friend. He asked me to leave a\n\n  message. I then told the person on the line to ask ‘Kathi’ ‘what did he\n\n  take away just now’ and that ‘the people here are waiting for the money’. I\n\n  also told the person to inform ‘Kathi’ to come to the coffeeshop at Blk 632 to\n\n  return the money. The person said that he will inform ‘Kathi’ and asked me to\n\n  call in to the handphone again. All this while, I have been at the coffeeshop at Blk 632\n\n  Ang Mo Kio. (Emphasis is mine).34.    In a further\n\nstatement on the following day, 26 January 2000, the accused elaborated on the calls he\n\nmade to Katheraven’s handphone with Anan as follows:31. …..On 13.1.2000, at about 7\n\n  something in the evening, I called into ‘Kathi’’s handphone from a public\n\n  phone at Blk 632 Ang Mo Kio coffeeshop. The purpose of me calling ‘Kathi’ is to\n\n  ask him to repay the$2,220/-to ‘Joe’. The person answering the call\n\n  asked me who I am and I replied that I am ‘Thirichi’. After I had informed him\n\n  about the purpose, the person asked me where I was and I told him I was at the coffeeshop\n\n  at Blk 632 Ang Mo Kio. The person then asked me to call back as ‘Kathi’ is not\n\n  around.32. About 5 minutes later, I called\n\n  ‘Kathi’ again using the public phone. The friend of ‘Kathi’ answering\n\n  the call told me that ‘Kathi’ was busy. I told the person that ‘Kathi’\n\n  had used my name and got me into trouble. I did not tell him that the trouble is\n\n  concerning ‘ganja’. Without me asking, the person I talked to told me\n\n  that he has got the money and he will bring the money down to me in 20 minutes time but he\n\n  did not tell me the amount. I then told him to come as soon as possible and I will wait\n\n  and show him who he was to pass the money to. I also told the person that I am wearing\n\n  soccer jersey and shorts and he in return told me that he is wearing black shirt and\n\n  trousers. Our conversation then ended. Karthi’s friend did not tell me his name.33. After I finished speaking to\n\n  ‘Kathi’’s friend, ‘Thambi’ called me at the public phone and I\n\n  told him about ‘Kathi’s friend handing over the money. ‘Thambi’ then\n\n  told me that he and ‘Joe’ has to go and ask me to inform ‘Kathi’s\n\n  friend that he will contact ‘Kathi’ on his own at 5 o’clock the next day to\n\n  make sure that ‘Kathi’ pays up. I agreed and we ended the conversation.34. When I returned to the table to drink\n\n  with ‘Shanmugam’, he asked me what was the problem. ‘Boy’ [i.e.\n\n  ‘Prakas’] was also there. I then told both of them that ‘Kathi’ had\n\n  used my name to buy drugs and the people are now chasing for the money. I did tell them\n\n  that ‘Kathi’s friend will be coming to see me with the money and I also told\n\n  them directly that it is drug money. However, I did not tell them that the drugs refer to\n\n  ‘ganja’.35. Just before I left the coffeeshop with\n\n  ‘Shanmugam’ and ‘Boy’, I called into ‘Kathi’’s\n\n  handphone again intending to ask him not to come to the coffeeshop. However, the person\n\n  told me that he was already at Blk 639 Ang Mo Kio. I agreed and when I reached the\n\n  bus-stop, I was arrested. (Emphasis is mine.)35.    From the above,\n\nclearly Kathi’s friend (i.e. the undercover CNB officer Anan) was not coming with\n\nKathi to meet the accused to pay the money. The accused further knew the amount was\n\nexactly $2,220. Again there was no mention of any $300 loan that the accused was going to\n\ncollect from Kathi at that meeting at the bus stop. The significance of all this would\n\nonly be apparent later.",
        "Evidence of Katheraven": "36.    The prosecution\n\ncalled the accomplice, Katheraven, to testify. Katheraven admitted that he had pleaded\n\nguilty in the High Court on 16 June 2000 to two trafficking charges in relation to a drug\n\noffence committed on 13 January 2000. He was sentenced to 25 years’ imprisonment and\n\n24 strokes of the cane.37.    Katheraven testified\n\nthat his friend, Selvan, had telephoned him at his home on 13 January 2000 at about 12.45\n\np.m. and asked for one kilogram of cannabis. Selvan said that his friend Andrew wanted it.38.    Katheraven revealed\n\nthat he did page for the accused within half an hour of the call from Selvan. However, he\n\ndenied that the accused had called him back.39.    I did not believe\n\nhim. The telephone records revealed that at about 12.52 p.m., there was an outgoing call\n\nfrom his handphone to the accused’s pager number not long after Selvan had called\n\nasking for the cannabis. Within two minutes, there was an incoming call from the\n\naccused’s home telephone number, and the call lasted 9 minutes and 53 seconds. I drew\n\nthe inference that Katheraven had spoken with the accused soon after Selvan had, at the\n\nrequest of Andrew, asked for a kilogram of cannabis.40.    When confronted with\n\nthis evidence, Katheraven simply evaded the issue and said he could not remember. However,\n\nduring cross-examination, he surprisingly recalled speaking with the accused at about 1.00\n\np.m. but it was about returning the $300 that he allegedly borrowed from the accused about\n\na week or two prior to his arrest. Katheraven denied discussing with the accused about\n\ndrugs in any of his telephone conversations with him. From the vacillations in his\n\nevidence, I did not find him to be a reliable witness in court.41.    Katheraven then\n\nclaimed that at about 1.00 p.m., he used his handphone to call Joe Baskeran, who was known\n\nto him for about a year and who had in fact supplied the cannabis to him. According to\n\nKatheraven, Joe Baskeran’s number was 97517643.42.    When confronted with\n\nthe telephone records that there was no outgoing call from his handphone to Joe\n\nBaskeran’s number, Katheraven quickly changed his evidence and said that he called\n\nJoe Baskeran instead from a public phone.43.    According to him, he\n\ncalled Selvan after contacting Joe Baskeran. He then met up with Selvan and his friend,\n\nAndrew. Andrew told Katheraven that he needed the ‘stuff’urgently.\n\nAndrew asked where he could get it and Katheraven told them that he would have to go to\n\nAng Mo Kio to get the stuff. Selvan and Andrew told him that if he was able to get the\n\nstuff, they would pay him $500. Selvan left.44.    Katheraven explained\n\nthat he then called Joe Baskeran on the public phone because his handphone battery was\n\nweak. Thereafter, he went back home to get the spare batteries after telling Andrew to\n\nwait for him. When he returned, he boarded Andrew’s car and they proceeded to Ang Mo\n\nKio. Whilst in Andrew’s car, he told Andrew the price.45.    However, I noted\n\nfrom Andrew’s evidence that there was no mention of Katheraven making any phone call\n\nfrom a public phone or of him going home to change his handphone batteries. If it did take\n\nplace, in all probability those material facts would be stated in his evidence. I was\n\ninclined to think that this story was fabricated on the spot by Katheraven to show that he\n\ndid call Joe Baskaran to arrange for the supply of the drugs so as to deflect the\n\nculpability away from the accused. When his handphone records revealed that no calls were\n\nmade to Joe Baskaran, he had to lie that he used a public phone.46.    Katheraven testified\n\nthat when he was in Andrew’s car on the way to Ang Mo Kio, he used his handphone to\n\npage the accused. The accused returned his call. Katheraven purportedly told the accused\n\nthat he was going to Ang Mo Kio and that if he were to pass by his house, he would return\n\nthe loan of $300. But later in his testimony, Katheraven said that he could not remember\n\nwhether he had spoken to the accused about the return of the $300 whilst he was in\n\nAndrew’s car. This indicated that the $300 loan might well be a red herring which had\n\nto be scrutinised.47.    On reaching Avenue\n\n6, Ang Mo Kio, Katheraven told Andrew to park at a car park in Avenue 6. Katheraven got\n\nout and proceeded to meet Joe Baskaran at the coffee shop at Blk 630. Joe Baskaran took\n\nhim to the toilet in this coffee shop and gave him one kilogram of cannabis. He tucked it\n\nin his trousers and returned to the car park. He went into Andrew’s car and handed\n\nthe cannabis to Andrew.48.    When asked by the\n\nlearned DPP whether he or anyone used his handphone whilst in the coffee shop, Kathevaren\n\nsaid no one did.49.    As his oral evidence\n\ncontradicted his previous statements, the learned DPP applied to cross-examine Katheraven.\n\nI allowed the DPP’s application.50.    Katheraven denied\n\nthat the accused was involved in the supply or sale of the drugs to him. He maintained\n\nthat he had not called the accused to ask if he had any cannabis nor tell him that he\n\nneeded one kilogram of cannabis. Neither did the accused tell him that he would arrange\n\nfor the Malaysian supplier to deal directly with Andrew. Katheraven again denied that the\n\nMalaysian supplier had borrowed his handphone at the coffee shop to page for the accused\n\nat 96069940.",
        "Section 147 Evidence Act": "51.    As a result of these\n\nmaterial contradictions, the prosecution sought to admit the previous inconsistent\n\nstatements under s 147(3) of the Evidence Act as evidence of facts stated therein. I found\n\nthat these statements were admissible for that purpose.52.    The controversies\n\nsurrounding the ambit of s 147 (3) of the Evidence Act were settled by the Court of Appeal\n\ninChai Chien Wei Kelvin v Public Prosecutor[1999] 1 SLR 25, where Yong Pung How\n\nCJ delivering the judgment of the Court of Appeal said at p 58:..Section 157 (c) [of the Evidence Act]\n\n  provides for the impeachment of a witness’s credit by proof of former inconsistent\n\n  statements. Section 147 contains the general scheme governing cross-examination on\n\n  previous inconsistent statements. Section 157 could not be said to bring in only s 147 (1)\n\n  and (2). This point had already been dealt with inSng Siew Ngoh[1996] 1 SLR 143at pp 149-150 as follows:It is clear then that there is a general\n\n    scheme governing cross-examination on previous statements. Section 157 of the Evidence Act\n\n    cannot be said to only bring in sub-s (1) [of s 147]. The other subsections also govern\n\n    the cross-examination of previous statements. They cannot be separated from sub-s (1).\n\n    Through this reference to s 147, the whole of that section is brought in, including s\n\n    147(3). It also has to be noted that s 147 (3) explicitly states that it applies ‘in\n\n    any proceedings’, and does not purport to be restricted to specific circumstances,\n\n    which would have to be the case had it been intended that s 147(1) were to operate\n\n    independently of s 147 (3).Therefore, the consequences that follow\n\n  upon proof of a former statement inconsistent with any part of the witness’s evidence\n\n  which is liable to be contradicted are first, that his credit is impeached under s 157(c)\n\n  and second, that his former statement is admissible as evidence of any fact stated therein\n\n  under s 147 (3). The weight to be attached to the statement is determined by the factors\n\n  stipulated in s 147 (6).53.    In a recent decisionSelvarajan James v Public Prosecutor(Criminal Motion No 9 of 2000) delivered on 21\n\nAugust 2000, the learned Chief Justice succinctly set out the factors that the court\n\nshould consider when determining the weight to be attached to a statement admitted under s\n\n147. He said:25. ….Section 147 (6) provides\n\n  guidance as to the weight to be attached to such statements:In estimating the weight, if any, to be\n\n    attached to a statement admissible in evidence by virtue of this section regard shall be\n\n    had to all the circumstances from which any inference can reasonably be drawn as to the\n\n    accuracy or otherwise of the statement and, in particular, to the question whether or not\n\n    the statement was made contemporaneously with the occurrence or existence of the facts\n\n    stated, and to the question whether or not the maker of the statement had any incentive to\n\n    conceal or misrepresent the facts.In the case ofPP v Tan Kim Seng\n\n  Construction Pte Ltd & anor(1997) 3 SLR 158, I said that, in addition to the\n\n  above, other factors that will affect the weight accorded to such previous inconsistent\n\n  statements are: (1) an explanation of the inconsistency, and why that statement is an\n\n  inaccurate representation of the facts; (2) the context of the whole statement and the\n\n  circumstances affecting its accuracy; and (3) the cogency and coherence of the facts to be\n\n  relied upon.26.    This issue was further expounded by\n\n  the Court of Appeal inChai Chien Wei Kelvin v PP(1999) 1 SLR 25 where I said:First, the contemporaneity of a statement\n\n    with the occurrence or existence of the facts stated is important for it guards against\n\n    inaccuracy, though the degree of contemporaneity required will vary with the facts in\n\n    question. The recollection of the details of particular events, particularly where these\n\n    occur quickly, is easily susceptible to error with time but the recollection of the\n\n    existence of a relationship is not so malleable. Second, there can be little guidance on\n\n    the possibility of misrepresentation by the maker of the statement but the court must be\n\n    astute in spotting such instances. Third, in addition to the above matters, the weight to\n\n    be accorded to a prior inconsistent statement will be affected materially by an\n\n    explanation of the inconsistency and why that statement is an inaccurate representation of\n\n    the facts. Fourth, regard should be had to the context of the statement. Subsection (6)\n\n    does not restrict consideration to only the making of the statement but requires\n\n    consideration of all the circumstances affecting its accuracy. Thus the court must\n\n    consider the context of the inconsistent portions, which requires that the whole of the\n\n    statement be examined. Reliance cannot be placed on a portion of the statement that is\n\n    taken out of context. Finally, the cogency and coherence of the facts to be relied upon\n\n    has to be noted. An ambivalent statement does not attract much weight.Inconsistent statements of Katheraven54.    I would deal\n\nseparately with the 3 inconsistent statements made by Katheraven viz (a) the Statement of\n\nFacts (‘SOF’) which he admitted to in Court when he pleaded guilty; (b) the\n\nsigned statement given on 16 June 2000; and (c) the signed statement recorded on 20\n\nJanuary 2000.55.    In determining the\n\nweight to be given to the statements admitted for the purpose stated in S147 (3), I gave\n\nfull consideration to the factors elucidated inSelvarajan James v Public Prosecutor.(a) Statement of Facts (SOF)56.    Katheraven initially\n\nclaimed that the SOF was not read to him in court. In my judgment, he was obviously lying.\n\nIn the usual course, the SOF would have been interpreted and explained to him and he would\n\nhave admitted to them without qualification. Otherwise, the High Court would not have\n\nconvicted him on his plea of guilt.57.    Later Katheraven\n\nchanged his testimony and alleged that he admitted to untrue facts in the SOF in relation\n\nto the accused’s involvement out of fear. This was dubious. Having been advised by\n\ncounsel, I found it difficult to accept that his admission without qualification to the\n\nSOF in the High Court was involuntary or that he had admitted to facts in the SOF without\n\nregard to whether he was wrongly accusing another innocent man of a very serious crime\n\nbecause he was in fear. It was even more unbelievable that Katheraven was prepared to\n\nfalsely implicate the accused, who was his childhood friend, out of fear.58.In my opinion,\n\ncounsel advising accused persons pleading guilty in a court of law have a duty to confirm\n\nwith their clients that whatever material facts in the SOF that their clients are\n\nadmitting to are factually accurate and true, and their admissions to the SOF are\n\ncompletely voluntary. If not, they are to advise their clients to qualify the SOF\n\naccordingly. If for some reason their clients are unable to articulate their\n\nqualifications to the SOF read out and interpreted to them in court, counsel have to\n\nassist by pointing out to the court parts of the SOF that their clients wish to qualify\n\nand they should state unequivocally that their clients’ admissions to the SOF are\n\ninvoluntary if that were to be the case. The court will then have to decide whether to\n\naccept the plea of guilt and to convict accordingly based on the SOF as qualified.\n\nCounsel’s responsibilities assume even greater importance where the SOF implicates\n\nanother person in a commission of a serious offence.59.    In this case, there\n\nwas no evidence before me that counsel acting for Kathevaren had acted in dereliction of\n\nhis basic duties to his client and to the court when his client pleaded guilty. When the\n\ncourt asks an accused person whether he is admitting to the SOF without qualification\n\n(which necessarily includes a qualification of involuntariness if any), and the accused\n\nconfirms to the judge that he is, that SOF becomes an oral voluntary confession or\n\nadmission of the accused under s 17 of the Evidence Act, which is a situation analogous to\n\ns 124 of the Criminal Procedure Code where a Magistrate records a statement or confession\n\nmade to him before the commencement of an inquiry or trial. For these reasons, I did not\n\nthink that there would be any need for a voire dire prior to admitting the SOF for the\n\npurpose stated in s 147 (3).60.    In the SOF, it was\n\nstated that Katheraven had used his handphone to contact the accused and request for one\n\nkilogram of cannabis. The accused informed him that he would arrange for the supplier to\n\nmeet him. The accused reminded him that the drugs would cost $2220. When he informed the\n\naccused that the payment would only be made after the buyer had inspected the drugs, the\n\naccused agreed. The accused thereafter instructed him to meet a man wearing a blue shirt\n\nand trousers at the coffee shop at Block 630 Ang Mo Kio Avenue 6 to collect the drugs from\n\nhim. Katheraven met the supplier, who gave him a block of vegetable matter. This supplier\n\ntold Katheraven to pay the accused for the drugs. Katheraven then handed over the drugs to\n\nAndrew, who posed as a buyer. Katheraven was arrested subsequently. The block of vegetable\n\nmatter seized was analysed by the Department of Scientific Services to contain 807.6 grams\n\nof cannabis and 115 grams of cannabis mixture.61.    In my opinion,\n\nthe SOF was admissible as a previous inconsistent or contradictory statement of Kathevaren\n\nand as proof of the substantive facts stated therein under S 147(3) of the Evidence Act in\n\nthe light of his denial before me of those material facts in the SOF in relation to the\n\naccused. In this regard, I would most respectfully quote what the learned Chief Justice\n\nYong Pung How had said after an extensive review of the relevant law inPublic\n\nProsecutor v Liew Kim Choo[1997] 3 SLR 699:I therefore took the view that the\n\n  statement of facts, properly classified as a confession for the purposes of s 17 [of the\n\n  Evidence Act], was a statement made by PW4. It was a statement on which he could be\n\n  properly cross-examined under s 147 of the Act. I also found that if such statement was\n\n  properly proved against him, the statement could be used as proof of the facts stated\n\n  therein by virtue of s 147(3) of the Act .. ….(b) Statement P49 dated 16 June 200062.    Following his plea\n\nof guilt and conviction, a further statement P49 was obtained from the potential witness,\n\nKatheraven, in the presence of his counsel on 16 June 2000 in the lock-up of the High\n\nCourt.63.    It was in the form\n\nof a conditioned statement where Katheraven declared that his statement was true to the\n\nbest of his knowledge and belief and that he had made it knowing that, if it was tendered\n\nin evidence, he might be liable to prosecution if he had wilfully stated in it anything he\n\nknew to be false or did not believe to be true. Recording P49 in the presence of his\n\ncounsel was a prudent step to take as it necessarily ensured that the statement so\n\ndeclared to be true was not made under any pressure, threat or harassment and there could\n\nbe no suggestion of impropriety of any kind.64.    In court however,\n\nKatheraven denied that he had given that conditioned statement. He only admitted to his\n\nsignature on the last page of P49. The prosecution consequently led evidence from ASP Fan\n\nand the interpreter Mohd Ferdhouse to prove that he did make the statement in P49. ASP Fan\n\ntestified that no threat, inducement or promises were made to Kathevaren before or during\n\nthe recording of that statement. He saw Katheraven sign on all three pages of his\n\nconditioned statement after Mohd Ferdhouse had read through everything to him in Tamil,\n\nand after Katheraven had confirmed that his statement was correct and he had no amendments\n\nto make. Katheraven later admitted in his oral testimony that Mohd Ferdhouse did ask him\n\nwhether it was his statement. When he told him that it was, Mohd Ferdhouse asked him to\n\nsign and he did. I thus found that the prosecution had proved beyond reasonable doubt that\n\nKatheraven had given his signed conditioned statement in P49.65.    P49 was obviously\n\nnot a statement recorded from an accused person by a CNB officer in the course of an\n\ninvestigation. Having been convicted, Katheraven was no longer under any investigation nor\n\nwas he an accused person at the time when his statement was taken. He was merely a\n\npotential witness giving a conditioned statement. Hence, I saw no necessity for any voire\n\ndire (whether in practice or in law) to determine the voluntariness and hence, the\n\nadmissibility of P49 prior to admitting the statement for the purposes provided under s\n\n147 of the Evidence Act since the conditioned statement was recorded when Katheraven was a\n\nmere witness, and since Katheraven was not a co-accused in this trial.66.    At the application\n\nof the learned DPP, I admitted P49 under s 147(3) as that statement similarly contradicted\n\nhis testimony in court that the accused was not his drug supplier but Joe Baskaran was.\n\nP49 was admissible as evidence of facts stated therein of which direct oral evidence by\n\nKatheraven would be admissible.67.    Just as with his\n\nearlier SOF, Katheraven continued to implicate the accused in paragraphs 5 and 6 of his\n\nP49 statement:5.    After that, ‘Selvam’ left\n\n  as he had to stand-by at his workplace and I told ‘Andrew’ that if he wanted the\n\n  stuff, I could get for him. I also told him to drive me to Ang Mo Kio Ave 6 as I wanted to\n\n  collect the stuff there. While I was with ‘Andrew’ in the car, I called\n\n  ‘Thirichi’ (Thiruselvan s/o Nagaratnam) to ask if he had any stuff, which I was\n\n  referring to cannabis. I told ‘Thirichi’ in Tamil that I needed 1 kilogram of\n\n  cannabis. He told me that he would call me back in about 5 minutes time. About 5 minutes\n\n  later, ‘Thirichi’ called me back at my handphone and I told him that I am\n\n  driving to Ang Mo Kio and asked if the stuff is ready. He answered that he had already\n\n  arranged for the stuff and told me that the stuff costs $2220/- and asked me to call him\n\n  again when I reached the carpark of Blk 645 Ang Mo Kio Ave 6. He would then arrange for\n\n  the Malaysian supplier to deal direct with ‘Andrew’. I told ‘Thirichi’\n\n  that ‘Andrew’ does not want to deal direct with the cannabis supplier.\n\n  ‘Thirichi’ asked me why ‘Andrew’ was scared and I told him not to\n\n  worry, as ‘Andrew’ is my friend. ‘Thirichi’ then told me to meet a man\n\n  called ‘Joe’ in blue shirt and trousers at the coffeeshop of Blk 630 Ang Mo Kio\n\n  Ave 6 and identify myself. The man will hand to me the cannabis and I would pay him.\n\n  However, I told ‘Thirichi’ that the buyer wanted to see the stuff and would only\n\n  pay upon seeing the stuff. ‘Thirichi’ agreed to the payment arrangement and ask\n\n  me to make sure that the money is paid.6.    After I reached Ang Mo Kio Ave 6,\n\n  ‘Andrew’ dropped me off at the carpark of Blk 646 Ang Mo Kio Ave 6 and I walked\n\n  to the coffeeshop at Blk 630 Ang Mo Kio. At the coffeeshop, the Malaysian used my\n\n  handphone to call the number 96069940. In the toilet, the Malaysian handed over a block of\n\n  cannabis to me. The cannabis was wrapped in plastic and put into a black plastic bag. As\n\n  it was bulky, I threw away the black plastic bag and hid the block of cannabis by tucking\n\n  it into my trousers. The Malaysian told me that he needed to go out somewhere and asked me\n\n  to give the money to ‘Thirichi’. At that time, I was thinking of paging\n\n  ‘Thirichi’ and paying him the money after I had collected it from\n\n  ‘Andrew’. I then left the coffeeshop and headed back to\n\n  ‘Andrew’’s car.68.    At first, Katheraven\n\nsaid that he gave his statement in P49 in fear as he was afraid that something might\n\nhappen to him. He explained that the Investigating Officer (‘IO’) had told him\n\nduring the recording of this statement that he would be hanged. Later he retracted his\n\nevidence and said that the IO did not say that to him. Katheraven was undoubtedly an\n\nunreliable witness in court.69.    As counsel was\n\npresent when his P49 statement was obtained, I found it hard to accept that he was still\n\nfearful of the CNB officers. Moreover, he was no longer in their custody but in the\n\ncustody of the prison officers by now.70.    To explain the\n\ninconsistencies and contradictions with his testimony in court, Kathevaren thereafter gave\n\na fresh reason that he had falsely implicated the accused in P49 because he was afraid\n\nthat the DPP might appeal against his sentence if he did not sign his P49 statement. He\n\nadmitted however that it was his own self-generated belief and not what the DPP or his\n\ncounsel had told him. Later on, he explained that he was in a confused state of mind and\n\nthat he did not understand what was being interpreted to him. However, he agreed that he\n\ndid not inform ASP Fan or the interpreter, Mohd Ferdhouse, that he did not understand what\n\nwas interpreted to him.71.    I was not prepared\n\nto give any weight to these lame reasons, which I believed he concocted in court to\n\ndissociate himself from the facts he himself had stated in P49 in order to save his\n\nchildhood friend from the noose if he could.(c) Statement P 29 recorded on 20 January\n\n200072.    I turn now to the\n\nstatement P29 made by Katheraven on 20 January 2000 at 3.00 p.m. to ASP Fan, which was\n\ninterpreted by Ms Caroline Edmund, a part-time foreign language interpreter. Since\n\nKatheraven admitted in his testimony that P29 was his signed statement, proof of the\n\nstatement was dispensed with when the DPP sought to have it admitted as evidence of the\n\nfacts stated therein under s 147(3).73.    I observed that\n\nnothing in s 147 (3) requires the admissibility of a statement of a witness (including one\n\nwho might have been an accomplice or an accused person) to be subject to additional proof\n\nof voluntariness. Similarly there is no specific statutory provision for admissibility for\n\nthe purposes under s 147 (1) (2) or s 157 (c) to be subject to the requirement of\n\nvoluntariness.74.    In my opinion, the\n\nsafeguards for ensuring the reliability of statements admitted under s 147 are found in s\n\n147 (6). If a statement has been involuntarily extracted from any witness (and all the\n\nmore so from a witness who at the time of giving the statement was an accused person), the\n\nweight of that statement admitted for the purpose under s 147 (3) may be significantly\n\nreduced although its admissibility per se remains unaffected.75.    But there appears to\n\nbe an accepted practice to conduct a voire dire prior to admitting a statement taken when\n\nthe witness was an accused person or an accomplice under investigation. If the statement\n\nis found to be involuntary under the very strict voluntariness requirements under s 24 of\n\nthe Evidence Act or s 122 (5) of the Criminal Procedure Code, is the entire statement\n\ninadmissible per se under s 147 (or for that matter inadmissible also under s 157(c) ) of\n\nthe Evidence Act? If so, then the involuntary statement could never be used to contradict\n\nthe witness under s147(1) or to impeach his credit under s 157(c) even if there was no\n\nintention to use the contents in that statement to prove the facts stated therein under s\n\n147(3) of the Evidence Act. That seemed extraordinary to me. To give sensible efficacy to\n\nthe various provisions, it would in my view be consistent not to introduce any impediment\n\nbased on involuntariness to the admissibility of a statement of a witness, who might well\n\nbe an accomplice, or perhaps even an accused person who had given a previous statement in\n\nanother criminal matter totally unrelated to the trial at hand. It would be preferable to\n\ntreat involuntariness as just another of the multifarious factors that ought to be taken\n\ninto account when deciding what weight should be given to that previous inconsistent\n\nstatement of a witness having regard to the specific purpose for which that inconsistent\n\nstatement was permitted to be used under the Evidence Act.76.    As such, once proved\n\nas a statement made by the witness, it would be admissible per se, and evidence could then\n\nbe led by the parties on all matters that would impinge on the weight to be given to the\n\ncontents of the statement, whether it be(a)to impeach the credit of the witness\n\nunder s 157 (c);(b)to reduce or negate the effect of his sworn testimony in court\n\ncontrary to his previous statement under s 147 (1); or(c)as evidence of facts\n\nstated therein under s 147(3).77.    Accordingly, I\n\nadmitted P29 into evidence under s 147 (1) and (3) without a voire dire upon the\n\nconfirmation by Katheraven that it was his statement recorded by ASP Fan although he was\n\nboth an accomplice and an accused person under investigation at that time.78.    Kathevaren similarly\n\ntestified that he was in fear when P29 was recorded. He said that the IO had told him that\n\nhe would be hanged. He allegedly gave a false statement in P29 out of fear. ASP Fan was\n\nrecalled and gave evidence denying that he had told Katheraven in the course of recording\n\nP29 that he would be hanged or words to that effect. ASP Fan testified that no threat,\n\ninducement or promises were made to him during the recording of P29.79.    The learned DPP\n\nreferred me to paragraph 17 of P 29 which substantially reflected what was stated in\n\nparagraph 5 of P49. The other paragraphs of P29 relied on by the DPP to contradict\n\nKatheraven’s testimony in court were:12. After much thinking, I decided to tell\n\n  that other than myself, another person was involved. The other person is known as\n\n  ‘Thirichi’. …He gave me his telephone number 4593616 and his other contact\n\n  number 96069940 when he was working with me. ….13. ‘Thirichi’ now works as a\n\n  lashing worker at the port. Sometime in 1999, I got to know that he has contacts in\n\n  cannabis as he told me that if there is anybody who wants cannabis, I can contact him and\n\n  introduce buyers to him. He also told me that he will give me whatever he afford as\n\n  commission.(d) Weight to be given to the SOF, P29 and\n\nP4980.    Applying the above\n\nfactors laid down inSelvarajan James v Public Prosecutor, I decided to place far\n\nmore weight on what Kathevaren had stated in P29 and P49 and admitted to in the SOF than\n\nhis sworn testimony in court exonerating the accused.81.    P29 was a statement\n\nmade by him fairly contemporaneously, about 7 days after the drug transaction in question.\n\nP49 and the SOF were given on 16 June 2000 some 5 months later. Katheraven was consistent\n\nthroughout that period of 5 months and never wavered in implicating the accused as the one\n\nwho arranged for the supply of one Kg of cannabis to him. Although the accused might be\n\nunder considerable strain when giving his statement in P29 after having been arrested for\n\na capital offence, and he might be apprehensive in court when he pleaded guilty and\n\nadmitted to the SOF, however I did not find any fear, pressure or intimidation or any\n\nmotivation that would cause him to falsify an account in P29 of the involvement of his\n\nchildhood friend in a very serious offence, or to admit to an untrue account in the SOF.\n\nFurther, P49 was given after his conviction and sentence. Hence, there should be no good\n\nreason to be fearful any longer. All this while, he continued to maintain his story of the\n\naccused’s involvement. I concluded that Katheraven decided to reveal the\n\naccused’s involvement in all his previous statements because that was simply what\n\nhappened.82.    In my opinion,\n\nKatheraven’s change of mind to give false testimony before me in court denying the\n\naccused’s involvement came about only recently when he was called by the prosecution\n\nto testify.83.    Since his oral\n\nevidence pertaining to the purported phone calls to Joe Baskaran had been contradicted by\n\nthe objective phone records, I gave no weight to his testimony that Joe Baskaran was his\n\ndrug supplier. His handphone records showed indisputably that he never contacted Joe\n\nBaskaran on that day. Neither were there any incoming calls to Katheraven from Joe\n\nBaskaran’s handphone.84.    On the contrary, the\n\nnumerous pages to the accused’s pager from Katheraven’s handphone and the\n\nnumerous incoming telephone calls from the accused’s home telephone as revealed by\n\nhis handphone records in fact corroborated the SOF and the contents of P29 and P49, that\n\nthe accused was in constant contact with Katheraven on 13 January 2000. The inference I\n\ndrew was that Katheraven and the accused were not discussing about how Katheraven was\n\ngoing to repay $300 to the accused (as that should not justify so many calls of such\n\napparent urgency) but that they were in continuous communication negotiating and arranging\n\nfor the supply and sale of the cannabis to Andrew, the undercover Narcotics Officer, who\n\nneeded delivery of the cannabis on that very same day on certain terms.85.    Thus\n\nKatheraven’s evidence in court that the accused was not his drug supplier was totally\n\nunreliable. In my judgment, Katheraven’s credit was impeached in relation to his\n\nevidence exonerating the accused as his testimony in court was contradicted materially by\n\nhis former statements and his admitted SOF.86.    I had carefully\n\nscrutinised P29, P49 and the SOF and tested the alleged facts stated therein against the\n\nevidence of the CNB officers and other objective evidence in particular the phone records.\n\nI was mindful all the time that he was an accomplice and that he might have an incentive\n\nto frame the accused in P29 to minimise his involvement, exculpate himself or to seek\n\nleniency in any way he could. In this case, Katheraven had already confessed in P29 to his\n\ncommission of the offence before implicating the accused in his P29 statement. Thus, it\n\nwas significant that his subsequent revelation of the accused’s involvement was no\n\nlonger to minimise his own role or to exculpate himself. Needless to say, I still\n\nexercised caution in taking account of Kathevaren’s three inconsistent statements for\n\nthe truth of their contents. I had carefully considered in detail Katheraven’s\n\nexplanations for the contradictions between his former statements and his oral testimony,\n\nwhich for the reasons given earlier were wholly unsatisfactory.87.    In court, Katheraven\n\nexonerated the accused and retracted all the parts in his statements that implicated the\n\naccused to help him. In my judgment, his testimony was highly suspect, if not untruthful.Evidence of the Accused88.    Counsel for the\n\naccused did not make any submissions that the accused had no case to answer after the\n\nprosecution closed its case. Having found that there was a prima facie case for the\n\naccused to answer, I called on the accused to give his defence with the usual allocution.\n\nHe elected to give evidence on oath.89.    The accused\n\nvehemently denied that he was involved in any manner. He admitted knowing Katheraven since\n\n1993 and had given his pager number to him. When he moved to Ang Mo Kio in January 1999,\n\nthey had maintained contact. Katheraven used to page for him.90.    He testified that\n\nhis conversations with Katheraven on 13 January 2000 pertained to the repayment of the\n\n$300 which Katheraven had borrowed from him and were not about drugs.91.    The accused\n\nexplained that the numerous calls from his home (telephone no: 4525161) and from the\n\ncoffee shop public phones at Blk 632 (telephone numbers: 4520742 and 4522407) to\n\nKatheraven up to about 6.37 p.m. were to collect the $300 borrowed some 2 weeks earlier,\n\nwhich Katheraven promised several times previously to repay but never did. This was the\n\nfirst time that the accused brought up the existence of this $300 loan and linked it to\n\nhis telephone conversations with the accused on 13 January 2000.92.    At about 6.30 p.m.,\n\nthe accused decided to meet one Shanmugam at the coffee shop at Blk 632. Shortly\n\nthereafter, Thambi, who had sold VCDs to the accused, came and joined them. Thambi then\n\ntold the accused that he had something important to discuss with him. He asked the accused\n\nto follow him to the coffee shop at Blk 630.93.    At Blk 630, the\n\naccused met Joe, a close friend of Thambi, who had on occasions delivered VCDs on behalf\n\nof Thambi to the accused. The accused had previously introduced Katheraven to Thambi, who\n\nin turn had introduced Katheraven to Joe. Thambi had given Joe’s contact number to\n\nthe accused about two days prior to his arrest. The accused subsequently gave Katheraven\n\nthe telephone number of Joe when Katheraven asked for it so that he could contact Joe\n\nregarding payment for VCDs.94.    Thambi then asked\n\nthe accused whether Kathi had telephoned him. The accused said that he did. Joe asked if\n\nthe accused knew where Kathi was staying since he was a close friend of Kathi. The accused\n\nsaid yes. Thereafter, Thambi said that Kathi telephoned him the previous day to arrange to\n\nbuy some stuff, which was clarified to the accused to be controlled drugs. Thambi spoke to\n\nJoe and both then made some arrangements in respect of the stuff.95.    They informed the\n\naccused that Kathi had taken the stuff from Joe earlier. Kathi told them that he would\n\nreturn later to pay for the stuff. Kathi assured them that he would not cheat them. They\n\ncould trust him because he was a close friend of the accused. On this basis, Joe allowed\n\nKathi to take the stuff.96.    The accused’s\n\ndefence was that this was the first time he heard of Kathi taking the stuff from Thambi\n\nand Joe. He claimed that he was shocked and surprised that Joe was a drug pusher.97.    Thambi then asked\n\nthe accused how Kathi knew of Joe’s telephone number. The accused told Thambi that he\n\ngave Kathi the telephone number.98.    Joe then insisted\n\nthat Kathi had used the accused’s name and asked for the stuff. Having been given the\n\nstuff, he had not returned to pay for it. Joe told the accused, \"Since Kathi is your\n\nfriend, you call him.\" Joe asked the accused to call Kathi to come. The accused told\n\nJoe that he had never consulted him before giving the stuff. Therefore, he told Joe that\n\nhe could not pay for Kathi. Thambi said that they had used the money meant for their\n\nworkers to purchase the drugs which they had given to Kathi. They expected Kathi to pay\n\nthem. Joe and Thambi then insisted that the accused pay for the drugs on behalf of Kathi.\n\nThey also said that the accused could collect the money from Kathi as he was his friend.\n\nThe accused reiterated that he could not do so.99.    Pausing here, it\n\nseemed rather strange that Joe and Thambi would hold the accused liable to pay for what\n\nKathi took simply because the accused was Kathi’s friend. Then all of Kathi’s\n\nfriends would be liable to pay even though they were not involved in any way with the drug\n\ntransaction. Could it be that the accused was really the middle man who brokered the drug\n\ntransaction and when the accused did not receive the money from Kathi, the accused himself\n\ntherefore could not pay Joe and Thambi, who supplied the drugs? Under the circumstances,\n\nJoe and Thambi would naturally hold the accused responsible for payment. I would also\n\nexpect Joe and Thambi to be angry with the accused for brokering the drug deal with a\n\nbuyer who refused to pay after taking the drugs. To my mind, that was a far more realistic\n\nscenario.100.    According to the\n\naccused, Joe got up from his seat and shouted at him. Joe asked the accused to call Kathi\n\nand ask him to come by 8.00 p.m. and pay them the money, otherwise he would do something\n\nto him and Kathi. In reply, the accused said that he would look for Kathi. If he could\n\nlocate him, he would tell Kathi to see them. However, Joe and Thambi did not inform the\n\naccused of the amount of money which Kathi had to pay. Neither did they tell the accused\n\nthat it was cannabis that they had supplied to Kathi. Hence, apart from knowing that it\n\nwas a controlled drug, he was unaware of what type it was and how much it cost. It did not\n\noccur to him to ask either Joe or Thambi. It might be pertinent to observe at this point\n\nthat the accused was able to furnish details about the price and the kind of controlled\n\ndrugs involved in his statements to the CNB.101.    Since Thambi\n\nalready had Kathi’s handphone number given by the accused, I wondered why they could\n\nnot call Kathi themselves. The accused explained that Thambi told him that Kathi did not\n\nrespond to their calls. So they wanted the accused to call Kathi.102.    The accused pointed\n\nout in his evidence that his statement to the IO was incorrect that Joe had asked him\n\npersonally to return the money by 8.00 p.m. that night. He maintained that Joe told him to\n\nget in touch with Kathi and get Kathi to come and pay the money by 8.00 p.m. But in the\n\nnext breath, the accused testified that he and Joe had quarreled and Joe asked the accused\n\nto pay on behalf of Kathi. If so, then what need was there for Kathi to come and meet Joe\n\nand Thambi and make payment again to them, which would then amount to a double payment.\n\nThe story of the accused was internally inconsistent. Either the accused was to pay them\n\non behalf of Kathi, or Kathi was to pay them directly but not both.103.    At that time, the\n\naccused noticed the handle of a knife which was tucked at Joe’s waist. However, there\n\nwas no evidence that Joe had taken out his knife to threaten the accused. Neither had Joe\n\nthreatened the accused that he would kill or knife him if he did not get Kathi to pay\n\nthem.104.    At that juncture,\n\nPrakas passed by the coffee shop and the accused was still quarrelling with Joe. Prakas\n\nasked them what was happening. The accused told Prakas that Kathi had used the\n\naccused’s name and obtained some stuff from Joe and Thambi, thereby getting him into\n\ntrouble.105.    In the midst of his\n\nheated argument with Joe, the accused testified that he opened his pouch at his waist and\n\ntook out the card where he had written the name \"Thambi\" and the telephone\n\nnumber of Joe, and threw it on the table where Joe was at, saying that he would have\n\nnothing to do with them anymore. In my opinion, this conduct of the accused throwing the\n\nname card in front of Joe indicated that the accused was hardly afraid of Joe, whom he\n\nalleged had a knife. He was even brave enough to enter into a long heated argument with\n\nJoe and Thambi.106.    The accused then\n\ntold Joe and Thambi that he would call Kathi and ask him to come. Then the accused quickly\n\nadded that he would first ask Kathi why he had used his name and taken the stuff. He would\n\nalso ask Kathi to see both Joe and Thambi.107.    Thereafter, the\n\naccused told Prakas that Shanmugam was at the other coffee shop at Blk 632. He told Prakas\n\nto join Shanmugam first and he would join them later. The accused subsequently proceeded\n\nto Blk 632. As he was walking away, Thambi called out from behind telling the accused to\n\ncall Kathi to come and there would not be any problem.108.    On the way, the\n\naccused stopped at the phone booth to telephone Kathi. Thambi stood beside him. When the\n\naccused telephoned and asked for Kathi, the person on the other line answered that he was\n\nnot in and that he had gone downstairs. The person also said that he was Kathi’s\n\nfriend. When this person asked the accused for his identity, the accused told him that he\n\nwas Thiruchy. The man asked the accused why he had called. The accused allegedly said that\n\nKathi had earlier called to return the money borrowed from him. He also told the man that\n\nKathi had put him into some kind of a problem and that those people were asking him for\n\nmoney. At the same time, he also asked the man to ask Kathi what stuff (i.e.\n\n‘porul’ in Tamil) that Kathi had taken from Ang Mo Kio. The man said that he\n\nwould pass the message to Kathi. He then told the accused to call back after five minutes.\n\nThe conversation ended.109.    The accused denied\n\nthat he ever said in Tamil that ‘If the stuff is taken, money must be paid’. He\n\nalso denied Anan’s version that he told him that he would not cheat him but would pay\n\nhim the money.110.    I noted that the\n\ncontents of this 1sttelephone conversation as put by defence counsel to Anan,\n\nwas far more elaborate than that described by the accused in his oral testimony. Anan\n\nflatly denied the contents as put to him.111.    At this stage, I\n\nobserved that it seemed very contrived that the accused should be asking the man to ask\n\nKathi what stuff was taken by Kathi, when he could so easily have asked that question of\n\nJoe earlier or he could simply turn to Thambi, who was beside him, to ask what stuff was\n\ntaken by Kathi if the accused was so keen to know what kind of controlled drug was taken\n\nby Kathi.112.    Continuing with the\n\naccused’s version of the events, the accused said that he informed Thambi that it was\n\nKathi’s friend who answered the phone. He told Thambi that his friend would ask Kathi\n\nabout it. Thambi comforted the accused by telling him not to be upset over what had\n\nhappened. Thambi then asked the accused to call Kathi five minutes later.113.    The accused called\n\nagain. Kathi’s friend picked up the phone. The accused asked if he had asked Kathi.\n\nThen the man said that he and Kathi would be coming with the money. When the man wanted to\n\nknow where they should meet, the accused informed him to meet at the coffee shop at Blk\n\n632 at Ang Mo Kio. The accused then said that he would show him the men (i.e. Joe and\n\nThambi) who wanted the money. He told the man to pay the money to those men. The\n\nconversation ended.114.    During\n\ncross-examination, the accused changed his version of the 2ndcall somewhat.\n\nThe accused said that he asked Kathi’s friend if Kathi was around. Kathi’s\n\nfriend said that Kathi was busy with work. He again said that Kathi had got him into big\n\nproblems. The person then said that Kathi was just here and that he would bring Kathi and\n\nthe money along. He told Kathi’s friend that he would tell them the exact problems\n\nand show them the persons, i.e, Joe and Thamby, and then they could deal with these\n\npersons directly. When Kathi’s friend asked the accused where he was, he told them\n\nthat he was at the coffee shop at Blk 632. The accused agreed with the learned DPP that he\n\nnever mentioned to Kathi’s friend that he had been threatened by Thambi and Joe.115.    At this juncture, I\n\nnoted that Anan had in his testimony denied telling the accused at any time that he would\n\ncome with Kathi down to Blk 632. He maintained that the accused never told him to come\n\ndown quickly because the people waiting to collect the money were waiting. What the\n\naccused was trying desperately to do in his defence was to create the impression that he\n\nwas not the one who wanted the drug payment urgently.116.    Continuing now with\n\nthe accused’s evidence, the accused said that after he put down the phone, Thambi\n\nreturned to the coffee shop at Blk 630 where Joe was. The accused went to join Shanmugam\n\nand Prakas instead at the coffee shop at Blk 632..117.    I found it rather\n\nstrange that Thambi and Joe should prefer to wait at one coffee shop and the accused would\n\nwait for Kathi at another coffee shop in a different block, if the money was in fact to be\n\npaid over directly to Joe and Thambi on an urgent basis and the accused had also intended\n\nto show Kathi’s friend the persons, Joe and Thambi, who were demanding for payment of\n\nthe cannabis money. I would have imagined that Joe and Thambi who were desperate enough to\n\nuse Kathi to collect payment for them, would surely want to wait at or very near the place\n\nwhere Kathi and his friend were expected to come to, bringing with them the money that\n\nthey (i.e. Joe and Thambi) wanted so badly. I believed that the story was fabricated in\n\nthis way because the CNB officers did not keep watch at the adjacent coffee shop which\n\nthen enabled this version to be cleverly fabricated without other available evidence for\n\ncontradiction.118.    Whilst the accused\n\nwas with Shanmugam and Prakas, the accused told Shanmugam that Kathi had used his name and\n\nhad taken some stuff and then gone away. Those people whom he took the stuff from were now\n\nasking the accused for the money. The accused informed Shanmugam that he had telephoned\n\nKathi and that Kathi’s friend had answered saying that he and Kathi were on their way\n\nto meet him at this coffee shop. Significantly, the accused never called either Shanmugam\n\nor Prakas to testify and provide some corroboration to this crucial part of his defence.119.    The accused then\n\ntestified that he telephoned the third time from the coffee shop. Kathi’s friend\n\nanswered the call saying that heand Kathiwere on their way to meet him and would\n\nbe arriving in about 20 minutes time. The accused said that he would be at Blk 632.\n\nKathi’s friend said he had gone to that place but nobody was there. Kathi’s\n\nfriend then asked how the accused was dressed and what he was wearing. The accused replied\n\nthat he was wearing a football uniform. The accused then asked the man, \"You said you\n\ncame earlier. How are you dressed? How can I identify you?\". The man told the accused\n\nthat he was dressed in a black shirt and black pants. When the man said that he was not\n\nfamiliar with that place, the accused told him that Kathi knew this coffee shop just in\n\nfront of his block. The call ended.120.    Again, it was\n\nincomprehensible that the man would have said that he had been to the coffee shop and\n\nfound nobody there, when he and Kathi were still on their way there and would be arriving\n\nin 20 minutes time. Secondly, if indeed Kathi was accompanying the man, why was there the\n\nneed to explain to the man how the accused would be dressed since Kathi obviously would be\n\nable to identify the accused, and bring his friend to meet him. The accused’s version\n\nwas inherently incredible. In fact at paragraphs 32 to 35 of the accused’s own\n\nstatement given earlier on 26 January 2000, it was very clear that only Kathi’s\n\nfriend was coming and Kathi was not. Anan (masquerading as Kathi’s friend) had denied\n\ntelling the accused that Kathi was coming with him. I found that the accused was\n\ndeliberately lying.121.    In relation to this\n\nthird call, defence counsel put something quite different to Anan that the accused had\n\ntold him that Kathi got him into trouble and other people were demanding money. The\n\naccused basically was pouring out his grievances all over to Anan again. Anan disagreed.\n\nMaterial differences between what was put to the prosecution witnesses and the\n\naccused’s testimony in court often do indicate the unreliability of the\n\naccused’s oral evidence. In this instance, I gave the benefit of doubt to the accused\n\nthat there might have been a mix up in the accused’s instructions to his counsel. I\n\nmight add that since Anan was already on the way with the money, I could not see any good\n\nreason why the accused should be complaining and repeating his grievances to Anan in this\n\nthird call.122.    The accused then\n\nrelated that a short while later, he received a telephone call at the public phone in the\n\ncoffee shop where Thambi told him that he and Joe had something to attend to and were\n\nleaving. Thambi then said that he would be calling Kathi on their own to collect the money\n\nfrom him. The accused immediately told Thambi that Kathi and his friend were on their way\n\nand asked why they were leaving. Thambi reiterated that he and Joe had something very\n\nimportant to attend to and they would contact Kathi to collect the moneyon their own.\n\nDuring cross-examination, the accused added that Thambi had also told him to tell Kathi\n\nthat he (i.e. Thambi) would call Kathi the next day. Thambi however did not ask the\n\naccused to collect the money on their behalf.123.    This part of the\n\nstory was quite unbelievable. According to the accused, Joe and Thambi thought that Kathi\n\nwas trying to cheat them and was not returning their calls. Hence, they needed to compel\n\nthe accused to call Kathi, as only then he would come down to see them. Joe and Thambi\n\nwere already waiting so long for Kathi to come and pay them a substantial sum of money of\n\nsome $2000. They needed the money desperately to pay their workers. Since the accused had\n\nsuccessfully got Kathi to come down, what was the problem in waiting a little while more?\n\nUnder the circumstances, it seemed quite out of character not to seize the opportunity to\n\ncollect payment from the elusive Katheraven, whom they had no alternative but to resort to\n\nthe accused to make contact in the first place. Why would they would want to go away, and\n\nthen risk collecting payment from Katheraven themselves on another day? If indeed they\n\nwere so confident of collecting payment from Katheraven on their own later, then I could\n\nnot see the reason for this roundabout manner of getting the accused to make calls to\n\nKatheraven to chase for and to collect payment on their behalf. The story did not quite\n\nmake sense to me.124.    The accused\n\ntestified that he went back to his table to continue drinking with Shanmugam and Prakas.\n\nHe subsequently called Kathi’s number (4thcall) with the intention of\n\ninforming Kathi or his friend that Thambi and Joe had left but Kathi’s friend told\n\nthe accused that they were already in the vicinity at Blk 639. He then told Kathi’s\n\nfriend to go to the coffee shop at Blk 632. But the man said to go to the bus stop at Blk\n\n639.125.    The accused\n\ncategorically denied that Anan had told him that he was in the vicinity and that he did\n\nnot feel safe going to the coffee shop but would meet him in front of the bus stop of Blk\n\n639. I found Anan’s version to be more realistic and credible. There could be no good\n\nreason why they could not meet in the coffee shop where the accused was. Why must the\n\naccused go to a bus stop to meet Anan? I preferred Anan’s evidence that he cooked up\n\nthat reason to lure the accused out from the coffee shop.126.    The accused’s\n\nsequence of events also seemed unlikely. I would have imagined that he would call\n\nKathi’s friendimmediatelyto cancel the appointment upon being told that Joe\n\nand Thambi could not wait. Instead the accused went back to continue with his drinking.\n\nThis was more consistent with the fact that it was the accused himself who wanted to\n\ncollect the money for himself. After waiting a fairly long period of time, and when Kathi\n\nand his friend still failed to show up, he became impatient. That was why the accused\n\ncalled again. The telephone records revealed that the accused had waited for some20\n\nminutes(see Katheraven’s telephone records for the time interval between the 3rdand 4thcalls) before he decided to call Kathi’s friend for the fourth\n\ntime.127.    When he returned to\n\nthe table, the accused told Prakas that Kathi and his friend were near a bus stop and that\n\nthey had asked him to go there. Prakas said that he would like to come with him to find\n\nout who Kathi’s friend was. The accused allegedly wanted to ask Kathi personally why\n\nhe used his name and put him into all this trouble. He also wanted to collect the $300\n\nwhich Kathi owed him, and tell Kathi that Thambi would be calling him and that he had to\n\nsettle whatever he owed Thambi and Joe for the stuff he had taken from them. Further, the\n\naccused wanted to ask what stuff it was. As explained earlier, it was most improbable that\n\nAnan had told the accused that Kathi was accompanying him.128.    It was obvious to\n\nme that the accused needed to weave into his evidence, this motivation of his to see\n\nKathi, and the only way he could do so was to concoct a story that Kathi was indeed coming\n\nalong to the bus stop with his friend. Otherwise, he would have difficulty explaining why\n\nhe was waiting so long at the coffee shop with such anxiety to meet with Kathi and his\n\nfriend, if he was not going to confront Kathi with all those questions, clear his name and\n\ncollect his $300 loan, especially when Joe and Thambi had left and had told the accused\n\nthat they were going to collect the drug money from Kathi themselves on another day. It\n\nwas also intended to reinforce his defence that he was not involved but was dragged into\n\nthe picture by Joe and Thambi, which accounted for his action to clear his name.129.    Unfortunately for\n\nthe accused, he could not neatly stitch up his fabricated story as a whole and thus, in\n\nmaterial parts, it did not make much sense and showed up readily to be an unbelievable\n\nstory.130.    Shanmugam and\n\nPrakash accompanied the accused to the bus stop but waited at Blk 645 behind the bus stop.\n\nSubsequently, all of them were arrested. After the accused was handcuffed, he was\n\nassaulted by Cpl Devan with many blows to his chest until he stooped down. The CNB\n\narresting officers were recalled and they denied assaulting him.131.    During questioning,\n\nthe accused denied that he was Thiruchy because he was in fear and was confused. His\n\nconfusion arose because Kathi told him that the outstanding payment to Joe was in relation\n\nto VCDs purchased but Joe and Thambi were saying that it related to drugs. He admitted\n\ndenying that he had called Katheraven’s handphone number when the CNB officers\n\nquestioned him.Dispute on accuracy of recording of his statements132.    Although there was\n\nno challenge on voluntariness, the accused in the course of his evidence disputed the\n\naccuracy of recording of his statements by ASP Fan and the interpretation by the\n\ninterpreter. This dispute on accuracy arose subsequent to the admission of the statements.133.    The accused firmly\n\nmaintained that he never used the word ‘ganja’ during the recording of his\n\nstatements. When the statements were read back to him and he pointed out that he did not\n\nuse the word ‘ganja’, he alleged that the interpreter became very confused and\n\nangry. The accused also denied mentioning $2,220 as the price of the drugs during the\n\nstatement recording.134.    It was put to Ms\n\nCaroline Edmund Susila that the accused, when giving the statements, had used the Tamil\n\nword ‘porul’ referring to a ‘thing’. However, she was certain that he\n\nnever used this Tamil term. She remembered him using ‘jama’ instead to mean the\n\n‘thing’. She also denied that during the recording of his statements, the\n\naccused had complained to the recording officer directly that he did not use the word\n\n‘ganja’. Ms Caroline testified that the accused had not objected to or disagreed\n\nwith anything during the recording of his statements. She clarified that her\n\ninterpretation was done systematically, line by line, and that it was not possible that\n\nthe accused had told her the reason why he went to the bus stop opposite Blk 636, which\n\nshe might have inadvertently omitted to interpret for recording by ASP Fan. She maintained\n\nthat if the accused had told her that he went to the bus stop because he wanted to collect\n\n$300 from Katheraven, she would have interpreted it.135.    The interpreter\n\nconfirmed that the accused did use the word ‘ganja’ himself several times. When\n\nthe accused used the word ‘jama’, she specifically clarified with him and the\n\naccused told her that it was ‘ganja’. She maintained that ‘ganja’ was\n\nnot suggested to the accused but the word came from the accused himself. I believed her\n\nevidence. Further, I would not think that she and the recording officer would have\n\nconcocted the price $2,220 for insertion into his statements if he never said it. She\n\nappeared to me to have given her evidence in an honest and forthright manner. I found\n\ntherefore that the accused’s voluntary statements were accurately recorded.136.    Based on this, I\n\ndrew the inescapable inference that the accused knew at the time of giving the statements\n\nthat the drug trafficked was cannabis and it cost $2,220. I disbelieved his defence that\n\nhe did not know that the drug involved was cannabis and neither did he know of its price.",
        "Evidence of Josephine d/o Anthony": "137.    The accused called\n\nhis wife, Josephine d/o Anthony, to testify on his behalf. She is currently detained at\n\nthe Changi Female Drug Rehabilitation Centre.138.    She confirmed that\n\nKatheraven had paged for her husband on 13 January 2000. She testified that he spoke with\n\nKatheraven on the phone. Her husband later told her that Kathi was going to return the\n\nmoney borrowed from him including some monies pertaining to VCDs, which Kathi had bought\n\nfrom her husband’s friend. She could not remember anything else. She also said that\n\nher husband had asked her to get from his pouch a name card with ‘Thambi’\n\nwritten on it, and her husband gave the number to Kathi over the telephone. This would\n\nvaguely suggest that Kathi contacted ‘Thambi’ directly for the cannabis.139.    When cross-examined\n\nby the learned DPP why she never mentioned what her husband had told her to the CNB\n\nofficers, she said that she could not recall whether she had. She was later shown her\n\nconditioned statement and she had to agree that she never mentioned those facts in her\n\nstatement. She explained that she was stressed up that her husband was arrested and it did\n\nnot occur to her to tell the CNB officers. I did not believe her as her statement was\n\nrecorded some 4 months after her husband’s arrest.",
        "Defence counsel’s submissions": "140.    Learned counsel\n\nemphasized that Katheraven had in P29 initially mentioned Joe Baskaran (‘Joe’)\n\nas his drug supplier and he had also provided the handphone number of Joe in his\n\nstatement. He did not implicate the accused from paragraphs 1 to 11. Midway through the\n\nrecording, Katheraven suddenly decided to change his mind and implicated the accused\n\ninstead as the one who arranged for the supply of the cannabis to him.141.Counsel contended\n\nthat something must have influenced Katheraven to change his statement and implicate the\n\naccused. Katheraven probably was not able to provide more details about Joe Baskeran to\n\nCNB, which would then lead CNB to think that Joe Baskeran was a fictitious character.\n\nCounsel deplored the fact that the CNB did not ascertain who the subscriber of 97517436\n\nwas. He submitted that it could well have been the handphone number of Joe. Had CNB probed\n\nfurther into this, the defence that Joe was not a fictitious character and indeed was the\n\nsupplier would well have been proven to be true. Sensing that he was making no progress\n\nwith the CNB regarding Joe and that his own future was at stake if CNB did not believe\n\nhim, counsel contended that Katheraven then substituted Joe with the accused.142.    Counsel managed\n\nwithout any difficulty to get Katheraven to agree that those were the reasons for\n\nimplicating the accused via the following leading questions to him:Q: On 20thJanuary 2000 when\n\n  you gave the statement. Do you agree you were found with the drug, a large quantity?A: Yes.Q: And you also would have known that the\n\n  only way you could have escaped the gallows is, if the prosecution showed some compassion\n\n  to you or due to your co-operation they reduced the charge, you would have known.A: Yes.Q: Now the prosecution--- the\n\n  investigation officer must have certainly queried you on Joe, would have asked you for\n\n  more details – Where is Joe staying, how did you meet him, what is his address?\n\n  – he must have certainly queried you on these aspects, right?A: Yes, he did.Q: And CNB would certainly have been\n\n  interested in the supplier, in your supplier?A: Yes.Q: Am I right to say that when you could\n\n  not furnish any details about Joe, CNB were suspicious of this character, Joe, that you\n\n  had created, that you had stated?A: Yes.Q: Therefore, knowing that you cannot make\n\n  any headway with them in respect of Joe and knowing that there’s no way CNB would\n\n  help you if you did not reveal the name of the supplier, you substituted the accused with\n\n  Joe.A: That’s the truth.Q: And at that time you only considered\n\n  about saving your own skin, your own life.A: Yes.143.    With regard to the\n\nSOF, Katheraven said that he wanted to save himself from the gallows and hence, he was\n\nprepared to admit to the SOF prepared by the prosecution. He said that his counsel’s\n\nassistant told him that he must accept the SOF to have the charge reduced, thereby\n\nsuggesting that he was accepting everything in the SOF, without caring whether they were\n\ntrue or not, just to save his own life. He agreed with counsel for the accused that after\n\nhe was convicted, he was not bothered whether what was stated in P49 was truthful or not.\n\nHe just signed the pre-prepared statement as it no longer concerned him. Counsel submitted\n\nthat little weight should be given to P49 because it was given out of fear that the\n\nprosecution might appeal against his sentence or it was given in the hope that his case\n\nwould be viewed favourably by CNB.144.    During his\n\nre-examination by the DPP, Katheraven explained that the only reason why he subsequently\n\nimplicated the accused in his P29 statement was because he was afraid that something might\n\nhappen to him. He retracted the following reasons he gave at paragraph 21 in his P29\n\nstatement for implicating the accused:-21.    I am now asked a few questions by\n\n  the officer recording my statement.Q: Why did you not tell me that\n\n    ‘Thirichi’ was involved in the case earlier?A: I do not want to get a bad name outside and I was also afraid that he will harm me and\n\n    my family.Q: Then why did you decide to tell me\n\n    about ‘Thirichi’ later?A: I realise that if I were to continue with my lie, the truth will still be found out by\n\n    CNB and I may be charged again for giving a false statement.145.    His explanation for\n\nsaying that the accused was his drug supplier in his statements was to induce the IO to\n\nbelieve him. However, he agreed that the IO did not promise him anything in exchange for\n\nimplicating the accused. When asked why he involved the accused if it were not true, he\n\nsaid that he was frightened and in his fear, he implicated him. Dissatisfied the DPP\n\nquestioned him further on his reasons for falsely implicating the accused. His answers\n\nwere quite incomprehensible and unbelievable:Q: Witness, my question to you is, why did\n\n  you choose to implicate Thiruselvan [the accused] in your statement instead of, let’s\n\n  say, for example, choosing to implicate Joe or let’s say, choosing one of these two\n\n  persons [referring to Shanmugam and Prakas] you have never seen before?A: I implicated him because he’s my friend.HIS HONOUR: So you prefer to implicate\n\n  somebody you like and not somebody you don’t like?WITNESS: Yes.Q: Witness, in your statement you had\n\n  already implicated Joe. So why was there a need to, let’s say, additionally implicate\n\n  Thiruselvan? Why was there a need to additionally implicate Thiruselvan since you had\n\n  already implicated Joe?A: Because he was arrested and he was taken to MIB with me.Q: Witness, is that the only reason you\n\n  implicated Thiruselvan?A: Yes.146.    I further observed\n\nthat Katheraven was already in the early part of his statement P29 (at paragraphs 5, 6 and\n\n7) indirectly implicating Thiruselvan if one were to study the objective telephone records\n\nin conjunction with Katheraven’s statement. Katheraven only became more explicit in\n\nimplicating Thiruselvan from paragraph 12 onwards in his statement. It was most\n\nsignificant that the telephone records were obtainedafterKatheraven had given his\n\nstatement. Neither the recording officer nor Katheraven could have referred to these\n\ntelephone records during the statement taking. Yet there were aspects of the telephone\n\nrecords, which showed that whenever Katheraven stated that he was arranging for the drugs\n\nwith Joe on the telephone, one could trace that telephone conversation to the accused but\n\nnot to Joe. This was not some uncanny co-incidence. Further some of the calls which\n\nKatheraven said were made to and from his handphone on the day of the incident could be\n\nnicely matched with the telephone records.147.    For instance,\n\nKatheraven said in his statement that when he was in Andrew’s car on the way to Ang\n\nMo Kio to take delivery of the cannabis from Joe Baskaran, he called Joe on his handphone\n\nand he told Joe that a friend needed cannabis. Joe told him to meet at the coffee shop at\n\nBlk 630 Ang Mo Kio Ave 6 at 3.30 p.m. and he said that the ‘stuff’ i.e. cannabis\n\ncosts $2000. Katheraven called Joe again on his handphone to relay the message that Andrew\n\ndid not want to deal directly with him. In this call, Katheraven then arranged with Joe to\n\ncollect the cannabis himself and return later with the payment for it.148.    For these\n\narrangements, the purported conversations could not have been with Joe based on the\n\nobjective telephone records and on the timing. They must have been with the accused as\n\nduring this time, the telephone records showed convincingly that the only calls at that\n\ntime (i.e. at 3.05 p.m. and 3.13 p.m.) were those incoming calls from the accused’s\n\nhome telephone numbers. If one were to substitute the accused for Joe for those\n\nconversations above, clearly Katheraven was already implicating that the accused was his\n\ndrug supplier in the early part of his statement in P29.149.    Another instance\n\nwas Katheraven’s disclosure in paragraph 7 of his P 29 statement that when he\n\nalighted from the car in front of Blk 647, he met Joe at the coffee shop at Blk 630 as\n\npre-arranged. Joe borrowed his handphone to page his friend at 96069940. Joe then brought\n\nhim to the toilet and gave him one block of cannabis. This was again borne out by the\n\ntelephone records that there was indeed a page to the accused (not to Joe) in the course\n\nof the cannabis delivery.150.    For these reasons,\n\nI rejected counsel’s contention that it was a change of heart that Katheraven decided\n\nto incriminate his childhood friend. I could find no reason for it unless it was true.My conclusions(a) Failure to report to the police151.    The accused claimed\n\nthat he was threatened by Joe with the knife and asked to call Katheraven or pay up for\n\nthe drugs on behalf of Katheraven. The accused in my opinion could easily have reported to\n\nthe police if he was truly not involved at all in the drug transaction. I would have\n\nexpected that of a reasonable person who was innocently caught under such circumstances.\n\nThere was no question that the accused had all the opportunity to make a police report if\n\nhe wanted to, especially after both Joe and Thambi had said they were leaving. Having seen\n\nthe accused testify, I did not think he would be so ignorant that he did not know that he\n\ncould protect himself by reporting the matter to the police or CNB and have Joe and Thambi\n\narrested. Counsel submitted that uppermost in the accused’s mind was to confront\n\nKatheraven and clear his name. This paramount reason sounded hollow and unbelievable.152.    I would have\n\nthought under the circumstances that uppermost on the accused’s mind would be to try\n\nto seek the protection of the police for his and his family’s safety and that could\n\nonly be properly achieved by having Joe and Thambi arrested before they could come round\n\nto threaten him again. He could easily lure Joe and Thambi out and be arrested. For\n\nconviction for trafficking in drugs, they would be safely put away in prison for a very\n\nlong time if not hanged.153.    Instead of\n\nreporting them to the police or to CNB, he was helping the two drug traffickers to collect\n\nthe purchase money for the drugs from Katheraven. By his own account, the accused was\n\nprepared to abet these two drug traffickers in the drug transaction albeit under certain\n\npurported fears and threats, which in law did not fall within section 94 of the Penal Code\n\nwhich only exonerates a person compelled to commit an offence by threats, which would at\n\nthe time of commission, reasonably cause him apprehension ofinstant death.(b) Accused’s lies154.The evidential value of lies was dealt\n\nwith by the Court of Appeal inPublic Prosecutor v Yeo Choon Poh[1994] 2 SLR 867,\n\nwhere the learned Chief Justice delivering the judgment said at p 876:The English Court of Appeal inR v\n\n  Lucas (Ruth)[1981] QB 720 has held that the mere fact that an accused tells lies\n\n  should not be taken as evidence of his guilt, but that lies can in certain circumstances\n\n  amount to corroboration because it indicates a consciousness of guilt. Lord Lane CJ held\n\n  at p 724 that there were four criteria to satisfy before a lie could amount to\n\n  corroboration:The lie… must first of all be\n\n    deliberate. Secondly it must relate to a material issue. Thirdly, the motive for the lie\n\n    must be a realization of guilt and a fear of the truth. …. Fourthly, the statement\n\n    must be clearly shown to be a lie by [independent] evidence …155.    I would now refer\n\nto the series of deliberate lies of the accused:(a) His initial denial that he spoke with\n\n  Anan who was then holding on to Katheraven’s handphone;(b) His denial that he was known as\n\n  ‘Thiruchi’;(c) His shouts to his wife to the effect\n\n  that he was only known by his first name ‘Thiruselvan’;(d) Informing ASP Fan on 14 January 2000\n\n  that he did not know Katheraven;(e) Suggesting in his statement to\n\n  Inspector Xavier Lek that he did not personally arrange to meet the person wearing a black\n\n  shirt and black pants at the bus stop, but that ‘Thambi’ did and thereafter\n\n  instructed him to take the money from this person dressed in black (i.e. Anan);(f) Specific retraction of paragraph 5 of\n\n  the accused’s statement given on 14 January 2000 where the accused said that Thambi\n\n  had paged him at about 3 pm to 4 pm using a Singapore handphone number and Thambi had\n\n  asked him to go to the coffee shop downstairs. In his evidence, the accused said that was\n\n  untrue. He maintained that he did not have any sort of contact whether on the phone or\n\n  pager with Thambi.156.    There was no reason\n\nfor the accused to lie in this fashion if he was truly innocent. Clearly, he was so afraid\n\nof being found out that he was connected with the drug transaction of Katheraven that he\n\ndecided to dissociate himself as much as he could from the phone calls he made to Kathi,\n\nand to deny knowing Kathi altogether. In (f) above, the accused also wanted to make sure\n\nthat he made no calls to Thambi between 3 pm to 4 pm as that could imply that after\n\nKatheraven called him to arrange for the supply of 1 kg of cannabis, he in turn arranged\n\nwith ‘Thambi’ to deliver the drugs directly to Katheraven. All these denials and\n\nspecific retractions reflected his consciousness of his guilt and his attempts to conceal\n\nhis involvement.157.    In my judgment, the\n\naccused was a clever liar who deftly weaved his evidence as closely as possible around the\n\nobjective facts to give it a veneer of believability. I saw through his lies and\n\ncontradictions which reflected more of culpability and guilt than innocence. He had no\n\nhesitation to lie when it suited him. He was a witness of poor veracity and credibility.\n\nHe was a self-confessed liar as he himself testified that he just rattled off a story for\n\nthe IO to record and he did not tell the truth when he gave his statements. I thus\n\nrejected his defence in court completely.158.    Counsel submitted\n\nthat the accused had lied that he did not know Katheraven and had given a different\n\nexplanation for his presence at the bus stop on 13 January 2000 because Katheraven had\n\ntold him earlier at Ang Mo Kio Police Station to deny that he knew him and Katheraven\n\nwould do likewise. Otherwise, the accused would be in deep trouble. Hence, it was\n\ncontended that what the accused did was reasonable.159.    I could not see how\n\ncounsel’s submissions would advance the case any further for the accused, as it would\n\ndemonstrate instead that both the accused and Katheraven were prepared to cooperate to\n\nconcoct lies for ASP Fan to record. It was apparent to me that they were doing the same in\n\ntheir testimony in court.160.    Further, it would\n\nsuggest that Katheraven, having been caught red-handed, was already thinking of\n\nexonerating the accused very early on soon after their arrest. As Katheraven was already\n\ncaught with delivering the drugs to the undercover CNB officer and had confessed to his\n\nown role, I could not imagine him trying to save himself by simply implicating the\n\naccused. It would appear that Katheraven had tried to shield the accused initially (which\n\nnecessarily implied that the accused was indeed involved with him), but Katheraven later\n\nhad a change of heart and decided to tell the truth in his statements.161.    In any event,\n\nKatheraven himself disagreed with defence counsel that he had told the accused to deny\n\nknowing him. One of them must be lying. Counsel submitted that the accused’s version\n\nshould be accepted because both the accused and Katheraven had the opportunity during\n\ntheir urine tests to speak to each other and both had initially denied in their statements\n\nthat they knew each other. How this might help the accused’s defence was unclear to\n\nme.(c) Katheraven’s statements\n\nimplicating the accused162.    I accepted the\n\nlearned DPP’s submissions that P29 and P49 revealed the truth of what happened. P29\n\nwas a contemporaneous statement of Katheraven. P49 was a statement given by Katheraven\n\nafter he had pleaded guilty and there was no real incentive for him to wrongly accuse an\n\ninnocent man if it were not true. The same applied to the SOF admitted without\n\nqualification in the High Court when he pleaded guilty.(d) Telephone call records163.    The account given\n\nin P29 was surprisingly consistent with the call-tracing records which the CNB obtainedsome\n\n5 days afterP29 was recorded from Katheraven.164.    The call tracing\n\nrecords on 13 January 2000 showed the close contact maintained between the accused and\n\nKatheraven on the day of the cannabis transaction:(a) Katheraven paging the accused 4 times\n\n  between 3.00 pm and 3.04 pm.(b) The accused calling Katheraven at 3.05\n\n  pm and spoke for 3 minutes 20 seconds.(c) The accused calling Katheraven at 3.13\n\n  pm and spoke for 1 minute and 43 seconds.(d) Between 2.29 pm and 4.23 pm, there\n\n  were no calls to or from anyone else except the accused on Katheraven’s handphone,\n\n  which proved that while in Andrew’s car, Katheraven did not speak to anyone else\n\n  except the accused.165.    In P29, Katheraven\n\nhad stated at paragraph 15 that when he was with Andrew in the car, there were 2 calls\n\nabout 5 minutes apart which were eventually borne out by the call-tracing records. (The\n\n3.05 call ended at 3.08 p.m. The next call was at 3.13 p.m.)166.    These calls were in\n\nrelation to the drug transactions. Andrew had requested Katheraven to collect the drugs\n\nand deliver it to him. Andrew then sprung another surprise that he was not going to pay\n\nuntil he saw the drugs. Obviously, Katheraven would have to make the delivery arrangements\n\nand further check with his supplier whether it would be acceptable to take the drugs first\n\nwithout paying. As such, I found that these last minute arrangements would have to be\n\ncarried out by Katheraven over his handphone during the time he was with Andrew.167.    The only person\n\nthat Katheraven was in contact with at this time was the accused. I therefore drew the\n\nirresistible inference that the accused was Katheraven’s drug supplier. It seemed\n\nhighly implausible that the 2 calls made by Katheraven on his handphone to the accused\n\nwhen he was in Andrew’s car on the way to Ang Mo Kio were in relation to other\n\nmatters unrelated to the drug transaction which was afoot.168.    The numerous calls\n\nfrom the accused to Katheraven’s handphone soon after Katheraven’s arrest showed\n\na very anxious accused trying desperately to contact Katheraven who simply\n\n‘disappeared’ without paying, as he was by then arrested. I did not believe that\n\nit was because of the repayment of $300. I found that the accused had called to chase\n\nKatheraven for payment of some $2200 for the cannabis he had taken. That was exactly why\n\nhe had told Anan that ‘If the thing is taken, the money must be paid.’ From its\n\ncontext, ‘the thing’ could not have referred to the $300 loan but could only\n\nrefer to the one kg of cannabis under the circumstances.(d) Charge proved169.    Taking into account\n\nthe cumulative effect of all the evidence, I found that the evidence pointed irresistibly\n\nto the accused as the supplier of the cannabis to Katheraven. He acted as an intermediary\n\nwhere he had arranged for the direct delivery to Katheraven from his Malaysian source but\n\npayment for the drugs supplied would be directly to the accused.170.    Accordingly, I\n\nfound that the prosecution had proved the charge against the accused beyond a reasonable\n\ndoubt. I then sentenced the accused in accordance with law.Chan Seng OnnJudicial CommissionerCopyright © Government of Singapore."
    }
}