{
    "case_title": "Projection Pte Ltd v The Tai Ping Insurance Company Limited",
    "ncitation": "[2000] SGHC 146",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The law": "40. It would be appropriate at this juncture to look at the requirements at law\n\nfor a valid compromise to come into being; I refer to the textbookThe Law and Practice of\n\nCompromise(4 ed 1996) which was cited by the defendants. At para 3-01 (p 14) the learned author\n\nhad this to say:Since a compromise is merely a contract, the ordinary principles of contract\n\n  law apply with as much force as in other contractual contexts. Under the ordinary law, a contract\n\n  will not be found to have arisen unless:(i) consideration;(ii) an agreement can be identified which is complete and certain;(iii) the parties intend to create legal relations and;(iv) in some cases, certain formalities have been observed..At para 3-03 (at p 15) the learned author continued:In compromise, consideration is often furnished by the promised or actual\n\n  forbearance of one party to pursue a claim against another in return for some promised or actual\n\n  act by the other. Such act may constitute a benefit to the claimant or a detriment to the\n\n  performer or indeed both. The promised or actual forbearance may be for a specified time or, where\n\n  no time is specified, for a reasonable time.41. With the above extracts in mind, I turn to paras 5 to 7 of the (amended)\n\nstatement of claim which pleaded as follows:5. By a letter dated 31 March 1999, the defendants recorded their agreement to\n\n  the sum of $553,560.98 as payable to the plaintiffs in respect of the said claim and/or said\n\n  damage. A discharge voucher dated 31 March 1999 (the Discharge Voucher) was enclosed with the said\n\n  letter for the plaintiffs' signature.6. The Discharge Voucher was duly executed by the plaintiffs and returned to\n\n  the defendants some time on 8 May 1999. The plaintiffs will rely on the discharge voucher for its\n\n  full purport and effect at trial.7. In the premises, there is a compromise agreement (the Agreement) between the\n\n  parties for the said claim and/or said damage in that the defendants have agreed to pay the sum of\n\n  $553,560.98 as full and final settlement of the said claim and/or said damage.No particulars were furnished for the above paragraphs in particular for para 7\n\nas to when the compromise agreement was made, the reasons therefor and the terms thereof. Above all,\n\nnothing was pleaded on the issue of consideration; nor was it elaborated on in para 99 of the\n\nplaintiffs' submissions as to what constituted good consideration for this case. All that counsel\n\nfor the plaintiffs did was, to refer to an extract fromCheshire Fifoot & Furmston'sLaw\n\nof Contract (1998) which included a comment that the compromise of a doubtful claim was upheld by\n\nthe courts. I consider the paucity of the plaintiffs' pleadings and submission on this very\n\nessential ingredient for a compromise agreement as another indication of its non-existence as at\n\nMarch 1999, particularly when the issue of want of consideration was specifically pleaded in the\n\ndefence. As an aside, I would add that it was wrong of the plaintiffs to include in the Agreed\n\nBundle (at AB40) as well as make reference to it in their final submissions (para 86) the without\n\nprejudice letter from the defendants dated 31 August 1999 offering to pay them $322,649.14, even\n\nif counsel for the defendants raised his objections late in the day.The conclusion42. In the light of my findings, there is no necessity for me to determine the\n\nalternative defence put forward by the defendants -- that there was a fundamental mistake which\n\nrendered any alleged agreement to settle void. I would only venture to say that the evidence\n\nsuggests that such a defence would be difficult to succeed. I therefore dismiss the plaintiffs'\n\nclaim with costs to the defendants.",
        "Lai Siu Chiu": "JudgeCopyright © Government of Singapore."
    }
}