{
    "case_title": "Societe Generale v Statoil Asia Pacific Pte Ltd",
    "ncitation": "[2000] SGHC 64",
    "coram": "S Rajendran J",
    "sections": {
        "Default by SUSCO": ".11.    As stated above, the due date for the first Payment Undertaking\n\ngiven in respect for the first shipment made under the 2ndcontract was 1\n\nDecember 1997. SUSCO, however, failed to effect the necessary payment to SOCGEN. On 3\n\nDecember 1997, SOCGEN issued a letter of demand to SUSCO which read:\"We refer to your Payment Undertaking dated 6 June 1997 (\"the\n\n  Payment Undertaking\") issued by you in favour of ourselves and issued in respect of\n\n  your purchase of 2,014.297 metric tonnes/15,063 barrels of gasoil from Statoil Asia\n\n  Pacific Pte Ltd (\"Statoil\").We also refer to the Notice of Assignment given to you wherein you will\n\n  note that Statoil has assigned to us all its rights, benefits and interests in the Payment\n\n  Undertaking and the monies payable thereunder.Payment to us of US$390,583.59 (principal amount) plus interests under\n\n  the Payment Undertaking was due and payable on 1 December 1997.We regret to inform you that as of today we have still not received the\n\n  sum of US$390,583.59 (principal amount) plus interests which was due and payable on 1\n\n  December 1997.We hereby demand the payment to us the outstanding principal sum of\n\n  US$390,583.59 plus interests calculated up to the date of final payment by4 p.m., 4\n\n  December 1997.Interest at 1% per annum above SIBOR continues to accrue on the said\n\n  outstanding sum.If you fail to comply with this demand, we shall take such further\n\n  action as we deem fit to recover all the outstanding sums and interests thereon due to us\n\n  without further reference to you and all costs and expenses incurred thereon (including\n\n  legal costs and expenses) shall be borne by you.\"Not receiving any response, SOCGEN, on 5 December 1997, asked SUSCO to provide a\n\nwritten explanation for the reasons for the non-payment. There was still no response. On\n\n15 December 1997, SOCGEN issued another letter of demand to SUSCO. This letter was\n\nnecessitated by the fact that SUSCO had defaulted on its next Payment Undertaking, given\n\non 1 July 1997, to pay a sum of US$351,632.97 on 12 December 1997. The second letter of\n\ndemand was also ignored by SUSCO. To-date, SUSCO has made no payment to SOCGEN either in\n\nrespect of its obligations under its Payment Undertakings that were the subject of the two\n\nletters of demand or any of the remaining Payment Undertakings relating to subsequent\n\nshipments.12.    When SOCGEN backed out of the arrangement, there was\n\ncommunication between SUSCO and STATOIL on how STATOIL could nevertheless continue to\n\nsupply gasoil to SUSCO under its 3rdcontract. On 21 November 1997, Mr Fournier\n\ninformed Mr Bertel verland (from DNS Norway) that SOCGEN would consider renewing the\n\nline if SUSCO could come up with tangible security in the form of a standby letter of\n\ncredit from an acceptable bank to cover SOCGEN’s exposure. Mr verland flew to\n\nBangkok on 25 November 1997 and relayed SOCGEN’s suggestion to SUSCO. Mr verland\n\nwas not able to obtain any commitment from SUSCO to open such letter of credit. Instead,\n\nSUSCO requested Mr verland to speak to SOCGEN to roll over the outstanding balance to\n\nthe next due date. This was reflected in a letter from SUSCO to STATOIL dated 8 December\n\n1997:\"According to our contract dated 9 October 1997 StatOil has\n\n  committed to supply the oil to SUSCO and the terms of payment set at 6 months with\n\n  interest at 1% above SIBOR, and for SUSCO to make payment directly to the Societe Generale\n\n  Bank. Due to the recent Asian economic recession, Societe Generale Bank has been unable to\n\n  continue the line of credit for StatOil to supply oil to SUSCO. This has had substantial\n\n  impact on SUSCO since our contract with StatOil should continue until April 1998, as\n\n  stipulated in the above mentioned contract.With reference to our meeting on Tuesday 25 November 1997 in order to\n\n  find the solution to the problem mentioned above, you understood the problem and would\n\n  like to continue to supply SUSCO’s orders according to the terms and conditions as\n\n  stated in our contract with the condition that the amount should not exceed each due\n\n  payment and the outstanding balancewould be rolled over to the following due dates.Please would you kindly let me know if you have been able to make such\n\n  arrangements as soon as possible.We look forward to receiving your urgent response.\"A copy of this letter was sent to SOCGEN. As will be seen later, SOCGEN relied on this\n\nletter as indicative that SUSCO did not honour its Payment Undertakings to SOCGEN, not\n\nbecause SUSCO was insolvent but because STATOIL had breached its contract with SUSCO.13.    On 10 December 1997, Mr verland broached the subject of rolling\n\nover SUSCO’s outstanding balance with SOCGEN. SOCGEN, however, was not willing to\n\nconsider any proposals from SUSCO until SUSCO paid up all outstanding sums under\n\nSUSCO’s Payment Undertakings. Mr verland wrote to SUSCO on 12 December 1997 giving\n\nthe following account of his discussions with SOCGEN:\"First of all, let me thank you for all hospitality given by\n\n  yourselves and your colleagues in connection with our meetings in Bangkok on Tuesday 25\n\n  November 1997. I am now back in Singapore and can therefore attend to our credit issues\n\n  again.As mentioned in your fax dated 8 December 1997, it is correct that I\n\n  would bring forward your proposal to Societe Generale (SocGen). I was in contact with\n\n  SocGen (both Denise Tan and Philippe Fournier) last week on Thursday 4 December when\n\n  I was in Norway, and I also tried to get in touch with you the same day.SocGen did not formally respond to your proposal because, as they\n\n  explained, SUSCO were in a default situation with the bank by not making the payment that\n\n  was due on 1 December 1997. According to SocGen, the default on payment to them\n\n  constitutes a breach of contract and therefore make it impossible for them to consider new\n\n  exposure.It is therefore important in order to progress matters that immediate payment\n\n  is remitted for the unpaid cargo and for all subsequent cargoes already shipped whenever\n\n  they become due.Therefore, as mentioned in our meeting on November 25, it is suggested\n\n  that all three parties involved gather for an urgent meeting in Singapore in order to\n\n  discuss the situation.If you concur with this approach, please advise me urgently so we can\n\n  arrange for a suitable date and venue.\"SUSCO’s responded to that letter on 16 December 1997. A copy of\n\nthe response was sent to SOCGEN. In the response SUSCO stated:\"Thank you for your fax of 10 December 1997, responding to our\n\n  letter of 8 December 1997. As you know theeconomic situation has caused serious\n\n  liquidity problems for companies in Thailand. However, according to our contract dated\n\n  9 October 1997 StatOil has committed to supply the oil to SUSCO and the terms of payment\n\n  set at 6 months with interest at 1% above SIBOR, and for SUSCO to make payment directly to\n\n  the Societe Generale Bank.Because of the recent Asian economic recession, Societe\n\n  Generale Bank has been unable to continue the line of credit for StatOil to supply oil to\n\n  SUSCO causing StatOil to default on their commitment for supply. This has had a\n\n  substantial negative impact on SUSCO since we have made our operation plan based on\n\n  StatOil supply to be continued until April 1998, as stipulated in the above mentioned\n\n  contract.If StatOil cannot continue with their arrangements with Societe\n\n  Generale for a further commitment on their funding then other alternatives should be\n\n  sought. In the event that further funding cannot be achieved from other sources may we\n\n  suggest that StatOil provide their own funding support. In this way StatOil would be able\n\n  to continue their commitment for supply of oil to SUSCO according to the terms and\n\n  conditions stated in our contract. SUSCO would then make due payments, according to the\n\n  terms suggested in our letter of 8 December 1997, until the debt with Societe Generale has\n\n  been cleared and subsequent due payments would be made directly to StatOil.Please would you kindly let me know as soon as possible whether such\n\n  arrangements will be made.We look forward to receiving your urgent response.\"SOCGEN also relied on this letter as indicating that SUSCO’s\n\ndefault under the Payment Undertaking was attributable to STATOIL’s breach of its\n\nobligations to SUSCO under the 3rdcontract.14.    On 19 December 1997, SOCGEN wrote to STATOIL stating in effect,\n\nthat since the reason SUSCO had not honoured its Payment Undertakings to SOCGEN because\n\nSTATOIL had stopped shipments under the 3rdContract, SOCGEN was not under any\n\nliability to STATOIL under its Payment Confirmations. The letter stated:\"We understand from the letters dated 8 December 1997 and 16\n\n  December 1997 from SUSCO to yourselves (copied by SUSCO to ourselves) that you have\n\n  stopped supplying SUSCO with oil pursuant to your contract with SUSCO dated 9 October 1997and for that reason, SUSCO has delayed payment on the Payment Undertakings which\n\n  fell due on 1 December 1997 and 12 December 1997.Please note that our obligations under the various Payment\n\n  Confirmations extend to the failure by SUSCO to perform its payment obligations under the\n\n  Payment Undertakings and that such failure is only and directly due to the circumstances\n\n  specified in paragraphs (I) and (II) of the Payment Confirmations.Please also note that we are not under any obligations or liability\n\n  whatsoever in the event of failure by you to perform any of your contractual obligations\n\n  under the Payment Confirmations or any relevant contract for the shipment by you to SUSCO\n\n  and that ourPayment Confirmations become null and void if payment from SUSCO is not\n\n  made on due date by reasons other than as specified in paragraphs (I) and (II) of the\n\n  Payment Confirmations.We therefore reserve all our rights against yourselves under the terms\n\n  and conditions of the Payment Confirmations.\"The reference in the above letter to the Payment Confirmation becoming null and void if\n\npayment from SUSCO was not made on the due date by reasons specified in paragraphs (I) and\n\n(II) of the Payment Confirmations is a reference to the proviso that was included in all\n\nPayment Confirmations when the form was revised by SOCGEN in May 1997.15.    Although the proviso introduced a substantial limitation to\n\nSOCGEN’s liability under the Payment Confirmation, SOCGEN had, at the time it revised\n\nthe form, not specifically drawn the revision to the attention of STATOIL. STATOIL claimed\n\nthat they were not aware that SOCGEN had, from May 1997, inserted the proviso into the\n\nPayment Confirmation form. It was STATOIL’s original case that it was never a term\n\nthat SOCGEN’s liability under the Payment Confirmation would be so limited.16.    SOCGEN did not deny that it had not specifically drawn\n\nSTATOIL’s attention to the modifications effected to the form in May 1997.\n\nSOCGEN’s explanation for this omission, as given by Miss Tan, was that from the very\n\ninception it had been explained to STATOIL, several times, that the risks that SOCGEN\n\ncovered under its guarantee were insolvency and political risks. It was Miss Tan’s\n\nevidence that since STATOIL had been informed so often of this limitation, it was not\n\nnecessary, when SOCGEN revised its forms, to draw STATOIL’s attention to the\n\namendments. In her words: \"the revision merely ensured that the documentation would\n\nnow accurately reflect SOCGEN’s agreement with STATOIL\".17.    The fact that SOCGEN’s liability to pay STATOIL under its\n\nPayment Confirmations was limited to situations where SUSCO’s default was \"only\n\nand directly\" due to the two circumstances described in the proviso was, as Miss Tan\n\nreadily agreed, an important matter. If it had indeed been a term of the agreement from\n\nthe very beginning, one would have expected that there would have been some reference\n\nthereto, if not in the original Payment Confirmation form, then at least in the\n\ncorrespondence between the parties at that time. The absence of any such reference in the\n\noriginal form or in the correspondence supports STATOIL’s denial that there had been\n\nany such limitation.18.    STATOIL’s claim of ignorance of the limitations was,\n\nhowever, complicated by the fact that STATOIL had signed its acceptance of the terms and\n\nconditions in the revised form, not just once or twice, but in all the Payment\n\nConfirmations issued from May 1997 onwards. In the light of this difficulty, Counsel for\n\nSTATOIL, Mr Lawrence Quah, indicated to the court that STATOIL would proceed on the basis\n\nthat they had in fact accepted the amended terms. I therefore do not have to delve further\n\ninto the matter but I would, in passing, say that SOCGEN, at least as a matter of\n\ncommercial integrity and etiquette, should have drawn STATOIL’s attention to the\n\nsomewhat substantive amendments that they were making to their routine documentation. The\n\nofficers of SOCGEN, on their part, should not have been so ready to sign the Payment\n\nConfirmations on the assumption that SOCGEN would not have amended its standard form\n\nwithout prior notice.",
        "The Claim": ".19.    The total amount paid by SOCGEN to STATOIL on the 12 discounted\n\ninvoices was US$4,408,599.73. In May 1999, SOCGEN commenced this present suit against\n\nSTATOIL claiming the return of the US$4,408,599.73. The basis of the claim was that SOCGEN\n\nhad a right of recourse against STATOIL for return of the monies paid under the Invoice\n\nDiscounting scheme if two conditions, namely:(a) SUSCO fails in its obligations to pay under their Payment\n\n  Undertakings; and(b) SOCGEN’s obligations under the guarantee contained in the\n\n  Payment Confirmation was not triggered;were fulfilled.20.    As I indicated earlier, the conditions under which payments were\n\nmade to STATOIL under the Invoice Discounting scheme were not set out in the Payment\n\nConfirmation and Invoice Discounting form. STATOIL’s initial stance taken in their\n\nDefence was that the Invoice Discounting scheme was provided on a without recourse basis\n\nand therefore SOCGEN had no right to recover the monies paid under the discounted invoices\n\nunder any circumstances. However, during the trial, STATOIL abandoned that position and\n\ninstead pleaded (vide paragraph 13 of the amended Defence filed on 16 November 1999) as\n\nfollows:\"…The Defendant avers that the Payment Confirmation with\n\n  Invoice Discounting service, inclusive of the invoice discounting thereunder, was provided\n\n  on an unconditionalwithout recoursebasissubject to the Two Provisos\".The last five underlined words were additions to the original Defence.\n\n  In view of this amended plea, the question whether payments made under the Invoice\n\n  Discounting scheme was or was not on a without recourse basis merged into the question\n\n  whether SOCGEN was liable to STATOIL under the guarantee contained in the Payment\n\n  Confirmation.21.    Given this new position by STATOIL, the main issue in this case\n\nis whether SUSCO was insolvent during the relevant period (which is 1 December 1997 to 7\n\nApril 1998) and, if so, whether the failure by SUSCO to pay the amounts due to SOCGEN\n\nunder SUSCO’s Payment Undertakings was, to use the words of the proviso \"only\n\nand directly\" due to SUSCO having become insolvent. SOCGEN’s case was that SUSCO\n\nwas not insolvent when they defaulted on their Payment Undertakings and that, in any\n\nevent, the direct reason for SUSCO’s failure to pay was not its insolvency but the\n\ncommercial dispute between SUSCO and STATOIL arising from STATOIL’s breach of its 3rdcontract. It was submitted on behalf of SOCGEN that, even if SUSCO was insolvent, the\n\nfailure to pay was not \"only and directly\" due to the insolvency.22.    STATOIL’s position was that there was no commercial dispute\n\nbetween it and SUSCO and that the direct and only reason SUSCO defaulted was because\n\nSUSCO, at that time, in common with numerous other companies in the region, had serious\n\nliquidity problems and was unable to pay its debt because of its insolvency. SOCGEN was\n\ntherefore, under the Payment Confirmations, liable to STATOIL for the amounts guaranteed\n\nand had no right of recourse to the monies paid under the discounted invoices.23.    SOCGEN also took a further position that as no one from SUSCO was\n\nin court to testify on SUSCO’s financial affairs at the relevant time, this court was\n\nnot in a position to make a finding of fact adverse to SUSCO that SUSCO was insolvent. The\n\nshort answer to that submission is that the central question before me is one of\n\nconstruction of the contract entered into between SOCGEN and SUSCO. A determination on the\n\nmeaning of the word \"insolvent\" used in that contract and whether, on the\n\nevidence adduced, SUSCO was solvent or insolvent within that meaning, were matters clearly\n\nwithin this court’s purview. The court cannot refuse to address the matter simply\n\nbecause SUSCO was not before the court. In any event, as SUSCO was not a party to these\n\nproceedings, the finding of this court on the insolvency or otherwise of SUSCO would not\n\naffect SUSCO in any way.",
        "Insolvency": "24.    I now turn to consider SUSCO’s solvency at the relevant\n\ntime. The first question that arises is: what is the meaning to be ascribed to the word\n\n\"insolvent\" in the context of the proviso?25.    For SOCGEN, Mr Singh drew attention to the case ofRe Great\n\nEastern Hotel (Pte) Ltd[1989] 1 MLJ 161. In that case, Grimberg J had rejected an\n\nargument raised that a company could only be said to be solvent if it was able to pay its\n\ndebts \"out of its own money\". Mr Singh also cited the following passage from the\n\njudgment of Chao Hick Tin JC (as he then was) inRe Sanpete Builders (S) Pte Ltd[1989] 1 MLJ 393at 400:\"Proof that a creditor`s debt has not been paid per se does not\n\n  establish an inability to pay debts within the meaning of s 254(2)(c). The conclusion\n\n  of insolvency, generally speaking, ought not to be drawn simply from evidence of a\n\n  temporary lack of liquidity.\"Mr Singh relied on that passage as establishing that inability to meet current demands\n\nwas indicative only of a temporary lack of liquidity and was not a sufficient circumstance\n\nfrom which to conclude that the company was insolvent and that the true test was whether\n\nthe total liabilities of the company exceeded the total assets of the company.26.    For STATOIL, Mr Quahe, in support of the proposition he canvassed\n\nthat insolvency would be established if it can be shown that the company was unable to\n\nmeet its current liabilities from its current assets, cited the decision of the Court of\n\nAppeal inRe Sunshine Securites (Pte) Ltd[1978] 1 MLJ 57(CA). In that case, the\n\ncompany had failed to respond to a statutory demand (under s 218(2)(a) of the then\n\nCompanies Act) issued by the petitioner. The trial judge found the company to be insolvent\n\nand ordered it to be wound-up. The company appealed and one of the grounds was that the\n\nlearned judge erred in fact and in law in finding that \"the company was clearly\n\ninsolvent and unable to pay its debts\" when there was evidence on record that the\n\ncompany held a property the value of which was far in excess of the debt due to the\n\npetitioner. In dismissing the appeal, Rajah J, giving the decision of the Court of Appeal,\n\nsaid:\"With regard to the first appellant’s contention that the\n\n  learned judge was wrong in finding that the company was unable to pay its debts, it is to\n\n  be observed that the petition is based on the company’s failure to pay or give\n\n  security for the debt of which a statutory demand has been made. The law is clear and is\n\n  as inBuckleyon the Companies Acts, 13thEdition, at page 460 as\n\n  follows:-‘The particular indications of insolvency mentioned in paragraphs\n\n    (a), (b) and (c) are all instances ofcommercial insolvency, that is of the company\n\n    being unable to meet current demands upon it. In such a case it is useless to say that if\n\n    its assets are realised there will be ample to pay twenty shillings in the pound; this is\n\n    not the test. A company may be at the same time insolvent and wealthy. It may have wealth\n\n    locked up in investments not presently realisable; but although this be so, yet if it have\n\n    not assets available to meet its current liabilities it is commercially insolvent and may\n\n    be wound up.’ \"A similar approach was adopted by the Privy Council (in an appeal from Singapore) in\n\nthe case ofMalayan Plant (Pte) Ltd v Moscow Naroday Bank Ltd[1980] 2 MLJ 53.27.    In Mcpherson’sThe Law of Company Liquidation, 3rdEd, the learned author states at page 54:\"The phrase ‘unable to pay its debts’ which appears in\n\n  s 364(2)(c) (the equivalent of our s 254(2)(c)) is susceptible of two\n\n  interpretations. One meaning which may properly be attached to it is that a company is\n\n  unable to pay its debts if it is shown to be financially insolvent in the sense that its\n\n  liabilities exceed its assets. But to require proof of this in every case would impose\n\n  upon an applicant the often near-impossible task of establishing the true financial\n\n  position of the company, and the weight of authority undoubtedly supports the view that\n\n  the primary meaning of the phrase is insolvency in the commercial sense – that is,\n\n  inability to meet current demands, irrespective of whether the company is possessed of\n\n  assets which, if realized, would enable it to discharge its liabilities in full.From this it follows that insolvency in this form is principally a\n\n  question of fact, and one which may be established in any number of ways.\"This passage was adopted by Chao Hick Tin JC inRe Sanpete Builders (S) Pte Ltd.\n\nMr Quahe relied onRe Sanpeteand on the passage in Mcpherson in further support of\n\nhis submission that inability to meet current demands was sufficient evidence of\n\ninsolvency.28.    Mr Quahe also submitted that as SUSCO had, to-date, failed to\n\nrespond to the two formal letters of demand issued by SOCGEN on 3 December 1997 and\n\non 15 December 1997, a presumption arose under s 351(2)(a) of the Companies Act\n\n(which is identical to s 254(2) except that it applies to an unregistered company) that\n\nSUSCO was unable to pay its debts and was therefore insolvent.29.    In response, Mr Singh submitted that in the two letters of\n\ndemand: (i) SUSCO was not given the statutory period of 3 weeks to make payment of the sum\n\ndemanded; (ii) there was no warning to SUSCO of an impending winding-up petition in the\n\nevent that the plaintiff’s demand is not met; and (iii) there was no reference to\n\nsection 351 of the Companies Act in the notice and consequently the presumption under\n\ns 351(2)(a) could not arise. In support of this submission, Mr Singh relied on the\n\nMalaysian cases ofRe Yap Kim Kee & Sons Sdn Bhd[1990] 2 MLJ 108;Re Beauty\n\nWord Enterprise Sdn Bhd[1997] CSLR XX [6094] andHongkong and Shanghai Banking\n\nCorpn Ltd v Kemajuan Bersatu Enterprise Sdn Bhd[1992] 2 MLJ 370.30.    The cases cited by Mr Singh were reviewed by the Supreme Court of\n\nMalaysia inSri Hartamas Development Sdn Bhd v MBF Finance Bhd[1992] 1 MLJ 313and\n\nthe court took the view that the 3-week period was not a period that needed to be\n\nspecified in the notice as the period within which the demand was to be satisfied but that\n\nit referred to the period of neglect by the debtor to pay the debt after receipt of the\n\nformal notice. To quote from the judgment:\"In other words, thethree weeks refer to the period of neglect\n\n  to pay before the said presumption of inability to pay debtsarises under the said\n\n  section, and is not a requirement relating to the notice of demand itself.\"Item (i) of Mr Singh’s list of non-compliance was therefore not\n\n  sustainable. As for items (ii) and (iii), whilst there is some references in the cases\n\n  cited that it is usual for these matters to be included in the notice, s 254(2)(a) does\n\n  not in terms contain any such requirement.31.    An analysis of the authorities under s 254(2)(a) and\n\ns 351(2)(a) of the Companies Act can, however, be only of limited assistance in\n\nresolving the issues in this case. Here we are not concerned with the winding-up of a\n\ncompany under the provisions of the Companies Act. What we are concerned with is the\n\nmeaning to be ascribed to the word \"insolvent\" as used in the Payment\n\nUndertaking entered into between STATOIL and SOCGEN. That would be purely a matter of\n\nconstruing that word in the context of the agreement. However, in construing a word such\n\nas \"insolvent\" in a commercial arrangement, the broad context in which the word\n\nis generally understood and used, would be a factor. To that extent, the fact that a\n\ncompany that continues to default on its debt after a formal demand has been made can be\n\nwound up on grounds of insolvency, is relevant. As stated by R.M. Goode in\"The\n\nConcept of Corporate Solvency\":\"Where a company defaults in payment of an undisputed debt after\n\n  demand has been made, that is sufficient evidence that it is unable to pay its debts as\n\n  they fall due, and if it persists in its failure to pay it will be taken to be unable to\n\n  pay its debts even if it in fact it appears to be solvent. This salutary rule reflects the\n\n  view that a company which is able to pay an undisputed debt and chooses not to do so has\n\n  only itself to blame if the inference is drawn that it is not able to pay.\"32.    Considering the factual matrix in which the contract between\n\nSTATOIL and SOCGEN was entered into, I accept the submission of Mr Quahe that what\n\nthe parties intended to cover by the use of the word \"insolvent\" in the Payment\n\nUndertaking was commercial insolvency in the sense used by Mcpherson (and Buckley) in the\n\npassages above quoted, namely, an inability to meet current demands irrespective of\n\nwhether the company was possessed of assets which, if realized, would enable it to\n\ndischarge its liabilities in full. I would also, for the purposes of this case, adopt what\n\nMcpherson stated in the next paragraph of the passage from his book quoted above, namely:\"From this it follows that insolvency in this form is principally\n\n  a question of fact, and one which may be established in any number of ways.\"If, on the evidence, it is established that SUSCO was in fact insolvent\n\n(in that commercial sense), then the further question would arise whether the failure by\n\nSUSCO to pay the amounts due under its Payment Undertakings to SOCGEN were due solely to\n\nits insolvency.",
        "Evidence of insolvency": "33.    SOCGEN, in support of its claim that SUSCO was not insolvent (ie\n\nsolvent), relied on the expert evidence of Dr Virach Aphimeteetamrong (\"Dr\n\nVirach\"), the Dean of the Faculty of Commerce and Accountancy of the Chulalongkorn\n\nUniversity in Thailand. Dr Virach was an authorised auditor and a member of the Institute\n\nof Certified Accountants and Auditors of Thailand from 1967. He based his view on a study\n\nof (i) audited financial statements of SUSCO for the years ended 31 December 1997 and\n\n1996; 31 December 1998 and 1997; (ii) audited financial statements of SUSCO for the years\n\nended 31 December 1998 and 1997; and (iii) the interim financial statements of SUSCO for\n\nthe first quarter of 1999 and 1998 and concluded that during the relevant period\n\n(1 December 1997 to 7 April 1998), SUSCO was solvent.34.    It is relevant to note that, at the very beginning of his report,\n\nDr Virach stated:\"I must state at the outset that the period in respect of which\n\n  this opinion relates to coincided with the Thai economic crisis which began in July 1997.\n\n  During the crisis, a lot of companies in Thailand experienced financial difficulties\n\n  brought about by the collapse of financial institutions as well as the devaluation of the\n\n  Thai Baht.\"In his report Dr Virach accepted that the inability of a company to pay\n\n  its debts when they are due and payable was one of the criteria that could be applied in\n\n  determining whether a company was insolvent. He, however, went on to say that that was not\n\n  the only criterion and that taking into account all relevant criteria, namely:(a) Examination of the cash flow of the company;(b) Current ratio;(c) Debt to equity ratio; and(d) Total assets to total liability ratio.SUSCO was not insolvent at the relevant time.35.    I will not here set out the details of the analysis Dr Virach\n\nmade under each of these heads. I would, however, highlight the following:(1) The current ratio of SUSCO for the year ended 31 December 1997\n\n  and for the first quarter of 1998 were well below one. Dr Virach conceded that a current\n\n  ratio of less than one indicated that the company would have difficulties meeting its\n\n  current liabilities as and when they fell due. He, however, discounted that possibility by\n\n  emphasising that even where the ratio is below one, the company may be able to make\n\n  arrangements with its bankers and other creditors for indulgence to be granted.(2) After analysing the cash flow of the company, Dr Virach again\n\n  adverted to the \"need for continued support from the banks and its major\n\n  shareholders.\"(3) Dr Virach found that the total assets value of SUSCO, based on book\n\n  value, exceeded its total liabilities.(4) Dr Virach appears not to have factored into his consideration the\n\n  foreign exchange crisis in Thailand and in the region and the effects of the crisis on\n\n  SUSCO.36.    STATOIL, on its part, called John Malcolm Perrins, a chartered\n\naccountant and a partner in the Financial Advisory Services Department of Pricewaterhouse\n\nCoopers FAS Ltd in Bangkok, as its expert to testify on the financial health of SUSCO. Mr\n\nPerrins had specialised in insolvency and corporate re-construction and recovery services\n\nsince 1974. In conducting his review of the finances of SUSCO, Mr Perrins looked at the\n\naudited financial statements of SUSCO as at 31 December 1997, 31 March 1998 and as at\n\n31 December 1998.37.    The approach that Mr Perrins took, as stated in the commencement\n\nof his report, was as follows:\"From an insolvency practitioners viewpoint, I consider a company\n\n  is solvent if, the company is able to pay all its debts, as and when they become due and\n\n  payable.A company which is not solvent must be insolvent.The issue of whether a company is able to pay its debts when they\n\n  become due and payable is subjective and may be determined by reference to a number of\n\n  factors including, but not limited to:(a) available cash balances;(b) total assets compared to total liabilities;(c) current assets compared to current liabilities (current ratio);(d) whether creditors are being paid in accordance with normal trading\n\n  terms; and(e) in the absence of immediate cash resources, the availability of\n\n  alternative sources of funding.\"Mr Perrins noted that the quantum of total assets (taken at book value) exceeded the\n\nquantum of total liabilities. He, however, took the view that for solvency purposes (ie\n\nability to pay debts as and when they fell due) it was more relevant to consider the\n\ncurrent ratio.38.    Mr Perrins found a deterioration in the current ratio which in\n\nhis view indicated that\"… SUSCO will likely have experienced severe difficulty in\n\n  paying its debts as and when due in the period 1 December 1997 to 7 April 1998.\"In this respect, Mr Perrins’s conclusion was similar to that of Dr Virach except\n\nthat Mr Perrins did not take into account possibilities of creditor and shareholder\n\nsupport which may help SUSCO tide over its difficulties. Mr Perrins also noted that\n\neven before taking into consideration losses resulting from the floating of the Baht in\n\nJuly 1997, SUSCO, in most quarters throughout 1997 and 1998, recorded loss from\n\noperations.39.    Mr Perrins touched in some detail on the detrimental effect on\n\nSUSCO of foreign exchange movements during that period. He pointed out that the floating\n\nof the Baht in July 1997 produced, over the succeeding 8 months to February 1998,\n\nsignificant movements in its value against major world currencies and particularly against\n\nthe US dollar. This, he stated, would have had a severe adverse effect on SUSCO. To quote\n\nfrom his report:\"The Baht rate per US dollar moved from 25.8 prior to the float,\n\n  to 47.6 at 31 December 1997 and a high of 55 in late January 1998. The devaluation has had\n\n  material adverse effects on the level of foreign currency denominated liabilities of\n\n  companies in Thailand, and substantially increased the effective cost of sales in trading\n\n  companies which rely on imported products. The impact is enhanced if revenues of the\n\n  organisation are domestically sourced. SUSCO is one such organisation. The impact of the\n\n  devaluation of the Baht to SUSCO would have included the following:- US dollar borrowings of USD 7.6 million are recorded in the balance sheet of SUSSO at\n\n    31 December 1997. The Baht equivalent of these loans increased from approximately Baht 196\n\n    million at 30 June 1997 to approximately Baht 361 million at 31 December 1997, an increase\n\n    of approximately 84%. Related interest payments would have increased proportionaly;- The purchases of oil from STATOIL were denominated in US dollars, with payments due\n\n    180 days after shipment. Accordingly payments due to be made in the period 1 December\n\n    1997 to 7 April 1998 would relate to shipments made 180 days earlier, during the period 1\n\n    June 1997 to 7 October 1997. Attached as Annexure ‘5’ is a schedule indicating\n\n    movements in the exchange rate during these periods. Accordingly the liability accruing by\n\n    SUSCO for its purchase during the period June to October 1997 would in Baht terms have\n\n    increased substantially by the time the payments were due to be made in the period\n\n    December 1997 to April 1998.The impact of the above on a business such as SUSCO’s whose\n\n  revenues are substantially Baht denominated would have been severe.\"Mr Perrins concluded at the end of his report that SUSCO was insolvent\n\nduring the relevant period (1 December 1997 to 7 April 1998). He based his view on the\n\nfollowing factors:(a) It did not pay its obligations to SOCGEN as and when due during the\n\n  period, and has still not paid these debts;(b) It had other liabilities that were disclosed as being overdue\n\n  during the period;(c) It had a severe deficiency in current assets compared with current\n\n  liabilities;(d) It was incurring operating losses during the period.\"40.    Mr Perrins’s approach to what constitutes insolvency was\n\nsimilar to that taken by the Court of Appeal inRe Sunshine Securitiesand would\n\nfall within what Mcpherson in the passage I have referred to earlier termed\n\n\"commercial insolvency\". Dr Virach gave more weight to the ratio of total assets\n\nto total liabilities. To adopt Dr Virach’s approach would, in my view, place too\n\nhigh a burden on STATOIL and would not have been what was reasonably in the contemplation\n\nof the parties when the Payment Undertakings were entered into. Further, Dr Virach’s\n\nassertions that the shareholders, bankers and other creditors of SUSCO would grant\n\nindulgence to SUSCO in coping with the financial crisis that SUSCO was facing can, in the\n\nabsence of direct evidence, be treated only as conjecture. I therefore reject Dr\n\nVirach’s testimony that SUSCO was solvent and had no difficulty in accepting the\n\nevidence of Mr Perrins that it was more than likely that SUSCO was insolvent at the\n\nrelevant time.",
        "Was insolvency the only reason for the default": "?41.    In view of the very stringent conditions that SOCGEN introduced\n\ninto the Payment Confirmations in May 1997, SOCGEN would be liable to STATOIL under the\n\nPayment Confirmations if, and only if, the failure to pay was \"only and\n\ndirectly\" due to the insolvency of SUSCO. When SOCGEN suddenly withdrew the facility,\n\nSTATOIL could no longer offer that method of effecting payments to SUSCO. To that extent\n\nSTATOIL was unable to honour its commitments to SUSCO. SOCGEN argued that this inability\n\nof SUSCO to honour the terms agreed to in the 3rdcontract was the reason, or\n\npartly the reason, why SUSCO failed to honour its Payment Undertakings to SOCGEN. It is\n\ntherefore necessary to consider if, despite SUSCO being insolvent at the relevant time,\n\nthe reason or part of the reason why SUSCO failed to pay was because of a commercial\n\ndispute between SUSCO and STATOIL over the terms of the 3rdcontract.42.    The best way for SOCGEN to prove this claim would have been to\n\nget someone from SUSCO to testify. SOCGEN was, however, unable to get any assistance from\n\nSUSCO. SUSCO did not even respond to SOCGEN’s letter to them of 5 December 1997\n\nasking for a written explanation for the non-payment. SOCGEN therefore had to rely on\n\nwhatever material that they could find in the correspondence between SUSCO and STATOIL to\n\nsubstantiate their claim.43.    Looking through the correspondence (which I have mostly set out\n\nin the earlier part of this judgment), it appears to me that whilst SUSCO was upset by the\n\nfact that STATOIL, in view of SOCGEN having withdrawn its facility, was not able to extend\n\nto them the payment terms envisaged under the 3rdcontract, SUSCO did not as a\n\nresult of this become acrimonious towards STATOIL. To the contrary, SUSCO admitted that\n\n\"the economic situation has caused serious liquidity problems for companies in\n\nThailand\" and had (through STATOIL) even asked SOCGEN to roll over the outstandings\n\nto the next due date. Not getting a positive response from SOCGEN, SUSCO had discussions\n\nwith STATOIL to vary the terms of the 3rdcontract. STATOIL, in these\n\nre-negotiations, was prepared to accommodate SUSCO by reducing its premium if SUSCO could\n\narrange payments by letters of credit. SUSCO was, however, unable to get its bankers to\n\nissue such credits (no doubt because of its critical financial situation at that time). It\n\nis relevant to note that when the re-negotiations were unsuccessful, SUSCO did not insist\n\non holding STATOIL to the terms of the 3rdcontract but instead cancelled a\n\nshipment of gasoil that was due to be shipped to it by STATOIL and thereafter gave no\n\nfurther shipping instructions. It would, in the circumstances, appear that SUSCO had\n\ndecided not to insist on its contractual rights but opted to treat the 3rdcontract as cancelled.44.    On the evidence before me, I am not persuaded that SUSCO’s\n\nfailure to make payments to SOCGEN under its Payment Undertakings was due, in any way, to\n\nany commercial dispute between SUSCO and STATOIL. It seems to me that the direct and only\n\nreason that SUSCO failed to pay was because SUSCO was, at that time, insolvent.45.    In the light of the above findings, I dismiss the\n\nplaintiffs’ claim with costs.S. RAJENDRANJudgeCopyright © Government of Singapore."
    }
}