{
    "case_title": "LKM Investment Holdings Pte Ltd v Cathay Theatres Pte Ltd",
    "ncitation": "[2000] SGHC 13",
    "coram": "Judith Prakash J",
    "sections": {
        "Background": "On 13 November 1997, Cathay started Suit 1944 of 1997 against LKM. It sued, inter alia, for specific performance of an option agreement granted by Cathay on 17 April 1996 and exercised by LKM on 17 May 1996. LKM disputed liability on a number of grounds and counterclaimed for rescission of the sale and purchase contract. The case was tried before the Honourable Judicial Commissioner Lee Seiu Kin. On 29 June 1999, his Honour gave judgment in favour of Cathay and on 26 July 1999, LKM appealed against the whole of this judgment.Among the orders made by Lee Seiu Kin JC were the following:It is adjudged and declared that:(10) [Cathay`s] notice to complete dated 17 August 1996 with regard to the sale of the leasehold property known as Regal Theatre, 3501 Jalan Bukit Merah, Singapore (the `property`) is valid;...(4) [LKM] specifically perform the contract for the sale of the property within 14 days from the date of judgment and pay to [Cathay] the sum of $14,850,000 being the balance of the purchase price;(5) [LKM] pay [Cathay] late completion interest under condition 8(a) of the Law Society`s Conditions of Sale 1994 on the balance of the purchase price at 10% per annum amounting to $4,068.49 per day from 17 August 1996 to the date of actual completion less the rent received in respect of the property by [Cathay] as landlord from 17 August 1996 to the date of actual completion;...LKM neither completed the purchase of the property nor paid Cathay any part of the interest accruing on the unpaid purchase price. On 17 August 1999, Cathay through its solicitors served on LKM a statutory demand pursuant to s 254(2)(a) of the Companies Act (Cap 50) (`the Act`) demanding payment of late completion interest allegedly due under the judgment. The sum demanded was $3,419,514.72 being interest amounting to $4,454,996.55 (for the period 17 August 1996 to 16 August 1999) less rental received by Cathay amounting to $1,035,481.83.On 20 August 1999, LKM applied for a stay of execution of the judgment in Suit 1944 of 1997 pending the determination of its appeal. Two weeks later, its solicitors wrote to Cathay`s solicitors to state that the statutory demand made was not valid as the late completion interest could not constitute a debt due until completion had finally taken place and the total amount of interest had crystallised. This argument did not convince Cathay whose solicitors replied that they intended to proceed with a winding up petition. This application for an injunction was filed shortly thereafter.",
        "Issues": "There were two main issues argued at the hearing. The first related to the validity of the statutory demand served by Cathay. The contention was that this was not a valid demand because the interest demanded was not yet due and payable. The second contention was that it was an abuse of process to bring  winding up proceedings against a company based on a judgment which had been appealed against.",
        "(i)[emsp ]Was the statutory demand valid?": "The statutory demand was made under s 254(2)(a) read with s 254(1)(e) of the Act. For the presumption provided by s 254(2)(a) to be invoked, a creditor of the company must make a demand requiring the company to pay a sum due to it and the company must then neglect to pay the debt. The submission was that in this case, there was no debt due in respect of interest from LKM to Cathay at the time the statutory demand was served because completion of the purchase and sale had not then taken place. LKM argued that the late completion interest would only crystallise and become payable on completion. This was really a question of the proper construction of order 5 of the judgment in Suit 1944/97 which provided for LKM to pay Cathay late completion interest on the balance of the purchase price `at $4,068.49 per day from 17 August 1996 to the date of actual completion`.LKM relied onLoh Wai Lian v SEA Housing Corporation Sdn Bhd[1987] 2 MLJ 1, a decision of the Privy Council. In that case, the court had to construe a liquidated damages payment clause contained in a contract for the purchase of a shop house to be erected on a housing estate. Clause 17, the relevant clause, provided for the calculation of the delivery date of the house and then went on to state:Provided always that if the said building is not completed and ready for delivery of possession to the purchaser within the aforesaid period then the vendor shall pay to the purchaser agreed liquidated damages calculated from day to day at the rate of eight per centum [8%] per annum on the purchase price of the said property from such aforesaid date to the date of actual completion and delivery of possession of the said building to the purchaser.In the event the building was not completed on the due date, ie 18 September 1975. Possession was not finally delivered until 7 November 1977. In subsequent proceedings for the payment of the liquidated damages, which had accrued under cl 17, the question arose as to the date on which these damages were due. The developers` argument was that the action was statute barred because the debt had fallen due, and therefore the cause of action had accrued, on 18 September 1975, whilst the purchaser argued that it had only accrued on the actual date of possession, ie 7 November 1977.The Privy Council found in favour of the purchaser. Lord Oliver, delivering the judgment of the board, stated (at p 3):What in essence the proviso to cl 17 was creating was a contractual obligation in a particular event to pay a single sum by way of indemnity for the period during which the appellant was kept out of the building for which, in large measure, she would already have paid, such sum being calculated upon a particular basis. The true construction of the clause, Mr Kidwell submits, is that the respondent was undertaking to pay not a series of interest payments accruing ex die in diem but a single aggregate sum which could not be calculated and did not become due until the building was completed and ready to be handed over. Their Lordships have found Mr Kidwell`s submissions persuasive.His Lordship went on to consider the genesis of cl 17 which was a statutory provision that imposed an obligation on a housing developer to indemnify any purchaser for any delay in delivery of possession. Lord Oliver noted that the statutory rule when incorporated into the actual contract was modified by changing the indemnity to liquidated damages and secondly the formula for calculation of the indemnity was modified by specifying not only the date when the obligation to indemnify commenced but also the date when it ended. He said (at p 4):The obligation is introduced by the words `the vendor shall pay` and there follows the calculation of the sum which he is to pay carefully defined by its opening and closing date.A construction which would import into the clause a fresh obligation on the vendor to pay the calculated amount at the end of each day would be capricious, involving as it does a series of breaches of contract as each day passes without payment being made. The whole tenor of the clause is, in their Lordships` view, that the vendor is assuming as a matter of contract and subject to the occurrence of the condition precedent that the building remains uncompleted on the stipulated date, an express contractual obligation to pay a single sum which cannot become due, because it cannot be ascertained, until the building has been completed and possession can be delivered....In their Lordships` judgment, the only sensible construction of cl 17 is, as Mr Kidwell has contended, that it imposes an obligation to pay, in substitution for any other right to damages which the purchaser might otherwise have, a single sum to be calculated and ascertained at a particular date and that until that sum has been ascertained it does not become due and cannot be sued for.Loh Wai Lian`s case may be contrasted with a more recent Malaysian case,Insun Development Sdn Bhd v Azali bin Baker[1996] 2 MLJ 188, which also involved the construction of a liquidated damages clause in a contract for the sale of a house being built by a housing developer. The clause in question, cl 18(2), provided that if the developer/vendor failed to deliver vacant possession of the house on the due date, he would have to `pay immediately to the purchaser liquidated damages to be calculated from day to day at the rate of ten per centum (10%) per annum of the purchase price`. Again, there was an issue of limitation of action, which turned on the question when payment of the liquidated damages became due. The Federal Court held that as the clause provided for a formula for the calculation of liquidated damages which defined the opening date but not the closing date, the general rule applied. It followed that the purchaser`s right of action for damages for breach of contract accrued on the date of the breach which, in this case, was the day after the specified date for delivery of vacant possession.The judgment of the Federal Court was delivered by Edgar Joseph Jr FCJ. His Honour analysedLoh Wai Lian`s case and distinguished it on the following basis (at p 197):The obvious difference between the contract of sale inLoh Wai Lianand the agreement here which we consider to be most material is this: under the former, the statutory formula for the calculation of the indemnity was modified by expressly stating not only theterminus a quo(the opening date) but also theterminus ad quem(the closing date), which was the date of actual completion and delivery of possession, whereas under the latter - although there is, by cl 18(2), also a formula for the calculation of liquidated  damages - it only specifies the terminus a quo but not theterminus ad quem. In our view, this difference is a matter of critical substance.It is also obvious from the judgment of the Privy Council inLoh Wai Lianthat but for the unusual language of cl 17 of the contract of sale, which had provided a formula for the computation of damages payable by the developer to the buyer for delay, by defining not merely theterminus a quo(the opening date) required under r 12(1)(4) of the 1970 Rules but also theterminus ad quem(the closing date) - not required under r 12(1)(r) - the case would have been differently decided, ...The two cases cited above were instructive in indicating the different interpretations that would result from differences in the form of words used to specify the way in which the obligation to pay a sum of money arises. It appeared to me that the language used in order 5 of the judgment in Suit 1994/97 had to be construed in the same manner as the language used in cl 17 in the contract considered inLoh Wai Lian`s case. This was because the order prescribed the formula for the computation of interest by specifying both the date on which interest would start to run and the date on which the interest would cease to run. This was the essential difference that led to the differing outcomes in the two Malaysian cases. Also here it was not a simple matter of just calculating the interest which had accrued on each day that had elapsed since the starting date but the final amount payable could only be ascertained by deducting the sum of rental received by Cathay during the period prior to completion. To do this sum two amounts had to be ascertained: one the total amount of interest accruing and two, the total amount of rental received up to the completion date. Without knowing the completion date therefore it would be impossible to calculate either of these amounts.Cathay contended that under the judgment LKM had been supposed to complete the purchase within 14 days of the judgment date. If it had completed the purchase on the 14th day, ie 13 July 1999, it would, on that date, have paid both the purchase price and the interest that had accrued thereon from 17 August 1996 to 13 July 1999 less the rental collected. Since it had an obligation under the judgment to complete by 13 July 1999, the interest would have accrued to and been payable, at the latest, on that date. Although the statutory demand was based on interest calculated up to 17 August, it could not be denied that as at 13 July 1999, there had still been a substantial amount of interest due and payable and therefore, the statutory demand was valid in respect of the amount payable on that day and Cathay should not be restrained from proceeding on it. I could not accept that argument since the fact remained that no actual completion had taken place on 13 July 1999. The amount payable to Cathay by way of late payment interest could not have been ascertained on that day as the judgment required it to be ascertained on the completion date itself and not at any other time. It would have been a different matter if the statutory demand had been made in respect of the balance of the purchase price. The judgment specified that that sum had to be paid within 14 days of the judgment. So, at the latest, it would have fallen due on 13 July 1999 and could thereafter have been the subject of a valid statutory demand.In the result, I agreed with the submission made on behalf of LKM that the statutory demand dated 17 August 1999 was invalid as it had been made in respect of a debt which had not accrued as of that date. Accordingly, I made the order  restraining Cathay from presenting a winding up petition on the basis of that statutory demand.",
        "(ii)[emsp ]Would a petition for winding up be an abuse of process?": "The injunction order that I had made was in specific reference to a particular statutory demand. This order was insufficient from the point of view of LKM as it left Cathay free to issue a further statutory demand for the sum of $14,850,000 which was payable as the purchase price under the sale and purchase contract, and, possibly thereafter, a petition based on the new demand. What LKM wanted was a more wide-ranging injunction.Mr Hwang submitted that it was an abuse of process to bring winding up proceedings against a company based on a judgment appealed against. He said this was even clearer in cases where the company had either obtained or applied for a stay of execution of the judgment appealed against. Various authorities were referred to as being in support of this submission.I could not accept the proposition that for a judgment creditor to present a winding up petition against the judgment debtor would be an abuse of process simply because the judgment was under appeal. In my view, if enforcement of a judgment is not stayed pending the appeal, the judgment creditor is entitled to take all legal steps open to him to recover the amount of the judgment debt. No doubt the presentation of a winding up petition is not procedurally a method of execution of a court judgment, but, in a situation like the present, recourse to that procedure is in effect a parallel method of execution. Whether a winding up should be restrained or not should, in my view, be decided on the same basis as an application for stay of execution would be and the petition should not be dismissed as being ipso facto an abuse of process. In the present case, as Cathay had already made an application for a stay of execution pending judgment, I considered that the judge hearing that application would be in a better position to decide the issue. Additionally, that application was scheduled to be heard the following week. I therefore made the second order, ie that Cathay be restrained from presenting a winding up petition pending the hearing of the stay application. I took the view that if a stay order was then issued that would be a ground on which any future action taken by Cathay to wind up LKM could be restrained.A further reason for my stand on the abuse of process contention was that I did not accept the argument that once a judgment debt has been appealed against it becomes a disputed debt and cannot found the basis of a statutory demand. Mr Hwang referred me toSolid Kitchen Sdn Bhd v Regal Development Sdn Bhd[1998] 6 MLJ 437where Rekhraj J held that a judgment debt which is the subject of a further appeal to a superior court could not be said to be an undisputed debt and pending the appeal, the judgment creditor could not claim to be a creditor entitled to present a winding up petition under the Malaysian Companies Act which has provisions similar to s 254 of our Act. His Honour did not, however, give reasons for his contention that a judgment debt under appeal could not be regarded as undisputed.AsPalmer`s Company Law, Vol 3 states (at para 15.210), under case law if a company which has been served with a statutory demand bona fide disputes the  debt then it has not `neglected to pay` within s 254(2)(a) of the Act and the statutory presumption of insolvency cannot be invoked against it. The question is what a bona fide dispute amounts to. Palmer`s answer is as follows (at pp 15067-15068):To fall within the general principle, the dispute must be bona fide in both a subjective and an objective sense. Thus the reason for not paying the debt must be honestly believed to exist and must be based on substantial or reasonable grounds. `Substantial` means having substance and not frivolous, which disputes the court should ignore. There must be so much doubt and question about the liability to pay the debt that the court sees that there is a question to be decided. The onus is on the company `to bring forward a prima facie case which satisfies the court that there is something which ought to be tried either before the court itself or in an action, or by some other proceedings.` In considering the matter the court will take into account the following factors: (i) the fact that the company has been given leave to defend an action begun by specially indorsed writ; (2) whether where is a set-off or counter-claim based on a substantial ground; (3) whether the company has lodged an appeal against the judgment debt on which the petition is based; and (4) an allegation by the company that the judgment was obtained by fraud. However, none of these factors is conclusive for the court`s discretion will be exercised in the light of all circumstances then existing.`Whether a debt is disputed on bona fide grounds is a matter to be assessed, as pointed out above, on the basis of an assessment of all existing circumstances. In my opinion, a judgment debt cannot be regarded as being in dispute simply because the debtor has filed an appeal against the judgment. The circumstances in which the judgment was obtained must be considered. Where it is a judgment which has been entered after a full trial during which the judgment debtor company had the opportunity to put forward whatever evidence and arguments it wished to rely on to dispute the validity of the claim, it is impossible to say that the simple filing of an appeal is enough to discharge the onus on the company to bring forward a prima facie case that there is a further question to be tried. On the contrary since the matter was tried at first instance and decided against the company, the prima facie position is that the company had no defence to the claim. Therefore, prima facie, any further dispute over the debt would not be bona fide. In such a situation the company must be able to put forward reasonable arguments and circumstances in support of its continued resistance to the validity of the debt before it will be able to convince the court that, despite the judgment, the debt is still the subject of a bona fide dispute.In the present case, no facts and circumstances apart from the filing of the appeal were put before me in order to enable me to determine that the judgment debt was still the subject of a bona fide dispute. There was no ground on which I could issue a general restraint against the presentation of a winding up petition against LKM prior to the hearing of the appeal.Outcome:Application allowed.Copyright © Government of Singapore."
    }
}