{
    "case_title": "Tan Kong Kar and Another v Bonsel Development Pte Ltd",
    "ncitation": "[2000] SGHC 40",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The background": "The plaintiffs, husband and wife, came across an advertisement concerning the sale of terrace houses at Mariam Walk and approached the defendants, the developers of the houses, with a view to purchasing one of them. They were attended by one Stanley Wong, an employee of the defendants, on 11 January 1999 at their home. He presented the plaintiffs with the option and represented that the option was in the standard form except for cl 10, which reads:The sale of the property is subject to us removing the existing caveats lodged against the property and in the event we are unable to do so by the completion date, completion shall take place two (2) weeks from the date the said caveats are removed.The plaintiffs executed the option and paid the option fee of 1% of the purchase price ($1,015,000). The option was due to expire at 4pm on 25 January 1999, with completion fixed at ten weeks from the date of exercise of the option. I shall refer to the other relevant terms of the option in due course.On 23 January 1999, the defendants` solicitors wrote to the plaintiffs` solicitors stating:As we informed you, the caveat referred to in cl 10 of the option is the caveat lodged by the previous purchasers of the property. Their sale and purchase agreement with our clients was annulled after the expiration of the 21-days` notice. We have written to the solicitors to withdraw their clients` caveat. We have now been informed by them that their clients wish to proceed with the purchase. We have informed them that it is not possible and have given them notice that if their clients` caveat is not withdrawn, we  will commence legal proceedings against their clients to have the caveat removed. Please take note that the sale is subject to the said caveat being removed.We will keep you informed of developments.Relying on the representation that the earlier sale and purchase agreement had been annulled, the plaintiffs exercised the option and paid the balance of the 10% deposit to the defendants` solicitors on 25 January 1999. Between 20 January 1999 and 31 March 1999, the plaintiffs liquidated their assets, namely, a Housing and Development Board flat and securities, to finance the purchase of the property.The completion of the sale was scheduled for 5 April 1999, but this was delayed as the originating summons instituted by the defendants to have the original purchasers remove their caveat had not yet been heard. Unfortunately matters went awry and on 18 May 1999, the defendants` solicitors wrote to the plaintiffs informing them that:[o]ur clients` application to remove the original purchasers` caveat was heard this morning and we regret to inform you that the court did not make an order in favour of our clients. The effect of the ruling today is that the original sale and purchase agreement is still subsisting and the original purchasers are entitled to maintain their caveat. Our clients accordingly cannot proceed with the sale of the property to your clients. Please note that the sale to your clients is subject to the original purchasers` caveat being removed. In the circumstances, if it cannot be done, the sale will be abortive.The defendants had issued a 21-days` notice of repudiation under cl 5(3) of the earlier sale and purchase agreement on 5 January 1998 as the original purchasers had defaulted on their payment obligations. Nevertheless they insisted on holding the original purchasers to the agreement on 20 May 1998 and gave 14-days` notice to complete. This was notwithstanding the fact that the original purchasers had written earlier on 12 May 1998 expressly stating that they were unable to pay the outstanding progress instalments and interest, and had asked the defendants to treat the agreement as terminated in accordance with cl 5(3).It appears that nothing transpired thereafter until the defendants wrote again on 11 January 1999 to the original purchasers` solicitors, apparently in ignorance of their letter of 20 May 1998, reiterating that the earlier sale and purchase agreement had been annulled by reason of the original purchasers` non-compliance with the notice issued on 5 January 1998. Accordingly, they requested that the original purchasers remove their caveat. One can only assume that the proceedings to remove the caveat failed because the defendants had by their conduct waived their notice of rescission and were thus held to the earlier agreement.As a result of the abortive sale, the plaintiffs eventually purchased an identical property at No 49 Mariam Walk at a higher price of $1,290,000. They had also incurred wasted expenditure including the cost of alternative accommodation as a result of the ensuing delay; hence the present summons.",
        "The construction of cl 10": "The principal issue that crystallised before me was this: what was the nature of the obligation imposed by cl 10 on the defendants to remove the caveat lodged against the property? Counsel for the plaintiffs argued that the clause clearly imposed an absolute obligation on the defendants to do so, with the only consequence of failure being the postponement of the completion date. The defendants contended that the effect of cl 10 was to render the option a conditional contract for the sale of property, the contingency being the removal of the caveat lodged against the property. The use of the wordssubjectto clearly indicated that the contingency was either a condition precedent to the formation or performance of the contract. If it was the former, the main obligations of the contract remained inchoate and if it was the latter, the sale simply could not proceed until the contingency materialised. This not having occurred, the defendants were not in breach (repudiatory or otherwise) as they were under no obligation to complete the sale of the property.Counsel added that, at most, the defendants were only obliged to take reasonable steps to remove the caveat in order to fulfil the condition, pursuant to an implied subsidiary obligation to the same effect notwithstanding the inchoate main obligations. He submitted that the defendants had discharged this obligation as the institution of the (albeit unsuccessful) proceedings to remove the caveat was all that could be reasonably expected of them in the circumstances.It is convenient at this juncture to set out the clauses in the option relevant to the question at hand:2 To exercise this option, you must sign at the part of this option marked `Acceptance Copy` and deliver it with a cheque for 10% of the purchase price (less the option money) in favour of our solicitors ... as deposit before this option expires ...3 The sale is subject to the Singapore Law Society`s Conditions of Sale 1994 in so far as they are not applicable to a sale by private treaty and are varied by or inconsistent with the terms and conditions of this option....5 The title of the property shall be properly deduced and free from encumbrances. You shall not require the production or delivery of any deeds or documents not in our possession nor make any requisitions or objection whatsoever in reference thereto.6 The property is sold subject to all restrictive and other covenants and conditions affecting it.7 Completion shall be subject to no notice of acquisition or intended acquisition being served by the relevant government department/s on or before completion in respect of the property.8 The property is sold subject to your solicitors receiving satisfactory replies to their requisitions to the various Government Departments and to road/drainage interpretation plans so far as such replies relate to the property and if any such replies or plans are unsatisfactory then you may at your absolute discretion rescind this Agreement arising out of your acceptance of this option and in such event we shall forthwith refund to you all moneys paid by you to us but without any interest compensation or deductions whatsoever and thereupon neither party shall have claim or demand against the other for costs damages or compensation or otherwise...9 .If this sale and purchase is rescinded under cl 7 or cl 8 hereof, we shall forthwith refund you all moneys paid by you hereunder without any interest compensation or deduction whatsoever. Each party hereto shall bear their or his own solicitors` costs in the mater and neither party hereto shall have any claim or demand against the other party for damages, costs or otherwise whatsoever in the matter....13 When properly exercised, the option shall form a legally binding contract for the sale and purchase of the property.It is obvious that the parties` use of the wordssubjectto was not determinative of the conditional nature of cl 10 as its meaning was dependant on the context. For example, their use in cl 3 was in the sensegoverned bywhile in cl 6 they connoted an exception to the defendants` obligation to provide title free from encumbrances.Having construed the option as a whole, I concluded that it was not possible to accept the defendants` submissions for several cumulative reasons. Firstly, cl 10 could not operate as a condition precedent to the formation or existence of a binding agreement simply because cl 13 expressly provided otherwise. Once the option was properly exercised in accordance with cl 2, a legally binding contract was immediately formed under cl 13 without further qualification. A consequence of this is that there is no necessity to read into cl 10 a duty on the defendants to co-operate by taking reasonable steps to procure fulfilment of the condition.Secondly, the alternative interpretation of the clause as a condition subsequent determining the previously binding agreement was not supported by the express language of the option. Clauses 7 and 8 provided for the extraneous contingencies of a notification of acquisition (or intended acquisition) and unsatisfactory replies to requisitions. Significantly, cll 8 and 9 expressly provided that upon the occurrence of these contingencies, the option would be rescinded and the plaintiffs would be refunded all their existing payments without further recourse. In contrast, the sole consequence under cl 10 for the defendants` failure to remove the caveatby completion(and not simply the failure alone) was the postponement of completion pending the removal. Although it might be implied that if there was no such removal, there would be no completion,expressio unius est exclusio alterius: the expression of one thing is the exclusion of another.Thirdly, I did not consider that the application of this well known maxim would lead to any inconsistency or injustice here. The defendants` obligation under cl 5 read with cl 6 was to convey title free from encumbrances, subject to all restrictive covenants and conditions. These restrictions could not conceivably include the potential equitable interest of the original purchasers under their earlier sale and purchase agreement. If it be contended that cl 10 was also an exception to the defendants` obligations under cl 5, this was again not supported by the context of the option. Clauses 5 and 6 were specifically concerned with the title of the property. In contrast when properly construed, cl 10 by reference to the `sale of the property` and `completion date`, as opposed to the agreement in general or some aspect of title, was concerned with the time of performance of the defendants` obligations to complete the sale of the property.Thus, construing the defendants` undertaking to remove this caveat as absolute was perfectly consistent with their obligation in any case to give title free from encumbrances. Seen in this light, the objective of cl 10 was to provide the defendants with an extension of time for completion date pending removal, should this take longer than expected. Removal of the caveat was still necessary as s 119(4) of the Land Titles Act (Cap 157) prohibits the registration of any dealing which is prohibited by the caveat so long as it remains effective.Finally, counsel for the defendants referred me to the factual matrix at the time the option was granted. He pointed out that after the plaintiffs were granted the option, they were informed of the possible difficulties in removing the caveat resulting from the original purchasers` decision to proceed with their purchase, before they exercised the option. Having proceeded with full knowledge of this, the plaintiffs thus took the risk that the proceedings would be unsuccessful. Under these circumstances, cl 10 was inserted simply because completion was impossible and title could not conveyed unless the caveat was removed. These facts thus supported a conditional construction of the clause.In so far as the facts above constituted evidence of the subjective intentions of the parties, this was irrelevant. We are only concerned with the objective intentions of the parties as expressed in the option. Secondly, the latter argument contradicts the chronology of events. At the date of the option, the defendants were clearly of the understanding that the earlier sale and purchase agreement was annulled and were unaware of the original purchasers` intentions. In any event, it is not at all clear that the plaintiffs were to accept the risk of the proceedings to remove the caveat. The common understanding between the parties, based on the defendants` solicitors` clear representation on 18 May 1999, was that the earlier sale and purchase agreement had in fact been annulled. Accordingly, there would be no basis for the original purchasers to maintain the caveat and thus no conceivable difficulty in having it removed. Thus, the factual matrix was entirely consistent with the conclusion that the defendants` obligation to remove the caveats was absolute.",
        "Conclusion": "Clause 10 could obviously have been better drafted. However, if there was any doubt as to its construction, this should be construed strictly against the defendants, the party in whose favour the clause was inserted: see Burton & Co v English & Co (1883) 12 QBD 218. The defendants` counsel conceded that if cl 10 imposed an absolute obligation, then the plaintiffs were entitled to damages. For the foregoing reasons, I made the orders granted.Outcome:Plaintiffs` claim allowed.Copyright © Government of Singapore."
    }
}