{
    "case_title": "Yow Mee Lan v Chen Kai Buan",
    "ncitation": "[2000] SGHC 152",
    "coram": "Judith Prakash J",
    "sections": {
        "Background": "The husband and wife met in 1970 when both became employees of a company called International Wood Products Ltd (`IWP`). The husband who had passed his `A` levels about a year earlier, joined IWP as a charge hand and was subsequently promoted through the ranks. By the time he left IWP in 1982, he was a production manager earning a salary of about $3,200 per month. The wife also started out as a charge hand but her qualifications were not as good and she was promoted only up to the level of quality control clerk level.The parties married in December 1973. Their first child, a daughter, was born in January 1975 and the wife ceased work for a time. In August 1976, she resumed employment with IWP as an accounts clerk. She remained there until the birth of the couple`s son in August 1979. For some time thereafter, the wife was a full-time housewife.In 1982, both parties went to work for a company called Plywood Engineering Consultants Pte Ltd. This company was also in the timber industry. The husband worked there for about two years. The wife maintained that he was a director of the company but the husband`s recall was that he was essentially an employee earning $3,500 per month plus commission. The wife`s work was  administrative. She stated that she handled all the company`s administration matters but the husband thought she had been only a clerk.While employed by Plywood Engineering, the husband travelled extensively in Indonesia and built up contacts there. When Plywood Engineering ceased operation sometime in 1985 due to the economic recession then prevailing, the husband decided to start his own business, Plymat Engineering Consultants (`Plymat`). The business was registered as a sole proprietorship with the husband being the proprietor. The wife`s contention throughout the proceedings, which the husband steadfastly denied, was that she was an undisclosed and equal partner in Plymat. It was undisputed, however, that from the time it was founded up to May 1996, the wife worked in Plymat and was in charge of its administration.The business of Plymat was to sell spare parts and materials for the timber industry. In addition, the husband undertook management consultancy work to several companies in Indonesia. He advised his Indonesian clients on the plywood manufacturing and management process from the initial stage of processing the raw material right up to the end stage of exporting the end product. The wife`s position was that all services rendered by the husband were provided as part of Plymat`s business and that she had a share in all Plymat`s income from these services.The husband admitted that he had used the name Plymat in connection with some aspects of the consultancy business since it was necessary to give people business cards and it was necessary to have an organisation for signing contracts. Notwithstanding that, he averred that Plymat was essentially a separate business and the wife had never had anything to do with it. Except for very minor matters, whatever he needed to do for the Indonesian consultancy business, was done with the assistance of Indonesian employees of Indonesian organisations with whom he had made arrangements in Indonesia.After Plymat was established, the parties did extremely well financially. Plymat seems to have been a profitable business from the start even if only its trading transactions are considered. As for the consultancy business, that proved to be a money-spinner. By 1989, the husband, in order to avoid paying tax on earnings for work done outside Singapore, had taken the advice of his book-keeper and directed the Indonesian clients to send the consultancy fees to bank accounts in Hong Kong. These accounts were opened in the joint names of the husband and wife and it was the wife who was responsible for writing some of the letters directing the clients on payment procedures.In the meantime, the parties` third child, another daughter, had been born. The wife appears to have been the main caregiver for the children as the husband travelled extensively in order to provide his consultancy services to the Indonesian clients. The wife remained in Singapore running the home and the Plymat office.This successful edifice started to crumble in 1993 when the wife found out that the husband not only had a mistress but also two children by her. This second family lived in Johor and the husband also maintained a joint bank account there with his mistress. The marriage limped along for some time but in August or September 1994 according to the wife there was a big quarrel between the parties  over the husband`s failure to keep an earlier promise to break up with his mistress. The wife became convinced that he would not give up the other woman and in October 1994, she withdrew an aggregate amount of HK$9,683,827.96 (about S$1.8m) from two of the Hong Kong accounts and put them in accounts in her own name. It is established that she made these withdrawals without the husband`s prior knowledge and consent but she averred that when she informed him later of what she had done, the husband raised no objection to her actions. The husband, on the other hand, stated that he had been very angry and had asked the wife to add his name to the bank account that now held the moneys. She did not do so.The next crisis in the marriage related to a flat purchased in 1994 in the joint names of the parties. This was located at a development called Astor Green. The husband paid the downpayment, all expenses in connection with the purchase, all outgoings and all repayments due on the mortgage loan. Although the wife made no financial contribution to the acquisition, she was included as a joint owner. The husband explained that he did this to give the wife and the children some security and because he wanted the family to move there.Subsequently, when the wife proved unwilling to move into the Astor Green flat, the husband decided to sell it. He found a buyer willing to pay $1.05m for the flat but as the parties` relationship was bad at the time, the wife refused to co-operate in the sale. In March 1996, the husband forged her name on the option to purchase the flat thinking that the wife might change her mind about the sale. This the wife refused to do and the sale had to be aborted. The flat was subsequently sold at a much lower price pursuant to a court order obtained by the husband. In the meantime, the wife had made a police complaint against the husband and charges were brought against him. In July 1998, the husband pleaded guilty to a charge of simple forgery and was fined.In May 1996, the wife ceased to work at Plymat. The circumstances in which she left caused her aggravation. She said it was because the husband had decided to reduce her position to that of a part-time clerk earning only $600 a month and had left a notice to that effect in the office for all to see. The husband complained the wife had been offered the part-time position because he needed to reduce Plymat`s overheads since its income had fallen and that she had not been willing to work on that basis. He did not dispute the wife`s account of how he had notified her of the new position.In mid-1996, the husband instructed solicitors in Hong Kong to look into recovering the moneys that the wife had removed from the Hong Kong accounts. He commenced legal proceedings against the wife in Hong Kong in October 1996 and was able to recover HK$2,741,779.14 by garnishee action in those proceedings. In July 1998, he began an action in this court in Suit 1180/98 against the wife for the recovery of the balance of those moneys. That same month, he moved out of the matrimonial home.For the wife, the husband`s action against her in Singapore was the last straw. In August 1998, she commenced these divorce proceedings against the husband on the grounds of adultery and unreasonable behaviour. The decree nisi was granted in June 1999. The husband`s suit to recover the Hong Kong money was  discontinued (with liberty to restore) pending the outcome of the ancillary matters herein.",
        "Decision at first instance on the ancillary matters": "AssetsThe parties` success in business was reflected in the number of assets that the District Judge had to consider for division between them. These assets can be listed briefly as follows:(1) the matrimonial home, a flat at Pandan Gardens which is held in the joint names of the parties;(2) an office unit at the building called The Plaza in Beach Road, also held jointly by the parties;(3) moneys in Singapore bank accounts;(4) the husband`s Singapore listed shares;(5) the husband`s Singapore car;(6) three houses in Johor Bahru, owned solely by the husband;(7) moneys in the husband`s foreign bank accounts in Johor and Hong Kong;(8) moneys withdrawn by the wife from the Hong Kong bank accounts;(9) Plymat;(10) CPF savings of both parties;(11) club memberships;(12) proceeds of sale of the flat in Astor Green and a refund from the cancelled purchase of a property in Malaysia that had been bought in joint names;(13) moneys in the wife`s bank accounts.In coming to her decision, the District Judge made findings on various areas of dispute between the parties. First, as regards Plymat, she did not accept the wife`s submission that the wife had been an equal undisclosed partner of Plymat. Secondly, as to whether the overseas consultancy fees were part of Plymat`s income or should be regarded as the husband`s personal income, the District Judge took the view that the overseas consultancy business should be regarded as separate business. Furthermore, Her Honour found that the overseas consultancy business came mainly from Indonesia and the bulk of the husband`s earnings from this business had been materially adversely affected by the economic crisis. However, she made no finding that the overseas consultancy business had ceased as he claimed.On the bank accounts, Her Honour found that the entire principal sum which the wife had withdrawn from the Hong Kong bank accounts in 1994 should be notionally pooled back and made available for distribution. No order was made that the sums be pooled back with interest as there was no evidence that the wife had kept the moneys in an interest bearing account. Further, if interest was factored in, the husband would likewise have to account for interest on the sums he garnished. The District Judge regarded the interest as falling within the de minimis principle.The wife had argued that the withdrawals made by the husband from the Hong Kong accounts over the years should be pooled back as well and made available for distribution. The District Judge rejected this contention. The judge also found that two Malaysian bank accounts were jointly owned by the husband with his Malaysian partner and therefore ordered that only half the amounts in these bank accounts be pooled for distribution.The wife had contended that a house in Jalan Hang Tuah, Johor Bahru was owned by the husband through a nominee. The District Judge held that there was insufficient evidence to make a finding to that effect.The District Judge drew an adverse inference against the husband for his failure to make full and frank disclosure of his bank accounts and Malaysian properties. She was satisfied that the undisclosed assets would most likely comprise Malaysian properties and bank accounts since the husband had resided in Malaysia with his second family from July 1998 and also had investments and business dealings there. She came to the conclusion that the undisclosed assets would be somewhat less than 20% of the value of his disclosed assets (which the husband estimated to be more than S$3m). The District Judge made a similar adverse inference against the wife. The wife had not made full and frank disclosure of what she owned.Approach and orders of the District JudgeThe District Judge took into account the length of the marriage and the different roles played by the parties. She considered it would be an artificial starting point to mathematically ascertain the precise amount of money each party had contributed towards the acquisition of the assets and in this view was much influenced by the following passage from the judgment of Justice Warren LH Khoo inSoh Chan Soon v Tan Choon Yock(Unreported)  where His Honour said:It is closer to reality to use as the starting point the assumption that both parties have contributed jointly and equally throughout the marriage to the acquisition and growth of the equity in the family home. An account can then be taken of other factors to tilt the balance one way or another. It is more a qualitative than a quantitative exercise.The District Judge summed up her approach as follows:53 Having regard to the matters stated in s 112(2), I was of the view that I should not order a single apportionment percentage across the board to all the matrimonial assets, as the different factors weighed differently in respect of the assets. Further the petitioner`s stand was that in respect of some of the assets (eg the club memberships, Plymat, CPF moneys) she was not asking for the court to divide up these assets, but that the court should take into account in a broad way these assets that the respondent was keeping in dividing up the other assets. It was not her stand that the court should order a valuation of these assets and her share paid to her.54 .I agreed with this in principle, as a division simpliciter in respect of some of the assets would not do justice to either of them. In the case of Plymat, the respondent was the sole proprietor and the alter ego of the business, and to order a division of the business which appeared to be a viable going concern when the petitioner was not asking for such division would serve no purpose. However the task was made more difficult by the failure of either party to tender some objective indication of  the value of some of the major assets. Further in the case of the CLOB shares, there was no indication of the last done price of the shares, but even if there was, any assessment of their worth on that basis would be speculative in view of the existing trading impasse.In regard to the matrimonial home at Pandan Gardens, the District Judge considered that this was a case where the equal apportionment principle in a long marriage should apply squarely. She divided the property equally between the parties and, as the wife and the children were living there and wanted to continue to do so, she ordered the husband to transfer his share of the flat to the wife. As this was not a sale in the open market, she also ordered that the HDB`s market valuation be used for determining the amount to be paid on transfer. The wife has appealed against this order on the basis that the flat should be given to her absolutely and the husband has cross-appealed arguing that the flat should be transferred at its open market value rather than the HDB`s valuation.As regards the other assets, the District Judge considered that the factors in s 112(2) of the Women`s Charter (Cap 353) (`the Charter`) weighed against an equal apportionment of them. She took into account that the husband`s financial contribution to the purchase of the Beach Road property exceeded those of the wife; that the funds in the foreign bank accounts and those used to purchase the Malaysian property came principally from the husband`s overseas consultancy fees; that the husband`s earnings from Plymat were the source of the funds for the moneys in the Singapore bank accounts and substantially all the Singapore assets including the Singapore shares and the car; and that the wife`s direct financial contributions were confined to the purchase of the matrimonial home and the Beach Road property. Her other contributions over the course of the marriage were non-financial. The District Judge considered those assets and bank deposits acquired through Plymat`s earnings as being primarily acquired through the husband`s funds and efforts.The District Judge was of the view that therefore the husband should be given the major share of the assets which had been purchased with Plymat`s earnings and his consultancy fees. Her basic finding was that the wife was entitled to 25% of these assets. In order to reflect the adverse inference she had drawn in respect of the husband`s inadequate disclosure, she increased the wife`s share by 5% to 30%. Further, to reflect the 11 years which the wife spent working in Plymat, the District Judge awarded her a further 10% interest in the Singapore assets purchased or acquired with Plymat`s funds. In the result, the wife was awarded:(1) a 40% share of the Singapore assets including the bank accounts and the office property and rentals collected from it;(2) a 30% share of the three Malaysian properties and all the foreign bank accounts; and(3) one club membership (which was all she in fact wanted).The husband was allowed to keep the rest of his disclosed assets including Plymat and CLOB shares and the wife was allowed to keep her CPF moneys and disclosed assets. As regards maintenance, the husband was ordered to pay a lump sum of $172,800 for the wife`s maintenance (eight years at $1,800 per month); $1,200 monthly for the youngest child and $500 monthly for the son while he is in  national service and the costs of his tertiary education (including living expenses) thereafter.Both parties have appealed against the above orders. The wife wants a 60% interest in all of the assets apart from the matrimonial home. She also wants the court to make no order in respect of the Hong Kong accounts or alternatively, to take into account as well the husband`s aggregate withdrawals from that account over the years, and apportion the same between the parties in the ratio 60:40 in her favour. As for maintenance, she wants a monthly maintenance of $3,000 per month or such lump sum as the court deems appropriate for herself, $1,500 per month for the youngest child and $1,800 per month for the son.The husband on the other hand wants the proportion of assets awarded to the wife to be reduced. He is only willing to give her 30% of his Singapore assets and 20% of his foreign assets including 20% of the amounts which she withdrew from the Hong Kong accounts. He also contests the order to share the rental he received from the Beach Road property. Finally, he wants a 20% share of all assets in the wife`s name (excluding the proceeds of her withdrawal from the Hong Kong accounts).",
        "The appeal - principles to be applied": "The injunction laid upon the court when it chooses to exercise the powers conferred by s 112(1) of the Charter to divide matrimonial assets between divorcing parties is that such division shall be effected in such proportions as are just and equitable. In considering what would be just and equitable in any particular case, the court must have regard to all the circumstances of that case and should also consider the various factors laid down in s 112(2). This is a wide ranging list which includes both financial and non-financial contributions made by the parties to the acquisition of the assets and to the care of both the immediate family and the extended family.The enactment of s 112 in 1996 removed the dichotomy which the previous legislation had contained: the difference in approach to the division of assets that had been acquired by the joint efforts of the parties from the approach taken to the division of those that had been acquired by the sole efforts of one of them. In the context of the famous and often analysed s 106, the efforts that resulted in any particular asset falling into one category or the other were financial efforts only and when it was established that only one party had financed an acquisition, the court had to give that party a greater share in that asset. On the other hand, when assets had been acquired by joint efforts, the court had a freer hand in dividing them though there was a suggestion that the court should divide them equally.Even when the previous regime held sway, the approach of the court was to consider the equities of the situation. As LP Thean JA noted in a often cited passage fromNg Hwee Keng v Chia Soon Hin William[1995] 2 SLR 231(at p 241), the court `has to adopt a \"broad brush\" approach after giving serious consideration to the factors laid down in s 106(4). Again, at the end of the day bearing in mind all the relevant factors, we have to consider what in the circumstances would be a just and equitable division between the parties`.LP Thean JA`s observation has been adopted and reinforced in statutory form as can be seen from the language of ss 112(1) and (2). The court`s task in each case now is to consider the marriage before it as a whole and particularly the role played by each of the parties in the physical and emotional care of the family and in their financial dealings, in order to arrive, to the best of its ability, at a fair division of the assets. In doing this, the court will of course have regard to the various factors laid down both in s 112(2) and in s 114 but will not be bound to give pre-eminence to any of those factors in the way it used to have to do under s 106(4). Thus, a party`s financial contributions to the acquisition of any particular matrimonial asset can no longer be principally determinative of how it is divided and the court is free to give as much weight or more to other, non-financial, factors.Given that the court`s prime function is to make an equitable distribution of matrimonial assets in the light of all the circumstances, it cannot carry out this function properly if it operates on assumptions. In my view, the correct approach would be to first determine the facts of any particular case, consider which of the factors set out in s 112(2) are applicable on those facts and thereafter decide what on that basis would amount to an equitable division. In this regard, I must respectfully disagree with the approach postulated inSoh Chan Soon`s case that the starting point is the assumption that both parties have contributed jointly and equally throughout the marriage to the acquisition and growth of the equity in the family home (an assumption which in this case the court below applied equally to all other matrimonial assets) and thereafter take account of the other factors mentioned in s 112(2) to tilt the balance between them.First, that method is the inverse of the procedure that I consider appropriate. Secondly, experience of matrimonial disputes has shown me that, in most cases, it is not safe to assume that both parties have contributed equally to the acquisition of the family home, or any other asset for that matter. Thirdly, that method puts too much emphasis on financial contributions towards the acquisition of matrimonial assets. As the list of factors set out in s 112(2) makes clear, the court must take a wider perspective of the marriage than to simply consider what each party did to finance an acquisition or improve the value of that acquisition. For example, the court has to have regard to an obligation undertaken by either party for the benefit of any child of the marriage and to the extent of the contribution to the family which one party may have made by looking after an aged relative. The effect of applying the principle enunciated inSoh Chan Soon`s case as the decision below demonstrated, is that financial contributions are over-emphasised and other contributions to the marriage and the family`s welfare are under-emphasised. Thus here, if it had not been for the adverse inferences drawn, the wife would have been awarded only 35% of the local assets (excluding the home) and only 25% of the foreign assets.Applying the principle I have enunciated here, I must first determine the relevant facts. In my judgment, these are as follows. First, this was a long marriage. It stretched over a period of 26 years of increasing prosperity for the parties. When they married, they were in their early twenties and had no assets to their names. Their educational qualifications were not high, and their financial prospects would not have appeared particularly bright to an objective third party.  They did not, however, let themselves be impeded by their lack of formal qualifications. The husband turned out to be a most enterprising and capable person who was able to capitalise on the knowledge that he acquired in the timber industry and parlay this into a very profitable consultancy business.The wife was not as capable, professionally and academically, as the husband. She, however, did her utmost to support him both at home and in business. Apart from a few years which she devoted to care of her infant children, she worked continuously during the marriage, first for third parties and subsequently for the husband himself. In addition, while the husband travelled extensively and for long periods in order to build up and maintain his consultancy business, the wife looked after the home and the three children. There were no complaints about the way in which she had conducted herself as a mother or in her administrative duties in the office. Neither did the husband have any complaints about her conduct as a wife prior to her discovery of his infidelity. It was clear from the affidavits that were filed that prior to this devastating discovery, the wife`s commitment to her family and the marriage had been total and unstinting.As the District Judge found, the parties` prosperity in 1998 was largely due to the talents and efforts of the husband. It was his knowledge and ability that enabled him to charge the high fees that became the source of a substantial portion of the matrimonial assets. Although the Singapore business of Plymat was successful, it did not bring in anything close to the income earned from the consultancy business. It therefore played a smaller role in the acquisition of those assets.Given that the foreign bank accounts were savings from the income generated by the consultancy business and this same income was used to buy the Malaysian properties, and that some assets, like the Beach Road office, were paid for by Plymat, the court below had to determine whether first the consultancy business was part of Plymat and secondly, whether the wife was a partner in Plymat. On the first issue, the holding was that the overseas consultancy business had to be regarded as a separate business. In reaching this conclusion, the District Judge laid emphasis on the facts that the overseas income was never declared or reflected as part of Plymat`s income and that it arose from the efforts and skill of the husband.With respect, in my judgment, this holding was incorrect. The husband himself admitted that he had used the name Plymat in connection with some aspects of the consultancy business although he asserted it was a separate business. His excuse for using Plymat`s name was that it was necessary to give people business cards and also to have an organisation name for signing contracts. This seems to me to be a feeble excuse given that he could have registered a separate business name for the consultancy business had he wished to do so in view of the need in the commercial world to act in the guise of an organisation. Further, the wife`s evidence showed that she was fully aware of the clients of the consultancy business and the movement of fees. She asserted that she had this knowledge as she had been in charge of, and dealt with, these accounts on the instructions of the husband and had also typed letters at times to these clients to advise and direct them what to do with the consultancy fees. She was also in charge of checking whether payments of the fees had been made. Further, she had  to pay salaries of various technical advisors employed in Indonesia and if payments were not received she was responsible for calling the various clients to remind them of the payments due. The husband did not expressly deny that such tasks had been undertaken by the wife. What he said was that except for very minor matters, whatever he needed to do for the Indonesian consultancy business had been done with the assistance of Indonesian employees of his Indonesian principals. That statement related to the way in which he implemented the advice given to his clients but did not impact directly on whether he himself gave the advice as part of Plymat`s business or as part of a separate business. It is my finding, therefore, that the consultancy business must be regarded as part of Plymat.On the second issue, whether the wife was an equal undisclosed partner of Plymat, I am entirely in agreement with the finding of the District Judge that she was not. The wife`s allegation was that she and the husband had agreed to register Plymat in his name in case the business failed and they would put it in her name as well when Plymat was converted to a limited liability company. As the District Judge noted, however, Plymat was registered in 1985 and based on the financial records it had been financially sound through the years. If it had been intended for her to be a partner, there had been plenty of time either to register her as one or to convert the business into a limited liability company and issue shares to her.The wife contended that all the knowledge she had about Plymat and its dealings supported her claim to be a partner but this knowledge could equally have been gained simply through her work in the company and the confidences received from the husband. The wife also argued that the husband`s action in making her a joint account holder in respect of the bank accounts in Hong Kong into which the consultancy fees were deposited reflected her status as a partner of Plymat. The husband`s explanation for this, however, was that he wanted the wife to have easy access to these moneys in case something happened to him since he travelled so frequently and to remote areas in Indonesia. That was a reasonable explanation. It is notable that prior to the wife`s massive withdrawal in 1994, only the husband operated the Hong Kong accounts. Further, although the husband did use the consultancy fees to pay for properties which were purchased in joint names, he also used them to buy properties which were held in his name alone. There was thus no consistent course of conduct to show that he regarded those moneys as being jointly owned.To summarise, the marriage was a long one. The husband was the main income earner. The wife looked after the home and children and played a supporting role in the family business owned by the husband. It appears that she did not have either the knowledge or the talent which the husband did and could not herself have produced the substantial income he was able to generate. In these circumstances, what would be a just and equitable division of the assets? The District Judge placed great emphasis on the husband`s role as the income generator and considered that he should therefore have a major share of the assets.With due respect, that approach no longer accords with the legislation which takes a wider view. It recognises that a marriage is not a business where, generally, parties receive an economic reward commensurate with their economic input. It is  a union in which the husband and wife work together for their common good and the good of their children. Each of them uses (or should use) his or her abilities and efforts for the welfare of the family and contributes whatever he or she is able to. The partners often have unequal abilities whether as parents or as income earners but, as between them, this disparity of roles and talent should not result in unequal rewards where the contributions are made consistently and over a long period of time.In the present case, the wife contributed to the best of her ability both to the maintenance of the family and to the business. She provided essential backup on which the husband could rely. He was able to travel for long periods safe in the knowledge that both his home and his business were in reliable hands. No doubt someone else could have done the administrative work in Plymat which the wife did (the husband was at pains to denigrate her work as being merely clerical) but with someone else in charge, he would not have had the assurance that in the office his interests would not be undermined.It is also relevant to my consideration that the wife`s claims to share in the husband`s assets do not extend to his CPF contributions, two of his club memberships and to his interest in Plymat itself which would otherwise be regarded as a matrimonial asset. This renunciation is of value to the husband. No doubt, as far as Plymat is concerned, its main assets are the skill and contacts of the husband and those obviously could not be divided between the husband and the wife. Notwithstanding that, it would still be possible to do a valuation of Plymat`s business and to award the wife a share of that value.In all the circumstances of this case, I consider that the equitable division would be an equal division of those assets which the parties have asked to share in. This includes the wife`s assets since it is apparent that she acquired them during marriage and insofar as they were paid for solely by her, there is no doubt that the husband had contributed to the acquisition. He was the owner of Plymat and generated the income which paid her monthly salary. Secondly, he also gave her $4,000 a month for the household expenses and there is no suggestion that she had to return to him any sums which she saved from the household moneys. I would, however, exclude the wife`s CPF moneys from division on this basis since she has not asked for a share in the husband`s admittedly greater CPF funds.The wife submitted that she was entitled to a 60% share in the husband`s assets on the basis of her financial contribution, her non-financial contribution, the husband`s gross misconduct, his refusal to make frank and full disclosure, the long marriage and the needs of the wife and children. I do not accept this. The submission was based on the premise that the starting point was an equal division between the parties and that an additional amount should be added to her 50% share to reflect the factors cited. That premise is one that I have rejected since an equal division between the parties is not a starting point but an ending point. Further, the husband`s behaviour is no ground for giving the wife an extra share in the assets. Even though the initial cause of the marriage breakdown was the husband`s conduct, both parties behaved badly thereafter and the wife`s unreasonable refusal to co-operate with the husband in the sale of the Astor Green property has caused them both substantial financial damage. The wife herself is on shaky ground in asserting that non-disclosure on the part of the husband  entitled her to a larger share since she consistently refused to disclose what she did with the moneys that she had taken from the Hong Kong bank accounts. Simply admitting that she had withdrawn these moneys was not sufficient disclosure. That would have involved coming clean on how she had dealt with them and whether she had made any profit out of the use of them. Finally, the assets here are substantial and there is no necessity to give the wife more in order to meet the needs of the children.The matter does not end here. There are consequential issues to be decided as I apply the principle of equal division in this case.",
        "Consequential issues": "Matrimonial homeThe order made below was that this property which had been purchased in the parties` joint names and to which both parties had contributed financially (although the husband had made a greater contribution than the wife) should be divided equally between them. The wife had argued below that she should be given the property absolutely. Although this contention was renewed on appeal, her submission on the point was cursory going no further than to assert that since this flat had been the family`s home for decades and she and the children still needed it, she should be given it. I agree with the District Judge that that contention was no basis for ordering that she be given the flat absolutely. The husband had borne the greater financial burden in the purchase of the flat. There was no justification to deprive him entirely of interest in the flat as the wife had the economic muscle to buy this over.The husband`s dissatisfaction with the division of the matrimonial flat related to valuation rather than to quantum. He considered 50% was fair but argued that the division should be based on the market value of the flat as assessed by an external valuer rather than on HDB`s market valuation. The submission was that a division on the latter basis was wrong because it was tantamount to giving the wife more than 50% of the asset since she would be able to sell it in the open market for more than the conservative value assessed by the HDB. Counsel also pointed out that the asset was to be paid for by `netting off` and the wife had and would have more than sufficient funds to meet her needs. Further, the approach was not consistent with the other orders made which were based on either market or actual realisable values. I accept this reasoning. Accordingly, I vary the order below in relation to the matrimonial flat to the extent only that the amount to be paid by the husband for his 50% share shall be assessed on the basis of an open market valuation carried out by a valuer appointed jointly by the husband and wife`s solicitors.",
        "Singapore assets": "The order below was that the wife was to have a 40% share of the rest of the Singapore assets including the bank accounts and the Beach Road property and the rentals collected from it. Both parties appealed on the quantum of division. As  far as that is concerned, the order shall be varied to give the wife a 50% share of these assets except for the rentals collected from the Beach Road property.The court below ordered that the husband account, and pay, to the wife for 40% of the rentals received from the Beach Road property. The District Judge`s view was that since this property had been purchased in their joint names for use as Plymat`s office, the parties themselves had intended from the start that the wife should have some interest in the property. Further, both had contributed to the downpayment and the monthly mortgage instalments had been met partly from the CPF accounts of both parties ($852.50 from the husband and $442.50 from the wife) and partly from Plymat ($1,337). Her Honour therefore considered that the wife should have a right to the rentals collected corresponding to the 40% beneficial interest in the property awarded to her by the court.The husband appealed against this ruling. His counsel submitted that s 112 empowered the court to make a division of parties` existing assets. It was no part of the wife`s case that the rentals earned over the years had been accumulated and retained by the husband and still formed part of the parties` assets. Alternatively, counsel argued that there was no reason to suppose that rentals had not been subsumed as part of the declared assets. These were good points. I was also impressed by the contention that the order for division of the rentals was tantamount to the settling of a civil claim between the parties or an order made pursuant to s 59 of the Charter rather than a division of a matrimonial asset under s 112 since no particular asset could be pointed to as representing the accumulated rental.I agree with the finding below that the parties` intention was that the wife should have a beneficial interest in the Beach Road property and in fact she was entitled to such an interest by virtue of her financial contribution to its purchase. In my view, however, the interest which she had therein had to be determined at the time of acquisition of the property in accordance with property law principles and not at the time of divorce in accordance with principles relating to the division of the matrimonial property. Whilst the marriage was on-going and the wife`s beneficial interest in the Beach Road property was determined by the property law principles, her entitlement to a share in the rentals would have been similarly determined. In any event, at that time she would not have been entitled to a 40% share in the rentals. She would only have been entitled to such rental share as was equal to her share in the property itself. At any time prior to the hearing of the ancillary matters, the wife could have started a civil action for an accounting of the rental due to her. She did not do so and I think it is too late for her to ask for such an order now when whatever rentals the husband has received would, as submitted, have either been spent or subsumed in some way in his other assets which are now the subject of division and of which she will receive her share. Accordingly, I set aside the order that the husband account to the wife in respect of the rentals.",
        "Foreign assets": "The order below was that the wife was to have a 30% share in the three Malaysian properties and all the foreign bank accounts. In view of my decision on  equal division, this order shall be varied so that the wife is given a 50% share in the Malaysian properties and the foreign bank accounts. There shall be no change in the order that the husband is to keep the rentals collected from the Malaysian properties. There were questions raised in the appeal on what exactly the foreign assets should consist of and I will deal with these questions below.",
        "The Hong Kong bank accounts": "The court below ordered that the entire aggregate sum equivalent to S$1.853m withdrawn from the Hong Kong bank accounts by the wife in October 1994 should be notionally pooled back and made available for distribution. These moneys, in her view, clearly formed part of the matrimonial assets and it was immaterial whether the husband had agreed to their withdrawal. She also ordered that the principal sums garnished by the husband be squared off against his eventual share of the asset.On appeal, the wife wanted the above orders to be discharged and no orders to be made in respect of the Hong Kong bank accounts. Alternatively, she wanted the court to take into consideration various sums which the husband had withdrawn from the Hong Kong bank accounts prior to October 1994 and order that these be pooled back and made available for distribution as well.The basis of the wife`s contention that the sums she withdrew from Hong Kong should not be considered part of the matrimonial assets was that they were a gift to her from the husband and therefore not available for distribution. She contended that she was entitled to these moneys as of right and it would be wrong for the court to invoke its powers under s 112 and vary that right. This was not an argument that was put before the court below.The wife relied onLee Leh Hua v Yip Kok Leong[1999] 3 SLR 506at p 512 where it was held that in a case where the events before the divorce petition clearly established that one party was entitled to an asset as of right, the court ought not to allow the other party to ask the court to exercise its power under s 112 of the Charter and vary the vested interest of the first party. That holding was, however, made on the basis of a very different factual situation.InLee Leh Hua`s case, the husband had left the matrimonial home without the consent of the wife and without any apparent cause. The wife alleged that he had offered to sell the matrimonial home and give her the net sale proceeds as a form of compensation for dissolving the marriage. In November 1993 the husband granted the wife a power of attorney empowering her to sell the flat. On the day of completion in April 1994, the husband instructed the HDB to issue the cheque in the name of the wife only. By then the parties had already been living apart for several months. Two years later, the wife wrote to the husband asking for a divorce based on three years separation. The husband refused and the wife subsequently filed for and obtained a divorce on the ground of his desertion. The husband then made a claim to a share in the proceeds of sale of the flat and, at first instance, it was held he was entitled to 60%. On appeal by the wife, Justice GP Selvam held that she was entitled to the entire proceeds.The decision in theLee Leh Huacase was predicated on the finding of the court that the husband had intended to make the wife a gift of the net sale proceeds of the flat to expiate the emotional and mental devastation the wife had sustained by reason of his desertion. The court then went on to consider whether it should exercise the powers conferred on it by s 112(1) to vary the absolute right to the sale proceeds vested in the wife by reason of the husband`s gift. The wife had contended that the court should uphold the gift and not disturb it by exercising those powers. The court observed that in considering whether to invoke s 112(1) it had to bear in mind s 59(1) of the Charter which allowed spouses who had a dispute as to the title to or possession of property to apply by summons to the court for a summary disposition of the issue. That provision was a procedural one which did not give power to the court to vary or defeat the vested interests of parties. His Honour then went on to state that in a case where the events before the divorce petition clearly established that one party was entitled to an asset as of right the court ought not to allow the other party to ask it to exercise its s 112(1) powers. Selvam J concluded that in the case before him the court could not vary the vested interest of the wife by recourse to s 112.On the facts ofLee Leh Hua, the court clearly came to the right decision. The husband, having made the wife a gift as compensation for his causing the breakdown of the marriage, was wrong to ask the court to exercise its discretionary powers and thereby enable him to retract that gift. I do not think, however, that the learned Judge intended to hold, as the wife here submitted, that in all cases where one spouse vests property in the other by way of a gift, the court cannot vary the vested interest of the other spouse by invoking s 112(1) of the Charter. Such a holding would be difficult to support. Whether the court will decide to exercise those powers depends only on the particular circumstances before it and the court is not deprived of its powers under 112(1) by the fact of the asset being a gift between spouses even though this factor would be determinative of any summary application on title brought under s. 59.The court`s power to divide gifts between spouses has been established beyond a doubt by the Court of Appeal inYeo Gim Tong Michael v Tianzon[1996] 2 SLR 1. LP Thean JA who delivered the judgment of the court explained the basis of this power as follows (at pp 4 to 5):The land being a gift, the question is whether such a gift should be taken into account in the division of matrimonial assets under s 106. Though local decisions have dealt with division of assets including gifts, there has not been as yet any clear statement of principles on the matter. ... Where a gift is made, the donor normally has no intention to claim any interest or share in it and his intention is that the recipient should take the gift absolutely - that clearly must be his intention, at any rate, at the time of the gift. The position should be no different in the case of gifts between spouses.Whatever might be the intention of the spouses as regards a gift between them at the time the gift was made, upon their divorce the criteria for division of their assets including the gift under s 106 do not depend or take into account their intention, express or implied:Wang Shi Huah Karen v Wong King Cheung Kevin[1992] 2 SLR 1025at p 1030. In considering the issue of a gift in the division of matrimonial assets under s 106, the starting point is whether the subject matter of the gift is property originally acquired during the marriage through the sole effort of the donor or the joint efforts of the donor and his or her spouse, the recipient. If the property was so acquired during the  marriage, it falls within sub-s (1) or (3) (as the case may be) of s 106, and depending on the circumstances would be taken into account in the division of matrimonial assets, notwithstanding that it was a gift from one spouse to another. The spouse who made the gift would have no doubt expended moneys in acquiring it. The fact that the gift was contemporaneously or immediately thereafter or later transferred to the other spouse does not affect the original acquisition of that gift. Such a gift was nonetheless acquired by the donor and not the recipient, and if it was acquired during the marriage it would fall within the class of assets covered by s 106. ...The above observations are, in my view, equally relevant to s 112 where the court has to consider the extent to which a party contributed in money towards the original acquisition of any asset.Thus, even if the wife`s contention that the moneys withdrawn by her from the Hong Kong accounts constituted a gift to her from the husband were true, that would not necessarily prevent the court from dividing those moneys between her and the husband upon their divorce. There is no doubt in this case that the moneys were originally, at least, matrimonial assets since they were derived from the efforts of the husband during the marriage. The question is whether there is any reason why the court should not invoke its powers under s 112 to deal with these moneys.The wife`s contention was that the husband had asked her to take the moneys as a method of trying to appease her hurt and anger at his betrayal. She was not, however, consistent in her stand. At one stage she said that the husband had told her `the money in the Hong Kong accounts is yours. If you feel more secure, transfer the money to your own name`. That statement prompts the question how the husband could give the moneys to her if they were hers in the first place. She had also said that she took the moneys because she was alarmed by the husband`s previous expenditure and was afraid he would waste it. Another justification for the withdrawal was that she took the moneys because they were her share ie they were not a gift but her entitlement as a partner of Plymat.InLee Leh Hua`s case, there was no doubt that the husband intended to make the wife a gift. He took steps to make and complete the gift and did so before witnesses. There was also written corroborative evidence of the intention to make the gift in the form of the power of attorney which he gave the wife for the sale of the flat. The husband was present at, consented to, and witnessed, the transfer of the flat. In front of HDB officers, he instructed the HDB to issue a cheque for the proceeds in the wife`s name only instead of in their joint names as the HDB had originally intended to do. The husband was present and witnessed the issue of the cheque to, and its receipt by, the wife.The facts in this case do not establish such an unequivocal intention to make a gift of the type made inLee Leh Hua. It is the wife`s word alone that the husband told her to take the moneys. He took no contemporaneous action to give them to her. The wife herself took the trouble to go to Hong Kong and withdraw the moneys. The wife did concede she had not notified the husband before taking out the moneys though she asserted that when she informed him after the fact, he raised no objection. While the husband might not have objected verbally, what he did as soon as he found out about the withdrawals was to ensure that all further  payments would be made to another account in his sole name. He also removed the wife`s mandate to operate his other bank accounts. Further, when the husband took action in Hong Kong to recover the moneys, the wife did not defend it. Her explanation was that she had no money to mount a legal defence but this reason is unconvincing since she had all the funds withdrawn from the bank accounts.Whilst the truth or otherwise of the allegations and counter-allegations made by the parties in relation to the withdrawal of the funds from Hong Kong cannot be finally determined without cross-examination, there are enough facts before the court for it to decide whether these assets should be subject to division notwithstanding that they were or might have been a gift to the wife at the time of withdrawal. In this case, the circumstances do not persuade me that it would be wrong to use s 112 to vary any rights which the wife may have acquired to the withdrawn moneys. The position here is not at all similar toLee Leh Hua`s case where the equities of the situation were clearly against a retraction by the husband of his gift. In my judgment, the District Judge was correct in ordering that the moneys withdrawn by the wife should be notionally pooled back and made available for distribution.The wife`s alternative submission was that the husband`s withdrawals from the Hong Kong bank accounts over the years should also be notionally pooled back and made available for distribution. The lower court rejected this contention on the basis that the evidence suggested that the husband`s withdrawals had been made before the wife`s 1994 withdrawal, in the usual course of his transactions when the parties were still together. The District Judge took the view that these withdrawals were made to finance the husband`s investments or otherwise used or transferred in the ordinary course of things and therefore should not be pooled back. I entirely agree with her finding. The wife herself had admitted that some of these withdrawals had been used to acquire the assets which were to be divided between them and could not insist on a double accounting. What the court does is divide the assets existing at the time of divorce and assets that were existing at any time prior thereto are not divisible as such. They are only relevant to assist the court in determining whether there has been proper disclosure of the assets presently available for distribution.",
        "Maybank accounts 009693 and 50372330": "In his sixth affidavit, the husband disclosed that he held two accounts in a Malaysian branch of Malayan Banking Berhad jointly with one Wong Ching Hock. Account 009693 was a savings account which had a balance of RM349,837.58 as of 27 July 1999 whereas account 50372330 was a current account which had a nil balance. According to the husband, the joint account holder, Mr Wong, was his business partner and the moneys in the account belonged equally to both of them. The court below accepted this was so after seeing a bank slip confirming that the accounts were held in joint names. The District Judge therefore ordered that only half the amounts in these Maybank accounts be pooled for distribution.The wife appealed against this order. Her counsel submitted that the husband had made a bare allegation as to the joint ownership of the moneys in the accounts. He pointed out that from documents disclosed by the husband in his Hong Kong action, the husband had transferred a total sum of $558,227.50 to Mr Wong from the husband`s funds in Hong Kong. The wife did not know who Mr Wong was and how he was related to the husband or the reason why the husband had transmitted large sums of money to Mr Wong. Counsel submitted that it was likely that Mr Wong had been made a joint account holder for the convenience of the husband. Accordingly, the court should not infer that half the funds in the Maybank accounts belonged to Mr Wong.Counsel for the husband submitted that the wife was being untruthful in her denial of knowledge about Mr Wong. She submitted that the wife knew that Mr Wong was a business partner and there had been a long course of dealing with him. She also drew the court`s attention to a letter which the husband`s solicitors had written on his behalf on 26 November 1998 whereby the wife was informed that Mr Wong was a business partner and the accounts held with him were established for business purposes and the moneys belonged to the account holders in equal shares. Counsel submitted that the wife had never refuted this allegation. Further, as regards the transfers to Mr Wong`s account, these had been made in 1993 before the marriage broke down and the wife was aware that various sums were being withdrawn from the Hong Kong bank accounts. Indeed, she had quarrelled with the husband on this as she was afraid he was squandering the money.The husband did not expressly say in any of his affidavits that the wife knew about his business relationship with Mr Wong. As far as I can tell from the documents, the question of his relationship with Mr Wong was first raised by the wife`s solicitors after the husband`s disclosure of the Maybank joint accounts. They wanted to know exactly who Mr Wong was and the only answer they were given was per the husband`s solicitors` letter of 26 November 1998. The husband did not produce any further proof of his relationship with Mr Wong or go into detail on what business dealings he and Mr Wong had conducted together and on what terms. Nor was any evidence adduced to show that any part of the moneys in the joint savings account had come from these business dealings or emanated from Mr Wong`s own sources. All that the documents showed was that the husband had previously made large remittances to Mr Wong.In view of the paltry documentation and scanty facts furnished by the husband, I do not consider that he had substantiated his assertion that the moneys in the Maybank accounts belonged to him and Mr Wong in equal shares. Accordingly, I vary the order made below and order that the total amount in the joint Maybank savings account held with Mr Wong be pooled for distribution.",
        "Refund from the Binabaik property": "In 1998, when the marriage broke down for good, the husband was in the course of purchasing a fourth property in Malaysia (which he called the Binabaik property) in the joint names of the wife and himself. He then terminated the  purchase and agreed that the net proceeds returnable to him by the vendor should be divided equally between the wife and himself. He stated that he agreed to the equal division as to otherwise he would have to commence proceedings and obtain a declaration as to the beneficial ownership of the property. Thus in June 1998 each of the parties received RM42,406.03. The husband was not satisfied with this as he was the only person who contributed towards payment of the price of the Binabaik property and he also made a loss on termination. He asked for the proceeds to be notionally pooled back and redistributed in accordance with the general division.The court below did not accede to the husband`s request. The District Judge made no order for the redistribution of the proceeds from the termination of the Binabaik purchase. Her reason for not doing so appears that these proceeds had been shared equally by agreement. The husband appealed against this decision. In the light of my own holding that the matrimonial asset should be divided equally, there is no reason now to make any specific order in relation to those proceeds since they have already been divided equally between the parties.",
        "Adverse inference": "The District Judge drew an adverse inference against the husband for his failure to make full and frank disclosure of his bank accounts and Malaysian properties. Her reasons were that the documents he relied on to show his bank balances were hand-written and there was scant disclosure on the transaction history of the accounts. Further his mistress and two other children were living in Johor and he had lived with them since July 1998. Since the husband owned property in Johor which he was renting out, the District Judge considered it unlikely that he and his second family were occupying rented property. The total absence of any joint account with his mistress or any Malaysian property in which he then lived from his disclosed assets suggested to her that there was selective disclosure on his part. The husband has appealed against this finding.With respect, an analysis of the evidence does not support the reasons given for the drawing of an adverse inference. First, the husband did not rely upon his hand-written statements for his bank balances but upon official verifications of these amounts. His assets were first disclosed in the affidavit that he filed pursuant to the mareva order which the wife obtained against him. Subsequently he made further disclosure in his second, third and fourth affidavits. Exhibited with the last two affidavits were, in respect of each account, official verifications from the banks concerned which were either signed by or stamped with the bank`s rubber stamp or supported by a copy of the printed statement from the bank. The husband complied with all aspects of the mareva order except insofar as he applied for a variation of the same.As regards the complaint of scant disclosure of transaction records, neither party was obliged to give additional disclosure of transaction records. It was not required by the Mareva order and the parties were subsequently only required to file affidavits of the assets which they possessed. The wife could have but never did apply for more discovery. Further, transaction records of money spent in the  normal course of the marriage and business and which do not form part of the matrimonial assets are not filed as a matter of course in matrimonial proceedings.The third reason relating to the support of the Johor family was a speculative one. First, the husband did disclose evidence confirming that the joint account which he had had with the mistress had been closed in 1993. Bearing in mind what the wife did in 1994 with moneys that were placed in joint names it would not be unreasonable to infer that the husband would be reluctant thereafter to place himself in a similarly vulnerable position vis--vis his mistress. There is no reason why one should infer that it is more probable than not that he still maintains a joint account with the mistress. Nor is there any reason for inferring that it is probable that the second family is living in a home owned by the husband.In this connection one must also bear in mind that the husband did show himself to be reasonably open with the court in the matter of his assets. He did disclose the very substantial sum of over three-quarter of a million dollars which he earned and put into another Hong Kong account between 1994 and 1997. The wife did not know about this new Hong Kong account and would have found difficulty in forcing a disclosure had it not been made voluntarily. The husband also disclosed very substantial Malaysian accounts.Finally, with regard to the drawing of adverse inferences, it should be noted that the husband had been facing the prospect of divorce since 1993. Yet the wife continued to work in his office until 1996 and to be privy to his financial affairs. Her affidavits and divorce petition make clear the detailed knowledge that she had of the these matters. He was not hiding anything from her at that stage. The relationship became even more acrimonious after 1996 and yet the husband disclosed substantial moneys in his numerous bank accounts including the accumulation of the three-quarter of a million dollars already mentioned. I therefore allow the husband`s appeal in this respect and set aside the finding that he did not make full and frank disclosure of his assets.",
        "The wife`s assets": "I have stated in [para ] 46 above that there must be an equal division of the wife`s assets (excluding her CPF moneys) between the parties. The husband has contributed to those assets and part of his appeal is for a share in them. This order applies to the credit balances in the disclosed bank accounts. The question is whether the wife has any other assets to which the order should apply other than those bank accounts.There is first the sum of $75,000 which the wife received when the bond which the husband had provided in respect of the son`s national service was released. The lower court allowed the wife to keep these moneys. Whilst that order might have been justifiable when the wife was being given a minority share in the matrimonial assets, it can no longer stand in view of the decision on division that I have made. Accordingly, this sum shall be divided equally between the parties.The second issue here is whether the wife has undisclosed assets which should also be divided between the parties. The trial judge noted that the wife had not made disclosure of substantial sums of money being basically the balance of  the sums withdrawn from Hong Kong (approximately S$1.2m), the $75,000 bond money, and the proceeds of Astor Green and Binabaik. She rejected the submission that an account should be taken at least of interest on the Hong Kong moneys on the ground that this amount would be de minimis. If, however, these moneys had earned simple interest at the rate of 3% per annum (which is what they were earning in Hong Kong) then taking the principal sum as being S$1.2m, the interest earned from October 1994 to October 1999 would have been $180,000 ($36,000 per year for five years). This is certainly not a small sum.I think an adverse inference has to be drawn against the wife in this respect. She made no effort to account for what she had done with the funds in her hands. It is reasonable to assume that she invested them in some way and may very well have earned a profit in excess of the $180,000 I have mentioned. In these circumstances, I think it fair to assess the wife`s undisclosed assets as amounting to S$180,000 and to order that those assets be divided equally between the parties. I so order.",
        "CLOB shares": "The court below excluded the CLOB shares owned by the husband from the division orders made and allowed the husband to keep all these shares. No indication had been given to the court of the last done value of the shares and, in the court`s view, no valuation would be practicable as it was speculative in view of the trading impasse. The question of when or if trading in the shares would resume was, at best a guess. In the view of the District Judge, it would be in the interests of the parties to realise their respective shares in their matrimonial assets as ordered by the court and to square off their positions as soon as possible to achieve a clean break.The wife appealed against this order. She submitted that it was not true that the CLOB shares were of no value. It was a matter of timing and the fairest order would be to divide the shares in specie between the parties. The wife was prepared to take the shares in kind and if transfer to her was not possible, for the husband to be ordered to hold a proportion of the shares in trust for her and to deal with them as she may direct. As events occurring after the judgment below have shown, the wife`s analysis is correct. The CLOB shares held by Singaporeans do still have some value and those owners who decide to take up the offer made for their shares can expect to receive their proceeds of sale in the not too distant future. In view of the developments, I consider it fair that the order for division of matrimonial assets be applied to the CLOB shares as well. I therefore order that the husband pay the wife half the proceeds of sale of the CLOB shares. If the husband has not already accepted the offer for sale, he should sell at least half his CLOB shares and channel the net proceeds of the same to the wife as and when he receives them. It would not be correct to order him to pay her for them now as the sale proceeds will not come in immediately and there is no reason why her position in respect of these shares should be better than his.",
        "Maintenance": "The District Judge awarded the wife a lump sum maintenance based on $1,800 per month for eight years. The wife wants this increased to $3,000 per  month or such lump sum as the court deems appropriate. No submission was made as to how the lump sum should be calculated.In her sixth affidavit, the wife estimated her monthly expenses as amounting to $2,665. She also stated that she spent a further $1,000 a year during Chinese New Year and $500 at Christmas. In addition, she estimated the household expenses as amounting to $2,378.30 per month. Her submission was that her expenses were not far-fetched and represented basic needs. Counsel asked the court to take into account the husband`s high income, earning capacity and financial resources, the wife`s inability to earn a high income herself in the light of her age, health and lack of education and the standard of living enjoyed by the family before the break down of the family.The District Judge carefully considered the facts. She noted that when the parties lived as a family, the wife was given $4,000 a month for the family`s expenses and also earned a salary of more than $2,000 a month. In February 1997, the parties agreed through solicitors on $3,000 a month as maintenance for the wife and the youngest child. This maintenance stopped after the parties could not settle their differences on the return of the Hong Kong funds.The District Judge considered most of the items on the wife`s list of personal and household expenses to be inflated. She noted that none of these had been supported by receipts. She also rejected the claim that the wife had a serious medical condition requiring regular medical attention. She found it significant that $4,000 a month had been sufficient when the whole family had lived together. Since then there had been two significant changes: the husband had moved out and the eldest child had completed her education and found a reasonable job.Having considered the items of expenditure, the wife`s assets and the husband`s ability to pay maintenance and other relevant factors, the District Judge concluded that $1,800 per month was a fair maintenance payment for the wife. I agree. The wife has assets of her own and cannot expect a full subsidy for her lifestyle from the husband.Where I diverge slightly from the court below is in relation to the number of years of maintenance that should be taken into account to arrive at the lump sum payable. The wife was given eight years maintenance as a lump sum on the basis that the husband was 52 at the time of the hearing and that having regard to the demands of his business using 60 years as his retirement age from active business and the upper limit of a lump sum award was appropriate. The District Judge rejected the wife`s argument that the multiplier should reflect her expected life span. In the court`s view, the husband should not be made to maintain wife at the same level past his retirement when he would suffer a substantial drop in his income.In my judgment, it is highly speculative to put the husband`s retirement age at 60 when he is working for himself and can carry on for as long as his health permits and his financial needs require. He has a young family by his mistress and the chances are that if he can he will work beyond the age of 60 for at least four or five years, if not considerably more. Further, the husband if he were paying monthly maintenance could not expect to be relieved entirely from this obligation by reason of retirement. In the normal case of an order for the periodic payment of maintenance, the husband is able to go back to the court and ask for a variation  of the order if his financial circumstances change for any reason including retirement. At that stage, the court will assess the parties` needs and assets and adjust the maintenance order so as to be fair to both parties. In some cases, it is possible that the maintenance order will be discharged entirely but this is not the most probable outcome of such a variation application. In any event, prima facie, the husband`s obligation to maintain the wife would continue beyond his retirement and up to her remarriage or the death of either party.InOng Chen Leng v Tan Sau Poo[1993] 3 SLR 137, the Court of Appeal had to consider what would be the appropriate lump sum maintenance award for a wife aged 50. The court below had found that $400 a month was the appropriate maintenance rate. As the Court of Appeal observed, the trial judge had awarded a lump sum of $81,600 by quantifying `the $400 on a straight line basis over a period of 17 years as a compromise between the average life expectancy of a woman (70 years) and the usual retirement age (65) of a Singapore male worker less the wife`s present age which was 50` (per Karthigesu J at p 146). The Court of Appeal accepted this method of quantification as being proper in the circumstances of the case.The wife in this case was aged 51 at the time of the hearing. She should have the normal life expectancy of a Singapore woman as she enjoys reasonable health. If I were to apply the quantification adopted inOng Chen Leng`s case, I would take a multiplier of 16 years on the same reasoning as used there. In this case, however, the monthly quantum of maintenance awarded is considerably higher than that at issue in Ong`s case and I am sensible of the point made by the District Judge that the wife cannot expect to be maintained at the same standard after the husband retires. Also although the husband is unlikely to retire at 60, the demanding nature of the husband`s job might cause him to reduce his consultancy business after that age. In the circumstances, I consider that the fairer way of dealing with the problem would be to award the wife a lump sum based on full maintenance for eight years (ie up to the husband reaching the age of 60) and on half maintenance for a further eight years. Accordingly, I allow the wife`s appeal in relation to maintenance and vary the lump sum awarded to $259,200. The husband shall have the option of either paying the whole sum immediately or of paying it in two equal instalments, one to be paid now and the other to be paid in two years` time.As to the wife`s appeal on the quantum of maintenance for the son and younger daughter, she has not put forward any good basis for upsetting the very careful decision of the lower court on this matter. I therefore dismiss the appeal on this ground.",
        "Costs": "The wife submitted that costs of the ancillary proceedings should be taxed and paid by the husband to her. No argument was presented in support of this submission. The District Judge noted that parties did not address her on the issue of costs at the end of hearing or when judgment was given. When they appeared before her again for clarification of the orders, the wife`s counsel asked for costs and the husband`s counsel indicated that she was not ready to argue on costs as  she did not have all her papers before her. The District Judge informed the parties that they were at liberty to apply to her on costs if they were unable to resolve this issue between themselves. The parties do not appear to have taken up that invitation. As the District Judge has not had an opportunity to consider what order for costs should be made since proper submissions have not been put before her and since the submissions before me are too brief to be of assistance, I cannot make any order in relation to the costs below.As far as the costs of the appeal are concerned, both parties have partially succeeded and partially failed. Looking at the balance of the appeal, however, I consider the wife to be the successful party since she has obtained an increase in her share of the matrimonial assets. She has, however, failed on several points including her attempt to keep her assets and the Hong Kong moneys for herself. Accordingly, I award the wife half her costs of the appeal to be taxed if not agreed.Finally, I give the parties liberty to apply for any consequential orders that are needed to implement the holdings in this judgment.Outcome:Order accordingly.Copyright  Government of Singapore."
    }
}