{
    "case_title": "Hing Yip Containers Pte Ltd v Union Containers Private Limited",
    "ncitation": "[2000] SGHC 106",
    "coram": "Lee Seiu Kin JC",
    "sections": {
        "The Invoiced Sum": "13. The defendants do not deny that, in respect of the Invoiced Sum,\n\nmaterials were supplied, the work was done and the services were rendered. Hugo Choi had\n\nin effect deposed that they had consciously made the decision to continue to sub-contract\n\nwork to the plaintiffs after Choi Kwai Shing had been removed as director. They did so\n\nnotwithstanding their knowledge of all the alleged abuse by Choi Kwai Shing as director.\n\nThe fact that they had no choice because of commercial pressure does not absolve them of\n\ntheir contractual obligation. The rates charged were the same rates that had been charged\n\nall along, which the defendants had not protested about at the time of the invoices.\n\nHaving given orders for these works to be carried out, and having obtained the benefit of\n\nthe plaintiffs' efforts, I cannot see how the defendants can now say that they are not\n\nliable to pay the Invoiced Sum. As there is no conceivable defence, I dismissed the\n\ndefendants' appeal against judgment in respect of this part of the claim.The DN Sum14. I turn now to the DN Sum which totals $144,200. The defendants say\n\nthat the debit notes were issued under rather spurious circumstances. They also say that\n\nthere is duplicity in the debit notes. Hugo Choi pointed out that the 3 debit notes in\n\nquestion state that each is for \"service charge, storage & supply of ink for\n\nprinting of cartons\". He said that some of the invoices also provide for printing. I\n\nfind that this ground raises a triable issue as to whether there is duplicity in the\n\ncharges given the relationship between the parties. However I am of the view that the\n\ndefence is shadowy for the following reasons:(a) There was a long-standing arrangement in relation to the charges\n\n  the subject of the debit notes.(b) Hugo Choi, who made allegations against the plaintiffs, was part of\n\n  the management team of the defendants when Choi Kwai Shing held control.(c) The defendants had initially relied principally on the affidavit\n\n  Ho, who had no direct knowledge of the matters. Hugo Choi filed an affidavit only after\n\n  the plaintiffs had obtained judgment in the court below.15. I therefore considered that the appropriate order to make in\n\nrespect of the DN Sum was to give conditional leave to defend. As the defendants had\n\nalready paid to the plaintiffs the total amount of the judgment given in the court below,\n\nI ordered the plaintiffs to refund $144,200 to the defendants upon their providing a\n\nbanker's guarantee or some other satisfactory security for that amount.LEE SEIU KINJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}