{
    "case_title": "Premier Properties Pte Ltd v Tan Soo Tiong and Others",
    "ncitation": "[2000] SGHC 12",
    "coram": "Lee Seiu Kin JC",
    "sections": {
        "Whether Plaintiffs repudiated the Agreement": "11. The main issue that I have to determine is whether in the\n\ncircumstances, the Plaintiffs have repudiated the Agreement thereby entitling the\n\nDefendants to terminate it. Counsel for the Defendants submitted that notwithstanding that\n\nthere is provision in the Agreement for payment of L.D. for delay, it cannot apply to a\n\nsituation where such delay is inordinately long. As a proposition, I think this argument\n\nis impeccable. Notwithstanding that there is no express provision for it, the parties\n\ncould not have agreed that the Plaintiffs is entitled to delay completion of the\n\ndevelopment for as long as they wished. Conversely I do not see anything in the Agreement\n\nthat grants the Defendants the right to treat the slightest delay as a repudiation\n\nentitling them to terminate it. Indeed the existence of clause 5.4, the L.D. provision,\n\nindicates clearly that the parties envisaged that there could be some delay on the part of\n\nthe Plaintiffs and that clause sets out the remedy available to the Defendants. Therefore\n\nthe question is whether in the circumstances, the actions of the Plaintiffs, or lack of\n\nit, may be treated by the Defendants as a repudiatory breach. This is not always an easy\n\nquestion to answer. As Devlin, J said inUniversal Cargo Carriers Corporation v Citati[1957] 2 QB 401 at p.406, which concerned a delay on the part of the charterer of a ship\n\nto nominate a berth and provide cargo:\"This case gives rise to a difficult question. How long is a ship\n\n  obliged to remain on demurrage, and what are the rights of the owner if the charterer\n\n  detains her too long? Translated into the terms of general contract law, the question is:\n\n  Where time is not of the essence of the contract - in other words, when delay is only a\n\n  breach of warranty - how long must the delay last before the aggrieved party is entitled\n\n  to throw up the contract? The theoretical answer is not in doubt. The aggrieved party is\n\n  relieved from his obligations when the delay becomes so long as to go to the root of the\n\n  contract and amount to a repudiation of it. The difficulty lies in the application, for it\n\n  is hard to say where fact ends and law begins. The best solution will be found, I think,\n\n  by a judge who does not try to draw too many nice distinctions between fact and law, but\n\n  who, having some familiarity both with the legal principle and with commercial matters and\n\n  the extent to which delay affects maritime business, exercises them both in a common-sense\n\n  way.\"12. It is necessary therefore to examine all the circumstances\n\nsurrounding the Agreement in order to arrive at the determination of this issue. In a\n\nsubsequent affidavit filed on the Plaintiffs' behalf on 18 August 1999, they responded to\n\nthe Defendants' allegations. The Plaintiffs pointed out that the development was to be\n\ncarried out in two phases. The Defendants' New Flats were in the first phase. Accordingly,\n\nof the approvals covered under clause 10.2 (a) to (d), the Plaintiffs had obtained item\n\n(a) in time in respect of Phase I. Approvals in respect of items (b), (c) and (d) were\n\nobtained between 6 February and 13 March 1998, which is between 2 and 7 weeks later than\n\nthe 14-month period. The contractors for the project had stated that they would take 87\n\nweeks to complete the project, viz. From 1 June 1999 to 30 June 2001. However this covered\n\nboth Phases. The contractors were obliged to complete Phase I within 61 weeks, i.e. by\n\nlate July 2000. The building contract had been awarded to the contractor in May 1999 on\n\nthis basis and construction was underway. Accordingly the Plaintiffs advised the first\n\nDefendant by letter of 5 May 1999 that the delay would be about one year. The Plaintiffs\n\nsay that the Defendants cannot rely on the expected T.O.P. date stated in the brochure\n\nused by them to market the development because such dates were usually conservatively\n\nstated.13. The first argument of the Defendants is that the completion date in\n\nthe Agreement refers to that of all phases and not just Phase I. This turns on a minute\n\nexamination of clause 5.1 which I do not propose to discuss in any detail. While there is\n\nsome ambiguity in the manner in which that provision is drafted, it is clear that the\n\nAgreement entitles the Plaintiffs to purchase additional surrounding land so as to\n\nincrease the size of the development in order to enhance its value. And this would benefit\n\nthe Defendants. It cannot be that the Plaintiffs would have bound themselves to the time\n\nlimits set for land the subject of the Agreement in respect of land to be acquired in the\n\nfuture. To so bind them would also deter them from acquiring land if the opportunity did\n\nnot come early enough and this would be to the detriment of the Defendants as well.\n\nAccordingly I see nothing in the Agreement preventing the Plaintiffs from acquiring more\n\nland at a later stage and completing the buildings on such land in a second phase of the\n\nproject.14. The Defendants say that even in relation to Phase I, the estimates\n\ngiven for its completion was overly optimistic as it would be impossible to complete even\n\nPhase I of the development. However the Defendants did not produce any expert evidence on\n\nthis. On the other hand, the Plaintiffs have produced evidence that the building contract\n\nwas awarded on this basis as well as the architects' letters in this regard. On my part I\n\nam unable to say that this estimate of the time required is clearly wrong. I therefore\n\nhave to accept the Plaintiffs' evidence that the period is realistic.15. In my view, the circumstances of this case do not justify the\n\nDefendants treating the Plaintiffs as having repudiated the contract. The factors that led\n\nme to this conclusion are as follows:(i) Clause 5.4 of the Agreement makes provision for delay in delivery\n\n  of the New Flats. The Plaintiffs would be obliged to pay each Defendant L.D. at the rate\n\n  of 10% per annum of the sum of $2.805 million. It is silent as to the extent of such\n\n  delay.(ii) The Cash Vendors received payment of $2.4 million each in November\n\n  1996. That would reflect the valuation of the parties of each of the old apartments. The\n\n  rate of L.D. is prescribed at 10% on the sum of $2.805 million. Therefore $2.805 million\n\n  would appear to be the parties' estimation, at the time of the Agreement in March 1996, of\n\n  the value that each of the New Flats would attain in August 1999. This would amount to an\n\n  annual appreciation of slightly under 6%, which appears to correspond roughly with the\n\n  housing loan rates prevailing at the time. The 10% L.D. rate is substantially higher than\n\n  a 6% appreciation rate. There is therefore an additional 4% built into it to compensate\n\n  for delay beyond the Handing Over Date.(iii) The L.D. rate of 10% is sufficiently high as to give the\n\n  Plaintiffs no incentive to unnecessarily delay the completion of the development.(iv) The L.D. amounts to a sum of $280,500 per year or $23,375 per\n\n  month. Such a sum would more than pay for the most luxurious of equivalent accommodation\n\n  for the Defendants, even if one used the rental rates prevailing in March 1996. Indeed it\n\n  would leave a tidy sum for any relocation costs.(v) In the context of the 33 months given to the Plaintiffs to complete\n\n  the New Flats, 12 months does not appear an unreasonably long period of delay given the\n\n  10% L.D. rate.(vi) The L.D. rate is expressed as 10%per annum. It could just\n\n  as easily be expressed as 8.33% per month, or 0.2% per week, or 0.274% per day. Although\n\n  not significant by itself, it is one possible manifestation of the contemplation by the\n\n  parties that a delay can extend into a year or more.(vii) Another factor is the regional economic crises in 1997 and 1998.\n\n  The uncertainty it engendered had an impact on the progress of the development. While it\n\n  does not excuse the Plaintiffs from an inordinately long delay, in my view it would be\n\n  unreasonable to say that the provision for L.D. does not cover a certain amount of delay\n\n  caused by such an eventuality.16. Accordingly, taking into account all the above considerations, I\n\nheld that the delay of the magnitude that obtains in this case does not amount to a\n\nrepudiation by the Plaintiffs. I should add that the Plaintiffs had cited the case ofA.G.\n\nv Wong Wai Cheng[1978-1979] SLR 151but I do not find it useful because it\n\nessentially dealt with a provision in the contract there that specifically provided that\n\nany delay, even if it materially impeded or delayed execution or completion, shall not\n\nvitiate the contract, and it shall only entitle the contractor to compensation from the\n\nemployer. There is no such specific provision in the present case and everything must turn\n\non its own set of facts.17. The Defendants also argue that the length of the delay amounts to\n\nfrustration of the Agreement. They citePioneer Shipping Ltd v B.T.P. Tioxide Ltd (The\n\nNema)[1982] AC 724 at p.752, which said that the test was:\"… whether the delay … will make any ultimate\n\n  performance of the relevant contractual obligations 'radically different' … from that\n\n  which was undertaken by the contract … \"The Defendants also citeChitty on Contracts(27thEd) at p.1113 which states:\"To frustrate a contract, the delay must be abnormal, in its\n\n  cause, its effects, or its expected duration, so that it falls outside what the parties\n\n  could reasonably contemplate at the time of contracting. The fact that the delay was\n\n  caused by 'a new and unforeseeable factor or event' is a relevant matter. The probable\n\n  length of delay must be assessed in relation to the nature of the contract, and to the\n\n  expected duration of the contract after the delay is expected to end. There can be no\n\n  frustration if the delay in question was within the commercial risks undertaken by the\n\n  parties.\"18. I have no difficulty accepting authorities cited by the Defendants.\n\nWhat they require is an examination of whether the delay in question so alters the nature\n\nof the bargain as to make it radically different from the original contract. The factors\n\nthat I have to examine are exactly the same in my analysis as to whether the delay would\n\namount to a repudiatory breach. Furthermore the learned editors ofChitty on Contractsfind that \"a new and unforeseeable factor or event\" is a relevant consideration.\n\nIn this case, one of the causes of the delay was the regional economic crises. Therefore,\n\nfor the same reasons I have given above, I do not think that the delay of 12 months in the\n\ncircumstances of the case has so altered the nature of the bargain as to frustrate the\n\ncontract. While the term \"frustration\" may aptly describe the emotions of those\n\nof the Defendants who had hoped to move into the New Flats in time to greet the new\n\nmillennium, in my view, as a contractual doctrine it does not arise in this case.",
        "Condition precedent of guarantee not met": "19. The Plaintiffs also have another basis for their claims. They say\n\nthat the demands made by the Defendants were invalid because the terms of the guarantees\n\nwere not complied with. Term 1 of the guarantee provides as follows:\"If the Purchaser … fails to deliver vacant possession of the\n\n  New Flat … in accordance with Clause 5.4 of the Agreement … the Guarantor will\n\n  indemnify the Exchange Vendor … against all losses, damages, costs and expenses that\n\n  may be incurred by him by reason of any default on the part of the Purchaser in performing\n\n  and observing the provision of Clauses 5.4 and/or Clause 5.5 aforesaid and/or any other\n\n  provisions of Clause 5 of the Agreement provided that the aggregate maximum liability\n\n  … [is $2.805 million].\"Now the contract between the bank and each of the Defendants under the\n\nguarantee is separate from that between the Plaintiffs and the Defendants. It is a\n\ncondition precedent under term 1 of the guarantee that the Plaintiffs shall have failed to\n\ndeliver vacant possession of the New Flat by 28 August 1999, the Handing Over Date. The\n\ndemands were made on 12 May 1999, i.e. more than 3 months before that date. Therefore the\n\ncondition precedent for the demand, i.e. the failure to deliver vacant possession of the\n\nNew Flats by 28 August 1999, was not met. Therefore, the Plaintiffs submit, the call was\n\ninvalid.20. I agree with this submission of the Plaintiffs. The guarantee is a\n\ncontract between the bank and each of the Defendants which is separate from the Agreement.\n\nIt entitles the beneficiary to make a demand only if the conditions stated in it are met.\n\nClause 7.2 of the Agreement affords the Defendants an opportunity to negotiate the terms\n\nof the guarantee. They had agreed to accept the guarantee in the present form. The\n\ncondition that there must be a failure to deliver the New Flat by the Handing Over date\n\nwas clearly not met at the time of the demand. Even if the Plaintiffs had committed an\n\nanticipatory breach which entitled the Defendants to rescind the Agreement, as regards the\n\nbank the only basis for the demand can only be the conditions under the guarantee.\n\nTherefore the demands of 12 May 1999 are not valid and the bank is not obliged under the\n\nguarantee to make payments pursuant to them.",
        "The counterclaim": "21. The Defendants prayed for the following declarations in their\n\ncounterclaim:(1) Whether the Plaintiffs have committed a breach of the Agreement if:(a) they were unable to deliver vacant possession of the New Flats by\n\n    28 August 1999;(b) they had indicated to the Defendants subsequent to the Agreement\n\n    that they were only able to do so:(i) 12 months after the Handing Over Date;(ii) 28 months after the Handing Over Date; or(iii) any time between 12 and 28 months after the Handing Over Date.(2) If the Plaintiffs had committed a breach in any of the instances in\n\n  (1), whether such breach constitutes:(a) a total or substantial failure of consideration under the\n\n    Agreement; and/or(b) a repudiatory breach of the Agreement which entitles the Defendants\n\n    to terminate the Agreement.(3) If the answer to (2) is \"yes\", whether the call by each\n\n  of the Defendants on 12 May 1999 on the guarantees were proper.(4) If the answer to (2) is \"no\", what is the date on which\n\n  the Defendants are entitled to terminate the Agreement.(5) If the answer to (3) is \"yes\", or if a date in question\n\n  (4) is specified whether the amount that the Plaintiffs are liable to pay each of the\n\n  Defendants by reason of the Plaintiffs' breach of the Agreement is:(a) $2,805 million; or(b) $2.4 million plus interest accruing on such sum at the rate of 6%\n\n    per annum for such period as the Court deems fit; or(c) such other sum to be assessed by the Court.22. On the basis of my findings, it follows that the answer to question\n\n(1)(a) is \"yes\". However I find questions (2) and (4) to be speculative and\n\ninappropriate for me to make a declaration on. They essentially require me to determine at\n\nwhat stage of delay beyond the 12 months will the Plaintiffs be deemed to have repudiated\n\nthe Agreement such as would entitle the Defendants to terminate it. However whether any\n\nsituation gives rise to this position depends on the entirety of the facts and not simply\n\non the period of delay. The court will not in general make a declaration based on assumed\n\nfacts and I see no reason to do so in this case. Question (3) has been answered in the\n\nnegative. As for issue of the nature of damages in question (5), since the answer to\n\nquestion (3) is \"no\" and I have declined to give an answer to question (4), I am\n\nnot required to answer that question. Accordingly I answered question 1(a) in the positive\n\nand declined to answer the remaining questions posed. However I was prepared to hold that\n\nthe L.D. payable under clause 5.4 of the Agreement was payable monthly. This is a term\n\nthat can be implied from the Agreement. The L.D. is there to compensate the Defendants for\n\nlate delivery of the New Flats. As they may have to rent alternative accommodation or\n\nforgo rent that may be earned from their current residence, the L.D. provision ought to be\n\npayable monthly in arrears in order to achieve this result in a practicable manner.LEE SEIU KINJUDICIAL COMMISSIONERSUPREME COURTCopyright © Government of Singapore."
    }
}