{
    "case_title": "The Law Society of Singapore v Disciplinary Committee",
    "ncitation": "[2000] SGHC 169",
    "coram": "Lim Teong Qwee JC",
    "sections": {
        "The scheme was set up by an unauthorised person (ie Winfast) for the express purpose of offering and placing at the disposal of strangers the services of the solicitors concerned (in contravention of s 33(3)).": "The scheme is a clear attempt to circumvent s 79.Mr Low in his written submissions said that the Disciplinary Committee failed to recognise that the conduct of the solicitors concerned was `professionally improper and unbefitting a solicitor`. He gave eight reasons and I have retained the numbering system in setting them out for consideration.(1)(7)Section 33(3) provides:Any unauthorised person who offers or agrees to place at the disposal of any other person the services of an advocate and solicitor shall be guilty of an offence.Mr Elias objected that this was not in any of the charges now before me. It was not any part of the information referred to the Inquiry Committee or to the Disciplinary Committee.Mr Low said that he was only relying on s 33(3) to answer the defence raised. He said he was not relying on any evidence or any facts in relation to s 33. I think what this means is that he is not saying in his written submissions that there has been any contravention of r 5(c) of the Rules or of para 2.3 of the Practice Directions by the solicitors concerned by reason that there has been any contravention of s 33(3) by Winfast. I think the objection would have been well taken but on the basis of Mr Low`s explanation I made no order.Section 79 (as it was in 1996) provides:(1) Where a solicitor acts for a housing developer in a sale of immovable property developed under a housing development, neither he nor a member nor an assistant of the firm of which he is a member either as partner or employee shall, in the sale of any immovable property developed under the same housing development, act for the purchaser of the property unless a certificate of fitness for occupation in respect thereof has been issued by the Chief Building Surveyor or other relevant authority.(4) Disciplinary proceedings may be taken against a solicitor who acts in contravention of subsection (1).Mr Elias also objected that this was not in any of the charges and Mr Low said he was not proceeding with this ground. In any event there was no evidence of any attempt to circumvent s 79. In view of what Mr Low said I made no order on the objection which I would otherwise have upheld.",
        "The solicitors concerned `agreed to, and participated in, the scheme`": "In all the charges the expression used was `agreed to and did participate in a scheme`. Before the Disciplinary Committee it was understood to mean that the solicitors concerned agreed to participate in and did participate in the scheme and not that they agreed to the scheme which may be the meaning suggested by the way Mr Low has stated it in his written submissions. However he has not attempted to urge upon me to find that the solicitors concerned did agree to the scheme. The Law Society`s case before me as it was before the Disciplinary Committee is that theyagreed to participatein the scheme and that they did participate in it.I think it is necessary to be clear about what is meant by the `scheme`. Paragraphs 3 and 4 of the statement of the case state:3 .... Winfast invited two firms of advocates and solicitors, namely, M/s Wilfred Yeo Quahe & Tan (`WYQT`) and M/s Lee & Lee (`L&L`), to be on a panel of solicitors together with another firm, M/s Yeo Leong & Peh (`YLP`) ...4 The purpose of empanelling these three firms was to enhance Winfast`sscheme of offering free conveyancing, stamp duty and other disbursements to purchasers of the units in the development only if they used any of these firms as their solicitors in the transaction.The `scheme` is that described in the italicised passage in para 4. If a buyer retains one of these firms and only if he does so he will receive free conveyancing services and he will not have to pay any stamp duty or other disbursements. The ordinary meaning is that if he retains some other firm he will not receive free  conveyancing services and he will have to pay stamp duty and other disbursements. This is the scheme referred to in the charges which are set out in para 9 of the statement of the case.The Disciplinary Committee made these findings of fact:10 [Ms Len] telephoned to and invited the [solicitors concerned] to sit on Winfast`s panel of solicitors.11 The [solicitors concerned] in accepting the invitation to sit on the panel, cautioned [her] that ...The `panel` was a panel of solicitors established by Winfast as referred to in para 4 of the statement of the case. I think it is clear that the Disciplinary Committee found as a fact that the solicitors concerned agreed to be on Winfast`s panel of solicitors and that they did `sit` on the panel.The Disciplinary Committee also made these findings of fact:1 The residential property market was `very, very slow` in the second half of 1996 after the curbs were implemented on property speculation on 15 May 1996.2 Winfast, the developers and vendors of the project first launched it in Hong Kong.3 At the launch in Hong Kong, Winfast agreed to pay the buyers` legal fees, stamp duty and disbursements if they used the law firm of Yeo Leong & Peh (`YLP`).5 When the project was launched in Singapore in August/September 1996, Winfast decided to extend the offer of paying legal fees, stamp duty and disbursements to purchasers of units in the project in order to attract business to the project.6 The purpose of the scheme was to make the purchase of units in the project more attractive to purchasers than projects of other developers ...9 The [solicitors concerned] had not been consulted by, nor had they advised Winfast on the devise of the scheme.In Ms Quahe`s case the Disciplinary Committee also found:Respondent Quahe was informed by [Ms Len] that Winfast would pay legal fees, stamp duty and disbursements if purchasers used the panel solicitors. She was not told, but she assumed, that Winfast would not pay the legal fees and disbursements if the purchasers did not use solicitor on the panel.Ms Quahe was not told if Winfast would pay legal fees, stamp duty or disbursements if solicitors not on the panel were retained. The undisputed evidence was that in fact Winfast also paid the stamp duty whether or not panel solicitors were retained. The panel was set up by Winfast and it was for Winfast and not for either of the solicitors concerned to decide who was to be added to or removed from the panel. It was for Winfast and its buyers to agree upon and decide if legal fees or stamp duty or other disbursements incurred by them would be paid by Winfast if solicitors whether or not on the panel were retained.The Disciplinary Committee did not make any specific finding of fact as to these matters in Ms Kwa`s case. However it noted Ms Kwa`s evidence that until the Inquiry Committe stage she did not know that Winfast would not pay the legal fees and disbursements if solicitors not on the panel were retained. She was not told about this before then and when Ms Len invited her firm to be on the panel she did not tell her about this.Ms Len said in her statutory declaration which was admitted in evidence:Sometime in September 1996, I contacted Ms Kwa Kim Li and told her that we would like [her firm] to be one of the firms on the panel for this scheme. Ms Kwa cautioned that this may be viewed by some as touting. She emphasised that Winfast must make it very clear to the purchasers that they were not compelled to appoint [her firm] to act for them and that they were free to use whichever firm they wanted.I had also contacted Ms Vivien Quahe who raised the same concerns as Ms Kwa Kim Li and stressed the importance of allowing purchasers the choice of their solicitors.I assured both Ms Kwa Kim Li and Ms Vivien Quahe that the purchasers would be informed that they were at liberty to appoint any firm of solicitors to act in the purchase and that they need not appoint [Ms Kwa`s firm] or [Ms Quahe`s firm] to act for them.She did not say if she told them what the scheme was. In particular she did not say if she told them whether Winfast would pay the legal fees or stamp duty or other disbursements if solicitors not on the panel were retained.When she was examined-in-chief Ms Len said:Q: And when you contacted Ms Kwa and told her you would like Lee & Lee to be one of the firms on the panel, did you mention to her the names of the solicitors on the panel?A: No.Q: Did you mention to her the number of solicitors firms that would be on the panel?A: No, we didn`t discuss that.Q: Did you mention to her that fee absorption - and I use it as `fee absorption`, would not be paid if it was not a panel member?A: No, we didn`t discuss that.Q: So all you discussed was your invitation for her to be on the panel for the scheme?A: That`s right.Q: And the scheme was that you, Winfast, would pay the legal fees, stamp duty and disbursements of the purchaser when they bought a unit from you?A: That`s right.Under cross-examination she said she was not sure if she used the word `only`. She was not sure if she said Winfast would pay legal fees, stamp duty and disbursementsonlyif the purchasers retained solicitors on its panel.",
        "The solicitors concerned `expressly consented to and authorised Winfast to introduce and refer their customers` to them": "`Winfast`s customers - hitherto strangers to [Ms Kwa`s firm] as well as [Ms Quahe`s firm] - were induced to appoint both firms; and if they refused to appoint the panel lawyers introduced and referred by Winfast, the purchasers would be financially disadvantaged`The scheme is prohibited by:r 5(c) of the Rules; andpara 2.3 of the Practice DirectionsThe scheme is prohibited by the Solicitors` Introduction & Referral Code UK (1988 and 1990)The Disciplinary Committee made no finding as to whether or not Ms Len did tell either of the solicitors concerned that Winfast would not pay the legal fees (for conveyancing) or the stamp duty or other disbursements if they retained solicitors who were not on the panel. Theschemeas alleged in the statement of the case was that Winfast would pay these only if panel solicitors were retained. The alleged scheme was not the scheme that Winfast devised. Under the scheme Winfast devised or carried into effect Winfast would pay the stamp duty whether or not solicitors on its panel were retained. I think the Disciplinary Committee made a conscious decision to find that the solicitors concerned only accepted the invitation to `sit` on the panel and not that they agreed to participate in the scheme alleged in the statement of the case.(3)(5)(6)(a)(b)(8)The Disciplinary Committee did not make any specific finding as to the consent and authority but it found that the solicitors concerned accepted the invitation to sit on Winfast`s panel. I think by accepting the invitation to be on the panel they must have given their consent to Winfast to introduce or to refer their buyers to them or to their firms for conveyancing services. There is no evidence of any express consent or authority but I do not think it makes any difference.In his written submissions Mr Low said that:The Disciplinary Committee erred in law in failing to understand the meaning, purpose and effect of:(1) para 2.3 [of the Practice Directions] and r 5(c) [of the Rules]; and(2) the true English position.The `true English position` is based on the Solicitors` Introduction and Referral Code 1988 and 1990 (`1988 Code` and `1990 Code`). I am unable to agree.Section 3 of the 1988 Code provides:In addition to the other provisions of this code the following requirements should be observed in relation to agreements for the introduction of clients/business to solicitors under which the solicitor is to be paid directly or indirectly by or through the introducer to work for the customers of the introducer:This is followed by six subsections and sub-s (4) provides:A solicitor should not enter into any agreement under this Section with a lender, builder, developer or vendor or their agent, or with a life office or its tied agent, for the provision of conveyancing services for purchasers or borrowers.These provisions have been restated differently in the 1990 Code but I have set them out and will refer to them as well only because counsel has expressly referred to both of them. Section 3A(1) of the 1990 Code provides:In addition to the other provisions of this code the following requirements must be observed in relation to agreements for the introduction of clients/business to solicitors under which the solicitor agrees with the introducer to be paid by the introducer to provide conveyancing services for the introducer`s customers.Section 3A(3) provides:Referrals under this section must not be made where the introducer is a seller or seller`s agent and the conveyancing services are to be provided to the buyer.Both codes provide that non-compliance, evasion or disregard of the code `could represent ... conduct unbefitting a solicitor`.The conduct of a solicitor who acts in non-compliance with or evasion or disregard of the provisions of the 1988 Code or the 1990 Code where it applies to him may be conduct unbefitting a solicitor but this is so as the code itself so provides. There is no equivalent rule of conduct made by the Council under the provisions of the Act. There is no evidence of any such usage whether in Singapore or anywhere else.The provisions of the 1988 Code and the 1990 Code clearly do not apply to the solicitors concerned. In any case the Law Society has not shown that there has been any non-compliance with or evasion or disregard of these provisions.The `agreement` in s 3A(1) of the 1990 Code is an agreement `under which the solicitor agrees with the introducer to be paid by the introducer` to provide conveyancing services for the introducer`s customer. The agreement is between the solicitor and the introducer. The solicitor agrees to provide the services andthe introducer agrees to pay the solicitor. The prohibition in s 3A(3) applies to such an agreement where the introducer is himself the seller or the seller`s agent.A solicitor under such an agreement whether the introducer is the seller or seller`s agent or not looks to the introducer and the introducer only for his remuneration. The introducer looks to his customer for his own remuneration if the transaction between him and his customer so provides. The customer is the client of the solicitor if he agrees to retain him but is not liable for the fees incurred by him within the scope of the agreement for the introduction. The solicitor binds himself with the introducer to provide the services for the introducer`s customer.The evidence before the Disciplinary Committee clearly shows that there was no agreement between the introducer (Winfast) and either of the solicitors concerned or their firms. There was no agreement under which either of them or their firms agreed to be paid by Winfast to provide conveyancing services for its buyers. Neither of the solicitors concerned nor their firms at any time at all bound themselves with Winfast to provide any services for its buyers. What the Disciplinary Committee found was that `Winfast decided to extend the offer of paying legal fees ... to purchasers`. On the evidence that offer was made to the buyers when they were offered options to purchase the housing units and if they accepted Winfast`s offer of paying their legal fees there would be agreements not between Winfast and the solicitors concerned or their firms but between Winfast and the buyers.The purpose of the scheme whether in the sense as alleged in the statement of the case or as conveyed to the solicitors concerned by Ms Len or as devised by Winfast and carried into effect was as the Disciplinary Committee found to make the purchase of the housing units more attractive at a time when the residential property market was `very, very slow`. It was in effect a discount given by Winfast and made available between the contract stage (when the stamp duty would be paid) and the completion stage (when the legal fees would be paid). It was a  `sweetener` or discount that was made in good faith. As Ms Len said in her statutory declaration the scheme was `part of Winfast`s marketing strategy`.Ms Len said in her statutory declaration:We have instructed [Ms Kwa`s firm] on many other transactions in the past. We had also dealings with [Ms Quahe`s firm] and [Ms Kwa`s firm] who had acted for purchasers of units in our other condominium projects. From our previous experience and dealings with them and the feedback we had received from our customers who had appointed them to act previously, we were pleased with their good service; trusted their integrity and competence and were certain that we could safely `recommend` them to our customers by inviting them to be on the panel.That was one of the matters Winfast took into consideration in coming to a decision to invite the firms of the solicitors concerned to be on the panel.I have referred to Ms Len`s evidence that when she contacted the solicitors concerned both raised their concerns that some might view that as touting and `emphasised that Winfast must make it very clear to the purchasers that they were not compelled to appoint [their firms] to act for them and that they were free to use whichever firm they wanted`. Ms Len gave her assurance. Her evidence was that all the purchasers were accordingly informed and there was no evidence to the contrary. The evidence also was that a number of purchasers retained solicitors other than those on the panel.Ms Len said in her statutory declaration:Winfast did not expect to be treated, nor were we treated more favourably, by [Ms Quahe`s firm] or [Ms Kwa`s firm] by virtue of their being on the panel. In fact, [Ms Kwa`s firm] had advised at least one of their clients that the floor area of the unit which he was purchasing included a void of 15 square metres. The purchaser was apparently not aware of this prior to receipt of advice from [Ms Kwa`s firm]. [Ms Quahe`s firm] had similarly also written to us on several occasions seeking confirmation that various items not mentioned in the sale and purchase agreement were to be supplied by us to the purchasers. Further they had written on behalf of several purchasers to request for amendments to the plans on receipt of instructions from their clients, the purchasers.The solicitors concerned and their firms acted for the purchasers who had retained them and acted in their best interests. There was no evidence of any instance where there was a failure in this respect. There was no evidence that in the discharge of their professional duties they were in any way at all influenced by their having been on Winfast`s panel.The Disciplinary Committee found that Winfast`s reason for confining the panel to three firms was for `administrative convenience`. Ms Len said in her statutory declaration:It was administratively expedient for us and our lawyers in the sale, M/s Lee Chang & Partners (`LCP`), to deal with a limited number of firms acting for the purchasers. Since we had decided to pay the purchaser`s legal fees, we felt that if the bills were rendered by [Ms Quahe`s firm] and [Ms Kwa`s firm] with whom we were familiar and trusted, we need not waste time calculating the quantum presented and verifying the same before making payment. In this regard, it is of note that we had initially considered  reimbursing the purchasers` fees regardless of whichever law firm they appointed. However, this idea was not pursued as it was clear that we would save unnecessary time and resources verifying the lawyers` bills before making payment and liaising with the various firms.That was what the Disciplinary Committee referred to as the `administrative convenience`.There was no evidence that any intending buyer negotiated with Winfast for it to pay the legal fees and disbursements where solicitors other than those on the panel were retained. It was a `very, very slow` market and Winfast had `initially considered reimbursing the purchasers` fees` whether panel solicitors were retained or not. As pointed out above it was for Winfast and its buyers to agree upon and to decide and I see no reason to suppose that Winfast would not agree to pay the legal fees and disbursements incurred. It was also for Winfast to decide whom to add to or to remove from its panel and the number of solicitors to be on it at any time.By consenting to be on the panel or authorising Winfast to introduce or refer its customers to their firms in the circumstances of the case the solicitors concerned had not done anything that compromised or impaired their professional independence or integrity or that was likely to do so. Winfast`s buyers were entitled to an independent choice of solicitors and remained so. Any financial advantage they received by retaining solicitors on the panel arose out of the agreements they made with Winfast and not out of any agreement between Winfast and the solicitors or anything done by the solicitors.Before leaving the 1988 Code and the 1990 Code I should refer to a notice published by the English Law Society in itsGazetteof 21 October 1998 which contains this passage:A consultation took place in November 1996 because there were conflicting views about the [1990 Code]. Some solicitors thought the code was too restrictive whereas others thought it needed to be tightened. More importantly, many solicitors did not understand it at all. The Law Society`s standards and guidance committee also believed that the code might be one piece of regulation which could be removed.I think the Council will want to make rules or come up with a code that will serve the interests of the public and of the profession and its members but I do not see that these interests are served by borrowing a code which is in some stage of development and which does not even apply to the present situation among legal practitioners for whom it is intended.It is improper to apply for or to seek instructions for professional business. It is improper to do or permit any act or thing which can be reasonably regarded as touting or as advertising (save as now permitted) or as calculated to attract business unfairly. The solicitor must not do any of these things. That is what r 5(c) of the Rules provides. It is quite another thing altogether to say that a solicitor must stop someone who has had business dealings with him from introducing business of the same kind to him. He is entitled to obtain business by virtue of his reputation.It may be wrongful for a party to exercise undue influence or coercion over a buyer in connection with his choice of solicitor but the solicitors concerned have not participated in the scheme as alleged in the charge before the Disciplinary Committee. In whichever sense the scheme is understood the whole substance of it is the agreement between Winfast and its buyer. That is an agreement to which the solicitors concerned or their firms are not parties.",
        "Ms Len wanted only three law firms on the panel and `effectively - as it transpired - it became a two-law firm panel`": "The Disciplinary Committee found that although Ms Quahe was not informed by Ms Len as to the number of firms on the panel when her firm was invited to be on it she was subsequently aware that there were three firms on the panel. In the case of Ms Kwa the Disciplinary Committee did not make a specific finding in this respect but the evidence was that she was not informed as to the number of firms on the panel but she found out subsequently that two other firms were on it. The third firm withdrew from the panel.I do not think there was any dispute that Winfast confined the panel to three firms as the Disciplinary Committee found and the number was reduced to two. As pointed out above it was for Winfast and not the solicitors concerned to decide who was to be added to or removed from the panel and it was for Winfast and its buyers to agree upon and to decide if legal fees incurred by the buyers would be paid by Winfast if solicitors whether on the panel or not were retained. It can make no difference whether there were only two firms on the panel or more than that or whether the solicitors concerned knew about it.",
        "Panels of solicitors": "The Disciplinary Committee said in its report:We can understand the frustration of a solicitor who may feel that panels are somewhat unfairly discriminating especially if one cannot get on the panel. But panels are now a fact of life. CPF has it, Credit POSB (before its merger with DBS Bank) had it and banks have them; and even property developing companies are now having them.Mr Low submitted that it was wrong to equate the Winfast panel with panels formed by the Central Provident Fund Board (`CPF Board`) and by financial institutions and insurance companies.Some lending institutions whether financial institutions or insurance companies or the CPF Board have panels of solicitors. Where a lending institution provides a loan for its customer to buy land (ie an interest in land) on the security of a mortgage of the land it will retain a solicitor on its panel to act in the mortgage. If the customer retains the same solicitor to act in the purchase of the land the solicitor is entitled to charge less in respect of the mortgage. The agreement between the lender and its customer usually provides that the customer pays the lender`s costs of the mortgage which will include the solicitor`s fees and disbursements in respect of the mortgage. There is in consequence a financial advantage to the customer in retaining the same solicitor.Where the customer retains a solicitor to act in his purchase before he obtains a loan and the solicitor is on the lender`s panel the same solicitor may be retained in respect of the mortgage. It is for the lender to decide although generally it will retain the same solicitor. If the customer`s solicitor is not on the lender`s panel it is for the lender to decide whether or not to include this solicitor on the panel and to retain him for the mortgage. If the customer has not retained a solicitor for the purchase before obtaining the loan he will learn from the lender which solicitor he may retain in order to avail himself of the financial advantage of retaining the same solicitor for the purchase and the mortgage.A solicitor on the lending institution`s panel authorises it to make it known to its customer that he is on the panel. The result is to make it known to the customer that a financial advantage may be available to him if he retains the same solicitor for the purchase. The lender retains the right whether or not to retain the same solicitor for the mortgage. It retains the right to determine how to make it known to the customer that a particular solicitor is on its panel but it `should not unduly influence` the customer to retain the lender`s solicitor to act for him as well. See the example in para 2.3 of the Practice Directions.I think in material and relevant respects Winfast`s panel is no different form panels established by lending institutions. The same cannot be said for panels established by insurance companies in conjunction with claims under third party liability or indemnity policies but such companies are expressly exempted from the provisions of s 33(3). However I do not see that the Disciplinary Committee has equated Winfast`s panel with panels established by such companies.The members of the Inquiry Committee did not think it was improper for the solicitors concerned or their firms to be on Winfast`s panel. When the Council referred the matter back for reconsideration they came to the same conclusion. The members of the Disciplinary Committee also did not think it was improper. The Council says it is. I have considered their views as expressed in their reports and in the Law Society`s case before the Disciplinary Committee and before me. In my judgment the solicitors concerned have not been guilty of any breach of r 5(c) of the Rules or para 2.3 of the Practice Directions as alleged or guilty of conduct unbefitting a solicitor as alleged. I agree with the Disciplinary Committee that no cause of sufficient gravity for disciplinary action exists under s 83.Outcome:Application dismissed.Copyright © Government of Singapore."
    }
}