{
    "case_title": "Sim Chiang Lee & Another v Lee Hock Chuan & Others",
    "ncitation": "[2000] SGHC 265",
    "coram": "Choo Han Teck JC",
    "sections": {
        "Ryland v Fletcher": "And The\n\nFirst And Second Defendant7.\n\n        Mr. Gn conceded that the plaintiffs had no\n\nbasis in proceeding against the owners here under the rule inRylands v Fletcher,\n\nbut sought to argue that they did as against the second defendants. However, the\n\nplaintiffs did not pleadRylands v Fletcheragainst the second defendants and,\n\nhaving closed their case, it was too late to amend the pleadings. It would have required\n\nthem to plead the particulars of non-natural user and the subsequent escape, both of which\n\nare indispensable elements of the rule. The only particulars in the pleadings refer to an\n\nescape of fire due to what the plaintiffs call \"defective wiring\". It would not\n\nbe right to expect the second defendants to amend their defence and get-up their case at\n\nthis stage to meet the fresh cause. Furthermore, the plaintiffs’ evidence have not\n\nshown that there was a non-natural user of land, by the second defendants. The ordinary\n\nuse of electricity is not a non-natural user of land in theRyland v Fletchersense. No submission was, in any event, made by Mr. Gn in this regard.Negligence Against First And\n\nSecond Defendants8.\n\n        The third ground which Mr. Gn relied on against\n\nthe first and second defendants was based on negligence. He argued that these defendants\n\nthough not occupiers of the lower floor of No. 25, were under a duty of care as owner and\n\nmain tenant respectively, to inspect the fuse box at regular intervals. On the evidence,\n\nthe third defendants were in occupation as tenants for at least four years prior to the\n\nfire. There was no contractual obligation on the part of the first or second defendants to\n\nmaintain the fuse box, and even if there were, their duty as owner and main tenant was\n\nonly to carry out repairs as and when required by the tenant. It would be an unwarranted\n\nexpansion of that duty to require them to make regular inspection of premises which they\n\nhad no right of entry during the duration of the tenancy to the third defendants without\n\nthe latter’s consent. Furthermore, the suggestion, postulated by Mr. Gn, that three\n\nseparate and independent parties (the three defendants) may and ought to share the same\n\nduty of inspecting the fuse box is impractical, and unnecessary for imposing legal\n\nresponsibility. Only one party should hold that responsibility, and that lies with the\n\noccupier. If he has a separate contractual arrangement with anyone else then it is for him\n\nto bring that person into the action by way of third party proceedings. Mr. Gn relied onVirco\n\nMetal Industrial Pte Ltd v Carltech Trading Industries Pte Ltd & Ors,[2000] 2 SLR 201,for the authority that the landlord is responsible for checking and installing a\n\nsafe and proper switch. But that case turned on its own facts. There was no allegation by\n\nthe plaintiffs or the third defendants in the present case that it was the first or second\n\ndefendants who replaced the fuses with copper wires. The third defendants’ case was\n\nthat they did not tamper with the fuses but they did not know who did; and they were not\n\nprepared to say that it was either the first or second defendants who were responsible for\n\nit. In the nine years that the first storey of No. 25 was tenanted out no complaint was\n\nreceived by the first defendant landlords that something about the fuse box was amiss.\n\nThere was no evidence that anyone had any inclination that the fuses in the fuse box had\n\nbeen replaced by copper wire; but more importantly, there was no evidence that that\n\nparticular fuse box, in the shophouse that was at least 30 years old, was still in use.9.\n\n        Mr. Gn suggested that an expansion of the duty\n\nof care requiring the three defendants to make regular inspection merely required them to\n\nmeet and agree on the appointment of an electrician to make regular inspections of the\n\nfuse box, and was, therefore, not an onerous duty. It is not quite so simple. Mr.\n\nGn’s idea may be convenient for persons in the plaintiff’s position, but an\n\nexpansion of the duty he proposed involves an unnecessary intrusion into areas of law and\n\npractice concerning landlords and tenants. The law imposes sufficient obligations and\n\nsanctions on an occupier not to do harm to his neighbour, whether by trespass, negligence,\n\nnuisance or under the Rule inRylands v Fletcher. An occupier in the\n\nplaintiffs’ position seeking comfort against harm or damage that falls outside the\n\nabove laws protecting him, must cover himself with appropriate insurance.Res Ipsa Loquitur10.\n\n        I need to deal with the plaintiffs’ plea\n\nofres ipsa loquitur. In my judgment,res ipsa loquituris only an\n\nevidentiary doctrine and does not apply in this case because the plaintiffs had\n\nspecifically sought to show that the cause of the fire was an electrical ignition. That\n\nbeing the case, it will not assist them to say that if they fail, the defendants must then\n\nexplain how the fire occurred. This is not how the doctrine is intended to be used. The\n\nburden of proof lies with he who asserts. Where a plaintiff asserts negligence he must\n\nprove negligence. If he is unable to assert any cause, then he may, if the circumstances\n\npermit, cryres ipsa loquiturand shift the burden of proof to the defendant to\n\nestablish how the facts complained of occurred. The overall burden (the legal burden) of\n\nproving the plaintiffs’ case remains with the plaintiff. Where, as in this case, the\n\nplaintiff makes a specific allegation of negligence he cannot rely on the rule to\n\nestablish a preliminary case of negligence. He must proceed to prove forthwith that which\n\nhe has asserted to be the defendant’s negligence.Conclusion11.\n\n        For the reasons above I find that the\n\nplaintiffs have no cause to pursue against the first and second defendants. Their\n\napplication to dismiss the plaintiffs’ claim was therefore allowed. The trial then\n\ncontinued against the third defendants. In the meantime, however, the plaintiffs have\n\nfiled an appeal against my decision dismissing their claim against the first and second\n\ndefendants.Sgd:Choo Han TeckJudicial CommissionerCopyright © Government of Singapore."
    }
}