{
    "case_title": "The \"Patraikos 2\"",
    "ncitation": "[2000] SGHC 86",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The documents discovered by the defendants": "8. On 8 October 1999, the defendants filed their list of documents for\n\ndiscovery. The plaintiffs were dissatisfied with the list, and filed Summons-in-Chambers\n\n7688 of 1999, applying for a Further and Better List of Documents and Affidavit Verifying\n\nthe same. Some of the documents requested were those which were referred to by documents\n\ndisclosed in the defendants’ original list. Some of the other documents were said to\n\nexist based on the surrounding circumstances. The Assistant Registrar granted an order in\n\nterms, and the defendants appealed by Registrar’s Appeal No. 600005 of 2000 (the\n\ndefendants’ appeal). I dismissed the defendants’ appeal with costs when it came\n\nup for hearing on 12 January 2000. The defendants have appealed against my decision (in\n\nCivil Appeal No. 17 of 2000) in so far as they relate to the following sets of documents\n\nordered to be disclosed:-(i) Survey reports for the vessel’s Annual Class Survey, Annual\n\n  Loadline Survey, Annual Construction Survey, Annual Safety Equipment Survey and Annual\n\n  Cargo Gear Survey.(ii) Two faxes from Sinclair, Roche & Temperly (SRT) to Dioryx\n\n  Maritime Corporation (Dioryx), dated 19 August 1996 and 3 September 1996 respectively.\n\n  (SRT are the defendants’ solicitors in the English action. Dioryx was the agent\n\n  employed by the defendants to manage the vessel.)(iii) All documents, including surveys relating to class\n\n  recommendations after survey of the vessel in Belgium.(iv) All invoices evidencing repairs made to the vessel in the past 5\n\n  years prior to grounding.(v) All classification survey reports/records, including but not\n\n  limited to the Lloyd’s Classification Reports/Repairs, of the vessel for a period of\n\n  five years prior to its grounding(vi) All documents pertaining to the grounding of theSaronikos IIin June 1989, including statements, if any, given by Orlanda in relation to the grounding.I will now deal with each of these sets of documents in turn.",
        "(i) Survey reports for the vessel’s Annual Class Survey, Annual\n\nLoadline Survey, Annual Construction Survey, Annual Safety Equipment and Annual Cargo Gear\n\nSurvey.": "9. Before an application for discovery of particular documents will be\n\ngranted, the documents in question must be shown to \"relate to matters in question in\n\nthe cause or matter\" (see O 24 r 7(3) of the Rules of Court). In this regard, the\n\ntest laid inCompagnie Financiere v Peruvian Guano[1882] 11 QBD 55 (at 63), should\n\nbe borne in mind. A document relates to the matters in question if:(i) they would be evidence upon any issue(ii) they contain information which may (as opposed tomust)\n\n  enable the party requiring the affidavit either to advance his own case or to damage the\n\n  case of his adversary, or(iii) they may fairly lead him to a train of inquiry, which may have\n\n  either of the two consequences in (ii) above.As some cases have put it more simply, documents relate to matters in\n\nquestion if they ‘throw light on the case’ (seeMerchants' &\n\nManufacturers' Insurance Co Ltd v Davies[1938] I KB 196 at 210,Manilal & Sons\n\n(Pte) Ltd v Bhupendra KJ Shan[1990] 2 MLJ 282).10. One of the ‘matters in issue’ in the present case would\n\nbe, as can be seen from the plaintiffs’ reliance on Art III r 1(a) of the Rules,\n\nwhether the vessel was seaworthy. Before a ship is deemed ‘seaworthy’, it must,\n\namongst other things, \"be fit in design, structure, condition, and equipment to\n\nencounter the ordinary perils of the voyage\" (Carver’s Carriage By Sea,\n\n13thed. at para 147). That being the case, the reports for the vessel’s\n\nAnnual Class Survey, Annual Loadline Survey, Annual Construction Survey, Annual Safety\n\nEquipment Survey and Annual Cargo Gear Survey would clearly constitute evidence as to the\n\nseaworthiness of the vessel. I thus had no difficulty in finding that these survey reports\n\nshould be disclosed.11. I would also add that in filing their list of documents, the\n\ndefendants in the present case actually included the entire list of documents discovered\n\nby the plaintiffs in the English action. Included in this list discovered in the English\n\naction was a Greek letter, which had in turn made reference to the above survey reports.\n\nHaving chosen to disclose the entire list of documents discovered in the English action,\n\nthe defendants thereby implied that these documents (including the Greek letter) are\n\nrelevant. It would now lie ill in their mouths to contend otherwise.",
        "(ii) The faxes from SRT to Dioryx": "12. As mentioned above, the grounding of the vessel led to the English\n\naction being commenced against the defendants. In the course of the proceedings in the\n\nEnglish action, correspondence was exchanged between SRT (i.e. the solicitors for the\n\ndefendants in the English action) and the solicitors for the English plaintiffs. In one of\n\nthe letters, dated 1 May 1997, SRT had broached the issue of the qualifications of the\n\nvessel’s Chief Officer at the time of grounding, one Aris Sporidis. Apparently, Aris\n\nSporidis only had a Second Mate’s Certificate. However, SRT stated in the letter that\n\nthe defendants’ agents who managed the vessel, Dioryx, employed officers based on\n\ntheir experience and not only on the basis of their paper qualifications alone. SRT\n\nfurther stated in the letter that the Greek authorities had been prepared to give Aris\n\nSporidis dispensations to act as Chief Mate, despite his having only a Second Mate’s\n\nCertificate. The plaintiffs thus sought discovery of certain faxes sent by SRT to Dioryx,\n\nand I allowed their application. The defendants have appealed against my order with\n\nrespect to two of the faxes dated 19 August 1996 and 3 September 1996. I felt that the\n\nplaintiffs’ application for discovery of the faxes was justifiable, as these faxes\n\nwould throw light on the issue regarding Aris Sporadis’ qualifications. If he only\n\nhad a Second Mate’s Certificate, and was not genuinely qualified to act as Chief\n\nOfficer aboard the vessel, then this might support the claim that the defendants failed to\n\nproperly man the vessel, as required by Art III r 1(b) of the Hague Rules (see alsoThe\n\n\"Makedonia\"[1962] 316, at 337-338, where it was held that the\n\nshipowners’ failure to employ sufficiently experienced engineers amounted to a breach\n\nof the obligation to properly man the ship).13. One of the objections raised before me by the defendants was that\n\nthe faxes were privileged. I rejected this argument. Apart from the statutory protection\n\nafforded by s 128(1) of the Evidence Act Cap 97 to communications between lawyers and\n\ntheir clients, it appears that there is also protection afforded by the common law, which\n\nextends to certain communications made in contemplation of litigation. The latter\n\nprotection has been termed ‘litigation privilege’, and consists of the following\n\ntwo limbs (seeSingapore Court Forms and Precedentsat para XIX p 203):(i) communications between the client’s professional legal\n\n  advisers and third parties, if made for thepurposeof pending or contemplated\n\n  litigation, and(ii) communications between the client or his agent and third parties,\n\n  if made for thepurposeof obtaining information to be submitted to the\n\n  client’s professional legal advisers for the purpose of obtaining advice upon pending\n\n  or contemplated litigation.14. Of greater relevance to the present case is the above first limb,\n\nsince the faxes constitute communications between the defendants’ legal advisers\n\n(SRT) and a third party (i.e. Dioryx). InWheeler v Le Marchant(1881) 17 Ch.D.\n\n675, Cotton LJ held (at 684-685):\"Hitherto such\n\n  communications\" -- between a solicitor and a third person -- \"have only been\n\n  protected when they have been in contemplation of some litigation, or for the purpose of\n\n  giving advice or obtaining evidence with reference to it. And that is reasonable, because\n\n  then the solicitor is preparing for the defence or for bringing the action, and all\n\n  communications he makes for that purpose, and the communications made to him for the\n\n  purpose of giving him the information, are, in fact, the brief in the action, and ought to\n\n  be protected.\"However, inSecretary Of State For Trade And Industry v Baker[1998] WLR 667, Sir Richard Scott VC consideredWheeler v Le Marchant, and held (at 675):These citations make clear, in my opinion, that\n\n  documents brought into being by solicitors for the purposes of litigation were afforded\n\n  privilege because of the light they might cast on the client's instructions to the\n\n  solicitor or the solicitor's advice to the client regarding the conduct of the case or on\n\n  the client's prospects.There was no general privilege that attached to documents\n\n  brought into existence for the purposes of litigation independent of the need to keep\n\n  inviolate communications between client and legal adviser. If documents for which\n\n  privilege was sought did not relate in some fashion to communications between client and\n\n  legal adviser, there was no element of public interest that could override the ordinary\n\n  rights of discovery and no privilege. [emphasis added].15. Thus, in order to have the benefit of the privilege, the defendants\n\nhad to show that the faxes sent by SRT to Dioryx either reflected the defendants’\n\ninstructions to SRT in some way, or somehow gave an indication of the legal advice that\n\nSRT would be giving the defendants; this they failed to do. Accordingly, I held that the\n\nfaxes should be disclosed.",
        "(iii) All documents, including surveys relating to class\n\nrecommendations after survey of the vessel in Belgium": "16. These documents related to the seaworthiness of the vessel, and\n\nthus clearly \"relate to matters in question\" in this case. The plaintiffs had\n\nadduced evidence before me to the effect that the survey in Belgium took place just a\n\nmatter of months before the grounding occurred, so these documents would be all the more\n\nrelevant in establishing the seaworthiness (or the lack thereof) of the vessel.",
        "(iv) All invoices evidencing repairs made to the vessel in the past 5\n\nyears prior to grounding": ".17. Again these documents are relevant in determining the seaworthiness\n\nof the vessel, so they should be disclosed. In fact, they are particularly relevant,\n\nbearing in mind that there was evidence adduced by the plaintiffs that several tons of\n\nrust were removed from the hull of the vessel when it was being repaired in Rotterdam,\n\njust before the grounding.18. In the course of submissions, counsel for the plaintiffs argued\n\nthat it would be oppressive for the defendants to be made to produce these documents,\n\nwhich stretched back for a period of 5 years. I did not find this to be the case. Of\n\ncourse there may be times when the sheer volume of the documents requested might render\n\nthe application for discovery oppressive. InScience Research Council v. Nass[1980] A.C. 1028, Lord Edmund-Davies remarked (at1076):Again, a request\n\n  for inspection of a great mass of documents, without any attempt at selection, could well\n\n  be regarded as oppressive.That does not appear to be the case here. There is no evidence that the\n\nvolume of documents involved will be so massive that the defendants will find discovery\n\noppressive.",
        "(v) All classification survey reports/records, including but not\n\nlimited to the Lloyd’s Classification reports/repairs, of the vessel for a period of\n\nfive years prior to its grounding": "19. These documents are relevant in that they again pertain to the\n\nseaworthiness of the vessel. In their defence, the defendants claimed that the vessel was\n\n\"in class and in possession of current and valid Safety Construction and Loadline\n\nCertificates\" ( at para 7(i)(a) of Defence). The documents that had been requested by\n\nthe plaintiffs under this head will go to show whether the defendants’ claim is true.",
        "vi) All documents pertaining to the grounding of the Saronikos II in\n\nJune 1989, including statements, if any, given by Orlanda in relation to the grounding": "20. It appeared that even before the grounding of the vessel, Orlanda\n\nhad been connected with another marine accident involving the ship \"Saronikos II\",\n\nof which he had also been second officer. After the grounding of the vessel, a statement\n\nhad been taken from Orlanda where he claimed that the \"Saronikos II\" had\n\nonly been involved in a minor collision, and that the \"Saronikos II\"\n\nsuffered no damage. The plaintiffs however adduced evidence that the \"Saronikos II\",\n\nfar from being involved in merely a minor collision, had actually been grounded (as was\n\nthe case with the vessel) The plaintiffs further contended that Orlanda had been on the\n\nbridge when the grounding of the \"Saronikos II\" occurred. I was of the\n\nview that all the documents pertaining to the grounding of the \"Saronikos II\",\n\nincluding statements, if any, given by Orlanda in relation to the grounding, were relevant\n\nto matters in question in this case. If these documents indicated that the grounding of\n\nthe \"Saronikos II\" resulted from Orlanda’s incompetence or\n\nnegligence, then the plaintiffs were entitled to use the evidence to argue that the\n\ndefendants, in engaging Orlanda, failed to properly man the ship, knowing his past\n\nemployment history..",
        "Conclusion": "21. For all the aforesaid reasons, I dismissed the defendants’\n\nappeal.LAI SIU CHIUJUDGECopyright © Government of Singapore."
    }
}