{
    "case_title": "MFH Marine Pte Ltd v Asmoniah bin Mohamad",
    "ncitation": "[2000] SGHC 141",
    "coram": "S Rajendran J",
    "sections": {
        "The pleadings": "As noted above, the respondent, in order to counter the defence of limitation, had pleaded that `the material facts relating to the respondent`s cause of action herein were outside his knowledge ... before 21 July 1998`. In support of that plea, the respondent had testified that it was on that date that he first came to know, through a friend, that he had the right to sue his employer in the civil courts. The hearing before the learned DJ proceeded on that basis. The learned DJ, however, on his own initiative and without inviting the attention of the parties to it, decided the case on the different basis that because s 33(2) of the Workmen`s Compensation Act prohibited the respondent from instituting civil action, time would begin to run from 28 June 1996 when the Commissioner rejected the claim for compensation.In taking that approach, the learned DJ was, as he indicated in his judgment, motivated by a desire not to allow poorly drafted pleadings deprive a party of his rights. That motivation is laudable but it has to be balanced against the requirement in our system of justice that issues for determination by the court should be carefully framed and all parties should have the opportunity to address the court on those issues before the court adjudicates thereon. It would be apposite in this context to quote Sir Charles Mathew CJ inHaji Mohamed Dom v Sakiman[1956] MLJ 45where the learned CJ stated:I think it is clear that a Judge is bound to decide a case on the issues on the record and if there are other questions they must be placed on the record ...The same sentiment was echoed by Sharma J, albeit in stronger language, inJanagi v Ong Boon Kiat[1971] 2 MLJ 196where he said:A statement of claim and the defence (together with the reply, if any) constitute the pleadings in a civil action. It is on the examination of the pleadings that the court notices the differences which exist between the contentions of the parties to the action. In other words the matters on which the parties are at issue are determinable by an examination of the pleadings. An issue arises when a material proposition of law or fact is affirmed by one party and denied by the other.The court is not entitled to decide a suit on a matter on which no issue has been raised by the parties. It is not the duty of the court to make out a case for one of the parties when the party concerned does not raise or wish to raise the point. In disposing of a suit or matter involving a disputed question of fact it is not proper for the court to displace the case made by a party in its pleadings and give effect to an entirely new case which the party had not made out in its own pleadings. The trial of a suit should be confined to the plea on which the parties are at variance. [Emphasis added.]The learned DJ in this case was quite correct in criticising the pleadings as poorly drafted. But whether the pleadings were poorly drafted or not, the learned DJ was not entitled to decide the case on the basis of an issue that was not canvassed before him. What the learned DJ should have done was to invite the respondent to apply to amend his pleadings and, if such application was made and (after hearing all parties) granted, to hear submissions on the fresh issue raised in the amendment before adjudicating on the matter. Had the learned DJ done that, there would have been no cause for the appellants to complain that the case had been decided against the appellants on issues not pleaded and not canvassed at the hearing.",
        "Decision": "For the above reasons, the appellants succeed on both the grounds raised by Mr Rai. This appeal is therefore allowed with costs both here and below.Outcome:Appeal allowed.Copyright © Government of Singapore."
    }
}