{
    "case_title": "Hsing Mei Construction Pte Ltd v Lim Check Meng",
    "ncitation": "[2000] SGHC 75",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "GROUNDS OF DECISION": "1. The plaintiffs obtained judgment in default of the defendant’s\n\nappearance amounting to the liquidated sum of $353,820 on 28 April 1999. Some five (5)\n\nmonths later on 30 September 1999, the defendant applied to set aside the judgment, which\n\nwas regularly obtained. His application was dismissed by the Senior Assistant Registrar\n\n(SAR). The defendant appealed and I allowed his appeal in part, setting aside part of the\n\njudgment obtained against him. He has nevertheless appealed against my decision (in Civil\n\nAppeal No. 16 of 2000).Background facts2 In 1996, Hsing Mei Building Construction Pte Ltd (Hsing Mei), who are\n\nbuilding contractors, entered into (2) agreements with one Lim Check Meng (the defendant)\n\nto construct houses on two pieces of land. The first of these agreements was for the\n\nproposed erection of a pair of semi-detached houses at No 8 Mariam Close, Singapore at the\n\nprice of $1.6m. The second agreement was for the proposed erection of a three-storey\n\ndwelling house at No 144 Jalan Pari Burong, Singapore at the price of $1m. According to\n\nthe two (2) agreements, the houses at Mariam Close and Jalan Pari Burong were scheduled to\n\nbe completed by 31 March 1997 and 28 April 1997 respectively.3 Hsing Mei commenced construction works on 15 April 1996 for the\n\nMariam Close houses and on 13 March 1996 for the Jalan Pari Burong property. The\n\nagreements, which were standard form contracts prescribed by the Singapore Institute of\n\nArchitects (‘SIA’), provided generally for interim payments to be made subject\n\nto a certificate being issued by the appointed architect, termination of the contracts by\n\nboth contractor and employer if certain events occurred, and the time for completion. The\n\nrelevant clauses of the contract read:‘15.\n\n  POSSESSION AND TIME FOR COMPLETION(1) The\n\n    dates for possession and completion respectively will be those stated in the Appendix.\n\n    Should the Contractor fail to complete the Works by the contract completion date, or the\n\n    date as extended by the Architect under Sub-Clause (4) of this clause, the Contractor,\n\n    upon a certificate of the Architect to that effect and stating that the Works should have\n\n    been completed by a date named in the certificate, shall be liable to pay, or the Employer\n\n    may deduct from monies due under the contract, the sums stated as liquidated damages in\n\n    the Appendix.…(4) The Contractor shall be entitled to a reasonable extension of time\n\n    for delays caused by the following:(a) Variations ordered by the Architect (other than variations caused\n\n      by the Contractor’s defective work or other breaches of contract).(b) Exceptionally adverse unseasonal weather.(c) Breaches of contract by the Employer or other matters for which the\n\n      Employer is responsible.(d) Damage due to insured risks under Clause 18.And (e) Other contractors employed by the Employer, provided and to the\n\n    extent that in all the above cases the Contractor has not himself been at fault in failing\n\n    to guard against or prevent or minimise such delays or damage.…22. TERMINATION FOR DEFAULT(1) Should the Contractor become insolvent or a Receiver be appointed\n\n    or should he:(a) Fail to proceed with the Works with due diligence for 2 weeks after\n\n      receipt of a written warning notice from the Architect, or fail so to proceed on any\n\n      subsequent occasion whether with or without notice, (in assessing due diligent, regard\n\n      shall be had to any programme submitted by the Contractor and any extensions of time\n\n      received by or due to the Contractor.) or(b) Suspend work without justification for more than one further week\n\n      after receipt of a written warning notice from the Architect,or(c) Fail to comply with any written instruction which the Architect is\n\n      entitled to give under the terms of the contract within 2 weeks of receipt of a written\n\n      warning notice from the Architect, or(d) Remove from the Site without justification any unfixed materials or\n\n      goods or items of plant or equipment necessary for completion of the Works and fail to\n\n      return the same or its equivalent to the Site within one week of a written warning notice\n\n      from the Architect, then the Employer may within 14 days of the Architect so certifying in\n\n      writing determine the contract by written notice.…25. PAYMENT(1) Interim\n\n    payments shall be made at the rate of 90% of the gross sum required to be paid at each\n\n    stage on the certificate of the Architect following satisfactory completion of the various\n\n    stages of construction set out in the Appendix and upon Provisional and Final Completion.\n\n    The percentages not paid hereof shall be known as \"Retention Monies\", but shall\n\n    be subject to the sum or percentage (if any) stated as the limit of Retention in the\n\n    Appendix hereto. On this limit being reached, any further balance of Retention Monies\n\n    calculated shall be payable to the Contractor. Subject to Clause 15(2) of these Conditions\n\n    in regard to Phased Completion, one-half of the Retention Monies not yet paid shall be\n\n    certified as due to the Contractor on the issue of the Provisional Completion Certificate\n\n    under Clause 19 of these Conditions, and any remaining unpaid balance of the Retention\n\n    Monies shall be certified and paid to the Contractor at the expiry of the Maintenance\n\n    Period for the whole work. Variations shall be valued and paid for at the same stage dates\n\n    unless it would be inequitable to do so, in which case the Architect may issue a special\n\n    certificate under Sub-Clause(2) of this Clause as therein stated. The times and instalment\n\n    arrangements for nominated sub-contractors’ accounts to be paid to the Contractor\n\n    shall be separately stated in the Specification or Appendix, or indicated to the\n\n    Contractor at the time of nomination of the sub-contractor.(3) Both parties shall be bound by the Architect’s interim or\n\n    other payment certificates until such time, in a disputed case, as a final award or\n\n    judgment is obtained, in the like manner and with the like consequences as provided for in\n\n    Clauses 31(11) and 37(3)(g) of the SIA Articles and Conditions of Building Contract. Save\n\n    as aforesaid, no certificate of the Architect, including his Provisional and Final\n\n    Completion Certificates, shall be binding on either party.(4) All payment certificates shall be issued to the Contractor with a\n\n    copy to the Employer. Should the Employer fail to pay any interim certificate within 14\n\n    days following presentation of the relevant certificate by the Contractor to the Employer,\n\n    then the Contractor may serve written notice requiring payment within 7 days of service of\n\n    the notice. Failing such payment the Contractor may thereupon terminate the contract by\n\n    notice in writing and upon such termination the Contractor shall be entitled to payment of\n\n    the full value of work carried out, together with any expenditure or loss of profit\n\n    (subject to mitigation of damage) caused by the termination, less sums previously paid by\n\n    the Employer. Provided that, if and to the extent that the Employer is ultimately held to\n\n    be entitled by way of set-off or counterclaim to sums in excess of the sums certified for\n\n    payment, or in excess of any balance due as a result of any partial payment made by him\n\n    against such sums, the termination by the Contractor shall be treated as wrongful\n\n    termination of the contract, and the Employer shall be entitled to damages in the same way\n\n    as if he had himself validly terminated the contract in accordance with Clause 22(3) of\n\n    the Conditions.’Aside from stating the commencement and completion dates, the contracts\n\nprovided for liquidated damages at $500 per day and that the retention percentage would be\n\n10%. The retention limit was expressed to be 10% of every progress claim. The maximum\n\nretention sum was to be 5% with 2.5% on handing over for the duration of the warranty\n\nperiod.Hsing Mei’s claims4 On 8 April 1997 and 29 August 1997, the architect appointed by the\n\ndefendant, one Tan Kee Cheong (‘Tan’) from T3M Architects & Urban Designers,\n\nissued certificates of payments for the sums of $11,500 and $52,800 respectively. One part\n\nof these sums was to be paid by the bank from whom the defendant had taken out a mortgage.\n\nThe certificate issued on 8 April 1997 was for the work done at Jalan Pari Burong whereas\n\nthe certificate issued on 29 August 1997 was for the houses at Mariam Close. These\n\ncertificates were sent to the defendant and copied to Hsing Mei. Hsing Mei also sent\n\nletters to the defendant asking for payment of these progress payment amounts, less the\n\namount to be paid by the bank.5 According to Hsing Mei, although the projects had not been completed\n\nby the scheduled completion dates set out in the agreements, the parties had agreed to\n\nvary the completion date at a meeting held on 10 September 1997. What happened was that on\n\n11 April 1997 and 2 May 1997, Tan issued two Delay Certificates purportedly under cl 24(1)\n\nof the contracts which certified that the completion dates for the works had passed and\n\nthat no grounds existed for any further extension of time to the contractors (Hsing Mei),\n\nand that Hsing Mei was in default for not completing the works on time. However, at a\n\nmeeting held on 10 September 1997 at which Tan, the defendant and Lim Puay Kwang (LPK),\n\nthe managing director of Hsing Mei, were present, the defendant agreed to grant an\n\nextension of time to Hsing Mei to complete the works. The relevant portion of the minutes\n\nof this meeting states as follows:-‘Extension of Time – Client (The defendant)\n\n  accept Contractor’s (Hsing Mei) claim for Extension of Time, and confirm to award\n\n  extension of time up to today plus the period Contractor has indicated will be required to\n\n  complete the job. Client also confirm no LD up to today, but will charge LD if Contractor\n\n  fails to complete before the revised date.Completion\n\n  – Contractor said from the date of receiving next payment, the completion date is as\n\n  follows:Mariam Close 2 monthsPari Burong 3 months’The reference to LD in the minutes is to liquidated damages.6 Pursuant to the above meeting, Tan issued two Termination of Delay\n\nCertificates, also purportedly under cl 24(3) of the contract, on the same date. The first\n\nof these certificates certified that in respect of the Mariam Close project, an extension\n\nof time was granted to Hsing Mei totalling 31 weeks due to matters which had arisen since\n\nthe Delay Certificates were issued. The certificate also stated that Hsing Mei’s\n\ndelay was terminated on the scheduled completion date, 31 March 1997, and that no\n\nliquidated damages would become due to the defendant beyond any that had already accrued\n\nat that date. The certificate in relation to the Jalan Pari Burong contract stated\n\nessentially the same thing. The extension period was likewise 31 weeks from the date of\n\nthe certificate.7 Subsequently, the defendant did not make the progress payments that\n\nhad been certified by Tan on 8 April 1997 and 29 August 1997. On 2 September 1997 and on\n\n17 September 1998, Hsing Mei sent reminders to the defendant, which were copied to Tan, in\n\nrespect of these payments for both the Mariam Close and Jalan Pari Burong works. It was\n\nstated in the letter dated 17 September 1998 that if payment was not made within seven\n\ndays from the date of the letters, both contracts would be treated as terminated by Hsing\n\nMei. No payments were however made by either the bank or the defendant. Thus on 1 March\n\n1999, Hsing Mei issued a writ claiminginter aliafor the sum of $194,300 in\n\nrespect of the two contracts. This consisted of $11,500 plus a $50,000 retention fee for\n\nthe house at Jalan Pari Burong and $52,800 (plus the additional retention fee of $80,000)\n\nfor the semi-detached houses at Mariam Close.8 Hsing Mei also claimed that the defendant borrowed certain sums of\n\nmoney from it amounting to $159,520. LPK alleged that soon after Hsing Mei began work on\n\nthe projects, the defendant asked Hsing Mei to help him out by advancing monies to him to\n\nservice certain bank loans that he had taken out to finance the construction costs of the\n\nhouses on both properties. In the interest of ensuring that the construction work\n\nproceeded, Hsing Mei advanced to the defendant an interest-free friendly loan. In return,\n\nthe defendant told LPK that he would give Hsing Mei another contract to build more houses\n\nat No 33 Mariam Close. The loan to the defendant was advanced by the following\n\ninstalments:i) $63,000 vide a Chung Khiaw Bank Cashier’s Order on 18 September\n\n  1996ii) $40,000 vide a Bank of Singapore cheque on 1 November 1996iii) $50,000 vide a Chung Khiaw Bank Cheque on 21 January 1997iv) $6,520 vide a Chung Khiaw Bank Cheque on 17 March 1997To date this sum has not been repaid and Hsing Mei thus included it in\n\nits statement of claim against the defendant. The total judgment sum obtained against the\n\ndefendant was $353,820.The defence9 In applying to set aside the judgment in default against him, the\n\ndefendant said firstly that he had not entered an appearance because he was not aware that\n\nan action had been commenced against him. When he found out on 30 April 1999 that judgment\n\nhad been entered against him, he was unable to deal with it then as he was facing\n\ncash-flow problems and had to deal with two pending bankruptcy petitions against him.\n\nThus, he was only able to address this matter in late September 1999.10 The defendant also claimed that Hsing Mei’s version of facts\n\nrelating to his refusal to pay the progress payments was not correct. He said that by\n\nvirtue of the two Delay Certificates dated 11 April 1997 and 2 May 1997 issued by Tan, he\n\nwas justified in withholding the progress payments to Hsing Mei. Furthermore, due to these\n\ndelays, he in fact had a counterclaim against Hsing Mei for liquidated damages from the\n\ndate of delay till 31 August 1999. These liquidated damages amounted to the sum of\n\n$441,500 for the Mariam Close houses and $427,000 for the house at Jalan Pari Burong. The\n\ndefendant added that subsequently, he terminated the contracts with Hsing Mei on 16\n\nSeptember 1997.11 According to the defendant, the minutes of the meeting that\n\nallegedly took place on 10 September 1997 were a fabrication and he denied that a meeting\n\naccording to the terms of the minutes ever took place. Instead, he said that there was a\n\nmeeting held on 10 September 1997 at the premises of Tan’s office, at which only the\n\ndefendant and LPK were present. This meeting only lasted five minutes during which LPK\n\nasked him for a waiver of the liquidated damages which were due. The defendant claimed he\n\nrefused to agree whereupon LPK broke down and cried. The two men then adjourned, at the\n\nsuggestion of the defendant, to the coffeehouse at Allson Hotel to continue the\n\ndiscussion. However, the defendant remained firm in his stance that he would not waive the\n\nliquidated damages.12 In support of his version of facts, the defendant pointed out\n\ncertain anomalies in Hsing Mei’s allegation that the contracts had been varied.\n\nFirst, there was no evidence that the minutes of the meeting held on 10 September 1997\n\nwere sent to the defendant or approved by him. Secondly, the portion of the minutes which\n\nreferred to an extension of time being granted to Hsing Mei provided no evidence that a\n\nvariation of the contract was agreed to by the parties. There was also no evidence that\n\nTan had been given the power to issue the two Termination of Delay Certificates. It was\n\ncurious that given the enormity of the amount of liquidated damages that would be waived,\n\nthere was no confirmation in writing by Tan, to both Hsing Mei and the defendant, that the\n\ndefendant had agreed to waive the liquidated damages and grant an extension of time to\n\nHsing Mei. Thirdly, if it was the case that the parties had agreed to the waiver, why\n\nwould the defendant terminate the contracts with Hsing Mei so soon after the alleged\n\nagreement? Finally, there could be no variation of the contract in any case as there\n\nappeared to be an absence of fresh consideration for the waiver.13 As for the Termination of Delay Certificates that were issued by\n\nTan, the defendant said that although Tan faxed him draft copies of these certificates on\n\n14 October 1997, he refused to agree to them. As such, the certificates were not valid.\n\nFurthermore, as Tan had only spoken to him on 14 October 1997, it was not possible that\n\nthe certificates could be dated 10 September 1997 unless they were backdated to refer to\n\nan alleged agreement that had never existed. The defendant also pointed out that the\n\ncertificates were issued under cl 24(3) of the SIA contracts. However, this clause did not\n\nexist in the standard form contract signed by the parties. Thus, Tan had no power to\n\nrescind or render nugatory the Delay Certificates issued earlier by him. In any event, on\n\n16 September 1997, the defendant terminated the contracts with both Hsing Mei and Tan and\n\nTan thus had no power to act on his behalf.14 In relation to the claim for the repayment of the interest-free\n\nfriendly loan granted by Hsing Mei, the defendant admitted that he received the payments\n\nas detailed above. However, he denied that this was in respect of a loan to him from Hsing\n\nMei. Rather the sums were paid to him as repayment of a loan of $300,000 that he had made\n\nto Hsing Mei through LPK between April 1996 and May 1996 to buy materials and to pay the\n\nworkers’ salaries. The defendant claimed that LPK had sent him a letter by way of\n\nfacsimile transmission acknowledging receipt of the monies, but he was unable to produce\n\nthis letter for his own reasons. However, he said that he would endeavour to produce it at\n\ntrial.The decisionThe law15 The court is given the discretion to set aside judgments obtained in\n\ndefault under O 13 r 8 of the Rules of Court. Lord Atkin in the leading case ofEvans v\n\nBartlam[1937] AC 473 said that:‘The principle\n\n  obviously is that unless and until the Court has pronounced a judgment upon the merits or\n\n  by consent, it is to have the power to revoke the expression of its coercive power where\n\n  that has only been obtained by a failure to follow any of the rules of procedure.’16 In order to set aside a judgment in default that was regularly\n\nobtained, the defendant must show that he has a meritorious defence. According to the\n\nEnglish Court of Appeal decision ofAlpine Bulk Transport Co Inc v Saudi Eagle Shipping\n\nCo Inc[1986] 2 Lloyd’s Rep 221(The Saudi Eagle), it is not sufficient\n\nfor the defendant to show a merely ‘arguable’ defence that would justify leave\n\nto defend under the O 14 summary judgment. The defence must have a real prospect of\n\nsuccess and carry some degree of conviction. The court must form a provisional view of the\n\nprobable outcome of the action by assessing whether the affidavit evidence is potentially\n\ncredible such that there is a real likelihood that the defendant will succeed on fact.\n\nFurthermore, if the proceedings had been deliberately ignored by the defendant, this\n\nfactor must be considered before exercising the court’s discretion to set aside the\n\njudgment.17 Both the above propositions have been accepted in Singapore in the\n\ncase ofHong Leong Finance Ltd v Tay Keow Neo & Anor[1992] 1 SLR 205which was\n\nreaffirmed inAbdul Gaffar v Chua Kwang Yong[1994] 2 SLR 645. InHong Leong\n\nFinance Ltd v Tay Keow Neo & Anor, Rubin JC (as he then was) had to decide whether\n\nto set aside a judgment in default obtained against two guarantors by Hong Leong Finance.\n\nHe set out the guiding principles in relation to an application to set aside a judgment in\n\ndefault and quoted Sir Roger Ormrod who delivered the leading judgment inThe Saudi\n\nEagle, saying:‘The manner in\n\n  which a court should exercise its discretion in an application of this nature, can be\n\n  extracted from the speeches inEvans v Bartlam. The guiding principles, bearing in\n\n  mind that in matters of discretion, no one case can be authority for another, have been\n\n  summarized inAlpine Bulk Transport Co Inc v Saudi Eagle Shipping Co Inc (‘The\n\n  Saudi Eagle’), at p 223 (per Sir Roger Ormrod) as follows:(i) a judgment signed in default is a regular judgment from which,\n\n    subject to (ii) below, the plaintiff derives rights of property;(ii) the rules of court give to the judge a discretionary power to set\n\n    aside the default judgment which is in terms ‘unconditional’ and the court\n\n    should not ‘lay down rigid rules which deprive it of jurisdiction’ (per Lord\n\n    Atkin at p 480);(iii) the purpose of this discretionary power is to avoid the injustice\n\n    which might be caused if judgment followed automatically on default;(iv) the primary consideration is whether the defendant ‘has\n\n    merits to which the court should pay heed’ (per Lord Wright at p 489), not as a rule\n\n    of law but as a matter of common sense, since there is no point in setting aside a\n\n    judgment if the defendant has no defence and if he has shown ‘merits’ the ...\n\n    court will not, prima facie, desire to let a judgment pass on which there has been no\n\n    proper adjudication (ibid p 489 and per Lord Russell of Killowen at p 482).(v) Again as a matter of common sense, though not making it a condition\n\n    precedent, the court will take into account the explanation as to how it came about that\n\n    the defendant ... found himself bound by a judgment regularly obtained to which he could\n\n    have set up some serious defence (per Lord Russell of Killowen at p 482).Rubin JC then went on to say:-It is my view that\n\n  the defendants have not shown that they have a defence which had any reasonable prospect\n\n  of success on the grounds stated and evidence placed before me. Above all, the conduct of\n\n  the defendants in ignoring the service of process when they allowed judgment to be entered\n\n  in default, further fortifies my view that their conduct was deliberate and that they came\n\n  in to dispute the issues only when they found that they were going to be made bankrupts.\n\n  The defences raised were not by any means meritorious and the defendants had deliberately\n\n  allowed the plaintiffs’ claim to go by default.’Claim for progress payments18 Having read the defendant’s affidavits, I came to the\n\nconclusion that he had no reasonable prospect of successfully defending Hsing Mei’s\n\nclaim for the progress payments and the relevant retention sums (which amounted to a total\n\nof $194,300 plus interest). The defendant’s defence basically consisted of alleging\n\nthat all the documentary evidence against him, in particular the two Termination of Delay\n\nCertificates and the minutes of the meeting that took place on 10 September 1997, had been\n\nfabricated by Hsing Mei. He also said that in any event, Tan had no power to issue the\n\nTermination of Delay Certificates as the contracts did not provide expressly that he could\n\ndo so.19 I first turn to the minutes of the meeting allegedly held on 10\n\nSeptember 1997. The defendant claimed that these were fabricated and there was never an\n\nagreement by him in the terms stated in those minutes. It was conceded by counsel for\n\nHsing Mei that these minutes were not signed and that the defendant denied ever receiving\n\na copy. The defendant further tendered a receipt issued by the coffeehouse at Allson Hotel\n\non the date and time the meeting had supposedly taken place to bolster his stance that he\n\nhad gone there with LPK to discuss matters. Although I dismissed any evidential weight\n\nthat the coffeehouse’s receipt could lend to the defendant’s contention that the\n\nmeeting did not take place at the architect’s office in the manner detailed in the\n\nminutes, I was of the view that the evidential quality of the minutes of the meeting was\n\nprobably insufficient on its own to establish the fact that the parties had agreed that no\n\nliquidated damages were payable by Hsing Mei for the delay. However, I had to take into\n\naccount the two Termination of Delay Certificates, as well as other circumstances.20 In relation to the two Termination of Delay Certificates, the\n\ndefendant had said that there was no confirmation in writing to either him or Hsing Mei by\n\nTan that the extension of time had been granted. Furthermore, he submitted that if indeed\n\nit was true that the parties had agreed to waive the liquidated damages, why would he have\n\nterminated both Hsing Mei’s and Tan’s services six days after that? I was not\n\nconvinced of the credibility of this defence. Although the defendant claimed that he sent\n\nthe letters of termination by registered post on 16 September 1997 and enclosed the\n\nreceipts from Singapore Post purporting to evidence this, there were several problems with\n\nthe surrounding circumstances that indicated that this allegation could not be believed.\n\nIn the first place, the dates on the letters of termination exhibited in the\n\ndefendant’s affidavit were not typed but were hand-written. I also noted that Tan\n\ncontinued to provide architectural services to the defendanteven after16\n\nSeptember 1997 as evidenced by the defendant’s own claim that Tan had spoken to him\n\nabout the draft Termination of Delay Certificates on 14 October 1997, as well as two\n\nmemoranda dated 28 October 1997 concerning the projects. These memoranda were sent to both\n\nHsing Mei and the defendant and contained no hint of the fact that either Tan’s or\n\nHsing Mei’s services had been terminated. As such, even if the fact that the\n\ndefendant posted letters to Hsing Mei and Tan on those dates was proved by the Singapore\n\nPost receipts, I could not accept that their contents were termination notices as this was\n\nnot borne out by the surrounding circumstances and actions of the parties.21 As for the defendant’s allegation that Tan had no power to\n\nissue the Termination of Delay Certificates as the clause under which the certificates\n\nwere issued (cl 24) did not actually exist in the version of the SIA contracts signed by\n\nthe parties, I noted that the two Delay Certificates on which he relied to substantiate\n\nhis claim that he was entitled to withhold payments were also issued under the\n\nnon-existent cl 24. If the defendant wanted to rely on these Delay Certificates, then he\n\ncould not in the next breath say that the Termination of Delay Certificates issued under\n\nthe same clause were invalid; he could not which he did, blow hot and cold. If he\n\npersisted in his position that the Termination of Delay Certificates were invalid due to\n\nthe fact that they were issued under a non-existent clause, then likewise he could not\n\nrely on the Delay Certificates as these were issued under the same cl 24. What is sauce\n\nfor the goose is sauce for the gander. Either way, the defendant could not rely on the\n\nDelay Certificates as the basis on which he was entitled to withhold progress payments due\n\nand owing to Hsing Mei.22 I thus concluded that the alleged defence to Hsing Mei’s claim\n\nfor the progress payments had no real prospect of success in accordance with the meaning\n\nof the term inThe Saudi Eagle. The defendant’s affidavit evidence contained\n\nlittle substance and revealed that there was no real likelihood of his succeeding if the\n\nmatter went to trial. I therefore did not exercise my discretion to set aside the judgment\n\nobtained by Hsing Mei against him in relation to the sum of $194,300.Interest-free friendly loan23 However, in respect of Hsing Mei’s claim of $159,520 against\n\nthe defendant under an alleged loan, I was of the opinion that there was a plausible\n\ndefence to this claim which may have a reasonable prospect of success if the matter went\n\nto trial.24 Apart from particularising the details of four payments totalling\n\n$159,520 made by way of three cheques and one cashier’s order, Hsing Mei did not\n\ntender any other evidence in support of its claim that this sum represented a loan\n\nadvanced to the defendant. This was pointed out by the defendant in his affidavits in\n\nwhich he acknowledged that while he had received these sums from Hsing Mei, they were for\n\npart repayment of certain loans totalling about $300,000 that he had advanced in cash to\n\nHsing Mei to buy materials and to pay the workmen’s salaries. The defendant also said\n\nthat at the time that Hsing Mei purportedly advanced these monies to him, he had a fair\n\namount of funds in bank accounts and did not need to borrow money from Hsing Mei,\n\nnotwithstanding that subsequently he was on the verge of bankruptcy.25 Given the lack of evidence by Hsing Mei that the sum of $159,520 was\n\ndisbursed to the defendant as a friendly loan, I felt that the defendant’s defence\n\nmay succeed at trial if he could substantiate his assertion that this sum was actually a\n\npartial repayment to him of a loan he made to Hsing Mei. The burden of proving on a\n\nbalance of probabilities that the sums were disbursed as loans to the defendant lay with\n\nHsing Mei and the lack of documentary evidence in support of its contention meant that it\n\nwas not certain the defendant would not succeed in his defence that the sums were actually\n\nmonies he had lent to Hsing Mei in the first place; I gave the defendant the full benefit\n\nof the doubt, however shadowy his defence was.Conclusion26 Thus I ordered that final judgment against the defendant for the sum\n\nof $194,300 and the costs awarded by the SAR in respect of this part of the claim should\n\nstand. However judgment against the defendant for the sum of $159,520 was set aside with\n\nleave to file his defence provided he furnished a bank’s guarantee or some suitable\n\nsecurity in the said sum. I further ordered that the costs of the appeal on this matter\n\nwere to be costs in the cause.LAI SIU CHIUJUDGECopyright © Government of Singapore."
    }
}