{
    "case_title": "Public Prosecutor v Zhou Jian Guang and Another",
    "ncitation": "[2000] SGHC 68",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "THE STATEMENT OF FACTS": "4 The joint Statement of Facts admitted by the two Accused persons\n\nreads:\"1 The Accused persons are:b. Zhou Jian Guang @ Guo Ping, (hereinafter \"1stAccused\"), male / 26 years. He is a national of the People’s Republic of China.c. Shi Song Jing @ Ah Jing, (hereinafter \"2ndAccused\") male / 29 years. He is a national of the People’s Republic of China.2 The victim is Yong Sze Hui (hereinafter \"the victim\")\n\n  female / 14 years, a Secondary 2 student of Monk’s Hill Secondary School. She is\n\n  residing at No. 25 Sian Tuan Avenue, Singapore.3 Investigations revealed that sometime in early August 1999, one\n\n  Vincent Lee Chuan Leong (hereinafter \"Vincent Lee\") met the 1stand 2ndAccused at a coffeeshop located behind Hougang Plaza. Both 1stand 2ndAccused asked Vincent Lee whether he could help them find a job in Singapore. A few days\n\n  later, they met up again at a hawker centre in Hougang. There, Vincent Lee suggested that\n\n  they conduct a kidnap for ransom and came up with the details to execute the scheme. Both\n\n  1stand 2ndAccused agreed to the plan suggested by Vincent Lee.4 On 25 August 1999, Vincent Lee rented a house at No. 43 Lorong Kismis\n\n  through a housing agent from Mr K Sivanathan. He paid for the rental of the house by way\n\n  of a United Overseas Bank (\"UOB\") cheque amounting to $2,600. Vincent Lee also\n\n  paid the housing agent, Mr Tham See Weng, $325 as commission by way of another UOB cheque.\n\n  The purpose of renting this house was to keep the victim there for the duration of the\n\n  kidnapping.5 On 26 August 1999, Vincent Lee proceeded to M/s National Automobile\n\n  Service at Block 5033 Ang Mo Kio Industrial Park 2 #01-279. There, he rented a Toyota\n\n  LiteAce Motor van, bearing registration number GQ 3466 Y (hereinafter \"the\n\n  vehicle\"). He paid for the rental of the vehicle using his Overseas Chinese Banking\n\n  Corporation Visa credit card.6 On the same day, Vincent Lee went to a shop in Ubi Industrial Estate.\n\n  There, he paid for a pair of false vehicle licence plates bearing number GQ 6292. Later\n\n  that day, Vincent Lee and 2ndAccused fixed the false licence plates on to the\n\n  vehicle.7 From 26 August 1999 till 8 September 1999, Vincent Lee, together with\n\n  1stand 2ndAccused, drove around Singapore looking for victims to\n\n  kidnap. The profile of their intended target was that of a young schoolgirl. They decided\n\n  to roam the Bukit Timah area as they felt that it was a \"rich man’s\" area.8 On 9 September 1999, the victim was walking alone along Sian Tuan\n\n  Avenue on her way home. Near the junction of Sian Tuan Avenue and Hua Guan Lane, the\n\n  vehicle was driven up to the victim. Vincent Lee was the driver of the vehicle. The 2ndAccused grabbed the victim and pulled her into the van while 1stAccused closed\n\n  the sliding door of the van. As Vincent Lee drove off, 1stand 2ndAccused blindfolded the victim and tied her up using adhesive tapes.9 Upon arriving at No. 43 Lorong Kismis, the victim was carried into\n\n  one of the bedrooms of the house by 2ndAccused. Vincent Lee and both the 1stand 2ndAccused then asked the victim questions pertaining to her family’s\n\n  wealth and background. They also obtained the victim’s father’s handphone and\n\n  residence telephone numbers from her.10 Shortly before 9.00 pm on 9 September 1999, the victim’s\n\n  father, Mr Yong Cher Keng, (hereinafter \"Mr Yong\") received a call on his\n\n  handphone from Vincent Lee who spoke in Mandarin. Vincent Lee informed Mr Yong that the\n\n  victim was in his hands and demanded a sum of $500,000 for the release of the victim if he\n\n  wanted to see the victim again. Vincent Lee then hung up the phone.11 About three minutes later, Mr Yong again received another call from\n\n  Vincent Lee on his handphone. This time, Vincent Lee asked him if he had any problem in\n\n  raising the said amount of $500,000. Mr Yong expressed his difficulty in raising the\n\n  money. Vincent Lee then informed Mr Yong that he would call him back about half an hour\n\n  later. Immediately after this call, Mr Yong called ‘999’ and reported the matter\n\n  to the police.12 From the time of the police report till the release of the victim\n\n  there were numerous calls made by Vincent Lee to Mr Yong. Mr Yong negotiated with Vincent\n\n  Lee for the ransom to be reduced and it was eventually agreed that the amount would be\n\n  $330,000. During three of the phone calls, Mr Yong was allowed to speak to the victim. One\n\n  of the instructions of Vincent Lee, the victim told Mr Yong that she was safe and that he\n\n  should not alert the Police and that he should get the ransom money ready. Vincent Lee\n\n  also told Mr Yong to put the ransom money in a bag for delivery. Mr Yong replied that he\n\n  had a black bag that he would use for the purpose.13 In the evening on 11 September 1999, Vincent Lee gave instructions\n\n  for Mr Yong to drive to Ponggol Marina Park to deliver the ransom money. Mr Yong complied,\n\n  bringing along with him a black bag containing $330,000. Thereafter, Mr Yong was told to\n\n  drive to Blk 127 Tampines St 11 where he was given further instructions on his handphone\n\n  by 2ndAccused as to where to drop off the money. The bag containing the money\n\n  was finally dropped off at the grass verge near the overhead bridge. There, the money was\n\n  collected by Vincent Lee and 2ndAccused. On the way back, they threw the bag\n\n  out of the car after transferring the money into another carrier. The 2ndAccused then alighted from the car somewhere at Hougang, taking along with him the ransom\n\n  money as Vincent Lee and the 2ndAccused felt that they were being followed.14 The 1stAccused remained with the victim in the house at\n\n  No. 43 Lorong Kismis when 2ndAccused went with Vincent Lee to collect the\n\n  ransom money. She was blindfolded throughout her stay at No. 43 Lorong Kismis for a period\n\n  of about 60 hours.15 On 12 September 1999 at about 7.40 am, the victim was released. She\n\n  managed to take a taxi and return home.16 The 2ndAccused who had all the ransom money with him\n\n  then went to stay at Blk 311 Hougang Avenue 5. The 1stAccused subsequently\n\n  went to join the 2ndAccused there. At the flat, the 1stAccused\n\n  took out a portion of the ransom money and placed it in his bag. Thereafter, the 1stAccused left the flat with the bag and went to stay with another Chinese national one\n\n  \"Wu Kang\". At \"Wu Kang\"’s flat, he placed his bag containing part\n\n  of the ransom money in a wardrobe. The bag and the money were subsequently stolen by\n\n  another Chinese national, one \"Wen Fu\" who was staying at the flat.\n\n  Investigations revealed that \"Wen Fu\" handed a sum of $5,000 to one Lin Shi Jian\n\n  and asked him to have it remitted to China. Lin Shi Jian left the money with Yu Chuan Wen\n\n  for safekeeping. This sum of $5,000 was recovered by the Police from Yu Chuan Wen.17 Investigations revealed that 2ndAccused disposed of the\n\n  remaining money as follows:a. The 2ndAccused entrusted a black sports bag containing a\n\n    sum of $134,500 to one Chen Chan Seng for safekeeping. The bag and the money were\n\n    retrieved when the Police arrested Chen Chan Seng;b. The 2ndAccused requested Chen Chan Seng to remit another\n\n    sum of $60,000 to his family in China through one Lin Yong Jian. This amount was\n\n    subsequently recovered from the DBS account of Lin Yong Jian who was in the process of\n\n    remitting the money to China.c. The 2ndAccused also handed a sum of $1500 to one Weng Wu\n\n    Kun in repayment of a loan. However, only a sum of $200 was recovered from Weng Wu Kun as\n\n    the latter had handed a sum of $1000 to his uncle Weng Bao Fa for remission to China, and\n\n    had spent the rest of the money.d. The sum of $1400 was recovered from Weng Bao Fa. Investigations\n\n    revealed that $1000 was from Weng Wu Kun and $400 comprised marked notes which formed part\n\n    of the ransom monies taken by \"Wen Fu\".18 At about 8.00 am, upon confirming that the victim had already been\n\n  safely released, the police arrested Vincent Lee at his residence at Blk 552 Pasir Ris St\n\n  52 #10-87. On 14 September 1999 at about 12.35 am, the 1stand 2ndAccused were arrested at a HDB flat in Telok Blangah Crescent. A sum of $13,300, which was\n\n  part of the ransom, was recovered from them.19 To date, a total of $214,400 has been recovered by the Police.\"SUBMISSIONS ON SENTENCE(1) The Prosecution5 The Prosecution informed me the two Accused persons had no known\n\ncriminal history.6 The Prosecution also referred me to the decision of the Court of\n\nCriminal Appeal inSia Ah Kew & Others v PP[1972-1974] SLR 208and submitted\n\nthat there should be a strong incentive for kidnappers to refrain from harming or\n\nmolesting hostages or otherwise behaving cruelly towards them and that caning should be\n\nimposed where there was some harm. The Prosecution conceded that the two Accused persons\n\nhere had treated the hostage quite kindly and that she was not molested or hurt.\n\nAccordingly, the Prosecution submitted that caning was not necessary. In addition, the\n\nmastermind, Vincent Lee, was not sentenced to caning as well.",
        "(2) Zhou Jian Guang": "7 For Zhou Jian Guang, Mr Sng informed me that he was from a poor\n\nfarming family in the province of Fukien, China. He wanted very much to build a new house\n\nfor his parents, his wife and a 5-year old son and came to Singapore hoping to achieve\n\nthis objective.8 His work at construction sites was irregular but he remitted money\n\nevery month back home to repay the loan taken out to finance his passage here. It was when\n\nhe was out of work in July 1999 that he and the other Accused happened to meet Vincent Lee\n\nat a coffeeshop where both of them approached him for job openings.9 Sometime in August 1999, Vincent Lee hatched the kidnapping scheme\n\noriginally targetted at another girl as hostage. Both Accused persons decided to go along\n\nwith Vincent Lee’s plans as he had been providing them with food, cigarettes and\n\nloans. Vincent Lee was also potraying himself as someone not to be disobeyed.10 I was urged to take into consideration the following mitigation\n\nfactors:(1) The plea of guilt;(2) His previous clean record;(3) The absence of physical injury and ill-treatment on the victim and\n\n  the fact that her welfare was looked after;(4) The absence of threats by this Accused;(5) His removal of the tapes used to tie the victim’s hands and\n\n  his subsequent release of the victim on his own volition;(6) The absence of any weapons;(7) The fact that Vincent Lee devised the whole scheme;(8) The fact that this Accused had used only $150 to $200 at the end of\n\n  the day;(9) The need for consistency in sentencing all the co-Accused persons\n\n  in this matter.(3) Shi Song Jing11 This Accused came here from China in February 1997 lured by promises\n\nof abundant well-paid jobs in the construction industry only to be abandoned by the agent\n\nonce he arrived. He had to fend for himself for the first six months until he found a job\n\nas a plasterer.12 As an overstayer, he had reluctantly agreed to participate in the\n\nscheme because of the overbearing Vincent Lee and also because the mastermind provided\n\nfree meals and cigarettes.13 I was urged to bear in mind the following factors:(1) He pleaded guilty;(2) He was completely remorseful and wished to apologise to the victim\n\n  and her family;(3) He had no previous criminal record;(4) He did not profit from the crime and had assisted the police in\n\n  recovering the loot;(5) The victim was unharmed, was actually consoled and cheered by him\n\n  constantly and she was allowed to talk to her father three times over the telephone;(6) He removed the adhesive tape from the victim’s mouth because\n\n  he felt sorry for her;(7) The one who did all the planning and demanding of the ransom was\n\n  Vincent Lee;(8) He was nave and stupid (instead of being a hardcore criminal);(9) He should not be sentenced more harshly than Vincent Lee.THE DECISION OF THE COURT14 I made the following remarks at the conclusion of the trial:\"1 No person anywhere should be subject to the agony, the anguish\n\n  and the anxiety that both of you, together with Vincent Lee Chuan Leong, have inflicted on\n\n  the victim, not least a 14-year old girl. One can easily emphatize with what this young\n\n  female student must have felt during those dark 60 hours in September last year, not\n\n  knowing where she was, what manner of persons were holding her in captivity and what\n\n  horrible plans they might have in store for her. She was completely at the mercy of the\n\n  three of you and could never be certain that the ransom money was all that you wanted.2 She was not your only victim during those painful 60 hours. In every\n\n  kidnap, there is at least one other person who suffers – the person from whom the\n\n  ransom is demanded, who is willing to pay any price but may not be able to and often has\n\n  to scramble frantically to muster the funds within a very short span of time. The three of\n\n  you must have caused sleepless nights to the parents and family of this young female\n\n  hostage. Although you may not have known it then, you have made her father’s birthday\n\n  a very memorable one for all the wrong reasons.3 The then Court of Criminal Appeal inSia Ah Kew & Others v PP[1972-1974] SLR 208has said that it is a long and well established principle of\n\n  sentencing that the legislature in fixing the maximum penalty for a criminal offence\n\n  intends it only for the worst cases. The Court there also noted that the sentencing\n\n  discretion given in cases of kidnapping for ransom was very limited in scope and said:\"In our opinion, the maximum sentence prescribed by the\n\n  legislature would be appropriate where the manner of the kidnapping or the acts or conduct\n\n  of the kidnappers are such as to outrage the feelings of the community.\"The Court also held that it was wrong to impose the alternative\n\n  sentence of life imprisonment only when there were some very exceptional circumstances\n\n  which did not justify the imposition of the death sentence. After noting that this type of\n\n  crime was neither rampant nor on the increase in Singapore between 1970 and 1973 and after\n\n  having regard to the fact that two of the five appellants in that case were armed with\n\n  pistols and one with a dagger, the Court there set aside the sentences of death and\n\n  substituted therefor sentences of life imprisonment with caning ranging from six to 12\n\n  strokes.4 In your case, it is to your credit that the victim was not hurt\n\n  physically and that there is no indication that weapons were used. That is of immensely\n\n  greater importance than the fact that some two thirds of the ransom money have been\n\n  recovered. You say that the victim’s welfare was looked after – I am not sure\n\n  being bundled into a van, having one’s limbs and lips bound with adhesive tapes, and\n\n  then spending 60 hours in total darkness and fear merit such a description. This offence\n\n  has certainly not been rampant for the past decade – in fact it was practically\n\n  non-existent – but I am confident that our society does not feel nostalgic about it.5 Due to the turn of events in Court, the acknowledged directing mind\n\n  of this episode, Vincent Lee, pleaded guilty two days before the two of you did. He was\n\n  sentenced to life imprisonment with no caning imposed. As noted inSia Ah Kew’s\n\n  case, there are only three sentencing options for this type of offence and Vincent\n\n  Lee’s sentence is the most lenient permissible in law.6 There is another principle of sentencing which dictates that there\n\n  should be parity of sentences for accomplices unless there are some material\n\n  distinguishing features in the roles that they played in the offence or in their personal\n\n  circumstances. In your case, no such distinguishing feature has been brought to my\n\n  attention as to justify a heavier penalty for the two of you in comparison with Vincent\n\n  Lee. The death penalty is undoubtedly inappropriate in your case. To order caning would be\n\n  to impose a harsher punishment on the two of you than that meted out to the originator of,\n\n  and the main player in, this whole scheme. The only appropriate sentence for both of you\n\n  is therefore one of life imprisonment, deemed to have commenced from the date of your\n\n  arrest, 14 September 1999, and I so sentence both of you.7 I thank Mr Francis Tseng and his team of DPPs and the Defence teams\n\n  led by Mr Sng Kheng Huat and Mr Leo Cheng Suan for their efforts in bringing this episode\n\n  to a swift conclusion. In addition, I must congratulate the team of investigators led so\n\n  ably by ASP Richard Lim Beng Gee for their remarkable speed and admirable professionalism\n\n  in apprehending all the offenders within 41 hours or so after confirmation of the safe\n\n  return of the victim.8 Finally, for Sandi Yong and her family, we wish you all well and hope\n\n  that the emotional wounds you have suffered will begin to heal from this day forth.\"15 Upon the application of the Prosecution, I ordered that the $214,400\n\nrecovered by the police be returned to the victim’s father and that there be a\n\ndisposal inquiry in the Subordinate Courts in respect of the vehicle (SBQ 7935 T) used to\n\ncollect the ransom money.TAY YONG KWANGJUDICIAL COMMISSIONERSUPREME COURTCopyright © Government of Singapore."
    }
}