{
    "case_title": "Chng Gim Huat v Public Prosecutor",
    "ncitation": "[2000] SGHC 127",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The agreed facts": "An agreed statement of facts was tendered at the commencement of the trial. It was undisputed that the appellant extended an interest-free loan of $6.3m, repayable on demand, to one Ong Kah Chye (`Ong`) via a loan agreement dated 28 June 1990. This was intended to be a bridging loan to be set-off subsequently by Ong selling 5.6m shares in Alliance Securities Pte Ltd (`ASPL`) worth $6.3m to CGH Land Pte Ltd, which was owned by the appellant and two of his sons. The sale was ultimately unsuccessful as CGH Land Pte Ltd withdrew its application to purchase the shares in October 1990. The appellant then sought repayment of the loan.On 1 October 1992, the appellant received $500,000 from Ong by way of two separate account payee cheques for the sums of $400,000 and $100,000 respectively. They were accompanied by a covering letter dated 1 October 1992 stating that the cheques were for partial repayment of the loan, reducing the outstanding loan amount to $5.8m.In the first half of 1994, after the distribution of dividends by ASPL, Ong made five separate payments totalling $290,000 to the appellant. Ong issued five cash cheques (for the sums of $60,000, $20,000, $110,000, $20,000 and $80,000 respectively) on various dates in April and May 1994. He then caused these cheques to be encashed and handed the cash to the appellant through the latter`s son Chng Beng Siong (`Chng`).In April 1995, after the distribution of dividends by ASPL, Ong made six separate payments totalling $1.064m to the appellant. He issued six cash cheques (for the sums of $250,000, $250,000, $200,000, $200,000, $100,000 and $64,000 respectively) on various dates in April 1995. The cheques were given to Chng to be encashed and, in turn, for the cash to be handed to the appellant.In 1996, the appellant received two payments of $200,000 each by way of cashier`s orders made payable to him. Both payments were accompanied by a covering letter dated 9 July 1996 and 22 August 1996 respectively. The appellant acknowledged receipt of the second cashier`s order. In 1999, Ong made a further payment of $5.4m to the appellant by way of a transfer of funds into Chng`s bank account.It was not disputed that the sums of $290,000 and $1.024m were omitted from the appellant`s tax return forms for the assessment years 1995 and 1996.",
        "The prosecution`s case": "The prosecution`s case essentially hinged on Ong`s evidence. In court, Ong testified that he proposed to compensate the appellant with interest after the latter complained about his interest costs and opportunity costs. The appellant was agreeable to this proposal. According to Ong, this took place during informal discussions prior to the declaration of dividends by ASPL in the first half of 1994 and 1995.Ong testified that he proposed paying interest at a rate of 5% pa but the appellant did not confirm this rate as he did not know his borrowing costs. Ong`s understanding was that the appellant would only confirm the interest costs at a later stage. Ong testified that he did not discuss the 1994 and 1995 payments with the appellant and did not specifically inform him that they were interest payments. He had assumed that the appellant would understand their purpose on the basis of their previous discussions. Furthermore, he wanted to retain the option of treating the payments as capital repayments in the future. Ong testified that the sum of $1.064m paid in 1995 included a sum of $40,000 as reimbursement to the appellant for banking charges incurred by the latter in obtaining the loan.In the course of the trial, the prosecution applied for and was granted leave to cross-examine and impeach Ong on his previous statements in writing pursuant to ss 147(1) and 157(c) Evidence Act (Cap 97) on the basis of the material discrepancies between his oral testimony and his previous statements to IRAS recorded on 14 February 1998 and 20 August 1998. Pursuant to the application, the statements were also admitted into evidence under s 147(3) Evidence Act.The prosecution relied principally on these statements to prove that the appellant knew of the nature of the 1994 and 1995 payments and had wilfully omitted these interest income from his tax returns. Ong did not dispute that he made both statements nor their voluntariness. The relevant portions are set out below:Statement recorded 14 February 1998 - exh P244 Sometime in the first quarter of 1994, Alliance declared a 10% dividend, Chng learned of the dividend payment, and again he brought up the issue of loan repayment and the interest expenses suffered. Under pressure, and since I benefited from the dividend income from the investment funded by him, I proposed to pay him $290,000 to compensate his interest expenses. This amount of $290,000 is based on 5% pa on the sum o/standing of $5.8m. Chng accepted my proposal, but commented that he did not know the cost of funding. Chng asked for cash cheques and I did not query him. I gave him the following cash cheques from my account with Maybank....5 Similarly, when Alliance declared a 20% dividend on 1.4.95, Chng again brought up the issue of loan repayment and the interest expenses he suffered. He ever brought up the similar issues there and then. I proposed to pay him $1,024,000 interest as per working in App A. After enjoying two years` earnings, I tried my best to sweeten the compensation of Mr Chng`s interest lost in my mind. I was prepared to spend my dividend income. Again, Mr Chng commented that he did not know the cost of fundings but accepted my proposal. Chng asked for cash  cheques and I did not query him. I gave him the following cash cheques from my account with Keppel Bank.Statement recorded 20 August 1998 - exh P253 I re-confirm that when the payment of $290,000 in 4/94 and 5/94 and $1,064,000 in 4/95 was made to Chng Gim Huat, I made it very clear that the payments were for interest calculated at 5% p.a. In actual fact, Chng always asked me to compensation for the cost of funds. I further confirm that the word `intention` as stated in App C refer to interest rate of 5%. The letter was requested by Chng so that he could make his tax declaration.The IRAS investigating officer, Toh Kiau Kee, explained that the 1994 interest payment of $290,000 was computed at the rate of 5% on the outstanding capital sum of $5.8m for one year (ie 1994) while the 1995 payment of $1.024m represented the balance of the accumulated interest on the loan of $6.3m for the period between 1 July 1990 and 1 July 1994, calculated at 5% pa on a compound rate basis. These figures corresponded with Ong`s calculations contained in App A of exh P24, entitled `Interest to Chng Gim Huat (estimate)` which he had earlier submitted to the SES. The investigating officer confirmed that the interest should have been included in the tax returns for the years of assessment 1995 and 1996 respectively. The additional taxes which would have been payable for the years of assessment 1995 and 1996 were $78,174.39 and $276,471.26 respectively amounting to a total of $354,645.65.",
        "The defence case": "The appellant contended that the 1994 and 1995 payments were capital repayments and that he was not aware that they were `interest payments` at the material time. It was only in 1997 that an agreement was reached between Ong and himself to treat them as interest payments. He denied having wilfully omitted the interest payments from the tax returns with an intention to evade tax.The appellant testified that he first started complaining about his loss of interest and opportunity costs in late 1994 when his various attempts to purchase the ASPL shares failed. Following the complaints, Ong only informed the appellant that he would compensate the latter at the appropriate time. They did not have any detailed discussion on the question of interest payments in late 1994 or 1995. He testified that it was his understanding that Ong would compensate him with interest after full repayment of the loan was made.Concerning the 1994 payments, the appellant testified that prior to ASPL`s dividends declaration in April 1994, Ong offered to make repayment of the loan but did not confirm the amount to be paid. The appellant asked for the first repayment ($60,000) to be made in cash as he was then in need of it. Thereafter, there was no contact between them regarding the subsequent cash payments in 1994 and 1995. The appellant viewed these payments, which were not accompanied by any covering letters, as capital repayments. On 1 April 1996, the appellant wrote to Ong requesting repayment of the outstanding loan. This resulted in the 1996 repayment of $400,000.The appellant testified that in March 1997, Ong informed him that he had mistakenly reported the 1994 and 1995 payments to the Stock Exchange of Singapore (`SES`) as interest payments in 1996. The appellant expressed his unhappiness and requested a letter from Ong for the purpose of submitting tax returns to IRAS. Ong duly provided the letter dated 17 March 1997 which recorded a retrospective agreement to treat the 1994 and 1995 payments as interest (exh D12). The annexure to exh D12 entitled `Interest Payment to CGH`, prepared by Ong, contained the interest calculations which corresponded to the calculations done by the investigating officer and the figures contained in App A to exh P24. The appellant only knew of the period and rate of interest when he saw the annexure to exh D12.The appellant informed IRAS of the interest income via a letter dated 14 April 1997 for the years of assessment 1991 to 1995 and subsequently paid additional taxes amounting to $394,799.20.The appellant`s son, Chng, testified on his behalf. He was aware of the $6.3m loan extended to Ong and the collateral agreement for the purchase of ASPL shares. He testified that the appellant started to press Ong for repayment in 1991. Subsequently, the appellant complained to Ong about his high cost of fundings and his opportunity costs. However he denied that Ong made any proposals to compensate the appellant`s interest costs in his presence. He confirmed that Ong gave him cash amounting to $290,000 in 1994 and cash cheques amounting to $1.064m in 1995. However he was not told of the purpose of those payments at the material time.",
        "The decision below": "The appellant did not make any submission of no case to answer at the close of the prosecution`s case. The magistrate reviewed the evidence and held that there was a prima facie case based on Ong`s statements as well as other undisputed evidence and called the appellant to enter upon his defence.The magistrate found that there were material contradictions between Ong`s oral evidence and his previous statements to IRAS (exhs P24 and P25) and granted leave to the prosecution to impeach his credit and to admit the statements into evidence pursuant s 147(3) Evidence Act. The magistrate ultimately rejected Ong`s explanations for the discrepancies and ruled that his credit had been successfully impeached. Having considered the relevant factors, the magistrate was satisfied that Ong`s previous statements in writing contained the truth and accepted them over Ong`s oral testimony.At the close of the trial, the magistrate found that the issue of repayment of the loan was first discussed in 1991 and not in late 1994 She found that prior to the 1994 payments, the appellant had expressed frustration and concern over the non-repayment of the loan and had complained about his opportunity costs and interest costs. In her view, these complaints were intended to induce Ong to offer some form of compensation in view of the length of time for which the loan had been outstanding.The magistrate rejected the appellant`s contention that the payments were capital loan repayments. In light of the totality of the evidence and the conduct of the appellant, the magistrate found that the appellant knew that the 1994 and 1995 payments were interest payments and that he had wilfully omitted them from his tax returns with intent to evade tax. She also found that the actions of the appellant showed that he did not want the payments to be traced back to him.The magistrate concluded that the prosecution had proven both charges beyond reasonable doubt and convicted the appellant accordingly.",
        "The appeals against conviction": "The appellant raised four main issues in this appeal. First, the appellant contended that the payments in question did not amount to `interest income` within the meaning of the Income Tax Act (Cap 134) but were compensation for the cost of funds incurred by the appellant in funding the loan. The appellant also contended that the magistrate erred in ruling that Ong had materially contradicted his two statements to IRAS (exhs P24 and P25) such that his credit was thereby impeached. Related to this, it was submitted that the magistrate erred in solely relying on Ong`s previous statements in writing without giving adequate consideration to their true effect and meaning. Finally, the appellant submitted that the magistrate erred in finding that the appellant knew that the payments were interest payments at the material times and had wilfully omitted them from the tax returns with the intent to evade tax.",
        "Whether the payments amounted to `interest income`": "Before me, the appellant contended that the payments did not amount to `interest income` within the charging provision of s 10(1) Income Tax Act. The appellant testified that he took a bank loan for the sum of $6.3m through his companies and incurred the attendant interest charges. The 1994 and 1995 payments were intended to compensate the appellant for his cost of funds incurred and not intended as interest payments. This novel argument, which rested on a fine distinction between compensation for the deprivation of the principal and compensation for the interest incurred on the principal, was not raised in the court below (the appellant was then represented by a different counsel).Section 10(1) Income Tax Act states:Income tax shall, subject to the provisions of this Act, be payable at the rate or rates specified hereinafter for each year of assessment upon the income of any person accruing in or derived from Singapore ... in respect of -...(d) dividends, interest or discounts;...The Act itself does not contain a definition of the term `interest` which has been defined in theOxford English Dictionary, Vol VII (2nd Ed, 1989) at p 1099 as:money paid for the use of money lend (the principal), or for forbearance of a debt, according to a fixed ratio.`Interest` has also been described as `the return or compensation for the use or retention by one person of a sum of money belonging to or owed to another`: 32Halsbury`s Laws of England(4th Ed Reissue) para 106 and as `compensation for the delay in payment`: per Farrell J inBond v Barrow Haematite Steel Co[1902] 1 Ch 353at p 363. The Scottish Lord President Lord Strathclyde inSchulze v Benstead1916 SC 188 at p 191 approved what I consider to be a useful working definition which has been cited in theSingapore Master Tax Guide 1998(17th Ed) at [para ] 893:Interest signifies a sum payable in respect of the use of another sum of money, called the principal.It is also often described as a compensation for delayed payment. There is no definition of the word `interest` in theIncome Tax Act. A good working definition, for tax purposes, was given inSchulze v Bensted (Surveyor of Taxes)[1915] 7 TC 30as `a creditor`s share of the profit which the borrower or the debtor is presumed to make from the use of the money.Otherwise stated, it is just recompense to the creditor for being deprived of the use of his money. [Emphasis added.]The appellant referred me to the case ofRiches v Westminister Bank Ltd[1947]  AC 390where the House of Lords had to decide whether interest which had been awarded in proceedings for the recovery of debt, and included in the total sum for which judgment was given, was interest within the meaning of the Income Tax Act 1918. In an illuminating passage, Lord Wright stated at p 400:The essence of interest is that it is a payment which becomes due because that creditor has not had his money at the due date. It may be regarded as representing the profit he might have made if he had had use of the money, or, conversely,the loss he suffered because he had not that use. The general idea is that he is entitled to compensation for the deprivation. From that point of view it would seem immaterial whether the money was due to him under a contract express or implied or a statute or whether the money was due for any other reason in law. In either casethe money was due to him and was not paid, or in other words was withheld from him by the debtor after the time when payment should have been made, in breach of his legal rights and interest was a compensation, whether the compensation was liquidated under an agreement or statute, ... or was unliquidated and claimable under the Act as in the present case. The essential quality of the claim for compensation is the same and the compensation is properly described as interest. [Emphasis added.]Applying the above test, their Lordships held that the interest awarded on the debt was interest within the meaning of the Income Tax Act and thus liable to tax.Apart from the above, the characteristics of an interest payment need to be considered as well. I would align myself with Rand J`s comments inReference Re Saskatchewan Farm Security Act 1944, Section 6[1947] 3 DLR 689at p 703:... the definition [of interest], as well as the obligation [to pay interest], assumes that interest is referable to a principal in money or an obligation to pay money. Without that relational structure in fact and whatever the basis of calculating or determining the amount, no obligation to pay money or property can be deemed an obligation to pay interest.This was a decision of the Canadian Supreme Court, which was subsequently affirmed by the Privy Council (see [1949] 2 DLR 145). There, the court examined certain provincial legislative measures in order to determine whether they infringed the exclusive legislative power of the Dominion in relation to interest. These measures sought to suspend principal repayments on mortgages and sale and purchase agreements in the event of crop failures without purporting to change the interest payable under those agreements. It was argued that the provisions were agricultural measures and did not relate to interest. Four out of the five Supreme Court judges, including Rand J, disagreed and held that the measures were ultra vires as the operation of the measures in substance, affected the interest payments by increasing the rate of interest payable on the reduced principal amount.Rand J`s dictum was cited and approved by Megarry J (as he then was) inRe Euro Hotel (Belgravia) Ltd[1975] 3 All ER 1075. There, the issue was whether certain sums payable under a sub-building agreement were interest within the terms of the Income and Corporation Taxes Act 1970. After reviewing the relevant case authorities, the learned judge suggested a two-stage test (at p 1084):It seems to me that running through the cases there is the concept that as a general rule two requirements must be satisfied for a payment to amount to interest, and a fortiori to amount to `interest in money`. First, there must be a sum of money by reference to which the payment which is said to be interest is to be ascertained. ... Secondly, those sums of money must be sums that are due to the person entitled to the alleged interest; ...Applying the two stage test, Megarry J held that the payments in question were not interest in money as the principal sum paid out by the creditor was not paid as a loan but as an outright payment to the company for developing the property as well as to give the creditor property rights in the property. Thus, the provision of `interest` payments by the company was `not compensation for delay in payment but for delay in performance of other obligations: and the payments were not payments by time for the use of money but payments by time for non-performance of those obligations` (at p 1085).The quality to be attributed to the sum in question is also significant. InRiches v Westminister Bank Ltdat p 403, Lord Wright noted the numerous decisions which have drawn a distinction between capital and income, and recognised that the `distinction depends on substance not on the mere name`. The DPP cited the case ofIRC v Church Commissioners for England[1975] 3 All ER 614(subsequently affirmed by the House of Lords [1976] 2 All ER 1037), where Stamp LJ, delivering the judgment of the Court of Appeal, stated (at p 619):... it is, we think, common ground, or if not it is established by authority, that in determining whether sums payable annually are to be regarded as wholly or partly income for the purposes of income taxone must ascertain the true legal nature of the transaction or agreement between the parties which is the source of the payments and not the labels which the parties put on the sums payable ... It is the true legal result of the transaction with which one is concerned and not its financial result. [Emphasis added.]The DPP also referred me to the case ofVestey v IRC[1962]  Ch 861. The case involved a sale and purchase agreement to sell shares, then worth Â£2m, for a sum of Â£5.5m payable in 125 interest free yearly instalments. Known to the purchasers, the instalment payments represented interest on the unpaid balance at 2% pa. Cross J (as he then was) upheld the Special Commissioners` decision to dissect each annual instalment into a capital and an interest element. In my view, this case was of limited assistance. Without applying any principle of law, the learned judge simply adopted a common sense approach on the basis that the facts clearly revealed an interest element. In fact, Cross J`s approach in analysing the previous authorities was expressly rejected by the Court of Appeal inIRC v Church Commissioners for England(at p 623).The following guiding principles can be distilled from the above authorities. First, the label attached to the payment is not conclusive of its true legal nature. Whether or not a particular payment constitutes `interest` depends on the substance of the transaction. Nomenclature does not alter the character of the payment if it is not in fact `interest` and vice versa. Secondly, the essence of `interest` is compensation for the deprivation for the use or delayed payment of money by another. Thirdly, there must be a principal sum of money by reference to which the interest payment is to be ascertained, which sum of money must be due to the person entitled to the interest.I now return to the facts, bearing in mind that the labels attached to the payments are not conclusive of their legal nature. Here, there was an ascertainable principal sum of $6.3m, later reduced to $5.8m in 1992, which was owing to the appellant. The testimonies of the investigating officer and Ong, as well as the calculations attached as App A to exh P24 and the annexure to exh D12, both prepared by Ong, showed that the 1994 and 1995 payments were calculated by reference to the principal sum of $6.3m. The two-stage minimum criteria laid down by Megarry J inRe Euro Hotel (Belgravia)was clearly met. The remaining task was to decipher the true nature of the payments and to ascertain whether they were compensation for the deprivation for the use or delayed payment of money.The appellant contended that Ong merely intended to reimburse the appellant`s interest expenses. I was unable to agree. The appellant`s defence at the trial was that the payments were capital repayments at the material times, not that they reimbursed or compensated his cost of funds. It was apparent from the appellant`s and Ong`s evidence that the concepts of cost of funds, compensation or interest were viewed interchangeably. I did not place too much weight on the expressions `compensation` or `reimbursement` which were merely polite and colloquial terms used by Ong in describing the payments.The evidence and statements must be viewed in totality. From the agreed statement of facts, the appellant sought repayment of the loan after the abortive attempt to purchase ASPL shares in 1990. Chng also testified that the appellant started to press Ong for repayment of the loan sometime in 1991. The covering letter dated 1 October 1992, which accompanied the capital repayment of $500,000 also referred to:... our numerous discussions on repayment of the above mentioned loan, as explained to you I am not able to raise adequate funds to perform. ...The magistrate accepted Ong`s evidence that, prior to the 1994 and 1995 payments, the appellant made frequent requests for repayment and complained about his lost opportunity costs, the lack of returns and the interest charges he incurred in financing the loan. It was clear that Ong was apologetic over the delayed repayment and felt that the appellant`s complaints were justified. As a result, he felt pressured and proposed to compensate the appellant. Ong had also informed the SES investigator in 1996 that the payments were `interests to compensate` the appellant and not mere reimbursements.It was clear to me that the 1994 and 1995 payments were intended to compensate the appellant for the delayed repayment of the debt. The payments might well have achieved the secondary purpose of off-setting the interest charges which the appellant incurred, but that did not alter the nature of those payments. It was useful to recall the appellant`s evidence that his interest charges were considerably lessened in 1994 as he had already discharged part of the loan through other means. In my view, the magistrate was quite right in viewing the appellant`s frequent complaints about his interests charges as a tactic to impress upon Ong the need to make efforts to repay the sum expeditiously as well as to offer him a `fair settlement`. It was against this factual matrix that the substance of the payments was to be determined.The appellant further argued that the payments were not intended to be profit nor accepted as profit for the loan given. I doubted if it was helpful to use the term `profit`. As stated by Stamp LJ inIRC v Church Commissioners of England, it was the true legal nature that was important and not the financial result. The payments were meant to compensate the appellant for the delayed repayment, regardless of whether they were sufficient to offset the actual interest charges incurred by the appellant.There was in my view, a more fundamental flaw in the appellant`s submission. There was no evidence pertaining to the appellant`s actual cost of borrowings nor any concrete evidence showing a link between the money borrowed and the interest income produced. The appellant had testified in a general manner as to the average prime rate and the overdraft interest rates in 1990 - 1994. He recalled that his companies were paying interest at a rate of between 6.5% - 8 % for the bank loans in 1994. Apart from bare assertions, there was no evidence of those loans nor the actual interest charges incurred. The absence of an evidential substratum upon which the appellant could mount his legal arguments was, in my view, fatal.I would add that, assuming evidence of the appellant`s cost of borrowings was adduced, he was not absolved from his obligation to declare the interest income to the IRAS. While it may be possible to offset the cost of borrowings as deductions under s 14(1)(a) Income Tax Act, this would not transform the nature of those payments into something outside the scope of the charging provision contained in s 10(1)(d) Income Tax Act.I was therefore unable to agree with the appellant`s contention that there was a legal distinction between `interest income` and `interest` which were intended to reimburse the lender`s interest charges. This submission obfuscates the nature of interest payments and is unsustainable was law. Indeed, it would be contrary to the intention of the legislature if individuals or corporations could circumvent the Act by simply framing interest income as compensation for the cost of funds. From the evidence, the 1994 and 1995 payments were clearly precipitated by Ong`s delay in repaying the loan and served to compensate the appellant for delayed repayment. That in my view, was the very essence of `interest`.",
        "Whether the magistrate was correct in holding that Ong`s credit had been impeached and in relying on exhs P24 and P25 over his oral testimony": "Role of appellate court as regards findings of factAs this ground relates to the magistrate`s findings regarding the credit and veracity of the witnesses, it is a convenient point to reiterate the principles guiding the appellate court`s role as regards findings of fact by a trial judge.It is trite law that an appellate court will not disturb findings of fact unless they are plainly wrong or clearly reached against the weight of evidence. It is not enough to show that the appellate court would have come to a different conclusion on the evidence from the court below, bearing in mind that the trial judge had the opportunity of observing the witnesses to assess their veracity and credibility:Tan Hung Yeoh v PP[1999] 3 SLR 93at [para ] 23-25,Ng Soo Hin v PP[1994] 1 SLR 105at p 118H,PP v Hla Win[1995] 2 SLR 424at p 436A. However, insofar as they involve inferences drawn from the surrounding circumstance, the appellate court is in as good a position as the trial judge to draw the appropriate inferences:Yap Giau Beng Terence v PP[1998] 3 SLR 656at [para ] 24.",
        "Whether Ong`s testimony had materially contradicted exhs P24 and P25 and whether his credit was impeached": "The impeachment of the credit of a witness is governed by s 157 Evidence Act which provides:The credit of a witness may be impeached in the following ways by the adverse party or, with the consent of the court, by the party who calls him:...(c) by proof of former statements inconsistent with any part of his evidence which is liable to be contradicted;...The purpose and accompanying circumstances of the payments went to the crux of the appellant`s knowledge of the nature of those payments and his intention. Ong`s oral testimony sought to show that there was no clear understanding or agreement that the 1994 and 1995 payments were interests payments. In court, Ong testified that:a he did not meet the appellant after the declaration of dividends in 1994 and 1995;b the appellant did not expressly accept his proposal to compensate the appellant with interest at 5% pa;c he did not inform the appellant of the sums of money which he proposed to pay in 1994 and 1995;d he did not confirm the nature of the 1994 and 1995 payments with the appellant, that is, whether they were interest or capital repayments as he wanted to leave open the option to treat them as capital repayments; ande he could not recall whether the appellant had asked for the 1994 payments to be in cash and that it was Chng who had asked for cash cheques in 1995.This evidence contrasted with exhs P24 and P25 which stated that the question of interest payments was discussed by Ong and the appellant after the declaration of dividends in 1994 and 1995. The statements showed that Ong proposed to compensate the appellant by paying him $290,000 and $1.024m in 1994 and 1995 respectively, which sums represented interest payments calculated at 5% pa. The proposal was accepted by the latter on both occasions. In addition, the appellant asked for cash cheques on both occasions.Both versions conflicted materially with each other and called for a satisfactory explanation. The magistrate did not, as submitted by the appellant, close her mind to the possibility that Ong could have been genuinely mistaken when he made those statements. A review of the grounds of decision showed that the magistrate was fully cognizant of Ong`s various explanations, including his claim that the statements contained mistakes which he subsequently discovered and sought to clarify in his oral testimony. Ong`s various explanations for the inconsistencies were canvassed and tested against other aspects of his testimony, the undisputed facts as well as other independent evidence. She ultimately rejected Ong`s explanations as being `incredible`, `unconvincing`, `implausible`, `merely fabrications in an attempt to assist the defence`, `unbelievable` and `an afterthought`. The appellant was unable to persuade me that there were grounds to disturb these findings of fact.In particular, I fully shared the magistrate`s assessment that Ong must have discussed the question of compensation, the rate of interest payable and the exact amount to be paid as interest after the declaration of dividends in 1994 and 1995. This followed from Ong`s sincere intention to compensate the appellant with interest. Further, Ong would only have known whether he had sufficient cashflow to pay the appellant after dividends were declared. Viewed in that light, Ong could not have left the matter vague and ambiguous so that he could have the option of treating those sums as repayments. This also explained Ong`s later notification to SES that the 1996 sums were interest payments.There were other factors which cast doubt on Ong`s explanations. Ong was aware of the seriousness of the matter by the time the statements were recorded in February and August 1998 as related SES examination and IRAS queries took place in 1996 and 1997. He had more than enough opportunities to recall the pertinent discussions and to ensure that an accurate version was conveyed to the authorities by the time he gave the statements. Ong`s claim that his recollection  became more accurate was implausible in the absence of any reason explaining the dramatic improvement in his memory during the trial, more than a year later.Ong claimed that the statements were inaccurate and misleading due to incorrect and careless sentence structure:this is definitely a wrong structure when I put it together in thismannerthis statement is trying to squeeze in too many things together until it is misleadingHe added that he had merely copied the format and sentence structure of para 4 which described the 1994 payments into para 5 of exh P24 which dealt with the 1995 payments.This claim bore closer examination. Both statements were personally constructed and hand-written by Ong and contained information which was wholly within his knowledge. Exhibit P24 (recorded in Feb 1998) consisted of nine paragraphs totalling five pages recorded over three and a half hours, which was a reasonable amount of time considering the length of the statement, and it was amended by Ong before he signed and confirmed it. The contents were subsequently reaffirmed in a further statement recorded in August 1998 (exh P25). Despite this further opportunity to reflect upon the relevant events, Ong did not detect any inaccuracies and did not amend his earlier statement exh P24, even though the material discrepancies would have been immediately obvious from a plain reading of exh P24. Paragraphs 4 and 5 of exh P24 had been set out above. They reflected a clear and concise sentence structure and did not support Ong`s claims that the discrepancies were due to poor structure or that para 5 was simply copied from para 4.Ong was particularly evasive in explaining the origins of the cash payments and the cash cheques and gave vague and vacillating evidence when confronted exh P24:Court:Did Mr Chng ask for cash payments to be made in 1994?A:I`m not able to answer this question because I can`t recall what happened.Q:Why then did you state in your statement, that Chng asked for cash cheques?A:As I explained earlier, it is not my practice to issue cash cheques of large amounts until it is instructed by the payee. I`m not now denying the sentence. I cannot remember how this instruction had taken place.Court:Were such instructions given?A:Can`t recall exactly. I assume that there were such instructions....Put:It was Chng Gim Huat who told you to make payments of cash or by cash cheques in 1994 and 1995.A:In my statement, I stated that for 1994, Chng Gim Huat asked for cash cheques and I did not query him. I did not make any changes or clarifications for 1994. I`m only clarifying for 1995, the person I spoke to was Chng Beng Siong.Court:Is it your evidence in Court now that it was Mr Chng Gim Huat who asked for cash cheques in 1993 but Mr Chng Beng Siong who asked for cash cheques in 1995?A:Yes.In his testimony in court, Ong claimed that it was Chng and not the appellant, who requested for cash cheques in 1995. I agreed with the magistrate in rejecting his explanations for the discrepancy. Ong did not furnish a believable reason for his failure to explicitly mention Chng`s role in exh P24. His claim that one Kang Seow Kiam (`Kang`) reminded him of this matter in June/July 1999 was also implausible. This matter was completely unrelated to Kang. It was thus most improbable that Kang would recall this detail some four years after the events of 1995.Having reviewed Ong`s explanations in the light of all the evidence and surrounding circumstances, I found no reason to impugn the magistrate`s ruling that Ong`s credit had been successfully impeached",
        "Exhibits P24 and P25 as evidence of facts stated": "I explained inKwang Boon Keong Peter v PP[1998] 2 SLR 592at [para ] 24, that `[t]he successful impeachment of a witness`s credit under s 157 Evidence Act only goes to the weight of his oral testimony in court and not to its admissibility. It does not mean that the whole of his oral testimony will be expunged.` A trial judge is entitled to disregard the whole of the witness`s testimony, applying the settled principles of impeachment, but it is necessary to bear in mind my cautionary note inGarmaz s/o Pakhar & Anor v PP[1995] 3 SLR at pp 711I-712B:... The mere fact that his credit had been impeached did not necessarily mean that all his evidence would be disregarded. The court would still have to scrutinise the whole of the evidence to determine what was true and which aspects should be disregarded. These principles were stated inPP v Somwang Phattanasaeng, at p 148. The Court of Appeal dismissed the appeal, no arguments on these principles having been raised (Somwang Phattanasaeng v PP).It is apparent then, that it is well within the province of a trial judge to decide which aspects of the evidence merited consideration, having regard to the entirety of the witness`s testimony, and also, where appropriate, to the case sought to be presented by the party which called him to give evidence.In addition to the impeachment of Ong`s credit, the former inconsistent statement became admissible as evidence of any fact stated therein by virtue of s 147(3) Evidence Act:PP v Sng Siew Ngoh[1996] 1 SLR 143at pp 149-150,Chai Chien Wei Kelvin v PP[1999] 1 SLR 25at [para ] 55. The appellant however, contended that the magistrate erred in relying solely on exhs P24 and P25 and completely rejecting Ong`s oral testimony.Section 147(6) Evidence Act directs the court as follows:In estimating the weight, if any, to be attached to a statement admissible in evidence by virtue of this section, regard shall be had to all the circumstances from which any inference can reasonably be drawn as to the accuracy or otherwise of the statement and, in particular, to the question whether or not the statement was made contemporaneously  with the occurrence or existence of the facts stated, and to the question whether or not the maker of the statement had any incentive to conceal or misrepresent the facts.InPP v Tan Kim Seng Construction Pte Ltd[1997] 3 SLR 158at [para ] 27-32, I endeavoured to give some guidance on the application of this provision. The Court of Appeal subsequently cited and approved this decision inChai Chien Wei Kelvin v PP[1999] 1 SLR 25, holding that (at [para ] 56):... First, the contemporaneity of a statement with the occurrence or existence of the facts stated is important for it guards against inaccuracy, though the degree of contemporaneity required will vary with the facts in question. The recollection of the details of particular events, particularly where these occur quickly, is easily susceptible to error with time but the recollection of the existence of a relationship is not so malleable. Second there can be little guidance on the possibility of misrepresentation by the maker of the statement but the court must be astute in spotting such instances. Third, in addition to the above matters, the weight to be accorded to a prior inconsistent statement will be affected materially by an explanation of the inconsistency and why that statement is an inaccurate representation of the facts. Fourth, regard should be had to the context of the statement. Subsection (6) does not restrict consideration to only the making of the statement but requires consideration of all circumstances affecting its accuracy. Thus the court must consider the context of the inconsistent portions, which requires that the whole of the statement be examined. Reliance cannot be placed on a portion of the statement that is taken out of context. Finally the cogency and coherence of the facts relied upon has to be noted. An ambivalent statement does not attract much weight.It was evident from the grounds of decision that the magistrate had correctly considered the factors elucidated inChai Chien Wei Kelvin v PP. She did not reject Ong`s oral testimony in total, nor did she reject Ong`s testimony simply on the basis that his credit had been impeached. The magistrate noted that Ong had provided two sources of evidence and went on to test the statements in light of the other evidence, including evidence adduced by the appellant. She was ultimately satisfied that Ong`s previous statements contained the truth and accepted it over his oral testimony.",
        "Weight to be accorded to exhs P24 and P25": "Exhibits P24 and P25 were recorded in February 1998 and August 1998. They were closer in time to the material events than the trial which took place in August and September 1999. By sheer force of logic, the statements ought to be accorded more weight although due circumspection had to be exercised in view of the lapse of time since the material events in question.It was not the mere incidental details of particular events which were disputed. The crux of the matter concerned Ong`s proposal to compensate the appellant with interest at 5% pa and the amounts in question, the appellant`s acceptance of the proposal and his request for the payments to be made in cash cheques. These were material agreements and understandings which impacted on and in a sense, directed Ong`s subsequent conduct and were not easily susceptible to error with the passage of time.What was susceptible to error was the chronology of events, for example, when Ong proposed to compensate the appellant and when the appellant accepted  this proposal. This was not lost on the magistrate who found that the events which unfolded were consistent with and corroborated the chronology contained in exh P24. The appellant failed to persuade me that the magistrate`s findings should be faulted.There was no suggestion that Ong had any reason to conceal or misrepresent the facts. In reality, there was an active disincentive to do so as there was a SES examination into the affairs of ASPL in 1996 and a subsequent IRAS inquiry on Ong`s interest income in March 1997. It was also undisputed that Ong and the appellant enjoyed a cordial and friendly relationship as well as a long-standing business relationship.I had earlier addressed the explanations for the inconsistencies and inaccuracies in the statements. As I indicated above, exhs P24 and P25 were clear and concise. There was in my view, no ambiguity in their contents and no reason to disturb the weight accorded to exhs P24 and P25 by the magistrate.",
        "Impact of exh D12": "In assessing the weight to be attached to exhs P24 and P25, the magistrate considered the impact of exh D12, dated 17 March 1997. The appellant relied heavily on exh D12 to show that Ong and the appellant only reached an agreement in 1997 to treat the 1994 and 1995 payments as interest payments.The investigating officer confirmed that exh D12 was shown to Ong at the time the statements were made. Paragraph 3 of exh P25 also referred to such a letter. Despite this, Ong furnished a version in exh P24 which incriminated the appellant. In exh P25, Ong again confirmed that when the 1994 and 1995 payments were made, the appellant was informed that they were interest sums. Having regard to all the circumstances, including the fact that this was now a criminal investigation, I agreed with the magistrate`s assessment that exh P24 contained the truth.The magistrate could not be faulted for declining to place any weight on exh D12 in light of its origins. Ong testified that sometime in March 1997, he told the appellant that in 1996, he informed the SES that the 1994 and 1995 payments were interest payments. He also told the appellant that it had triggered an IRAS enquiry on him. The appellant became upset and asked Ong to prepare exh D12 so that he could proceed with his own tax declaration. Ong however, could not satisfactorily explain his failure to inform the appellant of this important matter in 1996. He merely asserted that it was due to an oversight. This explanation was rightly rejected. In my view, it was the appellant`s realisation that the IRAS would eventually discover his failure to declare the interest income that caused him to procure exh D12.On the other hand, the appellant claimed that in 1997, Ong explained that he had mistakenly declared the 1994 and 1995 payments as `interest payments` during the SES examination and sought the appellant`s assistance. Exhibit D12 originated from his desire to help Ong. This explanation was quite incomprehensible and illogical. There was no reason for the appellant to assist Ong in this manner. Ong could have easily clarified the alleged mistake with SES  instead of resorting to this delayed and rather complicated solution. Oddly enough, although the appellant was confronted for the first time with the possibility that the 1994 and 1995 payments were interest payments, he did not immediately enquire about the interest rates and the period of the interest. In my view, the appellant`s conduct showed that he already knew that the 1994 and 1995 payments were interest sums.The appellant also attempted to embellish his evidence. He claimed to possess documents from SES showing that he had treated the 1994 and 1995 payments as capital repayments. However these highly crucial and material documents were never produced in court. Under these circumstances, the magistrate was rightly led to the conclusion that the appellant had fabricated this evidence as an afterthought.",
        "Discrepancy of $40,000": "The appellant also referred to the discrepancy of $40,000 between the payments received by the appellant in 1995 ($1.064m) and the amount of interest ($1.024m) reflected in the calculations contained in App A to exh P24.In my view, this was not a real discrepancy. The magistrate accepted Ong`s evidence that the $40,000 was reimbursement for banking charges incurred by the appellant in obtaining the loan. Even though Ong`s credit was impeached, it did not mean that his entire testimony was rejected. The magistrate was entitled to accept some parts of his oral evidence as the truth. It was clear from para 5 of exh P24 that Ong proposed to pay the appellant $1.024m in interest which proposal was accepted by the appellant at the material time. That was the crux of the second charge.In the final analysis, it seemed to me that Ong`s testimony on the material points was tainted by a motivation to paint a favourable picture for the appellant. He was afflicted with convenient bouts of amnesia and deliberate vagueness on issues which could shed critical light on the appellant`s state of mind. On the other hand, he possessed a clarity of memory on matters which tended to absolve the appellant. In light of this and since the magistrate`s findings of fact had not been shown to be clearly wrong, I concluded that the court below was entitled to rely on exhs P24 and P25 in convicting the appellant.",
        "Whether the appellant was aware of the nature of the payments and wilfully omitted them from the tax returns with an intent to evade tax": "The appellant`s knowledge of the nature of the payments was necessarily linked to the question of whether he had wilfully omitted the interest income from his tax returns with the intention of evading tax. FA Chua J inNg Chwee Poh v PPSLR 603[1977] 2 MLJ 203at p 237, in an appeal involving a similar charge, cited and approved the meaning of the term `wilfully` set out by the trial judge in that case:This term (wilfully) has been discussed fully and defined in several decided cases. In the case of Senior [1899] 1 QB 283, at p 290, Lord Russell of Killowen described the term thus; `wilfully` means that the act is done deliberately and intentionally, not by accident or inadvertence, but so that the mind of the person who does the act goes with  it. This interpretation was adopted in the case ofAB Tamboli v Agent, GIP Railway Company, BombayAIR 1928 PC (Bombay) 24, at pp 26-27. Again, in the case ofIannella v French[] 41 ALJR 389, at p 303, Barwick CJ stated, `... \"wilful\" connotes intention and knowledge:...` and further in his judgment therein, that, `the word contains in its connotations elements of purpose`. Windeyer J, also in the same case, at p 399, expanded on this interpretation of the term in the words, `If the word \"wilfully\" be given the meaning and effect that I think it has in this context,then an honest mistake as to the existence of any element essential to the offence is a defence`. He also referred to the judgement of Napier CJ in the case ofDavies v O`Sullivan (No 2)[1949]  SASR 208, wherein it was stated. `the natural meaning (of the term \"wilfully\") ... is that the act was done intentionally, not by accident or inadvertence, but so that the mind or will of the action goes with the act ...` with which he expressed his agreement. ... Windeyer J added that, `That word \"wilfully\" does not stand alone. Its importance is in the meaning which it gives to its context`. [Emphasis added.]And further, at p 238:Wilfulness implies knowledge proved by circumstantial evidence rather than by direct evidence to be gathered from the acts and conduct of the appellant. With intent to evade tax implies motive. What was the motive of the appellant? Was it solely to evade payment of less tax?The ultimate question before the court is what is the totality of the evidence of the acts and conduct of the appellant at the relevant timewhen the appellant prepared and submitted exh P15 toenable the court to infer that the omission ... was an act done wilfully. [Emphasis added.]I was in full agreement with the above passage. Therefore, if the appellant harboured an honest mistake as to the nature of the payments, he would not be guilty of the offences charged, although he might well be guilty of a lesser offence under s 95(1)(a) or s 95(2)(a) of the Act for omitting or negligently omitting to declare the interest income. Conversely, if the direct and circumstantial evidence proved that the appellant was aware of the purpose and nature of the payments and had deliberately omitted to declare the payments with an intent to declare tax, he would be guilty of the offences as charged.",
        "Knowledge of nature of payments": "The appellant faced the uphill task of persuading me that the magistrate had clearly and manifestly erred in rejecting his testimony as being `incredible`, unreliable`, `fabricated`, `an afterthought` and `did not make sense`. Having carefully considered the appellant`s submissions, it sufficed to say that the appellant failed to convince me that the magistrate`s findings of fact, which were based on her assessment of the credibility and veracity of the witnesses, were perverse and ought to be overturned.Apart from the direct evidence contained in exhs P24 and P25 showing that the appellant knew that the sums paid in 1994 and 1995 were interest payments and not capital repayments, there was ample circumstantial evidence supporting the conclusion that the appellant knew the purpose of those payments at the material time.Unlike the 1992 payment which was accompanied by a covering letter expressly stating that it was a partial repayment of the loan, the 1994 and 1995 payments were made in cash or cash cheques, and without any covering letters.  The sudden, unexplained payment of large sums of money, as well as the distinctly different mode of payment, surely called for an inquiry. Afterall, the appellant had been anxious to recover his loan. Furthermore, it was the appellant`s own evidence that Ong had proposed to compensate him with interest in late 1994, even though no further details were discussed. This was then followed by the cash payments after the dividends declaration in 1995. Thus viewed, the appellant claimed ignorance and failure to clarify the purpose of those payments strongly indicated that he already knew that they were interest payments. As aptly put by the magistrate in her grounds of decision at [para ] 100:... his defence is totally unacceptable in the light of the surrounding facts and circumstances particularly when he said that he just accepted what PW4 [Ong] told him without wanting to confirm the nature of the payments. Surely, a successful businessman like the accused, would enquire if he did not know about the nature of payments in the first place.The appellant relied heavily on exh D12, dated 17 March 1997, to show that they only agreed to treat the 1994 and 1995 payments as interest payments in 1997. However, as I have explained above at [para ] 69-72, the magistrate was correct in attributing little weight to this document.",
        "Wilful omission with intention to evade tax": "I was not persuaded that the magistrate erred in drawing the inference that the appellant possessed the requisite mens rea to evade tax.The incriminating evidence came from the appellant`s concerted efforts in ensuring the untraceability of the funds. The first of which was his request for the payments to be made by cash cheques as indicated in exh P24, which was corroborated by Ong`s oral testimony and the appellant`s own evidence that he requested the first payment, amounting to $60,000, to be made in cash. This mode of payment contrasted sharply with the capital repayments which were easily traceable and which were accompanied by covering letters.Even if I accepted that the appellant was genuinely in need of cash for the first payment of $60,000, this did not explain the subsequent payments (in 1994 and 1995) which were also made in cash or cash cheques. The appellant himself admitted that he was not in need of cash. The evidence showed that after receiving the payments, he in fact embarked on a systematic deposit of a large portion of the cash received into his accounts with Dao Heng bank in Hong Kong and Bangkok Bank in Singapore.The appellant was evasive and refused to or was unable to explain, despite repeated questioning, why he did not request Ong to make the subsequent payments in account payees cheques or cashier`s orders which was a far safer and more convenient mode of payment. This must also be viewed in the light of Ong`s practice of not issuing cash cheques for such large sums of money in the absence of an express request by the payee.The appellant also admitted that he personally carried a large portion of the 1995 payments amounting to hundreds of thousands of dollars in cash to Hong Kong, converted it into Hong Kong currency and deposited it into his Hong Kong  bank account. This conduct was highly incriminating, especially in the absence of any satisfactory explanation for transporting and depositing the money is such a convoluted manner. The appellant denied that it was risky to transport the cash physically, and insisted that it was faster and more convenient than a telegraphic transfer of funds. During the proceedings, it emerged that the appellant was a director of one of the largest finance companies in Singapore. Considering his background in this industry, I found this explanation most astonishing and untenable.In his written arguments, counsel for the appellant contended that until the long overdue loan had been fully repayed, and in the absence of any agreement that the loan was subject to the payment of interest, the appellant was entitled to treat such payments as repayments of the principal. His counsel referred to the Statement of Accounting Standards (SAS) 16 and GAAP Guide 1995 (Generally Accepted Accounting Principles).I found these references to be of limited assistance. First, the appellant failed to explain how these technical accounting principles applied to the facts in question. Furthermore, the extract from the Statement of Accounting Standards contained general definitions of income, revenue and interest and did not appear to be relevant to the appellant`s submissions.The appellant cited two chapters from the GAAP Guide entitled `Impairment of a Loan` and `Installment Sales Method of Accounting`. The former referred to an accounting method which provided for a loss contingency for impaired loans, ie `when it is probable that a creditor will be unable to collect all amounts due, including principle and interest`. 20.05 of the GAAP Guide states:... A loan is not considered impaired if[bull  ] There is merely an insignificant delay or shortfalls in amounts of payments.[bull  ] The creditor expects to collect all amounts due, including interest accrued at the contractual interest rate for the period of the delayThere was however, no evidence, nor any arguments before me or in the court below, that the loan was impaired. The chapter `Installment Sales Method of Accounting` cited in GAAP Guide at 22.03 was clearly inapplicable to the facts of the instant appeal. As stated in the overview to that chapter, that method provided for the `deferral of gross profit on instalment sales until cash is collected`. This appeal did not involve any instalment sales.Whilst true that the appellant subsequently declared the interest payments to IRAS and paid the additional taxes, it was a necessary corollary of the attempt to cover his tracks as evidenced by exh D12. This did not detract from the fact that the appellant possessed the intention to evade tax at the material time.Having reviewed the evidence, I found no reason to disturb the magistrate`s findings. Viewed in totality, the direct and indirect evidence gave rise to an irresistible conclusion that the appellant knew that the 1994 and 1995 payments were interest payments and that he had wilfully omitted them from the income tax returns for assessment years 1995 and 1996 with the intent to evade tax. I was  satisfied that the prosecution had proven its case against the appellant beyond all reasonable doubt and dismissed the appeals against conviction.",
        "The appeals against sentence": "The appellant urged me to impose non-custodial sentences or alternatively, to reduce the period of imprisonment. The appellant contended that the sentences of imprisonment were manifestly excessive and that the magistrate failed to adequately consider the relevant factors affecting the appropriate sentences.In sentencing the appellant, the magistrate took into account the fact that the appellant reported the interest income to IRAS before investigations began and paid the additional taxes assessed. Against that, she noted that the offences were serious in nature and were tantamount to cheating the State. She also noted that the appellant attempted to disguise the payments which he had received.",
        "Whether it is mandatory for the court to impose a fine or imprisonment or both": "Section 96(1) Income Tax Act states:Any person who wilfully with intent to evade tax -...shall be guilty of an offence for which, on conviction, heshall pay a penaltyof treble the amount of tax which has been undercharged in consequence of the offence or which would have been undercharged if the offence had not been detected, andshall also be liable toa fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or both. [Emphasis added.]Counsel for the appellant cited the case ofPP v Lee Soon Lee Vincent[1998] 3 SLR 552and submitted that the phrase `shall also be liable` meant that the court had the discretion not to sentence the appellant to a fine and/or to imprisonment. Counsel argued that these were optional, additional sentences to the mandatory treble penalty and need not be imposed if the court was satisfied that the penalty was a sufficient punishment. The prosecution disagreed and argued that the court must impose either a fine or imprisonment or both in addition to the penalty. However the prosecution did not cite any reasons or arguments in support.I did not consider it strictly necessary to determine this question. Even if this court had the discretion advocated for by counsel, I would not have been minded to exercise it in favour of the appellant. Nonetheless, I would venture to express my preliminary views, bearing in mind that I did not have the benefit of full submissions from both parties and that it may well be necessary for this question to be canvassed and argued more fully in a future case.InPP v Lee Soon Lee Vincentat [para ] 14, I acknowledged that:In my view, prima facie, the phrase `shall be liable` (as opposed to `shall be punished`) contained no obligation or mandatory connotation.However, as illustrated in that case, the use of the phrase `shall be liable` can sometimes convey a mandatory effect. There, I had to interpret the effect of s 67(1) of the Road Traffic Act (Cap 276) which read:...shall be liableon conviction to a fine ... or to imprisonment and, in the case of a second or subsequent conviction, to a fine ... and to imprisonment for a term not exceeding 12 months. [Emphasis added.]I eventually concluded that the a term of imprisonment was mandatory for a repeat offender even though it was prefaced by the phrase `shall be liable`. There was however no dispute in that case that one or both of the prescribed punishments had to be imposed on a first offender.In order to interpret a statutory provision, the court will normally rely on the wording of the relevant sections as they appear in the statutes and where available, the full legislative history of the provision in question:PP v Lee Soon Lee Vincentat [para ] 27. I was not able to locate any relevant Parliamentary debates relating to this phrase in the context of the Income Tax Act. Nonetheless, it was my considered opinion that s 96(1) prescribes a mandatory fine or imprisonment or both in addition to the mandatory treble penalty.The phrase `shall be liable` is used throughout the Income Tax Act in prescribing the sentences of fines or imprisonment. For instance, it appears in s 94(2), which is the general sentencing provision for contravention of provisions of the Act or any rules or regulations made thereunder:Any person guilty of an offence under this Act for which no other penalty is provided shall be liable on conviction to a fine not exceeding $1,000 and in default of payment to imprisonment for a term not exceeding 6 months.Similarly, s 97 which concerns offences committed by authorised and unauthorised persons, provides that such offenders... shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both.In the above examples, the phrase `shall be liable` must necessarily be of mandatory effect in the sense that one or both of the prescribed sentences must be imposed. To interpret it in any other manner would lead to the absurd possibility that no sentence may be imposed upon the offender at all. In my view, the same interpretation necessarily applied to the phrase `shall be liable` as it appears in s 96(1). As stated in BennionStatutory Interpretation(3rd Ed, 1997) at p 942,Since drafting is presumed to be competent, it is assumed that a word or phrase has the same meaning throughout unless the contrary intention is shown. This is an aspect of the principle that an Act should be drafted and construed as a whole. It is a sound rule of construction to give the same meaning to the same words occurring in different parts of an Act.Unless a contrary intention is shown or there is some doubt as to Parliament`s intention, a departure from this approach would place the court in an invidious position of having to interpret an identical phrase in a different manner in different parts of the Income Tax Act. This would give rise to uncertainties in the application and implementation of the law.Reading the Income Tax Act as a whole, I was not able to find any indication that Parliament intended a contrary effect. I was fortified in that view by reference to s 96(2):Where an individual has been convicted for 3 or more offences under this section the imprisonment he shall be liable to shall not be less than 6 months.In interpreting the effect of the phrase `shall be liable`, I bore in mind the accepted canon of statutory interpretation that the court would avoid a construction that produces an absurd result or a construction that creates an anomaly or otherwise produces an irrational or illogical result:Bennion, supra, at p 751, 764. Applying that principle, the phrase `shall be liable to` must necessarily be interpreted in a mandatory sense in both ss 96(1) and 96(2).How was this conclusion reached? I first noted that Parliament intended to punish offenders with multiple charges more severely since this has been specifically legislated for. It thus follows that s 96(2) prescribes a mandatory minimum imprisonment term of six months in addition to the mandatory treble penalty. This position was explicitly accepted without argument by FA Chua J inNg Chwee Poh v PPat p 246. Section 96(2) would be superfluous if it is wholly discretionary in nature since s 96(1) already provides for sentences of imprisonment. Further, if s 96(2) is wholly discretionary, an offender with multiple charges would either not be sentenced to imprisonment or sentenced to a minimum term of six months on each charge. On the other hand, an offender facing a single charge of tax evasion may be sentenced to imprisonment for up to three years pursuant to s 96(1). Such an outcome would indeed be absurd, anomalous and illogical.In my view, the phrase `shall pay a penalty of treble the amount of tax` did not affect the above conclusion. This phraseology simply emphasizes that the court has to impose such a penalty as opposed to the later part of s 96(2) where there is a choice of either one or both of the prescribed sentences. This does not change the meaning of `shall be liable` as it appears in other parts of the Act such that the court may decline to impose any of the prescribed sentences altogether.The penalty appears to be of a somewhat different genus from the usual sentencing option of a fine. Otherwise Parliament could simply have legislated for a mandatory fine of three times the tax evaded. In addition, while non-payment of a fine is punishable with in default terms of imprisonment, s 90(1) provides that any tax or penalty imposed under the Act may be sued for by way of a specially endorsed writ of summons. This supported my view that the treble penalty is a mandatory order which is additional to the usual sentencing options.",
        "Whether the sentence was manifestly excessive": "I was not persuaded by the appellant`s arguments and was not inclined to substitute the sentence of imprisonment with a fine. InPP v Tan Fook Sum[1999] 2 SLR 523, I discussed the interplay between the sentencing principles of retribution, deterrence, prevention and rehabilitation; and noted that (at [para ] 21):... the foregoing principles cannot be applied merely to determine whether the proper sentence is a fine or imprisonment but also to determine whether, in addition to a fine, a custodial sentence should be imposed. Moreover, after the proper option has been determined, it seems the foregoing principle must again be applied in order to ascertain what the amount of fine or the term of imprisonment should be. In the view of Tan Yock Lin, there is a better way:... what will facilitate more rational and informed sentencing is recognition that there is a dichotomy between public interest and aggravating or mitigating factors.Generally speaking, only the public interest should affect the type of sentence to be imposed while only aggravating or mitigating circumstances affect the duration or severity of the sentence imposed. [Emphasis added.]The public interest was significant in this case as the charges were grave and were tantamount to a deliberate fraud on the State. Higgins J expressed the view inR v Elvin & Anor97 ATC 4089 (at p 4094) that while:It is not possible, ... to conclude that every substantial tax fraud should result in the incarceration of the offender. It is possible to conclude that deliberate and systematic fraud on the revenue will, in the absence of substantial mitigating factors, lead to incarceration.This type of offences affect the society as a whole as any deficiencies in revenue would have to be made up by other taxpayers. Furthermore, such offences are often difficult to detect or investigate without information or co-operation from the taxpayers. In view of these considerations, a custodial sentence should normally be imposed in order to meet the needs of general deterrence.Case authorities from other jurisdictions have provided useful guidance on the governing factors to be considered in deciding on the appropriate sentences for tax evasion offences. InA-G v Ma Lai Wu & Ors[1987]  HKLR 744, the respondent was sentenced to suspended terms of imprisonment and fines for offences involving the fraudulent avoidance of tax. The Hong Kong Attorney General applied by way of case stated to the Hong Kong Court of Appeal. The appellate court allowed the application for review and imposed penalty fines while reducing the amount of fines imposed but did not disturb the suspended terms of imprisonment. In the course of the judgement, Silke JA, delivering the judgment of the Hong Kong Court of Appeal, stated at (p 747D-G):... While sentences imposed in other jurisdictions with differing social and economic structures and the reasons for them are not necessarily applicable to Hong Kong, each of those cases emphasized the principle that the course which should be taken by a court where there is deliberate and fraudulent evasion of tax is one of immediate imprisonment which may be coupled with a fine and a penalty. We think that, in Hong Kong, ... sentences of immediate custodial imprisonment should in future be imposed in the appropriate case.It is necessary for a court to take into consideration when assessing the quantum of such sentence - and this list is not intended to be exhaustive - the time span of the offences, the systems and methods used to evade tax, where or not there was re-payment of the tax evaded, the amount of that tax, the individual culpability of one or more defendants and the circumstances of each defendant.Lenient sentences, where detection is not certain, may encourage persons to take a risk. People who commit offences such as these are favoured by the possibility of non-detection and favoured yet again if upon detection they can look forward to leniency.The deliberate defrauding of the Inland Revenue is a serious matter which affects the community as a whole. [Emphasis added.]In the subsequent case ofR v Ng Wing Keung[1997]  HKLR 142, the offender was sentenced to imprisonment following conviction on tax evasion charges. The offender did not suggest that the sentence was too long or was wrong in principle, but argued that the sentence of imprisonment ought to have been suspended. The Hong Kong High Court cited and applied the factors set out inA-  G v Ma Lai Wu & Ors. In upholding the sentence, Stuart-Moore J, delivering the judgment of the majority of the Hong Kong Court of Appeal, approved the approach which was adopted by the High Court below (at p 147C-148E).As revealed from the magistrate`s findings, the offences were committed with premeditation and deliberation. The evidence revealed a careful scheme of concealment to evade tax through the use of cash cheque and overseas deposits which occurred over the course of two years. The appellant eventually received a large sum of interest totalling $1.314m. The total tax evaded was substantial and amounted to $354,645.65, a sum far in excess of the maximum fine of $10,000 prescribed under s 96(1) of the Act. With that in mind, a fine would have been manifestly inadequate. As was noted in 9(2)Butterworths Annotated Statutes of Singaporeat p 933:Where substantial amount of tax is being evaded by deception, the usual sentence adopted by courts in many jurisdictions has been that of a custodial one.The appellant cannot deny that he bore individual responsibility for the acts. He requested that the payments be made in cash cheques and subsequently wilfully omitted to declare the interest income to the tax authorities. He would also have been the sole beneficiary if the scheme had succeeded.In my view, the strongest mitigating factor in the appellant`s favour was his voluntary and swift action in notifying IRAS of the payments before investigations began. The appellant subsequently made reparation and paid additional taxes amounting to $394,7354,645.65 which was in excess of the actual taxes payable. This was a significant indication of the appellant`s desire to make amends. I was inclined to agree that the magistrate had not given sufficient weight to this and shared the observation made by Higgins J observations inR v Elvin & Anor(at p 4094):... It is true that the perception that those who have profited from tax evasion can buy freedom from incarceration either from the profits of that evasion or their accumulated wealth must be avoided.However, as with a plea of guilty, it is a relevant matter favouring leniency. The weight to be accorded to it depends, as with a plea of guilty, on the implication as to remorse and the desire to make amends which the reparation in the circumstances discloses. The degree of hardship accepted by the offender in making reparation is also material. [Emphasis added.]The appellant`s individual circumstances must also be considered. I noted from the mitigation plea in the court below, that the appellant started from relatively humble beginnings and had since built up a successful business. He had also made several contributions to the community, for instance, he had been the Chairman of the Management Committee of a primary school since 1983 and had also been the Honorary Chairman of a Citizens` Consultative Committee since 1994.In the final analysis, after taking into account the above considerations, the appellant`s age (65 years old), the fact that he was a first offender as well as the fact that he had to resign from all his directorships following the convictions, I accepted the appellant`s submissions that the sentences were manifestly excessive. Accordingly, I allowed the appeals against the sentences and reduced  the period of imprisonment to one month and two months on the first and second charges respectively. I ordered both sentences to run concurrently, resulting in a total sentence of two months` imprisonment. I did not disturb the orders made by the magistrate in relation to the penalties imposed.Outcome:Appeals against convictions dismissed; appeals against sentences allowed.Copyright © Government of Singapore."
    }
}