{
    "case_title": "Pan-United Shipyard Pte Ltd v India International Insurance Pte Ltd",
    "ncitation": "[2000] SGHC 14",
    "coram": "Chao Hick Tin JA; \n      Goh Joon Seng J",
    "sections": {
        "The background": "2 On 22 January 1992, the Plaintiffs entered into a contract with\n\nRanger Shipping Pte Ltd to convert a bulk carrier the Ikopa (‘the Vessel’) to a\n\nclean product tanker. The scope of works included and required grit blasting and spray\n\npainting.3 For the purpose of securing protection and indemnity against, inter\n\nalia, their liability arising from any accident or occurrence, the Plaintiffs under the\n\nadvice of their brokers Frank B Hall Insurance Brokers (S) Pte Ltd obtained from theDefendants,a Collective Policy of Insurance (‘the Collective Policy’). The\n\ninsureds were described as ‘Pan-United Shipyard Pte Ltd and/or Petro Ships Pte Ltd\n\nand/or Ranger Shipping Pte Ltd and/or Asian Lift Pte Ltd for their respective rights and\n\ninterest.’ The relevant clauses are clauses 19 and 10.1. They read:\"19.1 The Underwriters agree to indemnify the Assured for any sum\n\n  or sums paid by the Assured to any other person or persons by reason of the Assured\n\n  becoming legally liable,as Ownerof the Vessel, for any claim, demand, damages\n\n  and/or expenses, where such liability is in consequence of any of the following matters or\n\n  things and arises from an accident or occurrence during the period of this insurance:[underlining added]19.1.1 loss of or damage to any fixed or movable object or property or\n\n      other thing or interest whatsoever, other than the Vessel, arising from any cause\n\n      whatsoever in so far as such loss or damage is not covered by Clause 17 [clause 17 refers\n\n      to liability of the Assured arising from collision involving the Vessel]19.1.2 any attempted or actual raising, removal or destruction of any\n\n      fixed or movable object or property or other thing, including the wreck of the Vessel, or\n\n      any neglect or failure to raise, remove, or destroy the same19.1.3 liability assumed by the Assured under contracts of customary\n\n      towage for the purpose of entering or leaving port or maneuvering within the port19.1.4 loss of life, personal injury, illness or payments made for life\n\n      salvage.19.2 The Underwriters agree to indemnify the Assured for any of the\n\n  following arising from an accident or occurrence during the period of this insurance:19.2.1 the additional cost of fuel, insurance, wages, stores,\n\n      provisions and port charges reasonably incurred solely for the purpose of landing from the\n\n      Vessel sick or injured persons or stowaways, refugees, or persons saved at sea19.2.2 additional expenses brought about by the outbreak of infectious\n\n      disease on board the Vessel or ashore19.2.3 fines imposed on the Vessel, on the Assured, or on any Master\n\n      Officer crew member or agent of the Vessel who is reimbursed by the Assured, for any act\n\n      or neglect or breach of any statute or regulation relating to the operation of the Vessel,\n\n      provided that the Underwriters shall not be liable to indemnify the Assured for any fines\n\n      which result from any act neglect failure or default of the Assured their agents or\n\n      servants other than Master Officer or crew member19.2.4 the expenses of the removal of the wreck of the Vessel from any\n\n      place owned, leased or occupied by the Assured19.2.5 legal costs incurred by the Assured, or which the Assured may be\n\n      compelled to pay, in avoiding, minimizing or contesting liability with the prior written\n\n      consent of the Underwriters.DEDUCTIBLE10.1 No claim arising from a peril insured against shall be payable\n\n  under this insurance unless the aggregate of all such claims arising out of each separate\n\n  accident or occurrence (including claims under clauses … 19 … exceeds __________\n\n  in which case this sum shall be deducted.\"This clause is to be read with the schedule which provided:\"Deductible, Clause 10 – S$50,000.00 All claims Each\n\n    Accident.\"4 The conversion work to the Vessel was carried out during the period\n\nFebruary 1992 to January 1993. Grit blasting and spray painting were carried out. At the\n\nmaterial time, a yacht, the El Corsario was undergoing warranty and docking works at a\n\nneighbouring shipyard at No 29, Tuas Crescent,Singapore.5 In June 1995, the Plaintiffs received a claim from the owners of the\n\nEl Corsario for damage allegedly caused by the grit blasting and spray painting works\n\ncarried out by the Plaintiffs on the Vessel.6 The Plaintiffs referred the claim to theDefendants. On 4\n\nOctober 1995, theDefendantsdenied liability principally on the ground\n\nthat the claim was not being brought against the Plaintiffs as the owner but as the\n\nrepairer of the Vessel. Consequently the Plaintiffs were not entitled to be indemnified\n\nunder Clause 19.7 On 31 August 1996, the owners of El Corsario commenced proceedings in\n\nSuit 1627 of 1996 against the Plaintiffs and the neighbouring shipyard Kvaerner\n\nFjellstrand (S) Pte Ltd.8 As liability to indemnify the Plaintiffs had been denied by theDefendants, the Plaintiffs conducted their own defence through their own solicitors.9 Pending the hearing of Suit 1627 of 1996, the Plaintiffs on 6\n\nFebruary 1998 filed these proceedings for, inter alia, a declaration that in the event\n\nthat they were held liable for the claim made by the owners of the El Corsario, they were\n\nentitled to be indemnified by theDefendants under\n\nclause 19 of the Collective Policyin respect of the said claim including all interest and costs.10 Eventually, the claim in Suit 1627 of 1996 was settled on 25 August\n\n1998 when, by consent, the claim was dismissed with no order as to costs.11 On 1 March 1999, the Plaintiffs amended their claim herein to one\n\nfor declaration, inter alia, that they ‘be entitled to be indemnified by theDefendantsfor their legal costs incurred in defending Suit 1627 of 1996 pursuant to Clause\n\n19’ of the Collective Policy. The amount claimed is $146,193.96.12 These proceedings came up for hearing before me. I dismissed the\n\nPlaintiffs’ claim. The Plaintiffs have appealed to the Court of Appeal. I now give my\n\nreasons.13 Clause 19.1 provides that theDefendantsshall indemnify the Plaintiffs as the\n\nAssured in respect of ‘any sum or sums paid by Assured to any person or persons by\n\nreason of the Assured becoming legally liable, as Owner of the Vessel…’ It is\n\nthus quite clear that the indemnity provided is against liability incurred by the Assured\n\nas ‘Owner’ of the Vessel. The other sub-clauses of clause 19 also relate to\n\nliability of shipowners or persons in possession of a ship as owners or as operators.14 InRigby & Ano. v Sun Alliance & London Insurance Ltd[1980] 1 Lloyd’s Law Reports 359, a policy on buildings contained an ‘Additional\n\nprotection’ clause reading:\"Additional protection:… the Company will pay to the\n\n  Insured… (13) the amount of claimant’s damages (including costs and expenses)\n\n  arising out of the Insured’s liability at law attaching solely as owner, not\n\n  occupier, of the house in respect of (a) accidental bodily injury (including death or\n\n  illness) to any person, or (b) accidental damage (including loss) to property happening in\n\n  or about the house during any period of insurance.\"14.1 The issue before the court was whether that clause would indemnify\n\nthe insured against claims by their neighbours for damage to the latter’s property\n\nallegedly caused by encroachment of the roots of oak trees on the insured’s property.\n\nThe claim was based on the tort of nuisance which is concerned with the wrongful use of\n\nland by a defendant who may or may not be the owner. In holding that the claims were not\n\nwithin the scope of the policy, Mustill J stated at p 364:\"The liability must attach to the insured \"as owner\".\n\n  These words are apt to describe not the capacity of the insured or the history of the\n\n  liability, but the character of the liability itself. To my mind they denote that the\n\n  status of the insured as owner is an integral part of the cause of action against him, and\n\n  not merely that in practice he would never have found himself in the position of receiving\n\n  a claim and being held liable if he had not been the owner of the premises. This view\n\n  corresponds with the opinions expressed on a very similar point by Mr. Justice McNair and\n\n  Lord Justice Diplock delivering the judgment of the Court of Appeal inSturge v.\n\n  Hackett,[1962] 1 Lloyd’s Rep. 117, at p. 124, and [1962] 1 W.L.R. 1257.\"15 InSturge v Hackett[1962] 1 Lloyd’s List Law Reports\n\n117, the defendant obtained a policy of insurance covering his liability as\n\n‘occupier’ of a flat in a house up to 100,000 and his personal liability for\n\nnegligence up to 10,000. The house was destroyed by fire resulting from the\n\ndefendant’s efforts to burn a birds’ nest under the eaves of the house while\n\nstanding on the balcony which he was permitted to use. The owner of the house brought an\n\naction against the defendant for 50,000. The insurer brought an action for declaration\n\nthat his liability under the policy was limited to 10,000 under the personal negligence\n\nclause. In granting the declaration, McNair J stated at p 124:\"In my judgment, the phrase \"All sums for which the Assured\n\n  (as occupier…) may be held legally liable\" in the section of the policy headed\n\n  \"Liability to the Public\" clearly relates, and relates only, to a well-defined\n\n  group of liabilities imposed upon occupiers of premises. The words \"as occupier\"\n\n  connote that occupation is an essential ingredient of the liability and are not merely\n\n  descriptive of the identity or status of the person to whom liability attaches.\"15.1 The defendant appealed. Though the appeal was allowed by the Court\n\nof Appeal, Diplock LJ upheld McNair J’s construction of the words ‘as\n\noccupier’:\"In our view, the learned Judge was right in law in holding that\n\n  the question whether Colonel Hackett’s liability falls within the occupier’s\n\n  liability clause depends upon whether the fire that caused the damage started upon\n\n  premises of which he was the occupier.\"SeeSturge v Hackett[1962] 1 Lloyd’s List Law Reports 626\n\n  at 631.16 My attention was drawn to the decision inChrismas v Taylor\n\nWoodrow Civil Engineering Ltd and Sir Robert McAlpine Ltd[1997] 1 Lloyd’s Law\n\nReports 407. That case concerned a floating platform which could be moved though not under\n\nits own power. It could also be jacked up on legs which rested on the seabed with the\n\nplatform itself raised above the level of the water. The platform was owned by the first\n\ndefendants and was at the time on demise charter to the second defendants.16.1 The platform was insured with the plaintiff. The policy named the\n\nassured as Taylor Woodrow Plc, including charterers. The plaintiff accepted that the\n\nsecond defendant was an assured under the policy.16.2 The policy conditions incorporated the Institute Time Clauses\n\nHulls Port Risks which provided, inter alia, that ‘[t]he Underwriters agree to\n\nindemnify the Assured for any sum paid by the Assured to any other person or persons by\n\nreason of the Assured becoming legally liable, as owner of the Vessel, for any claim,\n\ndemand, damages and/or expenses, where such liability is in consequence of any of the\n\nfollowing matters … [par. 4] Including cover in respect of liability arising out of\n\ngoods … being lifted and/or transported mechanically or otherwise by the insured\n\nequipment and/or craft for the purpose of any contract for works or otherwise.’16.3 The second defendant was using the platform as a platform for a\n\ncrane which it employed in work for a water authority. There was a provision in the\n\ncontract between the water authority and the second defendant that on completion of the\n\nworks the second defendant should clear away and remove from the site all constructional\n\nplant plus material, rubbish and temporary works of every kind and leave the whole of the\n\nsite and permanent works clean and in a workmanlike condition.16.4 While the platform was jacked up it was struck by an exceptionally\n\nlarge wave which lifted it off its legs. The crane fell off the platform and sank. The\n\nsecond defendant incurred substantial expense in removing the crane from the seabed and\n\nsought to recover such expenses from the insurers under the policy.16.5 Judge Kershaw held that though the second defendant were\n\ncharterers and not owners, they were entitled to be indemnified under the policy in\n\nrespect of their expenses in removing the crane from the seabed. In delivering his\n\njudgment, the learned judge stated at p 411:\"I have reached the conclusion that the fourth paragraph of the\n\n  condition does apply only to liabilities which would be covered by the Institute Times\n\n  Clauses and that it is a requirement of cover under the fourth paragraph that it should be\n\n  by reason of the assured becoming legally liable, … the second defendant would be\n\n  insured, by reason of the fourth paragraph, against liabilities which fall upon the second\n\n  defendant, in the sense that they would have fallen upon the first defendant as owner but\n\n  instead fall upon the second defendant under a demise charter. …… I have reached the conclusion that the second defendant became\n\n  liable to remove the crane from the seabed not in any way as charterer or because it was a\n\n  charterer by demise and an owner would have been liable, but purely and simply and solely\n\n  because of its contractual obligation to the water authority.\"17 Relying onChrismas v Taylor Woodrowand the description of\n\nthe four named insureds in the Collective Policy containing the words ‘for their\n\nrespective rights and interest’ the Plaintiffs contended that they, as ship\n\nrepairers, were entitled to be indemnified in respect of the claim brought by the owners\n\nof the El Corsario. They also contended that as theDefendantshad wrongfully repudiated liability to\n\nindemnify them under the Collective Policy, they took steps to defend the claim as a\n\nprudent uninsured. The defence resulted in the claim against them being withdrawn. But the\n\nPlaintiffs incurred costs as between solicitor and client in defending the said claim for\n\nwhich they should be reimbursed.",
        "My decision": "18 In my view,Chrismas v Taylor Woodrowturned on the special\n\nwording of sub-paragraph 4 of the policy. This sub-paragraph is not in the Collective\n\nPolicy. Accordingly, the case is of no assistance. The Collective Policy only covered the\n\nPlaintiffs’ liability as owner and not as repairers of the Vessel. Accordingly, I\n\ndismissed the Plaintiffs’ claim with costs. I would also add that if the Plaintiffs\n\nas ship repairers are covered under the terms of the CollectivePolicy, their claim will still be subject to a deductible of $50,000 under\n\nclause 10.GOH JOON SENGJUDGECopyright © Government of Singapore."
    }
}