{
    "case_title": "Public Prosector v Chan Choon Wai",
    "ncitation": "[2000] SGHC 41",
    "coram": "Amarjeet Singh JC",
    "sections": {
        "Charge": "1. At about 11.50pm on 25thMarch 1999, Koh Mew Chin\n\n(‘the Deceased’) an unemployed Malaysian, was found and pronounced dead in a\n\nrented room at apartment Blk 145 Pasir Ris Street 11 #05-75 (‘the said\n\napartment’).2. On 26thMarch 1999 at about 4.25am, the Accused, also an\n\nunemployed Malaysian, was arrested and subsequently charged for murdering the deceased\n\nbetween 4.00pm and 11.00pm on 25thMarch 1999 in the said apartment.  At\n\nthe conclusion of the Prosecution case the time of the offence was amended to\n\n‘between 3.00pm and 11.00pm’ on the application of the Prosecution and without\n\nobjection by the Defence.Prosecution CaseDiscovery of Deceased Body3. The relevant evidence adduced by the Prosecution in support of the\n\ncharge was that the Accused who had befriended the Deceased sometime in September/October\n\n1998, invited the Deceased to come and reside with him in a room at the said apartment\n\nwhich he was already sharing with another Malaysian worker, Lim Sew Foung, PW11,\n\n(‘Seow Feng’). Seow Feng had rented the said room from its owner one Tan Puay\n\nChin (‘Ah Chin’) at a monthly rental of $150/-. Later a fourth Malaysian Goh Lee\n\nLee, PW17, (‘Lily’) also moved into the said room. Ah Chin also rented other\n\nrooms in his flat to a few other Malaysian workers namely, Quah Chin Aun (‘Ah\n\nAun’), Lai Chee Choong (‘Ah Choong’) and Tan Yeap Shion (‘Ah\n\nSeng’).4. The Prosecution adduced evidence from Ah Aun that when he returned\n\nto the flat on the 25thof March 1999 at about11pm, he noticed droplets\n\nof blood on the floor outside the Accused’s bedroom and extending to the kitchen\n\nsink. Ah Aun informed Ah Chin the owner of the flat about the droplets of blood. Ah Chin\n\nthen entered the Accused’s room and discovered the Deceased lying on a mattress. The\n\nAccused lay next to her. The Deceased was \"motionless\".. He saw blood on the\n\nAccused’s body and upon query by Ah Chin as to what had happened, the Accused\n\ninformed him that nothing had happened. He immediately called for an ambulance. He further\n\nrequested the Accused to wake the Deceased up. The Accused used his hands to wake the\n\nDeceased but there was no response from her. An ambulance followed by the police arrived\n\nsoon afterwards.Medical EvidenceAmbulance Officer5. The ambulance officer Norbayah Bte Md Yasin on arrival pronounced\n\nthe Deceased as dead. She noted lacerations on each wrist of the Accused. The bleeding\n\nfrom the lacerations had dried up. She found the Accused fully conscious in accordance\n\nwith the Glasgow-Coma Scale which she noted inExh. P94.Medical Officer, Changi Hospital6. The Accused was taken to the Changi General Hospital. Dr Gan Yu Unn,\n\nMedical Officer, Accident and Emergency Department, Changi General Hospital, clinically\n\nexamined the Accused at 12.35am, confirmed the evidence of the ambulance officer that the\n\nAccused was fully conscious. Dr Gan testified that the Accused had told him that the wrist\n\ninjuries he had were self-inflicted as he was feeling sad. However, the Accused did not\n\nappear sad to him. He found the Accused somewhat reluctant to speak to him. Dr Gan’s\n\nevidence was that the laceration to each wrist measured approximately 5cm in length. Both\n\nlacerations were superficial and involved only skin and subcutaneous tissues but not the\n\ndeep arteries, veins or nerves. Both hands had full range of movement, full sensory\n\nfunction and no evidence of tendon damage. Dr Gan’s further testimony was that the\n\nbleeding of the lacerations would have stopped within an hour. It would have stopped\n\nwithin half an hour if pressure had been applied on the wound soon thereafter. The\n\nlacerations he said were consistent with having been caused by a knife such as Exh. P146\n\nwhich the Prosecution had recovered from a drawer in the cupboard of the Accused’s\n\nroom where the Deceased and Accused were found.Pathologist7. It was the evidence of Prof Chao Tzee Cheng, PW21 (‘Prof\n\nChao’), Senior Pathologist from the Department of Science and Forensic Medicine,\n\nMinistry of Health that he tentatively examined the Deceased’s body in the area where\n\nshe was found at about 3.30am on 26thMarch 1999. Rigor Mortis was setting in.\n\nHe estimated death to have occurred between 8 to 10 hours before his arrival i.e.\n\neffectively between 3 to 11pm on 25thMarch 1999 giving allowance for an error\n\nof 2 to 4 hours. He later carried out a post mortem on the Deceased and certified the\n\ncause of death in his Autopsy Report Exh. P87, to be:‘Asphyxia from Strangulation’.Prof Chao found the following external injuries:Neck1. A thin linear abrasion 8 cm long in the centre of the neck at\n\nthyroid region.2. Roundish bruise 1.5cm at right side of chin.3. Small bruises at right jaw.4. Oval shaped bruise 3 cm with a 1cm abrasion in the centre on the\n\nleft side of neck below jaw.5. Below that a crescentic abrasion 1 cm.6. Abrasion 1.5cm on left side of neck.7. Below that a crescentic abrasion 1 cm.Elbows8. Bruise above left elbow 3 x 2cm9. Bruises around right elbow 2 x 2 cm and 5 x 2 cm.Prof Chao also found petichae haemorrhages on the skin of the\n\nDeceased’s face around the eyes as well as haemorrhages in the conjunctiva of the\n\nDeceased’s eyes. These he said were signs of strangulation. In addition, there were\n\nstrangulation marks on the Deceased’s neck with a ligature and by fingertip marks.According to Prof Chao, injury 1 above was caused by pressure from a\n\nstring-like object pressed against the Deceased’s neck from the front. A dissection\n\nof the neck in a bloodless field revealed the ligature injury to have caused haemorrhage\n\nover the muscles in the centre of the neck.As for injuries 2, 3, 4 and 6, Prof Chao testified that these injuries\n\nwere made by fingertips of the assailant. It was Prof Chao’s evidence that the\n\nassailant had also applied considerable amount of force manually by his hands as internal\n\nunderlying examination revealed injuries 2, 3, 4 and 6 had caused deep haemorrhages on the\n\nunderlying tissue of the neck as well as on the larynx and the food passage (oesophagus)\n\nat the back of the neck.Prof Chao was of the opinion that the ligature mark and the marks\n\ncaused by the finger tips under the neck structure either independently or collectively\n\nwere sufficient in the ordinary course of nature to cause death and that these injuries\n\nhad not been accidentally caused. Neither were they self-inflicted. The Deceased’s\n\ndeath would have taken between 2 to 4 minutes with the oxygen cut off from the brain\n\nresulting in brain death.As for injuries 5 and 7 above, i.e. the crescentic abrasions of 1cm,\n\nProf Chao stated that they were caused by the Deceased’s finger nails which left\n\nscratch marks on her face. They resulted because she was attempting to pull off the\n\nassailant’s hands to lift the stranglehold on her.Prof Chao also found haemorrhages on the outside of both elbows of the\n\nDeceased and he was of the opinion that the injuries were consistent with pressure having\n\nbeen applied on the outside of the elbows by the assailant gripping the Deceased’s\n\nelbows and body by his having straddled across the Deceased’s body in such a way that\n\nthe Deceased’s elbows were gripped by the assailant’s knees at some point during\n\nthe strangulation.Prof Chao went on to testify that there was an absence of blood on the\n\nDeceased’s neck and this made it unlikely that the assailant had cut his wrists\n\nbefore strangling her. He further said that as considerable force had been applied on her\n\nlarynx and food passage, it was unlikely that the Deceased could have shouted out or\n\nscreamed. As for part of the Deceased’s clothes, thighs and legs being covered with\n\nblood, his opinion was that she was not moving when the blood fell on her body. There were\n\nno open wounds on the Deceased’s body and the blood was not hers. The blood he\n\nsuggested could have come from the assailant’s bleeding hands when he moved her body\n\nor lay next to her later.Scientific Officer8. DNA profiles of all the blood stains and other exhibits in the room\n\nmatched that of the Accused including the knifeExh. P146according to Scientific\n\nOfficer Mrs Tan Wai Fun of the Department of Scientific Services. Semen stains were also\n\ndetected on the bedsheet and on the Deceased’s shorts which she wore. DNA profiles of\n\nthe semen stains on the said bedsheet and on the Deceased’s shorts matched the DNA\n\nprofile of the Accused.Other Prosecution WitnessesWendy, Lily, Seow Feng and Sam9. Prosecution witnesses, the Accused’s roommates Lily and Seow\n\nFeng and one Lim Geok Mui (‘Wendy’) testified that the Accused had become\n\nsuspicious about the activities of the Deceased and he had been following the Deceased for\n\nsome days i.e. from about 18thMarch 1999 to 24thMarch 1999 in\n\nplaces such as Tampines Central, Marina Square, East Coast Food Centre and City Plaza and\n\ncalling her on the mobile phone she carried.Wendy9.1 It was Wendy’s evidence that she had seen the Accused and\n\ntalked to him at several of these places when she saw him following the Deceased. The\n\nAccused had denied following the Deceased. Wendy went on to testify that she had\n\nintroduced the Deceased in early March to one Hooi Sau Ching ('Sam')’and they became\n\nfriends. Soon afterwards the Deceased, she and Sam met regularly three to four times a\n\nweek. On 20thMarch 1999 Wendy accompanied the Deceased to Johore Bahru in a\n\ncar driven by Sam to obtain a new Social Visit Pass by exiting Singapore. There the\n\nDeceased informed her that she and Sam were going to Genting Highlands she invited Wendy\n\nto come along with them as well. She did so. All 3 slept in Sam’s car that night\n\nafter arriving in Genting Highlands as there was no accommodation available there. They\n\nreturned home the next day on 21stMarch 1999 at about 7pm. Her evidence was\n\nthat the Deceased thereafter began looking for a job, attending one or two interviews but\n\nwas unsuccessful. They began going out daily.Wendy testified that some time after 7 pm on 24 March 1999 the Deceased\n\nreceived a phone call on Sam’s handphone [97948719] when the trio were together. The\n\ncaller was the Accused. Sam handed the mobile phone to the Deceased to speak. Wendy who\n\nwas in the car heard the Deceased telling the Accused, in Mandarin:-\"I have made it clear to you, it is impossible between us. I told\n\nyou clearly.\"\"A woman like me is not suitable for you\".\"You better not accept a woman like me, I hope that you will find\n\na better one.\"\"You better not look for Ah Sam.\"After the call ended, the telephone rang again and this time, the\n\nAccused spoke to Sam and asked him to meet him. Wendy testified that her impression during\n\nthese several days was that the Accused appeared upset at the relationship of the Deceased\n\nwith Sam.Wendy further stated that on the 25thMarch 1999 she had\n\nlunch with the Deceased and Sam at about noon. Thereafter both she and the Deceased took a\n\nbus to Jurong where the Deceased went for a job interview whilst Sam went back to work.\n\nThe Deceased was carrying Sam’s handphone. She received a call from the Accused on\n\nSam’s handphone. After the Deceased spoke to the Accused, Wendy said that the\n\nDeceased had told her that the Accused had threatened her that if she did not return, he\n\nwould commit suicide and she was to watch the news that night on television. The Deceased\n\nthereafter returned to the flat by taxi sometime between 2.00pm and 3.00pm.Wendy went on to say that as soon as she returned home, she called the\n\nDeceased at the flat. The Deceased answered the call and told her to meet her at the flat.\n\nThey intended to go out. Wendy then arrived at the void deck of the flat where the\n\nDeceased lived and called the Deceased from there. However, the Accused answered the phone\n\nthis time. He informed her that the Deceased had left for dinner with her elder sister.\n\nThe Accused soon afterwards again spoke to Wendy after paging her. This time he told her\n\nthat the Deceased had left a message for Wendy that she should wait for the Deceased at\n\nthe bus stop at Bedok South. Subsequently, the Accused spoke to Wendy a third time, after\n\npaging her and told her that the Deceased had gone to Johore Bahru to attend a wedding\n\ndinner and would call her the following day. He then asked her to meet him at the void\n\ndeck of the flat as the Deceased had given him $50/- which the Deceased had requested him\n\nto give to her to pay for her taxi fare back to Bedok South. He accordingly met her at the\n\nvoid deck where she had been waiting and gave her $50/-. Wendy thereafter left.Lily10. Lily testified that on 22ndMarch 1999, the Deceased\n\nrevealed to her that Sam had treated her very well and had also given her $250/-. She\n\nrealised that there were differences between the Deceased and the Accused. The Deceased\n\nhad further revealed to her that she had an argument with the Accused as he had kept\n\nquestioning her about Sam. Although the Deceased had told her not to tell the Accused\n\nabout the money given to her by Sam, Lily had however revealed to the Accused at his\n\ninsistence to confide in him that a sum of $250/- was given by Sam to the Deceased. The\n\nAccused had checked the Deceased’s wallet in the room and seen that the sum of money\n\nwas inside. The Accused had remarked to her that the Deceased had lied to him that she had\n\nreturned the money to Sam. The Accused then told her that he had intended to go out with\n\nthe Deceased and suggest to her to end their relationship. Lily also testified that on 22ndMarch 1999 at 11 pm when the Deceased had still not returned to the room, the Accused had\n\ntold her that Sam and she were only casual friends. The Accused had admitted following the\n\nDeceased as he wanted to see what Sam looked like. He also spoke to her about the Deceased\n\nhaving changed her feelings towards him. Lily said she advised the Accused to take things\n\neasy.As to the events on the afternoon of 25thof March 1999 i.e.\n\nthe day of the incident, the Prosecution adduced evidence that the Accused had used the\n\ntelephone in the flat and had continuously paged for the Deceased prior to the\n\nAccused'’ return to the flat. Lily testified that the Accused had also called her\n\nseveral times earlier that afternoon telling her that the Deceased had not returned to the\n\nflat and had requested her help to page for the Deceased.Sam11. Sam testifying, confirmed the events as narrated earlier by Lily\n\nand Wendy concerning his friendly relationship with the Deceased and the trip to Genting\n\nHighlands and his giving the Deceased $250/-.Psychiatric Evidence12. Dr Stephen Phang, Psychiatric Consultant attached to the Institute\n\nof Mental Health who examined the Accused on six occasions from 27thMarch to\n\n12thApril 1999 put up a Psychiatric Report dated 13thApril 1999\n\nExh. P91. He also put up a supplementary report dated 4thJanuary 2000 after he\n\nhad been requested to review the Accused at the Queenstown Remand Prison after he had\n\nvoluntarily given a further statement to the police as evidenced by Exh. P147.In Exh. P91, Dr Stephen Phang stated that the Accused had told him that\n\nhe had strangled the Deceased to death. He denied strangling her as a result of anger or\n\nof a third party in their relationship. He had also denied any intention on his part to\n\nkill her.Briefly, Dr Phang stated that the Accused had informed him that it was\n\nthe Deceased who requested him to end her life by strangling her. He denied any intention\n\non his part to kill her. The Accused had stated to him that the Deceased had even casually\n\nmentioned committing suicide on several occasions in that week to him. He claimed that she\n\nrefused to divulge her problems to him even though he had queried her. He had denied that\n\nthey had any dispute or conflict prior to the killing taking place. He emphatically denied\n\nstrangling her in anger in the context of a quarrel, either as a result of a third party\n\nin their relationship or any other reason. She had requested that they commit suicide\n\ntogether after they had sexual intercourse. He succumbed to her request, obtained a fruit\n\nknife in the kitchen and cut both his wrists whereupon she asked him to strangle her as\n\ndying by the knife was too painful and he did so. Dr Phang noted in his report that\n\n\"at no time did he feel depressed or suicidal himself. He stated that he had felt\n\n‘a little troubled and uneasy’ in the course of the week preceding the killing,\n\nbut explained that this was due to his awareness of the fact that his girlfriend was upset\n\nand not confiding in him. Even so, he denied feeling depressed in his mood, and was able\n\nto go about his daily activities without any apparent difficulty.\"It was Dr Phang’s opinion that the Accused did not suffer from any\n\nform of mental illness. He was neither depressed nor psychotic at or around the material\n\ntime of the killing, or in the week preceding, when he claimed he first noticed that the\n\ndeceased appeared miserable. The Accused also stated that he attempted to kill himself,\n\nbut was ‘rescued’ by the intervention of the flat owner. He said that he cut his\n\nwrist as felt that he had ‘lived long enough’. However, he denied feeling\n\ndepressed at the time and described even tidying the area around the bed so that they\n\ncould \"die in a neat surrounding\".Dr Phang was also of the opinion that the Accused was fully aware of\n\nthe nature of his actions at and around the material time of the killing from the detailed\n\nand consistent account of the events he gave. The Accused, Dr Phang stated, retained the\n\nability to differentiate between right and wrong, and is therefore not considered to have\n\nbeen of unsound mind at the material time.In Court Dr Phang added that the Accused did not come within any\n\ncriteria under DSM IV (DSM III previously) or any ICD and was not suffering from\n\ndiminished responsibility under S 300 Exception 7 of the Penal Code.In his further report dated 4thJanuary 2000, in an\n\ninterview, the Accused admitted to him that he changed his original statements and that he\n\nhad no wish to die. He had admitted to him (Dr Phang) that he was angry with the Deceased\n\nfor insulting him by communicating her desire to leave him for another man after they had\n\nsex which was the reverse of what he had promised prior to their lovemaking. The Accused\n\nstated that his reason for squeezing the neck of the Deceased was to prevent her from\n\nverbalizing that she wanted to leave him. He admitted that his action was therefore\n\nmotivated by (and reactive to) what he perceived as a betrayal by the Deceased as well as\n\na desire to prevent her from being together with any other man. The Accused admitted to\n\nhim that he was still unaware of the nature of his actions at and around the material\n\ntime.Dr Phang again concluded that the Accused had not suffered from any\n\nmental illness at the time of the killing of the Deceased.The Police Statements of the Accused13. The Prosecution adduced evidence of seven statements made by the\n\nAccused after his arrest. These were admitted in evidence as Counsel for the Accused\n\ninformed the Court that the Defence was not objecting to their admission as he was not\n\nraising any issue as to the lack of their voluntariness. Nevertheless, on my direction,\n\nthe Prosecution adducedprima facieevidence that all the statements were\n\nvoluntarily made. The evidence was unchallenged. The Accused was also invited to testify\n\nafterprima facieevidence had been adduced showing that the statements were\n\nvoluntarily made. The Accused declined to do so. I was in the end satisfied that all the\n\nstatements were voluntarily made by the Accused. I admitted them in evidence as such. The\n\nstatements admitted and marked asExhibits P99, P101, P102, P103, P104, P105andP147were made as follows:(i)Exh. P99(Exh. P99A, a typed copy) - on 26thMarch 1999 at 3.30am recorded by Benjamin Oh at Changi Hospital.(ii)Exh. P101- on 26thMarch 1999 at 11.27am at\n\nCID.(iii)Exh. P102(S 122(6) of CPC) on 20thApril 1999\n\nat 11.16am at CID.(iv)Exh. P103on 21stApril 1999 at 3.01pm at CID.(v)Exh. P104(Exh. P104Aa typed copy) on 28thApril 1999 at 3.43pm at CID(vi)Exh. P105on 28thApril 1999 at 4.32pm at CID.(vii)Exh. P147on 30thDecember 1999 at 3.05pm at\n\nQueenstown Remand Prison.Exhibits P101 to P105andP147were recorded by the\n\nInvestigating Officer.The relevant contents extracted from the statements are as follows:-Exh. P99A:\"………..On 25/3/99 (Thu) @ 3 plus in the\n\n  afternoon, ‘Ah May’ came back. We talked. ……………….Suddenly, in the midst of our conversation, ‘Ah May’ started\n\n  to cry. I asked her what had happened but she refused to tell me. A short while later, her\n\n  mood changed for the better.‘Ah May’ told me that she wanted to make love. We then\n\n  proceed to make love.After making love, ‘Ah May’ started to cry. She told me that\n\n  she has done me wrong.I asked ‘Ah May’ what happened. She refused to tell me and\n\n  suggested that both of us kill ourselves. I again asked her what happened and she still\n\n  refused to tell me.As I was very confused and I waited for her the whole night. ‘Ah\n\n  May’ suggested that I cut my wrists first, then I strangle her neck using my hands.I then leave the bedroom and went to the kitchen to take a knife\n\n  (approximate 6 to 7 inches long) from the sink and cut my wrists.After that, I went to the bedroom and used my hands to strangle\n\n  ‘Ah May’ neck until she fainted.\"Exh. P101:\"I have nothing to say.\"Exh. P102:\"8. On the morning of 25 March 99, when \"Ah May\" had\n\n  failed to return home to sleep, I paged for her. ………….Over the\n\n  telephone, she told me that she would be home later in the afternoon at about 2 to 3 p.m.\n\n  ……………10. On her return home at about 3:00 p.m. …..……………17. We engaged in chatting. However, \"Ah May\" started crying\n\n  shortly afterwards. I asked her why she was crying and she refused to say. Later, she\n\n  asked me to make lover to her. I complied and we made love.18. Ten to fifteen minutes later, \"Ah may\" told me that she\n\n  wanted to commit suicide. I asked her why she wanted to commit suicide and again she\n\n  refused to say anything. She asked me to die with her, saying that if I did not do so, she\n\n  would still commit suicide when she moved out. She said that when that happened, I would\n\n  suffer from guilty conscience all my life.19. After what she had said, I somehow went to the kitchen to get a\n\n  knife. She told me that even though we were going to die, we should not dirty other\n\n  people’s place. I then proceeded to cut both my wrists once with the knife. At the\n\n  sight of me cutting my wrists, \"Ah May\" indicated that she was afraid of the\n\n  pain. She then asked me to strangle her.20. After that time, \"Ah May\" was lying on a mattress. I was\n\n  sitting beside her. I proceeded to put my hands around her neck and squeezed it. Shortly\n\n  after that, when she appeared to have fallen asleep, I stopped in my tracks. I took the\n\n  knife again and cut my own wrists two times more on each side. ……\n\n  …………..\"Exh. P103:\"Q10 - Do you know anyone by the name of \"Sam\"?A10 - No. However I have spoken to a person by the name of\n\n\"Sam\" over the telephone. ….Q19 - On the same day i.e. 25 March 99, did you inform \"Ah\n\nMay\" over \"Sam’s\" handphone that you would commit suicide if she did\n\nnot return to the house i.e. Block 145 Pasir Ris Street 11 #05-75, immediately?A19 - No \"Exh. P104:\"I sat cross-legged on the mattress close to her head. I\n\n  put my hands on her neck with my fingers spread at the side and my thumbs pointing inward.\n\n  At that time she had closed her eyes to let me strangle her. Some 5-6 minutes later she\n\n  seemed to have fallen asleep. I let go of my hands and cut both my wrists with a knife. In\n\n  all, I cut myself a total of 3 times on each wrist.\"Exh. P147:\"33. At about 3:00 p.m., she arrived home in Pasir Ris. …34. In the bedroom, I told ‘Ah May’ not to leave me. I kept\n\npleading with her for a while. Subsequently, she agreed. We then made love.35. 10 to 15 minutes after we have made love, ‘Ah May’ again\n\nmentioned that she was going to leave me. She told me that she was more found of the other\n\nperson. I gathered that the person referred to was ‘Ah Sam’ because I have heard\n\nfrom ‘Lily’ that ‘Ah May’ had got to know a guy named ‘Ah\n\nSam’. I was sad on hearing what ‘Ah May’ had said. I became furious and it\n\npained me to hear that she was leaving me because she was more found of another guy. At\n\nthat time the thought crossed my mind that I wanted to die with her because I could not\n\nbear to have her leave me. I love her very much.36. During that time, ‘ah May’ kept saying that she had\n\nfallen in love with another guy. I was fearful that she would leave me for the other guy.\n\nI was in agony. While she kept saying that, I told her not to say anymore as I was not\n\ngoing to listen to her further. I put my hands around her neck and squeezed it. As I was\n\nsqueezing her neck, I kept telling her not to leave me or we would die together. When I\n\nwas squeezing her neck, she clenched her fists and tried to struggle. I kept squeezing her\n\nneck until she became still.37. When I saw her lying still on the bed, I went to the kitchen to get\n\na knife. Thereafter, I went back to the bedroom and cut my wrist. I cut both my wrists\n\nthree times each. The knife I used was actually a fruit knife that was not sharp.\n\nTherefore, I cut both my wrists three times each on the same site.38. After this, I took a face towel and wiped away the blood on the\n\n    floor. Thereafter, I put the bloodstained towel into a drawer together with the knife. I\n\n    lay beside ‘Ah May’ and waited for death to come upon me. ……\"Prima Facie Case14. It was evident from the Accused’s voluntary statements to the\n\npolice especiallyExh. P147and inferences therefrom and the medical\n\nevidence which I have narrated that the Accused killed the Deceased by strangling her. The\n\nPathologist’s evidence showed as has been narrated earlier that the assailant i.e.\n\nthe Accused had both strangled the Deceased with his hands by applying considerable amount\n\nof manual force and also by a ligature causing her to die from asphyxiation as is evident\n\nfrom the underlying internal injuries found on the neck. The Pathologist had also\n\ncategorically stated that the injuries to the Deceased’s neck were not accidental or\n\nself-inflicted and that the injuries were sufficient in the ordinary course of nature to\n\ncause death.Each element of the murder charge had beenprima facieproved by\n\nthe primary evidence, the bodily injuries present on the neck, that the same were not\n\naccidental or self-inflicted but intentionally inflicted. The Accused’s intention in\n\ninflicting the fatal injuries were clear in view of the Pathologist’s evidence that a\n\nconsiderable amount of manual force was used in pressing the neck of the Deceased as\n\nevidenced by the Deceased’s haemorrhages in the underlying tissue of the neck, larynx\n\nand food passage and also by a string-like object i.e. a ligature pressed against the\n\nDeceased’s neck from the front resulting in the Deceased’s death from\n\nasphyxiation. As the Accused’s intention wasprima facieproved, the\n\nsufficiency of the injuries was for the Court a purely objective inference to draw. I wasprima\n\nfaciesatisfied on all the evidence that the injuries caused by the manual\n\nstrangulation and those caused by ligature independently or collectively, were sufficient\n\nin the ordinary course of nature to cause death and had caused the death of the Accused.Psychiatric evidence further showed that the Deceased was not of\n\nunsound mind at the time of the offence. It was for the Accused to establish any of the\n\nexceptions to s 300 of the Penal Code which provide formal mitigation and reduce the\n\noffence of murder to simple culpable homicide.I therefore called upon the Accused to enter upon his Defence.The Accused elected to give evidence on oath.Defence15. The Accused testified that he had come to know the Deceased some 9\n\nmonths earlier. They became intimate lovers soon afterwards. Some time in early March, he\n\ninvited her to stay with him in a room which he was occupying with the two other Malaysian\n\nfemales Seow Feng and Lily.16. On the 22ndof March he learnt from Lily that the\n\nDeceased had gone to Genting Highlands with another youth. He was angry when he heard the\n\nnews from Lily. He had earlier suspected her of having a new boyfriend and had been\n\nfollowing her. He said the Deceased had started coming home late at night and on the night\n\nof the 24thMarch she had altogether failed to return to his room despite his\n\nhaving paged for her and sought the assistance of Lily to do the same.16.1 On the afternoon of the 25thof March 1999 he paged for\n\nher repeatedly and finally spoke to her on the telephone a few times, eventually informing\n\nher to come back to the flat and told her that if she refused to come back, she could read\n\nfrom the newspapers and find out from the news on the television about his having\n\ncommitted suicide. However when asked by his Counsel ,\"Did you intend to do what\n\nyou said?\"his answer was \"No\". His purpose he said was to use the\n\n‘suicide’ as a ‘pretext’ to make her return to the flat. Thereafter\n\nthe Deceased returned to the flat at 3pm. He was very happy. However, shortly later he\n\nlearnt from Wendy that both of them would be going out again. As he wanted to talk to the\n\nDeceased, he asked her whether she was going out again but she did not answer his\n\nquestion. He did not want her go go out as he wanted to talk to her about their\n\nrelationship which they started to do after she had a bath. He told her to think about the\n\nmatter carefully. He told her that he loved her genuinely and that it did not matter if\n\nshe had lied to him or had hidden things from him previously as long as she came back to\n\nhim. The Deceased began to cry. He wiped the tears off her eyes and she apologised to him.\n\nShe then nodded her head when he asked her if she would come back to him. They then had\n\nsexual intercourse. He believed he ejaculated outside her body.16.3 However, after the intercourse when he was about to go out and\n\ntake a bath, the Deceased said that she was fond of the other man whom he knew was Sam.\n\nShe told him that he had a more successful career than he did. Upon hearing that he\n\nsqueezed her neck with his hands to prevent her from speaking about the other man. He kept\n\nasking her why she had wanted to lie to him. After some time, she became motionless. He\n\nthough she had fainted and he let her sleep covering her with a blanket and thereafter\n\nlying beside her.16.4 He got up a little later and went to the hall as he was very\n\ntroubled. He then entered the kitchen and saw a knife on the kitchen sink. He returned\n\nwith it to the room. He thought he had to prove his love to the Deceased. So he cut his\n\nwrists pacing the room. He thought that if the Deceased knew what he did, she would come\n\nback to him. He again stated that he had intended to kill himself by cutting his wrists.Asked further by his Counsel as to whether the contents of his police\n\nstatementsExhs. P99, P101-102were true where he stated that the Deceased had\n\nasked him to cut his wrists and then to kill her, he stated that the statements in that\n\nversion were untrue. He did not state the truth because he was afraid as he could not\n\naccept the facts. Asked to elaborate by Prosecuting Counsel later as to what he meant by\n\n\"could not accept the facts\" he stated that he could not accept the fact that he\n\nhad caused the death of the Deceased with his hands. When asked specifically by his\n\nCounsel whether his further statement inExh. P104was true that the Deceased had\n\nlet him strangle her, he again stated that the statement was not true.16.5 The Accused also went on to state that the statements he had made\n\nto the Psychiatrist and reported by the Psychiatrist in his report were not a true account\n\nof what he had stated and he had made them because he was following his earlier police\n\nstatements.  The Accused thereafter revealed that the statements he made inExh.\n\nP147were the true and correct version of the events that had transpired leading to\n\nhis strangling the Deceased and the cutting of his own wrists.17. InCross-Examinationby the Prosecution, the Accused stated\n\nthat after he had found that the Deceased had fainted from his strangulation it did not\n\noccur to him to wake her up or call for help; that he was unaware that she was dead after\n\nhe had strangled her; that he had no intention to commit suicide when he cut his hands;\n\nthat he had not applied pressure on his wrists to stop them from bleeding; that he had not\n\nfelt as if he was losing consciousness; that he did not try to wake up the Deceased to\n\nshow her that he had cut his wrists which should have indicated to her that he loved her.\n\nHe did not do this because he was worried for her if she saw blood on his hands; that he\n\nagreed that there was no suicide pact between the Deceased and himself and that the\n\nDeceased did not consent to be strangled by him; that the Deceased had no knowledge that\n\nhe was cutting his wrists as she had already fainted; that he had strangled her because he\n\ndid not want to hear her affairs with the other man of whom he learnt she was found of and\n\nhe had to stop her from saying further; that the Deceased did struggle when he was\n\nstrangling her; that the injuries to the Deceased’s outer elbow were caused when he\n\nsqueezed at her elbows and her body when sitting or straddling over her; that he had\n\npreviously told Lily that he would break off his relationship with the Deceased because of\n\nthe other man; that he had not killed the Deceased in a fit of jealousy, but had done so\n\nbecause he could not bear the Deceased’s lying to him on numerous occasions and also\n\nwanted her to stop mentioning things about the other man; he disagreed that there was\n\nnothing new the Deceased had told him which he did not already know just before he\n\nstrangled her; he disagreed that he had cut his wrists to support his version of a suicide\n\npact as narrated in his earlier police statements.Evaluation and Findings18. I considered the entire history of the events from the intimate\n\nrelationship of the Deceased and the Accused over some 8 or 9 months to her attraction for\n\nanother boy known as Sam which attraction had fatal consequences for her at the hands of\n\nthe Accused.19. After his arrest, the Accused had in his statementsExhs. P99A,P102 and P104stated to the police to the effect that the Deceased had told him on\n\n25 March 1999 that they should both end their lives although she did not say why. He said\n\nshe had asked the Accused to cut his wrists and then to strangle her neck. Accordingly, he\n\nthen cut his wrists and strangled. The clear impression from his statements was that it\n\nwas a suicide pact between lovers although he later survived. However, shortly before the\n\nPreliminary Inquiry some months later, the Accused volunteered a new statementExh.\n\nP147retracting the earlier statements as to how the Deceased’s death resulted.\n\nIn the new statement he said she had told him that she wasfondof the other person\n\nand had fallen in love with him. This had made him angry and furious as he believed she\n\nwould leave him. He thereupon told her to say no more and that he was not going to listen\n\nto her and had thereafter strangled her. In the new statement, he said he had neither\n\nconsented to being strangled nor had asked him to cut his wrists.20. Essentially the Accused’s defence in Court was not very\n\ndifferent from that put forward inExh. P147. He stated in Court that during a\n\ndiscussion on 25 March 1999 to resolve their relationship the Deceased had agreed to\n\nremain his girlfriend. They then had sexual intercourse. However, shortly afterwards, the\n\nDeceased told him that:(i)she was fond of the other man (Sam) and did not want to hear\n\nanymore about it;(ii)that the other man had better career prospects than him and(iii)further that he was angry as she had lied previously to him\n\nwhich included her hiding many things from him.. The Accused’s defence was that all this amounted to provocation\n\nand he reacted to the provocation by squeezing her by the neck with his hands to prevent\n\nher speaking about the other man. He had squeezed her neck until she became motionless.21. I accepted as probable and true the version of events as narrated\n\nby the Accused in Court and in the new statementExh. P147.Exh. P147had\n\nnot been sought by the police but the Accused had taken the initiative and called for the\n\nInvestigating Officer when in remand to make the statement to him shortly before the\n\nPreliminary Inquiry and when the investigations were long completed. It was admitted\n\nwithout objection as being voluntarily made and thus substantially ensured its truth.22. I found that the Accused had realised that his earlier accounts inExhs.\n\nP99A, P102 and P104did not fit in with the expert forensic evidence. Otherwise, there\n\nwas no reason for the Accused to recant his earlier statements and to admit that there was\n\nno suicide pact and to go and admit that he had strangled her because she was in effect\n\ndumping him for Sam whose qualities she preferred, all of which he could not bear to hear.\n\nThere was no reason for the Accused finally to make these admissions inExh. P147and in his evidence in Court unless they were true. The Accused was entitled to ground his\n\ndefence of provocation on these facts as he did. I shall now consider the law and the\n\nevidence in its totality in assessing his defence on his evidence in Court and the\n\nrelevant facts narrated inExh. P147.23. Under S 300, Exception 1 of the Penal Code, for the defence of\n\nprovocation to succeed so as to reduce an offence of murder to culpable homicide, an\n\noffender’s power of self-control must be deprived by grave and sudden provocation.24. I accepted the Accused’s account that the Deceased made the\n\nutterances complained of by the Accused on the afternoon of the 25 March 1999 in view of\n\nthe corroborating evidence of the deteriorated relationship between the Accused and the\n\nDeceased as expressed by Wendy, Lily and Seow Feng her roommates as set out earlier. The\n\nDeceased’s utterances, however, constituted at the highest only a very amildform\n\nof provocation and not agraveprovocation as envisaged by the Penal Code. Again\n\nthere was nothingsuddenin the utterances made or intimations given to the\n\nAccused. The Accused had already known that the Deceased had started to go out with Sam as\n\ntestified to by the Deceased’s roommates The Deceased had specifically told the\n\nAccused about two days earlier over the phone as appears from the evidence of Wendy, which\n\nfact the Accused admitted, that the Deceased had made it clear to him that their\n\nrelationship was impossible, that she was not suitable for him and not to accept her and\n\nthat he should find a better one and that he further had better not look for Sam. Further,\n\nLily a mutual friend, had testified that previously the Accused had told her he\n\ncontemplated suggesting to the Deceased that they end their relationship. This evidence\n\nhad not been challenged by the Accused. The Accused had therefore plenty of time to\n\nreflect coolly over his relationship with the Deceased. Lily had also advised him earlier\n\nto take things easy.25. The Accused had in my opinion therefore plainly overacted to the\n\nwords of the Deceased declaring her intention to leave him for Sam on that fateful\n\nafternoon. In my opinion, he further failed to display the level of self-control expected\n\nof an ordinary person when the Deceased made the utterances complained of. There was\n\nnothing to suggest in the evidence that the Deceased had mocked the Accused or had\n\ninsulted him or otherwise subjected him to indignity by her conduct in making known to him\n\nher fondness for Sam. The severity of degree of loss of self-control was simply not\n\ncommensurate with the mild provocation. The law is that the defence of provocation is not\n\navailable to those who over-react because they are exceptionally pugnacious, bad-tempered\n\nor over-sensitive. I find the Deceased was over-sensitive and had grossly over-reacted out\n\nof jealousy although he denied the same in intentionally injuring the Deceased fatally.26. Finally, I would add that the Accused had also throughout his\n\nevidence testified that the Deceased had only fainted as a result of his strangling her\n\nand that she was only asleep. He admittedly did nothing to try to wake her up or seek help\n\nif that was so. His explanation was that he did not do so as she would have been\n\nfrightened by the blood on his hands and on her body. This was a feeble explanation and I\n\nrejected it. I was satisfied that the Accused knew he had strangled the Deceased to death.\n\nThe Accused not only applied considerablemanualforce but also went on to apply\n\npressure on her neck by aligaturethereby independently or collectively causing\n\nserious injuries to the neck structure and causing her to die from asphyxiation. The\n\nAccused’s denial that he had used a ligature to strangle her was a lie as it went\n\nagainst the established evidence which showed such a ligature was used as can clearly be\n\ndiscerned from the photographs taken during the post mortem (Exhs. P57 –59, P61\n\nand P62) and the exposed underlying injury inExh. P73.In his earlier version\n\nof events as stated in his recanted statements he had tried to give a false impression\n\nthat there was a suicide pact between him and the Deceased to dupe the police in case he\n\nwas apprehended. His new versionExh. P147as amplified in Court that he had cut\n\nhis wrists as he wanted to die anyway after he found the Deceased motionless was totally\n\nunconvincing and I rejected it.27. Further, I accepted the evidence of the psychiatrist that the\n\nAccused was fully aware of the nature of his actions all the time and was neither of\n\nunsound mind nor suffering from diminished responsibility at or about the time he\n\ncommitted the offence in as much as the defences were not raised.Conclusion28. In the circumstances, I found the Accused guilty on the amended\n\ncharge of murder, convicted him and sentenced him according to law.Dated this 15thday of March 2000AMARJEET SINGHJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}