{
    "case_title": "Public Prosecutor v Mohamed Noor bin Abdul Majeed",
    "ncitation": "[2000] SGHC 93",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Background facts": "On 28 January 2000, the appellant pleaded guilty to the following charge:You, Mohamed Noor bin Abdul Majeed, are charged that you, on or about 11 August 1999, at or about 7.40pm, at Kampong Glam Police Post, Singapore, without lawful authority or lawful excuse made use of an identity card other that (sic) your own, to wit, the identity card bearing number S1616463A which belongs to one Ahmad bin Yahaya and you have thereby committed an offence punishable under s 13(2)(b) of the National Registration Act (Cap 201).In the statement of facts, which were admitted without qualification, it was stated that the appellant had, on 11 August 1999, gone to the Kampong Glam Neighbourhood Police Post to lodge a police report pertaining to his lost identity card. However, as the appellant knew that he was unlawfully at large for failing to return to the Changi Reformative Training Centre, he decided to give a false name to the police officer attending to him. The police officer found the appellant`s behaviour suspicious and decided to conduct a check on the appellant. The check revealed that the appellant was carrying in his rear trouser pocket, a Singapore  identity card belonging to one Ahmad bin Yahaya. The appellant was not able to give a satisfactory account as to why he was in possession of the said identity card which did not belong to him. The appellant was thus arrested and charged accordingly as a result.",
        "The decision below": "After the appellant pleaded guilty and was convicted of the charge, his previous criminal records were read out for consideration by the trial judge for the purposes of sentencing. The following antecedents were admitted to by the appellant:(i) On 7 July 1995, he was convicted for affray under s 160 of the Penal Code (Cap 224) and was placed on 18 months` probation.(ii) On 16 February 1996, he was convicted on three charges of theft of a motor vehicle under s 379A, Penal Code, and was sentenced to reformative training. On the same occasion, the appellant consented to two charges under s 379A and s 457 of the Penal Code being taken into consideration.The trial judge was also informed that the appellant was currently still undergoing reformative training, after being recalled from supervision for failing to comply with instructions issued to him.After listening to the appellant`s mitigation plea, the trial judge was minded to give him another chance to reform as he was under 21 years old and was still eligible for reformative training. The trial judge then took into account the decision inNg Kwok Fai v PP[1996] 1 SLR 568, in which the High Court had held that consecutive terms of reformative training were not desirable. Feeling himself bound by the decision, the trial judge ordered the appellant to undergo reformative training with the sentence to commence on the same date as his existing term of reformative training.",
        "Criminal Revision No 4 of 2000": "The first petition for criminal revision was made by the trial judge himself. In preparing his grounds of decision for the appeal, the trial judge discovered that the statement of facts did not satisfy the charge preferred against the appellant. The charge had erroneously stated that the appellant hadmade use ofan identity card belonging to another person when the facts revealed that the appellant was onlyin possession ofthe said identity card. The offence in fact committed by the appellant was therefore beingin possession ofan identity card other than his own, without lawful authority or reasonable excuse. As was pointed out by the trial judge in his petition for a criminal revision, this was incidentally also an offence under the same section as that stated in the charge, ie s 13(2)(b) of the National Registration Act (`NRA`), and it carries the same prescribed punishment as the charge which the appellant had pleaded guilty to. The trial judge was of the view that the error in the charge constituted sufficient ground for the High Court to exercise its revisionary powers and hence the petition for revision was made.The relevant statutory provisions dealing with the revisionary powers of the High Court are s 23 of the Supreme Court of Judicature Act (Cap 322) and s 268  of the Criminal Procedure Code (Cap 68) (`CPC`). In particular, s 268 of the CPC reads as follows:(1) The High Court may in any case, the record of the proceedings of which has been called for by itself or which otherwise comes to its knowledge, in its discretion exercise any of the powers conferred by sections 251, 255, 256 and 257.(2) No order under this section shall be made to the prejudice of the accused unless he has had an opportunity of being heard either personally or by advocate in his own defence.(3) Nothing in this section shall be deemed to authorise the High Court to convert a finding of acquittal into one of conviction.The general position established by the local authorities is that the revisionary jurisdiction and powers of the High Court must be exercised sparingly. In all cases where the court has exercised its powers of revision, there has been some form of serious injustice which warrants the exercise. InAng Poh Chuan v PP[1996] 1 SLR 326at 330, I had summarised the governing principles in the following terms:Thus various phrases may be used to identify the circumstances which would attract the exercise of the revisionary jurisdiction, but they all share the common denominator that there must be some serious injustice. Of course there cannot be a precise definition of what would constitute such serious injustice for that would in any event unduly circumscribe what must be a wide discretion vested in the court, the exercise of which would depend largely on the particular facts. But generally it must be shown that there is something palpably wrong in the decision that strikes at its basis as an exercise of judicial power by the court below.This statement has been endorsed in subsequent cases and the same principle was reiterated in my recent decision inNgian Chin Boon v PP[1999] 1 SLR 119.At first glance, the situation in the present case may appear to be somewhat similar to the factual scenario that arose inPP v Koon Seng Construction Pte Ltd[1996] 1 SLR 573. In that case, there was also an error in the charge arising out of a clerical mistake. The accused there was to be charged under s 25(1) of the Destruction of Disease-Bearing Insects Act (Cap 79) (`DDBIA`) and had intended to plead guilty to such a charge. However, the charge that was read out in court and to which the accused pleaded guilty was, through a clerical error, for an offence under s 6(1), DDBIA, instead. As a result of the error, the sentence imposed on the accused was higher than that which would have been given had the charge been correctly stated to be under s 25(1), DDBIA. After the mistake was discovered, a petition was made to the High Court for an exercise of its revisionary powers. The High Court found that there was never any doubt which offence the accused had committed and that the accused was still willing to plead guilty to the amended charge in the correct form. The High Court then went on to hold that it has, in its revisionary capacity, the implied power to correct errors in the charge pursuant to s 256(b)(ii), CPC, and this would include the power to amend the charge to introduce the appropriate offence section. As a serious injustice was caused to the accused, who suffered a more severe sentence as a result of the error, the High Court exercised its revisionary powers and amended the charge and the sentence accordingly.Reverting to the facts in the instant case, the error in the charge appeared to be due to a negligent oversight in the drafting of the charge. Following the decision inPP v Koon Seng Construction Pte Ltd(supra), it was clear that the High Court has the power to amend an erroneously stated charge when exercising its powers of revision. I was, however, of the view that the present circumstances did not warrant an exercise of the High Court`s revisionary powers as the error in the charge was so minor it could be rightly regarded as immaterial. Section 162 of the CPC provides that no error in stating either the offence or the particulars required to be stated in the charge shall be regarded at any stage of the case as material unless the accused was in fact misled by that error. It is further stated in s 396, CPC, that no finding or sentence made by a court shall be reversed or altered on account of any error or irregularity in the charge unless the error or irregularity has occasioned a failure of justice. In the present case, it had always been apparent to all parties which offence was committed by the appellant and as alluded to earlier, the offence was one under the same sub-section in the NRA as was stated in the erroneous charge. Therefore, unlike the situation inPP v Koon Seng Construction Pte Ltd, the proposed amendment did not introduce a charge under a different provision and the prescribed punishment for the amended charge would remain unchanged from the present. Such being the case, the proceedings below would have taken exactly the same course even if the charge had been correctly drafted in the first place since the appellant clearly intended to plead guilty and admit to the statement of facts without any qualifications. Thus, I saw no necessity to invoke the revisionary jurisdiction of the High Court with regard to this negligible discrepancy in the wording of the charge since the appellant was not misled by the error at all and neither did the error occasion a failure of justice. Accordingly, I dismissed the petition under CR 4/2000.",
        "Criminal Revision No 5 of 2000": "The next petition for criminal revision was brought by the Public Prosecutor and it related to the sentence imposed by the trial judge. In the court below, when the trial judge ordered the accused to undergo further reformative training, he also ordered the sentence to run concurrently with the appellant`s previous term of reformative training by having it commence on the same date as the earlier sentence, ie on 16 February 1996. It was submitted by the prosecution that the trial judge`s order for concurrent sentences of reformative training was inappropriate.The detention and release of persons sentenced to reformative training is governed by Sch D to the CPC and can be summarised briefly in the following manner:(i) an offender sentenced to reformative training is detained in a reformative training centre (`RTC`) for a maximum period of three years (36 months) from his date of sentence;(ii) the offender may be released from detention into supervision any time after 18 months of detention and such supervision will continue until the end of four years from the date of his sentence;(iii) while under supervision, the offender must comply with the requirements as may be so specified; and(iv) if the offender fails to comply with any of the requirements while under supervision, he may be ordered to be recalled to the RTC for further detention  until the end of three years from the date of his sentence or the end of six months from the date he is taken into custody under the order of recall, whichever is the later. Provided that such further detention will not extend beyond the end of four years from the date of his sentence.Here, the appellant had been sentenced to reformative training for a prior conviction and was first detained in a RTC on 16 February 1996. He was detained for 34 months and 22 days before being released into supervision on 6 January 1999. The appellant`s term of supervision was to expire on 15 February 2000, which was exactly four years after his date of sentence under the previous conviction. However, during his term of supervision, the appellant disobeyed the instructions of his Aftercare Officer by refusing to go to work and therefore an order of recall dated 27 April 1999 was issued against him. Thereafter, the appellant remained unlawfully at large until he was arrested for the present offence.In ordering concurrent sentences of reformative training, the trial judge had relied on the High Court decision inNg Kwok Fai v PP[1996] 1 SLR 568. InNg Kwok Fai`scase, the accused was placed on probation for 18 months on 28 June 1995 after pleading guilty to a charge of rioting with hurt. On 13 October 1995, the accused pleaded guilty to an offence of unlawful assembly and was sentenced to undergo reformative training. Soon after on 28 November 1995, the accused was brought before a trial judge for breaching his probation order due to the conviction for unlawful assembly. The trial judge sentenced him to imprisonment and caning which was to run consecutive to the reformative training sentence. On appeal, the High Court held that the sentence of imprisonment and caning consecutive to reformative training was inappropriate as it ran counter to the aim of reformative training. Substituting the sentence with an order for reformative training, the court went on to hold that, as reformative training sentences should never be ordered to run consecutively since it would be wrong in principle and could give rise to problems in practice, the second reformative training was to commence on the same date as the first.With due respect to the trial judge in our present case, it seemed to me that he had misapplied the case ofNg Kwok Fai v PP. In our case, the problem of consecutive reformative training sentences did not arise at all by virtue of the operation of para 4 of Sch D to the CPC. The relevant para 4 provides as follows:If any person while under supervision, or after his recall to a reformative training centre, as aforesaid, is sentenced to corrective training or reformative training his original sentence of reformative training shall cease to have effect; and if any such person is so sentenced to imprisonment, any period for which he is imprisoned under that sentence shall count as part of the period for which he is liable to detention in a reformative training centre under his original sentence [Emphasis added.]Paragraph 4 of Sch D to the CPC was directly applicable to our present facts as the appellant was sentenced to further reformative training after he was recalled to a RTC from supervision. Therefore, applying the provision, the earlier sentence of reformative training would cease to have effect and as such, there would be only one sentence of reformative training, which would be the one being imposed for the present offence under the National Registration Act. The reasoning  employed in theNg Kwok Faicase did not apply here since there was only one sentence of reformative training in question. This was reinforced by a reference to the second part of para 4 of Sch D, which contemplates a sentence of imprisonment being imposed on an offender who is under supervision or serving further detention in a RTC pursuant to an order of recall. The imposition of a sentence of imprisonment would not be possible if the holding in Ng Kwok Fai was applicable to such a situation.Furthermore, to order the appellant`s sentence to commence on the same date as his first term of reformative training, ie on 16 February 1996, would effectively mean that the appellant has already completed serving his sentence and would have to be released practically immediately since the maximum period of detention and supervision under his first order would have already expired on 15 February 2000, four years after his date of sentence for the previous conviction. This was obviously an absurd result and would mean that the sentence given was manifestly inadequate for the offence committed.",
        "Ng Kwok Fai v PP": "was plainly distinguishable from the present case. In the earlier case, para 4 of Sch D to the CPC was not applicable as the accused there was not under supervision or serving further detention under an order of recall when the second sentence of reformative training was imposed. The date of the second sentence was also relatively close to the date of the first sentence and the accused had only served a short term of detention under the first order of reformative training. By contrast, the present case involved a time gap of more than 47 months between the earlier sentence of reformative training and the second one. The application of the principles inNg Kwok Fai v PPby the trial judge to the present case was therefore misconstrued.From the above discussion, it was apparent that the order for the sentence of reformative training to commence on the same date as the appellant`s earlier term of reformative training was erroneous. The present circumstances clearly justified the exercise of the High Court`s revisionary powers, which would include the power under s 256(c) of the CPC to alter the nature of the sentence. Consequently, I allowed the petition under CR 5/2000 and ordered the sentence to be amended to commence on the date of sentencing, ie on 28 January 2000.",
        "Magistrate`s Appeal No 28 of 2000": "I now move on to deal with the appellant`s appeal against his sentence. In this regard, the appellant tendered a hand-written note setting out the mitigating circumstances in his favour. The circumstances mentioned by the appellant dealt mainly with his family problems. He alluded to his parents` divorce when he was a young child and the fact that his mother was currently undergoing treatment in a drug rehabilitation centre. His younger brother was in the Boys` Home while his younger sister was placed under probation. The appellant also had a girlfriend who had just given birth to their second child. He claimed that he wanted to be responsible by taking care of his girlfriend and their two children as well as his siblings. He pleaded for leniency, claiming that he had learnt his lesson and had changed for the better.Generally, an appellate court will not interfere with the sentence passed below unless there was some error, whether in fact or in principle, or the sentence was manifestly excessive or inadequate. From his grounds of decision, it was clear that the trial judge had taken into proper consideration the appellant`s antecedents and his various mitigating circumstances before passing sentence. There was nothing to suggest that the sentence passed was erroneous either on the facts or on the law.Was the sentence manifestly excessive? I did not think so. The offence committed by the appellant under s 13(2) of the NRA, of being in possession of an identity card of another person without lawful authority or reasonable excuse, was a serious offence. This was evident from the fact that the offence was deemed to be a seizable one and the heavy punishment prescribed for it, which carried a fine not exceeding $10,000 or imprisonment for a term not exceeding ten years or both. On this issue, I agreed with the submissions made by the prosecution that the severe punishments prescribed underlie the Parliament`s clear message that offences connected with the unlawful use of Singapore identity cards must be effectively dealt with to prevent their abuse and to ensure their security and integrity. This was especially important in light of the growing proliferation of abuse of Singapore identity cards by illegal immigrants gaining unlawful entry into Singapore.Taking into consideration all the various factors, such as the gravity of the offence committed as well as the appellant`s antecedents, it was obvious that the sentence of reformative training imposed by the trial judge was not manifestly excessive at all. The appeal against sentence was therefore dismissed.Outcome:Criminal Revision No 4/2000 dismissed; CR 5/2000 allowed; appeal against sentence dismissed.Copyright © Government of Singapore."
    }
}