{
    "case_title": "Linda Lai Swee Lin v Public Service Commission",
    "ncitation": "[2000] SGHC 162",
    "coram": "MPH Rubin J",
    "sections": {
        "The applicant’s probation": "7 The applicant commenced her appointment\n\non 28 November 1996 and in the normal course would have completed her probation on 27\n\nNovember 1997. She was, when she first started her appointment, designated Head (Legal)\n\nreporting to the Deputy Commissioner of Land, Mr Liew Choon Boon (\"DCOL\"). On or\n\nabout 30 June 1997, about 7 months after she commenced her probation, she was requested by\n\nthe DCOL to take on added responsibilities.8 In the course of her duties, the\n\napplicant oversaw the operations of the Lease Administration Section in carrying out title\n\nmanagement work, in particular, lifting of title restriction, upgrading of lease tenure\n\nand enforcement of the covenants.9 Under the IM, a confidential staff\n\nreport was required every six months during the probationary period of all public servants\n\nThe applicant was given such a staff confidential report form to be completed and passed\n\non to her immediate superior (DCOL) for the two six-month period during her probation. IM\n\nNo. 2 B.42 provided that if an officer were to receive an adverse report within the first\n\nsix months, the Permanent Secretary of the Ministry should verbally inform the officer of\n\nhis or her shortcomings. If these shortcomings were to persist in the next six months, the\n\nofficer was to be informed in writing.10 The applicant never received, at any\n\ntime during her probationary period, any adverse report nor was she informed verbally or\n\nin writing of any shortcomings or that she was not performing up to expectation.11 At the end of the applicant’s\n\nprobationary period, sometime in November/December 1997, she asked her immediate superior,\n\nDCOL about her appraisal. He replied that he had requested DA2 (Mr Leong Foke Meng) to\n\nappraise her and that the latter had given her a ‘generous’ appraisal. She\n\ntherefore expected her confirmation to be no more than a mere formality.12 She highlighted the aspect that if the\n\nPermanent Secretary had indeed decided to extend her probation or not to confirm her, the\n\nIM obliged the Permanent Secretary to inform her of his decision in sufficient time before\n\nher probationary period ended (IM B66). She received no indication at any time during her\n\nprobationary period that the Permanent Secretary had decided not to confirm her or to\n\nextend her probation. She added that according to Appendix B-5 of the IM, she was,\n\nconsequently, entitled to be treated as confirmed as of the date immediately following the\n\ndate of her normal period of probation. As the events unfolded, in or around December\n\n1997, the applicant enquired from the then Commissioner of Lands (COL) regarding her\n\nletter of confirmation. She then received a reply with the words to the effect that there\n\nwas no hurry and that when the letter was issued, the arrears of increment would be paid.\n\nHence, she did not pursue the matter further and expected the confirmation letter in due\n\ncourse.13 In or about March 1998, Director\n\nAlienation 1 (\"DA1\"), Mr Gaw Seng Suan, who had previously left for the private\n\nsector, rejoined the Civil Service. He was re-appointed to the same position.14 A meeting was called on 29 May 1998,\n\nattended by DCOL as Chairman, DA1, DA2 as well as the other section heads including the\n\napplicant. The said meeting was called because the then President, Mr Ong Teng Cheong, had\n\nqueried on the inefficiency of the Land Office with respect to land titles which had been\n\nforwarded to him for approval after years of delay. It was discovered that 128 titles had\n\nbeen delayed, some for between 10 and 20 years.15 Following the meeting, having knowledge\n\nthat DA1 and DA2 had not accurately reflected the extent of the backlog, the applicant\n\nsent an electronic mail dated 30 May 1998 to DCOL who was her immediate superior. The\n\nletter was copied to the then COL (Mr Low Oon Song). The said electronic mail read as\n\nfollows:I refer to the meeting yesterday.I was surprised that both DA1 and DA2 did\n\n  not inform you that there are many more outstanding cases not in CTS, the ‘real’\n\n  backlog cases.I come from Malaysia where there is much\n\n  inefficiency and corruption. I could not accept such a situation, hence I readily accepted\n\n  Singapore citizenship.Unfortunately, I find that there are\n\n  delays and backlog in Alienation Division. I believe I have a duty to bring them up, so\n\n  that you are aware of the seriousness of the problem and not be kept in the dark.…Lucy (one of the Section Heads) mentioned\n\n  that there are some cases that \"she will clear in her own time.\" during the\n\n  meeting. May I suggest that you e mail to DA1 and DA2 to give you a list of all\n\n  outstanding cases not in CTS.Only then you would realise the extent of\n\n  the delays/backlog. A deadline can then be fixed to clear all such backlog. If not, they\n\n  will merely accumulate and increase over the years eg the file I routed to you (DP paid 4\n\n  years ago & Supplemental Deed not even executed).…I bring this up in good faith, for the\n\n  good of the Land Office in the long run. Also in the spirit of PS 21, & not to find\n\n  fault with others.As a responsible Singaporean, I cannot\n\n  just keep quiet & be unconcerned, when I know that delays and backlog are not being\n\n  resolved for years. In my opinion, Directors should ensure that their Divisions run\n\n  efficiently, thank you.16 The applicant had, even at the time of\n\nsending that electronic mail, ie after 1 years in service, never received any adverse\n\nreport nor was she informed of any shortcomings on her part, whether orally or in writing.17 On 1 June 1998, the day following the\n\ntransmission of the electronic mail, the applicant was verbally informed by the then COL\n\nthat he would not confirm her as there was conflict and friction between herself and DA1.\n\nThis was the first time that she had heard of this and she was therefore surprised and\n\nupset. The announcement not to confirm her had come out of the blue. Her explanation to\n\nthe COL that the friction was due to the conflict of hierarchy was apparently not\n\nwell-received.",
        "Retrospective extension of probation": "18 On or about 24 August 1998, about 9\n\nmonths after her probationary period had ended, the applicant received a letter dated 19\n\nAugust 1998 through DCOL, DA2, and DA1 which stated that:1. … Based on the recommendation from\n\n  the appraisal reports in respect of your service from 28 Nov 96 till 27 Nov 97, we regret\n\n  to inform your that you are unable to be confirmed in your appointment.2. However, approval has been granted for\n\n  the extension of your probationary period for 1 year with effect from 28 November 1997 to\n\n  27 November 1998. …3. As adverse reports have been received\n\n  in respect of your service from 28 Nov 96 to 27 Nov 97, we are to inform you of your\n\n  shortcomings. This is in order for your to make improvements necessary for your\n\n  confirmation in service, failing which termination of your service may be considered.19 This was the first time the applicant\n\nhad heard of ‘adverse reports’. In fact, no adverse reports of any nature had\n\nbeen received or heard of by her between the period 28 November 1996 and 27 November 1997,\n\nas alleged.20 The applicant was taken aback. Nearly\n\nnine months after her purported confirmation date, she was told that she would be placed\n\non probation for another year, to be backdated to 27 November 1997, the date her initial\n\nprobationary period should have ended. Her plaint was that if she had been\n\nunderperforming, the IM obliged the Permanent Secretary to inform her of any adverse\n\nappraisal early during her probationary period, which the Permanent Secretary did not, to\n\nenable her to know what her perceived shortcomings were, and to take steps to improve. The\n\nIM also obliged the Permanent Secretary to inform the applicant well before the end of her\n\nprobationary period if a decision was made not to confirm her or to extend her\n\nprobationary period. This however, was not done. At any rate, the purported extension of\n\nher probationary period for one year was a myth. In reality it was only for three months\n\nsince nine months had already elapsed by the time she was notified of the extension of the\n\nprobationary period with retrospective effect.21 By a letter dated 1 September 1998, the\n\napplicant sent a protest to the new COL informing him amongst other things that:At no time was I informed that I failed to\n\n  meet job performance standards.No specific instances of faults or\n\n  shortcomings was pointed out to me during my probation period.There was no legitimate reason for the\n\n  ex-COL not to confirm me after my probation period. The friction with D/A1 arose because\n\n  the hierarchy was not clear and I had highlighted delays and backlog in Alienation\n\n  Division.…I have been unfairly penalised because I\n\n  have highlighted delays and backlog in Alienation Division. However, I did so in good\n\n  faith and in the spirit of PS21. As a responsible Singaporean, I cannot be silent when I\n\n  know that delays and backlog are not being resolved for years. No adverse report was made\n\n  known to me during the probation period or thereafter, until HR’s letter. On receipt\n\n  of the letter, I enquired of D/A2 whether he had put up my appraisal and whether he had\n\n  given me an adverse report. He refused to answer both questions....I also request a transfer from Alienation\n\n  Division.In view of the conflict with D/A1 for 2\n\n  months, it would not be appropriate for D/A1 to put up my next appraisal. He would not be\n\n  objective in the matter. Justice must not only be done, but seen to be done. It would be\n\n  against the principles of fair play for D/A1 to appraise me after the friction with him.I request a transfer to State Lands\n\n  Division. In view of my age, qualifications and experience, I am willing to assume greater\n\n  responsibilities.…As I sincerely believe in the principle of\n\n  meritocracy, I would be most grateful if COL (Commissioner of Lands) would allow me the\n\n  opportunity to prove myself. Thank you.22 Following that letter, the situation\n\nbetween the applicant and DA1 who was by now her immediate superior, became intolerable.\n\nAs such, on 1 September 1998, the applicant sent a further electronic mail to the COL.\n\nTwelve days after her mail dated 1 September 1998, she received still no answer. During\n\nthose twelve days, she requested to see the COL many times only to be informed each time\n\nthat he was busy. On or about 12 September 1998, the applicant sent another electronic\n\nmail to the COL stating that if he did not wish to decide on the matter, she would have no\n\nchoice but to refer the matter to the Ministry of Law.23 The applicant received an immediate\n\nreply to her electronic mail with words to the effect: ‘Never threaten me. It amounts\n\nto insubordination.’ The mail further stated that her work was unsatisfactory. The\n\napplicant never intended to be insubordinate but was unfortunately perceived as such. The\n\nCOL made it known in the said mail that he was not the appointing authority.24 After making representations to a\n\nnumber of persons in the Ministry, the applicant decided to highlight her grievances\n\nthrough the proper channel and consequently wrote a letter dated 30 September 1998 to the\n\nPermanent Secretary (Law) through the COL.",
        "The applicant’s appeals": "25 The applicant appealed against her\n\ntermination first to the Minister for Law by her letters dated 20 December 1998 and 26\n\nDecember 1998. In those letters, she complained that there was a breach of natural justice\n\nprocedures and that her superiors had not paid heed to the IM in their dealings with her.\n\nShe then received a reply from the Deputy Secretary dated 29 December 1998 informing her\n\nthat since the decision to terminate her service was made by the Senior Personnel Board F,\n\nshe should appeal to the Appeals Board. She promptly appealed to the Minister for Law by a\n\nletter dated 31 December 1999 stating that her non-confirmation was wrongful and improper\n\nand that it was the wrongful non-confirmation that led to the unlawful termination.\n\nHowever, the Ministry replied by a letter dated 15 January 1999 that even for\n\nconfirmation, the appropriate authority for appeal was the Appeals Board.26 The applicant commenced the formal\n\nappeal process by a letter dated 23 January 1999 to the Appeals Board, Public Service\n\nDivision. She referred to the Appeals Board all the letters that she had written\n\npreviously on this matter. There were several grounds advanced by her, chief amongst them\n\nwere that:1) procedures in the IM were not complied\n\n  with and there was mala fide (on the part of her superiors); and that2) she was not informed of any\n\n  shortcomings with respect to her work during her probationary period.27 The other grounds of appeal put forward\n\nby her against her termination included the following:1) that she was not informed that her\n\n  matter would be brought before the Senior Personnel Board F, nor of the date of the\n\n  inquiry; and that2) she was not informed of the case made\n\n  against her nor given an opportunity to be heard before the Senior Personnel Board F.28 By a letter dated 29 January 1999, the\n\napplicant wrote to the Appeals Board indicating that she would be willing to serve in\n\nanother Ministry. She further wrote to the Appeals Board on 6 February 1999 and 16\n\nFebruary 1999 providing them with further particulars. She later received a reply from the\n\nAppeals Board by a letter dated 22 March 1999 informing her that her appeal was\n\nunsuccessful.29 By a letter dated 3 April 1999, the\n\napplicant wrote to the Appeals Board requesting another chance. On 7 April 1999, the\n\nAppeals Board informed the applicant that she should direct all further appeals to the\n\nPublic Service Commission (PSC). In the result, she by her letter dated 22 May 1999\n\nappealed to the PSC but was informed on 25 May 1999 that she was out of time for the\n\nappeal. She wrote to the PSC on 28 May 1999 requesting a waiver on grounds that her\n\nearlier letter had been misdirected by the postal services. This was granted by a letter\n\ndated 3 June 1999. Thereafter, the applicant submitted her further appeals to the PSC by\n\nway of her letter dated 10 June 1999. On 21 July 1999, she was advised by the PSC that her\n\nappeal was again unsuccessful.",
        "The present application": "30 The applicant’s many grievances\n\nand the grounds in relation to the application before me were spelt out in detail in the\n\nsubmissions by her counsel, Mr Harpreet Singh. The relevant segments of his submissions\n\nwere as follows.31 The applicant was aggrieved that:(a) almost nine months after her probation\n\n  had ended she was informed that she would not be confirmed despite the fact she had\n\n  received no adverse comment, oral or written, about her performance during her probation\n\n  period;(b) her probation was extended\n\n  retrospectively nine months after the date of confirmation. The letter extending her\n\n  probation merely stated in general terms that she had been informed that her work\n\n  performance was not up to the standard required. No specific allegations were made to\n\n  which the applicant could answer;(c) In August 1998, she was told that she\n\n  had her probation period extended by one year although in effect she had only three months\n\n  to improve her work performance failing which her services would be terminated. No\n\n  particulars were given as to what she was required to do to improve her work performance;(d) Even at the start of the purported\n\n  extension of her probationary period, the applicant’s new appraising officer (DA1)\n\n  informed her that she would not be confirmed and that she should look for another job;(e) All the plaintiff’s pleas for a\n\n  transfer so that her work could be objectively assessed fell on deaf ears.32 Mr Singh further submitted that the\n\nrefusal to confirm the plaintiff after her initial one-year probationary period was\n\nwrongful, improper and/or irrational. He contended that:(a) the applicant was never informed\n\n  during her probationary period that there were adverse reports against her, contrary to\n\n  the provisions contained in paragraph B20 of the IM;(b) it would be irrational to justify the\n\n  applicant’s non-confirmation as she had not received any adverse reports. All her\n\n  recommendations/submissions in the course of work had been accepted and approved by the\n\n  then COL. Seven months into her probation, she was given added responsibilities to cover\n\n  two other positions in addition to her substantive appointment. In addition, she had been\n\n  earlier advised that her appraisal was ‘generous’;(c) the applicant’s letter of\n\n  appointment had represented that discretion as to confirmation would be exercised in\n\n  accordance with the instructions, however styled, that are in force. As such, the\n\n  applicant acted on that representation believing that if she had not received any adverse\n\n  reports from her superiors, she would be confirmed from the date after her probation\n\n  ended;(d) paragraph 42 of the IM required the\n\n  Permanent Secretary ‘to make sure that staff confidential reports were put up every\n\n  six months on all probationary officers in Divisions 1, II and III.’ After the\n\n  applicant’s probationary period ended on 27 November 1997, the applicant was not\n\n  given any report form to be filled up within the 6 months following. This was consistent\n\n  with the fact that the applicant was no longer treated as a probationary officer;(e) the applicant was informed of the\n\n  extension of her probation, nine months after her confirmation date, contrary to paragraph\n\n  B 66 of the IM; and that(f) the grounds given for the extension of\n\n  the applicant’s probation were invalid, vague, irrelevant, and unjustified, in the\n\n  light of the applicant’s work performance and conduct during her probationary period\n\n  and thereafter.33 Mr Singh further submitted that the\n\neventual termination of the applicant’s service wasultra vires, wrongful and\n\nimproper in that:(a) it stemmed from a wrongful decision to\n\n  extend the applicant’s probationary period;(b) the applicant’s probation had\n\n  long been over, she was for all intents and purposes a confirmed officer. Therefore,\n\n  pursuant to Article 110D(2) of the Constitution, Senior Personnel Board F had no\n\n  jurisdiction to terminate the applicant’s appointment. It was only the Public Service\n\n  Commission which had the requisite jurisdiction, if at all;(c) there was a breach of the rules of\n\n  natural justice as the applicant was not given an opportunity to be heard in respect of\n\n  the allegations made against her at Senior Personnel Board F, the Appeals Board and Public\n\n  Service Commission proceedings. The applicant was not told of what factors were considered\n\n  and therefore had no opportunity to meet the allegations made against her; and that(d) there was alsomala fideas\n\n  evidenced by the applicant’s letters to Permanent Secretary (Law).34 The present application was duly served\n\non the Attorney-General as was required under the Rules of Court. It was, as it turned\n\nout, opposed vigorously on several grounds by Senior State Counsel, Mr Jeffrey Chan, who\n\nwas given the courtesy of addressing the court on thisexparteapplication. The\n\nmain points of his objections were: (a) that there was no element of public law in the\n\ndetermination of the applicant’s employment and consequently, judicial review being a\n\npublic law remedy, was not available to the applicant; and (b) that in any event, the\n\napplicant was out of time for applying for judicial review in respect of the extension of\n\nher probationary period, which decision was conveyed to her on 19 August 1998 and the\n\ndecision of the Senior Personnel Board F terminating her employment which was conveyed to\n\nher on 17 December 1998.",
        "Arguments by the senior state counsel": "35 On the first ground that public law\n\nremedies were not available to the applicant, Mr Chan’s contentions as encapsulated\n\nby him in one of the synopses submitted, read as follows:(i) Judicial review is a remedy that lies\n\n  exclusively in public law. This remedy is not available to the plaintiff [applicant]\n\n  unless she shows that a public law right that she enjoyed has been infringed. As was said\n\n  by the Court of Appeal inRegina v. East Berkshire Health Authority, Ex parte Walsh[1984] 3 All ER 425 (DB-6), \"employment by a public authority does not per se inject\n\n  any element of public law\".(ii) The Plaintiff [applicant] was\n\n  employed as a probationer and her employment was governed by contract. The fact that she\n\n  was not confirmed does not give rise to any public law right. An employee on probation is\n\n  generally eligible for confirmation subject to the employer being satisfied with the\n\n  employee’s work and conduct. Confirmation is not an entitlement or a right. As was\n\n  pointed out by the Privy Council inMunusamy v Public Services Commission[1967] 1 MLJ 199at 202:\" ‘Eligible for is not\n\n  equivalent to ‘entitled to’ and means no more than ‘fit to be chosen\n\n  for’.\"(iii) There was also no element of public\n\n  law in the termination of her employment. The Plaintiff [applicant] was not dismissed from\n\n  service. The statutory provisions on dismissal of civil servants did not apply to her and\n\n  are not relevant in this case. The termination of the Plaintiff’s [applicant’s]\n\n  service was pursuant to the contractual terms governing her employment. The source of the\n\n  power exercised by the Defendants in terminating the Plaintiff’s [applicant’s]\n\n  employment was contractual and her remedies against any wrongful termination therefore lie\n\n  only in private law.(iv) The case ofRegina v. Crown\n\n  Prosecution Service, Ex parte HoggThe Times 14 April 1994 is on point. The facts of\n\n  the case are as follows. Mr Hogg was appointed as a prosecutor in the Crown Prosecution\n\n  Service. During his probationary service, he was dismissed. As in the present case, Mr\n\n  Hogg challenged the dismissal and alleged non-compliance with procedures governing\n\n  dismissal. He applied for leave to apply for judicial review but leave was not granted on\n\n  the ground that the dismissal was not a public law issue. This decision was upheld by the\n\n  Court of Appeal. The Court held that the relationship between the Crown as an employer and\n\n  the Crown servant as employee was a private law relationship and not one which brought in\n\n  public law principles.(v) This principle has been repeatedly\n\n  upheld in a number of other cases such asR v Lord Chancellor’s Department, Ex\n\n  parte Nangle[1992] 1 All ER 897 (DB-5),R v. East Berkshire Health Authority, Ex\n\n  parte Walsh[1984] 3 All ER 425 (DB-6) andGnanasundram v. Public Service\n\n  Commission[1966] MLJ 157(DB-7). These cases have been discussed in the\n\n  Attorney-General’s earlier submissions. The Plaintiff’s solicitors, both in\n\n  their written and oral submissions, did not distinguish or rebutt the principles embodied\n\n  in these cases.(vi) The only case submitted by the\n\n  Plaintiff [applicant] on this point, namelyDr Chandra Muzaffar v. Universiti Malaya[2000] 1 MLJ 173is without merit. In that case, the Applicant was appointed as a\n\n  professor by the Respondent. Subsequently, the Applicant’s contract was terminated\n\n  and the Applicant applied for leave to apply for judicial review. The Court decided that\n\n  \"it was not improper\" for the Applicant to apply for judicial review as the\n\n  Respondent was a creature of statute and the Applicant was its employee. The Court only\n\n  referred in passing to two Malaysian cases and made no reference to the body of cases that\n\n  have developed on this issue. The judgment is without legal reasoning and should be\n\n  disregarded.36 Mr Chan also contended that the\n\napplicant’s employment was terminated in accordance with the provisions that\n\nempowered her managers to terminate her employment. Her case was therefore purely one of a\n\ncontract being terminated in accordance with applicable provisions. Termination of service\n\nwas not dismissal and the provisions relating to dismissals, therefore, were not\n\napplicable. He went on to argue that the applicant held office ‘at the pleasure of\n\nthe President’ and the services of persons who held such an office could be\n\nterminated any time subject to constitutionally prescribed procedures. He maintained that\n\nthere was no breach of natural justice in the case at hand.37 Mr Chan further contended that:(1) the applicant had dwelt at length on\n\n  what she said were the reasons for the termination of her services. In gist, she was\n\n  alleging that her services were terminated because she had exposed the incompetence of her\n\n  seniors. Her seniors and the Ministry of Law had a completely different version of the\n\n  facts relied on by her. They would, at the appropriate time and should it be necessary to\n\n  do so, present these to the court. However, the reasons for the applicant’s\n\n  termination were, in the main, irrelevant to the present proceedings. A writ of certiorari\n\n  can only lay to quash a decision tainted by illegality, irrationality or procedural\n\n  impropriety (see:Council of Civil Service Unions v Minister for the Civil Service[1985] AC 374). It can also be used to quash an unreasonable decision but the level of\n\n  unreasonableness must be very high. It must satisfy theWednesburyTest. (seeAssociated\n\n  Provincial Picture House Ltd v Wednesbury Corp[1947] 2 All ER 685);(2) A writ of certiorari ought not to be\n\n  granted to quash a wrong decision unless the decision offended these principles;(3) On the face of it, the decisions which\n\n  the applicant was seeking to quash did not offend any of these principles. In fact,\n\n  nowhere did the applicant adduce evidence which would prove that the decisions she was\n\n  seeking to impugn offended these principles. The facts which she relied on to show that\n\n  the decisions were ‘ultra vires, improper and/or irrational’ did not illustrate\n\n  these points;(4) The court should not substitute its\n\n  judgment whether the applicant should or should not be confirmed for the judgments of\n\n  those who had worked with her and supervised her work on a day- to-day basis. The issue\n\n  before the court was whether the authorities who were responsible for confirming her or\n\n  for terminating her services acted in accordance with what were required by law to be\n\n  done. Given the applicant’s status as an unconfirmed officer, this was fully complied\n\n  with by the relevant authorities.(5) Inherent in all that the applicant was\n\n  alleging was that the decision not to confirm her in her appointment and to terminate her\n\n  services was motivated by mala fide. Mala fide would require a very high degree of proof.\n\n  Just because she believed that the decisions were motivated by mala fide, did not mean\n\n  that those decisions were, motivated by mala fide in law. In the absence of supporting\n\n  evidence of mala fide, the court should not reach such a conclusion merely because she\n\n  believed that the decisions were such and had said so.",
        "Reply by the applicant’s counsel": "38 Mr Singh’s detailed reply to the\n\nconcerns addressed by Senior State Counsel had a persuasive ring to it – not to\n\nmention the force of logic and well structured propositions of law. Presently, he invited\n\nmy attention to a test enunciated by the Singapore Court of Appeal inChan Hiang\n\nLeng Colin v Minister for Information and the Arts[1996] 1 SLR 609(CA) at 616\n\nwhere it was stated by Karthigesu JA:… the court should quickly peruse the\n\n  material put before it and consider whether such material discloses what might on further\n\n  consideration turn out to be an arguable case. The other is that the applicant had to make\n\n  out a ‘prima facie case of reasonable suspicion’. In our view, both tests\n\n  present a very low threshold and it is questionable whether there is really any difference\n\n  in substance between the two interpretations.…What is required is not a prima facie\n\n  case, but a prima facie case of reasonable suspicion. If the latter can be shown then it\n\n  cannot necessarily be said that the application must necessarily fail, for there would\n\n  then appear to be an ‘arguable case’",
        "Decision": "39 Much emphasis was laid by Mr Chan that\n\njudicial review was a remedy that lay exclusively in public law and that this remedy was\n\nnot available to the plaintiff unless she showed that a public law right that she enjoyed\n\nhad been infringed. In this regard, reference was made toR v East Berkshire Health\n\nAuthority ex parte Walsh[1984] 3 All ER 425 (CA). The facts of this case as apear\n\nin the headnotes of the case are set out below.40 The applicant was employed as a senior\n\nnursing officer by the respondent health authority under a contract of employment which,\n\npursuant to the National Health Service (Remuneration and Conditions of Service)\n\nRegulations 1974, incorporated terms and conditions which were negotiated by a recognised\n\nnegotiating body and approved by the Secretary of State for Social Services. In August\n\n1982 the district nursing officer suspended the applicant from duty and on 27 September\n\nshe purported to terminate his employment with the health authority. The applicant sought\n\njudicial review of the dismissal, on the grounds that the district nursing officer had\n\nacted ultra-vires in dismissing him and that there had been breaches of the rules of\n\nnatural justice in the procedures leading up to the dismissal. The health authority raised\n\nthe preliminary point whether it was appropriate for the applicant to question the\n\ndismissal by bringing proceedings for judicial review. The judge held that the\n\napplicant’s rights were of a sufficiently public nature to entitle him to seek public\n\nlaw remedies or, alternatively, that if he was not entitled to an order of certiorari he\n\ncould, under Ord 53, r 9(5) of the RSC, continue the action as though it had been begun by\n\nwrit.41 The health authority appealed and in\n\nallowing the appeal the Court of Appeal held, amongst other things that:Whether a dismissal from employment by a\n\n  public authority was subject to public law remedies depended on whether there were special\n\n  statutory restrictions on dismissal which underpinned the employee’s position, and\n\n  not on the fact of employment by a public authority per se …42 Donaldson MR observed in his judgment\n\nat page 429:The remedy of judicial review is only\n\n  available where an issue of ‘public law’ is involved, but, as Lord Wilberforce\n\n  pointed out inDavy v Spelthorne BC[1983] 3 All ER 278 at 285, [1984] AC 262 at\n\n  276, the expressions ‘public law’ and ‘private law’ are recent\n\n  immigrants and, while convenient for descriptive purposes, must be used with caution,\n\n  since English law traditionally fastens not so much on principles as on remedies. On the\n\n  other hand, to concentrate on remedies would in the present context involve a degree of\n\n  circularity or levitation by traction applied to shoestrings, since the remedy of\n\n  ‘certiorari’ might well be available if the health authority is in breach of a\n\n  ‘public law’ obligation, but would not be if it is only in breach of a\n\n  ‘private law’ obligation.43 The next case relied on by Mr Chan was\n\na Malaysian decision:Gnanasundram v Public Services Commission(1966) 1 MLJ 157. InGnanasundram, the applicant filed for an order of certiorari to\n\nquash the decision of the Public Services Commission terminating the appointment of the\n\napplicant, a temporary officer. The application was made more than six months after the\n\ndecision of the Public Services Commission and the applicant applied for enlargement of\n\ntime to make the application. Raja Azlan Shah J (as he then was) in dismissing the\n\napplication held that the relationship between the government and the applicant was one of\n\ncontract and the government was therefore entitled to terminate the employment of the\n\napplicant by payment of a month’s salary in lieu of notice as provided in the\n\ncontract. In respect of the enlargement of time issue, the learned judge said in passing\n\nthat the court would only extend the time where a strong case for it is shown and the only\n\ndelay involved in the pursuit of a legal remedy open to the applicant.44 The principles articulated by Donaldson\n\nMR inexparte Walsh(supra) cannot be second-guessed. However, the\n\nsubmission by Mr Chan that the applicant’s grievance fell indubitably beyond the pale\n\nof public law right sounded a little exotic, particularly when the duty of the court\n\nhearing an exparte application, such as the one at hand, was not to embark upon any\n\ndetailed and microscopic analysis of the material placed before it but as enjoined by the\n\nSingapore Court of Appeal inChan Hiang Leng Colinto peruse the material\n\nbefore it quickly and appraise whether such material disclosed an arguable and aprima\n\nfaciecase of reasonable suspicion. In my view, the applicant had more than\n\ncomfortably crossed the threshold barriers and had placed adequate material before the\n\ncourt for it to conclude that there was indeed aprima faciecase of reasonable\n\nsuspicion. In my view, the Malaysian decision ofGnanasundramwas not of any\n\nassistance to the respondent since that case was in relation to the termination of\n\nemployment of a temporary employee and there was no question of any reported flouting of\n\nany of the provisions of the IM or its equivalent.45 Additionally, inR v Chief\n\nConstable of Greater Manchester Police, ex parte LaintonThe Times 13 July 1998\n\nJackson J dealing with a somewhat similar case deemed fit to observe (see heading Part 5:\n\nThe Timing issue): ‘Indeed in the ordinary case, a decision taken after expiry of the\n\ntwo year period to relegate a police constable to the status of probationer may well be\n\nvulnerable to attack on grounds such as unreasonableness.’ In this regard, I agree\n\nwith Mr Singh’s submission that the decision not to confirm the applicant, many\n\nmonths of service after the end of her regular probationary period could be vitiated by\n\ntheWednesburyunreasonableness.46 In my provisional view, the\n\ncircumstances under which the applicant’s probation came to be extended and the\n\nsubsequent decisions by the Senior Personnel Board F as well as the PSC, seemed to fall in\n\nthe sphere of public law rights. The fact she was told that her probation had been\n\nextended for one year after the lapse of nine months since her probationary period and\n\nthat too without any previous adverse reports, patently straddled the area ofWednesburyunreasonableness. Again, in my provisional view, the apparent disregard of the provisions\n\nof the Instruction Manual by the applicant’s superiors was a concern more of public\n\nlaw and not private law. Such disregard also appeared to lend weight to the\n\napplicant’s allegations of unfairness, improper dealings and bad faith.47 InDr Chandra Muzaffar v\n\nUniversiti Malaya[2000] 1 MLJ 173, the Malaysian High Court had to deal with an\n\napplication similar to the one at hand. In that case, the applicant was appointed on a\n\nyearly basis by the respondent as the director and professor of civilisation and dialogue\n\ncentre of the respondent university with effect from 1 March 1997. After having the\n\napplicant’s contract renewed for the second year, the respondent issued a letter to\n\nthe applicant dated 18 February 1999 indicating that on the expiry of the second year, the\n\ncontract would no longer be renewed. The applicant’s contract was terminated on 28\n\nFebruary 1999. The applicant applied for leave to apply for an order of certiorari to\n\nquash the decision of the respondent and mandamus to direct the respondent to make a\n\ndecision in accordance with law by reinstating the applicant. The issues were: (i) whether\n\nit was proper for the court to entertain an application under O 53 of the Rules of the\n\nHigh Court 1980 as the applicant’s complaint was on refusal to renew the contract\n\nrather than a dismissal; (ii) whether it would be premature to discuss issues of merit at\n\nthis leave application stage; and (iii) whether the respondent in the leave application\n\nstage had the right to lodge an appeal against the decision, as the applicant’s\n\napplication for leave was made ex parte.48 In granting leave to the applicant to\n\napply for the order of certiorari and mandamus, Azmel J held:(1) The respondent is a creature of a\n\n  statute and the applicant was an employee of the respondent at the time of the incident.\n\n  The decision that had been made by the respondent had direct effect on the employment of\n\n  the applicant. It is not improper for the applicant to commence an action in this court\n\n  under O 53 of the Rules of the High Court 1980 (see p 176F-G).(2) It would be premature to discuss issue\n\n  of merits at this leave application stage. The respondent would not in any way be\n\n  prejudiced as such arguments on merits can be appropriately done at the later stage (see p\n\n  178A);Dr Amir Hussein v Universiti Sains Malaysia[1989] 3 MLJ 298distinguished.(3) The respondent at this leave\n\n  application stage does not have the right to lodge an appeal against the decision for\n\n  leave because the respondent is not made a party to the application yet. Only the\n\n  applicant was a party to this ex-parte application and only the applicant has the legal\n\n  capacity to lodge an appeal if he is not satisfied with the decision. The appeal by the\n\n  respondent should be summarily struck off for want of locus (see p 177A-B).49 I adopt the views expressed by Azmel J.\n\nAlthough Mr Chan urged the court not to follow the decision of Azmel J, in my opinion the\n\nMalaysian decision did not in any way fall foul of either the test set out inChan\n\nHiang Leng Colin(supra) by the Singapore Court of Appeal or what Donaldson\n\nMR observed inex parte Walsh(supra). It should be presently\n\nremarked that the facts inex parte Walsh(supra) did not bear any\n\nresemblance to the facts and averments in the case at hand. In my provisional opinion, the\n\ncomplaint of the applicant that there was breach of the rules of natural justice as she\n\nwas not given an opportunity to be heard in respect of the allegations levelled against\n\nher at the Senior Personnel Board F and later, clearly fell to be determined in a judicial\n\nreview proceedings.50 The next point argued by Mr Chan was\n\nthat the applicant was out of time in making the current application and that the court\n\nshould not enlarge the time. It is a settled principle of law that in judicial review\n\ncases the applicant should in the first instance exhaust all available statutory internal\n\nremedies before he or she had recourse to judicial review. In this connection, it would be\n\ninstructive to refer first to the case ofR v Epping & Harlow General\n\nCommissioners[1983] 3 All ER 257 where it was held that where a statute had\n\nprovided a remedy before another tribunal, the aggrieved person should exhaust his\n\nremedies before he can come to court. It had also been stated inReg v Chief\n\nConstable ex parte Merrill[1989] 1 WLR 1077 at 1088, that normally the time for\n\njudicial review would not arise if at all before the appeal tribunal has given its\n\ndecision.51 The chronology of events which was not\n\ndisputed in this matter appeared to be as follows:24 August 1998 - Nearly nine months after\n\n  her probation had ended, the applicant was told that her probation had been extended.17 December 1998 - Applicant was informed\n\n  that her services had been terminated by the Senior Personnel Board.23 January 1999 - The applicant commenced\n\n  the formal appeals process by way of a letter to the Appeal Board, Public Service\n\n  Division.23 March 1999 - Appeals Board informed the\n\n  applicant that it had agreed with the decision of the Senior Personnel Board.10 June 1999 - Applicant appealed to the\n\n  Public Service Commission.21 July 1999 - Applicant was advised by\n\n  letter that she was unsuccessful.20 January 2000 - Applicant files\n\n  Originating Summons No 96 of 2000 for leave under O 53 of the Rules of Court.52 Perusal of the chronology supported the\n\nconclusion that the applicant was well within the time frame prescribed ie, six months\n\nunder O 53 Rule 1(6) of the Rules of Court which provides that leave shall not be granted\n\nto apply for an order of certiorari unless the application is made within six months after\n\nthe date of proceedings, except where the delay is accounted for to the satisfaction of\n\nthe judge to whom the application for leave is made.53 Even if there was a delay, I was amply\n\nsatisfied that the delay had not been due to any fancy footwork by the applicant; rather\n\nit was wholly owing to the steps taken by her to exhaust all available internal remedies\n\nas explained to the court by counsel. As observed by Raja Azlan Shah inGnanasundram(supra) the court would extend the time where the delay was as a result of the\n\npursuit by the applicant of a legal remedy (page 159 of the report,supra). In the\n\ncircumstances, I found the contention by Mr Chan that the applicant was out of time as\n\ndevoid of merit. At any rate, if need be, there were compelling grounds justifying the\n\ngrant of an extension which I would have readily given for reasons given by the\n\napplicant’s counsel.54 Having been satisfied that the material\n\nplaced before me appeared to disclose ‘a prima facie case of reasonable\n\nsuspicion’ as laid down inChan Hiang Leng Colinand that the\n\ngrievances raised appeared to fall well within the boundaries of public law, I granted the\n\napplication and made the following orders:(a) a writ of certiorari to quash the\n\n  decision of the Commissioner of Lands and/or the Permanent Secretary (Ministry of Law)\n\n  and/or such other Appointing Authority (as defined in the Government Instruction Manual)\n\n  conveyed to the respondent by a letter dated 19 August 1998 extending the\n\n  respondent’s probationary period as a Senior Officer Grade III (Law) for one year\n\n  retrospectively with effect from 28 November 1997 to 27 November 1998;(b) a writ of certiorari to quash the\n\n  decision of Senior Personnel Board F conveyed to the respondent by a letter dated 17\n\n  December 1998 terminating the respondent’s services as Senior Officer Grade III with\n\n  effect from 21 December 1998; and(c) a writ of certiorari to quash the\n\n  decision of the Public Service Commission conveyed to the respondent by a letter dated 21\n\n  July 1999 refusing the respondent’s appeal against each of the decisions referred to\n\n  under paragraphs (a) and (b) above.55 As for the prayer concerning mandamus,\n\nI made no order thereon as I was of the view that leave as respects mandamus would be\n\nsuperfluous if the court were to grant the applicant the writs of certiorari prayed for,\n\nwhich I did. Against the grant of such leave, the respondent now appeals.",
        "Order accordingly.": "M P H RubinJudgeCopyright © Government of Singapore."
    }
}