{
    "case_title": "RHB Bank Berhad v Koon Hoe & Company Pte Ltd and Others",
    "ncitation": "[2000] SGHC 216",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "Date : 9thMarch 2000": "To : RHB Bank BerhadWe accept the terms and conditions as\n\n  stated in your Letter of Offer dated 2 March 2000, together with the Annexure comprising\n\n  of the Standard Terms and Conditions governing Banking Facilities.We enclose herewith our Board of\n\n  Directors’ Resolution accepting the terms and conditions of the said Letter of Offer\n\n  and authorization on the due execution of all security documents as may be required by the\n\n  Bank.(signed)Authorized Signatory...........................................Company Stamp4 Pursuant to the compromise spelt out in\n\nthe Letter of Offer, the First Defendant paid $50,000 to the Plaintiffs on or about 9\n\nMarch 2000 in partial settlement of the outstanding amount of $12,042,121.92. On 13 March\n\n2000, the Plaintiffs liquidated the fixed deposit account of Nam Wing Fiegh and utilised\n\nthe money therein amounting to $252,112.19 (after deducting the Plaintiffs’\n\nadministrative costs) to partially settle the outstanding amount, which, after deducting\n\nthe two partial payments, stood at $11,925,214.44 as at 31 March 2000.5 In breach of Clause 8 of the Letter of\n\nOffer, the First Defendant did not forward to the Plaintiffs the Statutory Declaration of\n\nAssets and the undertaking by the Second, Third and Fourth Defendants when it signed and\n\nreturned the Letter of Offer.6 The Plaintiffs’ solicitors then\n\nwrote a letter dated 15 March 2000 to the Defendants’ solicitors stating as follows:\"KOON HOE & CO PTE LTD1. We refer to the above matter.2. We are instructed by our clients that\n\n  in response to their letter of offer dated 2 March 2000 to your clients, your clients have\n\n  complied with Clause 1 of the said letter of offer by paying the sum of $50,000.00 via a\n\n  UOB Cashier’s Order dated 9 March 2000.3. However, our clients have yet to\n\n  receive the acceptance copy of the said letter of offer duly executed by your clients.\n\n  Please advise your clients to do so immediately.4. In respect of the other clauses, please\n\n  note that our clients expect them to be duly complied with, in particular, kindly advise\n\n  your clients to prepare the Statutory Declaration of Assets and forward the same with the\n\n  acceptance copy.5. Finally, a regulating agreement will be\n\n  drawn up upon the receipt of the above.\"It appeared that paragraph 3 was erroneous\n\nas the acceptance copy had apparently been sent to the Plaintiffs but not the Statutory\n\nDeclaration and the undertaking specified in condition number 8 of the Letter of Offer\n\ndated 2 March 2000.7 By a letter of the same date, the\n\nDefendants’ solicitors replied that \"As stated in their fax to your clients\n\ndated 9thMarch 2000 our clients think it best for your clients to let them\n\nknow the format of the Statutory Declaration required by them so as to avoid any confusion\n\nand to enable the matter of the Statutory Declaration to be dealt with efficiently.\"\n\nThe relevant sentence in the said fax of 9 March 2000 asked the Plaintiffs to \"please\n\nfurnish us with the format of the Statutory Declaration to enable us to comply\".8 The Plaintiffs averred that it was not\n\nprovided in the Letter of Offer nor was it agreed by them that they would provide the\n\nformat of the Statutory Declaration. Nevertheless, by their letter of 17 March 2000 to the\n\nDefendants’ solicitors, the Plaintiffs’ solicitors informed them that the\n\nPlaintiffs required the Second, Third and Fourth Defendants to each make a Statutory\n\nDeclaration on their current assets and liabilities as at the date of execution of the\n\nStatutory Declaration and that such assets should include details of share holdings in\n\ncompanies, ownership of motor vehicles, club memberships including any encumbrances or\n\nfinancing for the acquisition of those assets as well as their market value.9 Ten days passed and the default\n\ncontinued. By their letter dated 27 March 2000 to the Defendants’ solicitors, the\n\nPlaintiffs’ solicitors gave the following ultimatum:\"We refer to your letter dated 17\n\n  March 2000, and would inform you that since that letter, we have still not received the\n\n  Statutory Declarations of Nam Wing Fiegh, Tan Sioh Lwee and Nam Wen Kai Paul.We write to inform you that these three\n\n  (3) Statutory Declarations must be delivered to our officesno later than 4.00 p.m.\n\n  on Tuesday, 28 March 2000, together with a written undertaking from each of the\n\n  abovenamed 3 persons that he/she shall not sell, transfer, alienate, encumber or otherwise\n\n  dispose of any of their respective assets without the prior written consent of our clients\n\n  – See paragraph 9 of the Letter of Offer.All our clients’ rights are hereby\n\n  expressly reserved.\"10 Another three days passed. The\n\nStatutory Declarations and the undertakings were still not forwarded to the Plaintiffs. By\n\na letter dated 31 March 2000, the Plaintiffs’ solicitors wrote to the\n\nDefendants’ solicitors accepting the First Defendant’s breach of contract and,\n\npursuant to the Letter of Offer, demanded that the Defendants pay the outstanding amount\n\nof $12,042,121.92, as at 31 January 2000 together with default interest thereon from 1\n\nFebruary 2000 until full payment, within five days failing which the Plaintiffs would\n\ncommence legal action. The Plaintiffs’ solicitors also indicated that they would be\n\nreturning the Defendants’ cheque for $17,299.31. Bearing in mind the two partial\n\npayments, the amount owing as at 31 March 2000 was $11,925,214.44.11 The Defendants’ solicitors\n\nresponded on 4 April 2000 thus:\"We refer to your letter dated 31stMarch 2000.Our clients find it difficult to believe\n\n  your clients’ position as stated therein which flies in the face of reason and\n\n  commercial reality.Your clients accepted the Settlement\n\n  Agreement without the said Statutory Declarations on 9thMarch 2000.Subsequent correspondence between the\n\n  solicitors on this point clearly shows that our clients were in the process of preparing\n\n  the Statutory Declarations.You will appreciate that such things take\n\n  time to ensure that the list of assets to be included in the Statutory Declarations were\n\n  complete.Your said fax of 27thMarch\n\n  1999 imposed an impossible deadline which cannot be seen otherwise as manifest bad faith\n\n  particularly in view of the fact that your clients accepted the sum of $50,000.00 which\n\n  was paid by our clients pursuant to the Settlement Agreement.In light of the above your clients’\n\n  current stance cannot be fathomed and is clearly unnecessary and excessive. Ironically we\n\n  note that your clients are also, and still, in the process of preparing the other\n\n  documents required by the Settlement Agreement.Our clients’ position is that your\n\n  clients remain bound by the said Agreement and this issue of the Statutory Declarations\n\n  does not constitute a breach on our clients’ part.Our clients have acted in good faith and\n\n  have paid the first installment payment of $17,299.31.In addition our clients have sourced for\n\n  buyers for their properties.To this end our clients seek your clients\n\n  approval to sell their property at No. 17 Bukit Pasoh Road for not less than $3 million\n\n  less the usual costs and expenses of the sale (such as agent’s fees, lawyers fees,\n\n  insurance etc).As there appear to be a number of possible\n\n  purchasers, our clients are unable to provide further details until negotiations are\n\n  concluded and an Option/Sale and Purchase Agreement signed.Please let us have your clients’\n\n  immediate consent as time is of the essence.We are endeavouring to let you have the\n\n  Statutory Declarations within this week and trust this will be acceptable.Otherwise kindly confirm by 6thApril 2000 that your clients intend to maintain their stand as stated in your said fax\n\n  upon which we will have no option but to apply to the Court for the appropriate\n\n  relief.\"12 Although the above letter indicated\n\nthat the statutory declarations might be ready \"within this week\", the\n\nDefendants’ solicitors faxed three draft statutory declarations to the\n\nPlaintiffs’ solicitors some two and a half hours later that same day (4 April 2000).13 The Plaintiffs’ solicitors replied\n\non 6 April 2000 as follows:\"2. Our clients had received the\n\n  Letter of Offer duly signed as accepted by your clients on 9 March 2000, and had granted\n\n  your clients’ indulgence by not insisting that the Statutory Declarations and the\n\n  undertakings be furnished at the same time.3. Our clients’ indulgence was\n\n  clearly not open-ended, and neither was it to be construed as a waiver of their rights to\n\n  insist on the Statutory Declarations and undertakings be provided forthwith.4. By our letter dated 27 March 2000, we\n\n  informed you in no uncertain terms that the Statutory Declarations and undertakings were\n\n  to be delivered no later than 4.00 p.m. on Tuesday, 28 March 2000.5. This was an eminently reasonable\n\n  deadline, bearing in mind that your clients knew full well about their contractual\n\n  obligation to furnish the Statutory Declarations and undertakingsas early as 2 March\n\n  2000.6. Your clients even saw fit not to reply\n\n  to our said letter dated 27 March 2000 despite the fact that almost one month had passed\n\n  since they had sight of the Letter of Offer and Clause 8 therein referring to their\n\n  obligation to furnish the Statutory Declarations and undertakings.7. Accordingly, our clients dispute and\n\n  deny all your baseless allegations of \"impossible deadline\" and \"manifest\n\n  bad faith\". Our clients further deny that their current stance is unnecessary and\n\n  excessive.\"14 Clause 19 of the Standard Terms and\n\nConditions Governing Banking Facilities (which were annexed to the Letter of Offer and\n\naccepted by the Defendants) provided as follows:\"19.WAIVER19.1 The Bank may at its absolute\n\n  discretion waive either unconditionally or on such terms and conditions as it may deem fit\n\n  any breach by the Borrower of any of the terms and conditions contained herein and in the\n\n  Facility Letter or grant such indulgences as may be agreed provided that such waiver or\n\n  forbearance shall not prejudice or affect the rights, powers or remedies of the Bank at\n\n  any time afterwards to act strictly in accordance with the originally agreed terms and\n\n  conditions and shall not prejudice the rights of the Bank in respect of any other existing\n\n  or subsequent breach of any of the terms and conditions aforesaid.19.2 No failure to exercise and no delay\n\n  in exercising on the part of the Bank of any right, power or privilege hereunder shall\n\n  operate as a waiver thereof, nor shall any single or partial exercise of any right, power\n\n  or privilege preclude any other or further exercise thereof or the exercise of any other\n\n  right, power or privilege. The rights and remedies herein provided are cumulative and not\n\n  exclusive of any rights or remedies provided by law.\"Accordingly, the Defendants’\n\nallegations of estoppel and of a new agreement were misconceived.15 Sometime soon after the First Defendant\n\nreceived the Plaintiffs’ fax dated 21 March 2000 demanding the payment of $49,107.93\n\nas the first payment of interest pursuant to the settlement agreement, the Third Defendant\n\ntelephoned the Plaintiffs and requested that the interest instalment demanded which was in\n\nexcess of $49,000 be capitalised and repaid at the end of the fifth year. The Plaintiffs\n\nreplied on 29 March 2000 to the First Defendant that they were unable to accede to the\n\nrequest and asked that the said amount be forwarded by 31 March 2000.16 Condition 4 of the Letter of Offer\n\nallowed the Plaintiffs to charge interest on the whole $9,727,000 as it provided that\n\ninterest would be charged \"on all of item (3) above\".17 The Plaintiffs’ letter of 8 March\n\n2000 to the First Defendant’s auditors merely stated the principal monies due and\n\nowing by the First Defendant as at 31 December 1999, without the element of interest. The\n\ndemand dated 31 March 2000 clearly demanded the sum as at a precise date, in this case, 31\n\nJanuary 2000. The Statement of Claim has given credit for the two partial payments.18 As indicated earlier, the Second, Third\n\nand Fourth Defendants were sued as guarantors. By their guarantees dated 16 August 1996,\n\nthey jointly and severally agreed to guarantee and indemnify the Plaintiffs’\n\npredecessor-in-title in respect of all monies owing by the First Defendant. Under Clause\n\n12 of the guarantees, any admission or acknowledgement in writing by the First Defendant\n\nof the amount of indebtedness shall be conclusive and binding on the Second, Third and\n\nFourth Defendants.19 The outstanding amount of\n\n$11,925,214.44 as at 31 March 2000 and further interest accruing thereon remained unpaid\n\nby the First Defendant. It was also averred that the Letter of Offer accepted by the First\n\nDefendant constituted an admission or acknowledgement in writing by the First Defendant\n\nwithin the meaning of the said Clause 12 of the guarantees and that the outstanding amount\n\nand interest were therefore due and owing to the Plaintiffs by all four Defendants.THE DEFENCE AND COUNTERCLAIM20 The Defendants pleaded that pursuant to\n\nthe settlement agreement contained in the Letter of Offer dated 2 March 2000, which was\n\naccepted by the First Defendant on 9 March 2000, the Plaintiffs’ claim was\n\ncompromised at $9,727,000 in addition to the two partial payments. They averred that\n\nalthough the statutory declarations had not been delivered to the Plaintiffs by 9 March\n\n2000, they were nonetheless delivered on 10 April 2000, and that time was not made of the\n\nessence in the settlement agreement. Further, the Plaintiffs had waived this condition and\n\nwere not entitled to rely on it. Such waiver was evidenced by the correspondence between\n\nthe parties’ solicitors and by the conduct of the Plaintiffs. The Defendants were\n\nthereby induced to believe that the settlement agreement still subsisted and acted upon\n\nthat belief by liquidating his fixed deposit account and making payment to the Plaintiffs\n\nwhich was accepted.21 The Plaintiffs had failed to give the\n\nFirst Defendant any notice requiring the statutory declarations within a reasonable time\n\nand their letter dated 27 March 2000 was not a reasonable notice in the circumstances. The\n\nPlaintiffs were therefore estopped from saying that the period for the delivery of the\n\nstatutory declarations expired on 9 March 2000 or on 28 March 2000 or from asserting that\n\nthe settlement agreement ceased to be valid on either of those dates.22 The Defendants further alleged that a\n\nnew agreement was to be implied from the correspondence and the conduct of the parties\n\nthat the period for the delivery of the statutory declarations should be extended beyond 9\n\nMarch 2000 and until the Plaintiffs had given a notice to the Defendants requiring\n\ndelivery of the same within a reasonable period. The Plaintiffs’ letter dated 27\n\nMarch 2000 was not such a reasonable notice.23 The Defendants also asserted that the\n\nPlaintiffs’ act of issuing the notice of 27 March 2000 and/or of purporting to\n\nterminate the settlement agreement was unconscionable and/or done in manifest bad faith.\n\nOn 21 March 2000, the Plaintiffs demanded $49,107.93 as the first payment of interest\n\npursuant to the settlement agreement. On 30 March 2000, the First Defendants informed the\n\nPlaintiffs that their calculation of interest was incorrect as it was based on the total\n\ncompromised sum of $9,727,000 and not on the sum of $3,427,000 as provided in condition\n\nnumber 3 of the said agreement. The next day, the Plaintiffs’ solicitors’ letter\n\nclaimed that the agreement had been breached due to the failure to furnish the three\n\nstatutory declarations by 28 March 2000 as demanded by their letter dated 27 March 2000.\n\nThe purported termination was motivated by the Plaintiffs’ realisation that the\n\nconditions of the settlement agreement did not permit them to charge interest on the full\n\ncompromised sum and was an attempt to escape and avoid the effect of the conditions.24 As further evidence of the\n\nPlaintiffs’ bad faith, the Plaintiffs had stated in their Letter of Offer dated 2\n\nMarch 2000 that the outstanding balance as at 31 January 2000 was $12,042,121.92 whereas\n\nthey had by their letter dated 8 March 2000 to the First Defendant’s accountants\n\ncertified that the outstanding balance as at 31 December 1999 was $10,770,176.24.25 The Plaintiffs’ letter of 31 March\n\n2000 also failed to give any credit for the two payments made by the First Defendants\n\nafter accepting the settlement agreement on 9 March 2000.26 By way of Counterclaim, the Defendants\n\nrelied on the same averments and sought a declaration that the Plaintiffs’ notices\n\ndated 27 March 2000 and 31 March 2000 to the First Defendants were wrongful, ineffectual\n\nand invalid to determine the settlement agreement made on 9 March 2000 and that the said\n\nsettlement agreement remained a binding and enforceable contract and that there had been\n\nno breach by the First Defendant. The Defendants therefore claimed specific performance of\n\nthe agreement. Alternatively, they asked for an order that they be relieved of the\n\nforfeiture (if any) of their right and interests under the agreement on such terms as the\n\nCourt thought fit and for damages that may have been sustained by them by virtue of the\n\nwrongful termination of the agreement.27 In the affidavit filed by the Third\n\nDefendant (a director) on behalf of all four Defendants, the Third Defendant said that he\n\nexecuted the settlement agreement on behalf of the First Defendant on 9 March 2000 and\n\ncaused it to be delivered by hand to the Plaintiffs together with a cashier’s order\n\nfor $50,000 and a letter dated 9 March 2000 from the First Defendant to the Plaintiffs\n\n(referred to earlier in paragraph 7 of this judgment). The statutory declarations were not\n\ndelivered to the Plaintiffs on that date as he was unsure as to the format to adopt and\n\ndid not want to waste time, money and effort should they be rejected. He had therefore\n\nasked the Plaintiffs to furnish them with the required format.28 The Plaintiffs accepted the executed\n\nsettlement agreement and the cashier’s order without protest. No mention was made of\n\nthe statutory declarations and no deadline for their delivery was given then. The\n\nDefendants were thereby led to believe that the Plaintiffs did not regard the non-delivery\n\nof the statutory declarations as crucial or material or as a breach of the agreement. They\n\nbelieved that the statutory declarations could be given at a later date and that the\n\nPlaintiffs would give them reasonable notice to do so since time was not made of the\n\nessence in the agreement, the other terms of which both parties would perform in the\n\nmeantime. On or about 13 March 2000, he liquidated the fixed deposit as required and paid\n\nthe money to the Plaintiffs. Again there was no protest about the statutory declarations.29 His \"belief was cemented by the\n\nsubsequent conduct of the Plaintiffs\" when their solicitors sent the letter dated 15\n\nMarch 2000 claiming that the First Defendant had not returned the acceptance copy of the\n\nagreement and asked for it to be done immediately. In that letter, they also asked for the\n\nstatutory declarations to be prepared and forwarded to them but no time was specified. The\n\nPlaintiffs have accepted that the acceptance copy had been returned on 9 March 2000.30 While providing the format was not a\n\nterm of the settlement agreement, it was a reasonable request and one made solely for the\n\nPlaintiffs’ benefit to enable the statutory declarations to be completed efficiently\n\nand to the Plaintiffs’ satisfaction. In the Plaintiffs’ reply of 17 March 2000,\n\nthey provided a basic and general description of the format of the statutory declarations\n\nbut again made no mention of any urgency or deadline. The Third Defendant was therefore\n\n\"led to believe that there was still time to provide the same and that the Plaintiffs\n\nwould give us reasonable notice in the event time became of the essence and they wanted\n\nthe Statutory Declarations to be delivered to them\".31 The Defendants were not doing nothing\n\nwhile all this was going on. They were making efforts to recollect, search and collate all\n\nthe information to be included in the statutory declarations. Relying on the\n\nPlaintiffs’ conduct, the Third Defendant focused on fulfilling the other terms of the\n\nsettlement agreement, in particular, sourcing for a purchaser of the First\n\nDefendant’s property. That property was sold for $3.25 million and the sale proceeds\n\nwould go to the Plaintiffs.32 When he received the Plaintiffs’\n\nletter dated 21 March 2000 asking for the first interest payment, the Third Defendant was\n\nextremely startled by the amount as it appeared to have been incorrectly calculated and\n\ninconsistent with the \"step-up\" basis of payment as it was greater in amount\n\nthat the subsequent payments. He then proceeded to do his own sums and to discuss the\n\nmatter with his solicitors.33 Subsequently and out of the blue, the\n\nDefendants’ solicitors received a letter dated 27 March 2000 from the\n\nPlaintiffs’ solicitors demanding that the statutory declarations be delivered to the\n\nPlaintiffs by 4 pm the next day. This letter was faxed at 8 pm on 27 March 2000 and was\n\ntherefore seen by the Defendants’ solicitors only in the morning of 28 March 2000.34 The Defendants’ solicitors\n\ncontacted the Third Defendant immediately about the matter. The period for compliance was\n\nless than eight hours and was clearly unreasonable. It was also impossible to comply with\n\nthe deadline set as the asset information had not been fully compiled and the Fourth\n\nDefendant was then out of the country.35 On 29 March 2000, the Third Defendant\n\ncalled the Plaintiffs about the demand for the interest payment and told them it was\n\nwrongly calculated. This was followed by a letter dated 30 March 2000 from the First\n\nDefendant delivered by hand to the Plaintiffs setting out the correct position, i.e. that\n\ninterest for the first six months was to be calculated on the amount of $3,427,000 and not\n\n$9,727,000. A cheque for the correct amount of interest for 22 days ($17,299.31) was\n\nenclosed.36 The Plaintiffs’ response of 29\n\nMarch 2000 was received by the First Defendant only on 31 March 2000 and appeared to have\n\ntotally missed the point and talked instead about capitalisation of interest, something\n\nnever requested or mentioned by the Third Defendant. Nevertheless, this letter also said\n\nnothing about the statutory declarations or anything about termination of the settlement\n\nagreement.37 On 31 March 2000, the Defendants’\n\nsolicitors received the Plaintiffs’ solicitors’ letter purporting to terminate\n\nthe settlement agreement pursuant to their earlier letter of 27 March 2000.\n\nNotwithstanding this, the Defendants continued to honour the agreement by delivering the\n\ndraft statutory declarations on 4 April 2000 and the executed ones on 10 April 2000, which\n\nwere returned by the Plaintiffs’ solicitors the same day. The First Defendant also\n\ncontinued to make the interest payments due for March and April 2000 until told not to\n\nforward any more payments. The Third Defendant has also obtained refinancing for a\n\nproperty to enable the First Defendant to pay up the balance of the $6.3 million due under\n\nthe agreement.38 Unable to understand the\n\nPlaintiffs’ motive behind their actions in ending a settlement that took more than\n\ntwo years to reach, the Third Defendant could only infer that they were merely seeking any\n\nexcuse to renege on the agreement. After all, the lateness in providing the statutory\n\ndeclarations had not prejudiced the Plaintiffs in any way. Further, the Plaintiffs were\n\nthemselves guilty of non-compliance with the terms of the agreement in that they did not\n\ncarry out a valuation of the properties within seven days from 9 March 2000 and failed to\n\nfurnish the Regulating Agreement.39 Throughout the dispute, the First\n\nDefendant had questioned the Plaintiffs’ accounting procedures and calculations which\n\nwere consistently error-prone. For instance, the fixed deposit of $250,000 placed on or\n\nabout 26 July 1995 yielded only a sum of $252,112.19 when liquidated in March 2000.\n\nAdministration costs, not provided for in the settlement agreement, were deducted by the\n\nPlaintiffs. After deducting the two partial payments, the balance ought to be\n\n$11,740,009.73 and not $11,925,214. Such manifest errors raised serious doubts as to the\n\naccuracy of any of the Plaintiffs’ figures. The Plaintiffs were unsure of the actual\n\namount owing at any one point in time. This was evidenced by the need to amend the\n\nStatement of Claim three times.40 Although the Defendants’\n\nsolicitors’ letter of 4 April 2000 indicated that the statutory declarations would be\n\nprovided within the week, that was a conservative estimate made in the event all the\n\ninformation could not be gathered as some of the information related to Malaysian shares\n\nwhich the Third Defendant had to obtain or confirm with his accountants in Malaysia.\n\nFortunately, all the information could be garnered and the draft statutory declarations\n\nwere sent the same day. The Defendants did not deny that the Plaintiffs were entitled to\n\ndemand for the statutory declarations at any time but they were obliged to give reasonable\n\nnotice for the delivery of the same and Clause 19 of the Standard Terms and Conditions did\n\nnot detract from this.41 The Plaintiffs’ letter dated 8\n\nMarch 2000 to the First Defendant’s auditors could not have left out the interest\n\npayable or accrued on the account as the First Defendant’s auditors would have\n\nrequired this information for the purposes of the statutory accounts. The Plaintiffs’\n\ndemand dated 31 March 2000 was invalid and bad in law as it failed to give credit for the\n\npayments made.THE DECISION OF THE COURT42 The Plaintiffs posed the following\n\nissues to be decided:(1) Did the Defendants breach the\n\n  settlement agreement by failing to deliver the statutory declarations and undertakings of\n\n  the three guarantors (i.e. the Second, Third and Fourth Defendants) by the 28 March 2000\n\n  deadline set out in the Plaintiffs’ solicitors’ letter of 27 March 2000?(2) If they did, do the terms of the\n\n  settlement agreement permit the Plaintiffs to terminate the said agreement, accelerate\n\n  payment and demand for the whole sum owing?43 The Defendants summarised the issues in\n\nthe following manner:(1) Whether the Plaintiffs by their\n\n  conduct/actions have waived the right to rely on the Defendants’ failure to deliver\n\n  the statutory declarations;(2) The effect of the Plaintiffs’\n\n  conduct/actions.44Chitty on Contracts(27thEdition, 1994) at pages 1087 to 1089 makes the following statements on waiver:\"Waiver or forbearance. Where\n\n  one party voluntarily accedes to a request by the other that he should forbear to insist\n\n  on the mode of performance fixed by the contract, the court may hold that he haswaivedhis right to require that the contract be performed in this respect according to its\n\n  original tenor. Waiver (in the sense of \"waiver by estoppel\" rather than\n\n  \"waiver by election\") may also be held to have occurred if, without any request,\n\n  one party represents to the other that he will forbear to enforce or rely on a term of the\n\n  contract to be performed or observed by the other party, and the other party acts in\n\n  reliance on that representation.Form of waver. A waiver may be oral\n\n  or written or inferred from conduct ....Effect on party forbearing. The\n\n  party who forbears will be bound by the waiver and cannot set up the original terms of the\n\n  agreement. If, by words or conduct, he has agreed or led the other party to believe that\n\n  he will accept performance at a later date than or in a different manner from that\n\n  provided in the contract, he will not be able to refuse that performance when tendered.\n\n  However, in cases of postponement of performance, if the period of postponement is\n\n  specified in the waiver, then, if time was originally of the essence, it will remain so in\n\n  respect of the new date. If the period of postponement is not specified in the waiver, the\n\n  party forbearing is entitled, upon reasonable notice, to impose a new time-limit, which\n\n  may then become of the essence of the contract. Similarly, in other cases of forbearance,\n\n  he may be entitled, upon reasonable notice, to require the other party to comply with the\n\n  original mode of performance, unless in the meantime circumstances have so changed as to\n\n  render it impossible or inequitable so to do. He cannot treat the waiver as entirely\n\n  without effect....Although consideration need not be proved,\n\n  certain other requirements must be satisfied for such an estoppel to be effective: first,\n\n  it must be clear and unequivocal; secondly, the other party must have altered his position\n\n  in reliance on it, or at least acted on it.\"45 The Defendants submitted that the\n\nPlaintiffs, having not asserted the non-delivery of the statutory declarations from 9\n\nMarch 2000 until 27 March 2000 had \"patently waived\" the Defendants’\n\nnon-delivery of the documents during that period and were therefore not entitled to rely\n\non this to terminate the agreement. Further, the Plaintiffs had accepted payment under the\n\nother terms of the agreement and it would be inequitable for them to go back on their\n\nrepresentation at their whim and fancy. They had to give reasonable notice if they wished\n\nto assert their strict legal rights. Further, the Plaintiffs had also waived compliance\n\nwith their ultimatum of 27 March 2000 as their letter of 29 March 2000 asked the\n\nDefendants to perform the agreement by 31 March 2000. There was therefore no valid notice\n\nrequiring delivery of the statutory declarations.46 Looking at the sequence of events, even\n\nthough strict compliance with the settlement agreement had been waived (i.e. delivery of\n\nthe statutory declarations and undertakings by 9 March 2000), it was clear that delivery\n\nof the documents was never waived. A fair reading of the letter of offer shows that all\n\nthe terms pertaining to time demanded strict compliance, i.e. time was of the essence. The\n\nPlaintiffs’ solicitors’ letter of 15 March 2000, while evidencing a\n\nmisunderstanding that the acceptance copy had not been received, nevertheless demanded in\n\nparagraph 3 that the acceptance copy be duly executed and delivered\n\n\"immediately\". Paragraph 4 of that letter then proceeded to remind the\n\nDefendants that all other terms had to be duly complied with, particularly delivery of the\n\nsaid documents together with the acceptance copy. Read in their context, surely the\n\nPlaintiffs were demanding delivery of the documents \"immediately\" as well.47 Even if the Defendants were sincere in\n\nasking the Plaintiffs for the desired format of the statutory declarations, clear\n\nguidelines had been given by 17 March 2000. The Plaintiffs granted them the indulgence of\n\nanother ten days before delivering their ultimatum o f 27 March 2000. Ten days to execute\n\nand deliver the documents, a requirement known to the Defendants since 2 March 2000 and\n\naccepted by them since 9 March 2000, must be more than reasonable notice. Despite the\n\nultimatum giving effectively another eight hours to comply, the Defendants were apparently\n\ncontent to let things be and displayed a completely lackadaisical attitude. Whatever\n\ndifficulties they professed to have had in compiling the information for the statutory\n\ndeclarations, the fact remained that what was produced finally was a one-page document per\n\nperson.48 The Plaintiffs’ solicitors’\n\nletter of 29 March 2000 was merely one written in response to the Defendants’\n\nrequest. It did not seek to qualify in any way their ultimatum of 27 March 2000 which set\n\nout the time for delivery of the documents but did not state that the settlement agreement\n\nwould otherwise be deemed terminated as at 4 pm on 28 March 2000.49 Apart from the circumstances showing\n\nclearly that more than a reasonable period of time for compliance had been given, the\n\nPlaintiffs could rely on Clause 19 of the Standard Terms and Conditions in any event to\n\novercome any contention on estoppel or waiver.50 It appeared also that the Defendants\n\nwere reading into the settlement agreement and the correspondence whatever they wanted to\n\nsee. They were attempting to re-interpret the clear provisions pertaining to interest\n\nwhich had to be paid on the entire compromised amount and not $3,427,000. The\n\n\"step-up basis\" in the settlement agreement obviously referred to the gradually\n\nincreasing monthly instalments ranging from $30,000 to $70,000. Further, despite the clear\n\nwording that interest would be charged with effect from 1 March 2000 (i.e. for 31 days as\n\non 31 March 2000), the Defendants proffered payment of interest for only 22 days,\n\napparently treating interest as running only after the date of their acceptance of the\n\nsettlement agreement on 9 March 2000.51 I saw no evidence of bad faith or ill\n\nintentions on the part of the Plaintiffs. I accepted their explanations pertaining to the\n\nalleged discrepancies in the amount owing. Clearly, the First Defendant was in breach of\n\nthe settlement agreement by its failure to deliver the requisite documents by 28 March\n\n2000 and the Plaintiffs were entitled to demand the full outstanding amount with interest\n\npursuant to the default provision in the settlement agreement. Although the two partial\n\npayments were not taken into account in the letter of demand, the error has since been\n\nrectified and due credit has been given. There was no confusion or prejudice caused to the\n\nDefendants by that error in any event. The Second, Third and Fourth Defendants were liable\n\nunder the terms of the guarantees.52 I therefore affirmed the decision of\n\nthe learned Assistant Registrar ordering that judgment be entered against all four\n\nDefendants. I also ordered the Defendants to pay $3,500 costs for the appeal.Tay Yong KwangJudicial CommissionerCopyright © Government of Singapore."
    }
}