{
    "case_title": "Public Prosecutor v Sim Teck Ho",
    "ncitation": "[2000] SGHC 66",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "THE CHARGE": "1 The Accused, a 33 year old male, was tried and convicted on the\n\nfollowing Charge which carries the mandatory death penalty:\"That you,SIM TECK HOon the 11thday of November 1999, at or about 1.00 pm,\n\n  at Blk 644 Yishun Street 61 #07-312, Singapore, did traffic in a controlled drug specified\n\n  in Class \"A\" of the First Schedule to the Misuse of Drugs Act, Chapter 185, to\n\n  wit, by having in your possession for the purpose of trafficking seven (7) plastic packets\n\n  containing not less than 130.46 grams of diamorphine at the aforesaid place without any\n\n  authorisation under the said Act or the Regulations made thereunder, and you have thereby\n\n  committed an offence under section 5(1)(a) read with section 5(2) and punishable\n\n  under section 33 of the Misuse of Drugs Act, Chapter 185.\"THE PROSECUTION’S CASE2 The facts are fairly straightforward and, by and larger, undisputed.\n\nOn 11 November 1999, at about 1 pm, a team of officers from the Central Narcotics Bureau\n\n(\"CNB\") raided a HDB flat at Block 644 Yishun Street 61 #07-312, Singapore. The\n\nteam comprised:(1) Insp Lee Chai Hwa;(2) SSG Rosely bin Sheron;(3) SGT Harry Ong Keng Leng;(4) SGT Mohd Azli bin Nasib; and(5) SGT Shadikin bin Abdullah.3 The occupiers of the flat were:(1) Mdm Tan Soh Gek (Accused’s mother, 58 years old);(2) Sim Soon Leong (Accused’s brother, 36 years old);(3) Sim Lai Huat (Accused’s brother, 29 years old); and(4) The Accused.All four had the keys to the flat. Although the Accused had rented a\n\nflat in the Sin Ming Industrial Estate, he was living with his mother at the Yishun flat\n\nfor one or two months before the raid. The rental of $12 per month for the Sin Ming Flat\n\nwas paid by his brother Sim Soon Leong.4 At the time of the raid, occupiers (1), (2) and (4) above were in the\n\nflat. Sim Lai Huat was at work. The Accused was sleeping in one of the three bedrooms. Mdm\n\nCheong Swee Hoon (wife of another of the Accused’s siblings) and her young daughter\n\nwere visiting the Accused’s mother.5 SGT Harry Ong had been instructed to wait at the foot of the block in\n\nquestion, under the kitchen windows of the flat, until after the Accused had been\n\narrested. The rest of the raiding team identified themselves, entered the flat and placed\n\nthe Accused under arrest on suspicion of having consumed a controlled drug. SGT Harry Ong\n\nwas then instructed to go up to the flat.6 A search of the flat was conducted by the officers in the presence of\n\nthe Accused. SGT Harry Ong searched the storeroom and found a Watson’s plastic bag\n\ncontaining seven packets of a yellow granular substance which he believed was heroin. The\n\nWatson’s plastic bag was placed between two red pails on the floor beneath the\n\nshelves. There was a pink plastic bag on the floor containing some vases. SGT Harry Ong\n\ncould not recall if the Watson’s plastic bag was rolled up. The Accused, escorted by\n\nSGT Shadikin, was then standing at the doorway of the storeroom behind SGT Harry Ong.7 INSP Lee was alerted to the find. He pointed to the Watson’s\n\nplastic bag and asked the Accused three questions in Hokkien with the Accused answering in\n\nthe same dialect as follows:\"Q1 : What is this?A1 : Doesn’t know what is this.Q2 : Whose stuff is this?A2 : Belong to ‘Ah Bei’ who is a Malaysian, which I kept for\n\n  him.Q3 : Why you keep the stuff for Ah Bei?A3 : To make $350 for keeping the stuff.\"The questions and answers were interpreted in English by INSP Lee and\n\nrecorded down in the Field Book by SGT Harry Ong.8 The Investigation Officer, ASP Fan Tuck Chee, was informed. He\n\narrived at the Yishun flat at about 3 pm that day. After he had been briefed on the facts\n\nof the arrest, ASP Fan asked the Accused six questions. The questions and answers were in\n\nHokkien but were recorded by ASP Fan in his Field Book in English. The questions and the\n\nAccused’s answers were:\"Q1 : What is this?A1 : I don’t know.Q2 : How much inside?A2 : I never see and I don’t know.Q3 : Who put this there?A3 : I did. I took it from a man and put it there.Q4 : Who passed this to you?A4 : ‘Ah Beh’, a Malaysian.Q5 : How can I find this ‘Ah Beh’?A5 : I have his number in my pocket. He asked me to call him if anybody\n\n  collects this thing (referring to bag) from me.Q6 : Who will collect from you?A6 : I don’t know.\"A piece of paper with the number 020167527126 and the Chinese words\n\n\"Ah Beh\" was recovered from the Accused.9 The Accused was then brought by the raiding team to his Sin Ming\n\nflat. Nothing of any relevance to this trial happened there. The team then returned with\n\nthe Accused to the Yishun flat where photographs of the flat and of the Watson’s\n\nplastic bag and its contents were taken in his presence.10 The cellophane papers used to wrap the seven packets of the yellow\n\nsubstance were sent for fingerprint examination but no prints of any value were found.11 The Accused was brought away from the Yishun flat to HQ CNB where\n\nhis urine sample was taken. He was then escorted to Alexandra Hospital for a pre-statement\n\nmedical examination. At about 10.15 pm, he was brought to the Major Investigation Branch\n\nwhere ASP Fan weighed, in his presence, the drug exhibits seized earlier. Their gross\n\nweight was 3193.63 grammes.12 A statement pursuant to Section 122(6) Criminal Procedure Code was\n\nthen taken by ASP Fan with the assistance of a Hokkien interpreter. The Accused made the\n\nfollowing statement:\"I do not know what is in there. A friend asked me to keep it for\n\n  him. He did not tell me it is ‘pen-hoon’. He told me someone would come to\n\n  collect the thing a few days later. The person will then call ‘Ah Beh’ on a\n\n  phone number which he gave me.\"13 ASP Fan then asked the Accused to contact Ah Beh at the telephone\n\nnumber indicated on the piece of paper seized from him at the Yishun flat. The Accused\n\ncalled that number but a recorded message indicated that the subscriber of that number was\n\nnot available as he was out of range. ASP Fan’s attempts to call that number met with\n\nthe same result. That number was subsequently ascertained to be a confidential Malaysian\n\ntelephone number. There was to date no reply from the Malaysian authorities to the\n\nCNB’s queries about that number.14 The seven packets of yellow substance were sent for testing by the\n\nDepartment of Scientific Services and were subsequently analysed to contain not less than\n\n130.46 grammes of diamorphine. ASP Fan estimated the street value of this quantity to be\n\nat least $50,400.15 The investigations showed that the Accused had less than $100 on his\n\nperson. His savings account also had less than $100 in it. His personal belongings\n\nincluded a gold chain, a gold ring and a watch.16 According to the Accused’s mother and his younger brother (Sim\n\nHai Huat), elderly neighbours living in the same block of flats would go to the Yishun\n\nflat once or twice a week to play mahjong with the Accused’s mother. The\n\nAccused’s mother did not know whether any of them went to the storeroom of the flat,\n\nwhich was used to store dry rations, underused household items and old comic books. The\n\nold comic books had been placed on the shelves in the storeroom by Sim Hai Huat at least\n\nthree to four years earlier. They were outdated issues which he no longer read. He had not\n\nbeen to the storeroom for some four years.17 On 16 November 1999, a further statement was taken from the Accused\n\nby ASP Fan. In it, the Accused said that when the raiding team first arrested him in the\n\nYishun flat, one of the officers asked him, \"Where is the thing?\" to which he\n\nreplied, \"What thing?\".18 On 17 November 1999, the Accused made a further statement\n\nelaborating on how he came to have the Watson’s plastic bag:\"9. I am now referred to ‘Ah Beh’ who I had mentioned at\n\n  paragraph 4 in my earlier statement. I do not know ‘Ah Beh’ personally and I\n\n  have never seen him before. He speaks to me in Hokkien and from his tone, I assumed that\n\n  he is Singaporean. On the Tuesday night (9.11.99) before I was arrested, I was at the\n\n  coffeeshop at Blk 605 Yishun. This is the coffeeshop where I was working as a hawker\n\n  assistant. At about 9 plus p.m., the orange public telephone, bearing number 2575933, at\n\n  the coffeeshop nearest to my stall rang and I answered the telephone. The person at the\n\n  other end of the line asked for ‘Teh Oh’. I asked him who he was and he\n\n  introduced himself as ‘Ah Beh’. Although I told him I do not know him, he told\n\n  me that if I were to see him, I would recognise him. He then told me that he would ask\n\n  someone to pass something to me to keep and somebody would collect it from me a few days\n\n  later. Without me asking, ‘Ah Beh’ also told me that the person who will collect\n\n  the ‘thing’ from me will also pay me $350/-. ‘Ah Beh’ told me that the\n\n  $350/- is for me doing the favour of keeping ‘the thing’ for him. ‘Ah\n\n  Beh’ also told me that after my work that night, ‘his worker’ will look for\n\n  ‘Teh Oh’ at my stall and identify himself as working for ‘Ah Beh’. The\n\n  worker will pass ‘the thing’ and a piece of telephone paper to me and when\n\n  somebody collects the ‘thing’ from me a few days later, I am to pass the\n\n  telephone paper to that person and ask the person to call ‘Ah Beh’. The\n\n  conversation with ‘Ah Beh’ over the telephone lasted a little more than five\n\n  minutes.10. During the conversation, I did not ask what ‘Ah Beh’\n\n  wants me to keep and I also did not wonder why he would give me $350/- for keeping the\n\n  ‘thing’ for him. I never suspected that it could be anything illegal. After the\n\n  telephone call, I went back to work until about 11.00 p.m. when the stall closes. After\n\n  packing up, it was about 11.15 p.m., a male Malay and a male Chinese, both in their early\n\n  thirties approached me. The male Chinese asked me who is ‘Teh Oh’ and when I\n\n  identified myself, he told me that his ‘boss’ had asked me to keep the\n\n  ‘thing’ and also passed me a piece of paper with the telephone number of\n\n  ‘Ah Beh’. The male Malay and then handed over a blue plastic bag to me. I had\n\n  noticed that all along, the male Malay had been carrying the blue plastic bag which was\n\n  later recovered from the Yishun flat by the officers. The two men then left. I have never\n\n  met these two men before.11. After the blue plastic was being handed over to me, I headed\n\n  straight for my mother’s flat at Blk 644 Yishun. During the walk home, I held on to\n\n  the blue plastic bag all along and did not stop over at anywhere else. I reached my\n\n  mother’s home and everybody was asleep then. I opened the door and went straight to\n\n  the storeroom. I placed the blue plastic bag on the floor, in between two red pails at the\n\n  lowest level of the rack. From the time I received the blue plastic bag till the time I\n\n  placed it at the storeroom, I did not see what was inside the plastic bag and it never\n\n  crossed my mind then to find out what was inside the plastic bag. After that, I went to\n\n  shower and then to sleep in the living room on the sofa. Since I shifted in to stay with\n\n  my mother, I have been sleeping in the living room.12. On Wednesday (10.11.99), I woke up in the afternoon and did not go\n\n  out at all. Just before 4.00 p.m., I left the flat for the hawker stall at the coffeeshop\n\n  at Blk 605. I reported for work as usual and at about 8.00 p.m., I went to see a doctor\n\n  for my chest pains. Thereafter, I went back to work until 11.00 p.m. before returning to\n\n  my mother’s place. As usual, everybody was asleep and I also went to sleep after I\n\n  showered.13. On Thursday (11.11.99), the day when I was arrested, my third\n\n  brother Sim Soon Leong woke me up and asked me to sleep in the bedroom sometime in the\n\n  afternoon. After I slept in the bedroom for a while, I was arrested.14. Since I placed the blue plastic bag in the storeroom on Tuesday, I\n\n  had not entered the storeroom. Neither have I checked if the plastic bag was still there\n\n  on Wednesday or Thursday. I do not think that anybody in my family has touched the blue\n\n  plastic because everybody in the house seldom use the storeroom. That is also the reason\n\n  why I placed the blue plastic bag in the storeroom as I believe that it is a safe place\n\n  for nobody will notice it there. Since ‘Ah Beh’ entrusted me with the plastic\n\n  bag, I have the responsibility of making sure that it is not lost. Therefore, I decided to\n\n  keep the plastic bag in the storeroom.15. Inside the storeroom, on the top most shelf are empty boxes. There\n\n  are also kitchen utensils and items for praying. There are also storybooks which belong to\n\n  my younger brother, Sim Hai Huat. As I know, these are the old storybooks that he has.\n\n  Nowadays, he will read the newer ones that he keeps inside his room. The kitchen utensils\n\n  and the prayer items are also not being used as these are old items and kept as extras in\n\n  the storeroom.16. Altogether, there are five people staying at the flat in Blk 644\n\n  Yishun. They are my mother, myself and my brothers, Soon Leong, Teck Leong and Hai Huat.\n\n  Other than Teck Leong and myself who are temporarily staying there, the rest are residing\n\n  there permanently.\"19 In yet another statement on 23 November 1999, the Accused added the\n\nfollowing:\"20. I am referred back to the incident in which ‘Ah\n\n  Beh’ contacted me. ‘Ah Beh’ only told me then that a few days later,\n\n  sometime would contact me by calling in to the telephone 2575933 at the coffeeshop. The\n\n  person will identify himself as a worker of ‘Ah Beh’ and when he comes, I was\n\n  supposed to hand him the blue plastic bag and the slip of ‘telephone paper’. The\n\n  person will also pay me $350/-. I do not know why ‘Ah Beh’ would contact me to\n\n  keep the plastic bag since I do not know him. During my conversation with ‘Ah\n\n  Beh’, I was told that the $350/- is for me helping to keep the ‘thing’ but\n\n  I did not bargain with him about the amount that I would receive. This is the first time\n\n  that ‘Ah Beh’ contacted me. Sometimes, people would contact me using the public\n\n  telephone at the coffeeshop but very seldom.\"20 All the statements made by the Accused were not challenged by the\n\nDefence. In the light of the above evidence, Defence Counsel correctly decided not to make\n\nany submissions that there was no case to answer as there clearly was aprima faciecase made out by the Prosecution. Accordingly, the Accused was called upon to make his\n\ndefence to the Charge.",
        "THE CASE FOR THE DEFENCE": "21 The only witness for the Defence was the Accused himself. He\n\ntestified that he was a divorcee with two children. He had been educated up to Primary 3\n\nonly in the Chinese Stream but was practically illiterate in Mandarin and completely\n\nilliterate where the English language was concerned. He would converse in Hokkien.22 On 11 November 1999, he had been working as a cook in a coffeeshop\n\nin Block 605 Yishun for about a week. Prior to that, he was unemployed.23 When the raiding team arrested him, they asked him if he had\n\nanything with him but he did not quite know what they meant. He asked for clarification\n\nand was asked again if he had anything, to which he responded in the negative, not knowing\n\nwhat they were asking him about.24 The Accused said he did not know the plastic bag recovered in the\n\nstoreroom contained heroin until he was so informed by SGT Harry Ong. Before ASP Fan\n\narrived at the scene, the CNB officers simply wrote something in a book and asked him to\n\nsign in it. He did not ask them what was written in it. The Accused confirmed, however,\n\nthat the questions recorded were those asked of him and that he had given the replies\n\nstated in the record. When he said he was keeping the stuff for Ah Bei, he meant the\n\nplastic bag only.25 He could not recall where exactly in the storeroom he had placed the\n\nWatson’s plastic bag except that it was on the floor where there were a few plastic\n\nbags. He placed the Watson’s plastic bag among them, next to the one containing the\n\nvases.26 The Accused went on to testify that there was no definite place in\n\nthe flat that he would sleep in. Apart from the family members, there would be people\n\ngoing into the flat everyday to play mahjong. There would be four players and some\n\nspectators watching the game. His sister-in-law’s friends had also gone to the flat\n\nto play mahjong.27 He then recounted essentially what he had said in his statements\n\nabout how he came to have the Watson’s plastic bag. He added that when Ah Bei called\n\nhim over the telephone, he said he was one of the Accused’s former prison-mates but\n\nthe Accused could not recall who he was. The two persons who passed the plastic bag to him\n\non 9 November 1999 were a Chinese and a Malay who claimed that they were Ah Bei’s\n\ncolleagues. He did not see Ah Bei before his arrest on 11 November 1999. He would be paid\n\nthe $350/- only when the plastic bag was collected in a few days’ time. He was not\n\ntold who would be collecting it from him.28 The Accused had no knowledge whatsoever of the contents of the\n\nplastic bag. Ah Bei did not inform him and he did not ask Ah Bei as he was busy working\n\nthen. When the plastic bag was handed over to him by the two men, he did not ask them\n\neither what it contained. The two men left immediately after handing it and the piece of\n\npaper containing the telephone number to him.29 While the plastic bag was not sealed up, the top was rolled up. He\n\nwas exhausted after a hard day’s work and after placing it in the storeroom in the\n\nflat, he went to bed and did not look at it again until after his arrest. He decided to\n\nkeep it in the storeroom as he had no other place in the flat to keep it. Besides, his\n\nfamily members seldom went into the storeroom. They did not know that he had placed the\n\nbag there. Since somebody had entrusted something to him, he had to make sure that it was\n\nkept properly. He did not know why he was willing to be the custodian of the bag except\n\nthat he was quite an obliging person.30 The next day (10 November 1999), he felt unwell and went to see a\n\ndoctor at about 8 pm. He then returned to work. After completing the day’s work, he\n\nreturned to the Yishun flat, took the medication and then slept until the next day when\n\nthe raiding team arrested him.31 The Accused also confirmed the questions and answers recorded by ASP\n\nFan in the flat as accurate except that for the fifth question, his answer was actually\n\nthat Ah Bei had asked him to pass the piece of paper containing the telephone number to\n\nthe person collecting the plastic bag so that that person could contact Ah Bei.32 When he was first told that the thing he was keeping was a\n\ncontrolled drug, he was shocked. When he saw the seven packets inside the plastic bag, he\n\nbecame frightened as he knew what heroin looked like. He would not have kept them if he\n\nhad known that they contained a controlled drug. He denied any involvement in the\n\ntrafficking of the drug.33 Under cross-examination, the Accused said he did not even keep a\n\nchange of clothes at Yishun flat. He would put on his brother’s clothes.34 When Ah Bei called the coffeeshop on 9 November 1999, it was through\n\nthe public telephone which the Accused happened to answer. Besides the matters already\n\nmentioned, Ah Bei told him nothing else except that he was a Malaysian although the\n\nAccused noted from his accent that he sounded more like a Singaporean. He did not find the\n\nepisode strange as he had had a similar encounter in 1997. Back then, someone had also\n\nasked him to keep something for him and he found out subsequently that it was watches\n\nwhich were later displayed for sale at a night bazaar. He was also paid $350 on that\n\noccasion.35 When the two men went to the coffeeshop to hand the plastic bag to\n\nhim, they asked around for ‘Teh Oh’, the Accused’s nickname. After\n\nreceiving the plastic bag, the Accused merely put it aside at the dishwashing area outside\n\nthe coffeeshop and after cleaning up the stall, he brought it to the Yishun flat. It was\n\nnot heavy and he did not feel the contents of the plastic bag. He merely held on to it. He\n\ndid not think at all about what could be in it as he was very tired. He did not check to\n\nsee whether there were perishable items therein. It did not occur to him that there might\n\nbe illegal substance inside. He had slipped the piece of paper with the telephone number\n\ninto his wallet.36 The Accused then claimed that he had actually placed the plastic bag\n\non the floor outside the shelves in the storeroom and not in between the two red pails\n\nunder the shelves. He explained that the exact spot was not made clear to him by the\n\ninterpreter during the taking of his statement on 17 November 1999. He added that the\n\nstoreroom was the place where people usually kept unwanted things and that was also why he\n\nleft the plastic bag inside. It was not because he did not want his family members to find\n\nout about it. He did not tell his family that he had placed something in the storeroom\n\nbecause no one would touch the unwanted things therein or accidentally throw them away.\n\nThe comic books had been inside the storeroom for years and no one had sold them to the\n\nrag and bone collector. When the plastic bag was shown to him after it was found, it\n\nlooked the same size as it did on 9 November 1999.THE DECISION OF THE COURT37 The Prosecution relied on the presumption in Section 17(c) of the\n\nMisuse of Drugs Act which provides that any person proved to have had in his possession\n\nmore than 2 grammes of diamorphine shall be presumed to have had that drug in possession\n\nfor the purpose of trafficking unless it is proved that his possession of that drug was\n\nnot for that purpose. The Prosecution also invoked the presumption in Section 18(2) that\n\nany person proved to have had a controlled drug in his possession shall, until the\n\ncontrary is proved, be presumed to have known the nature of that drug. It is trite law\n\nthat the Prosecution has to prove the pre-conditions for the presumptions beyond\n\nreasonable doubt while the Defence only has to prove the necessary facts on a balance of\n\nprobabilities in order to rebut the presumptions.38 The Accused has admitted being in possession of the Watson’s\n\nplastic bag but not of its contents. In my view, it is a totally untenable proposition\n\nbecause the plastic bag in itself has no intrinsic value and he knew that what he was\n\nkeeping was not the plastic bag but its contents. By placing it in the storeroom, he has\n\nnot ceased being in possession of the plastic bag and its contents in the same way as a\n\nperson placing his wallet in his drawer at home does not cease to be in possession of the\n\nwallet or its contents.39 The fact that there were frequent visitors to the Yishun flat and\n\nthat there were other members of his family residing therein do not change the position.\n\nBy his own evidence, his family did not even know of the existence of the plastic bag in\n\nthe storeroom. If it was intimated that anyone of them could have changed the contents of\n\nthe plastic bag in question, that was not suggested at all to the two family members who\n\ntook the witness stand. The Defence has also chosen not to question any of the other\n\nfamily members offered for cross-examination. Similarly, the visitors were at the Yishun\n\nflat to play or to watch mahjong games. There was no reason for any of them to go to the\n\nrather small storeroom. Indeed, that was one of the reasons why the Accused chose to place\n\nthe plastic bag in the storeroom. Again, if the suggestion was that any of the visitors\n\ncould have placed the drug in question, it would have been remarkably coincidental that\n\nthe Watson’s plastic bag under the shelves (which is where I find it was placed by\n\nthe Accused on 9 November 1999) was precisely the one targeted. I find that no one, other\n\nthan the Accused, entered the storeroom between 9 November 1999 and 11 November 1999 and\n\nthat the plastic bag and its contents remained intact from the time it was placed in the\n\nstoreroom by the Accused until the time of its discovery by the CNB officers.40 The Prosecution has therefore proved that the plastic bag and its\n\ncontents were in the physical control of the Accused. What then about the Accused’s\n\nassertions of total ignorance of the contents? The essence of the Accused’s testimony\n\nwas that he took custody of something which he knew nothing about from someone he knew\n\nnothing about through two intermediaries he knew nothing about and which would be\n\ncollected from him by someone whom he knew nothing about. The law on ignorance as a\n\ndefence is succinctly stated by the Court of Appeal inYeo Choon Huat v PP[1998] 1 SLR 217at page 226 (paragraph 22) where Karthigesu JA, in delivering the judgment of the\n\nCourt, said:\"In short, ignorance is a defence only when there is no reason for\n\n  suspicion and no right and opportunity of examination; ignorance simpliciter is not\n\n  enough.\"41 The circumstances leading to the plastic bag coming into the\n\npossession of the Accused, if true, were so highly suspicious that it would require a\n\ntotally mindless person to have done what the Accused claimed he did. The Accused, despite\n\nhis lack of formal education, was not such a mindless person. If he was such an obliging\n\nand responsible person as he claimed to be, then he would surely have enquired from Ah Bei\n\nor his two associates as to the contents of the plastic bag. It need not be because he\n\nsuspected something illicit might be in it. He would still need to know whether the\n\ncontents were fragile or perishable in order to discharge his duties responsibly. After\n\nall, the contents must either be of monetary or sentimental value to the owner. At the\n\nleast, he would have opened the rolled plastic bag to take a peek. It was not as if he had\n\nbeen instructed not to look inside. If he had been, then more questions would have arisen.\n\nThe plastic bag contained bulky substances weighing some 3 kg. It was not a small item\n\nwhich one could easily slip into the pocket and forget about. He did not even bother to\n\nask why the plastic bag should be kept by him for a few days. In addition, the owner was\n\nnot only someone unknown to him, he was also a former inmate in prison.42 In all the circumstances of the case, it is an irresistible\n\ninference that I must draw that the Accused knew clearly what he was receiving and keeping\n\nwas a controlled drug despite his protestations to the contrary at the time of his arrest,\n\nin his various statements and in Court. Even if he did not know, that would be no defence\n\nto the Charge as the circumstances were highly suspicious and he had every opportunity to\n\ntake a look inside the plastic bag (and he would have recognized the illegal substance)\n\nbut chose not to.43 The Defence further contended that all the Accused had done was to\n\nkeep the drug for Ah Bei who would be sending somebody to collect it at a later date and\n\nthat such keeping was not one of the overt acts contemplated by the definition of\n\n\"traffic\" in Section 2 of the Act which provides:\" ‘traffic’ means –(a) to sell, give, administer, transport, send, deliver or distribute;\n\n  or(b) to offer to do anything mentioned in paragraph (a).\"In other words, the Accused would merely return the drug to the owner\n\nor agents of the owner and was therefore not trafficking.44 InLee Yuan Kwang v PP[1995] 2 SLR 349at page 369, Yong\n\nPung How CJ in the Court of Appeal said:\"It should be noted that the amendments to the Act in December\n\n  1993 have changed the complexion of s 17 and also introduced s 5(2). Thus, we do not see\n\n  how the statements of the Privy Council inOng Ah Chuancould have any relevance in\n\n  the current statutory climate. The definition of ‘traffic’ in s 2 of the Act has\n\n  not been amended. The Act itself makes no reference to ‘end-users’ or promotion\n\n  or distribution of drugs, apart from the fact that ‘distribute’ comes within one\n\n  of the seven definitions of ‘traffic’ in s 2. There is no requirement that the\n\n  person found in possession must be shown to be a ‘dealer’ or\n\n  ‘supplier’ in order for the presumption of trafficking in s 17 to operate. There\n\n  is also no requirement in the Act for any directly proximate connection between any\n\n  particular end-user and an accused who is found in possession of a quantity of drugs which\n\n  attracts the presumption of trafficking in s 17.\"45 It must be noted that there was no evidence that the person who\n\nwould collect the drug from the Accused was going to be Ah Bei’s agent. As far as the\n\nAccused was concerned, it could be anybody and that person need not be the end-user of the\n\ndrug. The Accused was therefore part of some distribution system or was at least some form\n\nof conduit. In my view, that is sufficient to bring him within the words \"give,\n\n…, deliver or distribute\" in the definition of \"traffic\".46 The twin presumptions invoked by the Prosecution therefore applied\n\nwith full force against the Accused who has clearly not succeeded in rebutting them in any\n\nway. I was satisfied beyond reasonable doubt that the Accused was guilty as charged and\n\nconvicted him accordingly.47 The mandatory death sentence was pronounced upon his conviction.TAY YONG KWANGJUDICIAL COMMISSIONERSUPREME COURTCopyright © Government of Singapore."
    }
}