{
    "case_title": "Mak Seng Fook v Lin Kao Chi and Another",
    "ncitation": "[2000] SGHC 42",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The background": "2 The first defendant was a director of the second defendants. He was\n\nintroduced to Mak and one Tan Dib Jin (who is the plaintiff in Suit No. 691 of 1999) by\n\nWee Hup Choon (Wee). At that time, Wee was an employee of the first defendant. Shortly\n\nthereafter, sometime in 1993, the parties entered into an oral agreement (the oral\n\nagreement) for the sale and purchase of a 16,000 sq. m. factory building to be built in\n\nTong An, People’s Republic of China. This agreement was made between Mak, Tan Dib Jin\n\n(Tan) and Wee of the one part as the purchasers (hereinafter they will be referred to\n\ncollectively as the purchasers), and the first defendant of the other part as the vendor.\n\nWhether the first defendant was acting as a principal or agent in entering into the\n\ncontract was a matter disputed by the parties and I will deal with this question in\n\ngreater detail later. The following are the undisputed facts.3. Under the oral agreement, the purchase price of the factory was\n\nfixed at Chinese renminbi (RMB) 19.2m (equivalent to S$3,456,000). It was agreed that 20%\n\nof the purchase price was to be paid upon commitment as deposit. Pursuant to the oral\n\nagreement, the purchasers paid a total of around 30% of the purchase price to the second\n\ndefendants, on the first defendant’s instructions. Subsequently, Mak was paid (over a\n\nfew occasions) the total sum of S$244,150 by the second defendants.4. In brief, Mak’s case was that the oral agreement was made\n\nsubject to all the parties executing a written agreement, which the first defendant was\n\nsupposed to prepare. The written agreement was to incorporate all the terms and conditions\n\nof the oral agreement as well as the building plans and specifications of the proposed\n\nfactory. Mak claimed that the first defendant failed to prepare the said written agreement\n\ndespite repeated requests and demands by the purchasers to do so. Some time later, the\n\nfirst defendant expressed his intention to rescind the oral agreement. Thus, a second oral\n\nagreement (the second agreement) was entered into between the same four parties, whereby\n\nit was agreed that the earlier oral agreement would be rescinded and that the first\n\ndefendant would refund all the monies paid by the purchasers under the oral agreement\n\ntogether with interest thereon at 10% per annum. It was pursuant to this second agreement\n\nthat the sum of S$244,150, as mentioned earlier, was paid to Mak by the second defendants.\n\nHowever, no monies were paid to Tan and Wee by the first or second defendants. Mak then\n\nbrought the present suit against the defendants to claim for the refund of the balance of\n\nthe monies paid by him under the first oral agreement together with interest at 10% per\n\nannum.5. In response, it was contended by the first defendant that he and the\n\nsecond defendants were not the right parties for Mak to sue as he had entered into the\n\noral agreement only as an agent. The principal for whom the first defendant was allegedly\n\nacting for was a company in China called Xiamen Tonggi Development Co Ltd (Tonggi). The\n\nfirst defendant denied that he was supposed to prepare a written agreement as was claimed\n\nby Mak and the other two. The first defendant also denied that he or Tonggi, sought to\n\nterminate the oral agreement. It was alleged that the purchasers were the ones who were in\n\nbreach of the oral agreement by failing to pay the balance of the purchase price due. On\n\nthe sum of $244,150 paid to Mak by the second defendants, the explanation given was that\n\nit was a loan extended to Mak who was experiencing financial difficulties at the relevant\n\ntime.",
        "The proceedings": "6. Mak was not the only one who commenced proceedings against the first\n\nand second defendants. As stated earlier, proceedings in Suit No. 691 of 1999 (Suit 691)\n\nwere initiated by Tan against the same two defendants with respect to the same facts and\n\ncircumstances, claiming the sum that he had paid to the second defendants pursuant to the\n\noral agreement. In both the present suit and Suit 691, summary judgment was sought by the\n\nplaintiffs. The Order 14 application for Suit No. 1110 of 1999 was heard by Assistant\n\nRegistrar Wan Wai Yee whilst that for Suit 691 was heard by the Deputy Registrar, Ng Peng\n\nHong. In the two separate hearings, the same decision was reached whereby summary judgment\n\nwas granted in favour of both plaintiffs.7. The defendants, being dissatisfied with the decisions in both the\n\nOrder 14 proceedings, proceeded to appeal against the decisions. As the claims in both\n\nsuits arose out of the same facts, the defendants’ counsel requested and it was\n\narranged, for both the appeals to be heard at the same time by the same Court. The appeals\n\n(RA 424/99 and RA 425/99) came up for hearing before me. At the commencement of the\n\nhearing of RA 424/99 (which relates to Suit No. 1110 of 1999) I informed counsel that its\n\ndetermination would apply to RA 425/99 in Suit 691; no objections were raised to my\n\nruling. However, I should point out that in hearing the appeal, reference was made to the\n\npleadings filed in Suit 691 in particular the Defence, as no equivalent pleading was filed\n\nby the defendants for Suit No. 1110 of 1999.",
        "The plaintiffs’ case": "8. Sometime around April 1993, Mak and Tan were first informed by Wee\n\nthat his employer, the first defendant, was developing a project in China and he asked if\n\nthey were interested in participating in it. After Mak and Tan expressed their interest in\n\nthe said project, Wee arranged for them to meet the first defendant at the latter’s\n\noffice at the second defendants’ premises at No. 121 Kallang Way, Singapore. At this\n\nmeeting, the first defendant informed them that he had many businesses in Taiwan, China\n\nand Singapore and that he had acquired large parcels of land in Tong An, a province near\n\nXiamen, China. The first defendant was interested in developing his land into a commercial\n\narea and he mooted to Mak and Tan his idea of building a factory to their specifications\n\nand selling the factory to them and then leasing back the completed factory building from\n\nthem at a guaranteed minimum rental. No specific proposal was, however, discussed during\n\nthis first meeting.9. A few days after that initial meeting, the first defendant sent Wee\n\nto inform Mak and Tan of the specific proposal that he had in mind; Mak and Tan were very\n\ninterested. After several discussions and subsequent meetings with Wee, who was acting as\n\nthe agent of the first defendant, Mak and Tan decided to meet the first defendant in\n\nperson to finalise the terms and conditions of their proposed investment. As most of the\n\nearlier discussions with Wee were done orally, Mak and Tan decided to reduce into writing\n\nthe terms which they had already previously discussed with Wee. A written document (see\n\nMak’s first affidavit exhibit MSF-1) was therefore prepared by Mak and Tan which\n\nincorporated the terms and conditions which Tan had made in his specific proposal as well\n\nas those which the former two wanted to be included in the final agreement to be made.10. The purchasers subsequently met with the first defendant again, at\n\naround April 1993, to discuss and confirm the terms and conditions of the specific\n\nproposal. As Mak and Tan were only able to take up 80% share in the proposed factory\n\nbuilding, Wee was invited to join in the investment and take up the remaining 20% share.\n\nAn oral agreement was thus made between the first defendant of the one part and the\n\npurchasers jointly of the other part. Under the oral agreement, it was agreed that the\n\nfirst defendant would build a four-storey factory building in Tong An, China, with a total\n\nfloor area of 16,000 square metre and sell it to the purchasers at the price of RMB 19.2m,\n\ni.e. at RMB 1,200 per sq. m. The first defendant would then lease back the completed\n\nfactory building from the purchasers at a guaranteed minimum rental of RMB 200 per sq. m.\n\na year. With regard to the payment terms, it was agreed that the purchasers would pay 20%\n\nof the purchase price as deposit upon their commitment to the project and a further 10%\n\none year later at the first defendant’s request. The balance 70% of the purchase\n\nprice was to be paid by a bank loan to be procured by the first defendant using the\n\nfactory building as a collateral.11. According to Mak, whose account was substantiated by Tan and Wee,\n\nthe oral agreement was made subject to the first defendant preparing a written agreement\n\nincorporating all the terms and conditions of the oral agreement as well as all the\n\nbuilding plans and specifications of the proposed factory building. The written agreement\n\nwas to be executed by the first defendant and the purchasers. The first defendant promised\n\nto prepare the written agreement for their execution as soon as possible but as the\n\nbuilding and site plans would take quite a while before they could be finalised, he\n\nsuggested that the purchasers make the 20% deposit payment first on a ‘subject to\n\ncontract’ basis. The purchasers agreed to pay the 20% deposit subject to the written\n\nagreement being executed by them.12. Subsequently, Mak was asked by Wee to take over half () of his 20% share as he was short of funds and Wee\n\noffered to buy them back once he had sufficient funds. Mak agreed, thereby increasing his\n\nown share from 50% to 60%. Tan and the first defendant were both aware of the arrangement\n\nbetween Wee and Mak and did not raise any objections.13. Pursuant to the oral agreement, the purchasers made payments for\n\nthe deposit amounting to 20% of the purchase price. The payments were, on the instructions\n\nof the first defendant, made to the second defendants. Thereafter, the purchasers\n\nrepeatedly pressed the first defendant for the written agreement but he would always give\n\nthe excuse that the agreement was still not ready due to certain technicalities. The first\n\ndefendant assured the purchasers that the written agreement would be ready shortly and\n\nreminded them to make payment of another 10% of the purchase price as agreed under the\n\noral agreement. As the purchasers still trusted the first defendant, they agreed to make\n\nthe payments. Thus, more payments were made by the purchasers to the second defendants.\n\nAltogether, the purchasers paid to the second defendants about 30% of the purchase price\n\nof the factory. A breakdown of the respective payments made by each of the purchasers is\n\nas follows:Mak Seng Fook :DateAmount paid (in\n\n        Singapore Dollars)12/05/1993$172,80010/06/1993$ 40,00010/06/1993$132,80023/06/1993$ 69,00030/11/1994$164,86330/11/1994$ 32,973Total:$612,436Tan Dib\n\n    Jin:DateAmount\n\n        paid (in Singapore Dollars)13/05/1993$103,68010/06/1993$103,68030/11/1994$ 98,918Total:$306,278Wee Hup\n\n    Choon :DateAmount\n\n        paidMay 1993RMB\n\n        384,000May 1995S$\n\n        12,97214. Sometime in 1995, the purchasers became concerned as the first\n\ndefendant still could not produce the written agreement for execution. In early 1996, Mak\n\nand Tan confronted the first defendant and threatened to take legal action against him if\n\nhe continued to delay in getting the written agreement ready. Sometime near the end of\n\n1996, Wee informed Mak that the first defendant wished to terminate the oral agreement and\n\nthat he was prepared to refund the purchasers all the monies that had been paid by them\n\ntogether with interest. After discussing the matter, the purchasers met with the first\n\ndefendant in February 1997 and a second oral agreement (the second agreement) was made\n\nbetween all of them. Under this second agreement, it was agreed that the first oral\n\nagreement would be rescinded and that the first defendant would refund to the purchasers\n\nall the monies paid by them pursuant to the earlier oral agreement together with interest\n\nthereon at the rate of 10% per annum.15. The first defendant delayed in making the refunds as promised and\n\nit was only after repeated demands that Mak finally received the following amounts from\n\nthe first defendant:DateCopyright © Government of Singapore."
    }
}