{
    "case_title": "Public Prosecutor v Tan Siew Lam and Another",
    "ncitation": "[2000] SGHC 161",
    "coram": "Amarjeet Singh JC",
    "sections": {
        "Prima Facie Case": "11.    I was satisfied at\n\nthe end of the Prosecution’s case, that the Prosecution had proved aprima faciecase against each of the Accused in respect of the charge each faced in view of the\n\nfollowing unchallenged evidence:",
        "1stAccused": "11.1    The 1stAccused was seen taking delivery of an orange plastic bag from the 2ndAccused\n\nin the car park as stated earlier. He was seen walking with it towards the lift bay in Blk\n\n164. The 1stAccused took lift B to the 8thfloor where he resided.\n\nWhen the door of lift B opened, CNB officers who were waiting for him, arrested him with\n\nthe red plastic bag held in his hand which later revealed 3 packets of substance\n\ncontaining morphine having a gross weight of about 1,321.5 grams anda nett weight of\n\n62.26 grams of morphine. The 1stAccused admitted in his oral statement at\n\nhis flat which was recorded and signed by him and which was unchallenged by him that there\n\nwere 4 packets of heroin in the orange plastic bag and that they belonged to him and that\n\nhe was staying in flat No. 168 of the 8thfloor in which flat, paraphernalia\n\nrelating to re-packing and sealing of drugs was found. The door of the 1stAccused’s flat had been opened with the keys found in his possession. Although the 1stAccused stated there were 4 packets of heroin in the orange plastic bag, the fact is that\n\n3 packets containing 62.26 grams of morphine were still found. The other discrepancy\n\nrelating to the 1stAccused calling the drugs heroin when it was morphine again\n\nwas of no consequence as both are controlled drugs.11.2    The 1stAccused, was, on the Prosecution’s evidence and admittedly as set out above,\n\ntherefore clearly in possession of the morphine in the quantity charged. The presumption\n\nin s 17(1) of the MDA escalated his possession of more than 3 grams of morphine to\n\npossession for the purpose of trafficking. The further presumption in s 5(2) of the said\n\nAct, escalated the possession for the purpose of trafficking to trafficking. The 1stAccused was, in the circumstances,prima facie, trafficking in the said amount of\n\nmorphine and the onus was on the 1stAccused to prove on a balance of\n\nprobabilities that he was not and as such, I called upon him to enter his defence.",
        "2ndAccused": "11.3    The 2ndAccused, a Malaysian who had arrived from Johore Bahru, that night was seengivingthe orange coloured plastic bag which he took from his car seat by both S/S/Sgt Tan and\n\nSgt Eddie Wee. That bag containing three packets of morphine (with 62.26 grams of\n\nmorphine) was immediately afterwards found in the possession of the 1stAccused\n\nwho had walked away with it after receiving it and gone up lift B in Blk 164. S/S/Sgt Tan\n\nand Sgt Eddie Wee identified the orange plastic bag as similar to the one the 2ndAccused gave to the 1stAccused. They also identified the 2ndAccused in Court.11.4    The only\n\nirresistibleprima facieinference I could draw was that the orange plastic bag\n\nfound on the 1stAccused with the morphine in question was the same onegivento him by the 2ndAccused and it contained the said morphine when so given\n\nby the 2ndAccused. Under s 18 of the MDA, the 2ndAccused is\n\npresumed to have known the nature of the drug in the said bag namely that it was morphine.\n\nThe 2ndAccused therefore had the morphine in his possession when he gave it to\n\nthe 1stAccused. As he was in possession and observed by CNB officersgivingthe said bag containing the morphine to the 2ndAccused, he was under the\n\ndefinition section of the MDA, s 2(a), trafficking in the said morphine. In section 2\n\ntraffic is denied amongst othere things, as:\"(a) to sell, give …..\"11.5    The Prosecution had\n\nalso, therefore, made out aprima faciecase of trafficking against the 2ndAccused which if unrebutted, would warrant his conviction. I called upon him to enter his\n\ndefence. It was for the 2ndAccused to prove the contrary.The Defence12.    Both Accused elected\n\nto give evidence on oath.1stAccused13.    Briefly, the 1stAccused’s evidence was that at about 9.00pm on 1stFebruary 2000 he was\n\nwaiting for his boss, one Ah Seng, a Malaysian, in his rented flat where he stayed alone,\n\nto come and deliver some goods to him. At about 10.00pm, Ah Seng telephoned him and said\n\nhe was not free but had arranged for someone else, an Indian, to make the delivery to the\n\n1stAccused and the money in respect of the goods would be collected from him\n\nlater. Ah Seng told him to go to the carpark of Blk 164 and upon seeing an Indian man\n\narriving there by car, he was to ask him if he was a friend of one Ah John, so that the\n\nIndian man could then deliver the goods to him but not to open the plastic bag in from of\n\nthe Indian as he did ot know what would be inside the said bag. The 1stAccused\n\ntestified that he himself did not know Ah John. He did so accordingly by going down to the\n\nsaid carpark carrying his handphone and a bunch of keys. There he took delivery of an\n\norange coloured plastic bag similar toExh. P108which contained the goods from an\n\nIndian after asking him if he is a friend of ‘John’. He gave the Indian whom he\n\nidentified as the 2ndAccused an ‘ang pow’ packet containing $168/-\n\nfor Chinese New Year which was a few days away. He then added that at first the 2ndAccused did not want to take the ‘ang pow’ but when told it was for Chinese New\n\nYear, he took it. The 1stAccused said that he had not met the 2ndAccused before now nor had he spoken to him over the telephone. The 1stAccused\n\nsaid he was soon afterwards arrested with the said goods.13.1    The 1stAccused further admitted that the goods he was intending to collect, was heroin and agreed\n\nthat he had witnessed the opening of the newspaper bundles by the Investigating Officer\n\ntaken from the orange plastic bag in which there were the 3 packets of substance which he\n\nsaid was heroin. He went on to say that he had ordered 4 packets of heroin. He could not\n\ntell the difference between diamorphine (heroin) although he knew that in Mandarin\n\nmorphine was called ‘ma fei’. He did not know why he had only received 3\n\npackets.13.2    The 1stAccused confirmed that his mobile phone number was 96714234 and calls to the phone would\n\nautomatically go to a voice box if unanswered. This mobile phone was seized from the 1stAccused upon his arrest at 8thfloor level when he emerged from the lift. He\n\nalso confirmed that all the drug paraphernalia found by CNB officers in the flat belonged\n\nto him.2ndAccused14.    The 2ndAccused was a second year student studying for his diploma in computer science at an\n\nInformatics institution in Johore Bahru. His defence was that he did not know what was\n\ncontained in the orange plastic bag when he delivered it to the 1stAccused. On\n\nthe evening of 1stFebruary 2000 at about 6.00pm, he had been contacted by one\n\nJohn a Malaysian whom he knew for 2 – 3 months. John was then in Singapore. The 2ndAccused said he told John he was coming to Singapore with his mother as his mother wanted\n\nto cash some S$ dollars from her POSB Bank ATM machine at Woodlands. John asked the 2ndAccused to pick him up at Ang Mo Kio MRT station and give him a lift back to Johore Bahru.\n\nHe agreed. He left his mother at Woodlands at 9.30pm and arranged to come back and pick\n\nher up at 10.00 pm as she also wanted to do some shopping.When he met John about 10 minutes later at\n\nthe MRT station at Ang Mo Kio, John told him he had to go and deliver a plastic bag to a\n\nfriend in Bishan but could not do so as his girlfriend was coming to join him at the said\n\nMRT station in 30 to 45 minutes. The 2ndAccused said to save time he\n\nvolunteered to deliver the orange plastic packet which he said was similar to the one in\n\nCourt, thinking it was some Chinese New Year food or decoration stuff as Chinese New Year\n\nwas a few days away. John then told him where to go and would call the person and ask him\n\nto come down and take the goods from him. John had not told him what the contents of the\n\norange plastic bag were. Nor had he asked him. He also did not look inside the bag then or\n\nlater to ascertain what it contained. He said he trusted John.The 2ndAccused confirmed that\n\nhe then delivered the said plastic bag and contents to the 1stAccused at the\n\ncarpark of Blk 164 Bishan Street 13 who in turn handed him an ‘ang pow’ packet -\n\nExhibit P116 - after being told it was for Chinese New Year. He took the packet\n\nreluctantly only because he thought it would contain S$10/- - S$15/-. After leaving Blk\n\n164, he opened the packet and found it contained S$168/- and he was shocked but happy as\n\nit was a lot of money and he stopped at the nearby Blk 167 and made a telephone call to\n\nhis girlfriend in Johore Bahru to tell her of the ‘ang pow’ and to take her out\n\nthe next day. He was arrested when making the telephone call.Concerning the statements to S/S/Sgt Ang,\n\nthe 2ndAccused went on to say that he had lied concerning each of the\n\nstatements to S/S/Sgt Ang that he was at the scene to take an ‘ang pow’ from a\n\nmale Chinese; that the male Chinese had called him through his pager 92297274; that he had\n\ncalled him at 9.00pm and that he had not handed over anything to that Chinese person. He\n\nso lied because he was frightened. He did not want to get involved with drugs. For the\n\nsame reason he had not told S/S/Sgt Ang at the scene or the Investigating Officer upon his\n\narrest about John sending him to deliver the goods. He could not think at that time. He\n\nhad not been told by John to expect money for his services nor did he expect to be paid\n\nany money. He only came to realise he had delivered drugs after he was arrested and\n\nquestioned. The 2ndAccused said it did not cross his mind to tell John that\n\nsince he had to wait for his girlfriend and also send the goods to Blk 164 in Bishan, all\n\nthese would take time and that he could not afford to wait for him and would be going back\n\nto his mother whom he had to pick up at 10.00pm and that the John should make his own way\n\nback to J.B. Instead, he explained his mother would not mind waiting if he was a bit late.\n\nFinally the 2ndAccused denied he knew what he had delivered to the 1stAccused were drugs.Evaluation and Findings1stAccused15.    No closing\n\nsubmission was made by Counsel for the 1stAccused.The 1stAccused had admitted in\n\nhis defence that he took delivery of the orange coloured plastic bag and its contents from\n\nthe 2ndAccused and that it was seized from him by CNB officers when he was\n\ncarrying it when he arrived by lift B at the 8thfloor of Blk 164 Bishan Street\n\n13. He did not challenge the fact that the bag was found to contain 62.26 grams nett\n\nweight of morphine. The 1stAccused therefore had failed to rebut his\n\npossession of the morphine in question and theprima faciecase proved against him\n\nthat he was in possession of the morphine for the purpose of trafficking and was therefore\n\ntrafficking in it by the further presumption under s 5(2) of the MDA. In fact the 1stAccused in his evidence clearly admitted that he was engaged in the sale of heroin i.e.\n\ntrafficking in drugs and that the drug related paraphernalia used for re-packaging of\n\ndrugs found in his flat belonged to him.I would like however, to deal with what\n\nmay appear at first sight, to be one small distracting aspect of the case. The 1stAccused had said he had ordered heroin. However, morphine was delivered to him as the\n\nfacts showed. The implication was that he was not therefore in knowing possession of\n\nheroin as what was delivered to him was morphine i.e. something else. I took judicial\n\nnotice of the fact that the basic and obvious difference between diamorphine (heroin) and\n\nmorphine is that whilst both are opium derivatives, diamorphine is a further distillation\n\nof morphine. In my opinion, the mistaken notion of the 1stAccused that he was\n\nin possession of diamorphine when it was morphine did not matter in the least since both\n\nare controlled drugs, any one of which the 1stAccused could not possess\n\nwithout authorisation. InTan Ah Tee & Anor v P P[1978 – 1979] SLR 211; [1980] 1MLJ 49, the Court of Criminal Appeal endorsed the ratio of Lord Pearce inR\n\nv Warner[1969] 256 as follows:\"If one goes to the extreme length of\n\n  requiring the prosecution to prove that ‘possession’ implies a full knowledge of\n\n  the name and nature of the drug concerned, the efficacy of the Act is seriously impaired,\n\n  since many drug pedlars may in truth be unaware of this. I think that the term\n\n  ‘possession’ is satisfied by a knowledge only of the existence of the thing\n\n  itself and not its qualities, and that ignorance or mistake as to its qualities is not an\n\n  excuse.\"It was plain therefore that on the\n\npresumed and proved facts and in the light of the 1stAccused’s own\n\nincriminating admissions in Court, his intention was to repackage the three large packets\n\nof morphine received from the 2ndAccused into small sachets for retailing them\n\namongst drug pedlars and drug addicts and so traffic in them. I therefore found him guilty\n\nas charged in respect of the offence of trafficking and convicted him.I sentenced him according to law.2ndAccused16.    Essentially, the 2ndAccused’s defence was that he volunteered to do an errand for a friend John who then\n\nhanded to him the orange plastic bag with its contents to deliver to the 1stAccused in the carpark of Blk 164 Bishan Street 13. Believing the bag contained some food\n\nor decorations for the Chinese New Year some days away he had gone on and made the\n\ndelivery to the 1stAccused by giving the said plastic bag to him. He had not\n\nat any time known or suspected that the bag contained drugs as he trusted John.Having considered on the facts and\n\ncircumstances of the whole affair which formed the basis of the charge against the 2ndAccused, I rejected the 2ndAccused’s defence relating to the absence of\n\nknowledge as to the true contents of the said plastic bag he gave to the 1stAccused.17.    The 2ndAccused after leaving his mother at Woodlands at 9.30pm had promised to return at 10.00pm\n\nto pick her up. It was his evidence that John had asked him at about 6.00pm in a telephone\n\ncall when he was still in Johore Bahru to pick him up at the Ang Mo Kio MRT station and to\n\ntake him back to Johore Bahru to which he had agreed. Had he done just that he would have\n\nreturned in time to pick up his mother from Woodlands at 10.00pm. The 2ndAccused failed to give a satisfactory explanation as to why he did not simply tell John in\n\nview of John’s new engagements that he would have to make his own way back to Johore\n\nBahru as waiting for his girlfriend for about 45 minutes and going to deliver the orange\n\nplastic bag to the 2ndAccused in Bishan about ten to fifteen minutes away and\n\nin addition doing the return journey would take a lot of time - probably an hour extra and\n\nhe would be very late in returning to pick up his mother. Instead the 2ndAccused had reacted strangely by volunteering to go and deliver the plastic bag to the 1stAccused.17.1    His reason that it\n\nwould save time while John waited for his girlfriend did not impress me. If Blk 164 Bishan\n\nStreet 13 was about ten to fifteen minutes away, the return journey could be done in half\n\nan hour and he should have asked John to join him in the car for the delivery to the 1stAccused of the plastic bag especially as the 2ndAccused on his own admission\n\nhad never been to Bishan and there were a very large number of blocks of flats in Bishan.\n\nThey could both return in time to the MRT Station to meet John’s girlfriend i.e. be\n\nwithin the half hour to forty minutes that she was going to take to come. John would also\n\nhave been free to communicate with his girlfriend over his mobile phone and to explain to\n\nher to wait for him at the station if he was delayed in returning. The 2ndAccused however did not raise all these matters with John. John’s sudden story to the\n\n2ndAccused after his arrival about waiting for his girlfriend should have\n\nraised a suspicion in the 2ndAccused’s mind so much so that if he had not\n\nenquired or examined the plastic bag for its contents straightaway, he should have done so\n\non the way to Bishan along the road by stopping and checking the bag’s contents as he\n\nadmittedly knew that trafficking in drugs carried a death penalty in Singapore. He had all\n\nthe opportunity to do so. The contents of the plastic bag were readily accessible to view\n\nas the plastic bag was not sealed.17.2    The 2ndAccused’s further explanation that he trusted John was not credible and worthy of\n\nbelief. He did not know John’s full name nor address in Johore Bahru nor where he\n\nworked and had only been his acquaintance for 2 or 3 months meeting him on occasions to\n\nplay pool with him. It was not possible that he reposed trust in a man about whom very\n\nlittle was known by him. It should have appeared wrong to the 2ndAccused who\n\nwas an adult and an educated person that he should deliver goods to a total stranger whose\n\nname he did not know and who would come and meet him in a carpark and whom he could not\n\nlater trace if he was in trouble.17.3    Counsel for the 2ndAccused stressed in submission that the 2ndAccused’s lack of knowledge is\n\nshown by hisvolunteeringto deliver the plastic bag to save time and there being\n\nno evidence that John had requested him to deliver the plastic bag which request would\n\nhave aroused his suspicion. Therefore the Court should infer that he was acting\n\ninnocently. His innocence it was submitted, was further underlined by the 1stAccused’s evidence that ‘Ah Seng’ (who was known to the 2ndAccused as John) had told him not to open the plastic bag upon delivery at the carpark\n\nbecause the 2ndAccused did not know of the bag’s contents. Further the 1stAccused had also stated that the 2ndAccused initially had refused to accept\n\nthe ang pow from him but only accepted it when told it was for Chinese New Year indicating\n\nthereby that he was not doing the errand for reward. The evidence of the 1stAccused, Counsel added, corroborated the 2ndAccused’s own version that he\n\nwas unaware of or lacked knowledge of the true contents of the plastic bag.17.4    The Prosecution\n\ncountered by submitting that the 1stAccused had no other purpose of giving\n\nevidence from the witness box but to contrive evidence and give support to the 2ndAccused’s lack of knowledge of the drugs that he gave to the 1stAccused.\n\nThe 1stAccused’s motive to help the 2ndAccused to establish\n\nhis defence was clearly seen from the fact that when in the witness stand he did not\n\ndefend himself but readily admitted to taking delivery of the drugs from the 2ndAccused and to being in possession of drug paraphernalia in his flat and to being engaged\n\nin trafficking in drugs and had gone on further to instruct his Counsel not to make any\n\nsubmission at the close of the Defence case.17.5    I accepted the\n\nProsecution’s submission as to the 1stAccused’s motive as plausible.\n\nI found it unconvincing that the 1stAccused who was admittedly engaged in\n\ntrafficking of drugs should be told or reminded by his supplier Ah Seng not to open the\n\nplastic bag to ascertain the drugs as no such offending recepient is ever likely to do so\n\nespecially in a public place because of the surreptitious nature of the operation, the\n\nidea behind it being to quickly take delivery and leave for fear of there being a\n\nsurveillance by CNB officers. Since payment was specifically arranged for a later date\n\nseparately by Ah Seng (John), as admitted by the 1stAccused, the need to check\n\nthe contents of the bag did not arise as the 1stAccused would be checking the\n\nsame when he went back to his room. He would therefore only have to pay subsequently on\n\nthe basis of what was delivered to him. It was the Accused’s evidence that he made\n\nthree telephone calls to John from the telephone at the void deck of Blk 164, the first\n\ninforming him he was in the carpark and to inform his friend (1stAccused) to\n\ncome down when the phone was suddenly disconnected, the second to enquire if John‘s\n\ngirlfriend had arrived but he could not make a connection and the third call to another\n\ntelephone no. 9671423 belonging to John which went unanswered resulting in a voice mail\n\nmessage being generated. Again, both the 1stAccused’s and 2ndAccused’s credibility was seriously in doubt on the issue when the 1stAccused said he did not receive any telephone call from the 2ndAccused that\n\nevening or the 2ndAccused saying he did not make any call to the 1stAccused. The Prosecution’s evidence established that a phone call was made from the\n\npublic telephone no. 3543208 at the void deck of Blk 164 and that call was made to a\n\nmobile phone held by and recovered from the 1stAccused i.e. no. 9671423 at\n\n10.12pm. I was satisfied that this was the call lasting about 10 seconds in which the 2ndAccused spoke to the 1stAccused to come down. This brief conversation was\n\noverheard by Sgt Eddie Wee who was nearby to the 2ndAccused when he made the\n\ncall. I could not comprehend the 2ndAccused’s evidence that he thought he\n\nwas making the third telephone call to John who had given him the telephone no. 9671423 as\n\nhis number in Johore Bahru, previously, which number he had stored and retrieved from his\n\npager just prior to calling him the third time. If it was John’s telephone number,\n\nthere was no explanation why the 1stAccused was holding a telephone with that\n\nnumber when he was arrested. There was no reason why when the 2ndAccused rang\n\nno. 9671423, the 1stAccused should not have answered the call allowing the\n\ncall to go into a voicemail mode as it was the very phone he had with him when arrested\n\nand he was expecting a delivery. The irresistible inference I drew was that the 1stAccused answered the call made by the 2ndAccused and was told by the 2ndAccused ‘Come down. I am here’. I therefore also disbelieved the 2ndAccused’s version that earlier he had made two other calls to John. I was satisfied\n\non the evidence that only one telephone call was made by the 2ndAccused and\n\nthat was made to the 1stAccused telling him to come down as he was already\n\nthere. The 2ndAccused therefore could not have uttered similar words to John\n\nas a signal to convey his presence at the scene (during the first telephone conversation)\n\nas was submitted by his Counsel leaving to John to call the 1stAccused.. The 1stAccused’s evidence in favour of the 2ndAccused that he received no\n\ntelephone call from him, was therefore unworthy of belief.17.5    I could not also\n\nfathom why if the 2ndAccused’s version of events was truthful, he did not\n\nimmediately upon his arrest volunteer to inform S/S/Sgt Ang by telling him about John\n\nhaving given him the drugs at the Ang Mo Kio MRT station of which he had no knowledge, for\n\ndelivery. Instead the 2ndAccused admittedly lied to the CNB officers when he\n\nmade his voluntary out of Court statement to S/S/Sgt Ang in response to questions. Of\n\ncourse, it cannot be said that because a witness has been proved a liar on one or two\n\npoints, then the whole of his evidence must in law he rejected. I was mindful that to\n\nsimply come to this conclusion would be wrong. When a lie or lies comes to light, it is\n\nimperative that the witness’s evidence must be scrutinised with great care and indeed\n\nsuspicion.17.6    Having scrutinised\n\nwith care the 2ndAccused’s evidence, I found that he was not a truthful\n\nwitness. The 2ndAccused far from being frightened into telling lies as was\n\nsubmitted by his Counsel, should and would have felt incensed and outraged if he had been\n\ninnocently duped by a trusting friend to deliver drugs to the 1stAccused and\n\nas such he would have naturally and readily told the CNB officer at the scene about what\n\nJohn had done to him which would have led to John’s arrest whilst John waited at the\n\nAng Mo Kio MRT station for the 2ndAccused to arrive and the 2ndAccused would then have vindicated himself. I may add that the 2ndAccused\n\nadmittedly also did not tell the Investigating Officer about John and his role at any\n\ntime. If the 2ndAccused was frightened at the time of his arrest, he would\n\nhave come to terms with his fright in the next few months and told the Investigating\n\nOfficer about what John did to him. But the 2ndAccused did not do so.17.7    I was satisfied in\n\nthe light of all the circumstances that the 2ndAccused’s account of what\n\nhappened was not a credible account. His admitted lies added a damaging complexion to his\n\ncase resulting in my finding in the end that he was an untruthful witness. The lies were\n\nnamely that he was at the scene to take an ‘ang pow’ when he was not; that he\n\nwas called by a Chinese person (1stAccused) through his handphone 92297274 at\n\n9.00pm when he was not and that he had not handed anything to the 1stAccused\n\nwhen he in fact had. The lies and admissions in my opinion were deliberate, related to a\n\nmaterial issue in the case and were motivated by a realisation of guilt and fear of the\n\ntruth. The Accused’s lies therefore corroborated the Prosecution’s version of\n\nevents that the 2ndAccused had knowledge that he had carried and given a\n\ncontrolled drug to the 1stAccused:Lucas[1981] QB 720 at 724.17.8    In any case, the 2ndAccused by not questioning John about the contents of the orange plastic bag or examining\n\nit himself either in the presence of John or later on his way to deliver it to the 1stAccused when there was nothing constraining him to look into the plastic bag showed that\n\nhe was wilfully shutting his eyes to the truth and was prepared to do anything including\n\nact illegally irregardless of the consequences. I therefore further equated his wilful\n\nblindness to knowledge, namely, that he knew that he took, conveyed andgavethe\n\nplastic bag in question containing the drug inside it knowing it contained a drug.17.9    As the 2ndAccused had therefore not proven an absence of knowledge of that which he possessed beyond\n\na reasonable doubt, the presumptions in the MDA against him became final and conclusive.\n\nHe therefore knowingly had possession of the 62.76 grams of morphine and trafficked in it\n\nwhen hegaveit to the 1stAccused thereby failing to prove the contrary\n\non a balance of probabilities - namely that he did not traffic in the said drug.20.    I therefore found\n\nthe 2ndAccused guilty as charged and convicted him and sentenced him according\n\nto law.Amarjeet SinghJudicial CommissionerCopyright © Government of Singapore."
    }
}